{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":27,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Two struggles","postDate":"1351521605","msgId":69511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDRkZFRTdELTQ2RUYtNDRDMC1CNkM2LTk0QjMwMTY2ODBCRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2bDFzNStwYzNsQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2bDFzNStwYzNsQGVHcm91cHMuY29tPg=="},"prevInTopic":69510,"nextInTopic":0,"prevInTime":69510,"nextInTime":69512,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"-=-And just because a person isn t reading, doesn t mean that they don t have a profound understanding, and even love, of words and language...I have a 7 year","messageBody":"<div id=\"ygrps-yiv-1348922255\">-=-And just because a person isn&#39;t reading, doesn&#39;t mean that they don&#39;t have a profound understanding, and even love, of words and language...I have a 7 year old non-reader who actually knows what the word ambuscade means. That didn&#39;t come from school, but as Sandra says, from conversations with others, being read to, watching movies and TV. -=-<br/>\n<br/>\nHolly had a very sophisticated vocabulary when she started reading, at 11.  The first book she read was by Judy Blume.  She started with difficulty, and by the end was reading fluently enough that the next thing she wanted to read was &quot;The Boy,&quot; by Stephen King.  She had no problem with it.   <br/>\n<br/>\nReading baby words ends up with stories not worth reading.  If &quot;One fish, two fish&quot; is considered &quot;reading,&quot; no wonder even kids who pick it up early might not think there&#39;s much value in it.<br/>\n<br/>\nAnd another thing is that I read to escape the boredom of school and the crowded and often irritating realities of my homelife.  My kids had a happy homelife with very little boredom.  There were things happening that didn&#39;t require escape.<br/>\nI wrote about that here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookandsax\">http://sandradodd.com/bookandsax</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":411981224,"authorName":"apprentice_mom","from":"&quot;apprentice_mom&quot; &lt;justine@...&gt;","profile":"apprentice_mom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Two struggles","postDate":"1351486149","msgId":69510,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2bDFzNStwYzNsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJGNDA4MDE0LTQ4MTEtNDlBNS1CMTI4LTg5NTgyNTk2QUYzRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69509,"nextInTopic":69511,"prevInTime":69509,"nextInTime":69511,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"... And just because a person isn t reading, doesn t mean that they don t have a profound understanding, and even love, of words and language...I have a 7 year","messageBody":"<div id=\"ygrps-yiv-697718227\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I taught Jr. High English (7th to 9th grade, kids who are 12-15 if they never failed a grade and maybe older if they did.<br/>\n&gt; <br/>\n&gt; Many of them couldn&#39;t read well.  Half of them didn&#39;t want to read aloud; it was frightening for them, or they were tired of criticism.  Some had been told they were non-readers.  There&#39;s a label, for a kid who&#39;s only 12 or 13.  &quot;Cannot read&quot; (on paper, by officials).   And why try, if professionals say it&#39;s not going to do any good?<br/>\n&gt; <br/>\n&gt; An unschooler at that age who isn&#39;t reading well could have gained a wealth of information from videos, the internet, conversations with others, being read to, going real places with real things happening.   <br/>\n<br/>\n </span></blockquote>And just because a person isn&#39;t reading, doesn&#39;t mean that they don&#39;t have a profound understanding, and even love, of words and language...I have a 7 year old non-reader who actually knows what the word ambuscade means.  That didn&#39;t come from school, but as Sandra says, from conversations with others, being read to, watching movies and TV.  <br/>\n<br/>\nThere was an interesting article in the Guardian recently from an interview with Frank Cottrell Boyce:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.guardian.co.uk/books/2012/oct/26/frank-cottrell-boyce-children-reading?newsfeed=true\">http://www.guardian.co.uk/books/2012/oct/26/frank-cottrell-boyce-children-reading?newsfeed=true</a><br/>\n<br/>\nHe says, among other things, that people have conflated literacy with reading.  The way reading is taught in schools has essentially resulted in a whole generation of people who don&#39;t read anything they don&#39;t have to even though they can.  You could apply that across the board to a whole array of school subjects.<br/>\n<br/>\nJustine</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351484507","msgId":69509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTE0ODQ1MDcuNTYxMDguWWFob29NYWlsTmVvQHdlYjEyMjUwMy5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69506,"nextInTopic":69510,"prevInTime":69508,"nextInTime":69510,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"***In reading about anxiety, I am repeatedly encountering the advice that a child or adult with fear should not allow themselves to avoid a situation that","messageBody":"<div id=\"ygrps-yiv-205110333\">***In reading about anxiety, I am repeatedly encountering the advice that a child or adult with fear should not allow themselves to avoid a situation that triggers fear, because the fears then continue unchecked and the world of possibilities gets smaller.***<br/>\n<br/>\n<br/>\nI totally disagree with this.  One of my kids fears things, all kinds of things.  A friend reminded me, as I was trying to push/encourage my kid to do something because *I* wanted it for her, that the pushing could backfire with the exact opposite results that I was hoping for.  Unless a person decides for themselves for their own reasons to do the things that are anxiety producing, they won&#39;t ever get past that.  It&#39;s a very personal sort of thing.<br/>\n<br/>\nIf someone is afraid of the dark, putting them in a dark room with no way out, wouldn&#39;t make that person feel safer and happier.  Without feeling safe and happy, they won&#39;t learn how to not be afraid of the dark.  For learning to take place, even learning how to feel less anxious, maybe even especially so, it can&#39;t be forced because force isn&#39;t safe and happy.  The term &quot;confront your fears&quot; could mean so many different things, but I choose to see it as acknowledgement of said fears and then proactively discovering ways past or through them. <br/>\n<br/>\n***Of course for my son, reading is difficult and stressful and he chooses not to practice it or engage in a structured phonetic program even though he loves books and wants to read and has a *lot* of emotion and frustration about not being able to.***<br/>\n<br/>\n<br/>\n***I don&#39;t want to &quot;fix&quot; these issues, but at the same time, they make him unhappy, life is harder for him and less carefree than for my other children because of his frustrations about reading and his many anxieties and I find that I do want to intervene and, yes, &quot;fix&quot; them. ***<br/>\n<br/>\n<br/>\nThis absolutely does not need to be your reality!!!!!<br/>\n<br/>\nWhen my own dyslexic child was 9, she would never have known what the heck phonics even was.  I wonder why your son is engaging in structured phonics programs.  Well, to be clear, I don&#39;t think he&#39;s engaging at all since it causes him frustration.  Again, frustration is not a good way to learn at all.  <br/>\n<br/>\nThe first time that I&#39;ve ever discussed dyslexia with my daughter was very recently.  She&#39;s 18 now.  She had decided to do a GED course at the local community college and was discouraged that she was unable to keep up with all the hand writing.  So we talked about writing and dyslexia a bit.  Early on, she learned how to use a computer and keyboard and that solved much of the dyslexic issues, but even at 18, it&#39;s hard to remember all those different directions of alphabetic shapes.  Next year all the GED courses will be computer based.  She types super fast.<br/>\n<br/>\nShe learned how to read when she was 11.  She was a word collector.  When she learned a word, she knew it from that point on.  Once she knew enough words she could put them together and read.  She learned from playing online role playing games and other video games.  Book for book, by the time she was able to read on her own, we&#39;d listened to so many books on tape and cd, that she knew more stories and books than most of her same age peers in school.  All those stories and written word, read to her by me or Angela Landsbury (yes she narrated a book, I wish she&#39;d done more!), seeped into her and added to all the things she already knew.<br/>\n<br/>\nThe first book she read from cover to cover was manga, read from right to left.  Her grammar and spelling are near to perfect.  She&#39;s never had any reading lesson, or any grammar or spelling lessons.  She had to take a pre test for the GED, it&#39;s the same test they make you take to do college placement when going to college.  She was somewhere in the nearly perfect range on the reading and comprehension.<br/>\n<br/>\nI shared her story with Peter Gray when he was asking for these things and he&#39;s written about it here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read\">http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351452222","msgId":69506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBQUU0MjY3NUY4NjQxM0RBOUIwQTMyNTY4MERGNTYxQERlYm9yYWhQQz4=","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69505,"nextInTopic":69509,"prevInTime":69505,"nextInTime":69507,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"***I am repeatedly encountering the advice that a child or adult with fear should not allow themselves to avoid a situation that triggers fear, because the","messageBody":"<div id=\"ygrps-yiv-212395875\">***I am repeatedly encountering the advice that a child or adult with fear should not allow themselves to avoid a situation that triggers fear, because the fears then continue unchecked and the world of possibilities gets smaller. ***<br/>\n<br/>\nWhile I wouldn’t call it anxiety there were plenty of places and situations my son avoided because they would have been uncomfortable for him. When Dylan didn’t want to go the movie theaters anymore because of the people and the noise we found lots of ways to get and watch movies at home.  <br/>\n<br/>\nSome people told me that because he couldn’t stand the feeling of seams in his clothing he had sensory issues that could be helped with therapy.  He got older and better able to tolerate tags and seams. <br/>\nSome people told me that if he was allowed to avoid doing things that made him uncomfortable he’d be limited later in life. He got older and better able to judge ahead of time whether the discomfort of a crowd was worth the benefit of the movie or concert or whatever. That’s the same kid who took a trip to Canada without me when he was fourteen and tripped around our state without me when he was sixteen and took off last spring on vacation to Europe, alone.<br/>\n<br/>\nIt sounds like your son enjoys skating at the rink now, but he could have skated at home, right?  Skating is something a person can try at any point in his life. Not going to the rink at nine does not necessarily mean he’ll be a shut-in when he’s twenty.  And it seems like this is your fear, that what he’s doing now is what he’ll always do.  You’re looking way into the future and finding problems he doesn’t have and may never have instead of looking at how you can help him do what he wants and avoid what he doesn’t want today.<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351450314","msgId":69505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERFQkExOTJCQzAxQjQ4RTc5RkNDRTk3M0UxNEE5MTEzQERlYm9yYWhQQz4=","inReplyToHeader":"PDg0RDFBQjFGNDAwRDQzMzJBOEVEMkIwRDgzNjExMzY3QERlYm9yYWhQQz4=","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPiA8ODREMUFCMUY0MDBENDMzMkE4RUQyQjBEODM2MTEzNjdARGVib3JhaFBDPg=="},"prevInTopic":69503,"nextInTopic":69506,"prevInTime":69504,"nextInTime":69506,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"***...he isn’t queuing ...*** He’s not getting in line! I was in a queue with tech support and it must have been pressing on my brain.  Deb Lewis ","messageBody":"<div id=\"ygrps-yiv-918854558\">***...he isn’t queuing ...***<br/>\n<br/>\nHe’s not getting in line!  <br/>\n<br/>\nI was in a queue with tech support and it must have been pressing on my brain. &lt;g&gt;<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351442820","msgId":69503,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0RDFBQjFGNDAwRDQzMzJBOEVEMkIwRDgzNjExMzY3QERlYm9yYWhQQz4=","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69500,"nextInTopic":69505,"prevInTime":69502,"nextInTime":69504,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"Nine is very young for you to be so worked up and anxious about him not reading.  Get a subscription to audible.com so he can listen to any and every book he","messageBody":"<div id=\"ygrps-yiv-566310618\">Nine is very young for you to be so worked up and anxious about him not reading.  Get a subscription to audible.com so he can listen to any and every book he wants.  Stop fretting about this.  People learn differently and tagging him with a label won’t help him or you.  Stop looking for something to be wrong.<br/>\n<br/>\n***By anxiety, I mean that he has panic attacks regularly...***<br/>\n<br/>\nIf you are this anxious about a nine year old non reader it makes me wonder if he isn’t queuing off your own heightened state.  Maybe it’s genetic or maybe he’s seen you freak out over things so much he thinks that’s normal.  <br/>\n<br/>\nIf you can calm yourself and unpack your fear things will change significantly for your son. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Two struggles","postDate":"1351435986","msgId":69500,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2amdzaSs2N3VwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2aTZubCsydTFrQGVHcm91cHMuY29tPg=="},"prevInTopic":69498,"nextInTopic":69503,"prevInTime":69499,"nextInTime":69501,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"... *********** It can be helpful for parents to read about all sorts of kids, all sorts of learning styles and processing styles - even assorted issues and","messageBody":"<div id=\"ygrps-yiv-798189328\">&quot;malvarez5412&quot; &lt;hayesalvarez@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; For instance, when an author noted that some dyslexics find long or complex spoken sentences difficult to follow, it was a moment of insight for me.<br/>\n </span></blockquote>***********<br/>\n<br/>\nIt can be helpful for parents to read about all sorts of kids, all sorts of learning styles and processing styles - even assorted issues and diagnoses - as a way of better understanding their unique kids. And all kids are unique - I&#39;m not using that as some special new label ;)<br/>\n<br/>\nFor instance, my dad and I both have trouble following long, complex spoken sentences... but neither one of us has any kind of dyslexia. We&#39;re more visual and kinesthetic than verbal. In fact, we do better following a long lecture by doing something with our hands - he doodles, I knit. My daughter is very visual and kinesthetic, too, and she has some dyslexia in the classical sense, but she doesn&#39;t have any trouble following long, complex sentences - she took to audio books much more easily than I did. And my Ex, who still has very definite dyslexia, got through grad school never taking notes - in fact, many adult dyslexics have impressive listening skills and memory for spoken language. I&#39;ve never met an adult with dyslexia who didn&#39;t, actually.<br/>\n<br/>\nThat&#39;s one of the problems with diagnoses - sometimes the &quot;related&quot; characteristics are so broad as to be useless. Have you heard the saying &quot;if you&#39;ve met one kid with autism you know One kid with autism&quot;? That&#39;s true of so many things, including dyslexia. Some people with dyslexia have trouble with language, some don&#39;t. Some are very visual - others very verbal. Some are very creative, others more normally creative. Some people grow out of dyslexia, some don&#39;t. <br/>\n<br/>\nAnd don&#39;t ever forget that all these lists and lists of characteristics are all weighted heavily towards the sorts of issues which are problematic in schools and other situations where conformity is important. People with dyslexia - or people on the &quot;autism spectrum&quot; for that matter - who don&#39;t have problems fitting in aren&#39;t part of the data set. <br/>\n<br/>\nUse information which helps you be a better partner to your kids, but don&#39;t get locked into some kind of definition. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":383312070,"authorName":"Cara Barlow","from":"Cara Barlow &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Two struggles","postDate":"1351427429","msgId":69498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRWhNejUrRXNuRXRMQm5oVTViT3JXMUFUclc9VjUybWhBSDZkUzR2Nmdjd0tucE94UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDFGOEU1NTJELTJBQzktNEQ5MC05MEVCLTRCNDk2QjZGRUU0QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGs2aTZubCsydTFrQGVHcm91cHMuY29tPgk8MUY4RTU1MkQtMkFDOS00RDkwLTkwRUItNEI0OTZCNkZFRTRBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":69492,"nextInTopic":69500,"prevInTime":69497,"nextInTime":69499,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"My oldest daughter, Anna, who s now 16 was a late reader. She was in school until the beginning of third grade when she was 8 years old - at that point the","messageBody":"<div id=\"ygrps-yiv-1206299599\">My oldest daughter, Anna, who&#39;s now 16 was a late reader. She was in school<br/>\nuntil the beginning of third grade when she was 8 years old - at that point<br/>\nthe school administrators were suggesting I have her tested and coded for<br/>\nvarious learning disabilities. I don&#39;t think she read fluently until she<br/>\nwas probably 10 or 11 years old - I don&#39;t remember exactly when.<br/>\n<br/>\nShe&#39;s in the process of taking the GED right now - her choice. She wants to<br/>\nget a cosmetology license, and that&#39;s the easiest way to deal with the<br/>\npaperwork. We got the results back on Friday for the sections of the test<br/>\nshe did. She scored a 99% on the reading. Even I, who have a high opinion<br/>\nof her capabilities, was surprised. It was the first test, other than the<br/>\ndriving exam, that she&#39;s taken since she was 8 years old.<br/>\n<br/>\nYou can&#39;t predict future capabilities by what a child can do when they&#39;re 8<br/>\nor 9 years old, though you can pretty severely mess things up if *you* get<br/>\nstressed and negative and controlling.<br/>\n<br/>\nBest wishes, Cara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Two struggles","postDate":"1351396681","msgId":69492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGOEU1NTJELTJBQzktNEQ5MC05MEVCLTRCNDk2QjZGRUU0QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2aTZubCsydTFrQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2aTZubCsydTFrQGVHcm91cHMuY29tPg=="},"prevInTopic":69491,"nextInTopic":69498,"prevInTime":69491,"nextInTime":69493,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"This came in the midst of several paragraphs of DENSE, breathless text: -=- For instance, when an author noted that some dyslexics find long or complex spoken","messageBody":"<div id=\"ygrps-yiv-1575411016\">This came in the midst of several paragraphs of DENSE, breathless text:<br/>\n<br/>\n-=- For instance, when an author noted that some dyslexics find long or complex spoken sentences difficult to follow, it was a moment of insight for me. My son had always had a tendency to say &quot;what?&quot; &quot;what?&quot; over and over again, no matter how many times you repeated something, and I had thought that perhaps he disagreed with what was being said or was being silly or just wasn&#39;t up to talking/listening. After reading that, I asked him directly and he said he never understands when people talk fast or too much and it helps so much if sentences are short with pauses in between.-=-<br/>\n<br/>\nAll that is just three sentences.  <br/>\n<br/>\nTOO MANY WORDS.  Too long.  Too complicated.  Too repetitive.  <br/>\n<br/>\nIf you hadn&#39;t noticed that you were not speaking to your own child in such a way that you knew whether he was understanding without him needing to say &quot;what?what?over and over again,&quot; then that was your failure, and not your son&#39;s condition.<br/>\n<br/>\nIf you are repeating the same thing over and over without comprehending whether he understands you, that&#39;s a failure in your communication.<br/>\n<br/>\nPlease print out this post of yours:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/69490\">http://groups.yahoo.com/group/AlwaysLearning/message/69490</a><br/>\nPrint it and put it somewhere.  Mark on your calendar to read it again in a month.  Put it back.  Mark on your calendar to read it again in a year.<br/>\nI&#39;m as serious as can be.<br/>\n<br/>\nYou came here with a problem.  TWO.  &quot;Struggles,&quot; you said.<br/>\nPeople who know things you don&#39;t know are trying to offer you their insights.  They&#39;re doing it freely and out of kindness, hoping to help you have a life with more peace, and easier learning, and nicer relationships.  You have spent a GREAT deal of time and effort trying to assure us that you don&#39;t really need much from us, that you know way more than we do about dyslexia, and that really all our guesses are missing the mark.<br/>\n<br/>\nPrint it.<br/>\nDon&#39;t write any more.  Stop writing about it.  You&#39;ve written enough.<br/>\n<br/>\nRead a little.<br/>\nTry a little.<br/>\nWait a while.<br/>\nWatch.<br/>\n<br/>\nNone of that says keep writing until you get it.<br/>\n<br/>\n-=-Again I appreciate the advice to stop reading about these things, and stop being anxious myself. Even though its obvious, its oddly freeing to hear stated directly to me. Even though I know this, I need to hear this, and continue to let it seep into me.-=-<br/>\n<br/>\nSO many words.  Stop reading.  Let it seep in.<br/>\nDon&#39;t consider the feeling odd.  <br/>\nIt doesn&#39;t help you or anyone else here for you to assure us you already knew these things.<br/>\n<br/>\nThe paragraph below is from <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a> , which is a page with lots of people&#39;s best ideas about deschooling, and links to others.  <br/>\n<br/>\nOnce upon a time a confident and experienced scholar went to the best Zen teacher he knew, to apply to be his student. The master offered tea, and he held out his cup. While the student recited his knowledge and cataloged his accomplishments to date, the master poured slowly. The bragging continued, and the pouring continued, until the student was getting a lapful of tea, and said, “My cup is full!” The master smiled and said, “Yes, it is. And until you empty yourself of what you think you know, you won’t be able to learn.”<br/>\n<br/>\nDon&#39;t respond.<br/>\n<br/>\nRead a little.     <br/>\nTry a little.<br/>\nWait a while.<br/>\nWatch.<br/>\n<br/>\nSpend more time with your son than you do on this list.  Try some of these ideas.  Let time pass.  Watch your children quietly.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Two struggles","postDate":"1351395639","msgId":69491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwQzY5M0E3LTk5NzMtNDBBQy1BOTNGLTY0RjU1RThGRDlDQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2aTZubCsydTFrQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2aTZubCsydTFrQGVHcm91cHMuY29tPg=="},"prevInTopic":69490,"nextInTopic":69492,"prevInTime":69490,"nextInTime":69492,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"-=-While I ve read about unschooling for a few years and have read all of Joyce s website before a few times, I hadn t subscribed to her newsletters or emails,","messageBody":"<div id=\"ygrps-yiv-268459453\">-=-While I&#39;ve read about unschooling for a few years and have read all of Joyce&#39;s website before a few times, I hadn&#39;t subscribed to her newsletters or emails, so I did that as well. -=-<br/>\n<br/>\nPam Laricchia&#39;s newsletters and e-mails, I bet you meant.  She only created that series a few weeks ago, so even I (who signed up before it was announced) haven&#39;t seen the whole set yet.   You&#39;re still early for that one!  <br/>\n<br/>\nAnyone who signs up for that will receive them all, but not all at once.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.livingjoyfully.ca\">http://www.livingjoyfully.ca</a><br/>\n<br/>\nJoyce&#39;s site:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nMy site is always being added to.  New pages an additions to pages are (sometimes, not always) announced here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://aboutunschooling.blogspot.com\">http://aboutunschooling.blogspot.com</a><br/>\nbut the site itself is <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com\">http://sandradodd.com</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":528306112,"authorName":"malvarez5412","from":"&quot;malvarez5412&quot; &lt;hayesalvarez@...&gt;","profile":"malvarez5412","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Two struggles","postDate":"1351392821","msgId":69490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2aTZubCsydTFrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZFMDc2RTVGLUFDMjctNEUwNi05NDhBLUE0NjIwM0Y2NURERkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69487,"nextInTopic":69491,"prevInTime":69489,"nextInTime":69491,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"Thank you everyone for your responses.  There were a lot of helpful links and insightful ideas for me.  While I ve read about unschooling for a few years and","messageBody":"<div id=\"ygrps-yiv-402456780\">Thank you everyone for your responses.  There were a lot of helpful links and insightful ideas for me.  While I&#39;ve read about unschooling for a few years and have read all of Joyce&#39;s website before a few times, I hadn&#39;t subscribed to her newsletters or emails, so I did that as well. <br/>\n<br/>\nWhile I was challenged, in a good and helpful way, by various aspects of the responses, some felt odd to me.  Especially those that seemed to imply that dyslexia is a bad thing. My son wasn&#39;t diagnosed or labeled &quot;dyslexic&quot; in school, and he&#39;s never been traditionally schooled at all. He&#39;s never had a grade or test or been asked to read (though he saw other children his age reading around him and noticed that he wasn&#39;t.)  It&#39;s also not a word I, or any one else, uses with him, though I think it may be useful to him in the future when he&#39;s old enough, or it may not.  In any case, I see dyslexia primarily as a description of the way a significant minority of the population&#39;s brains are wired.  I see it as encompassing many traits, including an unusual facility for out of the box, innovative approaches to problem solving and an aptitude for three dimensional mapping and visualizing complex objects.  It&#39;s also correlated with an approach to reading in the front-lobe rather than language centers of the brain, and sometimes other difficulties with language processing. The dyslexic brain is optimized for certain kinds of thinking rather than others, just like everyone&#39;s is. I don&#39;t think of using the term as different than terms I&#39;d use to describe my older son, such as artistic or introverted. They&#39;re simply characteristics, though again, while I would describe my older son in those ways and perhaps reflect on or read about introversion in children if that&#39;s helpful to me as a parent, I don&#39;t use those terms with him. I think my sons can describe themselves any way they choose, I wouldn&#39;t box them in.  <br/>\n<br/>\nUsing the word dyslexic to talk about my middle son wasn&#39;t a &quot;label&quot; of deficiency for me, it was a term that led me to resources that were helpful in so many ways. For instance, when an author noted that some dyslexics find long or complex spoken sentences difficult to follow, it was a moment of insight for me. My son had always had a tendency to say &quot;what?&quot; &quot;what?&quot; over and over again, no matter how many times you repeated something, and I had thought that perhaps he disagreed with what was being said or was being silly or just wasn&#39;t up to talking/listening. After reading that, I asked him directly and he said he never understands when people talk fast or too much and it helps so much if sentences are short with pauses in between. I don&#39;t think he would have articulated that if I hadn&#39;t read about it, realized it as a possibility, and asked him.  I&#39;m also not sure that much of the current work on dyslexia is &quot;school&quot; oriented. The best books have pretty bold critiques of schooling and pessimistic thoughts about school ever being a good fit for dyslexic kids. (For example, Neurodiversity suggests that American culture prizes one type of brain in children because it is well suited to classroom situations and excels in skills that are easily assessable.  It directly challenges the educational establishment for pathologizing normal healthy brain diversity.) These books and websites also directed us to resources that we love--like the &quot;maker&quot; website, and the &quot;monster physics&quot; app, and other cool stuff that&#39;s up his alley. <br/>\n<br/>\nBut, despite coming from a really different feeling about whether the word dyslexic is good or bad and what its for, several responses made me reflect on what letting it go would feel like, and I like the feeling of moving on without it.  I think it would in fact free me up to stop reading about it or thinking of it as a construct.  His frustration about not reading remains hard for me, but so was my toddlers&#39; frustrations about not being able to talk in full sentences before they could and we waited that one out just fine!  <br/>\n<br/>\n(And just to clarify, he isn&#39;t &quot;pressured&quot; and I&#39;ve never given him the option of an intensive phonics-based intervention.  He&#39;s been happily playing skylanders on the wii, building forts, baking, watching Liberty&#39;s kids on endless loop and begging to visit american revolution sites all day.  I was sharing that I had been reading books that suggested such intervention and it was causing me to struggle internally with some confusion about whether I was doing him a disservice by not offering it.  I mentioned that he didn&#39;t want to do it only because I know he wouldn&#39;t want it. He doesn&#39;t like to try and read. I know this not because I suggest he read (or write, which he also hates), but because sometimes he tries on his own and gets very upset and frustrated. )  <br/>\n<br/>\nHearing from parents of anxious kids was really helpful to me by the way.  And for my son it isn&#39;t nutrition or pressure -- he&#39;s been fearful and overwhelmed by his emotions from his earliest years, its part of him.  And yes, not being in a school--even his old school that was remarkably free and that he loved and mourned leaving--is helping!  He told someone who asked the other day that the best part of not being in school is getting to be with me all day. (Just a really sweet moment for me! Its the best part for me too.)   Again I appreciate the advice to stop reading about these things, and stop being anxious myself.  Even though its obvious, its oddly freeing to hear stated directly to me.  Even though I know this, I need to hear this, and continue to let it seep into me.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351390217","msgId":69487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGNDA4MDE0LTQ4MTEtNDlBNS1CMTI4LTg5NTgyNTk2QUYzRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAxNTUwMWNkYjRhZCQyMDM3NGY1MCQ2MGE1ZWRmMCRAY29tY2FzdC5uZXQ+","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPiA8OUI2MkVFRTMtMDA2NC00QTc0LUFCNjMtQ0I1NzEwQTM1NjM1QFNhbmRyYWRvZGQuY29tPiA8MTM1MTM2MzI2My4zODcyMi5ZYWhvb01haWxOZW9Ad2ViMTg0NTA1Lm1haWwubmUxLnlhaG9vLmNvbT4gPDAxNTUwMWNkYjRhZCQyMDM3NGY1MCQ2MGE1ZWRmMCRAY29tY2FzdC5uZXQ+"},"prevInTopic":69484,"nextInTopic":69490,"prevInTime":69486,"nextInTime":69488,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"-=-Unschooling is a world away from kids in special classes. Unschooling doesn’t need kids to be labeled. Unschooling gives kids the opportunity to be who","messageBody":"<div id=\"ygrps-yiv-380678337\">-=-Unschooling is a world away from kids in special classes. Unschooling doesn�t need kids to be labeled. Unschooling gives kids the opportunity to be who they are, and to learn at their own pace in a positive and supportive environment that�s filled with toys and books and videos and games and all sorts of wonderful things, exploring and playing with which will lead them to read and wonder and question and learn and have fun without the baggage lots of schooled kids will have to carry with them as they grow.-=-<br/>\n<br/>\nYes.  <br/>\n<br/>\nI taught Jr. High English (7th to 9th grade, kids who are 12-15 if they never failed a grade and maybe older if they did.<br/>\n<br/>\nMany of them couldn&#39;t read well.  Half of them didn&#39;t want to read aloud; it was frightening for them, or they were tired of criticism.  Some had been told they were non-readers.  There&#39;s a label, for a kid who&#39;s only 12 or 13.  &quot;Cannot read&quot; (on paper, by officials).   And why try, if professionals say it&#39;s not going to do any good?<br/>\n<br/>\nAn unschooler at that age who isn&#39;t reading well could have gained a wealth of information from videos, the internet, conversations with others, being read to, going real places with real things happening.   <br/>\n<br/>\nSchool doesn&#39;t provide all that.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439465581,"authorName":"Robert and Colleen","from":"&quot;Robert and Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Two struggles","postDate":"1351388392","msgId":69484,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNTUwMWNkYjRhZCQyMDM3NGY1MCQ2MGE1ZWRmMCRAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDEzNTEzNjMyNjMuMzg3MjIuWWFob29NYWlsTmVvQHdlYjE4NDUwNS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPiA8OUI2MkVFRTMtMDA2NC00QTc0LUFCNjMtQ0I1NzEwQTM1NjM1QFNhbmRyYWRvZGQuY29tPiA8MTM1MTM2MzI2My4zODcyMi5ZYWhvb01haWxOZW9Ad2ViMTg0NTA1Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":69475,"nextInTopic":69487,"prevInTime":69483,"nextInTime":69485,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"****Why are people illiterate?  Are there people who really can not learn to read?  Or is it because they were shamed so much in school?**** When I was first","messageBody":"<div id=\"ygrps-yiv-1486939809\">****Why are people illiterate?  Are there people who really can not learn to read?  Or is it because they were shamed so much in school?****<br/>\n<br/>\n <br/>\n<br/>\nWhen I was first out of college, I taught for a year in a Head Start program (preschool kids from low-income families).  The local high school had a nationally-recognized program where they took kids who would have been on out-of-school suspension (usually for fighting), and placed them in our preschool classrooms as volunteers (an interesting idea – trying to help the kids turn their teen years around by helping them be role models for little ones :-)).  <br/>\n<br/>\n <br/>\n<br/>\nIn my attempt to try to find things for the teens to do that they’d enjoy, I handed one boy a copy of “Is Your Mama a Llama?” – and asked him if he’d read it to a small group of preschoolers.<br/>\n<br/>\n <br/>\n<br/>\nHe took the book, but when I listened to him try to read it, I realized he couldn’t.  He was 16 or 17 – had been in school his whole life, and he couldn’t read.  One of his friends came over and took the book – and it was the same thing – he couldn’t puzzle through the words.  Before a third got involved, I suggested everyone go outside for a game of kickball :-)<br/>\n<br/>\n <br/>\n<br/>\nIt really opened my eyes to see kids that old, who had been in school for so many years, struggle so severely with a children’s book.<br/>\n<br/>\n <br/>\n<br/>\nLater, when talking to one of the moms of one of the little ones, I mentioned it and I wondered out loud how kids could go through school without learning to read.  She too said something that opened my eyes – she told me that those teens hadn’t grown up like I had, surrounded by books and print and words and other people who loved to read.  She said there were probably no books in their houses – because there were none in her house even now as she was raising her daughter.  She talked about how sometimes, food takes priority over books.  And how sometimes when kids who don’t have books at home get to school, teachers decide they’re “stupid” or “worthless” and they don’t work with them like they do the other kids who take naturally to books and reading.  Instead they label them and send them to “special” classes where it’s even less likely they’ll learn to read since the focus there is on behavior, not on enjoying the written world or playing or growing or enjoying.<br/>\n<br/>\n <br/>\n<br/>\nUnschooling is a world away from kids in special classes.  Unschooling doesn’t need kids to be labeled.  Unschooling gives kids the opportunity to be who they are, and to learn at their own pace in a positive and supportive environment that’s filled with toys and books and videos and games and all sorts of wonderful things, exploring and playing with which will lead them to read and wonder and question and learn and have fun without the baggage lots of schooled kids will have to carry with them as they grow.<br/>\n<br/>\n <br/>\n<br/>\nColleen <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Two struggles","postDate":"1351372877","msgId":69475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2aGo4ZCsxMDhsNkBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDEzNTEzNjMyNjMuMzg3MjIuWWFob29NYWlsTmVvQHdlYjE4NDUwNS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":69468,"nextInTopic":69484,"prevInTime":69474,"nextInTime":69476,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"... ************** Shame on top of too-early instruction, or instruction which doesn t match the person s learning style are the common causes - in the modern","messageBody":"<div id=\"ygrps-yiv-1745894923\">Tiffani &lt;tiffermomof5@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Why are people illiterate? Â Are there people who really can not learn to read? Â Or is it because they wereÂ shamedÂ so much in school?<br/>\n </span></blockquote>**************<br/>\n<br/>\nShame on top of too-early instruction, or instruction which doesn&#39;t match the person&#39;s learning style are the common causes - in the modern developed world. I used to work for an adult literacy program and the biggest hurdles for people to overcome were self-esteem and the belief that reading had to be learned one particular way. And the vast majority of illiterate adults are people who can&#39;t use phonetic information to decode until after they&#39;ve learned to read. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I want to answer with confidence that the children will read when they are ready but it is hard to say that knowing that my Dad could not read<br/>\n </span></blockquote>***************<br/>\n<br/>\nOne of the major factors which sets kids up to learn to read when they&#39;re ready is &quot;a print rich environment&quot; - which is common nowadays in the developed world. Print is everywhere: on signs, video games, the internet, as well as books and magazines. It&#39;s hard to Avoid the printed word in our world. But that&#39;s new, relatively speaking. My mom grew up in a home with very few books in it - she depended on school to learn to read. There are large portions of the world where that&#39;s still true, today - kids don&#39;t have the luxury of learning to read at home because there isn&#39;t much, if anything, to read there. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351366689","msgId":69468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDNDIyMDA5LTM0QjgtNERFOC1BNTkzLTZFMUY3RUQ3RUVFQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzNTEzNjMyNjMuMzg3MjIuWWFob29NYWlsTmVvQHdlYjE4NDUwNS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPiA8OUI2MkVFRTMtMDA2NC00QTc0LUFCNjMtQ0I1NzEwQTM1NjM1QFNhbmRyYWRvZGQuY29tPiA8MTM1MTM2MzI2My4zODcyMi5ZYWhvb01haWxOZW9Ad2ViMTg0NTA1Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":69464,"nextInTopic":69475,"prevInTime":69467,"nextInTime":69469,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"-=-I have been asked about reading in regards to unschooling and I want to answer with confidence that the children will read when they are ready but it is","messageBody":"<div id=\"ygrps-yiv-1765516931\">-=-I have been asked about reading in regards to unschooling and I want to answer with confidence that the children will read when they are ready but it is hard to say that knowing that my Dad could not read. -=-<br/>\n<br/>\nYour dad wasn&#39;t unschooled.  So what your dad&#39;s story proves is that school doesn&#39;t guarantee that a person can read.<br/>\n<br/>\nMy dad read very little, very haltingly.  He was in school in the 1930&#39;s.  He was lefthanded, but was made to use his right hand.  That slowed him down and made his learning very awkward all by itself.  And so he was behind, because he was being handicapped.  If I had been prevented from using my right hand in school when I was six, seven, eight, I would have been distracted and unhappy.<br/>\n<br/>\nWith unschooling, to try to teach a child or pressure him to learn or do in ways that aren&#39;t natural or pleasurable or of his own choosing is like that.<br/>\n<br/>\nThe lastest-reading unschooler I&#39;ve ever heard of was a preemie twin (his sister was full-sized, but he was small/younger) and he was very slow to speak, and even when he was four we couldn&#39;t always understand him when he did speak.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/carol\">http://sandradodd.com/r/carol</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351365477","msgId":69464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGQkUzRkZCLTdENkYtNDVCQS05RUQ1LUUzMjQyMUUxRTY5Q0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDEzNTEzNjMyNjMuMzg3MjIuWWFob29NYWlsTmVvQHdlYjE4NDUwNS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPiA8OUI2MkVFRTMtMDA2NC00QTc0LUFCNjMtQ0I1NzEwQTM1NjM1QFNhbmRyYWRvZGQuY29tPiA8MTM1MTM2MzI2My4zODcyMi5ZYWhvb01haWxOZW9Ad2ViMTg0NTA1Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":69459,"nextInTopic":69468,"prevInTime":69463,"nextInTime":69465,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"... Not reading is not a legacy. Many things could have contributed to your dad s being unable to read, but I d guess at school damage and shame. Your dad","messageBody":"<div id=\"ygrps-yiv-1020047710\"><blockquote><span title=\"ireply\">&gt; I have been asked about reading in regards to unschooling and I want  <br/>\n&gt; to answer with confidence that the children will read when they are  <br/>\n&gt; ready but it is hard to say that knowing that my Dad could not read.<br/>\n&gt;<br/>\n </span></blockquote>&quot;Not reading&quot; is not a legacy. Many things could have contributed to  <br/>\nyour dad&#39;s being unable to read, but I&#39;d guess at school damage and  <br/>\nshame.<br/>\n<br/>\nYour dad wasn&#39;t unschooled, so you can every confidence that kids can  <br/>\nlearn to read when they&#39;re ready!<br/>\n<br/>\nRead here, if you haven&#39;t already. Your kids (and you) are not that  <br/>\nmuch different from everyone in these stories.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":352884218,"authorName":"Tiffani","from":"Tiffani &lt;tiffermomof5@...&gt;","profile":"tiffermomof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351363263","msgId":69459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTEzNjMyNjMuMzg3MjIuWWFob29NYWlsTmVvQHdlYjE4NDUwNS5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDlCNjJFRUUzLTAwNjQtNEE3NC1BQjYzLUNCNTcxMEEzNTYzNUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPiA8OUI2MkVFRTMtMDA2NC00QTc0LUFCNjMtQ0I1NzEwQTM1NjM1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":69455,"nextInTopic":69464,"prevInTime":69458,"nextInTime":69460,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"I have wondered about this for a while.  My Dad was illiterate.  So was one of my Uncles.  You wouldn t know it they were both very intelligent.  In fact","messageBody":"<div id=\"ygrps-yiv-1468911426\">I have wondered about this for a while.  My Dad was illiterate.  So was one of my Uncles.  You wouldn&#39;t know it they were both very intelligent.  In fact I did not know my Dad could not read until my Mom told me (I was an adult when she told me, I always thought the image of a Dad sitting at the table reading the paper was weird.).  I thought she read to him because they enjoyed it.  When I said that to her she said that was because they did enjoy sitting together and her reading to him.<br/>\n<br/>\nMy Dad is no longer here so I can not ask him personally.  Why are people illiterate?  Are there people who really can not learn to read?  Or is it because they were shamed so much in school?  I am dyslexic. At least that is what I was told in school.  I do things to make reading easier for me and my family helps me when I need help.  I did not read to my older kids because I was embarrassed.  I do read to my younger kids because i have finally begun to feel comfortable with my slip ups. I even read to my teens now and then. I did not read for pleasure until I was an adult and pregnant. I wanted to know what was going on with the baby inside me.<br/>\n<br/>\nAll my kids can read at least a bit.  2 learned in school, 2 learned with programs and 1 learned in an unschooling environment.  1 of my kids has brain damage and that child struggles with reading and many other things. <br/>\n<br/>\nI have been asked about reading in regards to unschooling and I want to answer with confidence that the children will read when they are ready but it is hard to say that knowing that my Dad could not read. <br/>\n<br/>\nTiffani<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, October 26, 2012 3:37 PM<br/>\nSubject: Re: [AlwaysLearning] Two struggles<br/>\n <br/>\n-=-I am struggling with two blocks in my day-to-day attempts to unschool. Both involve my middle child who is approaching 10. -=-<br/>\n<br/>\nHe&#39;s only nine.  <br/>\n<br/>\nWhen parents round an age up, it seems almost invariably to be done when they&#39;re being critical of a lack of &quot;progress.&quot;  <br/>\n<br/>\nWhen they want to brag a kid up, they&#39;ll say &quot;He&#39;s only nine, and...&quot; but when they want to criticize, they&#39;ll say &quot;Nearly ten, and...&quot;<br/>\nI could be wrong about this, but listen around and see if I&#39;m right or wrong.<br/>\n<br/>\nWhat if you had a nine year old child who was deaf, or mute, or severely slow to understand?   Learning to see benefits and advantages instead of cataloging lack is a valuable part of unschooling.<br/>\n<br/>\n-=-But the struggle I am having moving further into confidence and peace in our unschooling life come from the other reading I do about both dyslexia and anxiety, the books by &quot;experts&quot; on those subjects. -=-<br/>\n<br/>\nSo don&#39;t read them.  They&#39;re writing about school first and dyslexia-related problems second.  Professional advice is almost always in support of school&#39;s needs and requirements.<br/>\n<br/>\n-=-n reading about anxiety, I am repeatedly encountering the advice that a child or adult with fear should not allow themselves to avoid a situation that triggers fear, because the fears then continue unchecked and the world of possibilities gets smaller. Instead, they argue, by noting the fear, engaging in the activity (going roller skating), finding it not so bad or even good (LOVING roller skating in this case), and then reflecting on the experience – my brain says danger, I try anyway, there isn&#39;t danger – the excess of fear can be cognitively handled. -=-<br/>\n<br/>\nThat&#39;s a lot of words designed to prevent people from having choices, and to make them feel that they DO have problems that professionals (who wrote those books) can help them fix, for a (high) price.<br/>\n<br/>\n-=-Similarly, in reading about dyslexia, many &quot;experts&quot; and dyslexics themselves advise that frequent, concrete phonological instruction, such as orton-gillingham, makes reading easier for them. According to the experts, decoding happens in a different region of the brain for dyslexic people, and over time concrete, repetitive practice supposedly speeds up what is otherwise a difficult mental task. Of course for my son...-=-<br/>\n<br/>\nThat all has to do with school, and the assertion that it is difficult, and a difficult TASK.<br/>\n<br/>\nOne of my kids is classic dyslexic, lefty, mathish, slower to language skills.  But you wouldn&#39;t know which one.  By the time he was 13, 14, you wouldn&#39;t have been able to tell in any group of kids, nor from his brother at the same age.  As a young adult, nobody would know.   This is because he had no school to tell him he was slow, or badly wired, or deficient, or had a condition or disability.  So he learned to read without it being a task.  He learned in his own time and in his own way.  It&#39;s the only way anyone can learn to read.  <br/>\n<br/>\nSchool has experts and methods because they take in and spend money.  The money goes into the bank accounts of the experts and producers of methods.  And the children are certified to be disabled, so that the experts take credit for miraculous partial cures.<br/>\n<br/>\nIf you will drop all thought and talk of this &quot;problem,&quot; the problem will be gone.  Do not perpetuate the damage school does. <br/>\n<br/>\n-=-Of course for my son, reading is difficult and stressful and he chooses not to practice it or engage in a structured phonetic program even though he loves books and wants to read and has a *lot* of emotion and frustration about not being able to.-=-<br/>\n<br/>\nStop giving him a choice of a structured phonetic program.  It&#39;s not unschooling.  It&#39;s not natural learning.  It&#39;s causing him frustration and stress and difficulty.  <br/>\n<br/>\nOf course for ANYONE it&#39;s diffcult and stressful for people to press them to do something they&#39;re not yet able to do.  If you feel stressed that I&#39;m pressing you to understand unschooling before you&#39;re able to do it, I don&#39;t know what to say except you will need to stop doing what prevents unschooling from happening efore unschooling can begin to happen.<br/>\n<br/>\n-=-In both cases I&#39;m reading books that say that I should push him, or that I should encourage him to push himself, or at least tell him to consider pushing himself. But I don&#39;t want to push him; I want to let him be-=-<br/>\n<br/>\nStop reading those books.<br/>\n<br/>\n-=- I google therapists and dyslexia tutors. -=-<br/>\n<br/>\nStop googling those things.  <br/>\n<br/>\nYou&#39;ve explained to us that it&#39;s adversely affecting your entire family, and yet your son still isn&#39;t ready to read.  He&#39;s only nine.  Stop ruining his childhood with your anxiety.<br/>\n<br/>\nThis might help, or it might not.  But what you&#39;re doing already is definitely not helping.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/words/without\">http://sandradodd.com/words/without</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/specialunschooling\">http://sandradodd.com/specialunschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/labels\">http://sandradodd.com/labels</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351359867","msgId":69455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZFMDc2RTVGLUFDMjctNEUwNi05NDhBLUE0NjIwM0Y2NURERkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69449,"nextInTopic":69459,"prevInTime":69454,"nextInTime":69456,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"There was a post I returned, but I will quote the advice anonymously.  Then there are another couple of things after: I m sorry about you son s condition, and","messageBody":"<div id=\"ygrps-yiv-702718409\">There was a post I returned, but I will quote the advice anonymously.  Then there are another couple of things after:<br/>\n<br/>\nI&#39;m sorry about you son&#39;s condition, and I tnk some may <br/>\nthink this is totally crazy, but talk to him and see if he <br/>\ncan agree to go into a raw plant based diet. Not a loose <br/>\nweight diet, just eating mostly raw, and mostly plants. If <br/>\nyou can afford organic, that is even better. If you cannot, <br/>\nwash your produce well before eating. This can take care of <br/>\nthe anxiaty, and you will be surprise of how well things <br/>\ncould turn around...<br/>\n<br/>\n_______________<br/>\n<br/>\nThis morning on the Retronaut blog (&quot;The past is a foreign country.  This is your passport&quot;--great for exploring random connections), there was a collection of advertisements for &quot;Nervine,&quot; which was to settle nervouness.  Their descriptions of &quot;nerves&quot; is interesting.  Varied, and much of what people medicate for today, but all seemed to be about thinking.   <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.retronaut.com/2012/10/dr-miles-nervine\">http://www.retronaut.com/2012/10/dr-miles-nervine</a><br/>\n<br/>\nIF there is stress in a family stress begets stress.  If the mother is pressuring, there will be responses and reactions to that pressure. If a mother is inattentive and not seeing a child directly and looking for the best in that child, there will be responses and reactions.  <br/>\n<br/>\nIf a child IS nervous, of a suspicious or nervous nature, there are ways that a positive attitude and a life filled with options and sympathy can lessen that.<br/>\n<br/>\nMaybe diet.  Maybe drugs.  Maybe counselling.  <br/>\nI think it&#39;s fair and right to say, in this discussion on this list, that FIRST the mom should try unschooling.<br/>\n<br/>\nIf any mom here is in a situation in which it seems counselling is a good route, I have a collection of names of counsellors who understand unschooling (some are unschoolers).  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/issues/therapy\">http://sandradodd.com/issues/therapy</a><br/>\n<br/>\nMy favorite, of the Nervine ads, looks like the 1920&#39;s (by the phone and clothes) and reminds me of &quot;Mother&#39;s Little Helper&quot; by The Rolling Stones.  The 1960&#39;s had another wave of drugs for nervous conditions, and the idea that children DID &quot;drive mothers crazy.&quot;<br/>\nNowadays they drug the children instead.  :-/  The large image of that one is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.retronaut.com/wp-content/uploads/2012/10/1109.jpg\">http://www.retronaut.com/wp-content/uploads/2012/10/1109.jpg</a><br/>\n<br/>\nThe problem with recommending drugs or diet is that the mother is unlikely to change her own behavior or attitude, and when a child feels afraid or unsafe, he needs the adults around him to help him feel safer and more seen and heard.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":327852347,"authorName":"Tress m","from":"Tress m &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351303236","msgId":69449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMybW8wdDBIeW83WS1EdVFMekh6UV8wY3U3WEtrN3ZzeUN5PXNXSzRaTlR2UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69445,"nextInTopic":69455,"prevInTime":69448,"nextInTime":69450,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"I took my 10 year old daughter who overwhelms easily to the same conference attended by Meredith and Sandra (I saw the octopus).  She spent most of her time in","messageBody":"<div id=\"ygrps-yiv-186432663\">I took my 10 year old daughter who overwhelms easily to the same conference<br/>\nattended by Meredith and Sandra (I saw the octopus).  She spent most of her<br/>\ntime in our hotel room or in the gaming room.  I have learned to respect<br/>\nher need to be in very small groups or to be alone.  She knows what she can<br/>\nhandle or cope with.<br/>\n<br/>\nAt home she prefers to stay home rather than participate in group<br/>\nactivities.  I let her know when the local homeschooling group has an<br/>\nouting planned.  If she says no, then I trust that she knows that she can&#39;t<br/>\nmanage an outing today.<br/>\n<br/>\nFor me, it comes down to trusting her to know what she can handle.<br/>\nTress<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Friday, October 26, 2012, malvarez5412 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hayesalvarez@...\">hayesalvarez@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I am struggling with two blocks in my day-to-day attempts to unschool.<br/>\nBoth involve my middle child who is approaching 10. He is dyslexic and has<br/>\nanxiety. By dyslexic, I mean that understanding language (both oral and<br/>\nwritten) is more arduous for him than for many other people and that he has<br/>\nother traits (both struggles and aptitudes) described in books such as the<br/>\nGift of Dyslexia and Neurodiversity. By anxiety, I mean that he has panic<br/>\nattacks regularly (with physical and emotional symptoms), he has high<br/>\nlevels of advance fear about situations that seem to me benign, and turn<br/>\nout to be pleasurable for him (such as roller skating at the rink for<br/>\n&quot;homeschooling day&quot; or having a playdate with a friend).<br/>\n&gt;<br/>\n&gt; I&#39;ve read a lot of unschooling articles specifically about reading and<br/>\ndyslexia and they have helped me to let go of outside expectations. I am<br/>\nnot concerned that his reading be &quot;age-appropriate,&quot; nor do I think his<br/>\nbrain should be different than it is. But the struggle I am having moving<br/>\nfurther into confidence and peace in our unschooling life come from the<br/>\nother reading I do about both dyslexia and anxiety, the books by &quot;experts&quot;<br/>\non those subjects.<br/>\n&gt;<br/>\n&gt; In reading about anxiety, I am repeatedly encountering the advice that a<br/>\nchild or adult with fear should not allow themselves to avoid a situation<br/>\nthat triggers fear, because the fears then continue unchecked and the world<br/>\nof possibilities gets smaller. Instead, they argue, by noting the fear,<br/>\nengaging in the activity (going roller skating), finding it not so bad or<br/>\neven good (LOVING roller skating in this case), and then reflecting on the<br/>\nexperience � my brain says danger, I try anyway, there isn&#39;t danger � the<br/>\nexcess of fear can be cognitively handled.<br/>\n&gt;<br/>\n&gt; Similarly, in reading about dyslexia, many &quot;experts&quot; and dyslexics<br/>\nthemselves advise that frequent, concrete phonological instruction, such as<br/>\norton-gillingham, makes reading easier for them. According to the experts,<br/>\ndecoding happens in a different region of the brain for dyslexic people,<br/>\nand over time concrete, repetitive practice supposedly speeds up what is<br/>\notherwise a difficult mental task. Of course for my son, reading is<br/>\ndifficult and stressful and he chooses not to practice it or engage in a<br/>\nstructured phonetic program even though he loves books and wants to read<br/>\nand has a *lot* of emotion and frustration about not being able to.<br/>\n&gt;<br/>\n&gt; In both cases I&#39;m reading books that say that I should push him, or that<br/>\nI should encourage him to push himself, or at least tell him to consider<br/>\npushing himself. But I don&#39;t want to push him; I want to let him be. I know<br/>\nthat my choice not to push him, to fully accept him for who he is and let<br/>\nhim grow without pressure is crucial to his well-being. But there is a part<br/>\nof me that says that because he has these two issues, he needs<br/>\nintervention. I don&#39;t want to &quot;fix&quot; these issues, but at the same time,<br/>\nthey make him unhappy, life is harder for him and less carefree than for my<br/>\nother children because of his frustrations about reading and his many<br/>\nanxieties and I find that I do want to intervene and, yes, &quot;fix&quot; them. I<br/>\ngoogle therapists and dyslexia tutors. Then I stop and reread Holt. But I<br/>\nfeel stuck, not able to move further into freedom and acceptance because of<br/>\nmy thinking about these two aspects of my son&#39;s mind and self.<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":439465581,"authorName":"Robert and Colleen","from":"&quot;Robert and Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Two struggles","postDate":"1351293792","msgId":69445,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzMWEwMWNkYjNkMCRkZTRkNzRjMCQ5YWU4NWU0MCRAY29tY2FzdC5uZXQ+","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69444,"nextInTopic":69449,"prevInTime":69444,"nextInTime":69446,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"****I am struggling with two blocks in my day-to-day attempts to unschool. Both involve my middle child who is approaching 10. He is dyslexic and has ","messageBody":"<div id=\"ygrps-yiv-267827668\">****I am struggling with two blocks in my day-to-day attempts to unschool.<br/>\nBoth involve my middle child who is approaching 10. He is dyslexic and has<br/>\nanxiety.****<br/>\n<br/>\n <br/>\n<br/>\nOne of the nice things about unschooling is that your son, now that he&#39;s not<br/>\nin school, doesn&#39;t need to be dyslexic and he doesn&#39;t need to &quot;[have]<br/>\nanxiety.&quot;  He can simply Be Himself.  <br/>\n<br/>\n <br/>\n<br/>\nAnd you can play with him, watch him play, enjoy him, explore with him - in<br/>\nwhatever ways work for him (by work I mean make him happy - make him smile -<br/>\nmake him say things like &quot;let&#39;s do that again!&quot; or &quot;I like that!&quot;).  <br/>\n<br/>\n <br/>\n<br/>\nWhat a wonderful thing I imagine it must be, for someone who has been<br/>\nlabeled to see those labels fall away.  To leave those behind and be known<br/>\nsimply by his/her name again - rather than being known as &quot;So-and-So who is<br/>\ndyslexic and has anxiety.&quot; :-)<br/>\n<br/>\n <br/>\n<br/>\nColleen <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Two struggles","postDate":"1351293423","msgId":69444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTEyOTM0MjMuNDI3MzIuWWFob29NYWlsTmVvQHdlYjg3OTAxLm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGs2ZjRsNCtiN3NuQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPiA8azZmNGw0K2I3c25AZUdyb3Vwcy5jb20+"},"prevInTopic":69443,"nextInTopic":69445,"prevInTime":69443,"nextInTime":69445,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"________________________________ From: Meredith   Recently my daughter and I went to an unschooling conference in a hotel.","messageBody":"<div id=\"ygrps-yiv-1423541336\">________________________________<br/>\n From: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; &lt;wrote&gt;<br/>\nRecently my daughter and I went to an unschooling conference in a hotel. She&#39;s 11, and for the most part didn&#39;t leave the hotel room. She toured the place with me, saw where they game room was, where the pool was, was interested, but mostly didn&#39;t want to leave the room. I didn&#39;t push her to get out, but I didn&#39;t &quot;leave her be&quot; either - I made sure to check in with her, offer to go with her if she wanted to check something out, stay as close to her as she wanted. From much experience doing this sort of thing, she knows I can always find her an escape route if she gets overwhelmed - including carrying her out if she totally freezes up and helping her relax afterwards. It&#39;s hard to Explain all that I do - sometimes there&#39;s coaxing or reassuring or planning... and generally with a minimum number of words, because she doesn&#39;t deal well with a lot of talking! But I don&#39;t push Or leave her be. I work with her to help her get and do what she wants - and<br/>\n sometimes getting and doing what she wants is hard for her.<br/>\n<br/>\nAs it turned out, she went to the pool every day and the beach one day - always with me nearby, always with me walking to and from the room with her. Knowing Mo, it was impressive - I honestly was prepared for her to stay in the room the entire time. She even went into the big ballroom during someone&#39;s presentation (lots of people! a PA system! big over-stimulation triggers!) in order to see the octopus Sandra had found on the beach, And said hello to Sandra&#39;s husband too.<br/>\n<br/>\n___________________________<br/>\n<br/>\nThat&#39;s a big part of the difference between what an unschooling parent is capable of and what a parent who is working within the school system is limited to. There is no way that a school could support a child in the way that Meredith supported Morgan. There is no way that a child who had to go to school, for whatever reason, could be supported, nurtured by their parents in the same way. <br/>\n<br/>\nPart of the limitation of the books you are reading is that parents mostly need their children to be precocious in the ways that allow them to go to school everyday. Those children need to be independent, need to be reading, need to be pushed to go on whatever it is one needs to go on with a schoolbus full of children in order to allow their parents to do whatever it is that keeps them from being able to make other choices. <br/>\n<br/>\nI listened to an infant cry as his parents were helping him to expect less from them. His mother and his father needed to get back to work. They needed their son to be set up to go into daycare at however few weeks it was that the maternity leave gave them together. They needed him to be independent faster than I ever needed Simon or Linnaea to be. And I sat listening to him cry and I wanted to hold and rock him and I knew that it wasn&#39;t my baby, it wasn&#39;t my option set, it wasn&#39;t my sweet, sweet life. So I would go inside rather than be where I could hear. And I would touch Simon or Linnaea and I would think about how wonderful it is that I can help them to negotiate the world as and when and how they are ready to and not based on some other need or drive. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Two struggles","postDate":"1351293334","msgId":69443,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBOEU3ODBFLUE2NkEtNDJBRi1CNjBCLTBBQ0U2QTRGOTA3NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2ZjRsNCtiN3NuQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZjRsNCtiN3NuQGVHcm91cHMuY29tPg=="},"prevInTopic":69442,"nextInTopic":69444,"prevInTime":69442,"nextInTime":69444,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"=-She even went into the big ballroom during someone s presentation (lots of people! a PA system! big over-stimulation triggers!) in order to see the octopus","messageBody":"<div id=\"ygrps-yiv-1296536529\">=-She even went into the big ballroom during someone&#39;s presentation (lots of people! a PA system! big over-stimulation triggers!) in order to see the octopus Sandra had found on the beach, And said hello to Sandra&#39;s husband too.-=-<br/>\n<br/>\nI  hope she went before I let it go.<br/>\n<br/>\nAn little octopus found us/we found it...   but it got cranky inked and escaped the bucket, so Keith and Holly pressed me to take it back out, even though I had told people we would take it back at 6:00.  So I took it back noonish.  I&#39;m still agitated about that, that I told people they could see it, but i took it back.  I really felt what my boys must have felt when they had a bug or lizard and I presuaded them to let it go.  <br/>\n<br/>\nI figured I would make a blogpost of it, but haven&#39;t yet.  The photos are <br/>\nthe orange bucket photos here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://s26.photobucket.com/albums/c111/SandraDodd/Albuquerque/2012/October/Florida/#!\">http://s26.photobucket.com/albums/c111/SandraDodd/Albuquerque/2012/October/Florida/#!</a>cpZZ6QQtppZZ20<br/>\n<br/>\nSorry for the side story, but everything connects to other things.  <br/>\nUnexpected things happen.<br/>\nChoices are made. <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Two struggles","postDate":"1351292388","msgId":69442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2ZjRsNCtiN3NuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69441,"nextInTopic":69443,"prevInTime":69441,"nextInTime":69443,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"... ************ Some people, some dyslexics among them, can t use phonetic information to decode until they have a big enough sight-word lexicon - and then","messageBody":"<div id=\"ygrps-yiv-1030352581\">&quot;malvarez5412&quot; &lt;hayesalvarez@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;According to the experts, decoding happens in a different region of the brain for dyslexic people, and over time concrete, repetitive practice supposedly speeds up what is otherwise a difficult mental task.<br/>\n </span></blockquote>************<br/>\n<br/>\nSome people, some dyslexics among them, can&#39;t use phonetic information to decode until they have a big enough sight-word lexicon - and then the information makes sense. If those people are in some kind of program where they do a lot of repetitive drills, they&#39;ll eventually memorize enough words that the program will Seem to work - eventually they &quot;get it&quot;. That&#39;s one of the perennial problems with teaching - it&#39;s very easy to conflate what&#39;s learned and how with what&#39;s being taught.<br/>\n<br/>\nAdding to the confusion is that the most successful modern &quot;phonics&quot; programs are really &quot;whole language&quot; programs with a veneer of phonics - they push phonetic information, yes, but they also repeat words and build on words already used which allows people who learn via memorization to build a lexicon more easily. <br/>\n<br/>\nAnd it isn&#39;t true that everyone with dyslexia has trouble with phonics - they&#39;re different phenomena. People with dyslexia seem to fall into the same sorts of groups as other people in terms of learning to read: some read early, some later, some catch on to phonics right away, others don&#39;t... the catch is that kids with dyslexia who don&#39;t have problems aren&#39;t accounted for in the statistics - and that makes utter hash of the data. <br/>\n<br/>\nAnd, on top of everything else, some people aren&#39;t ready to read until they reach puberty. That&#39;s completely ignored by most educators nowadays - it&#39;s not in Their best interest to acknowledge that there&#39;s really nothing which will speed the process along. After all, they&#39;re paid to teach. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; In both cases I&#39;m reading books that say that I should push him, or that I should encourage him to push himself, or at least tell him to consider pushing himself.<br/>\n </span></blockquote>************<br/>\n<br/>\nThose are all different things... and different still from seeing that there&#39;s a wider range of options than &quot;push&quot; or &quot;avoid/retreat&quot; and looking for ways to help your kid make plans and choices and support him in those plans and choices. Figuring out how to help your kid with that complex, delicate process isn&#39;t something you&#39;ll learn just by reading, though, any more than you can learn to water-ski just by reading ;) You need to get a Feel for the details and nuances of your own child&#39;s needs and wants and triggers, what helps, what doesn&#39;t - and most of the time those will all be subject to other variables, too. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; But I don&#39;t want to push him; I want to let him be.<br/>\n<br/>\n </span></blockquote>That&#39;s much too black and white!<br/>\n<br/>\nRecently my daughter and I went to an unschooling conference in a hotel. She&#39;s 11, and for the most part didn&#39;t leave the hotel room. She toured the place with me, saw where they game room was, where the pool was, was interested, but mostly didn&#39;t want to leave the room. I didn&#39;t push her to get out, but I didn&#39;t &quot;leave her be&quot; either - I made sure to check in with her, offer to go with her if she wanted to check something out, stay as close to her as she wanted. From much experience doing this sort of thing, she knows I can always find her an escape route if she gets overwhelmed - including carrying her out if she totally freezes up and helping her relax afterwards. It&#39;s hard to Explain all that I do - sometimes there&#39;s coaxing or reassuring or planning... and generally with a minimum number of words, because she doesn&#39;t deal well with a lot of talking! But I don&#39;t push Or leave her be. I work with her to help her get and do what she wants - and sometimes getting and doing what she wants is hard for her.<br/>\n<br/>\nAs it turned out, she went to the pool every day and the beach one day - always with me nearby, always with me walking to and from the room with her. Knowing Mo, it was impressive - I honestly was prepared for her to stay in the room the entire time. She even went into the big ballroom during someone&#39;s presentation (lots of people! a PA system! big over-stimulation triggers!) in order to see the octopus Sandra had found on the beach, And said hello to Sandra&#39;s husband too.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351291254","msgId":69441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdBMEJBRDdDLUQzMzEtNDdFMy04RTQ0LUMyMTE4RjdBQzFDQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69440,"nextInTopic":69442,"prevInTime":69440,"nextInTime":69442,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"Pam Laricchia s introductory series of information about unchooling would help here, too.  If you can go just a few weeks REALLY trying to get unschooling","messageBody":"<div id=\"ygrps-yiv-1542733227\">Pam Laricchia&#39;s introductory series of information about unchooling would help here, too.  If you can go just a few weeks REALLY trying to get unschooling (though it will take you, the mom, over a year altogether), I think you could make some solid progress if you will read Pam&#39;s e-mails as they come (two per week, spread out for a reason, with things to do and consider between times).  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.livingjoyfully.ca\">http://www.livingjoyfully.ca</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351291072","msgId":69440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCNjJFRUUzLTAwNjQtNEE3NC1BQjYzLUNCNTcxMEEzNTYzNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69439,"nextInTopic":69441,"prevInTime":69439,"nextInTime":69441,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"-=-I am struggling with two blocks in my day-to-day attempts to unschool. Both involve my middle child who is approaching 10. -=- He s only nine. When parents","messageBody":"<div id=\"ygrps-yiv-1862003790\">-=-I am struggling with two blocks in my day-to-day attempts to unschool. Both involve my middle child who is approaching 10. -=-<br/>\n<br/>\nHe&#39;s only nine.  <br/>\n<br/>\nWhen parents round an age up, it seems almost invariably to be done when they&#39;re being critical of a lack of &quot;progress.&quot;  <br/>\n<br/>\nWhen they want to brag a kid up, they&#39;ll say &quot;He&#39;s only nine, and...&quot; but when they want to criticize, they&#39;ll say &quot;Nearly ten, and...&quot;<br/>\nI could be wrong about this, but listen around and see if I&#39;m right or wrong.<br/>\n<br/>\nWhat if you had a nine year old child who was deaf, or mute, or severely slow to understand?   Learning to see benefits and advantages instead of cataloging lack is a valuable part of unschooling.<br/>\n<br/>\n-=-But the struggle I am having moving further into confidence and peace in our unschooling life come from the other reading I do about both dyslexia and anxiety, the books by &quot;experts&quot; on those subjects. -=-<br/>\n<br/>\nSo don&#39;t read them.  They&#39;re writing about school first and dyslexia-related problems second.  Professional advice is almost always in support of school&#39;s needs and requirements.<br/>\n<br/>\n-=-n reading about anxiety, I am repeatedly encountering the advice that a child or adult with fear should not allow themselves to avoid a situation that triggers fear, because the fears then continue unchecked and the world of possibilities gets smaller. Instead, they argue, by noting the fear, engaging in the activity (going roller skating), finding it not so bad or even good (LOVING roller skating in this case), and then reflecting on the experience � my brain says danger, I try anyway, there isn&#39;t danger � the excess of fear can be cognitively handled. -=-<br/>\n<br/>\nThat&#39;s a lot of words designed to prevent people from having choices, and to make them feel that they DO have problems that professionals (who wrote those books) can help them fix, for a (high) price.<br/>\n<br/>\n-=-Similarly, in reading about dyslexia, many &quot;experts&quot; and dyslexics themselves advise that frequent, concrete phonological instruction, such as orton-gillingham, makes reading easier for them. According to the experts, decoding happens in a different region of the brain for dyslexic people, and over time concrete, repetitive practice supposedly speeds up what is otherwise a difficult mental task. Of course for my son...-=-<br/>\n<br/>\nThat all has to do with school, and the assertion that it is difficult, and a difficult TASK.<br/>\n<br/>\nOne of my kids is classic dyslexic, lefty, mathish, slower to language skills.  But you wouldn&#39;t know which one.  By the time he was 13, 14, you wouldn&#39;t have been able to tell in any group of kids, nor from his brother at the same age.  As a young adult, nobody would know.   This is because he had no school to tell him he was slow, or badly wired, or deficient, or had a condition or disability.  So he learned to read without it being a task.  He learned in his own time and in his own way.  It&#39;s the only way anyone can learn to read.  <br/>\n<br/>\nSchool has experts and methods because they take in and spend money.  The money goes into the bank accounts of the experts and producers of methods.  And the children are certified to be disabled, so that the experts take credit for miraculous partial cures.<br/>\n<br/>\nIf you will drop all thought and talk of this &quot;problem,&quot; the problem will be gone.  Do not perpetuate the damage school does. <br/>\n<br/>\n-=-Of course for my son, reading is difficult and stressful and he chooses not to practice it or engage in a structured phonetic program even though he loves books and wants to read and has a *lot* of emotion and frustration about not being able to.-=-<br/>\n<br/>\nStop giving him a choice of a structured phonetic program.  It&#39;s not unschooling.  It&#39;s not natural learning.  It&#39;s causing him frustration and stress and difficulty.  <br/>\n<br/>\nOf course for ANYONE it&#39;s diffcult and stressful for people to press them to do something they&#39;re not yet able to do.  If you feel stressed that I&#39;m pressing you to understand unschooling before you&#39;re able to do it, I don&#39;t know what to say except you will need to stop doing what prevents unschooling from happening efore unschooling can begin to happen.<br/>\n<br/>\n-=-In both cases I&#39;m reading books that say that I should push him, or that I should encourage him to push himself, or at least tell him to consider pushing himself. But I don&#39;t want to push him; I want to let him be-=-<br/>\n<br/>\nStop reading those books.<br/>\n<br/>\n-=- I google therapists and dyslexia tutors. -=-<br/>\n<br/>\nStop googling those things.  <br/>\n<br/>\nYou&#39;ve explained to us that it&#39;s adversely affecting your entire family, and yet your son still isn&#39;t ready to read.  He&#39;s only nine.  Stop ruining his childhood with your anxiety.<br/>\n<br/>\nThis might help, or it might not.  But what you&#39;re doing already is definitely not helping.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/words/without\">http://sandradodd.com/words/without</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/specialunschooling\">http://sandradodd.com/specialunschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/labels\">http://sandradodd.com/labels</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Two struggles","postDate":"1351286899","msgId":69439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTEyODY4OTkuNzcwMTEuWWFob29NYWlsTmVvQHdlYjg3OTAxLm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":69438,"nextInTopic":69440,"prevInTime":69438,"nextInTime":69440,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"I went to wikipedia and quickly looked at the entry on dyslexia and found this line: Removing stress and anxiety alone contributes to improving","messageBody":"<div id=\"ygrps-yiv-819236243\">I went to wikipedia and quickly looked at the entry on dyslexia and found this line: &quot;Removing stress and anxiety alone contributes to improving understanding.&quot; with a citation that leads to the book Dyslexia and Stress: <a rel=\"nofollow\" target=\"_blank\" href=\"http://books.google.com.au/books?id=h27uAAAAMAAJ&redir_esc=y.%c2%a0\">http://books.google.com.au/books?id=h27uAAAAMAAJ&redir_esc=y.%c2%a0</a><br/>\n<br/>\nI don&#39;t know if they are arguing that dyslexia is the causal factor in stress or if the two things are correlated, that those folks who are dyslexic have higher stress levels, but there is clearly some associative pathway being highlighted between dyslexia and stress. <br/>\n<br/>\nIt may not matter, for your purposes, what the relationship is between dyslexia and stress. If what you want to do is figure out how to change your perspective, maybe simply recognising the association will be enough. And holding on to the sentence &quot;Removing stress and anxiety alone contributes to improving understanding&quot; regarding dyslexia may make it easier for you to look for things for your son to do that aren&#39;t going to cause him to have an anxious moment. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: malvarez5412 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hayesalvarez@...\">hayesalvarez@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Saturday, 27 October 2012, 6:26<br/>\nSubject: [AlwaysLearning] Two struggles<br/>\n <br/>\nI am struggling with two blocks in my day-to-day attempts to unschool.  Both involve my middle child who is approaching 10.  He is dyslexic and has anxiety. By dyslexic, I mean that understanding language (both oral and written) is more arduous for him than for many other people and that he has other traits (both struggles and aptitudes) described in books such as the Gift of Dyslexia and Neurodiversity.  By anxiety, I mean that he has panic attacks regularly (with physical and emotional symptoms), he has high levels of advance fear about situations that seem to me benign, and turn out to be pleasurable for him (such as roller skating at the rink for &quot;homeschooling day&quot; or having a playdate with a friend).  <br/>\n<br/>\nI&#39;ve read a lot of unschooling articles specifically about reading and dyslexia and they have helped me to let go of outside expectations. I am not concerned that his reading be &quot;age-appropriate,&quot; nor do I think his brain should be different than it is.  But the struggle I am having moving further into confidence and peace in our unschooling life come from the other reading I do about both dyslexia and anxiety, the books by &quot;experts&quot; on those subjects. <br/>\n<br/>\nIn reading about anxiety, I am repeatedly encountering the advice that a child or adult with fear should not allow themselves to avoid a situation that triggers fear, because the fears then continue unchecked and the world of possibilities gets smaller.  Instead, they argue, by noting the fear, engaging in the activity (going roller skating), finding it not so bad or even good (LOVING roller skating in this case), and then reflecting on the experience – my brain says danger, I try anyway, there isn&#39;t danger – the excess of fear can be cognitively handled.  <br/>\n<br/>\nSimilarly, in reading about dyslexia, many &quot;experts&quot; and dyslexics themselves advise that frequent, concrete phonological instruction, such as orton-gillingham, makes reading easier for them.  According to the experts, decoding happens in a different region of the brain for dyslexic people, and over time concrete, repetitive practice supposedly speeds up what is otherwise a difficult mental task.  Of course for my son, reading is difficult and stressful and he chooses not to practice it or engage in a structured phonetic program even though he loves books and wants to read and has a *lot* of emotion and frustration about not being able to.<br/>\n<br/>\nIn both cases I&#39;m reading books that say that I should push him, or that I should encourage him to push himself, or at least tell him to consider pushing himself.  But I don&#39;t want to push him; I want to let him be.  I know that my choice not to push him, to fully accept him for who he is and let him grow without pressure is crucial to his well-being. But there is a part of me that says that because he has these two issues, he needs intervention.  I don&#39;t want to &quot;fix&quot; these issues, but at the same time, they make him unhappy, life is harder for him and less carefree than for my other children because of his frustrations about reading and his many anxieties and I find that I do want to intervene and, yes, &quot;fix&quot; them.   I google therapists and dyslexia tutors.  Then I stop and reread Holt.  But I feel stuck, not able to move further into freedom and acceptance because of my thinking about these two aspects of my son&#39;s mind and self.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":528306112,"authorName":"malvarez5412","from":"&quot;malvarez5412&quot; &lt;hayesalvarez@...&gt;","profile":"malvarez5412","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Two struggles","postDate":"1351283165","msgId":69438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2ZXJrdCtpdXViQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":69439,"prevInTime":69437,"nextInTime":69439,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"I am struggling with two blocks in my day-to-day attempts to unschool.  Both involve my middle child who is approaching 10.  He is dyslexic and has anxiety. By","messageBody":"<div id=\"ygrps-yiv-1443173345\">I am struggling with two blocks in my day-to-day attempts to unschool.  Both involve my middle child who is approaching 10.  He is dyslexic and has anxiety. By dyslexic, I mean that understanding language (both oral and written) is more arduous for him than for many other people and that he has other traits (both struggles and aptitudes) described in books such as the Gift of Dyslexia and Neurodiversity.  By anxiety, I mean that he has panic attacks regularly (with physical and emotional symptoms), he has high levels of advance fear about situations that seem to me benign, and turn out to be pleasurable for him (such as roller skating at the rink for &quot;homeschooling day&quot; or having a playdate with a friend).  <br/>\n<br/>\nI&#39;ve read a lot of unschooling articles specifically about reading and dyslexia and they have helped me to let go of outside expectations. I am not concerned that his reading be &quot;age-appropriate,&quot; nor do I think his brain should be different than it is.  But the struggle I am having moving further into confidence and peace in our unschooling life come from the other reading I do about both dyslexia and anxiety, the books by &quot;experts&quot; on those subjects. <br/>\n<br/>\nIn reading about anxiety, I am repeatedly encountering the advice that a child or adult with fear should not allow themselves to avoid a situation that triggers fear, because the fears then continue unchecked and the world of possibilities gets smaller.  Instead, they argue, by noting the fear, engaging in the activity (going roller skating), finding it not so bad or even good (LOVING roller skating in this case), and then reflecting on the experience  my brain says danger, I try anyway, there isn&#39;t danger  the excess of fear can be cognitively handled.  <br/>\n<br/>\nSimilarly, in reading about dyslexia, many &quot;experts&quot; and dyslexics themselves advise that frequent, concrete phonological instruction, such as orton-gillingham, makes reading easier for them.  According to the experts, decoding happens in a different region of the brain for dyslexic people, and over time concrete, repetitive practice supposedly speeds up what is otherwise a difficult mental task.  Of course for my son, reading is difficult and stressful and he chooses not to practice it or engage in a structured phonetic program even though he loves books and wants to read and has a *lot* of emotion and frustration about not being able to.<br/>\n<br/>\nIn both cases I&#39;m reading books that say that I should push him, or that I should encourage him to push himself, or at least tell him to consider pushing himself.  But I don&#39;t want to push him; I want to let him be.  I know that my choice not to push him, to fully accept him for who he is and let him grow without pressure is crucial to his well-being. But there is a part of me that says that because he has these two issues, he needs intervention.  I don&#39;t want to &quot;fix&quot; these issues, but at the same time, they make him unhappy, life is harder for him and less carefree than for my other children because of his frustrations about reading and his many anxieties and I find that I do want to intervene and, yes, &quot;fix&quot; them.   I google therapists and dyslexia tutors.  Then I stop and reread Holt.  But I feel stuck, not able to move further into freedom and acceptance because of my thinking about these two aspects of my son&#39;s mind and self.</div>","specialLinks":[]}],"prevTopicId":69456,"nextTopicId":69502}}