{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"List Posting Policies","postDate":"1105803280","msgId":102620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4Rjk1NTE4LTY3MEEtMTFEOS04OUJDLTAwMEE5NTdFRkU0NkBtYWMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":102619,"nextInTime":102621,"topicId":102620,"numMessagesInTopic":0,"msgSnippet":"All of you got these when you subscribed to the list, but once in a while I like to send them to the list so that we can all be reminded of them. Also, we","messageBody":"<div id=\"ygrps-yiv-942449609\">All of you got these when you subscribed to the list, but once in a <br/>\nwhile I like to send them to the list so that we can all be reminded of <br/>\nthem. Also, we occasionally modify them, so they may not be quite the <br/>\nsame as when you first joined, so please do read them over. If you have <br/>\nquestions or comments, you can write directly to the list owners, but <br/>\nplease refrain from responding on the list itself. Thank you.<br/>\n<br/>\n****<br/>\nUnschoolingDiscussion Posting Policies<br/>\n<br/>\nPlease read carefully BEFORE posting on the list.<br/>\n<br/>\nIt is our sincere wish to provide a forum for those seeking to deepen <br/>\ntheir<br/>\nunderstanding of the unschooling philosophy. The primary purpose of this<br/>\nlist is to encourage the critical examination of ideas, beliefs and<br/>\nviewpoints.<br/>\n<br/>\nQuestioning of deeply-held ideas and beliefs can be very uncomfortable <br/>\nand<br/>\nsometimes responses to that process can stand in the way of people <br/>\ngetting<br/>\nwhat they need out of the list.<br/>\n<br/>\nTherefore, we offer the following to help our members get the<br/>\nmost from the list:<br/>\n<br/>\n1. We suggest that you read for at least a couple of weeks before <br/>\nposting. Spend that<br/>\ntime getting a &quot;feel&quot; for the list and its members. This will help you <br/>\ndecide if this list is worth<br/>\n  your time or whether some other list might be more useful to you in <br/>\nmeeting your needs.<br/>\n<br/>\n2 Expect your beliefs to be challenged. Welcome this as an opportunity <br/>\nto<br/>\ncritically examine your own ideas.<br/>\n<br/>\n3. When differences of opinion arise, stick to discussing ideas, not the<br/>\nperson with whom you are disagreeing.<br/>\n<br/>\n4. If you have a belief or practice that you don&#39;t want held up to <br/>\npublic<br/>\nexamination, don&#39;t post it to the list.<br/>\n<br/>\n5. Before you hit &quot;send,&quot; consider whether your post will contribute<br/>\npositively to the unschooling discussion or help people understand<br/>\nunschooling better. For example:<br/>\n<br/>\n    * Posts should add something to the discussion, not just say things <br/>\nlike,<br/>\n&quot;Me too,&quot; or &quot;Thank you.&quot;<br/>\n<br/>\n    * This list is international. State specific questions are best <br/>\nanswered<br/>\nelsewhere. (Try <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/\">http://www.unschooling.com/</a> click &quot;Message Boards&quot; then<br/>\n&quot;Across the Continent, Around the World&quot;.)<br/>\n<br/>\n    * This list&#39;s focus is learning through unschooling, not <br/>\nhomeschooling<br/>\npolitics. Discussions of legislative and legal issues can be found at<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nhen.org/forum\">http://www.nhen.org/forum</a>&gt;.<br/>\n<br/>\n    * List members should refrain from meta-discussion, that is, <br/>\ncommenting or<br/>\ncomplaining about a discussion instead of contributing to it. Examples <br/>\nof<br/>\nmeta-discussion are: &quot;This list is not very friendly.&quot; &quot;That response <br/>\nseemed<br/>\noverly defensive.&quot; &quot;Why do my posts get criticized and not others?&quot;<br/>\n<br/>\n<br/>\n6. Avoid using loaded terminology. For instance, &quot;If you have no TV<br/>\nrestrictions why don&#39;t your kids just watch TV all day?&quot; will get you <br/>\nmore<br/>\nuseful responses than, &quot;I don&#39;t see how your kids learn anything if all <br/>\nthey<br/>\never do is sit around like zombies watching unlimited TV.&quot;<br/>\n<br/>\n7. It is not useful to inform the list that you believe someone else is<br/>\nbeing rude or discourteous; please trust the rest of the list to <br/>\nrecognize<br/>\nrudeness for themselves. Saying, &quot;Jane was rude to me,&quot; just bogs down <br/>\nthe<br/>\nlist. It is also a waste of everyone&#39;s time when participants attempt to<br/>\ncorrect or improve other list members&#39; manners. It never works and <br/>\nalways<br/>\ndisrupts the list. Avoid<br/>\nstatements such as: &quot;Jane, here is my suggestion of how you could write <br/>\nmore<br/>\nnicely so people wouldn&#39;t think you are being rude.&quot;<br/>\n<br/>\n8. Our brains automatically supply a &quot;tone&quot; to posts as we read. It can <br/>\nbe<br/>\nhelpful to imagine your best friend speaking the words you are reading, <br/>\nin<br/>\nthe gentlest, most well-meaning tone you can imagine. It is <br/>\nunacceptable to<br/>\nattack the &quot;tone&quot; of the list or to make generalizations about it. &quot;I&#39;ve<br/>\nbeen on many other lists and this one is the rudest I&#39;ve seen,&quot; would be<br/>\nunacceptable. Instead, attempt to create a positive, helpful tone with <br/>\nyour<br/>\nown posts by setting the example you hope others will follow.<br/>\n<br/>\n9. Envision every post and response as a dish at a potluck dinner. You <br/>\nwon&#39;t<br/>\nlove every dish at a potluck any more than you will love every poster&#39;s<br/>\nstyle of help. But a dish/post may be exactly what someone else needs. <br/>\nIf<br/>\nyou don&#39;t like a certain list member&#39;s offerings, skip them and<br/>\nleave them for others.<br/>\n<br/>\n10. Read and write as clearly as you can. In casual conversation we <br/>\noften<br/>\ndon&#39;t realize how much we rely on others to fill in the gist of our<br/>\nconversation based on what they expect us to say. But here, without body<br/>\nlanguage or inflection, all we have to go on are your words and they <br/>\nshould<br/>\nsay what you mean. If you say, for example, you &quot;never&quot; do something, it<br/>\nshould not mean &quot;almost never.&quot;<br/>\n<br/>\n<br/>\nOur goal is to make the list as useful as possible for those seeking to<br/>\ndeepen their understanding of the unschooling philosophy. To do that, <br/>\nall<br/>\nnew list members are initially moderated to prevent spamming and catch <br/>\nposts<br/>\nthat could disrupt the list. People will also be moderated if they <br/>\ndisrupt<br/>\nthe usefulness of the list. Potentially disruptive posts will be <br/>\nreturned<br/>\nfor revision.<br/>\n<br/>\nIf you have questions, please write to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingdiscussion-owner@yahoogroups.com\">unschoolingdiscussion-owner@yahoogroups.com</a></div>","specialLinks":[]}],"prevTopicId":102566,"nextTopicId":102622}}