{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"school-at-home/school/unschooling","postDate":"1047146048","msgId":60425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0YS4xY2NjNzRiYS4yYjliODg0MEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":60424,"nextInTime":60426,"topicId":60425,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1730509683\">&lt;&lt;  From the <br/>\nbeginning, I thought that I would see such a difference in children who were <br/>\nhomeschooled from those that went to school. And even though I know <br/>\nhomeschooled doesn&#39;t always mean a great difference from being in school, I <br/>\nstill thought I would see the children behave differently. I don&#39;t and I <br/>\nmust say I&#39;m a bit surprised.  &gt;&gt;<br/>\n<br/>\nExtremely sheltered kids seem different, but sometimes they seem just <br/>\nextremely sheltered.<br/>\n<br/>\nI know two sheltering homeschooling families here.  One was La Leche League, <br/>\nbut the mom was blind and the oldest girl did most of the housework and <br/>\nchildcare, and the family was full of rules.  (I haven&#39;t been counting them <br/>\nin the four homeschooling families I knew, because they weren&#39;t in my <br/>\nbabysitting co-op, and I mostly knew the girl from her babysitting another <br/>\nfamily I know; they weren&#39;t homeschoolers.)    The girl married as a <br/>\nteenager.  She hadn&#39;t dated at all, as far as I could see, so it seems to me <br/>\n(I&#39;m not sure) that she found someone at church and married him as that was <br/>\nher only real escape from her house.  She was &quot;a good kid&quot; and things were <br/>\npeaceful at home as far as I ever knew, but marrying someone was her <br/>\n&quot;success.&quot;<br/>\n<br/>\nAnother family lives very rurally and they use correspondence school for <br/>\ntheir kids.  Other than the SCA (Society for Creative Anachronism) their kids <br/>\ndidn&#39;t have much &quot;educational exposure&quot; (not a good term, but good enough for <br/>\nthis story) because the parents figured the correspondence school would be <br/>\ntheir education.  Period.  So the kids are not very broadly exposed to <br/>\nthings.  The oldest married at 16 or 17 and moved to England.  The second is <br/>\nan irritating punk macho boy (Kirby says he&#39;s better lately, but I don&#39;t care <br/>\nenough to find out, personally).  The third lived for years babysitting for a <br/>\nvery schoolish family, but at least it got her away from the boring rural <br/>\ncorrespondence school life and around people who listened to musicals, read <br/>\nbooks, played games and talked.  Even though they badmouthed homeschooling.  <br/>\nAnd she&#39;s always had Kirby and Marty to lean toward or stand next to if <br/>\nanyone badmouthed homeschooling too much.<br/>\n<br/>\nBut neither of those stories involves unschooling families.  They both <br/>\ninvolve early marriage/escape.<br/>\n<br/>\nWhen people have tried to associate me with school-at-home families, I&#39;ve <br/>\nalways resisted, from the very beginning, when Kirby was five.  In person, I <br/>\nindicate with a drawing or an object &quot;Here is school.  On this side are the <br/>\nconservative homeschoolers who homeschool because they think school is <br/>\nteaching their children too much, and they want to shelter them.   Here (on <br/>\nthe opposite side of my &quot;school&quot;) we are, and other families who homeschool <br/>\nbecause they think school is too narrow and too limiting.  We want our kids <br/>\nto know MORE than school was going to teach them.  We think school is too <br/>\nlimiting.  They think school isn&#39;t limiting enough.  They&#39;re on the far other <br/>\nside of school from us.&quot;<br/>\n<br/>\nSince my homeschooling has always been based on Kirby himself (since he <br/>\nwasn&#39;t going to do well in a school situation when he was little) and on my <br/>\nphilosophies about how learning best works, I was never in it for the <br/>\npolitical-statement or social-statement reasons that would cause people to <br/>\nsay &quot;Homeschoolers need to all band together.&quot;<br/>\n<br/>\nI know that over the years I&#39;ve irritated people who were trying to <br/>\naccomplish political action of one sort or another, or to get a numbers-base. <br/>\n I didn&#39;t want to be counted with people whose kids are home because they <br/>\ndon&#39;t want them to meet people of other religions or beliefs, or they don&#39;t <br/>\nwant their kids being with people of other races or cultures, or they don&#39;t <br/>\nwant anyone suggesting to their children that homosexuality is anything <br/>\nexcept sinful depravity, and that maybe people are somehow related to apes <br/>\nand monkeys.   I don&#39;t want to help them homeschool.  I don&#39;t even really <br/>\nwant to help them preserve their right to isolate their children and lie to <br/>\nthem and make them read books which are fantasy-based or Bible-based <br/>\nreconstructed history and science.  I think it&#39;s stupid.   <br/>\n<br/>\nWhat they prove when their kids get good test scores is that one-on-one <br/>\nforced education works better than mass forced education.  I don&#39;t care to <br/>\ncontribute to the proving of that.  It makes me sick to think about those <br/>\npoor kids with noplace to go after &quot;school&quot; when school&#39;s at home.<br/>\n<br/>\nWhere their advantage does lie is that a child who is dorky or awkward, or <br/>\nhas a speech impediment, or is funny looking and who would have been chewed <br/>\nup and spit out at school can, by being homeschooled, be confident and calm, <br/>\nand that often shows in speech and movement.  I&#39;ve met a couple of young <br/>\nadolescent boys and I knew they were homeschooled right away, because even <br/>\nthough they were the kind of boys who would have had the gloss of shame and <br/>\nfear on them in school, they were bright-eyed and direct even though their <br/>\nclothes and haircuts were not nearly stylish, or would have been downright <br/>\nunacceptable in a school setting.<br/>\n<br/>\nSo preventing overt bully-damage and teacher-shame is the best I see those <br/>\nfamilies doing.<br/>\n<br/>\nThat, and if you LIKE that sort of thing, they&#39;re raising kids who are <br/>\nunaware of the diversity of the world around them.   As fantasy life goes, <br/>\nsome people DO like that.  And I think some new-age families end up doing the <br/>\nsame thing to an extent, if their kids are around pagans and wiccans and <br/>\ncelebrate the neo-pagan equinox and solstice holidays, and they aren&#39;t made <br/>\naware that in some parts of the country that could get them really shunned <br/>\nbigtime.  <br/>\n<br/>\nSandra, just rambling now, but onto something, maybe</div>","specialLinks":[]}],"prevTopicId":60379,"nextTopicId":60318}}