{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Was:Moms doing what they want.. Now: Understanding &quot;No interests of my own&quot;","postDate":"1051842602","msgId":67291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2OS4xZTAyMmUzMS4yYmUzMzIyYUBhb2wuY29tPg=="},"prevInTopic":67276,"nextInTopic":0,"prevInTime":67290,"nextInTime":67292,"topicId":67243,"numMessagesInTopic":0,"msgSnippet":"I really enjoyed reading about your families interests, Teresa, the bicycles and whip-performances and baby interest.  Holly *loves* babies too. You should","messageBody":"<div id=\"ygrps-yiv-1748136811\">I really enjoyed reading about your families&#39; interests, Teresa, the bicycles <br/>\nand whip-performances and baby interest.  Holly *loves* babies too.<br/>\n<br/>\nYou should post about those things more often.  It was really interesting.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Was:Moms doing what they want.. Now: Understanding &quot;No interests of my own&quot;","postDate":"1051839453","msgId":67276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2IwMWMzMTA0YiQ2NzdkZGZjMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDE3NS4xOWViZWE2NS4yYmUyZmEwMEBhb2wuY29tPg=="},"prevInTopic":67243,"nextInTopic":67291,"prevInTime":67275,"nextInTime":67277,"topicId":67243,"numMessagesInTopic":0,"msgSnippet":"From:  ","messageBody":"<div id=\"ygrps-yiv-1235016404\">From: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a>&gt;<br/>\n<br/>\n<br/>\n&lt;&lt; Mary,<br/>\n ( and I address to Mary, personally, because it this is in regards to her<br/>\n post)<br/>\n<br/>\n When you said&quot; I have no interests that are soley my own&quot;  Did you mean,<br/>\nthat<br/>\n you have no interests that you do not share with someone else in your<br/>\nfamily?<br/>\nIn other words, there are lots of things you like to do, but at least one<br/>\nother person in your family enjoys doing them too?   From what I tried to<br/>\nunderstand from your explanation of your comments, that was how I understood<br/>\nit.&gt;&gt;<br/>\n<br/>\n<br/>\nThat&#39;s exactly it. Plenty of interests and plenty of people here that at<br/>\nleast one shares them with me. Even my love of medical knowlege is shared<br/>\nwith my son Joseph. There hasn&#39;t been anything so far that someone here<br/>\ndoes&#39;t like to do or investigate right along with me. I&#39;m sure there will<br/>\ncome a time when that might happen, but so far no. And yes before children,<br/>\nit did happen!<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Was:Moms doing what they want.. Now: Understanding &quot;No interests of my own&quot;","postDate":"1051828224","msgId":67243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NS4xOWViZWE2NS4yYmUyZmEwMEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":67276,"prevInTime":67242,"nextInTime":67244,"topicId":67243,"numMessagesInTopic":0,"msgSnippet":"Mary, ( and I address to Mary, personally, because it this is in regards to her post) When you said I have no interests that are soley my own  Did you mean,","messageBody":"<div id=\"ygrps-yiv-845301077\">Mary,<br/>\n( and I address to Mary, personally, because it this is in regards to her <br/>\npost)<br/>\n<br/>\nWhen you said&quot; I have no interests that are soley my own&quot;  Did you mean, that <br/>\nyou have no interests that you do not share with someone else in your family? <br/>\n  In other words, there are lots of things you like to do, but at least one <br/>\nother person in your family enjoys doing them too?   From what I tried to <br/>\nunderstand from your explanation of your comments, that was how I understood <br/>\nit.  <br/>\n<br/>\nI know that is how it is in my family ( with me).   I tried to think and <br/>\nthink.. ( and, if we don&#39;t count &quot;alone stuff&quot; like reading, computer time, <br/>\netc) everything I like to do, at least one other person in my family enjoys <br/>\nit too.  Even with reading and puter stuff, we will discuss things, share <br/>\nthings we find interesting, recommend stuff that we thing each other will <br/>\nlike. I like to sew and do crafts.  My children learned right alongside of me <br/>\nas I &quot;done my thing&quot;.  Now, Anna likes to sew too and we do projectst <br/>\ntogether.  Same thing with cooking... Now my children will help me cook or   <br/>\ndo thier own &quot;projects&quot;   Pretty much everything I enjoy doing, my kids <br/>\njoined in with me and began to enjoy them too.  Of course, not every one of <br/>\nthem likes everything I do.. LOL., but there is usually at least one of them <br/>\nthat does.   <br/>\n<br/>\n When my children were younger, I did go out with the &quot;girls&quot; occasionally.  <br/>\nI still do, but now that Anna is older, she enjoys girls night out too, so <br/>\nshe goes along if she wants to.  If I want to go shopping, or to a movie, or <br/>\nout to eat, at least one of my children want to go along, and it&#39;s always <br/>\nlots of fun.  When they were younger, I needed more &quot;breaks&quot; from them.   <br/>\nJust going out shopping alone for an hour.  Maybe lunch with a friend.. Now, <br/>\nI don&#39;t need that because they are so much more independent.   <br/>\n<br/>\nIt&#39;s funny, when I think about it, there are very few interests that my <br/>\nfamily does not share.  Sure, we all have our &quot;special&quot; things.. things that <br/>\nwe like A LOT more than anyone else in the family, but still , on some level, <br/>\n we all share them.<br/>\n<br/>\n For instance, Landon is a sports cracker, or a whip enthusiast.  ( its a <br/>\nlong story). but, basically, he collects whips and he &quot;performs&quot; with them.  <br/>\n( no, no, not in the BDSM way.. lol)  Its a &quot;Western Performing Art&quot; .. also <br/>\nconsidered a Circus Art.   ANYWAY, he is wayyy into his whips.   No one else <br/>\nin our family does the whip thing, we can&#39;t crack em like he does.. lol, but <br/>\nwe do all really enjoy watching him do his routines.  We are enthusiastic <br/>\nabout his new whips and we will help him target practice or &quot;wrap&quot; us.<br/>\n<br/>\n My husband collects and restores vintage bicycles.    Sometimes it kind of <br/>\nbugs me   the amount of time he spends with those bikes. lol.. But, Ethan and <br/>\nJP really love those bikes too.  Ethan is learning how to restore the bikes <br/>\nand lots of mechanical stuff.   We always keep an eye out for bikes for DH to <br/>\nadd to his collection.  <br/>\n<br/>\nJP and Ethan like video games.  The rest of us really could care less about <br/>\nsitting down and playing games. But, we will watch them play, listen to thier <br/>\n&quot;stories&quot; about thier games, and help with technical stuff.    I look up <br/>\ncheat codes for them and take them to the &quot;game store&quot;.    JP plays baseball. <br/>\n  We go watch him practice, and we go to the games and cheer him on.   We <br/>\nplay with him at home and help him &quot;practice&quot;<br/>\n<br/>\n Anna loves babies and baby sitting.  Little babies are the about the least <br/>\nexciting thing to Ethan and JP..  But, they are so proud of thier sister and <br/>\nher &quot;jobs&quot;.  Ethan will help Anna babysit for her nieces and nephews just to <br/>\nhelp her out.<br/>\n<br/>\nSo, yeah, everybody has thier own interests ( except me. LOL..) But we all <br/>\nshare   them in some way. And there are LOTS AND LOTS more things that we all <br/>\nenjoy doing together: camping, riding bikes, going to the beach, going to the <br/>\nmovies, boating, hiking, amusement parks... Gosh, I know there is more.. but <br/>\nthats all I can think of right now.  <br/>\n<br/>\nSO, back to the original question.. lol.. about &quot;sole interests&quot;.  That was <br/>\nhow I interpretted Marys post.   I may be off base about what she meant.. <br/>\nBut, when I say, &quot; I don&#39;t have any interests that are solely my own&quot;   <br/>\n^^^^^^ all that up there is what I mean.  :-)<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":67284,"nextTopicId":67292}}