{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1050473,"authorName":"DDecoeur@aol.com","from":"DDecoeur@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Dog questions","postDate":"1035317709","msgId":47340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4OS5mZjhkNWEyLjJhZTcwYmNkQGFvbC5jb20+"},"prevInTopic":47313,"nextInTopic":0,"prevInTime":47339,"nextInTime":47341,"topicId":47313,"numMessagesInTopic":0,"msgSnippet":"I have raised puppies for Leader Dogs of America for several years.  If your plan is to donate them to a service group I would suggest calling a group in your","messageBody":"<div id=\"ygrps-yiv-205585581\">I have raised puppies for Leader Dogs of America for several years.  If your <br/>\nplan is to donate them to a service group I would suggest calling a group in <br/>\nyour state sooner then later. The most important lesson puppies for service <br/>\nneed to learn is socialization.  they need to be exposed to as many different <br/>\nsituations and people as possible.  Actually as a raiser they tell me this is <br/>\neven more important then basic training since they will recieve intense <br/>\ntraining when they are returned to the school.  As for training at home we <br/>\nspend several short sessions per day devoted to training, such as sit.  In <br/>\ntraining this from a young age we begin by saying sit (once only) then <br/>\nassisting the dog by placeing your hand on the rump and pressing gently down. <br/>\n Once the dog sits give lots of praise and remember to always stop a session <br/>\nwhen the dog has done something right.  After several days of repetion the <br/>\ndog usually starts to sit as soon as you say the word.  After sit is mastered <br/>\nmove on to the next command such as down.  Oh and try to remember down is for <br/>\nlaying down and off is the command for not jumping on things.  To teach down <br/>\nwe first have the dog do a sit then give the command down as you are saying <br/>\nthe word pull on the leash in a downward motion while sliding the dogs legs <br/>\nforward.  Soon you will not have to do either. <br/>\n<br/>\nAnother godd thing is to begin walkind with a leash as soon as the dog is <br/>\nconfortable with it always insisting on the dog staying in a heel position <br/>\nslightly in front of your toe.  And do not allow playing or rushing on leash. <br/>\n We use two seperate leashes one a long 16&#39; leash for play and a short 6&#39; for <br/>\nobiedence work.<br/>\n<br/>\n<br/>\nHopefully this helps with some of your questions, if you would like i could <br/>\ngo on with other techniques we have learned over the years.<br/>\n<br/>\nDorothy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":73238415,"authorName":"Julie Stauffer","from":"&quot;Julie Stauffer&quot; &lt;jnjstau@...&gt;","profile":"callingmoon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Dog questions","postDate":"1035310212","msgId":47313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTUwMWMyNzlmNiQ0ZDc0YTE0MCQ2ODgwZWU0MEBkZWZhdWx0Pg==","referencesHeader":"PDEwMzUyOTYxMjIuMTg4OC43NDI3My5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":47340,"prevInTime":47312,"nextInTime":47314,"topicId":47313,"numMessagesInTopic":0,"msgSnippet":"I have 2 puppies, courtesy of Dar s dog (kiss and hug to Nana) that are 13 weeks old.  They are half border collie.  I am attempting to teach them manners,","messageBody":"<div id=\"ygrps-yiv-797469912\">I have 2 puppies, courtesy of Dar&#39;s dog (kiss and hug to Nana) that are 13<br/>\nweeks old.  They are half border collie.  I am attempting to teach them<br/>\nmanners, etc., hoping a service dog organization will take them in a few<br/>\nmonths.  Here is the dilemma.  The farthest I have ever gotten in dog<br/>\ntraining is &quot;sit&quot;.  I have read lots of books but they all deal with a<br/>\nsingle dog.<br/>\n<br/>\nI have crate trained the pups in their own crates.  They have time to spend<br/>\nplaying just with each other and times they are in our half-acre pen with<br/>\nour adult dogs.  I have been trying to use a &quot;lead&quot; system, where the dog is<br/>\nattached to me on a 4-foot lead in the house or attached to a short lead in<br/>\ntheir &quot;settle down&quot; area.  We have lots of toys, bones, etc..<br/>\n<br/>\nI have been working with them one at a time.  Does this sound on track at<br/>\nall or could someone recommend a good book?  Just wanting to do what I can<br/>\nto try to help these pups find a more suitable home than our very pet-heavy<br/>\none.<br/>\n<br/>\nJulie--with 4 dogs, 6 goats, 30 chickens, 10 rabbits, 1 cat and 1 newborn<br/>\nrat</div>","specialLinks":[]}],"prevTopicId":47271,"nextTopicId":47265}}