{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Snow and then back here again","postDate":"1043725456","msgId":11956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMTI3LjIwNDQxNi4xNTMyLjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":11955,"nextInTime":11957,"topicId":11956,"numMessagesInTopic":0,"msgSnippet":"We finally got some snow here, we ve been waiting less than patiently. It started snowing Tuesday, cold and blowing and nasty and we just stayed inside and","messageBody":"<div id=\"ygrps-yiv-406107267\">We finally got some snow here, we&#39;ve been waiting less than patiently.  <br/>\nIt started snowing Tuesday, cold and blowing and nasty and we just stayed<br/>\ninside and watched movies all day.   Dylan likes the old monster movies<br/>\nwith special effects by Ray Harryhausen so we watched &quot;Jason and the<br/>\nArgonauts&quot;  &quot;The 7th Voyage of Sinbad&quot;  and &quot;Clash of the Titans.&quot;  <br/>\nWednesday was cold but not blowing so much and the snow was crisp and<br/>\npowdery and beautiful so we went snowshoeing, just Dylan and I, out along<br/>\nthe river.   We followed fox tracks and then found the fox, hunting along<br/>\na fence line.   He saw us but didn&#39;t seem to care at all.   We watched<br/>\nhim for about half an hour before we noticed we were getting cold just<br/>\nstanding there.   He was beautiful.   <br/>\nWe had corn with us, just in case we saw a duck or two.  Some crazy ducks<br/>\nstay the winter here and we spend our free time wondering if their big<br/>\nduck feet are being frozen into the river ice.   We like to go out and<br/>\nlisten to the ice moving along the river and we like to feed the brave<br/>\nducks who don&#39;t mind cold Montana winters.   There was a small group of<br/>\nseven Mallards and we tossed them corn while they swore at us and looked<br/>\nat us suspiciously, but after we moved away a bit they came and ate.   I<br/>\nlater read that Mallards prefer sugar donuts,  (who wouldn&#39;t?)  so that<br/>\nwas the reason for the swearing I suppose.<br/>\n<br/>\nThursday was much warmer and friends came over.   We built snowmen in the<br/>\nfront yard and had snow ball fights.   The big snowman looked a little<br/>\nlike Abe Lincoln, just by accident, and we were proud of our abilities<br/>\nbut while we were inside warming over hot chocolate and a game of Clue<br/>\n(which I lost) his head fell off.  (We found no evidence he&#39;d been shot) <br/>\nThe replacement head looked a little like our current president and<br/>\nlasted a little longer, too.   We made some repairs to his ears and nose<br/>\nyesterday, but by last night he was done for.   Dylan said it was a<br/>\nrandom act of sunlight violence.<br/>\n<br/>\nFriday we went sledding.   The snow was slick and fast and we crashed a<br/>\nlot but it was fun and I have the sore rump to prove it.    <br/>\n<br/>\nDylan&#39;s Dad was home on Saturday and we decided to make ice sculptures.  <br/>\nWe filled some rubber maid (sp) storage bins with water and left them out<br/>\nto freeze,  but it didn&#39;t stay cold enough and we didn&#39;t get ice.  We did<br/>\nmake a snow dragon, slithering along the ground and bumping up here and<br/>\nthere until we ran out of snow.   <br/>\n<br/>\nI have been badly beaten at Master Labyrinth and Survival or Extinction<br/>\ntoday.  <br/>\nWe went out to lunch and took a walk.  We made granola.  We made oatmeal<br/>\ncookies.  Dylan had a karate class and when he came home my brother was<br/>\nhere with the ultrasound pictures of his little human bean sprout.<br/>\nWe&#39;re going to watch &quot;Eight Legged Freaks&quot; tonight and I&#39;m so glad to<br/>\nhave such a cool kid to spend time with.  <br/>\n<br/>\nDeb L</div>","specialLinks":[]}],"prevTopicId":11813,"nextTopicId":11944}}