{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Our son not stopping","postDate":"1186123582","msgId":30174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2OENDQ0Y5NEQ4RjQ4ODg4NDk5NzdEMTA1REFGOTAzQFJvYnluUEM+","inReplyToHeader":"PGY4dWU3Nis3cTM2QGVHcm91cHMuY29tPg==","referencesHeader":"PGY4dWU3Nis3cTM2QGVHcm91cHMuY29tPg=="},"prevInTopic":30173,"nextInTopic":0,"prevInTime":30173,"nextInTime":30175,"topicId":30173,"numMessagesInTopic":0,"msgSnippet":"... This whole scenario sounds very familiar. I expect he is not stopping because he is not done connecting with his Dad. We found that Jayn at 6 was","messageBody":"<div id=\"ygrps-yiv-1198583129\">&lt;&lt;&lt;&lt; &gt; My son(almost 6yo.) has a hard time stopping play fighting and it<br/>\n<blockquote><span title=\"ireply\"> &gt; makes dh and papa mad. Dh plays with him like this, Lukas will punch<br/>\n&gt; and kick but when dh says: okay,that&#39;s enough then stop,Lukas will say<br/>\n&gt; NO and keep right on fighting &gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>This whole scenario sounds very familiar. I expect he is &quot;not stopping&quot; <br/>\nbecause he is not done connecting with his Dad.<br/>\n<br/>\nWe found that Jayn at 6 was aggressive in her play when she felt that she <br/>\nhadn&#39;t had enough of Daddy&#39;s attention. When this combined with not having <br/>\nhad much physical activity earlier in the day for whatever reason it go <br/>\nquite tough on dh. She really needed the physicality.<br/>\n<br/>\nIt helped my dh to realize that although Jayn seemed to be &quot;attacking&quot; him, <br/>\nshe really didn&#39;t have it in her to be calmly verbal about wanting his <br/>\nindivided focus. Once he accepted that Jayn really was trying to give him a <br/>\nmessage as best as *she* knew how in that moment, he was able to &quot;reply&quot; to <br/>\nthe real message instead of getting cross with her or endlessly trying to <br/>\nget her to change and ask for attention with words. That change in his label <br/>\nfor Jayn&#39;s action (from &quot;attack&quot; to &quot;trying to communicate&quot;) forstalled the <br/>\nnegative spiral.<br/>\n<br/>\nWe did several things about the &quot;not stopping&quot; issue. The big one was to <br/>\nkeep on focussing on her, and for dh not to withdraw his attention in an <br/>\noffended huff just when she needed him most. Sometimes he would change the <br/>\nphysicality to be more like holding her so that she could push against him, <br/>\nother times he would call me and we would both hold her - not punitively but <br/>\ngiving her pressure for big movements, and still be protecting ourselves <br/>\nfrom her disorganized flailing. She would become more organized and <br/>\ncontrolled and start directing our physical response eg &quot;now Daddy hold my <br/>\nshoulders, Mommy move my feet&quot; until it was much more smiling and we could <br/>\nfeel her body relax.<br/>\n<br/>\nThe other thing we did was purchase a punching post - inflatable with a <br/>\nwater filled base for stability - and some gloves. She enjoyed that for a <br/>\nwhile, and then slowly she let it go. Dh also continues to try and do <br/>\nphysical things with Jayn such as taking her to the park by himself with <br/>\nstomp rockets or other outdoor toys. Sometimes he coaches her to do some <br/>\ncalisthenics or sit ups while he counts, when she is willing and happy to do <br/>\nthat. She and I do swimming and yoga together, so our physical interaction <br/>\nis much more quiet and gentle. When Jayn swims with her father they have <br/>\nseveral diving games they play together, as well as vigorous tossing her <br/>\nover the water type games.<br/>\n<br/>\nJayn and dh had a special self devised board game that they used to play <br/>\ntogether, without me, a lot. It involved many tiny figures and a piece of <br/>\ncardboard with designs drawn on it - and I have no idea how it worked. But I <br/>\nthink it was just them being together alone that was the key.<br/>\n<br/>\nI would guess the repeated &quot;contrary&quot; behavior that Lukas is showing you is <br/>\nlikely a code for &quot;I want more of Daddy&#39;s attention&quot;. I would suggest <br/>\nputting the glasses aside and playing instead of repeating information that <br/>\nhe probably knows by now. His emotional need is overriding his intellectual <br/>\nknowledge. The beginning of the wrestling is like the floodgate opening - it <br/>\nis very hard to shut it against a rushing flow - but it will slow to a <br/>\ntrickle if your dh can just persevere in the game without becoming angry.<br/>\n<br/>\nIt might be helpful to have a list of physical games - like ball games, <br/>\nrunning in the hose outside, stomp rockets (we use a hoop as a distant <br/>\ntarget), climbing of some kind, jump rope, you will think of more - on hand <br/>\nfor your dh to suggest to Lukas at the first sign of restivness. Just <br/>\nsomething that they can do together. If Lukas likes jumping what about a <br/>\nsmall trampoline - your dh could hold his hand while Lukas jumps on it, or <br/>\nmake up some kind of game where he throws a bean bag or some soft thing to <br/>\nhim while he jumps - anything that keeps them connected even while Lukas <br/>\nexpends some of his excess energy.<br/>\n<br/>\nI have a suspicion that your next post is likely to include the idea that <br/>\nyour dh is tired after a long day of work and deserves to be able to relax <br/>\n;) ..... however I would like to suggest to you and him that using the <br/>\npositive energy of engaging in happy play has got to be less draining than <br/>\nthe habitual conflict, and may even be energizing. One other alternative is <br/>\nto have a lot more physical activity for Lukas during the day before Dad <br/>\ngets home, BUT then to have  ready and planned some quiet activities for the <br/>\npair of them to connect over. He has to make the mental committment to give <br/>\nhim that attention if he really expects Lukas to not be demanding it.<br/>\n<br/>\nIt really is astonishing how much more time our children really want from us <br/>\nthan we think they should!<br/>\n<br/>\nRobyn L. Coburn</div>","specialLinks":[]},{"userId":212831948,"authorName":"halfshadow1","from":"&quot;halfshadow1&quot; &lt;halfshadow1@...&gt;","profile":"halfshadow1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Our son not stopping","postDate":"1186118694","msgId":30173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4dWU3Nis3cTM2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":30174,"prevInTime":30172,"nextInTime":30174,"topicId":30173,"numMessagesInTopic":0,"msgSnippet":"My son(almost 6yo.) has a hard time stopping play fighting and it makes dh and papa mad. Dh plays with him like this, Lukas will punch and kick but when dh","messageBody":"<div id=\"ygrps-yiv-2003519386\">My son(almost 6yo.) has a hard time stopping play fighting and it<br/>\nmakes dh and papa mad. Dh plays with him like this, Lukas will punch<br/>\nand kick but when dh says: okay,that&#39;s enough then stop,Lukas will say<br/>\nNO and keep right on fighting until dh is very angry and keeps telling<br/>\nhim to stop to the point of holding him away from himself and taking<br/>\nhim away but Lukas just comes right back.I will hold Lukas away from<br/>\ndh and tell him to stop and he will say&quot;okay,i will&quot; but goes for him<br/>\nagain Then dh yells:do ya want a whipping?!<br/>\nI have told Lukas what it feels like to daddy when he doesn&#39;t stop, i<br/>\nhave said daddy loves playing with you but when he wants to stop,you<br/>\nneed to respect him. If dh yells Lukas runs crying to me and i have<br/>\nsaid..well,you don&#39;t listen.<br/>\nI know i can do better.When Lukas is playing with papa he will take<br/>\nhis eyeglasses even tho papa has told him not to and we told him that<br/>\npapa needs them to see. He justs laughs and grabs for them again. I<br/>\nwant and need more peace,lol<br/>\nLukas wants jump on dh&#39;s back or on him alot of times dh isn&#39;t into<br/>\nit.I do acknowledge Lukas&#39; feelings. I also have to think of dh and<br/>\ni&#39;m so sick of the stress.</div>","specialLinks":[]}],"prevTopicId":30172,"nextTopicId":30170}}