{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":141316284,"authorName":"psoroosh","from":"&quot;psoroosh&quot; &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Responsibility and chores","postDate":"1062381483","msgId":79629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJpdTkzYitmbG51QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMwODMxMjIzNi5oN1ZNYVhPQTAxNzExMkBtdGE3LnBsdG4xMy5wYmkubmV0Pg=="},"prevInTopic":79600,"nextInTopic":0,"prevInTime":79628,"nextInTime":79630,"topicId":79600,"numMessagesInTopic":0,"msgSnippet":"If they come to me in a week and say, We re sick of cleaning our room we ll figure out something else. When they get older if they want privacy or WANT to","messageBody":"<div id=\"ygrps-yiv-951655151\">If they come to me in a week and say, &quot;We&#39;re sick of cleaning our <br/>\nroom&quot;<br/>\nwe&#39;ll figure out something else. When they get older if they want <br/>\nprivacy or<br/>\nWANT to keep their rooms in 10 inches of clothing, well, it&#39;s their <br/>\nroom.&gt;&gt;<br/>\n<br/>\nI WANT my house to be spotless and orderly and everything always put <br/>\naway and all the surfaces cleaned off so I have plenty of room to do <br/>\nwhatever I want, etc.<br/>\n<br/>\nI apparently don&#39;t want it ENOUGH to make it happen, though.<br/>\n<br/>\n--pam</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"&quot;Pam Hartley&quot; &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Responsibility and chores","postDate":"1062369394","msgId":79600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODMxMjIzNi5oN1ZNYVhPQTAxNzExMkBtdGE3LnBsdG4xMy5wYmkubmV0Pg=="},"prevInTopic":0,"nextInTopic":79629,"prevInTime":79599,"nextInTime":79601,"topicId":79600,"numMessagesInTopic":0,"msgSnippet":"... Well, it s kind of a silly question if you think about it. :) What happens if you say instead, I could really use some help cleaning this living room, can","messageBody":"<div id=\"ygrps-yiv-1837558500\"><blockquote><span title=\"ireply\">&gt; Are you suggesting that I shouldn&#39;t even ASK them to help, either?  <br/>\n&gt; Even if they are free to say no?  Because I say, &quot;Would you like to<br/>\n&gt; help me by cleaning the cat box?  and they don&#39;t mind saying, &quot;No, I<br/>\n&gt; wouldn&#39;t like to.&quot;<br/>\n<br/>\n </span></blockquote>Well, it&#39;s kind of a silly question if you think about it. :)<br/>\n<br/>\nWhat happens if you say instead, &quot;I could really use some help cleaning this<br/>\nliving room, can one of you give me a hand when you get a moment? I&#39;d really<br/>\nappreciate it.&quot;<br/>\n<br/>\nIf you regularly ask in such a way and regularly don&#39;t receive any help, I&#39;d<br/>\nsay you need to get the family together for a talk about why they don&#39;t feel<br/>\nany desire to help you, and examine what you may be doing that causes them<br/>\nto NOT want to help, such as:<br/>\n<br/>\n1. Nagging<br/>\n2. Sighing in a put-upon fashion about the mess as you drag yourself<br/>\nmuttering through the clean-up<br/>\n3. Letting the mess go for awhile and then getting sick of it and leaping to<br/>\nyour feet to suddenly clean and expecting everyone else to leap, too<br/>\n<br/>\nand get it sorted out. Dr. Phil says, &quot;relationships are managed, not cured&quot;<br/>\nwhich means that talking these things out is an ongoing process, not a<br/>\none-off problem fixed forever.<br/>\n<br/>\nMy husband and I clean the downstairs of our house every morning. It doesn&#39;t<br/>\ntake long, we have a small house. &lt;g&gt; My daughters pick up their own room<br/>\nnow (this is new, like for the past week) every evening. This was by my<br/>\nrequest, made kindly with a reasonable explanation about my own busy<br/>\nschedule vs. falling all over toys in my quest to kiss them good night or<br/>\nclose their window. ;) I asked if they&#39;d be willing to do it, they were.<br/>\nThey asked if it got REALLY messy would I help. I assured them I would. I<br/>\nalso offered to organize their bins of toys by &quot;type&quot; once a week or so,<br/>\nwhich they thought was a good idea.<br/>\n<br/>\nI asked what was a good time of day, and they gave this some serious thought<br/>\nand came up with 7:30 p.m. I asked if I could remind them if they forgot,<br/>\nand they said yes. So about half the time they&#39;ve remembered and about half<br/>\nthe time I&#39;ve reminded them. One night they said, &quot;Okay, after this show&quot;<br/>\nand I said fine and it was fine. One night they may say, &quot;We&#39;re really<br/>\ntired&quot; and I will offer to help or do it entirely or find some other<br/>\nreasonable solution.<br/>\n<br/>\nIf they come to me in a week and say, &quot;We&#39;re sick of cleaning our room&quot;<br/>\nwe&#39;ll figure out something else. When they get older if they want privacy or<br/>\nWANT to keep their rooms in 10 inches of clothing, well, it&#39;s their room.<br/>\n<br/>\nWhat is said isn&#39;t as important as how it&#39;s said. Figuring out comfortable<br/>\nways to live with several other people is NOT always an easy matter. Turning<br/>\ninto a martyr or a dictator are both bad solutions to the problem. Figuring<br/>\nout ways to work together toward our individual and group goals, without me<br/>\nasserting that I&#39;m &quot;right&quot; and they&#39;re &quot;wrong&quot; because I like the house<br/>\nneater than my children do is a good starting point.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My older son is 18, when is this desire to help out supposed to kick<br/>\n&gt; in?<br/>\n<br/>\n </span></blockquote>I&#39;d expect these things depend on the child, the family, and the dynamics of<br/>\nthe relationship, as well as the child&#39;s own &quot;inner neatness&quot; barometer. I<br/>\nwas a rare slob until I had a house of my own, in spite of chore charts,<br/>\nrewards, punishments, etc.<br/>\n<br/>\nIf you help him with what he considers important TO HIM (i.e, helping him by<br/>\nwashing his socks doesn&#39;t count unless he&#39;s a sock fanatic who cannot<br/>\nachieve pristine whiteness on his own and is therefore truly grateful to<br/>\nyou) will cause him to want to help you with what is important TO YOU. Going<br/>\nout of your way to aid him in his pursuits is more likely to cause him to<br/>\nwant to go out of HIS way to aid you in yours, including cleaning the cat<br/>\nbox.<br/>\n<br/>\nKarma: What goes around comes around.<br/>\nThe Golden Rule: Do unto others as you would have them do unto you.<br/>\nPhysics: For every reaction there is an equal and opposite reaction.<br/>\n<br/>\nIt&#39;s all the same.<br/>\n<br/>\nPam</div>","specialLinks":[]}],"prevTopicId":79626,"nextTopicId":79630}}