{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":64,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peaceful Parenting & Principles","postDate":"1268569909","msgId":52038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4NTczMTJCLTE0MjQtNDQzNi1CQ0I4LTVFRThCRUJCMzEzOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhuaTJhbytlaXA0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuaTJhbytlaXA0QGVHcm91cHMuY29tPg=="},"prevInTopic":52037,"nextInTopic":52039,"prevInTime":52037,"nextInTime":52039,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... Rather than modeling generosity, be generous. Be generous because it feels good to do things that bring someone joy, not because you have ulterior motives","messageBody":"<div id=\"ygrps-yiv-858919252\">On Mar 14, 2010, at 3:13 AM, clara_bellar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I&#39;m trying to say is that I want to model generosity and  <br/>\n&gt; selflessness<br/>\n<br/>\n </span></blockquote>Rather than modeling generosity, be generous. Be generous because it  <br/>\nfeels good to do things that bring someone joy, not because you have  <br/>\nulterior motives for him to be generous. Live your values because  <br/>\nthey&#39;re important to you, not because you want him to have them too.<br/>\n<br/>\nIf you read that and feel you really meant being generous, the idea  <br/>\nof modeling principles is there resting in your head unexamined  <br/>\n(until now ;-). And because you wrote it hundreds of people absorbed  <br/>\nthe idea of modeling generosity. Why that&#39;s not helpful needs pointed  <br/>\nout to help others.<br/>\n<br/>\nAnd, unless someone&#39;s devoting their life to easing a problem that  <br/>\ncan&#39;t resolve itself, self-sacrifice isn&#39;t a great goal. Self- <br/>\nsacrifice tends to communicate &quot;Everyone is more important than I am.&quot;<br/>\n<br/>\nFor kids, who do need our help, helping them shouldn&#39;t be self- <br/>\nsacrifice. It should be a gift, something we&#39;ve chosen to do because  <br/>\nwe&#39;ve chosen to bring them into the world. He&#39;s young. He needs more  <br/>\nof your time than an older child will. Here&#39;s Sandra&#39;s scientific  <br/>\ngraph about that:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/howto/precisely\">http://sandradodd.com/howto/precisely</a><br/>\n<br/>\nBase your expectations of what you can do for yourself on what he&#39;s  <br/>\nshown he can handle, not on what you think he should be able to  <br/>\nhandle. Keep your expectations to absolute necessities. So when you  <br/>\ndo get some time to add to the necessities it will feel like a gift  <br/>\nto you :-) (That may make more sense when you&#39;ve absorbed some  <br/>\npractical examples.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - &quot;Need for cleanliness&quot;. Whenever I put something in the  <br/>\n&gt; dishwasher S wants to take all the dirty silverware and plates out  <br/>\n&gt; and put them on the floor. (This example would include &quot;need for  <br/>\n&gt; care for him and his safety&quot; when it comes to the dishes. If I try  <br/>\n&gt; to redirect and give him plastic or steel plates he says &quot;no&quot; and  <br/>\n&gt; insists on playing with the dirty, breakable ones.)<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>This won&#39;t last forever. He will eventually have explored it as far  <br/>\nas it can go. What about getting a set of plastic plates or cheap  <br/>\nceramics from Goodwill to use for now? You could probably find some  <br/>\nfor less than $10 which is about the price of a toy that might be  <br/>\nplayed with for the same amount of time. Maybe it&#39;s the sliminess  <br/>\nthat he wants to experience. Provide more opportunities to play with  <br/>\nmessy things. Jello is fun. Pudding is fun. My daughter loved playing  <br/>\nwith flour so I bought her a bag of cheap flour that was reused for  <br/>\nplay. Shaving cream! (That was one of the standard items in her  <br/>\nEaster basket.) (Playing in the tub makes clean up easy, though most  <br/>\nof the flour needs cleaned up or it might clog the drain!)<br/>\n<br/>\nI think one bit of confusion that people have with &quot;say yes more&quot; and  <br/>\nthe discussion of opening the world to them as much as possible is  <br/>\nthe new unschooler assumes the new rule is they can never say no.  <br/>\nIt&#39;s more helpful to think in terms of keeping the nos reserved for  <br/>\nthe most important things. No retains its importance. If a child  <br/>\nhears no 30 times a day, they&#39;ve heard it 10,000 times by the end of  <br/>\nthe year. Long before that, it&#39;s lost the meaning the mom wants it to  <br/>\nhave (eg, that&#39;s dangerous, hurtful, annoying, etc.) No by then means  <br/>\nto the child &quot;I don&#39;t care what you want.&quot;<br/>\n<br/>\nAre the dishes something you want to be one of your most important  <br/>\nthings? That&#39;s a question only you can decide.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I open my yoga mat to stretch a bit. He wants to nurse.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>This is another one of those that won&#39;t last forever. That seemed  <br/>\nlike a convenient time for you to exercise. But he still needs you  <br/>\nimmediate access to you. (A minute can feel like an hour at that  <br/>\nage.) A better time would be while he&#39;s napping.<br/>\n<br/>\nConventional parenting is a lot about making raising kids more  <br/>\nconvenient for the parent. But it helps to avoid resentment if we  <br/>\naccept that we&#39;ve chosen this time and kids *are* inconvenient. Being  <br/>\ninconvenienced is part of the package deal. We don&#39;t get to adjust  <br/>\ntheir dials or push their off switch. We have the child that we have.  <br/>\nAnd what we have will change with age. But it helps to see his needs  <br/>\nare his needs right now and this is the season you&#39;re in. There will  <br/>\nbe a new season coming along with new needs but you can&#39;t predict or  <br/>\nspeed up when it will come. (And hopefully that acceptance moves  <br/>\nthoughts away from kids being inconvenient! Kids aren&#39;t trying to  <br/>\nmake life more difficult. They require a lot of our time, especially  <br/>\nwhen they&#39;re young.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We had planned to stay at a friend&#39;s for diner after a play date,  <br/>\n&gt; but after an 1 h 1/2 visit, he said &quot;ciao ciao&quot; (which to him means  <br/>\n&gt; &quot;let&#39;s go&quot;) and when we didn&#39;t immediately leave repeated it  <br/>\n&gt; several times and started to cry.<br/>\n<br/>\n </span></blockquote>It seems like an hour and a half is his limit. Or he sensed dinner  <br/>\ncoming which he knows will tie up your time. Rather than trying to  <br/>\nchange him, recognize his current limits (they will change as he gets  <br/>\nolder) and change your expectations. Don&#39;t plan to do something that  <br/>\nhe&#39;s shown in the past he&#39;s not ready to handle. Build a bail plan  <br/>\ninto plans.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I hesitate: it&#39;s a cheap toy, $3, should I just let him have it?  <br/>\n&gt; But we need the floss<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Don&#39;t the stores have more floss? ;-) How many reels of floss can he  <br/>\ngo through before he&#39;s thoroughly explored it? Rewind it and  <br/>\ndesignate it as his so he can play with it.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I ask him, no pressure, I hold my arms out to him, and he says no  <br/>\n&gt; (vehemently.)<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>His actions were saying he wasn&#39;t done so your asking *was* pressure.<br/>\n<br/>\nThere isn&#39;t a rule for how to handle these. Each situation will be  <br/>\ndifferent.<br/>\n<br/>\nI&#39;d say a starving husband is a good reason to leave. You could ask  <br/>\nyour husband if he wouldn&#39;t mind eating something to tide him over  <br/>\nbut it&#39;s respectful of him to treat his needs as seriously as you&#39;re  <br/>\ntrying to treat your son&#39;s. Let your son know Daddy&#39;s hungry. Don&#39;t  <br/>\nexpect your son to care. But your caring about others needs will be  <br/>\nhuge -- immediately to your husband and long term to your son.<br/>\n<br/>\nIf you do need to go, it helps if you talk about the fun thing you&#39;re  <br/>\ngoing toward rather than. Give your son understanding and sympathy  <br/>\nfor his disappointment of having to give up something fun. Here&#39;s  <br/>\nsome ideas of how unschoolers have handled transitions that might  <br/>\nhelp you see the bigger picture:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/unschooling%20in%20action/transitions.html\">http://joyfullyrejoycing.com/unschooling%20in%20action/transitions.html</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We just got out of bed and haven&#39;t had Bfast. We nursed a few times  <br/>\n&gt; at night and also in the AM, so S is not hungry but I am. He wants  <br/>\n&gt; to go outside now. He says &quot;ciao ciao&quot;. I tell him we&#39;ll eat  <br/>\n&gt; something, I&#39;ll quickly shower and then we&#39;ll go. He starts banging  <br/>\n&gt; on the door and crying.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>This won&#39;t last forever ;-) Sorry to keep repeating it but it&#39;s no  <br/>\nless true! Conventional wisdom says that if you don&#39;t nip this self- <br/>\ncentered, the world needs to cater to my whims attitude of small  <br/>\nchildren that it will continue into adulthood. Conventional wisdom is  <br/>\nwrong. Right now his needs are large and his patience with waiting is  <br/>\nsmall. (Not to mention that time spent waiting seems 10 times as  <br/>\nlong.) His needs and lack of patience will be less intense as he gets  <br/>\nolder. (And if they don&#39;t, then reading the Explosive Child will  <br/>\nhelp! ;-)<br/>\n<br/>\nWhat will help his patience -- when he&#39;s developmentally ready to  <br/>\nhave it -- is confidence that his need is important and you are  <br/>\nworking on meeting it. When he&#39;s older and you say I can do that in 5  <br/>\nminutes, make sure it is 5 minutes, or if you put something off until  <br/>\nnext week *don&#39;t* do it with the expectation he&#39;ll forget. Make your  <br/>\nword mean something.<br/>\n<br/>\nDo the minimum amount you need to do for yourself in the simplest  <br/>\nway. Grab something to eat. Be playful! Instead of worrying and  <br/>\ngetting upset that he&#39;s upset that you need to go to the bathroom or  <br/>\nput on some clothes quickly, be sympathetic but also be playful and  <br/>\nfill that waiting time with happy distraction. If you&#39;d like a  <br/>\nshower, rather than asking him to accommodate you, ask if he&#39;d like  <br/>\nto play in the tub. Make it about what&#39;s in it for him. And expect  <br/>\nyour shower to be quick. (It will be a bonus if it&#39;s longer!) Or wait  <br/>\nuntil he&#39;s napping. (Though I think my daughter gave up naps at 18  <br/>\nmos so I know that&#39;s not time that can necessarily be counted on!) He  <br/>\n*will* have patience for a longer shower later. Right now you need  <br/>\npatience with the season he&#39;s living in.<br/>\n<br/>\nI think Playful Parenting by Lawrence Cohen might be the book with  <br/>\nideas about being more playful if that&#39;s something you have problems  <br/>\nwith.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":169332780,"authorName":"Natalie","from":"&quot;Natalie&quot; &lt;natalijoi@...&gt;","profile":"natalijoi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peaceful Parenting & Principles","postDate":"1268566276","msgId":52039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuaWhlNCtibm1lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuaTJhbytlaXA0QGVHcm91cHMuY29tPg=="},"prevInTopic":52038,"nextInTopic":52040,"prevInTime":52038,"nextInTime":52040,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"Hi, Clara, I m Natalie, ... This one I really empathize with, because my one year old is a percussionist :) she really loves to swing her arms, and to hit","messageBody":"<div id=\"ygrps-yiv-1869289756\">Hi, Clara, <br/>\n<br/>\nI&#39;m Natalie, <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&quot;Need for my own safety&quot;. <br/>\n<br/>\n </span></blockquote>This one I really empathize with, because my one year old is a percussionist :) she really loves to swing her arms, and to hit things, and be large, and loud with her movements. I know that she doesn&#39;t mean to hurt, but she does scratch, and hit, and it hurts.  <br/>\n<br/>\nFor a long time I was just sort of taking joy in it, if it was joyful to her, but, the first time she *really* bit me while nursing, and I said, &quot;Ow!&quot; because it hurt, I realized, well, yeah, if it hurts, it certainly doesn&#39;t impose upon them to say that it does. <br/>\n<br/>\nIn fact, that is exactly what they need to know. That *is* the natural consequence, is that I tell her, that hurts!<br/>\n<br/>\na bandaid, and a nursing necklace? When she scratches, I gently touch and move her hand, and sing, and rearrange, until we find the peace again.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Whenever I put something in the dishwasher S wants to take all the dirty silverware and plates out and put them on the floor.&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Load and unload the dishwasher while he&#39;s napping, occupied, etc. <br/>\nAlso, spend time in the kitchen with him, banging on pots and pans, transferring beans from one dish to the next with a spoon, rearranging the lower cupboards. Leave the dirty stuff for when he&#39;s not near. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&quot;Need for food&quot;. Visiting same friend. He&#39;s playing. After 1 h 1/2 visit diner is ready to be served. S tells me he wants to leave. When I tell him we&#39;ll have diner first, he cries. He was totally fine minutes ago.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Did he need to sleep, or be held? Was it time for him to eat? I would pick him up and comfort him, and let him know about the food we have, offer him some, but not from across the room. I find that the littles really need the constant contact, especially while communicating about something distressing to them. When they are preverbal, instead of asking questions about how I can help, I just try meeting different needs until I find the right one. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I open my yoga mat to stretch a bit. He wants to nurse. We nurse. He&#39;s off for more fun. We&#39;re in the same room. I try child&#39;s pose again. He comes back to the mat and asks for my attention. We hug for a while, we talk. I tell him I&#39;d love to stretch a bit. He asks to nurse. Then climbs on me. He finally goes off again. As soon as I try a pose again he&#39;s back and leans on me and stops me from doing it.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Can you get a mom & baby yoga dvd and learn to do them with him? Or like, mini partner yoga, or, circus yoga? (circus yoga is *really cool*) Also, if you are wearing him a lot, switch up your carries, and your carriers. Between my husband and I, we have a wrap, a Mei Tie, and 3 pouches, and we use all of them, almost every day. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; - &quot;Need for personal hygiene&quot; and &quot;need for not wasting stuff&quot;. S grabs the floss, wants to take it all out. I tell him I&#39;ll hold it w/him and show him how it works. He wants to hold it alone. He wants to take it all out. I hesitate: it&#39;s a cheap toy, $3, should I just let him have it? But we need the floss... and maybe he&#39;ll grab the shampoo next and will take it all out... I&#39;m confused with what to do.<br/>\n </span></blockquote>&lt;&lt;&lt; <br/>\n<br/>\nI buy the flossers shaped like crocodiles. Honey has her own toothbrush, also, but still likes to take mine. I just find it when she drops it. I try to introduce her to what is fun, and good at this age. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; &gt; - &quot;Need for food, rest and warmth for myself and my son&quot;. We&#39;re leaving Whole Foods, S was sitting in a regular cart, as I&#39;m about to put him in the car seat, he points to something excitedly and resists my putting him in the car. I ask him &quot;what did you see?&quot; He points again to something very far. I notice the little cars carts....&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Start with the car carts next time! With my sons, who are 11 and 7, I already anticipate and offer the things I know they like at any given place. We start with what they like at the grocery store, go there fed, rested, and anticipating the things they enjoy about the place. With the littles, keeping it brief is the most important thing, after fed and rested, of course. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; (A similar thing happened after shopping at WF another night. It wasn&#39;t the cars trolleys, it was the laundry place next door. S wanted to explore it, he&#39;d never seen one before, it was fascinating. We spent quite some time in there even though DH (who was w/us) was starving and wanting to go. In that situation their needs conflicted and I prioritized S&#39;s need to explore for a long time, then unsuccessfully tried to redirect and when we finally told him we had to put him back on the bicycle seat he cried a bit. How do we decide how much time is enough time? I&#39;d love to let him stay there as much as he wants but what if he simply keeps not wanting to leave?)&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Really sounds like you need to do the shopping at another time that&#39;s better for you and DH. Earlier in the day, and shop more often, twice a week for half the amount of stuff, then you can go play at the laundry without being tired and hungry.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;But then, why is my need for cleanliness & food more important than his need to be outside? How do I choose?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>You really don&#39;t have to choose. Can you wait to take that shower? (can you bathe at night instead?) If you really can&#39;t, then bring him along with some fun tub stuff, give him a piece of fruit he likes while you grab a bite, do it together. Let him know you are on the way outside, and make it easier to wait. I often find myself over explaining things to Honey, and the focus stays on the thing that&#39;s hard for her. I like to find how we can both go along together, and that makes it so smooth.</div>","specialLinks":[]},{"userId":366686190,"authorName":"clara_bellar","from":"&quot;clara_bellar&quot; &lt;claramont@...&gt;","profile":"clara_bellar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peaceful Parenting & Principles","postDate":"1268550808","msgId":52037,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuaTJhbytlaXA0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNGQTMxOTM3LTAyMTUtNDM1Ri04QjNDLUE0QTk3QzE2Njg3OUB2ZXJpem9uLm5ldD4="},"prevInTopic":52027,"nextInTopic":52038,"prevInTime":52036,"nextInTime":52038,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote: ***I think being generous and flexible and respectful of your son s need to explore could, if you think of it from a different angle, be found to","messageBody":"<div id=\"ygrps-yiv-70697936\">Sandra wrote:<br/>\n***I think being generous and flexible and respectful of your son&#39;s need to explore could, if you think of it from a different angle, be found to meet needs of yours  you didn&#39;t even know you had.***<br/>\n<br/>\nMe:<br/>\nThank you, I&#39;m loving this perspective. I&#39;ve already noticed it to be true. I used to be in a hurry all the time. Living at my son&#39;s rhythm is meeting so many needs I didn&#39;t know I had and is so very fulfilling.<br/>\n<br/>\nJoyce wrote:<br/>\n*** We shouldn&#39;t act as though we have no needs, but we should be taking responsibility for meeting them.***<br/>\n<br/>\nMe:<br/>\nOk. What I&#39;m trying to say is that I want to model generosity and selflessness, but do not want to model not taking care of oneself and sacrificing for others, which I don&#39;t think is healthy... Hence my confusion here. Taking responsibility for meeting our needs makes sense. But what to do when those needs conflict with others&#39; is where is gets so confusing.<br/>\n<br/>\nSandra wrote:<br/>\n***What kinds of needs are you picturing when you write that?  What are you ignoring?***<br/>\n<br/>\nand <br/>\n<br/>\nJoyce wrote:<br/>\n*** If you have some real examples, we might be able to explain it better.***<br/>\n<br/>\nMe:<br/>\nOk! <br/>\n<br/>\n- &quot;Need for my own safety&quot;. I have a big beauty spot on the breast, and S likes to put his finger on it when he&#39;s nursing on that side. I never really paid attention, until one day his nail scratched it and it bled. So, I try to keep his nails very short (though they grow so damn fast and he only lets me cut them when he&#39;s fast asleep!) but even with short nails it&#39;s a bit scary. I try to put my finger on it when he nurses on this side but he likes to push my hand away so he can play with the beauty spot (He pushes it like a button!) I guess it&#39;s still sensitive from when it bled. When his nails hurt me, I tell him and try to move his finger away. He groans and cries and fights me to put it back. I &quot;have to&quot; let him.<br/>\n<br/>\n- &quot;Need for cleanliness&quot;.  Whenever I put something in the dishwasher S wants to take all the dirty silverware and plates out and put them on the floor. (This example would include &quot;need for care for him and his safety&quot; when it comes to the dishes. If I try to redirect and give him plastic or steel plates he says &quot;no&quot; and insists on playing with the dirty, breakable ones.)<br/>\n<br/>\n- &quot;Need for exercise&quot;. My husband has been out of town for work a lot, my back hurts with all the nursing and carrying baby alone all the time. We visit S&#39;s godmother who has an older son S adores. I bring some new toys and books, food. We nurse. All is well, he&#39;s having fun. I open my yoga mat to stretch a bit. He wants to nurse. We nurse. He&#39;s off for more fun. We&#39;re in the same room. I try child&#39;s pose again. He comes back to the mat and asks for my attention. We hug for a while, we talk. I tell him I&#39;d love to stretch a bit. He asks to nurse. Then climbs on me. He finally goes off again. As soon as I try a pose again he&#39;s back and leans on me and stops me from doing it. Whenever I try he cries. I could have chosen to go to the other room and close the door, but S&#39;s need seemed to be closeness and connection so I would never do that in such a context. <br/>\n<br/>\n- &quot;Need for food&quot;. Visiting same friend. He&#39;s playing. After 1 h 1/2 visit diner is ready to be served. S tells me he wants to leave. When I tell him we&#39;ll have diner first, he cries. He was totally fine minutes ago. I try redirecting and almost fail. My last idea works: the little boy plays the piano for us, S&#39;s now happy to stay. If it hadn&#39;t been for the piano, we would have left. I would not have had diner w/him crying. The same thing happened elsewhere this week. We had planned to stay at a friend&#39;s for diner after a play date, but after an 1 h 1/2 visit, he said &quot;ciao ciao&quot; (which to him means &quot;let&#39;s go&quot;) and when we didn&#39;t immediately leave repeated it several times and started to cry. We left very abruptly, he was happy once we left.<br/>\n<br/>\n- &quot;Need for personal hygiene&quot; and &quot;need for not wasting stuff&quot;. S grabs the floss, wants to take it all out. I tell him I&#39;ll hold it w/him and show him how it works. He wants to hold it alone. He wants to take it all out. I hesitate: it&#39;s a cheap toy, $3, should I just let him have it? But we need the floss... and maybe he&#39;ll grab the shampoo next and will take it all out... I&#39;m confused with what to do.<br/>\n<br/>\n- &quot;Need for food, rest and warmth for myself and my son&quot;. We&#39;re leaving Whole Foods, S was sitting in a regular cart, as I&#39;m about to put him in the car seat, he points to something excitedly and resists my putting him in the car. I ask him &quot;what did you see?&quot; He points again to something very far. I notice the little cars carts. He really wants to check them out. I decide that even though it&#39;s late,  chilly and we&#39;re hungry, we have no reason to rush, nobody&#39;s waiting for us, so we go there. He goes and sits inside one, plays in there for a few minutes. I ask him if he&#39;s ready to leave, he says no. He crawls inside the next car cart. Every few minutes I ask him, no pressure, I hold my arms out to him, and he says no (vehemently.) I second guess myself, am I being generous, flexible and respectful of his need to explore, or am I raising him to be a tyrant. I choose to wait till he&#39;s done. And finally, something else distracts him. A huge motorcycle arrives and parks next to our car. I take the opportunity as he lets me take him in my arms and we go check it out, then transition smoothly to the car.<br/>\n(A similar thing happened after shopping at WF another night. It wasn&#39;t the cars trolleys, it was the laundry place next door. S wanted to explore it, he&#39;d never seen one before, it was fascinating. We spent quite some time in there even though DH (who was w/us) was starving and wanting to go. In that situation their needs conflicted and I prioritized S&#39;s need to explore for a long time, then unsuccessfully tried to redirect and when we finally told him we had to put him back on the bicycle seat he cried a bit. How do we decide how much time is enough time? I&#39;d love to let him stay there as much as he wants but what if he simply keeps not wanting to leave?)<br/>\n<br/>\n- &quot;Need for cleanliness and food&quot;. It&#39;s 7.45 AM  and we&#39;re supposed to leave at 9.15 to go to a play date. S woke up earlier than usual and I&#39;m barely awake. We just got out of bed and haven&#39;t had Bfast. We nursed a few times at night and also in the AM, so S is not hungry but I am. He wants to go outside now. He says  &quot;ciao ciao&quot;. I tell him we&#39;ll eat something, I&#39;ll quickly shower and then we&#39;ll go. He starts banging on the door and crying. <br/>\nMy usual response is OK, fair enough, we live in an apt, you have a need to be outside and to explore, let&#39;s go for a walk. So I go down to the street in my PJs, grab some fruit if something&#39;s on the counter and off we go. Then if he doesn&#39;t want to come back up, I let him explore and be happy. Where it gets confusing is whether it would be more of a service to him in the long term for him to be made aware (now at 20 mo, or later) that other people have needs too (which *others* would definitely call &quot;be given limits&quot;), and to not necessarily go out when he wants to. But then, why is my need for cleanliness & food more important than his need to be outside? How do I choose? Or do I &quot;compromise&quot; and have a quick snack and an express shower? But that means he&#39;s crying while I&#39;m doing it. (I&#39;ve been told by well meaning friends that I need to look at my tolerance level for my child&#39;s feelings - I was given an article called the Right to be Unhappy.)<br/>\n<br/>\nI hope this is not too many examples! I didn&#39;t know which ones would be most helpful.<br/>\n<br/>\nGratefully,<br/>\nClara</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peaceful Parenting & Principles","postDate":"1268528391","msgId":52027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGQTMxOTM3LTAyMTUtNDM1Ri04QjNDLUE0QTk3QzE2Njg3OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhuaDRvdCs3Z2c4QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuaDRvdCs3Z2c4QGVHcm91cHMuY29tPg=="},"prevInTopic":52024,"nextInTopic":52037,"prevInTime":52026,"nextInTime":52028,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... I ve said -- in the context of encouraging people to shift their viewpoint -- that it s not helpful to suppress feelings, like anger at a child s actions.","messageBody":"<div id=\"ygrps-yiv-1116609927\">On Mar 13, 2010, at 5:49 PM, clara_bellar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also read here that it&#39;s not helpful to suppress or ignore our  <br/>\n&gt; own needs.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ve said -- in the context of encouraging people to shift their  <br/>\nviewpoint -- that it&#39;s not helpful to suppress feelings, like anger  <br/>\nat a child&#39;s actions. It&#39;s better to shift a point of view so the  <br/>\nparent sees the child&#39;s actions in a positive light so anger doesn&#39;t  <br/>\nget triggered.<br/>\n<br/>\nAnd I&#39;ve said it&#39;s adults&#39; responsibility to find someway to take  <br/>\ncare of their needs without taking from their children. For instance,  <br/>\nif a mom needs alone time, it&#39;s better to wake up early than to carve  <br/>\nthe time out of the evening by making the kids go to bed without  <br/>\nregard to whether they&#39;re sleepy at a time convenient for the mother.<br/>\n<br/>\nIf someone&#39;s idea of not suppressing means telling kids what you  <br/>\nneed, that&#39;s not necessarily good. It depends on the situation. We  <br/>\nshouldn&#39;t act as though we have no needs, but we should be taking  <br/>\nresponsibility for meeting them.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; lovingly guide him towards an option that&#39;s taking my needs and my  <br/>\n&gt; principles in consideration.<br/>\n<br/>\n </span></blockquote>That sounds like trickery. You don&#39;t need to get him to agree to meet  <br/>\nyour needs. You&#39;re the one making the arrangements. You can build  <br/>\nmeeting your needs into the plans.<br/>\n<br/>\nIf you have some real examples, we might be able to explain it better.<br/>\n<br/>\nIf Kathryn needs to go somewhere right now and I need to go to the  <br/>\nbathroom first, I wouldn&#39;t lovingly guide her to accept that ;-) It&#39;s  <br/>\njust a given I need to go.<br/>\n<br/>\nIf I&#39;m hungry (and she isn&#39;t) I do need to eat but, as someone with  <br/>\ngreater powers of manipulating the world, I don&#39;t need to eat a hot  <br/>\nmeal at home. I can grab something. I can get something after we&#39;re  <br/>\ndone. She can suggest some other idea. But it&#39;s up to me to make sure  <br/>\nmy needs are met someway, somehow.<br/>\n<br/>\nIf we&#39;re picking up something she&#39;s excited about using at home, say  <br/>\na video game for instance, and I need to go to the grocery store, I  <br/>\ncould ask her to if she wouldn&#39;t mind waiting a few more minutes  <br/>\nwhile I shop. But if she&#39;s really excited, I&#39;d drop her off and go  <br/>\nback out. It all depends. But my needs are my responsibility, not hers.<br/>\n<br/>\nDoes that help?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peaceful Parenting & Principles","postDate":"1268521903","msgId":52024,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0MTRERTUyLUYzQ0MtNDJGRS05MTNFLUFGREFBMzQyODJDMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhuaDRvdCs3Z2c4QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuaDRvdCs3Z2c4QGVHcm91cHMuY29tPg=="},"prevInTopic":52023,"nextInTopic":52027,"prevInTime":52023,"nextInTime":52025,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"-=- I m in the process of figuring out how to find a balance, since my tendency is to want to be generous and flexible with my son at all times, to be","messageBody":"<div id=\"ygrps-yiv-1306883194\">-=- I&#39;m in the process of figuring out how to find a balance, since my  <br/>\ntendency is to want to be generous and flexible with my son at all  <br/>\ntimes, to be respectful of his need to explore, at the cost of  <br/>\nignoring my needs. -=-<br/>\n<br/>\nWhat kinds of needs are you picturing when you write that?  What are  <br/>\nyou ignoring?<br/>\nI think being generous and flexible and respectful of your son&#39;s need  <br/>\nto explore could, if you think of it from a different angle, be found  <br/>\nto meet needs of yours  you didn&#39;t even know you had.<br/>\n<br/>\n<br/>\n-=-I also read here that it&#39;s not helpful to suppress or ignore our  <br/>\nown needs.-=-<br/>\n<br/>\nAre you sure it was here?<br/>\nI&#39;m not saying &quot;it is helpful to suppress or ignore your own needs.&quot;   <br/>\nWhat I&#39;m saying is that it&#39;s not helpful to think of normal life as  <br/>\nbeing a suppression of one&#39;s own needs.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":366686190,"authorName":"clara_bellar","from":"&quot;clara_bellar&quot; &lt;claramont@...&gt;","profile":"clara_bellar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peaceful Parenting & Principles","postDate":"1268520541","msgId":52023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuaDRvdCs3Z2c4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuZ29sbStkZWZxQGVHcm91cHMuY29tPg=="},"prevInTopic":52022,"nextInTopic":52024,"prevInTime":52022,"nextInTime":52024,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"Joanna wrote: *** I looked for my book so that I could quote the passage about silent NVC, and not using scripted language with children, but I couldn t find","messageBody":"<div id=\"ygrps-yiv-906834811\">Joanna wrote:<br/>\n***&gt; I looked for my book so that I could quote the passage about silent NVC, and not using scripted language with children, but I couldn&#39;t find it.  Oh well.***<br/>\n<br/>\nMe:<br/>\nI&#39;ve only read a third of Rosenberg&#39;s book but he definitely mentions that NVC is about empathy and that you can give empathy and go through the whole motion (what is the person feeling, what are their needs & request) w/out using words. Which would seem more appropriate w/children.<br/>\n<br/>\nSandra wrote:<br/>\n***&gt; &gt; It frustrates me because it sends parents down a trail of rules and  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; assumptions that don&#39;t help unschooling, and that don&#39;t foster a  <br/>\n&gt; &gt; close, honest, compassionate relationship between a parent and child,  <br/>\n&gt; &gt; although it wears the guise of doing that.***<br/>\n<br/>\n </span></blockquote>Me:<br/>\nI get it. Too scripted, a little manipulative sometimes. As I haven&#39;t yet ever had a conflict or a real challenge with my son, the main reason I looked at NVC was to learn ways to communicate with my husband in an emotionally intelligent way. We&#39;ve been together for 11 years and still, I loose my temper with him. We push each others&#39; buttons so fast. Before being parents, it was unpleasant enough. Now, with a little one taking everything in, I know it is my responsibility to model respectful communication. I thought NVC may be helpful. I would love any other recommendations since I now understand that NVC may be too contrived most of the time.<br/>\n<br/>\nI also wanted to say that Joyce&#39;s post (the first one of hers in this thread) was tremendously helpful in understanding principles better. And I appreciate Sandra and everybody clarifying how overwhelming our children with our needs is not helpful. I&#39;m in the process of figuring out how to find a balance, since my tendency is to want to be generous and flexible with my son at all times, to be respectful of his need to explore, at the cost of ignoring my needs. I also read here that it&#39;s not helpful to suppress or ignore our own needs. What I understand I&#39;m been told is trying to meet both needs w/out intellectualizing about my needs with a child, to just lovingly guide him towards an option that&#39;s taking my needs and my principles in consideration. <br/>\n<br/>\nClara</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peaceful Parenting & Principles","postDate":"1268518976","msgId":52022,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOUMxMDQwLjUwMTA1MDBAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDQ2RDZDMzA3LTQ5QUItNDlDQS1CMzA4LUQ3OURDNzE2ODZCREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhuZmRsOSsyNnA4QGVHcm91cHMuY29tPiA8NDZENkMzMDctNDlBQi00OUNBLUIzMDgtRDc5REM3MTY4NkJEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":52017,"nextInTopic":52023,"prevInTime":52021,"nextInTime":52023,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... And it moves people into the direction of standardization, rather than individuation. -pam","messageBody":"<div id=\"ygrps-yiv-973075574\">On 3/13/2010 7:25 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; It frustrates me because it sends parents down a trail of rules and<br/>\n&gt; assumptions that don&#39;t help unschooling, and that don&#39;t foster a<br/>\n&gt; close, honest, compassionate relationship between a parent and child,<br/>\n&gt; although it wears the guise of doing that.<br/>\n<br/>\n </span></blockquote>And it moves people into the direction of standardization, rather than <br/>\nindividuation.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peaceful Parenting & Principles","postDate":"1268513434","msgId":52017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4MDBBNTFGLUVDRDItNEI3Ni04RjY0LTFBOTEwMjU0MzkzOUBTYW5kcmFEb2RkLmNvbT4=","inReplyToHeader":"PEMyMTY1MDcwLTNEMUQtNDdGRC1CNzJBLThDMDhBMjkwQjVCRkBzdXBlbm4uY29tPg==","referencesHeader":"PGhuZmRsOSsyNnA4QGVHcm91cHMuY29tPiA8NUVGMkY3RUItNDcxOC00NkE2LUI1ODQtNEExNTkzMDQ1N0NBQHZlcml6b24ubmV0PiA8QzIxNjUwNzAtM0QxRC00N0ZELUI3MkEtOEMwOEEyOTBCNUJGQHN1cGVubi5jb20+"},"prevInTopic":52016,"nextInTopic":52022,"prevInTime":52016,"nextInTime":52018,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"-=-I ve worked hard to make sure he knows that yes and no are both OK options.=- When kids are young and one child is outnumbered and there s no one to ","messageBody":"<div id=\"ygrps-yiv-1193231190\">-=-I&#39;ve worked hard to make sure he knows that &quot;yes&quot; and &quot;no&quot; are both  <br/>\nOK options.=-<br/>\n<br/>\nWhen kids are young and one child is outnumbered and there&#39;s no one to  <br/>\nleave him with, sometimes &quot;no&quot; isn&#39;t as ok an option as yes.     <br/>\nSometimes the mom doesn&#39;t have much choice but to use her best  <br/>\npersuasion and sweetness and promises, and as the kids get older  <br/>\nthey&#39;ll understand that if you can give them an option, you do.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peaceful Parenting & Principles","postDate":"1268508150","msgId":52007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZ29sbStkZWZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2RDZDMzA3LTQ5QUItNDlDQS1CMzA4LUQ3OURDNzE2ODZCREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":52005,"nextInTopic":52016,"prevInTime":52006,"nextInTime":52008,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... Yesterday I became a little frustrated when I asked for help and my daughter wasn t willing to give it.  Usually I don t have so many expectations when I","messageBody":"<div id=\"ygrps-yiv-1535325434\"><blockquote><span title=\"ireply\">&gt; It frustrates me because it sends parents down a trail of rules and  <br/>\n&gt; assumptions that don&#39;t help unschooling, and that don&#39;t foster a  <br/>\n&gt; close, honest, compassionate relationship between a parent and child,  <br/>\n&gt; although it wears the guise of doing that.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n </span></blockquote>Yesterday I became a little frustrated when I asked for help and my daughter wasn&#39;t willing to give it.  Usually I don&#39;t have so many expectations when I ask her, but at that moment I did.  But rather than say any more and make things worse, I just got quiet, and she got quiet and went to her room to be on her computer. <br/>\n<br/>\nAfter a few minutes she sought me out--sooner than I would have thought either one of us would be ready for re-connection, and started joking with me.  I knew that that was her way of...I won&#39;t say apologizing, &#39;cause she didn&#39;t, and wasn&#39;t a requirement of that situation.  But it was also her way of saying that she didn&#39;t require it of me either.  We just had a moment, and the moment was past.  No one needed to talk about needs.  No one needed to examine anything--it was a sweet, flowy way to reconnect, and I thought very mature on her part.  No script needed.  Words would have brought the whole thing down, as a matter of fact, and I didn&#39;t need to spend time thinking about my needs. <br/>\n<br/>\nAnd then she jumped up to help her Dad when he asked me for help with something.  It was very nice of her.<br/>\n<br/>\nI looked for my book so that I could quote the passage about silent NVC, and not using scripted language with children, but I couldn&#39;t find it.  Oh well.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":432657691,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;naturewalkersinfo@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peaceful Parenting & Principles","postDate":"1268507055","msgId":52016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZ25qZitocDdkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlFMUI2QjA4LUJCRDYtNEVEQS05OUE2LUUwNEYwM0EwMDQzNUB2ZXJpem9uLm5ldD4="},"prevInTopic":52007,"nextInTopic":52017,"prevInTime":52015,"nextInTime":52017,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... So NVC isn t meant to deepen relationships. It s meant to get two groups to work together without needing to be friendly with each other. -------- Yes. I","messageBody":"<div id=\"ygrps-yiv-1912088649\">-----&quot;Wasn&#39;t NVC developed for two hostile groups to work towards an agreement? The foundation of the method is the assumption they don&#39;t  want to be nice to each other, don&#39;t want to give up anything to the other, don&#39;t even need to like each other by the end.&quot;.....And.....<br/>\n&quot;So NVC isn&#39;t meant to deepen relationships. It&#39;s meant to get two  <br/>\ngroups to work together without needing to be friendly with each other.&quot;--------<br/>\n<br/>\nYes. I think so.  I&#39;ve seen NVC work really, really well--with Palestinian and Israeli teens in dialogue.  The last metaphor I&#39;d chose for my family dynamic is that of Israel and Palestine!<br/>\n<br/>\nThe desired &quot;end result&quot; was for both to end with a feeling a &quot;fairness.&quot;<br/>\n<br/>\nI think this is another way, besides the insincere, scripted nature of NVC, that gets in the way of unschooling.<br/>\n<br/>\nIf &quot;Fairness&quot; is my desired result, I&#39;m forgetting my foundational desire to create a home for my child that is: loving, free and safe.<br/>\n<br/>\nWanting/needing &quot;fairness&quot; gets in the way of this, for me, because it allows me to stay stuck in a position of victim--yes, I realize this is a strong word, but that is what it feels like when:<br/>\n<br/>\nI&#39;ve just cleaned the house.  Within a half an hour, there are toys all over the floor.<br/>\n<br/>\nI have a choice.  I can talk to my daughter about my needs and wants--I can try to get to the to the &quot;fair&quot; result--she helps clean up the toys and promise to care about all the hard work I do--or--I can clean up the toys or be grateful she&#39;s so happily playing! As soon as I let go of needing/wanting things to be &quot;fair,&quot; I can be a nice mom.  <br/>\n<br/>\n------It&#39;s assumed parents will bend their needs a lot more than  <br/>\nkids since we have greater power to meet our own needs and kids need  our help----<br/>\n<br/>\nExactly.</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peaceful Parenting & Principles","postDate":"1268502993","msgId":52005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyMTY1MDcwLTNEMUQtNDdGRC1CNzJBLThDMDhBMjkwQjVCRkBzdXBlbm4uY29tPg==","inReplyToHeader":"PDVFRjJGN0VCLTQ3MTgtNDZBNi1CNTg0LTRBMTU5MzA0NTdDQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGhuZmRsOSsyNnA4QGVHcm91cHMuY29tPiA8NUVGMkY3RUItNDcxOC00NkE2LUI1ODQtNEExNTkzMDQ1N0NBQHZlcml6b24ubmV0Pg=="},"prevInTopic":52004,"nextInTopic":52007,"prevInTime":52004,"nextInTime":52006,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... I do say this to Eric sometimes. Because he is more of a homebody than the other kids, and because switching gears can be hard for him, he sometimes ends","messageBody":"<div id=\"ygrps-yiv-1785067797\">On Mar 13, 2010, at 9:48 AM, Joyce Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Would you be willing ...?<br/>\n<br/>\n </span></blockquote>I do say this to Eric sometimes. Because he is more of a homebody than the other kids, and because switching gears can be hard for him, he sometimes ends up being pushed to do something he&#39;d rather not. I&#39;ll say things like, &quot;Would you be willing to go with us to park day if we stop for milkshakes on the way home?&quot; or, &quot;Would you be willing to do this because Carl and Yehva really want to, even though it&#39;s not your first choice?&quot;<br/>\n<br/>\nTo my  mind, in this context, &quot;would you be willing&quot; acknowledges that he&#39;s being asked to do something he doesn&#39;t necessarily want to do. Sometimes it comes after I&#39;ve asked if he wants to do something. OK, he doesn&#39;t want to, but he still might be willing. Sometimes I&#39;ll say, &quot;Are you able to come along without being resentful?&quot; because sometimes in the past he has said OK but carried such a little dark cloud along with him that nobody can have a good time, and if that&#39;s going to happen, we&#39;re better off staying home.<br/>\n<br/>\nI&#39;ve worked hard to make sure he knows that &quot;yes&quot; and &quot;no&quot; are both OK options. And to try not to be judgmental about his yes or no, or even about the dark cloud--because sometimes a person can do something cheerfully even if it wasn&#39;t what they wanted, and sometimes they can do it but not cheerfully, and sometimes they just can&#39;t do it at all. (I have some friends I love dearly but it makes me wince whenever I see they&#39;ve made a morning checklist for their son that includes &quot;be cheerful&quot; and &quot;good attitude.&quot; Because from my own experience, sometimes you can make me do something, or I&#39;ll do it because I know it needs to be done, but I&#39;ll be damned if you can DEMAND I be cheerful while I do it. There are things you can do to help me be cheerful, maybe--but posting a to-do list for me on the fridge probably isn&#39;t one of them!)<br/>\n<br/>\nAlso, when I ask him this, I really am looking for the information: I want to know his state of willingness and flexibility, and if there&#39;s anything I could do that would help him. I&#39;m not trying to _make_ him agree to go out, even if I am hoping he will, if that makes sense. <br/>\n<br/>\nI think that sometime in the misty past I&#39;ve read the book these quotes came from, but I don&#39;t remember it well enough to comment specifically. I do know that when I have read various &quot;more peaceful parenting&quot; books, very often the goal is still to get a certain behavior from the children--changing how you talk to your kids is presented as a more effective way to get them to do what you want, rather than as a way to improve the relationship, or show your respect for them, or help them better know themselves, or, as I see Sandra said while I was writing this, just straightforwardly get information from them.<br/>\n<br/>\nSu, mom to Eric 8; Carl, almost 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peaceful Parenting & Principles","postDate":"1268494482","msgId":52004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3QTc5NEU2LUJEMDgtNDE1RC05MEJDLTE1NDIxRjVFMzUzMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDVFRjJGN0VCLTQ3MTgtNDZBNi1CNTg0LTRBMTU5MzA0NTdDQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGhuZmRsOSsyNnA4QGVHcm91cHMuY29tPiA8NUVGMkY3RUItNDcxOC00NkE2LUI1ODQtNEExNTkzMDQ1N0NBQHZlcml6b24ubmV0Pg=="},"prevInTopic":52003,"nextInTopic":52005,"prevInTime":52003,"nextInTime":52005,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"-=- Would you be willing ...? -=-I remember someone using that on Sandra on the list last year. (And that *is* how it felt: using it on .) It was pretty much","messageBody":"<div id=\"ygrps-yiv-1133437240\">-=-&gt; Would you be willing ...?<br/>\n-=-I remember someone using that on Sandra on the list last year. (And<br/>\nthat *is* how it felt: &quot;using it on&quot;.) It was pretty much her asking<br/>\nSandra if she&#39;d be willing to change who she is and how she runs the<br/>\nlist so the new person could get what she wanted from the list.-=-<br/>\n<br/>\nYes, it was creepy.  And any answer like &quot;No, I&#39;m going to keep doing  <br/>\nwhat I&#39;m doing&quot; gets me branded violent, in that NVC &#39;game.&#39;  I  <br/>\nstarted to say &quot;culture,&quot; but it&#39;s not a culture.  It&#39;s a longterm  <br/>\ngame, where people compete to be the &quot;most non-violent.&quot;  And because  <br/>\nwords alone are not violence under any circumstances, even dire  <br/>\nthreats of violence are not themselves violence, it bends and misuses  <br/>\nEnglish, which bends and cripples logic, clarity and thought.<br/>\n<br/>\nI&#39;ll be glad when people get tired of it.  Unfortunately, if a family  <br/>\nhas used it for years and it&#39;s all the kids heard, those kids might  <br/>\nhave a hard time communicating in dictionary English with normal  <br/>\npeople.  Or they&#39;ll find themselves pissed off and resentful that  <br/>\ntheir friends and relatives are &quot;violent communicators&quot; when their  <br/>\nfriends and neighbors never were playing the same game.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peaceful Parenting & Principles","postDate":"1268493922","msgId":52003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2RDZDMzA3LTQ5QUItNDlDQS1CMzA4LUQ3OURDNzE2ODZCREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhuZmRsOSsyNnA4QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuZmRsOSsyNnA4QGVHcm91cHMuY29tPg=="},"prevInTopic":52002,"nextInTopic":52004,"prevInTime":52002,"nextInTime":52004,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"Below the line is a quote from another post.  I still think it s scripted and false, and condescending. At our house, our kids KNOW we try to find solutions","messageBody":"<div id=\"ygrps-yiv-394221888\">Below the line is a quote from another post.  I still think it&#39;s  <br/>\nscripted and false, and condescending.<br/>\n<br/>\nAt our house, our kids KNOW we try to find solutions that work for  <br/>\neveryone.  They know we&#39;re happy because we express joy by things like  <br/>\nsmiling, touching them, saying &quot;thanks!&quot; or &quot;this is cool!&quot; in a  <br/>\nsincere way.<br/>\n<br/>\nWhen we&#39;re sad they know because we&#39;re not acting happy, and they&#39;re  <br/>\nperceptive humans who also want to try to find solutions that work for  <br/>\neveryone.<br/>\n<br/>\nIn regular English our or family, &quot;I&#39;m wondering what you need right  <br/>\nnow&quot; would be rude, but &quot;Is there anything I can do to help?&quot; would be  <br/>\nnormal and direct.<br/>\n<br/>\n&quot;Please help me understand what you have in mind&quot; is weird.  It&#39;s  <br/>\nlong.  It&#39;s impersonal.  My kids let me know what they have in mind  <br/>\nall the time, and if I don&#39;t understand I ask honest, direct, cogent  <br/>\nquestions based on what I understand up to that point.  Holly is home  <br/>\nthis morning.  I thought maybe she was going to stay out all night.   <br/>\nShe has something to do today at noon.  When she wakes up, I&#39;ll ask  <br/>\nher straight-out questions, based on knowledge of her.  If I were to  <br/>\nsay ANYthing like &quot;Please help me understand what you have in mind,&quot;  <br/>\nit would be as though I didn&#39;t know her.<br/>\n<br/>\n&quot;Some examples of Power-With Parenting expressions&quot; means &quot;a script.&quot;   <br/>\nIt means there are these &quot;expressions&quot; you might choose from.<br/>\n<br/>\nIt frustrates me because it sends parents down a trail of rules and  <br/>\nassumptions that don&#39;t help unschooling, and that don&#39;t foster a  <br/>\nclose, honest, compassionate relationship between a parent and child,  <br/>\nalthough it wears the guise of doing that.<br/>\n<br/>\nSandra<br/>\n<br/>\n----------------------------------------------------------------------------------<br/>\n<br/>\nMarshall Rosenberg writes a foreward to this book - Respectful  <br/>\nParents, Respectful Kids. In the book, it has some examples of Power- <br/>\nWith Parenting expressions:<br/>\n<br/>\nI&#39;d like us to find a solution that works for everyone.<br/>\n<br/>\nI&#39;m happy when we work together.<br/>\n<br/>\nI feel sad when one of us is left out of decisions.<br/>\n<br/>\nI&#39;d like to hear how this sounds to you.<br/>\n<br/>\nI&#39;m wondering what you need right now.<br/>\n<br/>\nWould you be willing ...?<br/>\n<br/>\nPlease help me understand what you have in mind.<br/>\n<br/>\nI wonder what your thoughts are when you hear that.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peaceful Parenting & Principles","postDate":"1268491734","msgId":52002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVFRjJGN0VCLTQ3MTgtNDZBNi1CNTg0LTRBMTU5MzA0NTdDQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhuZmRsOSsyNnA4QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuZmRsOSsyNnA4QGVHcm91cHMuY29tPg=="},"prevInTopic":51999,"nextInTopic":52003,"prevInTime":52001,"nextInTime":52003,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... If someone can t feel how these feel to someone who isn t NVC, they re not going to be able to change them to sound less scripted. Probably if two NVC","messageBody":"<div id=\"ygrps-yiv-1929131630\">On Mar 13, 2010, at 2:08 AM, mkangj wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d like us to find a solution that works for everyone.<br/>\n&gt;<br/>\n&gt; I&#39;m happy when we work together.<br/>\n&gt;<br/>\n&gt; I feel sad when one of us is left out of decisions.<br/>\n<br/>\n </span></blockquote>If someone can&#39;t feel how these feel to someone who isn&#39;t NVC,  <br/>\nthey&#39;re not going to be able to change them to sound less scripted.<br/>\n<br/>\nProbably if two NVC people are working together, they know the dance  <br/>\nthey&#39;ve mutually agreed to do together: (Are the two opposing sides  <br/>\nwho are brought in to talk together coached on how the process will  <br/>\ngo?) &quot;Here&#39;s what I want/feel. Now you tell me what you want/feel.&quot;  <br/>\nBut without that common understanding, some of them feel kind of  <br/>\ncreepy. (I assume the two opposing sides who are brought in to talk  <br/>\ntogether are coached on how the process will go.)<br/>\n<br/>\nUnless &quot;I&#39;m happy when we work together,&quot; is a spontaneous  <br/>\nrealization it states the obvious. I&#39;d be wondering why someone was  <br/>\ntelling me that. What&#39;s their ulterior motive?<br/>\n<br/>\n&quot;I feel sad when one of us is left out of decisions,&quot; feels  <br/>\nemotionally manipulative. To me it feels like &quot;You need to change so  <br/>\nI don&#39;t have these feelings.&quot;<br/>\n<br/>\nRegardless of the *intent* of NVC communication, the other person can  <br/>\nonly react to their perception of the NVC person&#39;s intent.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d like to hear how this sounds to you.<br/>\n<br/>\n<br/>\n </span></blockquote>&quot;How does this sound&quot; can feel like putting someone on the spot but I  <br/>\nthink a gentle tone and a relationship where the child trusts the  <br/>\nparent would convey an openness to hearing other points of view  <br/>\nbetter than preceding it with &quot;I&#39;d like to hear.&quot; Building a  <br/>\nrelationship of trust is part of radical unschooling so it doesn&#39;t  <br/>\nneed stated. If NVC works in families because it&#39;s part of the home  <br/>\nenvironment for everyone to cooperate in this game, how does it  <br/>\ntranslate to adult skills? I think it would be better to talk to kids  <br/>\nas they&#39;d be talking to non-NVC people so they can absorb real world  <br/>\nskills. (Though it is a problem if parents don&#39;t have those skills  <br/>\nthemselves!)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m wondering what you need right now.<br/>\n&gt;<br/>\n&gt; Would you be willing ...?<br/>\n<br/>\n<br/>\n </span></blockquote>I remember someone using that on Sandra on the list last year. (And  <br/>\nthat *is* how it felt: &quot;using it on&quot;.) It was pretty much her asking  <br/>\nSandra if she&#39;d be willing to change who she is and how she runs the  <br/>\nlist so the new person could get what she wanted from the list.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Please help me understand what you have in mind.<br/>\n&gt;<br/>\n&gt; I wonder what your thoughts are when you hear that.<br/>\n<br/>\n<br/>\n </span></blockquote>I suspect the director of religious education at our church has done  <br/>\nsome NVC. I&#39;ll hear some of these odd ways of interacting with the  <br/>\nkids. It&#39;s like she&#39;s overly aware of the distance between them and  <br/>\nis trying to insert preconstructed bridges between them to substitute  <br/>\nfor a real relationship that they don&#39;t have the time or opportunity  <br/>\nto build. She&#39;s a very nice woman with a good heart, but Kathryn says  <br/>\nit feels like she&#39;s being talked down to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As opposed to Power-Over Parenting expressions:<br/>\n&gt;<br/>\n&gt; I want you to do this right now. If you don&#39;t ...<br/>\n&gt;<br/>\n&gt; Don&#39;t make me ask you again!<br/>\n&gt;<br/>\n&gt; You just have to do what you&#39;re told.<br/>\n&gt;<br/>\n&gt; No back talk from you!<br/>\n&gt;<br/>\n&gt; I know you want to play but you have to ...<br/>\n&gt;<br/>\n&gt; How many times do I have to tell you?<br/>\n<br/>\n<br/>\n </span></blockquote>But NVC or &quot;power-over&quot; parenting aren&#39;t the only two choices! I hope  <br/>\npeople can pick up ways to honestly communicate their desire to meet  <br/>\ntheir kids&#39; needs on this list that aren&#39;t either of those two!<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268478243","msgId":51997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5N0QzNTE4LTUxRUItNEY2OS1BQzVFLUZBNDI5QTI0OUVBQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDNhOTNmZmYxMTAwMzEyMTU0Mnk3ZmNlZDkyZG9jY2ExOGY4MjQ2MTY1Mzc3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPiA8M2E5M2ZmZjExMDAzMTIxNTQyeTdmY2VkOTJkb2NjYTE4ZjgyNDYxNjUzNzdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":51995,"nextInTopic":51998,"prevInTime":51996,"nextInTime":51998,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... The same thing happened between me and Kathryn when she was a toddler. It seemed reasonable to get her to learn that if she spilled something it was her","messageBody":"<div id=\"ygrps-yiv-317423532\">On Mar 12, 2010, at 6:42 PM, k wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I<br/>\n&gt; realized that even tho he was still in the process of learning what  <br/>\n&gt; those<br/>\n&gt; words meant, he could use them himself, and that&#39;s what he was really<br/>\n&gt; getting out of whatever it was I was trying to convey, and what I  <br/>\n&gt; was trying<br/>\n&gt; to convey is not what he was getting.<br/>\n<br/>\n </span></blockquote>The same thing happened between me and Kathryn when she was a  <br/>\ntoddler. It seemed reasonable to get her to learn that if she spilled  <br/>\nsomething it was her responsibility to clean it up. But when I  <br/>\nspilled something and she said &quot;It&#39;s your mess, you need to clean it  <br/>\nup,&quot; I heard how mean that sounded! I&#39;d much rather have heard &quot;Let&#39;s  <br/>\nget that cleaned up!&quot; and if I wanted to hear that, that&#39;s what I  <br/>\nneeded to say.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268477973","msgId":51998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFMUI2QjA4LUJCRDYtNEVEQS05OUE2LUUwNEYwM0EwMDQzNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDgyRTU5OUY0LUU3MjEtNDVDOC04RDJGLUE3RUE3NDVFNkY3N0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPiA8Rjc0OUI5NDUtNjRCNi00RkQwLTlDNDctMDk5MzNBNzUyMjkyQHN1cGVubi5jb20+IDxDQjBDRUMzNi1EMjE5LTRDOTUtQkY0RS1GOTU0RDUxRTNDMUNAdmVyaXpvbi5uZXQ+IDwxNzRkZjlkYzEwMDMxMjA3MzduMThmODcyYzlzMTZhMTQyNzFhYTYxZWEzMUBtYWlsLmdtYWlsLmNvbT4gPDgyRTU5OUY0LUU3MjEtNDVDOC04RDJGLUE3RUE3NDVFNkY3N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51997,"nextInTopic":51999,"prevInTime":51997,"nextInTime":51999,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... Wasn t NVC developed for two hostile groups to work towards an agreement? The foundation of the method is the assumption they don t want to be nice to each","messageBody":"<div id=\"ygrps-yiv-891121185\">On Mar 12, 2010, at 11:37 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If people are trying to find ways to just live without fighting, NVC<br/>\n&gt; might be good.<br/>\n<br/>\n </span></blockquote>Wasn&#39;t NVC developed for two hostile groups to work towards an  <br/>\nagreement? The foundation of the method is the assumption they don&#39;t  <br/>\nwant to be nice to each other, don&#39;t want to give up anything to the  <br/>\nother, don&#39;t even need to like each other by the end. They may end up  <br/>\nwith a better understanding of each other in addition to their  <br/>\nsolution, but that&#39;s not the goal.<br/>\n<br/>\nSo NVC isn&#39;t meant to deepen relationships. It&#39;s meant to get two  <br/>\ngroups to work together without needing to be friendly with each other.<br/>\n<br/>\nThe parenting aspect of radical unschooling is built on the  <br/>\nassumption kids like each other, don&#39;t want to hurt each other, don&#39;t  <br/>\nmind helping the other out as long as each gets their needs met in  <br/>\nsome way. It&#39;s assumed parents will bend their needs a lot more than  <br/>\nkids since we have greater power to meet our own needs and kids need  <br/>\nour help. That&#39;s probably why NVC has an awkward feel when applied to  <br/>\nfamilies.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":245404397,"authorName":"mkangj","from":"&quot;mkangj&quot; &lt;mkangj@...&gt;","profile":"mkangj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peaceful Parenting & Principles","postDate":"1268464105","msgId":51999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZmRsOSsyNnA4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuZjhvYys0dmRAZUdyb3Vwcy5jb20+"},"prevInTopic":51998,"nextInTopic":52002,"prevInTime":51998,"nextInTime":52000,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... Marshall Rosenberg writes a foreward to this book - Respectful Parents, Respectful Kids. In the book, it has some examples of Power-With Parenting","messageBody":"<div id=\"ygrps-yiv-149536571\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; I want to point out that Marshall Rosenberg himself doesn&#39;t recommend trying to use the NVC script with children.<br/>\n<br/>\n </span></blockquote>Marshall Rosenberg writes a foreward to this book - Respectful Parents, Respectful Kids. In the book, it has some examples of Power-With Parenting expressions: <br/>\n<br/>\nI&#39;d like us to find a solution that works for everyone.<br/>\n<br/>\nI&#39;m happy when we work together.<br/>\n<br/>\nI feel sad when one of us is left out of decisions.<br/>\n<br/>\nI&#39;d like to hear how this sounds to you.<br/>\n<br/>\nI&#39;m wondering what you need right now.<br/>\n<br/>\nWould you be willing ...?<br/>\n<br/>\nPlease help me understand what you have in mind.<br/>\n<br/>\nI wonder what your thoughts are when you hear that.<br/>\n<br/>\nAs opposed to Power-Over Parenting expressions:<br/>\n<br/>\nI want you to do this right now. If you don&#39;t ...<br/>\n<br/>\nDon&#39;t make me ask you again!<br/>\n<br/>\nYou just have to do what you&#39;re told.<br/>\n<br/>\nNo back talk from you!<br/>\n<br/>\nI know you want to play but you have to ...<br/>\n<br/>\nHow many times do I have to tell you?<br/>\n<br/>\nAll the best,<br/>\n<br/>\nM.J.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mjmiaoren.wordpress.com/\">http://mjmiaoren.wordpress.com/</a> - Traveling Natural Momma Blog<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/NaturalParentingLA/\">http://groups.yahoo.com/group/NaturalParentingLA/</a> - Natural Parenting LA</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peaceful Parenting & Principles","postDate":"1268459084","msgId":51995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZjhvYys0dmRAZUdyb3Vwcy5jb20+","inReplyToHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg=="},"prevInTopic":51991,"nextInTopic":51997,"prevInTime":51994,"nextInTime":51996,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"Or at that age is it better to use NVC and needs, as in explaining my need not to waste food or stain the carpet? I want to point out that Marshall Rosenberg","messageBody":"<div id=\"ygrps-yiv-571748558\">Or at that age is it better to use NVC and needs, as in explaining my need not to waste food or stain the carpet?<br/>\n<br/>\nI want to point out that Marshall Rosenberg himself doesn&#39;t recommend trying to use the NVC script with children.  I&#39;ve noticed that most NVC parents can&#39;t help themselves, though.  :-)  I think it&#39;s really worth considering what the process would mean and look like if you weren&#39;t &quot;NVCing&quot; anybody with all the &quot;right&quot; words--because one is supposed to be able to use the process silently with ANYONE.  Done well, it&#39;s an internal process of self-awareness--not just a set of words in a script.  <br/>\n<br/>\nIt might boil down to one simple question--but it&#39;s not going to look like you trying to explain some complicated set of needs to a little kid.  I think it&#39;s overwhelming for kids to be so conscious of their parents needs all the time.  Like Sandra said, I think it is an artificial layer between parents and children.<br/>\n<br/>\nSave all the words for the adults around you that are also trying to learn NVC--they&#39;ll appreciate your efforts.  &lt;g&gt;<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268437377","msgId":51991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMTAwMzEyMTU0Mnk3ZmNlZDkyZG9jY2ExOGY4MjQ2MTY1Mzc3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg==","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg=="},"prevInTopic":51989,"nextInTopic":51995,"prevInTime":51990,"nextInTime":51992,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... we try not to break things...*** so I am wondering, could we try not to loose food be a principle? Or at that age is it better to use NVC and needs, as","messageBody":"<div id=\"ygrps-yiv-1464327294\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;At <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a> , Cat says: ***if the principle is that<br/>\n </span></blockquote>we try not to break things...*** so I am wondering, could &quot;we try not to<br/>\nloose food&quot; be a principle? Or at that age is it better to use NVC and<br/>\nneeds, as in explaining my need not to waste food or stain the carpet?&lt;&lt;&lt;<br/>\n<br/>\nPrinciples as lived by the parents are obvious models to be imitated by the<br/>\nchild.  Words are not the things to children that they are to most adults<br/>\n(and to many adults they&#39;re not the things they are to others).  Actions and<br/>\nwords treated as actions are easily seen by the child as something to copy<br/>\nand to try out for oneself.<br/>\n<br/>\nI had an eye opening moment with Karl when he was a toddler because he told<br/>\nme something (I don&#39;t remember what it was... sorry) using the exact same<br/>\nwords and body language one of his parents had used (probably me ;).  I<br/>\nrealized that even tho he was still in the process of learning what those<br/>\nwords meant, he could use them himself, and that&#39;s what he was really<br/>\ngetting out of whatever it was I was trying to convey, and what I was trying<br/>\nto convey is not what he was getting.<br/>\n<br/>\nLive your principles. Eventually what you value will become more and more<br/>\nobvious as the child grows in awareness.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Mar 11, 2010 at 6:26 PM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:claramont@...\">claramont@...</a>&gt; wrote:<br/>\n<br/>\n&gt; My husband and I just listened to the Parenting Peacefully files. It was<br/>\n&gt; very helpful, thank you, Sandra, for making them available. I have a<br/>\n&gt; question re. Principles. Sandra says that if it hadn&#39;t been for her hot<br/>\n&gt; flashes, she wouldn&#39;t have gone down and told the boys to be quiet. The hot<br/>\n&gt; flashes were waking her, not the noise. Now, would it be against the<br/>\n&gt; unschooling philosophy to ask them to be quiet because others in the house<br/>\n&gt; are asleep? If they didn&#39;t wake her, they could be waking others. Can<br/>\n&gt; &quot;respect other family members&#39; needs&quot; or  &quot;respect other family members&#39;<br/>\n&gt; need for rest&quot; be a principle? Or would the principle be simpler, like<br/>\n&gt; &quot;respect&quot;?<br/>\n&gt;<br/>\n&gt; Which brings me to another question. On the tape, Richard Prystowsky<br/>\n&gt; mentions Non Violent Communication. In NVC you would talk to your child<br/>\n&gt; about feelings and needs. There seems to be a lot in common between honoring<br/>\n&gt; others&#39; needs and principles. I&#39;m wondering if I&#39;m on the right path? There<br/>\n&gt; is no risk of being arbitrary with either one.<br/>\n&gt;<br/>\n&gt; And how do you use principles with a very young, preverbal child, who<br/>\n&gt; developmentally and neurologically is not at a stage for that kind of high<br/>\n&gt; level thinking ? I really get it - I hope! - about not using rules,<br/>\n&gt; boundaries and limits - but how will having strong family values/principles<br/>\n&gt; and parents setting a good example register with my 20 months old as &quot;I<br/>\n&gt; shouldn&#39;t run out in front of that car&quot;?  Is establishing non-arbitrary<br/>\n&gt; limits in ways that respect the feelings and intelligences of our children<br/>\n&gt; acceptable?<br/>\n&gt;<br/>\n&gt; An example would be spilling drinks or dropping food. My son is at a stage<br/>\n&gt; where he insists on holding the cup or bowl alone, without any help, and<br/>\n&gt; when he&#39;s done he sometimes empties it on the carpet. I would like to help<br/>\n&gt; him hold it without using a limit or consequences (as in: spelling juice is<br/>\n&gt; off limit, or the consequence of spilling is you don&#39;t get to hold the cup<br/>\n&gt; alone.)<br/>\n&gt;<br/>\n&gt; At <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a> , Cat says: ***if the principle is that we<br/>\n&gt; try not to break things...*** so I am wondering, could &quot;we try not to loose<br/>\n&gt; food&quot; be a principle? Or at that age is it better to use NVC and needs, as<br/>\n&gt; in explaining my need not to waste food or stain the carpet?<br/>\n&gt;<br/>\n&gt; Many thanks,<br/>\n&gt; Clara<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268423449","msgId":51979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxMTM2NURFLUE5NzMtNEM4OS05QzI0LTRCRjBGNDhFNTU1QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQUVKREdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQUVKREdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":51974,"nextInTopic":51989,"prevInTime":51978,"nextInTime":51980,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"-=-I wouldn t do consequences at any age, but definitely not with someone as young as 20m - -=- When something spells there are natural consequences.  Whatever","messageBody":"<div id=\"ygrps-yiv-2021750078\">-=-I wouldn&#39;t do consequences at any age, but<br/>\ndefinitely not with someone as young as 20m - -=-<br/>\n<br/>\nWhen something spells there are natural consequences.  Whatever a  <br/>\nparents would &quot;do&quot; would not be consequences, it would be punishment.   <br/>\nUnless what the mom does is exclaim naturally that she&#39;s upset or  <br/>\ndisturbed, which might be a consequence but not a punishment.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268420531","msgId":51974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0OTU2OC44NDM5OC5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQUVKREdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQUVKREdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":51970,"nextInTopic":51979,"prevInTime":51973,"nextInTime":51975,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"***I wouldn t do consequences at any age, but definitely not with someone as young as 20m - he won t understand and it s pointless. He s not doing anything","messageBody":"<div id=\"ygrps-yiv-854491467\">***I wouldn&#39;t do consequences at any age, but<br/>\ndefinitely not with someone as young as 20m - he won&#39;t understand and it&#39;s<br/>\npointless. He&#39;s not doing anything &#39;naughty&#39; &lt;shudder&gt; but is just doing<br/>\nnormal 20m old stuff. It&#39;s just that it&#39;s messy that is the problem, so<br/>\nfind a way to deal with the mess.***<br/>\n<br/>\nI&#39;ve seen very young kids do things on purpose to rattle the adults around them.  While they may not understand that what they are doing is &quot;naughty&quot;, this is exactly the kind of stuff that spanking families spank for.  Little swats on the hand or butt with sharp &quot;no&#39;s&quot;.  <br/>\n<br/>\nLittle kids are pretty aware of what they are doing.  I know that when both my girls were small, I was able to redirect their bodies into a more appropriate place to be messy than in an area that I didn&#39;t want to clean food from all the time.  Margaux was by far the more messy hands on livin large kind of kid than Chamille was.  We moved to a house with carpets when she was 2.  For a long time we had a cheap area rug over our main carpet area.  By the time that got too disgusting she was old enough to be more careful and we bought a carpet shampooer.<br/>\n<br/>\nWe&#39;ve used sippy cups a lot!  Margaux is 8 and she still uses them.  We took the little rubber parts out so that it&#39;s easier to suck out of.  Out of both my kids, Margaux was the more difficult one to get to a place where she really realized that her actions impacted others.  She&#39;s getting pretty good at it now.  So, even if this is a big deal in your life, the whole mess making thing only lasted roughly 8 yrs, it wasn&#39;t forever.<br/>\n<br/>\nI honestly don&#39;t see a problem with telling a little one that they are spilling and making a mess and that you&#39;d like them to either drink in the kitchen or use a cup with a lid.  Margaux has an older sister, who brings friends over.  We usually don&#39;t wear shoes in the house, so stepping on wet gross carpet isn&#39;t pleasant or nice to allow.  It wasn&#39;t that big of an issue to help the younger child to not spill stuff all over the house, it seemed a more respectful thing to do for the household.<br/>\n<br/>\nI felt like, I could spend my time cleaning up messes, or I could help find ways to avoid them.  Either one takes time to navigate.  It&#39;s HOW that happens that is really more important than the whether or not a person finds it necessary to do so.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268411825","msgId":51970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyRTU5OUY0LUU3MjEtNDVDOC04RDJGLUE3RUE3NDVFNkY3N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE3NGRmOWRjMTAwMzEyMDczN24xOGY4NzJjOXMxNmExNDI3MWFhNjFlYTMxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPiA8Rjc0OUI5NDUtNjRCNi00RkQwLTlDNDctMDk5MzNBNzUyMjkyQHN1cGVubi5jb20+IDxDQjBDRUMzNi1EMjE5LTRDOTUtQkY0RS1GOTU0RDUxRTNDMUNAdmVyaXpvbi5uZXQ+IDwxNzRkZjlkYzEwMDMxMjA3MzduMThmODcyYzlzMTZhMTQyNzFhYTYxZWEzMUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":51968,"nextInTopic":51974,"prevInTime":51969,"nextInTime":51971,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"-=- So, I kept returning to the question, what s wrong with intellectually deconstructing a situation, even acknowledging my feelings as the biggest","messageBody":"<div id=\"ygrps-yiv-1633071345\">-=- So, I kept returning to the question, &quot;what&#39;s<br/>\nwrong with intellectually deconstructing a situation, even  <br/>\nacknowledging my<br/>\nfeelings as the biggest impediment to a good solution to a<br/>\nconflict/unpleasant situation&quot;. I can be wrong, or my feelings can be<br/>\nunreasonable;) Intellectually arriving at that conclusion can...<br/>\ndare I say it?<br/>\nprovide relief or even delight and change my feelings, needs or  <br/>\nperception<br/>\nof what the real issues are that are hindering me. Any formula that<br/>\ndiscounts human intellect can&#39;t succeed imo, because we are all about<br/>\nintelligence(curiousity, questioning, analysing)-=-<br/>\n<br/>\nAmen, to all of that.<br/>\nTwice.<br/>\n<br/>\nI don&#39;t &quot;Need&quot; for ever feeling I have to be affirmed or attended to.   <br/>\nIf I did, I woudln&#39;t make a very good mother.  Some of my needs need  <br/>\nto be handled by myself, by figuring out what childhood trauma just  <br/>\npopped up and how I can soothe my inner child (I can compartmentalize  <br/>\njust that far and not much more), and the best way I&#39;ve ever found or  <br/>\nheard of doing that is by turning right that moment and doing a sweet  <br/>\nthing for one of my children, or for my husband.  If they&#39;re not  <br/>\nthere, I might do a sweet thing for me; give myself a break, or some  <br/>\nspecial &quot;permission&quot; that I didn&#39;t have as a child.<br/>\n<br/>\nIf people are trying to find ways to just live without fighting, NVC  <br/>\nmight be good.<br/>\nIf they&#39;re trying to find ways to control all the rest of the world to  <br/>\nmake them comfortable, there IS no way to control the rest of the world.<br/>\nFor people who are trying to create a rich atmosphere of learning,  <br/>\nseparating thoughts from feelings is going to destroy the flow of  <br/>\nlearning pretty effectively, it seems to me.<br/>\n<br/>\nIf parents come here feeling that they need to become better parents,  <br/>\nwe can help them do that, briefly and directly.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268408261","msgId":51968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMTAwMzEyMDczN24xOGY4NzJjOXMxNmExNDI3MWFhNjFlYTMxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PENCMENFQzM2LUQyMTktNEM5NS1CRjRFLUY5NTRENTFFM0MxQ0B2ZXJpem9uLm5ldD4=","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPgkgPEY3NDlCOTQ1LTY0QjYtNEZEMC05QzQ3LTA5OTMzQTc1MjI5MkBzdXBlbm4uY29tPgkgPENCMENFQzM2LUQyMTktNEM5NS1CRjRFLUY5NTRENTFFM0MxQ0B2ZXJpem9uLm5ldD4="},"prevInTopic":51965,"nextInTopic":51970,"prevInTime":51967,"nextInTime":51969,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"My issue with NVC is its adherents talk about their own needs and feelings, though purporting to be non-judgemental...try using I think as an opener at an","messageBody":"<div id=\"ygrps-yiv-382316209\">My issue with NVC is its adherents talk about their own needs and feelings,<br/>\nthough purporting to be non-judgemental...try using &quot;I think&quot; as an opener<br/>\nat an NVC workshop:)  Boy, do the judgments fly. There isn&#39;t room for<br/>\n&quot;thought&quot;.  Marshall Roseberg&#39;s bible has it all pre-scripted/defined. Like<br/>\nmany systems of thought/behavior its own &quot;biases&quot; are rendered &quot;invisible&quot;.<br/>\nOther people&#39;s judgment/biases are made visible and seen as heretical--not<br/>\nproductive, or even &quot;violent&quot;.<br/>\n<br/>\nThe major issue for me is I can&#39;t compartmentalize...my feelings, thoughts,<br/>\nand needs are part of me.  So, I kept returning to the question, &quot;what&#39;s<br/>\nwrong with intellectually deconstructing a situation, even acknowledging my<br/>\nfeelings as the biggest impediment to a good solution to a<br/>\nconflict/unpleasant situation&quot;.  I can be wrong, or my feelings can be<br/>\nunreasonable;)  Intellectually arriving at that conclusion can...<br/>\ndare I say it?<br/>\nprovide relief or even delight and change my feelings, needs or perception<br/>\nof what the real issues are that are hindering me.  Any formula that<br/>\ndiscounts human intellect can&#39;t succeed imo, because we are all about<br/>\nintelligence(curiousity, questioning, analysing)<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268399741","msgId":51965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCMENFQzM2LUQyMTktNEM5NS1CRjRFLUY5NTRENTFFM0MxQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEY3NDlCOTQ1LTY0QjYtNEZEMC05QzQ3LTA5OTMzQTc1MjI5MkBzdXBlbm4uY29tPg==","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPiA8Rjc0OUI5NDUtNjRCNi00RkQwLTlDNDctMDk5MzNBNzUyMjkyQHN1cGVubi5jb20+"},"prevInTopic":51960,"nextInTopic":51968,"prevInTime":51964,"nextInTime":51966,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... Yes. I think the tendency when people first hear about living by principles instead of rules is they replace rules with principles. So instead of the rule","messageBody":"<div id=\"ygrps-yiv-1754223640\">On Mar 11, 2010, at 9:19 PM, Su Penn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not sure my Yehva would understand much if I yammered at her  <br/>\n&gt; about &quot;I have a need not to waste food.&quot; I will say clearly, if  <br/>\n&gt; she&#39;s wanting an open cup, &quot;OK, come sit at the table,&quot;<br/>\n<br/>\n </span></blockquote>Yes. I think the tendency when people first hear about living by  <br/>\nprinciples instead of rules is they replace rules with principles. So  <br/>\ninstead of the rule &quot;No, don&#39;t hit your sister,&quot; it becomes principle  <br/>\nexpressed as a rule of &quot;No, be kind.&quot;<br/>\n<br/>\nRather than imposing your principles on her, help her find a way to  <br/>\ndo what she wants that&#39;s in keeping with your principles. Instead of  <br/>\nsome form of &quot;You need to stop because it&#39;s going against the  <br/>\nprinciples I want you to adopt,&quot; you put your principles into action.  <br/>\nYou help her find a way to meet her underlying need in a way that&#39;s  <br/>\nsafer or cleaner or kinder or whatever principles apply. You don&#39;t  <br/>\nneed to teach her. She&#39;ll absorb that these changes are important to  <br/>\nyou even if she doesn&#39;t understand why. Not necessarily important to  <br/>\nher! Important to you. And if -- and this is the important part! --  <br/>\nyour focus is on helping her meet her need, then she&#39;ll absorb that  <br/>\nyour way has some &quot;better&quot; quality to it and she&#39;s less likely to  <br/>\nmind you inserting your need.<br/>\n<br/>\nIf she experiences years of you treating her needs seriously, then,  <br/>\nwhen she&#39;s developmentally able, she&#39;ll treat your needs seriously.  <br/>\nShe&#39;ll be willing to take a less direct path to what she wants, if it  <br/>\nmeans she&#39;ll avoid hurting someone who has always put her needs as a  <br/>\nhigh priority.<br/>\n<br/>\nIf a child&#39;s needs have been put at a lower priority than a mom&#39;s  <br/>\nneed to impose a lesson on principle, the child is less likely to  <br/>\ntreat the mom&#39;s needs seriously. She won&#39;t care if she hurts your  <br/>\nfeelings because you&#39;ve been hurting her feelings (without realizing  <br/>\nit) for years.<br/>\n<br/>\n(Whether or not to tell the child the principle that&#39;s guiding your  <br/>\nhelp depends. It depends on the age and situation and personality. In  <br/>\nsome cases &quot;Wait, juice is expensive, let&#39;s pour water instead,&quot; will  <br/>\nput the principle into the atmosphere and they can absorb it without  <br/>\nreally thinking about it. In some cases &quot;Let&#39;s pour water instead,&quot;  <br/>\nwill be good enough. (Especially if they already know the principle  <br/>\nand were just too focused on trying to do something.) In some cases  <br/>\n&quot;Let&#39;s find a less expensive (safer, kinder) way to do that,&quot; will be  <br/>\ngood when a solution isn&#39;t simple and quick. And that doesn&#39;t mean  <br/>\nremove &quot;No!&quot; from your tool box. But the fewer times &quot;No!&quot; is  <br/>\nresorted to the more power it retains. And sometimes &quot;Hey!&quot; is good  <br/>\nenough. At 2 AM when my daughter&#39;s loud on the phone with a friend, I  <br/>\ndon&#39;t need to tell her what she&#39;s doing wrong or what she needs to  <br/>\ndo. She knows. She just needs to realize she&#39;d momentarily lost  <br/>\nawareness of the rest of the world and she knows how to fix it.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"claremkirkpatrick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268378341","msgId":51960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQUVKREdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","inReplyToHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg=="},"prevInTopic":51955,"nextInTopic":51965,"prevInTime":51959,"nextInTime":51961,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"An example would be spilling drinks or dropping food. My son is at a stage where he insists on holding the cup or bowl alone, without any help, and when he s","messageBody":"<div id=\"ygrps-yiv-2027078959\">&quot;An example would be spilling drinks or dropping food. My son is at a stage<br/>\nwhere he insists on holding the cup or bowl alone, without any help, and<br/>\nwhen he&#39;s done he sometimes empties it on the carpet. I would like to help<br/>\nhim hold it without using a limit or consequences (as in: spelling juice is<br/>\noff limit, or the consequence of spilling is you don&#39;t get to hold the cup<br/>\nalone.)<br/>\n<br/>\nAt <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a> , Cat says: ***if the principle is that we<br/>\ntry not to break things...*** so I am wondering, could &quot;we try not to loose<br/>\nfood&quot; be a principle? Or at that age is it better to use NVC and needs, as<br/>\nin explaining my need not to waste food or stain the carpet?&quot;<br/>\n<br/>\nI find it interesting, and helpful, to read that we all have different<br/>\nthings that we are prepared to accept more than others.  Personally, messy<br/>\nfood is not a big deal to me, but we have laminate flooring - it&#39;s easy to<br/>\nclean.  I kind of think that 20m olds will eventually grow out of the desire<br/>\nto explore food in a messy way - I&#39;ve never seen an 18 year old spilling his<br/>\nfood just to see what happens!  But we&#39;ve always done what is sometimes<br/>\ncalled &#39;baby led weaning&#39; and I think that that has helped get to tidier<br/>\neating more quickly as the child has more practice at it younger.<br/>\n<br/>\nCan you get a large sheet of colourful PVC to keep on the carpet until he&#39;s<br/>\ntidier at eating and drinking?  I wouldn&#39;t do consequences at any age, but<br/>\ndefinitely not with someone as young as 20m - he won&#39;t understand and it&#39;s<br/>\npointless.  He&#39;s not doing anything &#39;naughty&#39; &lt;shudder&gt; but is just doing<br/>\nnormal 20m old stuff.  It&#39;s just that it&#39;s messy that is the problem, so<br/>\nfind a way to deal with the mess.<br/>\n<br/>\nWhen he learnt to walk, you didn&#39;t try and give him consequences when he<br/>\ntoppled over while cruising, I assume?  It&#39;s the same, IMO.  He&#39;s just<br/>\nlearning a different skill, now, and about a different thing.  I&#39;d rather my<br/>\nchildren made the mess while they&#39;re young, and got tidy quicker, than had<br/>\nthem desperate to play with food throughout their whole childhood because I<br/>\nnever let them explore it when they needed to.<br/>\n<br/>\nClare</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268373804","msgId":51989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMzExMjIwM3k0YTJkN2QyYWc1ZGE0NjE0NDNiN2MwMGI1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEY3NDlCOTQ1LTY0QjYtNEZEMC05QzQ3LTA5OTMzQTc1MjI5MkBzdXBlbm4uY29tPg==","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPgkgPEY3NDlCOTQ1LTY0QjYtNEZEMC05QzQ3LTA5OTMzQTc1MjI5MkBzdXBlbm4uY29tPg=="},"prevInTopic":51979,"nextInTopic":51991,"prevInTime":51988,"nextInTime":51990,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"And how do you use principles with a very young, preverbal child, who developmentally and neurologically is not at a stage for that kind of high level","messageBody":"<div id=\"ygrps-yiv-2138559472\">&quot;And how do you use principles with a very young, preverbal child, who<br/>\ndevelopmentally and neurologically is not at a stage for that kind of high<br/>\nlevel thinking ? I really get it - I hope! - about not using rules,<br/>\nboundaries and limits - but how will having strong family values/principles<br/>\nand parents setting a good example register with my 20 months old as &quot;I<br/>\nshouldn&#39;t run out in front of that car&quot;?&quot;<br/>\n<br/>\nI don&#39;t know if it can be done or would be healthy to, which is causing me<br/>\nsome concern about the tendency of relatives to &#39;train&#39; him through<br/>\ninteractions. So far, the only strategy with potential seems to be following<br/>\nthe principles myself and looking out for him to distract or defuse<br/>\nsituations as needed.<br/>\n<br/>\nDay before yesterday, I visited a cousin with an almost two year old. He is<br/>\na high voltage kid - always in action (and scrapes) - fantastic, fun child.<br/>\nI was with him with N for over an hour without incident. Then his<br/>\ngrandparents woke up from their nap, and his mom came out of the kitchen,<br/>\nand the whole thing was about &quot;Look! baby. Isn&#39;t he sweet? Don&#39;t touch, just<br/>\nwatch from a distance. No, don&#39;t hurt him...&quot; He didn&#39;t &#39;get it&#39; at all and<br/>\nthe rest of the visit was a stressful struggle of protecting N. When I was<br/>\nwith him earlier, we just ignored the baby, or were practical about his<br/>\ncuriosity, and moved on, playing happily, no violence, not even the threat<br/>\nof it in the air. We even played with the baby in ways that he could talk<br/>\nand entertain him and so on. Then, he realized that touching the baby and<br/>\nhurting him were possibilities and they were being denied to him, and every<br/>\ntime he thought we weren&#39;t paying attention, he tried to grab the<br/>\nopportunity, while he said aloud &quot;NO touching baby&quot;. I don&#39;t even think he<br/>\nwanted to hurt N. He just wanted to find out what would happen if he did<br/>\nthese new possibilities that was getting everyone all excited. What&#39;s worse,<br/>\nwe are now going to have to &#39;guard&#39; N for quite a while till he &#39;gets it&#39;.<br/>\n<br/>\nI don&#39;t think children have ability to reason out intangible stuff like<br/>\nconsequences and shoulds (even if they are important) till well after being<br/>\nable to speak. Usually at lease over three years of age. Till then, all they<br/>\ngrasp is a refusal, not the reason. Even with something as crucial as not<br/>\nrunning in front of a car. The more they are refused, the more they will<br/>\nlearn to grab opportunities when the refusal is unlikely. But this is<br/>\nmy theoretical knowledge, backed with limited experience. I don&#39; really see<br/>\na &#39;solution&#39; other than to be alert and redirect lovingly currently, but<br/>\nwould appreciate suggestions too, if this is not how things pan out in<br/>\nreality, because I really don&#39;t want to guard N around him all the time - he<br/>\nis a lovely boy.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268360369","msgId":51955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3NDlCOTQ1LTY0QjYtNEZEMC05QzQ3LTA5OTMzQTc1MjI5MkBzdXBlbm4uY29tPg==","inReplyToHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg==","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg=="},"prevInTopic":51952,"nextInTopic":51960,"prevInTime":51954,"nextInTime":51956,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"... I ve had two who did this! They liked dancing in the puddles they made. I don t think in terms of consequences per se--that s a little too much like","messageBody":"<div id=\"ygrps-yiv-365930573\">On Mar 11, 2010, at 6:26 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:claramont@...\">claramont@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; An example would be spilling drinks or dropping food. My son is at a stage where he insists on holding the cup or bowl alone, without any help, and when he&#39;s done he sometimes empties it on the carpet. I would like to help him hold it without using a limit or consequences (as in: spelling juice is off limit, or the consequence of spilling is you don&#39;t get to hold the cup alone.) <br/>\n<br/>\n </span></blockquote>I&#39;ve had two who did this! They liked dancing in the puddles they made.<br/>\n<br/>\nI don&#39;t think in terms of &quot;consequences&quot; per se--that&#39;s a little too much like precious code for &quot;punishment.&quot; But for Yehva, who is two, I do put things into a sipply cup--she can still pour them out, it just takes more effort--unless she&#39;s at the table or in the kitchen. I also try to give her lots of opportunities to pour and make puddles with water, since she likes to do that so much. I only fill open cups about half way for her (though she is a go-getter and more than once I&#39;ve found her helping herself to more by pouring it from my cup).<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; At <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a> , Cat says: ***if the principle is that we try not to break things...*** so I am wondering, could &quot;we try not to loose food&quot; be a principle? Or at that age is it better to use NVC and needs, as in explaining my need not to waste food or stain the carpet?<br/>\n<br/>\n </span></blockquote>&quot;Need&quot; is a strong word there.  Preference, maybe. My partner and I have always had a lot of pets, and now we have three kids, and we&#39;ve chosen to have old rugs and furniture so we don&#39;t have to worry about it much. My mother always wanted a white living room, but unlike my neighbor down the street with three young children she has to monitor all the time, my mom waited until we kids were moved out, and then she re-did her living room with white furniture and carpets.<br/>\n<br/>\nMaybe if you live in an apartment where you&#39;ll lose your security deposit, keeping the carpet pristine becomes a higher priority for real-world reasons.<br/>\n<br/>\nI also don&#39;t fret about wasted food with my kids. Part of learning about how to eat food is messing around with it, and food can be a great toy (pudding in the bathtub on a winter&#39;s day! what could be more fun!). I think overall we do pretty well as a family; I rarely throw out spoiled food, we&#39;re good at buying what we&#39;ll eat and eating what we buy. But I don&#39;t worry about the kids leaving something on their plate, or taking too much when they serve themselves, or, when they&#39;re toddlers, pouring out juice to make a puddle--at least not from a &quot;wasted food&quot; perspective. I might not give another cup of juice to Yehva if she&#39;d just poured one out; I&#39;d figure she probably wanted to do more pouring, and maybe we could switch to some water play at the sink.<br/>\n<br/>\nI&#39;m not sure my Yehva would understand much if I yammered at her about &quot;I have a need not to waste food.&quot; I will say clearly, if she&#39;s wanting an open cup, &quot;OK, come sit at the table,&quot; or, &quot;here, you can have this if you can stay in the kitchen with it.&quot; (Keeping in mind that a 2-year-old is not the best promise-keeper in the world, I&#39;ll then usually stay with her while she drinks it, or at least close enough so I can see if she starts heading out with an open cup.). And if she doesn&#39;t want to do that, I give her a cup with a lid.<br/>\n<br/>\nShe likes covered travel mugs sometimes because she likes to do what we do and we drink out of them. So if she&#39;s absolutely getting mad because I&#39;m trying to give her a sippy cup, she&#39;ll switch to sunshine if I pour the drink into one of those.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSu, mom to Eric 8; Carl, almost 6; Yehva, 2.5<br/>\n<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268354684","msgId":51952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5NDQyMS45MjgzNi5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg==","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg=="},"prevInTopic":51949,"nextInTopic":51955,"prevInTime":51951,"nextInTime":51953,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"***An example would be spilling drinks or dropping food. My son is at a stage where he insists on holding the cup or bowl alone, without any help, and when","messageBody":"<div id=\"ygrps-yiv-263143625\">***An example would be spilling drinks or dropping food. My son is at a stage where he insists on holding the cup or bowl alone, without any help, and when he&#39;s done he sometimes empties it on the carpet. I would like to help him hold it without using a limit or consequences (as in: spelling juice is off limit, or the consequence of spilling is you don&#39;t get to hold the cup alone.)***<br/>\n<br/>\nI suppose it depends on whether or not its intentional.  If my child was spilling things accidentally, I&#39;d say &quot;oops, let&#39;s clean that up.&quot;  If my child were spilling things on purpose, I&#39;d probably say &quot;Don&#39;t do that, it makes a mess.&quot;  Then if they were to continue, I wouldn&#39;t offer drinks with lids in the living room or where there is carpet.  They&#39;d be perfectly fine to do it outside or at a high chair where is spills on a tray.   Then I&#39;d find ways in which my kiddo can play around with liquids that doesn&#39;t ruin carpets or cause extra clean up to clean sticky stuff off floors or walls.  Bathtubs are great for that, as well as a sink full of dishes with soapy water.<br/>\n<br/>\n***Can &quot;respect other family members&#39; needs&quot; or &quot;respect other family members&#39; need for rest&quot; be a principle? Or would the principle be simpler, like &quot;respect&quot;? ***<br/>\n<br/>\nWith younger kids, it should be more concrete.  Don&#39;t talk about respect, if you need quiet at night, ask for quiet and make night times about being quiet so that others can sleep.  Over time, kids will develop a sense of what is respectful and what is not based on all those little concrete ideas and moments.  If those moments are peaceful, a kid can&#39;t help but grow up knowing how to be respectful.  If those moments are filled with anger or resentment, for instance being cranky and tired and snappish, a kid will not be nearly as respectful to the needs of quiet for the individual who is being angry, resentful, cranky, and snappish and may in turn behave in that manner late at night when getting tired.<br/>\n<br/>\nI speak from experience here!  I used to not handle tiredness very peacefully at all.  If I was tired and needing sleep, I would be cranky and ultimately piss everyone off around me.  I learned how to be peacefully tired and through that, my whole family has found ways to be kinder to me when I&#39;m tired.  That&#39;s how mutual respect is fostered.  <br/>\n<br/>\n***In NVC you would talk to your child about feelings and needs. There seems to be a lot in common between honoring others&#39; needs and principles. I&#39;m wondering if I&#39;m on the right path? There is no risk of being arbitrary with either one.*** <br/>\n<br/>\nWhen I first acknowledged this cycle, it did help to state that I was tired and cranky, but eventually I realized that in actuality, I should simply acknowledge this internally and then work to be peaceful, so that the peace is what comes out.  Stating that I was tired and cranky, initially was to let everyone know that I was having a hard time.  The problem with that, is it puts the burden of behavior on the other people around to act on that information.  It was easy to see how that didn&#39;t help the situation at all.  What really did help, was changing how I handled tiredness.  I was able to honor everyone&#39;s needs for peace, by being more peaceful.  It very often happens like that in families, where one person can set the tone for the household.  It should be the adults being actively mindful and peaceful.<br/>\n<br/>\nTo me, NVC is way too scripted and doesn&#39;t get to the core of what actually needs to be done.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peaceful Parenting & Principles","postDate":"1268354277","msgId":51949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxOUQwNThELUZDRTEtNDlGMi04RjZCLTg1RjEwRjcyMzJCMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg==","referencesHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg=="},"prevInTopic":51946,"nextInTopic":51952,"prevInTime":51948,"nextInTime":51950,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"-=-Now, would it be against the unschooling philosophy to ask them to be quiet because others in the house are asleep? If they didn t wake her, they could be","messageBody":"<div id=\"ygrps-yiv-66600086\">-=-Now, would it be against the unschooling philosophy to ask them to  <br/>\nbe quiet because others in the house are asleep? If they didn&#39;t wake  <br/>\nher, they could be waking others. Can &quot;respect other family members&#39;  <br/>\nneeds&quot; or &quot;respect other family members&#39; need for rest&quot; be a  <br/>\nprinciple? Or would the principle be simpler, like &quot;respect&quot;? -=-<br/>\n<br/>\nI think it&#39;s important to be quiet while people are sleeping, but I  <br/>\nhave also often hooted with laughter during a card game or discussion,  <br/>\nand I know it happens.<br/>\n<br/>\nCertainly &quot;sleep is important&quot;  and &quot;be a good neighbor&quot; and &quot;police  <br/>\nshowing up would be bad&quot; and such things are good and true.<br/>\n<br/>\nThey&#39;re all parts of respect, but I have nothing against people being  <br/>\nmore particular with their &quot;respect.&quot;  If someone&#39;s sleeping at 4:00  <br/>\nin the afternoon, I unlikely to be as quiet as I would be at 4:00 in  <br/>\nthe morning, unless the person was sick or needed to do a twelve hour  <br/>\nshift when he woke up or whatever.<br/>\n<br/>\n-=-On the tape, Richard Prystowsky mentions Non Violent Communication.  <br/>\nIn NVC you would talk to your child about feelings and needs. There  <br/>\nseems to be a lot in common between honoring others&#39; needs and  <br/>\nprinciples. I&#39;m wondering if I&#39;m on the right path? There is no risk  <br/>\nof being arbitrary with either one. -=-<br/>\n<br/>\nI don&#39;t mess with NVC myself.  It&#39;s an artificial construct between  <br/>\npeople, and between a person and her own honest thoughts, in my  <br/>\nexperience.   A &quot;NVC practitioner&quot; just beat the verbal crap out of me  <br/>\n(or tried to) for five thunderous pages by e-mail the other day.      <br/>\nI&#39;m not sure what &quot;there is no risk of being arbitrary with either  <br/>\none&quot; means, because I don&#39;t think there&#39;s anything that can innoculate  <br/>\na person against kneejerk reactions or against casting a situation in  <br/>\nher own favor in a martyrly fashion.<br/>\n<br/>\n-=-And how do you use principles with a very young, preverbal child,  <br/>\nwho developmentally and neurologically is not at a stage for that kind  <br/>\nof high level thinking ?-=-<br/>\n<br/>\nYou make decisions based on those principles yourself.   Young  <br/>\nchildren don&#39;t need any kind of high level thinking for the parents to  <br/>\nlive by principles.<br/>\n<br/>\n-=- how will having strong family values/principles and parents  <br/>\nsetting a good example register with my 20 months old as &quot;I shouldn&#39;t  <br/>\nrun out in front of that car&quot;?-=-<br/>\n<br/>\nThe principle would be &quot;be safe,&quot; and without trying to describe to  <br/>\nhim what a car can do to someone his size, just keep him safe.<br/>\n<br/>\n-=-Is establishing non-arbitrary limits in ways that respect the  <br/>\nfeelings and intelligences of our children acceptable?-=-<br/>\n<br/>\nIs that a twenty-word version of &quot;do you ever say no?&quot;?<br/>\nSometimes no is the only safe, reasonable, respectful and considerate  <br/>\nanswer.  SOMEtimes.  If &quot;No&quot; becomes the regular default answer, then  <br/>\nwhen a child hears &quot;no&quot; he might likely ignore it.   If it&#39;s<br/>\nNo, don&#39;t fidget,<br/>\nno, don&#39;t put your finger in your nose,<br/>\nno, don&#39;t bounce,<br/>\nno, don&#39;t take your shoes off,<br/>\nno, don&#39;t eat any more of that,<br/>\nno, don&#39;t sing at the table,<br/>\nno, don&#39;t make that noise,<br/>\nno, don&#39;t splash,<br/>\nno, don&#39;t walk around,<br/>\nno, no, no,<br/>\nthen how likely is he to really feel any power or immediacy in<br/>\nNO, don&#39;t go into the parking lot! ?<br/>\n<br/>\n-=-My son is at a stage where he insists on holding the cup or bowl  <br/>\nalone, without any help, and when he&#39;s done he sometimes empties it on  <br/>\nthe carpet. I would like to help him hold it without using a limit or  <br/>\nconsequences (as in: spelling juice is off limit, or the consequence  <br/>\nof spilling is you don&#39;t get to hold the cup alone.) -=-<br/>\n<br/>\nPut less in it, get sippy cups, don&#39;t let him on the carpet, put a  <br/>\nblanket down if he&#39;s eating on carpet, give him a bottle instead of a  <br/>\ncup, only give him finger food that can be vacuumed up and not wet  <br/>\nmessy food in a bowl.<br/>\n<br/>\n-=-so I am wondering, could &quot;we try not to loose food&quot; be a principle?  <br/>\nOr at that age is it better to use NVC and needs, as in explaining my  <br/>\nneed not to waste food or stain the carpet?-=-<br/>\n<br/>\nYou want to tell him you need him not to stain the carpet?  When he&#39;s  <br/>\nyoung enough to upend a cup for fun?  Think of your own similar lest  <br/>\nto the &quot;NO&quot; list above, and on #20 (or by the time he really  <br/>\nunderstands you), what are the odds he will deeply care about your  <br/>\nstated &quot;needs&quot;?    I think NVC is a bad tool for unschoolers.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":366686190,"authorName":"claramont@mac.com","from":"claramont@...","profile":"clara_bellar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Peaceful Parenting & Principles","postDate":"1268349973","msgId":51946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExMjk5QjdELTM0NzYtNEU5My1CMzdELTFDQzIxQUU3Njg4QkBtYWMuY29tPg=="},"prevInTopic":0,"nextInTopic":51949,"prevInTime":51945,"nextInTime":51947,"topicId":51946,"numMessagesInTopic":0,"msgSnippet":"My husband and I just listened to the Parenting Peacefully files. It was very helpful, thank you, Sandra, for making them available. I have a question re.","messageBody":"<div id=\"ygrps-yiv-2027034430\">My husband and I just listened to the Parenting Peacefully files. It was very helpful, thank you, Sandra, for making them available. I have a question re. Principles. Sandra says that if it hadn&#39;t been for her hot flashes, she wouldn&#39;t have gone down and told the boys to be quiet. The hot flashes were waking her, not the noise. Now, would it be against the unschooling philosophy to ask them to be quiet because others in the house are asleep? If they didn&#39;t wake her, they could be waking others. Can &quot;respect other family members&#39; needs&quot; or  &quot;respect other family members&#39; need for rest&quot; be a principle? Or would the principle be simpler, like &quot;respect&quot;? <br/>\n<br/>\nWhich brings me to another question. On the tape, Richard Prystowsky mentions Non Violent Communication. In NVC you would talk to your child about feelings and needs. There seems to be a lot in common between honoring others&#39; needs and principles. I&#39;m wondering if I&#39;m on the right path? There is no risk of being arbitrary with either one. <br/>\n<br/>\nAnd how do you use principles with a very young, preverbal child, who developmentally and neurologically is not at a stage for that kind of high level thinking ? I really get it - I hope! - about not using rules, boundaries and limits - but how will having strong family values/principles and parents setting a good example register with my 20 months old as &quot;I shouldn&#39;t run out in front of that car&quot;?  Is establishing non-arbitrary limits in ways that respect the feelings and intelligences of our children acceptable?<br/>\n<br/>\nAn example would be spilling drinks or dropping food. My son is at a stage where he insists on holding the cup or bowl alone, without any help, and when he&#39;s done he sometimes empties it on the carpet. I would like to help him hold it without using a limit or consequences (as in: spelling juice is off limit, or the consequence of spilling is you don&#39;t get to hold the cup alone.) <br/>\n<br/>\nAt <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a> , Cat says: ***if the principle is that we try not to break things...*** so I am wondering, could &quot;we try not to loose food&quot; be a principle? Or at that age is it better to use NVC and needs, as in explaining my need not to waste food or stain the carpet?<br/>\n<br/>\nMany thanks,<br/>\nClara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":51243,"nextTopicId":52124}}