{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092689630","msgId":98156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZC4zY2E5NTQ0MS4yZTUyNzhkZUBhb2wuY29tPg=="},"prevInTopic":98152,"nextInTopic":0,"prevInTime":98155,"nextInTime":98157,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/16/2004 10:58:19 AM Central Standard Time, SandraDodd@aol.com writes: We have  a dog who can get out of our yard but doesn t.  Or she","messageBody":"<div id=\"ygrps-yiv-709802901\">In a message dated 8/16/2004 10:58:19 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nWe have  a dog who can get out of our yard but doesn&#39;t.  Or she does, but she <br/>\n <br/>\ndoesn&#39;t go away.    We don&#39;t even have a fence or wall between  the front and <br/>\nback on one side anymore.  She has a dog door, and we  have no fence.  Yet <br/>\nshe&#39;s <br/>\nalways home.  She might be in the  front, if something exciting is happening, <br/>\nbut she doesn&#39;t have the urge  to run away.    She used to explore the vacant <br/>\nlot, but as she  got older she quit.  We take her on walks without a leash <br/>\nand <br/>\nshe  stays with us.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nMy dog Percy and my cats have no good reason to leave. There&#39;s always food,  <br/>\nclean water and a warm bed, someone to scratch an ear.  My neighbor&#39;s dog  <br/>\nused to get off his chain and he&#39;d come straight to my house.  I put him  back on <br/>\nthe chain (reluctantly), until finally I just left him in our yard until  his <br/>\nowner came looking.  He was small, so he could have snuck under the  fence <br/>\nback to his own house, but he knew how to work the doggie door and where  the <br/>\nfood was and that there were people here who paid attention to him.  He  was at <br/>\nour house for 3 days before the owner came to get him.  I  didn&#39;t want to give <br/>\nhim up at all.  When the guy found out I&#39;d like to keep  him he didn&#39;t bring <br/>\nhim back.  I hope he put in a doggie door for the  little guy.  <br/>\n <br/>\nWill would rather be here than at someone else&#39;s house, too.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092687191","msgId":98152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMjExNTU3LjEwNjA5QGNvbWNhc3QubmV0Pg==","inReplyToHeader":"PDIwMDQwODE2MDI0NTU5LjU0Mzg5LnFtYWlsQHdlYjExMzA2Lm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDQwODE2MDI0NTU5LjU0Mzg5LnFtYWlsQHdlYjExMzA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":98119,"nextInTopic":98156,"prevInTime":98151,"nextInTime":98153,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"Excuse my probably basic question here, but has this always been the case, or was there a certain age when you started to let her watch whatever she wants?  It","messageBody":"<div id=\"ygrps-yiv-657353906\">Excuse my probably basic question here, but has this<br/>\nalways been the case, or was there a certain age when<br/>\nyou started to let her watch whatever she wants?  It<br/>\nseems like there are some &#39;unschooling&#39; families with<br/>\nyoung children &#39;preschool&#39; age or younger (3 years old<br/>\nhere) who only selectively let there children watch TV<br/>\nor videos. <br/>\n===================<br/>\n<br/>\n<br/>\n&lt;&gt;This hasn&#39;t always been the case for us, as I touched on a bit in my <br/>\ntv post. For a long time we didn&#39;t have tv. When the kids were really <br/>\nyoung--when my oldest was 3 or under--I limited the amount of time they <br/>\nwatched videos to an hour or under a day. By the time she was 4, though, <br/>\nshe had free access to the videos and could pop them in when she wanted, <br/>\nthough that was still pretty controlled and limited by what we had in <br/>\nthe house. I remember lots of Teletubbies, Dragon Tales, Bear in the Big <br/>\nBlue House, Masie, countless Disney movies. We have a *huge* video <br/>\ncollection because of those years without tv.<br/>\n<br/>\nWhen I first started reading here (a year ago in November, I think), I <br/>\nbegan rethinking my approach to tv (and bedtimes and food). We had <br/>\ngotten cable several months before, so the kids (6, 4 and 3 at that <br/>\npoint) were watching tv as well as videos, though still more often <br/>\nvideos. I remember I had been wondering for a while when it would be <br/>\n&quot;okay&quot; to let my kids watch Star Wars, which I couldn&#39;t wait to share <br/>\nwith them because it&#39;s such an interest for dh and I. Emily had seen <br/>\nbits and pieces of the Phantom Menace, the parts that weren&#39;t too scary, <br/>\nbut it was still something that dh and I watched after the kids went to <br/>\nbed. For us, that&#39;s how it started--with Star Wars. After Star Wars, we <br/>\nbegan watching other things as well. It was gradual, not an <br/>\nin-your-face-violence kind of thing. Em had also seen parts of Lord of <br/>\nthe Rings, so we were soon sharing that with her as well. At first, she <br/>\ngot really upset by the dead dwarves in the mines and stopped watching. <br/>\nIt took her several months before she was comfortable trying again. Same <br/>\nthing with Spiderman--it was just too realistic when we first rented it, <br/>\nmaybe 6 months ago so we turned it off. We tried again a couple of weeks <br/>\nago, and they loved it--even the 4 year old. (A friend of mine has <br/>\ngotten quite a bit of grief from her 8 year old because he&#39;s not allowed <br/>\nto watch it but knows that Sam has.) We&#39;ve shared lots of really great <br/>\nmovies over the past year, but we still enjoy watching Disney movies, <br/>\ncartoons or whatever. We&#39;ve watched all the Star Wars, Lord of the <br/>\nRings, Indiana Jones, Men in Black, X-Men. We&#39;ve also watched Crouching <br/>\nTiger, Hidden Dragon; The Last Samurai; Sound of Music; Peter Pan; Harry <br/>\nPotter and many others.<br/>\n<br/>\nLike I said, this has been gradual. The kids probably don&#39;t even <br/>\nremember not having free choice because it went from being very young to <br/>\nfree choice of videos to free choice of tv and movies. But, that doesn&#39;t <br/>\nmean that they watch whatever they want without any parental input or <br/>\npresence. Emily watched the Last Samurai in our bed with us, and she <br/>\nwatched me sob at the end when the Samurai get massacred. We talked <br/>\nabout *why* I was crying so hard and what it meant to me to watch that. <br/>\nThey haven&#39;t seen The Matrix yet, but they haven&#39;t asked to see it <br/>\neither.  When Dh rented Kill Bill, we told the kids that it was an adult <br/>\nmovie, same thing with Fight Club. There are movies that I don&#39;t think <br/>\nthey need to see, and, yes, I&#39;m the one making that decision.. Kill Bill <br/>\nwas a movie I don&#39;t think *I* needed to see! We watch those movies in <br/>\nour room with the door closed. In the past we would have watched <br/>\nsomething like that after they went to bed, but because our kids no <br/>\nlonger have a bedtime, they&#39;re still awake. We just point that out and <br/>\nremind them that they&#39;re free to watch something else downstairs, play <br/>\nthe computer, play in the playroom, any number of other things, and <br/>\nthey&#39;re fine with that because it doesn&#39;t happen very often. They <br/>\nrealize that we&#39;re not telling them no just for the sake of controlling <br/>\nbut because it&#39;s something that is genuinely too much for them.<br/>\n<br/>\nThe gradual part is really important, I think. Several months ago, I <br/>\nmade an analogy to someone who was throwing off controls left and right <br/>\nand whose children didn&#39;t quite know what to do with the new freedom. I <br/>\nsuggested that it might be a lot like being in a closet and having <br/>\nsomeone suddenly fling the door open wide, letting flood in the very <br/>\nbright light outside and how much that must hurt their eyes!  It&#39;s not <br/>\nabout flinging the door open as quickly as you can just because it&#39;s <br/>\nbeen closed for so long; it&#39;s more about gradually opening the door, <br/>\nusing your children&#39;s comfort levels to guide you. Like several of the <br/>\nexperienced folks here often say, it&#39;s not about never saying no but <br/>\nabout saying yes more often.<br/>\n<br/>\n--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a></div>","specialLinks":[]},{"userId":9543528,"authorName":"Dana Matt","from":"Dana Matt &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092673161","msgId":98119,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODE2MTYxOTIxLjgxNzAxLnFtYWlsQHdlYjQwNDA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDE1OS4zY2EzYzRmMC4yZTUyMzIwMUBhb2wuY29tPg=="},"prevInTopic":98117,"nextInTopic":98152,"prevInTime":98118,"nextInTime":98120,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"... Forget the kids, Sandra ;)  As the mother of two run-away-never-come-back dogs, I want dog advice!  ;) Dana in MOntana __________________________________ ","messageBody":"<div id=\"ygrps-yiv-175272260\"><blockquote><span title=\"ireply\">&gt; Not true of any of our neighbors&#39; dogs, who will<br/>\n&gt; come to our house if they <br/>\n&gt; get a chance, or run far and fast (different dogs<br/>\n&gt; different ways).<br/>\n&gt; <br/>\n&gt; I have a related story I&#39;ll tell separately, about<br/>\n&gt; my kids being out and <br/>\n&gt; about.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>Forget the kids, Sandra ;)  As the mother of two<br/>\nrun-away-never-come-back dogs, I want dog advice!  ;)<br/>\n<br/>\nDana<br/>\nin MOntana<br/>\n<br/>\n<br/>\n\t<br/>\n\t\t<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - 100MB free storage!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/new_mail\">http://promotions.yahoo.com/new_mail</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092672443","msgId":98117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMi4xZDFiYzE1My4yZTUyMzViYkBhb2wuY29tPg=="},"prevInTopic":98111,"nextInTopic":98119,"prevInTime":98116,"nextInTime":98118,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/16/04 5:30:40 AM, fetteroll@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1173753287\">In a message dated 8/16/04 5:30:40 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\n&lt;&lt; When the world is divided into what they want to experience and what they<br/>\ndon&#39;t want to experience, why would they choose to experience what they<br/>\ndon&#39;t want to experience?<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>Last Friday night began a new era for me as a mom.   I had an experience.<br/>\n<br/>\nIt reminded me of the very first time all three of my children walked away <br/>\nfrom my house together, toward the busy road, to go to the convenience store.  <br/>\nThe boys were taking Holly, for the first time, without me.  I took a photo of <br/>\nthem walking away.  I don&#39;t know where it is and that&#39;s fine, because it used <br/>\nto make me cry and still might.<br/>\n<br/>\nHolly was barely three or nearly, and holding both their hands, so I guess <br/>\nMarty was five and Kirby was seven.<br/>\n<br/>\nFlash forward to June 11, 2004.<br/>\nKirby, 18 was at work.  Took the big van.  He works a mile away.<br/>\nMarty, 15, had gone to a gaming tournament across the valley, maybe 15 miles <br/>\naway.  Drove my Dodge Caravan.  First time driving all by himself, not <br/>\ncounting once to the nearest grocery store and once to the post office this week.<br/>\nHolly, 12, said, &quot;I&#39;m bored.  I wonder if  Crystal would want to hang out?&quot;<br/>\n<br/>\nCrystal is 18, someone they&#39;ve known since Kirby was seven (that same going <br/>\nto Circle K season), and she&#39;s lately moved back here after a stint in <br/>\nCalifornia which all the kids followed like a soap opera.   She called Crystal, who <br/>\n(surprisingy for a Friday night for someone as 18 and good looking as she is) <br/>\nsaid, &quot;Sure!  I&#39;ll be there in fifteen minutes.&quot;<br/>\n<br/>\nSo Crystal came and she and Holly went off to find something fun to do.<br/>\n<br/>\nAll three of my children were gone at once.  They were in three different <br/>\nplaces. They were not in the homes of other families.  They were all going to <br/>\ncome home at some point.  Kirby, 12:30 after he cleaned the shop.  Marty, before <br/>\n12 because he has a provisional license and isn&#39;t supposed to drive after <br/>\nmidnight.  Holly, whenever.<br/>\n<br/>\nIt was scary for me.  My husband was really comforting, said Crystal&#39;s great <br/>\nwith our kids, that Marty&#39;s fine to drive that.<br/>\n<br/>\nI went to sleep without any of my kids home.  <br/>\nI woke up and they were all in their beds, the van was fine.<br/>\n<br/>\nHolly told me the next day that at one point it occurred to her that I might <br/>\nbe worrying and thinking they were all in different places, but that she and <br/>\nCrystal were (at the moment she thought of it) with Kirby, where he works.<br/>\n<br/>\nLast night Marty returned from having seen a movie at the dollar movies with <br/>\nfriends, and left again to hang around the new apartment of a friend of his.  <br/>\nI wouldn&#39;t have cared how late he was out.  He was back within an hour.<br/>\n<br/>\nThey are real-live evidence (not proof, that takes more than a single-family <br/>\nsample of three) that children who have grown up with freedom can be given <br/>\nLOTS of freedom as they get older without going crazy or living dangerously or <br/>\n&quot;running wild.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092671489","msgId":98111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1OS4zY2EzYzRmMC4yZTUyMzIwMUBhb2wuY29tPg=="},"prevInTopic":98110,"nextInTopic":98117,"prevInTime":98110,"nextInTime":98112,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/16/04 5:30:40 AM, fetteroll@earthlink.net writes:  For me, I don t let my 3 year old watch ... ","messageBody":"<div id=\"ygrps-yiv-1527230883\">In a message dated 8/16/04 5:30:40 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\n&lt;&lt; &gt; For me, I don&#39;t let my 3 year old watch<br/>\n<blockquote><span title=\"ireply\"> &gt; stuff that I know has violence in it or stuff that is<br/>\n&gt; sexually explicit.<br/>\n<br/>\n </span></blockquote>&lt;&lt;Does your 3 yo want to watch those? &gt;&gt;<br/>\n<br/>\nWithout choice, there is no choice.<br/>\nWithout options, no one can make a good decision.<br/>\nNo one can make a generous decision, or a gracious or mature decision, unless <br/>\nthey have the leeway to decide.<br/>\n<br/>\nAnd unless a parent loosens up, she will assume her child is being the way <br/>\nshe is because the mom set her on a narrow path.   If she takes the reins off, <br/>\nthe child will probably not run crazy and leave.<br/>\n<br/>\nWhich children DO run crazy and leave?<br/>\nThose whose reins were too tight for too long.<br/>\n<br/>\nWe have a dog who can get out of our yard but doesn&#39;t.  Or she does, but she <br/>\ndoesn&#39;t go away.    We don&#39;t even have a fence or wall between the front and <br/>\nback on one side anymore.  She has a dog door, and we have no fence.  Yet she&#39;s <br/>\nalways home.  She might be in the front, if something exciting is happening, <br/>\nbut she doesn&#39;t have the urge to run away.    She used to explore the vacant <br/>\nlot, but as she got older she quit.  We take her on walks without a leash and <br/>\nshe stays with us.<br/>\n<br/>\nNot true of any of our neighbors&#39; dogs, who will come to our house if they <br/>\nget a chance, or run far and fast (different dogs different ways).<br/>\n<br/>\nI have a related story I&#39;ll tell separately, about my kids being out and <br/>\nabout.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":4324016,"authorName":"Kelly Muzyczka","from":"Kelly Muzyczka &lt;mina@...&gt;","profile":"mommamina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092670443","msgId":98110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMS4yLjAuMC4yMDA0MDgxNjExMzE0OC4wMjUzNGM0MEBzbXRwLm1hYmIubmV0Pg==","inReplyToHeader":"PDIwMDQwODE2MDI0NTU5LjU0Mzg5LnFtYWlsQHdlYjExMzA2Lm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDQwODE2MDI0NTU5LjU0Mzg5LnFtYWlsQHdlYjExMzA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":98103,"nextInTopic":98111,"prevInTime":98109,"nextInTime":98111,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"... Sure, what is appropriate for YOUR child at that age. My three year old watches the Tolkein movies by himself.  He ll go up to his brother s room and go","messageBody":"<div id=\"ygrps-yiv-524466607\"><blockquote><span title=\"ireply\">&gt;Is there such a thing as age appropriateness regarding<br/>\n&gt;TV/videos in the unschooling world?<br/>\n&gt;<br/>\n&gt;-Jennefer<br/>\n<br/>\n<br/>\n </span></blockquote>Sure, what is appropriate for YOUR child at that age.<br/>\n<br/>\nMy three year old watches the Tolkein movies by himself.  He&#39;ll go up to <br/>\nhis brother&#39;s room and go through two of them in a row.  He can tell you <br/>\nall about who the characters are, what they are doing, etc.<br/>\n<br/>\nMy girlfriend&#39;s four year old would have horrible nightmare and can&#39;t watch <br/>\nthe beginning of Nemo without wigging.  (He hates the diver.)<br/>\n<br/>\nKelly</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092670267","msgId":98103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0My4zMGE2NjA2YS4yZTUyMmQzYkBhb2wuY29tPg=="},"prevInTopic":98084,"nextInTopic":98110,"prevInTime":98102,"nextInTime":98104,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/16/2004 12:37:17 AM Eastern Daylight Time, jenneferh2000@yahoo.com writes: It seems  like there are some unschooling families with young","messageBody":"<div id=\"ygrps-yiv-941208348\">In a message dated 8/16/2004 12:37:17 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenneferh2000@...\">jenneferh2000@...</a> writes:<br/>\n<br/>\nIt seems  like there are some &#39;unschooling&#39; families with<br/>\nyoung children &#39;preschool&#39;  age or younger (3 years old<br/>\nhere) who only selectively let there children  watch TV<br/>\nor videos.  For me, I don&#39;t let my 3 year old watch<br/>\nstuff  that I know has violence in it or stuff that is<br/>\nsexually explicit.   For example, we don&#39;t watch the<br/>\nTolkien movies or The Sopranos when he&#39;s  awake.  &lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nBut do they ASK to watch these movies? Would they want to? I&#39;ve never met a  <br/>\nthree year old who would spend more than a minute or two in front of The  <br/>\nSopranos, for example, without leaving the room or doing something else. And if  <br/>\nthe &quot;something else&quot; would be to play with me, then The Sopranos could  wait.<br/>\n <br/>\nMost three year olds would rather watch what IS considered &quot;age  appropriate&quot; <br/>\nshows like Teletubbies and Mr Rogers, and Robyn&#39;s favorite, Max  & Ruby. &lt;g&gt;<br/>\n <br/>\nWhat did *we* watch? We only had Captain Kangaroo in the morning and Mr  <br/>\nRogers & Electric Company in the afternoon. I&#39;d watch The Lone  Ranger  (age <br/>\nappropriate? I don&#39;t think so!) and Batman and Zorro. I  loved Dark Shadows---and I <br/>\nwas six when I started watching that. And all those  westerns.<br/>\n <br/>\nDuncan (8) went to Blockbuster the other day with my father. He picked up  RL <br/>\nStine&#39;s &quot;The Werewolf of Fever Swamp&quot;. He asked that I watch it with him, so  <br/>\nwe snuggled up on his bed. We didn&#39;t get three minutes into it when he says, <br/>\n&quot;I  can&#39;t watch this. Too scary. Want to play chess?&quot;<br/>\n <br/>\nI reminded him that *I* was there, that it was only a movie with actors and  <br/>\nmake-up, and that he did NOT have to watch anything he didn&#39;t want to. No  <br/>\nproblem. We played chess.<br/>\n <br/>\nThe next day, he asked again that I watch it with him. Before he  put it in, <br/>\nhe asked a little more about actors and make-up and RL Stine and  stuff. Then <br/>\nwe got down to watching it. Several times, I saw him lips mouthing,  &quot;It&#39;s <br/>\njust a movie. It&#39;s just a movie.&quot; I&#39;d also point out how silly something  <br/>\nwas---like when they&#39;re walking through the dark house without turning on ONE  light. <br/>\nI said, &quot;Would YOU do that?&quot; It&#39;s, of course, scarier when they DON&#39;T!  &lt;G&gt; <br/>\nAnd that&#39;s the point----to scare you. After a while, he started to  laugh and <br/>\npoint out other silly things and how girls HAVE to trip and fall in  each and <br/>\nevery scary movie. &lt;g&gt;.We figured out *who* the werewolf was, and  laughed <br/>\nabout that too.<br/>\n <br/>\nHis brother&#39;s out of town so he slept downstairs that night, and with me  and <br/>\nBen last night. But he&#39;s OK with werewolves today. We might even watch it  <br/>\nagain! &lt;G&gt;<br/>\n <br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Is there such a thing as age appropriateness  regarding TV/videos in the <br/>\n </span></blockquote>unschooling world?&lt;&lt;&lt;&lt;<br/>\n <br/>\nSure. In *my* little unschooling world. &lt;g&gt; Everyone decides  when he&#39;s ready <br/>\nto watch whatever he wants to. Here, little kids prefer cartoons  and shows <br/>\nabout animals. Bigger kids watch cartoons  and adventure. Teens like comedy and <br/>\nmusic. Adults like all of  these &lt;g&gt; Plus the Olympics, the Hitler Channel <br/>\nand House Porn.  &lt;G&gt;<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092659256","msgId":98084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlNi4yN2NkZDZlZi4yZTUyMDIzOEBhb2wuY29tPg=="},"prevInTopic":98080,"nextInTopic":98103,"prevInTime":98083,"nextInTime":98085,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/16/2004 6:30:39 AM Central Standard Time, fetteroll@earthlink.net writes: They  appreciate help in finding what they want and avoiding","messageBody":"<div id=\"ygrps-yiv-1555177057\">In a message dated 8/16/2004 6:30:39 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\nThey  appreciate help in finding what they want and avoiding what they don&#39;t<br/>\nwant  just as adults do. We can give them information and advice, but they<br/>\nwant  to make their own decisions.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nWe watched Haunted Mansion last night.  Or, 2 of us did.  When it  got to the <br/>\npart when Eddie Murphy was in the crypt and the skeletons started  coming out <br/>\nof the coffins, I had to leave.  I said, &quot;I have issues.&quot; and  grinned at my <br/>\nhusband and left the room.<br/>\n <br/>\nIt reminded me of a really traumatic nightmare I had when I was a child,  <br/>\nafter watching, of all things, &quot;Abbot and Costello Meet Dracula and  <br/>\nFrankenstein.&quot;  That day my mother had really scrubbed my room, and  rearranged it, and <br/>\nmoved the bed so it was at an angle, sticking out in the  middle of the room <br/>\nfrom the corner.  I remember I had sponge curlers in my  hair for some reason, <br/>\nand clean summer cotton pajamas.  So that night we  watched the movie, and I <br/>\nwent to bed in my spotless room and the light was still  on when I had the <br/>\nnightmare about Dracula and Frankenstein, in their coffins, on  either side of my <br/>\nbed.  They came out of their coffins, of course.<br/>\n <br/>\nIt&#39;s a vivid dream, even still, and I can still see my room and feel that  <br/>\nlurch in my chest from when you sob in your sleep.  And when I saw that  scene <br/>\nin Haunted Mansion it all came back.  <br/>\n <br/>\nSo, warn me if there are skeletons coming out of coffins.<br/>\n<br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092655832","msgId":98080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJENDYxMzE4LjJBMEQ3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDQwODE2MDI0NTU5LjU0Mzg5LnFtYWlsQHdlYjExMzA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":98071,"nextInTopic":98084,"prevInTime":98079,"nextInTime":98081,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"... Always the case. ... Does your 3 yo want to watch those? When the world is divided into what we want them to see and what we don t want them to see, the","messageBody":"<div id=\"ygrps-yiv-413916965\">on 8/15/04 10:45 PM, jennefer harper at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenneferh2000@...\">jenneferh2000@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Excuse my probably basic question here, but has this<br/>\n&gt; always been the case, or was there a certain age when<br/>\n&gt; you started to let her watch whatever she wants?<br/>\n<br/>\n </span></blockquote>Always the case.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For me, I don&#39;t let my 3 year old watch<br/>\n&gt; stuff that I know has violence in it or stuff that is<br/>\n&gt; sexually explicit.<br/>\n<br/>\n </span></blockquote>Does your 3 yo want to watch those?<br/>\n<br/>\nWhen the world is divided into what we want them to see and what we don&#39;t<br/>\nwant them to see, the &quot;dangerous&quot; things become more attractive and they&#39;ll<br/>\nwant to check out what&#39;s so mysteriously threatening, and perhaps try out<br/>\nwhether they can handle it or not.<br/>\n<br/>\nWhen the world is divided into what they want to experience and what they<br/>\ndon&#39;t want to experience, why would they choose to experience what they<br/>\ndon&#39;t want to experience?<br/>\n<br/>\nI can watch porn. But I don&#39;t want to. So why would I watch it?<br/>\n<br/>\nThey appreciate help in finding what they want and avoiding what they don&#39;t<br/>\nwant just as adults do. We can give them information and advice, but they<br/>\nwant to make their own decisions.<br/>\n<br/>\nAnd when they&#39;re allowed to make their own decisions, they learn more about<br/>\nthemselves and what they&#39;re capable of. *And* learn more about making<br/>\ndecisions.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092634630","msgId":98071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxRkE0RDBCLUVGNDYtMTFEOC1CREY2LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDIwMDQwODE2MDI0NTU5LjU0Mzg5LnFtYWlsQHdlYjExMzA2Lm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDQwODE2MDI0NTU5LjU0Mzg5LnFtYWlsQHdlYjExMzA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":98066,"nextInTopic":98080,"prevInTime":98070,"nextInTime":98072,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"... Yes. We are not hands-off parents. Don t picture our children alone with a tv - that just isn t how it is. We chose carefully what to watch ourselves when","messageBody":"<div id=\"ygrps-yiv-985653867\">On Aug 15, 2004, at 7:45 PM, jennefer harper wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there such a thing as age appropriateness regarding<br/>\n&gt; TV/videos in the unschooling world?<br/>\n<br/>\n </span></blockquote>Yes. We are not hands-off parents. Don&#39;t picture our children alone <br/>\nwith a tv - that just isn&#39;t how it is.<br/>\nWe chose carefully what to watch ourselves when the kids were around. <br/>\nWe encouraged shows we thought were great by being enthusiastic and <br/>\nenjoying them together - Mr. Rogers, Magic School Bus, etc. We chose <br/>\nmovies that we could all enjoy. We muted or switched channels when we <br/>\nthought things were coming on that might be disturbing. My kids didn&#39;t <br/>\nwatch a lot of commercial tv, because there was just so much truly <br/>\ngreat programming on PBS that it took up most of the time they had for <br/>\ntv.<br/>\n<br/>\nThe hardest thing for me was never what we watched, but has been that <br/>\nmy kids love to watch the same thing over and over - and I really like <br/>\nto watch new stuff.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Age Appropriatenes Was ....","postDate":"1092633746","msgId":98066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDViLjU2NGE0NDA1LjJlNTE5ZTkyQGFvbC5jb20+"},"prevInTopic":98060,"nextInTopic":98071,"prevInTime":98065,"nextInTime":98067,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/15/04 10:37:20 PM, jenneferh2000@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1307807856\">In a message dated 8/15/04 10:37:20 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenneferh2000@...\">jenneferh2000@...</a> writes:<br/>\n<br/>\n&lt;&lt; For me, I don&#39;t let my 3 year old watch<br/>\nstuff that I know has violence in it or stuff that is<br/>\nsexually explicit.  For example, we don&#39;t watch the<br/>\nTolkien movies or The Sopranos when he&#39;s awake.   &gt;&gt;<br/>\n<br/>\nThere are movies I still warn my kids away from, or that I&#39;ll turn off if <br/>\nthey come in.   I have &quot;Last Tango in Paris&quot; rented.  I watched half, and will <br/>\nwatch half tomorrow.  I&#39;m not inviting anyone else to watch it with me.<br/>\n<br/>\nIf one of them saw it and asked to watch it, I&#39;d give a light warning and let <br/>\nthem.   They&#39;re 12 and 15.  (The other&#39;s out of town until after the movie <br/>\ngoes back.)<br/>\n<br/>\n-=-Is there such a thing as age appropriateness regarding<br/>\nTV/videos in the unschooling world?-=-<br/>\n<br/>\nI don&#39;t think there&#39;s an unschooling world.  There&#39;s just a world.<br/>\nWithin the principle of treating children as we would treat other people, is <br/>\nthere age appropriateness?   <br/>\n<br/>\nFor me, no.  But that doesn&#39;t mean there is no criteria for making <br/>\nrecommendations.   <br/>\nI have a 55 year old friend who can&#39;t see movies with snakes, so I let her <br/>\nknow if I&#39;ve seen one she should avoid, and I would never put a video with a <br/>\nsnake in it on while she was here.<br/>\n<br/>\nI have a 36 year old friend who was spanked, slapped and thrown around by <br/>\nhalf a dozen parents and stepparents, and a show with any kind of child crying <br/>\nfrom parental abuse is horrible for her.  I shelter her when I can.<br/>\n<br/>\nNone of my kids mind snakes.  <br/>\nKirby (18) doesn&#39;t like horror shows or monster movies (avoids even light <br/>\ncreepiness).<br/>\n<br/>\nI see it as a case-by-case thing.  When my kids were little they liked <br/>\ncartoons, and movies with pets and kids.   <br/>\n<br/>\nThey still do, but they&#39;ve added other things gradually over the years. &lt;g&gt;<br/>\n<br/>\nI never did an age thing. Never anything like &quot;You can watch it when you&#39;re <br/>\n12.&quot;  <br/>\n<br/>\nWe live near a video rental store, and I have the kids on the account, and <br/>\nhave them marked with their real birthdays, but also a note that they&#39;re not <br/>\nrestricted in what they can rent.   It&#39;s possible there for an account-holder to <br/>\nput limits on what can be rented, even if the others are adults!!!   I could <br/>\nprevent my husband from renting R rated movies, I guess.  Seems so.<br/>\n<br/>\nMy kids aren&#39;t sneaky, and they let us know what they&#39;re watching, or they <br/>\nwatch it with us.<br/>\n<br/>\nThey will warn me about movies they think are too rough for me, too, or just <br/>\nnot the kind of thing they think I&#39;d like.   They recommend things they think <br/>\nI WOULD like.   It works both ways, in all directions.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":9206405,"authorName":"jimpetersonl","from":"&quot;jimpetersonl&quot; &lt;jimpetersonl@...&gt;","profile":"jimpetersonl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Age Appropriatenes Was ....","postDate":"1092629569","msgId":98060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmcGM4MSs1ZnZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwODE2MDI0NTU5LjU0Mzg5LnFtYWlsQHdlYjExMzA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":98056,"nextInTopic":98066,"prevInTime":98059,"nextInTime":98061,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"... The answer I ve often seen is, No, they are age appropriate in their selections. ~Sue","messageBody":"<div id=\"ygrps-yiv-1265760512\"><blockquote><span title=\"ireply\">&gt; Is there such a thing as age appropriateness regarding<br/>\n&gt; TV/videos in the unschooling world?<br/>\n&gt; <br/>\n&gt; -Jennefer<br/>\n<br/>\n<br/>\n </span></blockquote>The answer I&#39;ve often seen is, &quot;No, they are age appropriate in their<br/>\nselections.&quot;<br/>\n<br/>\n~Sue</div>","specialLinks":[]},{"userId":86181566,"authorName":"jennefer harper","from":"jennefer harper &lt;jenneferh2000@...&gt;","profile":"jenneferh2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Age Appropriatenes Was ....","postDate":"1092624359","msgId":98056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODE2MDI0NTU5LjU0Mzg5LnFtYWlsQHdlYjExMzA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":98060,"prevInTime":98055,"nextInTime":98057,"topicId":98056,"numMessagesInTopic":0,"msgSnippet":"... Excuse my probably basic question here, but has this always been the case, or was there a certain age when you started to let her watch whatever she wants?","messageBody":"<div id=\"ygrps-yiv-42911055\"><blockquote><span title=\"ireply\">&gt;My daughter can watch whatever she wants. She doesn&#39;t<br/>\n&gt;choose to watch <br/>\n&gt;what<br/>\n&gt;she doesn&#39;t want to see. If I know that a movie or<br/>\n&gt;show has scenes that<br/>\n&gt;might bother her, I&#39;ll warn her.<br/>\n<br/>\n </span></blockquote>Excuse my probably basic question here, but has this<br/>\nalways been the case, or was there a certain age when<br/>\nyou started to let her watch whatever she wants?  It<br/>\nseems like there are some &#39;unschooling&#39; families with<br/>\nyoung children &#39;preschool&#39; age or younger (3 years old<br/>\nhere) who only selectively let there children watch TV<br/>\nor videos.  For me, I don&#39;t let my 3 year old watch<br/>\nstuff that I know has violence in it or stuff that is<br/>\nsexually explicit.  For example, we don&#39;t watch the<br/>\nTolkien movies or The Sopranos when he&#39;s awake.  <br/>\n<br/>\nIs there such a thing as age appropriateness regarding<br/>\nTV/videos in the unschooling world?<br/>\n<br/>\n-Jennefer<br/>\n<br/>\n<br/>\n\t\t<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail Address AutoComplete - You start. We finish.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/new_mail\">http://promotions.yahoo.com/new_mail</a></div>","specialLinks":[]}],"prevTopicId":98091,"nextTopicId":88607}}