{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"teens, unschooled and otherwise","postDate":"1131399197","msgId":109367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0My41MTNhZjViNy4zMGExMjIxZEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":109366,"nextInTime":109368,"topicId":109367,"numMessagesInTopic":0,"msgSnippet":"I wanted something to read while I was having lunch, so I clicked on a homeschooling blog ring and read something a little sad.   In the description of the ","messageBody":"<div id=\"ygrps-yiv-2031288421\">I wanted something to read while I was having lunch, so I clicked on a <br/>\nhomeschooling blog ring and read something a little sad.   In the description of the <br/>\nblog the mom had specified right early and clearly that her method was <br/>\neclectic.   After reading about another slightly younger child for whom she finds <br/>\nreading and math instruction online, I read this:<br/>\n<br/>\n-=-My daughter, age 16, is going her own way, refusing to believe that she <br/>\ndoesn&#39;t have to attend public highschool to succeed in college. She&#39;s been a <br/>\nrebellion factory for years now - this is nothing new. I know if I wanted her to <br/>\nattend a public school she would be begging for homeschool.-=-<br/>\n<br/>\n<br/>\n&quot;Refusing to believe&quot;?<br/>\nThat phrase doesn&#39;t come up at our house.   <br/>\n<br/>\nI think mostly it&#39;s because I don&#39;t just TELL my kids that something is or <br/>\nisn&#39;t true, I try to find evidence so they can see for themselves and believe it <br/>\nbecause of proof.   There&#39;s no refusal to believe what is clearly shown.   <br/>\n<br/>\nKirby brakes quickly and later than I would, when he drives.   I&#39;ve told him <br/>\na couple of stories and reminded him that brakes CAN fail, and I told him that <br/>\nI wished he&#39;d be careful BEFORE he experiences brake failure.   He didn&#39;t <br/>\n&quot;refuse to believe&quot; it, he tries to do it my way, but his belief so far is based <br/>\non his own experience.   <br/>\n<br/>\nThe other day he bumped the back of a pickup (or SUV or something high).   He <br/>\nwas in a big van.   They were big.   He didn&#39;t hit hard.   The other car <br/>\nturned right from the middle lane, so Kirby followed figuring they wanted to pull <br/>\nover and discuss insurance, maybe call the police, all that.   (For those <br/>\nlocals wanting to picture this, he was coming south/downhill on Juan Tabo and it <br/>\nhappened just before the light at Comanche; they turned right onto Comanche.)   <br/>\n  So...   He&#39;s following politely as as he should, and they speed up and take <br/>\noff.   He pulls into a parking lot to look at the van.   Some part of the <br/>\nplastic edges of the bumper cover (aren&#39;t cars irritating sometimes!?) is gone, <br/>\nso he went back to the scene and retrieved it.<br/>\n<br/>\nNOW Kirby knows what can happen if you count too much on the magic of brakes. <br/>\n  Now he KNOWS.   He was lucky not to get a ticket and a moving violation.   <br/>\nHe felt it was the other driver&#39;s fault, for doing some weird <br/>\nstop-and-start-and-hesitate thing about maybe changing lanes.   I reminded him it&#39;s his job to <br/>\ngive all the cars in front of him room to do that very thing.<br/>\n<br/>\nSo back to the reported 16-year-old rebellion factory...<br/>\n<br/>\nThe conditions required to create rebellion don&#39;t exist at my house.<br/>\nI don&#39;t think unschooling provides a good environment for a rebellion factory <br/>\nto emerge.<br/>\n<br/>\nHolly (14 now) very seriously considered going to 8th grade.   She talked <br/>\nabout it for over a year, and a dozen times, we lurked around the middle school <br/>\nwhen kids were arriving or leaving.   (Cameron Lovejoy went with us one day, so <br/>\nwe have a witness to Holly&#39;s fascination.)   Holly wasn&#39;t doing that out of <br/>\nrebellion or a refusal to believe.   She wanted to learn about school and <br/>\nschoolkids.   She wanted to see what she was missing.   <br/>\n<br/>\nA couple of all-day visits to another school (Sandia Prep) satisfied a lot of <br/>\nher curiosity.   Discussion with friends who had done school and homeschool <br/>\nboth convinced her that home was good for her.<br/>\n<br/>\nKirby, at 19, isn&#39;t a rebellion factory.<br/>\nMarty, 16, isn&#39;t a rebellion factory.<br/>\nHolly, 14, isn&#39;t a rebellion factory.<br/>\n<br/>\nJust thought I&#39;d mention that. &lt;g&gt;<br/>\n<br/>\nNext time I need lunchtime reading I&#39;ll go to the unschooling blogring!<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":109334,"nextTopicId":109368}}