{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":31,"messages":[{"userId":118371350,"authorName":"yaboobarb","from":"&quot;yaboobarb&quot; &lt;yaboobarb@...&gt;","profile":"yaboobarb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Tell me the ways in which you fulfill your child","postDate":"1268191652","msgId":51865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuNzNqNCsxYmxuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51854,"nextInTopic":51867,"prevInTime":51864,"nextInTime":51866,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"I have an 8 year old, a 5 year old and a 2.11 year old. I felt very bad for my daughter Delilah( 5) and then I felt angry at myself for not being able to give","messageBody":"<div id=\"ygrps-yiv-687042601\">I have an 8 year old, a 5 year old and a 2.11 year old.<br/>\n<br/>\nI felt very bad for my daughter Delilah( 5) and then I felt angry at myself for not being able to give her the attention that I felt she was needing. She was such a good girl, it was easy to brush her aside for the baby.<br/>\n<br/>\nI beat myself up,and then I hated myself and I was angry a lot and overwhelmed. ( because I  need me too.)<br/>\n<br/>\nI had a realization that my anger was at myself for not being perfect ( and not knowing how to make it better), and this was poisoning all of my moments with her.<br/>\n<br/>\nI realized that I could not make everything right, BUT I could have perfect moments. <br/>\nI would catch her eye and send her silent appreciation. <br/>\nI would make an effort to notice when she walked into the room, and beam some love her way.<br/>\nI would reach out and pull her into a hug when she was near me, even for one second.<br/>\nAlso, when the bay takes a nap I say things like, &quot; Hey, how about a little special time together?&quot; ( just saying special makes her beam.)<br/>\n<br/>\nI also try to let my husband care for the little one if she needs something when I am spending my &quot;moments&quot; with my 5yr old. I will say, &quot; Daddy, I think the baby needs help, can you help her? I am spending special time here with Delilah.&quot;<br/>\n<br/>\nI have seen her glow and appreciate these special moments. She seems more fulfilled and happy. ( And I still am not perfect! :)<br/>\n<br/>\nHere is something I posted about that anger realization from another group:<br/>\n<br/>\nThat &quot;hard shell&quot; and playfulness<br/>\n <br/>\nThe e-mail below reminds me of a realization I have been living lately. For the past few years I have been able to see &quot;my hard shell&quot; and I<br/>\nhated it (me).<br/>\n<br/>\nThe hard shell to me is hard to explain but I will try the energy of it; it was attitude of anger, an almost biting down or shutting off, the opposite of playful. A meanness.<br/>\n<br/>\nWhen the children were jumpy or playful near me I would be like &quot;Ouch!<br/>\nYou hurt me!&quot; I had forgotten HOW to play. Playing games were tiring.<br/>\n<br/>\nI saw how I was being but I could not be different. I blamed and hated<br/>\nmyself for the way I was acting. That felt horrible too. This made the<br/>\nanger worse towards the kids in my trying to control them.<br/>\n<br/>\nI beat myself up. How could *I* be this way and not change it when I<br/>\nread practiced and immersed myself in LOA, Spirituality and Peaceful<br/>\nparenting etc. I knew how I wanted to be, but that playfulness seemed<br/>\nlike it was on another planet and all I could do is watch others enjoy<br/>\nit.<br/>\n<br/>\nFinally I had an awakening. I realized that *feeling* the anger was not bad. The anger rose and fell and was done. The energy of it was just an energy ( which was rich and full and amazing in itself). The problem was beating myself up and hating myself afterward.<br/>\n<br/>\nSome how I broke though. I laugh more-- delicious spontaneous laughter.<br/>\nI play more- easy present playful play. I am at peace more. I am<br/>\nexcited to start each day instead of wanting to stay in bed.<br/>\n<br/>\nWhat I do now when I am feeling strong emotions is say to myself,<br/>\n&#39;&quot;Wow! Will you look at that! Whooo!! I am angry!&quot; I will tell the<br/>\npeople around me, my husband or children, &quot; Oh oh, here it comes! I am<br/>\nfeeling angry and I don&#39;t know what to do with it!&quot;<br/>\n<br/>\nSometimes that even make me laugh and then it s over.<br/>\nWhat a little thing- having and emotion, riding it like a roller<br/>\ncoaster, then letting it pass and moving on.<br/>\n<br/>\nJust like a child.<br/>\n<br/>\n<br/>\nBarbara Rivera<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Laura Syria &lt;mandavia8@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; The thing that affected most after the births of my 5 and 3 year olds was that my oldest would never again get the attention she deserves. Â It broke my heart. Â It still gnaws at me. Â I feel like it&#39;s not possible for her to reap the benefits of unschooling. Â My rational mind says this is untrue. Â That I&#39;ll just have to work a </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268165020","msgId":51854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4MTM4Mi4xNDk4OC5xbUB3ZWIxMTA0MDEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRCOTY3NEM5LjUwNzA0MDJAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+IDw0Qjk2NzRDOS41MDcwNDAyQGVhcnRobGluay5uZXQ+"},"prevInTopic":51853,"nextInTopic":51865,"prevInTime":51853,"nextInTime":51855,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"***Make sure you re touching her (physically) in loving ways all throughout the day - just pat her as you walk by, give her a kiss on the top of her head,","messageBody":"<div id=\"ygrps-yiv-1304600644\">***Make sure you&#39;re touching her (physically) in loving ways all throughout <br/>\nthe day - just pat her as you walk by, give her a kiss on the top of her <br/>\nhead, squeeze her hand, etc.***<br/>\n<br/>\nI still do that to Chamille and she&#39;s 15 almost 16, in less than a month!  Last night she was really upset and crying.  I found her in her room crying all by herself.  I had no idea she was so sad, so I&#39;d asked her why she was crying and she didn&#39;t know why exactly, just felt sadness.  I told her that she shouldn&#39;t isolate herself like that, that she should come out and let her family cheer her up, that she should come snuggle up on the couch with me while we watch tv.  So she did.  She didn&#39;t entirely perk up, but she was able to get herself calm and get to a place where she could figure out why she was so sad, and most importantly, she was able to go to bed knowing that she was loved and that she doesn&#39;t have to carry the burden of sadness alone.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268164816","msgId":51853,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOTZBOEQwLjEwNjAwMDdAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDQ2ODM0LjQ2OTk4LnFtQHdlYjExMDQwNS5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+IDw0NjgzNC40Njk5OC5xbUB3ZWIxMTA0MDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":51852,"nextInTopic":51854,"prevInTime":51852,"nextInTime":51854,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"... I am also the oldest - I have two younger sisters - 3 and 6 years younger. I also felt displaced and jealous of the time my mom spent with my sisters. And","messageBody":"<div id=\"ygrps-yiv-65050197\">On 3/9/2010 11:41 AM, Jenny Cyphers wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My best suggestion is to stop feeling badly about it because that will <br/>\n&gt; only cause more bad feelings. Proactively find positive happy ways to <br/>\n&gt; be sweet and kind with that oldest child, the one that made you a mom. <br/>\n&gt; Give her more choices and more control over things like what the <br/>\n&gt; family should have for breakfast, what activity you guys could do that <br/>\n&gt; day, little positive things that let her know she really matters and <br/>\n&gt; that what she feels and thinks really matter.<br/>\n<br/>\n </span></blockquote>I am also the oldest - I have two younger sisters - 3 and 6 years <br/>\nyounger. I also felt displaced and jealous of the time my mom spent with <br/>\nmy sisters. And I also have memories, like Jenny&#39;s, of wanting to do bad <br/>\nthings to my sisters. There were many times I thought my life would be <br/>\nbetter without them. Sounds horrible, but its true.  BUT - I also have <br/>\nfantastic memories of wonderful wonderful times together. We played <br/>\ntogether a lot. I was fiercely protective of my younger sisters. When I <br/>\nwas 12, I got into an intense fistfight with a boy who was much bigger <br/>\nand stronger than I was - he was teasing my sister. And, even though I <br/>\nprobably would have said I couldn&#39;t stand my sisters, if my childhood or <br/>\nteenage self was asked, we&#39;ve grown up to be best friends.<br/>\n<br/>\nI&#39;ve thought a lot about how my parents handled our sibling rivalry and <br/>\nour jealousy of our parents&#39; attentions. I know I felt that I fairly <br/>\noften got special treatment for being the oldest - my mom and dad would <br/>\ndo little things with me that my little sisters were clearly not &quot;ready&quot; <br/>\nfor. My dad played adult card games (gin rummy and black jack) with me, <br/>\nfor example, when I was 7 or 8 years old and my sisters were only 1 and <br/>\n4 or so. I got to go out with the grownups, once in a while, while my <br/>\nsisters stayed with a babysitter - like to a coffee shop for dinner and <br/>\nmaybe to a movie. My dad took me fishing with him, off the pier. It was <br/>\na bit boring, but it was also a privilege that I appreciated, because he <br/>\nwouldn&#39;t have taken my sisters - they were too young and wouldn&#39;t have <br/>\nbeen patient enough. I remember my mom and dad taking me out to buy a <br/>\ncoat.We hardly ever went out at night, so this seemed exciting. I got to <br/>\nsit in the front seat of the car, between them, instead of the usual all <br/>\nthree of us girls in the back seat.<br/>\n<br/>\nLittle things leave big impressions.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268163683","msgId":51852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2ODM0LjQ2OTk4LnFtQHdlYjExMDQwNS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51848,"nextInTopic":51853,"prevInTime":51851,"nextInTime":51853,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"***When I leave with my oldest I will feel (have felt) so sad at leaving the others behind knowing that they want to come, too.  Do you think this is normal?","messageBody":"<div id=\"ygrps-yiv-1463074825\">***When I leave with my oldest I will feel (have felt) so sad at leaving the others behind knowing that they want to come, too.  Do you think this is normal? ***<br/>\n<br/>\nIt doesn&#39;t have to be that way though!  If you are going and doing something fun with the oldest, the younger 2 can do something fun with dad.  Instead of seeing it as them missing out on something, help them get something just as fun and cool with their dad.<br/>\n<br/>\n***The thing that holds me back is that we are on a tight budget and I don&#39;t think I can afford that.  After writing that, though, I see that if it&#39;s important then I will need to budget for that. ***<br/>\n<br/>\nIt might help all around if you look at this as something small, not something huge.  Go for a walk with her, just the two of you, or go window shopping at the mall, or take her along for the grocery trip.  It doesn&#39;t have to be something big and expensive.  It&#39;s about one on one connections and sometimes the simple everyday things are the biggest ones.  Next time she needs new shoes, take her without the siblings, stop and get some milkshakes at a drive through, that sort of thing.  <br/>\n<br/>\n*** I just feel so heartbroken about the way that we have become disconnected because of something out of her control.  I, too, was the oldest in our family and it was horrible for me.***<br/>\n<br/>\nI was the oldest too.  My sister and I are almost exactly one year apart.  I remember one time when I was about 2 yrs old, taking my diaper off to pee on her.  I don&#39;t remember if I actually did it, my mom probably caught me and put my diaper back on, but I do remember very clearly taking my diaper off with the intent to pee on my little sister because at that moment I didn&#39;t want her there.  The rest of my childhood with my sister was pretty good.  We are still pretty close.<br/>\n<br/>\nMy best suggestion is to stop feeling badly about it because that will only cause more bad feelings.  Proactively find positive happy ways to be sweet and kind with that oldest child, the one that made you a mom.  Give her more choices and more control over things like what the family should have for breakfast, what activity you guys could do that day, little positive things that let her know she really matters and that what she feels and thinks really matter.<br/>\n<br/>\nToday, I&#39;m making cookies with my youngest.  That will be our big connecting moment today, among many small ones I&#39;m sure.  We made plans to do it last night.  Everyone benefits from us baking cookies.  My oldest daughter was really wanting something sweet last night and we didn&#39;t have anything, so I thought making cookies would be fun, but it was too late last night to do that.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268151497","msgId":51848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOTY3NEM5LjUwNzA0MDJAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51847,"nextInTopic":51852,"prevInTime":51847,"nextInTime":51849,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"... Go to the library. Go walk in a park. Push her on the swings. Walk in an interesting place (where I live we might go walk to the end of a pier). Go to a 99","messageBody":"<div id=\"ygrps-yiv-1632406041\">On 3/9/2010 6:44 AM, Laura Syria wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; After writing that, though, I see that if it&#39;s important then I will <br/>\n&gt; need to budget for that. <br/>\n<br/>\n </span></blockquote>Go to the library. Go walk in a park. Push her on the swings. Walk in an <br/>\ninteresting place (where I live we might go walk to the end of a pier). <br/>\nGo to a 99 cent store and each of you spend 99 cents. Visit historical <br/>\nsites or monuments. Get a zoo or aquarium or a science or children&#39;s <br/>\nmuseum membership so you can go there over and over for no extra charge <br/>\nand so you can go for short periods without feeling you have to get your <br/>\nmoney&#39;s worth. Don&#39;t go out for a big meal, just go to Starbucks for a <br/>\nspecial cup of cocoa.<br/>\n<br/>\nThe important thing is to spend some time a few times a week really <br/>\nfocused on her.<br/>\n<br/>\nThe rest of the time - give her minutes of focus - maybe try to give her <br/>\nat least 10 minutes every morning, afternoon, and evening of really <br/>\ndirect &quot;I&#39;m all yours&quot; focused attention. Maybe the ten minutes can&#39;t be <br/>\nall at one time.<br/>\n<br/>\nMake sure you&#39;re touching her (physically) in loving ways all throughout <br/>\nthe day - just pat her as you walk by, give her a kiss on the top of her <br/>\nhead, squeeze her hand, etc.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":279647515,"authorName":"d.lewis","from":"&quot;d.lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268149027","msgId":51847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyOEYxM0EyNTgzMTQyRkM4OTYzNDBFQ0EzMEQ3MzBGQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+IDw0QjExMTJCQi03RTlCLTQyRkYtOTEwQy01QzZBOUVGQzA1RjZAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":51845,"nextInTopic":51848,"prevInTime":51846,"nextInTime":51848,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"I don t know what sever epilepsy is.  I meant severe which you probably figured. ***Wow.  That s a LOT.*** She had all her babies at home, too.  She s","messageBody":"<div id=\"ygrps-yiv-657094598\">I don&#39;t know what sever epilepsy is.&lt;g&gt;  I meant &quot;severe&quot; which you probably <br/>\nfigured.<br/>\n<br/>\n***Wow.  That&#39;s a LOT.***<br/>\n<br/>\nShe had all her babies at home, too.  She&#39;s tough! &lt;g&gt;<br/>\n<br/>\nI hope she doesn&#39;t pester you.<br/>\n<br/>\nDeb</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268148304","msgId":51844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMTExMkJCLTdFOUItNDJGRi05MTBDLTVDNkE5RUZDMDVGNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51840,"nextInTopic":51845,"prevInTime":51843,"nextInTime":51845,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"-=-The thing that holds me back is that we are on a tight budget and I don t think I can afford that.  After writing that, though, I see that if it s important","messageBody":"<div id=\"ygrps-yiv-1687499508\">-=-The thing that holds me back is that we are on a tight budget and I  <br/>\ndon&#39;t think I can afford that.  After writing that, though, I see that  <br/>\nif it&#39;s important then I will need to budget for that.  -=-<br/>\n<br/>\nA session with a therapist is about five times as much as lunch out  <br/>\nwith a young child.  That&#39;s the way I think of it when I can&#39;t  <br/>\ndecide.  What&#39;s the likely effect of not doing it?<br/>\n<br/>\n-=-When I leave with my oldest I will feel (have felt) so sad at  <br/>\nleaving the others behind knowing that they want to come, too.  Do you  <br/>\nthink this is normal? -=-<br/>\n<br/>\nI&#39;m sure it is, but if you&#39;ve planned something fun for them to do  <br/>\nwhile you&#39;re gone, then everyone will have something to look forward to.<br/>\n<br/>\n-=- This is where I felt like other&#39;s stories about specifically their  <br/>\nsix year olds (but now I realize that what would really be helpful are  <br/>\nstories about six year olds who have younger siblings).  -=-<br/>\n<br/>\nI still don&#39;t think the &quot;six year old&quot; part should be a focus.  How  <br/>\ncould you have been different with her when she was five, or four?   <br/>\nWill you gather ideas for now and then abandon those when she&#39;s seven?<br/>\n<br/>\nThe principles of how to live with your children for unschooling to  <br/>\nwork don&#39;t have to do with ages.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268148095","msgId":51845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4NzUzOS42NDU4OS5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51844,"nextInTopic":51847,"prevInTime":51844,"nextInTime":51846,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"I had a 6 year old with a 3 year old younger sister. He and I hung out together when Linnaea was napping. We hung out all together. I don t think that Simon","messageBody":"<div id=\"ygrps-yiv-617762086\">I had a 6 year old with a 3 year old younger sister. He and I hung out together when Linnaea was napping. We hung out all together. I don&#39;t think that Simon and I went and did things together especially, but he didn&#39;t need that. He liked to sit on my lap and play a video game while David did something with Linnaea. But Simon didn&#39;t need me to be there for him more than I was, or if he did, I just made that time for him. <br/>\n<br/>\nThere are lots of things that you can do that are free. Go to a park and push her on the swings and sing and skip and talk and bring some chalk and draw on the sidewalk and dig in the sand and find the first flowers and look for 3 leaf clovers and watch ants and run up the slide and whatever. Use whatever publically funded, free to you, resources that are in your area to go and do something. <br/>\n<br/>\nDon&#39;t spend time feeling guilty, spend time with your daughter. Don&#39;t think about how good you could have been to her, how much attention she might have gotten, maximize how much attention she is getting right now. Find ways to get down and play with her, find things to do with her. Buy some face paints and paint her face. Paint all of your kids faces and then everybody run for the bath to wash off the weird feeling paint before it gets too itchy. See if she would like to make some cookies, get everybody to come and hang and help and knead and roll out, but let your eldest pick the kind and be the one who gets to have that special, picked the kind, feeling. <br/>\n<br/>\nIt isn&#39;t easy. It takes a lot of time and effort on your part. Feeling guilty or wrong or sad or like you can&#39;t solve it because of being heartbroken or damaged or any of that won&#39;t help. None of that will help your daughter feel more engaged and more connected with. What will help is putting aside your feelings of failure, of loss, of being overwhelmed and being with your daughter one minute at a time. The amazing thing is that the more you focus on making her life better and your other two children&#39;s lives better, the better you will feel about your own life. Hanging out with them, playing with finger paints, making play-doh, exploring the wonders of gloop, watching a movie, playing a video game, all of those things, those moments of laughing and sharing and enjoying, those will fill you up and make you feel so much richer. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Laura Syria &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mandavia8@...\">mandavia8@...</a>&gt;<br/>\n<br/>\nThe thing that affected most after the births of my 5 and 3 year olds was that my oldest would never again get the attention she deserves.  It broke my heart.  It still gnaws at me.  I feel like it&#39;s not possible for her to reap the benefits of unschooling.  My rational mind says this is untrue.  That I&#39;ll just have to work a lot harder.  I just feel so heartbroken about the way that we have become disconnected because of something out of her control.  I, too, was the oldest in our family and it was horrible for me.<br/>\nI like the idea of taking her out once a week.  We&#39;ve tried this in the past and it didn&#39;t work because the others were so small that they didn&#39;t understand why they weren&#39;t going, too.  Still, I know that they will want a time for me to be taking them out.  They should have that.  There&#39;s no reason not to. (Writing this out is great for me.)  The thing that holds me back is that we are on a tight budget and I don&#39;t think I can afford that.  After writing that, though, I see that if it&#39;s important then I will need to budget for that.  <br/>\nWhen I leave with my oldest I will feel (have felt) so sad at leaving the others behind knowing that they want to come, too.  Do you think this is normal?  This is where I felt like other&#39;s stories about specifically their six year olds (but now I realize that what would really be helpful are stories about six year olds who have younger siblings).  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126765637,"authorName":"Laura Syria","from":"Laura Syria &lt;mandavia8@...&gt;","profile":"mandavia8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268145887","msgId":51840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3NDg2My4yMTU3Mi5xbUB3ZWI1MTgwMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDM1RjgwRkQxLUEzMEQtNENENi05QTZELUFBOUJCMTM4MjU4RUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51826,"nextInTopic":51844,"prevInTime":51839,"nextInTime":51841,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"The thing that affected most after the births of my 5 and 3 year olds was that my oldest would never again get the attention she deserves.  It broke my heart.","messageBody":"<div id=\"ygrps-yiv-1980433246\">The thing that affected most after the births of my 5 and 3 year olds was that my oldest would never again get the attention she deserves.  It broke my heart.  It still gnaws at me.  I feel like it&#39;s not possible for her to reap the benefits of unschooling.  My rational mind says this is untrue.  That I&#39;ll just have to work a lot harder.  I just feel so heartbroken about the way that we have become disconnected because of something out of her control.  I, too, was the oldest in our family and it was horrible for me.<br/>\nI like the idea of taking her out once a week.  We&#39;ve tried this in the past and it didn&#39;t work because the others were so small that they didn&#39;t understand why they weren&#39;t going, too.  Still, I know that they will want a time for me to be taking them out.  They should have that.  There&#39;s no reason not to. (Writing this out is great for me.)  The thing that holds me back is that we are on a tight budget and I don&#39;t think I can afford that.  After writing that, though, I see that if it&#39;s important then I will need to budget for that.  <br/>\nWhen I leave with my oldest I will feel (have felt) so sad at leaving the others behind knowing that they want to come, too.  Do you think this is normal?  This is where I felt like other&#39;s stories about specifically their six year olds (but now I realize that what would really be helpful are stories about six year olds who have younger siblings).  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 3/8/10, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nSubject: Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Monday, March 8, 2010, 8:17 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      -=-my kids haven&#39;t learned how to occupy themselves.. .. And yet there  <br/>\n<br/>\nis a disconnect between my six year old and I.  We need to heal it.-=-<br/>\n<br/>\n<br/>\n<br/>\nAs an oldest, I can tell you that there is something sorrowful and  <br/>\n<br/>\ninfuriating about other children coming along.   She was an only child  <br/>\n<br/>\nfor a while and now you probably tell her &quot;later&quot; and &quot;not now&quot; a lot,  <br/>\n<br/>\nand if you&#39;re paying attention to her at all, you probably have a baby  <br/>\n<br/>\nwith you.<br/>\n<br/>\n<br/>\n<br/>\nIt would probably help a great deal if you could find a way to be with  <br/>\n<br/>\nher alone a time or two a week.  Maybe take her to lunch--not a little  <br/>\n<br/>\nkid playground lunch, but a sit-down with you.  Possibly you could let  <br/>\n<br/>\nher talk about whatever she wants to talk about or nothing at all.   <br/>\n<br/>\nSay a nice thing or two to her but don&#39;t talk about &quot;it.&quot; Don&#39;t say  <br/>\n<br/>\nyou want to take her to lunch to heal a disconnect.<br/>\n<br/>\n<br/>\n<br/>\nAt home, try to give her some special attention, too.   I can&#39;t guess  <br/>\n<br/>\nwhat she would like, but maybe letting her do the most fun parts of  <br/>\n<br/>\nthings with you, or instead of you.<br/>\n<br/>\n<br/>\n<br/>\nMaybe there&#39;s another family that could take her places with them to  <br/>\n<br/>\ndo things so she could be out and you could spend more time with the  <br/>\n<br/>\nmiddle kid?<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268097478","msgId":51826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1RjgwRkQxLUEzMEQtNENENi05QTZELUFBOUJCMTM4MjU4RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDI1MTU4OS4xMjg2NS5xbUB3ZWI1MTgwNC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDI1MTU4OS4xMjg2NS5xbUB3ZWI1MTgwNC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51822,"nextInTopic":51840,"prevInTime":51825,"nextInTime":51827,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"-=-my kids haven t learned how to occupy themselves.... And yet there is a disconnect between my six year old and I.  We need to heal it.-=- As an oldest, I","messageBody":"<div id=\"ygrps-yiv-2034212044\">-=-my kids haven&#39;t learned how to occupy themselves.... And yet there  <br/>\nis a disconnect between my six year old and I.  We need to heal it.-=-<br/>\n<br/>\nAs an oldest, I can tell you that there is something sorrowful and  <br/>\ninfuriating about other children coming along.   She was an only child  <br/>\nfor a while and now you probably tell her &quot;later&quot; and &quot;not now&quot; a lot,  <br/>\nand if you&#39;re paying attention to her at all, you probably have a baby  <br/>\nwith you.<br/>\n<br/>\nIt would probably help a great deal if you could find a way to be with  <br/>\nher alone a time or two a week.  Maybe take her to lunch--not a little  <br/>\nkid playground lunch, but a sit-down with you.  Possibly you could let  <br/>\nher talk about whatever she wants to talk about or nothing at all.   <br/>\nSay a nice thing or two to her but don&#39;t talk about &quot;it.&quot; Don&#39;t say  <br/>\nyou want to take her to lunch to heal a disconnect.<br/>\n<br/>\nAt home, try to give her some special attention, too.   I can&#39;t guess  <br/>\nwhat she would like, but maybe letting her do the most fun parts of  <br/>\nthings with you, or instead of you.<br/>\n<br/>\nMaybe there&#39;s another family that could take her places with them to  <br/>\ndo things so she could be out and you could spend more time with the  <br/>\nmiddle kid?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126765637,"authorName":"Laura Syria","from":"Laura Syria &lt;mandavia8@...&gt;","profile":"mandavia8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268088026","msgId":51822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1MTU4OS4xMjg2NS5xbUB3ZWI1MTgwNC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDgxNjgwMDc2LUU1REYtNDhDQi04MjRDLUQyMEU4QkZDRTlDNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51817,"nextInTopic":51826,"prevInTime":51821,"nextInTime":51823,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"I m appreciating these replies so much.  I m going to take some time really read the links provided and then I ll check back. Some backstory, for those who","messageBody":"<div id=\"ygrps-yiv-703240146\">I&#39;m appreciating these replies so much.  I&#39;m going to take some time really read the links provided and then I&#39;ll check back.<br/>\nSome backstory, for those who asked, is that she is the oldest of 3.  She has a 5 year old brother and a 3 year old sister.  I suffered pretty awful postpartum depression after the births of her siblings.  I think we disconnected a lot during that time.  I am also in therapy right now to deal with my abusive childhood and I&#39;m finding it so difficult to be present with them.  People around me (who don&#39;t understand unschooling and the way I WANT to do it) tell me I do too much.  That my kids haven&#39;t learned how to occupy themselves.  My kids are so young.  They want me to be with them.  I WANT to be there for them.  And yet there is a disconnect between my six year old and I.  We need to heal it.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 3/8/10, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\nFrom: Sandra Dodd &lt;Sandra@...&gt;<br/>\nSubject: Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child<br/>\nTo: AlwaysLearning@yahoogroups.com<br/>\nDate: Monday, March 8, 2010, 5:07 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      Another way to look at a curriculum:<br/>\n<br/>\nhttp://sandradodd. com/unschoolingc urriculum<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268086063","msgId":51817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxNjgwMDc2LUU1REYtNDhDQi04MjRDLUQyMEU4QkZDRTlDNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhuM3JwMCtydDU3QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuM3JwMCtydDU3QGVHcm91cHMuY29tPg=="},"prevInTopic":51815,"nextInTopic":51822,"prevInTime":51816,"nextInTime":51818,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"Another way to look at a curriculum: http://sandradodd.com/unschoolingcurriculum Sandra","messageBody":"<div id=\"ygrps-yiv-782916643\">Another way to look at a curriculum:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum\">http://sandradodd.com/unschoolingcurriculum</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":321996436,"authorName":"missalexmissalex","from":"&quot;missalexmissalex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Tell me the ways in which you fulfill your child","postDate":"1268085344","msgId":51815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuM3JwMCtydDU3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFOTNCRDRCLUU4QTctNDA3OC1CMzU2LTE0OTU4ODhENjdFMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51812,"nextInTopic":51817,"prevInTime":51814,"nextInTime":51816,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"... I want to be clear that when I suggested looking at curriculum, I was not suggesting adopting a curriculum!  My feeling is, your child is under the","messageBody":"<div id=\"ygrps-yiv-1189707841\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Laura Syria &lt;mandavia8@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I need to be clear, too, that we haven&#39;t tried curriculum because I want to unschool. Â I believe in the principles and I think my children deserve it. Â I&#39;m curious about what her life might be lacking that I&#39;m not seeing that will help her feel fulfilled.&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I want to be clear that when I suggested looking at curriculum, I was not suggesting adopting a curriculum!  My feeling is, your child is under the impression that other parents/teachers give their kids something that you are refusing to give to her. Until someone shows her something that is the famous *curriculum* to check out for herself, she might not be convinced that she doesn&#39;t want it. OF COURSE unschooling is a better life! She just doesn&#39;t have enough experience yet to know it. The other, more experienced posters have made me rethink my suggestion. Now I think in that position I might find the most hideously boring program in the world and let her figure it out for herself.;) We all know that curriculum is NOT exciting.Given lots of sparkly other options on a daily basis, I&#39;m guessing your daughter would come to the same conclusion very quickly. I was just thinking that it might be important for her to feel like she COULD have it if she wanted it.   <br/>\n<br/>\nAlex N.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268082448","msgId":51812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBNjc2MDI1LTgxNDgtNDlCRi04MzE2LTRFMEE5ODc2QjNGRkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDg4QzY2MzI1LUU4RTctNEM1RC04RkRFLUExODk2NzA0NjBGMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+IDwxMEQzNzdENS0zMzJGLTQ3REYtQTNCNS1BNjRDMzY3NDRDOUVAdmVyaXpvbi5uZXQ+IDw4OEM2NjMyNS1FOEU3LTRDNUQtOEZERS1BMTg5NjcwNDYwRjBAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":51806,"nextInTopic":51815,"prevInTime":51811,"nextInTime":51813,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"... Oh! Never mind, then! Do fun stuff. Find the things *she* loves and do more of that. Lyla already asked the questions that immediately popped into my head.","messageBody":"<div id=\"ygrps-yiv-131377328\">On Mar 8, 2010, at 1:58 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The child is six.<br/>\n<br/>\n </span></blockquote>Oh! Never mind, then!<br/>\n<br/>\nDo fun stuff. Find the things *she* loves and do more of that.<br/>\n<br/>\nLyla already asked the questions that immediately popped into my   <br/>\nhead. Who told her about curricula? What made it sound exciting?<br/>\n<br/>\nKathryn wanted to go to kindergarten. Turns out she thought they had  <br/>\nBig Wheels like in preschool.<br/>\n<br/>\nSo what does your daughter really mean when she says &quot;curricula&quot;?  <br/>\nWhat does she think it is? What&#39;s the exciting part that she thinks  <br/>\nit has?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268077074","msgId":51806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2ODEyNC4zODY1Ni5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDg4QzY2MzI1LUU4RTctNEM1RC04RkRFLUExODk2NzA0NjBGMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+IDwxMEQzNzdENS0zMzJGLTQ3REYtQTNCNS1BNjRDMzY3NDRDOUVAdmVyaXpvbi5uZXQ+IDw4OEM2NjMyNS1FOEU3LTRDNUQtOEZERS1BMTg5NjcwNDYwRjBAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":51802,"nextInTopic":51812,"prevInTime":51805,"nextInTime":51807,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"***Anecdotes that you re willing to share of ways you have connected with your 6 year old.*** Interestingly, I never really had a hard time connecting with my","messageBody":"<div id=\"ygrps-yiv-646054301\">***Anecdotes that you&#39;re willing to share of ways you have connected with <br/>\nyour 6 year old.***<br/>\n<br/>\nInterestingly, I never really had a hard time connecting with my kids when they were younger.  I could see what they liked and I added more of that and watched and then added something more and watched and then mixed it up and added more.  <br/>\n<br/>\nWhat&#39;s the background?  Has there been a disconnect?  Is this a child that grew up in daycares?  If that&#39;s the case, do easy kid things that most kids like.  Watch tv, go to the zoo, go to a toy store, read her fun books, play games.  If that&#39;s not the case, look at what she already does like and find something extra to add to it.  Last night, at our house, that involved finding batteries for one child, to put batteries in something that hadn&#39;t had batteries in it for a loooong time, and getting clear plastic hair bands for the oldest and taking her to her boyfriend&#39;s house to say hello for a few minutes after he was away for the whole weekend.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268075635","msgId":51802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNDI5MC44OTU3LnFtQHdlYjExMDQxMS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51797,"nextInTopic":51806,"prevInTime":51801,"nextInTime":51803,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"***I m curious about what her life might be lacking that I m not seeing that will help her feel fulfilled.  I don t think the answer is a curriculum. *** My","messageBody":"<div id=\"ygrps-yiv-768920659\">***I&#39;m curious about what her life might be lacking that I&#39;m not seeing that will help her feel fulfilled.  I don&#39;t think the answer is a curriculum. ***<br/>\n<br/>\nMy initial thought was, how old is your daughter and what does she like to do, what are her interests?  That is the kind of info that would be helpful in answering how you could make her life more interesting.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw@comcast.net","from":"&lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268074980","msgId":51797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":51796,"nextInTopic":51802,"prevInTime":51796,"nextInTime":51798,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"Wow.  How does a six year old even know what a curriculum IS or determine that it sounds exciting? Lyla","messageBody":"<div id=\"ygrps-yiv-2119683128\">Wow.  How does a six year old even know what a curriculum IS or determine that it sounds exciting?<br/>\n<br/>\nLyla</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268074706","msgId":51796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4QzY2MzI1LUU4RTctNEM1RC04RkRFLUExODk2NzA0NjBGMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEwRDM3N0Q1LTMzMkYtNDdERi1BM0I1LUE2NEMzNjc0NEM5RUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+IDwxMEQzNzdENS0zMzJGLTQ3REYtQTNCNS1BNjRDMzY3NDRDOUVAdmVyaXpvbi5uZXQ+"},"prevInTopic":51795,"nextInTopic":51797,"prevInTime":51795,"nextInTime":51797,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"-=-Is she by any chance pre or early teens? That s the age when kids can be (though not universally so!) drawn to more focused learning rather than the","messageBody":"<div id=\"ygrps-yiv-842366598\">-=-Is she by any chance pre or early teens? That&#39;s the age when kids can<br/>\nbe (though not universally so!) drawn to more focused learning rather<br/>\nthan the freeform &quot;what fun thing will we do today?&quot; of childhood.<br/>\nThat doesn&#39;t mean unschooling parents should be buying curricula for<br/>\nthem, but it might explain why she&#39;d think a curriculum sounded<br/>\n&quot;exciting.&quot;-=-<br/>\n<br/>\nThe child is six.<br/>\n<br/>\nThe original post, which I returned and requested re-phrasing on, was  <br/>\nthis:<br/>\n<br/>\n-=-I&#39;m looking for things you do/have done with your six year olds.   <br/>\nAnecdotes that you&#39;re willing to share of ways you have connected with  <br/>\nyour 6 year old.  I want to know where you are at/have been.  I want  <br/>\nto know what your unschooling life is/has been with your six year old.- <br/>\n=-<br/>\n<br/>\nI wrote<br/>\n<br/>\nLaura,<br/>\n<br/>\nThis isn&#39;t really appropriate, because unschooling is the same for a  <br/>\nsix year old as for a five or ten year old.<br/>\n<br/>\nI&#39;ll give you a few places you can look for ideas, and then if you  <br/>\nwant to word your question in a way that doesn&#39;t suggest six year olds  <br/>\nare different from seven year olds, ask it on the list.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/youngchildren\">http://sandradodd.com/youngchildren</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268074518","msgId":51795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2RTNDNDcwLUQ2M0MtNDZBQS1BMkY4LUIyQzRCMkEyMzI5QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk1NjY5MS43MjQxMC5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDk1NjY5MS43MjQxMC5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51794,"nextInTopic":51796,"prevInTime":51794,"nextInTime":51796,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"-=-These aren t quite the replies I was looking for.  All of the suggestions are nice but, really, we do all of those things.   I guess I m asking about ways","messageBody":"<div id=\"ygrps-yiv-402525108\">-=-These aren&#39;t quite the replies I was looking for.  All of the  <br/>\nsuggestions are nice but, really, we do all of those things.   I guess  <br/>\nI&#39;m asking about ways to go even deeper with your child.  To connect  <br/>\ndeeper.  How do you do that?-=-<br/>\n<br/>\nTell us what replies you&#39;re looking for.<br/>\n<br/>\n&quot;Even deeper&quot; is more of doing and being.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n<br/>\nPlease don&#39;t just glance at it and say &quot;nice, but...&quot;<br/>\nReally read, and watch your interactions, and see what&#39;s missing.<br/>\nWe can&#39;t see your house from here, but a great deal of ideas have  <br/>\nalready been suggested.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268074232","msgId":51794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY5NjQwQjk3LTY5RTAtNDdGQy05MjYwLTk2MkJBMjAxQjczREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51790,"nextInTopic":51795,"prevInTime":51793,"nextInTime":51795,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"-=-I m curious about what her life might be lacking that I m not seeing that will help her feel fulfilled.  ...  I want to get to the roots.-=- Warning!","messageBody":"<div id=\"ygrps-yiv-1060951742\">-=-I&#39;m curious about what her life might be lacking that I&#39;m not  <br/>\nseeing that will help her feel fulfilled.  ...  I want to get to the  <br/>\nroots.-=-<br/>\n<br/>\n<br/>\nWarning!  Alert!  Whoop whoop!  Red lights!<br/>\n<br/>\nThere are some AWESOME and wonderful analogies of children as plants,  <br/>\nchildren as trees.  You don&#39;t &quot;get to the roots.&quot;  You provide safety  <br/>\nand water.  You keep things from breaking it or walking on it or  <br/>\nclimbing in it before it&#39;s really big and old.<br/>\n<br/>\nDon&#39;t be curious.  Be attentive.<br/>\nDon&#39;t worry about what you&#39;re not seeing.  Look RIGHT at her, in small  <br/>\nmoments.  What could you do to make her more comfortable in ten  <br/>\nseconds?  What could you do after that?  Is there something fun you  <br/>\ncould bring out to share with her this afternoon?  Something  <br/>\ninteresting to read to her tonight?  Something different for the bath  <br/>\nor shower?<br/>\n<br/>\nEnrich her life.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268073825","msgId":51790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwRDM3N0Q1LTMzMkYtNDdERi1BM0I1LUE2NEMzNjc0NEM5RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51789,"nextInTopic":51794,"prevInTime":51789,"nextInTime":51791,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"... If I had been unschooled I can picture myself being curious about curricula. Obviously I can t know, but I think at 53 I m pretty well deschooled yet I","messageBody":"<div id=\"ygrps-yiv-732277914\">On Mar 8, 2010, at 10:42 AM, Laura Syria wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m curious about what her life might be lacking that I&#39;m not  <br/>\n&gt; seeing that will help her feel fulfilled.<br/>\n<br/>\n </span></blockquote>If I had been unschooled I can picture myself being curious about  <br/>\ncurricula. Obviously I can&#39;t know, but I think at 53 I&#39;m pretty well  <br/>\ndeschooled yet I love how-to style books that suggest they contain  <br/>\nall you need to know to get you up and running doing something:  <br/>\nwriting a song, playing guitar, drawing anime style, reading  <br/>\nJapanese ...<br/>\n<br/>\nCurricula suggest they&#39;re everything you need to know about subject x  <br/>\n(or for the year following year w to prepare you for year y.) There&#39;s  <br/>\nsomething very satisfying in that idea. As an engineer, I&#39;m not sure  <br/>\nwhy anyone *wouldn&#39;t* want something like that ;-)<br/>\n<br/>\nMaybe if you explore some with her -- without buying anything!  <br/>\nlibrary, borrowing, online -- as you discuss the good and bad points,  <br/>\nshe and you will be able to figure out what it is she&#39;s looking for.  <br/>\nCurricula tend to promise way more than they deliver because humans  <br/>\ndon&#39;t naturally learn linearly. So I think it&#39;s easy for someone to  <br/>\nsee the self-contained promise of &quot;all you need to know&quot; and get a  <br/>\ntingle, but realize after not too long how far off the promise is  <br/>\nfrom reality.<br/>\n<br/>\nIs she by any chance pre or early teens? That&#39;s the age when kids can  <br/>\nbe (though not universally so!) drawn to more focused learning rather  <br/>\nthan the freeform &quot;what fun thing will we do today?&quot; of childhood.  <br/>\nThat doesn&#39;t mean unschooling parents should be buying curricula for  <br/>\nthem, but it might explain why she&#39;d think a curriculum sounded  <br/>\n&quot;exciting.&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess I&#39;m asking about ways to go even deeper with your child.   <br/>\n&gt; To connect deeper.  How do you do that?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>To go deeper you&#39;ll probably need to describe the situation more  <br/>\nspecifically. Generalized questions tend to spark superficial answers.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268073710","msgId":51789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4MTMzMi4yNTU5Mi5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":51786,"nextInTopic":51790,"prevInTime":51788,"nextInTime":51790,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"... things in many different ways when she wants to.  She says, though, that she wants to use a curriculum because she thinks they are exciting.  Could you","messageBody":"<div id=\"ygrps-yiv-1610516284\">I&#39;m going to put in the original post as I&#39;m not always sure what a later post is referring to:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;--&lt;My daughter and I do lots of fun things together.  We explore many<br/>\n </span></blockquote>things in many different ways when she wants to.  She says, though,<br/>\nthat she wants to use a curriculum because she thinks they are<br/>\nexciting.  Could you share the ways in which you make your child&#39;s life<br/>\nricher when your child feels unfulfilled?&gt;--&lt;<br/>\n<br/>\nMy son, Simon, 12, is sitting next to me on his computer. I asked him what a curriculum was and he almost got it. He was really close, but not quite there. I can&#39;t imagine him or my 9 year old daughter, Linnaea, asking for a curriculum. Not just because they don&#39;t have the language for it, but because it would have had to be part of how they know the world. <br/>\n<br/>\nOf the two of them, Linnaea is the one most likely to feel agitated, antsy, bored. Is that what unfulfilled looks like? I don&#39;t know your daughter, but my daughter likes to get out and move it, do different things, go run with the dog, go biking, go swimming, get physical when she&#39;s bored. I can absolutely empathize with that and accomodate it. <br/>\n<br/>\nI think to figure out what your daughter wants you&#39;ll have to talk to your daughter, or think about your daughter. What kinds of things does she like doing? What kinds of things do you not do very often or have you never done that you think she would enjoy? Can you switch it up a bit? Is she suffering from end of winter cabin fever? Can you go somewhere totally different? Go see a magic show or a play or a nearby town or a cool thrift store or something that you haven&#39;t done for a while. If life is exciting and full of adventure, and it doesn&#39;t take a lot for life to be full of adventure and new ways of seeing, than the sense of ennui may fade. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\nI need to be clear, too, that we haven&#39;t tried curriculum because I want to unschool.  I believe in the principles and I think my children deserve it.  I&#39;m curious about what her life might be lacking that I&#39;m not seeing that will help her feel fulfilled.  I don&#39;t think the answer is a curriculum.  That answer sounds like the way our culture generally treats the symptoms to an illness but not the root cause.  I want to get to the roots.<br/>\n-<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126765637,"authorName":"Laura Syria","from":"Laura Syria &lt;mandavia8@...&gt;","profile":"mandavia8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268062979","msgId":51784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyMzYwMS4yODYwMi5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDNFOTNCRDRCLUU4QTctNDA3OC1CMzU2LTE0OTU4ODhENjdFMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51762,"nextInTopic":51786,"prevInTime":51783,"nextInTime":51785,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"I need to be clear, too, that we haven t tried curriculum because I want to unschool.  I believe in the principles and I think my children deserve it.  I m","messageBody":"<div id=\"ygrps-yiv-1652261994\">I need to be clear, too, that we haven&#39;t tried curriculum because I want to unschool.  I believe in the principles and I think my children deserve it.  I&#39;m curious about what her life might be lacking that I&#39;m not seeing that will help her feel fulfilled.  I don&#39;t think the answer is a curriculum.  That answer sounds like the way our culture generally treats the symptoms to an illness but not the root cause.  I want to get to the roots.<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 3/8/10, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\nFrom: Sandra Dodd &lt;Sandra@...&gt;<br/>\nSubject: Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child<br/>\nTo: AlwaysLearning@yahoogroups.com<br/>\nDate: Monday, March 8, 2010, 10:27 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      I hope I&#39;m repeating what someone else already posted while I was  <br/>\n<br/>\nasleep, but there is a problem with the whole curriculum thing for a  <br/>\n<br/>\nfamily that really does want to unschool.<br/>\n<br/>\n<br/>\n<br/>\nFor a family that thinks &quot;whatever&quot; is as good as &quot;seriously  <br/>\n<br/>\nunschooling, &quot; then it&#39;s not a problem.<br/>\n<br/>\n<br/>\n<br/>\n-=-If you daughter wants curriculum I have seen a few free online free  <br/>\n<br/>\nhomeschooling curriculum. I book mark them for my son on the computer  <br/>\n<br/>\nfor my son to explore if he wants. -=-<br/>\n<br/>\n<br/>\n<br/>\nIf anyone&#39;s daughter wants a curriculum and the mom doesn&#39;t see a  <br/>\n<br/>\nreason to try to distract her with bigger, better, more real-world  <br/>\n<br/>\nthings, then the mom is quite likely to encourage and praise whatever  <br/>\n<br/>\nshe does with that curriculum, which would be an indication that the  <br/>\n<br/>\nmother hasn&#39;t deschooled sufficiently to see the potential of  <br/>\n<br/>\nunschooling, or the realities of natural learning.<br/>\n<br/>\n<br/>\n<br/>\nKelly Lovejoy wrote something really clear and good about the stages  <br/>\n<br/>\nof unschooling.  I hope the link has already been left in this  <br/>\n<br/>\ndiscussion.<br/>\n<br/>\n<br/>\n<br/>\nhttp://sandradodd. com/kellylovejoy /stages<br/>\n<br/>\n<br/>\n<br/>\nThere are links to similar and back-up ideas there, too.<br/>\n<br/>\n<br/>\n<br/>\nThere must be a hundred lists that will encourage people not to really  <br/>\n<br/>\nunschool.  Let&#39;s keep this one on the DO IT end.<br/>\n<br/>\nhttp://sandradodd. com/doit<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268062049","msgId":51762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFOTNCRDRCLUU4QTctNDA3OC1CMzU2LTE0OTU4ODhENjdFMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhuMW12aitmdHFzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhuMW12aitmdHFzQGVHcm91cHMuY29tPg=="},"prevInTopic":51745,"nextInTopic":51784,"prevInTime":51761,"nextInTime":51763,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"I hope I m repeating what someone else already posted while I was asleep, but there is a problem with the whole curriculum thing for a family that really does","messageBody":"<div id=\"ygrps-yiv-954255917\">I hope I&#39;m repeating what someone else already posted while I was  <br/>\nasleep, but there is a problem with the whole curriculum thing for a  <br/>\nfamily that really does want to unschool.<br/>\n<br/>\nFor a family that thinks &quot;whatever&quot; is as good as &quot;seriously  <br/>\nunschooling,&quot; then it&#39;s not a problem.<br/>\n<br/>\n-=-If you daughter wants curriculum I have seen a few free online free  <br/>\nhomeschooling curriculum. I book mark them for my son on the computer  <br/>\nfor my son to explore if he wants. -=-<br/>\n<br/>\nIf anyone&#39;s daughter wants a curriculum and the mom doesn&#39;t see a  <br/>\nreason to try to distract her with bigger, better, more real-world  <br/>\nthings, then the mom is quite likely to encourage and praise whatever  <br/>\nshe does with that curriculum, which would be an indication that the  <br/>\nmother hasn&#39;t deschooled sufficiently to see the potential of  <br/>\nunschooling, or the realities of natural learning.<br/>\n<br/>\nKelly Lovejoy wrote something really clear and good about the stages  <br/>\nof unschooling.  I hope the link has already been left in this  <br/>\ndiscussion.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kellylovejoy/stages\">http://sandradodd.com/kellylovejoy/stages</a><br/>\n<br/>\nThere are links to similar and back-up ideas there, too.<br/>\n<br/>\nThere must be a hundred lists that will encourage people not to really  <br/>\nunschool.  Let&#39;s keep this one on the DO IT end.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/doit\">http://sandradodd.com/doit</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126765637,"authorName":"Laura Syria","from":"Laura Syria &lt;mandavia8@...&gt;","profile":"mandavia8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child","postDate":"1268057388","msgId":51786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1NjY5MS43MjQxMC5xbUB3ZWI1MTgwNy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhuMW12aitmdHFzQGVHcm91cHMuY29tPg=="},"prevInTopic":51784,"nextInTopic":51789,"prevInTime":51785,"nextInTime":51787,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"These aren t quite the replies I was looking for.  All of the suggestions are nice but, really, we do all of those things.   I guess I m asking about ways to","messageBody":"<div id=\"ygrps-yiv-854962619\">These aren&#39;t quite the replies I was looking for.  All of the suggestions are nice but, really, we do all of those things.   I guess I&#39;m asking about ways to go even deeper with your child.  To connect deeper.  How do you do that?<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sun, 3/7/10, yaboobarb &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yaboobarb@...\">yaboobarb@...</a>&gt; wrote:<br/>\n<br/>\nFrom: yaboobarb &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yaboobarb@...\">yaboobarb@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Re: Tell me the ways in which you fulfill your child<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Sunday, March 7, 2010, 9:21 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      I love when my (8 yr) son fulfills himself.<br/>\n<br/>\nIf you daughter wants curriculum I have seen a few free online free homeschooling curriculum. I book mark them for my son on the computer for my son to explore if he wants. <br/>\n<br/>\n<br/>\n<br/>\nAlso try book on tape! <br/>\n<br/>\nReading/ listening to things that interest you is soooo fufilling!<br/>\n<br/>\nMy son eats them up. I got him a few of my favorites so we could talk about it together after he was through. I worried for awhile that this would prevent him from reading but in fact his vocabulary is amazing and he reads just as much.<br/>\n<br/>\n<br/>\n<br/>\nSometimes I will pick a book and we will read it together and discuss it. Sometimes I pick up a book that he was reading and I read it too.<br/>\n<br/>\nBarbara<br/>\n<br/>\n<br/>\n<br/>\n--- In AlwaysLearning@ yahoogroups. com, &quot;mandavia8&quot; &lt;mandavia8@. ..&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; My daughter and I do lots of fun things together.  We explore many things in many different ways when she wants to.  She says, though, that she wants to use a curriculum because she thinks they are exciting.  Could you share the ways in which you make your child&#39;s life richer when your child feels unfulfilled?<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; Thanks,<br/>\n<br/>\n&gt; Laura<br/>\n<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":118371350,"authorName":"yaboobarb","from":"&quot;yaboobarb&quot; &lt;yaboobarb@...&gt;","profile":"yaboobarb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Tell me the ways in which you fulfill your child","postDate":"1268014899","msgId":51745,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuMW12aitmdHFzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuMWQwNSt2ZWJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":51735,"nextInTopic":51762,"prevInTime":51744,"nextInTime":51746,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"I love when my (8 yr) son fulfills himself. If you daughter wants curriculum I have seen a few free online free homeschooling curriculum. I book mark them for","messageBody":"<div id=\"ygrps-yiv-1760335525\">I love when my (8 yr) son fulfills himself.<br/>\nIf you daughter wants curriculum I have seen a few free online free homeschooling curriculum. I book mark them for my son on the computer for my son to explore if he wants. <br/>\n<br/>\nAlso try book on tape! <br/>\nReading/ listening to things that interest you is soooo fufilling!<br/>\nMy son eats them up. I got him a few of my favorites so we could talk about it together after he was through. I worried for awhile that this would prevent him from reading but in fact his vocabulary is amazing and he reads just as much.<br/>\n<br/>\nSometimes I will pick a book and we will read it together and discuss it. Sometimes I pick up a book that he was reading and I read it too.<br/>\nBarbara<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;mandavia8&quot; &lt;mandavia8@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My daughter and I do lots of fun things together.  We explore many things in many different ways when she wants to.  She says, though, that she wants to use a curriculum because she thinks they are exciting.  Could you share the ways in which you make your child&#39;s life richer when your child feels unfulfilled?<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Laura<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Tell me the ways in which you fulfill your child","postDate":"1268013787","msgId":51734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJBRDY5MzJELUZFOTYtNDU0Ni1CMjBFLTczQTYwQTU5MzMxNUBzdXBlbm4uY29tPg==","inReplyToHeader":"PGhuMWQwNSt2ZWJ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuMWQwNSt2ZWJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":51731,"nextInTopic":51735,"prevInTime":51733,"nextInTime":51735,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"... How old is your daughter? What is it about curriculum that seems appealing? Are there specific topics she especially wants curriculum in? I can answer a","messageBody":"<div id=\"ygrps-yiv-2028949287\">On Mar 7, 2010, at 6:31 PM, mandavia8 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My daughter and I do lots of fun things together.  We explore many things in many different ways when she wants to.  She says, though, that she wants to use a curriculum because she thinks they are exciting.  Could you share the ways in which you make your child&#39;s life richer when your child feels unfulfilled?<br/>\n<br/>\n </span></blockquote>How old is your daughter? What is it about curriculum that seems appealing? Are there specific topics she especially wants curriculum in?<br/>\n<br/>\nI can answer a little bit for my son Carl, who is about to turn 6 and LOVES workbooks. He has done some Explode the Code (phonics, very curriculum-y), but he also really likes Venn Perplexors from mindware (mindwareonline.com), 4x4 Sudoku puzzles, maze books, connect-the-dots, books about animals that include sticker pages, anatomy books with transparent pages or pop-up book features, and so on. He also enjoys some of the simple machine learning kits from LegoEducation, and simple science experiments (we actually own a science curriculum b/c I thought the stuff would be fun and it came with everything we needed so I wouldn&#39;t have to try to shop for odd things. And it has been fun. We do something from it every now and again, when the mood strikes us). <br/>\n<br/>\nIf it&#39;s more that your daughter is interested in an organized study plan on a certain topic, you could create that by putting together a list of possible resources and helping her find them. I&#39;ve been a person who likes to make plans since I was a kid; if she&#39;s inclined that way, it could be fun to do with her.<br/>\n<br/>\nIf she&#39;s excited by all the fancy manipulatives in some math curricula, or by the big box of books you get with some of the literature-based curricula, you could either duplicate that or go ahead and order the cool bits. I myself have to be careful about bringing curriculum into my house because I can start wanting to use it! And work through it in order! By June! But if you are a parent for whom curriculum is &quot;safer,&quot; it might be an OK choice for you, though I would start by seeing if you can figure out WHAT about curriculum seems exciting, and build from there.<br/>\n<br/>\nSu</div>","specialLinks":[]},{"userId":321996436,"authorName":"missalexmissalex","from":"&quot;missalexmissalex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Tell me the ways in which you fulfill your child","postDate":"1268011758","msgId":51731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuMWp0ZSs1Z2cwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuMWQwNSt2ZWJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":51728,"nextInTopic":51734,"prevInTime":51730,"nextInTime":51732,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"I don t see any problem with looking at curriculum with her. She has an interest in curriculum. You would be supporting an interest. You didn t fail if she","messageBody":"<div id=\"ygrps-yiv-2111264726\">I don&#39;t see any problem with looking at curriculum with her. She has an interest in curriculum. You would be supporting an interest. You didn&#39;t fail if she wants to do a workbook. Do you have a local homeschooling group that you could ask for castoffs? It&#39;s only not unschooling when you force or pressure your child to use curriculum, right? If she just does the activities she is interested in, it&#39;s not that different from bringing home books of science experiments, crafts and games, and saying you&#39;ll do whatever she&#39;s interested in with her. You didn&#39;t say how old she is. You might take a look at &quot;five in a row&quot; type stuff online--it&#39;s actually a lot like what we do naturally. You read a story 5 days in a row and do a different related activity every day. <br/>\n<br/>\nAlex N. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;mandavia8&quot; &lt;mandavia8@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My daughter and I do lots of fun things together.  We explore many things in many different ways when she wants to.  She says, though, that she wants to use a curriculum because she thinks they are exciting.  Could you share the ways in which you make your child&#39;s life richer when your child feels unfulfilled?<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Laura<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Tell me the ways in which you fulfill your child","postDate":"1268009805","msgId":51735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ3QzQ1MTE1LURGNUYtNEQ0QS04MTM4LUY4OTVDODE2RjEwRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhuMWQwNSt2ZWJ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuMWQwNSt2ZWJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":51734,"nextInTopic":51745,"prevInTime":51734,"nextInTime":51736,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"-=-She says, though, that she wants to use a curriculum because she thinks they are exciting. -=- Does she have older siblings who have told her a curriculum","messageBody":"<div id=\"ygrps-yiv-1089145366\">-=-She says, though, that she wants to use a curriculum because she  <br/>\nthinks they are exciting. -=-<br/>\n<br/>\nDoes she have older siblings who have told her a curriculum is exciting?<br/>\nDo you have some school books or workbooks around she could play with?<br/>\n<br/>\nMaybe if you went to a school supply place there would be workbooks  <br/>\nand she could get a few, and also maybe some nice Dover or Bellerophon  <br/>\ncoloring books, or pattern books.  Mazes.  An assortment of books, and  <br/>\nthen you could treat them the same and let her use or not use any of  <br/>\nthem?<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126765637,"authorName":"mandavia8","from":"&quot;mandavia8&quot; &lt;mandavia8@...&gt;","profile":"mandavia8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Tell me the ways in which you fulfill your child","postDate":"1268004677","msgId":51728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuMWQwNSt2ZWJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":51731,"prevInTime":51727,"nextInTime":51729,"topicId":51728,"numMessagesInTopic":0,"msgSnippet":"My daughter and I do lots of fun things together.  We explore many things in many different ways when she wants to.  She says, though, that she wants to use a","messageBody":"<div id=\"ygrps-yiv-1867025152\">My daughter and I do lots of fun things together.  We explore many things in many different ways when she wants to.  She says, though, that she wants to use a curriculum because she thinks they are exciting.  Could you share the ways in which you make your child&#39;s life richer when your child feels unfulfilled?<br/>\n<br/>\nThanks,<br/>\nLaura</div>","specialLinks":[]}],"prevTopicId":51859,"nextTopicId":51873}}