{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning about Unschooling & Stuff","postDate":"1076275677","msgId":90552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5RTE2QjVFLTVBN0QtMTFEOC1BM0RFLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PEJBWTUtREFWODUzTndueXIzenQwMDAxZjFlNEBob3RtYWlsLmNvbT4=","referencesHeader":"PEJBWTUtREFWODUzTndueXIzenQwMDAxZjFlNEBob3RtYWlsLmNvbT4="},"prevInTopic":90549,"nextInTopic":0,"prevInTime":90551,"nextInTime":90553,"topicId":90549,"numMessagesInTopic":0,"msgSnippet":"Welcom, Sheri. Your post was a great description of all the variety that happens here. Thanks for taking the time to write that. I wanted to respond to just ","messageBody":"<div id=\"ygrps-yiv-2141453771\">Welcom, Sheri.<br/>\n<br/>\nYour post was a great description of all the variety that happens here. <br/>\nThanks for taking the time to write that. I wanted to respond to just <br/>\none bit of it.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 8, 2004, at 3:44 AM, Bob Iyall wrote:<br/>\n<br/>\n&gt;  I can understand how long time members of this group could get <br/>\n&gt; frustrated or bored with questions from newer members, that go over <br/>\n&gt; very familiar ground.<br/>\n<br/>\nJust a reiteration that people were not complaining about repeat <br/>\nquestions - those are expected for ALL the reasons Sheri eloquently <br/>\ndescribed.<br/>\n<br/>\nWhen long-time contributors get tired of answering questions, they take <br/>\nbreaks from it, they don&#39;t complain that people still want to ask the <br/>\nsame questions. That&#39;s understood. Most of us DID that ourselves and <br/>\nthat&#39;s what gives us the motivation to stick around and provide ideas <br/>\nfrom our own experience.<br/>\n<br/>\nAll of us had to learn about unschooling and get our questions <br/>\nanswered. I remember rather fondly a question that I asked, repeatedly, <br/>\nabout unschooling math: &quot;Are you telling me that you don&#39;t tell them to <br/>\ndo it, but that you kids will go to the bookshelf, take down their math <br/>\nbook, and do their math every day?&quot;<br/>\n<br/>\nYep - that was me!!!<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations. </span></blockquote></div>","specialLinks":[]},{"userId":49804702,"authorName":"Bob Iyall","from":"&quot;Bob Iyall&quot; &lt;bob_iyall@...&gt;","profile":"wertheimer_iyall","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learning about Unschooling & Stuff","postDate":"1076240673","msgId":90549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWODUzTndueXIzenQwMDAxZjFlNEBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":90552,"prevInTime":90548,"nextInTime":90550,"topicId":90549,"numMessagesInTopic":0,"msgSnippet":"Greetings! I am a relative newbie to unschooling (about 18 months), DD is 16 and I haven t found too many groups or sites aimed at the issues of a sensitive","messageBody":"<div id=\"ygrps-yiv-209836456\">Greetings! <br/>\n<br/>\nI am a relative newbie to unschooling (about 18 months), DD is 16 and I haven&#39;t found too many groups or sites aimed at the issues of a sensitive teen. I am lurking for a while here to see what I can glean. I must admit this topic of impatience with the same old questions, has pushed some of my buttons, made me think, rethink and recall education theory from way back when (I am more than &quot;45 something&quot; &lt;G&gt;) and more current theory in learning and psychology. I have begun to reply a few times already but always stop to think and read some more posts. I must admit to being a Pollyanna in some situations, always hoping to find a positive motivation behind puzzling behavior. Here are my few thoughts in relation to this thread.<br/>\n<br/>\n I can understand how long time members of this group could get frustrated or bored with questions from newer members, that go over very familiar ground. This is after all, a mixed gathering of long time members, quiet lurkers, brand new members who may or may not be new to unschooling or even homeschooling in general. We come to this group with different communication styles, temperaments, family constellations, and most of all different needs. Would this need to avoid covering old ground again and again be better served in an experienced members only group? Yahoo allows email groups with closed membership. Our family belongs to a couple of closed groups with specific interests such as local Irish Dance, or my DD&#39;s homeschool newsletter group. The moderator sends an invitation to each interested member so they can join. With a private forum to vent and share, it is possible that the frustration level about newbies on this group would lift.  <br/>\n<br/>\n Adults, just like our children have different learning styles. The expectation that a new member will be able to deeply understand unschooling from reading books and archives is perhaps optimistic at best. Even when intellectual comprehension is achieved, a person&#39;s emotional/behavioral understanding happens gradually through actual real life experience. Like the proverbial onion, learning and change seems to happen in layers of recognition, understanding, growth, and movement. The dear friends who have been helping me understand unschooling at a gut level, are soft, genuine, and ask me gentle open ended questions that allow me to  move forward. I saw through their eyes many wonderful things that my DD was exploring when watching spy shows on TV, or reading Japanese Manga books. These friends modeled for me, how they would look at these activities my my DD were one of their own. <br/>\n<br/>\nHelping relationships, whether they be parental, friendship, therapeutic, spiritual, or virtual &lt;G&gt;, are energized and empowered when both parties (particularly the &quot;helper&quot;) show genuine respect and patience for this process. A sense of humor also tend to be a vital factor in change. <br/>\n<br/>\nThanks for all the lively discussions and postings. I have a platter full of food for thought. Good thing I like onions!<br/>\n<br/>\nTake Care,<br/>\nSheri<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":1144,"nextTopicId":90508}}