{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] music & teachers","postDate":"1050368225","msgId":13596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzLjJjZjY2YWM4LjJiY2NiMmUxQGFvbC5jb20+"},"prevInTopic":13595,"nextInTopic":0,"prevInTime":13595,"nextInTime":13597,"topicId":13595,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/14/03 8:05:15 PM Eastern Daylight Time, ... What a great gal.  It is nice that she had one great experience so she won t judge all music","messageBody":"<div id=\"ygrps-yiv-1661736658\">In a message dated 4/14/03 8:05:15 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kerrin@...\">kerrin@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m so grateful for that guitar teacher, Erin didn&#39;t even worry about the <br/>\n&gt; piano experience because she was so musically inspired. She stood up for <br/>\n&gt; herself too, and politely told the piano teacher that it wasn&#39;t working out <br/>\n&gt; for her. She didn&#39;t ask me to sort it out for her.  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>What a great gal.  It is nice that she had one great experience so she won&#39;t <br/>\njudge all music teachers by the piano teacher.  And it is great that the two <br/>\nof you can play together.<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":36194,"authorName":"Kerrin or Ralph Taylor","from":"&quot;Kerrin or Ralph Taylor&quot; &lt;kerrin@...&gt;","profile":"kerrin37","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"music & teachers","postDate":"1050364876","msgId":13595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwN2YwMWMzMDJlMiQzY2VjNzYyMCQwMjAwYThjMEB2ZWN0cmE+"},"prevInTopic":0,"nextInTopic":13596,"prevInTime":13594,"nextInTime":13596,"topicId":13595,"numMessagesInTopic":0,"msgSnippet":"I thought I d share our recent interesting experiences with music teachers. My daughter is into music and plays piano and guitar. In the course of organizing","messageBody":"<div id=\"ygrps-yiv-1995475061\">I thought I&#39;d share our recent interesting experiences with music teachers. My daughter is into music and plays piano and guitar. In the course of organizing lessons we met 2 very different types of music teacher. <br/>\n<br/>\nFirst the guitar experience:<br/>\n<br/>\nErin (14) picked up my guitar a couple of months ago and started teaching herself to play. She did really well, and decided that she would like some lessons to help her go further. I&#39;m your basic, strum along just enough to sing with guitarist so I didn&#39;t have any fancy stuff to pass on (I taught myself a few years ago). She got on the phone and set it all up and is now having lessons with a very cool, youngish guy who is showing her the things SHE WANTS to learn. Each week she comes home with riffs from modern songs to play and learns about harmonics, power chords and other stuff that I never heard of! She pays $15 for a half hour lesson which actually goes to at least an hour, because the teacher is so enthusiastic and loves teaching music! As a result I have been re-inspired and am learning all this stuff too! Yesterday we went into the guitar shop and played around on some 2nd hand electric guitars and decided to buy one for Erin and a bass guitar for me. It is all soo exciting!! <br/>\n<br/>\n<br/>\nNow the piano experience:<br/>\n<br/>\nErin has been playing the piano for a few years. She started out with lessons for a year or so then the teacher retired. There was no one else available so she has taught herself, with books and just playing, on and off since then. She can play beautiful music and recently came 2nd in a talent quest playing and singing &quot;My heart will go on&quot; from Titanic. So, she&#39;s not a beginner, but she has gaps in her music theory knowledge and isn&#39;t able to look at a piece of music and play it without a fair amount of time spent figuring it out.<br/>\n<br/>\nShe decided that she would like to have lessons again to fill those gaps. She found a teacher who told her that she would treat her as an adult student. We thought that sounded good. However the teacher couldn&#39;t really handle that idea, and when it came to the crunch she treated her as a child. Anyway, she insisted on meeting me (which was fine with me), so we went along to the first lesson (which turned out to be only an interview) together. The teacher made a point of telling us that she was a trained school teacher (uh oh) and said that Erin couldn&#39;t possibly have got to the stage she was at with only a year of lessons (she said she wasn&#39;t accusing us of lying!?). I was ready to leave!!  She decided to start Erin at the very beginning. Erin was willing to try it though and it was her choice so I hung in there. Then she asked me to sign a contract committing to a whole term of lessons which I had to pay for even if Erin didn&#39;t continue. I wasn&#39;t about to do that! I suggested that as there were only 3 weeks of the term left I was willing to commit to those and then let Erin decide if she was the right teacher for her and whether or not to continue. She obviously hadn&#39;t come across the concept of students approving their teachers! but she agreed. <br/>\n<br/>\nThe next week came and floods prevented us from getting to town so I rang the piano teacher, well before the time of the lesson, to tell her we couldn&#39;t get there. We tried and had to turn back. Anyway to cut a long story short, Erin went to the 2 remaining lessons which were largely a waste of her time, and money. She decided not to go back next term so she told the teacher, who now expects me to pay for the lesson we couldn&#39;t get to! I won&#39;t be paying for it. <br/>\n<br/>\nI don&#39;t see how this kind of music teacher is going to pass on any love of music to her students. She certainly didn&#39;t express any herself. I think she is so used to students who are forced to be there, who are not enjoying the music that she has just become jaded. She charges an inflated price and assumes that students won&#39;t practice and that she&#39;s going to have trouble getting her money.<br/>\n<br/>\nI&#39;m so grateful for that guitar teacher, Erin didn&#39;t even worry about the piano experience because she was so musically inspired. She stood up for herself too, and politely told the piano teacher that it wasn&#39;t working out for her. She didn&#39;t ask me to sort it out for her.  <br/>\n<br/>\n<br/>\nKerrin.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":13584,"nextTopicId":13541}}