{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":29,"messages":[{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli - To Deb. Very, Very Long","postDate":"1222630868","msgId":38853,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwOTI4MTI0MW8yMTljYTZjYnk4ZTQwMWE2MmFkNWFlZjZjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdibnU3MCtqOThpQGVHcm91cHMuY29tPg==","referencesHeader":"PGdiazl0dCs5cmkxQGVHcm91cHMuY29tPiA8Z2JudTcwK2o5OGlAZUdyb3Vwcy5jb20+"},"prevInTopic":38846,"nextInTopic":0,"prevInTime":38852,"nextInTime":38854,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... you and your circumstances. But I can tell you, the fact you re asking question, perhaps maybe your unschooling is finally beginning. You re no longer","messageBody":"<div id=\"ygrps-yiv-938048411\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;We cannot tell you if you&#39;re right or wrong. Because we don&#39;t know<br/>\n </span></blockquote>you and your circumstances. But I can tell you, the fact you&#39;re<br/>\nasking question, perhaps maybe your unschooling is finally<br/>\nbeginning. You&#39;re no longer blindly doing and following things, you<br/>\nare finally questioning the logic, and suitability, and application<br/>\nof certain unschooling practices. You are finally awake.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI really think what you said here... &quot;finally awake&quot; ...is exactly what<br/>\noften happens of a long time unschooling enthusiast who has yet to come full<br/>\ncircle and make the life they envisioned their own.<br/>\n<br/>\nI do sometimes get concerned with how to better make unschooling available.<br/>\nThe ideas are so abundantly here!  Yet here we are, most of us having gone<br/>\nto school and many weighed down with baggage.  I like what someone said<br/>\n(Robyn I think) about seeing childhood baggage as no longer part of<br/>\nchildhood, which is past, but as now part of our current lives!!  We can win<br/>\nthen and win now, improving and healing both our present and our past, and<br/>\nunschooling is sort of like a time machine window for doing that.  What a<br/>\ngreat thing.<br/>\n<br/>\nOnce a person wakes up (and has the distinct possibility of coming full<br/>\ncircle and making unschooling one&#39;s own), much of what still lies before a<br/>\nperson to work through seems overwhelming and incongruent with the goal to<br/>\nrealize a happy life that&#39;s fluidly inclusive of the wonderful freeing<br/>\nprinciples of unschooling.<br/>\n<br/>\nThere must be quite a few approaches for doing it.  There must be as many<br/>\nways as there are to learn anything else.<br/>\n<br/>\nOne approach is to refrain from meditating by direct thought on<br/>\ninconsistencies.  Instead meditate with some side activity along with your<br/>\nthinking.  (Side activities can be thought of as a similar notion to<br/>\nSandra&#39;s Truck analogy but with oneself rather than with others in this<br/>\ninstance).  Activity that sort of puts brain chatter to the left of present<br/>\nconversation has some great benefits.  One benefit is to be convinced that<br/>\nyou are learning even when you&#39;re not directly concentrating on it.<br/>\n<br/>\nSome examples of such activities:<br/>\nyoga<br/>\ndraw/scribbling in sand/dirt<br/>\nplay with clay<br/>\nsand art<br/>\nwork puzzles<br/>\nplay solitaire, tetris, computer games<br/>\n<br/>\nSome people need more.  Therapy doesn&#39;t always have to be talking and<br/>\nthinking more about ourselves when we don&#39;t want to.  We can get into<br/>\nself-directed therapy ... like dance, art, music.  If there&#39;s no class<br/>\nbilled as therapy, take an art, dance or music class with the intent of<br/>\ndistracting oneself from an over analyzing tendency.  If we need more<br/>\nattention, a great thing to do is get a massage or go to a day spa or more<br/>\ncheaply, go get made up at the makeup counter.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":357843301,"authorName":"lyeping2008","from":"&quot;lyeping2008&quot; &lt;lyeping2008@...&gt;","profile":"lyeping2008","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sugar (was broccoli - To Deb. Very, Very  Long","postDate":"1222605856","msgId":38846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdibnU3MCtqOThpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdiazl0dCs5cmkxQGVHcm91cHMuY29tPg=="},"prevInTopic":38817,"nextInTopic":38853,"prevInTime":38845,"nextInTime":38847,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... feelers. Like a snail, perhaps, testing the waters , if you will, as he moves along. I am moving forward, but I always test things first. It is a long and","messageBody":"<div id=\"ygrps-yiv-755920585\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;prism7513&quot; &lt;penley75@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  Luckily, I&#39;m not waiting. But as I&#39;m moving, I&#39;m putting out <br/>\n </span></blockquote>feelers. Like a snail, perhaps, testing the &quot;waters&quot;, if you will, <br/>\nas he moves along. I am moving forward, but I always test things <br/>\nfirst. <br/>\n<br/>\n<br/>\nIt is a long and comprehensive thread which I&#39;ve finally caught up. <br/>\nSo this is what&#39;ve I understood so far from each and every post. <br/>\n<br/>\nLike you, I too question things alot. I also dissect and analyse <br/>\nsituations, and mull over it. I then to solve my own problems and <br/>\nissues, which makes me unique and alone. Occasionally I get stuck, I <br/>\nhave since learnt to ask for help. I do not follow any shepard but I <br/>\ndo listen and adopt from their experiences and methods that works <br/>\nfor me. Most of which goes thru tweakings here and there, to make <br/>\nthem mine.<br/>\n<br/>\nPlease bear in mind, my message and tone here is gentle and caring. <br/>\nIt is not my intention to tell you off, or sound cruel. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; At this point, like in the past 6 years, I feel pressure more from <br/>\n </span></blockquote>the people I&#39;m moving TOWARDS, in this case, all of you wonderful <br/>\npeople here! I want you to like me, I want to feel like I belong, <br/>\nlike I&#39;m one of you, a part of something. I know that&#39;s not at all <br/>\nwhat it&#39;s about, but that feeling is still present. It&#39;s been there <br/>\nsince the first grade when I first became an outsider.<br/>\n<br/>\nI do not know you, so I cannot like you nor hate you. I can truly <br/>\nunderstand the feeling of feeling an outsider. I&#39;m a foreigner, <br/>\nliving in UK, i have only 1 or 2 friends. I too have always been an <br/>\noutsider, coming from a background of my parents spliting up, <br/>\nremarried, moved away leaving me behind with my grandma. <br/>\n<br/>\nYou will not feel belong if you&#39;re constantly seeing yourself un-<br/>\nworthy of anything just because you&#39;ve not learn enough or do <br/>\nenough. Just because you cannot measure your doings by means of <br/>\npraises or approval, you do not think you&#39;re equal enough to anyone! <br/>\nSo, you&#39;re an oddball. So am I. Now does help makes you feel less <br/>\nalone? Or do you resent being label as such, and will outcast me <br/>\nbecause you do not wanna be in my group? <br/>\n<br/>\nYou have to stop deciding what&#39;s constitute as right,  and what&#39;s <br/>\nconstitute as wrong. How many rights do you have to do before making <br/>\nit to the aproval-able state? How many ticks off the checklist you <br/>\nmust have before it&#39;s classified as acceptable.  <br/>\n<br/>\nYou are already part of something even tho you don&#39;t see it. We all <br/>\nclassified ourselves differently - enlightened,  happy, intelligent, <br/>\nopen minded, advance, far sighted, loving, caring and many more. But <br/>\nmost of all, we are all unique, individual unschooling families. <br/>\nYou, like all of us ARE different - accept that! We are all <br/>\nconsidered so because until unschooling becomes a majority, we are <br/>\nnot the norm. <br/>\n<br/>\nHere&#39;s the advice - I am part of many lists. I have emailed you a <br/>\ngroup which I think might possibly be good for you. You may not <br/>\naccept it but I do not expect you to reply. I believe even in <br/>\nunschooling lists, there are certain levels. I&#39;m finally at the <br/>\nlevel I think I can understand what Sandra and the others are <br/>\nsaying, which is why I&#39;m here. In my early days, I too would have <br/>\nbeen like you, questioning naively thier wisdom.   <br/>\n<br/>\nI&#39;ve since discovered that there is such a thing as being on a wrong <br/>\nlist, at a wrong time. The fact that Sandra is actually very nice <br/>\nand polite is in contrast to views I&#39;ev understood from other new <br/>\nunschoolers, one year ago.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; While I mostly feel confident in who I am and the decisions I make,<br/>\n&gt; the other part of me just wishes I could be like everyone else and <br/>\n </span></blockquote>not fight the system. No home births, no nursing toddlers in public, <br/>\nno homeschooling, whatever. I hate being the odd ball out. And yet at<br/>\n<blockquote><span title=\"ireply\"> &gt; night when I think about my choices, I&#39;d have it no other way. But <br/>\n </span></blockquote>I do wish I had someone to travel this road with.<br/>\n<br/>\nYour full confidence is not there yet. You have to continue work to <br/>\neradicate the other half. <br/>\n<br/>\nFinding the right list is like finding your kindred spirit, a <br/>\nhealing balm to your soul. Just like any other organisations, be it <br/>\nthe choir or football or reading club, they all have distinct <br/>\npersonality and voices. <br/>\n<br/>\nThis list is not the place to be airing your insecurities, <br/>\nquestioning your unhappy state because it seems like your <br/>\nunschooling is going well. It&#39;s only your own insecurities that&#39;s <br/>\nplaying up. <br/>\n<br/>\nAnd with all the numerous replies you&#39;ve recieved, you have yet hear <br/>\nthe right thing that can help snap you out of it. Because of that, <br/>\nyou retaliate your refusal by stating you&#39;re doing the opposite, <br/>\nLike you did to Katherine&#39;s &quot;waiting&quot;. <br/>\n<br/>\nKatherine gives alot of her time here and a few more group. I resent <br/>\nyour rebelling, and snapping back at her kindness!!! I think you <br/>\nshould keep your anger and frustration of your confusion to <br/>\nyourself, and not let it spill out onto the group. <br/>\n<br/>\nThis is not a therapy group, and we dont&#39; need to put up with your <br/>\ndefensive and bear the brunt of your &quot;refusing to let go that last <br/>\nbit of comfort blanket&quot; manner. Do not muse out loud on the <br/>\npostings, because we will take it as your answer to us. <br/>\n<br/>\nWe are here to help anyone who needs it, the best we can. You have <br/>\nbaggage and issues, so do a few of us. The fact that we are not <br/>\nignoring you, say enough that you are part of this group. But the <br/>\nreplies will soon end because that&#39;s what happens when you snap at <br/>\nthe hand that reaches out to you.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I am such a darn people pleaser and I so want to be right, and for <br/>\n </span></blockquote>once I just wish I didn&#39;t care what people thought, and just did <br/>\nwhat *I* want to do, but then I don&#39;t really know what that is...<br/>\n<br/>\nHere&#39;s the advice - Only please those who DESERVES YOU- so decide <br/>\nwho they are!! Otherwise,  ignore the rest because you do not <br/>\nbenefit kindess and happiness from them. Stop living your life <br/>\naccording to anybody&#39;s rules, because you are not them. <br/>\n<br/>\nStop being such a perfectionist!!! There is no hard and fast rules <br/>\nin unschooling, other than the basics - we do not co-erced. We treat <br/>\nand respect our kids - which is seems you are already doing. <br/>\nBecareful when considering other people&#39;s opinion. I have this line <br/>\nI use on my family and friends. If it&#39;s not helpful, I dont&#39; want to <br/>\nhear about it.   <br/>\n<br/>\nDo not compare. What we unschooler is doing, and you&#39;re not. We are <br/>\nall very unique in our very own ways which is why unschooling works, <br/>\nand &quot;cookie cutter&quot; school system don&#39;t. So just read more, explore <br/>\nand consider each and every unschooling option you can think, nt <br/>\nforgetting all the replies you&#39;ve got. <br/>\n<br/>\nTake what&#39;s relevant, disregard what&#39;s not. But be gracious about it <br/>\nby not challenging their beliefs. I am happy to share and explain my <br/>\nbeliefs if someone wants to learn, but I can be very rude if they <br/>\nare questioning my beliefs and decisions for my family.  <br/>\n<br/>\nLike you said &quot;examined and tested and hashed about&quot;. Until you&#39;ve <br/>\ndone and hashed out mentally what&#39;s suggested, do not tell us it <br/>\ndoesn&#39;t work!    <br/>\n<br/>\nI don&#39;t know everyone here personally but I accept that I am part of <br/>\nthis group just as much as everyone, in the short period of less <br/>\nthan a month here. I don&#39;t need an object or any signal to state I&#39;m <br/>\naccepted or not here. I just made myself part of it- just like that. <br/>\n<br/>\nYou mentioned wanting to move forward but on the other hand you&#39;re <br/>\nstruggling. You asked for help but yet refused to accept our advice. <br/>\nBut still you&#39;re asking. <br/>\n<br/>\nYour justification for this:-<br/>\n<blockquote><span title=\"ireply\"> &gt; Otherwise,aren&#39;t I simply being a sheep to the unschooling <br/>\n </span></blockquote>shepherd? &gt;If it&#39;s true, it will hold up. If it&#39;s for<br/>\nme, I will feel at peace. The first changes I made were as a mother <br/>\nand parent. Then this past two years it&#39;s been as a person and my <br/>\nfaith. And now it&#39;s as a parent yet again...always changing, <br/>\ntesting, questioning. And sometimes I just want to rest and be SURE <br/>\nthat I&#39;m &quot;okay.&quot;<br/>\n<br/>\nIt&#39;s not so hard fo rme to see why, if you have been unschooling for <br/>\nso long, why you are still so unsure and suffering.  It seems to me <br/>\nyou are still hanging onto rules that&#39;s been banged into your head <br/>\nsince young. You still have a need to please and seek approval in <br/>\norder to reflect that you&#39;re on the right path. In the past few <br/>\nyears, you did everything you think is best for your kid, without <br/>\nanalysing and understand why you&#39;re doing it. You were effectively <br/>\nbeing the sheep, following the shepard? <br/>\n<br/>\nWhich explains this panic and unsure of yourself. Which is why you <br/>\ncannot defend your beliefs. Which is why you feel odd, compared to <br/>\nthe people surrounding you because they are just so confident in <br/>\nwhat they believe in, and you&#39;re not.<br/>\n<br/>\nWhy are you asking these questions now, when you have been <br/>\nunschooling for so long? <br/>\n<br/>\nWe cannot tell you if you&#39;re right or wrong. Because we don&#39;t know <br/>\nyou and your circumstances. But I can tell you, the fact you&#39;re <br/>\nasking question, perhaps maybe your unschooling is finally <br/>\nbeginning. You&#39;re no longer blindly doing and following things, you <br/>\nare finally questioning the logic, and suitability, and application <br/>\nof certain unschooling practices. You are finally awake, realising <br/>\nthat you need to fix yourself because there&#39;s so many loopholes in <br/>\nyour beliefs. And you are getting fed-up of feeling defenseless, <br/>\nunable to defend all the goodness and right-ness of your unschooling <br/>\ndecisions when your parenting skills and choice is being contested <br/>\nby society.<br/>\n<br/>\nOr perhaps the answer can be simpler. YOU&#39;RE BURNT OUT!!<br/>\nQuite a common thing to happen. Take a few weeks out of being so <br/>\nconcern about what other people thinks, and do some soul searching <br/>\nand analyse your life, and where you&#39;re going. It&#39;s only thinking, <br/>\nso you can have full permission to daydream as far fethced as you <br/>\nwant, visulise how you want to feel and indulge in that glory. Think <br/>\nof how you can formulate your answers of defense when being <br/>\nchallenged on your ideas.  <br/>\n<br/>\nRemind yourself everytime, you&#39;re doing your best, and in time <br/>\nyou&#39;ll understand better. When the going gets tough, just surrender <br/>\nto the defeat, throw your hands in the air, and breath out, and <br/>\nforget it! Remind yourself that you have so many other options to <br/>\nexplore. <br/>\n<br/>\nUnschooling is all about confidence and faith, of your love for your <br/>\nkids. Keep your love for your kids as your beacon of sanity. In my <br/>\nearly days of unschooling, I too do things I don&#39;t understand other <br/>\nthat I know it&#39;s the best for my kid, and eventually it will makes <br/>\nsense to me - that&#39;s my hold to sanity.  Remind yourself that if <br/>\nyou&#39;re unhappy, they will feel it. So it is important that you do <br/>\nwhat you can to make yourself happy again. <br/>\n<br/>\nAgain don&#39;t be the perfectionist and think to yourself that you need <br/>\nthat expensive dinner or that spa taht you can&#39;t afford. Be <br/>\nrealistic, if you can&#39;t have that, what next best options you have? <br/>\n<br/>\nIndulge yourself - throw your caution to air and to hell with it. <br/>\nPut some music on and go crazy dancing to your favourite song. I put <br/>\nAbba if I&#39;m defiant, Andrea Borcelli on if I&#39;m feeling sorry for <br/>\nmyself. I have been know to go to great lenghts cooking my favourite <br/>\nfood to cheer myself up. I have many times crawled back into bed <br/>\nwith my child and read or daydream. <br/>\n<br/>\nMy sanity recuperation is every evening on bed, catching up on my <br/>\nreading, son watching Youtube or video. <br/>\n<br/>\nI hope this is of help to you in some ways. Pls excuse the typos, <br/>\ni&#39;m short on time here. <br/>\n<br/>\nBest Wishes<br/>\nSharonBugs.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222570191","msgId":38817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwOEU3RTQ2LTQ4MzktNDEwNS05MUZBLUU3RjgwRDEzOTlDM0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNhOTNmZmYxMDgwOTI3MTkyMWkzNDEzNTA2OXFhMzI4Y2MzZDU3ZDc1NDU1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDdGMUFCQTk4LTJFMjUtNDlDQS1BNUFELTZGN0M5MUZEMTI3Q0BzYW5kcmFkb2RkLmNvbT4gPGdia2U0dCtxc21yQGVHcm91cHMuY29tPiA8M2E5M2ZmZjEwODA5MjcxOTIxaTM0MTM1MDY5cWEzMjhjYzNkNTdkNzU0NTVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":38813,"nextInTopic":38846,"prevInTime":38816,"nextInTime":38818,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"-=-Maybe I m off base, but I thought that people learn by asking questions, or at least SOME people learn that way, and I am one of them.-=- People learn by","messageBody":"<div id=\"ygrps-yiv-648801896\">-=-Maybe I&#39;m off base, but I thought that people learn by asking<br/>\nquestions, or at least SOME people learn that way, and I am one of<br/>\nthem.-=-<br/>\n<br/>\n<br/>\n<br/>\nPeople learn by thinking.<br/>\n<br/>\nSome people can ask a question to their diary, and over the course of  <br/>\na few days or weeks or months, figure out the answer.<br/>\n<br/>\nSome people ask a question of someone they think might know, but  <br/>\nasking the question isn&#39;t learning.  Trying to understand the answer,  <br/>\nthinking about it, trying it out--that *might* lead to learning.<br/>\n<br/>\nAsking a question, and then another and another and another and not  <br/>\nlistening to the answers and saying &quot;I know but&quot; and &quot;yeah but&quot; isn&#39;t  <br/>\nlearning.<br/>\n<br/>\nSomeone once assured me she had read my whole website, about the  <br/>\nthird day she had been around.  I seriously doubt anyone here has  <br/>\nread my whole website.  That&#39;s fine!  It&#39;s not meant to be read  <br/>\nthroughout.  It&#39;s a resource center, an archive.  Saying &quot;Yeah, yeah,  <br/>\nI read all that, but...&quot; is a problem.<br/>\n<br/>\nDeschooling takes a long time.  Months.  Lots of tools and tricks are  <br/>\non my site and Joyce&#39;s--enough to get people started, and the list  <br/>\ncan help them people with rough spots and unexpected incidents, and  <br/>\nit&#39;s a good place to share successes and progress.<br/>\n<br/>\nI really like this list, even when it&#39;s not going smoothly, and even  <br/>\nwhen there&#39;s a quiet day or week.<br/>\n<br/>\nThanks, all of you who stick around a while to  help even after you  <br/>\ndon&#39;t need it so much yourself.  I really appreciate it.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222568509","msgId":38813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwOTI3MTkyMWkzNDEzNTA2OXFhMzI4Y2MzZDU3ZDc1NDU1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg==","referencesHeader":"PDdGMUFCQTk4LTJFMjUtNDlDQS1BNUFELTZGN0M5MUZEMTI3Q0BzYW5kcmFkb2RkLmNvbT4JIDxnYmtlNHQrcXNtckBlR3JvdXBzLmNvbT4="},"prevInTopic":38812,"nextInTopic":38817,"prevInTime":38812,"nextInTime":38814,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... questions, or at least SOME people learn that way, and I am one of them.","messageBody":"<div id=\"ygrps-yiv-1875994532\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;Maybe I&#39;m off base, but I thought that people learn by asking<br/>\n </span></blockquote>questions, or at least SOME people learn that way, and I am one of<br/>\nthem.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nMaybe you&#39;re selling yourself short.  Broaden those horizons, stretch<br/>\nyourself some more.  Come on, you can do it.  Asking questions is but *one*<br/>\nway to learn.<br/>\n<br/>\nObserve.<br/>\nExperiment.<br/>\nBrainstorm.<br/>\nShare.<br/>\nGive.<br/>\nReceive.<br/>\nWrite.<br/>\nTalk.<br/>\nRun.<br/>\nWalk.<br/>\nSwim.<br/>\nSurf.<br/>\n<br/>\nStretch yourself on out there and realize that you *are* always learning in<br/>\na myriad of ways.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222568128","msgId":38812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwOTI3MTkxNXY3YzA2ZTQ2MW4xY2IzOWU5MGVjYzZmNzdlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdiazl0dCs5cmkxQGVHcm91cHMuY29tPg==","referencesHeader":"PDNhOTNmZmYxMDgwOTI2MTU0NXMyNmI5NDkyOXg0Njc0NTc5Yjc1ZDU5ZDNjQG1haWwuZ21haWwuY29tPgkgPGdiazl0dCs5cmkxQGVHcm91cHMuY29tPg=="},"prevInTopic":38811,"nextInTopic":38813,"prevInTime":38811,"nextInTime":38813,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"There s a whole bunch of us here who are replying to your posts.  Some of that is we understand where you re coming from and we d like helping people","messageBody":"<div id=\"ygrps-yiv-404005253\">There&#39;s a whole bunch of us here who are replying to your posts.  Some of<br/>\nthat is &quot;we understand where you&#39;re coming from&quot; and &quot;we&#39;d like helping<br/>\npeople understand what we&#39;ve come to love about unschooling and the life<br/>\nwe&#39;re embracing.&quot;<br/>\n<br/>\nI don&#39;t really know you.  I wish I could say ... &quot;I like you.&quot;  So far, the<br/>\nbest I can do from here at my computer across the miles of wire online is &quot;I<br/>\nthink I like you&quot; and &quot;I don&#39;t dislike you&quot; and &quot;sure, let&#39;s talk as much as<br/>\nyou like about unschooling  ... I *luv* that!&quot;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;Unschooling, like anything else, should be able to be examined and<br/>\n </span></blockquote>tested and hashed about.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nReread what you wrote above.  What does &quot;examine,&quot; &quot;test,&quot; and &quot;hash about&quot;<br/>\nhave to do with &quot;unschooling?&quot;<br/>\n<br/>\nIt sounds more like school to me.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222567461","msgId":38811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwOTI3MTkwNHk1YThiNDhmZXVmZTRmNWNjYmE1ZDVlNGRAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGdianZubCtzb2tyQGVHcm91cHMuY29tPg==","referencesHeader":"PGdiamt0ZStkNW9nQGVHcm91cHMuY29tPiA8Z2Jqdm5sK3Nva3JAZUdyb3Vwcy5jb20+"},"prevInTopic":38810,"nextInTopic":38812,"prevInTime":38810,"nextInTime":38812,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"Crap I did it again.  The quote disappears out from under my reply. Sorry.   Here is my post again: Oh Karl too!  Brian not so much.  But me and Karl love our","messageBody":"<div id=\"ygrps-yiv-1865007615\">Crap I did it again.  The quote disappears out from under my reply.<br/>\nSorry.   Here is my post again:<br/>\n<br/>\n<br/>\nOh Karl too!  Brian not so much.  But me and Karl love our uncharted<br/>\nterritory.  :)  Brian is beginning to enjoy some parts of it.  He will<br/>\neventually enjoy it much more than he is now.  He&#39;s just dipping his toes in<br/>\nevery now and again, and he learns a little bit every time.  I &quot;splash&quot; him<br/>\nwith a bit and he gets a little to avoid him getting completely dried out<br/>\nbetween times.  The adventure aspect can be mighty contagious.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 9/26/08, carnationsgalore &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:addled.homemaker@...\">addled.homemaker@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   &gt;&gt;&gt; So it&#39;s hard for me to be confident. It&#39;s hard for me to &quot;trust&quot;<br/>\n&gt; &gt;&gt;&gt; anything since I trusted my parents completely, and now I realize<br/>\n&gt; &gt;&gt;&gt; that they weren&#39;t perfect, either. I don&#39;t trust myself at all...<br/>\n&gt;<br/>\n&gt; &gt;It&#39;s a do-over! Stop worrying about perfection which is unreachable<br/>\n&gt; &gt;anyway. Be your children&#39;s partner. Learn alongside them. My kids<br/>\n&gt; &gt;know I&#39;m in uncharted territory. They really like that we&#39;re all in<br/>\n&gt; &gt;this together. :)<br/>\n&gt;<br/>\n&gt; &gt;Beth M.<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222567249","msgId":38810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwOTI3MTkwMHU1YjU0YjQwN3lhMmNlNDdmZGI3YjFjNTMwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdianZubCtzb2tyQGVHcm91cHMuY29tPg==","referencesHeader":"PGdiamt0ZStkNW9nQGVHcm91cHMuY29tPiA8Z2Jqdm5sK3Nva3JAZUdyb3Vwcy5jb20+"},"prevInTopic":38801,"nextInTopic":38811,"prevInTime":38809,"nextInTime":38811,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"Oh Karl too!  Brian not so much.  But me and Karl love our uncharted territory.  :)  Brian is beginning to enjoy some parts of it.  He will eventually enjoy it","messageBody":"<div id=\"ygrps-yiv-1489773666\">Oh Karl too!  Brian not so much.  But me and Karl love our uncharted<br/>\nterritory.  :)  Brian is beginning to enjoy some parts of it.  He will<br/>\neventually enjoy it much more than he is now.  He&#39;s just dipping his toes in<br/>\nevery now and again, and he learns a little bit every time.  I &quot;splash&quot; him<br/>\nwith a bit and he gets a little to avoid him getting completely dried out<br/>\nbetween times.  The adventure aspect can be mighty contagious.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 9/26/08, carnationsgalore &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:addled.homemaker@...\">addled.homemaker@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   &gt; So it&#39;s hard for me to be confident. It&#39;s hard for me to &quot;trust&quot;<br/>\n&gt; &gt; anything since I trusted my parents completely, and now I realize<br/>\n&gt; &gt; that they weren&#39;t perfect, either. I don&#39;t trust myself at all...<br/>\n&gt;<br/>\n&gt; It&#39;s a do-over! Stop worrying about perfection which is unreachable<br/>\n&gt; anyway. Be your children&#39;s partner. Learn alongside them. My kids<br/>\n&gt; know I&#39;m in uncharted territory. They really like that we&#39;re all in<br/>\n&gt; this together. :)<br/>\n&gt;<br/>\n&gt; Beth M.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] lifestyle changes","postDate":"1222553453","msgId":38801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczRDc1RDMzLTIxQjItNDYxOC05NjM4LUQ1RUExQTVBMDg5NUBtYWMuY29tPg==","inReplyToHeader":"PGdibDNyMSttMDRuQGVHcm91cHMuY29tPg==","referencesHeader":"PGdibDNyMSttMDRuQGVHcm91cHMuY29tPg=="},"prevInTopic":38794,"nextInTopic":38810,"prevInTime":38800,"nextInTime":38802,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... Try to make it about doing something wonderful for your kids, not about feeling part of a movement, making friends, feeling supported, or anything else","messageBody":"<div id=\"ygrps-yiv-860719424\">On Sep 27, 2008, at 4:01 AM, carnationsgalore wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; At this point, like in the past 6 years, I feel pressure more from<br/>\n&gt;&gt; the people I&#39;m moving TOWARDS, in this case, all of you wonderful<br/>\n&gt;&gt; people here! I want you to like me, I want to feel like I belong,<br/>\n&gt;&gt; like I&#39;m one of you, a part of something.<br/>\n<br/>\n </span></blockquote>Try to make it about doing something wonderful for your kids, not  <br/>\nabout feeling part of a movement, making friends, feeling supported,  <br/>\nor anything else that is about you.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222541330","msgId":38794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdibHY2aStpM3AwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg=="},"prevInTopic":38793,"nextInTopic":38801,"prevInTime":38793,"nextInTime":38795,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... First he isn t your kid.  If he s not behaving in a manner that is helping you get him from point A to point B safely and calmly, it should be addressed,","messageBody":"<div id=\"ygrps-yiv-179543654\"><blockquote><span title=\"ireply\">&gt; And when you gave the suggestion to the other poster about telling the<br/>\n&gt; kid to be quiet while she was driving, &quot;and mean it.&quot; I thought, &quot;but<br/>\n&gt; how does that fit into letting him have a choice?&quot;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>First he isn&#39;t your kid.  If he&#39;s not behaving in a manner that is<br/>\nhelping you get him from point A to point B safely and calmly, it should<br/>\nbe addressed, and if he isn&#39;t responding to nicey nice, be very clear<br/>\nand blunt and be firm in what you want.<br/>\n<br/>\nI know what works and what doesn&#39;t with my own kids.  I know which words<br/>\nto use and what tone of voice works best when I really need something<br/>\nfrom them.  Other kids that are from other families won&#39;t be the same. <br/>\nOver the years, I&#39;ve found that a lot of kids don&#39;t respond to asking<br/>\nnice, I think because at home asking nice was just a polite way to<br/>\ndemand something, and kids learn to ignore that.  So, with kids that are<br/>\nused to that, it&#39;s better to be firm and direct and clear that you mean<br/>\nwhat you say.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: lifestyle changes","postDate":"1222540641","msgId":38793,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdibHVoMStxZzk5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdibDNyMSttMDRuQGVHcm91cHMuY29tPg=="},"prevInTopic":38781,"nextInTopic":38794,"prevInTime":38792,"nextInTime":38794,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... One of my favorite homeschooling families that I really connect with has never ever claimed to be unschooling.  They have one child who is a teen.  They ve","messageBody":"<div id=\"ygrps-yiv-531634268\"><blockquote><span title=\"ireply\">&gt; Yes Deb, I&#39;ve always felt that way too. But in all the groups I&#39;ve<br/>\n&gt; been in, I&#39;ve seen just how different everyone really is. One common<br/>\n&gt; cause does not make a best friend. Even when I was using curriculum<br/>\n&gt; and belonged to a homeschooling group of families who also used<br/>\n&gt; curriculum, I still felt like an outsider. I finally realized that I<br/>\n&gt; really had nothing in common with them other than the fact that we<br/>\n&gt; were homeschooling our children.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>One of my favorite homeschooling families that I really connect with has<br/>\nnever ever claimed to be unschooling.  They have one child who is a<br/>\nteen.  They&#39;ve always done what I guess people call relaxed<br/>\nhomeschooling.  However, the amount of respect and consideration they<br/>\ngive their daughter is amazing and wonderful.  It&#39;s a little of the the<br/>\nreverse of unschooling everything but math and bedtimes.  Their life is<br/>\nreally all about what they can do for and with their daughter that will<br/>\nmake her happy and content and allow her to flourish.<br/>\n<br/>\nI&#39;ve met other unschooling families claiming to be unschooling, but<br/>\nhaving school rooms set up in their house and heavily regulating video<br/>\ngames and food and stuff.  I think that&#39;s weird, I mean, why put a label<br/>\non yourself that doesn&#39;t even begin to describe what your about?<br/>\n<br/>\nI&#39;ve met a few unschoolers IRL, even a few that live near me, but I<br/>\ndon&#39;t ever see them even though I think the world of them for a variety<br/>\nof reasons, (MLewis, Emily...).<br/>\n<br/>\nOne way that helped me feel accepted was to go to a conference and put<br/>\nmyself out there.  I can be secure within myself, but it is nice to feel<br/>\na sense of belonging with something bigger than oneself.</div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Figuring out unschooling","postDate":"1222514259","msgId":38781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdibDRvais5bzUxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg=="},"prevInTopic":38780,"nextInTopic":38793,"prevInTime":38780,"nextInTime":38782,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... I m wondering if you are thinking that an unschooling lifestyle means freedom to do anything you want.  It s not quite like that.  In the example above","messageBody":"<div id=\"ygrps-yiv-2004119367\"><blockquote><span title=\"ireply\">&gt; And when you gave the suggestion to the other poster about telling the<br/>\n&gt; kid to be quiet while she was driving, &quot;and mean it.&quot; I thought, &quot;but<br/>\n&gt; how does that fit into letting him have a choice?&quot;<br/>\n<br/>\n </span></blockquote>I&#39;m wondering if you are thinking that an unschooling lifestyle means <br/>\nfreedom to do anything you want.  It&#39;s not quite like that.  In the <br/>\nexample above about the child being a backseat driver, he wasn&#39;t <br/>\nlooking for choices to explore life.  He was being rude and distracting <br/>\nthe driver which is dangerous.  <br/>\n<br/>\nI&#39;ve seen other homeschoolers talk about unschooling and they equate it <br/>\nwith unparenting.  I&#39;ve seen them say stuff like, &#39;But if I let my <br/>\nchild do anything they want, they&#39;ll run into the street and get hit by <br/>\na car!&#39;  Now think about that.  What child would intentionally run into <br/>\nthe street to get hit by a car?  But in these parent&#39;s lives, their <br/>\nchild running away is something that has happened.  Why would the child <br/>\nfeel a need to run away?  Because the parent isn&#39;t listening to and <br/>\nrespecting the child. Maybe the child just wanted to run.  So in that <br/>\ncase, the parent should find a safe place for the child to run.  Maybe <br/>\nthe child didn&#39;t want to get into the car.  Let&#39;s question why not.  Is <br/>\nit too hot in the car?  Is he not ready to go home or to the store?  <br/>\nThe kids don&#39;t listen because they&#39;ve learned it from their parents, <br/>\nwho don&#39;t listen to them.<br/>\n<br/>\nThis list is great for learning things like that.  :)<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"lifestyle changes","postDate":"1222513495","msgId":38780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdibDQwbis0dnNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdiazl0dCs5cmkxQGVHcm91cHMuY29tPg=="},"prevInTopic":38779,"nextInTopic":38781,"prevInTime":38779,"nextInTime":38781,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... I know exactly what you re talking about.  It s taken me a long time to deal with that feeling and honestly, I m still working on it. Hear my gentle tone","messageBody":"<div id=\"ygrps-yiv-921557676\"><blockquote><span title=\"ireply\">&gt; At this point, like in the past 6 years, I feel pressure more from<br/>\n&gt; the people I&#39;m moving TOWARDS, in this case, all of you wonderful<br/>\n&gt; people here! I want you to like me, I want to feel like I belong,<br/>\n&gt; like I&#39;m one of you, a part of something.<br/>\n<br/>\n </span></blockquote>I know exactly what you&#39;re talking about.  It&#39;s taken me a long time <br/>\nto deal with that feeling and honestly, I&#39;m still working on it.  <br/>\n<br/>\nHear my gentle tone when I remind you that this is an ideas list and <br/>\nnot a support group.  I think that is one reason people get so <br/>\noffended and want to leave.  They are looking for friends who will <br/>\nhold their hand and walk them softly through the unschooling <br/>\njourney.  Maybe if you had someone in person with that kind of <br/>\npersonality, it would be really great.  But this list won&#39;t really do <br/>\nthat for you.  <br/>\n<br/>\nWhen unschooling really started clicking for me, it was because of <br/>\nthe changes I was making in my own lifestyle.  Sometimes, I probably <br/>\nsound like many of these wonderful ladies when I talk about <br/>\nunschooling online.  But I&#39;m not a part of a club or anything.  I <br/>\ndon&#39;t have any real life unschooling friends.  I have never met the <br/>\nmajority of these ladies.  But my life is joyful.  It&#39;s very freeing <br/>\nto start unschooling yourself!  This list helps you ask the questions <br/>\nand will suggest some ways to find the answers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I DO have my DH and my<br/>\n&gt; family (the kids, not extended) who have wholeheartedly supported me<br/>\n&gt; every step of the way, but it&#39;s nice to have other mothers who share<br/>\n&gt; your ideals.<br/>\n<br/>\n </span></blockquote>Yes Deb, I&#39;ve always felt that way too.  But in all the groups I&#39;ve <br/>\nbeen in, I&#39;ve seen just how different everyone really is.  One common <br/>\ncause does not make a best friend.  Even when I was using curriculum <br/>\nand belonged to a homeschooling group of families who also used <br/>\ncurriculum, I still felt like an outsider.  I finally realized that I <br/>\nreally had nothing in common with them other than the fact that we <br/>\nwere homeschooling our children.<br/>\n<br/>\nI suggest you find ways to make your life joyful.  Stop worrying <br/>\nabout whether or not you belong, or what group of people might be <br/>\nlike you.  If you act like you doing the things you enjoy doing, <br/>\nyou&#39;ll naturally meet other people who like some of the same things.  <br/>\nYou might have one person that you love shopping with, and one person <br/>\nwho loves to go the movies with you, and one person who loves to sit <br/>\nby the pool and shoot the breeze.  But you may not find someone who <br/>\nwill fill all your needs.  Does that make sense?<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"lifestyle changes","postDate":"1222513313","msgId":38779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdibDNyMSttMDRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdiazl0dCs5cmkxQGVHcm91cHMuY29tPg=="},"prevInTopic":38777,"nextInTopic":38780,"prevInTime":38778,"nextInTime":38780,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... I know exactly what you re talking about.  It s taking me a long time to deal with that feeling and honestly, I m still working on it. Hear my gentle tone","messageBody":"<div id=\"ygrps-yiv-2066653371\"><blockquote><span title=\"ireply\">&gt; At this point, like in the past 6 years, I feel pressure more from<br/>\n&gt; the people I&#39;m moving TOWARDS, in this case, all of you wonderful<br/>\n&gt; people here! I want you to like me, I want to feel like I belong,<br/>\n&gt; like I&#39;m one of you, a part of something.<br/>\n<br/>\n </span></blockquote>I know exactly what you&#39;re talking about.  It&#39;s taking me a long time <br/>\nto deal with that feeling and honestly, I&#39;m still working on it.  <br/>\n<br/>\nHear my gentle tone when I remind you that this is an ideas list and <br/>\nnot a support group.  I think that is one reason people get so <br/>\noffended and want to leave.  They are looking for friends who will <br/>\nhold their hand and walk them softly through the unschooling <br/>\njourney.  Maybe if you had someone in person with that kind of <br/>\npersonality, it would be really great.  But this list won&#39;t really do <br/>\nthat for you.  <br/>\n<br/>\nWhen unschooling really started clicking for me, it was because of <br/>\nthe changes I was making in my own lifestyle.  Sometimes, I probably <br/>\nsound like many of these wonderful ladies when I talk about <br/>\nunschooling online.  But I&#39;m not a part of a club or anything.  I <br/>\ndon&#39;t have any real life unschooling friends.  I have never met the <br/>\nmajority of these ladies.  But my life is joyful.  It&#39;s very freeing <br/>\nto start unschooling yourself!  This list helps you ask the questions <br/>\nand will suggest some ways to find the answers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I DO have my DH and my<br/>\n&gt; family (the kids, not extended) who have wholeheartedly supported me<br/>\n&gt; every step of the way, but it&#39;s nice to have other mothers who share<br/>\n&gt; your ideals.<br/>\n<br/>\n </span></blockquote>Yes Deb, I&#39;ve always felt that way too.  But in all the groups I&#39;ve <br/>\nbeen in, I&#39;ve seen just how different everyone really is.  One common <br/>\ncause does not make a best friend.  Even when I was using curriculum <br/>\nand belonged to a homeschooling group of families who also used <br/>\ncurriculum, I still felt like an outsider.  I finally realized that I <br/>\nreally had nothing in common with them other than the fact that we <br/>\nwere homeschooling our children.<br/>\n<br/>\nI suggest you find ways to make your life joyful.  Stop worrying <br/>\nabout whether or not you belong, or what group of people might be <br/>\nlike you.  If you act like you doing the things you enjoy doing, <br/>\nyou&#39;ll naturally meet other people who like some of the same things.  <br/>\nYou might have one person that you love shopping with, and one person <br/>\nwho loves to go the movies with you, and one person who loves to sit <br/>\nby the pool and shoot the breeze.  But you may not find someone who <br/>\nwill fill all your needs.  Does that make sense?</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222508667","msgId":38777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERFNEMxODNFLTk0NDAtNDYxOC1BMkMzLUYxRDUyMEZDREM4N0BtYWMuY29tPg==","inReplyToHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg==","referencesHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg=="},"prevInTopic":38773,"nextInTopic":38779,"prevInTime":38776,"nextInTime":38778,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... They are asked for you to think about, not to get you to reveal all to us. -pam","messageBody":"<div id=\"ygrps-yiv-220813434\">On Sep 26, 2008, at 9:51 PM, prism7513 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel the need to answer the questions that are asked in my<br/>\n&gt; direction. I AM trying things out. I AM watching my kids<br/>\n<br/>\n </span></blockquote>They are asked for you to think about, not to get you to reveal all to  <br/>\nus.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Choices, boundaries","postDate":"1222495750","msgId":38773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFDNDk4RkRBLTQ4Q0ItNEYxMi05RjA3LTEwMDhBQzNEN0M5Q0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg==","referencesHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg=="},"prevInTopic":38771,"nextInTopic":38777,"prevInTime":38772,"nextInTime":38774,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"-=-And when you gave the suggestion to the other poster about telling the kid to be quiet while she was driving, and mean it. I thought, but how does that","messageBody":"<div id=\"ygrps-yiv-1865780923\">-=-And when you gave the suggestion to the other poster about telling  <br/>\nthe<br/>\nkid to be quiet while she was driving, &quot;and mean it.&quot; I thought, &quot;but<br/>\nhow does that fit into letting him have a choice?&quot;-=-<br/>\n<br/>\nI provide my children with choices and options.   I&#39;m not bound to  <br/>\nprovide the same privileges for neighbors, friends or relatives.   If  <br/>\na kid comes over and wants to hit my kid, that&#39;s not one of his  <br/>\nchoices.  If a stranger wants to come over and kick my dog or break  <br/>\nmy windows, that&#39;s not a choice I&#39;m willing to give him.<br/>\n<br/>\nBut then again, my own kids don&#39;t hit each other or kick the dog or  <br/>\nbreak windows.  And they don&#39;t tell me how to drive, unless they do  <br/>\nit kindly and helpfully.   If they kept on after I had asked them to  <br/>\nstop, I would say to be quiet while I was driving, and I would mean it.<br/>\n<br/>\n-=-I&#39;m just not THERE, yet. I&#39;m still on the path, I&#39;m still  <br/>\nunschooling, but I don&#39;t have all the details. And just doing it  <br/>\nwon&#39;t bring them, because I&#39;m not sure what to do in place of the  <br/>\nthings I&#39;ve been doing. -=-<br/>\n<br/>\nPeople have been pouring alternative ideas and links toward you for  <br/>\ndays.   Read them.  Read them again. Try them out.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222495045","msgId":38771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NTcyREQwLTk2Q0EtNEIzMi05QjJCLTI1Mjk5OEU2QzI0NkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg==","referencesHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg=="},"prevInTopic":38768,"nextInTopic":38773,"prevInTime":38770,"nextInTime":38772,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... -=-I feel the need to answer the questions that are asked in my direction. -=- The list isn t about your needs.  It s about discussing unschooling. Most of","messageBody":"<div id=\"ygrps-yiv-1475803027\"><blockquote><span title=\"ireply\">&gt; Then don&#39;t debate. Just read. Think. Try things out with your kids<br/>\n &gt; at home and watch them.<br/>\n<br/>\n </span></blockquote>-=-I feel the need to answer the questions that are asked in my<br/>\ndirection. -=-<br/>\n<br/>\nThe list isn&#39;t about your needs.  It&#39;s about discussing unschooling.   <br/>\nMost of the questions people ask are questions asked rhetorically, in  <br/>\norder for you to clarify your own thinking, so that you can see the  <br/>\nflaws in your reasoning.  They&#39;re not  asking because they need to  <br/>\nknow,  usually, but because they think you need to think about the  <br/>\nanswers to move closer to unschooling.<br/>\n<br/>\nIf what you need is to be involved in a discussion of unschooling,  <br/>\nthis list will be great for you!<br/>\n<br/>\n-=-I AM trying things out. I AM watching my kids-=-<br/>\n<br/>\nNot while you&#39;re writing to the list you&#39;re not.<br/>\n<br/>\nYou haven&#39;t had time to see  how these things play out at your house  <br/>\nbefore you&#39;re back writing more and more.<br/>\n<br/>\n-=-Did you wait for deep  answers about how bicycles work before you  <br/>\nrode a bicycle?<br/>\n<br/>\n**I was five and believed anything anyone told me.<br/>\n<br/>\nThis misses the point.  You didn&#39;t NEED to know how bicycles worked  <br/>\nbefore you could ride one.  You were five, but you were able to ride  <br/>\na bike without waiting to understand mechanics and physics.  You can  <br/>\nunschool without a million words passing between you and the list.   <br/>\nYou canNOT unschool if you wait until a million words pass.<br/>\n<br/>\n-=-I&#39;m not sure I said I needed to take time on anything - I was  <br/>\nasking the people on this list to be patient with me for asking so  <br/>\nmany questions because I obviously haven&#39;t gotten to the place where  <br/>\nyou are yet that you are so comfortable with your decisions.-=-<br/>\n<br/>\nThis is the kind of writing that neither helps you nor others on the  <br/>\nlist.  We don&#39;t need to be patient.  You need to read what people are  <br/>\nsending you more and post less.   You WILL get it if you read a  <br/>\nwhile, try some things, and only send your real, new questions, and  <br/>\nyour successes and thoughts that will help other unschoolers.  There  <br/>\nare lots of people reading, but if the list is too busy and  <br/>\nrepetitive, fewer will read.  So I&#39;ve asked regularly and often that  <br/>\npeople not post &quot;me too&quot; or &quot;thanks,&quot; and that they&#39;re careful to  <br/>\nsend what will help other people understand unschooling.<br/>\n<br/>\nThe purpose of the list is to discuss what helps and what hurts, and  <br/>\nwe&#39;ve been doing that.  Anyone can dip a cup in and partake of the  <br/>\ndiscussion, or make requests for topics, or throw situations out, but  <br/>\nno one can try to subvert the flow of the list toward a different  <br/>\ndirection.<br/>\n<br/>\nIt&#39;s about ideas, not about individuals.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222492604","msgId":38768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDQjkzQTVDLUQ1OUQtNDU5Qy04QzA3LTFCOTE0RDcyMEMwOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdiazl0dCs5cmkxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdiazl0dCs5cmkxQGVHcm91cHMuY29tPg=="},"prevInTopic":38767,"nextInTopic":38771,"prevInTime":38767,"nextInTime":38769,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"-=-I am moving forward, but I always test things first. Otherwise, aren t I simply being a sheep to the unschooling shepherd? Unschooling, like anything else,","messageBody":"<div id=\"ygrps-yiv-1327103772\">-=-I am moving forward, but I always test things first. Otherwise,<br/>\naren&#39;t I simply being a sheep to the unschooling shepherd?<br/>\nUnschooling, like anything else, should be able to be examined and<br/>\ntested and hashed about. If it&#39;s true, it will hold up. If it&#39;s for<br/>\nme, I will feel at peace.-=-<br/>\n<br/>\nBut you test it in and with yourself at home, not on this list.<br/>\n<br/>\nDo you mean you&#39;re testing US?  To see if we can defend unschooling?<br/>\n<br/>\n-=-I want you to like me, I want to feel like I belong, like I&#39;m one  <br/>\nof you, a part of something. -=-<br/>\n<br/>\nWhat people will like here is to feel that you&#39;re really thinking and  <br/>\nchanging, not that you&#39;re just writing and writing and writing  <br/>\nwithout reading and being more closely with your family.  What people  <br/>\nLOVE here is for people to get it and to express that by telling  <br/>\nstories about their actions with their kids.  No amount of recitation  <br/>\nwill impress people.  After a while it gets irritating.<br/>\n<br/>\nRead these, please.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gettingit\">http://sandradodd.com/gettingit</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/becoming.html\">http://sandradodd.com/peace/becoming.html</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/change\">http://sandradodd.com/change</a><br/>\n<br/>\nThey&#39;re all about the changes in people&#39;s lives when they change from  <br/>\ntalking about being more mindful to really BEING more mindful.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":356893003,"authorName":"prism7513","from":"&quot;prism7513&quot; &lt;penley75@...&gt;","profile":"prism7513","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222491101","msgId":38767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdia2U0dCtxc21yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdGMUFCQTk4LTJFMjUtNDlDQS1BNUFELTZGN0M5MUZEMTI3Q0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":38763,"nextInTopic":38768,"prevInTime":38766,"nextInTime":38768,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... It s not the goal of unschooling, but it IS the goal of parenting. When I die, I want to know I ve done the best job I can at raising my children, and the","messageBody":"<div id=\"ygrps-yiv-2088273258\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Is this the goal of unschooling for you?  For you to be fine?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>It&#39;s not the goal of unschooling, but it IS the goal of parenting.<br/>\nWhen I die, I want to know I&#39;ve done the best job I can at raising my<br/>\nchildren, and the part of me that decides whether I&#39;m doing well or<br/>\nnot - that instinct or conscience or WHATever it is that gives me<br/>\npeace at night...if it&#39;s not there, then I&#39;m not doing my job. I&#39;m not<br/>\ntalking about comfort zone &quot;fine.&quot; I&#39;m talking about knowing I&#39;ve done<br/>\nmy job &quot;fine.&quot;<br/>\n<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; Why would you want to blindly trust other parents who DO understand  <br/>\n&gt; where you come from?  Why would you want to trust anyone?<br/>\n<br/>\n </span></blockquote>I don&#39;t - thus the questioning...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Then don&#39;t debate.  Just read.  Think.  Try things out with your kids  <br/>\n&gt; at home and watch them.<br/>\n<br/>\n </span></blockquote>I feel the need to answer the questions that are asked in my<br/>\ndirection. I AM trying things out. I AM watching my kids<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The &quot;deep answers&quot; won&#39;t make any sense if you aren&#39;t going to trust  <br/>\n&gt; anyone.  You will need to do this yourself.  Did you wait for deep  <br/>\n&gt; answers about how bicycles work before you rode a bicycle?<br/>\n<br/>\n </span></blockquote>I was five and believed anything anyone told me. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Nobody here&#39;s getting paid to help you.  Everyone&#39;s volunteering.  We  <br/>\n&gt; don&#39;t have to report your progress.  You can take you time to get to  <br/>\n&gt; unschooling eventually, when your kids are older, or maybe understand  <br/>\n&gt; it well enough to help them with their kids someday if they decide  <br/>\n&gt; they wish you had unschooled them when they were little.<br/>\n<br/>\n </span></blockquote>First off, I&#39;m not sure why you said this. I thought this group was<br/>\nfor people to learn the ins and outs of unschooling. On the homepage<br/>\nit says &quot;What will help? What will hinder?&quot; That&#39;s all I&#39;m trying to<br/>\nfigure out. Maybe I&#39;m off base, but I thought that people learn by<br/>\nasking questions, or at least SOME people learn that way, and I am one<br/>\nof them. Always have been. Why do you insinuate that I&#39;m NOT<br/>\nunschooling simply because I&#39;m questioning the details? My kids have<br/>\nno set schedule, eat when they want, and mostly what they want (hence<br/>\nthe questions about food so I can learn more about how you do that),<br/>\nthey play when and where and what they want. They create all the time,<br/>\nand ask questions constantly. Just because I&#39;m trying to define what,<br/>\nexactly, I need to be as an unschooling parent doesn&#39;t mean we aren&#39;t<br/>\nunschooling currently. The journey isn&#39;t over, but it doesn&#39;t mean it<br/>\nhasn&#39;t begun. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Although you&#39;re assuring us that your path is much harder than we  <br/>\n&gt; will expect (where do you think the rest of the 1800 people on this  <br/>\n&gt; list came from?), <br/>\n<br/>\n </span></blockquote>When did I say that?<br/>\n<br/>\n<br/>\nI think your children probably age at the same rate  <br/>\n<blockquote><span title=\"ireply\"> &gt; everyone else&#39;s do--another day older every day.  If you take your  <br/>\n&gt; time at this point, you&#39;re taking their time too.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m not sure I said I needed to take time on anything - I was asking<br/>\nthe people on this list to be patient with me for asking so many<br/>\nquestions because I obviously haven&#39;t gotten to the place where you<br/>\nare yet that you are so comfortable with your decisions.<br/>\n<br/>\nAnd if it seems that I am being self-centered, then I&#39;m not sure what<br/>\nyou expect from me. I am trying to change my thinking and outlook and<br/>\nway of doing things so that my kids can learn in freedom. Maybe you<br/>\nare the kind of person who can just do something without thinking it<br/>\nthrough and asking everyone around you about it. I&#39;m not, at least not<br/>\nyet.<br/>\n<br/>\nYou encourage your children to test things and to question things, and<br/>\nthat is all I am doing. Why can&#39;t I question unschooling like I do<br/>\nother things that I learn? <br/>\n<br/>\nAs for the bike analogy. If I were to learn to ride a bike today,<br/>\nnever having ridden one before, then I probably WOULD question<br/>\neverything about it. &quot;where do you put your foot?&quot; &quot;but what about<br/>\nyour other foot?&quot; &quot;what about when I start to fall off and I loose my<br/>\nbalance?&quot; &quot;should I peddle fast, or slow?&quot; &quot;are you going to hold on<br/>\nto me?&quot;<br/>\n<br/>\nWhen my daughter asked me today as she tried her &quot;new&quot; used bike that<br/>\nshe could just barely reach, &quot;What if I fall?&quot; I didn&#39;t tell her to<br/>\njust go out there and find out. I replied, &quot;If you start to feel like<br/>\nyou&#39;re going to fall, then move off into the grass where you&#39;ll slow<br/>\ndown and falling won&#39;t hurt as bad. But just in case, I&#39;ll also jog<br/>\nbehind you and if I see you waver, I&#39;ll catch you.&quot;<br/>\n<br/>\nI had hoped that this list was a place I could learn more about the<br/>\nfiner details of unschooling in a positive way. Maybe this is why<br/>\npeople seek support of a different kind. I don&#39;t need to you pat me on<br/>\nthe back if I&#39;m not doing things the right way, but at the same time<br/>\nit would be nice to have the offer of &quot;I&#39;ll hold your hand through this.&quot;<br/>\n<br/>\nIt&#39;s obvious that I can&#39;t just &quot;do it&quot; as you keep saying, because<br/>\nwhen I tried, in the store, I apparently got it wrong. I redirected my<br/>\nson&#39;s words instead of ....well, I still don&#39;t know what I should have<br/>\ndone. Sitting and playing with the toys isn&#39;t really an option for me<br/>\nbecause the two babies get tired of shopping now as it is, and they<br/>\ndon&#39;t like sitting in the cart, so I have to get done quickly in order<br/>\nto keep them happy.<br/>\n<br/>\nAnd when you gave the suggestion to the other poster about telling the<br/>\nkid to be quiet while she was driving, &quot;and mean it.&quot; I thought, &quot;but<br/>\nhow does that fit into letting him have a choice?&quot;<br/>\n<br/>\nI&#39;m just not THERE, yet. I&#39;m still on the path, I&#39;m still unschooling,<br/>\nbut I don&#39;t have all the details. And just doing it won&#39;t bring them,<br/>\nbecause I&#39;m not sure what to do in place of the things I&#39;ve been doing. <br/>\n<br/>\nApparently I&#39;m getting the point of this forum wrong, too.<br/>\n<br/>\nI&#39;m sorry, I truly am. I didn&#39;t mean to waste your time.<br/>\n<br/>\nDeb</div>","specialLinks":[]},{"userId":356893003,"authorName":"prism7513","from":"&quot;prism7513&quot; &lt;penley75@...&gt;","profile":"prism7513","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222486781","msgId":38763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdiazl0dCs5cmkxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgwOTI2MTU0NXMyNmI5NDkyOXg0Njc0NTc5Yjc1ZDU5ZDNjQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":38749,"nextInTopic":38767,"prevInTime":38762,"nextInTime":38764,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... have been ... or half ... whatever you ... Luckily, I m not waiting. But as I m moving, I m putting out feelers. Like a snail, perhaps, testing the","messageBody":"<div id=\"ygrps-yiv-1782798167\"><blockquote><span title=\"ireply\">&gt; If you wait until you&#39;re convinced, until all the traces of doubt<br/>\n </span></blockquote>have been<br/>\n<blockquote><span title=\"ireply\"> &gt; removed, too much time will have passed and your kids will be grown<br/>\n </span></blockquote>or half<br/>\n<blockquote><span title=\"ireply\"> &gt; grown.  But in the meantime, continue to read and move through<br/>\n </span></blockquote>whatever you<br/>\n<blockquote><span title=\"ireply\"> &gt; need to in order to get more &quot;in your skin.&quot;<br/>\n&gt; <br/>\n </span></blockquote> Luckily, I&#39;m not waiting. But as I&#39;m moving, I&#39;m putting out feelers.<br/>\nLike a snail, perhaps, testing the &quot;waters&quot;, if you will, as he moves<br/>\nalong. I am moving forward, but I always test things first. Otherwise,<br/>\naren&#39;t I simply being a sheep to the unschooling shepherd?<br/>\nUnschooling, like anything else, should be able to be examined and<br/>\ntested and hashed about. If it&#39;s true, it will hold up. If it&#39;s for<br/>\nme, I will feel at peace.<br/>\n<br/>\nThe first changes I made were as a mother and parent. Then this past<br/>\ntwo years it&#39;s been as a person and my faith. And now it&#39;s as a parent<br/>\nyet again...always changing, testing, questioning. And sometimes I<br/>\njust want to rest and be SURE that I&#39;m &quot;okay.&quot; I am such a darn people<br/>\npleaser and I so want to be right, and for once I just wish I didn&#39;t<br/>\ncare what people thought, and just did what *I* want to do, but then I<br/>\ndon&#39;t really know what that is...<br/>\n<br/>\nAt this point, like in the past 6 years, I feel pressure more from the<br/>\npeople I&#39;m moving TOWARDS, in this case, all of you wonderful people<br/>\nhere! I want you to like me, I want to feel like I belong, like I&#39;m<br/>\none of you, a part of something. I know that&#39;s not at all what it&#39;s<br/>\nabout, but that feeling is still present. It&#39;s been there since the<br/>\nfirst grade when I first became an outsider.<br/>\n<br/>\nWhile I mostly feel confident in who I am and the decisions I make,<br/>\nthe other part of me just wishes I could be like everyone else and not<br/>\nfight the system. No home births, no nursing toddlers in public, no<br/>\nhomeschooling, whatever. I hate being the odd ball out. And yet at<br/>\nnight when I think about my choices, I&#39;d have it no other way. But I<br/>\ndo wish I had someone to travel this road with. I DO have my DH and my<br/>\nfamily (the kids, not extended) who have wholeheartedly supported me<br/>\nevery step of the way, but it&#39;s nice to have other mothers who share<br/>\nyour ideals.<br/>\n<br/>\nDeb</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222479874","msgId":38749,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2NkU1MURDLTc1NUItNDhCNS1BMzU2LUJFRTVGM0JCRkRGQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdiamt0ZStkNW9nQGVHcm91cHMuY29tPg==","referencesHeader":"PGdiamt0ZStkNW9nQGVHcm91cHMuY29tPg=="},"prevInTopic":38739,"nextInTopic":38763,"prevInTime":38748,"nextInTime":38750,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... I m betting there are few people here who don t understand where you re coming from. But you re in essence focusing on your spinning wheels asking us if","messageBody":"<div id=\"ygrps-yiv-26367534\"><blockquote><span title=\"ireply\">&gt; I don&#39;t trust myself at all...I can&#39;t<br/>\n&gt; trust other parents who don&#39;t understand where I come from, and most<br/>\n&gt; of the people who have been unschooling for awhile are SO confident<br/>\n&gt; that it feels like &quot;We have it all together, and you need to just get<br/>\n&gt; your act together already!&quot;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m betting there are few people here who don&#39;t understand where  <br/>\nyou&#39;re coming from. But you&#39;re in essence focusing on your spinning  <br/>\nwheels asking us if they&#39;ll ever stop spinning. And we&#39;re saying it  <br/>\ndoesn&#39;t help to look at the spinning wheels. It helps to look at  <br/>\nwhere you&#39;d like to be.<br/>\n<br/>\nSometimes just focusing on where you want to be can make all the  <br/>\ndifference!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I&#39;m trying to ask questions to get deep answers<br/>\n&gt; because I am the type of person that needs to be convinced of<br/>\n&gt; something before I just go and do it<br/>\n&gt;<br/>\n </span></blockquote>Actually what your words have asked for are the surface answers, eg,  <br/>\ndo classes damage kids as much as school? The answer (yes or no)  <br/>\ndoesn&#39;t get to why. As much as the engineer in me would like the  <br/>\nworld to be nothing but yes or no ;-) it&#39;s not that orderly. Most of  <br/>\nthe time the answer is &quot;It depends.&quot; And that&#39;s where deep begins.<br/>\n<br/>\nThe deep answers get into goals and philosophy.<br/>\n<br/>\nI think what you&#39;re asking is &quot;Does this work?&quot; But you haven&#39;t  <br/>\nclearly defined what &quot;this&quot; is to yourself and you&#39;re not sure if our  <br/>\n&quot;this&quot; matches yours. If you were certain our &quot;this&quot; matched yours,  <br/>\nthen you wouldn&#39;t need to ask *if* kids bodies will find the right  <br/>\nbalance (another question designed for a yes or no answer). Because  <br/>\nif kids bodies don&#39;t find the right balance, then we&#39;re a bunch of  <br/>\nloonies with kids who do nothing but watch TV and eat cookies and you  <br/>\nshouldn&#39;t be asking us!<br/>\n<br/>\nThe questions that will help you get to the deep stuff aren&#39;t the yes/ <br/>\nno questions but the how and why questions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I guess the question is, will the kids figure out what&#39;s good for<br/>\n&gt; them in spite of &quot;bad&quot; conditions, or do I need to change the<br/>\n&gt; conditions in order to better favor their bodies needs?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It depends!<br/>\n<br/>\nAnd it&#39;s another yes/no question and won&#39;t dig deep.<br/>\n<br/>\nThe healthier the model -- and model implies the ideas aren&#39;t being  <br/>\nimposed -- the more likely they&#39;ll eat healthy. It&#39;s not the only  <br/>\nfactor, though. Nothing&#39;s that easy when it comes to humans.<br/>\n<br/>\nIf mom smokes and tells kids not to smoke, what are the chances the  <br/>\nkids will smoke? Is it different if the mom doesn&#39;t smoke and tells  <br/>\nthe kids not to smoke? The answer is: it depends!<br/>\n<br/>\nIf mom doesn&#39;t smoke and shares honestly about why *she* chose not to  <br/>\nsmoke -- and the kids aren&#39;t in school -- the chances that the kids  <br/>\nwill smoke will go down. It comes down to trust and freedom.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222476341","msgId":38739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdianZubCtzb2tyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdiamt0ZStkNW9nQGVHcm91cHMuY29tPg=="},"prevInTopic":38738,"nextInTopic":38749,"prevInTime":38738,"nextInTime":38740,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... It s a do-over!  Stop worrying about perfection which is unreachable anyway. Be your children s partner.  Learn alongside them.  My kids know I m in","messageBody":"<div id=\"ygrps-yiv-395070442\"><blockquote><span title=\"ireply\">&gt; So it&#39;s hard for me to be confident. It&#39;s hard for me to &quot;trust&quot;<br/>\n&gt; anything since I trusted my parents completely, and now I realize<br/>\n&gt; that they weren&#39;t perfect, either. I don&#39;t trust myself at all...<br/>\n<br/>\n </span></blockquote>It&#39;s a do-over!  Stop worrying about perfection which is unreachable <br/>\nanyway. Be your children&#39;s partner.  Learn alongside them.  My kids <br/>\nknow I&#39;m in uncharted territory.  They really like that we&#39;re all in <br/>\nthis together.  :)<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222473598","msgId":38738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdianQxdSs3ajl1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdiampxZCtrbHRuQGVHcm91cHMuY29tPg=="},"prevInTopic":38733,"nextInTopic":38739,"prevInTime":38737,"nextInTime":38739,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... WAIT!  Your kidding right?!!!  The sugary cereal stuff is probably the cheapest you CAN buy!  At least in the US, I don t know about other locations, but","messageBody":"<div id=\"ygrps-yiv-1980747746\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; yes, I think it tastes like the milk in the bowl of sugary cereals!<br/>\n&gt; Oh! how I miss those! (don&#39;t buy them because they are gone in a day<br/>\n&gt; and can&#39;t justify the money...I&#39;d rather have cookies!...but I&#39;ll have<br/>\n&gt; to sometime let the kids choose some to try - they never have asked<br/>\n&gt; because they don&#39;t know what they taste like...)<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>WAIT!  Your kidding right?!!!  The sugary cereal stuff is probably the<br/>\ncheapest you CAN buy!  At least in the US, I don&#39;t know about other<br/>\nlocations, but the big box mart kind of stores sell this stuff really<br/>\ncheap!  Your kids could eat and eat and get sick of it for very little<br/>\nmoney!  Homemade cookies could cost more depending on the ingredients<br/>\nyou put in them.<br/>\n<br/>\nAs a nice example of a kid who is forbidden such things, just look at<br/>\nCalvin and Hobbes.  That poor Calvin is always inventing ways of getting<br/>\ninto the cookie jar and longing for Saturday morning to eat his frosted<br/>\nsugar bombs with cartoons and wishing it would last forever!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222470369","msgId":38733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGMUFCQTk4LTJFMjUtNDlDQS1BNUFELTZGN0M5MUZEMTI3Q0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdiamt0ZStkNW9nQGVHcm91cHMuY29tPg==","referencesHeader":"PGdiamt0ZStkNW9nQGVHcm91cHMuY29tPg=="},"prevInTopic":38728,"nextInTopic":38738,"prevInTime":38732,"nextInTime":38734,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"-=-I think, too, that if I could close my eyes and not watch what they ate, or did, etc., that I d be fine.-=- Is this the goal of unschooling for you?  For","messageBody":"<div id=\"ygrps-yiv-482448964\">-=-I think, too, that if I could close my eyes and not watch what they<br/>\nate, or did, etc., that I&#39;d be fine.-=-<br/>\n<br/>\nIs this the goal of unschooling for you?  For you to be fine?<br/>\n<br/>\nSomeone who speaks at unschooling conferences sometimes made a  <br/>\nstatement that unschooling is giving a child as many choices as the  <br/>\nparent is comfortable giving.  Huh.  Maybe parents need to sacrifice  <br/>\ntheir comfort level for it to work.  That speaker  has three  <br/>\nchildren, all of whom have gone to school.  Unschooling wasn&#39;t quite  <br/>\nat the children&#39;s comfort level in that family.<br/>\n<br/>\n<br/>\n<br/>\n-=-It&#39;s hard for me to &quot;trust&quot; anything since I trusted my parents  <br/>\ncompletely, and now I realize that they weren&#39;t perfect, either. I  <br/>\ndon&#39;t trust myself at all...I can&#39;t trust other parents who don&#39;t  <br/>\nunderstand where I come from,-=-<br/>\n<br/>\nWhy would you want to blindly trust other parents who DO understand  <br/>\nwhere you come from?  Why would you want to trust anyone?<br/>\n<br/>\n-=-I&#39;m trying...I really am. I&#39;m not great at debating about  <br/>\nsomething I have no clue about.-=-<br/>\n<br/>\nThen don&#39;t debate.  Just read.  Think.  Try things out with your kids  <br/>\nat home and watch them.<br/>\n<br/>\n-=-So I&#39;m trying to ask questions to get deep answers because I am  <br/>\nthe type of person that needs to be convinced of something before I  <br/>\njust go and do it-=-<br/>\n<br/>\nThe &quot;deep answers&quot; won&#39;t make any sense if you aren&#39;t going to trust  <br/>\nanyone.  You will need to do this yourself.  Did you wait for deep  <br/>\nanswers about how bicycles work before you rode a bicycle?<br/>\n<br/>\n-=-I have to play devil&#39;s advocate in order to prove to myself that  <br/>\nwhat I&#39;m learning will hold up.-=-<br/>\n<br/>\nNo, you don&#39;t &quot;have to,&quot; and if you do it too much and too long, what  <br/>\nare your kids doing during that time?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nPlease read that and the links.  It will help your children.  When  <br/>\nyour children feel better you will feel fantastic.<br/>\n<br/>\n-=-So I hope you understand that I AM actually on the road,  <br/>\ntraveling. I just haven&#39;t arrived, yet.-=-<br/>\n<br/>\nNobody here&#39;s getting paid to help you.  Everyone&#39;s volunteering.  We  <br/>\ndon&#39;t have to report your progress.  You can take you time to get to  <br/>\nunschooling eventually, when your kids are older, or maybe understand  <br/>\nit well enough to help them with their kids someday if they decide  <br/>\nthey wish you had unschooled them when they were little.<br/>\n<br/>\nAlthough you&#39;re assuring us that your path is much harder than we  <br/>\nwill expect (where do you think the rest of the 1800 people on this  <br/>\nlist came from?), I think your children probably age at the same rate  <br/>\neveryone else&#39;s do--another day older every day.  If you take your  <br/>\ntime at this point, you&#39;re taking their time too.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222469130","msgId":38728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwOTI2MTU0NXMyNmI5NDkyOXg0Njc0NTc5Yjc1ZDU5ZDNjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdiamt0ZStkNW9nQGVHcm91cHMuY29tPg==","referencesHeader":"PEQxQ0I4QUUzLURCM0MtNEQzQi1BNjM4LUIxODE4Nzg1Qjg3M0BzYW5kcmFkb2RkLmNvbT4JIDxnYmprdGUrZDVvZ0BlR3JvdXBzLmNvbT4="},"prevInTopic":38721,"nextInTopic":38733,"prevInTime":38727,"nextInTime":38729,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... you might imagine. This stuff is so far removed from the way I have always known things, and I ve changed SO much in the past 6 years, that I almost feel I","messageBody":"<div id=\"ygrps-yiv-1395422626\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;But each step I&#39;ve taken on this journey has been more stretching than<br/>\n </span></blockquote>you might imagine. This stuff is so far removed from the way I have<br/>\nalways known things, and I&#39;ve changed SO much in the past 6 years,<br/>\nthat I almost feel I don&#39;t know who I am anymore.&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nJoin the club!  I don&#39;t know who I am anymore either.  I like my life better<br/>\nnow, BY FAR.  But it&#39;s not familiar.  Parts of it are.  This is not exactly<br/>\n180 degrees from the way I was brought up, in some ways.  In other ways, it<br/>\ndoesn&#39;t even seem to be in the same universe.  It&#39;s a bit uncomfortable<br/>\ntraveling to another galaxy and knowing that when you come back across all<br/>\nthe lightyears later the departure point where you sprang from has changed<br/>\ntoo but not in the same way you have.  Unsettling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;I&#39;m trying...I really am. I&#39;m not great at debating about something I<br/>\n </span></blockquote>have no clue about. So I&#39;m trying to ask questions to get deep answers<br/>\nbecause I am the type of person that needs to be convinced of<br/>\nsomething before I just go and do it (didn&#39;t someone on here mention<br/>\nthat their child was the same way because they choose to think before<br/>\nacting?)&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nIf you wait until you&#39;re convinced, until all the traces of doubt have been<br/>\nremoved, too much time will have passed and your kids will be grown or half<br/>\ngrown.  But in the meantime, continue to read and move through whatever you<br/>\nneed to in order to get more &quot;in your skin.&quot;<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":356893003,"authorName":"prism7513","from":"&quot;prism7513&quot; &lt;penley75@...&gt;","profile":"prism7513","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222465262","msgId":38721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdiamt0ZStkNW9nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQxQ0I4QUUzLURCM0MtNEQzQi1BNjM4LUIxODE4Nzg1Qjg3M0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":38719,"nextInTopic":38728,"prevInTime":38720,"nextInTime":38722,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"I think, too, that if I could close my eyes and not watch what they ate, or did, etc., that I d be fine. I honestly DO trust my kids more than what you think.","messageBody":"<div id=\"ygrps-yiv-776917819\">I think, too, that if I could close my eyes and not watch what they<br/>\nate, or did, etc., that I&#39;d be fine.<br/>\n<br/>\nI honestly DO trust my kids more than what you think. What I DON&#39;T<br/>\ntrust is myself. Let me explain.<br/>\n<br/>\nOkay, I let my kids eat x amount of cookies. I think, &quot;I&#39;m such a<br/>\nhorrible mom! Maybe I shouldn&#39;t have done that....&quot;<br/>\n<br/>\nMost of this journey hasn&#39;t been about them, but about ME. I have<br/>\nwatched them wondrously become smart little beings who are creative,<br/>\nbright, funny, caring, etc. I have poured out my time and energy into<br/>\nletting them be who they want to be as much as possible.<br/>\n<br/>\nBut each step I&#39;ve taken on this journey has been more stretching than<br/>\nyou might imagine. This stuff is so far removed from the way I have<br/>\nalways known things, and I&#39;ve changed SO much in the past 6 years,<br/>\nthat I almost feel I don&#39;t know who I am anymore.<br/>\n<br/>\nSo it&#39;s hard for me to be confident. It&#39;s hard for me to &quot;trust&quot;<br/>\nanything since I trusted my parents completely, and now I realize that<br/>\nthey weren&#39;t perfect, either. I don&#39;t trust myself at all...I can&#39;t<br/>\ntrust other parents who don&#39;t understand where I come from, and most<br/>\nof the people who have been unschooling for awhile are SO confident<br/>\nthat it feels like &quot;We have it all together, and you need to just get<br/>\nyour act together already!&quot;<br/>\n<br/>\nI&#39;m trying...I really am. I&#39;m not great at debating about something I<br/>\nhave no clue about. So I&#39;m trying to ask questions to get deep answers<br/>\nbecause I am the type of person that needs to be convinced of<br/>\nsomething before I just go and do it (didn&#39;t someone on here mention<br/>\nthat their child was the same way because they choose to think before<br/>\nacting?)<br/>\n<br/>\nI have to play devil&#39;s advocate in order to prove to myself that what<br/>\nI&#39;m learning will hold up. So I hope you understand that I AM actually<br/>\non the road, traveling. I just haven&#39;t arrived, yet.<br/>\n<br/>\nThank you,<br/>\n<br/>\nDeb</div>","specialLinks":[]},{"userId":356893003,"authorName":"prism7513","from":"&quot;prism7513&quot; &lt;penley75@...&gt;","profile":"prism7513","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222464141","msgId":38719,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdiampxZCtrbHRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQxQ0I4QUUzLURCM0MtNEQzQi1BNjM4LUIxODE4Nzg1Qjg3M0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":38710,"nextInTopic":38721,"prevInTime":38718,"nextInTime":38720,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"... yes, I think it tastes like the milk in the bowl of sugary cereals! Oh! how I miss those! (don t buy them because they are gone in a day and can t justify","messageBody":"<div id=\"ygrps-yiv-1463301304\"><blockquote><span title=\"ireply\">&gt; AND...<br/>\n&gt; <br/>\n&gt; People make a LOAD of noise about sugar being bad and giving kids  <br/>\n&gt; candy being the root cause of their desire for more candy, but I have  <br/>\n&gt; this to say about that:<br/>\n&gt; <br/>\n&gt; taste baby formula<br/>\n&gt; <br/>\n&gt; taste breast milk<br/>\n&gt; <br/>\n&gt; (if you&#39;ve never tasted any, next time you&#39;re around a supply, maybe  <br/>\n&gt; ask politely for some expressed into a little cup--just a few drops  <br/>\n&gt; will make the point)<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>yes, I think it tastes like the milk in the bowl of sugary cereals!<br/>\nOh! how I miss those! (don&#39;t buy them because they are gone in a day<br/>\nand can&#39;t justify the money...I&#39;d rather have cookies!...but I&#39;ll have<br/>\nto sometime let the kids choose some to try - they never have asked<br/>\nbecause they don&#39;t know what they taste like...)<br/>\n<br/>\nDeb</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222455872","msgId":38710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxQ0I4QUUzLURCM0MtNEQzQi1BNjM4LUIxODE4Nzg1Qjg3M0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNhOTNmZmYxMDgwOTI1MTQyNXMyN2VjNTlkdWUzYzk2YWVmZmJkM2RmY2FAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDNhOTNmZmYxMDgwOTI1MTQyNXMyN2VjNTlkdWUzYzk2YWVmZmJkM2RmY2FAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":38685,"nextInTopic":38719,"prevInTime":38709,"nextInTime":38711,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"-=-I m not a sugar-phile (except for myself) but...that last sentence above is worth noting for sugar-phobic parents of young pre-adolescent children. I ","messageBody":"<div id=\"ygrps-yiv-1726052555\">-=-I&#39;m not a sugar-phile (except for myself) but...that last sentence  <br/>\nabove is<br/>\nworth noting for sugar-phobic parents of young pre-adolescent  <br/>\nchildren. I<br/>\nwouldn&#39;t judge the craving to be &quot;childish&quot; though. It&#39;s just a  <br/>\nbiological<br/>\nfact of life.-=-<br/>\n<br/>\nAND...<br/>\n<br/>\nPeople make a LOAD of noise about sugar being bad and giving kids  <br/>\ncandy being the root cause of their desire for more candy, but I have  <br/>\nthis to say about that:<br/>\n<br/>\ntaste baby formula<br/>\n<br/>\ntaste breast milk<br/>\n<br/>\n(if you&#39;ve never tasted any, next time you&#39;re around a supply, maybe  <br/>\nask politely for some expressed into a little cup--just a few drops  <br/>\nwill make the point)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222415621","msgId":38685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMDA2MC43OTkxLnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":38672,"nextInTopic":38710,"prevInTime":38684,"nextInTime":38686,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"Actually there is also a huge difference in the nutrients needed to grow brain and bones and muscle then the nutrients required to maintain it. When you limit","messageBody":"<div id=\"ygrps-yiv-506913140\">Actually there is also a huge difference in the nutrients needed to grow brain and bones and muscle then the nutrients required to maintain it. When you limit your kids food intake based on what you feel is appropriate you are working from a model that is appropriate for later maintenance and not for earlier development. Sugar and fats are good for brains. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n--------<br/>\n<br/>\nThe average adult reportedly has approximately 10,000 taste buds, but<br/>\nchildren have more, including some dotted along the inside of their cheeks.<br/>\nInfants seem to arrive ==hard-wired to react to bitterness and sweetness,===<br/>\nthough the ability to detect saltiness takes six months or so to develop.<br/>\n++++The childish craving for sweets typically declines during adolescence,<br/>\nprobably as a way of limiting caloric intake.&quot;++++<br/>\n<br/>\n<br/>\nI&#39;m not a sugar-phile (except for myself) but...that last sentence above is<br/>\nworth noting for sugar-phobic parents of young pre-adolescent children.  I<br/>\nwouldn&#39;t judge the craving to be &quot;childish&quot; though.  It&#39;s just a biological<br/>\nfact of life.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Sugar (was broccoli (was Re: Oh, and about &quot;bad language&quot; ))","postDate":"1222377938","msgId":38672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwOTI1MTQyNXMyN2VjNTlkdWUzYzk2YWVmZmJkM2RmY2FAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":38685,"prevInTime":38671,"nextInTime":38673,"topicId":38672,"numMessagesInTopic":0,"msgSnippet":"The average adult reportedly has approximately 10,000 taste buds, but children have more, including some dotted along the inside of their cheeks. Infants seem","messageBody":"<div id=\"ygrps-yiv-765087402\">The average adult reportedly has approximately 10,000 taste buds, but<br/>\nchildren have more, including some dotted along the inside of their cheeks.<br/>\nInfants seem to arrive ==hard-wired to react to bitterness and sweetness,===<br/>\nthough the ability to detect saltiness takes six months or so to develop.<br/>\n++++The childish craving for sweets typically declines during adolescence,<br/>\nprobably as a way of limiting caloric intake.&quot;++++<br/>\n<br/>\n<br/>\nI&#39;m not a sugar-phile (except for myself) but...that last sentence above is<br/>\nworth noting for sugar-phobic parents of young pre-adolescent children.  I<br/>\nwouldn&#39;t judge the craving to be &quot;childish&quot; though.  It&#39;s just a biological<br/>\nfact of life.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38755,"nextTopicId":38821}}