{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Threats","postDate":"1242299633","msgId":45087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5NUMzRDlELTFDNDMtNERGRC04QjUzLTdBNkU1N0FBRTE5RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDkyNjQyNy4zODQwNy5xbUB3ZWI1NDIwNy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDkyNjQyNy4zODQwNy5xbUB3ZWI1NDIwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":45070,"nextInTopic":0,"prevInTime":45086,"nextInTime":45088,"topicId":45002,"numMessagesInTopic":0,"msgSnippet":"-=-That s a great insight....one I needed to hear!  Annalise is like an I want recording sometimes.  Think I ll start takingher to the toy store a little","messageBody":"<div id=\"ygrps-yiv-1240030125\">-=-That&#39;s a great insight....one I needed to hear!  Annalise is like  <br/>\nan &quot;I want&quot; recording sometimes.  Think I&#39;ll start takingher to the  <br/>\ntoy store a little more often! =-<br/>\n<br/>\nDon&#39;t take her just to window shop or spend a dollar, though.  That  <br/>\ncan be cruel.<br/>\n<br/>\nMaybe thrift stores or garage sales or freecycle could help bring her  <br/>\nmore things to mess around with.<br/>\n<br/>\nConsider toys as educational supplies, though--as part of the cost of  <br/>\nhomeschooling.   Once in a while there&#39;s someone who chose unschooling  <br/>\nbecause a curriculum was $600 and unschooling didn&#39;t need the $600.   <br/>\nThat doesn&#39;t mean unschooling should be considered to be &quot;free.&quot;    <br/>\nThere should still be money put toward providing things that will  <br/>\nprovide see/hear/touch/smell/taste/think opportunities.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195268684,"authorName":"Shannon Burton","from":"Shannon Burton &lt;memismommy@...&gt;","profile":"memismommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Threats","postDate":"1242261399","msgId":45070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNjQyNy4zODQwNy5xbUB3ZWI1NDIwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":45028,"nextInTopic":45087,"prevInTime":45069,"nextInTime":45071,"topicId":45002,"numMessagesInTopic":0,"msgSnippet":"Here s another thought about a young child saying I want that, about a toy he sees on TV, or something someone else has.   What he wants and needs might be","messageBody":"<div id=\"ygrps-yiv-1469808575\">Here&#39;s another thought about a young child saying &quot;I want that,&quot; about  <br/>\n<br/>\na toy he sees on TV, or something someone else has.   What he wants  <br/>\n<br/>\nand needs might be to touch it, to see how heavy it is, how it works,  <br/>\n<br/>\nwhat it smells like. <br/>\n<br/>\n<br/>\n<br/>\nWhat he wants, and needs, is to learn.<br/>\n<br/>\nThat&#39;s a great insight....one I needed to hear!  Annalise is like an &quot;I want&quot; recording sometimes.  Think I&#39;ll start takingher to the toy store a little more often! <br/>\n<br/>\nThanks!<br/>\nshan<br/>\n<br/>\n&quot;There is a microscopically thin line between being brilliantly creative and acting like the most gigantic idiot on earth.  So what the hell, leap.&quot; - Cynthia Heimel<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Threats","postDate":"1242237999","msgId":45028,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzZjJkODVkMDM4OTBmNjBkOTk0MWQ3NzkxY2U2MjI5QGdtYWlsLmNvbT4=","inReplyToHeader":"PDRBMEFFQkU3LjEwNzA3MDZAbWFjLmNvbT4=","referencesHeader":"PGd1ZWcydCtidDFsQGVHcm91cHMuY29tPiA8NEEwQUVCRTcuMTA3MDcwNkBtYWMuY29tPg=="},"prevInTopic":45021,"nextInTopic":45070,"prevInTime":45027,"nextInTime":45029,"topicId":45002,"numMessagesInTopic":0,"msgSnippet":"... separate mom-time or separate friend-time. Siblings need space from each other - almost always more space than parents think they should need. ","messageBody":"<div id=\"ygrps-yiv-1412235779\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; This sounds like a symptom of too much time together - not enough<br/>\n </span></blockquote>separate mom-time or separate friend-time. Siblings need space from each<br/>\nother - almost always more space than parents think they should need. <br/>\n&lt;&lt;&lt;&lt;<br/>\n<br/>\nKarl talks about powers a lot because he has limits and can&#39;t help but <br/>\nnotice that.  Threatening is a natural outgrowth of figuring out how to <br/>\nnegotiate what one wants.<br/>\n<br/>\nThink of a cat: they love having gigantic spaces to themselves and <br/>\nperching above other big animals (animals and people they&#39;re suspicious <br/>\nof for instance).  Having their own space is very important to cats, <br/>\nmore than dogs who usually attach more to their person than their home.<br/>\n<br/>\nIn the same way, most kids love having their own space and their own <br/>\nstuff.  I think it is pretty universal when people have more than one <br/>\nkid, siblings are supposed to be convenient instant friends and share <br/>\neverything.  That&#39;s the way it was when I was growing up except the <br/>\npart about instant friends wasn&#39;t true.  It&#39;s an assumption or a very <br/>\nfond dream which I don&#39;t think should turn into an expectation .<br/>\n<br/>\nSo here is unschooling which about parents sharing lots of options with <br/>\ntheir children, yet siblings often come with the deal automatically as <br/>\nnon-optional.  Give the kids space to choose their siblings as friends. <br/>\n  Don&#39;t assume a child take an automatic friend as a matter of course by <br/>\ndent of being part of the same family.  Facilitate friendship between <br/>\nsiblings to be a pleasant and freely chosen option, and if the kids <br/>\naren&#39;t best friends, don&#39;t make it a shame.  If they aren&#39;t shamed <br/>\nabout it, the hope is that they can be friendly or civil to one another <br/>\nwhen they&#39;re grown.  Otherwise the kid who doesn&#39;t want to be forced to <br/>\nbe friends with siblings could end up being labeled as the family <br/>\nproblem, the fly in the ointment.<br/>\n<br/>\nI was the middle child, and labeled as a trouble maker, so my siblings <br/>\nfelt that I was an enemy they grudgingly had to share living space <br/>\nwith.  Now that we&#39;re all grown, my sisters won&#39;t say things about <br/>\nbegrudging space but they still talk about what a troublemaker I am.  I <br/>\njust think the perception is wildly unreal.  My dad still says I rebel <br/>\nagainst authority.  Yet he says he&#39;s been seeing a real difference, a <br/>\nchange, in me lately.   It would be nice not to be considered a family <br/>\nproblem.  I still like lots of space and I have lots of space now.  And <br/>\nnow that I&quot;m an adult the fact that I like lots of space is not usually <br/>\ncause to say I&#39;m a problem.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Threats","postDate":"1242233699","msgId":45021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3OWJjNWVjYWFiNDAxY2RiYzc0OWYxNTM4NjZmOThjQGdtYWlsLmNvbT4=","inReplyToHeader":"PGd1ZWcydCtidDFsQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1ZWcydCtidDFsQGVHcm91cHMuY29tPg=="},"prevInTopic":45014,"nextInTopic":45028,"prevInTime":45020,"nextInTime":45022,"topicId":45002,"numMessagesInTopic":0,"msgSnippet":"... Yes.  You re just getting into the ages where kids start thinking about threats and getting their way through force.  Karl threatens and he doesn t even","messageBody":"<div id=\"ygrps-yiv-1969317350\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; Am I expecting them to problem-solve at too young an age? &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes.  You&#39;re just getting into the ages where kids start thinking about <br/>\nthreats and getting their way through force.  Karl threatens and he <br/>\ndoesn&#39;t even have a sibling.  So he&#39;s dealing with an adult on it.  <br/>\nJust imagine (you probably don&#39;t have to imagine) if two children are <br/>\ngoing at it like that, there isn&#39;t much experience at negotiating or <br/>\nempathy for not being able to do what someone wants so the default is <br/>\nprobably to threaten the other without taking into account other <br/>\nvariables in the situation.  They don&#39;t have a big picture.  They have <br/>\ntheir own picture with smatterings of other people and things they <br/>\nmight consider in that picture.<br/>\n<br/>\nIf your children ever threaten or try to use force on you, they can <br/>\nhave an adult who tells them the other variables that a sibling might <br/>\nnot be quite as well able to express.  So that&#39;s not altogether a bad <br/>\nthing, if a child threatens a parent who can clarify other factors, <br/>\nkindly and matter of factly.<br/>\n<br/>\nI would say that for some people, the ability to take other factors <br/>\ninto account developmentally goes past what we would typically call <br/>\nchildhood.  When I got to late 20s ... 30 something... that&#39;s when I <br/>\nwas able to see other variables clearly and fairly quickly but even <br/>\nthere it depends.  Nobody sees other areas in negotiating for what they <br/>\nwant perfectly.<br/>\n<br/>\nAnd even when they do see, clarity still depends on good communication <br/>\nfrom others.  And quite a lot of people don&#39;t have good communication, <br/>\nso factoring in what they can or can&#39;t do is often a matter of <br/>\ndeciphering the nonverbal, sometimes annoyingly so.<br/>\n<br/>\nI think the frequency of things being so indecipherable has to do with <br/>\na strong passive/aggressive tendency in our culture due to exactly this <br/>\nthing: never learning that there are many variables, many sides to <br/>\nconsider in any negotiation, and then seeing the way out of conflict.<br/>\n<br/>\nPeople can learn to communicate kindly and clearly at the same time.  <br/>\nBut I don&#39;t think it comes naturally where many passive aggressive <br/>\npockets exist.<br/>\n<br/>\nWhich is why I like shows such as Care Bears where kindness and empathy <br/>\nis such a big emphasis.  I&#39;m glad Karl finds it as interesting as I do. <br/>\n  There are David the Gnome for similar problem solving ideas and Scooby <br/>\nDoo.  Those shows have a some good ideas (and we also sometimes like to <br/>\ncritique the ones that don&#39;t have ideas as good).  The more experience <br/>\na person gets the more they see opportunities for empathy: like for the <br/>\ncharacter Ron in KimPossible.  Maybe watch shows with your kids and <br/>\npoint out this stuff sometimes?  Karl points it out to me in Care <br/>\nBears.  I point it out to him about Ron, who is very likable and often <br/>\nsweet himself so it&#39;s easy to think kindly of his not very super-power <br/>\nself.<br/>\n<br/>\nA lot of opportunities for learning about empathy and good <br/>\ncommunication come out of shows and games, whether the shows were built <br/>\nwith those ideas in mind or not.  And they&#39;re a chance to talk about <br/>\nthe issues surrounding threats and forcing what we want without <br/>\nspotlighting individuals... our children who are just learning about <br/>\nthese things.  *I* learn a lot of things about the same stuff by <br/>\nwatching with Karl.  Brian has been watching Survivor, another good one <br/>\nfor critiquing all kinds of things (probably more interesting for older <br/>\nkids though).<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Threats","postDate":"1242229735","msgId":45014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMEFFQkU3LjEwNzA3MDZAbWFjLmNvbT4=","inReplyToHeader":"PGd1ZWcydCtidDFsQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1ZWcydCtidDFsQGVHcm91cHMuY29tPg=="},"prevInTopic":45013,"nextInTopic":45021,"prevInTime":45013,"nextInTime":45015,"topicId":45002,"numMessagesInTopic":0,"msgSnippet":"... He was in her room? It got to the point... means you stepped in way too late. Probably he shouldn t be in her room at all if they are having trouble","messageBody":"<div id=\"ygrps-yiv-213582267\">On 5/13/2009 5:57 AM, Kathryn wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Today it got to the point that Jude was hysterical.  I had to pick him up and take him to another room, where I closed the door on him and I; just to keep him from lashing out at Mia.  He hit his breaking point with Mia who had been dictating how it was going to be, and he lost it.  He lashed out at me -- both physically and verbally, because I was stopping him from<br/>\n&gt;   &#39;breaking precious things in Mia&#39;s room&#39;.<br/>\n<br/>\n </span></blockquote>He was in her room? &quot;It got to the point...&quot; means you stepped in way <br/>\ntoo late. Probably he shouldn&#39;t be in her room at all if they are having <br/>\ntrouble getting along these days. Prevention is better than intervention <br/>\nand early intervention is better than late reaction.<br/>\n<br/>\nThis sounds like a symptom of too much time together - not enough <br/>\nseparate mom-time or separate friend-time. Siblings need space from each <br/>\nother - almost always more space than parents think they should need.<br/>\n<br/>\nProvide LOTS of separate things for them to do - take one with you to <br/>\nthe grocery store and have FUN there.<br/>\n<br/>\nI know you&#39;ll have reasons you can&#39;t give them more one-on-one time - <br/>\nbut find ways to squeeze it in, anyway.<br/>\n<br/>\nAlso - get out of the house to big spaces like beaches/parks. Even <br/>\nfast-food play spaces are good. Children&#39;s museums are also awesome.<br/>\n<br/>\nThis is what animals do when they feel crowded in - when their territory <br/>\nis invaded. The pose and threaten and eventually erupt into violence.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Threats","postDate":"1242229594","msgId":45013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1ZXEwcSs1YmN1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1ZWcydCtidDFsQGVHcm91cHMuY29tPg=="},"prevInTopic":45009,"nextInTopic":45014,"prevInTime":45012,"nextInTime":45014,"topicId":45002,"numMessagesInTopic":0,"msgSnippet":"It sounds like your kids are having power problems.  When my kids are feeling powerless and specifically not heard, they will begin to threaten eachother.  The","messageBody":"<div id=\"ygrps-yiv-1562227291\">It sounds like your kids are having power problems.  When my kids are feeling powerless and specifically not heard, they will begin to threaten eachother.  The threats are designed to cause fear in the other person, and the better they do it, the more fear is caused.  LOL<br/>\n<br/>\nI&#39;ve noticed that my youngest will resort to that first because she is balancing her lack of physical, mental and even emotional power.  When I hear this I intervene right away, because this is the kind of stuff that has always escalated and can&#39;t be worked out on their own--because if it&#39;s gotten to threats, there is someone who is not interested in working it out without help.<br/>\n<br/>\nI remember the phase of, &quot;I&#39;m going to lick you,&quot; because my daughter figured out that that was the one that ALWAYS worked.  Smart.  ;-)<br/>\n<br/>\nKids will experiment with this stuff because it gives them power--something we always want to feel we have in a relationship.  If the other one has tried to take it away, we find ways to take it back.  I think it&#39;s very natural, but we can also step in and help them do it better.<br/>\n<br/>\nIf you start looking at it through the power lens, rather than through a personal lens, and help them with that perspective, you might be able to diffuse things a little more quickly, and help them.  My daughter still believes every threat, until the second that I point out that her brother isn&#39;t serious (&#39;cause he&#39;s not)--he&#39;s just trying to get her to listen, cooperate, etc. etc.  and that&#39;s the only currency he feels like he has in the moment.  I try to help them 1.  hear eachother, and 2. negotiate without the emotional blackmail.  <br/>\n<br/>\nSometimes it&#39;s a surprise to one person that the other was even feeling frustrated.  They just aren&#39;t able to read all of eachothers signals, so they escalate things to get the others&#39; attention--but then things fly out of control.<br/>\n<br/>\nMaybe you can help them negotiate before the grease hits the fire.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Threats","postDate":"1242226458","msgId":45009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBFRjM1QTRBLTUwNzYtNDVDQS04OUU3LUU5Rjc0M0E2OUQxM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1ZWcydCtidDFsQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1ZWcydCtidDFsQGVHcm91cHMuY29tPg=="},"prevInTopic":45002,"nextInTopic":45013,"prevInTime":45008,"nextInTime":45010,"topicId":45002,"numMessagesInTopic":0,"msgSnippet":"-=- It s essentially an alternative to bribery, or perhaps the same thing? They threaten each other with violence, or agressive behaviour, such as I m going","messageBody":"<div id=\"ygrps-yiv-638297087\">-=- It&#39;s essentially an alternative to bribery, or perhaps the same  <br/>\nthing? They threaten each other with violence, or agressive behaviour,  <br/>\nsuch as &quot;I&#39;m going to smash all your precious thigs in yuour room if  <br/>\nyou don&#39;t . . . &quot; They even threaten self-harm, like, &quot;If you don&#39;t  <br/>\ndo . . . I&#39;m going to get a knife and stab myself.-=-<br/>\n<br/>\nIt&#39;s extortion.  It&#39;s harrassment.<br/>\n<br/>\nA friend of ours got grouchy because someone at his apartment complex  <br/>\nkept parking a sports car in two parking places instead of one.  He  <br/>\nleft a note that said if the person didn&#39;t start parking better, he  <br/>\nwould break the windshield.<br/>\n<br/>\nNot one of our brightest friends.<br/>\n<br/>\nThreats like that are illegal.   He was in trouble and could have been  <br/>\nthrown out of the apartment complex, or worse.   He became profusely  <br/>\napologetic.<br/>\n<br/>\n-=-It&#39;s like they are trying to outdo each other with the level of  <br/>\ndevastation they can cause; or in this case, threaten. Unfortunately,  <br/>\nit always ends in violence between the two. -=-<br/>\n<br/>\nOne thing you could do is sort of &quot;aikido&quot; it into a joke, by saying  <br/>\n&quot;If you two don&#39;t stop making these threats, I&#39;m going to throw rocks  <br/>\nat the moon,&quot; or &quot;I&#39;m going to fill the oven with jello&quot; or &quot;I&#39;m going  <br/>\nto cut all my hair off and tattoo my head.&quot;    If they laugh at yours  <br/>\n(which could easily be funnier than these examples), they might see to  <br/>\nlaugh at their own.<br/>\n<br/>\nOn the other hand, you could just say it&#39;s not funny, because some  <br/>\nparents DO break or give away their children&#39;s things, or ground the  <br/>\nkids, or hit them, and so it makes you sad to hear them make light of  <br/>\nthose things because you&#39;re trying to have a peaceful house.<br/>\n<br/>\n-=-Today it got to the point that Jude was hysterical. I had to pick  <br/>\nhim up and take him to another room, where I closed the door on him  <br/>\nand I; just to keep him from lashing out at Mia. He hit his breaking  <br/>\npoint with Mia who had been dictating how it was going to be, and he  <br/>\nlost it. He lashed out at me -- both physically and verbally, because  <br/>\nI was stopping him from &#39;breaking precious things in Mia&#39;s room&#39;. When  <br/>\nmy kids hit that hysterical stage, I know that there is no negotiation  <br/>\npossible at that time. I just stay with them until it has passed. -=-<br/>\n<br/>\nA better thing would be to stay with them to make sure it never  <br/>\nbegins.   No child should have to &quot;reach a breaking point&quot; about the  <br/>\nbehavior of a sibling.   If you&#39;re leaving them alone to work it out,  <br/>\nthat&#39;s a mistake.<br/>\n<br/>\n-=- I know Jude is too young to be able to express himself in a way  <br/>\nthat doesn&#39;t hurt others, but I also know I cannot allow him to hit/ <br/>\nkick me in his frustration! -=-<br/>\n<br/>\nKeep him from being frustrated.<br/>\n<br/>\n-=-Am I expecting them to problem-solve at too young an age?-=-<br/>\n<br/>\nAbsolutely.   I have a 17 and 20 year old and I don&#39;t &quot;expect them to  <br/>\nproblem-solve&quot; with each other.  Marty was being short tempered with  <br/>\nHolly a month or two back.  I asked him on the side what was up, and  <br/>\nhe said she was just really bugging him lately.   Holly said &quot;Marty&#39;s  <br/>\nbeing hateful.&quot;  I watched them the next few chances I got, and Holly  <br/>\nWAS being awful.  &quot;She was starting it,&quot; so to speak.   I talked to  <br/>\nthem both separately on the side again, at a natural moment, not  <br/>\nhauling one out.   But when it was in the midst of it, I just said  <br/>\n&quot;Holly, that&#39;s harsh&quot; or &quot;I don&#39;t see why you&#39;re being that way about  <br/>\nit.&quot;  I didn&#39;t dictate what to do.  I indicated that she did seem to  <br/>\nbe about to cause an exchange none of us needed.<br/>\n<br/>\n-=-Neither of them really seem to want to work with the other, just be  <br/>\nthe &#39;dictator&#39; so to speak. -=-<br/>\n<br/>\nThey don&#39;t need to be &quot;working with the other.&quot;  They&#39;ve very young.   <br/>\nBe with one of them or both of them all the time.   The more you&#39;re  <br/>\nwith them now, the less you&#39;ll need to be with them later.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/howto\">http://sandradodd.com/howto</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\nSandra<br/>\n<br/>\n  Neither of them really seem to want to work with the other, just be  <br/>\nthe &#39;dictator&#39; so to speak. -=-<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Threats","postDate":"1242219421","msgId":45002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1ZWcydCtidDFsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45009,"prevInTime":45001,"nextInTime":45003,"topicId":45002,"numMessagesInTopic":0,"msgSnippet":"Threatening is the latest issue im my home.  Mia (7) and Jude (4) threaten each other when things don t go their way.  It s essentially an alternative to","messageBody":"<div id=\"ygrps-yiv-2110401003\">Threatening is the latest issue im my home.  Mia (7) and Jude (4) threaten each other when things don&#39;t go their way.  It&#39;s essentially an alternative to bribery, or perhaps the same thing?  They threaten each other with violence, or agressive behaviour, such as &quot;I&#39;m going to smash all your precious thigs in yuour room if you don&#39;t . . . &quot;  They even threaten self-harm, like, &quot;If you don&#39;t do . . . I&#39;m going to get a knife and stab myself.&quot;  It&#39;s like they are trying to outdo each other with the level of devastation they can cause; or in this case, threaten.  Unfortunately, it always ends in violence between the two.  Today it got to the point that Jude was hysterical.  I had to pick him up and take him to another room, where I closed the door on him and I; just to keep him from lashing out at Mia.  He hit his breaking point with Mia who had been dictating how it was going to be, and he lost it.  He lashed out at me -- both physically and verbally, because I was stopping him from &#39;breaking precious things in Mia&#39;s room&#39;.  When my kids hit that hysterical stage, I know that there is no negotiation possible at that time.  I just stay with them until it has passed.  But I tell you, I really don&#39;t know exactly what it is I am supposed to do during that time!  I know Jude is too young to be able to express himself in a way that doesn&#39;t hurt others, but I also know I cannot allow him to hit/kick me in his frustration!  <br/>\n<br/>\nAm I expecting them to problem-solve at too young an age?  Neither of them really seem to want to work with the other, just be the &#39;dictator&#39; so to speak.  <br/>\n<br/>\nLooking foward to your replies,<br/>\n<br/>\nKathryn</div>","specialLinks":[]}],"prevTopicId":44816,"nextTopicId":45054}}