{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Digest Number 165","postDate":"1012318402","msgId":3362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1LjE2MThjZjk3LjI5ODgxYWMyQGNzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":3361,"nextInTime":3363,"topicId":3362,"numMessagesInTopic":0,"msgSnippet":"I totally agree with you all about using the term eclectic or some other word...but NOT Unschooling. I was at least aware enough all of these years to not","messageBody":"<div id=\"ygrps-yiv-925409961\">I totally agree with you all about using the term &quot;eclectic&quot; or some other <br/>\nword...but NOT Unschooling.<br/>\nI was at least aware enough all of these years to not call myself an <br/>\nUnschooler even though I heavily leaned before finally letting go.<br/>\nI told people &quot;I lean towards Unschooling Philosophies&quot;  and even had a group <br/>\ncalled &quot;Eclectic Homeschoolers&quot; and actually met a total Unschooler through <br/>\nit.<br/>\nIt irritates the heck out of me when groups like that WAUnschoolers use the <br/>\ntitle, because they do a huge disservice to anyone really trying to <br/>\nunderstand unschooling.<br/>\nNo Andrea, they are NOT Unschoolers. I can tell just from the small amount <br/>\nthat you posted.<br/>\nAnd it wouldn&#39;t be worth my time to go to their site and discuss it with <br/>\nthem. They don&#39;t get it, my posts won&#39;t help them.<br/>\nAt Unschooling.com I DO feel it could make a difference though.<br/>\nAnd the way the entire battle resurfaced, was that I questioned a brand new <br/>\nunschooler over her comment &quot;and if our kids get behind, we will help them&quot; <br/>\nor something to that effect.<br/>\nI got completely slammed by a couple of people that said &quot;do it YOUR own way&quot; <br/>\nand then JoAnna came on and pointed out that the list was lacking in <br/>\nsubstance...<br/>\nblah, blah, blah.<br/>\nSome of us are very passionate about pure, radical unschooling. I do not try <br/>\nand shove my views down anyone&#39;s throat that doesn&#39;t want it. By posting at a <br/>\npublic UNSCHOOL board, they are asking for my opinion and anyone elses that <br/>\nwants to give it. And hey, I never said &quot;don&#39;t do it that way&quot; I just don&#39;t <br/>\nlike it being called Unschooling.<br/>\nYK?<br/>\nPeople want to have this ambiguous definition of Unschooling. I say it&#39;s <br/>\nfairly easy to define, because we have many of John Holt&#39;s books!! How it <br/>\napplies to other areas of life can be a grey area, but that&#39;s why  I turn to <br/>\npeople like Sandra, Joyce and Pam (among others) to get a feel for how they <br/>\nhandle certain situations.<br/>\nI have a deep respect for them and how they are raising their kids.<br/>\nSo it makes sense to turn to them for advice when I&#39;m not sure about <br/>\nsomething.<br/>\nThese ladies have EARNED the right to some respect by their peers and new <br/>\nUnschoolers imo!!<br/>\nI mean Sandra has been deeply entrenched in the public school system (having <br/>\nbeen a teacher) I think she knows what the heck she&#39;s talking about when she <br/>\nspeaks for Unschooling!!!!<br/>\nAnyhoooo...<br/>\nI&#39;ll shut up now. I just wanted you to know that I don&#39;t think your WA group <br/>\nare Unschoolers at all.<br/>\nAnd I&#39;d be happy to look in my old issue of GWS and see where some <br/>\nUnschoolers are in the Seattle area. I would guess that anyone in that <br/>\ndirectory would be closer to true Unschooling than the people on your e-mail <br/>\nlist.<br/>\nIt would be a good start anyway.<br/>\nAlthough any homeschoolers can be a good support network for friendships.<br/>\nMy oldest ds has a best friend in ps, so friends are in any walk of life of <br/>\ncourse. But it is nice to &quot;let your guard&quot; down so to speak and not have to <br/>\nexplain why you do things the way you do.<br/>\nI have had good experiences with many of the homeschoolers here. The ones <br/>\nthat judge me and think I&#39;m nuts, don&#39;t talk to me. So it works out fine.<br/>\nThe ones I get along great with are willing to accept my views without <br/>\njudgement. Even though they do things different.<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":3355,"nextTopicId":3124}}