{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"igprUHMoPlvuxFAA8-xWjgIcaClFqWpDvT87RmfVLuyvxcaT3UNgsi3-4HAMrhuY2j6wvy1Z_MvVewltwMm1V60UOQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: THE DECLARATION OF EDUCATIONAL INDEPENDENCE","postDate":"994273612","msgId":22810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODEwMWMxMDRiYyQ4MzExNWIwMCQ2NDVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":22809,"nextInTime":22811,"topicId":22810,"numMessagesInTopic":0,"msgSnippet":"From author Linda Dobson. Lynda","messageBody":"<div id=\"ygrps-yiv-1362504649\">From author Linda Dobson.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\n<br/>\n&gt; FOR YOUR CONSIDERATION AS YOU CELEBRATE INDEPENDENCE DAY.<br/>\n&gt; <br/>\n&gt; The Declaration of Educational Independence<br/>\n&gt; by Linda Dobson<br/>\n&gt; <br/>\n&gt;                    WHEN in the Course of human Events, it becomes<br/>\n&gt; necessary for Families to dissolve the Educational Bands which have<br/>\n&gt; connected them to a faltering Society, and to assume among the Powers of<br/>\n&gt; the Earth, the separate and equal Station to which the Laws of Nature<br/>\n&gt; and of Nature&#39;s God entitle them, a decent Respect to the Opinions of<br/>\n&gt; Mankind requires that they should declare the causes which impel them to<br/>\n&gt; the Separation.<br/>\n&gt; <br/>\n&gt;                    WE hold these Truths to be self-evident, that all Men<br/>\n&gt; are created equal,<br/>\n&gt; that they are endowed by their Creator with certain unalienable Rights,<br/>\n&gt; that among these are Life, Liberty, and the Pursuit of Happiness-That to<br/>\n&gt; secure these Rights, Education is instituted among Men, deriving its<br/>\n&gt; just Powers from the Consent of the Educated, that whenever any Form of<br/>\n&gt; Education becomes destructive of these Ends, it is the Right of the<br/>\n&gt; People to alter or to abolish it, and to institute new Education, laying<br/>\n&gt; its Foundation on such<br/>\n&gt; Principles, and organizing its Powers in such Form, as to them shall<br/>\n&gt; seem most likely to effect their Safety and Happiness.<br/>\n&gt; <br/>\n&gt; Prudence, indeed, will dictate that a Public Education System long<br/>\n&gt; established should not be changed for light and transient Causes; and<br/>\n&gt; accordingly all Experience hath shewn, that Mankind are more disposed to<br/>\n&gt; suffer, while Evils are sufferable, than to right themselves by<br/>\n&gt; Abolishing the Public Education System to which they are accustomed.<br/>\n&gt; But when a long Train of Abuses and Usurpations, pursuing invariably the<br/>\n&gt; same Object, evinces a Design to reduce them under absolute Government<br/>\n&gt; Control, it is their Right, it is their Duty, to throw off such Public<br/>\n&gt; Education System, and to provide new Guards for their future Security.<br/>\n&gt; Such has been the patient Sufferance of these Families; and such is now<br/>\n&gt; the Necessity which constrains them to alter their former Educational<br/>\n&gt; System.<br/>\n&gt; <br/>\n&gt; The History of the Government-Controlled, Public Education System is a<br/>\n&gt; History of repeated<br/>\n&gt; Injuries and Usurpations, all having in direct Object the Establishment<br/>\n&gt; of an absolute Control<br/>\n&gt; over these Families.  To prove this, let Facts be submitted to a candid<br/>\n&gt; World.<br/>\n&gt; <br/>\n&gt;                    THE GOVERNMENT has refused its Assent to Freedom in<br/>\n&gt; Education, the most wholesome and necessary for the public Good.<br/>\n&gt; <br/>\n&gt;                    IT has forbidden its Children Freedom of immediate<br/>\n&gt; and pressing Importance...<br/>\n&gt; <br/>\n&gt;                    IT has refused Freedom for the Accommodation of large<br/>\n&gt; Numbers of Families, unless those Families would register with the<br/>\n&gt; State, a violation of freedom and privacy to them, and formidable to<br/>\n&gt; Absolute Control only.<br/>\n&gt; <br/>\n&gt;                    IT has called together the Nation&#39;s Children at<br/>\n&gt; Places unusual, uncomfortable, and distant from the warmth and<br/>\n&gt; nurturance of their Parents, for the sole Purpose of fatiguing them into<br/>\n&gt; Compliance with its Measures.<br/>\n&gt; <br/>\n&gt;                    IT has dissolved Alternatives repeatedly with its<br/>\n&gt; unceasing bureaucratic requirements, for opposing with manly Firmness<br/>\n&gt; its Invasions on the Rights of the People.<br/>\n&gt; <br/>\n&gt;                    IT has refused for a long Time, after such<br/>\n&gt; dissolutions, to cause other Alternatives to be carried out; whereby the<br/>\n&gt; Educational Powers, incapable of Improvement, have returned to the<br/>\n&gt; failing System at large for their exercise; the Family remaining in the<br/>\n&gt; mean time exposed to all the Dangers of Invasion from without, and<br/>\n&gt; Convulsions within.<br/>\n&gt; <br/>\n&gt;                    IT has endeavored to prevent the True Education of<br/>\n&gt; the Population of these States; for that Purpose obstructing the Natural<br/>\n&gt; Process of Learning; refusing to pass others to encourage their<br/>\n&gt; Individual Efforts...<br/>\n&gt; <br/>\n&gt;                    IT has obstructed the Administration of True<br/>\n&gt; Education, by refusing to recognize the Sovereignty of Family.<br/>\n&gt; <br/>\n&gt;                    IT has made Public School Employees dependent on its<br/>\n&gt; Will alone, for the Tenure of their Offices, and the Amount and Payment<br/>\n&gt; of their Salaries.<br/>\n&gt; <br/>\n&gt;                    IT has erected a Multitude of new Laws, and sent<br/>\n&gt; hither Swarms of Its Employees to harrass our People, and eat out their<br/>\n&gt; Substance.<br/>\n&gt; <br/>\n&gt;                    IT has kept among us, often against the People&#39;s<br/>\n&gt; Will, Standing Armies of Social Workers.<br/>\n&gt; <br/>\n&gt;                    IT has affected to render the Education Establishment<br/>\n&gt; independent of and superior to the Civil Power.<br/>\n&gt; <br/>\n&gt;                    IT has...subject us to a Jurisdiction foreign to our<br/>\n&gt; Constitution, and unacknowledged by our Laws; giving its Assent<br/>\n&gt; to...Acts of...Legislation:<br/>\n&gt; <br/>\n&gt;                    FOR quartering large Bodies of Compelling Troops<br/>\n&gt; among us:<br/>\n&gt; <br/>\n&gt;                    FOR protecting them, by a mock Trial, from Punishment<br/>\n&gt; for any usurpation of Family Sovereignty which they should commit on the<br/>\n&gt; Inhabitants of these States:<br/>\n&gt; <br/>\n&gt;                    FOR cutting off our Connection with True Education:<br/>\n&gt; <br/>\n&gt;                    FOR imposing Taxes on us used to Oppress us:<br/>\n&gt; <br/>\n&gt;                    FOR depriving us, in many Cases, of the Benefits of<br/>\n&gt; Family Time;<br/>\n&gt; <br/>\n&gt;                    FOR transporting our Children for large blocks of<br/>\n&gt; their time;<br/>\n&gt; <br/>\n&gt;                    FOR taking away our Family Autonomy, abolishing our<br/>\n&gt; most valuable Family Connections, and altering fundamentally the Forms<br/>\n&gt; of our Families:<br/>\n&gt; <br/>\n&gt;                    FOR suspending our Parental Authority, and declaring<br/>\n&gt; itself invested with Power to control for us in all cases whatsoever.<br/>\n&gt; <br/>\n&gt;                    IT has abdicated Control here, by failing us its<br/>\n&gt; Protection and waging Educational War against us.<br/>\n&gt; <br/>\n&gt;                    IT has plundered our Pocketbooks, ravaged our Family<br/>\n&gt; Lives, burnt our Trust, and destroyed the Lives of our People.<br/>\n&gt; <br/>\n&gt;                    IT is, at this time, forging new Laws to compleat the<br/>\n&gt; Works of Despair, Desolation, and Tyranny, already begun with<br/>\n&gt; circumstances of Cruelty and Perfidy, scarcely<br/>\n&gt; paralleled in the most barbarous Ages, and totally unworthy the<br/>\n&gt; Government School System of a civilized Nation.<br/>\n&gt; <br/>\n&gt;                    IT has constrained our fellow Citizens taken Captive<br/>\n&gt; in our Nation&#39;s Classrooms, to become the Competitors of their Friends<br/>\n&gt; and Brethren, or to fall themselves by their Hands.<br/>\n&gt; <br/>\n&gt;                    IT has excited domestic Insurrections amongst us, and<br/>\n&gt; has endeavored to bring on the Inhabitants of our Nation, the merciless<br/>\n&gt; Conditioning, whose known Rule of Warfare, is an undistinguished<br/>\n&gt; Destruction, of all Ages, Sexes and Conditions.<br/>\n&gt; <br/>\n&gt;                    IN every stage of these Oppressions we have<br/>\n&gt; Petitioned for Redress in the most humble Terms:  Our repeated Petitions<br/>\n&gt; have been answered only by repeated Injury.  A Public Education System,<br/>\n&gt; whose Character is thus marked by every act which may define a Tyrant,<br/>\n&gt; is unfit to be the Educational Controller of a free People.<br/>\n&gt; <br/>\n&gt;                    NOR have we been wanting in Attentions to our<br/>\n&gt; Legislators. We have warned them from time to time of Attempts by their<br/>\n&gt; very Government to extend an unwarrantable Educational Jurisdiction over<br/>\n&gt; us.  We have reminded them of the Circumstances that brought us to this<br/>\n&gt; point.  We have appealed to their native Justice and Magnanimity, and we<br/>\n&gt; have conjured them by the Ties of our common Kindred to disavow these<br/>\n&gt; Usurpations, which, would inevitably interrupt our Connections and<br/>\n&gt; Correspondence.  They too have been deaf to the Voice of Justice and of<br/>\n&gt; Consanguinity.  We must, therefore, acquiesce in the Necessity, which<br/>\n&gt; denounces our Separation, and hold them, as we hold the rest of Mankind,<br/>\n&gt; Enemies in War, in Peace, Friends.<br/>\n&gt; <br/>\n&gt;                    WE, therefore, the Families of the UNITED STATES OF<br/>\n&gt; AMERICA, in GENERAL AGREEMENT, Assembled, appealing to the Supreme Judge<br/>\n&gt; of the World for the Rectitude of our Intentions, do, in the Name, and<br/>\n&gt; by Authority of Sound, Sane Parental Consciousness, solemnly Publish and<br/>\n&gt; Declare, That these United People are, and of Right ought to be, FREE<br/>\n&gt; AND INDEPENDENT FAMILIES, they have full Power to levy Choice in Family<br/>\n&gt; Education, consider the Family&#39;s Values and Time Needs to choose the<br/>\n&gt; extent of participation in and support of the Public Education System,<br/>\n&gt; contract Alliances, establish Family Priorities and Values, and to do<br/>\n&gt; all other Acts and Things which INDEPENDENT FAMILIES may of right do.<br/>\n&gt; And for the support of this Declaration, with a firm Reliance on the<br/>\n&gt; Protection of divine Providence, we mutually pledge to each other our<br/>\n&gt; Lives, our Fortunes, and our sacred Honor. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":22775,"nextTopicId":22811}}