{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":92084939,"authorName":"Heidi Crane","from":"&quot;Heidi Crane&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Digest Number 5275","postDate":"1113415189","msgId":105287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwMi1GNzhDMDNGQzc1RUQ2Rjk3RDc4QTUwQzAzNDBAcGh4LmdibD4=","inReplyToHeader":"PDExMTMzOTM4OTYuNjU2LjY5MjMxLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":105286,"nextInTime":105288,"topicId":105287,"numMessagesInTopic":0,"msgSnippet":"... From: b229d655@cs.com ... One of the reasons why I gave up on a regular bedtime was the flat out fact that my 10 year old is a genuine night owl, from","messageBody":"<div id=\"ygrps-yiv-2093810050\"><blockquote><span title=\"ireply\">&gt;<br/>\n </span></blockquote>   From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:b229d655@...\">b229d655@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt;Subject: Re: May I vent?<br/>\n&gt;<br/>\n&gt;In a message dated 4/12/2005 12:17:54 PM Eastern Standard Time,<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bunsofaluminum60@...\">bunsofaluminum60@...</a> writes:<br/>\n&gt; &gt; Okay, thanks for letting me vent a bit. More than likely, it&#39;s &quot;family<br/>\n&gt; &gt; meeting time.&quot; and I&#39;ll be able to express my frustrations without <br/>\n&gt;trashing<br/>\n&gt; &gt; the kids. Lots of my anger was already dissipated from picking up and <br/>\n&gt;from<br/>\n&gt; &gt; baking bread. and practicing my piano.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Fantastic vent.  I read it all and took a deep breath for you.  Thank<br/>\n&gt;goodness some things can help us cool off before we fire it all out.<br/>\n&gt;<br/>\n&gt;I ususally don&#39;t have much of an issue in the house cuz my kids are still<br/>\n&gt;really little and we all kinda go to bed about the same time so I have no<br/>\n&gt;surprises in the morning.<br/>\n<br/>\n </span></blockquote>One of the reasons why I gave up on a regular bedtime was the flat out fact <br/>\nthat my 10 year old is a genuine night owl, from birth. She slept in bed <br/>\nwith us, so I didn&#39;t notice it until she got her own bed at about 2 yoa. <br/>\nThen, I&#39;d settle her in, and sing her a song (her favorite was &quot;How Much Is <br/>\nThat Doggy In the Window?&quot; LOL) and go to bed myself in a peaceful, quiet <br/>\nhouse. Next day, peering in on sleeping kids, i&#39;d find my little Blondeletta <br/>\nsound asleep...in a box in the corner of the room, under the bed with covers <br/>\ndraped over everything, in the closet with a lamp shining nearby, sometimes <br/>\nwith markers and paper or books or masses of stuffed toys all piled up <br/>\naround her. From the moment she &quot;could&quot; she&#39;s been staying up late and doing <br/>\nher own thing. Now, it&#39;s just spread from her room out to the rest of the <br/>\nhouse.<br/>\n<br/>\nBut for us, occasionally mine will get beyond my patience<br/>\n<blockquote><span title=\"ireply\"> &gt;when we are out running errands or whatever and I am so thankful that we <br/>\n&gt;have<br/>\n&gt;the ride home to listen to music or the DVD or the gameboys or whatever, to<br/>\n&gt;calm us all down.  By the time we get home, it&#39;s no biggie and we can talk <br/>\n&gt;if we<br/>\n&gt;need to.<br/>\n<br/>\n </span></blockquote>Calming down first is so important. Hence, my morning rant before anyone got <br/>\nup. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I think setting some rules for &quot;after hours&quot; is a good thing.  They may be<br/>\n&gt;tired and really aren&#39;t thinking about cleaning up at night, maybe the <br/>\n&gt;lights<br/>\n&gt;are low and they don&#39;t see all the crumbs and stuff.<br/>\n<br/>\n </span></blockquote>I think you&#39;re right about not seeing all the crumbs and stuff, but...at <br/>\nleast in the case of my 10 year old, she isn&#39;t tired. The other day! LOL at <br/>\n11 o&#39;clock at night, she was moving furniture around in her room. This HUGE <br/>\nbunk bed, with her brother&#39;s help. And then they moved HIS stuff around. <br/>\nAlert, active, vocal, (mostly keeping it down for my sake), happy as clams. <br/>\nHappy as active, at-their-diurnal-peak clams, that is!<br/>\n<br/>\nSometimes, I do request that she stay in her room after i go to bed, and <br/>\nthat usually has the effect of keeping her quiet for a couple of hourse <br/>\nwhile I fall asleep, but more often than not, she&#39;s moved herself to the <br/>\ncouch or the front room floor by morning, where my hubby finds her when he <br/>\ngets home from work.<br/>\n<br/>\nIf there are dishes<br/>\n<blockquote><span title=\"ireply\"> &gt;they&#39;ve used, they should help clean and put them away.  Same with toys, <br/>\n&gt;books, or<br/>\n&gt;whatever.  Unless of course they are using those things again later.  Since <br/>\n&gt;we<br/>\n&gt;all share the same home, especially &quot;family rooms or common spaces&quot;, they <br/>\n&gt;can<br/>\n&gt;help by taking care of their things.  They probably won&#39;t mind, they may <br/>\n&gt;not<br/>\n&gt;even realize that you feel this way come morning time.<br/>\n<br/>\n </span></blockquote>I agree with that, but when they make a mess bigger than they can clean up. <br/>\nOr, if she has a huge surge of energy and works on many projects with gusto, <br/>\nthen *poof* drops. I mean, it happens to me during the day. Then, the <br/>\nprojects are still all over the place, and her without the energy to clean <br/>\nup. I just need to re-emphasize with her the principle of consideration. <br/>\nShe&#39;s 10. I think she can keep in mind the idea that cleaning up after <br/>\noneself is a socially responsible thing to do.<br/>\n<br/>\nas for the food, I&#39;m doing just what you suggest: I get groceries in the <br/>\nhouse, with a broad variety of things everyone in the family likes, both <br/>\nfoods they can get themselves, and things I can fix and have ready for <br/>\nthem...and when it&#39;s gone, it&#39;s gone until I get groceries again. Every <br/>\ncouple of weeks is how it has always worked in this family. I&#39;m not *really* <br/>\ngonna call &quot;kitchen closed&quot; but I am going to ask that there be some thought <br/>\nabout clean up when they&#39;re done. I found similar messes this morning. <br/>\nChocolate milk mix! Gotta give credit. She doesn&#39;t let anything stop her. We <br/>\ndidn&#39;t have choc milk mix, so she made a batch! and made a MESS...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Thanks for sharing, I feel like I&#39;m less alone when others have share their<br/>\n&gt;ups and downs.  I hope all goes well with your family meeting.<br/>\n&gt;<br/>\n&gt;Pamela<br/>\n<br/>\n </span></blockquote>family meeting will be this afternoon when 10 year old and daddy are awake. <br/>\nJust saying &quot;please clean up if you make a mess&quot; when i went to bed, didn&#39;t <br/>\ndo the job.<br/>\n<br/>\nthanks, Pamela<br/>\n<br/>\nblessings, heidic</div>","specialLinks":[]}],"prevTopicId":105260,"nextTopicId":105288}}