{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I am the cranky mom","postDate":"1274456323","msgId":54385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0NjllMytpNzMwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg=="},"prevInTopic":54376,"nextInTopic":0,"prevInTime":54384,"nextInTime":54386,"topicId":54355,"numMessagesInTopic":0,"msgSnippet":"... One thing I did recently with my 2 boys when they were fighting was to let each tell me their perspective of the problem, back and forth, until they were","messageBody":"<div id=\"ygrps-yiv-88943542\"><blockquote><span title=\"ireply\">&gt; I&#39;m stuck because the only things I can think of to do haven&#39;t helped:<br/>\n&gt; <br/>\n&gt; 1. Do problem-solving at times when they&#39;re not fighting.<br/>\n&gt; <br/>\n&gt; 2. Offer to help once they are fighting.<br/>\n&gt; <br/>\n&gt; 3. ????<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>One thing I did recently with my 2 boys when they were fighting was to let each tell me their perspective of the problem, back and forth, until they were both done. I didn&#39;t comment or offer suggestions or corrections like I usually do. I just listened and let both of them talk, one at a time, as long as they needed. It didn&#39;t take that long. Maybe 10 minutes. When they were both done they went back to playing as if nothing had happened. My older son, the 6 year old, found ways to play with his almost 3 year old brother that still followed his plan.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":383312070,"authorName":"Cara Barlow","from":"Cara Barlow &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] I am the cranky mom","postDate":"1274444666","msgId":54376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrc3RUX0hBaWVQZmNjandrQlZpQU9MUVM4UC1WV0N5Tzh2bHJiZkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRCRjYwREY4LjcwNTAxMDlAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPgkgPDRCRjYwREY4LjcwNTAxMDlAZWFydGhsaW5rLm5ldD4="},"prevInTopic":54370,"nextInTopic":54385,"prevInTime":54375,"nextInTime":54377,"topicId":54355,"numMessagesInTopic":0,"msgSnippet":"... I think this is really important to get if you have fighting children. Long before I ever heard of unschooling I started working at giving my daughters","messageBody":"<div id=\"ygrps-yiv-1917086114\">===I was JUST talking today to a friend who has just one child (grown<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  child, now) and saying how big a deal it was for my three to have enough<br/>\n&gt; space to be able to spend time apart. Kids don&#39;t choose their siblings<br/>\n&gt; and can go through stages when their siblings drive them crazy. The<br/>\n&gt; solution can be to help them spend more time apart and more one-on-one<br/>\n&gt; time with parents.===<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I think this is really important to get if you have fighting children.<br/>\n<br/>\nLong before I ever heard of unschooling I started working at giving my<br/>\ndaughters time apart and individual attention. They&#39;re about 2.5 years<br/>\napart. The oldest was not pleased to become a big sister, and they often got<br/>\non each others nerves and fought, especially when they were between the ages<br/>\nof 4-9. It was usually my oldest starting it, or rather she&#39;s the one who<br/>\nwas the most explosive.<br/>\n<br/>\nI remember many times taking her to someplace private, immediately after an<br/>\nincident, and telling her that she didn&#39;t have to like her little sister,<br/>\nbut she did need to be polite and kind, and then give her examples of what<br/>\nshe could have said or done.<br/>\n<br/>\nThey&#39;re now 12 and 14. Things are *so* much better. They like each other and<br/>\noften choose to do things together. Both girls still get edgy when they&#39;re<br/>\nhungry or tired (so do I!) but we all know what to do if that happens.<br/>\n<br/>\nI attribute their closeness to our homeschooling. I think if they had been<br/>\nin school, the emphasis on spending time with same-age peers, and the<br/>\nadults&#39; disrespect for children (which the kids pick up on and then mirror<br/>\ntowards younger children) would have made my daughters&#39; friendship very<br/>\ndifficult to achieve. They also just wouldn&#39;t have had the time - good<br/>\nrelationships don&#39;t happen instantly.<br/>\n<br/>\nWe did start homeschooling when my oldest was 8yo, so they may be been<br/>\nfighting because they were exhausted from being in school and we were all<br/>\nstressed. I don&#39;t know. But I do know that it eventually got better and that<br/>\nI spent a lot of energy smoothing the way for it to be better.<br/>\n<br/>\nBest wishes, Cara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I am the cranky mom","postDate":"1274421558","msgId":54370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0NTdmbStxNGg4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg=="},"prevInTopic":54369,"nextInTopic":54376,"prevInTime":54369,"nextInTime":54371,"topicId":54355,"numMessagesInTopic":0,"msgSnippet":"===but we have an XBox, a GameCube, and a PS2 in my bedroom as well, and Carl often likes to play in there when he s having alone time=== I know in our house,","messageBody":"<div id=\"ygrps-yiv-2045258147\">===but we have an XBox, a GameCube, and a PS2 in my bedroom as well, and Carl often likes to play in there when he&#39;s having alone time===<br/>\n<br/>\nI know in our house, when someone&#39;s gaming in the living room, with it being a common room, that sort of invites other people to hang out and comment on whatever video gaming action is happening -- not always to the apprecation of whoever is gaming. <br/>\n<br/>\nWhat about if whoever was gaming in the living room could say, &quot;Mom, I&#39;m ready to have some privacy while I game,&quot; before they get to the point of wanting to thump on their sibling, and that could be your cue to invite their sibling to do something with you elsewhere -- maybe a two-player video game in your bedroom, or maybe something else indoors or outdoors -- with the attitude of &quot;I really want to do something with you!&quot; rather than &quot;good grief, not another fight coming down the pike&quot;.<br/>\n<br/>\nAnother option would be that when someone wants to play a one-player game, to suggest they play it in your room so they can shut the door and have quiet and privacy, or to have the option of moving from the living room to your bedroom if the atmosphere in the living room is getting too stressful while they&#39;re trying to game. Either of those suggestions would leave the living room available to the rest of the family.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I am the cranky mom","postDate":"1274420170","msgId":54369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0NTY0YSs3YWhuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg=="},"prevInTopic":54365,"nextInTopic":54370,"prevInTime":54368,"nextInTime":54370,"topicId":54355,"numMessagesInTopic":0,"msgSnippet":"===In case it helps to know, we have game consoles in two rooms. The living room is the preferred space because it has a bigger TV and the Wii=== If the Wii is","messageBody":"<div id=\"ygrps-yiv-1502280589\">===In case it helps to know, we have game consoles in two rooms. The living room is the preferred space because it has a bigger TV and the Wii===<br/>\n<br/>\nIf the Wii is the preferred gaming system, might it be possible to obtain a second Wii? Maybe trade in one of the PS2s and the GameCube and some no-longer-played games to get store credit to apply against the cost of another Wii? <br/>\n<br/>\n<br/>\n===who did what wrong in the video game, or didn&#39;t do what he was told===<br/>\n<br/>\nIt sounds like that&#39;s happening when they&#39;re doing two-player / multiplayer games, is that correct? If so, well, yes, you might want to consider having them not play those particular games together if doing so is frequently leading to fighting. <br/>\n<br/>\nI asked Andrew which two-player games he thought might be less likely to lead to fighting amongst siblings and he suggested the Lego games. He and I play those together and those were my first thought too -- that said, there are situations in those games that I can see would lead to fighting, and some levels were incredibly challenging and we got short with each other while playing them. But they&#39;re fun games to goof around on, and you can definitely do some good teamwork kind of stuff.<br/>\n<br/>\nAndrew said Banjo Kazooie: Nuts & Bolts might be another good one. He said the only drawback is that when one person is building their vehicle, the other person can&#39;t do anything. But otherwise he considers it two-person-friendly.<br/>\n<br/>\nDo they ever play online games together from different PCs/laptops? Those might be an alternative to two-player games on the Wii/Xbox/etc, and they might be less frustrating and stressful to play together. I co-moderate the Unschooling Gamers yahoo list (<a rel=\"nofollow\" target=\"_blank\" href=\"http://games.groups.yahoo.com/group/unschooling_gamers/)\">http://games.groups.yahoo.com/group/unschooling_gamers/)</a> -- that&#39;d be a good place to get ideas of good, free online multiplayer games they could play together (and also a good place to perhaps get more feedback about specific games that might be good for younger siblings to play together).<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] I am the cranky mom","postDate":"1274416632","msgId":54365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCRjYwREY4LjcwNTAxMDlAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg==","referencesHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg=="},"prevInTopic":54362,"nextInTopic":54369,"prevInTime":54364,"nextInTime":54366,"topicId":54355,"numMessagesInTopic":0,"msgSnippet":"... I was JUST talking today to a friend who has just one child (grown child, now) and saying how big a deal it was for my three to have enough space to be","messageBody":"<div id=\"ygrps-yiv-1047412247\">On 5/20/2010 3:14 PM, Su Penn wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; 3. ????<br/>\n&gt;<br/>\n&gt; I seem to have forgotten things I used to know about dealing with this <br/>\n&gt; kind of thing.<br/>\n<br/>\n </span></blockquote>I was JUST talking today to a friend who has just one child (grown <br/>\nchild, now) and saying how big a deal it was for my three to have enough <br/>\nspace to be able to spend time apart. Kids don&#39;t choose their siblings <br/>\nand can go through stages when their siblings drive them crazy. The <br/>\nsolution can be to help them spend more time apart and more one-on-one <br/>\ntime with parents.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I am the cranky mom","postDate":"1274406382","msgId":54362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NTA2OC44NzcwLnFtQHdlYjUzOTA1Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg==","referencesHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg=="},"prevInTopic":54356,"nextInTopic":54365,"prevInTime":54361,"nextInTime":54363,"topicId":54355,"numMessagesInTopic":0,"msgSnippet":"________________________________ From: Su Penn  I am having a problem right now with being really cranky and directive of my two oldest kids,","messageBody":"<div id=\"ygrps-yiv-1299869660\">________________________________<br/>\nFrom: Su Penn &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:su@...\">su@...</a>&gt;<br/>\n<br/>\n  <br/>\nI am having a problem right now with being really cranky and directive of my two oldest kids, boys who are 9 and 6. What is setting me off is that they&#39;re having the same fights over and over<br/>\n*****<br/>\nIf they are having the same fights over and over, are you talking about the things they are fighting about, or are you talking about problem solving in general?   Could you spend a day or two and keep track of the fights and how often each topic comes up and then talk about about the highest frequency problems?  Throw out lots of ideas and then pick one to try and then another if that does not work.<br/>\n<br/>\n<br/>\n*************<br/>\n<br/>\n--who gets to sit in the comfy chair, who did what wrong in the video game, or didn&#39;t do what he was told. <br/>\n<br/>\n<br/>\n*****<br/>\nIf the comfy chair is in front of the video game, I would probably suggest that whoever sits in the comfy chair has to play the game in the way the other person wants.  We tend to end a lot of fights this way.  Or with a timer.  The first turn is 2 minutes, the second turn is 5 minutes, the third turn is 10 minutes and the forth turn is 30 minutes.  Or however ends with both boys thinking they got the better end of the deal.  I can almost always come up with a division that makes both kids happy, even if it does not seem fair to me!<br/>\n<br/>\n*******<br/>\n<br/>\n<br/>\nfor Carl&#39;s part, he has a tendency to catastrophize (&quot;Mom, can we go to the park?&quot; Me: &quot;Not right now, but&quot; -- getting ready to say, &quot;in about half an hour&quot; but Carl interrupts with, &quot;Ugh! So we _never_ get to go to the park?&quot; and huffs off and refuses to speak.).<br/>\n<br/>\n******<br/>\nYou may need to remember to start with a yes.  &quot;Yes we can go to the park, as soon as....&quot;<br/>\n<br/>\n******<br/>\n<br/>\nI am open to all ideas. Even if setting limits on the video games if they can&#39;t play together without fighting is the best option I can come up with for now, I&#39;d like it to be a gentler one than me being all I AM THE MOM AND YOU WILL DO AS I SAY.<br/>\n*****<br/>\nI often start as a mean mom.  When looking for the boys to help me solve a problem I might throw out the worst solution first.  &quot;How about we give away the video games, TV and computer and spend all our time scrubbing the floor with toothbrushes.&quot;  Somehow they are always able to come up with something better than I can!<br/>\n<br/>\n<br/>\n Amanda<br/>\nEli 9, Samuel 7<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I am the cranky mom","postDate":"1274398039","msgId":54356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4MDA3NUNELTBCMjYtNDFCOS1CMkY5LUQ5M0U0MzMyNjYzNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg==","referencesHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg=="},"prevInTopic":54355,"nextInTopic":54362,"prevInTime":54355,"nextInTime":54357,"topicId":54355,"numMessagesInTopic":0,"msgSnippet":"-=-it seems like they have the same pointless fight about six times a day.-=- Calling it pointless isn t good. -=-who gets to sit in the comfy chair, who did","messageBody":"<div id=\"ygrps-yiv-1010589734\">-=-it seems like they have the same pointless fight about six times a  <br/>\nday.-=-<br/>\n<br/>\nCalling it pointless isn&#39;t good.<br/>\n<br/>\n-=-who gets to sit in the comfy chair, who did what wrong in the video  <br/>\ngame, or didn&#39;t do what he was told. -=-<br/>\n<br/>\nAre they playing together, or is one watching the other play?  If it&#39;s  <br/>\none watching, persuade the watcher to be elsewhere.<br/>\n<br/>\nCan you get another comfy chair?  Can you take turns by day of one kid  <br/>\nhaving the choice of where to sit?  He might not want the comfy chair,  <br/>\neven, but he should get to choose.<br/>\n<br/>\nWe settled the &quot;shotgun&quot; problem in the car with a rotation, youngest  <br/>\nto oldest, per trip, not per day.  If it was Marty&#39;s turn and he  <br/>\nwasn&#39;t going, it fell to Kirby (the next older).  If he wanted the  <br/>\nback seat, that was fine.  (It was a van.) If he wanted the front,  <br/>\nfine.   But once he picked, Holly got the next pick.   Next time we  <br/>\ngot in the van, it was Holly&#39;s pick.<br/>\n<br/>\nMaybe you could do that with the chair, with odd and even days (though  <br/>\nthe ends of months could be a problem).<br/>\n<br/>\n-=-They seem perfectly happy to be outside--their new friend from down  <br/>\nthe street is over and they&#39;re playing tag or something--but this is  <br/>\nnot how I want things to be happening.-=-<br/>\n<br/>\nMaybe one could play with the friend while the other has the games to  <br/>\nhimself sometimes.<br/>\n<br/>\n-=- So Eric will say, &quot;Carl, stop throwing bombs! You have to shoot  <br/>\nthat guy,&quot; and Carl will react badly, and then they&#39;re in it and they  <br/>\ndon&#39;t seem able to respond to me saying, &quot;Hey, do you guys need some  <br/>\nhelp sorting this out?&quot; and they both are really fixated on saying  <br/>\nwhat the other one did wrong. They&#39;ll say, &quot;Mom, OK, we&#39;ll stop, we&#39;ll  <br/>\nstop!&quot; and be back at it 10 seconds later.-=-<br/>\n<br/>\nThat happened here.<br/>\nSometimes I said &quot;Let Marty play the way he wants to.&quot;  Sometimes I  <br/>\nwould ask Marty if he wanted Kirby&#39;s help and sometimes he would say  <br/>\nyes, so I&#39;d say &quot;Kirby, be nicer.&quot;<br/>\n<br/>\nThis is how I dealt with squabbles between them:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\nI wrote it and posted it, and then lost it, and Joyce found it!<br/>\n<br/>\n1. Do problem-solving at times when they&#39;re not fighting.<br/>\n<br/>\n2. Offer to help once they are fighting.<br/>\n<br/>\n3. ????<br/>\n<br/>\nOffer to help before they&#39;re fighting.  Get another chair, maybe.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"I am the cranky mom","postDate":"1274393648","msgId":54355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwMkVDODYyLTRCOUQtNEUxMy1CMERGLTI2ODE3MzQ5M0Q4NUBzdXBlbm4uY29tPg=="},"prevInTopic":0,"nextInTopic":54356,"prevInTime":54354,"nextInTime":54356,"topicId":54355,"numMessagesInTopic":0,"msgSnippet":"I am having a problem right now with being really cranky and directive of my two oldest kids, boys who are 9 and 6. What is setting me off is that they re","messageBody":"<div id=\"ygrps-yiv-978287985\">I am having a problem right now with being really cranky and directive of my two oldest kids, boys who are 9 and 6. What is setting me off is that they&#39;re having the same fights over and over--who gets to sit in the comfy chair, who did what wrong in the video game, or didn&#39;t do what he was told. It&#39;s that &quot;here we go again&quot; feeling that has me doing stuff like what I just did not more than 20 minutes ago--told them to turn the game off and go outside if they couldn&#39;t stop fighting. Carl answered me with rude words and tone, and I was like the avenging angel. &quot;That&#39;s it! Go outside!&quot; it seems like they have the same pointless fight about six times a day. They generally get along well otherwise, the fighting just really sets me off.<br/>\n<br/>\nThey seem perfectly happy to be outside--their new friend from down the street is over and they&#39;re playing tag or something--but this is not how I want things to be happening.<br/>\n<br/>\nWe talk about problem-solving when they&#39;re not in the middle of a fight, but they don&#39;t seem able to apply it once they start. Eric can be bossy and want things a certain way and he can be inflexible; for Carl&#39;s part, he has a tendency to catastrophize (&quot;Mom, can we go to the park?&quot; Me: &quot;Not right now, but&quot; -- getting ready to say, &quot;in about half an hour&quot; but Carl interrupts with, &quot;Ugh! So we _never_ get to go to the park?&quot; and huffs off and refuses to speak.). So Eric will say, &quot;Carl, stop throwing bombs! You have to shoot that guy,&quot; and Carl will react badly, and then they&#39;re in it and they don&#39;t seem able to respond to me saying, &quot;Hey, do you guys need some help sorting this out?&quot; and they both are really fixated on saying what the other one did wrong. They&#39;ll say, &quot;Mom, OK, we&#39;ll stop, we&#39;ll stop!&quot; and be back at it 10 seconds later.<br/>\n<br/>\nThey can sometimes avoid a fight by talking things through, but once the fight has started, me laying down the law or separating them seems to be the only way it ever stops. If I don&#39;t step in, it often escalates to Carl hitting, biting, or pulling Eric&#39;s hair, because right now at just barely 6, that&#39;s a thing he does when he gets frustrated. And then Eric fights back.<br/>\n<br/>\nI&#39;m stuck because the only things I can think of to do haven&#39;t helped:<br/>\n<br/>\n1. Do problem-solving at times when they&#39;re not fighting.<br/>\n<br/>\n2. Offer to help once they are fighting.<br/>\n<br/>\n3. ????<br/>\n<br/>\nI seem to have forgotten things I used to know about dealing with this kind of thing.<br/>\n<br/>\nI am open to all ideas. Even if setting limits on the video games if they can&#39;t play together without fighting is the best option I can come up with for now, I&#39;d like it to be a gentler one than me being all I AM THE MOM AND YOU WILL DO AS I SAY.<br/>\n<br/>\nIn case it helps to know, we have game consoles in two rooms. The living room is the preferred space because it has a bigger TV and the Wii, as well as an XBox and a PS2, but we have an XBox, a GameCube, and a PS2 in my bedroom as well, and Carl often likes to play in there when he&#39;s having alone time.<br/>\n<br/>\nThanks. I&#39;m just going to listen for awhile while you talk amongst yourselves.<br/>\n<br/>\nSu, mom to Eric, 9 next week; Carl, 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]}],"prevTopicId":54122,"nextTopicId":54333}}