{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":385544217,"authorName":"Pam","from":"&quot;Pam&quot; &lt;pamaronow@...&gt;","profile":"pammyz123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Looking for an Unschooling Nanny","postDate":"1235062279","msgId":42101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduazJtNytkNGRmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":42100,"nextInTime":42102,"topicId":42101,"numMessagesInTopic":0,"msgSnippet":"Hi everyone.  I ve been a member of this list for a few years now. I ve definitely been more of a read and lurk type, I guess!  I ve enjoyed so many of the","messageBody":"<div id=\"ygrps-yiv-7745544\">Hi everyone.  I&#39;ve been a member of this list for a few years now.  <br/>\nI&#39;ve definitely been more of a read and lurk type, I guess!  I&#39;ve <br/>\nenjoyed so many of the posts, along with the thoughtful and at times <br/>\nthought provoking responses from members.<br/>\n<br/>\nI spoke with Sandra ahead of creating this post because I am looking <br/>\nfor some help out there in the world of unschooling.  I&#39;d like to <br/>\nfind a nanny to live with our family for preferably a year.  I&#39;ve had <br/>\na live-in nanny helping me out the last couple of years and it has <br/>\nbeen a great help with our current circumstances.  But I would love <br/>\nto have a nanny who gets unschooling and our family lifestyle.  While <br/>\nour past nannies have done their best to learn and abide by our <br/>\nphilosophy, I&#39;ve still often felt I had to defend our choices and <br/>\nlifestyle.  Before I describe the position, let me give you a brief <br/>\nintro into our family:<br/>\n<br/>\nMy husband and I have three children, ages 10, 7 and 2 ½.  I began <br/>\nfirst homeschooling my daughter when she was 4, after trying some <br/>\npreschool.  She liked preschool okay, but I just had too much fun <br/>\nwith her to send her off to school and given a choice she wanted to <br/>\nstay home with me too.  I had considered homeschooling even while <br/>\npregnant with her.  So after just a mediocre school experience, I <br/>\ndecided to go for it and took her out.  I switched to unschooling <br/>\nwithin 6 months after reading John Holt and visiting Sandra&#39;s site--- <br/>\nthanks Sandra!  Wow, did unschooling resonate with me.  The idea of <br/>\nallowing her to learn how, what, where and when she wanted to learn, <br/>\nwithout deciding for her or coercing or judging her choices, made a <br/>\nlot of sense.  It has been so great and I&#39;ve enjoyed watching her <br/>\nlearn to read and develop a love of reading on her own and become <br/>\namazingly computer savvy, among others.<br/>\n<br/>\nUnschooling didn&#39;t unfold so easily with Ian, at age 7.  He is, based <br/>\non diagnosis, moderately to severely autistic.  He can talk, but <br/>\nsticks to single words and doesn&#39;t converse with us or answer <br/>\nquestions.  He doesn&#39;t easily engage with others, but prefers to play <br/>\nalone.  His likes to bang toys and objects together, like shoes, <br/>\ndrumsticks, blocks, books, etc.  He will circle and gallop around the <br/>\nroom when he does this and hum and squeal and make all sorts of <br/>\ninteresting noises.  He can do this for hours a day.  He&#39;s quite <br/>\nsensitive to noises and smells and can get easily overwhelmed and <br/>\nfrustrated and will vent by throwing things, banging his head, <br/>\nchewing on his shirt and sometimes breaking household items.  He has <br/>\na fantastic smile and likes to be tickled and will often, out of <br/>\nnowhere, give us hugs. <br/>\n<br/>\nI did try some school for Ian because that&#39;s where the speech and <br/>\noccupational services were once he reached the age of three.  We did <br/>\npart time preschool for about 6 months.  My heart wasn&#39;t there <br/>\nthough.  And they just didn&#39;t handle his needs appropriately, but <br/>\nlooked at him as just some big behavior problem.  I took him out to <br/>\nwork with him at home.  We had our third car garage converted to a <br/>\ngiant playroom for him.  The therapy program we use with Ian is <br/>\ncalled Son-Rise.  If you want to learn more, we have a website <br/>\ndescribing it all:  www.iansplace.net<br/>\n<br/>\nI felt in the beginning that doing therapy with Ian sort of went <br/>\nagainst this whole unschooling philosophy that I so embraced.  But <br/>\nSon-Rise to me is in a way very unschooly.  The therapy is based on <br/>\ngoing with the child, not forcing them to do what you want.  So many <br/>\ntherapies are based on modifying an autistic child&#39;s behavior and <br/>\nstopping them from doing all that quirky, repetitive stimming (like <br/>\nIan&#39;s tapping and banging things together).  With Son-Rise I actually <br/>\njoin Ian when he plays this way.  So if Ian is banging two sticks <br/>\ntogether and galloping with glee around the room, I do it too.  I <br/>\nsupport his choice and don&#39;t put a value judgment on what he chooses <br/>\nto do.  Since joining and playing with Ian on his terms, I&#39;ve found <br/>\nthat he his more flexible and open to then playing with me.  He makes <br/>\nmore attempts to connect with me in turn.  Having his own playroom <br/>\nspace also helps with Ian&#39;s sensitivitiesI can control the noise, <br/>\nthe smells and there are no other kids to mess with his stuff and <br/>\nvice versa.  <br/>\n<br/>\nThen, my youngest, Adam came on the scene 2.5 years ago and.well, it <br/>\ngot to be pretty challenging around here.  Ian didn&#39;t like the baby <br/>\nand still doesn&#39;t really care to have Adam around.  I&#39;ve needed one-<br/>\non-one supervision for both boys since Adam was born.  Ian has been <br/>\nknown to push, shove and sit down on top of his little brother.  So <br/>\nwhen Adam was born, that&#39;s when I first got a nanny.  I couldn&#39;t be <br/>\nwith Ian in his playroom and care for the needs of a newborn at the <br/>\nsame time and also spend time with Julia, as well.  <br/>\n<br/>\nHaving a nanny has been such a cool experience.  It really allows me <br/>\nto continue our unschooling lifestyle.  It has been quite a learning <br/>\nexperience sharing our home with another person and putting our <br/>\nvalues and way of life out there for scrutiny!  And now I want to <br/>\nfind an unschooling nanny!!! <br/>\n <br/>\nMy current nanny is leaving at the end of June 2009 (his year <br/>\ncontract is up).  I&#39;ve begun my search to replace him and thought it <br/>\nwould be great to have a nanny who understands and embraces <br/>\nunschooling.  I&#39;m looking to have someone for a year.  I will do 6 <br/>\nmonths, for the right person.  I would prefer 18 years of age or <br/>\nolder. The position is basically 40 hours a week, paid overtime, with <br/>\nweekends off, 2 weeks of paid vacation a year.  Room and board is <br/>\nincluded, along with a weekly stipend (negotiable).  The nanny will <br/>\nhave their own furnished bedroom with private bath and television.  <br/>\nWe also, have wireless internet.  I will consider a male or female <br/>\nnanny.  My current nanny is a man and he&#39;s worked out great.  We call <br/>\nhim the MANny!  <br/>\n<br/>\nI currently have a profile of our family and our nanny position on a <br/>\nnanny finding website called Great AuPair.  You can learn more about <br/>\nmy nanny position by checking it out here:  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.greataupair.com/showProfile.cfm/locatorID/877253\">http://www.greataupair.com/showProfile.cfm/locatorID/877253</a>  There&#39;s <br/>\nsome pictures of the kids on there too.<br/>\n<br/>\nI know my post was rather long, but I wanted to give you a little <br/>\nglimpse into our family and situation.  If you are interested or know <br/>\nof someone who might be interested in the position, you can contact <br/>\nme offlist at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamaronow@...\">pamaronow@...</a><br/>\n<br/>\nThanks everyone!  And thanks, Sandra for letting me post my nanny job!<br/>\n<br/>\nBest Wishes,<br/>\nPam Aronow</div>","specialLinks":[]}],"prevTopicId":42080,"nextTopicId":41738}}