{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":353761052,"authorName":"Cassie S","from":"Cassie S &lt;cassiesala@...&gt;","profile":"herbalmamacass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling for everyone, Lables not needed","postDate":"1220143590","msgId":37700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4MDg2OC45ODE0LnFtQHdlYjQ1NzA0Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":37699,"nextInTime":37701,"topicId":37700,"numMessagesInTopic":0,"msgSnippet":"Hello, My name is Cassie, and I NEVER post here.  I happily read my digest daily, and always gleen wonderful advice on unschooling, and tidbits to help me","messageBody":"<div id=\"ygrps-yiv-1439979878\">Hello, My name is Cassie, and I NEVER post here.  I happily read my digest daily, and always gleen wonderful advice on unschooling, and tidbits to help me feel &quot;more free&quot; in my approach and raising of my two little guy&#39;s.  Gleening wonderful advice, that is, until this crap.<br/>\nKaren, is this a joke?  I feel very strongly, after reading all of this bull, you have got to be kidding, because anyone actually following this thread has got to be sick of your constant debate of your own issue.  I hope this is not considered flaming, I&#39;m a very respectful person, who believes respect is the ground we as humans should always start from, but this whole &quot;the new group&quot; bull-hockey REEKS of disrespect, unethical, self-satisfying droning.  And now, after your HUGE &quot;entrance&quot; into your new group, that YOU started......&quot;oh, but I&#39;m not really going to want to head it...&quot;  This has to be a joke.  Wow.<br/>\nDo you think you could just maybe, tone it down now, and move on, I really love this group THE WAY IT IS, it&#39;s your perrogative to start a new one, but this bantor has honestly been ruining a normally intelligent, wonderful, inspiring place to LEARN things.<br/>\nMaybe I&#39;m the only one who feels this way, but it&#39;s my first time posting (I&#39;m pretty sure) here, and I felt THAT strongly about it.  Most all of you are so elloquent with your wording, I don&#39;t dare try to post! :)<br/>\nThanks for the &quot;ear&quot;<br/>\nand Thank you, Sandra, I&#39;ve learned so much, and hope to keep learning...you are WONDERFUL!<br/>\n~Cassie Sala~<br/>\nUnschooling mama to Canyon 4 1/2 and River 2 1/2, Birthmom to Sam 8<br/>\n&quot;Everybody, no matter how small, should always be listened to&quot; ~Holly, on Miss Spiders Sunny Patch&quot;<br/>\n&quot;Peace on Earth begins with Birth&quot;<br/>\n&quot;Further explanation:<br/>\n<br/>\nThe title is intended to get the attention of someone who is seeking an<br/>\nunschooling group that *may* not be as reactionary when labels are<br/>\nused--those<br/>\nwho want to spend more discussion time (which may include labels) to help<br/>\ntheir families and less time fielding posts which may feel like<br/>\nsecond-guesses as to whether their use of labels in their own personal<br/>\nsituations is appropriate.<br/>\n<br/>\nI recognize that posts challenging the use of labels can be and often are<br/>\nextremely useful in helping parents to be more conscious of the impact of<br/>\ntheir use. As such posts are well represented on other unschooling lists,<br/>\nthe new list is intended to be a place with a little less &quot;noise&quot; on this<br/>\nissue, so that the list may be used more efficiently by those who &quot;get it&quot;<br/>\nabout labels and want to receive the benefit of the doubt about their<br/>\nparticular use of labels. This way they can move on to what they really<br/>\nwanted to discuss. <br/>\n<br/>\nI really welcome suggestions for approaches to accomplish this goal. I<br/>\nwould also be happy if someone wanted to take over this group/project. I am<br/>\ntoo busy to be tackling this, but I wanted to get it started, because my<br/>\nheart goes out to families with special needs. As such needs are likely<br/>\nmore common among homeschooling families, I see such a group as that much<br/>\nmore important within the context of homeschooling.<br/>\n<br/>\nKaren&quot;<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":37657,"nextTopicId":37694}}