{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Personal Beliefs Are Important But Not Enough - IMO","postDate":"1064095358","msgId":81057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdhLjQ3ZjAyNWU4LjJjOWUyODdlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":81056,"nextInTime":81058,"topicId":81057,"numMessagesInTopic":0,"msgSnippet":"... Hmmm. It seemed very clear to me until you asked!  First of all, I was musing only about the beliefs themselves, not about whether one acts on them","messageBody":"<div id=\"ygrps-yiv-507264893\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; <br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;        What I mean is that if a belief is used as a way to decide what <br/>\n&gt; &gt; others<br/>\n&gt; &gt; should do or to judge others as right or wrong, then it&#39;s not really<br/>\n&gt; &gt; &quot;personal,&quot; at least not in the same sense of beliefs that are really <br/>\n&gt; &gt; only about my own life.<br/>\n&gt; &gt;<br/>\n&gt; Unless the context is something like, &quot;I think it is wrong to try to <br/>\n&gt; force children to learn something they have no interest in learning.&quot; <br/>\n&gt; That means I think that it is generally wrong - for anybody. It has <br/>\n&gt; personal application, in that I won&#39;t do it to my kids, but I do think <br/>\n&gt; it is wrong for others too.<br/>\n&gt; <br/>\n&gt; Thinking it is wrong doesn&#39;t mean I necessarily have any intention of <br/>\n&gt; insisting on anybody else acting on my belief, of course. On the other <br/>\n&gt; hand, there are some things I think are wrong enough that I&#39;ll try to <br/>\n&gt; persuade people to come around to seeing it my way and there are other <br/>\n&gt; beliefs that I hold strongly enough that I want to see them imposed on <br/>\n&gt; everybody. (Like not blasting their music at high volumes at <br/>\n&gt; campgrounds, for example &lt;G&gt;.)<br/>\n&gt; <br/>\n&gt; &gt;    To me any truly personal belief in personal choice or <br/>\n&gt; &gt; self-determination<br/>\n&gt; &gt; -- like unschooling for example -- cannot rest on religious doctrine <br/>\n&gt; &gt; or <br/>\n&gt; &gt; political proclamations of what all children and parents should <br/>\n&gt; &gt; believe or do, or  even what all unschoolers should believe or do.<br/>\n&gt; &gt;<br/>\n&gt; It sounds like you&#39;re saying that no general statements can be made <br/>\n&gt; about unschooling, but I doubt that is what you meant.<br/>\n&gt; <br/>\n&gt; So - I&#39;m clearly not following your point, JJ. The kinds of statements <br/>\n&gt; I&#39;m thinking of, about unschooling, are not religious or political. <br/>\n&gt; What am I missing?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; And - welcome!!!<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>       Hmmm. It seemed very clear to me until you asked! &lt;g&gt;<br/>\n<br/>\n       First of all, I was musing only about the beliefs themselves, not <br/>\nabout whether one acts on them through persuasion or advocacy, or stoning! LOL.  <br/>\n<br/>\n        You&#39;re right that I didn&#39;t mean no general statements can be made! I <br/>\nmeant only that that there are different &quot;kinds&quot; of personal beliefs and also <br/>\nthat claiming a belief as &quot;personal&quot; doesn&#39;t confer immunity from all <br/>\nchallenge. I thought Sandra and others did a good job of making this point. I was <br/>\nagreeing with it.<br/>\n<br/>\n       I do see the facts-evidence-theory kind of belief and the personal <br/>\npreference kind of belief as both being different in some sense from personal <br/>\nreligious and political beliefs. And unschooling beliefs could be any or all of <br/>\nthese, yes?<br/>\n<br/>\n       For example, I&#39;m guessing that your statement about it being wrong to <br/>\nforce children to learn involves several types of belief, maybe religious plus <br/>\npractical plus a personal gut-type preference and also reasoning and <br/>\nknowledge, based on lots of facts-evidence-theory that you and I might enjoy writing a <br/>\nwhole book about. When we were done, it certainly would reflect and be <br/>\ncongruent with our personal beliefs, but it would be much more than &quot;just&quot; a <br/>\nwrite-up of our own personal beliefs or preferences.<br/>\n<br/>\n    As to the &quot;no loud music at campgrounds&quot; &lt;g&gt; well, there are different <br/>\nways of looking at that &quot;belief&quot; (maybe religious or political even -- let&#39;s say <br/>\nsome sect or campaign wanted to have a huge tent revival at your favorite <br/>\npublic spot over your mother-daughter back-to-nature weekend? Ack!  --)  The jet <br/>\nski people merrily destroy pristine federal parks and preserves with their <br/>\nnoise pollution, and in my town we have a beautiful lake where the whine of <br/>\nrecreational airboats disturbs regular residents (not just campers) for miles <br/>\naround.<br/>\n <br/>\n     My belief that all this is &quot;wrong&quot; is I guess social, or perhaps civil.  <br/>\nBut having said all this, I am not sure WHY I said any of it. Maybe someone <br/>\nwill make more sense of it than I just did!  :)  JJ  <br/>\n<br/>\n      <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38670,"nextTopicId":81077}}