{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":167822625,"authorName":"Sunday Cote","from":"&quot;Sunday Cote&quot; &lt;sundaycote@...&gt;","profile":"revsunday2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need help w/dh and gaming issues","postDate":"1176661589","msgId":28415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM3N2Y4YiQ5NjJlNThmMCQ2NDAxYThjMEBEMTZWNDk0MT4=","inReplyToHeader":"PDUzOUMxRTEyLTlCMEYtNEYzQi1BNDg5LTQzRDlGNzlCNzdFOUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":28410,"nextInTopic":0,"prevInTime":28414,"nextInTime":28416,"topicId":28401,"numMessagesInTopic":0,"msgSnippet":"... him understand this one, please write - or even just share some personal stories about how your kids played/watched freely and DIDN T get addicted , or","messageBody":"<div id=\"ygrps-yiv-53814251\"><blockquote><span title=\"ireply\">&gt;&gt;If anyone here thinks of anything new I could convey to help  <br/>\n </span></blockquote>him understand this one, please write - or even just share some  <br/>\npersonal stories about how your kids played/watched freely and DIDN&#39;T  <br/>\nget &quot;addicted&quot;, or about the transition period when limits are first  <br/>\nremoved when it appears they are totally consumed, etc.???&lt;&lt;&lt;<br/>\n<br/>\nThis has been a big transformation for me as we started unschooling.  I<br/>\nwas pretty much the Waldorf anti-electronic mom when I first picked up a<br/>\nHolt book.  But now, three years into unschooling, I have two boys (5<br/>\nand 8) who have free access to TV, computer and video games.  I have to<br/>\nsay it took a lot of encouragement and coaching from my unschooling<br/>\nfriends and lists like this one to get me through the de-schooling phase<br/>\nof almost non-stop TV and gaming.  But then one day I discovered that<br/>\nthe boys weren&#39;t rushing to turn the TV on the minute they woke up and<br/>\nthat they were actually choosing other activities.  This became more<br/>\napparent when their still-Waldorf friends came to visit and my boys<br/>\ncouldn&#39;t get them off the computer.  One parent actually said that her<br/>\nson could only play 15 minutes of video games before I had to restrict<br/>\nhim, otherwise &quot;he just goes crazy!&quot;  Yikes.  But what she doesn&#39;t<br/>\nrealize is that her son is VERY video game savvy and is getting it from<br/>\nbeing at other friends or neighbors houses.  This means that he&#39;s lying<br/>\nto her and having to sneak around behind her back to get his &quot;fix.&quot;  He<br/>\nhas a secret life that he can&#39;t even talk to his mom about.  I can&#39;t<br/>\nimagine not sharing in the excitement my boys find in their games and TV<br/>\nshows.  Just yesterday, we were driving in the car and playing a game<br/>\nwhere one of us would give clues about a certain TV or gaming character<br/>\nand the others had to guess who it was.  My husband and I<br/>\nenthusiastically joined in and were pretty good at guessing the<br/>\ncharacter by hearing the description of clothing or what their signature<br/>\ncatch phrase was.  My husband really makes the boys laugh by imitating<br/>\nthe voices of the characters.  All four of us were laughing and having a<br/>\ngreat time.  What a sweet moment and a powerful way to keep us connected<br/>\nas they get older.  <br/>\n<br/>\nWe often sit and watch the shows with them or start our own file on a<br/>\nvideo game.  Right now, my husband, my 5 year old and I are all working<br/>\non our own Pikmin file.  We don&#39;t belittle what they watch and we<br/>\ncelebrate their passions, including all things electronic.  By honoring<br/>\nwhat they find useful or funny, they will always feel safe to share the<br/>\nimportant things in their lives. But more importantly, they will learn<br/>\nto value their own opinions and to follow their own passions.  How<br/>\nwonderful is that!<br/>\n<br/>\nSo, I&#39;d have to say that the best thing that got me through to a more<br/>\nbalanced perspective was being in the company of unschooling families,<br/>\nespecially the teens.  Go to a conference and just observe these kids!<br/>\nI am fortunate to know several unschooled teens IRL. (Waving to Jacki<br/>\nand her fantastic four teens down the road from us right now.)  Both my<br/>\nhusband and I have said, &quot;If these teens are the result of unschooling<br/>\nand respectful parenting, we&#39;re on-board!&quot;<br/>\n<br/>\nAnd there are two books that really helped me look at this issue from a<br/>\ndifferent perspective:<br/>\n<br/>\n&quot;Everything Bad is Good for You&quot; by Steven Johnson<br/>\n<br/>\n&quot;Killing Monsters&quot; by Gerard Jones<br/>\n<br/>\nYour husband might find them insightful as well.<br/>\n<br/>\nSorry this is so long.  I rarely post, so I guess I&#39;m making up for it<br/>\nall at once. &lt;g&gt;  <br/>\n<br/>\nGood luck!<br/>\nSunday</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need help w/dh and gaming issues","postDate":"1176601520","msgId":28410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV2czAzZys1NDNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUzOUMxRTEyLTlCMEYtNEYzQi1BNDg5LTQzRDlGNzlCNzdFOUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":28409,"nextInTopic":28415,"prevInTime":28409,"nextInTime":28411,"topicId":28401,"numMessagesInTopic":0,"msgSnippet":"... DIDN T ... first ... My 5yo has never had limits per se, although we didn t get our satellite hook-up until the turn of the year. Before then we had lots","messageBody":"<div id=\"ygrps-yiv-257543359\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Emily Troper &lt;emtroper@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; even just share some  <br/>\n&gt; personal stories about how your kids played/watched freely and <br/>\n </span></blockquote>DIDN&#39;T  <br/>\n<blockquote><span title=\"ireply\"> &gt; get &quot;addicted&quot;, or about the transition period when limits are <br/>\n </span></blockquote>first  <br/>\n<blockquote><span title=\"ireply\"> &gt; removed when it appears they are totally consumed, etc.???<br/>\n<br/>\n </span></blockquote>My 5yo has never had limits per se, although we didn&#39;t get our <br/>\nsatellite hook-up until the turn of the year. Before then we had <br/>\nlots of movies. She goes through phases of watching a lot of tv or <br/>\nplaying a lot of computer games just like she goes through phases of <br/>\ndrawing alot, or reading alot, or digging in the mud alot. Right now <br/>\nwe have new kittens so she&#39;s spending a great deal of time with them.<br/>\n<br/>\nMy stepson had tv and computer limits at his mom&#39;s house. A couple <br/>\nhours total a day. He moved in with us in Nov, and we got the <br/>\nsatellite a month later. He was amazed to learn that he could stay <br/>\nup *all night long* and play computer games if he really wanted to, <br/>\nand for awhile took us up on the offer, waking up around 4pm and <br/>\nstaying up until the rest of us were having breakfast. That&#39;s <br/>\nprobably a good example of what you mean by &#39;totally consumed&#39;.<br/>\n<br/>\nOnce spring started, though (it comes early here in TN), he decided <br/>\nentirely on his own to switch back to a more daytime schedule, even <br/>\nthough it meant he would have less opportunity to play on our single <br/>\ncomputer. A couple weeks ago he started going to a Saturday night <br/>\ncoffee house with his dad - he&#39;s there now, in fact. He likes <br/>\npeople, and much as he loves chatting with people online, face to <br/>\nface is better. He&#39;s gone to a couple parties and picked up some <br/>\nyard work, too. He still spends a lot of time on the computer - <br/>\nfour, five hours a night - but he&#39;s not &quot;addicted&quot;. He&#39;s wanting <br/>\nless, not more.<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: need help w/dh and gaming issues","postDate":"1176563512","msgId":28409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5MjE3Ni4zNjc5Ny5xbUB3ZWI1MTEwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDM5NTA4MS4zNjY0OC5xbUB3ZWI1MTExMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":28408,"nextInTopic":28410,"prevInTime":28408,"nextInTime":28410,"topicId":28401,"numMessagesInTopic":0,"msgSnippet":"Just wanted to clarify something.  Sorry I didn t see it before I hit send. ***They eat when they re hungry, get up and run around when they feel like they","messageBody":"<div id=\"ygrps-yiv-261308266\">Just wanted to clarify something.  Sorry I didn&#39;t see it before I hit send.<br/>\n<br/>\n***They eat when they&#39;re hungry, get up and run around when they feel like they need to, they choose to play with friends/family when there&#39;s an opportunity or when they want to do that. And we&#39;re OK with the fact that they might not want to do those things too.***<br/>\n<br/>\nThey will eat when they are hungry.  We will help them, by bringing them food sometimes, by joining them and we&#39;ll eat by them.  Usually though, Alec will want to come to the kitchen or eat with us.  When I said we&#39;re OK with the fact that they might not want to do those things, I meant they might choose to do something other than what I&#39;m offering or if there&#39;s a friend who they haven&#39;t really had a whole lot of fun with recently,  they&#39;ll probably choose something else.  Sometimes playing with others isn&#39;t always the best option for them right then.  :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Kelli~<br/>\n<br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/\">http://ourjoyfullife.blogspot.com/</a>  <br/>\n<br/>\n&quot;Life shrinks or expands in proportion to one&#39;s courage.&quot;  ~Anais Nin<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nAhhh...imagining that irresistible &quot;new car&quot; smell?<br/>\n Check outnew cars at Yahoo! Autos.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: need help w/dh and gaming issues","postDate":"1176558600","msgId":28408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NTA4MS4zNjY0OC5xbUB3ZWI1MTExMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDUzOUMxRTEyLTlCMEYtNEYzQi1BNDg5LTQzRDlGNzlCNzdFOUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":28407,"nextInTopic":28409,"prevInTime":28407,"nextInTime":28409,"topicId":28401,"numMessagesInTopic":0,"msgSnippet":"**If anyone here thinks of anything new I could convey to help him understand this one, please write - or even just share some personal stories about how your","messageBody":"<div id=\"ygrps-yiv-238551050\">**If anyone here thinks of anything new I could convey to help  <br/>\n him understand this one, please write - or even just share some  <br/>\n personal stories about how your kids played/watched freely and DIDN&#39;T  <br/>\n get &quot;addicted&quot;, or about the transition period when limits are first  <br/>\n removed when it appears they are totally consumed, etc.???**<br/>\n<br/>\nI think there are several stories of that at the link that Sandra sent.  People reporting that exact thing.  <br/>\n<br/>\nI have 3 kids who play a lot of video games and/or do a lot of computer work,  they aren&#39;t addicted.  They eat when they&#39;re hungry, get up and run around when they feel like they need to, they choose to play with friends/family when there&#39;s an opportunity or when they want to do that.  And we&#39;re OK with the fact that they might not want to do those things too.  I think that&#39;s a big factor.  You HAVE to be OK with their decisions.  Their decisions might be different from what you would choose.  Their balance in their life might be different from yours.  I think that&#39;s really hard sometimes for parents to accept.  Alec (ds14) might want to play a video game for hours on end.  He gets up and does other things while playing it but he will spend a day or more doing the same game.  He can focus so well on something its amazing.  <br/>\n<br/>\nNow as he&#39;s doing this its not like he&#39;s in his own world.  He&#39;s still part of ours and we are part of his as well.  We go and sit with him.  We talk with him about what he&#39;s doing and what he had to do to get to certain parts of the game.  He tells all about the research he&#39;s doing, the different aspects of the game that are interesting to him.<br/>\n<br/>\nNow for me,  I need to be more active than him.  I can&#39;t do something like that for the amount of time he can.  I like changing things up.  Going from one thing to another.  And I don&#39;t get as much excitement/energy from doing the things he does, but that&#39;s OK.  We&#39;re 2 different people.   He is so energized when he&#39;s working to beat a boss, or trying to figure out a puzzle, or figuring out a new strategy for a character.  He isn&#39;t as physical as me and that&#39;s OK.  Everyone&#39;s different.  <br/>\n<br/>\nI ended up pointing this out to my mother-in-law.  She was having worries about him playing so much video games/computer games and such.  Which to me was so funny that she would worry about that.  She loves to read, sew and quilt.  She rarely goes outside, doesn&#39;t really like sports, never has, even as a child and she will say she loves being home.  She is so much the same way as her grandson but yet she still couldn&#39;t see the connection.<br/>\n<br/>\nWe are allowing our children to be who they are now, they don&#39;t have to wait until they are out of the house.<br/>\n<br/>\n***he  <br/>\n doesn&#39;t disagree with the fact the games/TV can be interesting and  <br/>\n educational - his concern is that they are addictive and harmful as  <br/>\n well.***<br/>\n<br/>\n<br/>\nI have read/heard about people being addictive to video games.  Where they will miss out on really important events in their lives, due to video games but, and this is a huge BUT, &lt;g&gt;  None of these people have been unschooled. ( I think Joyce addressed that in her reply.) The people that I have heard of have not been happy in their lives. Its been an escape for them.  <br/>\n<br/>\nThe ones I&#39;ve seen, have been doing it because there&#39;s nothing else in their lives that is exciting or there are in unfulfilling relationships, stuff like that.  They&#39;ve either been unhappy in their family life or just unhappy in general.  The kids I meet who are playing video games aren&#39;t unhappy.  They are choosing to play because isn&#39;t fun, its interesting and there&#39;s a lot to these games.<br/>\n<br/>\nOnline gaming has been hit hard with fear of addictiveness, I know.  Our whole family played World of Warcraft for a while, it was an amazing time for us.  This adventure world where we met each other and other friends.  We don&#39;t play much anymore.  Abbi (dd12) will still roleplay a bit with friends, but Alec has leveled up so much and pretty much done all the different aspects of the game that he&#39;s bored with it now. <br/>\n<br/>\nDoing what everyone else says is &quot;wrong&quot; or &quot;bad&quot; is scary sometimes.  People love to put the scary fearful thoughts out there, but do they see the joy in your child&#39;s face?  Do they know of the lives that we can lead as unschoolers?  Probably not.  The possibilities are endless.  Trusting our children, nourishing what they like to do, including them in your interests.  Its all so good!<br/>\n<br/>\nI&#39;ve written quite a bit about gaming and computer use in our household at my blog.  Feel free to check it out.  The link is below.  :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Kelli~<br/>\n<br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/\">http://ourjoyfullife.blogspot.com/</a>  <br/>\n<br/>\n&quot;Life shrinks or expands in proportion to one&#39;s courage.&quot;  ~Anais Nin<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nAhhh...imagining that irresistible &quot;new car&quot; smell?<br/>\n Check outnew cars at Yahoo! Autos.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":82889211,"authorName":"Emily Troper","from":"Emily Troper &lt;emtroper@...&gt;","profile":"emtroper2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need help w/dh and gaming issues","postDate":"1176529363","msgId":28407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzOUMxRTEyLTlCMEYtNEYzQi1BNDg5LTQzRDlGNzlCNzdFOUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":28404,"nextInTopic":28408,"prevInTime":28406,"nextInTime":28408,"topicId":28401,"numMessagesInTopic":0,"msgSnippet":"Thank you so much Sandra and Joyce, I have sent my dh links to both of your wonderful sites, several times, and he still isn t convinced.  He says that the","messageBody":"<div id=\"ygrps-yiv-93849765\">Thank you so much Sandra and Joyce,<br/>\n<br/>\nI have sent my dh links to both of your wonderful sites, several  <br/>\ntimes, and he still isn&#39;t convinced.  He says that the arguments  <br/>\nthere are about whether or not kids are learning anything, and he  <br/>\ndoesn&#39;t disagree with the fact the games/TV can be interesting and  <br/>\neducational - his concern is that they are addictive and harmful as  <br/>\nwell.  If anyone here thinks of anything new I could convey to help  <br/>\nhim understand this one, please write - or even just share some  <br/>\npersonal stories about how your kids played/watched freely and DIDN&#39;T  <br/>\nget &quot;addicted&quot;, or about the transition period when limits are first  <br/>\nremoved when it appears they are totally consumed, etc.???<br/>\n<br/>\n<br/>\nThanks again to you all, we&#39;ll get there eventually!<br/>\n<br/>\nWe&#39;re going to Life is Good AND Live and Learn this year, so  <br/>\nhopefully that will help some!<br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] need help w/dh and gaming issues","postDate":"1176460623","msgId":28404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEODk2Rjk0LTlFQjgtNDQ0RS1CMTJCLTgzNTJCQ0M5MjYzRkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDA1MkNCNUFELUQ5OEUtNDkyNS04MTYxLUNDRTc4Rjc5ODMyOEBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDA1MkNCNUFELUQ5OEUtNDkyNS04MTYxLUNDRTc4Rjc5ODMyOEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":28402,"nextInTopic":28407,"prevInTime":28403,"nextInTime":28405,"topicId":28401,"numMessagesInTopic":0,"msgSnippet":"... What reality does he see? He cites studies but what does he seen with his own eyes? I think one of the unfortunate parts of school is that we re told what","messageBody":"<div id=\"ygrps-yiv-1507029853\">On Apr 12, 2007, at 6:38 PM, Emily Troper wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; feels strongly that I cannot or will<br/>\n&gt; not see the &quot;reality&quot; of the effect of gaming on them.<br/>\n<br/>\n </span></blockquote>What reality does he see?<br/>\n<br/>\nHe cites studies but what does he seen with his own eyes?<br/>\n<br/>\nI think one of the unfortunate parts of school is that we&#39;re told  <br/>\nwhat we&#39;re supposed to see (in science experiments, in poetry and  <br/>\nliterature, in history) and are taught (consequently) not to trust  <br/>\nour own sight and our own judgement about what we see.<br/>\n<br/>\nWe learn that most situations are too complex to understand what&#39;s  <br/>\nreally happening unless you&#39;re an expert so we set aside what&#39;s  <br/>\nhappening in front of us to search for what we&#39;re told is significant  <br/>\nand why it&#39;s significant.<br/>\n<br/>\n(It&#39;s also important to note that all studies are done on schooled  <br/>\nkids. Researches have no clue how much school warps the natural  <br/>\nbehavior of kids so they just accept schooled kids as normal kids.  <br/>\nThey aren&#39;t. Schooled kids make choices for different reasons than  <br/>\nunschooled kids do. So the conclusions they draw apply only to kids  <br/>\nwho spend years doing what others think is important in a society  <br/>\nthat fears giving them power in homes where more often than not their  <br/>\nparents both work.)<br/>\n<br/>\nWithout looking through the lens of studies that blow up little  <br/>\nsnippets of behavior into doom and gloom, what does he really see?<br/>\n<br/>\nOne technique that scientists use when studying animals is to write  <br/>\ndown what&#39;s going on -- interactions and actions -- every 15 minutes  <br/>\nor so. (He might want to write down what&#39;s going on other than  <br/>\nwatching the screen ;-) If someone were to do the same type of study  <br/>\nwith someone reading a book or playing chess and he were prejudiced  <br/>\nagainst either of those, it would look like even less was going  <br/>\non! ;-) How often do they interact and help each other? (Teamwork.)  <br/>\nHow often do they check strategy from books and on line? (Research.)  <br/>\nHow often does a game spark other actions (pretend play, writing,  <br/>\ndrawing.) (Processing information and making it their own.)<br/>\n<br/>\nUnschoolers *especially* know that scientific studies on learning  <br/>\nhave little relation to natural unwarped-by-school children.  <br/>\nEducators are convinced that kids need to start learning to read and  <br/>\ndo math and sit quietly early or they&#39;re on a track for failure. We  <br/>\nknow from our own experience that it isn&#39;t true. Without the  <br/>\npressures of school, kids turn out fine even if they don&#39;t read until  <br/>\n12, don&#39;t do formal math until they need it (for the SAT&#39;s or a  <br/>\ncollege requirement). With attentive loving families, kids turn out  <br/>\nfine if they play violent video games.<br/>\n<br/>\nHere&#39;s some stuff I&#39;ve written about the same arguments against TV:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/268c4k\">http://tinyurl.com/268c4k</a><br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] need help w/dh and gaming issues","postDate":"1176435380","msgId":28402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0QzdFQjMyLUE4NDEtNDQ0NS04MzFFLUFEMTE0RjUzRjY1N0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA1MkNCNUFELUQ5OEUtNDkyNS04MTYxLUNDRTc4Rjc5ODMyOEBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDA1MkNCNUFELUQ5OEUtNDkyNS04MTYxLUNDRTc4Rjc5ODMyOEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":28401,"nextInTopic":28404,"prevInTime":28401,"nextInTime":28403,"topicId":28401,"numMessagesInTopic":0,"msgSnippet":"-=-My dh, however is greatly disturbed by how much screen time (his words) the children have, and feels strongly that I cannot or will not see the reality","messageBody":"<div id=\"ygrps-yiv-1593616704\">-=-My dh, however is greatly disturbed by how much &quot;screen time&quot; (his<br/>\nwords) the children have, and feels strongly that I cannot or will<br/>\nnot see the &quot;reality&quot; of the effect of gaming on them-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames\">http://sandradodd.com/videogames</a><br/>\n<br/>\nThere are many studies and articles there, not by unschoolers.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":82889211,"authorName":"Emily Troper","from":"Emily Troper &lt;emtroper@...&gt;","profile":"emtroper2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"need help w/dh and gaming issues","postDate":"1176417536","msgId":28401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1MkNCNUFELUQ5OEUtNDkyNS04MTYxLUNDRTc4Rjc5ODMyOEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":28402,"prevInTime":28400,"nextInTime":28402,"topicId":28401,"numMessagesInTopic":0,"msgSnippet":"Hi there trusted listmates, I need your help! My dh is a very kind and smart man who, though he hasn t read much on unschooling, has always been cool enough to","messageBody":"<div id=\"ygrps-yiv-2044484999\">Hi there trusted listmates, I need your help!<br/>\n<br/>\nMy dh is a very kind and smart man who, though he hasn&#39;t read much on  <br/>\nunschooling, has always been cool enough to follow my lead on  <br/>\n&quot;educational&quot; issues.  We&#39;ve tried all sorts of alternative/free  <br/>\nschools over the years (including Summerhill), but have always left  <br/>\nthe choice up to the kids - if they didn&#39;t like the school, they  <br/>\ncould just be home and unschool.<br/>\nI have a 15 year old son (dh&#39;s stepson) who is very much into gaming,  <br/>\nand now our 7 year old son (Seth) has developed a deep interest in  <br/>\ngaming (he got his first system, a gameboy, for his 7th birthday) and  <br/>\nthe boys have been playing together quite a bit on my older son&#39;s  <br/>\ngame systems and TV.  I&#39;m actually glad to see the older boys bonding  <br/>\nmore and sharing some interests (they even chose to share a separate  <br/>\ntable at the pizza parlor the other night) and I definitely see Seth  <br/>\n(my 7 year old) engaged in a LOT of other things too (he loves  <br/>\nskateboarding, gymnastics and bouncing around on a pogo stick, and  <br/>\nhe&#39;s taking guitar lessons and swimming and has a few playdates each  <br/>\nweek with lively friends, as well as collecting pokemon cards and  <br/>\nplaying lots with his younger siblings, and doing various activities  <br/>\nwith me and dh - like chess, reading, board games, movies, etc.).   <br/>\nMost importantly, the person Seth is becoming is a great thing to  <br/>\nbehold - he is compassionate and kind and silly and interesting.  I  <br/>\nfeel like things are going really well.<br/>\n<br/>\nMy dh, however is greatly disturbed by how much &quot;screen time&quot; (his  <br/>\nwords) the children have, and feels strongly that I cannot or will  <br/>\nnot see the &quot;reality&quot; of the effect of gaming on them.  He cites many  <br/>\nstudies that show it&#39;s addictive and harmful, and often compares it  <br/>\nto heroin during our discussions.  I think that dh&#39;s disdain for  <br/>\nthese interests of our children are more harmful than the games, and  <br/>\nI feel in my heart that when/if he can truly let go of his fear  <br/>\naround this issue, the &quot;screen time&quot; will likely be less  <br/>\nanyway...but, I need more than that.  He wants to see/hear more  <br/>\n&quot;evidence&quot; than just an anecdote or two from teens saying that gaming  <br/>\nis great, or that gaming is educational - he&#39;s already on board with  <br/>\nthings not having to be &quot;educational&quot;, he&#39;d rather have them playing  <br/>\nin the sandbox outside or sitting in a chair staring into space, than  <br/>\ndoing a math computer game.<br/>\n<br/>\nWhat ya got for me? :)<br/>\n<br/>\nThanks,<br/>\n<br/>\nEmily<br/>\n<br/>\nmostly joyously unschooling<br/>\nin Portland, Oregon<br/>\nwith dh Michael<br/>\nds Morgan (12/91)<br/>\nds Seth (8/99)<br/>\ndd Sara Kate (7/01)<br/>\nand ds Jacob (12/04)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":28329,"nextTopicId":28427}}