{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":112,"messages":[{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065280236","msgId":82072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4wLjIyLjAuMjAwMzEwMDQwODA2MTguMDI2MTU0ODBAc2hhd21haWwuZ3Yuc2hhd2NhYmxlLm5ldD4=","inReplyToHeader":"PDIwMDMxMDAzLjE2MTM1OS4tNDM3MDAxLjUuc2l4cmVkaGVhZHNAanVuby5jb20+","referencesHeader":"PDIwMDMxMDAzLjE2MTM1OS4tNDM3MDAxLjUuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":82069,"nextInTopic":82073,"prevInTime":82071,"nextInTime":82073,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"... Giving them chances to try it is different from saying, I know you don t like this but it has to get done. If you stick around for a while and read about","messageBody":"<div id=\"ygrps-yiv-953489068\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;I don&#39;t expect this mature attitude from my young kids. But is any part<br/>\n&gt;of parenting &quot;you get out what you put in&quot;? I want to raise children who<br/>\n&gt;become responsible adults, joyful and playful, imaginative, helpful to<br/>\n&gt;others, who don&#39;t abandon responsibilities just because thier interest<br/>\n&gt;wanes. Shouldn&#39;t I live in a way that prepares and expects that? I&#39;m not<br/>\n&gt;talking about at the expense of the relationship, or in a way that<br/>\n&gt;communicates disappointment or pressure. But living it, telling them why<br/>\n&gt;I live it, giving them chances to try it?<br/>\n<br/>\n<br/>\n </span></blockquote>Giving them chances to try it is different from saying, &quot;I know you don&#39;t <br/>\nlike this but it has to get done.&quot;<br/>\n<br/>\nIf you stick around for a while and read about some of the kids on this <br/>\nlist, you&#39;ll find that the ways people are talking about *are* producing <br/>\nkids like that.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve really seen alot of examples of adults who only do what they feel<br/>\n&gt;like...from leaving toddlers alone for 3 weeks (in the news here in my<br/>\n&gt;neighborhood!), to not being able to feed a work crew on Saturday because<br/>\n&gt;no one wants to volunteer a casserole, to gosh...the neighbors who public<br/>\n&gt;school &quot;to get away from thier kids for a few hours&quot;. I&#39;d so much prefer<br/>\n&gt;not to raise that kind of child.<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;d be willing to bet that the majority of those adults were raised having <br/>\nto do chores and other things they preferred not to do.  Nobody gave them <br/>\nthe option of not doing them as they were growing up.  Once they were &quot;in <br/>\ncharge&quot; they decided not to.  I figure it&#39;s better to have them deciding <br/>\nthat when they&#39;re younger and it doesn&#39;t matter much.<br/>\nTia in Canada</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: on playing for life","postDate":"1065279743","msgId":82069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJsbW5kditsdm10QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMxMDAzLjE2MTM1OS4tNDM3MDAxLjUuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":82066,"nextInTopic":82072,"prevInTime":82068,"nextInTime":82070,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"Hi again Tia My kids surprise me in this area. I haven t ever fretted much about the academics, but the chores? the bedtimes? that has been a bit more ","messageBody":"<div id=\"ygrps-yiv-961431694\">Hi again Tia<br/>\n<br/>\nMy kids surprise me in this area. I haven&#39;t ever fretted much about <br/>\nthe academics, but the chores? the bedtimes? that has been a bit more <br/>\ndifficult for me to let go.<br/>\n<br/>\nOne example I gave recently, where I invited Robby (my non-helper <br/>\nboy) to come and visit while we did the dishes. He put down his book <br/>\nand we spent 20 minutes talking about The Hulk and Rockman.<br/>\n<br/>\nHere&#39;s another. We watch a lot of videos, and the TV is downstairs. I <br/>\nventure down there for laundry, and about twice a week, for a video <br/>\nmy own self. In the past, I&#39;ve fussed and fumed and scolded and made <br/>\nthem &quot;get all these videos back in their cases!&quot;...whereupon they <br/>\nwould fly around the room getting things in order...a few weeks ago, <br/>\nI went down to watch a movie w/the kids, and Robby put in the video, <br/>\nthen looked around him and said &quot;Geez, I better get some of these <br/>\nmovies put away.&quot; and DID SO.<br/>\n<br/>\nDid I faint? just about! LOL point being, he is capable of seeing <br/>\nwhen things need to be done, and doing so, without my nagging. I have <br/>\nmentioned the reason why I like the videos replaced as soon as we are <br/>\ndone watching (to avoid smashing the cardboard covers and if they&#39;re <br/>\nrented, to keep the tapes safe.)...<br/>\n<br/>\nIt&#39;s modelling, I&#39;m telling you. Cheerfully and willingly doing what <br/>\nneeds doing, making yourself an attractive person to be with, so the <br/>\nhelp will come because they want to be with you.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t divide these parts of life...I&quot;m talking about <br/>\n </span></blockquote>situations/needs<br/>\n<blockquote><span title=\"qreply\"> &gt; that come up that they don&#39;t want to do. </span></blockquote></div>","specialLinks":[]},{"userId":154033277,"authorName":"crystal.pina","from":"&quot;crystal.pina&quot; &lt;crystal.pina@...&gt;","profile":"crystalinma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065273557","msgId":82066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTUwMWMzOGE3YSQxZDJlZGVjMCQwMGMxZmVhOUBTRVlNT1VSQlVUVFM+","referencesHeader":"PDEyZi4zMjdlYjIzNi4yY2FmZGQ3MEBhb2wuY29tPg=="},"prevInTopic":82060,"nextInTopic":82069,"prevInTime":82065,"nextInTime":82067,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"That ll learn em, durn em she said many, many times. ... This is so mean.  I saw this happen just yesterday.  We were at our monthly homeschool meeting.","messageBody":"<div id=\"ygrps-yiv-1842626559\">&quot;That&#39;ll learn &#39;em, durn &#39;em&quot; she said many, many times.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>This is so mean.  I saw this happen just yesterday.  We were at our monthly homeschool meeting.  One of the mothers has two daughters.  They each made bagels to bring to the meeting for their breakfast because it was early.  One of the daughters forgot her bagel on the counter so she came to the meeting without any breakfast.  She asked her mother for some of hers.  The mother told her no! and that would &quot;teach&quot; her to remember her stuff.  Later, on the ride home my daughter told me she doesn&#39;t like those two girls because they&#39;re mean.  One of the girls asked a question which my daughter knew the answer to so she told her.  The girl looked at her and said &quot;I wasn&#39;t talking to you&quot;.  Well, where do you think she learned that attitude?<br/>\n<br/>\nCrystal<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065268164","msgId":82060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQTQyQzAzLjFGM0FGJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDMxMDAzLjIwMTEwMy4tNDM3MDAxLjExLnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":82059,"nextInTopic":82066,"prevInTime":82059,"nextInTime":82061,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"... I think it helps not to see what people are suggesting as criticism of where you are but as directions from where you are (or somewhere close to it) to ","messageBody":"<div id=\"ygrps-yiv-455788189\">on 10/3/03 7:40 PM, Tia Graham at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This was a relieving point. Some misconception of how I am and how I<br/>\n&gt; *actually* parent (versus my thoughts which I&#39;ve been posting about)<br/>\n&gt; seems to be coming into replies to me.<br/>\n<br/>\n </span></blockquote>I think it helps not to see what people are suggesting as criticism of where<br/>\nyou are but as directions from where you are (or somewhere close to it) to<br/>\nwhere you say you want to be. If what you&#39;re describing isn&#39;t where you<br/>\nactually are, our directions might be a little off on your end, but the end<br/>\nwe&#39;re describing is very accurate.<br/>\n<br/>\nWhat I&#39;m saying is that accurately describing where you are isn&#39;t totally<br/>\nimportant if you&#39;re understanding the destination we&#39;re describing. You can<br/>\nignore what we say that doesn&#39;t apply to you and focus on getting from where<br/>\nyou are to where you&#39;d like to be/where we can help you get. (Hopefully<br/>\nthey&#39;re the same or we&#39;re all wasting words! ;-)<br/>\n<br/>\nSo it&#39;s more helpful to you to ask questions about where we&#39;re giving you<br/>\ndirections to rather than trying to pinpoint for us where you are. Only you<br/>\ncan truly understand what your motivations are when you ask if your son<br/>\nwould like to read, for instance. We can pick up clues in your writing that<br/>\nsuggests you might be having schoolish thoughts. But it isn&#39;t helpful to<br/>\nconvince us that you aren&#39;t having schoolish thoughts. It is helpful to you<br/>\nin getting yourself to unschooling, though, to do some self reflection on<br/>\nwhere you are and why you&#39;re there and where you&#39;d like to be. (Doing some<br/>\nself reflection on why people are getting the wrong idea is also helpful.<br/>\nWhat about your words is giving people the idea that you have schoolish<br/>\nthoughts? Self-reflection not to help us understand you better, but<br/>\nself-reflection to help yourself understand yourself better.)<br/>\n<br/>\nThe hard part about unschooling is that no one can help anyone get from<br/>\nwhere they are to unschooling. You have to do all the work yourself. We can<br/>\nsuggest things that might be getting in your way. We can suggest ways to get<br/>\naround them. The only thing we can describe accurately is where you&#39;ll end<br/>\nup, and even that is in the vague terms of joy and freedom.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065267312","msgId":82059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQTQyOEIwLjFGM0FGJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDMxMDAzLjIwMTEwNC4tNDM3MDAxLjEyLnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":82055,"nextInTopic":82060,"prevInTime":82058,"nextInTime":82060,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"... Don t think of what we re talking about as fun, then. Think of it as joy. Even the most joyful life isn t all peaches and cream. Sometimes it rains when we","messageBody":"<div id=\"ygrps-yiv-1499121378\">on 10/3/03 8:11 PM, Tia Graham at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know in the nitty gritty of my heart, I&#39;m not okay with a life<br/>\n&gt; philosophy that centers on &quot;if it&#39;s fun I&#39;m here, and if it&#39;s not, I&#39;m<br/>\n&gt; gone&quot;.<br/>\n<br/>\n </span></blockquote>Don&#39;t think of what we&#39;re talking about as fun, then. Think of it as joy.<br/>\n<br/>\nEven the most joyful life isn&#39;t all peaches and cream. Sometimes it rains<br/>\nwhen we wanted it sunny. Sometimes a friend cancels out when we wanted to do<br/>\nsomething together. Sometimes accomplishing something means working through<br/>\na period of frustration.<br/>\n<br/>\nLife will naturally throw us lemons at us fairly regularly. But what we<br/>\ndon&#39;t need is to squirt life with artificial lemon juice to prepare us.<br/>\n<br/>\nMost people divide the world into productive uses of time and unproductive<br/>\nuses of time. Productive things are housework and going to work, home<br/>\nrepairs, shopping and so on. They are generally the things we don&#39;t want to<br/>\ndo. Unproductive uses are entertainment and fun. Then there&#39;s the gray area<br/>\nthat depends on how joyless someone&#39;s life is. Some people may feel that<br/>\ncreating only practical things is productive, like sewing curtains. Some may<br/>\nfeel that any creativity is productive, like sewing a quilted wall hanging.<br/>\nHow guilty you feel while doing something when there&#39;s a sinkful of dirty<br/>\ndishes may be a helpful indicator of where you draw the line ;-)<br/>\n<br/>\nI suspect you think we&#39;re suggesting you eliminate the productive stuff so<br/>\nkids can spend all their time on the unproductive &quot;fun&quot; stuff, eliminate all<br/>\nthe frustrations in life so kids&#39; lives are smooth sailing, eliminate the<br/>\nwork and hardship so that life is only fun.<br/>\n<br/>\nBut that isn&#39;t it at all.<br/>\n<br/>\nWhat we&#39;re talking about is shifting your priorities and viewpoint so that<br/>\nyou approach life from a different angle. Getting there is sort of a<br/>\nmultistep step process.<br/>\n<br/>\nYou need to reassess what&#39;s necessary.<br/>\n<br/>\nWhile people need to eat, we don&#39;t need to eat a home cooked mean every<br/>\nnight or even 3 square meals a day. There&#39;s a huge amount of flexibility<br/>\nabout how we eat but most of us have put up road blocks that make it seem<br/>\nlike we only have one or two choices.<br/>\n<br/>\nIf you see something as a necessity it will feel like there&#39;s an authority<br/>\nbehind you making you do it. If you give yourself permission to do only what<br/>\nyou want to do, then that eliminates the authority. You&#39;ll be in a better<br/>\nposition to see your family and wanting to cook a healthy meal for them<br/>\nrather than subconsciously categorizing that as another one of those &quot;have<br/>\ntos&quot;.<br/>\n<br/>\nYou need to reassess gaols and priorities.<br/>\n<br/>\nFor instance I realized that my goal of saving money was interfering with my<br/>\ngoal of helping my daughter take more regular showers. She wanted the room<br/>\nwarm but my frugal nature didn&#39;t want to bring down the space heater from<br/>\nthe attic. And it seemed silly to buy kids shampoo when the adult shampoo<br/>\nwas already there. And it seemed wasteful to buy body wash when there&#39;s a<br/>\nwhole stack of free hotel soap that&#39;s been trickling into the house for<br/>\nyears.<br/>\n<br/>\nI realized the first goal was setting up huge *artificial* road blocks in<br/>\nthe path to the second goal. What I was basically saying was that money was<br/>\nmore important than my daughter&#39;s comfort. But looking at it objectively, I<br/>\nrealized $10 (or whatever it took) to help showers be less painful was a<br/>\nreally small price to pay to eliminate the emotional price we were both<br/>\npaying by not spending the money.<br/>\n<br/>\nIf you set a high priority on maintaining the division between fun and<br/>\nnecessity then that will interfer with a goal of having helpful kids. You<br/>\nmight be able to acheive the second, but you&#39;ll be setting up artificial<br/>\nbarriers that you&#39;ll need to work around. We can&#39;t help you work around the<br/>\nbarriers. But we can help you eliminate the barriers if you&#39;re willing to<br/>\nchange your viewpoint and your priorities.<br/>\n<br/>\nAnd it really isn&#39;t as painful as it seems! It&#39;s just fear of the potential<br/>\nconsequences that makes it look painful.<br/>\n<br/>\nGetting there and letting go of the anchors that hold you back can be<br/>\npainful hard work, but once you&#39;re there being more joyful and having a more<br/>\njoyful family is a *huge* payback.<br/>\n<br/>\n(There&#39;s more steps involved but I never thought to write them all out. They<br/>\njust kind of flow when I&#39;m answering the &quot;chores&quot; question. ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was checking my priority, and also trying to<br/>\n&gt; clarify where I stand for you all who don&#39;t know me well. I would imagine<br/>\n&gt; that for some people, in the world because I see them, that fun is<br/>\n&gt; absolutely thier god, the thing they&#39;d do anything for. I&#39;m saying, I<br/>\n&gt; have a personal line that I&quot;m not willing to cross.<br/>\n<br/>\n </span></blockquote>Most of us have been where you are, where life is divided into things we<br/>\nhave to do and things we want to do. And we&#39;ve found that mindset doesn&#39;t<br/>\nhelp lead to kids who want to help. That priority is a road block.<br/>\n<br/>\nThe point people are trying to make is that by shifting your view point and<br/>\nrearranging your priorities you can reach the goals you have for your<br/>\nchildren.<br/>\n<br/>\n(You also have to eliminate those goals and accept that the goals will be a<br/>\nside effect. If you&#39;re giving expecting people to give in return it will<br/>\nvery likely backfire. If you&#39;re giving because you find joy in it, others<br/>\nvery likely will pick up your joy and find value in your model. Generosity<br/>\nwill more likely generate generosity than subconsciously putting your giving<br/>\non a pan scale and expecting someone to eventually give enough to balance<br/>\nout the scale.)<br/>\n<br/>\nIf you want to hold onto the priorities you have, we can&#39;t help you because<br/>\nwe&#39;ve found those priorities need to be let go of to get what you say you<br/>\nwant.<br/>\n<br/>\nWhat you&#39;re in essence saying is that you want to swim and you want to hold<br/>\nonto the side. People here have tried swimming while holding onto the side<br/>\nand we know that holding on interfers. We can help you let go to swim but we<br/>\ncan&#39;t help you hold on to swim.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065255792","msgId":82055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZi4zMjdlYjIzNi4yY2FmZGQ3MEBhb2wuY29tPg=="},"prevInTopic":82054,"nextInTopic":82059,"prevInTime":82054,"nextInTime":82056,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"-=-For instance, my neighbor went to her middle school son s locker last night and cleaned it out for him. She didn t want him to miss any assignments.  I","messageBody":"<div id=\"ygrps-yiv-2102048281\">-=-For instance, my neighbor went to her middle school son&#39;s<br/>\nlocker last night and cleaned it out for him. She didn&#39;t want him to miss<br/>\nany assignments.  I said, &quot;Why can&#39;t he clean out his own locker?&quot; She<br/>\nlaughed-=-<br/>\n<br/>\n-=-And I was thinking, &quot;He&#39;ll never know how either if you don&#39;t let<br/>\nhim.&quot; -=-<br/>\n<br/>\nMaybe he doens&#39;t know how because he&#39;s not seen it done, or he&#39;s just not <br/>\ngood at it, or he hates school and school books so much he can&#39;t stand to look at <br/>\nthem for one second he doesn&#39;t have to.<br/>\n<br/>\n&lt;&lt;I was thinking that this kid missing an assignment or two just might be<br/>\nthe example he needs to live through in order to discover it&#39;s important<br/>\nto keep up with things well.&gt;&gt;<br/>\n<br/>\nThis sounds vindictive.  Traditionally punitive and anti-child.  I bet you <br/>\ndon&#39;t mean to be, and you might not realize that it has that harsh edge my <br/>\ngranny&#39;s words had when she was in a spiteful mood.  Or maybe I&#39;m hearing my <br/>\ngranny&#39;s tone because she said things like that, about people she knew and didn&#39;t <br/>\nknow.  &quot;That&#39;ll learn &#39;em, durn &#39;em&quot; she said many, many times.<br/>\n<br/>\n&lt;&lt;Or maybe he doens&#39;t care at all<br/>\nand they both need to face that. But her doing it for him, in order to<br/>\nkeep him from facing any sorrow (and ruining his afternoon fun) isn&#39;t<br/>\nresulting in anything but a continuance of frustration on her part. She&#39;s<br/>\ngetting madder and he&#39;s getting messier. &gt;&gt;<br/>\n<br/>\nSounds like you&#39;re madder than she is, if she laughed, and she did it <br/>\nvoluntarily.  <br/>\n<br/>\nMaybe he doesn&#39;t care.  <br/>\nMaybe she DOES want him to have unruined afternoon fun and lack of sorrow.  <br/>\nSchool is sorrow enough.  <br/>\n<br/>\n&lt;&lt; And clean dishes to eat from are important to me. My family isn&#39;t<br/>\nold enough to clean thier own, or I&#39;d just wash my own and let them work<br/>\nout for themselves what was important to them. &gt;&gt;<br/>\n<br/>\nWould you want them to get old enough to just wash their own and never wash <br/>\nyours or the rest of the family&#39;s?  Generosity will gain more generosity than <br/>\nmeasuring and scheduling and drawing lines can.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The word Scheme","postDate":"1065255410","msgId":82054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkMS4xMWUwYTFjNS4yY2FmZGJmMkBhb2wuY29tPg=="},"prevInTopic":82051,"nextInTopic":82055,"prevInTime":82053,"nextInTime":82055,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/4/03 12:51:47 AM, dezigna@comcast.net writes:  Webster s is","messageBody":"<div id=\"ygrps-yiv-1428698030\">In a message dated 10/4/03 12:51:47 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n&lt;&lt; 3 : a plan or program of action; especially : a crafty or secret one &gt;&gt;<br/>\n<br/>\nWebster&#39;s is quite an American dictionary, though.<br/>\n<br/>\nCan we get to British-useage stuff from google?  How do we search brit sites?<br/>\n<br/>\nI have an OED here.  Can&#39;t believe how many columns of &quot;scheme&quot; and its <br/>\nrelatives, but here&#39;s an interesting thing:<br/>\n<br/>\nschematomancy<br/>\n<br/>\n(I&#39;ll put the definition below, but it&#39;s 19th century and maybe someone here <br/>\ncan guess vaguely at it by what it looks like.)<br/>\n<br/>\nScheme starts out all chart-and-diagrammish and then there is the definition <br/>\nthat covers both the benign English government schemes in the first half and <br/>\nAmerican bad-connation schemes, in the second half:<br/>\n<br/>\n&quot;A plan of action derived in order to attain some end; a purpose together <br/>\nwith a system of measures contrived for its accomplishment; a project; <br/>\nenterprise.  Often with unfavourable notion; a self-seeking or an underhand project; a <br/>\nplot.&quot;<br/>\n<br/>\nJust a few pages later is &quot;school,&quot; and it occurred to me that that second <br/>\ndescription fits the American school system of recent years:<br/>\n<br/>\n&quot;A purpose together with a system of measures contrived for its <br/>\naccomplishment.&quot;<br/>\n<br/>\nAHA!!! School IS a scheme!<br/>\n<br/>\nAnd &quot;schematomancy&quot; means (meant, a time or two anyway):<br/>\nA form of divination by which the personal history of a man is inferred from <br/>\nhis form and appearance.<br/>\n<br/>\nGood word, &quot;scheme.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] The word Scheme","postDate":"1065251031","msgId":82051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzOGE0NSRhZTk2NTQ5MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDAwMDAwMWMzOGEzZSQ1OTY0YTc4MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+"},"prevInTopic":82050,"nextInTopic":82054,"prevInTime":82050,"nextInTime":82052,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"Well poop - the message I wrote about needing a new word instead of scheme got removed as non-text . Well there, that says it only with brevity. Robyn Coburn ","messageBody":"<div id=\"ygrps-yiv-1364382275\">Well poop - the message I wrote about needing a new word instead of<br/>\nscheme got removed as &quot;non-text&quot;. Well there, that says it only with<br/>\nbrevity.<br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n <br/>\n<br/>\nFrom Webster dictionary online:<br/>\n<br/>\nMain Entry: 1scheme<br/>\n&lt;javascript:popWin(&#39;/cgi-bin/audio.pl?scheme01.wav=scheme&#39;)&gt; <br/>\nPronunciation: &#39;skEm<br/>\nFunction: noun<br/>\nEtymology: Latin schemat-, schema arrangement, figure, from Greek<br/>\nschEmat-, schEma, from echein to have, hold, be in (such) a condition;<br/>\nakin to Old English sige victory, Sanskrit sahate he prevails<br/>\nDate: 1610<br/>\n1 a archaic (1) : a mathematical or astronomical diagram (2) : a<br/>\nrepresentation of the astrological aspects of the planets at a<br/>\nparticular time b : a graphic sketch or outline<br/>\n2 : a concise statement or table : EPITOME<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.m-w.com/cgi-bin/dictionary?book=Dictionary\">http://www.m-w.com/cgi-bin/dictionary?book=Dictionary</a><br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=epitome\">http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=epitome</a>&gt;<br/>\n&va=epitome&gt; <br/>\n3 : a plan or program of action; especially : a crafty or secret one<br/>\n4 : a systematic or organized framework : DESIGN<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.m-w.com/cgi-bin/dictionary?book=Dictionary\">http://www.m-w.com/cgi-bin/dictionary?book=Dictionary</a><br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=design\">http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=design</a>&gt;<br/>\n&va=design&gt; <br/>\nsynonym see PLAN<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.m-w.com/cgi-bin/dictionary?book=Dictionary\">http://www.m-w.com/cgi-bin/dictionary?book=Dictionary</a><br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=plan\">http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=plan</a>&gt;<br/>\n&va=plan&gt;  <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The word Scheme","postDate":"1065247883","msgId":82050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzOGEzZSQ1OTY0YTc4MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDIwMDMxMDAyLjE5MzMyMy4tNDM3MDAxLjI0LnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":82045,"nextInTopic":82051,"prevInTime":82049,"nextInTime":82051,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"From Webster dictionary online: Main Entry: 1scheme  Pronunciation: skEm Function: noun Etymology:","messageBody":"<div id=\"ygrps-yiv-1152733630\">From Webster dictionary online:<br/>\n<br/>\n <br/>\n<br/>\nMain Entry: 1scheme<br/>\n&lt;javascript:popWin(&#39;/cgi-bin/audio.pl?scheme01.wav=scheme&#39;)&gt; <br/>\nPronunciation: &#39;skEm<br/>\nFunction: noun<br/>\nEtymology: Latin schemat-, schema arrangement, figure, from Greek<br/>\nschEmat-, schEma, from echein to have, hold, be in (such) a condition;<br/>\nakin to Old English sige victory, Sanskrit sahate he prevails<br/>\nDate: 1610<br/>\n1 a archaic (1) : a mathematical or astronomical diagram (2) : a<br/>\nrepresentation of the astrological aspects of the planets at a<br/>\nparticular time b : a graphic sketch or outline<br/>\n2 : a concise statement or table : EPITOME<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=epitome\">http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=epitome</a>&gt; <br/>\n3 : a plan or program of action; especially : a crafty or secret one<br/>\n4 : a systematic or organized framework : DESIGN<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=design\">http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=design</a>&gt; <br/>\nsynonym see PLAN<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=plan\">http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=plan</a>&gt;  <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065236554","msgId":82045,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzQTA3MjE4LUY2MTctMTFENy1BRUVFLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDIwMDMxMDAzLjIwMTEwMy4tNDM3MDAxLjExLnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":82041,"nextInTopic":82050,"prevInTime":82044,"nextInTime":82046,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"Unschooling families are REALLY different Tia. Don t look at specific aspects of how other families parent and then think things like: Those parents gave","messageBody":"<div id=\"ygrps-yiv-334728968\">Unschooling families are REALLY different Tia. Don&#39;t look at specific <br/>\naspects of how other families parent and then think things like: &quot;Those <br/>\nparents gave their kids everything, never made them do chores, and <br/>\ndidn&#39;t discipline them and look at how rotten those kids behave and I <br/>\ndon&#39;t want MY kids to turn out like that so....&quot;.<br/>\n<br/>\nThose parents aren&#39;t unschooling or probably even homeschooling. It <br/>\nisn&#39;t comparable.<br/>\n<br/>\nIt is like Jane Healy at the Sacramento Conference going on about how <br/>\nbad TV is for children - then admitting she&#39;d never even MET a <br/>\nhomeschooled kid, much less an unschooled kid, until two of them picked <br/>\nher up from the airport and she spent what she called a delightful half <br/>\nhour riding with them. She based her opinions on studies - none done on <br/>\nhomeschooled kids.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Friday, October 3, 2003, at 04:40  PM, Tia Graham wrote:<br/>\n<br/>\n&gt; I&#39;m sure there are. What I&#39;m struggling with though, is that there are<br/>\n&gt; lots of people in the *world* who don&#39;t have kids like that. Sometimes<br/>\n&gt; it&#39;s obvious that it was the parenting that caused it and sometimes <br/>\n&gt; not.<br/>\n&gt; I&quot;m not accusing unschoolers of turning out these kids...I&#39;m asking for<br/>\n&gt; some reassurance that unschooling can help prevent that. </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065231345","msgId":82041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyQzA4QTU1LUY2MEItMTFENy1BRUVFLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDE1Yy4yNGZjZjMzNC4yY2FmNTlkOUBhb2wuY29tPg=="},"prevInTopic":82038,"nextInTopic":82045,"prevInTime":82040,"nextInTime":82042,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"... My kids and I and my husband sometimes do not get the sleep we need because we don t plan ahead. Sometimes I stay up way too late and have to get up early.","messageBody":"<div id=\"ygrps-yiv-1638864147\">On Friday, October 3, 2003, at 04:01  PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My kids get all the sleep they need because they go to sleep when they <br/>\n&gt; want<br/>\n&gt; to and wake up with they wake up.  I<br/>\n<br/>\n </span></blockquote>My kids and I and my husband sometimes do not get the sleep we need <br/>\nbecause we don&#39;t plan ahead. Sometimes I stay up way too late and have <br/>\nto get up early. Sometimes I just can&#39;t sleep that well and feel sleepy <br/>\nall day.<br/>\n<br/>\nMy 16 yo just told me, 10 minutes ago, &quot;Mom, I&#39;m not going to want to <br/>\nwatch that movie tonight because I won&#39;t be home until too late and I <br/>\nwant to get enough sleep tonight because I have really really long <br/>\nrehearsals both Saturday and Sunday.&quot;<br/>\n<br/>\nMy kids handle their own sleep issues. Not perfectly. Neither do I. But <br/>\nthey have responsibility and they&#39;ve given sleep a fair amount of <br/>\nthought - sometimes they choose, just like I do, to stay awake and <br/>\nsqueeze every minute out of day.<br/>\n<br/>\nAt the Live and Learn Conference - some of us moms kept our kids up <br/>\nuntil the wee hours of the morning because WE didn&#39;t want to waste <br/>\nthose precious minutes together.  Poor kids - what examples we are, <br/>\nhuh? &lt;BEG&gt;<br/>\n<br/>\nRelax Tia. Bedtimes schmedtimes. Instead of having bedtime, if you <br/>\nthink a kid needs sleep - just read in bed, cuddle, have warm baths, <br/>\netc., Don&#39;t say its past their bedtime, just help them get the sleep <br/>\nthey need.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065229582","msgId":82038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4NjQxOTM4LUY2MDYtMTFENy1BRUVFLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDIwMDMxMDAzLjE2MTM1OS4tNDM3MDAxLjQuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":82036,"nextInTopic":82041,"prevInTime":82037,"nextInTime":82039,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"... I hate housework - I m bored to tears, sometimes literally, over it. I m frustrated by it and I get cranky when I have to spend time doing it. My house","messageBody":"<div id=\"ygrps-yiv-1449050961\">On Friday, October 3, 2003, at 12:59  PM, Tia Graham wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But really, right now, I&#39;m thinking I just must be a lesser woman than <br/>\n&gt; you. Because while I love being a mom and housewife, I hate doing the <br/>\n&gt; dishes.<br/>\n<br/>\n </span></blockquote>I hate housework - I&#39;m bored to tears, sometimes literally, over it. <br/>\nI&#39;m frustrated by it and I get cranky when I have to spend time doing <br/>\nit.<br/>\n<br/>\nMy house shows the effects of my bad attitude.<br/>\n<br/>\nTo be honest - it isn&#39;t housecleaning I hate so much - I can &quot;get&quot; how <br/>\nthere is a certain amount of joy, even, in those clean sheets and shiny <br/>\nsinks, but I just can&#39;t manage to take the time needed to be organized <br/>\nenough that I ever get to experience that. Everything to do with <br/>\nhousehold maintenance is a huge chore for me - because I&#39;m always <br/>\noverwhelmed by it, I can&#39;t stand to face it so I put it off and it gets <br/>\nworse and worse.<br/>\n<br/>\nSo - telling me that I should just not think of it as chores? Well - it <br/>\nmakes me laugh, at least &lt;G&gt;.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: on playing for life","postDate":"1065228307","msgId":82032,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE5LjQ5MWQ4ZGEyLjJjYWY3MjEzQGFvbC5jb20+"},"prevInTopic":82030,"nextInTopic":82034,"prevInTime":82031,"nextInTime":82033,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/3/03 5:56:24 PM, Wilkinson6@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-891977312\">In a message dated 10/3/03 5:56:24 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Wilkinson6@...\">Wilkinson6@...</a> writes:<br/>\n<br/>\n&lt;&lt; **Sorrow doesn&#39;t prepare people for sorrow.**<br/>\n<br/>\n<br/>\n&lt;&lt;Sometimes it does.  It, atleast, can take away the shock that bad <br/>\n<br/>\nthings can happen  &gt;&gt;<br/>\n<br/>\nI meant contrived sorrow or justified frustration doens&#39;t prepare people for <br/>\ngenuine sorrow.<br/>\n<br/>\nMy mother in law said once when both boys were toddlers and there was no <br/>\nHolly &quot;You have to frustrate them.&quot;<br/>\n<br/>\nShe didn&#39;t say &quot;you might want to consider frustrating them.&quot;<br/>\nShe said &quot;You HAVE to.&quot;<br/>\n<br/>\nShe meant to frustrate them purposefully and regularly, so they could learn <br/>\nto deal with frustration.<br/>\n<br/>\nI said &quot;Life is frustrating enough.&quot;<br/>\n<br/>\nI was nice enough not to say, &quot;Well, we bring them to visit you!&quot;<br/>\n<br/>\n&lt;g&gt;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":43907726,"authorName":"Tia Graham","from":"Tia Graham &lt;sixredheads@...&gt;","profile":"clarasmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065226263","msgId":82034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDAzLjIwMTEwNC4tNDM3MDAxLjEyLnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":82032,"nextInTopic":82036,"prevInTime":82033,"nextInTime":82035,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-438066236\">&lt;&lt;<br/>\n&lt;&lt;That simple job takes alot of mental discipline and diligence on<br/>\nmy part...my attention wanders everywhere and it&#39;s hard to finish. I&#39;m<br/>\nalso not the only one who lives here and dirties them. &gt;&gt;<br/>\n<br/>\nBut you&#39;re the only one who is the mom.<br/>\nThere&#39;s a reality to that whether we like to admit it &gt;&gt;<br/>\n<br/>\nYup. And clean dishes to eat from are important to me. My family isn&#39;t<br/>\nold enough to clean thier own, or I&#39;d just wash my own and let them work<br/>\nout for themselves what was important to them. So, for now, I wash<br/>\neveryones&#39; unless dh does it. I signed up for that when I birthed them<br/>\nand I don&#39;t resent it. But what is &quot;old enough&quot;? When I first asked about<br/>\nthis, it was an attempt to hear from older families as to when they<br/>\nstarted seeing thier kids care about stuff like environment.<br/>\n<br/>\n&lt;&lt;If my husband were disabled I would wash him and wipe his ass.  I<br/>\nwouldn&#39;t <br/>\nHAVE to, but I would choose to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>Glad to hear it. Because I want to raise kids that would choose too as<br/>\nwell. Not bolt for the door because it wasn&#39;t the fun they thought they<br/>\ndeserved. I&#39;m NOT saying unschooling produces that attitude...please<br/>\ndon&#39;t anyone think I&#39;m implying that!<br/>\n<br/>\n&lt;&lt;If you make your own life happy, the life will never be greener on the<br/>\nother <br/>\nside.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>Good point.<br/>\n<br/>\n&lt;&lt;.   But I chose it and I could have <br/>\nworked up a big tearful whine, or I could sing and smile and be happy.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>That&#39;s what I&#39;m after! Of course &quot;being after&quot; or &quot;raising&quot; someone<br/>\nprobably is the *wrong* lingo to use here. I&#39;m not saying I&#39;d love my<br/>\nkids less if they didn&#39;t turn out that way. But being on this side of it,<br/>\nwhen they are small and we are in the beginning, I think it&#39;s best to be<br/>\nhonest with myself and admit that I do care about my influence over them<br/>\nand the effect it can have on how they mature.<br/>\n<br/>\n&lt;&lt;Would you break a child&#39;s finger so he would be prepared to meet the <br/>\nchallenge of a possible (but not definite) future broken arm or leg?<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>That&#39;s obnoxious. Of course not. But I might use some prior example of<br/>\nwhen they persevered in something to encourage them to keep it up in<br/>\nanother instance. For ex: my son struggled for three years to learn the<br/>\ntwinkle variations on his violin. He did it and was so proud! Now when he<br/>\nstruggles over a new piece but *wants* to keep going and is so frustrated<br/>\nhe can&#39;t get it, we talk about how hard it was to keep going for Twinkle<br/>\nand how great he felt when he did it. <br/>\n<br/>\nI bet when my grandmother dies, my kids will remember more about when<br/>\nthier sister or dog died. <br/>\n<br/>\n&lt;Sorrow doesn&#39;t prepare people for sorrow.  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>I disagree. I made it through some particulary grievous sorrow just today<br/>\npurely on the fact that a previous and much greater sorrow was survived.<br/>\nI can make it through this because I made it through that, which was so<br/>\nmuch harder. This isn&#39;t sorrow that&#39;s avoidable and no one is inflicting<br/>\nit on me. No one person or thier attempt to prepare me could have done<br/>\nit...the previous sorrow itself is what prepared me. I&#39;d never inflict<br/>\nsorrow on another to &quot;prepare&quot; them. But I&#39;d talk, talk, talk, and I&#39;d<br/>\nhelp them relate small sorrows to survival strategies for larger ones. <br/>\n<br/>\nI know parents who shelter their kids from any kind of negative<br/>\nconsequence. For instance, my neighbor went to her middle school son&#39;s<br/>\nlocker last night and cleaned it out for him. She didn&#39;t want him to miss<br/>\nany assignments.  I said, &quot;Why can&#39;t he clean out his own locker?&quot; She<br/>\nlaughed and said he didn&#39;t know how and couldn&#39;t be trusted to do a good<br/>\njob. And I was thinking, &quot;He&#39;ll never know how either if you don&#39;t let<br/>\nhim.&quot; <br/>\n<br/>\nI was thinking that this kid missing an assignment or two just might be<br/>\nthe example he needs to live through in order to discover it&#39;s important<br/>\nto keep up with things well. Or maybe he needs her to help him, get him<br/>\nan organizer, and explain how it&#39;s done. Or maybe he doens&#39;t care at all<br/>\nand they both need to face that. But her doing it for him, in order to<br/>\nkeep him from facing any sorrow (and ruining his afternoon fun) isn&#39;t<br/>\nresulting in anything but a continuance of frustration on her part. She&#39;s<br/>\ngetting madder and he&#39;s getting messier. <br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;I know in the nitty gritty of my heart, I&#39;m not okay with a life<br/>\nphilosophy that centers on &quot;if it&#39;s fun I&#39;m here, and if it&#39;s not, I&#39;m<br/>\ngone&quot;. &gt;&gt;<br/>\n<br/>\nYou can choose to summarize what people are saying here to mean that, but<br/>\n<br/>\nit&#39;s not fair or true.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>I wasn&#39;t speaking of people here. I was articulating to myself what I<br/>\nfelt about how far I&#39;m willing to take the pursuit of happiness.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&quot;Fun&quot; is not my god.&gt;&gt;<br/>\n<br/>\nCheating, rhetorically speaking.<br/>\nNobody said that.  You&#39;re purposefully creating a false image to knock<br/>\ndown.<br/>\nIt&#39;s called &quot;attacking a straw man.&quot;&gt;&gt;<br/>\n<br/>\nI *never* said anyone did. I was checking my priority, and also trying to<br/>\nclarify where I stand for you all who don&#39;t know me well. I would imagine<br/>\nthat for some people, in the world because I see them, that fun is<br/>\nabsolutely thier god, the thing they&#39;d do anything for. I&#39;m saying, I<br/>\nhave a personal line that I&quot;m not willing to cross.<br/>\n<br/>\n&lt;&lt;You seem to be suggesting that some one or several someones here are <br/>\nrecommending living  irresponsibly (and extravagantly?  &quot;moderately&quot; as<br/>\nopposed to <br/>\nwhat?).<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>Nope. I only know one person here. I&#39;m not suggesting anything about<br/>\nanyone here, least of all any of the kind people who have written me and<br/>\ngiven me thier time. In the above, it seemed you were saying it had to be<br/>\none way or the other. I like middle ground...I want it *all* LOL. If<br/>\nMartha Stewart was a crunchy hippie churchgoer...that&#39;s me. :-) <br/>\n<br/>\nTia in Fl<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59432230,"authorName":"joanna514","from":"&quot;joanna514&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: on playing for life","postDate":"1065225288","msgId":82030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJsbDI4OCtwdmQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1Yy4yNGZjZjMzNC4yY2FmNTlkOUBhb2wuY29tPg=="},"prevInTopic":82027,"nextInTopic":82032,"prevInTime":82029,"nextInTime":82031,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"... **Sorrow doesn t prepare people for sorrow.** Sometimes it does.  It, atleast, can take away the shock that bad things can happen. **A big store of","messageBody":"<div id=\"ygrps-yiv-1840164448\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>**Sorrow doesn&#39;t prepare people for sorrow.**<br/>\n<br/>\nSometimes it does.  It, atleast, can take away the shock that bad <br/>\nthings can happen.<br/>\n <br/>\n**A big store of happiness makes sorrow easier to bear.**<br/>\n<br/>\nAbsolutely true.<br/>\nThe more happiness there is in your life, the harder it is for sorrow <br/>\nto consume you.<br/>\n<br/>\nIn my experience,<br/>\nJoanna</div>","specialLinks":[]},{"userId":43907726,"authorName":"Tia Graham","from":"Tia Graham &lt;sixredheads@...&gt;","profile":"clarasmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065224448","msgId":82036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDAzLjIwMTEwMy4tNDM3MDAxLjExLnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":82034,"nextInTopic":82038,"prevInTime":82035,"nextInTime":82037,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1239935597\">&lt;&lt;<br/>\n&lt;&lt; One way I&#39;ve spoken<br/>\nrecently was to say, &quot;I know you don&#39;t like this, but it still has to get<br/>\ndone.&quot; I might tack on, &quot;If you&#39;d like, I&#39;ll help you and we can get it<br/>\ndone faster&quot; or &quot;maybe you&#39;d like some music on while you do that&quot;. &gt;&gt;<br/>\n<br/>\nOh!<br/>\nThat&#39;s been my best tool/method/trick (can&#39;t think of a word for it<br/>\nbecause I <br/>\nhaven&#39;t thought of it that way before&gt;&gt;<br/>\n<br/>\nThis was a relieving point. Some misconception of how I am and how I<br/>\n*actually* parent (versus my thoughts which I&#39;ve been posting about)<br/>\nseems to be coming into replies to me. I&#39;m sure on this list you get lots<br/>\nof people who put ya&#39;ll on the defensive or imply nasty things. But I did<br/>\nstate in my first post that I&#39;ve been working at this (unschooling) for a<br/>\nfew months. I also non-coercively parent, don&#39;t do chore lists, respect<br/>\nmy kids. I&#39;m relatively new to uns yes, and still sorting through some<br/>\nthought lines. But I don&#39;t parent in alot of the ways that has been<br/>\nimplied.<br/>\n<br/>\n&lt;&lt;There are lots of families <br/>\nhere with responsible teens, joyful, playful, imaginative, hepful to<br/>\nothers, who <br/>\ndon&#39;t abandon responsibilities.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m sure there are. What I&#39;m struggling with though, is that there are<br/>\nlots of people in the *world* who don&#39;t have kids like that. Sometimes<br/>\nit&#39;s obvious that it was the parenting that caused it and sometimes not.<br/>\nI&quot;m not accusing unschoolers of turning out these kids...I&#39;m asking for<br/>\nsome reassurance that unschooling can help prevent that.<br/>\n<br/>\n Tia in Fl<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065222478","msgId":82027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYS4xMGI4MDIzYS4yY2FmNWI0ZUBhb2wuY29tPg=="},"prevInTopic":82026,"nextInTopic":82030,"prevInTime":82026,"nextInTime":82028,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/3/03 3:50:26 PM, sixredheads@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-497809814\">In a message dated 10/3/03 3:50:26 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a> writes:<br/>\n<br/>\n&lt;&lt; One way I&#39;ve spoken<br/>\nrecently was to say, &quot;I know you don&#39;t like this, but it still has to get<br/>\ndone.&quot; I might tack on, &quot;If you&#39;d like, I&#39;ll help you and we can get it<br/>\ndone faster&quot; or &quot;maybe you&#39;d like some music on while you do that&quot;. &gt;&gt;<br/>\n<br/>\nOh!<br/>\nThat&#39;s been my best tool/method/trick (can&#39;t think of a word for it because I <br/>\nhaven&#39;t thought of it that way before).<br/>\n<br/>\nThere&#39;s a standing offer for me to help with anything the kids need to do.  <br/>\nSince I&#39;m always willing to help them, they very often volunteer to help me.<br/>\n<br/>\nIf I ever once force one of them to do something alone without help, I would <br/>\nbe teaching them that it&#39;s perfectly okay to refuse to help someone.  My mom <br/>\nforced me to do things while she sat around and smoked cigarettes.  To this day <br/>\nI rarely voluntarily help her.  (There are other factors, but I don&#39;t feel <br/>\nguilty if I say no, and I have helped her LOTS, and lots more than she has <br/>\nhelped me, overall.)<br/>\n<br/>\n&lt;&lt;I don&#39;t expect this mature attitude from my young kids. But is any part<br/>\nof parenting &quot;you get out what you put in&quot;? I want to raise children who<br/>\nbecome responsible adults, joyful and playful, imaginative, helpful to<br/>\nothers, who don&#39;t abandon responsibilities just because thier interest<br/>\nwanes. Shouldn&#39;t I live in a way that prepares and expects that?&gt;&gt;<br/>\n<br/>\nThat&#39;s exactly what we&#39;re recommending to you.  There are lots of families <br/>\nhere with responsible teens, joyful, playful, imaginative, hepful to others, who <br/>\ndon&#39;t abandon responsibilities.<br/>\n<br/>\nWe&#39;re trying to share with you how they became that way.  It wasn&#39;t from <br/>\nmaking them do things they didn&#39;t want to do when they were younger.  <br/>\n<br/>\n&lt;&lt;I&#39;m not<br/>\ntalking about at the expense of the relationship, or in a way that<br/>\ncommunicates disappointment or pressure. But living it, telling them why<br/>\nI live it, giving them chances to try it?&gt;&gt;<br/>\n<br/>\nThey have chances to try. <br/>\nIt seemed you were talking about being made to &quot;try&quot; (and finish).<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065222105","msgId":82026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Yy4yNGZjZjMzNC4yY2FmNTlkOUBhb2wuY29tPg=="},"prevInTopic":82022,"nextInTopic":82027,"prevInTime":82025,"nextInTime":82027,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/3/03 3:39:23 PM, sixredheads@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-273867073\">In a message dated 10/3/03 3:39:23 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a> writes:<br/>\n<br/>\n&lt;&lt; But really, right now, I&#39;m thinking I just must be a lesser woman than<br/>\nyou. Because while I love being a mom and housewife, I hate doing the<br/>\ndishes. &gt;&gt;<br/>\n<br/>\nI hate floors.  My floors are grungy, but my stove and oven are always very, <br/>\nvery clean.<br/>\n<br/>\nIf transportation were no object, I&#39;d gladly exchange oven cleaning for <br/>\nsweeping and mopping with any and everyone.<br/>\n<br/>\n&lt;&lt;That simple job takes alot of mental discipline and diligence on<br/>\nmy part...my attention wanders everywhere and it&#39;s hard to finish. I&#39;m<br/>\nalso not the only one who lives here and dirties them. &gt;&gt;<br/>\n<br/>\nBut you&#39;re the only one who is the mom.<br/>\nThere&#39;s a reality to that whether we like to admit it or not.   <br/>\n<br/>\n<br/>\n&lt;&lt; But they often have an &quot;I&#39;m here for you to serve me&quot;<br/>\nattitude.  I *am* here to care for them but I not to the exclusion of the<br/>\nrest of life, when they are capable of some of this themselves.&gt;&gt;<br/>\n<br/>\nModelling that better attitude so that they want to serve you too might work <br/>\nbetter than convincing them that you are not there to serve them.<br/>\n<br/>\n&lt;&lt;I&#39;m not willing to let this point cost me a good relationship with them, <br/>\nand will<br/>\nwait gently and patiently for them to reach a place where they are<br/>\nresponsible for thier own selves.&gt;&gt;<br/>\n<br/>\nDo you want them just to be responsible for them own selves?  Wouldn&#39;t a <br/>\nfeeling of service by doing whatever&#39;s in front of them for whoever might <br/>\ncontribute be overall better than the idea that they&#39;re responsible for their personal <br/>\nstuff/mess/selves?<br/>\n<br/>\n&lt;&lt;But you know, parts of life really suck, no matter how much I were to<br/>\nfocus on not seperating parts.&gt;&gt;<br/>\n<br/>\nI ran over a cat.<br/>\nA friend of mine died a few years ago.<br/>\nI broke my leg.<br/>\nMarty&#39;s friends stood him up one day.<br/>\n<br/>\nThose things suck.<br/>\n<br/>\n&lt;&lt;My own life has shown me over and over<br/>\nthat there are indeed times when you just have to &quot;suck it up and do it&quot;,<br/>\neven if it causes pain or inconvenience. &gt;&gt;<br/>\n<br/>\nIn such cases you have chosen to inconvenience yourself because of something <br/>\nyou want, some desire or avoidance of your own.  You&#39;ve chosen something <br/>\nbecause the alternative seemed worse to you.<br/>\n<br/>\nIf my husband were disabled I would wash him and wipe his ass.  I wouldn&#39;t <br/>\nHAVE to, but I would choose to.<br/>\n<br/>\n&lt;&lt;And sometimes the grass *isn&#39;t*<br/>\ngreener on the other side. &gt;&gt;<br/>\n<br/>\nIf you make your own life happy, the life will never be greener on the other <br/>\nside.<br/>\n<br/>\n&lt;&lt;Whether it&#39;s  scrapping poop off a cloth<br/>\ndiaper because the greater goal is to CD&gt;&gt;<br/>\n<br/>\nI don&#39;t know &quot;CD&quot; in this context, but I had three children by choice, and <br/>\nI&#39;ve used cloth diapers.  I wanted clean diapers because I loved helping make <br/>\nthe babies comfortable.  I couldn&#39;t afford to throw cloth diapers away and buy <br/>\nnew ones, because they&#39;re too expensive.   But I chose it and I could have <br/>\nworked up a big tearful whine, or I could sing and smile and be happy.<br/>\n<br/>\n&lt;&lt;But I do think they should know that there will be<br/>\ntimes of unhappiness and be prepared to meet the challenge.&gt;&gt;<br/>\n<br/>\nThey know that.<br/>\nWould you break a child&#39;s finger so he would be prepared to meet the <br/>\nchallenge of a possible (but not definite) future broken arm or leg?<br/>\n<br/>\nSorrow doesn&#39;t prepare people for sorrow.  <br/>\nA big store of happiness makes sorrow easier to bear.<br/>\n<br/>\n&lt;&lt;I know in the nitty gritty of my heart, I&#39;m not okay with a life<br/>\nphilosophy that centers on &quot;if it&#39;s fun I&#39;m here, and if it&#39;s not, I&#39;m<br/>\ngone&quot;. &gt;&gt;<br/>\n<br/>\nYou can choose to summarize what people are saying here to mean that, but <br/>\nit&#39;s not fair or true.<br/>\n<br/>\n&lt;&lt;&quot;Fun&quot; is not my god.&gt;&gt;<br/>\n<br/>\nCheating, rhetorically speaking.<br/>\nNobody said that.  You&#39;re purposefully creating a false image to knock down.<br/>\nIt&#39;s called &quot;attacking a straw man.&quot;<br/>\n<br/>\n&lt;&lt;Certainly enjoyment and fun should be a goal, but not the end-all,<br/>\nbe-all.  &gt;&gt;<br/>\n<br/>\nIf they can be a sure by-product of other goals, why would you choose against <br/>\nthat?<br/>\n<br/>\n&lt;&lt;Sometimes I light a candle and play music<br/>\nwhile I do, to make it more enjoyable. Isn&#39;t the greater lesson how to<br/>\nmake something necessary as nice as possible and still accomplish it,<br/>\nrather than avoidance because we don&#39;t prefer it?&gt;&gt;<br/>\n<br/>\nMaybe the greater lesson for your children can be not to begin with <br/>\nresentment and avoidance.  They&#39;re not living the life you lived as you grew up.  They <br/>\nwon&#39;t necessarily have your prejudices and attitudes.<br/>\n<br/>\nPeople here are trying freely and generously to help you see a way to have a <br/>\ncalmer and happier life.  <br/>\n<br/>\nKids can learn their own ways to make life more enjoyable, but if you don&#39;t <br/>\nset &quot;tasks and chores&quot; in front of them, you won&#39;t have pre-defined some things <br/>\nas probably boring, likely not nice.<br/>\n<br/>\n&lt;&lt;What could be more important?   Bedtimes and math scores?<br/>\nI don&#39;t think so.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;<br/>\n </span></blockquote>&lt;&lt;Gosh...does it have to be one or the other? &gt;&gt;<br/>\n<br/>\nSome people do have priorities that involve a lot of rules and &quot;goals.&quot;<br/>\nI live by principles and the confident knowledge that kids will learn math, <br/>\nreading, geography and all those things.<br/>\n<br/>\nBedtimes and test scores are not on my lists whatsoever.<br/>\n<br/>\n&lt;&lt;I don&#39;t want bedtimes set in stone...but I do want my kids to get enough <br/>\nsleep.&gt;&gt;<br/>\n<br/>\nMy kids get all the sleep they need because they go to sleep when they want <br/>\nto and wake up with they wake up.  If they need to get up earlier for <br/>\nsomething, they ask me to wake them up or they use alarm clocks (or both).<br/>\n<br/>\n&lt;&lt; I couldn&#39;t care two nits about math scores, but I want to know they can <br/>\nadd and subtract and get by in life. &gt;&gt;<br/>\n<br/>\nYou&#39;ll know they can add and subtract the same way you learned that they <br/>\ncould talk, walk and ride a bike.  You see them doing it.<br/>\n<br/>\n&lt;&lt;Can&#39;t my top priorities include my kid&#39;s peace and<br/>\nhappiness, spending fun times together, learn lots, help others... *and*<br/>\nlive moderately and responsibly?&gt;&gt;<br/>\n<br/>\nYou seem to be suggesting that some one or several someones here are <br/>\nrecommending living  irresponsibly (and extravagantly?  &quot;moderately&quot; as opposed to <br/>\nwhat?).<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":43907726,"authorName":"Tia Graham","from":"Tia Graham &lt;sixredheads@...&gt;","profile":"clarasmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065212038","msgId":82022,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDAzLjE2MTM1OS4tNDM3MDAxLjUuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":82019,"nextInTopic":82026,"prevInTime":82021,"nextInTime":82023,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1242302892\">&lt;Splitting your life into this is fun, and this is &quot;necessary<br/>\napplication&quot; according to your ideas of fun or not, could cause your<br/>\nchildren to see activities as chores that they otherwise might enjoy.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t divide these parts of life...I&quot;m talking about situations/needs<br/>\nthat come up that they don&#39;t want to do. I think life and personal<br/>\npreference divides them just fine on it&#39;s own. One way I&#39;ve spoken<br/>\nrecently was to say, &quot;I know you don&#39;t like this, but it still has to get<br/>\ndone.&quot; I might tack on, &quot;If you&#39;d like, I&#39;ll help you and we can get it<br/>\ndone faster&quot; or &quot;maybe you&#39;d like some music on while you do that&quot;. I<br/>\ndon&#39;t have categories on my wall of &quot;fun stuff&quot; and &quot;not fun stuff&quot; for<br/>\nthem to check off ;-).<br/>\n<br/>\n&lt;&lt;Dedication - do you mean like practicing the piano (drudgery) so you<br/>\nget<br/>\ngood enough to play well enough to enjoy it (fun)? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>No, not really. Practice can become it&#39;s own fun. So can almost any<br/>\n&quot;chore&quot; really. But it&#39;s not *always* and just being not fun doesn&#39;t<br/>\nalways eliminate the need for it to be done.<br/>\n<br/>\nI don&#39;t expect this mature attitude from my young kids. But is any part<br/>\nof parenting &quot;you get out what you put in&quot;? I want to raise children who<br/>\nbecome responsible adults, joyful and playful, imaginative, helpful to<br/>\nothers, who don&#39;t abandon responsibilities just because thier interest<br/>\nwanes. Shouldn&#39;t I live in a way that prepares and expects that? I&#39;m not<br/>\ntalking about at the expense of the relationship, or in a way that<br/>\ncommunicates disappointment or pressure. But living it, telling them why<br/>\nI live it, giving them chances to try it?<br/>\n<br/>\nI&#39;ve really seen alot of examples of adults who only do what they feel<br/>\nlike...from leaving toddlers alone for 3 weeks (in the news here in my<br/>\nneighborhood!), to not being able to feed a work crew on Saturday because<br/>\nno one wants to volunteer a casserole, to gosh...the neighbors who public<br/>\nschool &quot;to get away from thier kids for a few hours&quot;. I&#39;d so much prefer<br/>\nnot to raise that kind of child.<br/>\n<br/>\nTia in Fl<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065211200","msgId":82014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5LjNlOTZiNDk3LjJjYWYyZjQwQGFvbC5jb20+"},"prevInTopic":81985,"nextInTopic":82019,"prevInTime":82013,"nextInTime":82015,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/3/2003 4:38:05 AM Mountain Daylight Time, fetteroll@earthlink.net writes: -=-I think kids can be trained early to do things parents want","messageBody":"<div id=\"ygrps-yiv-1213229197\">In a message dated 10/3/2003 4:38:05 AM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n-=-I think kids can be trained early to do things parents want them to do. <br/>\nThey<br/>\ncan also be trained not to complain. Sometimes at puberty they then get that<br/>\nurge to set their environment right and the parents feel like they did a<br/>\ngood job training them.-=-<br/>\n<br/>\nI think there&#39;s another aspect of the urges of puberty, and that is to have a <br/>\nchange, and to be more mature.<br/>\n<br/>\nIf a child has been forced to &quot;do chores&quot; simply because he&#39;s a child, he <br/>\nwill look forward to the time when he doesn&#39;t have to do that because it&#39;s kid&#39;s <br/>\nwork.  When puberty comes he will rebell.<br/>\n<br/>\nIf work is treated like something adults do because they want to, when <br/>\npuberty comes and the child is stretching toward what  more-adult thing he might do <br/>\nto show he&#39;s growing up, maybe doing housework can come under his new stretch.<br/>\n<br/>\nIt&#39;s working that way here.  Holly wanted to mop the floor with no help, and <br/>\nnot even a witness.  So I went to bed, but I bragged her up in the morning.<br/>\n<br/>\nKirby has had his license for nine days (I&#39;ll stop counting soon, honest).  <br/>\nLast night he took the car to the gaming shop after dinner.  He called after a <br/>\nwhile to say he wanted to go to someone&#39;s house and then to his friend Will&#39;s, <br/>\nwhere he often spends Thursday nights.  I said fine but said Holly wanted to <br/>\ngo shopping 11:00 Friday morning, so please be back by then.<br/>\n<br/>\nHe came back around midnight.<br/>\n<br/>\nAt noon, he said he wanted to go to the gaming store, and would be back at <br/>\n4:00.<br/>\n<br/>\nAt 1:30 he came home with a friend, to find some more cards, and right now <br/>\nthey&#39;re eating in the kitchen and telling stories.<br/>\n<br/>\nBecause  he had a lot of freedom before he could drive, he wasn&#39;t wound up <br/>\nlike a rubber band that had been twisting and twisting waiting for freedom.  <br/>\nHe&#39;s relaxed, and likes to be home.<br/>\n<br/>\nThe current issue of Gentleman&#39;s Quarterly, I learned on Wayne Brady the <br/>\nother day, has an article on &quot;The Rock,&quot; so I bought a copy for Marty when I took <br/>\nHolly on her shopping outing this morning.  It also has Jack Black and Conan <br/>\nO&#39;Brien, two other guys Marty really likes.<br/>\n<br/>\nI was sitting in Keith&#39;s office this morning reading it, when Kirby came back <br/>\nto find me.  He said &quot;Don&#39;t read that, come listen to these songs I <br/>\ndownloaded!&quot;   So I followed him back to his room (a long way) and we sat and listened <br/>\nto songs.<br/>\n<br/>\nI could have spoiled the moment by complaining about the state of his room, <br/>\nor by stopping to make him help me fold his laundry on the way through the den, <br/>\nbut he had walked a long way to find me, and I just followed him back.<br/>\n<br/>\nMy point is that they have freedom and they&#39;re soft and glad to be home and <br/>\nto hang around with us.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":43907726,"authorName":"Tia Graham","from":"Tia Graham &lt;sixredheads@...&gt;","profile":"clarasmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065211144","msgId":82019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDAzLjE2MTM1OS4tNDM3MDAxLjQuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":82014,"nextInTopic":82022,"prevInTime":82018,"nextInTime":82020,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"Did you choose to run a household ?  Do you do it to someone else s specifications or your own? I don t do chores.  A chore is a boring irritating thing","messageBody":"<div id=\"ygrps-yiv-385574852\">Did you choose to &quot;run a household&quot;?  Do you do it to someone else&#39;s <br/>\nspecifications or your own?<br/>\n<br/>\nI don&#39;t &quot;do chores.&quot;  A chore is a boring irritating thing someone else<br/>\nmakes <br/>\nyou do.  That&#39;s what the word means.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Yes of course I chose it. And I do it mostly to my own specs, though I<br/>\nsometimes do things dh&#39;s way because I love him. I have what I&#39;d consider<br/>\nto be a pretty good attitude about it all too...obviously there are parts<br/>\nof it that I love more than others. This is *my* dream and I support my<br/>\nown dream. I don&#39;t do chore lists or force anyone to help me with my<br/>\nstuff. The kids help as they want to but they are not expected to nor<br/>\nrequired to.<br/>\n<br/>\nBut really, right now, I&#39;m thinking I just must be a lesser woman than<br/>\nyou. Because while I love being a mom and housewife, I hate doing the<br/>\ndishes. That simple job takes alot of mental discipline and diligence on<br/>\nmy part...my attention wanders everywhere and it&#39;s hard to finish. I&#39;m<br/>\nalso not the only one who lives here and dirties them. Dh is wonderful in<br/>\nthat he supports an &quot;I made the mess, I&#39;ll clean the mess&quot; attitude. The<br/>\nkids pick up on it and do things automatically, like clear thier own<br/>\nplace at the table. But they often have an &quot;I&#39;m here for you to serve me&quot;<br/>\nattitude.  I *am* here to care for them but I not to the exclusion of the<br/>\nrest of life, when they are capable of some of this themselves. I&#39;m not<br/>\nwilling to let this point cost me a good relationship with them, and will<br/>\nwait gently and patiently for them to reach a place where they are<br/>\nresponsible for thier own selves.<br/>\n<br/>\nBut you know, parts of life really suck, no matter how much I were to<br/>\nfocus on not seperating parts. My own life has shown me over and over<br/>\nthat there are indeed times when you just have to &quot;suck it up and do it&quot;,<br/>\neven if it causes pain or inconvenience.  And sometimes the grass *isn&#39;t*<br/>\ngreener on the other side. Whether it&#39;s  scrapping poop off a cloth<br/>\ndiaper because the greater goal is to CD or sitting for endless hours in<br/>\na child&#39;s hosptial room, there are times it has to be done. And not<br/>\neveryone lives that way...there&#39;s a disposable market for those who don&#39;t<br/>\nwant to go through the messier parts of cloth diapering and I&#39;ve seen<br/>\nparents drop thier kids off for open heart surgery and go on a cruise<br/>\nbecause &quot;it&#39;s too hard to watch her go through that&quot;. <br/>\n<br/>\n&lt;&lt;Some people think children should practice not having fun so they&#39;ll<br/>\nprepared <br/>\nfor unhappiness.  Some people think children should get up at daybreak<br/>\nevery <br/>\nday so if they have an early morning job someday they&#39;ll be prepared. <br/>\nSome <br/>\npeople think children should go to school and suffer harrassment and<br/>\ntorture so <br/>\nthey&#39;ll be prepared for irritating bosses, co-workers and neighbors when<br/>\nthey <br/>\ngrow up.<br/>\n..<br/>\n<br/>\nWell, that&#39;s not me. But I do think they should know that there will be<br/>\ntimes of unhappiness and be prepared to meet the challenge. Wouldn&#39;t that<br/>\nsometimes mean doing something they don&#39;t like very much, because it<br/>\nneeds to be done, before going out to play?<br/>\n<br/>\nI know in the nitty gritty of my heart, I&#39;m not okay with a life<br/>\nphilosophy that centers on &quot;if it&#39;s fun I&#39;m here, and if it&#39;s not, I&#39;m<br/>\ngone&quot;. Certainly enjoyment and fun should be a goal, but not the end-all,<br/>\nbe-all. &quot;Fun&quot; is not my god. <br/>\n<br/>\nIt&#39;s great to come along side someone struggling and make it easier, more<br/>\nenjoyable. &quot;Many hands make for light work&quot; and all that. But to just not<br/>\ndo the thing at all because no one enjoys it? I hate dishes and so does<br/>\neveryone in my house. But we have a responsiblity to the planet not to<br/>\nover use paper products. Polluting the place for so many others isnt&#39;<br/>\njustifiyable just because &quot;I don&#39;t like that job&quot;. Right now, as the mom<br/>\nof small kids, I just do it. Sometimes I light a candle and play music<br/>\nwhile I do, to make it more enjoyable. Isn&#39;t the greater lesson how to<br/>\nmake something necessary as nice as possible and still accomplish it,<br/>\nrather than avoidance because we don&#39;t prefer it?<br/>\n<br/>\n&lt;&lt;Lots of other adults might say I don&#39;t have healthy priorities since<br/>\nsome of <br/>\nmy top items are the children&#39;s peace and happiness, having some happy <br/>\nsurprises in our lives, watching lots of movies, helping other people<br/>\nunschool, <br/>\nlistening to lots of music.  Yet my kids are learning lots, and my<br/>\nhusband and I <br/>\nare getting along well.<br/>\n<br/>\nWhat could be more important?   Bedtimes and math scores?<br/>\nI don&#39;t think so.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Gosh...does it have to be one or the other? I don&#39;t want bedtimes set in<br/>\nstone...but I do want my kids to get enough sleep. I couldn&#39;t care two<br/>\nnits about math scores, but I want to know they can add and subtract and<br/>\nget by in life. Can&#39;t my top priorities include my kid&#39;s peace and<br/>\nhappiness, spending fun times together, learn lots, help others... *and*<br/>\nlive moderately and responsibly?<br/>\n<br/>\nTia in Fl<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065177687","msgId":81985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQTJDQTk3LjFGMkZEJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDMxMDAyLjE3MTUyMy4tNDM3MDAxLjE2LnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":81982,"nextInTopic":82014,"prevInTime":81984,"nextInTime":81986,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"... At 11 my daughter Kat began voluntarily helping me to do things like bring in the groceries and put them away. A couple of times she noticed the bathroom","messageBody":"<div id=\"ygrps-yiv-1698368005\">on 10/2/03 5:15 PM, Tia Graham at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess when I<br/>\n&gt; said &quot;grow up&quot; about my kids that I was wondering when in thier lives I<br/>\n&gt; would begin to see that tendancy in them to understand that part of our<br/>\n&gt; lives is &quot;necessarry application&quot; and other is fun and discovery.<br/>\n<br/>\n </span></blockquote>At 11 my daughter Kat began voluntarily helping me to do things like bring<br/>\nin the groceries and put them away. A couple of times she noticed the<br/>\nbathroom sink was dirty and cleaned it and then asked what I thought of the<br/>\njob she did to make sure I&#39;d noticed she&#39;d done it. :-) She&#39;s 12 now and has<br/>\nseen the cat litter on the floor of the bathroom a number of times and has<br/>\ncleaned it up without even mentioning she did it.<br/>\n<br/>\nShe&#39;s doing these things not because she sees the necessity but because she<br/>\nwants to. There&#39;s a part of her world that affects her sensibilities of<br/>\nrightness and she recognizes she has the ability to right it to her<br/>\nstandards. It&#39;s part of changing body chemistry and it changes the way<br/>\nhumans see their world.<br/>\n<br/>\nAs she was growing up I&#39;ve done both demanding she help -- when company is<br/>\ncoming and I&#39;m in a tizzy -- and I&#39;ve asked if she&#39;d like to help. Asking<br/>\nworks much better! ;-)<br/>\n<br/>\nDemanding gets more work but it creates a negative relationship. I realized<br/>\nthat getting grumpy and making her cry was too great a price to pay for<br/>\nsomething that not only wouldn&#39;t make a difference in 10 years but, in fact,<br/>\nI was making her upset for a mess that would very likely return tomorrow.<br/>\n<br/>\nWhen Kat was younger, housework was well beyond her. Even low key things<br/>\nlike folding kitchen towels or sorting socks or underwear, she had no<br/>\ninterest in. Given the choice of helping so it goes faster or waiting for me<br/>\nto finish, she always chose waiting (impatiently). So asking didn&#39;t get me<br/>\nmuch help, but when she did want to do something, like the stirring and<br/>\npouring parts of cooking, the time was spent happily together.<br/>\n<br/>\nMy mother was made to do chores as a kid and she decided she&#39;d never do that<br/>\nto her kids. And she didn&#39;t. She did all the work. She also assumed that at<br/>\nsome point we&#39;d help out. But we didn&#39;t. And I think it was because she<br/>\nnever invited us along to help. And then it was puzzling to us as teens why<br/>\nshe&#39;d be upset that we weren&#39;t helping when she&#39;d been doing the work all by<br/>\nherself all along. She and school kept us living separate lives. It was a<br/>\nfine family life and childhood, sort of a Leave it to Beaver/Father Knows<br/>\nBest etc. type of structure to the family, but lacking the connections I now<br/>\nrealize could have been there.<br/>\n<br/>\nI think kids can be trained early to do things parents want them to do. They<br/>\ncan also be trained not to complain. Sometimes at puberty they then get that<br/>\nurge to set their environment right and the parents feel like they did a<br/>\ngood job training them. But sometimes at puberty they realize they have the<br/>\npower to demand that they not be pushed around anymore and they suddenly<br/>\nseem to turn into &quot;bad kids&quot; when the parents felt they were doing<br/>\neverything right all along.<br/>\n<br/>\nSo bottom line is to shift your point of view to recognizing that the house<br/>\nand the decisions about how it&#39;s maintained are yours. Recognize that you<br/>\nhave a choice about how it&#39;s kept. No one makes you clean to a certain<br/>\nstandard. Give yourself permission not to do things. It helps a great deal<br/>\nwhen you shift your perspective from having to do the dishes to doing them<br/>\nbecause you would like to have some clean plates.<br/>\n<br/>\nAnd then, invite the kids along to help. Create an atmosphere that they&#39;d<br/>\nlike to join in. (Hint: being a grump because company&#39;s coming in 2 hours<br/>\nand the house is a disaster is not a good way ;-) Rather than seeing the<br/>\ninvite as soliciting help with something burdensome, see the invite as an<br/>\nopportunity to spend time with you and the work is incidental. You can even<br/>\njust ask if they&#39;d like to do something in the same room with you while you<br/>\ndo work on something or bring the work to them, like folding laundry, so you<br/>\ncan be in the same room they&#39;re playing in.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] on playing for life","postDate":"1065159963","msgId":81982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDUwMWMzODk3MSRhNjBlNzE2MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDFlZS4xMGJmNzliZi4yY2FlM2E4NEBhb2wuY29tPg=="},"prevInTopic":81979,"nextInTopic":81985,"prevInTime":81981,"nextInTime":81983,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1842736571\">&lt;&lt;That &quot;practice&quot; is a chore and drudgery is another part of that whole <br/>\nwork-ethic guilt-trip mythos which has smothered the joy out of several<br/>\ngenerations <br/>\nof people.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI wasn&#39;t writing clearly enough for my irony to come through when I gave<br/>\na musical example. I completely agree with the above. Another example is<br/>\ntyping. I got really fast without even realizing it when I was typing my<br/>\nscript up the first time - as compared to the much lower top speed I was<br/>\nable to reach in typing school typing &quot;exercises&quot;.<br/>\n<br/>\nOne of the things being on this list does is make the questioning of<br/>\n&quot;conventional wisdom&quot; absolutely habitual. Sometimes it still holds<br/>\ntrue.can&#39;t think of an example off the top of my head.often it is<br/>\nrevealed as wrong for us.<br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065149246","msgId":81979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOWYwMWMzODk1OCRhZTUxZjU0MCQ2NTAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PDFlZS4xMGJmNzliZi4yY2FlM2E4NEBhb2wuY29tPg=="},"prevInTopic":81970,"nextInTopic":81982,"prevInTime":81978,"nextInTime":81980,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"For a little while recently I was taking lessons to play the fiddle  (I had to stop because pregnancy gave me carpal tunnel so badly I couldn t feel my hands","messageBody":"<div id=\"ygrps-yiv-65645315\">For a little while recently I was taking lessons to play the fiddle  (I had to stop because pregnancy gave me carpal tunnel so badly I couldn&#39;t feel my hands -- I&#39;m nearly recovered and hope to start lessons again soon).  I couldn&#39;t WAIT to practice the fiddle.  In a perfect world i would have practiced the fiddle nearly every hour of the day.  Music practice can be such a clear and easy way to get a near-nirvanic &quot;flow&quot; experience -- it is drudgery, IMO, only if someone else is controlling your musical goals.<br/>\n<br/>\n-Cat <br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Thursday, October 02, 2003 10:35 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] on playing for life<br/>\n<br/>\n<br/>\n<br/>\n  In a message dated 10/2/03 6:02:14 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n  &lt;&lt; Dedication - do you mean like practicing the piano (drudgery) so you get<br/>\n  good enough to play well enough to enjoy it (fun)?  &gt;&gt;<br/>\n<br/>\n  But you can play it for fun and still get better.<br/>\n  That &quot;practice&quot; is a chore and drudgery is another part of that whole <br/>\n  work-ethic guilt-trip mythos which has smothered the joy out of several generations <br/>\n  of people.<br/>\n<br/>\n  Sandra<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  To unsubscribe from this send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065148548","msgId":81970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlZS4xMGJmNzliZi4yY2FlM2E4NEBhb2wuY29tPg=="},"prevInTopic":81969,"nextInTopic":81979,"prevInTime":81969,"nextInTime":81971,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/2/03 6:02:14 PM, dezigna@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-1215594540\">In a message dated 10/2/03 6:02:14 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n&lt;&lt; Dedication - do you mean like practicing the piano (drudgery) so you get<br/>\ngood enough to play well enough to enjoy it (fun)?  &gt;&gt;<br/>\n<br/>\nBut you can play it for fun and still get better.<br/>\nThat &quot;practice&quot; is a chore and drudgery is another part of that whole <br/>\nwork-ethic guilt-trip mythos which has smothered the joy out of several generations <br/>\nof people.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065148185","msgId":81969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkOS4xMWJlOWJjOC4yY2FlMzkxOUBhb2wuY29tPg=="},"prevInTopic":81961,"nextInTopic":81970,"prevInTime":81968,"nextInTime":81970,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/2/03 3:25:18 PM, sixredheads@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-701773134\">In a message dated 10/2/03 3:25:18 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a> writes:<br/>\n<br/>\n&lt;&lt; But are you guys saying, that because you spend *some* of your time<br/>\nplaying, you don&#39;t consider work...work? What about running a household?<br/>\nDishes? Chores? Check books and other necessary evils?  &gt;&gt;<br/>\n<br/>\nMy husband does the checkbook because he likes to.<br/>\nI know people who don&#39;t &quot;do&quot; checkbooks.  They go back and forth between <br/>\naccounts and when they get confused, they switch until the other settles.<br/>\n<br/>\nDid you choose to &quot;run a household&quot;?  Do you do it to someone else&#39;s <br/>\nspecifications or your own?<br/>\n<br/>\nI don&#39;t &quot;do chores.&quot;  A chore is a boring irritating thing someone else makes <br/>\nyou do.  That&#39;s what the word means.<br/>\n<br/>\nI wash the dishes because I LIKE my dishes, and I need to use them again.  <br/>\nAnd I don&#39;t have a nice set of hand-painted Italian stuff or anything cool.  I <br/>\nhave thrift store things, some matching, but only from repeated searches.  I <br/>\nhave some plastic margarine containers from the 70&#39;s we bought at a Lion&#39;s Club <br/>\nfundraising sale.   But the kids really like them, and Holly and I were <br/>\ntalking just last night about how they fit in around other dishes on the top rack no <br/>\nmatter how many other dishes are in there, because of the shape of these <br/>\nbowls, they always fit.<br/>\n<br/>\nNobody makes me do the dishes.  Sometimes I load the dishwasher at night, <br/>\nsometimes first thing in the morning.  Today while I was making tea I scrubbed a <br/>\ngrill and a baking sheet that&#39;ve been waiting for hand washing.   I have some <br/>\npans I&#39;ve had for 30 years.  I really like them, too, and I don&#39;t let gunk <br/>\ngrow on them.  I just scrub them every single time.<br/>\n<br/>\nI don&#39;t need to do those &quot;chores.&quot;  They&#39;re more like personal interests.  <br/>\nTaking care of my collection.  I could just let them go grungy and get more when <br/>\nthey were too far gone.<br/>\n<br/>\nThe reason I&#39;m rambling on here is that a simple answer doesn&#39;t describe the <br/>\ndifference in the mindset of choosing to take care of my family and choosing <br/>\nwhat things to do and what to let go.<br/>\n<br/>\nI worked on some curtains today.   Then my husband asked me to go with him to <br/>\nget something we need for a sick tree.  So I jumped up and left.  The <br/>\ncurtains haven&#39;t been touched since.  We need them because we moved the TV and it <br/>\ngets glare now.  They&#39;ll get done, and people will say &quot;cool!&quot; even though it <br/>\nwill have been nearly a week (or more) since we bought the cloth and curtain rod <br/>\nby the time I get them up there.<br/>\n<br/>\nKeith and Holly and I bought the rod together, after looking at all the <br/>\nexpensive drapery stuff, and we picked out cloth together, and got it cheap.  We <br/>\nhad to look for something heavy that would match a room with fireplace bricks of <br/>\ngrey and black, and wall paper that&#39;s tan/brown/blue.  But we did it!  Shades <br/>\nof brown with blue swirlies in there.<br/>\n<br/>\nEvery part of all those stories involved interaction with kids, discussions, <br/>\nservice to my family, personal enjoyment.   I could work up a martyrly and <br/>\nresentful attitude about all this, or I can be happy.  We could have stayed in <br/>\nour old house with very small payments, but we&#39;re in a big house.  When I get w<br/>\nhiney about how far the vacuum cleaner is from where I need to use it, I just <br/>\nremind myself how happy I am to have a house big enough for everyone to spread <br/>\nout and have privacy.   <br/>\n<br/>\nMy whole life hasn&#39;t been uniformly happy, and I&#39;m not happy every moment <br/>\nnow, but one of my priorities is to maintain a light and loving mood in my <br/>\nfamily, as well as I can.  I used to do it for the kids&#39; benefit, but it ended up <br/>\nbenefiting me and my husband too.<br/>\n<br/>\nLuckily for us, he LIKES to do things like taxes and bank accounts.  <br/>\nLuckily for him, I like social stuff and if we&#39;re invited to a potluck 120 <br/>\nmiles away (10/12 &lt;g&gt;) I can get it together to make sure the kids don&#39;t <br/>\ndouble-book, that we have a gift and food ready to take, and that we have the map and <br/>\nphone number.<br/>\n<br/>\nTeamwork!<br/>\n<br/>\n&lt;&lt;I guess when I<br/>\nsaid &quot;grow up&quot; about my kids that I was wondering when in thier lives I<br/>\nwould begin to see that tendancy in them to understand that part of our<br/>\nlives is &quot;necessarry application&quot; and other is fun and discovery.&gt;&gt;<br/>\n<br/>\nLive are unnaturally and unnecessarily divided into parts.  There&#39;s no reason <br/>\nnot to have fun doing what&#39;s necessary.<br/>\n<br/>\n&lt;&lt;Even if<br/>\nwe end up in jobs we love, all of life is not fun and games.&gt;&gt;<br/>\n<br/>\nSome people think children should practice not having fun so they&#39;ll prepared <br/>\nfor unhappiness.  Some people think children should get up at daybreak every <br/>\nday so if they have an early morning job someday they&#39;ll be prepared.  Some <br/>\npeople think children should go to school and suffer harrassment and torture so <br/>\nthey&#39;ll be prepared for irritating bosses, co-workers and neighbors when they <br/>\ngrow up.<br/>\n<br/>\n&lt;&lt;And those<br/>\ntimes that it&#39;s not doesn&#39;t have to be miserable drudgery but it does<br/>\ntake a willingness and dedication right?&gt;&gt;<br/>\n<br/>\nKirby has had a job for three years and some.  Sometimes he doesn&#39;t want to <br/>\ngo, but he does go.  He teaches karate usually once a week, but for a while <br/>\nhere it will be twice a week.  Sometimes he&#39;d rather not, but he does it because <br/>\nhe agreed to and people will be showing up there and he needs to be there too. <br/>\n  We didn&#39;t make him do either of those things.  We help him.  We remind him <br/>\nand transport him (he got a license last week, though).  We pay his karate <br/>\ndues and buy him new equipment.   He doesn&#39;t do it ALL by himself, but he made <br/>\nchoices at the tender ages of 14 and 15 which he still honors.<br/>\n<br/>\nIf it were NOT fun or if it were unacceptable to him morally or however, he <br/>\ncould quit.<br/>\n<br/>\n&lt;&lt;So, is there any time in a child&#39;s life when one can expect to see a<br/>\npleasant/contented/willing understanding that parts of the day are for<br/>\nwork and other parts are for play? &gt;&gt;<br/>\n<br/>\nSure, but what&#39;s worth much more is the time in an unschooling mom&#39;s life <br/>\nwhen she stops looking to divide the day into parts.<br/>\n<br/>\n&lt;&lt;So far modeling is as far as I go. But I&quot;d honestly like to raise<br/>\nchildren who have healthy priorities. Will that happen with *just*<br/>\nmodeling?&gt;&gt;<br/>\n<br/>\nDiscussion?  Examples?  Stories of our real lives and other people&#39;s?<br/>\n<br/>\nMy kids seem to have healthy priorities.<br/>\n<br/>\nLots of other adults might say I don&#39;t have healthy priorities since some of <br/>\nmy top items are the children&#39;s peace and happiness, having some happy <br/>\nsurprises in our lives, watching lots of movies, helping other people unschool, <br/>\nlistening to lots of music.  Yet my kids are learning lots, and my husband and I <br/>\nare getting along well.<br/>\n<br/>\nWhat could be more important?   Bedtimes and math scores?<br/>\nI don&#39;t think so.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":43907726,"authorName":"Tia Graham","from":"Tia Graham &lt;sixredheads@...&gt;","profile":"clarasmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065137602","msgId":81960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDAyLjE5MzMyMy4tNDM3MDAxLjI0LnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":81956,"nextInTopic":81961,"prevInTime":81959,"nextInTime":81961,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"I highly recommend The Unprocessed Child by Valerie Fitzenreiter.   Thanks for the tip! I ll look for it. Tia in Fl [Non-text portions of this message have","messageBody":"<div id=\"ygrps-yiv-1164896268\">I highly recommend &quot;The Unprocessed Child&quot; by Valerie Fitzenreiter.  &gt;&gt;<br/>\n<br/>\nThanks for the tip! I&#39;ll look for it. Tia in Fl<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] on playing for life","postDate":"1065135377","msgId":81961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzODkzOCQ2M2ZjNTE0MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDIwMDMxMDAyLjE3MTUyMy4tNDM3MDAxLjE2LnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":81960,"nextInTopic":81969,"prevInTime":81960,"nextInTime":81962,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-651377602\">&lt;&lt;But are you guys saying, that because you spend *some* of your time<br/>\nplaying, you don&#39;t consider work...work? What about running a household?<br/>\nDishes? Chores? Check books and other necessary evils? I guess when I<br/>\nsaid &quot;grow up&quot; about my kids that I was wondering when in thier lives I<br/>\nwould begin to see that tendancy in them to understand that part of our<br/>\nlives is &quot;necessarry application&quot; and other is fun and discovery. Even<br/>\nif<br/>\nwe end up in jobs we love, all of life is not fun and games. And those<br/>\ntimes that it&#39;s not doesn&#39;t have to be miserable drudgery but it does<br/>\ntake a willingness and dedication right?&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI used to be in work I loved so much I often did it for free, despite<br/>\nthe dreary parts that attended that work, and the physical exhaustion<br/>\nthat was often part of it. I found something even better - being a<br/>\nparent. Early in pregnancy I read an article or a book about changing<br/>\ndiapers - how you could see it as a horrible smelly chore, or as a<br/>\nrepeated opportunity to connect deeply with your little baby. Fly Lady<br/>\ntalks about willingly and lovingly &quot;blessing&quot; your home with your<br/>\nattention to cleaning. Attitude changes everything, including whether<br/>\nsomething is fun.<br/>\n<br/>\nDedication - do you mean like practicing the piano (drudgery) so you get<br/>\ngood enough to play well enough to enjoy it (fun)? <br/>\n<br/>\nSome people enjoy balancing checkbooks - it gives them satisfaction and<br/>\na sense of control and balance in their life.<br/>\n<br/>\nSplitting your life into this is fun, and this is &quot;necessary<br/>\napplication&quot; according to your ideas of fun or not, could cause your<br/>\nchildren to see activities as chores that they otherwise might enjoy.<br/>\nJayn can&#39;t get enough of cleaning hard surfaces and swiffering the<br/>\nkitchen floor.<br/>\n<br/>\n<br/>\n&lt;&lt;So, is there any time in a child&#39;s life when one can expect to see a<br/>\npleasant/contented/willing understanding that parts of the day are for<br/>\nwork and other parts are for play?&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI hope not for Jayn&#39;s sake. I hope there is always a fluid mixing and<br/>\noverlapping - just like marbleizing. Where does the sky cease to be blue<br/>\nand be absolutely pink during the sunset? Not a line just a color wash.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Are there ways to encourage responsibility and a joyful dedication to<br/>\ngetting those things done that we don&#39;t always prefer that don&#39;t<br/>\ncommunicate &quot;life isn&#39;t about playtime&quot;? &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nThere is so much about chores and helping out in the archives. I say<br/>\nmake a game of as much as possible, so that you are having fun too, and<br/>\ndon&#39;t look at your kids with envy because they are free from<br/>\nresponsibility. Sometimes I get mad at my husband because he does<br/>\nnothing but his play all day long, and I have to do the cleaning. When I<br/>\nstart feeling resentful, unless for some diabolical PMS type reason of<br/>\nmy own I think I prefer to stew for a while, I ask him to help by being<br/>\nvery specific about the actual task I would like him to do. He is<br/>\nmodeling helpfulness just as much as I am modeling joy and caring and<br/>\nasking for help when needed. Jayn gets upset if she is left out of the<br/>\nhelping activity. (I have learned it is useless for me to expect him to<br/>\noffer to do something or notice that I need help without my asking for<br/>\nit - my disappointed expectations are the cause of my resentments, not<br/>\nwhat he failed to do)<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Is there a way to thow out the bathwater without tossing the<br/>\nbaby?&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI have an image of making a small hole in the bottom of the tub and<br/>\nletting the water leak out, but I don&#39;t know what it means.<br/>\n<br/>\n&lt;&lt;So far modeling is as far as I go. But I&quot;d honestly like to raise<br/>\nchildren who have healthy priorities. Will that happen with *just*<br/>\nmodeling?&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI&#39;m betting my child&#39;s whole life and future that the answer is yes,<br/>\nalthough I also believe that her own experiences will lead her to have<br/>\npriorities that are healthy for her.<br/>\n<br/>\nWhat would be the alternatives to modeling? Talking (lecturing) without<br/>\ndoing is futile. Pointing out her mistakes to her is cruel and<br/>\nunnecessary, although being human I still sometimes make that mistake -<br/>\nless than I used to. The only other alternatives I can think of are all<br/>\nthe old things that we have renounced - chore lists, expectations,<br/>\ninsisting on things, &quot;consequences&quot;, guilting them (sure never worked<br/>\nwith my husband!)<br/>\n<br/>\nAre there alternatives to modeling that would be compatible with this<br/>\nUnschooling life of freedom and family trust? I can&#39;t think of any, but<br/>\nthat doesn&#39;t mean there aren&#39;t any. <br/>\n<br/>\nRobyn Coburn<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":65837075,"authorName":"Shannon","from":"&quot;Shannon&quot; &lt;davenshan@...&gt;","profile":"shan_who","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] on playing for life","postDate":"1065133929","msgId":81956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhFRUVKSFBHQ0tQRkdQTUVMTk9ETUVCSERPQUEuZGF2ZW5zaGFuQG1pbmRzcHJpbmcuY29tPg==","inReplyToHeader":"PDIwMDMxMDAyLjE3MTUyMy4tNDM3MDAxLjE2LnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":81949,"nextInTopic":81960,"prevInTime":81955,"nextInTime":81957,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"I highly recommend The Unprocessed Child by Valerie Fitzenreiter.  She explains the things you are concerned about very well. Shan ... From: Tia Graham","messageBody":"<div id=\"ygrps-yiv-226401049\">I highly recommend &quot;The Unprocessed Child&quot; by Valerie Fitzenreiter.  She<br/>\nexplains the things you are concerned about very well.<br/>\n<br/>\nShan<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Tia Graham [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a>]<br/>\nSent: Thursday, October 02, 2003 2:15 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: [UnschoolingDiscussion] on playing for life<br/>\n<br/>\nLove these stories of adults &quot;playing&quot; and doing things they love for<br/>\nlivlihood. I come from parents who are self-employed artisans, both of<br/>\nwhom play for a living LOL. Keeping the spark alive is definately one of<br/>\nthe top reasons why I rejected traditional schooling.<br/>\n<br/>\nBut are you guys saying, that because you spend *some* of your time<br/>\nplaying, you don&#39;t consider work...work? What about running a household?<br/>\nDishes? Chores? Check books and other necessary evils? I guess when I<br/>\nsaid &quot;grow up&quot; about my kids that I was wondering when in thier lives I<br/>\nwould begin to see that tendancy in them to understand that part of our<br/>\nlives is &quot;necessarry application&quot; and other is fun and discovery. Even if<br/>\nwe end up in jobs we love, all of life is not fun and games. And those<br/>\ntimes that it&#39;s not doesn&#39;t have to be miserable drudgery but it does<br/>\ntake a willingness and dedication right?<br/>\n<br/>\nSo, is there any time in a child&#39;s life when one can expect to see a<br/>\npleasant/contented/willing understanding that parts of the day are for<br/>\nwork and other parts are for play? Are there ways to encourage<br/>\nresponsiblity and a joyful dedication to getting those things done that<br/>\nwe don&#39;t always prefer that don&#39;t communicate &quot;life isn&#39;t about<br/>\nplaytime&quot;? Is there a way to thow out the bathwater without tossing the<br/>\nbaby?<br/>\n<br/>\nSo far modeling is as far as I go. But I&quot;d honestly like to raise<br/>\nchildren who have healthy priorities. Will that happen with *just*<br/>\nmodeling?<br/>\n<br/>\nTia<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\nADVERTISEMENT<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=256694.4002236.5216697.1261774/D=egroupweb/S=17050819\">http://rd.yahoo.com/M=256694.4002236.5216697.1261774/D=egroupweb/S=17050819</a><br/>\n72:HM/A=1784493/R=0/id=noscript/SIG=11q7p9e7k/*<a rel=\"nofollow\" target=\"_blank\" href=\"http://webevents.yahoo.com/un\">http://webevents.yahoo.com/un</a><br/>\niversal/intolerablecruelty/&gt;<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt; .<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":43907726,"authorName":"Tia Graham","from":"Tia Graham &lt;sixredheads@...&gt;","profile":"clarasmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] on playing for life","postDate":"1065129322","msgId":81949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDAyLjE3MTUyMy4tNDM3MDAxLjE2LnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":0,"nextInTopic":81956,"prevInTime":81948,"nextInTime":81950,"topicId":81949,"numMessagesInTopic":0,"msgSnippet":"Love these stories of adults playing and doing things they love for livlihood. I come from parents who are self-employed artisans, both of whom play for a","messageBody":"<div id=\"ygrps-yiv-1655747867\">Love these stories of adults &quot;playing&quot; and doing things they love for<br/>\nlivlihood. I come from parents who are self-employed artisans, both of<br/>\nwhom play for a living LOL. Keeping the spark alive is definately one of<br/>\nthe top reasons why I rejected traditional schooling. <br/>\n<br/>\nBut are you guys saying, that because you spend *some* of your time<br/>\nplaying, you don&#39;t consider work...work? What about running a household?<br/>\nDishes? Chores? Check books and other necessary evils? I guess when I<br/>\nsaid &quot;grow up&quot; about my kids that I was wondering when in thier lives I<br/>\nwould begin to see that tendancy in them to understand that part of our<br/>\nlives is &quot;necessarry application&quot; and other is fun and discovery. Even if<br/>\nwe end up in jobs we love, all of life is not fun and games. And those<br/>\ntimes that it&#39;s not doesn&#39;t have to be miserable drudgery but it does<br/>\ntake a willingness and dedication right?<br/>\n<br/>\nSo, is there any time in a child&#39;s life when one can expect to see a<br/>\npleasant/contented/willing understanding that parts of the day are for<br/>\nwork and other parts are for play? Are there ways to encourage<br/>\nresponsiblity and a joyful dedication to getting those things done that<br/>\nwe don&#39;t always prefer that don&#39;t communicate &quot;life isn&#39;t about<br/>\nplaytime&quot;? Is there a way to thow out the bathwater without tossing the<br/>\nbaby?<br/>\n<br/>\nSo far modeling is as far as I go. But I&quot;d honestly like to raise<br/>\nchildren who have healthy priorities. Will that happen with *just*<br/>\nmodeling?<br/>\n<br/>\nTia</div>","specialLinks":[]}],"prevTopicId":83247,"nextTopicId":83315}}