{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"advertising humor and geography/history trivia","postDate":"1120748146","msgId":107170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Zi4zNzMzOGYyNy4yZmZlOWM3MkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":107169,"nextInTime":107171,"topicId":107170,"numMessagesInTopic":0,"msgSnippet":"This is long and not very important.   If you don t read it that s fine.   If you respond, PLEASE don t quote the whole thing.   I would wait and tell you ","messageBody":"<div id=\"ygrps-yiv-1806610602\">This is long and not very important.   If you don&#39;t read it that&#39;s fine.   If <br/>\nyou respond, PLEASE don&#39;t quote the whole thing.   I would wait and tell you <br/>\nlater, but I&#39;d surely forget, because it&#39;s not pressing.<br/>\n<br/>\n<br/>\nIn todays word-a-day e-mail one of their sponsors had a little poem as <br/>\nadvertisement, and I liked it.   Kind of an advertising jingle by e-mail:<br/>\n<br/>\nBrains, brains, go away--unless we learn a bit each day. <br/>\nTimely knowledge? We deliver. <br/>\nTry it now! Your brain&#39;ll quiver: <a rel=\"nofollow\" target=\"_blank\" href=\"http://knowledgenews.net/s?s=aw070705\">http://knowledgenews.net/s?s=aw070705</a><br/>\n<br/>\nSo I looked it up.   You can get a one-month free e-mail sampler, but if you <br/>\njoin you have access to their archives and other stuff that actually looks <br/>\npretty interesting.   I&#39;ve spent more for worse, and this stuff wouldn&#39;t clutter <br/>\nup the house.    So depending on your interests or your children&#39;s, and maybe <br/>\nif you have grandparents itchin&#39; to buy you something educational for your <br/>\nhomeschooling, you might want to look at it.   It&#39;s $35.95 for &quot;life&quot; but you can <br/>\nbuy $10 gift memberships for friends, so if several people go together and <br/>\nsplit the total it can be considerably less.   It doesn&#39;t show on the form but <br/>\nwhen I copied and printed, it had a whole string of $10 extras, so I guess <br/>\nthey&#39;ll ask you again if you put one in.    <br/>\n<br/>\nIt&#39;s not information that&#39;s not available otherwise, it&#39;s just organized and <br/>\nspoon fed (and sometimes I don&#39;t mind spoon feeding if I get to pick the meal, <br/>\nas it were, and e-mail&#39;s easy to ignore or delete if you get tired of it).   <br/>\nDown below is the text you see if you sign on for the sampler.<br/>\n<br/>\nIt&#39;s cheaper than Newsweek or Time, but with those you get the arts, popular <br/>\nculture and sports, and you can read them in bed.     This you don&#39;t have to <br/>\nrenew.   They can throw you out of your membership if you don&#39;t keep the <br/>\ne-mails to yourself (and your family, I&#39;m guessing, but didn&#39;t read all the fine <br/>\nprint).<br/>\n<br/>\n===========================<br/>\n<br/>\n<br/>\n What You Get If You<br/>\nBecome a Lifetime Member of KnowledgeNews<br/>\n Thanks for signing up to try KnowledgeNews! A welcome email with links to <br/>\nsome of our recent articles is already on its way to your inbox. And your free, <br/>\nfour-week introductory membership has begun.<br/>\n If you like what you see, you can become a full, lifetime member of the <br/>\nKnowledgeNews community and get full access to all our members-only features. For <br/>\njust a single one-time support payment, you get:<br/>\n<br/>\n3 Special Learning Collections<br/>\n The moment you sign up, you get immediate online access to:<br/>\n The KnowledgeNews World Tour. Go all around the world in just 30 days, and <br/>\nget the knowledge you need to understand today&#39;s global hotspots, from <br/>\nAfghanistan to Zimbabwe (not to mention Iraq and Israel).<br/>\n<br/>\n Americana. Get the crash course in American civics you&#39;ve always wanted--40 <br/>\nthings every American should know (and that every non-American has probably <br/>\nwondered about). Know what any true patriot should.<br/>\n<br/>\n 101 Questions. Answers to the top questions thinking people always ask about <br/>\nthe news. From how cloning works, to how airplanes fly. From who the Buddha <br/>\nwas, to how to become an Ayatollah. It&#39;s all here--in easy-to-swallow, <br/>\neducational capsules, carefully crafted to tickle your funny bone even as they build <br/>\nyour mental muscle.<br/>\n<br/>\n<br/>\n<br/>\n- Plus -<br/>\n<br/>\nOur KnowledgeNews Emails<br/>\n Delivered to your inbox every weekday, each packed with the knowledge you <br/>\nneed to make sense of each day&#39;s top news and events.<br/>\n<br/>\n<br/>\n- Plus -<br/>\n<br/>\nThe World&#39;s Best Deal on Brain Power<br/>\n Join today, and you get it all--complete, uninterrupted daily delivery of <br/>\nKnowledgeNews, plus all 3 special learning reports--for a one-time membership <br/>\nfee of just $34.95. That&#39;s right, just $34.95--less than the value of the <br/>\nSpecial Reports alone--makes you a KnowledgeNews member for life. There are no <br/>\nrenewals, ever.<br/>\n<br/>\nOf course, we hope you&#39;ll take advantage of special member discounts on other <br/>\nKnowledgeNews services (especially gift memberships for all your friends and <br/>\nfamily, available below). But there is no obligation.<br/>\n<br/>\nUnlike giant media conglomerates with astronomical overhead, we use the power <br/>\nof the web to keep our costs low, so we can keep our membership fee to a <br/>\nminimum. We also believe in good old-fashioned business principles, like providing <br/>\nactual customer service and standing behind our product. We do both 100 <br/>\npercent.<br/>\n<br/>\nDon&#39;t wait another minute. Start your lifetime membership now!<br/>\n <br/>\n<br/>\n<br/>\nBecome a Lifetime Member of KnowledgeNews!<br/>\n<br/>\n<br/>\nGive a lifetime membership to a friend for just $10 more<br/>\n<br/>\n Email: First Name: Last Name:<br/>\nBegin this gift Membership: Today  <br/>\nGive another lifetime membership for $10 more<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":107093,"nextTopicId":107106}}