{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] The car thing","postDate":"1058923540","msgId":77369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhNC4xN2FkN2FlZC4yYzRmM2UxNEBhb2wuY29tPg=="},"prevInTopic":77291,"nextInTopic":0,"prevInTime":77368,"nextInTime":77370,"topicId":77228,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/22/03 5:56:06 AM, Quiltsixer@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1686119807\">In a message dated 7/22/03 5:56:06 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Quiltsixer@...\">Quiltsixer@...</a> writes:<br/>\n<br/>\n&lt;&lt; He explained that they were out looking at squished squirrels and stuff.  <br/>\nHe had calmly explained to her that that was what happened to things that got <br/>\nrun over and they had investigated how flat they were and that they couldn&#39;t <br/>\nrun and play any more, etc.  He said he told her he would be very sad if his <br/>\nsister got hit by a car and looked like that.  &gt;&gt;<br/>\n<br/>\nBeth, that&#39;s really sweet!  <br/>\n(In a flat squirrel sort of way, I mean.)<br/>\n<br/>\nIt&#39;s sweet that he cared enough to tell her that.  Maybe seeing a squirrel is <br/>\nwhat made him realize the danger, and he remembered and shared it because of <br/>\nthat.<br/>\n<br/>\nGreat story.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] The car thing","postDate":"1058885732","msgId":77291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OS4xNTllM2NlZS4yYzRlYWE2NEBhb2wuY29tPg=="},"prevInTopic":77254,"nextInTopic":77369,"prevInTime":77290,"nextInTime":77292,"topicId":77228,"numMessagesInTopic":0,"msgSnippet":"The flat squirrel thing.. thats also how I demonstrated to my kids that it was not safe to get into the road.   Actually, roadkill is ever present out here in","messageBody":"<div id=\"ygrps-yiv-1479149605\">The flat squirrel thing.. thats also how I demonstrated to my kids that it <br/>\nwas not safe to get into the road.   Actually, roadkill is ever present out here <br/>\nin the rural area where we live.   Lots of dead dogs, cats, possums, <br/>\nsquirrels, skunks ( Peeeuuuuu) etc can be seen every time we go somewhere.   Even <br/>\nthough we live in a rural area, we do live on a very busy highway ( by &quot;country&quot; <br/>\nstandards)  and my children have never ventured near the road.  <br/>\n<br/>\nOH, thats a lie.. one time, JP got in the road!  It was so TOTALLY my fault.  <br/>\n I was outside talking with a neighbor.  The kids were playing around in the <br/>\nyard.  JP was about 3.   Dh was mowing the yard and he was doing the strip <br/>\nnext to the road.  One minute, JP was next to me playing, the next minute, he was <br/>\nstanding in the road waving at his Daddy on the lawn mower!!!    I had become <br/>\ndistracted in conversation and just didnt see him go towards the road.   He <br/>\nwas OK, we rescued him .. A car blew its horn to alert us.  Myself, my <br/>\nneighbor, my DH, my kids and my neighbors kids ( 5 total) all ran down do the road to <br/>\nget him and make sure he was OK.     I just picked him up and hugged him and <br/>\neverybody was saying Jon Phillip, are you OK?  were you scared?  why were you <br/>\nin the road?   I think all the fear and anxiety and relief from a whole crowd <br/>\nof people was more than enough for him to get the idea that the road was NOT <br/>\nSAFE.  Although, I really don&#39;t even think he realized he was in the road.  He <br/>\nhad been chasing after his daddy on the lawn mower and I he probably thought <br/>\nanywhere his dad was had to be a safe place.   The lesson learned was MINE and <br/>\nmy husbands.  PAY ATTENTION!  <br/>\n<br/>\nYou know, we also lost JP in Disney World when he was 5... but thats another <br/>\nstory :-)<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] The car thing","postDate":"1058875833","msgId":77254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0ZC4yMWRlYTY2Zi4yYzRlODNiOUBhb2wuY29tPg=="},"prevInTopic":77251,"nextInTopic":77291,"prevInTime":77253,"nextInTime":77255,"topicId":77228,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/22/2003 7:56:29 AM Eastern Daylight Time, ... DAMN! A lurker who s not afraid to post and who LIKES what she reads!  ~Kelly ","messageBody":"<div id=\"ygrps-yiv-1864240450\">In a message dated 7/22/2003 7:56:29 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Quiltsixer@...\">Quiltsixer@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Beth -mother to 5 teens and a wannabe 10 yr old  who will now slip back <br/>\n&gt; into <br/>\n&gt; lurker status as I seldom have time to do more than skim all of your <br/>\n&gt; wonderful <br/>\n&gt; and thought provoking posts.<br/>\n<br/>\n </span></blockquote>DAMN! A lurker who&#39;s not afraid to post and who LIKES what she reads! &lt;BWEG&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12226183,"authorName":"Quiltsixer@aol.com","from":"Quiltsixer@...","profile":"quilt6er","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] The car thing","postDate":"1058874823","msgId":77251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDViLjNiOTRlZjE0LjJjNGU3ZmM3QGFvbC5jb20+"},"prevInTopic":77228,"nextInTopic":77254,"prevInTime":77250,"nextInTime":77252,"topicId":77228,"numMessagesInTopic":0,"msgSnippet":"Joylyn, Your story triggered a memory for me.  My youngest (of 6) is a darling child, all smiles and happiness, but one day when she was 2 1/2  (now 10)she got","messageBody":"<div id=\"ygrps-yiv-159367121\">Joylyn,<br/>\nYour story triggered a memory for me.  My youngest (of 6) is a darling child, <br/>\nall smiles and happiness, but one day when she was 2 1/2  (now 10)she got <br/>\ninto a defiant mood while we were out in the front yard planting bulbs.  She took <br/>\noff down the street, looking over her shoulder laughing at me.  She was <br/>\nheaded straight for the intersection with the busy 4 lane highway and she wasn&#39;t <br/>\nslowing.  It actually had become fun for her, the excitement of the chase and <br/>\nall that.  She had enough of a head start and was not into listening and I just <br/>\nknew she would reach the corner and keep going right out into the highway.  <br/>\n<br/>\nLuckily one of her older brothers was on his bike and he raced ahead of her, <br/>\nlaid the bike out flat in skid and jumped off and caught her.  She was enraged <br/>\nat her will being thwarted.  But we all gathered ourselves back inside.  My <br/>\ndaughter raged and carried on, no amount of trying to reach her worked, so we <br/>\nleft her be.  In a little her BIG brother came home (there is a 9 year <br/>\ndifference and he is now 6&#39; 7&quot;) and all the kids shared the drama of the afternoon <br/>\nwith him.<br/>\n<br/>\nNext thing I know my oldest and youngest are outside standing together in the <br/>\nstreet, walking up and down, crouching down together, engaged in earnest <br/>\ndiscussion.  I resisted the urge to run outside screaming &quot;Get your sister out of <br/>\nthe street,&quot; the fear thing was still hammering in my heart.  In a little <br/>\nwhile they came back in and I took my son aside and asked what they had been <br/>\ndoing.  He explained that they were out looking at squished squirrels and stuff.  <br/>\nHe had calmly explained to her that that was what happened to things that got <br/>\nrun over and they had investigated how flat they were and that they couldn&#39;t <br/>\nrun and play any more, etc.  He said he told her he would be very sad if his <br/>\nsister got hit by a car and looked like that.  <br/>\n<br/>\nI was a little horrified, positive that all sorts of emotional trauma would <br/>\nensue, but the very calmness and matter of fact way that her 11 year old <br/>\nbrother handled it had far more impact than anything I had said.  From that day <br/>\nforward we did not have any repeats of that incident and my kids would all remind <br/>\neach other of street safety with the catch word, flat squirrels. <br/>\n<br/>\nThis is just one example of the many times that my kids have been wonderful <br/>\nteachers to each other, instinctively knowing how to reach each other in ways <br/>\nthat I as an adult would not be as effective.<br/>\n<br/>\nAs to your daughter&#39;s trauma, I hope she finds a balance point between her <br/>\nneed for safety and unreasonable fear.  Personally I would rather have a little <br/>\ntrauma than a dead child.  Whenever I look back and really wonder about a <br/>\ndecision in the past that is irrevocable I reassure myself with the fact that at <br/>\nleast I have given them something to take to therapy in their later years :-) <br/>\nVBG <br/>\n<br/>\nBeth -mother to 5 teens and a wannabe 10 yr old  who will now slip back into <br/>\nlurker status as I seldom have time to do more than skim all of your wonderful <br/>\nand thought provoking posts.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":118406848,"authorName":"Joylyn","from":"Joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The car thing","postDate":"1058851819","msgId":77228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGMUNDQkVCLjUwMTAwMDNAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PEJEQkJDRTlFLUJCQzktMTFENy1BMzUxLTAwMEE5NTZFMTA5RUBtYWMuY29tPg=="},"prevInTopic":0,"nextInTopic":77251,"prevInTime":77227,"nextInTime":77229,"topicId":77228,"numMessagesInTopic":0,"msgSnippet":"I ve been wondering if I should tell this story or not, but I think I will. For those of you who are lucky enough to know Janene, you know she is very--well,","messageBody":"<div id=\"ygrps-yiv-884342453\">I&#39;ve been wondering if I should tell this story or not, but I think I <br/>\nwill.  <br/>\n<br/>\nFor those of you who are lucky enough to know Janene, you know she is <br/>\nvery--well, she knows her own mind.  As soon as she could walk, which <br/>\nwas right under a year, she was hard to deal with in any situation that <br/>\nhad to do with streets, cars, parking lots, etc.  No amount of talking <br/>\nabout cars, helped, she continued and continued to run out into the <br/>\nparking lot, running toward the streets, etc.  By the time she was three <br/>\nI was scared to death that she would be hit because she was very quick, <br/>\nvery smart, and very good at slipping away.  I did use the sling a LOT, <br/>\nand that helped but it wasn&#39;t the perfect answer. I also would hold her <br/>\ntight, in my arms, or just hold her hand, and that was working but I <br/>\nmade the decision that she needed to understand better how dangerous a <br/>\nsituation it was.  So I did something that even today, 2 years later, I <br/>\nwonder if I should have.  Sometimes I think it was good, it solved the <br/>\nproblem.  Other times I think so totally traumatized my child and I <br/>\nnever should have done that.  This is what I did.<br/>\n<br/>\nI put a soda can, half empty, behind the wheel of my tire.  I had my <br/>\nmother roll backwards slowly over the can, and Janene and I watched it <br/>\nget squished.  Janene immediately broke down, crying hysterically.  It <br/>\ntook a long time to calm her.  The result was immediate though.  Janene <br/>\nimmediately stopped running into the parking lot, instead she would <br/>\ninsist on holding my hand or being held in arms when entering a parking <br/>\nlot.  To this day, she is super careful in parking lots and near <br/>\nstreets.  She will hold onto my shirt if a hand is not available.  She <br/>\nmakes sure every body else is also safe, insisting that Lexie also be <br/>\nright next to me and if there are any other children she makes them stay <br/>\nnext to me, making sure they hold my hand or shirt or purse strap.  She <br/>\nis overly concerned about it.  <br/>\n<br/>\nTo me, I&#39;m not quite sure what I did was worth it.  She was traumatized. <br/>\n Of this I am sure.  I just asked her and she has NO memory of the <br/>\nincident, but I remember it, as does my mother and father and sister, <br/>\nall who were there.  They all agreed that it was necessary, but I often <br/>\nwonder if the emotional damage I did was worse than just keeping her <br/>\nsafe by holding her, loving her.  I know I never thought of spanking or <br/>\nhitting her, but I also know it was a constant concern.  <br/>\n<br/>\nHowever, I do know I did the best I could at that moment in my life. <br/>\n Would I do it again, probably not.  <br/>\n<br/>\nJoylyn</div>","specialLinks":[]}],"prevTopicId":77331,"nextTopicId":12559}}