{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Unschooling &quot;Limits&quot;/Was Noelle&#39;s Homeschool Comments/Questions","postDate":"1122474379","msgId":107538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NC40YTE2YTk5OC4zMDE4ZjM4YkBhb2wuY29tPg=="},"prevInTopic":107537,"nextInTopic":0,"prevInTime":107537,"nextInTime":107539,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... The way this is worded is interesting.    Perhaps there is nothing meaning limits? Or meaning perhaps there is nothing an unschooler would not approve","messageBody":"<div id=\"ygrps-yiv-1440193040\"><blockquote><span title=\"ireply\">&gt; I was wondering what type, if any, limits<br/>\n&gt; are there ---do y&#39;all set? What do you not approve of? Perhaps there is<br/>\n&gt; nothing and I am still not seeing everything in the same way.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>The way this is worded is interesting.    &quot;Perhaps there is nothing&quot; meaning <br/>\nlimits?<br/>\nOr meaning perhaps there is nothing an unschooler would not approve of?<br/>\n<br/>\nEveryone has preferences and concerns and worries and when one lives with a <br/>\nroommate one finds out pretty quickly which are the really crucial things for <br/>\nthat person (maybe taking the trash out, maybe all the doors and windows being <br/>\nlocked, maybe making sure the refrigerator is clean, maybe not feeding the dog <br/>\nin any human plates).    <br/>\n<br/>\nThe difference between our relationships with our children (now teens) and <br/>\nmost of our friends&#39; is that we deal honestly with our children as we would <br/>\nother adults.   We don&#39;t say no arbitrarily.    We don&#39;t tell them to leave us <br/>\nalone because we&#39;re adults and we&#39;re busy.    I notice it most on Tuesday nights <br/>\nwhen others come to sing with us.   Keith and I have four to six other adults <br/>\nmost childless, one with two younger children quite controlled) over to sing, <br/>\nand the kids will come in to show us something or ask something, and it&#39;s a <br/>\nsnapsot of the relationship.     Two weeks ago Marty came and asked if he could <br/>\ngo to Edgewood, and we discussed which car and whether he needed gas, and I <br/>\nchucked him my charge card.    I suggested maybe he was actually meaning Stanley <br/>\n(a town further away that Edgewood, both over half an hour away over the <br/>\nmountains).   He allowed that yeah, he might end up in Stanley.    He ended up <br/>\npicking one person up in Edgewood to visit in Stanley with him,   and they all <br/>\nended up in Glorieta (NOT near) at a fourth friend&#39;s house.    <br/>\n<br/>\nLast night Marty and Kirby got back rustling bags from thrift stores and I <br/>\ncalled down &quot;What&#39;d you get?&quot; (between songs) and Marty came and showed us a <br/>\ncouple of things he got for Kirby&#39;s birthday party costume.   He offered to pay <br/>\nfor Kirby&#39;s costume, as his birthday gift.   Kirby&#39;s going as Casey Jones, from <br/>\nthe first Ninja Turtle movie.   He had spent $40 on costume parts (including <br/>\nbike gloves that Marty will keep for skateboarding later).    <br/>\n<br/>\nThe theme is movie characters.   Holly&#39;s going as Addie from Paper Moon; <br/>\nMarty as Dr. Strangelove; Kirby as Casey Jones with all his sports equipment as <br/>\nweapons against bad guys.<br/>\n<br/>\nWhatever the dire predictions of those who think we don&#39;t know what we&#39;re <br/>\ndoing, the kids are good and generous, direct and interesting.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Unschooling &quot;Limits&quot;/Was Noelle&#39;s Homeschool Comments/Questions","postDate":"1122470525","msgId":107537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDNzYwQzU1MERGMTQ1Qi1FMzAtMjY1Q0BNQkxLLU0zOC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDQyRTJBNkQ0LjcwNjAzMDhAZ21haWwuY29tPg==","referencesHeader":"PGRidTB1MSsxMTFjbEBlR3JvdXBzLmNvbT4gPDQyRTJBNkQ0LjcwNjAzMDhAZ21haWwuY29tPg=="},"prevInTopic":107459,"nextInTopic":107538,"prevInTime":107536,"nextInTime":107538,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... From: Jenn  This raises a, perhaps ignorant, question. I have never met any unschoolers, parents or children, and just recently even","messageBody":"<div id=\"ygrps-yiv-412571177\">-----Original Message-----<br/>\nFrom: Jenn &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfischetto@...\">jfischetto@...</a>&gt;<br/>\n<br/>\nThis raises a, perhaps ignorant, question. I have never met any<br/>\nunschoolers, parents or children, and just recently even heard of the<br/>\nterm, so if my question sounds ridiculous please forgive. :)<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThe conference would be a big help in actually SEEING what we&#39;re <br/>\ntalking about---if you can make it.<br/>\n<br/>\n-==-=-=-=-<br/>\n<br/>\nI have read about all the wonderful ways that children are respected, <br/>\nby<br/>\ntheir unschooling families, and the freedoms they are given to know <br/>\nwhat<br/>\nis in their interests, etc. I was wondering what type, if any, limits<br/>\nare there ---do y&#39;all set? What do you not approve of? Perhaps there is<br/>\nnothing and I am still not seeing everything in the same way.<br/>\n<br/>\n-==-=-=-<br/>\n<br/>\nI can&#39;t think of any limits.....I try to let them know they are are <br/>\nlimitless! &lt;g&gt; That they can achieve *any*thing!<br/>\n<br/>\nI don&#39;t approve of abuse or neglect or unkindness. But those are things <br/>\nI never, if ever, see in my children.<br/>\n<br/>\nI think empathy and honesty are pretty important.<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\nOctober 6-9, 2005<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Unschooling &quot;Limits&quot;","postDate":"1122220249","msgId":107459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhYS4zYjExODhiNi4zMDE1MTJkOUBhb2wuY29tPg=="},"prevInTopic":107445,"nextInTopic":107537,"prevInTime":107458,"nextInTime":107460,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... When I was little I usually only had one pair of shoes, and they were often uncomfortable, unfashionable, and wearing out.    Because of that I offer to ","messageBody":"<div id=\"ygrps-yiv-91041712\">In a message dated 7/23/05 9:04:34 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfischetto@...\">jfischetto@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Perhaps the children&#39;s inability to share was not due to the parents<br/>\n&gt; need to buy every toy under the sun (that&#39;s only a slight exaggeration),<br/>\n&gt; to not allow the child&#39;s father to eat the snacks that were purchased<br/>\n&gt; just for the child (because the child would get mad)... Oh the list goes<br/>\n&gt; on. &lt;g&gt;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>When I was little I usually only had one pair of shoes, and they were often <br/>\nuncomfortable, unfashionable, and wearing out.    Because of that I offer to <br/>\nbuy my kids shoes lots, and I feel happy when they have four or six pairs of <br/>\nuseable shoes, and they have choices of what to wear.   If their shoes get <br/>\nuncomfortable, if they&#39;re good I encourage them to give them to the thrift store; if <br/>\nthey&#39;re holey, I say &quot;throw them away.&quot;<br/>\n<br/>\nThe &quot;compensation&quot; is inside of me.   I am giving them what I didn&#39;t have.   <br/>\nI don&#39;t buy $60 pairs of shoes.   They&#39;re usually from PayLess or WalMart, <br/>\nthough I will offer to get nicer shoes and the kids usually decline because their <br/>\nfeet are growing and they&#39;re budget conscious kids, and not needy, grasping <br/>\nkids.<br/>\n<br/>\nGrasping and neediness come from lack and need.   Neediness is real.   When <br/>\nsomeone is needy or doesn&#39;t want to share, there is something that child is <br/>\nlacking to feel safe and secure.<br/>\n<br/>\nI have very current answers to some of your questions.   Holly&#39;s off camping <br/>\nin the mountains where it&#39;s expected to rain.   She&#39;s with her dad a few <br/>\nhundred medievalists.   Friday   morning she walked to the grocery store in the new <br/>\nshoes she had gotten to take to the event.   She had sandals for daytime <br/>\n(it&#39;s a fern meadow, the main campground), and wanted something waterproof for <br/>\nnighttime.   She got garden clogs with backs, basically rainboots.   So she wore <br/>\nthem to   walk to the store, and when she got back she said she didn&#39;t think <br/>\nsocks would fit in them and be comfortable, and I offered to take her to get <br/>\nsomething else.   <br/>\n<br/>\nWe went to PayLess and she got a pair of suede boots lined with plush.   They <br/>\nwon&#39;t stay dry in serious rain, but they&#39;ll be warm if she stays in a tent or <br/>\nunder a rainfly and out of water.   And she got a $5 pair of cloth Mary Janes <br/>\nbecause for Kirby&#39;s birthday there&#39;s a movie-character theme and she&#39;s going <br/>\nas Addie from Paper Moon.   She already got used overalls for $4.   <br/>\n<br/>\nMy mom wouldn&#39;t have done ANY of that for me.   Holly knows that, but I don&#39;t <br/>\ndrone on about it.   I make the offer, she accepts or not.    She makes good <br/>\nuse of the clothes she has and wears them in artsy rearrangements and really <br/>\nlikes having clothes and shoes.     I like her having clothes and shoes.   The <br/>\ncompensation is for my own soul and spirit.<br/>\n<br/>\n-=-How do you deal with others? Strangers? For instance, if your child<br/>\nbecomes friends with someone you don&#39;t know and wants to go out with<br/>\nthis person?-=-<br/>\n<br/>\nThis happened yesterday for the first time.<br/>\n<br/>\nMarty is 16 and drives.   He said he was going to go thrift-store shopping <br/>\nwith... and he named a name I had never heard.   A teenaged girl he met a week <br/>\nago through friends, and hung around with (in a group) for a few hours the day <br/>\nafter they met.    He asked her to go shopping with him to get costume parts.  <br/>\n He&#39;s wanting to be Dr. Strangelove.   I asked him a couple of questions <br/>\nabout her, but y&#39;know, they were going to thriftstores, not a weekend ski trip.<br/>\n<br/>\nIf he went to school he would have access to hundreds of people I had never <br/>\nmet.   It&#39;s not that big a deal.   He meets people through hobbies or friends.<br/>\n<br/>\n-=- Or, with the conversation about dating ---what if the boy<br/>\nis someone *you* don&#39;t know? Would you ask your daughter to have him<br/>\nvisit to get to know him better?-=-<br/>\n<br/>\nI used to think I would, but Holly (13) is SO used to making her own decisi<br/>\nons for real reasons, and carefully and for GOOD reasons, that if Holly trusted <br/>\nthe guy that would mean something.   And I can&#39;t really imagine that she <br/>\nwouldn&#39;t get a second opinion if she was undecided about him, or stay in groups <br/>\nuntil she knew him better.<br/>\n<br/>\n-=- At 18, I finally<br/>\nbroke free of her control and the summer after graduation I was sexually<br/>\nassaulted by my boyfriend&#39;s friend. So what did that tell me? That she<br/>\nwas right? That the world wasn&#39;t to be trusted?-=-<br/>\n<br/>\nMaybe you needed more practice at a younger age, and real reasons, not vague <br/>\n&quot;you could get pregnant&quot; reasons.    Real advice in the moment, like what to <br/>\ndo or say if you felt uncomfortable.<br/>\n<br/>\nHolly left the country for a month recently.   She was with a family we&#39;ve <br/>\nknown since she was little, but she wasn&#39;t with them at every moment, and one <br/>\nnight she went back to HesFes, the big homeschooling campout, while the rest <br/>\nstayed at the cottage a couple of blocks away, and she was out at night in the <br/>\ndark with boys swinging on a rope swing.    It didn&#39;t make me nervous.   She&#39;s <br/>\nnot sneaky, she&#39;s talkative, she has a strong personality, she&#39;s not desperate <br/>\nfor attention, she&#39;s not needy because we give her lots of attention, <br/>\ninformation, opportunities, and choices.<br/>\n<br/>\nThere are two things I&#39;ve written that are directly about what you&#39;re <br/>\nwondering, and both are about the positive effects of respecting children:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandadodd.com/spoiled\">http://sandadodd.com/spoiled</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/respect\">http://sandradodd.com/respect</a><br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":218443737,"authorName":"Jenn","from":"Jenn &lt;jfischetto@...&gt;","profile":"jenn58125","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Unschooling &quot;Limits&quot;","postDate":"1122169428","msgId":107445,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyRTJGMjU0LjYwNjAwMDJAZ21haWwuY29tPg==","inReplyToHeader":"PDFkNC40MDdiNGMzYi4zMDE0MWQ5OEBhb2wuY29tPg==","referencesHeader":"PDFkNC40MDdiNGMzYi4zMDE0MWQ5OEBhb2wuY29tPg=="},"prevInTopic":107440,"nextInTopic":107459,"prevInTime":107444,"nextInTime":107446,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... Yes, I guess that did tell a lot about what I believe, or have learned to believe and haven t truly figured out what *I* believe yet. I have had one close","messageBody":"<div id=\"ygrps-yiv-774561895\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One can only be &quot;lenient&quot; in the presence of rules.<br/>\n&gt; One can only OVERcompensate when the observer thinks it was more than<br/>\n&gt; necessary.<br/>\n&gt;<br/>\n&gt; When you tell us what you&#39;ve seen you accidentally tell us part of <br/>\n&gt; what you<br/>\n&gt; believe. &lt;g&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt;<br/>\n </span></blockquote>Yes, I guess that did tell a lot about what I believe, or have learned <br/>\nto believe and haven&#39;t truly figured out what *I* believe yet. I have <br/>\nhad one close and one semi-close friendship with a parent who, in my <br/>\neyes, overcompensates, and *I*, and my daughter, have had a hard time <br/>\n&quot;dealing&quot; with the child. What I call overcompensating is a parent who <br/>\ncan not go to a store for a gallon of milk without also purchasing a toy <br/>\nfor the child, a parent who will spend $300 on one child for Christmas <br/>\nand have to borrow money to pay their electricity.  It was actually the <br/>\nparent that I knew quite well with whom I thought of the word <br/>\n&quot;overcompensating&quot; because she herself stated that she wondered if she <br/>\ndid all she did because her own mother did very little. I am trying to <br/>\nnot be judgmental so I realize labels aren&#39;t &quot;correct&quot;. I grew up in an <br/>\noverly critical household filled with many rules, many subliminal rules, <br/>\nso it is hard to break out of this but I am working on it. :)<br/>\nPerhaps the children&#39;s inability to share was not due to the parents <br/>\nneed to buy every toy under the sun (that&#39;s only a slight exaggeration), <br/>\nto not allow the child&#39;s father to eat the snacks that were purchased <br/>\njust for the child (because the child would get mad)... Oh the list goes <br/>\non. &lt;g&gt;<br/>\nI do not mean to offend anyone and hopefully I have not. If I have, I <br/>\napologize.<br/>\n<br/>\nHow do you deal with others? Strangers? For instance, if your child <br/>\nbecomes friends with someone you don&#39;t know and wants to go out with <br/>\nthis person? Or, with the conversation about dating ---what if the boy <br/>\nis someone *you* don&#39;t know? Would you ask your daughter to have him <br/>\nvisit to get to know him better? (Ok, that sounds like a stupid question <br/>\nbut this is very new to me.) When I first read the dating thread my <br/>\nfirst thought was, &quot;I could never allow my 12, 13, 14 year-old daughter <br/>\nto go out on a date.&quot; Then as I read further I realized that the <br/>\ncircumstances were different then what were going through my mind, and <br/>\nthen I realized I was thinking like my mother. She was very strict and I <br/>\nwasn&#39;t allowed to go anywhere usually. A friend&#39;s house after school, <br/>\nwhen I was older ---junior high on up---as long as I was home by supper <br/>\ntime (5:00). My brother was allowed to go back out after dinner and I <br/>\nwas not. I was 5 years older than him. So at 15 I was sitting in the <br/>\nhouse and he,a t age 10, was running around with friends. Her reasons <br/>\nwere because I was a girl and I could get pregnant.<br/>\n<br/>\nOf course I took that to mean that she didn&#39;t trust *me*, although she <br/>\nsaid it was the rest of the world she didn&#39;t trust. At 18, I finally <br/>\nbroke free of her control and the summer after graduation I was sexually <br/>\nassaulted by my boyfriend&#39;s friend. So what did that tell me? That she <br/>\nwas right? That the world wasn&#39;t to be trusted? I don&#39;t want to send <br/>\nthose &quot;rules&quot; to Madison, for her to become jaded.<br/>\nI thank everyone for answering my newbie questions. I really do <br/>\nappreciate all the insight and experience you can offer. I so want this <br/>\nlife for my family.<br/>\nJenn :)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Unschooling &quot;Limits&quot;/Was Noelle&#39;s Homeschool Comments/Questions","postDate":"1122157464","msgId":107440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNC40MDdiNGMzYi4zMDE0MWQ5OEBhb2wuY29tPg=="},"prevInTopic":107439,"nextInTopic":107445,"prevInTime":107439,"nextInTime":107441,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... We don t like dishonesty, and we ask that people (not just kids, but adults too) let people know where they re going and when they ll be back.   We call if","messageBody":"<div id=\"ygrps-yiv-2016328094\">In a message dated 7/23/05 2:32:39 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfischetto@...\">jfischetto@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was wondering what type, if any, limits<br/>\n&gt; are there ---do y&#39;all set? What do you not approve of?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>We don&#39;t like dishonesty, and we ask that people (not just kids, but adults <br/>\ntoo) let people know where they&#39;re going and when they&#39;ll be back.   We call if <br/>\nplans change.   <br/>\n<br/>\nIf anyone finishes off the milk, or it&#39;s getting low, they need to get <br/>\nanother gallon from the fridge in back.    If the trash is full, someone will take <br/>\nthat bag down and replace the bag.   If the dog&#39;s dish is empty, someone will <br/>\nfill it.<br/>\n<br/>\nIt&#39;s considered tacky not to put the cordless phones back on their bases and <br/>\nto turn most of the lights off at night.<br/>\n<br/>\nWe try to be quiet if someone&#39;s asleep, but if noon has passed and there are <br/>\nno extenuating circumstances, noise is okay.<br/>\n<br/>\nWhoever finishes off any food item that we stock regularly should put it on <br/>\nthe list.   <br/>\n<br/>\nIf any of those things are not done, someone (any of us) might snark at <br/>\nsomeone (whoever could&#39;ve done better), or might even more likely NOT.     <br/>\n<br/>\n-=the closest I could<br/>\ncome to were the families where the mother is calmly telling her child<br/>\nwhy he/she shouldn&#39;t hit mommy-=-<br/>\n<br/>\nEeew.   And in the poodle voice?   Sing-songy?   Gags me.<br/>\n<br/>\n-=I have known families where the parents were strict, super strict,<br/>\nneglectful, lenient and whom overcompensate.-=-<br/>\n<br/>\nOne can only be &quot;lenient&quot; in the presence of rules.<br/>\nOne can only OVERcompensate when the observer thinks it was more than <br/>\nnecessary.<br/>\n<br/>\nWhen you tell us what you&#39;ve seen you accidentally tell us part of what you <br/>\nbelieve. &lt;g&gt;<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Unschooling &quot;Limits&quot;/Was Noelle&#39;s Homeschool Comments/Questions","postDate":"1122156014","msgId":107439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwLjU5ZTdlYjg5LjMwMTQxN2VlQGFvbC5jb20+"},"prevInTopic":107438,"nextInTopic":107440,"prevInTime":107438,"nextInTime":107440,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... Ah, if only you could distribute them one to each of us who ve had too few 10th century churches in our lives... But I remember the feeling of being","messageBody":"<div id=\"ygrps-yiv-951622437\">In a message dated 7/23/05 3:23:18 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; were bored by too<br/>\n&gt; many churches from the 10th century<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Ah, if only you could distribute them one to each of us who&#39;ve had too few <br/>\n10th century churches in our lives...<br/>\n<br/>\nBut I remember the feeling of being &quot;museum sick&quot; and tired of touristing, <br/>\nboth from England and from Washington D.C., where after a while the french fries <br/>\nat the cafeteria were MUCH more interesting to me than yet another hall of <br/>\nrare coins or gold nuggets or even Howdy Doody himself.   And my memories of <br/>\nEnglish castles got mixed up in my head.   Better to study ONE and have it <br/>\nclearly imprinted, maybe.<br/>\n<br/>\nThat was a beautiful description of your feelings about your family, Julie.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling &quot;Limits&quot;/Was Noelle&#39;s Homeschool Comments/Questions","postDate":"1122153767","msgId":107438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRidWNmNytndDNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQyRTJBNkQ0LjcwNjAzMDhAZ21haWwuY29tPg=="},"prevInTopic":107436,"nextInTopic":107439,"prevInTime":107437,"nextInTime":107439,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"Just back from Italy with our family of seven and this post really caught my eye in light of the wonderful family time we had there. ... respected, by ... what","messageBody":"<div id=\"ygrps-yiv-1910170938\">Just back from Italy with our family of seven and this post really<br/>\ncaught my eye in light of the wonderful family time we had there.<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Jenn &lt;jfischetto@g...&gt;<br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have read about all the wonderful ways that children are<br/>\n </span></blockquote>respected, by <br/>\n<blockquote><span title=\"ireply\"> &gt; their unschooling families, and the freedoms they are given to know<br/>\n </span></blockquote>what <br/>\n<blockquote><span title=\"ireply\"> &gt; is in their interests, etc. I was wondering what type, if any, limits <br/>\n&gt; are there ---do y&#39;all set? What do you not approve of? <br/>\n<br/>\n </span></blockquote>When I first joined this list, this was the kind of question I might<br/>\nhave asked too. After being here over two years time, I realized I had<br/>\nthe question backwards. A better question is &quot;What can I do with my<br/>\nkids that I haven&#39;t been doing? What can I say yes to that I used to<br/>\nsay no to?&quot;<br/>\n<br/>\n When I first <br/>\n<blockquote><span title=\"ireply\"> &gt; heard of unschooling I tried to trace my memories to find an incidence <br/>\n&gt; or person that I once knew who were unschoolers and the closest I could <br/>\n&gt; come to were the families where the mother is calmly telling her child <br/>\n&gt; why he/she shouldn&#39;t hit mommy ---but that is not what unschooling is <br/>\n&gt; about, correct? <br/>\n<br/>\n </span></blockquote>No, I don&#39;t think so. :)<br/>\n<br/>\nWe just returned from Italy for 18 days. We stayed in tiny apartments<br/>\nand were together 24/7. My oldest is 18 and my youngest is 8. This is<br/>\nwhat I wrote upon our return. To me, this is what unschooling is all<br/>\nabout:<br/>\n<br/>\nItaly is a memory, but a bright, life-sized one that I&#39;ll hold in my<br/>\nheart until I&#39;m gone. And while Italy itself is a gorgeous country<br/>\nfilled with color, music, light and flavor, it was the joy of being a<br/>\nfamily that will stay with me even longer.<br/>\n<br/>\nI am in love.<br/>\n<br/>\nIn love with our kids.<br/>\n<br/>\nIn love with my husband.<br/>\n<br/>\nThe two and a half weeks were spent all together with very few times<br/>\nwhere we split up. We played games, shared books, rode public<br/>\ntransport all smooshed into too tiny spaces, hiked, made jokes, rode<br/>\nbikes in ancient walls, looked at world class art, were bored by too<br/>\nmany churches from the 10th century, learned Italian catch phrases,<br/>\nwere horrified by Roman history, ate gelatto like there was only one<br/>\nscoop left, compared American pizza to Italian and voted for American,<br/>\nwe snuggled and hugged, took photographs, danced in endless<br/>\ncombinations of relatives, walked and talked, and played chess and cards.<br/>\n<br/>\nThe vacation was one long family love fest.<br/>\n<br/>\nI am humbled. I wanted to bring my children to the world. Instead, the<br/>\nworld brought them closer to me. Jon and I were in awe of how well<br/>\nthey get along, how much fun we all can have together. It is the<br/>\nunexpected end result and it is why I&#39;m in tears at this early<br/>\njet-lagged hour.<br/>\n<br/>\n And I&#39;m not talking about unschooling in an academic <br/>\n<blockquote><span title=\"ireply\"> &gt; way but within the family as a whole.<br/>\n<br/>\n </span></blockquote>You&#39;ve got it.<br/>\n<br/>\nTo me, unschooling is the joy of being a family engaged in life, LIFE!<br/>\nIt is saying yes to opportunities and sharing them with each other. It<br/>\nis reveling in our differences and similarities. It is being a family<br/>\nthat loves to be together but also supports separateness too.<br/>\n<br/>\nI used to think unschooling was about education.<br/>\n<br/>\nNow I know it&#39;s about a family life that is filled with love, peace<br/>\nand joy. Really. I know how corny that sounds, but it turns out to be<br/>\ntrue.<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":218443737,"authorName":"Jenn","from":"Jenn &lt;jfischetto@...&gt;","profile":"jenn58125","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Unschooling &quot;Limits&quot;/Was Noelle&#39;s Homeschool Comments/Questions","postDate":"1122150100","msgId":107436,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyRTJBNkQ0LjcwNjAzMDhAZ21haWwuY29tPg==","inReplyToHeader":"PGRidTB1MSsxMTFjbEBlR3JvdXBzLmNvbT4=","referencesHeader":"PGRidTB1MSsxMTFjbEBlR3JvdXBzLmNvbT4="},"prevInTopic":107435,"nextInTopic":107438,"prevInTime":107435,"nextInTime":107437,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... This raises a, perhaps ignorant, question. I have never met any unschoolers, parents or children, and just recently even heard of the term, so if my","messageBody":"<div id=\"ygrps-yiv-1518315769\">kayb85 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I couldn&#39;t imagine, back then, that a kid not going to school and<br/>\n&gt; therefore spending more time with her parents and in her home and<br/>\n&gt; going to places that her parents approved of her going would be very<br/>\n&gt; much fun. And I also thought, back then, that parents who let their<br/>\n&gt; kids have the kind of freedom that unschooled kids have were the kind<br/>\n&gt; of parents who didn&#39;t care much about their kids and didn&#39;t really<br/>\n&gt; care about being good parents.   <br/>\n<br/>\n </span></blockquote>This raises a, perhaps ignorant, question. I have never met any <br/>\nunschoolers, parents or children, and just recently even heard of the <br/>\nterm, so if my question sounds ridiculous please forgive. :)<br/>\nI have read about all the wonderful ways that children are respected, by <br/>\ntheir unschooling families, and the freedoms they are given to know what <br/>\nis in their interests, etc. I was wondering what type, if any, limits <br/>\nare there ---do y&#39;all set? What do you not approve of? Perhaps there is <br/>\nnothing and I am still not seeing everything in the same way.<br/>\n<br/>\nI have known families where the parents were strict, super strict, <br/>\nneglectful, lenient and whom overcompensate. I don&#39;t believe, from what <br/>\nI have read, that unschoolers fall into any of these categories and I <br/>\nrealize that those labels are not truly fair to families. When I first <br/>\nheard of unschooling I tried to trace my memories to find an incidence <br/>\nor person that I once knew who were unschoolers and the closest I could <br/>\ncome to were the families where the mother is calmly telling her child <br/>\nwhy he/she shouldn&#39;t hit mommy ---but that is not what unschooling is <br/>\nabout, correct?  And I&#39;m not talking about unschooling in an academic <br/>\nway but within the family as a whole.<br/>\n<br/>\nI hope I made sense.<br/>\nTIA<br/>\nJenn :)</div>","specialLinks":[]},{"userId":218443737,"authorName":"Jenn","from":"Jenn &lt;jfischetto@...&gt;","profile":"jenn58125","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Noelle&#39;s Homeschool Comments/Questions","postDate":"1122149235","msgId":107435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyRTJBMzczLjcwMDA3MDJAZ21haWwuY29tPg==","inReplyToHeader":"PDFkNS40MDhiMjM4Ni4zMDEzZDZhYkBhb2wuY29tPg==","referencesHeader":"PDFkNS40MDhiMjM4Ni4zMDEzZDZhYkBhb2wuY29tPg=="},"prevInTopic":107434,"nextInTopic":107436,"prevInTime":107434,"nextInTime":107436,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... My mother raised us where we were not allowed to tell ANYONE (in or out of the family) anything about those of us within our immediate family (my mom,","messageBody":"<div id=\"ygrps-yiv-125995205\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Some kids (in or out of school) are GREATLY discouraged by their <br/>\n&gt; parents from<br/>\n&gt; talking to or trusting ANYone outside the family, from being honest with<br/>\n&gt; anyone (outside the family they mean, but that seems to instantly <br/>\n&gt; become &quot;nor<br/>\n&gt; honest INside the family&quot;) and once communications and trust are cut <br/>\n&gt; off, the<br/>\n&gt; person is not really a part of any greater group of people. <br/>\n<br/>\n </span></blockquote>My mother raised us where we were not allowed to tell ANYONE (in or out <br/>\nof the family) anything about those of us within our immediate family <br/>\n(my mom, brother and myself). I am now not a very trusting person, but I <br/>\nthought it stemmed from years of getting hurt by others. Now I wonder if <br/>\nthere wasn&#39;t mistrust as a child, that I just don&#39;t recall. There had to <br/>\nbe. That is sad. It is probably something I have passed onto my kids <br/>\nwithout knowing. I have told my daughter not to tell her friends certain <br/>\nthings, like the fact that my four year-old son still uses a bottle <br/>\ntwice a day or other things that I feel comfortable with but not with <br/>\nother people knowing. I live in an apt. complex where threatening to <br/>\ncall DSS on a family is the norm. Way too many nosy, gossipy, insecure <br/>\nwoman in here, whom have raised aggressive, bullying, obnoxious, <br/>\nfoul-mouth children. I also don&#39;t need the added aggravation of hearing <br/>\nanyone&#39;s judgments.<br/>\n<br/>\nBut...(getting off track there), I don&#39;t want to raise my children that <br/>\nway. It amazes me sometimes how you go through life doing something and <br/>\nrealize later on that that something was actually a negative thing. <br/>\nThank you Sandra for point ing this out. :)<br/>\nJenn</div>","specialLinks":[]},{"userId":143938653,"authorName":"K Krejci","from":"K Krejci &lt;kraekrej@...&gt;","profile":"kraekrej","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [UnschoolingDiscussion] Re: Noelle&#39;s Homeschool Comments/Questions","postDate":"1122148970","msgId":107434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNzIzMjAwMjUwLjE2MDcucW1haWxAd2ViNTQzMTAubWFpbC55YWhvby5jb20+","inReplyToHeader":"PGRidTB1MSsxMTFjbEBlR3JvdXBzLmNvbT4="},"prevInTopic":107433,"nextInTopic":107435,"prevInTime":107433,"nextInTime":107435,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... I can t even think of a single person I knew who homeschooled throughout my growing-up years.  It just wasn t done.  My first experience was with a woman","messageBody":"<div id=\"ygrps-yiv-1328253843\">--- kayb85 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes, I agree.  What I was trying to express was that<br/>\n&gt; when I was a<br/>\n&gt; teenager, the only people I knew who were<br/>\n&gt; homeschooling were people<br/>\n&gt; whose kids did not have exposure to a very big world<br/>\n&gt; at all, and I<br/>\n&gt; imagined that if I had been homeschooled by my<br/>\n&gt; already strict parents,<br/>\n&gt; my world wouldn&#39;t have been very big at all. <br/>\n<br/>\n </span></blockquote>I can&#39;t even think of a single person I knew who<br/>\nhomeschooled throughout my growing-up years.  It just<br/>\nwasn&#39;t done.  My first experience was with a woman who<br/>\nowns a car repair shop.  I was well into my 20s and it<br/>\ndidn&#39;t even make a blip on my radar as something that<br/>\nwas even happening.  I mean, I could see her son there<br/>\nin the shop every time I went (we had crummy cars - I<br/>\nwas an excellent customer!) but it didn&#39;t even sink in<br/>\nthat there was something else going on.  Not only was<br/>\nshe homeschooling, she was unschooling.  And I only<br/>\nfigured this out in May (a mere 20 years later)!<br/>\n<br/>\nKathy<br/>\n<br/>\nIt&#39;s Good 2 B Dog Nutz!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.good2bdognutz.com\">http://www.good2bdognutz.com</a><br/>\n<br/>\n<br/>\n\t\t<br/>\n____________________________________________________<br/>\nStart your day with Yahoo! - make it your home page <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yahoo.com/r/hs\">http://www.yahoo.com/r/hs</a></div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Noelle&#39;s Homeschool Comments/Questions","postDate":"1122141953","msgId":107433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRidTB1MSsxMTFjbEBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDFkNS40MDhiMjM4Ni4zMDEzZDZhYkBhb2wuY29tPg=="},"prevInTopic":107432,"nextInTopic":107434,"prevInTime":107432,"nextInTime":107434,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... Yes, I agree.  What I was trying to express was that when I was a teenager, the only people I knew who were homeschooling were people whose kids did not","messageBody":"<div id=\"ygrps-yiv-1139084095\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 7/22/05 8:05:46 PM, sheran@p... writes:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; I think that what I thought kids needed was time away from their<br/>\n&gt; &gt; parents and exposure to a bigger world than what they had at home. <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; I think some kids do need that.<br/>\n<br/>\n </span></blockquote>Yes, I agree.  What I was trying to express was that when I was a<br/>\nteenager, the only people I knew who were homeschooling were people<br/>\nwhose kids did not have exposure to a very big world at all, and I<br/>\nimagined that if I had been homeschooled by my already strict parents,<br/>\nmy world wouldn&#39;t have been very big at all.  I imagined (and I&#39;m sure<br/>\nI was right, because they wouldn&#39;t have been unschoolers) that the<br/>\nresult would be even more tension between me and my parents. <br/>\n<br/>\nI couldn&#39;t imagine, back then, that a kid not going to school and<br/>\ntherefore spending more time with her parents and in her home and<br/>\ngoing to places that her parents approved of her going would be very<br/>\nmuch fun. And I also thought, back then, that parents who let their<br/>\nkids have the kind of freedom that unschooled kids have were the kind<br/>\nof parents who didn&#39;t care much about their kids and didn&#39;t really<br/>\ncare about being good parents.  <br/>\n<br/>\nMaybe Noelle is thinking somewhat along those lines.  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Noelle&#39;s Homeschool Comments/Questions","postDate":"1122139307","msgId":107432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNS40MDhiMjM4Ni4zMDEzZDZhYkBhb2wuY29tPg=="},"prevInTopic":107426,"nextInTopic":107433,"prevInTime":107431,"nextInTime":107433,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... I think some kids do need that. My own get that, with unschooling and the freedom and encouragement they get from   us to listen to other adults when they","messageBody":"<div id=\"ygrps-yiv-1733618065\">In a message dated 7/22/05 8:05:46 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that what I thought kids needed was time away from their<br/>\n&gt; parents and exposure to a bigger world than what they had at home. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I think some kids do need that.<br/>\n<br/>\nMy own get that, with unschooling and the freedom and encouragement they get <br/>\nfrom   us to listen to other adults when they get the chance, to go out and <br/>\nhang out with people of all ages who are doing what they&#39;re doing.   <br/>\n<br/>\nSome kids (in or out of school) are GREATLY discouraged by their parents from <br/>\ntalking to or trusting ANYone outside the family, from being honest with <br/>\nanyone (outside the family they mean, but that seems to instantly become &quot;nor <br/>\nhonest INside the family&quot;) and once communications and trust are cut off, the <br/>\nperson is not really a part of any greater group of people.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Noelle&#39;s Homeschool Comments/Questions","postDate":"1122084303","msgId":107426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRiczhrZisxaWxyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRicWxvYytqZDNiQGVHcm91cHMuY29tPg=="},"prevInTopic":107413,"nextInTopic":107432,"prevInTime":107425,"nextInTime":107427,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... I remember arguing with someone about homeschooling when I was a teenager.  The guy I argued with went to public school and was probably a senior.  I was","messageBody":"<div id=\"ygrps-yiv-1565768308\"><blockquote><span title=\"ireply\">&gt; (Ahh, I thought, this is what it&#39;s really about and how sad that <br/>\n&gt; Noelle has already lost that at 14.  Then I started wondering if it <br/>\n&gt; was possible for her to find that knowledge again--is it too late?  <br/>\n&gt; I kept offering &quot;The Teen Liberation Handbook&quot; (Grace Llewellyn) but <br/>\n&gt; she wouldn&#39;t take it or even listen to what it was about.)  Maybe <br/>\n&gt; she got a little bit of her self back by argueing with me for 10 <br/>\n&gt; days! <br/>\n<br/>\n </span></blockquote>I remember arguing with someone about homeschooling when I was a<br/>\nteenager.  The guy I argued with went to public school and was<br/>\nprobably a senior.  I was probably a sophomore.  Some guy had come to<br/>\nspeak at his church to promote homeschooling--very conservative Bob<br/>\nJones University school at home homeschooling.  His parents thought it<br/>\nsounded good, and wished they had done it with their kids, and he<br/>\nagreed.  My parents, who were both teachers, heard about this and<br/>\nthought it was ridiculous.  My mom had just taken me and some friends<br/>\nto a church camp retreat, where a homeschooled teen girl and her mom<br/>\nhad attended, and the girl was very shy and didn&#39;t speak to anyone,<br/>\nand her mom always answered for her.  My mom blasted homeschooling big<br/>\ntime after that, and I had it in my mind for a long time that<br/>\nhomeschooling was insane.  I knew nothing about unschooling, but had<br/>\nit in my mind that there was something about school that kids NEED and<br/>\nto keep them away from it was nuts.  <br/>\n<br/>\nI think that what I thought kids needed was time away from their<br/>\nparents and exposure to a bigger world than what they had at home.  My<br/>\nparents were VERY strict, and my mom and I often didn&#39;t get along well<br/>\n when I was a teenager, and the thought of her homeschooling me<br/>\nbrought visions of yelling and crying and worse as she made me sit<br/>\nbored out of my mind all day at the kitchen table as she taught me.  <br/>\n<br/>\nA title like The Teenage Liberation Handbook would have appealed to me<br/>\nBIG TIME when I was a teenager.  I remember one summer I spent working<br/>\nas kitchen staff at my church&#39;s kids&#39; camp, and I said to my dad once<br/>\nthat fall that it was REALLY hard for me to be living at home again<br/>\nafter having so much freedom as a staff member at camp.  He accepted<br/>\nthat I felt that way and even admitted that he understood, but he<br/>\ndidn&#39;t drop any of the rules.  I think he felt it was his<br/>\nresponsibility to be strict, that that&#39;s what made him a good parent. <br/>\n<br/>\nYet I wonder, if I had met a radically unschooled teenager when I was<br/>\na teenager, if I would have thought it was somehow wrong or weird.  I<br/>\nhad it in my mind that even though the strictness of my parents and<br/>\nthe ridiculousness of school was unpleasant, it was somehow necessary.<br/>\nI thought there was something wrong with *me* that I didn&#39;t like it,<br/>\nand that I just had to work harder to be what everyone expected me to<br/>\nbe.  <br/>\n<br/>\nI bet I would have argued with you back then too.  But look at me now. ;) <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Noelle&#39;s Homeschool Comments/Questions","postDate":"1122048548","msgId":107413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NC41NTZmOTVkNS4zMDEyNzQyNEBhb2wuY29tPg=="},"prevInTopic":107408,"nextInTopic":107426,"prevInTime":107412,"nextInTime":107414,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"... No doubt!   And the effects of those days will probably last her at least ten years (or more ).   She ll run her ideas through that filter whether she ","messageBody":"<div id=\"ygrps-yiv-722955634\">In a message dated 7/22/05 5:38:08 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maggioncalda@...\">maggioncalda@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe<br/>\n&gt; she got a little bit of her self back by argueing with me for 10<br/>\n&gt; days!<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>No doubt!   And the effects of those days will probably last her at least ten <br/>\nyears (or more &lt;g&gt;).   She&#39;ll run her ideas through that filter whether she <br/>\nwants to or not from time to time over her life.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171053152,"authorName":"m59z85","from":"&quot;m59z85&quot; &lt;maggioncalda@...&gt;","profile":"m59z85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Noelle&#39;s Homeschool Comments/Questions","postDate":"1122032204","msgId":107408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRicWxvYytqZDNiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":107413,"prevInTime":107407,"nextInTime":107409,"topicId":107408,"numMessagesInTopic":0,"msgSnippet":"Noelle was very curious about homeschooling/unschooling in a how will your children survive this very uncool thing? kind of way. Some of of her comments and","messageBody":"<div id=\"ygrps-yiv-1757443634\">Noelle was very curious about homeschooling/unschooling in a &quot;how <br/>\nwill your <br/>\nchildren survive this very uncool thing?&quot; kind of way.<br/>\n<br/>\nSome of of her comments and questions:<br/>\n<br/>\nNoelle:  If you homeschool them in high school and they are <br/>\nteenagers when will they go to bed and when will they get up?<br/>\n<br/>\nMe:  They will go to bed when they are tired and get up when they <br/>\nare rested.<br/>\n<br/>\nNoelle: Oh!<br/>\n<br/>\n====================================================================<br/>\n<br/>\nNoelle was incredibly frustrated that my 6 year old daughter Sarah <br/>\nwould not buckle herself in to her booster seat in the car.  <br/>\n<br/>\nNoelle sat on Sarah&#39;s side of the car and I asked Noelle if she <br/>\nwould take on the job of buckling Sarah in when we went somewhere.  <br/>\nNoelle constantly forgot and, rather than get out and buckle the <br/>\nseat belt, Noelle would turn around and try to talk Sarah in to <br/>\ndoing it herself.  Each time this happened I said, &quot;She will do it <br/>\nwhen she is ready&quot; and I would lean back and buckle it myself.<br/>\n<br/>\nOnce, when this happened Noelle snapped, &quot;What if she is never <br/>\nready?&quot;<br/>\n<br/>\nI said, &quot;I hardly think she will go to college in a booster seat.  <br/>\nSomeday she will be ready.&quot;<br/>\n<br/>\n<br/>\n====================================================================<br/>\n<br/>\nNoelle also asked what Sarah and Olivia would do if they wanted to <br/>\ngo to college.<br/>\n<br/>\nI didn&#39;t really understand what she wanted to know so I told her <br/>\nthey would go if they wanted to.<br/>\n<br/>\nNoelle said, &quot;No, I mean how will they know how to take a class if <br/>\nthey&#39;ve never been in class before?&quot;<br/>\n<br/>\nI said, &quot;Just because they haven&#39;t been in class doesn&#39;t mean they <br/>\ndon&#39;t know how to learn.  They do.&quot;<br/>\n<br/>\nNoelle said, &quot;Oh.&quot;<br/>\n<br/>\nI think she might have been wondering how they would know to raise <br/>\ntheir hands, act in class, etc.<br/>\n<br/>\n=====================================================================<br/>\n<br/>\nEarlier in our visit Noelle had told me that children don&#39;t need <br/>\ntheir parents.  Just a few days later she told me this:<br/>\n<br/>\nNoelle:  How do you do school?<br/>\n<br/>\nMe:  We don&#39;t really do school, we just get involved in whatever <br/>\nSarah and Olivia are interested in and we go out a lot and do things.<br/>\n<br/>\nNoelle:  What if they don&#39;t know what they are interested in?<br/>\n<br/>\nMe:  But they do.<br/>\n<br/>\nNoelle:  Little kids don&#39;t know what they want--they need guidance.<br/>\n<br/>\nMe:  I disagree.  In my experience children are born knowing without <br/>\na doubt what they want and then they lose that knowing when school <br/>\nand their parents force it out of them.<br/>\n<br/>\nNoelle:  Well, I don&#39;t know what I want.<br/>\n<br/>\n(Ahh, I thought, this is what it&#39;s really about and how sad that <br/>\nNoelle has already lost that at 14.  Then I started wondering if it <br/>\nwas possible for her to find that knowledge again--is it too late?  <br/>\nI kept offering &quot;The Teen Liberation Handbook&quot; (Grace Llewellyn) but <br/>\nshe wouldn&#39;t take it or even listen to what it was about.)  Maybe <br/>\nshe got a little bit of her self back by argueing with me for 10 <br/>\ndays! <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\nLinda</div>","specialLinks":[]}],"prevTopicId":107398,"nextTopicId":107539}}