{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1658973,"authorName":"Barb Eaton","from":"Barb Eaton &lt;homemama@...&gt;","profile":"homesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] RE: Exercises for Mindful Parenting","postDate":"1044216493","msgId":57637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNjJFNERDLjE1RTdGJWhvbWVtYW1hQGluZmluZXQuY29tPg==","inReplyToHeader":"PDAwMTAwMWMyY2FlNCRmNTE3YjEwMCRiNTU3NTI0NEBjZWxlcm9uMTc+"},"prevInTopic":57622,"nextInTopic":0,"prevInTime":57636,"nextInTime":57638,"topicId":38865,"numMessagesInTopic":0,"msgSnippet":"I think it came from the Building Big book I got last year from their website. I m sure if you google building big you ll find the site. Can t remember any","messageBody":"<div id=\"ygrps-yiv-925234842\">I think it came from the Building Big book I got last year from their<br/>\nwebsite. I&#39;m sure if you google building big you&#39;ll find the site. Can&#39;t<br/>\nremember any others. Good luck. :-)<br/>\n<br/>\nBarb E<br/>\n&quot;No one can make you change.<br/>\nNo one can stop you from changing.<br/>\nNo one really knows how you must change.<br/>\nNot even you.<br/>\nNot until you start. &quot;<br/>\n<br/>\n- Dr. David Viscott, Author and Psychologist<br/>\n<br/>\n<br/>\n<br/>\n<br/>\non 2/2/03 1:00 PM, Have a Nice Day! at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; THats a neat idea.  I&#39;ve never heard of that one.  Where did you get it and<br/>\n&gt; are there others like it??<br/>\n&gt; <br/>\n&gt; Kristen<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":132394532,"authorName":"Have a Nice Day!","from":"Have a Nice Day! &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] RE: Exercises for Mindful Parenting","postDate":"1044208823","msgId":57622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTAwMWMyY2FlNCRmNTE3YjEwMCRiNTU3NTI0NEBjZWxlcm9uMTc+","referencesHeader":"PEJBNjJCRDZGLjE1RTU4JWhvbWVtYW1hQGluZmluZXQuY29tPg=="},"prevInTopic":38901,"nextInTopic":57637,"prevInTime":57621,"nextInTime":57623,"topicId":38865,"numMessagesInTopic":0,"msgSnippet":"THats a neat idea.  I ve never heard of that one.  Where did you get it and are there others like it?? Kristen ... From: Barb Eaton To:","messageBody":"<div id=\"ygrps-yiv-1902827648\">THats a neat idea.  I&#39;ve never heard of that one.  Where did you get it and are there others like it??<br/>\n<br/>\nKristen<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Barb Eaton <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Sunday, February 02, 2003 12:20 PM<br/>\n  Subject: Re: [Unschooling-dotcom] RE: Exercises for Mindful Parenting<br/>\n<br/>\n<br/>\n      Since it is sunday and the paper is so big...Have you made rolled up<br/>\n  tubes and built dome houses (with triangles) and such? It&#39;s a lot of fun.<br/>\n  Cover it and you could take it outside and cover it with snow to make an<br/>\n  igloo. Masking tape to hold the tube together. We used duct tape to join<br/>\n  them together. Now if we&#39;d only get enough snow. I was thinking about<br/>\n  covering with trash bags and putting snow ( a little) over it all. Oh well<br/>\n  we still have this month.<br/>\n<br/>\n  Barb E<br/>\n  &quot;Just as our eyes need light in order to see, our minds<br/>\n  need ideas in order to conceive. &quot;<br/>\n<br/>\n  - Napoleon Hill, Author<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  on 2/2/03 11:12 AM, Angela at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooling@...\">unschooling@...</a> wrote:<br/>\n<br/>\n  &gt; Barb, <br/>\n  &gt; I am in the middle of reading a book by Myla and Jon Kabat-Zinn as we speak.<br/>\n  &gt; If fact, I was just thinking I could go and pick it up AND it is the book<br/>\n  &gt; that those quotes came from.  It is good.  It is called &quot;Everyday Blessings,<br/>\n  &gt; The inner work of mindful parenting.&quot;  It is a book that I need to have some<br/>\n  &gt; semblance of quiet to absorb though.  The kids are busy building houses<br/>\n  &gt; underneath the kitchen chairs, taping construction paper to the rungs with<br/>\n  &gt; doors and windows cut in it, so they are fairly quiet.  Might be a good<br/>\n  &gt; time.  I like having a list like that I can print out and tack up somewhere<br/>\n  &gt; to read often.  Thanks Barb!<br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; Angela in Maine<br/>\n<br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":77615025,"authorName":"Sue","from":"&quot;Sue&quot; &lt;werapfamily@...&gt;","profile":"werapfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Exercises for Mindful Parenting","postDate":"1025655389","msgId":38901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzQwMWMyMjIyNiRlMGNhYmQ4MCRlOTAwYThjMEBzdWViPg==","referencesHeader":"PDAwM2UwMWMyMjFjZCRmODE0MDhiMCQwMjAxYThjMEBhbHBoYXdvbGY2OT4="},"prevInTopic":38865,"nextInTopic":57622,"prevInTime":38900,"nextInTime":38902,"topicId":38865,"numMessagesInTopic":0,"msgSnippet":"... I just absolutely love this piece. I have onforwarded to my partner s email so that he will read it. We have been having some disagreements of late with ","messageBody":"<div id=\"ygrps-yiv-1159196106\"><blockquote><span title=\"ireply\">&gt; Exercises for Mindful Parenting<br/>\n&gt;<br/>\n&gt; With these meditative techniques,<br/>\n&gt;<br/>\n&gt; raising children can be<br/>\n&gt;<br/>\n&gt; a spiritual practice.<br/>\n </span></blockquote>I just absolutely love this piece. I have onforwarded to my partner&#39;s email<br/>\nso that he will read it. We have been having some disagreements of late with<br/>\nthe way he handles the children. His childhood treatment by his farther who<br/>\nwas in the army - you can only imagine - keeps coming thru.<br/>\n<br/>\nSue</div>","specialLinks":[]},{"userId":82877497,"authorName":"Cheryl Duke","from":"&quot;Cheryl Duke&quot; &lt;cheryl@...&gt;","profile":"windysnowdancer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Exercises for Mindful Parenting","postDate":"1025617195","msgId":38865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2UwMWMyMjFjZCRmODE0MDhiMCQwMjAxYThjMEBhbHBoYXdvbGY2OT4="},"prevInTopic":0,"nextInTopic":38901,"prevInTime":38864,"nextInTime":38866,"topicId":38865,"numMessagesInTopic":0,"msgSnippet":"Exercises for Mindful Parenting With these meditative techniques, raising children can be a spiritual practice. by Myla and Jon Kabat-Zinn 1. Try to imagine","messageBody":"<div id=\"ygrps-yiv-324662791\">Exercises for Mindful Parenting <br/>\n<br/>\nWith these meditative techniques,<br/>\n<br/>\nraising children can be<br/>\n<br/>\na spiritual practice.<br/>\n<br/>\n<br/>\nby Myla and Jon Kabat-Zinn <br/>\n<br/>\n1. Try to imagine the world from your child&#39;s point of view, purposefully letting go of your own. Do this every day for at least a few moments to remind you of who this child is and what he or she faces in the world.<br/>\n<br/>\n2. Imagine how you appear and sound from your child&#39;s point of view, i.e., having you as a parent today, in this moment. How might this modify how you carry yourself in your body and in space, how you speak, and what you say? How do you want to relate to your child in this moment?<br/>\n<br/>\n3. Practice seeing your children as perfect just the way they are. See if you can stay mindful of their sovereignty from moment to moment, and work at accepting them as they are when it is hardest for you to do so.<br/>\n<br/>\n4. Be mindful of your expectations of your children and consider whether they are truly in your child&#39;s best interest. Also, be aware of how you communicate those expectations and how they affect your children.<br/>\n<br/>\n5. Practice altruism, putting the needs of your children above your own whenever possible. Then see if there isn&#39;t some common ground, where your true needs can also be met. You may be surprised at how much overlap is possible, especially if you are patient and strive for balance.<br/>\n<br/>\n6. When you feel lost, or at a loss, remember to stand still and meditate on the whole by bringing your full attention to the situation, to your child, to yourself, to the family. In doing so, you may go beyond thinking, even good thinking, and perceive intuitively, with the whole of your being, what needs to be done. If that is not clear in any moment, maybe the best thing is to not do anything until it becomes clearer. Sometimes it is good to remain silent.<br/>\n<br/>\n7. Try embodying silent presence. This will grow out of both formal and informal mindfulness practice over time if you attend to how you carry yourself and what you project in body, mind, and speech. Listen carefully.<br/>\n<br/>\n8. Learn to live with tension without losing your own balance. In Zen and the Art of Archery, Herrigel describes how he was taught to stand at the point of highest tension effortlessly without shooting the arrow. At the right moment, the arrow mysteriously shoots itself. Practice moving into any moment, however difficult, without trying to change anything and without having to have a particular outcome occur. Simply bring your full awareness and presence to this moment. Practice seeing that whatever comes up is &quot;workable&quot; if you are willing to trust your intuition. Your child needs you to be a center of balance and trustworthiness, a reliable landmark by which he or she can take a bearing within his or her own landscape. Arrow and target need each other. They will find each other best through wise attention and patience.<br/>\n<br/>\n9. Apologize to your child when you have betrayed a trust in even a little way. Apologies are healing. An apology demonstrates that you have thought about a situation and have come to see it more clearly, or perhaps more from your child&#39;s point of view. But be mindful of being &quot;sorry&quot; too often. It loses its meaning if you are always saying it, making regret into a habit. Then it can become a way not to take responsibility for your actions. Cooking in remorse on occasion is a good meditation. Don&#39;t shut off the stove until the meal is ready.<br/>\n<br/>\n10. Every child is special, and every child has special needs. Each sees in an entirely unique way. Hold an image of each child in your heart. Drink in their being, wishing them well.<br/>\n<br/>\n11. There are important times when we need to be clear and strong and unequivocal with children. Let this come as much as possible out of awareness, generosity, and discernment, rather than out of fear, self-righteousness, or the desire to control. Mindful parenting does not mean being overindulgent, neglectful, or weak; nor does it mean being rigid, domineering, and controlling.<br/>\n<br/>\n12. The greatest gift you can give your child is your self. This means that part of your work as a parent is to keep growing in self-knowledge and awareness. This ongoing work can be furthered by making a time for quiet contemplation in whatever ways feel comfortable to us. We only have right now. Let us use it to its best advantage, for our children&#39;s sake, and for our own.<br/>\n<br/>\nMindfulness expert Jon Kabat-Zinn is the author of Wherever You Go, There You Are. Myla Kabat-Zinn has worked as a childbirth educator, birthing assistant, and environmental activist. Excerpted from Everyday Blessings: The Inner Work of Mindful Parenting. Copyright 1997 by Myla Kabat-Zinn and Jon Kabat-Zinn.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":57538,"nextTopicId":57527}}