{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":33,"messages":[{"userId":77070457,"authorName":"Sanguinegirl83@aol.com","from":"Sanguinegirl83@...","profile":"sanguinegirl83","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264765009","msgId":50217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzZFRUU3QjAwNzBEMy0zNDc4LUNGRDZAd2VibWFpbC1tMDc4LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGhqdDdnbyttdms3QGVHcm91cHMuY29tPg=="},"prevInTopic":50212,"nextInTopic":50233,"prevInTime":50216,"nextInTime":50218,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1826348240\">&lt;&lt;&lt;So I want to say something about what to do if you DO have a local unschooling support group:<br/>\nShow up, cheerfully, with things to share. Thank the organizer sometimes. If you can help other families, do. If your child isn&#39;t good at sharing or playing with other kids, stay RIGHT by the child, not sitting 30 yards away with moms. Don&#39;t expect that group to make your family happy; find ways for your family to make that group happier.&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI have a lot of experience setting things up in my area as well, and I&#39;d like to add to this suggestion: set something up that your kids won&#39;t mind doing alone, and let them know they *could* be the only ones there. This, especially for areas without a lot of homeschoolers or not a lot of organization.<br/>\n<br/>\nWe tend to think of the things we do &quot;out and about&quot; as things we&#39;re going to do anyway, but we&#39;re letting other folks know where and when we&#39;ll be there, just in case anyone else is interested in joining us. It helps us all feel less disappointed (or not at all) if no one else is of the same mind that day.<br/>\n<br/>\nAlso, in my experience, unschoolers tend to be a &quot;wait and see&quot; kind of group and sometimes will wait to see if a routine gathering is &quot;drama free&quot; before they try it out. It often works well in my area if I set up a &quot;homeschooler&quot; gathering and then if it gets too large, I&#39;ll whittle it down to just the unschooler group, or a group of homeschoolers of like mind (more relaxed and who like their kids) and unschoolers that all get along fairly well.<br/>\n<br/>\nPeace,<br/>\nDe<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":383684458,"authorName":"Jeffrey Lee Pressman","from":"Jeffrey Lee Pressman &lt;keenersoundz@...&gt;","profile":"madlad321","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local  unschooling support group","postDate":"1264745996","msgId":50212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCRjRGOUQzLTAzMzEtNDk1MC04NERGLTM5NTA3OUUyREQzN0BnbWFpbC5jb20+","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI4MDYwN3g0ZmM0MzM0ZXgxZjYxZjc0YjU0YzVkMzdjQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPiA8OUJFRjEzNzAtMTRGQy00RjkxLUEwRjktNzFEQUY3NkU3OTlFQFNhbmRyYWRvZGQuY29tPiA8NzljMWQxYjQxMDAxMjgwNTAyeTJlN2VhZjF2YzMxMmFlMmM1NWQyMzFkMUBtYWlsLmdtYWlsLmNvbT4gPDJDNEYyRTYyLThBRTctNDg5Ri05ODUzLTU1NjMxRTg1RjdCMkBTYW5kcmFkb2RkLmNvbT4gPDc5YzFkMWI0MTAwMTI4MDYwN3g0ZmM0MzM0ZXgxZjYxZjc0YjU0YzVkMzdjQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50198,"nextInTopic":50217,"prevInTime":50211,"nextInTime":50213,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"Newcomer, first post.  I m struck by the sensitive sophisticated dialogue here.  Hats off to that.  Close reading of common expressions such as expose my","messageBody":"<div id=\"ygrps-yiv-821216042\">Newcomer, first post.  I&#39;m struck by the sensitive sophisticated  <br/>\ndialogue here.  Hats off to that.  Close reading of common expressions  <br/>\nsuch as &quot;expose my child to x&quot; puts me in mind of my prenatal dad  <br/>\ndreams.  Before my daughter Issa, now three, was born, I indulged  <br/>\nmyself in countless fantasies of all that I would provide, inspire,  <br/>\nand expose her to, this blank slate on which I would proudly inscribe  <br/>\nmy cherished passions.  As yet unborn, Issa herself had no say in the  <br/>\nmatter.  It was, I&#39;ve since come to realize, a purely self- <br/>\naggrandizing exercise.  Still, to &quot;expose&quot; is not, I think, a bad  <br/>\nimpulse or wrong idea.  I made Issa a CD of Britten&#39;s Young Person&#39;s  <br/>\nGuide to the Orchestra to introduce her to something I loved.  To my  <br/>\ndelight, it was an instant hit, played over and over.  We slap it on  <br/>\nand have a little blast conducting the orchestra and leaping about  <br/>\nmiming all the instruments.  Just one example of how &quot;expose&quot; becomes  <br/>\n&quot;engage.&quot;<br/>\nJeffrey<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 28, 2010, at 9:07 AM, Vidyut Kale wrote:<br/>\n<br/>\n&gt; Yes, I&#39;m familiar with it. Its just that &#39;expose&#39; is something I do to<br/>\n&gt; another with no real place for the state of the another. It fits  <br/>\n&gt; well for<br/>\n&gt; things too. It smells of my objectives and shoulds, addressed. That  <br/>\n&gt; is the<br/>\n&gt; construct.<br/>\n&gt;<br/>\n&gt; If I am a musician, its unlikely I&#39;ll expose my child to music. I&#39;m  <br/>\n&gt; more<br/>\n&gt; likely to sing, dance, introduce her to my band, or even encourage  <br/>\n&gt; her to<br/>\n&gt; make music, learn music..... something that acknowledges her role in  <br/>\n&gt; it,<br/>\n&gt; because I&#39;m saying &quot;hello, my love, music! Meet my love, my son&quot;.  <br/>\n&gt; Even if<br/>\n&gt; its not my passion, but my son likes it, I&#39;m likely to go &quot;My son  <br/>\n&gt; enjoys<br/>\n&gt; music. I&#39;m going to see if I can rig up opera passes.&quot; It really gets<br/>\n&gt; bizarre to connect expose with my son. &quot;My son loves music. I&#39;m  <br/>\n&gt; going to<br/>\n&gt; expose him to the opera?&quot;<br/>\n&gt;<br/>\n&gt; But this is theory.<br/>\n&gt;<br/>\n&gt; I&#39;m going to do some observation data gathering on the use of this  <br/>\n&gt; and its<br/>\n&gt; alternatives to see if there is any noticeable link with sensitivity  <br/>\n&gt; to the<br/>\n&gt; child that gets enacted, or its &#39;empty words&#39; like an atheist  <br/>\n&gt; exclaiming &#39;my<br/>\n&gt; god&#39; with no real thinking behind them.<br/>\n&gt;<br/>\n&gt; Should be interesting.<br/>\n&gt;<br/>\n&gt; Vidyut<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264722264","msgId":50198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqdDdnbyttdms3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNjFCNzExLjMwNzAyMDJAdHdjbnkucnIuY29tPg=="},"prevInTopic":50196,"nextInTopic":50212,"prevInTime":50197,"nextInTime":50199,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"-=-Both times we moved we considered what would work for the kids before moving. We intentionally chose areas where there were homeschooling and unschooling","messageBody":"<div id=\"ygrps-yiv-1839520018\">-=-Both times we moved we considered <br/>\nwhat would work for the kids before moving. We intentionally chose areas <br/>\nwhere there were homeschooling and unschooling groups. Sometimes those <br/>\ngroups didn&#39;t turn out to be what they said they were, or they changed. -=-<br/>\n<br/>\nMy &quot;what do we owe people&quot; warning lights flashed.<br/>\n<br/>\nNot to talk about that one particular situation, but in general:<br/>\n<br/>\nPeople whose kids are in school will sell a house and move to get near a school they&#39;ve been assured is &quot;better.&quot;  When Conan O&#39;Brien&#39;s stint as Tonight Show host was cancelled recently, some of the worst complaint of his staff was that they had sold houses and moved to California and put their kids in school, and now right in the middle of a school year their jobs were lost.<br/>\n<br/>\nIf unschoolers are going to move because of groups, run by volunteers, that&#39;s MUCH less stable than moving to put kids in another school that&#39;s still a school.<br/>\n<br/>\nI used to run an unschooling park day, every week (often at my house, if the weather was bad; at parks to which I had drawn and printed fun maps, for many years when we did &quot;explores&quot; of other parks in the area).  My kids put in a lot of effort, cleaning, food help, shared toys...   The idea that someone would say (and some did) that the group didn&#39;t turn out to be what they&#39;d thought it would be or that the group changed makes me bristle, and it&#39;s been ten years since that group ceased to be because some of the other moms didn&#39;t like a newly arrived and flamboyant single mom, and I let that be the death of the group because the kids were tired of it, too.  <br/>\n<br/>\nSome families were disappointed that that group ceased to be, but none of them could get it together to even name a park and show up every week.  It&#39;s not as easy as it seems.  Many of our &quot;regular&quot; families would only come once or twice a month.  There was one week when we were the only ones there, and it was cold, but we waited so that another family wouldn&#39;t be disappointed.<br/>\n<br/>\nSo I want to say something about what to do if you DO have a local unschooling support group:<br/>\nShow up, cheerfully, with things to share.  Thank the organizer sometimes.  If you can help other families, do.  If your child isn&#39;t good at sharing or playing with other kids, stay RIGHT by the child, not sitting 30 yards away with moms.  Don&#39;t expect that group to make your family happy; find ways for your family to make that group happier.<br/>\n<br/>\nThis comes back to the morning&#39;s (or last evening&#39;s) idea about whose needs should &quot;trump.&quot;   Generosity and service might be reflected back on people who give them.  Nobody&#39;s generosity or service is guaranteed or required or to be taken for granted.  Other unschoolers don&#39;t owe anyone anything.  Some are helpful because they want to be.<br/>\n<br/>\nMy e-mail isn&#39;t working today.  I can get it in, but not send it out.  It&#39;s very frustrating.  I won&#39;t pull the plug on the Always Learning list, though, because I feel a commitment to the people who appreciate it.  Even on a week when I can&#39;t mail out and have been insulted three times (three is not a charm in such a case), I&#39;m going to keep this list available.<br/>\n<br/>\nIf someone does get a local group together, don&#39;t expect that it will last forever.  <br/>\n<br/>\nSandra<br/>\n<br/>\n(my outgoing e-mail is messed up, so I&#39;m writing directly from the webpage, in case I look unfamiliar)</div>","specialLinks":[]},{"userId":286002181,"authorName":"Sunnyoneof1@aol.com","from":"Sunnyoneof1@...","profile":"sunny1of1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264713663","msgId":50196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzZFNzZFRTZBREFEQi00MjM4LUM4QTNAd2VibWFpbC1tMDg0LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGhqc2Y4MStpc2JvQGVHcm91cHMuY29tPg=="},"prevInTopic":50194,"nextInTopic":50198,"prevInTime":50195,"nextInTime":50197,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"Gabi, That is what I was going through mine is so very social! He was asking to go back to be with friends, I knew he would miss the freedoms to learn when and","messageBody":"<div id=\"ygrps-yiv-915210864\">Gabi,<br/>\nThat is what I was going through mine is so very social! He was asking to go back to be with friends, I knew he<br/>\nwould miss the freedoms to learn when and where and how he wanted to, he was not a good candidate for going back to public school, so I started my group. Now he has tons of friends, we have activities at least two days a week, field trips, game day, skating, etc. He has found his place in the sun! Makes mom work really hard but I am not complaining at all! I actually have so many cool homescooling friends now. If I hadn&#39;t done this we wouldn&#39;t be where we are now. Cheryl<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: gabihugs &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gabihugs@...\">gabihugs@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Thu, Jan 28, 2010 10:50 am<br/>\nSubject: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group<br/>\n<br/>\n<br/>\n  <br/>\n    <br/>\n                  <br/>\nWe have groups, it wasn&#39;t enough for my twelve year old. She wanted to go back to school, since my ex (and his mom) never was really on board with homeschooling he pushed to let her go back. She was begging. So she is back and happy to be with her friends again (she was always a popular one). Before you ask while she was homeschooling she took band at the school four days out of the week, ballet three times per week, and choir once a week. So no, she was not isolated, she just complained of missing friends.<br/>\n<br/>\nSince I don&#39;t have that problem with my little ones, I suggest park dates and sometimes they want to go and sometimes they don&#39;t. They seem happy and content though they do ask for big sister. We miss her, but she seems happy, still hoping she&#39;ll want to come back again.<br/>\n<br/>\nOur city is not big but we have a choice between weekly park days and activities with four different homeschool groups and I&#39;m pretty sure there are two or three others, plus PE days and other activities, museum trips. We are very choosy.<br/>\n<br/>\nGabi<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;zurro&quot; &lt;zurrolaur@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; these have all been very helpful! I especially hadn&#39;t really thought about other people&#39;s influences but it does make sense. My husband is quite the introvert and will almost never go to anything social or wehre he really needs to talk to other people. I am not quite that extreme but I do have my issues with groups and do better one on one. I think part of the worry is that I was thinking to have our daughter at least gently exposed to other people because if I didn&#39;t it would be detrimental. But now I&#39;m rethinking that. We&#39;ve talked about living in a place where there wouldn&#39;t be a lot of possibility for social interaction but I was thinking that would be idea. <br/>\n&gt; <br/>\n&gt; If anyone else has any more to say, please do so. This has been really helpful, particularly since we&#39;re still so early in our journey - dd only turned 3 recently. <br/>\n&gt; <br/>\n&gt; Laura Z<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;J&quot; &lt;jmarsh122@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; &gt; No support groups here.  No friends either.  But my dc are still thriving and very happy where they are (despite my worries).  <br/>\n&gt; &gt; <br/>\n&gt; &gt; My dc love manga, PSP games, videos, sewing figures (and laughing hysterically), and watching Netflix videos.  I can&#39;t tell you how wonderful unschooling has been. My children are so happy!<br/>\n&gt; &gt; <br/>\n&gt; &gt; Jean<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n    <br/>\n             <br/>\n<br/>\n  <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264711057","msgId":50189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMTU4NC4xNDA4Ni5xbUB3ZWIxMTA0MTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDZDRkQ1N0IyLTY1QTctNEQ3MC1BNzhDLUU4NDkwMDU3QkZEMkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPiA8OUJFRjEzNzAtMTRGQy00RjkxLUEwRjktNzFEQUY3NkU3OTlFQFNhbmRyYWRvZGQuY29tPiA8NzljMWQxYjQxMDAxMjgwNTAyeTJlN2VhZjF2YzMxMmFlMmM1NWQyMzFkMUBtYWlsLmdtYWlsLmNvbT4gPDJDNEYyRTYyLThBRTctNDg5Ri05ODUzLTU1NjMxRTg1RjdCMkBTYW5kcmFkb2RkLmNvbT4gPDZDRkQ1N0IyLTY1QTctNEQ3MC1BNzhDLUU4NDkwMDU3QkZEMkB2ZXJpem9uLm5ldD4="},"prevInTopic":50187,"nextInTopic":50191,"prevInTime":50188,"nextInTime":50190,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"***Oh! There are probably people here too young to remember the Expose yourself to art poster. It was 1978. It was cute :-)*** http://tinyurl. com/y8zvzot I","messageBody":"<div id=\"ygrps-yiv-137345882\">***Oh! There are probably people here too young to remember the &quot;Expose <br/>\nyourself to art&quot; poster. It was 1978. It was cute :-)***<br/>\n<br/>\nhttp://tinyurl. com/y8zvzot<br/>\n<br/>\n<br/>\nI love that this statue is in Portland and I can go downtown and see it!  That guy was the mayor in Portland for while!  It was a very popular poster around here when I was a kid.  One of my teachers had it in her classroom.  She also had us read &quot;Far Side&quot; during our reading times because she was friends with Gary Larson.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264697522","msgId":50187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MTY3Ni40MzM4OC5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDlCRUYxMzcwLTE0RkMtNEY5MS1BMEY5LTcxREFGNzZFNzk5RUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPiA8OUJFRjEzNzAtMTRGQy00RjkxLUEwRjktNzFEQUY3NkU3OTlFQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":50186,"nextInTopic":50189,"prevInTime":50186,"nextInTime":50188,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"I live rurally in a Dairy Farm but I am only 8 miles from town. So its the perfect combination of being out in the country with the advntages of town. And","messageBody":"<div id=\"ygrps-yiv-678729720\">I live rurally in a Dairy Farm but I am only 8 miles from town. <br/>\nSo its the perfect combination of being out in the country with the advntages of town.<br/>\nAnd you can get your driving permit here at 15.<br/>\nWe do participate in homeschool groups.<br/>\nThere is only one other undchooling family where I live. <br/>\nBut there are other nice homeschool families , some I know from La Leche.<br/>\nMD used to have a huge need of friends and GIgi likes play with her friends too.<br/>\nIT really depends of the kids. Mine are pretty social like me.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":93577737,"authorName":"gabihugs","from":"&quot;gabihugs&quot; &lt;gabihugs@...&gt;","profile":"gabihugs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264697409","msgId":50191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqc2Y4MStpc2JvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPg=="},"prevInTopic":50189,"nextInTopic":50194,"prevInTime":50190,"nextInTime":50192,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"We have groups, it wasn t enough for my twelve year old. She wanted to go back to school, since my ex (and his mom) never was really on board with","messageBody":"<div id=\"ygrps-yiv-630080557\">We have groups, it wasn&#39;t enough for my twelve year old. She wanted to go back to school, since my ex (and his mom) never was really on board with homeschooling he pushed to let her go back. She was begging. So she is back and happy to be with her friends again (she was always a popular one). Before you ask while she was homeschooling she took band at the school four days out of the week, ballet three times per week, and choir once a week. So no, she was not isolated, she just complained of missing friends.<br/>\n<br/>\nSince I don&#39;t have that problem with my little ones, I suggest park dates and sometimes they want to go and sometimes they don&#39;t. They seem happy and content though they do ask for big sister. We miss her, but she seems happy, still hoping she&#39;ll want to come back again.<br/>\n<br/>\nOur city is not big but we have a choice between weekly park days and activities with four different homeschool groups and I&#39;m pretty sure there are two or three others, plus PE days and other activities, museum trips. We are very choosy.<br/>\n<br/>\nGabi<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;zurro&quot; &lt;zurrolaur@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; these have all been very helpful! I especially hadn&#39;t really thought about other people&#39;s influences but it does make sense. My husband is quite the introvert and will almost never go to anything social or wehre he really needs to talk to other people. I am not quite that extreme but I do have my issues with groups and do better one on one. I think part of the worry is that I was thinking to have our daughter at least gently exposed to other people because if I didn&#39;t it would be detrimental. But now I&#39;m rethinking that. We&#39;ve talked about living in a place where there wouldn&#39;t be a lot of possibility for social interaction but I was thinking that would be idea. <br/>\n&gt; <br/>\n&gt; If anyone else has any more to say, please do so. This has been really helpful, particularly since we&#39;re still so early in our journey - dd only turned 3 recently. <br/>\n&gt; <br/>\n&gt; Laura Z<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;J&quot; &lt;jmarsh122@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; &gt; No support groups here.  No friends either.  But my dc are still thriving and very happy where they are (despite my worries).  <br/>\n&gt; &gt; <br/>\n&gt; &gt; My dc love manga, PSP games, videos, sewing figures (and laughing hysterically), and watching Netflix videos.  I can&#39;t tell you how wonderful unschooling has been. My children are so happy!<br/>\n&gt; &gt; <br/>\n&gt; &gt; Jean<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264695057","msgId":50194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNjFCNzExLjMwNzAyMDJAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPg=="},"prevInTopic":50191,"nextInTopic":50196,"prevInTime":50193,"nextInTime":50195,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"We have moved to different areas twice since we  had kids. We knew from an early age with both our kids that they were people who liked frequent social","messageBody":"<div id=\"ygrps-yiv-294366377\">We have moved to different areas twice since we  had kids. We knew from <br/>\nan early age with both our kids that they were people who liked frequent <br/>\nsocial interactions with more than just their parents. (though of course <br/>\nthat has varied at different times). Both times we moved we considered <br/>\nwhat would work for the kids before moving. We intentionally chose areas <br/>\nwhere there were homeschooling and unschooling groups. Sometimes those <br/>\ngroups didn&#39;t turn out to be what they said they were, or they changed. <br/>\nI have also done a lot of work to start groups of different kinds. ALL <br/>\nin response to what my kids expressed a need for, though.<br/>\n<br/>\nIt would be cool if my kids were happy living remotely, but they really <br/>\nwouldn&#39;t be. As teenagers even less so. My husband and I might move to a <br/>\nmore remote location when they grow up, but since we have a choice, we <br/>\nstay in an area that works better for the kids. Some people may not be <br/>\nable to move to  a location with more support and social opportunities <br/>\nfor unschoolers, or may not need to, but some can move for those <br/>\nreasons, and do. Some families have come to our area for just that <br/>\nreason. Including us, but we have family in the area, too.<br/>\n<br/>\nHeather in NY<br/>\n<br/>\nzurro wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt;<br/>\n&gt; these have all been very helpful! I especially hadn&#39;t really thought <br/>\n&gt; about other people&#39;s influences but it does make sense. My husband is <br/>\n&gt; quite the introvert and will almost never go to anything social or <br/>\n&gt; wehre he really needs to talk to other people. I am not quite that <br/>\n&gt; extreme but I do have my issues with groups and do better one on one. <br/>\n&gt; I think part of the worry is that I was thinking to have our daughter <br/>\n&gt; at least gently exposed to other people because if I didn&#39;t it would <br/>\n&gt; be detrimental. But now I&#39;m rethinking that. We&#39;ve talked about living <br/>\n&gt; in a place where there wouldn&#39;t be a lot of possibility for social <br/>\n&gt; interaction but I was thinking that would be idea.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":79338309,"authorName":"maaamaaaa!","from":"&quot;maaamaaaa!&quot; &lt;pookycat2000@...&gt;","profile":"pookycat2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264692480","msgId":50186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqc2FlMCs3dGZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1Nzg0Ni4yMjk1OS5xbUB3ZWI0NTEwMS5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":50181,"nextInTopic":50187,"prevInTime":50185,"nextInTime":50187,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"{{{I guess I worry that I am not opening up the world enough for them and that is what gets me all frazzled. Yet, I am seeing that more than anything it is the","messageBody":"<div id=\"ygrps-yiv-472086093\">{{{I guess I worry that I am not opening up the world enough<br/>\nfor them and that is what gets me all frazzled. Yet, I am seeing that more than anything it is the connection between me and them....focusing on really listening to what they want.}}}<br/>\n<br/>\nThat&#39;s been my worry too lately.  We live in a rural area and at the moment we are pinching pennies so we spend a lot of time at home or in local parks and the library.  I would love to be able to get the kids out more and explore but until our finacial situation improves I try to do the best that I can with what we do have.  <br/>\nSocially we do belong to some homeschool groups but we rarely get to their park days because they meet at times that are just not convenient for us and we can&#39;t afford to be part of their field trips right now.  I must say though that my kids seem to be ok. My oldest 9yoDD is the social butterfly.  She can make friends with every girl at the park with in the first 5 minutes we are there.  She also has a BFF she met at church and they see each other often at AWANA club and for sleep overs.  My 5yoDD is polar opposite of my 9yoDD. She seems perfectly happy playing on her own in any situation.  Sometimes she does make friends at that park and she plays with kids who visit us, but she seems to prefer being by herself doing her own thing.  I also have a 3yoDS and a 1yoDD but they also seem happy just being with me and their siblings for now.  As for me, I&#39;m perfectly happy spending my days at home with my kids and hubby.  I get enough social interaction from my friends on line and groups like this one. I know some people might think that&#39;s not good, but that is just how I feel now.  I used to be a social butterfly just like my 9yoDD, but since having children my desire to spend time with friends has diminished. Maybe someday that desire will return, but for now I&#39;m good.   <br/>\n<br/>\nRosy<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Kelli Johnston &lt;kaipelesmom@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; The below idea is resonating with me. Most weeks I drive myself crazy trying to find activities and groups for my kids but honestly they seem more interested in being at home with me. I guess I worry that I am not opening up the world enough for them and that is what gets me all frazzled. Yet I am seeing that more than anything it is the connection between me and them....focusing on really listening to what they want. <br/>\n&gt; <br/>\n&gt; All my best--Kelli <br/>\n&gt; Sent from my iFriend<br/>\n&gt; <br/>\n&gt; On Jan 27, 2010, at 5:43 PM, &quot;Joanna&quot; &lt;ridingmom@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin Bentley &lt;robin.bentley@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; If I had to do it over again, I would do less &quot;social interaction&quot; and <br/>\n&gt; &gt; more making our home rich and interesting (not that it wasn&#39;t - I just <br/>\n&gt; &gt; would have done even more). <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I&#39;m wondering, now, if homeschoolers/unschoolers might be over-emphasizing the whole friends thing as a part of letting go of our own childhoods. Friendships were probably so important to many of us, who didn&#39;t feel the connections at home, but the reality is different for our children. My son didn&#39;t really even want friends until he turned 12. And still, he can take or leave them on any given day. He&#39;s enjoyed other kids, but it wasn&#39;t a need for him like is has been for me. My daughter too, to some degree, although she&#39;s always been more social, isn&#39;t craving constant playdates like I thought she would. <br/>\n&gt; <br/>\n&gt; That isn&#39;t to say that there my be kids who do. But maybe there is a lot more socializing going on than is necessary. Maybe that&#39;s something that the next generation of unschoolers--who haven&#39;t been to school--will do differently than we have. Maybe they&#39;ll have more confidence socially and more connection to what their kids actually need... hmmm...<br/>\n&gt; <br/>\n&gt; Joanna<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local \tunschooling support group","postDate":"1264687899","msgId":50179,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI4MDYxMWk0ZTI2YTI1a2ZkMzA1YWNlYTFkYjNlZDVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDZDRkQ1N0IyLTY1QTctNEQ3MC1BNzhDLUU4NDkwMDU3QkZEMkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPgkgPDlCRUYxMzcwLTE0RkMtNEY5MS1BMEY5LTcxREFGNzZFNzk5RUBTYW5kcmFkb2RkLmNvbT4JIDw3OWMxZDFiNDEwMDEyODA1MDJ5MmU3ZWFmMXZjMzEyYWUyYzU1ZDIzMWQxQG1haWwuZ21haWwuY29tPgkgPDJDNEYyRTYyLThBRTctNDg5Ri05ODUzLTU1NjMxRTg1RjdCMkBTYW5kcmFkb2RkLmNvbT4JIDw2Q0ZENTdCMi02NUE3LTRENzAtQTc4Qy1FODQ5MDA1N0JGRDJAdmVyaXpvbi5uZXQ+"},"prevInTopic":50178,"nextInTopic":50181,"prevInTime":50178,"nextInTime":50180,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"This is exactly what I was saying. Thanks. This is a keeper. Vidyut ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1167032933\">This is exactly what I was saying. Thanks. This is a keeper.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jan 28, 2010 at 7:34 PM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Jan 28, 2010, at 8:39 AM, Sandra Dodd wrote:<br/>\n&gt;<br/>\n&gt; &gt; It&#39;s a common term, &quot;to expose a child to art&quot;<br/>\n&gt;<br/>\n&gt; Oh! There are probably people here too young to remember the &quot;Expose<br/>\n&gt; yourself to art&quot; poster. It was 1978. It was cute :-)<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/y8zvzot\">http://tinyurl.com/y8zvzot</a><br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local \tunschooling support group","postDate":"1264687641","msgId":50178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI4MDYwN3g0ZmM0MzM0ZXgxZjYxZjc0YjU0YzVkMzdjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDJDNEYyRTYyLThBRTctNDg5Ri05ODUzLTU1NjMxRTg1RjdCMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPgkgPDlCRUYxMzcwLTE0RkMtNEY5MS1BMEY5LTcxREFGNzZFNzk5RUBTYW5kcmFkb2RkLmNvbT4JIDw3OWMxZDFiNDEwMDEyODA1MDJ5MmU3ZWFmMXZjMzEyYWUyYzU1ZDIzMWQxQG1haWwuZ21haWwuY29tPgkgPDJDNEYyRTYyLThBRTctNDg5Ri05ODUzLTU1NjMxRTg1RjdCMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50177,"nextInTopic":50179,"prevInTime":50177,"nextInTime":50179,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"Yes, I m familiar with it. Its just that expose is something I do to another with no real place for the state of the another. It fits well for things too. It","messageBody":"<div id=\"ygrps-yiv-1269679570\">Yes, I&#39;m familiar with it. Its just that &#39;expose&#39; is something I do to<br/>\nanother with no real place for the state of the another. It fits well for<br/>\nthings too. It smells of my objectives and shoulds, addressed. That is the<br/>\nconstruct.<br/>\n<br/>\nIf I am a musician, its unlikely I&#39;ll expose my child to music. I&#39;m more<br/>\nlikely to sing, dance, introduce her to my band, or even encourage her to<br/>\nmake music, learn music..... something that acknowledges her role in it,<br/>\nbecause I&#39;m saying &quot;hello, my love, music! Meet my love, my son&quot;. Even if<br/>\nits not my passion, but my son likes it, I&#39;m likely to go &quot;My son enjoys<br/>\nmusic. I&#39;m going to see if I can rig up opera passes.&quot; It really gets<br/>\nbizarre to connect expose with my son. &quot;My son loves music. I&#39;m going to<br/>\nexpose him to the opera?&quot;<br/>\n<br/>\nBut this is theory.<br/>\n<br/>\nI&#39;m going to do some observation data gathering on the use of this and its<br/>\nalternatives to see if there is any noticeable link with sensitivity to the<br/>\nchild that gets enacted, or its &#39;empty words&#39; like an atheist exclaiming &#39;my<br/>\ngod&#39; with no real thinking behind them.<br/>\n<br/>\nShould be interesting.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264687460","msgId":50176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDRkQ1N0IyLTY1QTctNEQ3MC1BNzhDLUU4NDkwMDU3QkZEMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDJDNEYyRTYyLThBRTctNDg5Ri05ODUzLTU1NjMxRTg1RjdCMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPiA8OUJFRjEzNzAtMTRGQy00RjkxLUEwRjktNzFEQUY3NkU3OTlFQFNhbmRyYWRvZGQuY29tPiA8NzljMWQxYjQxMDAxMjgwNTAyeTJlN2VhZjF2YzMxMmFlMmM1NWQyMzFkMUBtYWlsLmdtYWlsLmNvbT4gPDJDNEYyRTYyLThBRTctNDg5Ri05ODUzLTU1NjMxRTg1RjdCMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50175,"nextInTopic":50177,"prevInTime":50175,"nextInTime":50177,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"... Oh! There are probably people here too young to remember the Expose yourself to art poster. It was 1978. It was cute :-) http://tinyurl.com/y8zvzot Joyce","messageBody":"<div id=\"ygrps-yiv-2835012\">On Jan 28, 2010, at 8:39 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s a common term, &quot;to expose a child to art&quot;<br/>\n<br/>\n </span></blockquote>Oh! There are probably people here too young to remember the &quot;Expose  <br/>\nyourself to art&quot; poster. It was 1978. It was cute :-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/y8zvzot\">http://tinyurl.com/y8zvzot</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128237955,"authorName":"Beth Danicke","from":"&quot;Beth Danicke&quot; &lt;saremca@...&gt;","profile":"saremca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264687437","msgId":50181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMEYzN0M2QzE1NjRFOUZCNUNEN0JEMEM1OEVDMkIwQEZBTUlMWVJPT00+","inReplyToHeader":"PEE5NzAyNEQzLTJBMEQtNDEzNi04N0I2LTBENTYwODRDNkJBQkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhqcWZqYytocXVtQGVHcm91cHMuY29tPiA8QTk3MDI0RDMtMkEwRC00MTM2LTg3QjYtMEQ1NjA4NEM2QkFCQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":50179,"nextInTopic":50186,"prevInTime":50180,"nextInTime":50182,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"= =I m wondering, now, if homeschoolers/unschoolers might be over- emphasizing the whole friends thing as a part of letting go of our own childhoods.","messageBody":"<div id=\"ygrps-yiv-82022322\">=&#92;=I&#39;m wondering, now, if homeschoolers/unschoolers might be over- <br/>\nemphasizing the whole friends thing as a part of letting go of our own  <br/>\nchildhoods. Friendships were probably so important to many of us, who  <br/>\ndidn&#39;t feel the connections at home, but the reality is different for  <br/>\nour children. My son didn&#39;t really even want friends until he turned  <br/>\n12. And still, he can take or leave them on any given day. He&#39;s  <br/>\nenjoyed other kids, but it wasn&#39;t a need for him like is has been for  <br/>\nme. =&#92;=<br/>\n<br/>\nThis is such a great piece of wisdom.  One thing I love about this list is<br/>\nthat so many times the thoughts and ideas are exactly what I need to hear.  <br/>\n<br/>\nCaleb has grown up with the occasional friend in the neighborhood, but our<br/>\nneighborhood is kind of transient, mostly first time home buyers who stay<br/>\n3-4 years and then move on to something bigger.  So there are periods of<br/>\ntime when there are kids his age and times when there are not.  He hasn&#39;t<br/>\nreally been into making or having friends for the past few years and it has<br/>\nbothered me.  I&#39;ve offered different opportunities to meet other people and<br/>\nmake friends with similar interests, but he has always declined.  The other<br/>\nday I asked him about going to a board game day that one of the support<br/>\ngroups is having on Sunday and again he said &quot;No thanks.&quot;  I said &quot;Caleb,<br/>\ndon&#39;t you want to make some friends?&quot; and he said &quot;I already have friends.<br/>\nYou and Dad and Sarah and Emma and Nate and Noah (cousins) are my friends.&quot;<br/>\n<br/>\nI remember cherishing my close friends in school, but I also remember<br/>\nfeeling lost in the shuffle and socially awkward and very shy, and I suppose<br/>\nmy friends were a lifeline of sorts that my son doesn&#39;t feel he needs.<br/>\n<br/>\nBeth</div>","specialLinks":[]},{"userId":212477143,"authorName":"pamelahjn","from":"&quot;pamelahjn&quot; &lt;lilytrinity711@...&gt;","profile":"pamelahjn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264686674","msgId":50177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqczRvaStqMDU2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPg=="},"prevInTopic":50176,"nextInTopic":50178,"prevInTime":50176,"nextInTime":50178,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"... I grew up as a shy child and I went to public school. I think if I was homeschooled people would of said that was the reason I was so shy. I have two","messageBody":"<div id=\"ygrps-yiv-248408074\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;zurro&quot; &lt;zurrolaur@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; these have all been very helpful! I especially hadn&#39;t really thought about other people&#39;s influences but it does make sense. My husband is quite the introvert and will almost never go to anything social or wehre he really needs to talk to other people. I am not quite that extreme but I do have my issues with groups and do better one on one. I think part of the worry is that I was thinking to have our daughter at least gently exposed to other people because if I didn&#39;t it would be detrimental. But now I&#39;m rethinking that. We&#39;ve talked about living in a place where there wouldn&#39;t be a lot of possibility for social interaction but I was thinking that would be idea. <br/>\n&gt; <br/>\n&gt; If anyone else has any more to say, please do so. This has been really helpful, particularly since we&#39;re still so early in our journey - dd only turned 3 recently. <br/>\n&gt; <br/>\n&gt; Laura Z<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;J&quot; &lt;jmarsh122@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; &gt; No support groups here.  No friends either.  But my dc are still thriving and very happy where they are (despite my worries).  <br/>\n&gt; &gt; <br/>\n&gt; &gt; My dc love manga, PSP games, videos, sewing figures (and laughing hysterically), and watching Netflix videos.  I can&#39;t tell you how wonderful unschooling has been. My children are so happy!<br/>\n&gt; &gt; <br/>\n&gt; &gt; Jean<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n </span></blockquote>I grew up as a shy child and I went to public school. I think if I was homeschooled people would of said that was the reason I was so shy.<br/>\nI have two children 5 year old daughter and a 2 year old son. We have no support groups here or friends. My DD is very outgoing and loves to talk to anyone when we are out. My son is shy at first but then opens up too!<br/>\nThanks for the great post and for sharing. This has helped me as well.<br/>\nPamela</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local  unschooling support group","postDate":"1264685993","msgId":50175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJDNEYyRTYyLThBRTctNDg5Ri05ODUzLTU1NjMxRTg1RjdCMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI4MDUwMnkyZTdlYWYxdmMzMTJhZTJjNTVkMjMxZDFAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPiA8OUJFRjEzNzAtMTRGQy00RjkxLUEwRjktNzFEQUY3NkU3OTlFQFNhbmRyYWRvZGQuY29tPiA8NzljMWQxYjQxMDAxMjgwNTAyeTJlN2VhZjF2YzMxMmFlMmM1NWQyMzFkMUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":50173,"nextInTopic":50176,"prevInTime":50174,"nextInTime":50176,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"People can die of exposure!  ;-) It s a common term, to expose a child to art or opera or museums or whatever, but it s worth considering other terminology. ","messageBody":"<div id=\"ygrps-yiv-1187735364\">People can die of exposure!  ;-)<br/>\n<br/>\nIt&#39;s a common term, &quot;to expose a child to art&quot; or opera or museums or  <br/>\nwhatever, but it&#39;s worth considering other terminology.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local \tunschooling support group","postDate":"1264683728","msgId":50173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI4MDUwMnkyZTdlYWYxdmMzMTJhZTJjNTVkMjMxZDFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDlCRUYxMzcwLTE0RkMtNEY5MS1BMEY5LTcxREFGNzZFNzk5RUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPgkgPDlCRUYxMzcwLTE0RkMtNEY5MS1BMEY5LTcxREFGNzZFNzk5RUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50170,"nextInTopic":50175,"prevInTime":50172,"nextInTime":50174,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"Just a thought. I expose film and other objects. I introduce people to people they may find interesting when opportunities arise. I imagine I d do the same if","messageBody":"<div id=\"ygrps-yiv-541924807\">Just a thought. I expose film and other objects. I introduce people to<br/>\npeople they may find interesting when opportunities arise. I imagine I&#39;d do<br/>\nthe same if I met someone or found a group or class or community that my son<br/>\nmight like. The objective wouldn&#39;t be so much doing anything &#39;for his good&#39;<br/>\nor &#39;avoiding bad&#39;, but because it would likely be something he&#39;d enjoy.<br/>\n<br/>\nI understand that you simply mean offering him opportunities to interact and<br/>\nare not &#39;objectifying&#39; him.<br/>\n<br/>\nJust sharing this, because sometimes my mental constructs change my actions<br/>\nout of alignment with my intentions and its difficult to spot it on my own.<br/>\nPeople will usually spot the incongruence faster than I can, while all I can<br/>\nfigure out is a vague dissatisfaction over results.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264682328","msgId":50170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCRUYxMzcwLTE0RkMtNEY5MS1BMEY5LTcxREFGNzZFNzk5RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPg=="},"prevInTopic":50169,"nextInTopic":50173,"prevInTime":50169,"nextInTime":50171,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"-=-I was thinking to have our daughter at least gently exposed to other people because if I didn t it would be detrimental. But now I m rethinking that. We ve","messageBody":"<div id=\"ygrps-yiv-1860179256\">-=-I was thinking to have our daughter at least gently exposed to  <br/>\nother people because if I didn&#39;t it would be detrimental. But now I&#39;m  <br/>\nrethinking that. We&#39;ve talked about living in a place where there  <br/>\nwouldn&#39;t be a lot of possibility for social interaction but I was  <br/>\nthinking that would be idea. -=-<br/>\n<br/>\nDid you mean &quot;ideal&quot; there?<br/>\n<br/>\nI think the problem with unschoolers living rurally (others will  <br/>\ndispute this) is that when they&#39;re teens, the parents either do a LOT  <br/>\nof driving and waiting around, or the kids get restless and could end  <br/>\nup moving out prematurely.<br/>\n<br/>\nMy kids were able to have jobs in town as teens, and get to work  <br/>\nfairly easily, especially once they could drive (and New Mexico&#39;s  <br/>\nstill fairly easy about driving at 16).  Friends of theirs who lived  <br/>\nin the mountains or in little rural towns had a harder time of some of  <br/>\nthose teen things (and frequently stayed at our house in town).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":241904499,"authorName":"zurro","from":"&quot;zurro&quot; &lt;zurrolaur@...&gt;","profile":"zurrolaur","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264639043","msgId":50169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqcW04MytsdGtyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqcWtuNis3ZTlwQGVHcm91cHMuY29tPg=="},"prevInTopic":50164,"nextInTopic":50170,"prevInTime":50168,"nextInTime":50170,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"these have all been very helpful! I especially hadn t really thought about other people s influences but it does make sense. My husband is quite the introvert","messageBody":"<div id=\"ygrps-yiv-1497449374\">these have all been very helpful! I especially hadn&#39;t really thought about other people&#39;s influences but it does make sense. My husband is quite the introvert and will almost never go to anything social or wehre he really needs to talk to other people. I am not quite that extreme but I do have my issues with groups and do better one on one. I think part of the worry is that I was thinking to have our daughter at least gently exposed to other people because if I didn&#39;t it would be detrimental. But now I&#39;m rethinking that. We&#39;ve talked about living in a place where there wouldn&#39;t be a lot of possibility for social interaction but I was thinking that would be idea. <br/>\n<br/>\nIf anyone else has any more to say, please do so. This has been really helpful, particularly since we&#39;re still so early in our journey - dd only turned 3 recently. <br/>\n<br/>\nLaura Z<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;J&quot; &lt;jmarsh122@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; No support groups here.  No friends either.  But my dc are still thriving and very happy where they are (despite my worries).  <br/>\n&gt; <br/>\n&gt; My dc love manga, PSP games, videos, sewing figures (and laughing hysterically), and watching Netflix videos.  I can&#39;t tell you how wonderful unschooling has been. My children are so happy!<br/>\n&gt; <br/>\n&gt; Jean<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":235756940,"authorName":"J","from":"&quot;J&quot; &lt;jmarsh122@...&gt;","profile":"jmarsh122@verizon.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264637478","msgId":50164,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqcWtuNis3ZTlwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg=="},"prevInTopic":50161,"nextInTopic":50169,"prevInTime":50163,"nextInTime":50165,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"No support groups here.  No friends either.  But my dc are still thriving and very happy where they are (despite my worries). My dc love manga, PSP games,","messageBody":"<div id=\"ygrps-yiv-982334953\">No support groups here.  No friends either.  But my dc are still thriving and very happy where they are (despite my worries).  <br/>\n<br/>\nMy dc love manga, PSP games, videos, sewing figures (and laughing hysterically), and watching Netflix videos.  I can&#39;t tell you how wonderful unschooling has been. My children are so happy!<br/>\n<br/>\nJean</div>","specialLinks":[]},{"userId":280305582,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;kaipelesmom@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264636101","msgId":50161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Nzg0Ni4yMjk1OS5xbUB3ZWI0NTEwMS5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":50160,"nextInTopic":50164,"prevInTime":50160,"nextInTime":50162,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"The below idea is resonating with me. Most weeks I drive myself crazy trying to find activities and groups for my kids but honestly they seem more interested","messageBody":"<div id=\"ygrps-yiv-1936857094\">The below idea is resonating with me. Most weeks I drive myself crazy trying to find activities and groups for my kids but honestly they seem more interested in being at home with me. I guess I worry that I am not opening up the world enough for them and that is what gets me all frazzled. Yet I am seeing that more than anything it is the connection between me and them....focusing on really listening to what they want. <br/>\n<br/>\nAll my best--Kelli <br/>\nSent from my iFriend<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 27, 2010, at 5:43 PM, &quot;Joanna&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ridingmom@...\">ridingmom@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin Bentley &lt;robin.bentley@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; If I had to do it over again, I would do less &quot;social interaction&quot; and <br/>\n&gt; more making our home rich and interesting (not that it wasn&#39;t - I just <br/>\n&gt; would have done even more). <br/>\n<br/>\n<br/>\nI&#39;m wondering, now, if homeschoolers/unschoolers might be over-emphasizing the whole friends thing as a part of letting go of our own childhoods. Friendships were probably so important to many of us, who didn&#39;t feel the connections at home, but the reality is different for our children. My son didn&#39;t really even want friends until he turned 12. And still, he can take or leave them on any given day. He&#39;s enjoyed other kids, but it wasn&#39;t a need for him like is has been for me. My daughter too, to some degree, although she&#39;s always been more social, isn&#39;t craving constant playdates like I thought she would. <br/>\n<br/>\nThat isn&#39;t to say that there my be kids who do. But maybe there is a lot more socializing going on than is necessary. Maybe that&#39;s something that the next generation of unschoolers--who haven&#39;t been to school--will do differently than we have. Maybe they&#39;ll have more confidence socially and more connection to what their kids actually need... hmmm...<br/>\n<br/>\nJoanna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264634952","msgId":50160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1NDgwNDcyLUVERDItNDMzRC1CRjk4LTVFQzZFRTFDMzFFNkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGhqcWZqYytocXVtQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqcWZqYytocXVtQGVHcm91cHMuY29tPg=="},"prevInTopic":50158,"nextInTopic":50161,"prevInTime":50159,"nextInTime":50161,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"... I know! I needed at least another week to spend with everyone . ... I think that might be true, the over-emphasizing of friends. Hardly a day goes by on","messageBody":"<div id=\"ygrps-yiv-82495768\"><blockquote><span title=\"ireply\">&gt;&gt; If I had to do it over again, I would do less &quot;social interaction&quot;  <br/>\n&gt;&gt; and<br/>\n&gt;&gt; more making our home rich and interesting (not that it wasn&#39;t - I  <br/>\n&gt;&gt; just<br/>\n&gt;&gt; would have done even more).<br/>\n&gt;<br/>\n&gt; I&#39;m surprised to see my own recent thoughts echoed here in your  <br/>\n&gt; post, Robin.  Too bad we didn&#39;t have more time to talk in Santa Fe!<br/>\n<br/>\n </span></blockquote>I know! I needed at least another week to spend with everyone &lt;g&gt;.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m wondering, now, if homeschoolers/unschoolers might be over- <br/>\n&gt; emphasizing the whole friends thing as a part of letting go of our  <br/>\n&gt; own childhoods.  Friendships were probably so important to many of  <br/>\n&gt; us, who didn&#39;t feel the connections at home, but the reality is  <br/>\n&gt; different for our children.  My son didn&#39;t really even want friends  <br/>\n&gt; until he turned 12.  And still, he can take or leave them on any  <br/>\n&gt; given day.  He&#39;s enjoyed other kids, but it wasn&#39;t a need for him  <br/>\n&gt; like is has been for me.  My daughter too, to some degree, although  <br/>\n&gt; she&#39;s always been more social, isn&#39;t craving constant playdates like  <br/>\n&gt; I thought she would.<br/>\n<br/>\n </span></blockquote>I think that might be true, the over-emphasizing of friends. Hardly a  <br/>\nday goes by on the local homeschooling lists that parents of young  <br/>\nones aren&#39;t frantic to find friends for their children. I don&#39;t think  <br/>\nI&#39;ve ever read &quot;my child says she wants friends.&quot; It&#39;s some need for  <br/>\ncommunity, some down-time for mom to be with other moms that seems to  <br/>\nbe driving it. And sometimes, it&#39;s a need to see that there are other  <br/>\nkids like theirs, kids that would mesh well with theirs. I was one of  <br/>\nthose moms. We desperately want them to have someone other than us who  <br/>\nlove them for who they are. I think that might be a holdover from our  <br/>\nown school experiences, from our own search for friends who understand  <br/>\nus or share our interests, since our parents generally weren&#39;t  <br/>\ninterested in us that way.<br/>\n<br/>\nUnschooling parents are forging a different path, one of partnership  <br/>\nwith our kids and real interest in what they love. How much better to  <br/>\nbuild a child&#39;s selfhood than to show her that she and what she loves  <br/>\nis cool and wonderful? Especially from someone as important as a  <br/>\nparent. I found those amazing ideas from the on-line community, not  <br/>\nfrom &quot;real life.&quot;<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264632521","msgId":50158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5NzAyNEQzLTJBMEQtNDEzNi04N0I2LTBENTYwODRDNkJBQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqcWZqYytocXVtQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqcWZqYytocXVtQGVHcm91cHMuY29tPg=="},"prevInTopic":50157,"nextInTopic":50160,"prevInTime":50157,"nextInTime":50159,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"-=-I m wondering, now, if homeschoolers/unschoolers might be over- emphasizing the whole friends thing as a part of letting go of our own childhoods.","messageBody":"<div id=\"ygrps-yiv-117076471\">-=-I&#39;m wondering, now, if homeschoolers/unschoolers might be over- <br/>\nemphasizing the whole friends thing as a part of letting go of our own  <br/>\nchildhoods. Friendships were probably so important to many of us, who  <br/>\ndidn&#39;t feel the connections at home, but the reality is different for  <br/>\nour children. My son didn&#39;t really even want friends until he turned  <br/>\n12. And still, he can take or leave them on any given day. He&#39;s  <br/>\nenjoyed other kids, but it wasn&#39;t a need for him like is has been for  <br/>\nme. My daughter too, to some degree, although she&#39;s always been more  <br/>\nsocial, isn&#39;t craving constant playdates like I thought she would. -=-<br/>\n<br/>\nThat&#39;s a really good thought people have been afraid to pursue.  A few  <br/>\ntimes someone (sometimes me) has said that kids have grown up healthy  <br/>\nwith some pretty severe physical isolation (ranches).<br/>\n<br/>\nIn school maybe &quot;best friends&quot; (when kids are lucky enough to have  <br/>\nsuch a thing) are like prison friends.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264632236","msgId":50157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqcWZqYytocXVtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ1MkVDQkM0LUU2MDgtNDg4OS1BMUYxLTMyMzYyRUUxMDRFMkBjb21jYXN0Lm5ldD4="},"prevInTopic":50153,"nextInTopic":50158,"prevInTime":50156,"nextInTime":50158,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"... I m surprised to see my own recent thoughts echoed here in your post, Robin.  Too bad we didn t have more time to talk in Santa Fe! I m wondering, now, if","messageBody":"<div id=\"ygrps-yiv-1994147915\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin Bentley &lt;robin.bentley@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; If I had to do it over again, I would do less &quot;social interaction&quot; and  <br/>\n&gt; more making our home rich and interesting (not that it wasn&#39;t - I just  <br/>\n&gt; would have done even more). <br/>\n<br/>\n </span></blockquote>I&#39;m surprised to see my own recent thoughts echoed here in your post, Robin.  Too bad we didn&#39;t have more time to talk in Santa Fe!<br/>\n<br/>\nI&#39;m wondering, now, if homeschoolers/unschoolers might be over-emphasizing the whole friends thing as a part of letting go of our own childhoods.  Friendships were probably so important to many of us, who didn&#39;t feel the connections at home, but the reality is different for our children.  My son didn&#39;t really even want friends until he turned 12.  And still, he can take or leave them on any given day.  He&#39;s enjoyed other kids, but it wasn&#39;t a need for him like is has been for me.  My daughter too, to some degree, although she&#39;s always been more social, isn&#39;t craving constant playdates like I thought she would.  <br/>\n<br/>\nThat isn&#39;t to say that there my be kids who do.  But maybe there is a lot more socializing going on than is necessary.  Maybe that&#39;s something that the next generation of unschoolers--who haven&#39;t been to school--will do differently than we have.  Maybe they&#39;ll have more confidence socially and more connection to what their kids actually need...   hmmm...<br/>\n<br/>\nJoanna<br/>\nI believed what homeschoolers were saying  <br/>\n<blockquote><span title=\"qreply\"> &gt; about socialization, that there were events and classes and support  <br/>\n&gt; groups that addressed the &quot;issue&quot;. I should have paid more attention  <br/>\n&gt; to what my daughter needed - fewer group things, more one-on-one  <br/>\n&gt; playdates, fewer places she had to be quiet and still. And I thought I  <br/>\n&gt; needed social interaction, but a lot of the time, it confused me. I  <br/>\n&gt; had trouble finding my way clear to unschooling with the people I  <br/>\n&gt; spent time with.  In fact, trying to fit in socially was hard on us. I  <br/>\n&gt; could manage, but Michelle had trouble with what was expected of her,  <br/>\n&gt; which made me question what we were doing. She has just needed time.<br/>\n&gt; <br/>\n&gt; Our experience is not true for everyone, but looking to your  <br/>\n&gt; child(ren)&#39;s happiness is the best clue to making unschooling work for  <br/>\n&gt; you.<br/>\n&gt; <br/>\n&gt; Robin B.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;m curious how many of you have gotten through the years of  <br/>\n&gt; &gt; unschooling with or without local support groups. If you didn&#39;t/ <br/>\n&gt; &gt; don&#39;t have a local one how do you cope. I&#39;m aware some people are  <br/>\n&gt; &gt; fortunate to live in areas with local support but what do you do if  <br/>\n&gt; &gt; you don&#39;t have that, particularly for newer unschoolers who are  <br/>\n&gt; &gt; looking for social interaction, etc. I had posed this question in  <br/>\n&gt; &gt; another group but haven&#39;t gotten a lot of responses and am hoping it  <br/>\n&gt; &gt; will get more here. Look forward to hearing your responses :)<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What do you do if you don&#39;t have a local unschooling support group","postDate":"1264627295","msgId":50153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MkVDQkM0LUU2MDgtNDg4OS1BMUYxLTMyMzYyRUUxMDRFMkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDYyMDAxMS43NzA2MS5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPiA8NjIwMDExLjc3MDYxLnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":50150,"nextInTopic":50157,"prevInTime":50152,"nextInTime":50154,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"My experience is similar to Schuyler s, though we did join homeschooling groups to look for people of like mind in them. We have a few dear friends from the 8","messageBody":"<div id=\"ygrps-yiv-1859256938\">My experience is similar to Schuyler&#39;s, though we did join  <br/>\nhomeschooling groups to look for people of like mind in them. We have  <br/>\na few dear friends from the 8 or so years we did that. We don&#39;t belong  <br/>\nto any groups, now. My support, though, was from Sandra&#39;s and Joyce&#39;s  <br/>\nsites and the old unschoolingdotcom list, UnschoolingDiscussion and  <br/>\nAlwaysLearning. That&#39;s where the wisdom was and is.<br/>\n<br/>\nIf I had to do it over again, I would do less &quot;social interaction&quot; and  <br/>\nmore making our home rich and interesting (not that it wasn&#39;t - I just  <br/>\nwould have done even more). I believed what homeschoolers were saying  <br/>\nabout socialization, that there were events and classes and support  <br/>\ngroups that addressed the &quot;issue&quot;. I should have paid more attention  <br/>\nto what my daughter needed - fewer group things, more one-on-one  <br/>\nplaydates, fewer places she had to be quiet and still. And I thought I  <br/>\nneeded social interaction, but a lot of the time, it confused me. I  <br/>\nhad trouble finding my way clear to unschooling with the people I  <br/>\nspent time with.  In fact, trying to fit in socially was hard on us. I  <br/>\ncould manage, but Michelle had trouble with what was expected of her,  <br/>\nwhich made me question what we were doing. She has just needed time.<br/>\n<br/>\nOur experience is not true for everyone, but looking to your  <br/>\nchild(ren)&#39;s happiness is the best clue to making unschooling work for  <br/>\nyou.<br/>\n<br/>\nRobin B.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m curious how many of you have gotten through the years of  <br/>\n&gt; unschooling with or without local support groups. If you didn&#39;t/ <br/>\n&gt; don&#39;t have a local one how do you cope. I&#39;m aware some people are  <br/>\n&gt; fortunate to live in areas with local support but what do you do if  <br/>\n&gt; you don&#39;t have that, particularly for newer unschoolers who are  <br/>\n&gt; looking for social interaction, etc. I had posed this question in  <br/>\n&gt; another group but haven&#39;t gotten a lot of responses and am hoping it  <br/>\n&gt; will get more here. Look forward to hearing your responses :)<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What do you do if you don&#39;t have a local unschooling support group","postDate":"1264624891","msgId":50150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwODY4MS40NDIwNC5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg=="},"prevInTopic":50148,"nextInTopic":50153,"prevInTime":50149,"nextInTime":50151,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"***I m curious how many of you have gotten through the years of unschooling with or without local support groups. If you didn t/don t have a local one how do","messageBody":"<div id=\"ygrps-yiv-69613399\">***I&#39;m curious how many of you have gotten through the years of unschooling with or without local support groups. If you didn&#39;t/don&#39;t have a local one how do you cope. ***<br/>\n<br/>\nMy oldest is 15, she&#39;s never had an unschooling network of friends.  She knows some unschoolers now, within the last 2 yrs and that&#39;s been awesome, but her best friends all go to public school.  That&#39;s been the case from the beginning.  She&#39;s always formed friendships with neighborhood children and played in large groups of kids.  She was involved in Girl Scouts, and she took classes here and there, and then in those times when she didn&#39;t have a flood of friends, she met people online and had friends from all over the place, it is in fact how she met the friends she has right now.<br/>\n<br/>\nMy younger daughter has been very reluctant to play with neighbor kids, different personality, different kids.  I make an effort to visit the few unschooling kids we know.  If there weren&#39;t unschooling families around, I&#39;d look to the larger homeschool community to do the fun stuff they put together.  If that didn&#39;t exist, I&#39;d go to the local rec centers.<br/>\n<br/>\nFor me, it&#39;s been almost entirely online!<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What do you do if you don&#39;t have a local unschooling support group","postDate":"1264620729","msgId":50148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqcTRicCs0YmxtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg=="},"prevInTopic":50135,"nextInTopic":50150,"prevInTime":50147,"nextInTime":50149,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"I have had various levels of support around us over the years, from one family then one more to start, to being involved in a large unschooling group after we","messageBody":"<div id=\"ygrps-yiv-501835654\">I have had various levels of support around us over the years, from one family then one more to start, to being involved in a large unschooling group after we moved.  One thing I can say is that when you have other people around you, it&#39;s only natural, especially at first, to think that they know more about unschooling, but unschooling is so much about each parent and child that you really have to make your own way anyway for it to be successful.  And watching other people can actually be a pitfall.<br/>\n<br/>\nEveryone, including me, has always talked about support as a good thing, but it has its pros and its cons.<br/>\n<br/>\nJoanna<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;zurro&quot; &lt;zurrolaur@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m curious how many of you have gotten through the years of unschooling with or without local support groups. If you didn&#39;t/don&#39;t have a local one how do you cope. I&#39;m aware some people are fortunate to live in areas with local support but what do you do if you don&#39;t have that, particularly for newer unschoolers who are looking for social interaction, etc. I had posed this question in another group but haven&#39;t gotten a lot of responses and am hoping it will get more here. Look forward to hearing your responses :)<br/>\n&gt; <br/>\n&gt; Laura Z<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What do you do if you don&#39;t have a local unschooling support group","postDate":"1264607300","msgId":50135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2MDkxMTI3LUM2RkMtNDNBMi1CMTZGLUIxMkRFODFENEE5RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg=="},"prevInTopic":50124,"nextInTopic":50148,"prevInTime":50134,"nextInTime":50136,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"-=-I m curious how many of you have gotten through the years of unschooling with or without local support groups-=- There aren t stats, but just individual","messageBody":"<div id=\"ygrps-yiv-1672461235\">-=-I&#39;m curious how many of you have gotten through the years of  <br/>\nunschooling with or without local support groups-=-<br/>\n<br/>\nThere aren&#39;t stats, but just individual accounts, and sometimes if you  <br/>\nhear from a &quot;no support&quot; family, they&#39;re just months from finding  <br/>\nother families but they don&#39;t know it yet.<br/>\n<br/>\nI knew unschooling families for a few years before I even considered  <br/>\nhomeschooling.  I know, I lucked out!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What do you do if you don&#39;t have a local unschooling support group","postDate":"1264582551","msgId":50123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyMDAxMS43NzA2MS5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg=="},"prevInTopic":50121,"nextInTopic":50124,"prevInTime":50122,"nextInTime":50124,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"There is no local unschooling support group where I live. We ve gotten by making friends where we can and hanging out with people who have similar interests.","messageBody":"<div id=\"ygrps-yiv-1183112996\">There is no local unschooling support group where I live. We&#39;ve gotten by making friends where we can and hanging out with people who have similar interests. The support for unschooling in my life comes from on-line and going to the occasional  conference. Although that has been much more recent. It was the words that people write on lists like this one that buoyed me along. It was watching the changes in Simon and Linnaea and in me and in David that kept me motivated to move forward always along the unschooling path. The fact that I wasn&#39;t immersed in a face to face, social network of unschoolers didn&#39;t keep this from being the philosophy that I embraced. It just made this list incredibly important. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: zurro &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zurrolaur@...\">zurrolaur@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wednesday, 27 January, 2010 4:16:45<br/>\nSubject: [AlwaysLearning] What do you do if you don&#39;t have a local unschooling support group<br/>\n<br/>\nI&#39;m curious how many of you have gotten through the years of unschooling with or without local support groups. If you didn&#39;t/don&#39;t have a local one how do you cope. I&#39;m aware some people are fortunate to live in areas with local support but what do you do if you don&#39;t have that, particularly for newer unschoolers who are looking for social interaction, etc. I had posed this question in another group but haven&#39;t gotten a lot of responses and am hoping it will get more here. Look forward to hearing your responses :)<br/>\n<br/>\nLaura Z<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":286002181,"authorName":"Sunnyoneof1@aol.com","from":"Sunnyoneof1@...","profile":"sunny1of1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What do you do if you don&#39;t have a local unschooling support group","postDate":"1264569186","msgId":50124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzZEMjY4QjNBM0E1RC05MkJDLUJCNEVAd2VibWFpbC1kMDQ5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg=="},"prevInTopic":50123,"nextInTopic":50135,"prevInTime":50123,"nextInTime":50125,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"Laura, After trying some of our local support groups here I didn t find exactly what I wanted so I started my own. In just a year we have grown to over 200","messageBody":"<div id=\"ygrps-yiv-617104927\">Laura,<br/>\nAfter trying some of our local support groups here I didn&#39;t find exactly what I wanted so I started my own. In just a year we have grown to over 200 families in our small-ish town. You can belong to groups anywhere to get info, chat, share and just plain old get ideas. We are so chatty... I like that though. I was concerned about finding friends so I started asking people I saw with older than 4-5 yr old kids if they homeschooled, asked around the library etc and found some fun friends. If you can meet up with a few people they can introduce you to more people, etc. You might call some of the bigger churches, to see if they have homeschool groups that meet there. Look on Facebook for hs&#39;ing in your area, etc. I hope you find some kind of support and friendship. Where in the US do you llve? There has also been a nice resource called homeschoolblogger.com/ YOUR State here   I blog for our state. You might find some info there. Ok that is all I can think of right now, hope this helps, Cheryl<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: zurro &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zurrolaur@...\">zurrolaur@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Tue, Jan 26, 2010 10:16 pm<br/>\nSubject: [AlwaysLearning] What do you do if you don&#39;t have a local unschooling support group<br/>\n<br/>\n<br/>\n  <br/>\n    <br/>\n                  <br/>\nI&#39;m curious how many of you have gotten through the years of unschooling with or without local support groups. If you didn&#39;t/don&#39;t have a local one how do you cope. I&#39;m aware some people are fortunate to live in areas with local support but what do you do if you don&#39;t have that, particularly for newer unschoolers who are looking for social interaction, etc. I had posed this question in another group but haven&#39;t gotten a lot of responses and am hoping it will get more here. Look forward to hearing your responses :)<br/>\n<br/>\nLaura Z<br/>\n<br/>\n<br/>\n    <br/>\n             <br/>\n<br/>\n  <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":241904499,"authorName":"zurro","from":"&quot;zurro&quot; &lt;zurrolaur@...&gt;","profile":"zurrolaur","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"What do you do if you don&#39;t have a local unschooling support group","postDate":"1264565805","msgId":50121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqb2VuZCtubDdpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":50123,"prevInTime":50120,"nextInTime":50122,"topicId":50121,"numMessagesInTopic":0,"msgSnippet":"I m curious how many of you have gotten through the years of unschooling with or without local support groups. If you didn t/don t have a local one how do you","messageBody":"<div id=\"ygrps-yiv-1939246690\">I&#39;m curious how many of you have gotten through the years of unschooling with or without local support groups. If you didn&#39;t/don&#39;t have a local one how do you cope. I&#39;m aware some people are fortunate to live in areas with local support but what do you do if you don&#39;t have that, particularly for newer unschoolers who are looking for social interaction, etc. I had posed this question in another group but haven&#39;t gotten a lot of responses and am hoping it will get more here. Look forward to hearing your responses :)<br/>\n<br/>\nLaura Z</div>","specialLinks":[]}],"prevTopicId":50230,"nextTopicId":49437}}