{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":26,"messages":[{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschoolers in public school/divorce","postDate":"1251743859","msgId":47147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3aDU5aithdnBqQGVHcm91cHMuY29tPg=="},"prevInTopic":47122,"nextInTopic":0,"prevInTime":47143,"nextInTime":47148,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"UGH!  Why didn t my post go through?  retry... ... I ve had a lot of divorced women tell me that it takes a strong woman to leave a man, but I think it s","messageBody":"<div id=\"ygrps-yiv-212062737\">UGH!  Why didn&#39;t my post go through?  retry...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Making a marriage work is IMpossible if the couple&#39;s friends are<br/>\n&gt; &gt; saying &quot;Oh, just leave,&quot; or if people go to a discussion list and see<br/>\n&gt; &gt; divorce defended as no worse than staying together.<br/>\n<br/>\n </span></blockquote>I&#39;ve had a lot of divorced women tell me that it takes a strong woman to leave a man, but I think it&#39;s entirely opposite of that.  Almost all of my adult friends have gone through divorce.  Almost all of Chamille&#39;s friends come from divorced families.  It&#39;s very sad!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Most divorces have to do with immaturity and selfishness on the part<br/>\n&gt; &gt; of one or both of the parties. Having children doesn&#39;t make a person<br/>\n&gt; &gt; mature. Having children DOES put a person in a position of trust and<br/>\n&gt; &gt; responsibility for maintaining that child&#39;s peace and safety.<br/>\n<br/>\n </span></blockquote>Puting your own personal happiness above your children and spouse is selfish.  If both partners put each other and their children first there probably wouldn&#39;t be a need to feel selfish.  Loss of income, small children, loss of time can all be huge stressors in a marriage.  If it&#39;s viewed as the temporary thing that it is, it&#39;s easier to work through and stay together.  The marriage should be the thing that stays.  When divorce plays into it, those other things last longer, less income, less time, and more needy children.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251651929","msgId":47122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE3M0ZBMEY4LTExRkMtNEYxOS04QTY2LUZDMDg1ODFGODM2N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE0MzAzMS4xNTE5NS5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGg3YzIzbCtoa2E1QGVHcm91cHMuY29tPiA8MTQzMDMxLjE1MTk1LnFtQHdlYjg2MjA0Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":47115,"nextInTopic":47147,"prevInTime":47121,"nextInTime":47123,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"-=-I don t think that making a marriage work is always possible, but I do, strongly, believe that once you have children working to make it work is really,","messageBody":"<div id=\"ygrps-yiv-735989198\">-=-I don&#39;t think that making a marriage work is always possible, but I  <br/>\ndo, strongly, believe that once you have children working to make it  <br/>\nwork is really, really important. And, more than that, I believe that  <br/>\nthere are very few divorces that are beneficial to the children. -=-<br/>\n<br/>\nMaking a marriage work is IMpossible if the couple&#39;s friends are  <br/>\nsaying &quot;Oh, just leave,&quot; or if people go to a discussion list and see  <br/>\ndivorce defended as no worse than staying together.<br/>\n<br/>\nMost divorces have to do with immaturity and selfishness on the part  <br/>\nof one or both of the parties.  Having children doesn&#39;t make a person  <br/>\nmature.  Having children DOES put a person in a position of trust and  <br/>\nresponsibility for maintaining that child&#39;s peace and safety.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251648216","msgId":47115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MzAzMS4xNTE5NS5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGg3YzIzbCtoa2E1QGVHcm91cHMuY29tPg==","referencesHeader":"PGg3YzIzbCtoa2E1QGVHcm91cHMuY29tPg=="},"prevInTopic":47102,"nextInTopic":47122,"prevInTime":47114,"nextInTime":47116,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"I think that you can make some assumptions about divorce. Children of divorced parents will be more likely to have less financial assistance from their parents","messageBody":"<div id=\"ygrps-yiv-1161342445\">I think that you can make some assumptions about divorce. Children of divorced parents will be more likely to have less financial assistance from their parents than children of parents who stayed married. Children of divorced parents are less likely to have the same safety net to pull back to than are children of an intact marriage. <br/>\n<br/>\nMy parents divorced when I was 18, and I remember being relatively indifferent. They hadn&#39;t been particularly happy for a long time, they had both invested in their own lives separate from their lives as a couple, there was no sense that at 18 (I was living away from home) it would affect me that much. It affects me in gently sad ways a lot. There is a lot of my childhood, of my safety with them as parents, of my sense that where they are is home that is just not there. My dad moved quickly out of my childhood home. He dated other women quickly and remarried quickly. My mom invested in the home she lived in and didn&#39;t date in a way that I knew about for years. And didn&#39;t remarry for about 7 years. They rarely speak to one another. Not out of animosity, but because they have nothing to talk about. <br/>\n<br/>\nWhen I think about my marriage with David, one of the more important aspects of it are the shared memories. The remember-whens. My parents don&#39;t have anyone to nudge back a memory of my brother&#39;s first steps, or how they felt when they finally got pregnant with me. And that loss, that loss of my childhood, it makes me sad. And it is very much a selfish loss. My parents have separated themselves entirely from each other and in doing so, in divvying up the family photos and the family heirlooms, they&#39;ve taken bits of memories and made them almost inaccessible to each other and probably relatively difficult to get back for themselves. <br/>\n<br/>\nI don&#39;t think that making a marriage work is always possible, but I do, strongly, believe that once you have children working to make it work is really, really important. And, more than that, I believe that there are very few divorces that are beneficial to the children. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: susandsb &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susands@...\">susands@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Saturday, 29 August, 2009 9:12:37 PM<br/>\nSubject: [AlwaysLearning] Re: Unschoolers in public school/divorce<br/>\n<br/>\nI have not posted on this board before, but could not not respond to this thread. I have been divorced now for 2 years after being married for 19, we have 3 kids, 20, 15 and 11. We have been unschooling for about a year and a half.<br/>\n<br/>\n***Divorce kicks kids&#39; butts for life.***<br/>\nThis is a very sweeping statement that is unfair. Yes, it does kick many kids butts for life, certainly not all. Definitely not mine. I do not think my family is one in million that has come out of this divorce better. I know a handful off the top of my head that were better because if it. My ex and I tried for many years to make things work, counseling, books, lots of talking, compromises, we did not easily divorce nor did we do it due to an affair. But, now, we are happier, my kids included. I asked my 2 youngest last night about this, I told them a bit about the discussion here and they strongly disagreed that parents should stay married at virtually all costs. They are much happier with our life now. They see their dad several times a month, he lives only 5 minutes away, he and I get along well and have a good friendship now. But when he lived here, none of us were as happy. He was a very uninvolved dad, and a generally grouchy person. Everyones<br/>\n attitudes would change when it was almost time for dad to come home, not for the better. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251593214","msgId":47102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxM0I3ODYwLUFBREYtNEE2Ri1CQTY4LUI3MUI4MEY2NjIxNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGg3YzIzbCtoa2E1QGVHcm91cHMuY29tPg==","referencesHeader":"PGg3YzIzbCtoa2E1QGVHcm91cHMuY29tPg=="},"prevInTopic":47101,"nextInTopic":47115,"prevInTime":47101,"nextInTime":47103,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"... Whenever this subject comes up, a bunch of people think they hear the message No one should ever divorce, and come to defend divorce. No one has said no","messageBody":"<div id=\"ygrps-yiv-533942125\">On Aug 29, 2009, at 4:12 PM, susandsb wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Yes, it does kick many kids butts for life, certainly not all.  <br/>\n&gt; Definitely not mine.<br/>\n<br/>\n </span></blockquote>Whenever this subject comes up, a bunch of people think they hear the  <br/>\nmessage &quot;No one should ever divorce,&quot; and come to defend divorce.<br/>\n<br/>\nNo one has said no one should divorce. What&#39;s said is that there&#39;s a  <br/>\nhuge statistical reality for children that doesn&#39;t get examined by  <br/>\npeople who are struggling in a seemingly dead relationship and are  <br/>\nimagining that divorce will be a relief.<br/>\n<br/>\nFor one thing, for unschoolers divorce very likely means the end of  <br/>\nunschooling. Few judges are sympathetic to alternative education.  <br/>\nThey are very likely to side with the most educationally conservative  <br/>\nparent whether that parent has custody or not.<br/>\n<br/>\nYes, there are exceptions, but the exceptions are not in the parent&#39;s  <br/>\ncontrol. It&#39;s luck of the draw. Anyone contemplating divorce should  <br/>\nbe realistic and imagine that divorce very likely means the kids will  <br/>\nend up back in school. (Then you&#39;ll be grateful if on the off chance  <br/>\nit doesn&#39;t happen rather than devastated when it does.)<br/>\n<br/>\nAnd if you type divorce into the archives here you can read stories  <br/>\nof unschooling parents who had long lasting negative effects from  <br/>\ntheir parents&#39; divorce. I do recall a few stories of people who were  <br/>\ngrateful their parents divorced, but the negatives stories are more  <br/>\nnumerous.<br/>\n<br/>\nWhile that also sounds like a blanket &quot;Don&#39;t ever divorce&quot; it isn&#39;t  <br/>\nintended to be. (And it definitely doesn&#39;t say women should stay with  <br/>\nan abuser.) It says that this society doesn&#39;t treat children with  <br/>\nmuch respect. There&#39;s little information floating about in society  <br/>\nfrom children about what divorce did to them. The parents are  <br/>\ngenerally so grateful to be away from each other that they accept  <br/>\nwhatever struggles the children are going through as just part of the  <br/>\ndeal. That&#39;s hugely unfair (and damaging) to the kids.<br/>\n<br/>\nIf anyone&#39;s thinking divorce from an unsupportive spouse sounds good,  <br/>\nread the archives. Then go to the Peaceful Partnerships list:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Peacefulpartnerships\">http://groups.yahoo.com/group/Peacefulpartnerships</a><br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251581476","msgId":47101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2N0ExQTQ5LTMxNTktNEFFQS1CQjZBLUU2NzZGQTJENDBFN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg3YzIzbCtoa2E1QGVHcm91cHMuY29tPg==","referencesHeader":"PGg3YzIzbCtoa2E1QGVHcm91cHMuY29tPg=="},"prevInTopic":47100,"nextInTopic":47102,"prevInTime":47100,"nextInTime":47102,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"-=-I have not posted on this board before, but could not not respond to this thread. I have been divorced now for 2 years after being married for 19, we have 3","messageBody":"<div id=\"ygrps-yiv-1690370847\">-=-I have not posted on this board before, but could not not respond  <br/>\nto this thread. I have been divorced now for 2 years after being  <br/>\nmarried for 19, we have 3 kids, 20, 15 and 11. We have been  <br/>\nunschooling for about a year and a half.-=-<br/>\n<br/>\nIf you started unschooling after a divorce and your husband has agreed  <br/>\nto that, you&#39;re in a very exceptional situation.  Good for you.<br/>\n<br/>\nIt doesn&#39;t change the fact that divorce is often deeply regretted by  <br/>\nthe principles and can create problems for children for the rest of  <br/>\ntheir lives.  For the purposes of helping people unschool, I don&#39;t  <br/>\nwant the list to treat divorce as an equal option to an intact family.<br/>\n<br/>\nAnd I&#39;m atheist, by the way.   And I know that people need peace and  <br/>\nconfidence and safety to learn.  Sometimes a rough marriage can  <br/>\nprevent learning.  VERY often a stressful divorce or even a separation  <br/>\nwill cause kids (in school or out) to become unable to learn, to pay  <br/>\nattention, or to exist calmly.    Divorce is one of the most stressful  <br/>\nfactors in any life but in the case of a child it can include  <br/>\nabandonment or the discovery that one or both parents has been  <br/>\ndishonest.  It can involve them having to move to another house--also  <br/>\na huge stressor for any human.<br/>\n<br/>\nWhile it&#39;s comforting to divorced parents to think that it&#39;s no worse  <br/>\nthan if they had figured out a way to make the marriage strong and  <br/>\ngood, and I understand their need for comfort, when that comes at the  <br/>\nexpense of children that should be on the table.<br/>\n<br/>\nMost divorces are acrimonious, and one of the first tug-of-war things  <br/>\nto go is homeschooling of any sort.  I&#39;ve seen it at a distance and  <br/>\nI&#39;ve seen it up close, and I&#39;ve seen it repeatedly over many years.  <br/>\nWhen it&#39;s up to a judge, they opt for school.  If either parent says  <br/>\n&quot;school,&quot; school wins.<br/>\n<br/>\nI&#39;ve been a teacher and a friend to kids whose parents separated.  I  <br/>\nhave counselled adult men who were emotionally and socially stunted by  <br/>\nearly divorces.  I have a very close friend who was never calm and  <br/>\nsafe until her 40&#39;s because of abuse from a string of temporary and  <br/>\nvariously abusive step-parents (some official, some very live-in).<br/>\n<br/>\nAs to step parents, I knew vaguely there were real problems which it&#39;s  <br/>\nnot politically correct to point to, but I read a brief little book  <br/>\ncalled  The Truth about Cinderella:  A Darwinian View of Parental Love.<br/>\n<br/>\nIt can often seen advantageous for a divorced parent to remarry, for  <br/>\nfinancial and home-maintenance reasons, but if it&#39;s not good for the  <br/>\nkids (statistically, even) then it can be yet another upheaval in a  <br/>\nchild&#39;s life.  And if the worst it is is an upheaval, that&#39;s good!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":334709176,"authorName":"susandsb","from":"&quot;susandsb&quot; &lt;susands@...&gt;","profile":"susandsb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschoolers in public school/divorce","postDate":"1251576757","msgId":47100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3YzIzbCtoa2E1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBOTg5Qjc2LjMwMzA2MDNAbWFjLmNvbT4="},"prevInTopic":47077,"nextInTopic":47101,"prevInTime":47099,"nextInTime":47101,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"I have not posted on this board before, but could not not respond to this thread. I have been divorced now for 2 years after being married for 19, we have 3","messageBody":"<div id=\"ygrps-yiv-358545325\">I have not posted on this board before, but could not not respond to this thread. I have been divorced now for 2 years after being married for 19, we have 3 kids, 20, 15 and 11. We have been unschooling for about a year and a half.<br/>\n<br/>\n***Divorce kicks kids&#39; butts for life.***<br/>\nThis is a very sweeping statement that is unfair. Yes, it does kick many kids butts for life, certainly not all. Definitely not mine. I do not think my family is one in million that has come out of this divorce better. I know a handful off the top of my head that were better because if it. My ex and I tried for many years to make things work, counseling, books, lots of talking, compromises, we did not easily divorce nor did we do it due to an affair. But, now, we are happier, my kids included. I asked my 2 youngest last night about this, I told them a bit about the discussion here and they strongly disagreed that parents should stay married at virtually all costs. They are much happier with our life now. They see their dad several times a month, he lives only 5 minutes away, he and I get along well and have a good friendship now. But when he lived here, none of us were as happy. He was a very uninvolved dad, and a generally grouchy person. Everyones attitudes would change when it was almost time for dad to come home, not for the better. <br/>\n<br/>\n***When people can grow and change and learn more<br/>\nabout themselves, yes, it&#39;s great. ***<br/>\nIt is because I was able to grow and change and learn more about myself that finally led to the divorce. We did grow apart and wanted VERY different things out of life. When my girls and I were talking last night, they said they would not want dad to move back in, they very much liked things the way they are now, that we as a family are much happier. They thought it would be a really bad idea for parents who were very unhappy together to stay together for the kids. They thought that would be a very awkward and uncomfortable situation to live in, they love the peace we have now. <br/>\n<br/>\n***Step parents are likely to do it<br/>\nall over again.***<br/>\nIn the 2 years I have been divorced, I have not dated, so can&#39;t say alot about that. I have chosen not to date because of the happiness we have in the way we are living now. I don&#39;t want to bring someone else in and disrupt what we have now. Someday, I will, but it will most definitely not be someone who is going to make things worse for them, finding someone that they can love and respect as well as me is a priority. <br/>\n<br/>\nAnd, yes, I did read the links that were posted on divorce. What may be true for many families is certainly not true for all.</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251532233","msgId":47077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NzE2Mi45NjI5Mi5xbUB3ZWI4NjIxMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGg3OWs2Nytlc2RjQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3OWs2Nytlc2RjQGVHcm91cHMuY29tPg=="},"prevInTopic":47071,"nextInTopic":47100,"prevInTime":47076,"nextInTime":47078,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"This is a list on which unschooling is the main point. It s the goal. I m sure there are religious conservative people who read and post, just as there","messageBody":"<div id=\"ygrps-yiv-1623492586\">This is a list on which unschooling is the main point. It&#39;s the goal. I&#39;m sure there are religious conservative people who read and post, just as there are religious liberal people who read and post and atheists of liberal or conservative bent here as well. The point about divorce is that it becomes much, much more difficult to unschool if you are divorced. Ex-partners and courts can insist on school, making unschooling illegal. Economics can make it very difficult to have one parent at home with the children when there is only one parent in the household. If unschooling is a priority in your life, having your marriage or major relationship work makes it much easier to do. Much easier. <br/>\n<br/>\nSchuyler<br/>\n---------<br/>\nBefore I commit another gaffe, I want to make sure of the culture of this iist . . . is this a religious conservative group?  Not meaning any offence, but I know that divorce is a huge no-no for those groups.<br/>\n<br/>\nYnge<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251515254","msgId":47071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBOTg5Qjc2LjMwMzA2MDNAbWFjLmNvbT4=","inReplyToHeader":"PGg3OWtzYitpajJrQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3OWtzYitpajJrQGVHcm91cHMuY29tPg=="},"prevInTopic":47069,"nextInTopic":47077,"prevInTime":47070,"nextInTime":47072,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"... Well - I live in California. In the world I live in, people get divorced all the time when they feel they are no longer in love. They are attracted to","messageBody":"<div id=\"ygrps-yiv-1966599433\">On 8/28/2009 3:14 PM, yngeharol wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s a beautiful scenario.  When people can grow and change and learn more about themselves, yes, it&#39;s great.  But I wouldn&#39;t want to see a world where there was no option for people to dissolve a union that was destroying them and their children, as infrequently as that option is truly needed.<br/>\n&gt;<br/>\n&gt;    <br/>\n </span></blockquote>Well - I live in California. In the world I live in, people get divorced <br/>\nall the time when they feel they are no longer in love. They are <br/>\nattracted to other people and they indulge that attraction and have <br/>\naffairs and that leads to divorce. It is common. It isn&#39;t even frowned <br/>\nupon. Nobody bothers to ever say, &quot;What about the children?&quot;  In fact, <br/>\nto even suggest that someone consider staying in a marriage for the sake <br/>\nof the children is considered to be sort of a throwback to the stone-age <br/>\nof the 50&#39;s when women were trapped in marriages with no power. Just <br/>\nlike the post on this list - it is assumed you&#39;re some kind of <br/>\nultra-conservative Christian or something.<br/>\n<br/>\nWell - I&#39;m not a Christian and I&#39;m not conservative. In fact, I&#39;d call <br/>\nmyself a feminist. I have a graduate degree in a field in which fewer <br/>\nthan 2% of professionals are women (Econometrics). But I think people <br/>\nwho bring children into the world should put those children&#39;s well-being <br/>\nabove their urges to have affairs and get divorced just because they&#39;re <br/>\nnot blissfully happy. Marriage takes work. Lots of people I see who are <br/>\nmiserable in bad marriages are not and never were committed to doing the <br/>\nwork.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251509851","msgId":47069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4QTFBMTI1LUM3MEUtNDFGNi05OTFDLTdGM0YyNjI4RkZENEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGg3OTc0ait0bmdkQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3OTc0ait0bmdkQGVHcm91cHMuY29tPg=="},"prevInTopic":47061,"nextInTopic":47071,"prevInTime":47068,"nextInTime":47070,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"... The initial point was wanting to unschool when the husband objected not whether there are instances where a divorce improved a family life. The discussion","messageBody":"<div id=\"ygrps-yiv-1188106949\">On Aug 28, 2009, at 2:20 PM, yngeharol wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve heard plenty of stories of chldren having wonderful and  <br/>\n&gt; healing relationships with stepparents. Not all are evil.<br/>\n<br/>\n </span></blockquote>The initial point was wanting to unschool when the husband objected  <br/>\nnot whether there are instances where a divorce improved a family  <br/>\nlife. The discussion had nothing to do with abusive husbands.<br/>\n<br/>\n*If* someone wants to unschool and they&#39;re imagining it would be a  <br/>\nlot easier without a husband who strongly objects or downright  <br/>\nforbids, they should read the links.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spouses\">http://sandradodd.com/spouses</a><br/>\n<br/>\n<br/>\nIf someone wants her kids court ordered into school, then divorce has  <br/>\na fairly good track record for that. If she wants to unschool, then  <br/>\nworking on the relationship with her husband is a much better path  <br/>\nand undoubtedly a lot better for the kids. A really good list for  <br/>\npartnerships is:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Peacefulpartnerships\">http://groups.yahoo.com/group/Peacefulpartnerships</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251498342","msgId":47061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBNDRCNkZFLTRFMzctNDdCQy1BNUVCLTQ0RjI3NEM2NEYwREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg3OWs2Nytlc2RjQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3OWs2Nytlc2RjQGVHcm91cHMuY29tPg=="},"prevInTopic":47058,"nextInTopic":47069,"prevInTime":47060,"nextInTime":47062,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"-=Before I commit another gaffe, I want to make sure of the culture of this iist . . . is this a religious conservative group? Not meaning any offence, but I","messageBody":"<div id=\"ygrps-yiv-2085464280\">-=Before I commit another gaffe, I want to make sure of the culture of  <br/>\nthis iist . . . is this a religious conservative group? Not meaning  <br/>\nany offence, but I know that divorce is a huge no-no for those groups.- <br/>\n=-<br/>\n<br/>\nBefore posting on ANY list, shouldn&#39;t you check the culture of the list?<br/>\n<br/>\nThis is not in any way whatsoever a religious conservative group.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/alwayslearning\">http://sandradodd.com/alwayslearning</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearning\">http://sandradodd.com/lists/alwayslearning</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spouses\">http://sandradodd.com/spouses</a><br/>\n<br/>\nI&#39;m sure I&#39;ve left these links here in the past day or two.<br/>\n<br/>\n-=-&gt; Did you read those links before writing this?<br/>\n<br/>\n-=-Links? What links? I wrote from what I have seen in my life.-=-<br/>\n<br/>\nBut this list isn&#39;t about everything anyone has ever seen in their  <br/>\nlives.  It&#39;s about unschooling, and that&#39;s very important.<br/>\n<br/>\n-=-That&#39;s a beautiful scenario. When people can grow and change and  <br/>\nlearn more about themselves, yes, it&#39;s great.-=-<br/>\n<br/>\nWhen people cannot grow and change, they can&#39;t possibly unschool.<br/>\n<br/>\n-=- But I wouldn&#39;t want to see a world where there was no option for  <br/>\npeople to dissolve a union that was destroying them and their  <br/>\nchildren, as infrequently as that option is truly needed.-=-<br/>\n<br/>\nNo one is talking about changing laws or cultures or the world.<br/>\nPeople are talking about the disadvantage to children when their  <br/>\nparents can&#39;t grow and change, and so they divorce.   Blaming the  <br/>\nchildren for the divorce even backhandedly, as suggesting the union  <br/>\nwas destroying children and so the divorce is better is not a step in  <br/>\na more peaceful, whole direction.<br/>\n<br/>\nA few people report having survived divorces okay.  Millions of others  <br/>\nnever recover fully, and one of the worst effects is that children  <br/>\nfrom divorces are more likely to divorce.<br/>\n<br/>\nSandra<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":411977721,"authorName":"yngeharol","from":"&quot;yngeharol&quot; &lt;yngeharol@...&gt;","profile":"yngeharol","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschoolers in public school/divorce","postDate":"1251497675","msgId":47058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3OWtzYitpajJrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBOTgyQjE2LjkwNDA2MDNAbWFjLmNvbT4="},"prevInTopic":47057,"nextInTopic":47061,"prevInTime":47057,"nextInTime":47059,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"... That s a beautiful scenario.  When people can grow and change and learn more about themselves, yes, it s great.  But I wouldn t want to see a world where","messageBody":"<div id=\"ygrps-yiv-942723507\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; But if the parents have just fallen out of love, they could very likely <br/>\n&gt; decide to continue their lives together and be a happy family and raise <br/>\n&gt; happy kids and they might find that their love grows into a new and more <br/>\n&gt; mature form if they do that.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>That&#39;s a beautiful scenario.  When people can grow and change and learn more about themselves, yes, it&#39;s great.  But I wouldn&#39;t want to see a world where there was no option for people to dissolve a union that was destroying them and their children, as infrequently as that option is truly needed.<br/>\n<br/>\nYnge</div>","specialLinks":[]},{"userId":411977721,"authorName":"yngeharol","from":"&quot;yngeharol&quot; &lt;yngeharol@...&gt;","profile":"yngeharol","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschoolers in public school/divorce","postDate":"1251496967","msgId":47057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3OWs2Nytlc2RjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFEM0JCQ0U4LTJCQTUtNEY3Mi04NTI5LTg0M0Q2NkFBOEMxM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47039,"nextInTopic":47058,"prevInTime":47056,"nextInTime":47058,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"... Links?  What links?  I wrote from what I have seen in my life. ... I don t see what I wrote as platitudes, just another viewpoint.  It s certainly fine","messageBody":"<div id=\"ygrps-yiv-384399832\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-While divorce isn&#39;t something anyone looks forward to, an unhealthy  <br/>\n&gt; relationship, perpetuated beyond the point where the parents want to  <br/>\n&gt; split &quot;for the sake of the children&quot; creates a toxic environment far  <br/>\n&gt; worse than the divorce would. To try, genuinely try to heal the  <br/>\n&gt; relationship, absolutely; but sometimes divorce is the right choice  <br/>\n&gt; for the whole family. I&#39;ve heard plenty of stories of chldren having  <br/>\n&gt; wonderful and healing relationships with stepparents. Not all are  <br/>\n&gt; evil.-=-<br/>\n&gt; <br/>\n&gt; Did you read those links before writing this?<br/>\n<br/>\n </span></blockquote>Links?  What links?  I wrote from what I have seen in my life.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If this list becomes just a collection of mainstream platitudes, <br/>\n&gt; the best list members will drop off and go away.<br/>\n<br/>\n </span></blockquote>I don&#39;t see what I wrote as platitudes, just another viewpoint.  It&#39;s certainly fine with me if other people&#39;s life experiences lead them to different conclusions about what is best for a healthy family.  I&#39;m truly sorry if something I wrote could cause the best, or any, list members to leave.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Mainstream advice is one click away, all the time.  Let&#39;s not bring it  <br/>\n&gt; all in here.<br/>\n<br/>\n </span></blockquote>Before I commit another gaffe, I want to make sure of the culture of this iist . . . is this a religious conservative group?  Not meaning any offence, but I know that divorce is a huge no-no for those groups.<br/>\n<br/>\nYnge</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251486486","msgId":47033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBOTgyQjE2LjkwNDA2MDNAbWFjLmNvbT4=","inReplyToHeader":"PGg3OTc0ait0bmdkQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3OTc0ait0bmdkQGVHcm91cHMuY29tPg=="},"prevInTopic":47031,"nextInTopic":47039,"prevInTime":47032,"nextInTime":47034,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"... Few are evil. But kids are hurt and damaged. If a parent is abusive, etc., then the damage done by staying in the marriage could be worse than the damage","messageBody":"<div id=\"ygrps-yiv-319428536\">On 8/28/2009 11:20 AM, yngeharol wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; While divorce isn&#39;t something anyone looks forward to, an unhealthy relationship, perpetuated beyond the point where the parents want to split &quot;for the sake of the children&quot; creates a toxic environment far worse than the divorce would.  To try, genuinely try to heal the relationship, absolutely; but sometimes divorce is the right choice for the whole family.  I&#39;ve heard plenty of stories of chldren having wonderful and healing relationships with stepparents.  Not all are evil.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Few are evil.<br/>\n<br/>\nBut kids are hurt and damaged.<br/>\n<br/>\nIf a parent is abusive, etc., then the damage done by staying in the <br/>\nmarriage could be worse than the damage done by divorce.<br/>\n<br/>\nBut if the parents have just fallen out of love, they could very likely <br/>\ndecide to continue their lives together and be a happy family and raise <br/>\nhappy kids and they might find that their love grows into a new and more <br/>\nmature form if they do that.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school/divorce","postDate":"1251485615","msgId":47031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEM0JCQ0U4LTJCQTUtNEY3Mi04NTI5LTg0M0Q2NkFBOEMxM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg3OTc0ait0bmdkQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3OTc0ait0bmdkQGVHcm91cHMuY29tPg=="},"prevInTopic":47026,"nextInTopic":47033,"prevInTime":47030,"nextInTime":47032,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"-=-While divorce isn t something anyone looks forward to, an unhealthy relationship, perpetuated beyond the point where the parents want to split for the sake","messageBody":"<div id=\"ygrps-yiv-661085816\">-=-While divorce isn&#39;t something anyone looks forward to, an unhealthy  <br/>\nrelationship, perpetuated beyond the point where the parents want to  <br/>\nsplit &quot;for the sake of the children&quot; creates a toxic environment far  <br/>\nworse than the divorce would. To try, genuinely try to heal the  <br/>\nrelationship, absolutely; but sometimes divorce is the right choice  <br/>\nfor the whole family. I&#39;ve heard plenty of stories of chldren having  <br/>\nwonderful and healing relationships with stepparents. Not all are  <br/>\nevil.-=-<br/>\n<br/>\nDid you read those links before writing this?<br/>\n<br/>\nIf this list becomes just a collection of mainstream platitudes, half  <br/>\nthe best list members will drop off and go away.<br/>\n<br/>\nMainstream advice is one click away, all the time.  Let&#39;s not bring it  <br/>\nall in here.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":411977721,"authorName":"yngeharol","from":"&quot;yngeharol&quot; &lt;yngeharol@...&gt;","profile":"yngeharol","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschoolers in public school/divorce","postDate":"1251483603","msgId":47026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3OTc0ait0bmdkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA1QjU0MkMyLUZDNjctNDdGQi1BOUEyLTEyNUM3Q0Q4RDhFN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47002,"nextInTopic":47031,"prevInTime":47025,"nextInTime":47027,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"...  ... While divorce isn t something anyone looks forward to, an unhealthy relationship, perpetuated beyond the point where the parents want to split","messageBody":"<div id=\"ygrps-yiv-1324418094\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&lt;snip&gt; <br/>\n&gt; For anyone not getting along well with a spouse who also really likes  <br/>\n&gt; the idea of unschooling, read here:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spouses\">http://sandradodd.com/spouses</a><br/>\n&gt; <br/>\n&gt; Divorce kicks kids&#39; butts for life.  Step parents are likely to do it  <br/>\n&gt; all over again.  If your family is intact, try to keep it that way.<br/>\n&gt; <br/>\n<br/>\nWhile divorce isn&#39;t something anyone looks forward to, an unhealthy relationship, perpetuated beyond the point where the parents want to split &quot;for the sake of the children&quot; creates a toxic environment far worse than the divorce would.  To try, genuinely try to heal the relationship, absolutely; but sometimes divorce is the right choice for the whole family.  I&#39;ve heard plenty of stories of chldren having wonderful and healing relationships with stepparents.  Not all are evil.<br/>\n<br/>\nYnge </span></blockquote></div>","specialLinks":[]},{"userId":199360242,"authorName":"graberamy","from":"&quot;graberamy&quot; &lt;graber@...&gt;","profile":"graberamy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschoolers in public school","postDate":"1251466926","msgId":47002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3OG1yZSs1cmg0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY5QThCODMxLTJCM0YtNDY5QS1CQUM5LUVENDFCQjZEN0Y0NEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47001,"nextInTopic":47026,"prevInTime":47001,"nextInTime":47003,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"... Last year my kids started public school at their own request. Lydia (11 at the time) had a really rigorous/ rote memorization type school and after a few","messageBody":"<div id=\"ygrps-yiv-1773643271\"><blockquote><span title=\"ireply\">&gt; -=-I think this is a power struggle for her. She sounds like she&#39;s  <br/>\n&gt; exerting her power over not just your child but also over you.  <br/>\n&gt; Personally, I would skip the power plays and go right to her  <br/>\n&gt; supervisor.-=-&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Last year my kids started public school at their own request. Lydia (11 at the time) had a really rigorous/ rote memorization type school and after a few weeks of adjustment seem to be doing ok.  By the end of the year, if she had chosen, she would have been rolling right along.  But she burnt out and switched to the Montessori school after the first quarter.<br/>\n<br/>\nThere&#39;s no talking to some teachers about unschooling.  When she first started they wanted to test her because she couldn&#39;t find something (pretty basic) on a ma).  I said that distorted xerox copy of a map that didn&#39;t even look like anything she&#39;s seen b4?  I knew my local laws, I knew she didn&#39;t &quot;have to be tested&quot; (standardized that school year), so I said no.<br/>\n<br/>\nI then wrote the teacher explaining how Lydia was (un)schooled up til then so they could know that she was there by choice and how much they should appreciate her!&lt;bwg&gt;  They just didn&#39;t get it.  They believe in teaching.  I&#39;m sure any &quot;progress&quot; (ie: getting good at hoop jumping) that Lyd did they took as a sign of their wonderful teaching skills.<br/>\n<br/>\nAnyway, your options.  Can you work at night so you can be home with them during the day??  Are there different types of schools in your district?  Montessori, charter??  Here in Iowa those are public but they usually have a waiting list.  I had my kids on a few of these waiting list just in case they ever wanted to go.  Lydia switched to Montessori at the quarter and we had a WONDERFUL teacher.  Really cool.  Also in IA, we&#39;re allowed to dual enroll.  The kids can go part time.  Maybe that would satisfy your ex?  In dual enrollment the parent is still responsible for the assessments.<br/>\n<br/>\nBut if you&#39;re stuck where you&#39;re at, the best thing you can do for your kids is help them learn the game of school.  The hoop jumping will get easier for them and they&#39;ll catch up quickly.  Unfortunately the teacher will think its because of her great skills.  <br/>\n<br/>\n<br/>\n<br/>\namy g<br/>\niowa</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school","postDate":"1251466067","msgId":47001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0RTdDNkZBNkRENTREQTNCRTk4QjMyOUE2NEQ3MUNEQFJvYnluUEM+","inReplyToHeader":"PDA1QjU0MkMyLUZDNjctNDdGQi1BOUEyLTEyNUM3Q0Q4RDhFN0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGg3NnVobSszZmdnQGVHcm91cHMuY29tPiA8NTdEOTE0RUE1REIzNEVGOUE0NjAzMjhEMjI1RUZBRURAUm9ieW5QQz4gPDA1QjU0MkMyLUZDNjctNDdGQi1BOUEyLTEyNUM3Q0Q4RDhFN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46995,"nextInTopic":47002,"prevInTime":47000,"nextInTime":47002,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"... I should have been clearer that I endorse the general idea of looking for more hitherto unconsidered out of the box solutions that might allow the kids to","messageBody":"<div id=\"ygrps-yiv-1715986811\"><blockquote><span title=\"ireply\">&gt; Working from home, perhaps, or sending the children to a home educating<br/>\n&gt; friend&#39;s house while you&#39;re away? &gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; -=-This I totally endorse.-=-<br/>\n&gt;<br/>\n&gt; My first thought when I read the original recommendation, though, was<br/>\n&gt; how much could she afford to pay her friend?  &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I should have been clearer that I endorse the general idea of looking for <br/>\nmore hitherto unconsidered out of the box solutions that might allow the <br/>\nkids to be at home, rather than those specific ideas necessarily.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":337265206,"authorName":"bhmjones","from":"&quot;bhmjones&quot; &lt;bhmjones@...&gt;","profile":"bhmjones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschoolers in public school","postDate":"1251464132","msgId":47039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3OGs0NCtycWV1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg3NnMwNCszcHJyQGVHcm91cHMuY29tPg=="},"prevInTopic":47033,"nextInTopic":47057,"prevInTime":47038,"nextInTime":47040,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"I m a unschooling dad of two children, one school aged and the other only 2 years old. The school aged child has decided to try public school due to heavy","messageBody":"<div id=\"ygrps-yiv-965270212\">I&#39;m a unschooling dad of two children, one school aged and the other only 2 years old. The school aged child has decided to try public school due to heavy influence from my spouse and my spouse&#39;s mother. As I&#39;m fully convinced that unschooling does not preclude public school, as long as it is not forced on the child, I support her in giving it a try and I explained the difference between unschooling and schooling to my child best I could. <br/>\n<br/>\nMy child is actually excelling in public school and has even been placed in their [the school&#39;s] gifted student program. I support all this because the way I look at it is that 1.) the approach I&#39;m taking towards public school is treating it as strewing which allows my child to take advantage of many resources I can&#39;t offer, and 2.) I&#39;m treating this as one of my child&#39;s experiments as she may one day decide she no longer desires to participate in public school and come home but will have the experience of it nonetheless.<br/>\n<br/>\nI&#39;m in agreement with both Sandra and Robyn here in that you can&#39;t expect the teacher to understand unschooling nor expect them to change their attitude. All you can do is help your children adapt.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school","postDate":"1251458407","msgId":46994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1QjU0MkMyLUZDNjctNDdGQi1BOUEyLTEyNUM3Q0Q4RDhFN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU3RDkxNEVBNURCMzRFRjlBNDYwMzI4RDIyNUVGQUVEQFJvYnluUEM+","referencesHeader":"PGg3NnVobSszZmdnQGVHcm91cHMuY29tPiA8NTdEOTE0RUE1REIzNEVGOUE0NjAzMjhEMjI1RUZBRURAUm9ieW5QQz4="},"prevInTopic":46989,"nextInTopic":46995,"prevInTime":46993,"nextInTime":46995,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"-=-I m not sure that helping someone deal with her kid s teacher is a good purpose for this list-=- I m sure it s NOT a good use of the list. For anyone not","messageBody":"<div id=\"ygrps-yiv-1060148481\">-=-I&#39;m not sure that helping someone deal with her kid&#39;s teacher is a  <br/>\ngood<br/>\npurpose for this list-=-<br/>\n<br/>\nI&#39;m sure it&#39;s NOT a good use of the list.<br/>\n<br/>\nFor anyone not getting along well with a spouse who also really likes  <br/>\nthe idea of unschooling, read here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spouses\">http://sandradodd.com/spouses</a><br/>\n<br/>\nDivorce kicks kids&#39; butts for life.  Step parents are likely to do it  <br/>\nall over again.  If your family is intact, try to keep it that way.<br/>\n<br/>\n-=-&lt;&lt;&lt;&lt; I&#39;m also wondering if there are perhaps some options available  <br/>\nto you<br/>\nthat you hadn&#39;t considered that could mean the kids could stay at home?<br/>\nWorking from home, perhaps, or sending the children to a home educating<br/>\nfriend&#39;s house while you&#39;re away? &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n-=-This I totally endorse.-=-<br/>\n<br/>\nMy first thought when I read the original recommendation, though, was  <br/>\nhow much could she afford to pay her friend?   I wouldn&#39;t take kids  <br/>\nfor babysitting rates if I was expected to be their supervising  <br/>\nhomeschool teacher.  (Assuming I was already doing school-at-home with  <br/>\nmy own kids.)<br/>\n<br/>\nIf it&#39;s babysitting rates, or even letting my kids help another family  <br/>\nwith younger children in exchange for staying there, that&#39;s different.<br/>\n<br/>\nThere are a LOT of hours in the week left over after full-time work  <br/>\nand sleep.   There could still be enough hours for the mom to be with  <br/>\nher kids for unschooling purposes. Not ideal, but possible.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":363518215,"authorName":"claire.horsley08","from":"&quot;claire.horsley08&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschoolers in public school","postDate":"1251447105","msgId":46995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3ODNnMStvNmRrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY5QThCODMxLTJCM0YtNDY5QS1CQUM5LUVENDFCQjZEN0Y0NEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46994,"nextInTopic":47001,"prevInTime":46994,"nextInTime":46996,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"This sounds like a very difficult time of transition for both you and your kids.  Firstly you are dealing with the upheaval and grief of divorce. Secondly, you","messageBody":"<div id=\"ygrps-yiv-1363059496\">This sounds like a very difficult time of transition for both you and your kids.  Firstly you are dealing with the upheaval and grief of divorce. Secondly, you are all adjusting to school culture after many years of a totally different learning paradigm.  But you can still hold on to the basic principles of supporting and respecting your kids.  While understanding that they do not want to be different from the other kids at school, you can also downplay the importance of things like spelling lists. Actually you can make a game out of a spelling list by making up crazy sentences with the words, putting them in a song, etc (if your kids enjoy stuff like that). Although you have decided that school is the best option at this time, it doesn&#39;t mean you have to buy in to the culture of &#39;achievement&#39; and competition. Your biggest achievement at this point will be maintaining the wonderful relationship with your kids that unschooling has nurtured.<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school","postDate":"1251446589","msgId":46989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3RDkxNEVBNURCMzRFRjlBNDYwMzI4RDIyNUVGQUVEQFJvYnluUEM+","inReplyToHeader":"PGg3NnVobSszZmdnQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3NnVobSszZmdnQGVHcm91cHMuY29tPg=="},"prevInTopic":46986,"nextInTopic":46994,"prevInTime":46988,"nextInTime":46990,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-624385913\">&lt;&lt;&lt; It sounds like you and the teacher will be butting heads ad nauseum, and <br/>\nthis is only the beginning of the school year. I think this is a power <br/>\nstruggle for her. She sounds like she&#39;s exerting her power over not just <br/>\nyour child but also over you. Personally, I would skip the power plays and <br/>\ngo right to her supervisor. They need to understand the difference between <br/>\nwhat a person has learned and what they are capable of doing -- not just for <br/>\nyour daughter&#39;s sake, but for all their students&#39; &gt;&gt;&gt;&gt;<br/>\n<br/>\nI find myself in the amazing position of defending a school teacher...<br/>\n<br/>\nI don&#39;t think this teacher has the goal of exerting her power. Nor do I <br/>\nthink that Heather will find that approaching the teachers with the mind set <br/>\nthat they are doing so will help her have a positive relationship with these <br/>\npeople who are in charge of her children for 30 waking hours a week.<br/>\n<br/>\nI can imagine the teacher talking to the others in the staff room or venting <br/>\nto her spouse about how sorry she feels for these kids, what opportunities <br/>\nthey have missed, how behind they are, how tough it is to help them when <br/>\ntheir mom is so recalcitrant and ignorant about education. She probably <br/>\nbelieves that she is following the individualized learning philosophy you <br/>\nhave outlined by giving your dd tasks &quot;tailored&quot; to her specific deficits <br/>\n(as she thinks of them).<br/>\n<br/>\nIt&#39;s not that she is necessarily a mean person, but that she is misguided, <br/>\nfrom our POV certainly wrong about a lot, but most likely with good <br/>\nintentions.<br/>\n<br/>\nHer paradigm is so entirely different from unschooling, for example the <br/>\nconcept of &quot;behind&quot; being one that we reject. It is hard enough to change <br/>\nour thinking and deschool ourselves, we who are actively pursuing <br/>\nunschooling with the desire and motivation to do so. It is unrealistic to <br/>\nexpect understanding of it from someone whose whole life is about schooling, <br/>\nwith no reason to do that strenuous and challenging mental work.<br/>\n<br/>\nWhat if, instead of trying to educate her about unschooling (probably a <br/>\ndoomed project) you stick to helping your kids reach their goals and <br/>\nchecking in with them about what those are. Maybe the greatest service you <br/>\ncan give them is being a listening ear for their frustrations.<br/>\n<br/>\nI&#39;m not sure that helping someone deal with her kid&#39;s teacher is a good <br/>\npurpose for this list, but I seem to remember someone starting a list <br/>\nspecifically for unschoolers going to school for any reason - I think it was <br/>\nplanned as a support forum for distressed parents coping with their <br/>\nchildren&#39;s choice to try school, but I bet there is better advice there on <br/>\ndealing with teachers than I might have . Anyone remember the link?<br/>\n<br/>\n&lt;&lt;&lt;&lt; I&#39;m also wondering if there are perhaps some options available to you <br/>\nthat you hadn&#39;t considered that could mean the kids could stay at home? <br/>\nWorking from home, perhaps,  or sending the children to a home educating <br/>\nfriend&#39;s house while you&#39;re away? &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThis I totally endorse. With divorce as part of this picture, I am guessing <br/>\nthat your ex is insisting on school. I wonder if he would be satisfied with <br/>\na home tutoring option, or a home school curriculum. We know from <br/>\nschool-at-homers&#39; experiences that often it takes a very few hours to cover <br/>\nwhat it takes months to complete at school. Perhaps your kids would agree <br/>\nthat jumping through a few academic hoops at home to satisfy dad would be <br/>\nworth it to secure the rest of day for their own stuff.<br/>\n<br/>\nI truly hope that school is just a temporary blip for you.<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;adesah&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:2homeboys@...\">2homeboys@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Thursday, August 27, 2009 2:41 PM<br/>\nSubject: [AlwaysLearning] Re: Unschoolers in public school<br/>\n<br/>\n<br/>\n&gt; Heather, I&#39;m so sorry your children are having to deal with this. .<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Adesa<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com<br/>\nVersion: 8.5.392 / Virus Database: 270.13.71/2330 - Release Date: 08/27/09 <br/>\n18:02:00 </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschoolers in public school","postDate":"1251436766","msgId":46986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5QThCODMxLTJCM0YtNDY5QS1CQUM5LUVENDFCQjZEN0Y0NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg3NnVobSszZmdnQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3NnVobSszZmdnQGVHcm91cHMuY29tPg=="},"prevInTopic":46984,"nextInTopic":46989,"prevInTime":46985,"nextInTime":46987,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"-=-I think this is a power struggle for her. She sounds like she s exerting her power over not just your child but also over you. Personally, I would skip the","messageBody":"<div id=\"ygrps-yiv-815587247\">-=-I think this is a power struggle for her. She sounds like she&#39;s  <br/>\nexerting her power over not just your child but also over you.  <br/>\nPersonally, I would skip the power plays and go right to her  <br/>\nsupervisor.-=-<br/>\n<br/>\nHow is that not a power play?<br/>\nAnd the parent is not in a position of power, with the school.<br/>\n<br/>\nThe teacher was hired to do what schools do.  She *has* power.<br/>\nParents have the power to take their children out of school, but not  <br/>\nto tell the school how to change to accommodate once-unschooled  <br/>\nchildren.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":10649172,"authorName":"Ward Family","from":"&quot;Ward Family&quot; &lt;xtr581602@...&gt;","profile":"snoozem404","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschoolers in public school","postDate":"1251428287","msgId":46974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBMTdENzI2OEQ0NjRDNEE5NEU5QjdGRkQ1RUI1OTkzQHdpbmRvd2NvbXA+","referencesHeader":"PGg3NnMwNCszcHJyQGVHcm91cHMuY29tPiA8N0UzRUYzNUUtRDkxNS00MTM0LUJFMkUtQ0Y4QzlDNjQwMzBEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":46959,"nextInTopic":46984,"prevInTime":46973,"nextInTime":46975,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"This article from the Life Without School Blog amy give you some ideas on how to approach a teacher faced with children transtioning to school ","messageBody":"<div id=\"ygrps-yiv-1485692745\">This article from the Life Without School Blog amy give you some ideas on how to approach a teacher faced with children transtioning to school<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lifewithoutschool.typepad.com/lifewithoutschool/2008/03/cultural-exchan.html\">http://lifewithoutschool.typepad.com/lifewithoutschool/2008/03/cultural-exchan.html</a><br/>\n<br/>\nHere are a couple of quotes:<br/>\n<br/>\n&quot;Homeschooled kids come from a different learning culture, with different timetables, methods, and expectations about life and learning. ......  In short, these kids march to a completely different drummer, which can be very disconcerting if you&#39;re not expecting it.&quot;<br/>\n<br/>\n&quot;School teachers assume that a child can move from a homeschool setting into the neighborhood public school as effortlessly as a child from the town down the road.  While they expect some minor adjustments, they assume that within a few weeks the new child will be up to speed with the other children and behaving in the same ways as his peers.  While they expect some variation from school to school, they assume that all third graders across the state and country are doing roughly the same sort of work in the same ways.   <br/>\n<br/>\nBut if that same child were a foreign exchange student, the teacher&#39;s expectations would be quite different.&quot;<br/>\n<br/>\nCheers,<br/>\n<br/>\nJulie Ward  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschoolers in public school","postDate":"1251409353","msgId":46959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdFM0VGMzVFLUQ5MTUtNDEzNC1CRTJFLUNGOEM5QzY0MDMwREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg3NnMwNCszcHJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3NnMwNCszcHJyQGVHcm91cHMuY29tPg=="},"prevInTopic":46955,"nextInTopic":46974,"prevInTime":46958,"nextInTime":46960,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"-=-My children, Isabella and Isaiah, have been unschooled for their entire lives. Isaiah is 13 and in 7th grade and Isabella is 8 and in 3rd. Due to divorce","messageBody":"<div id=\"ygrps-yiv-1578956508\">-=-My children, Isabella and Isaiah, have been unschooled for their  <br/>\nentire lives. Isaiah is 13 and in 7th grade and Isabella is 8 and in  <br/>\n3rd. Due to divorce and other life changes I am unable to continue  <br/>\ntheir home education and enrolled them in public school-=-<br/>\n<br/>\nIf they&#39;re in school, you should help them catch up and survive  <br/>\nthere.  You can&#39;t expect the teachers to treat them differently  <br/>\nbecause they used to be homeschooled.   That&#39;s not how it works.<br/>\n<br/>\n-=- What astounds me is that the schools / teachers fail (or appear  <br/>\nto) to see what excellent learners my children are. =-<br/>\n<br/>\nDon&#39;t expect your kids to learn everything they know at school.   <br/>\nContinue to provide a rich environment.  The teacher/school is running  <br/>\nan assembly line, and they&#39;re not looking for individual learning.   <br/>\nThey&#39;re looking at group cooperation.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":367524539,"authorName":"adesah","from":"&quot;adesah&quot; &lt;2homeboys@...&gt;","profile":"adesah","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschoolers in public school","postDate":"1251409270","msgId":46984,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3NnVobSszZmdnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg3NnMwNCszcHJyQGVHcm91cHMuY29tPg=="},"prevInTopic":46974,"nextInTopic":46986,"prevInTime":46983,"nextInTime":46985,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"Heather, I m so sorry your children are having to deal with this. It sounds like you and the teacher will be butting heads ad nauseum, and this is only the","messageBody":"<div id=\"ygrps-yiv-854739556\">Heather, I&#39;m so sorry your children are having to deal with this. It sounds like you and the teacher will be butting heads ad nauseum, and this is only the beginning of the school year. I think this is a power struggle for her. She sounds like she&#39;s exerting her power over not just your child but also over you. Personally, I would skip the power plays and go right to her supervisor. They need to understand the difference between what a person has learned and what they are capable of doing -- not just for your daughter&#39;s sake, but for all their students&#39;.<br/>\n<br/>\nI&#39;m also wondering if there are perhaps some options available to you that you hadn&#39;t considered that could mean the kids could stay at home? Working from home, perhaps,  or sending the children to a home educating friend&#39;s house while you&#39;re away?<br/>\n<br/>\nAdesa</div>","specialLinks":[]},{"userId":411942335,"authorName":"homeschoolbarefoot","from":"&quot;homeschoolbarefoot&quot; &lt;homeschoolbarefoot@...&gt;","profile":"homeschoolbarefoot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschoolers in public school","postDate":"1251406660","msgId":46955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3NnMwNCszcHJyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46959,"prevInTime":46954,"nextInTime":46956,"topicId":46955,"numMessagesInTopic":0,"msgSnippet":"My children, Isabella and Isaiah, have been unschooled for their entire lives. Isaiah is 13 and in 7th grade and Isabella is 8 and in 3rd. Due to divorce and","messageBody":"<div id=\"ygrps-yiv-1002570416\">My children, Isabella and Isaiah, have been unschooled for their entire lives. Isaiah is 13 and in 7th grade and Isabella is 8 and in 3rd. Due to divorce and other life changes I am unable to continue their home education and enrolled them in public school. They began last Wednesday. At first they both enjoyed school and Isaiah especially seems to stand up to the challenges, which are many. Both of my children feel that they are being singled out for being behind in writing skills. Isabella is not wanting to return and says that her teacher treats her differently from the other kids and treats her like a baby. <br/>\n<br/>\nPreviously when I spoke with her teacher I explained our unschooling belief and life style approuch to learning. I explained at the start of school and again the other day that Isabella is behind in writing (very far in fact) and below grade level in reading, however she loves reading and learning. When I told the teacher that we follow the children&#39;s lead in learning by following interests and have not focused on &#39;grade level&#39; work because I knew they would learn it when they were in need and ready. She told me that they would not  and would never be ready. She did not say this as an insult but rather, I believe, she was meaning that if not taught and taught in precise order then the information is lost ... or something on that line of thinking. I told her that I personally know of others who have learned in this manner and grown into successful adults as well as many more I have known of who learn everything they need and more. It was obvious neither of us believed the other. <br/>\n<br/>\nIsabella&#39;s teacher has her practicing hand writing and the alphabet! I am so angry. Isabella knows the alphabet, she knows how to read and until recently she greatly enjoyed both. The teacher is having her practice the alphabet in order to &#39;correctly&#39; write her brush strokes. For spelling she gave Isabella five words instead of the 18 she gave the rest of the class. Isabella was in tears. I am going to address this with her teacher and explain that the reason Isabella doesn&#39;t write well is not because she is incapable but rather that it was not our focus, and ask that she give Isabella more words to study. Isaiah&#39;s teacher also gave him far fewer spelling words and he too was very upset and in tears. In true determination he told me he didn&#39;t care what the teacher said and that he was going to complete the entire list and not just the ones she assigned him. What astounds me is that the schools / teachers fail (or appear to) to see what excellent learners my children are. <br/>\n<br/>\nHeather</div>","specialLinks":[]}],"prevTopicId":47104,"nextTopicId":47148}}