{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":177721839,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: Santa....a different view","postDate":"1090584193","msgId":96734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzIzMTIwMzEwLkpOU0EyMDIzLm10YTkuYWRlbHBoaWEubmV0QGxlaWdoPg==","inReplyToHeader":"PDQxMDA2QTYzLjAwMDAxQS4wMzM2NEBQQVRUSURJQU1PTkQ+"},"prevInTopic":96713,"nextInTopic":0,"prevInTime":96733,"nextInTime":96735,"topicId":96713,"numMessagesInTopic":0,"msgSnippet":"Patti, What you wrote was beautiful and also the theme behind yes Virginia, there is a Santa Claus , which I love and plan to share with my children at some ","messageBody":"<div id=\"ygrps-yiv-925043768\">Patti,<br/>\nWhat you wrote was beautiful and also the theme behind &quot;yes Virginia, there<br/>\nis a Santa Claus&quot;, which I love and plan to share with my children at some<br/>\npoint.  <br/>\n <br/>\nI also wanted to mention that the cousin I mentioned who felt so betrayed by<br/>\nher parents also had a LOT of other issues with regards to her parent&#39;s<br/>\nparenting.  So, it&#39;s not like the Santa issue was the only thing she was<br/>\nlied to about.  There was both physical and mental abuse to go with it.  <br/>\n <br/>\nAngela <br/>\n &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n <br/>\n Patti wrote:<br/>\n&lt;snip&gt; <br/>\nSanta may not be real in the sense of we cannot feel, touch, smell, taste or<br/>\nhear him BUT we can believe in what he is in our hearts - a sense of<br/>\ninnocence, a sense of awe and wonder at life and of life and in life. <br/>\n&lt;snip&gt; <br/>\n <br/>\nAnd Rebeca wrote:<br/>\n&lt;snip&gt;<br/>\nI have friends who were terribly bothered by their parent&#39;s<br/>\n&#39;lies&#39; about Santa.  But, then again, lots of things about their upbringing<br/>\nbother them.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":173547862,"authorName":"Diamondlady1025","from":"&quot;Diamondlady1025&quot; &lt;diamondlady1025@...&gt;","profile":"diamondlady1025","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Santa....a different view","postDate":"1090546275","msgId":96713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMDA2QTYzLjAwMDAxQS4wMzM2NEBQQVRUSURJQU1PTkQ+"},"prevInTopic":0,"nextInTopic":96734,"prevInTime":96712,"nextInTime":96714,"topicId":96713,"numMessagesInTopic":0,"msgSnippet":"Why be conflicted about the whole Santa thing? Yes, Santa may very well be a fantasy character, a man much like Superman, Batman or Spiderman in our fantasy","messageBody":"<div id=\"ygrps-yiv-1749372901\">Why be conflicted about the whole Santa thing? Yes, Santa may very well be a<br/>\nfantasy character, a man much like Superman, Batman or Spiderman in our<br/>\nfantasy world..... but if you can look behind the man into what he<br/>\nrepresents in the eyes of children and in my eyes, you will find  something<br/>\nmuch more real.<br/>\n<br/>\nTo me, I love Santa. I loved Santa even when I found out he was not &quot;real&quot;.<br/>\nI was not disappointed or hurt by what appeared to be my parents &quot;lies&quot;,<br/>\nbecause I never interpreted them as &quot;lies&quot;. The only thing I was upset about<br/>\nwas the fact that my mother used the same wrapping paper and tags for the<br/>\npresents she and my dad gave, as she did the ones from Santa. I think my<br/>\nreasoning there was one of that if she was going to have made such strides<br/>\nto have the gifts be from two different sets of people without us knowing it<br/>\n why use the same paper then? :)<br/>\n<br/>\nSo, why was I not hurt or disappointed about discovering that the physical<br/>\nperson of Santa was being portrayed by my parents? Because for me, Santa is<br/>\nand always has been since as far back as I can remember, been the belief in<br/>\nwhat is possible. Santa is not so much of a HE but rather a what is. It is a<br/>\nknowing that although we cannot always see something - faith, hope, love,<br/>\nmagic, fate, miracles, what can be, possibility....... we can still believe.<br/>\nWe can still believe in what can be, in life, no matter what logic may tell<br/>\nus. <br/>\n<br/>\nDo we believe in love and the power of love to go beyond what we humans can<br/>\nsee and reason? You bet we do, and we believe in it so strongly that<br/>\nsometimes it can make us blind to what is real. But we believe in it<br/>\nnonetheless, and it is not something real in the sense of something we can<br/>\nfeel, touch, smell, taste or hear....but we believe, we believe in it&#39;s<br/>\npower and in it&#39;s strength and in the essence of knowing it is what brings<br/>\nus all together, no matter what race, no matter what (fill in the blank)....<br/>\n<br/>\n<br/>\nSanta may not be real in the sense of we cannot feel, touch, smell, taste or<br/>\nhear him BUT we can believe in what he is in our hearts - a sense of<br/>\ninnocence, a sense of awe and wonder at life and of life and in life. We can<br/>\nbelieve in that all things are possible and that life is the miracle that it<br/>\nis because we choose to see it for the miracle that it is. Santa is so much<br/>\nmore than just someone who brings children presents on Christmas while we<br/>\nall go to sleep. It is a belief of something that is beyond what we can use<br/>\nour five senses to see, materialize and realize - the magic of what is<br/>\npossible in life beyond any reason or explanation, it just is..... and the<br/>\nspirit in which that can happen, that needs to be felt and seen here. Seeing<br/>\nis not believing, believing is seeing!<br/>\n<br/>\nThat is who Santa is to me. Do I believe in Santa? You bet I do and I will<br/>\nalways believe in him until I draw my last breath! Do my kids believe? They<br/>\nare 13, 7, (almost 8, next month) and 6 and you bet they do! :) They will<br/>\nnot feel betrayed when they learn of the truth that I am the one who gives<br/>\nthem the presents under the tree and in their stockings, instead of a<br/>\nphysical man who wears a red suit, because they know of what Santa truly is<br/>\nin all of which I have written here and more, beyond what our minds can<br/>\nreason. And THAT is what will be keep Santa alive in their hearts and keep<br/>\nthem believing in Santa, not for the figure of the man he is, but for what<br/>\nhe is and can be within their hearts.<br/>\n<br/>\nPatti and the boys (Chris 13, Matthew 7, Anthony 6)<br/>\nLife Long Learning Academy<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.life-long-learning-4-all.com/index.html\">http://www.life-long-learning-4-all.com/index.html</a><br/>\n&quot;For no matter where knowledge and learning come from - no matter<br/>\nwhat shape, size, or dimension it assumes - it still is what it is,<br/>\nknowledge and learning. Therefore knowledge and learning should<br/>\nalways be embraced.&quot; ~ unknown</div>","specialLinks":[]}],"prevTopicId":96731,"nextTopicId":96718}}