{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Enough","postDate":"1035517195","msgId":47901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEzREM3QUNAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":47880,"nextInTopic":0,"prevInTime":47900,"nextInTime":47902,"topicId":47880,"numMessagesInTopic":0,"msgSnippet":"Myranda...I honestly do not think that it was your intention to disrupt this list. I wish that there was a way to help you see what people are saying, maybe it","messageBody":"<div id=\"ygrps-yiv-2103063907\">Myranda...I honestly do not think that it was your intention to disrupt this list.<br/>\nI wish that there was a way to help you see what people are saying, maybe it would<br/>\nbe easier in person. Yes, people keep asking you questions, mostly, I think, to get<br/>\nyou to think about what you were saying. And to help you see what they were saying.<br/>\n<br/>\nMaybe you could take a break for a little while. Read the list and get a feel for<br/>\nwhat people are saying, how this list works. Don&#39;t feel like you have to jump in<br/>\non every conversation.<br/>\n<br/>\nI can tell that your feelings are hurt, but I do not believe that anyone meant anything<br/>\npersonally against you. There are some very strongly held beliefs on this list. And<br/>\npeople who are not shy about stating them. No, you do not have to agree with these<br/>\nbeliefs, but you will also not be able to change people&#39;s minds about them. Kind<br/>\nof like picking your battles with your kids, deciding what is worth it and what is<br/>\nnot.<br/>\n<br/>\n(And please do not feel like you need to respond to this message, please<br/>\njust think about it...)<br/>\n<br/>\nStephanie E.</div>","specialLinks":[]},{"userId":10294444,"authorName":"Myranda","from":"&quot;Myranda&quot; &lt;myrandab@...&gt;","profile":"randascloudream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Enough","postDate":"1035511226","msgId":47880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOTIwMWMyN2JjYSQ1MDlkNmRlMCQwMTNmZmVhOUBjb21wdXRlcj4="},"prevInTopic":0,"nextInTopic":47901,"prevInTime":47879,"nextInTime":47881,"topicId":47880,"numMessagesInTopic":0,"msgSnippet":"First, I d like to apologize for all the posts that seem to have inconvenienced people. Second, I d like to say that I have no idea how every comment I make","messageBody":"<div id=\"ygrps-yiv-1023007883\">First, I&#39;d like to apologize for all the posts that seem to have inconvenienced people. <br/>\n<br/>\nSecond, I&#39;d like to say that I have no idea how every comment I make that someone doesn&#39;t agree with has to be turned into a big debate, and I certainly never intended for that to happen. Yes, I am confused about that. Several people have said &quot;just ignore it and move one&quot; but even more people keep asking me questions about my views. Three other people, at least, have re-stated my original concern about interfering in parent/child exchanges, and have not been questioned/attacked. Two people have talked about how they stick to natural/organic diets, and didn&#39;t get all the put-downs and snide comments about not giving their children choices that I did about it. One person, just a little bit ago, was commended for being a good, respectful parent from the get-go but when I said that I had always raised my kids in that manner, all I received were more spanking debate questions, after I&#39;d already stated several times that I was against it. <br/>\n<br/>\nEven though I follow the same educational and parenting philosophies of almost every one of you, and do not have to go through half the struggle anymore to do it, have went out of my way and wasted a lot of time answering questions that you all obviously didn&#39;t want to hear the answers to, I am called names, insulted, assumed to be an inept parent, my words are twisted and misquoted, and more. No, that doesn&#39;t make sense to me, and if that makes me dumb, then so be it. I find it ironic that some are yelling &quot;disruption&quot; when I&#39;ve been the one getting flamed. Isn&#39;t that against most list policies? <br/>\n<br/>\nAnyway, I&#39;m around if anyone wants to discuss anything to do with unschooling. <br/>\n<br/>\nNamaste,<br/>\nMyranda 8-)<br/>\nWAH,HS,M<br/>\nMarried to Daniel since 12/31/94<br/>\nBrett 9/4/95<br/>\nTyler 1/22/97<br/>\nCassidy 1/19/02<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47896,"nextTopicId":47904}}