{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Making friends with old nagging thoughts ....","postDate":"1024595220","msgId":38449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5LjIyNDZjNjUxLjJhNDM2ZjE0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":38448,"nextInTime":38450,"topicId":38449,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/19/2002 10:50:50 AM Pacific Daylight Time, ... Luz -- I just loved this. I think it is so helpful for people to realize that all the old","messageBody":"<div id=\"ygrps-yiv-1384931380\">In a message dated 6/19/2002 10:50:50 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Isn&#39;t it great -- all this support. Make friends with the old nagging<br/>\n&gt; thoughts & carry on. Mine still creep in once in awhile, even though our<br/>\n&gt; dear totally unschooled son just graduated (with honors) from college.<br/>\n<br/>\n </span></blockquote>Luz -- I just loved this. I think it is so helpful for people to realize that <br/>\nall the old schoolish ways of thinking are not usually going to just <br/>\nmagically vanish from our brains when we decide that unschooling is a good <br/>\nidea. We&#39;ve grown up being bombarded with the ideas that &quot;school is a child&#39;s <br/>\nwork&quot; and that &quot;nothing is a higher priority than school&quot; and &quot;school comes <br/>\nfirst&quot; and so on. All those slogans are in there, in our heads. And, even <br/>\nthough there IS more support and more &quot;evidence&quot; (real live unschoolers, <br/>\ngrowing up and leading interesting, happy, joyful, successful lives), we are <br/>\nSTILL doing something very &quot;fringy&quot; and if OUR kids turn out to be axe <br/>\nmurderers or complete sloths - we&#39;ll blame ourselves and so will others think <br/>\nit is OUR fault since we did this weird thing and not only didn&#39;t send them <br/>\nto school, we didn&#39;t even school them at home. So - I think that if a sense <br/>\nof standing precariously on an edge of some sort pops up occasionally, in our <br/>\nminds, we shouldn&#39;t be too surprised.<br/>\n<br/>\nBUT - when that happens, when we have doubts and fears or are discouraged, it <br/>\nhelps to remember that those feelings sometimes go along with being a parent, <br/>\nno matter what educational choice we make. <br/>\n<br/>\nSince I had a child in school, for a while, I can very easily reassure myself <br/>\nby remembering what it was like to be constantly trying to figure out what <br/>\nwas really going on in her classroom - was the teacher doing a good job? Was <br/>\nshe treating my child fairly? Was my child learning anything worthwhile? WHAT <br/>\nwas she really learning? Weren&#39;t they just wasting most of their time there? <br/>\nWeren&#39;t there some really awful hidden lessons being taught? Wasn&#39;t my child <br/>\nbeing indoctrinated into a very materialistic worldview with values very <br/>\ndifferent than our family&#39;s? Wasn&#39;t the social life of the schoolyard looking <br/>\nincreasingingly meanspirited and sexualized, even among 9 and 10 year olds? <br/>\nWasn&#39;t my child becoming mostly eager to please the teacher, rather than <br/>\neager to learn? And, finally, even then, wasn&#39;t my child learning a WHOLE lot <br/>\nmore by following her own interests outside of school than the mostly-twaddle <br/>\nshe was being exposed to in school - even when it was presented in <br/>\ninteresting, multiple-intelligence-based ways? <br/>\n<br/>\nOne example of the latter always comes to mind. I was working as a classroom <br/>\nvolunteer. The &quot;unit&quot; the class was working on was the human body. This <br/>\nlesson was about &quot;joints&quot; -- they looked at diagrams of different kinds of <br/>\njoints in the human body, memorized names of different parts, and then had <br/>\nthe &quot;hands-on&quot; part of the lesson which consisted of taping popsicle sticks <br/>\nto their thumbs and fingers so that they couldn&#39;t bend the joints and then <br/>\ntrying to pick up various items such as paper clips, staples, pencils, etc. <br/>\nNot a bad idea - lots of fun - gets the point across about the importance of <br/>\njoints. Except - there are 35 children in the class and each one needs to <br/>\nhave the popsicle sticks taped to their fingers. This turns out to be a huge <br/>\nmess - the kids don&#39;t have the dexterity to easily tape up each other&#39;s <br/>\nfingers. The tape twists and sticks on itself and when they start pulling it <br/>\noff - they&#39;re are yelping in pain as it is pulled off their skin. The <br/>\npopsicle sticks are so long that they dig into their hands and the kids start <br/>\ncomplaining about the pain. Some do NOT want to do it - they don&#39;t like the <br/>\nstuff being stuck to their hands. Many are just frustrated, not being able to <br/>\nget the sticks taped on sturdily enough to keep them from bending their <br/>\nfingers. It takes FOREVER to get everybody taped up and satisfied. Then - <br/>\nthey are supposed to be in 5 teams and there are stations with bowls of <br/>\ndifferent things to try to pick up at each station. There are recordkeeping <br/>\nforms at each station. Each kid is supposed to get a certain amount of time <br/>\nand they are supposed to keep track of how many of each item the team was <br/>\nable to pick up - how many cotton balls, how many paper clips, etc. They have <br/>\nstopwatches but now everybody has to stop and learn to use them. More time <br/>\ngone by - and I can see the teacher is getting tense because the time <br/>\nallotted for &quot;science&quot; is almost finished and they haven&#39;t even started the <br/>\nactual activity yet. So, fnally the teams are starting to pick things up - <br/>\neach kid getting 30 seconds for each item. All goes well for a while, but by <br/>\nthe time they&#39;re moving to the 3rd set of items to pick up, they are <br/>\nextrememly BORED and lots of kids are &quot;acting up&quot;. There is a LOT of waiting <br/>\ntime - always six kids watching while the seventh is doing the picking up. <br/>\nWhen they move to another station, it is just more of the same - with <br/>\ndifferent items. They&#39;ve LEARNED the lesson about joints being important - <br/>\nbut they still have to go through all the stations and keep score even though <br/>\nnone of them actually CARE who picks up the most items. They&#39;re in the middle <br/>\nof this when the bell rings for the 20 minute recess. NO time to take off the <br/>\nsplints - so they go out wearing them. Of course, that is a big no-no ---- <br/>\nthe playground aide spends the whole recess removing them from the fingers of <br/>\nlittle boys who are using them as weapons. Recess is over and they return to <br/>\nthe classroom - they didn&#39;t finish the science activity, but there is no more <br/>\ntime for that anyway, so they don&#39;t all get to do all the stations and most <br/>\ndon&#39;t really care except that some items were more fun to fool with than <br/>\nothers and some kids complain that it isn&#39;t fair that they didn&#39;t get to do <br/>\nthose.<br/>\n<br/>\nToo bad - time to go on to &quot;reading workshop.&quot; Before they on the book the <br/>\nclass is reading together, the teacher asks them to remember what they&#39;d read <br/>\nlast. Several kids respond to her leading questions and they &quot;review&quot; what&#39;s <br/>\nhappened up to then in the book. THEN they take out their reading journals <br/>\nand they are supposed to write about what they think is going to happen next. <br/>\nMy daughter has read this book before - so she raises her hand and asks the <br/>\nteacher what to write if she already knows what is going to happen. The <br/>\nteacher says, &quot;Pretend you don&#39;t know and write what you think you would have <br/>\nthought would happen next if you didn&#39;t already know.&quot; (Right - well, this is <br/>\nwriting that the child is surely going to think really &quot;matters&quot; <br/>\n:::sarcasm::::) But she does it. Then they start the reading. One child is <br/>\npicked to read aloud - 34 others are supposed to be reading along. I can see <br/>\nthat most are not - many are just daydreaming, some of doodling or just <br/>\nplaying with their fingers or hair, few eyes are on the book. Some are <br/>\nsurreptitiously reading ahead. MY daughter has put another book in her lap - <br/>\nshe&#39;s reading that while holding the class book up in front of her and I&#39;m <br/>\npretty sure the teacher knows it, that this is sort of tacitly okayed by her. <br/>\nWhen it is her turn to read, she looks at the teacher who tells her the page <br/>\nnumber and where to start. <br/>\n<br/>\nWhen the reading is finished, finally, it is time for computer lab - once a <br/>\nweek for an hour or so. The kids are paired up - my daughter is paired with a <br/>\nboy who is one of the &quot;behavior problem&quot; kids - a boy who doesn&#39;t yet read <br/>\nand is often bored and causing trouble. They have a long list of things they <br/>\nare supposed to do - a numbered list. They have 45 minutes to do 30 things. <br/>\nThey are supposed to alternate, first one does number 1 on the list, then the <br/>\nother kid does number 2 on the list, etc. Number one on the list is to drag <br/>\nsomething certain spot.  The other kid doesn&#39;t know how to drag using the <br/>\ncursor. So my daughter tries to explain it to him - finally she puts her hand <br/>\non his and tries to help him do it. The computer lab teacher happens to walk <br/>\nby right at that moment and snaps at her to let him do his own work. So she <br/>\nsits back and doesn&#39;t help him. He got the idea of dragging, but now he <br/>\ndoesn&#39;t know which WAY to drag it - he doesn&#39;t appear to understand left <br/>\nversus right, in fact. I go over and help him and the computer lab teacher <br/>\ndoesn&#39;t yell at me. My daughter gets to do her item - which takes about 5 <br/>\nseconds, and then it is back to the other kid. That&#39;s it - he is never able <br/>\nto do his second one and she never gets another turn on the computer. <br/>\nForty-five minutes of sitting, frustrated, not being allowed to help or do <br/>\nanything herself. Add to that the time it took to line the kids up and get to <br/>\nand from the computer lab.<br/>\n<br/>\nWHAT did they really learn from all this? This is a REALLY big question and, <br/>\nonce I started answering it in depth, I couldn&#39;t leave my children there AND <br/>\nit led inexorably to unschooling - because a lot of the answers applied <br/>\nequally to school-at-home as to school-at-school.<br/>\n<br/>\nCouldn&#39;t my child have been at home - comfortably sipping a cup of cocoa and <br/>\nreading one of her favorite books? Or maybe we could be at the nursery, <br/>\nbuying ladybugs to release in our garden to control the aphids? Or we could <br/>\nbe camping? Or going to a museum? Or playing a game? Or amost ANYTHING else <br/>\nincluding just sitting at home chatting or sleeping? <br/>\n<br/>\n--pamS<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38407,"nextTopicId":38451}}