{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Education Underground","postDate":"1028813533","msgId":40289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NzdFQjFDLkI0NzYlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PEI5NzZFNzhFLjExREYlbmVkdmFyZUBudHBseC5uZXQ+"},"prevInTopic":40165,"nextInTopic":0,"prevInTime":40288,"nextInTime":40290,"topicId":40150,"numMessagesInTopic":0,"msgSnippet":"... This makes for an effective rallying cry to gather the troops against the enemy who seeks to control or destroy us. But it doesn t line up with reality in","messageBody":"<div id=\"ygrps-yiv-1260733959\">on 8/7/02 3:13 PM, Luz Shosie and Ned Vare at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nedvare@...\">nedvare@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We are constantly<br/>\n&gt; in the position of possibly needing to defend ourselves from the &quot;logic&quot; of<br/>\n&gt; the government system. We are told by the establishment that we are<br/>\n&gt; ill-equipped to educate our kids, not &quot;certified,&quot; not &quot;trained,&quot;  without<br/>\n&gt; the &quot;resources&quot; that schools (presumably) have. They will, and do, say just<br/>\n&gt; about anything to make us look inferior to them. They use all the power at<br/>\n&gt; their disposal, even though they are the failure, not we.<br/>\n<br/>\n </span></blockquote>This makes for an effective rallying cry to gather the troops against the<br/>\nenemy who seeks to control or destroy us. But it doesn&#39;t line up with<br/>\nreality in every state. Unless the people in the states where the state<br/>\nisn&#39;t interfering with homeschooling *want* to believe they&#39;re being<br/>\nattacked because they&#39;d rather believe some plot by the evil government made<br/>\nthem buy into the idea of public schooling as the be all and end all of<br/>\neducation rather than their own foolish selves. If they want to pass off the<br/>\nblame that badly, they&#39;ll see boogy men all over the place. (And HSLDA is<br/>\nreally good at pointing out the boogy men!)<br/>\n<br/>\nIt&#39;s very comforting to be able to say &quot;I knew I wasn&#39;t at fault. It was<br/>\nthat evil entity that&#39;s out to control or destroy me. That&#39;s why this<br/>\nhappened.&quot; Hitler used the same tactic very effectively by pointing the<br/>\nfinger of blame at Jews and homosexuals and gypsies and other outsiders.<br/>\n(His tactic was of course more effective by choosing a physical enemy rather<br/>\nthan a vague enemy.)<br/>\n<br/>\nWhether the control we see is caused by evil government or the collective<br/>\npull of a basic human nature that needs to control things (in varying<br/>\ndegrees in all of us) can&#39;t be proved either way. But personally I find it<br/>\nmore empowering to take responsibility for the choices I&#39;ve made rather than<br/>\nblame it on some plot by powerful government forces. To examine why those<br/>\nchoices made sense at the time. To examine why they don&#39;t make sense any<br/>\nmore. (Or why they do make sense -- for different reasons -- for other<br/>\npeople.)<br/>\n<br/>\nBelieving if we could get rid of evil government controlling us we&#39;d all be<br/>\nhappy and free is sort of like believing if we get rid of alcohol we&#39;ll all<br/>\nbe happy and free. Yes, that worked really well.<br/>\n<br/>\nThose of us who know/believe it&#39;s basic human nature to want to control know<br/>\nthat the &quot;enemy&quot; we fight is ourselves and human nature and we won&#39;t be<br/>\nsurprised when social control pops up anywhere anytime. It&#39;s human nature<br/>\nand can only be battled one person at a time. (And only, of course, if that<br/>\nperson wants to battle it.)<br/>\n<br/>\nPainting government workers and those who support them with a broad brush of<br/>\nevil may rally the troops against them but it won&#39;t make any inroads into<br/>\nthat group. It just turns the world into two camps: us good guys and those<br/>\nbad guys.<br/>\n<br/>\nThe other real &quot;enemy&quot; is fear of the unknown. I think it a far better (and<br/>\ngentler) tactic to help people see that people are exploring and creating<br/>\npathways into the schoolless off-the-career-path territory. That way people<br/>\nwon&#39;t feel such a great need to huddle in masses (and make rules and<br/>\nregulations!) to guard against the unknown.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Education Underground","postDate":"1028749167","msgId":40165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0LjFiNWZhYzhlLjJhODJkMTZmQGFvbC5jb20+"},"prevInTopic":40162,"nextInTopic":40289,"prevInTime":40164,"nextInTime":40166,"topicId":40150,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/7/02 1:12:36 PM, nedvare@ntplx.net writes: ","messageBody":"<div id=\"ygrps-yiv-44402203\">In a message dated 8/7/02 1:12:36 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nedvare@...\">nedvare@...</a> writes:<br/>\n<br/>\n&lt;&lt; Homeschooling is, and always will be, the enemy of government schooling.<br/>\nThat&#39;s because our goals are the exact opposite of the state&#39;s. The state<br/>\nwants obedient, predictable clerks and soldiers and consumers. &gt;&gt;<br/>\n<br/>\nThis isn&#39;t true of the majority of homeschoolers, if you include the <br/>\nChristian homeschooling movement in the numbers.  If they are the enemy of <br/>\ngovernment schooling it is because they think schools should teach much LESS, <br/>\nnot more, and they believe schools should have corporal punishment and other <br/>\nstrict discipline.  So they take their kids home to do it right.  They want <br/>\nobedient, predictable Christians, and they want the boys to go into politics.<br/>\n<br/>\n&lt;&lt;We want them to be independent thinkers, creative individuals,<br/>\nself-starters and questioners of all kinds of authority -- not part of a<br/>\ngroupthink outer-directed treadmill human resource sink.&gt;&gt;<br/>\n<br/>\nThe first half does not apply to those Christian homeschoolers.<br/>\nThe second half is more of the same strident anti-school rhetoric.<br/>\n<br/>\nSo was that post just another previously published article?  Was it not <br/>\nactually dialog with this list?  <br/>\n<br/>\nSandra<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":51989482,"authorName":"rsale515@cs.com","from":"rsale515@...","profile":"rsale515","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Education Underground","postDate":"1028748892","msgId":40162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NS4xMTVkZjE3NS4yYTgyZDA1Y0Bjcy5jb20+"},"prevInTopic":40150,"nextInTopic":40165,"prevInTime":40161,"nextInTime":40163,"topicId":40150,"numMessagesInTopic":0,"msgSnippet":"Forgive me for being so chatty these last couple days, I know it s rude to appear every year or so and just start yapping. But I can t help it! Mr. Vare, do","messageBody":"<div id=\"ygrps-yiv-407257058\">Forgive me for being so chatty these last couple days, I know it&#39;s rude to <br/>\nappear every year or so and just start yapping. But I can&#39;t help it! <br/>\n<br/>\nMr. Vare, do yourself a favor and keep an eye out on C-SPAN today to see <br/>\nblowhardism in action. As I was reading your great posts today, <br/>\nUndersecretary of Education, Gene Hickock, was spewing about as much hot air <br/>\nthat the ozone can handle, to rally his troops at some sort of dinner or <br/>\nlunch. Incredible. According to him, the whole course of history, nay, <br/>\nHUMANITY, is at stake, and upon the shoulders of our public school teachers. <br/>\nIt&#39;s a big task, he readily admits, but the DOE will be there on the front <br/>\nlines ensuring our collective salvation. I should remind you that he is a <br/>\n&quot;big admirer of the Constitution and Bill of Rights.&quot; Indeed, just as Soviet <br/>\nDictator Andropov claimed to have been a big admirer of John Coltrane. <br/>\n<br/>\nI&#39;ll retire to Bedlam.<br/>\n<br/>\nBob Sale<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Education Underground","postDate":"1028747619","msgId":40150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NzZFNzhFLjExREYlbmVkdmFyZUBudHBseC5uZXQ+","inReplyToHeader":"PDEwMjg3MjM5NTIuOTA2LjYxNzYwLm03QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":40162,"prevInTime":40149,"nextInTime":40151,"topicId":40150,"numMessagesInTopic":0,"msgSnippet":"The Education Underground -- that s us, folks. I was once a ski instructor, among other things, in Aspen, CO. On Aspen Mountain was a wonderful, enigmatic","messageBody":"<div id=\"ygrps-yiv-1568811812\">The Education Underground -- that&#39;s us, folks.<br/>\n<br/>\nI was once a ski instructor, among other things, in Aspen, CO. On Aspen<br/>\nMountain was a wonderful, enigmatic character named Ralph Jackson, who ran,<br/>\nwith tenuous permission of the skiing establishment in town, an enterprise<br/>\nhe called, The Underground Ski School. His was a different kind of skiing<br/>\nfrom the usual brand of safety-first, correct positions, carefully carved<br/>\nturns and balance. He was a flamboyant free spirit in a flowing black<br/>\nfur-trimmed overcoat, top hat, baggy pants, cigarette holder and champagne<br/>\nglass held high (no poles) -- a kind of chimney sweep circus act on skis --<br/>\nwho would, with his class in tow, swoop down the trails, often skiing<br/>\nbackwards, doing spins and one-legged jumps and turns with the other ski<br/>\nhigh in the air. It was an unforgettably sight, an inspiration. Ralph was a<br/>\nHarvard grad, and for me, he made being &quot;underground&quot; a thing to be admired.<br/>\nWe became friends.<br/>\n<br/>\n...now for my point, if you have another moment...<br/>\n<br/>\nIn Japan, I&#39;m told, homeschoolers sometimes refer to themselves as<br/>\n&quot;refusers.&quot; In England, the HS umbrella group is called Education Otherwise<br/>\n(Luz and I get their newsletter). In Germany (remember Fascism)<br/>\nhomeschooling is not allowed -- all the children get government<br/>\nindoctrination full time. In Venezuela, the president/dictator, Chavez, has<br/>\nrecently ordered that all schools, including all privates, teach a socialist<br/>\npropaganda course exclusively for two months in the coming school year. As<br/>\nwe learn about how governments work, we see that there is a constant<br/>\nstruggle for citizens to be free, and we come to realize that oppressor is<br/>\nmostly government and its varied, often diabolical, institutions.<br/>\n<br/>\nHomeschooling is, and always will be, the enemy of government schooling.<br/>\nThat&#39;s because our goals are the exact opposite of the state&#39;s. The state<br/>\nwants obedient, predictable clerks and soldiers and consumers. It&#39;s schools<br/>\ntake twelve years out of our lives in order to train us to become dependent<br/>\non it -- that&#39;s how long it takes to break the human spirit sufficiently to<br/>\nchange persons into &quot;economic units.&quot;<br/>\n<br/>\nIn contrast, homeschooling, and especially UNschooling, stands as a<br/>\nfundamental break in those ranks of believers and supplicants at the trough<br/>\nof state largesse. We don&#39;t buy it, even though we keep paying our share of<br/>\ntaxes that support it. Government indoctrination is not what we want for our<br/>\nkids. We want them to be independent thinkers, creative individuals,<br/>\nself-starters and questioners of all kinds of authority -- not part of a<br/>\ngroupthink outer-directed treadmill human resource sink.<br/>\n<br/>\nThat independence for our kids and ourselves comes at a price -- every day.<br/>\nIt costs us our time in helping our children, and in justifying our practice<br/>\nto the many doubters we encounter -- especially nagging family members. It<br/>\ncosts us money, obviously, since we accept both the expenses for our kids<br/>\nand the taxes for the schools we wouldn&#39;t use even if they were free.<br/>\nAnother cost is the angst that always comes with being a rebel, a renegade,<br/>\nan iconoclast, a - yes - revolutionary. Even though the path is uphill all<br/>\nthe way, by taking it we gain our dignity and self-confidence.<br/>\n<br/>\nWe are a threat to the establishment. We reveal to them, to their shame,<br/>\nthat they are not necessary, superfluous. Not only that, but that children<br/>\ncan do better without them. We draw a line in the sand for them. Suddenly,<br/>\nthese days, the schools are being forced to question their policies,<br/>\nmethods, qualifications for employees, books, programs, the works. As our<br/>\nnumbers grow, so does the pressure on them to prove their worth.<br/>\n<br/>\nThe problem for the schools is this: They can&#39;t prove that they are doing<br/>\nwhat they claim. In fact, studies show that they are not only not doing it,<br/>\nbut are getting worse, more dangerous and coercive, and of less education<br/>\nvalue all the time. Therefore, their only tactic is to try to make us look<br/>\nbad. They demand interviews and send out a barrage of news releases that<br/>\n(often falsely) tell of homeschooling parents who abuse their kids, even<br/>\nkill them. They talk about the homeschooling experience not being<br/>\nsufficiently &quot;rounded&quot; or &quot;real worldly&quot; even though it is school that is<br/>\nthe true limiting and synthetic experience for children and is totally<br/>\nisolated (on purpose) from the &quot;real world.&quot;<br/>\n<br/>\nAll the hoopla by the schools is designed to rally the public in their favor<br/>\nand to intimidate homeschoolers and, with the goals of stopping our<br/>\ndissenting voices and returning our children -- with the accompanying<br/>\nfunding -- to their buildings or at least their control. They will spend<br/>\nvirtually unlimited resources on those goals even while allowing their<br/>\nschools to continue to fail their students, thus revealing that the school<br/>\nsystem is nothing more than a huge jobs program that dumbs down the<br/>\npopulation.<br/>\n<br/>\nWe, homeschoolers feel the effect, like runaways, like escapees, like<br/>\nnaughty children, like risk-takers and &quot;bad influences.&quot; We are constantly<br/>\nin the position of possibly needing to defend ourselves from the &quot;logic&quot; of<br/>\nthe government system. We are told by the establishment that we are<br/>\nill-equipped to educate our kids, not &quot;certified,&quot; not &quot;trained,&quot;  without<br/>\nthe &quot;resources&quot; that schools (presumably) have. They will, and do, say just<br/>\nabout anything to make us look inferior to them. They use all the power at<br/>\ntheir disposal, even though they are the failure, not we.<br/>\n<br/>\nHomeschooling groups are ports in that storm, we need them for &quot;support&quot; as<br/>\nthey are for many groups of &quot;victims&quot; today. We are treated like the enemy,<br/>\nso we need much mutual nourishment, just as slaves needed the underground<br/>\nrailroad with its safehouses.<br/>\n<br/>\nI don&#39;t mean to get paranoid, only to point out that we often feel as though<br/>\nwe are Davids on Goliath&#39;s turf. (but remember who won that one...)<br/>\n<br/>\nKnowing that countries like Germany (now our trusted &quot;friend and ally&quot;) can<br/>\neliminate such educational freedom as we take for granted (even though it<br/>\ncomes with its own restrictions in most states) makes us realize how<br/>\ntentative is that freedom, how precious it is, and how far we have to go in<br/>\norder to make it totally without limits. Courage, friends.<br/>\n<br/>\nNed Vare</div>","specialLinks":[]}],"prevTopicId":40074,"nextTopicId":40052}}