{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] A question about older teens","postDate":"1440908715","msgId":76110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2OEYwOTJELUFEQjctNEExMi1CMERELUU3MUM5QURBNkMwNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG1ydGZtMCsxMTJocTNxQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG1yc3I3cisxMGsybzhiQFlhaG9vR3JvdXBzLmNvbT4gPDdGRjM5MUI2LTFFQkQtNDIwMi1CQUM0LUY4RThGODVFNENFQUBTYW5kcmFkb2RkLmNvbT4gPG1ydGZtMCsxMTJocTNxQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":76109,"nextInTopic":0,"prevInTime":76109,"nextInTime":76111,"topicId":76106,"numMessagesInTopic":0,"msgSnippet":"-=-I ve only met this 20 year old once and she didn t know her own address. I m not sure how long they ve lived there - that might not be as bad as it sounds","messageBody":"<div id=\"ygrps-yiv-1135774921\">-=-I&#39;ve only met this 20 year old once and she didn&#39;t know her own address. I&#39;m not sure how long they&#39;ve lived there - that might not be as bad as it sounds if it was a recent move. -=-<br/>\n<br/>\nYounger people are less likely to than years back when kids memorized those things.  Cell phones make it much less necessary—one calls &quot;mom&quot; and asks, if needed.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":402833151,"authorName":"Erin & Keith","from":"&quot;Erin & Keith&quot; &lt;keithnerin@...&gt;","profile":"m.erin33","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] A question about older teens","postDate":"1440904390","msgId":76109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSFI9eEdoNk8yaTZUNkgxcmpYQThpam9rMnN3WXY4QmhhSDYyUUdKQWpBNUtydmMyZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PG1yc3I3cisxMGsybzhiQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG1yc3I3cisxMGsybzhiQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":76108,"nextInTopic":76110,"prevInTime":76108,"nextInTime":76110,"topicId":76106,"numMessagesInTopic":0,"msgSnippet":"and that s where I start to wonder what my place in all of this is, especially since M is twenty, but lives with her mother. I -wouldn t- wonder, but when M","messageBody":"<div id=\"ygrps-yiv-927619554\"><p dir=\"ltr\">&quot;and that&#39;s where I start to wonder what my place in all of this is, especially since M is twenty, but lives with her mother. I -wouldn&#39;t- wonder, but when M and Alex went to the mall and left there to go to the fabric store two blocks away, M called her mom with an update of where she&#39;d be. I don&#39;t know if that was because her mother needed to know where she was at all times, or if it was just letting someone know where she was in case my daughter turned out to be a crazy person luring her away from the mall.&quot;</p>\n<p dir=\"ltr\">I feel like that right there tells you there&#39;s no need for you to call her mother. She obviously communicates openly with her mother, you have no reason to doubt her. I&#39;d assume she&#39;s told her mother her whole plan. </p>\n<p dir=\"ltr\">IF there had been an issue of her mother getting upset at your first meeting (not knowing who she was with or when she&#39;d be back), then you might have a reason to call, to avoid the mother being upset with you.</p>\n<p dir=\"ltr\">I don&#39;t think a 20 year old needs any parental permission though or has any requirement to share their doings unless they are asking for assistance (a ride, cash, etc.) It&#39;s common courtesy to tell her mom she won&#39;t be home at night if she&#39;s living there, but that&#39;s an aspect of their relationship and nothing to do with you.</p>\n<p dir=\"ltr\">You&#39;d just be providing a taxi service since you&#39;re headed that way anyway. If she gets in a pickle while there, that is hers to sort out. Although her mother may not want to drive her that far for the event,  I&#39;d guess that she&#39;d be willing to help her or pick her up in an emergency situation.<br><br></p>\n<p dir=\"ltr\">Erin<br></p></div>","specialLinks":[]},{"userId":50712510,"authorName":"","from":"michelle_m29@...","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] A question about older teens","postDate":"1440891392","msgId":76108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG1ydGZtMCsxMTJocTNxQFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PDdGRjM5MUI2LTFFQkQtNDIwMi1CQUM0LUY4RThGODVFNENFQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PG1yc3I3cisxMGsybzhiQFlhaG9vR3JvdXBzLmNvbT4JPDdGRjM5MUI2LTFFQkQtNDIwMi1CQUM0LUY4RThGODVFNENFQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":76107,"nextInTopic":76109,"prevInTime":76107,"nextInTime":76109,"topicId":76106,"numMessagesInTopic":0,"msgSnippet":"... There actually is interstate travel involved in this one, but it s minimal. I ve asked fewer and fewer questions over the past year. It s gone from exact","messageBody":"<div id=\"ygrps-yiv-1836732011\"><blockquote><span title=\"ireply\"><span style=\"color:rgb(63, 63, 63);\">&gt;I didn&#39;t do that with 17 year olds. I probably stopped confirming things (unless there was interstate travel &gt;involved) after they were 15 or so, but...</span><br style=\"color:rgb(63, 63, 63);\"><div><span style=\"color:rgb(63, 63, 63);\"><br> </span></div></span></blockquote><div><span style=\"color:rgb(63, 63, 63);\">There actually is interstate travel involved in this one, but it&#39;s minimal. I&#39;ve asked fewer and fewer questions over the past year. It&#39;s gone from exact plans to &quot;might go to the zoo and/or ice skating or to a movie&quot; to my not asking anything about the plans except when to pick her up.&nbsp;</span></div><div><span style=\"color:rgb(63, 63, 63);\"><br></span></div><div><span style=\"color:rgb(63, 63, 63);\">Your checklisting is a good idea. My daughter is very organized on her own, so she doesn&#39;t need a lot of reminders from me. I usually check that the card is in her camera, if she&#39;s got her phone. For this trip, I dug out moleskin for her blistered heels. A favorite pair of shoes betrayed her a couple of days ago and she&#39;s trying to heal up quickly.&nbsp;</span></div><div><span style=\"color:rgb(63, 63, 63);\"><br><blockquote><span title=\"ireply\"> </span></blockquote></span></div><div><span style=\"color:rgb(63, 63, 63);\">&gt;The only thing in your long detailed question that stuck out as not smooth was this: &quot;I don&#39;t want to get stuck &gt;with some middle-of-the-weekend drama.&quot;<br><br>&gt;Why not?&nbsp;<br>&gt;And why call it &quot;drama&quot; instead of a need or a problem?<br> </span></div><div><span style=\"color:rgb(63, 63, 63);\"><br></span></div><div><span style=\"color:rgb(63, 63, 63);\">I&#39;ll be a hundred miles away, home with my husband and other three children. I don&#39;t want to be responsible for rescuing anyone but my own kid. (Maybe that&#39;s mean, &nbsp;but I&#39;m stretched to the limit right now.)</span></div><div><span style=\"color:rgb(63, 63, 63);\"><br><blockquote><span title=\"ireply\"> &gt;If you think of the advantages of your daughter having friends to go to the cosplay event with, so that you &gt;don&#39;t need to go, maybe transporting one person or having her overnight would be worth it!<br> </span></blockquote></span></div><div><span style=\"color:rgb(63, 63, 63);\"><br></span></div><div><span style=\"color:rgb(63, 63, 63);\">She&#39;s going with the friend whose house she&#39;s staying at and they&#39;re meeting up with another half a dozen girls at the con, so she&#39;s not going to be lonely.&nbsp;</span></div><div><span style=\"color:rgb(63, 63, 63);\"><br></span></div><div><span style=\"color:rgb(63, 63, 63);\">At the last con, a third friend (who isn&#39;t involved in any of this) got D to pay for her ticket and wanted Alex to see if her grandma would pick her up from across town &nbsp;(according to Alex, her friend doesn&#39;t have any kind of filter when adults are around, so Alex made up some excuse why she couldn&#39;t ask her grandma, who was already ferrying and feeding Alex and D to do even more). If I&#39;d been in town, I would&#39;ve made the side trip. &nbsp;I think it&#39;s a combination of that and another girl who whined for the entire two hundred mile round trip to and from that event that makes me describe it as drama.&nbsp;<br><br>I&#39;ve only met this 20 year old once and she didn&#39;t know her own address. I&#39;m not sure how long they&#39;ve lived there - that might not be as bad as it sounds if it was a recent move.&nbsp;</span></div><div><span style=\"color:rgb(63, 63, 63);\"><br></span></div><div><span style=\"color:rgb(63, 63, 63);\">Michelle &nbsp;</span></div><div><span style=\"color:rgb(63, 63, 63);\"><br></span></div></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] A question about older teens","postDate":"1440885275","msgId":76107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGRjM5MUI2LTFFQkQtNDIwMi1CQUM0LUY4RThGODVFNENFQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG1yc3I3cisxMGsybzhiQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG1yc3I3cisxMGsybzhiQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":76106,"nextInTopic":76108,"prevInTime":76106,"nextInTime":76108,"topicId":76106,"numMessagesInTopic":0,"msgSnippet":"-=-Since my daughter turned eighteen in January, I ve been asking fewer questions..... I no longer confirm her plans with her friend s parents, ...-=- I didn t","messageBody":"<div id=\"ygrps-yiv-1891346732\">-=-Since my daughter turned eighteen in January, I&#39;ve been asking fewer questions.....<br/>\nI no longer confirm her plans with her friend&#39;s parents, ...-=-<br/>\n<br/>\nI didn&#39;t do that with 17 year olds.  I probably stopped confirming things (unless there was interstate travel involved) after they were 15 or so, but...<br/>\n<br/>\n...-=-And then, once she get her license, am I involved at all -- as far as responsibility for younger friends goes? -=-<br/>\n<br/>\nMy kids drove at 15, 16.  Kirby was nearly 17, I think (quite late for New Mexico).<br/>\n<br/>\nI would talk my kids through, what we called &quot;checklisting.&quot;  &quot;Checklist me,&quot; Holly might say.  It would involve physical, packing, backup supplies (extra car keys, chargers, access to emergency money, maps/addresses, tickets), and also logistics.  Reservations, times, do the other people&#39;s parents need to know more.<br/>\n<br/>\nThe only thing in your long detailed question that stuck out as not smooth was this:  &quot;I don&#39;t want to get stuck with some middle-of-the-weekend drama.&quot;<br/>\n<br/>\nWhy not?  <br/>\nAnd why call it &quot;drama&quot; instead of a need or a problem?<br/>\n<br/>\nIf you&#39;re resentful of helping, why? <br/>\n<br/>\nIf you think of the advantages of your daughter having friends to go to the cosplay event with, so that you don&#39;t need to go, maybe transporting one person or having her overnight would be worth it!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":50712510,"authorName":"","from":"michelle_m29@...","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A question about older teens","postDate":"1440870460","msgId":76106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG1yc3I3cisxMGsybzhiQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":76107,"prevInTime":76105,"nextInTime":76107,"topicId":76106,"numMessagesInTopic":0,"msgSnippet":"I ve been trying to figure out my role (probably not quite the word I want) as parent of an eighteen-year-old and I m hoping for some guidance. Since my","messageBody":"<div id=\"ygrps-yiv-314293265\"><p><span>I&#39;ve been trying to figure out my role (probably not quite the word I want) as parent of an eighteen-year-old and I&#39;m hoping for some guidance.&nbsp;</span></p><p><span><br></span></p><p><span>Since my daughter turned eighteen in January, I&#39;ve been asking fewer questions. It&#39;s more &quot;when do you want me to pick you up and where?&quot; (or, more likely, &quot;call me when you know where you&#39;ll be and I&#39;ll pick you up there&quot;) than &quot;exactly what stores will you be in?&quot; &nbsp;</span></p><p><span><br></span></p><p><span>I no longer confirm her plans with her friend&#39;s parents, which is what I&#39;m trying to figure out today. (I seriously don&#39;t know what the rules/expectations for that even are these days. MY parents never bothered to call and check on the details of sleepovers or afternoons at the mall.)&nbsp;</span></p><p><span><br></span></p><p><span>We live in the country, quite a few miles from the good stuff (but closer to my husband&#39;s job) so I do a lot of driving. Alex&#39;s best friend (D who is 16) lives 100 miles away in Portland. The first few times she went up there, I called and confirmed all of the details with her friend&#39;s dad in advance. More recently, I just &nbsp;trust that the girls have checked everything with him. &nbsp;Last weekend, Alex and D stayed with my parents so they could attend a cosplay thing (not trying to dismiss their passion, I just don&#39;t know the proper terminology) and he didn&#39;t confirm any of the plans with either me or my folks, just dropped his daughter off in the driveway. (My folks live in a really nice neighborhood and Alex makes a really good impression on parents, so I&#39;m guessing he didn&#39;t have any worries.)&nbsp;</span></p><p><span><br></span></p><p><span>This coming weekend, there&#39;s a five day con in Washington state that the girls are going to. We&#39;ve done this before -- I drop Alex at D&#39;s apartment, they take public transportation to the hotel that&#39;s hosting the event, and D&#39;s dad picks them up each night because they want to stay later than two young girls should be riding the bus. Alex knows that he knows she&#39;s coming, because they discussed the plans the last time she was up there.&nbsp;</span></p><p><span><br></span></p><p>Last night, Alex asked if I could drive her friend M (who lives 30 miles from our house) up with us on Thursday and back on Tuesday. All three girls met at another event, M wants to come to the con and D says she &nbsp;can stay with her, but M needs transportation....and that&#39;s where I start to wonder what my place in all of this is, especially since M is twenty, but lives with her mother. I -wouldn&#39;t- wonder, but when M and Alex went to the mall and left there to go to the fabric store two blocks away, M called her mom with an update of where she&#39;d be. I don&#39;t know if that was because her mother needed to know where she was at all times, or if it was just letting someone know where she was in case my daughter turned out to be a crazy person luring her away from the mall. (I think I worry about Alex less since she&#39;s had 15+ years of karate.)</p><p><br></p><p>The way Alex asked me was, if her friend could get to Albany where we&#39;ll be for an appointment that morning, if she could possibly ride with us. I don&#39;t mind (assuming that D&#39;s dad is on board with the rest of their plans) but I don&#39;t want to be responsible for M and her transportation. She can &nbsp;ride up when we go up, come back when we go back. But I don&#39;t want to get stuck with some middle-of-the-weekend drama.&nbsp;</p><p><br></p><p>So, do I talk to both girls&#39; parents? The 20 year old&#39;s mom? Assume that the adult young women have it figured out? I&#39;m running into more and more situations like this and, like I said at the beginning of the posts, not quite sure what my role is. More with my daughter&#39;s friends than with her -- Alex has her own backup plans if something weird and unexpected happens, which it never has.</p><p><br></p><p>And then, once she get her license, am I involved at all -- as far as responsibility for younger friends goes?&nbsp;</p><p><br></p><p>Michelle&nbsp;</p><p><br></p><p><br></p></div>","specialLinks":[]}],"prevTopicId":76100,"nextTopicId":76111}}