{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":0,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","replyTo":"LIST","senderId":"UdiGvGFByMtx_Do-77S3OmrKw3cfEdfjwl1J5XV4-oZ5j8vJO35yapipwM52JOifkvsNB4CIBJMulKViZeBjVcQpj71Ra5kcRdc6jA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] two questions...electric experiments other dangerous stuff","postDate":"999903425","msgId":24429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwOTA3MjI1NzA1LjYwODU0LnFtYWlsQHdlYjE0MzAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwMDIwMWMxMzdkZiQ4MWNjYzU4MCQ1ZWQ3OWJjZUBvZW1jb21wdXRlcj4="},"prevInTopic":24406,"nextInTopic":24455,"prevInTime":24428,"nextInTime":24430,"topicId":24403,"numMessagesInTopic":0,"msgSnippet":"Dear Johanna I don t necessarily think your son has betrayed your trust.... BUT I do think he needs a mentor or guide in his field of interest. if you cannot","messageBody":"<div id=\"ygrps-yiv-286529956\">Dear Johanna<br/>\n<br/>\nI don&#39;t necessarily think your son has betrayed your<br/>\ntrust....<br/>\nBUT I do think he needs a mentor or guide in his field<br/>\nof interest. if you cannot find someone whose judgment<br/>\nyou trust, you must insist that you son does. Then he<br/>\ncan reassure you through this person who is<br/>\nknowledgeable in the field.  We had a similar<br/>\nsituation with motorcycles. I had told my sons they<br/>\ncould ride when they could build and maintain the<br/>\nbikes (go carts, cars, etc).....but ds1 and ds2<br/>\nrebuilt motorcycles at ages 13 and 11. Whoops!! The<br/>\nboys didn&#39;t think I had enough know how in their<br/>\nfields of interest to say what was safe and what<br/>\nwasn&#39;t.  However as I WAS and still am their MOTHER I<br/>\ncould say what worried me and what didn&#39;t and that<br/>\nthey were not allowed to do certain things. Like ride<br/>\non public roads without a license.  Had to have good<br/>\nhelmets. As for learning to ride I told them they had<br/>\nto &quot;get checked out&quot; and have the bike &quot;checked out&quot;<br/>\nby person whose expertise in the field we both<br/>\nrespected.  I fortunately knew just such a person. <br/>\nAny innovative mechanical stuff they wanted to do, I<br/>\nwould tell them that if Jon B. would tell me it was<br/>\nOK, then I would allow it.  If they couldn&#39;t convince<br/>\nJon, then do something else.  It worked.  At different<br/>\ntimes they worked for their mentor for pay.<br/>\n<br/>\nIn this case he was an old friend. But if it happened<br/>\nto be in the area of electronics then the person they<br/>\nhad to go through was G&#39;pa....an electrical engineer,<br/>\nor, well, I could hunt up someone for just about<br/>\nanything that came along, if it was something they<br/>\ndidn&#39;t feel I was qualified to pass judgment on.<br/>\n<br/>\nKids seem to feel that we Mama&#39;s never did anything<br/>\nwhen we were younger, that we don&#39;t know what&#39;s going<br/>\non in the world. DS1 recently told me (he is in his<br/>\nlate 20s) that I didn&#39;t understand why he liked to<br/>\nrace because I had never even driven a car fast! I had<br/>\nto hide the internal smirk.<br/>\n<br/>\nBUT...was your DS TRYING to hurt you? That is a whole<br/>\ndifferent arena.<br/>\n<br/>\nor was he just trying to see if his idea would work?<br/>\nOne thing I had to do was to buy thrift store things<br/>\nfor the boys to dismantle....&#39;cause they were going to<br/>\ndo that regardless of where anything came from or what<br/>\nit cost.  I bought lots of telephones, stereos,<br/>\nradios, etc....all of the butter knives were used as<br/>\nscrewdrivers...wires were always strung all over the<br/>\nplace, all of the little cars and trucks had hobby<br/>\nmotors attached.....Roy does this stuff too...remote<br/>\ncontrol things are dismantled the quickest....One PHD<br/>\nphysics researcher told me he dismantled his mother&#39;s<br/>\nsewing machine as a young child. Apparently the<br/>\npunishment was severe....he asked me, when DS was a<br/>\ntoddler, to &quot;please not get mad if he took apart my<br/>\nsewing machine.&quot; That was my first intro to<br/>\nunschooling!!!<br/>\n<br/>\nI wonder if there is a way for an<br/>\nunschooler/homeschooler to enter a science fair?<br/>\nProbably he would do something safer than a kite in an<br/>\nelectrical storm with a key on the string!! He may<br/>\njust make the BEST electric car yet!<br/>\n<br/>\nGood luck with your DS....let us know what he is up<br/>\nto, OK? And if he gets too wild...there is the breaker<br/>\nbox.  Just unplug him.<br/>\n<br/>\nSharon<br/>\n<br/>\n--- Johanna SanInocencio &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:saninocencio@...\">saninocencio@...</a>&gt;<br/>\nwrote:<br/>\nWhat if your child<br/>\n<blockquote><span title=\"ireply\"> &gt; has betrayed trust? I have a son (14) who loves to<br/>\n&gt; experiment with electronic things.a few weeks ago he<br/>\n&gt; tried to boobytrap his room by running a wire off<br/>\n&gt; the electric fence, through his bedroom window, and<br/>\n&gt; attaching it to his doorknob. He was angry and surly<br/>\n&gt; for two days because I stopped this experiment.  He<br/>\n&gt; has dissassembled several of his own things like<br/>\n&gt; calculators and portable tape decks. I told him I<br/>\n&gt; did not mind, they were his things, my only<br/>\n&gt; restriction was to not experiment with anything<br/>\n&gt; plugged into the wall, only with battery power. Less<br/>\n&gt; than a half hour later, I walked into his room (the<br/>\n&gt; door was open) and he had a plug in the wall and<br/>\n&gt; about to attach a small wire (20 gauge) to the open<br/>\n&gt; end or it. A few years back same child zapped his<br/>\n&gt; butt across a room with a similar experiment<br/>\n&gt; involving a lightbulb, solder and an open plug. Blew<br/>\n&gt; out wiring in the house. Thankfully the circuit<br/>\n&gt; breaker went off before he was killed. I have<br/>\n&gt; suggested books he could use to learn safely. I try<br/>\n&gt; to help him. Sometimes he accepts my guidance, other<br/>\n&gt; times he digs in his heels and does whatever he<br/>\n&gt; wants.<br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; Johanna <br/>\n&gt; Life is the ultimate learning experience!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been<br/>\n&gt; removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nGet email alerts & NEW webcam video instant messaging with Yahoo! Messenger<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://im.yahoo.com\">http://im.yahoo.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"Bonni Sollars","from":"Bonni Sollars &lt;BSOLLARS@...&gt;","replyTo":"LIST","senderId":"fBOsHlsczuEzFXlefubIiQDwvbxclktUHZz6RHnLro3ihfsa6_yXbMCy1icHz_Rt5IKigOXI6s3XtOlM2D0lT1GVFb4D8QLd","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] two questions...","postDate":"999900021","msgId":24455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwOTA3LjE4MDc1NC4tMTg5NzI5LjIxLmJzb2xsYXJzQGp1bm8uY29tPg=="},"prevInTopic":24429,"nextInTopic":0,"prevInTime":24454,"nextInTime":24456,"topicId":24403,"numMessagesInTopic":0,"msgSnippet":"Johanna,  I understand your desire for your son s safety.  But maybe your son jimmy rigged his bedroom to express a point, and his surliness is over his point","messageBody":"<div id=\"ygrps-yiv-1490384640\">Johanna,  I understand your desire for your son&#39;s safety.  But maybe your<br/>\nson jimmy rigged his bedroom to express a point, and his surliness is<br/>\nover his point not being received?  Sometimes in our creativity we are<br/>\nable to say things we can&#39;t articulate.<br/>\nAlso, when my brother was little, my step mom would let him touch<br/>\neverything and explore everything.  I thought she was spoiling him,<br/>\nbecause he would take apart my record player, etc. and not get in trouble<br/>\nfor it.  One time he adapted the flashlight to plug into the wall (age<br/>\n3).  By four, he knew how a motor runs.  He rigged a board so he could<br/>\ndrive the truck in the barn!  In first grade, once he learned what the<br/>\nalphabet was for, he subscribed to popular mechanics.  He almost failed<br/>\nhigh school because he would not do his English assignments.  When he was<br/>\nfourteen, he was fixing appliances in an appliance store.  In high<br/>\nschool, he got a job in a computer store fixing computers.  Today he<br/>\nworks for Bill Gates.  He makes more money than I do, with my controlling<br/>\nmom who wouldn&#39;t give me freedom to get into trouble.  And he is a very<br/>\naffectionate, loving person.<br/>\nI don&#39;t think your son broke your trust.  He&#39;s just a genius.<br/>\nMy brother&#39;s room was never clean.  He had electrical parts all over his<br/>\nfloor,so you dared not vacuum or walk there without shoes on.  He also<br/>\nloved to play all sorts of music and make commercials on the tape<br/>\nrecorder for fun.  He also loved sarcastic humor, and has an incredible<br/>\nwit.  I brag about my brother to everyone I know.  <br/>\nForgive your son, and let him grow.<br/>\nOh, and as for your question about unschooling and scripture.  Here are<br/>\nsome scriptures, I&#39;m sorry that I don&#39;t write the reference, but it&#39;s in<br/>\nthere somewhere.  The first is to raise up a child in the way he should<br/>\ngo and when he is grown he will not depart from it.  That means, in the<br/>\nway he is bent.  That involves according to their unique,god-given<br/>\ntendencies.<br/>\nThe other one is the one where Moses says to teach your children the law<br/>\nwhen your sitting, and walking and going along.  In other words, teach<br/>\nthem in the context of life.  I should also point out what I&#39;ve been<br/>\nconsidering lately.  The law was a controlling thing, but there is<br/>\nfreedom in the law of the Spirit of Life in Christ Jesus.  We should obey<br/>\nGod because we know he loves us and wants our best, not because we fear<br/>\nhim.  Because there is no love in fearful obedience, only slavery.  But<br/>\nin a free, loving relationship, we can do good as it flows out of us from<br/>\nrelating and interacting with our living God.  In the same way, I can<br/>\nteach just by being myself and by having a relationship with my kids. <br/>\nOh, and here&#39;s another, Jesus said the servant is greatest in his<br/>\nkingdom.  Not the one who is controlling, but the one who serves.  So, I<br/>\ncan serve my children well by offering them a context in which to grow<br/>\nand learn, rather than by forcing them to learn what I want them to<br/>\nlearn.<br/>\nI&#39;m sure everything will work out, with a lot of patience and prayer?<br/>\nOh, I should say I have not done this for five years, I am only just<br/>\nlearning about it.  But I felt that God was the one who directed me to it<br/>\nright when I was considering what curriculum to use.  Also, when my<br/>\nchildren were young and I homeschooled my oldest, I remember noticing how<br/>\nmuch they learn even when not doing their studies.<br/>\nBonni</div>","specialLinks":[]},{"userId":0,"authorName":"Rachel Wolfe Ravenhart","from":"Rachel Wolfe Ravenhart &lt;ravenhart@...&gt;","replyTo":"LIST","senderId":"7R0Zchb6MBGkAF87eDx4dbqw6GNMy_tjdY9FhInrAct4zBaU--R7glGoKaHFc9BKJwGOiIRZhty4-ff8920tdiu-_fAC51yM6mcyX78WHCw5_A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] two questions...","postDate":"999896738","msgId":24406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCOTkzNkExLjcyMTEyMEIxQGhvbWUuY29tPg==","referencesHeader":"PDAwMDIwMWMxMzdkZiQ4MWNjYzU4MCQ1ZWQ3OWJjZUBvZW1jb21wdXRlcj4="},"prevInTopic":24403,"nextInTopic":24429,"prevInTime":24405,"nextInTime":24407,"topicId":24403,"numMessagesInTopic":0,"msgSnippet":"Johanna, I m not Christian and not overly familiar with the Christian Bible, but I do find myslef muttering This too shall pass under my breath a lot. IT","messageBody":"<div id=\"ygrps-yiv-1879515180\">Johanna,<br/>\n<br/>\nI&#39;m not Christian and not overly familiar with the Christian Bible, but<br/>\nI do find myslef muttering &quot;This too shall pass&quot; under my breath a lot.<br/>\n<br/>\nIT sounds as if you&#39;re making reasonable safety requests for you son.<br/>\nAfter all, ALL of you have to live in the house. Is there anywhere<br/>\nnearby where he could learn and do such experiments? A local community<br/>\ncollege, maybe?<br/>\n<br/>\n<br/>\nRachel<br/>\nWarrior bitch, kitchen witch, Celtic mommy type person with an attitude<br/>\n<br/>\nJohanna SanInocencio wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Before I ask these questions, please understand I do not ask to judge<br/>\n&gt; anyone and I hope everyone else keeps it so. Are any of you who have<br/>\n&gt; been unschooling wholeheartedly for a long time, say at least five<br/>\n&gt; years, Christian? If so have you ever studied it out in the Bible? Can<br/>\n&gt; you share any scriptures that have encouraged you in your walk? We<br/>\n&gt; &quot;tried&quot; unschooling in the spring this year. My younger ones can be<br/>\n&gt; very inventive. I love the idea of unschooling but my husband is<br/>\n&gt; skeptical. He wants the children doing bookwork. My oldest<br/>\n&gt; daughter(17) thinks unschooling is foolish and does not understand.<br/>\n&gt; She want work assigned to her and puts a bee in my husband&#39;s ear about<br/>\n&gt; it.  I won&#39;t directly disobey my husband. I want to help him to<br/>\n&gt; understand so he will consent.<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Johanna SanInocencio","from":"&quot;Johanna SanInocencio&quot; &lt;saninocencio@...&gt;","replyTo":"LIST","senderId":"5HtHaHEaHheOWJfKZJn50xuM4g42smvqCxTZb-hcjYEFbyUgjlZ5MpJ4xrQa-h7imP9PTJ1H-PgACnYjQ7EMST7VH8A6K3M_vDA2org3poxWRoLOnzhsuTLPtQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"two questions...","postDate":"999895296","msgId":24403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDIwMWMxMzdkZiQ4MWNjYzU4MCQ1ZWQ3OWJjZUBvZW1jb21wdXRlcj4="},"prevInTopic":0,"nextInTopic":24406,"prevInTime":24402,"nextInTime":24404,"topicId":24403,"numMessagesInTopic":0,"msgSnippet":"Before I ask these questions, please understand I do not ask to judge anyone and I hope everyone else keeps it so. Are any of you who have been unschooling","messageBody":"<div id=\"ygrps-yiv-1142596819\">Before I ask these questions, please understand I do not ask to judge anyone and I hope everyone else keeps it so. Are any of you who have been unschooling wholeheartedly for a long time, say at least five years, Christian? If so have you ever studied it out in the Bible? Can you share any scriptures that have encouraged you in your walk? We &quot;tried&quot; unschooling in the spring this year. My younger ones can be very inventive. I love the idea of unschooling but my husband is skeptical. He wants the children doing bookwork. My oldest daughter(17) thinks unschooling is foolish and does not understand. She want work assigned to her and puts a bee in my husband&#39;s ear about it.  I won&#39;t directly disobey my husband. I want to help him to understand so he will consent.<br/>\n    A lot of the comments Sandra hs made lately involve trusting your children. What if your child has betrayed trust? I have a son (14) who loves to experiment with electronic things.a few weeks ago he tried to boobytrap his room by running a wire off the electric fence, through his bedroom window, and attaching it to his doorknob. He was angry and surly for two days because I stopped this experiment.  He has dissassembled several of his own things like calculators and portable tape decks. I told him I did not mind, they were his things, my only restriction was to not experiment with anything plugged into the wall, only with battery power. Less than a half hour later, I walked into his room (the door was open) and he had a plug in the wall and about to attach a small wire (20 gauge) to the open end or it. A few years back same child zapped his butt across a room with a similar experiment involving a lightbulb, solder and an open plug. Blew out wiring in the house. Thankfully the circuit breaker went off before he was killed. I have suggested books he could use to learn safely. I try to help him. Sometimes he accepts my guidance, other times he digs in his heels and does whatever he wants.<br/>\n<br/>\n  <br/>\nJohanna <br/>\nLife is the ultimate learning experience!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":24292,"nextTopicId":24463}}