{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TIPS FOR UNSCHOOLING/DESCHOOLING?","postDate":"1302204176","msgId":60559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlubDJ1Zys4NTE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlua3BuZytyMTBiQGVHcm91cHMuY29tPg=="},"prevInTopic":60558,"nextInTopic":0,"prevInTime":60558,"nextInTime":60560,"topicId":60549,"numMessagesInTopic":0,"msgSnippet":"... ************ Sometimes, too, its possible to back up and redo whatever - say I m sorry, let s try this again... you want to do this and I m concerned","messageBody":"<div id=\"ygrps-yiv-1122800316\">&quot;sweetbo3boys&quot; &lt;sweetbo3boys@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; If I get into a situation where I have yelled at my kids and didn&#39;t like how I handled it, I simply apologize to my kids. I tell them I could have reacted differently.<br/>\n </span></blockquote>************<br/>\n<br/>\nSometimes, too, its possible to back up and redo whatever - say &quot;I&#39;m sorry, let&#39;s try this again... you want to do this and I&#39;m concerned about x, so how can I help you do what you want without x being a problem?&quot; You don&#39;t necessarily have to say all that in words! Lots of parents get the idea that &quot;its important to stick to your guns&quot;. It&#39;s important for kids to see better ways to handle mistakes than *just* sticking with them, so swallowing your pride, appologizing And finding a better solution helps them see that. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":180083488,"authorName":"sweetbo3boys","from":"&quot;sweetbo3boys&quot; &lt;sweetbo3boys@...&gt;","profile":"sweetbo3boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: TIPS FOR UNSCHOOLING/DESCHOOLING?","postDate":"1302194736","msgId":60558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlua3BuZytyMTBiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGluaWxoMys0MGJpQGVHcm91cHMuY29tPg=="},"prevInTopic":60557,"nextInTopic":60559,"prevInTime":60557,"nextInTime":60559,"topicId":60549,"numMessagesInTopic":0,"msgSnippet":"If I get into a situation where I have yelled at my kids and didn t like how I handled it, I simply apologize to my kids. I tell them I could have reacted","messageBody":"<div id=\"ygrps-yiv-242276117\">If I get into a situation where I have yelled at my kids and didn&#39;t like how I handled it, I simply apologize to my kids. I tell them I could have reacted differently. I think, for me, acknowledging it takes the guilt and shame out of the mix and I can learn and move on. Even with your young children, they understand and appreciate when an adult can say I am sorry. When I first started unschooling, we had more of these incidents and less over the years, however, life is an ongoing process and you never know what will happen. It is important to give ourselves a break as well as our children so we can learn and evolve. <br/>\nAngela<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Patrick&quot; &lt;pmurphy06@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello,<br/>\n&gt; <br/>\n&gt; Im new to the group. Im a father of 3 (5,3,and 5mths) and I am with my children all if the time. I have been unschooling for a couple weeks. I just pulled my child out of half a day kindergarten 2 weeks ago.<br/>\n&gt; I am new to unschooling and am struggling a bit to deschool my mind and ways. 2 areas I am working on are my own self actions and letting my children do what they want.<br/>\n&gt; I sometimes yell at the kids  to clean up or to stop bickering or to do something else I want them to do. I am not teaching them any sort of curriculum at this time but I am still struggling a bit to just let them be whoever they want to be.<br/>\n&gt; Does anyone have any tips for not yelling at the kids? I really want to stop this as much as possible but sometimes I get frustrated.<br/>\n&gt; What about Clean Up? How as unschoolers do you have the kids clean up after themsleves or is it better to clean it up yourself or better not to clean up at all? <br/>\n&gt; I love the idea of unschooling for letting them read/write/play/ everything at their own pace. Child led learning is great. How do I let it happen?<br/>\n&gt; Struggling a bit with all of this as I am pretty new to it. Any tips are appreciated. Thank you.<br/>\n&gt; <br/>\n&gt; Patrick<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] re:TIPS FOR UNSCHOOLING/DESCHOOLING?","postDate":"1302185763","msgId":60557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZGNjA4NTk5LTg4RDMtNEFEMi04OEFDLUM5OENDQTYyNUJEQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlua2Yzbis4MmtpQGVHcm91cHMuY29tPg==","referencesHeader":"PGlua2Yzbis4MmtpQGVHcm91cHMuY29tPg=="},"prevInTopic":60556,"nextInTopic":60558,"prevInTime":60556,"nextInTime":60558,"topicId":60549,"numMessagesInTopic":0,"msgSnippet":"-=-when you are about to yell, it is to release you from a very important experience of emotional reality that is pregnant with the possibility of learning","messageBody":"<div id=\"ygrps-yiv-596466157\">-=-when you are about to yell, it is to release you from a very important experience of emotional reality that is pregnant with the possibility of learning what you do , why you do it and not repeating the pattern to your kids. the pattern of giving up on life/ on relating with another whole individual. stop and sit with curiosity of a zen moment / a master, a profound wisdom is present that changes everything in these moments. -=-<br/>\n<br/>\nIt&#39;s pretty difficult for a parent dealing with a young child, in a moment when he is about to yell, to stop and sit in ANY literal/figurative/physical way.<br/>\n<br/>\nIt&#39;s very true that parenting in a mindful way can and does heal one&#39;s own inner child.  We can&#39;t stop to commune with the inner child, though, while the current child is needing a present parent.<br/>\n<br/>\nLearning to think of two choices and make the better one is the best tool I&#39;ve found and it works every time.  If the two choices are &quot;what was done to me&quot; and &quot;what I wish had been done to me instead,&quot; it&#39;s healing every time, too.<br/>\n<br/>\n-=-these moments are magical if you can beleive enough to be present with your child as an equal in a moment of inquiry of an unknown reality , a reality that we can only garner the smallest amount but we need to start eating and stop fasting. -=-<br/>\n<br/>\n<br/>\n<br/>\nI don&#39;t know what &#39;a reality that we can only garner the smallest amount&quot; means, but I don&#39;t think a parent should be present with a child as an equal in ANY rough moment.  Children are depending on their parents to be the more knowledgable guide to the world, not to share a moment of inquiry concerning unknown realities.  That&#39;s not direct being.   In a partnership with a child, one person has been here a few decades already and should be prepared to be the guiding member of the team in moments of confusion or conflict.<br/>\n<br/>\nAll three of my kids are here this week (Kirby, 24, visiting from Austin).  They help me now in many ways I used to help them--helping find things, helping me remember words I&#39;m not thinking of (&quot;reptile&quot; escaped me the other day, but Marty helped me without suggesting I was going senile if I couldn&#39;t think of that word, because in his 22 years his parents never suggested he was a baby or not too bright if he didn&#39;t know a word).  They&#39;ve driven me around, done errands for me, opened a jar, carried heavy boxes of books.   They did those things sweetly because for years I chose sweet over impatient every time I could manage or remember to do it.<br/>\n<br/>\nIf a parent practices making the better choice, it doesn&#39;t matter what or why or pattern or childhood in that deciding moment.  What matters is &quot;better.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":402920926,"authorName":"Patrick","from":"&quot;Patrick&quot; &lt;dasein1959@...&gt;","profile":"dasein1959@verizon.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"re:TIPS FOR UNSCHOOLING/DESCHOOLING?","postDate":"1302183863","msgId":60556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlua2Yzbis4MmtpQGVHcm91cHMuY29tPg=="},"prevInTopic":60554,"nextInTopic":60557,"prevInTime":60555,"nextInTime":60557,"topicId":60549,"numMessagesInTopic":0,"msgSnippet":"hi patrick. I am also patrick and  a stay at home unschool dad for the past 6 years of unschooling with my son now 17( we took him out in mid 5th grade). feel","messageBody":"<div id=\"ygrps-yiv-1164625689\">hi patrick.<br/>\n I am also patrick and  a stay at home unschool dad for the past 6 years of unschooling with my son now 17( we took him out in mid 5th grade). feel free to email me off list if you would like. I&#39;m going to answer the one about yelling at kids. unschooling to me is a sign that points to a direction/ or a way through a particular conflict; the problem of the education system in the western world . but it also shines a light on the broader conflicts and struggles of human existence;for me this centers on relationships.<br/>\n being a parent triggers past experiences of our own past relationships when we were at our children&#39;s age. our relationships from the past are cluttered with traumas that are often chronic in nature. at those ages we did the best we could do to figure out what was going on when there was emotional disruption of our nuturing relationship with our parents. I believe these disruptions were their inability to contain the emotional turbulence of their own childhood relationships; that is how we learn our models of how to (not) relate but especially how to retreat and attack our own ability to tolerate emotional unknowns that are the healthy edge of growth and learning. when you yell, something has happened to you right before; something emotionally unbearable; the unknown quality is frightening and you want to impose a knowness, an order of what is right and wrong, a protection back toward a sense of saftey and security.<br/>\nthe relationship with the child before this cutt off through yelling is opening to something to be learned by both you and the child. in the past as a child you could not tolerate the feelings but you can now. it is an available choice. to me that is very important; to know the moments of rupture of the relationship with your kid through yelling isyour doing to protect yourself. to me ideally it is a time to be curious about what is going on emotionally; not to fix it, resolve it, make it go away, but rather a real oppurtunity to repair through learning and understanding about what options are available. and most importantly that the growth/ healing/ learning is often only available in the matriux of a relationship, an emotionally charged one that you have retreated from in the past and accept that you don&#39;t have a choice. the beauty of repeating relationships again now with you as parent the other thou as child gives you the fulcrum of both sides of the equation.<br/>\n when you are about to yell, it is to release you from a very important experience of emotional reality that is pregnant with the possibility of learning what you do , why you do it and not repeating the pattern to your kids. the pattern of giving up on life/ on relating with another whole individual. stop and sit with curiosity of a zen moment / a master, a profound wisdom is present that changes everything in these moments. <br/>\n these moments are magical if you can beleive enough to be present with your child as an equal in a moment of inquiry of an unknown reality , a reality that we can only garner the smallest amount but we need to start eating and stop fasting. <br/>\npatrick out</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] TIPS FOR UNSCHOOLING/DESCHOOLING?","postDate":"1302136012","msgId":60554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFRUQyMDgyLTgwMkUtNDg3MC1BMkU2LUExNjFDODgzRkQxOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGluaWxoMys0MGJpQGVHcm91cHMuY29tPg==","referencesHeader":"PGluaWxoMys0MGJpQGVHcm91cHMuY29tPg=="},"prevInTopic":60553,"nextInTopic":60556,"prevInTime":60553,"nextInTime":60555,"topicId":60549,"numMessagesInTopic":0,"msgSnippet":"-=-I am new to unschooling and am struggling a bit to deschool my mind and ways. 2 areas I am working on are my own self actions and letting my children do","messageBody":"<div id=\"ygrps-yiv-2111899367\">-=-I am new to unschooling and am struggling a bit to deschool my mind and ways. 2 areas I am working on are my own self actions and letting my children do what they want.-=-<br/>\n<br/>\nI don&#39;t think it helps to think of it as &quot;letting children do what they want.&quot;  Think of it as finding lots of interesting things to do with them, without pressing or forcing them to do any of them.  Instead of saying &quot;But I planned this (play dough / puzzle / movie),&quot; make it appealing and interesting, and lure them in.  They shouldn&#39;t be needing to find something interesting to do on their own.<br/>\n<br/>\n<br/>\n-=-I sometimes yell at the kids to clean up or to stop bickering or to do something else I want them to do. I am not teaching them any sort of curriculum at this time but I am still struggling a bit to just let them be whoever they want to be.-=-<br/>\n<br/>\nYelling at kids to stop bickering isn&#39;t about school or no school.<br/>\n<br/>\nWhoever they ARE.  Not who they want to be. :-)  And be there with them--your real self and their real selves.<br/>\n<br/>\n-=-Does anyone have any tips for not yelling at the kids? I really want to stop this as much as possible but sometimes I get frustrated.-=-<br/>\n<br/>\nOne sure-fire tip, but it&#39;s in the sound file at the end of this page:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\nYou can download it to your own computer or listen from there, but it&#39;s about making the more peaceful choice.   Once you know how to do it, you can&#39;t really NOT do it very well.<br/>\n<br/>\n-=-What about Clean Up? How as unschoolers do you have the kids clean up after themsleves or is it better to clean it up yourself or better not to clean up at all? -=-<br/>\n<br/>\nUnschooling has no governing body or by-laws, so there is no way unschoolers as a group do or don&#39;t do things.  It&#39;s not a democracy. :-)<br/>\nEach parent should do what makes sense and what works.  I personally think there&#39;s a lot of merit to cleaning up after the kids, and making it fun, so they might want to help a little bit, and not shaming them if they don&#39;t help more.  Others think differently.  Here&#39;s a collection of lots of thoughts and experiences:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a><br/>\n<br/>\nRead a little, try a little, wait a while and watch.  Don&#39;t try to jump from point A to point Z.<br/>\n<br/>\n-=-Child led learning is great. How do I let it happen?<br/>\nStruggling a bit with all of this as I am pretty new to it. Any tips are appreciated. -=-<br/>\n<br/>\n&quot;Child led learning&quot; is another problem.  Where do they need to lead?  Are you going to go too?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\nCreate a learning environment. Nobody needs to lead, and surely not the children.  Everyone should have a choice to opt out of any particular activity or sandwich or game, if possible.  Sometimes it&#39;s not possible, but if you&#39;ve given them tons of choices, they&#39;ll start to trust you when you say there aren&#39;t good alternatives a time or two.<br/>\n<br/>\nAdd up all the years you were in school, including university and teaching, and that&#39;s how many months it will probably take you to relax about all this, IF you&#39;re being conscientious and moving incrementally toward the way you want to be.  It won&#39;t happen in weeks, or even in a single year, for the parents.  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TIPS FOR UNSCHOOLING/DESCHOOLING?","postDate":"1302130915","msgId":60553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaXJkMytjN2FhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGluaWxoMys0MGJpQGVHcm91cHMuY29tPg=="},"prevInTopic":60549,"nextInTopic":60554,"prevInTime":60552,"nextInTime":60554,"topicId":60549,"numMessagesInTopic":0,"msgSnippet":"Sandra s website is a great place to start...she has a page devoted to Beginning : http://sandradodd.com/beginning Andrea Q","messageBody":"<div id=\"ygrps-yiv-1666808868\">Sandra&#39;s website is a great place to start...she has a page devoted to &quot;Beginning&quot;:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a><br/>\n<br/>\n<br/>\nAndrea Q<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Patrick&quot; &lt;pmurphy06@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello,<br/>\n&gt; <br/>\n&gt; Im new to the group. Im a father of 3 (5,3,and 5mths) and I am with my children all if the time. I have been unschooling for a couple weeks. I just pulled my child out of half a day kindergarten 2 weeks ago.<br/>\n&gt; I am new to unschooling and am struggling a bit to deschool my mind and ways. 2 areas I am working on are my own self actions and letting my children do what they want.<br/>\n&gt; I sometimes yell at the kids  to clean up or to stop bickering or to do something else I want them to do. I am not teaching them any sort of curriculum at this time but I am still struggling a bit to just let them be whoever they want to be.<br/>\n&gt; Does anyone have any tips for not yelling at the kids? I really want to stop this as much as possible but sometimes I get frustrated.<br/>\n&gt; What about Clean Up? How as unschoolers do you have the kids clean up after themsleves or is it better to clean it up yourself or better not to clean up at all? <br/>\n&gt; I love the idea of unschooling for letting them read/write/play/ everything at their own pace. Child led learning is great. How do I let it happen?<br/>\n&gt; Struggling a bit with all of this as I am pretty new to it. Any tips are appreciated. Thank you.<br/>\n&gt; <br/>\n&gt; Patrick<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":387419012,"authorName":"Patrick","from":"&quot;Patrick&quot; &lt;pmurphy06@...&gt;","profile":"onthemovellja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TIPS FOR UNSCHOOLING/DESCHOOLING?","postDate":"1302124899","msgId":60549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaWxoMys0MGJpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":60553,"prevInTime":60548,"nextInTime":60550,"topicId":60549,"numMessagesInTopic":0,"msgSnippet":"Hello, Im new to the group. Im a father of 3 (5,3,and 5mths) and I am with my children all if the time. I have been unschooling for a couple weeks. I just","messageBody":"<div id=\"ygrps-yiv-1601757236\">Hello,<br/>\n<br/>\nIm new to the group. Im a father of 3 (5,3,and 5mths) and I am with my children all if the time. I have been unschooling for a couple weeks. I just pulled my child out of half a day kindergarten 2 weeks ago.<br/>\nI am new to unschooling and am struggling a bit to deschool my mind and ways. 2 areas I am working on are my own self actions and letting my children do what they want.<br/>\nI sometimes yell at the kids  to clean up or to stop bickering or to do something else I want them to do. I am not teaching them any sort of curriculum at this time but I am still struggling a bit to just let them be whoever they want to be.<br/>\nDoes anyone have any tips for not yelling at the kids? I really want to stop this as much as possible but sometimes I get frustrated.<br/>\nWhat about Clean Up? How as unschoolers do you have the kids clean up after themsleves or is it better to clean it up yourself or better not to clean up at all? <br/>\nI love the idea of unschooling for letting them read/write/play/ everything at their own pace. Child led learning is great. How do I let it happen?<br/>\nStruggling a bit with all of this as I am pretty new to it. Any tips are appreciated. Thank you.<br/>\n<br/>\nPatrick</div>","specialLinks":[]}],"prevTopicId":60539,"nextTopicId":60545}}