{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Trying to breathe and start over...","postDate":"1093262665","msgId":98747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjkwMWM0ODkwOSQ1Njg2MDA3MCQzZWFlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDIwMDQwODIxMjI0NC5pN0xNaXQwSTA2MTY2NEBteDEuY2VudHVyeXRlbC5uZXQ+"},"prevInTopic":98737,"nextInTopic":0,"prevInTime":98746,"nextInTime":98748,"topicId":98646,"numMessagesInTopic":0,"msgSnippet":"With Jayn I try hard to keep modeling what a pleasant tone is, both with her and to dh. My occasional phrase, I like it better when you speak kindly to me","messageBody":"<div id=\"ygrps-yiv-319351530\">With Jayn I try hard to keep modeling what a &quot;pleasant tone&quot; is, both with<br/>\nher and to dh. My occasional phrase, &quot;I like it better when you speak kindly<br/>\nto me&quot; has a lot more meaning for her now, compared to a year ago. I also<br/>\nsay &quot;Thank you for asking so pleasantly&quot; as appropriate.<br/>\n====================<br/>\n<br/>\nI could do better in the modeling department, not that I&#39;m usually ugly with<br/>\nher, because I&#39;m not, but I do get tired and frustrated, and my patience<br/>\nwears thin.  Then the &quot;I&#39;m the boss&quot; tone comes out.  (Which is really a<br/>\nmistake, because then she gets REALLY loud and digs her heels in about<br/>\nwhatever we&#39;re at odds about!)  Sometimes I lecture and nag too, though I<br/>\nreally try not to do that--my mom was infamous for this...still is.  UGH!<br/>\nDon&#39;t want to be like that.  I really don&#39;t.<br/>\n<br/>\nStill, for the most part I am civil and pleasant and loving when I talk to<br/>\nmy kids.  Also I try to keep it short when I am reminding 3 yo to use a<br/>\npleasant voice.  Sometimes she stops and re-does her request in a much less<br/>\nwhiny and demanding tone, but she also often chooses to just yell more<br/>\nloudly at me.  She is just young AND it is also in her nature to be a bit of<br/>\na growly bear.  I think she really enjoys being contrary for the drama of<br/>\nit, frankly, and sometimes it&#39;s downright funny because we can see she is<br/>\nmustering up extra orneriness, just for effect, though we don&#39;t usually let<br/>\nher see us laugh.  But sometimes, actually, if we do laugh or somehow show<br/>\nthat we recognize her act, she gets in on the fun and laughs at herself too!<br/>\nA real tension breaker.</div>","specialLinks":[]},{"userId":86181566,"authorName":"jennefer harper","from":"jennefer harper &lt;jenneferh2000@...&gt;","profile":"jenneferh2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying to breathe and start over...","postDate":"1093231099","msgId":98737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODIzMDMxODE5LjIxNTUwLnFtYWlsQHdlYjExMzA5Lm1haWwueWFob28uY29tPg=="},"prevInTopic":98675,"nextInTopic":98747,"prevInTime":98736,"nextInTime":98738,"topicId":98646,"numMessagesInTopic":0,"msgSnippet":"Again, I ve made comments with in the quotes.  As with my last post I did not have time to proof read with two small kids running around me, so I hope it reads","messageBody":"<div id=\"ygrps-yiv-741606057\">Again, I&#39;ve made comments with in the quotes.  As with<br/>\nmy last post I did not have time to proof read with<br/>\ntwo small kids running around me, so I hope it reads<br/>\nwell...<br/>\n<br/>\n<br/>\nDate: Sat, 21 Aug 2004 13:09:42 -0700<br/>\n   From: &quot;Andrea Burlingame&quot;<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a>&gt;<br/>\nSubject: Trying to breathe and start over...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I do think my 3 yo, who I&#39;ve written about before as<br/>\n&gt;&gt;being very <br/>\n&gt;&gt;challenging to everyone in my family in the past, is<br/>\n&gt;&gt;going through a rough <br/>\n&gt;&gt;time again lately.  I don&#39;t know the reason, but she<br/>\n&gt;&gt;seems to be <br/>\n&gt;&gt;regressing a bit. <br/>\n<br/>\n </span></blockquote>There are probably a lot of reasons.  Moving, &#39;potty<br/>\nlearning&#39;, and also she may be seeing how you act with<br/>\nthe 1 year old, and so she may want to act like a<br/>\n&#39;baby&#39; again.  I&#39;m sure this is all pretty natural and<br/>\nwill turn around.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It may be because she knows I&#39;m frustrated by her<br/>\n&gt;&gt;potty <br/>\n&gt;&gt;learning. <br/>\n<br/>\n </span></blockquote>Seems like it might be, and you showing frustration<br/>\ncould be very damaging to her.  Try not to let your<br/>\nfrustration show too much with this.  I&#39;ve heard that<br/>\nat around age 3 and probably other ages, children&#39;s<br/>\nbladders grow and they  temporarily lose control.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Then, she just started peeing <br/>\n&gt;&gt;everywhere again, and is still doing that much of<br/>\n&gt;&gt;the time 2 weeks or so later.  <br/>\n&gt;&gt;Yet she doesn&#39;t want to wear diapers. <br/>\n<br/>\n </span></blockquote>Have you tried padded underwear?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She still doesn&#39;t speak clearly <br/>\n&gt;&gt;enough for me to always understand her<br/>\n<br/>\n </span></blockquote>At age 3?  Could she have a speech impediment?<br/>\nSign might be very helpful here too.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;ve <br/>\n&gt;&gt;explained to her that people would be much happier<br/>\n&gt;&gt;about helping her <br/>\n&gt;&gt;when she needs it if she would only ask in a<br/>\n&gt;&gt;pleasant tone of voice rather <br/>\n&gt;&gt;than whining or screaming out orders to us all.  <br/>\n<br/>\n </span></blockquote>When this happens in our house, I say, can you use<br/>\nyour nice voice, not your &#39;whiny&#39; voice or whatever. <br/>\nUsually this works right away; I also wait until my<br/>\nchild asks nicely before I do whatever it is they&#39;re<br/>\n&#39;asking&#39; for.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I <br/>\n&gt;&gt;don&#39;t know what I want, actually.  <br/>\n<br/>\n </span></blockquote>I know it&#39;s hard to have a clear sense, sometimes, of<br/>\nwhat it is you do really want.  Sometimes you think<br/>\nyou want one thing, but really what you want is<br/>\nsomething else.  Maybe meditating upon what your do<br/>\nwant and making a list might help you works on things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I just want peace and mutual regard <br/>\n&gt;&gt;and respect in this house. <br/>\n<br/>\n </span></blockquote>Wow!  Sounds ideal!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I guess I also really need a break.<br/>\n<br/>\n </span></blockquote>Yeah, it sounds like this is really what you need!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Being <br/>\n&gt;&gt;out here on the coast, away from friends and my<br/>\n&gt;&gt;husband, who works during <br/>\n&gt;&gt;the week in Portland 3 hours away<br/>\n<br/>\n </span></blockquote>Are you on the Oregon Coast?  Sounds like Reedsport. <br/>\nI&#39;m in Eugene and would be happy to be a Eugene<br/>\nconnection for you.  Feel free to contact me off list.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t really have a great friend in my <br/>\n&gt;&gt;husband and I feel lonely alot of the time, even<br/>\n&gt;&gt;when he is here.<br/>\n<br/>\n </span></blockquote>*Bummer*  Maybe you can do some couple counseling. <br/>\nThat&#39;s a hard 3 hour commute.  Doesn&#39;t seem to healthy<br/>\nfor the family.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We&#39;re <br/>\n&gt;&gt;very broke even though he works all the time and we<br/>\n&gt;&gt;are living here <br/>\n&gt;&gt;cheaply because of a friend.  <br/>\n<br/>\n </span></blockquote>I know how it feels to have a partner who works &#39;all<br/>\nthe time&#39; and still be broke.  At least you have cheap<br/>\nrent!  Try to look into resources in your area where<br/>\nyou can get free stuff like free food/food assistance,<br/>\nkid stuff etc.  Maybe there is a freecycle organized<br/>\nin your town.  WWW.freecycle.com<br/>\nAlso, in helping to have a more positive attitude, try<br/>\nlooking at the bright side of living on the coast- the<br/>\nocean and beach!  Take advantage of it.  Just go;<br/>\ndon&#39;t ask the kids.  Say, we&#39;re going to the ocean<br/>\ntoday and pack the kids up!  I was bummed out for<br/>\nawhile because we live in a townhouse that has no<br/>\nfenced in back yard and just a little patch of grass<br/>\nand the other residences are pretty anal about leaving<br/>\nout toys etc.  The lawn people spray too so we never<br/>\nplanted anything edible.  Anyhow, I was really bummed<br/>\nabout living here because we really had no back yard,<br/>\nBUT we do have a pool- so I try to look at living here<br/>\nas a positive experience of having free access to a<br/>\npool.  My kids are teaching themselves to swim as a<br/>\nresult!  So much is mental attitude.<br/>\n<br/>\nHope your days are getting better,<br/>\nJennefer<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - Send 10MB messages!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/new_mail\">http://promotions.yahoo.com/new_mail</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Trying to breathe and start over...","postDate":"1093126506","msgId":98667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhiLjEyZGQ0YzFmLjJlNTkyMzZhQGFvbC5jb20+"},"prevInTopic":98646,"nextInTopic":98675,"prevInTime":98666,"nextInTime":98668,"topicId":98646,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/21/2004 2:12:08 PM Mountain Daylight Time, aburlingame@centurytel.net writes: I just want peace and mutual regard and respect in this","messageBody":"<div id=\"ygrps-yiv-2142478699\">In a message dated 8/21/2004 2:12:08 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> writes:<br/>\nI just want peace and mutual regard and respect in this house.  <br/>\n---------------<br/>\n<br/>\nChildren can&#39;t go 50-50 on mutuality with adults.  Most of the peace and <br/>\nregard and respect have to come from the parent.<br/>\n<br/>\nTraditionally, parents demand 100% respect.  They can&#39;t get it.  That <br/>\ntraditional way has many inherent problems.<br/>\n<br/>\n&#39;Mutual&quot; will come if parents give more than hal for a lon gtime.<br/>\n<br/>\nBummer. It&#39;s way up the line.  But I&#39;ve seen many families in which it has <br/>\nhad great results.<br/>\n<br/>\n-=-  I don&#39;t really have a great friend in my husband and I feel lonely alot <br/>\nof the time, even when he is here.-=-<br/>\n<br/>\nWill he at least make a deal to give you time to take just one kid and not <br/>\nall some afternoons or evenings?    If you can get one child away alone, it&#39;s a <br/>\nbreak for you and a joy for that child.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Trying to breathe and start over...","postDate":"1093126269","msgId":98675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwNDYwMWM0ODdiYSRjY2RhYmE5MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98667,"nextInTopic":98737,"prevInTime":98674,"nextInTime":98676,"topicId":98646,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-705413660\">&lt;&lt;&lt;I do think my 3 yo, who I&#39;ve written about before as being very<br/>\nchallenging to everyone in my family in the past, is going through a rough<br/>\ntime again lately.  I don&#39;t know the reason, but she seems to be regressing<br/>\na bit. [snip]<br/>\nI don&#39;t really have a great friend in my husband and I feel lonely alot of<br/>\nthe time, even when he is here.&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhen my dh and I are cranky with each other, or arguing, or just not in<br/>\nharmony, the most obvious result is that Jayn becomes more whiney and<br/>\ndemanding of me and pushy towards him. Sometimes she tries to distract us<br/>\nfrom each other with demanding behaviors. <br/>\n<br/>\nI&#39;m sorry that you are lonely even when he is there. That would be the<br/>\nhardest thing for me to deal with. <br/>\n<br/>\nOn the few occasions that dh has been away for a week or more and then come<br/>\nback, it has taken both Jayn and I some time to readjust and she has been<br/>\nkinda mean seeming - a reaction to the unpleasantness of missing him. It<br/>\nseems like this kind of continual flux in your dh&#39;s coming and going may be<br/>\ncontributing to the lack of balance and serenity in your household. Jayn is<br/>\nonly now starting to understand concepts of longer time - like &quot;a week&quot;. I<br/>\nusually count days. Grasping how long a month is, is still beyond her. Your<br/>\n3yo may be having trouble grasping when Daddy is returning - it might just<br/>\nseem like &quot;a loooong unpredictable time&quot; to her. Maybe she even sees him as<br/>\nan intruder dividing your attention even more.<br/>\n<br/>\n &lt;&lt;&lt; don&#39;t like that she uses such an ugly tone so much of the time.  I&#39;ve<br/>\nexplained to her that people would be much happier about helping her when<br/>\nshe needs it if she would only ask in a pleasant tone of voice rather than<br/>\nwhining or screaming out orders to us all.  This often just makes her yell<br/>\nlouder for whatever it is she wants.  If she already has what she wants, she<br/>\njust ignores me.&gt;&gt;&gt;<br/>\n<br/>\nJayn ignores *lectures* from me any time I try to deliver them. My answer is<br/>\nto keep it very brief if she is doing something negative that I feel needs a<br/>\ncomment from me. Thinking back I don&#39;t think she really had a grasp on what<br/>\nwas &quot;whining&quot; or &quot;demanding tone&quot; when she was three. I mean she used those<br/>\nunpleasant ways of speaking, but did not *hear herself* that way. <br/>\n<br/>\nIf taking time to express your comments to her are preventing the<br/>\nfulfillment of her request, then it is no wonder she is not listening to or<br/>\nunderstanding the content of your words. <br/>\n<br/>\nDon&#39;t make your dd have to guess what a pleasant tone of voice really is.<br/>\nWith Jayn I try hard to keep modeling what a &quot;pleasant tone&quot; is, both with<br/>\nher and to dh. My occasional phrase, &quot;I like it better when you speak kindly<br/>\nto me&quot; has a lot more meaning for her now, compared to a year ago. I also<br/>\nsay &quot;Thank you for asking so pleasantly&quot; as appropriate.<br/>\n<br/>\n&lt;&lt;&lt;I guess I also really need a break.&gt;&gt;&gt;<br/>\n<br/>\n&lt;&lt;&lt; On the extremely rare (a couple of times since I moved here in March)<br/>\noccasion that I can get away for an hour or two, I spend much of my time<br/>\nworrying about and justifying my need to get away and I find that I don&#39;t<br/>\nknow what to do with myself.&gt;&gt;&gt;&gt;<br/>\n<br/>\nI found myself doing that at one point with dh, when asking for a break, by<br/>\ndetailing the &quot;important&quot; things I would need to accomplish, to justify<br/>\nwanting some time to myself. I realized that time to myself to do nothing<br/>\nimportant was just as justified, and I did not need to create a reason for<br/>\ndh&#39;s sake. Dh was more than sympathetic. He had been taking his cue from me,<br/>\nby asking what I was going to &quot;get done&quot; with my time, even though I thought<br/>\nit was him being demanding.<br/>\n<br/>\nRobyn L. Coburn  <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.740 / Virus Database: 494 - Release Date: 8/16/2004</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Trying to breathe and start over...","postDate":"1093118982","msgId":98646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDYwMWM0ODdiYSRjY2RhYmE5MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":0,"nextInTopic":98667,"prevInTime":98645,"nextInTime":98647,"topicId":98646,"numMessagesInTopic":0,"msgSnippet":"I wanted to post again, because the last post about things being so hard seems so negative.  We do have fun here and I enjoy my children a lot of the time,too.","messageBody":"<div id=\"ygrps-yiv-1294038071\">I wanted to post again, because the last post about things being so hard seems so negative.  We do have fun here and I enjoy my children a lot of the time,too.   I think we go through bad spells and are having one right now.  It doesn&#39;t help that I&#39;m reacting to monthly hormones.  <br/>\n<br/>\nI do think my 3 yo, who I&#39;ve written about before as being very challenging to everyone in my family in the past, is going through a rough time again lately.  I don&#39;t know the reason, but she seems to be regressing a bit.  It may be because she knows I&#39;m frustrated by her potty learning.  She was finally using the toilet fairly consistantly for a couple of weeks, and that was so nice.  Then, she just started peeing everywhere again, and is still doing that much of the time 2 weeks or so later.  Yet she doesn&#39;t want to wear diapers.  She still doesn&#39;t speak clearly enough for me to always understand her, and that frustrates her too.  I don&#39;t like that she uses such an ugly tone so much of the time.  I&#39;ve explained to her that people would be much happier about helping her when she needs it if she would only ask in a pleasant tone of voice rather than whining or screaming out orders to us all.  This often just makes her yell louder for whatever it is she wants.  If she already has what she wants, she just ignores me.<br/>\n<br/>\nAnyway, I don&#39;t want to go on and on about her or the other kids.  I don&#39;t know what I want, actually.  I just want peace and mutual regard and respect in this house.  I guess I also really need a break.  Being out here on the coast, away from friends and my husband, who works during the week in Portland 3 hours away, I seldom get away by myself.  On the extremely rare (a couple of times since I moved here in March) occasion that I can get away for an hour or two, I spend much of my time worrying about and justifying my need to get away and I find that I don&#39;t know what to do with myself.  I don&#39;t really have a great friend in my husband and I feel lonely alot of the time, even when he is here.  We&#39;re very broke even though he works all the time and we are living here cheaply because of a friend.  Ugh. Here I go again... <br/>\n<br/>\nI guess I&#39;m just discontent.  I don&#39;t know why I&#39;m even writing this here.  Sorry.  Maybe someone will say something that will snap me out of it.<br/>\n<br/>\n~Andrea<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":98732,"nextTopicId":98711}}