{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: babsteps in communication with husband","postDate":"1244895982","msgId":45843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgxMDV0ZStzZGt0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgwc2c3cCsxM2d1QGVHcm91cHMuY29tPg=="},"prevInTopic":45832,"nextInTopic":0,"prevInTime":45842,"nextInTime":45844,"topicId":45829,"numMessagesInTopic":0,"msgSnippet":"... My son wasn t intentionally unschooled. I agreed to his request to quit school because the pace of the teaching was so slow compared to what I knew was","messageBody":"<div id=\"ygrps-yiv-181216137\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;kelly_sturman&quot; &lt;conspicuousfamily@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Also, would he be willing to agree to a<br/>\n&gt; short trial of unschooling?  That is how<br/>\n&gt; our family began homeschooling.  My DH<br/>\n&gt; was reluctant, but was willing to give<br/>\n&gt; a try, &quot;for a semester.&quot;  That semester<br/>\n&gt; was so good that he was willing to let<br/>\n&gt; us try the &quot;experiment&quot; for another <br/>\n&gt; semester, and another...<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>My son wasn&#39;t intentionally unschooled. I agreed to his request to<br/>\nquit school because the pace of the teaching was so slow compared to<br/>\nwhat I knew was possible it was like watching grass grow. My<br/>\nintention was to get him through the school curriculum more<br/>\nefficiently. But he didn&#39;t want lessons of any kind, so, figuring he<br/>\nwas only seven and could always catch up later if he fell behind in<br/>\nany subject, my wife and I gave him a year off to do his own thing.<br/>\nThat was more than six years ago. He never returned to a structured<br/>\neducation. He&#39;s been too busy learning immersively at the speed of<br/>\nthought.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":381959449,"authorName":"kelly_sturman","from":"&quot;kelly_sturman&quot; &lt;conspicuousfamily@...&gt;","profile":"kelly_sturman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: babsteps in communication with husband","postDate":"1244775481","msgId":45832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwc2c3cCsxM2d1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgwcmdtYit2bXUzQGVHcm91cHMuY29tPg=="},"prevInTopic":45830,"nextInTopic":45843,"prevInTime":45831,"nextInTime":45833,"topicId":45829,"numMessagesInTopic":0,"msgSnippet":"I may have missed this, but is he willing to read?  Alfie Kohn summarizes tons of educational research that talks about how many of the aspects of school ","messageBody":"<div id=\"ygrps-yiv-1616578405\">I may have missed this, but is he<br/>\nwilling to read?  Alfie Kohn summarizes<br/>\ntons of educational research that talks<br/>\nabout how many of the aspects of school<br/>\ninhibit/discourage learning.<br/>\nThe book, _The Game of School:  Why We<br/>\nAll Play It, How It Hurts Kids, and <br/>\nWhat It Will Take to Change It_ might<br/>\nbe convincing.  The author, Robert Fried,<br/>\nis a school psychologist, so he is a<br/>\nproponent of schools.  Yet, both professionally<br/>\nand personally (one of his own children<br/>\nstruggled mightily in school), he has seen<br/>\nthe system shred kids, and he writes about<br/>\nthat.  The stories he tells are so heart-<br/>\nwrenching that it is hard to remember that<br/>\nthe guy is a part of the system he is <br/>\ncriticizing.<br/>\n<br/>\nAlso, would he be willing to agree to a<br/>\nshort trial of unschooling?  That is how<br/>\nour family began homeschooling.  My DH<br/>\nwas reluctant, but was willing to give<br/>\na try, &quot;for a semester.&quot;  That semester<br/>\nwas so good that he was willing to let<br/>\nus try the &quot;experiment&quot; for another <br/>\nsemester, and another...<br/>\n<br/>\nMaybe it&#39;s too huge a leap for somebody<br/>\nwho&#39;s having a hard time even talking<br/>\nabout it, but sometimes it&#39;s easier<br/>\nto do than to talk.  One semester would<br/>\ngive you something to talk about, other<br/>\nthan your fears.  It would give you a <br/>\nreal experience to discuss.  And even<br/>\nif he is afraid, what is going to be lost<br/>\nin one semester?  <br/>\n<br/>\nKelly Sturman<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;DaBreeze21&quot; &lt;susanmay15@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; I think that is good<br/>\n&gt; it is noble, scholarly and not harmful </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] babsteps in communication with husband","postDate":"1244745572","msgId":45830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5NTk2NjgwLUEyNDAtNEM4Qy05MzI3LTdFQUNENzFFRjlFM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGgwcmdtYit2bXUzQGVHcm91cHMuY29tPg==","referencesHeader":"PGgwcmdtYit2bXUzQGVHcm91cHMuY29tPg=="},"prevInTopic":45829,"nextInTopic":45832,"prevInTime":45829,"nextInTime":45831,"topicId":45829,"numMessagesInTopic":0,"msgSnippet":"-=-Ok, this is getting long. I really wanted input -- where do people think I should go from here? I think this was a HUGE step for us and I want to really","messageBody":"<div id=\"ygrps-yiv-2008820403\">-=-Ok, this is getting long. I really wanted input -- where do people  <br/>\nthink<br/>\nI should go from here? I think this was a HUGE step for us and I want to<br/>\nreally think through things I say/do from here.-=-<br/>\n<br/>\nMaybe a copy of &quot;Dumbing us Down?&quot;<br/>\nMaybe now that you have his concerns in writing you could be on the  <br/>\nlookout for studies that show American high school grads can&#39;t find  <br/>\nother countries on a map and things like that.<br/>\n<br/>\nMaybe casually, conversationally (if that can happen, and if you can  <br/>\nbe willing to bail if he catches on) you could talk about what you do  <br/>\nor don&#39;t remember from high school chemistry or physics or biology  <br/>\nclasses.   Maybe he would volunteer what he does or doesn&#39;t  <br/>\nremember.   It might get him to thinking about what he does remember.<br/>\n<br/>\nAnd the &quot;everything&quot; they teach in school is a teeny subset of  <br/>\n&quot;everything.&quot;  There are many topics school never touches and never  <br/>\nwill, and those they do &quot;touch&quot; get the lightest of one- or two-week  <br/>\nunit and then it&#39;s on to something else.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"babsteps in communication with husband","postDate":"1244743179","msgId":45829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwcmdtYit2bXUzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45830,"prevInTime":45828,"nextInTime":45830,"topicId":45829,"numMessagesInTopic":0,"msgSnippet":"Hi- I started reading about unschooling almost a year and a half ago. I got SUPER excited and in that excitement told my husband about it. He was not so","messageBody":"<div id=\"ygrps-yiv-1516444631\">Hi-<br/>\n<br/>\nI started reading about unschooling almost a year and a half ago. I got<br/>\nSUPER excited and in that excitement told my husband about it. He was<br/>\nnot so excited. Since that time I have embraced a lot of really good<br/>\nadvice - I do not bring it up with him really, but have continued to<br/>\nread about it daily. Our few conversations have not gone well. Around<br/>\nValentine&#39;s day this past year I wrote him a letter (I had been reading<br/>\nabout unschooling for about a year at this point). I let him know that<br/>\nif we explore our options together I am of course willing to have our<br/>\nchildren go to school if that is what is best for the happiness of our<br/>\nfamily. (Thank you Sandra! I do mean that too... What I am working for<br/>\nnow is at least having DISCUSSION and actually exploring together).<br/>\n<br/>\nHe read it and we haven&#39;t discussed since. This past weekend I got<br/>\nreally upset when he made a comment to me about not liking my ideas,<br/>\nunschooling etc. This was during a &quot;discussion&quot; about something entirely<br/>\nunrelated -- where to put the couch in our new apartment! So clearly it<br/>\nhas been building up in him. I was very hurt but we didn&#39;t discuss it<br/>\nanymore.<br/>\n<br/>\nSo today I sent him an email:<br/>\n<br/>\nI never addressed my &quot;joyful&quot; mood on Sunday. I thought it was pretty<br/>\nobvious what made me really upset, and I have a feeling you had an<br/>\ninkling. I don&#39;t want to let it slide though because my strong feelings<br/>\ntend to fade and it is possible to just let things go until the &quot;next<br/>\ntime&quot; and it becomes a cycle without dealing with anything.<br/>\n<br/>\nIt was not the &quot;discussion&quot; about where to put the couch that hurt me so<br/>\nmuch. Although I think it is actually a good analogy to what IS<br/>\nbothering me. I purposely do NOT bring up unschooling because I am<br/>\ntrying to respect that you are not ready to talk about it. But I would<br/>\nthink that by now you would see that it is something that means a LOT to<br/>\nme and something that I am learning a lot about; I read about it almost<br/>\nevery day. So when you make an offhand comment about it in a very<br/>\ndismissive way that really hurts. I am a very thoughtful, intelligent<br/>\nperson - and we both know it. I think that you are too. I wouldn&#39;t be so<br/>\nenthusiastic about something that couldn&#39;t be really good for all of us.<br/>\nI feel like you shut down about things that you just want to go away or<br/>\njust want your way. And yes I realize that I want &quot;my&quot; way. Or at least<br/>\na lot of discussion about what that means! That is the most hurtful part<br/>\nfor me at this point, that you won&#39;t even talk or read or anything. I<br/>\nguess you may be scared that if you even look like you are considering<br/>\nit then I will be encouraged?? I KNOW doing things differently isn&#39;t<br/>\neasy, and I TRULY appreciate how supportive you have been about all of<br/>\nour parenting decisions so far. I think (and I think you do too) that<br/>\nMarisol is amazing. I hope that we all continue to grow together and<br/>\ntrust each other even more.<br/>\n<br/>\nI LIKE thinking of different ways to do things - which is why I thought<br/>\nthe couch thing was a good analogy. I really am fine leaving it how you<br/>\nlike it -- part of the fun for me when settling a new place is trying<br/>\ndifferent things out first.<br/>\n<br/>\nA lot of this is a repeat of what I wrote to you in that letter on<br/>\nV-day, but you have not responded and I felt like I should say something<br/>\nabout why I was SO upset last weekend. I think that I will also start<br/>\nemailing you little things to read and I hope that you will. A lot of it<br/>\nis not even &quot;unschooling&quot; per se, but about learning, or how to treat<br/>\nothers, or how to live your life in general!<br/>\n<br/>\nHere is something that I read today that I thought really made sense:<br/>\n<br/>\nThink about that. The kids who do best in school, who have the types of<br/>\nintelligences that schools are geared toward, are going to excel in<br/>\nthose areas without ever setting foot in a classroom. So all they really<br/>\nget from school is gold stars and A grades for doing what comes<br/>\nnaturally.<br/>\n<br/>\nAnd what about the kids who struggle in school? They spend all those<br/>\nyears feeling inadequate. Yes, some of them learn to write well, or to<br/>\nenjoy reading, or to do some higher math. But can the schools take the<br/>\ncredit for it? After four years of unschooling, I&#39;m not convinced they<br/>\ncan. Maybe it&#39;s another case of a natural process coinciding with an<br/>\nartificial one. And for every one of those kids who is able to adapt<br/>\nhimself and get the rewards of school, there is one (five? twenty? a<br/>\nhundred?) who comes out of school with nothing but a self-esteem<br/>\nproblem. It&#39;s thirteen wasted years, years he could have spent in an<br/>\nenvironment that valued the strengths he possesses, developing real<br/>\nskills to build a life on.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://zombieprincess.blogspot.com/2007/03/about-learning-styles.html\">http://zombieprincess.blogspot.com/2007/03/about-learning-styles.html</a><br/>\n<br/>\nI love you so much and hope that soon we will be able to talk about this<br/>\nmore.<br/>\n<br/>\nSusan<br/>\n<br/>\nThen we talked on google talk (we have ALWAYS been better about writing<br/>\n- messaging on the computer especially, than about talking things out in<br/>\nperson. It is something I would like to work on, but I am happy that at<br/>\nleast we communicate in SOME way)<br/>\nHere  is the conversation:<br/>\nHusband: what cha doing?<br/>\n<br/>\nSusan: writing you an email<br/>\n<br/>\nHusband: what?<br/>\n<br/>\nSusan: if you have no work to do I gave you something to chew on :-)<br/>\nI felt that I should clear up my bad mood last weekend since we never<br/>\ndid talk about it...<br/>\n<br/>\nHusband: k<br/>\n<br/>\nSusan: I wanted to talk to you about it the next day, but I always<br/>\nchicken out or it seems like the &quot;wrong&quot; time<br/>\nIt&#39;s not long by my normal standards either... pretty brief really (the<br/>\nemail) I just sent it to you<br/>\n(He read the email at this point and then we messaged more)<br/>\nHusband: ok<br/>\nI will talk about this whenever<br/>\nbut I thought you would bring it up<br/>\nFrom what I know about unschooling I don&#39;t really like it<br/>\nI think the good thing about traditional school is that you learn about<br/>\neverything<br/>\n<br/>\nSusan: I don&#39;t feel like it goes well when I bring it up - you have told<br/>\nme before to just stop, that you dont&#39; want to talk about it and pretty<br/>\nmuch just stop me<br/>\n<br/>\nHusband: even if you don&#39;t like something<br/>\nso I am definately in favor of something more traditional<br/>\n<br/>\nSusan: ok<br/>\n<br/>\nHusband: not just letting the kid do what they want to do<br/>\nif you want to home school I am okay with that<br/>\nbut I would like it to be structured<br/>\n<br/>\nSusan: I&#39;m just curious... tell me the benefit of learning about things<br/>\nthat you have no interest in? and how long do you think that it stays<br/>\nwith you?<br/>\n<br/>\nHusband: some type of formal system...as formal as it can be at home<br/>\nbecause maybe you don&#39;t know that it interests you<br/>\nuntil you learn more about it<br/>\n<br/>\nSusan: ok<br/>\nI see what you are saying<br/>\n<br/>\nHusband: kids should be exposed to every possible avenue<br/>\nI didn&#39;t like chemistry or biology but at least I have some basic<br/>\nunderstanding of it<br/>\nI think that is good<br/>\nit is noble, scholarly and not harmful<br/>\npeople change so much over time<br/>\nnot exposing them to different topics could be harmful in my opinion<br/>\n<br/>\nSusan: well I am glad that you are willing to talk more about this, and<br/>\nI hope that we can keep the conversations more positive... what I really<br/>\nwant is to talk to you about things like this and not have either of us<br/>\nget overly defensive<br/>\n<br/>\nHusband: ok that is fine<br/>\nSusan: thanks :-)<br/>\nI know you only want what is best for her (and other children) and I<br/>\nhope you know that that is what I want too... we just have different<br/>\nideas right now about what that is<br/>\n<br/>\nmichaelmay21: yes I understand<br/>\nI actually started crying while we were messaging each other. I think it<br/>\nwas such a relief to actually be discussing unschooling (or our<br/>\neducational options) with him! (I am also very hormonal right now - 7<br/>\nmos pregnant!) I was holding back a lot. I kind of let him get things<br/>\nout - had a lot swirling in my mind as &quot;responses&quot; to his concerns - I<br/>\neven started typing a few things and then deleted. I really didn&#39;t want<br/>\nto &quot;screw up&quot; our first civil conversation. I already have some ideas of<br/>\nthings I may be able to say to try and alleviate some of his concerns.<br/>\nBut I also know that it will probably come across as me trying to<br/>\nconvince him of &quot;my way&quot;. Some examples that of things I might say:<br/>\n<br/>\nTo this<br/>\nSusan: I&#39;m just curious... tell me the benefit of learning about things<br/>\nthat you have no interest in? and how long do you think that it stays<br/>\nwith you?<br/>\n<br/>\nHusband:<br/>\nbecause maybe you don&#39;t know that it interests you<br/>\nuntil you learn more about it<br/>\nI might say-<br/>\nI think that strewing and the rich lives that successful unschoolers<br/>\nlead pretty much negate this worry. Also I have read so much about how<br/>\none thing leads to another from so many people...<br/>\n<br/>\nas for this:<br/>\nHusband: kids should be exposed to every possible avenue<br/>\nI didn&#39;t like chemistry or biology but at least I have some basic<br/>\nunderstanding of it<br/>\nI think that is good<br/>\nit is noble, scholarly and not harmful<br/>\npeople change so much over time<br/>\nnot exposing them to different topics could be harmful in my opinion<br/>\nI think I remember recently Pam or someone saying something about how<br/>\neven school can&#39;t open every door - no path can do that! I don&#39;t know<br/>\nwhat to say to the &quot;noble, scholarly, and not harmful&quot;.<br/>\nOh, I guess the last line is pretty simple - Unschooler do expose their<br/>\nkids to lots of different things!<br/>\n<br/>\nI think I am suddenly seeing one of his misconceptions - that<br/>\n&quot;unstructured = kids do whatever they want&quot; and that parents are not <br/>\ninfluencing what they are doing in their lives at all.<br/>\n<br/>\nI also pretty  much know that I don&#39;t want to homeschool the way he was<br/>\nsaying... I agree with the idea that &quot;school at home&quot; is probably more<br/>\nharmful to our relationships than plain old school. Plus I was a teacher<br/>\nand that is not what I would want to do! I just let it go for now...<br/>\n<br/>\nOk, this is getting long. I really wanted input -- where do people think<br/>\nI should go from here? I think this was a HUGE step for us and I want to<br/>\nreally think through things I say/do from here.<br/>\n<br/>\nThanks so much!<br/>\nSusan<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":45754,"nextTopicId":45760}}