{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How do I teach my 8yo dd to help around the house?","postDate":"1178916659","msgId":28745,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYyMmt2ais5aWZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFORUNKUEJBTUNER0VLQ0ZGR0JPS0VOQU9QQUEuSmxhenp0b29AY29tY2FzdC5uZXQ+"},"prevInTopic":28734,"nextInTopic":0,"prevInTime":28744,"nextInTime":28746,"topicId":28718,"numMessagesInTopic":0,"msgSnippet":"Elysia just does not want to help around the ... her that ... to mention ... up after ... Simply don t make her.  When I feel that the house is messy, it is my","messageBody":"<div id=\"ygrps-yiv-969574252\">Elysia just does not want to help around the<br/>\n<blockquote><span title=\"ireply\"> &gt; house.  I am trying to figure out how to respect her while teaching <br/>\n </span></blockquote>her that<br/>\n<blockquote><span title=\"ireply\"> &gt; we all need to work together to help the house run smoothly.  Not <br/>\n </span></blockquote>to mention<br/>\n<blockquote><span title=\"ireply\"> &gt; that she is the messiest one of us and she needs to learn to clean <br/>\n </span></blockquote>up after<br/>\n<blockquote><span title=\"ireply\"> &gt; herself.  The kids do not have assigned chores, nor do they get an<br/>\n&gt; allowance.<br/>\n<br/>\n </span></blockquote>Simply don&#39;t make her.  When I feel that the house is messy, it is my <br/>\ninterpretation of what messy looks and feels like, not my kids&#39; ideas <br/>\nof messy looks and feels like.  I clean to my comfort level, and as a <br/>\nside effect, my kids get to live in a comfortable and clean <br/>\nenvironment.  <br/>\n<br/>\nJust to give you an idea:  When my oldest dd, now 13, was 3, 4, and <br/>\n5, and on up to about 7, when her younger sister was born, she <br/>\ncleaned up her toys every night.  We did it together and it was fun, <br/>\nshe never complained about it or expressed any negativity towards.  <br/>\nAt the age of 13, she absolutely doesn&#39;t clean up after herself.  So <br/>\nyears of doing it didn&#39;t teach her about the value of a clean room or <br/>\nabout picking up your own messes.<br/>\n<br/>\nI clean her room for her about once a week.  She loves it when I do <br/>\nand loves having her room clean, but she doesn&#39;t do it herself except <br/>\nmaybe every once in a while.  It&#39;s something that she values, but she <br/>\nobviously values other things more than having a clean room.  I even <br/>\ntake her plates, cups, and bowls into the kitchen, empty her garbage <br/>\nfor her, pick up trash, wash her clothes, make her bed, and tidy up <br/>\nher dresser, vaccuum, and all of that.  I fold and put away her <br/>\nclothes for her because I know if I don&#39;t they will all end up on the <br/>\nfloor and under bed.  <br/>\n<br/>\nI get criticism for doing this from some of my friends who think she <br/>\nis old enough to do it herself.  If she really was old enough to do <br/>\nit herself, she would do it herself.  If she didn&#39;t want me to do <br/>\nthat stuff for her, she would say so.  Plus, it&#39;s a little like <br/>\npeeking into her world when I&#39;m in her room cleaning it up.  I find <br/>\ninteresting bits of information about my child who doesn&#39;t talk a lot <br/>\nabout things that she doesn&#39;t find interesting, but I do. <br/>\n<br/>\nGive the gift of a clean house to your kids, and then one day, they <br/>\nmay just do that for their own kids.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] How do I teach my 8yo dd to help around the house?","postDate":"1178903673","msgId":28734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCMzE0NDJDLTUyMDYtNDU3Ri1BOTNFLUJEOUNBRUJBOTlBNUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFORUNKUEJBTUNER0VLQ0ZGR0JPS0VOQU9QQUEuSmxhenp0b29AY29tY2FzdC5uZXQ+","referencesHeader":"PEFORUNKUEJBTUNER0VLQ0ZGR0JPS0VOQU9QQUEuSmxhenp0b29AY29tY2FzdC5uZXQ+"},"prevInTopic":28733,"nextInTopic":28745,"prevInTime":28733,"nextInTime":28735,"topicId":28718,"numMessagesInTopic":0,"msgSnippet":"-=-How do I teach -=- My answer to any how do I teach question is don t. For unschooling to work as well as it can, you should try to undo all thought of","messageBody":"<div id=\"ygrps-yiv-1328265523\">-=-How do I teach -=-<br/>\n<br/>\nMy answer to any &quot;how do I teach&quot; question is &quot;don&#39;t.&quot;<br/>\n<br/>\nFor unschooling to work as well as it can, you should try to undo all  <br/>\nthought of &quot;teaching.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wordswords\">http://sandradodd.com/wordswords</a><br/>\nThere are some explanations (reasons and ideas) for replacing &quot;teach&quot;  <br/>\nthoughts and words with &quot;learning&quot; thoughts and words.<br/>\n<br/>\nI&#39;ll recast your question this way:<br/>\n<br/>\nHow might your daughter best learn to help around the house?<br/>\n<br/>\n-=-Elysia just does not want to help around the<br/>\nhouse. I am trying to figure out how to respect her while teaching  <br/>\nher that<br/>\nwe all need to work together to help the house run smoothly. -=-<br/>\n<br/>\nThe more you try to make her do what she doesn&#39;t want to do, the more  <br/>\nyou will teach her to avoid that thing in the future.  Stop teaching  <br/>\npeople what is undesireable by making rules about what must and can&#39;t  <br/>\nand has to and such.   People will respond to rules in ways you  <br/>\ndidn&#39;t foresee and can&#39;t undo.<br/>\n<br/>\n-=-Not to mention that she is the messiest one of us and she needs to  <br/>\nlearn to clean up after<br/>\nherself.-=-<br/>\n<br/>\nWhat if she had a disability that prevented her from picking anything  <br/>\nup?  Would you pick up after her then?<br/>\n<br/>\nDeclarations of what our children &quot;need&quot; should always be looked at  <br/>\ntwice.<br/>\n<br/>\nIf you want to read what others have written in the past, you could  <br/>\ngo to the &quot;visit your group&quot; link at the bottom of this e-mail (or  <br/>\nthe &quot;messages&quot; link to the left if you&#39;re reading online) and when  <br/>\nyou get the search box, put in chores.   Some of the best stuff is  <br/>\nalso here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":156499635,"authorName":"Jackie Lazzaro","from":"&quot;Jackie Lazzaro&quot; &lt;jlazztoo@...&gt;","profile":"lazzarji","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How do I teach my 8yo dd to help around the house?","postDate":"1178894857","msgId":28733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFORUNKUEJBTUNER0VLQ0ZGR0JPS0VOQU9QQUEuSmxhenp0b29AY29tY2FzdC5uZXQ+","inReplyToHeader":"PDQ3NjI3My4yMTUxNS5xbUB3ZWI1ODEwNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":28718,"nextInTopic":28734,"prevInTime":28732,"nextInTime":28734,"topicId":28718,"numMessagesInTopic":0,"msgSnippet":"I have 2 dd s ages 8 and 10.   We have been easing into hs g and unschooling since the beginning of the year.  My dh and I agreed to take our older dd out of","messageBody":"<div id=\"ygrps-yiv-719383182\">I have 2 dd&#39;s ages 8 and 10.   We have been easing into hs&#39;g and unschooling<br/>\nsince the beginning of the year.  My dh and I agreed to take our older dd<br/>\nout of public school this past December.  We found that unschooling made the<br/>\nmost sense for us.  We are now moving toward bringing my 8yo home too.  She<br/>\nwill finish 3rd grade in ps but will not go back in Sept.<br/>\n<br/>\nI have been learning so much from the folks here and on several other lists<br/>\nI joined.  I&#39;m hoping that maybe you can help me figure out how to approach<br/>\nthis situation w/my 8yo.  Elysia just does not want to help around the<br/>\nhouse.  I am trying to figure out how to respect her while teaching her that<br/>\nwe all need to work together to help the house run smoothly.  Not to mention<br/>\nthat she is the messiest one of us and she needs to learn to clean up after<br/>\nherself.  The kids do not have assigned chores, nor do they get an<br/>\nallowance.<br/>\n<br/>\nAny suggestions would be appreciated.  Thx!<br/>\n<br/>\n:-)<br/>\n<br/>\nJackie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":286686117,"authorName":"Melody Flurry","from":"Melody Flurry &lt;imagine1harmony@...&gt;","profile":"imagine1harmony","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"an attempt at connections","postDate":"1178819377","msgId":28718,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3NjI3My4yMTUxNS5xbUB3ZWI1ODEwNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":28733,"prevInTime":28717,"nextInTime":28719,"topicId":28718,"numMessagesInTopic":0,"msgSnippet":"Just thought I would share my recent experience of trying to make connections.  The interesting thing is that before I encountered Sandra s unschooling","messageBody":"<div id=\"ygrps-yiv-571356913\">Just thought I would share my recent experience of trying to make connections.  The interesting thing is that before I encountered Sandra&#39;s unschooling website, it probably wouldn&#39;t have occured to me to share this story with my son.  I&#39;m so thankful to have found a resource that has opened my eyes to the possibilities of how everything is interwoven.  Learning is so much more fun when it isn&#39;t segregated into compartments and presented as a dry set of facts to be memorized instead of stories that are related and have real personal meaning in our lives.  But you know that already!<br/>\n   <br/>\n  This experience begins with me reading a story to my son called &quot;Lei Zu and the Silkworm&quot;, which is a legend about the Chinese Emporer Huang Di&#39;s wife Lei Zu discovering the silk threads from a silkworm cocoon and having them made into a garment for the emporer.  When I finished the story I asked my son if he wanted to know what silkworms had to do with Florence, Alabama.  (Although we no longer live there, my son was born in Florence and his grandparents still live in the area.)  He looked surprised and interested and said yes, he wanted to know.<br/>\n   <br/>\n  I related to him the story of how a man named Nicholas Hentz, who was originally from France, came to the Florence, AL area to start a girl&#39;s school called Locust Dell Academy in the early 1830&#39;s.  Nicholas Hentz had met and married his wife in Mass. and they had moved to Cinncinnati, OH (where we also used to live) and had then moved to Kentucky and started a girl&#39;s school there before coming to Alabama.  The site where Hentz and his wife built this school for girls is now an administration building at the small liberal arts University where my husband and I graduated.  (My son had visited this University and knew the building).  <br/>\n   <br/>\n  While running this school, Nicholas Hentz, who was an entymologist and more specifically an arachnologist, discovered 124 new species of spiders, and his drawings of these were widely published in academic journals.  (He had learned how to draw and paint miniatures in France).  Another of Hentz&#39;s interesting endeavors was that he tried his hand at cultivating Mulberry trees for the purpose of raising and selling--you guessed it--silkworms.  This enterprise ultimately failed because the trees would not grow well in that area and he couldn&#39;t make the money he hoped he would.<br/>\n   <br/>\n  Later on that evening, we were discussing the civil war (although I don&#39;t remember how this discussion started) and I went on to tell my son that the wife of Nicholas Hentz, Caroline Lee Hentz, was a famous author and that she wrote a novel called &quot;The Planter&#39;s Nothern Bride&quot;, which was a response to a novel called &quot;Uncle Tom&#39;s Cabin&quot; by Harriet Beecher Stowe.  Caroline Hentz provided a different perspective on slavery than Stowe.  This led to a further discussion  of the civil war and of wars in general, and how there are many issues involved in the causes of wars, not all of which are morally motivated.<br/>\n   <br/>\n  So the point of all this is that everything IS related--and if I can make connections, then anyone can!<br/>\n   <br/>\n  Melody<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nIt&#39;s here! Your new message!<br/>\nGet new email alerts with the free Yahoo! Toolbar.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":28710,"nextTopicId":28735}}