{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teach, learn, and looking for some\tfeedback","postDate":"1026126099","msgId":39085,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NEVFOTUzLkE1OUYlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PEI5NEU4QTA3LkUwMiVhYnRsZW9AZWFydGhsaW5rLm5ldD4="},"prevInTopic":39084,"nextInTopic":0,"prevInTime":39084,"nextInTime":39086,"topicId":39070,"numMessagesInTopic":0,"msgSnippet":"... Music lessons to me seem a lot like math lessons. A lot of the learning (teaching! ;-) is out of context, e.g., how to do two digit addition and how to","messageBody":"<div id=\"ygrps-yiv-346838139\">on 7/7/02 6:20 PM, Alan & Brenda Leonard at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abtleo@...\">abtleo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Somewhere along the<br/>\n&gt; line, somebody hears a violin, decides they want to learn to do that, and<br/>\n&gt; calls me for violin lessons.<br/>\n<br/>\n </span></blockquote>Music lessons to me seem a lot like math lessons. A lot of the learning<br/>\n(teaching! ;-) is out of context, e.g., how to do two digit addition and how<br/>\nto play a G, or in artificial contexts, e.g., made up word problems and<br/>\nbeginner songs that weren&#39;t the ones that inspired kids to want to play the<br/>\nviolin.<br/>\n<br/>\nOf course most kids don&#39;t stumble over violin playing throughout their daily<br/>\nlife as they do math! They can&#39;t watch mom playing, she can&#39;t show them<br/>\nsomething interesting she found.<br/>\n<br/>\nBut perhaps you could incorporate some of that. Find out what it was that<br/>\nthey heard that drew them to the violin, or the kinds of things that kids<br/>\nfind cool until they get used to listening for themselves. Maybe they could<br/>\nbring in recordings/music of things they like and mess around with it so<br/>\nthat learning how to hold the bow isn&#39;t the point of the lesson. It&#39;s a<br/>\nskill that gets picked while working towards something they want. Learning<br/>\nhow to add is a side-effect of wanting to know how much money they have or<br/>\nhow long until daddy gets home or who won the game.<br/>\n<br/>\nIt might help if you projected the attitude of a mentor. *Assume* they will<br/>\nbecoming to you as a mentor rather than assuming they want to be fed. You<br/>\nmight need to feed them some nifty things that other kids have enjoyed<br/>\ntrying to do to get the ball rolling but I bet once they get the idea, that<br/>\nmany will figure it out. Some might not. And they might feel more<br/>\ncomfortable with a different teacher. Which should be perfectly fine! Not<br/>\nall kids learn the same way.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Teach, learn, and looking for some feedback","postDate":"1026116501","msgId":39084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFiLjFlOTM5ODgzLjJhNWFhNTk1QGFvbC5jb20+"},"prevInTopic":39081,"nextInTopic":39085,"prevInTime":39083,"nextInTime":39085,"topicId":39070,"numMessagesInTopic":0,"msgSnippet":"... voice and facialexpressions, everything that s part of a human connection is assumed tobe dispensible.  That seems wrong to me.  ","messageBody":"<div id=\"ygrps-yiv-2045188922\"><blockquote><span title=\"ireply\">&gt;&gt;As if only the wordsthat the teacher speaks are important -- the tone of <br/>\n </span></blockquote>voice and facialexpressions, everything that&#39;s part of a human connection is <br/>\nassumed tobe dispensible.  That seems wrong to me.  &lt;&lt;<br/>\n<br/>\nI can&#39;t teach big huge theater-style classes where students are too far for <br/>\nme to look into their eyes. I have to have students sitting so that I can see <br/>\ntheir faces. If I don&#39;t - I just start to stumble and fumble and can&#39;t <br/>\nexplain myself well and my lectures become PAINFULLY stilted and boring. When <br/>\nI have eye contact, I&#39;m very very sensitive to my students - sensing that <br/>\nthis one is not quite understanding, not trying, trying really hard, getting <br/>\noverwhelmed, not getting enough information, wanting more, wanting less, etc. <br/>\n<br/>\n<br/>\n--pam<br/>\n<br/>\nNational Home Education Network<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.NHEN.org\">http://www.NHEN.org</a><br/>\nChanging the Way the World Sees Homeschooling!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teach, learn, and looking for some feedback","postDate":"1026098129","msgId":39081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEMjkwM0QxLjRBM0VBNUNBQGVhcnRobGluay5uZXQ+","referencesHeader":"PDIwMDIwNzA3LjE1NTE0MS4tMTM5MTA5LjMuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":39078,"nextInTopic":39084,"prevInTime":39080,"nextInTime":39082,"topicId":39070,"numMessagesInTopic":0,"msgSnippet":"**I ve been mentally writing an essay on the importance of experts, so this is very timely for me. Up until this summer, Rain had mostly learned things on her","messageBody":"<div id=\"ygrps-yiv-297431055\">**I&#39;ve been mentally writing an essay on the importance of experts, so<br/>\nthis is very timely for me. Up until this summer, Rain had mostly<br/>\nlearned things on her own, with my assistance as requested, and using resources<br/>\nsuch as books, tv, computer software, etc. She&#39;d been on sports teams<br/>\nwith coaches, but that was all pretty loose, and the coaches did a lot<br/>\nmore organizing than teaching. And they weren&#39;t &quot;experts&quot;, just men and<br/>\nwomen who knew a bit and were willing to get out there with the kids.**<br/>\n<br/>\nIt&#39;s great that you are pondering this, and I&#39;ll hope you share more as<br/>\nyour ideas form.<br/>\n<br/>\nI&#39;ve been reading stuff about &quot;education reform&quot;, especially past<br/>\nefforts.  I was really struck by the assumption that a human teacher<br/>\ncould be replaced by some kind of technology (e.g., filmstrips, or a<br/>\ncomputer) doing programmed instruction, and that nothing would be lost,<br/>\nthere would just be amazing gains in productivity. As if only the words<br/>\nthat the teacher speaks are important -- the tone of voice and facial<br/>\nexpressions, everything that&#39;s part of a human connection is assumed to<br/>\nbe dispensible.  That seems wrong to me.<br/>\n<br/>\nI was also reading some stuff about language acquisition, and whether<br/>\nyounger kids have an advantage in second language acquisition.  My<br/>\npersonal theory is that babies do so well with language acquisition<br/>\nbecause they are with their mothers.  I think a child in daycare or with<br/>\na non-native-speaker nanny might be at a disadvantage for language<br/>\nacquisition.  I did notice that when my son was first taking off in<br/>\nreading to himself he would come over to the couch and lean against me<br/>\nto have the same contact that was familiar from when I had read to him.<br/>\n<br/>\nMaybe the value of affection in learning as been underestimated.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teach, learn, and looking for some  feedback","postDate":"1026092735","msgId":39078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAyMDcwNzE4NDI1Mi4wMjhkYjY2MEBsb2NhbGhvc3Q+","inReplyToHeader":"PEI5NEU4QTA3LkUwMiVhYnRsZW9AZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDEwMjYwNjM2NTcuMTM3Ni4yMzE1MC5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":39076,"nextInTopic":39081,"prevInTime":39077,"nextInTime":39079,"topicId":39070,"numMessagesInTopic":0,"msgSnippet":"... There are 2 unschoolers on the Canadian homeschooling list who teach violin.  They ve talked some on the list about their conflicts between their","messageBody":"<div id=\"ygrps-yiv-246322560\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;As my understanding of how my son learns and how I learn develops, the<br/>\n&gt;natural side-effect is to consider what I do professionally.  I teach<br/>\n&gt;violin, and I&#39;ve been struggling with how I do that.  (I hate the &quot;I<br/>\n&gt;teach...&quot; comment, too, and I&#39;m open to suggestions on other ways to say<br/>\n&gt;that!  My business card could use a little help, too.)<br/>\n<br/>\n </span></blockquote>There are 2 unschoolers on the Canadian homeschooling list who teach <br/>\nviolin.  They&#39;ve talked some on the list about their conflicts between <br/>\ntheir unschooling principals and their violin teaching methods.  They also <br/>\ntalk about it a lot between themselves.  If you&#39;re interested, I could ask <br/>\nthem if it&#39;s all right to send you their addys.<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teach, learn, and looking for some feedback","postDate":"1026089396","msgId":39076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMC4xMGQ2OWJkYy4yYTVhM2JiNEBhb2wuY29tPg=="},"prevInTopic":39073,"nextInTopic":39078,"prevInTime":39075,"nextInTime":39077,"topicId":39070,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2106929287\">&lt;&lt;As my understanding of how my son learns and how I learn develops, the<br/>\nnatural side-effect is to consider what I do professionally.  I teach<br/>\nviolin, and I&#39;ve been struggling with how I do that. &gt;&gt;<br/>\n<br/>\nHolly was taking fiddle lessons from someone who<br/>\n1) played since he was eight<br/>\n2) switched to (or added to his knowledge) bluegrass and Irish three years <br/>\nbefore that<br/>\nand<br/>\n3) is a homeschooling/unschooling-maybe dad of a four/five year old boy.<br/>\n<br/>\nSo the teacher was interested in experimenting with looser methods and <br/>\nteaching by ear.  He was willing to go with Holly&#39;s personal quirks, if he <br/>\nfound any.  <br/>\n<br/>\nShe went ten times or so, had three songs mostly learned, liked his tire <br/>\nswing better than the lessons, and after a while didn&#39;t want to go.<br/>\n<br/>\nLast month she said she wanted to start again, but his bluegrass band is <br/>\ngetting more work AND he has more students (and he&#39;s a full time engineer or <br/>\nsomething), so her spot was gone, but he recommended someone else who<br/>\n1) teaches suzuki or something akin to it<br/>\n2) has (in fall starting again) a group that is all-but-one homeschoolers, so <br/>\nthey have a private lesson and the  come to the group thing each week too<br/>\n3) is doing fiddling too<br/>\nAND<br/>\n4) is concert master for the Musical Theatre of the Southwest.<br/>\n<br/>\nAnd she and Holly hit it off well.  Holly&#39;s been three times and is going <br/>\nagain tomorrow.  The approach is really structured (the teacher is reading <br/>\noff a list sometimes, and always checking back with her checklist, so it&#39;s <br/>\nsomeone else&#39;s &quot;curriculum&quot;), but it&#39;s fun and funny and Holly&#39;s into it.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;   But how do I get them beyond the &quot;teach me&quot;<br/>\nmentality to learn themselves?  How do I give these people some direction,<br/>\nwithout it becoming just more assignments that I give for the week, added<br/>\nonto everything else. &gt;&gt;<br/>\n<br/>\nMaybe you could say you&#39;re the coach, and they need to do there <br/>\nviolin-related things each week besides playing it some (don&#39;t say <br/>\n&quot;practicing,&quot; say &quot;play your violin during the week,&quot; and then it won&#39;t be <br/>\nhomework, it will be the coach reminding them to DO).<br/>\n<br/>\nI&#39;ve taken piano lessons from three different teachers  (pre-school for a <br/>\nyear, and then jr high/high school two teachers), was in band in school, had <br/>\ntwo chorus teachers I liked lots, made all-state, took recorder lessons <br/>\n(after I had learned to play it, took serious Baroque-coaching and <br/>\nRenaissance ensemble university-music lessons with Floyd Williams, who&#39;s in <br/>\nAustralia now, or was last I knew).  So the music lessons have been all kinds <br/>\nof different, but the LEARNING has been almost always me myself.  What the <br/>\nbest of those teachers did was coach me, and tweak what I was doing.<br/>\n<br/>\nMaybe you could ask them to find music (live or recorded, video, or old <br/>\nrecords) each week, and maybe art or history, and in all that exploration <br/>\nthey&#39;ll learn lots of trivia and connections that might inspire them to ask <br/>\nyou questions you could answer.<br/>\n<br/>\nAt Holly&#39;s last lesson they were doing copying phrases.   Holly would copy <br/>\nthree or four notes, with different (I don&#39;t know the violin terminology) <br/>\nbowing techniques--stacatto, legato (smooth and something).<br/>\n<br/>\nWith her old teacher she used to share a lesson with another homeschooler <br/>\nsometimes, and that girl was making up songs.  So the girl would play a <br/>\nphrase and the teacher would copy it.  THAT was a thrill for the <br/>\ncomposing-kid.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teach, learn, and looking for some feedback","postDate":"1026082300","msgId":39073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNzA3LjE1NTE0MS4tMTM5MTA5LjMuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":39070,"nextInTopic":39076,"prevInTime":39072,"nextInTime":39074,"topicId":39070,"numMessagesInTopic":0,"msgSnippet":"On Mon, 08 Jul 2002 00:20:03 +0200 Alan & Brenda Leonard ... along the ... and ... It ... teacher!  I  get kudos ... I ve been mentally writing an essay on the","messageBody":"<div id=\"ygrps-yiv-880981946\">On Mon, 08 Jul 2002 00:20:03 +0200 Alan & Brenda Leonard<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abtleo@...\">abtleo@...</a>&gt; writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; And yet to some extent, this is what I do for a living.  Somewhere <br/>\n </span></blockquote>along the<br/>\n<blockquote><span title=\"ireply\"> &gt; line, somebody hears a violin, decides they want to learn to do  that,<br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; calls me for violin lessons.  And so we begin working through the <br/>\n&gt; basics of how you play, etc.  But here&#39;s my problem: they get bored. <br/>\n </span></blockquote>It <br/>\n<blockquote><span title=\"ireply\"> &gt; happens to everyone, somewhere down the line.  (Including me, the<br/>\n </span></blockquote>teacher!  I  get kudos<br/>\n<blockquote><span title=\"ireply\"> &gt; for my teaching, I&#39;m a good teacher.  But it&#39;s not thrilling me, <br/>\n&gt; either<br/>\n<br/>\n </span></blockquote>I&#39;ve been mentally writing an essay on the importance of experts, so this<br/>\nis very timely for me. Up until this summer, Rain had mostly learned<br/>\nthings on her own, with my assistance as requested, and using resources<br/>\nsuch as books, tv, computer software, etc. She&#39;d been on sports teams<br/>\nwith coaches, but that was all pretty loose, and the coaches did a lot<br/>\nmore organizing than teaching. And they weren&#39;t &quot;experts&quot;, just men and<br/>\nwomen who knew a bit and were willing to get out there with the kids.<br/>\n<br/>\nThis summer, Rain is taking private swimming lessons from an expert<br/>\nswimmer. I was impressed by the way he sat down with her to start and<br/>\nasked what she could do, and what she wanted to be able to do. Then he<br/>\nwatched her &quot;swim&quot; (basically mess around in the water) for a few<br/>\nminutes, and then picked one small skill she was lacking (tucking her<br/>\nchin) and told her what this would do for her, and why. They went on like<br/>\nthat, with him giving her small pieces, and her practicing those bits<br/>\nuntil she felt she had them, and then him suggesting other pieces, or<br/>\ncombinations. I was really impressed, both by his expertise and ability<br/>\nto break the skill down for her, and by his receptiveness to teaching her<br/>\nthe skills that would lead to what she wanted to learn. She may never<br/>\nmaster the back float - it wasn&#39;t on her list, she feels fine with the<br/>\nway she does it now and doesn&#39;t want further assistance - and that&#39;s<br/>\nokay. She *can* swim better than she could before, and that&#39;s what she<br/>\nwanted.<br/>\n<br/>\nI&#39;ve heard of music teachers who start the same way, with inviting the<br/>\nperson wanting help to just play, or sing, and then taking it from there.<br/>\nRain has been learning a lot about singing this summer through a theater<br/>\nworkshop, and has expressed an interest in continuing with some sort of<br/>\nlessons (mentorship?) after the workshop ends. I would look for someone<br/>\nwho would look at meeting her specific goals at that time, not at working<br/>\nthrough a beginning singing book. Maybe the problem is the whole<br/>\nteacher-student paradigm, maybe you could call yourself a &quot;violin<br/>\nmentor&quot;, since that to me implies a resource to be used, instead of<br/>\nsomeone who will be responsible for shoving knowledge into your head.<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teach, learn, and looking for some\tfeedback","postDate":"1026080403","msgId":39070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NEU4QTA3LkUwMiVhYnRsZW9AZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDEwMjYwNjM2NTcuMTM3Ni4yMzE1MC5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39073,"prevInTime":39069,"nextInTime":39071,"topicId":39070,"numMessagesInTopic":0,"msgSnippet":"I need help here, folks, and this IS related to unschooling, but in a different way.  Feel free to hit delete if I bore you (expect for you, Sandra...you got","messageBody":"<div id=\"ygrps-yiv-1765151716\">I need help here, folks, and this IS related to unschooling, but in a<br/>\ndifferent way.  Feel free to hit delete if I bore you (expect for you,<br/>\nSandra...you got me here, now you have to help me! &lt;g&gt;).<br/>\n<br/>\nAs my understanding of how my son learns and how I learn develops, the<br/>\nnatural side-effect is to consider what I do professionally.  I teach<br/>\nviolin, and I&#39;ve been struggling with how I do that.  (I hate the &quot;I<br/>\nteach...&quot; comment, too, and I&#39;m open to suggestions on other ways to say<br/>\nthat!  My business card could use a little help, too.)<br/>\n<br/>\nI&#39;m coming to beleive that most students come to me expecting me to feed<br/>\nknowledge into them, and then they become burned out when I do exactly that.<br/>\n(And so do I!)  I was considering it this way: if my son wanted to learn<br/>\nabout dinosaurs, I&#39;d probably help him find a couple books on dinosaurs,<br/>\nsearch for web sites, check out our nearby Natural History museum, buy some<br/>\nmodel dinosaurs to mess around with, or whatever.  The LAST thing I&#39;d<br/>\nconsider doing would be calling someone whom I heard was an expert on<br/>\ndinosaurs and sign him up for weekly &quot;dinosaur lessons&quot;, where he would<br/>\nlearn a little bit new each week and then be expected to come home and<br/>\nrepeat it over and over and then repeat it back to the expert the next week,<br/>\nperfectly or at least greatly improved!<br/>\n<br/>\nAnd yet to some extent, this is what I do for a living.  Somewhere along the<br/>\nline, somebody hears a violin, decides they want to learn to do that, and<br/>\ncalls me for violin lessons.  And so we begin working through the basics of<br/>\nhow you play, etc.  But here&#39;s my problem: they get bored.  It happens to<br/>\neveryone, somewhere down the line.  (Including me, the teacher!  I get kudos<br/>\nfor my teaching, I&#39;m a good teacher.  But it&#39;s not thrilling me, either.)<br/>\nLet&#39;s face it, put as above, I&#39;d be bored with dinosaurs in the first month.<br/>\nIf we played little games learning the information, had some laughs, etc., I<br/>\nmight survive for two months.<br/>\n<br/>\nI&#39;m realizing that somehow, I need my students to see me as a single<br/>\nresource in their quest to learn violin.  That they also need to read,<br/>\nlisten, study, experiment, search the internet, etc.  They need to think<br/>\nabout why some things work and some things just don&#39;t work for them, and how<br/>\nto fix their own problems.  But how do I get them beyond the &quot;teach me&quot;<br/>\nmentality to learn themselves?  How do I give these people some direction,<br/>\nwithout it becoming just more assignments that I give for the week, added<br/>\nonto everything else.<br/>\n<br/>\nThere&#39;s so much more to this all jumbled around in my poor little brain<br/>\ntonight, but maybe this works as a start.  Thanks for the help!<br/>\n<br/>\nbrenda</div>","specialLinks":[]}],"prevTopicId":39082,"nextTopicId":39053}}