{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":5029967,"authorName":"plumaria_1","from":"&quot;plumaria_1&quot; &lt;plumaria_1@...&gt;","profile":"plumaria_1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re: unmusic-ing","postDate":"1066248894","msgId":82979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtazlydStxOXE0QGVHcm91cHMuY29tPg=="},"prevInTopic":82928,"nextInTopic":0,"prevInTime":82978,"nextInTime":82980,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-157976252\">&lt;&lt;This morning dd 8, was playing a tune on the piano she learned to<br/>\nsing at a<br/>\nfriend&#39;s synagogue. She figured out the tune last week but today she began<br/>\nadding chords to the melody. All by herself, she does not want any help<br/>\nfrom me thank you very much. after she figured out the chords she<br/>\nwanted to<br/>\nadd she played it and sang along... in Hebrew.<br/>\n<br/>\nMy smile is going to last all day.<br/>\n<br/>\nKrisula&gt;&gt;<br/>\n<br/>\n<br/>\nI&#39;m smiling too!  That is so great, Krisula!!<br/>\n<br/>\nIsn&#39;t it neat that music is so tied into other areas of life...it is<br/>\nwoven into life so completely that we learn about culture and religion<br/>\nand literature and dance and so on!  SOmeimes these other aspects of<br/>\nlife bring us back to music, and music also brings us to these other<br/>\nwonderful things to learn about life.<br/>\n<br/>\nPam (I remember it as being Pam) was talking about an ancient musical<br/>\ninstrument in an earlier post on this thread, (I need to dig that post<br/>\nup so I can listen to that instrument!) and I wanted to share a link<br/>\nsomeone offered on another homeschool message board.  It is a website<br/>\nthat features unusual/ethnic musical instruments from all times. <br/>\nThere is a good bit of history and pictures and sound samples, too. <br/>\nhere is the link: <a rel=\"nofollow\" target=\"_blank\" href=\"http://oddmusic.com/\">http://oddmusic.com/</a><br/>\n<br/>\nCheers!</div>","specialLinks":[]},{"userId":154422553,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisulam@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unmusic-ing","postDate":"1066175000","msgId":82928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElORU5MQU5QUENKSEFJUE9NRklPRUVITkNBQUEua3Jpc3VsYW1AdmVyaXpvbi5uZXQ+","inReplyToHeader":"PDEwNjYxMzc4NjQuNjMyLjk1OTE3Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":82871,"nextInTopic":82979,"prevInTime":82927,"nextInTime":82929,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"Just thought I d share: My husband and I are both musicians.  I have degrees in performance and in music ed and my husband plays many instruments, performs,","messageBody":"<div id=\"ygrps-yiv-1166881666\">Just thought I&#39;d share:<br/>\n<br/>\nMy husband and I are both musicians.  I have degrees in performance and in<br/>\nmusic ed and my husband plays many instruments, performs, records and leads<br/>\nmusic at church.  We don&#39;t do any formal lessons with our children 10, 8,<br/>\nand 3.  They are surrounded by music and have access to instruments and<br/>\nrecordings and most important, they experience other people enjoying music<br/>\nmaking around them.<br/>\n<br/>\nThis morning dd 8, was playing a tune on the piano she learned to sing at a<br/>\nfriend&#39;s synagogue.  She figured out the tune last week but today she began<br/>\nadding chords to the melody.  All by herself, she does not want any help<br/>\nfrom me thank you very much.  after she figured out the chords she wanted to<br/>\nadd she played it and sang along... in Hebrew.<br/>\n<br/>\nMy smile is going to last all day.<br/>\n<br/>\nKrisula</div>","specialLinks":[]},{"userId":5029967,"authorName":"plumaria_1","from":"&quot;plumaria_1&quot; &lt;plumaria_1@...&gt;","profile":"plumaria_1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re: unmusic-ing","postDate":"1066085708","msgId":82871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtZmFnYys1cjc5QGVHcm91cHMuY29tPg=="},"prevInTopic":82859,"nextInTopic":82928,"prevInTime":82870,"nextInTime":82872,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1921232447\">&lt;&lt;I<br/>\ncouldn&#39;t play the rest of the song, because I didn&#39;t know D7. Lisa<br/>\nsaid, yes<br/>\nyou do. She pulled out the paper Dan had written the chords on for us. She<br/>\nwas right, D7 is one of the chords.<br/>\n<br/>\nMy kids pick up so much more than I am aware of!<br/>\n<br/>\nMary Ellen&gt;&gt;<br/>\n<br/>\n<br/>\nGlad you could finish your song! (-:  Lisa to the rescue!<br/>\n<br/>\nMy ds saw this neat chord flip-card thing at the DIscovery CHannel<br/>\nstore in the mall...it is a chord chart made up of flash cards.  All<br/>\nof the cards are in the shape of the fret board (complete with tuning<br/>\npegs on the end) and the strings.  The cards seem to be true to size<br/>\nof an actual guitar.  Each card shows the finger placement for each<br/>\nchord.  I don&#39;t know if all of the chords you can play on the guitar<br/>\nare there, but the whole book of catds is almost an inch thick.  It&#39;s<br/>\ncalled the guitar chord deck (like in deck of cards)<br/>\nISBN is 0.8256.1754.5  <br/>\n<br/>\nIt seems *tons* easier to see the finger placement on this flip deck<br/>\nthan it does on regular chord charts in the back of our beginning<br/>\nguitar book.  <br/>\n<br/>\nWe went and bought it.  Ds (age 7) is playing the guitar..imitating<br/>\nthe strumming patterns of folks we see performing live and on tv.  He<br/>\ntold me a few months ago that he wants to be a rock star when he grows<br/>\nup.  Maybe someday he&#39;ll be interested in learning the chords on the<br/>\nguitar....I bet this will be helpful.<br/>\n<br/>\nThanks All, for sharing your unmusic-ing adventures!  It&#39;s so nice to<br/>\nread them...it seems that in the general populace, musicmaking is<br/>\ntreated with so much regiment (fixed ages to begin, lessons from the<br/>\nstart, etc)  that in many people, the joy is either lost or never found.</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unmusic-ing","postDate":"1066072123","msgId":82859,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTQwMWMzOTFiZSRlNzE5MTNlMCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDFhMy4xYjQwN2NhMS4yY2I4OTY0N0Bhb2wuY29tPg=="},"prevInTopic":82807,"nextInTopic":82871,"prevInTime":82858,"nextInTime":82860,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"I think I mentioned that someone showed Lisa the chords and how to use them to play Where Have All the Flowers Gone on the guitar.  She has tried to play it a","messageBody":"<div id=\"ygrps-yiv-1411303892\">I think I mentioned that someone showed Lisa the chords and how to use them to play Where Have All the Flowers Gone on the guitar.  She has tried to play it a few times, but hasn&#39;t done much with it as far as I can tell.<br/>\n<br/>\nThis morning I dug out a Wee Sing book because I thought it might have the chords written for the songs.  It does!  I looked for songs with the 4 chords Dan showed us.  I played part of one song, but then came to D7.  I said that I couldn&#39;t play the rest of the song, because I didn&#39;t know D7.  Lisa said, yes you do.  She pulled out the paper Dan had written the chords on for us.  She was right, D7 is one of the chords.<br/>\n<br/>\nMy kids pick up so much more than I am aware of!<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:unmusic-ing","postDate":"1065986943","msgId":82807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OS4xYTJhYmZhMi4yY2JiMDU3ZkBhb2wuY29tPg=="},"prevInTopic":82782,"nextInTopic":82859,"prevInTime":82806,"nextInTime":82808,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/12/2003 8:25:48 AM Eastern Standard Time, UnschoolingDiscussion@yahoogroups.com writes: My kids are young--3 and 5. We ve had a guitar","messageBody":"<div id=\"ygrps-yiv-1167670409\">In a message dated 10/12/2003 8:25:48 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> writes:<br/>\nMy kids are young--3 and 5. We&#39;ve had a guitar around forever. Now <br/>\nthey&#39;ve both got recorders and a harmonica and a kazoo and some blowing <br/>\ninstrument with keys like a (heck--it&#39;s like an acordion but smaller). <br/>\nAfter the conference, where they had SO much fun with the rhythm <br/>\ninstruments they&#39;d been wanting a triangle, which we got them this week. <br/>\nAnd we recently got an electronic keyboard that they love playing with.<br/>\n<br/>\nWe also have a violin and a viola, but they&#39;re not available to the kids <br/>\nmost of the time. We all play music, I read music, and none of us perform.<br/>\nWe sort of do a combination of lessons and unmusic-ing.  Julian, who is 14, <br/>\ndoes take guitar lessons, and takes them very seriously, as he&#39;s hoping to be a <br/>\nprofessional musician.  Beth plays lots of instruments, almost all <br/>\nself-taught, and takes an occasional violin lesson when she has time. We have a <br/>\nkeyboard, violin, several guitars, drums of several types, weird African instruments, <br/>\nocarinas, recorders, a sax, a clarinet, and ... oh, probably several more. <br/>\n<br/>\nI listen to music most of the time. We all sing, particularly Julian, who&#39;s <br/>\nvery good.  We have lots of musical family friends.<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill & Diane","from":"Bill & Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unmusic-ing","postDate":"1065868809","msgId":82782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGODdERTA5LjIwODA2MDZAdm9sLmNvbT4=","inReplyToHeader":"PGJtNzQ0cSs2YXNoQGVHcm91cHMuY29tPg==","referencesHeader":"PGJtNzQ0cSs2YXNoQGVHcm91cHMuY29tPg=="},"prevInTopic":82682,"nextInTopic":82807,"prevInTime":82781,"nextInTime":82783,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"My kids are young--3 and 5. We ve had a guitar around forever. Now they ve both got recorders and a harmonica and a kazoo and some blowing instrument with keys","messageBody":"<div id=\"ygrps-yiv-1041133221\">My kids are young--3 and 5. We&#39;ve had a guitar around forever. Now <br/>\nthey&#39;ve both got recorders and a harmonica and a kazoo and some blowing <br/>\ninstrument with keys like a (heck--it&#39;s like an acordion but smaller). <br/>\nAfter the conference, where they had SO much fun with the rhythm <br/>\ninstruments they&#39;d been wanting a triangle, which we got them this week. <br/>\nAnd we recently got an electronic keyboard that they love playing with.<br/>\n<br/>\nWe also have a violin and a viola, but they&#39;re not available to the kids <br/>\nmost of the time. We all play music, I read music, and none of us perform.<br/>\n<br/>\n:-) Diane<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;So I was curious, would any of you unschoolers like to share your<br/>\n&gt;adventures with music?  How do you and your kids experience music, and<br/>\n&gt;how has this changed over time? DO any of you/your kids play and<br/>\n&gt;perform?  How did it all start out and how is it coming about? I wOUld<br/>\n&gt;love to hear the stories you have to tell!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unmusic-ing","postDate":"1065827399","msgId":82682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMy4xYjQwN2NhMS4yY2I4OTY0N0Bhb2wuY29tPg=="},"prevInTopic":82680,"nextInTopic":82782,"prevInTime":82681,"nextInTime":82683,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/10/03 5:01:29 PM, nellebelle@charter.net writes: ","messageBody":"<div id=\"ygrps-yiv-1242259315\">In a message dated 10/10/03 5:01:29 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nellebelle@...\">nellebelle@...</a> writes:<br/>\n<br/>\n&lt;&lt; In the past, I probably would have responded to a request to play an <br/>\ninstrument in an all or nothing way.  I probably would have insisted that they <br/>\nchoose between an instrument or dance (both take dance lessons right now.) &gt;&gt;<br/>\n<br/>\nSometimes one of our kids is &quot;doing two or three things&quot; and another is <br/>\n&quot;doing nothing&quot; (in terms of projects or lessons or teams involving other people <br/>\noutside the house).  Instead of trying to enforce a steady schedule of one or <br/>\ntwo things, each kid has to have or do a sport, and an art, we just encourage <br/>\nthe things that come up, don&#39;t force them to stay, and encourage the next thing <br/>\ntoo.  The kids have been great about it, and we always know that they&#39;re doing <br/>\nwhat they&#39;re doing because they really want to.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unmusic-ing","postDate":"1065826413","msgId":82680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWIwMWMzOGY4MSQ4MDE3YzM2MCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PGJtNzQ0cSs2YXNoQGVHcm91cHMuY29tPg=="},"prevInTopic":82679,"nextInTopic":82682,"prevInTime":82679,"nextInTime":82681,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"Music has been on my mind lately!  I enjoy listening to music and often talk to my kids about music we hear on the radio, in movies,  or on our home stereo.","messageBody":"<div id=\"ygrps-yiv-273956403\">Music has been on my mind lately!  I enjoy listening to music and often talk to my kids about music we hear on the radio, in movies,  or on our home stereo.  We watch music on TV too, vh1, etc.  I played violin between the ages of 10 and 15.<br/>\n<br/>\nWe inherited a piano and two banjos from my mil.  I bought a couple &quot;teach yourself to play&quot; piano books, 1 is written for adults and the other is an Usborne book aimed at kids.  I hoped that I might learn to play, but haven&#39;t made it a priority.  Both kids sometimes play around on the piano and Lisa has asked me to help her learn to play, so we do a bit of that.  We are researching piano lessons as a possible option.  The banjos get pulled out and played from time to time, although none of us really know quite how to play them.<br/>\n<br/>\nWe have a child size guitar.  We had musician/relatives visit Labor Day weekend.  Dan showed us how to play &quot;where have all the flowers gone&quot; (using 4 chords).  I&#39;ve got it down pretty good, but can&#39;t get my voice to match the guitar.  I really like the child size guitar myself!  Lisa picks it up once in awhile, but seems to get frustrated easily.  I remind her that it is easier for me because I have played an instrument before and my fingers are a bit stronger than hers and that every time she tries it will get easier and sound better.<br/>\n<br/>\nJackie asked about trying a violin.  We rented a 1/4 size for her and got a book to help refresh my memory enough to get her started.  She&#39;s only played it a few times and said it&#39;s not her thing after all, but the store rents for a minimum of 3 months, so we will have it for another month and a half.  (We could take it back sooner, but we will be charged for the 3 months, so might as well hang on to it.)  I&#39;ve played it a little too.  Boy is it tiny!  Lisa has played it a few times and likes it, but really needs a bigger size.  We talked about trading for a bigger size for the rest of our rental period, but then Jackie said no, she does want to play it.  She doesn&#39;t actually play it though, just says she wants to.  She says what she really wants is an electric guitar.  Pat (dh) tells her if she wants to play electric guitar, she should play the acoustic guitar instead, because we have it and we don&#39;t have an electric one.  I pointed out that they are similar, but certainly not the same.  I&#39;m trying to work out how to get hold of an electric one for her to try.<br/>\n<br/>\nLisa wants a drum set now.<br/>\n<br/>\nIn my dreams I would have an entire room in my house set up with all sorts of musical instruments for us to use and enjoy anytime.  But my reality is a not big enough house and a lack of time and money to buy numerous instruments and lessons.  I am giving this issue serious attention though.  There must be a way, right?<br/>\n<br/>\nOh, both girls have also &quot;started bands&quot; with some friends, but haven&#39;t got very far.  I&#39;ve told my kids that if they want to have a band, the most important thing is to spend time making music.  They get more caught up with what to name the band and who should be which part of the band.  I&#39;m trying to be helpful without putting any pressure on them.  It&#39;s not like it matters to me whether they have a band or not.  It is hard to know quite what to do though, as my only past experience at making music was through school.<br/>\n<br/>\nI&#39;ve only recently made the switch from unschooling as an academic philosophy to unschooling as a lifestyle.  In the past, I&#39;d think about how &quot;busy&quot; I was with my kid&#39;s various activities and how the busy-ness was overwhelming me.  I&#39;m now focusing instead on my role as supporting them in the things they&#39;d like to do or try.  What a difference that change in attitude makes!  However, the day to day details of it are still needing to be worked out.  In the past, I probably would have responded to a request to play an instrument in an all or nothing way.  I probably would have insisted that they choose between an instrument or dance (both take dance lessons right now.)  Now I am seeing it as something they want to experience that may or may not become a passion for them and either way is OK.  Still, it is hard to get beyond my old programming and figure out how to actually do it.<br/>\n<br/>\nMary Ellen <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unmusic-ing","postDate":"1065826362","msgId":82679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYy4xMTFmYmI2Ny4yY2I4OTIzYUBhb2wuY29tPg=="},"prevInTopic":82675,"nextInTopic":82680,"prevInTime":82678,"nextInTime":82680,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/10/03 2:50:02 PM, plumaria_1@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-917207117\">In a message dated 10/10/03 2:50:02 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plumaria_1@...\">plumaria_1@...</a> writes:<br/>\n<br/>\n&lt;&lt; So I was curious, would any of you unschoolers like to share your<br/>\n<br/>\nadventures with music?  How do you and your kids experience music, and<br/>\n<br/>\nhow has this changed over time? DO any of you/your kids play and<br/>\n<br/>\nperform?  How did it all start out and how is it coming about? I wOUld<br/>\n<br/>\nlove to hear the stories you have to tell! &gt;&gt;<br/>\n<br/>\nKirby went to homeschool band ONCE to learn clarinet and didn&#39;t like the <br/>\ndirector, and didn&#39;t want to go back.   That frustrated me, but you really can&#39;t <br/>\nforce someone to play a wind instrument, and even I could, it wouldn&#39;t be good.<br/>\n<br/>\nMarty borrowed a banjo and played with it for a while, and it has sat quietly <br/>\nfor months.<br/>\n<br/>\nHolly took fiddle lessons for a year overall, with a break in the middle, <br/>\nfrom two different teachers.  Sometimes she was really excited and played a lot, <br/>\nand sometimes she was frustrated.<br/>\n<br/>\nHolly has lately been playing &quot;Prepare Ye the Way of the Lord&quot; from Godspell <br/>\non an electronic keyboard, playing the bass line/counterpoint with her left <br/>\nhand and tune with the right.<br/>\n<br/>\nMarty has my wooden ocarina, a fingering chart, and a tune I sketched out for <br/>\nhim in a way he could understand it.<br/>\n<br/>\nThey all sing for fun sometimes.  They listen to LOTS of music.  Marty can <br/>\nnotice similarities in tiny bits of tunes, so sometimes will make a kind of <br/>\nmusical pun.   Holly&#39;s messing with learning to harmonize, and has gotten where <br/>\nshe can hold her own part while others harmonize, without following them over to <br/>\ntheir notes.<br/>\n<br/>\nBut it&#39;s by ear.   While they&#39;re interested passively in commentary about <br/>\nmusic, if it comes up (like &quot;look at this&quot; or they&#39;ll bring me a piece and ask <br/>\nabout part of a tune, and I&#39;ll read it from music, show them where I&#39;m reading <br/>\nand sing the part they&#39;re missing), they haven&#39;t had a reason to learn to read <br/>\nit.<br/>\n<br/>\nI have no doubt they&#39;d learn it pretty quickly if they tried, because it <br/>\nwouldn&#39;t scare them.  It&#39;s a grid, with direction and pace markings.  They&#39;re all <br/>\ngames- and math-oriented enough that they would apply prior knowledge to it <br/>\nand probably discover lots of it on their own.  <br/>\n<br/>\nI did.<br/>\n<br/>\nI&#39;d have a music lesson and then learn a bunch on my own, and go back in <br/>\nahead of the course, and that&#39;s what made it easy--my curiosity about what, if <br/>\nthere was 3/4 and 6/8 was the difference, and what OTHER /4 and /8 were there and <br/>\nwhy (and all that &quot;why? why? why?&quot; thinking).<br/>\n<br/>\nMy  husband and I met in a madrigal group.  We both had done vocal music <br/>\nstuff (me at church and school and folk music, and him at school and in a local <br/>\nSingOut group).  We&#39;d both had piano lessons and theory and played wind <br/>\ninstruments (clarinet and recorder for me; clarinet, oboe and bassoon for him).<br/>\n<br/>\nSo it&#39;s not a foreign thing to our family.<br/>\n<br/>\nThey all appreciate musicals and musical humor and &quot;oldies,&quot; and they have a <br/>\npassing familiarity with a number of medieval and Renaissance songs from being <br/>\naround musicians in the SCA their whole lives.<br/>\n<br/>\nHolly more than the boys enjoys going to folksinging parties and to Sacred <br/>\nHarp sessions.  She&#39;s interested in going to more of those, and that&#39;s a way to <br/>\nlearn a lot about music--some people singing by shapes and some by the staff <br/>\npositions (relative pitch, not with a piano) and it being four part harmony <br/>\nwith the two styles of notation all right there in front of her and the voices <br/>\nall around.   I learned a lot about music just watching the other parts in <br/>\nchurch, and eventually singing the alto and tenor lines on stuff I&#39;d heard my whole <br/>\nlife.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":5029967,"authorName":"plumaria_1","from":"&quot;plumaria_1&quot; &lt;plumaria_1@...&gt;","profile":"plumaria_1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unmusic-ing","postDate":"1065817050","msgId":82675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtNzQ0cSs2YXNoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":82679,"prevInTime":82674,"nextInTime":82676,"topicId":82675,"numMessagesInTopic":0,"msgSnippet":"Hi All, My family loves music.  We love listening to and  dancing to music. We enjoy watching watching musical performances live and on tv/video. Most of all,","messageBody":"<div id=\"ygrps-yiv-1777372039\">Hi All,<br/>\n<br/>\nMy family loves music.  We love listening to and  dancing to music. <br/>\nWe enjoy watching watching musical performances live and on tv/video.<br/>\n Most of all, we love making music with various instruments we have in<br/>\nthe house...homemade and manufactured.  <br/>\n<br/>\nMy kids have not yet shown an interest in learning to learn to read<br/>\nmusic or master an instrument, and perhaps they will, or they won&#39;t.<br/>\nThe point is that they enjoy it in their own ways.   SO I think of us<br/>\nas &quot;unmusic-ing&quot;.  <br/>\n<br/>\nSo I was curious, would any of you unschoolers like to share your<br/>\nadventures with music?  How do you and your kids experience music, and<br/>\nhow has this changed over time? DO any of you/your kids play and<br/>\nperform?  How did it all start out and how is it coming about? I wOUld<br/>\nlove to hear the stories you have to tell!</div>","specialLinks":[]}],"prevTopicId":82978,"nextTopicId":82982}}