{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":177721839,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re:  Gifts","postDate":"1090632077","msgId":96795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzI0MDEyMTEyLlNMQkMyODYwOS5tdGExMy5hZGVscGhpYS5uZXRAbGVpZ2g+","inReplyToHeader":"PENGQjNBMkUyLUREMDgtMTFEOC05REE4LTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":96791,"nextInTopic":0,"prevInTime":96794,"nextInTime":96796,"topicId":96383,"numMessagesInTopic":0,"msgSnippet":"Your cocoa parties remind me of my Grammy. My favorite Grammy didn t have much money to speak of and she stretched her budget tightly to give us each a five","messageBody":"<div id=\"ygrps-yiv-1978574908\">Your cocoa parties remind me of my Grammy.<br/>\n <br/>\nMy favorite Grammy didn&#39;t have much money to speak of and she stretched her<br/>\nbudget tightly to give us each a five dollar gift at Christmas each year.  I<br/>\nknow my mom picked out the gifts because Grammy didn&#39;t drive.  I honestly<br/>\ndon&#39;t remember one thing she gave me.  What I remember about her is the time<br/>\nshe gave me.  She really listened to me and wanted to know me.  She also<br/>\nmade home-made cocoa with cocoa powder and sugar.  It was always served in a<br/>\nCampbell&#39;s Soup Mug that she got free through the mail.  She loved to send<br/>\nfor freebies.  She read aloud to me. She spent time with me teaching me to<br/>\nknit.  She had smarties in her candy dish and we could have a pack or maybe<br/>\ntwo if we asked.  But mostly, she listened to me with an open heart and an<br/>\nopen mind.  She was not judgmental.  <br/>\n <br/>\nOn the other side of the family was Nana.  She gave more gifts but with<br/>\nstrings attached. (She&#39;d give a stuffed animal to us with instructions that<br/>\nit wasn&#39;t to play with but to sit on your bed as a decoration, etc.  She had<br/>\nfavorites and gave them much better gifts.)  She never listened to me or<br/>\nwanted to know more about me.  She seemed cold hearted and judgmental.  She<br/>\nliked my dh when she first met him and he drove a candy apple red corvette.<br/>\nShe didn&#39;t like him so much when she found out he didn&#39;t have any money to<br/>\nspeak of.  <br/>\n <br/>\nWhat it boils down to is the gifts don&#39;t really matter. It&#39;s what you give<br/>\nfrom your heart that matters.<br/>\nAngela <br/>\n &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n <br/>\n <br/>\nBut - like I said - the BIG memory that stands out more than any other <br/>\n- the cocoa parties.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re:  Gifts","postDate":"1090629092","msgId":96791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENGQjNBMkUyLUREMDgtMTFEOC05REE4LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDIwMDQwNzIxMTgwNTEzLjY2MDk3LnFtYWlsQHdlYjIwNzA4Lm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDQwNzIxMTgwNTEzLjY2MDk3LnFtYWlsQHdlYjIwNzA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":96740,"nextInTopic":96795,"prevInTime":96790,"nextInTime":96792,"topicId":96383,"numMessagesInTopic":0,"msgSnippet":"Ali - I think that what that was about was about parents telling grandparents NOT to give gifts - saying that it is in the nature of grandparency to want to","messageBody":"<div id=\"ygrps-yiv-1945962518\">Ali - I think that what that was about was about parents telling <br/>\ngrandparents NOT to give gifts - saying that it is in the nature of <br/>\ngrandparency to want to give gifts and that is how it should be - it is <br/>\nnormal and nice and wonderful and a parent shouldn&#39;t try to thwart it <br/>\njust because the grandparents are spending too much money/giving too <br/>\nmany gifts.<br/>\n<br/>\nIn fact, giving gifts to children is a great pleasure, as you pointed <br/>\nout. And a wonderful grandparent/child relationship should include the <br/>\ngrandparents joyfully  giving gifts - assuming they can do that within <br/>\ntheir means and at their discretion and the children graciously and <br/>\ngratefully accepting them. Doesn&#39;t have to be purchased gifts, of <br/>\ncourse. My mom had her grandchildren over for a &quot;cocoa party,&quot; one kid <br/>\nat a time, on a regular basis. They&#39;d have cookies and cocoa on a tray <br/>\nand the child would light a candle and they&#39;d have nice music playing. <br/>\nAnd they&#39;d just eat, sip cocoa, and talk. That&#39;s it. But THAT is the <br/>\nthing that all the grandchildren remember most about her. She also took <br/>\neach of them on a BIG trip as they got old enough - Zac to Hawaii, Alex <br/>\nto the Bahamas, Becky to Mexico, Roxana to London, Roya and Shelley <br/>\ntogether to Mexico. Rosie and Joe were both too young when my mom died <br/>\nand never got to take on an extended trip - but Rosie went with Grandma <br/>\non the train to San Diego for a one-night vacation.  The other kids had <br/>\nall gotten that trip when they were younger, too.<br/>\n<br/>\nBut - like I said - the BIG memory that stands out more than any other <br/>\n- the cocoa parties.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 21, 2004, at 11:05 AM, Ali Kat wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; &quot;&quot;&quot;&quot;&quot;Grandparents SHOULD give gifts, imo. They, as a rule, have more<br/>\n&gt; disposable  income and can give bigger and more practical gifts than <br/>\n&gt; the parents<br/>\n&gt; often can. Asking them to give NO gifts to their grandchildren is <br/>\n&gt; creepy.<br/>\n&gt; Asking *anyone* to give no gifts to children is creepy.&quot;&quot;&quot;&quot;&quot;&quot;<br/>\n&gt;<br/>\n&gt; I do NOT like to be told that I SHOULD give a gift because of either <br/>\n&gt; my familial relationship or my financial (or perceived financial) <br/>\n&gt; status.  I give gifts because I WANT to, because I care for and love <br/>\n&gt; someone, and because I love the joy I receive in seeing the <br/>\n&gt; recipient&#39;s reaction.<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations. </span></blockquote></div>","specialLinks":[]},{"userId":184936771,"authorName":"Ali Kat","from":"Ali Kat &lt;sweetgypsiedncer@...&gt;","profile":"sweetgypsiedncer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  Gifts","postDate":"1090433113","msgId":96740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzIxMTgwNTEzLjY2MDk3LnFtYWlsQHdlYjIwNzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwOTAzNDY1NzEuNzIzMy42MzM3MS5tMjVAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":96383,"nextInTopic":96791,"prevInTime":96739,"nextInTime":96741,"topicId":96383,"numMessagesInTopic":0,"msgSnippet":"Grandparents SHOULD give gifts, imo. They, as a rule, have more disposable  income and can give bigger and more practical gifts than the parents often","messageBody":"<div id=\"ygrps-yiv-337401723\">&quot;&quot;&quot;&quot;&quot;Grandparents SHOULD give gifts, imo. They, as a rule, have more <br/>\ndisposable  income and can give bigger and more practical gifts than the parents  <br/>\noften can. Asking them to give NO gifts to their grandchildren is creepy.  <br/>\nAsking *anyone* to give no gifts to children is creepy.&quot;&quot;&quot;&quot;&quot;&quot;<br/>\n <br/>\nI do NOT like to be told that I SHOULD give a gift because of either my familial relationship or my financial (or perceived financial) status.  I give gifts because I WANT to, because I care for and love someone, and because I love the joy I receive in seeing the recipient&#39;s reaction.  If I want to give someone a gift and don&#39;t know what to get, then I ask.  Otherwise, I glean what I can from knowing the person, check to make sure he/she doesn&#39;t have duplicates, and pick something they would hopefully enjoy.  <br/>\n<br/>\nI know plenty of folks who are grandparents and cannot afford a box of crayons let alone a large/expensive gift. I believe it is a parents responsibility to model gracious acceptance of gifts - big or small - and to foster an attitude that does not expect gifts.  (what if someone can&#39;t give a gift... they feel horrible, and knowing it is expected can make it more of a burden)  Sometimes an unexpected gift is more precious than any &quot;should give&quot; gift (i.e.  a card with a sheet of stickers in it, a favorite candy you haven&#39;t had in a while, a plate of your favorite home-baked cookies).  <br/>\n<br/>\nFocusing on fostering relationships with family and friends instead seems more important than what one should/could/would receive as a gift , IMO, but that could be me.  I do believe that you can tactfully mention the child&#39;s interests and wants through your conversations with family, and when asked be blatantly open about the child&#39;s wants.  Also, I  just accept that some folks are going to send a gift that is totally out of touch with the recipient - i.e. Aunt Sue&#39;s hideous purple and orange polka dot sweaters every Christmas.  I smile and go on with life...  I know some of this may be hard for a child, but it can be good too.  I have learned a lot about folks by what they give, and have learned a deeper appreciation for who &quot;they&quot; are and how they are trying to share a bit of themselves with me.  <br/>\n<br/>\nAli<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail is new and improved - Check it out!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":98863955,"authorName":"Heather Hall","from":"Heather Hall &lt;Heatherette@...&gt;","profile":"harrietsmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Gifts","postDate":"1090115982","msgId":96383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMUY1MUNFLjUwOTclaGVhdGhlcmV0dGVAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDEwOTAxMDk2NDAuMzE3MS40MTEyNi5tMUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":96740,"prevInTime":96382,"nextInTime":96384,"topicId":96383,"numMessagesInTopic":0,"msgSnippet":"... Maybe that is part of the difference - we don t really have family close by. My mom sends money, and dh s mom always sends something made of vinyl or that","messageBody":"<div id=\"ygrps-yiv-2128133719\"><blockquote><span title=\"ireply\">&gt; I can only imagine if I&#39;d told my mother not to buy toys for her<br/>\n&gt; beloved grandchildren. The things she gave them are so valuable now -<br/>\n&gt; not in dollar terms, but because they no longer have HER here and the<br/>\n&gt; &quot;mere things&quot; are the concrete way they hold her close them to them.<br/>\n<br/>\n </span></blockquote>Maybe that is part of the difference - we don&#39;t really have family close by.<br/>\nMy mom sends money, and dh&#39;s mom always sends something made of vinyl or<br/>\nthat comes in vinyl packaging which has to go straight in the garage or my<br/>\nthroat closes up.  Not much of anything we get would be sentimental.  I<br/>\nstill have a ton of stuff from my own childhood, like my cloth doll<br/>\ncollection that I share with the kids a piece at a time.  My aunt has<br/>\nrecently started sending little things, but they are random as she is<br/>\nthinking of the kids rather than for an event which is really nice in a<br/>\ndifferent way.<br/>\n<br/>\n-- <br/>\nHeather, mom to<br/>\nHarriet 12.15.99<br/>\nCrispin 01.25.02<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherette@...\">heatherette@...</a></div>","specialLinks":[]}],"prevTopicId":48970,"nextTopicId":96826}}