{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":28,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Building Trust","postDate":"1257004554","msgId":48217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCODVBMTlGLUEyMTYtNDJFNC05NTlFLUIwRDQ1QUMzNDQ3NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFNOVDEwOC1XMjZBQkQyMjJBMjU0NDc5OEM2OURGM0U0QjUwQHBoeC5nYmw+","referencesHeader":"PGhhb3NsaStxZGxxQGVHcm91cHMuY29tPiA8U05UMTA4LVcyNkFCRDIyMkEyNTQ0Nzk4QzY5REYzRTRCNTBAcGh4LmdibD4="},"prevInTopic":48216,"nextInTopic":0,"prevInTime":48216,"nextInTime":48218,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"-=-I still have to work at it. But I feel hopeful, reading about parenting peacefully is like a drug=- Are you doing the breathing though? ","messageBody":"<div id=\"ygrps-yiv-853497040\">-=-I still have to work at it. But I feel hopeful, reading about  <br/>\nparenting peacefully is like a drug=-<br/>\n<br/>\nAre you doing the breathing though?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<br/>\nI&#39;m guessing that getting outside and riding the bike is getting  <br/>\noxygen into you and helping dissipate adrenaline, but you could  <br/>\nbreathe then and there in ways that would help you calm down without  <br/>\nhaving to leave.<br/>\n<br/>\nIf your outing is the goal or the cure, you might be extra short- <br/>\ntempered while you&#39;re waiting.  If you see that as the thing that will  <br/>\ncalm you, instead of considering it might be the breathing itself,  <br/>\nyou&#39;re potentially a danger to yourself an others (low level, but  <br/>\nstill...)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337736493,"authorName":"Anne Mills","from":"Anne Mills &lt;anne-mills@...&gt;","profile":"aberruyermills","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Building Trust","postDate":"1257002763","msgId":48216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwOC1XMjZBQkQyMjJBMjU0NDc5OEM2OURGM0U0QjUwQHBoeC5nYmw+","inReplyToHeader":"PDEyNTc5NC42NzkwNy5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGhhb3NsaStxZGxxQGVHcm91cHMuY29tPg=="},"prevInTopic":47996,"nextInTopic":48217,"prevInTime":48215,"nextInTime":48217,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"I feel like framing this one :-))Lately my switch is going off too many times. I have decided to fit more bike rides or little walks during the day, before","messageBody":"<div id=\"ygrps-yiv-458187759\">I feel like framing this one :-))Lately my switch is going off too many times. I have decided to fit more bike rides or little walks during the day, before getting to &#39;&#39;up tight&quot; and after significant period of focus with the children and Martin (my husband).<br/>\nI felt horrible at first taking a break outside so I would wait too long and delay something that brought my serotonine up in some ways.<br/>\nBut more importandly I enjoyed my days more. Knowing that i knew better what options i had to free myself from the dragon...<br/>\nI still have to work at it. But I feel hopeful, reading about parenting peacefully is like a drug. I can&#39;t stop returning to those stories and dream about achieving a certain &#39;&#39;art de vivre&#39;&#39;.<br/>\n<br/>\nAnne  <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a><br/>\nDate: Sat, 10 Oct 2009 09:01:23 +0000<br/>\nSubject: Re: [AlwaysLearning] Building Trust<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n                  Is there a pattern to the difficult days? Are you busier and more likely to forget to eat, are you more tired? Can you feel the tension building? If you can are there things you can do to alleviate it? Watch a movie, go through a drive in and get some food, do something slower for a bit. <br/>\n<br/>\n<br/>\n<br/>\nI started out spanking. I spanked until Simon was 5 and Linnaea was 2. Spanking was all about my way and my frustration and my inability to seek out a different way. It was amazing when I stopped. It was hard not to turn to the quick solution that never solved anything and left everyone upset, me included, me, maybe the most. But it was amazing to have to expand into the vacuum left by not having that blunt tool in my toolbox. Both Simon and Linnaea grew to trust me. It took less time than I expected. They didn&#39;t want to think of me as a bad mom, it was easy to rewrite myself as a no-longer-hitting mom than I expected. <br/>\n<br/>\n<br/>\n<br/>\nTwo days ago I got irritated at David. And I raged at him for about 1/2 second and I stopped. I breathed and I apologized and it was gone. There is no way that I could have done that when Simon and Linnaea were little, not because of them, but because I hadn&#39;t taken the small steps to get from where I was to where I am. It took recognizing that what I wanted from them and what they gave didn&#39;t have to be different things. It took more and more seeing how much I enjoyed them and being with them and all that they did. As a side note, when I feel myself getting annoyed I find it helps a lot to just hang out more with them and appreciate them all over again.  It took seeing that I didn&#39;t need to get to the end of a tirade to apologize for it. I could stop midstream. It took using Ronnie Maier&#39;s rewind and do-over requests and having two children who had the generosity to give me those momentary reprieves. It took doing better each time. It took looking at<br/>\n<br/>\n the toll not doing better took. Simon would ball up and get smaller and smaller. Linnaea would rage back and scream and defend. Nobody heard what I was saying anyhow. My raging, my approach to problems didn&#39;t help anything. <br/>\n<br/>\n<br/>\n<br/>\nI can remember talking about it, thinkiing about it, it was like a switch I could feel turning. I went from calm and in control to *switch* furious in no time at all. And I couldn&#39;t figure out how to not turn the switch on, to make the switch a thoughtful process. When it flipped the other day I felt it go and I stepped away and I turned it off. Most days I stop long before the switch goes. The thoughtful process was recognizing the grumpiness earlier in the day. Feeling a shortness that isn&#39;t normally there and doing things to respond to that like going for a quick breath outside or having a chocolate milk or a chai latte or something else that just ups my energy budget a bit. Taking 5 minutes to close my eyes and be still helps, too. Whatever works for you to buffer yourself is good, come up with lots of little things. With an almost 4 year old little things and little moments are what you are most likely going to get. <br/>\n<br/>\n<br/>\n<br/>\nt helps a lot to try for better moments not days. Don&#39;t judge a day by one upset, judge it as a bad moment and move forward. A little bit better each moment. A little bit more aware. <br/>\n<br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\nFrom: Emily S &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:saturnfire16@...\">saturnfire16@...</a>&gt;<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n<br/>\nSent: Saturday, 10 October, 2009 3:48:18<br/>\n<br/>\nSubject: [AlwaysLearning] Building Trust<br/>\n<br/>\n<br/>\n<br/>\nMy name is Emily, and this is my reintroduction to the group.  I was here for a while (a year maybe?) and then I left.  I was spending too much time reading about unschooling and not spending enough time with my kids.  I&#39;m doing better with that, and I needed to come back to ask some questions.<br/>\n<br/>\n<br/>\n<br/>\nHere&#39;s some background:<br/>\n<br/>\n<br/>\n<br/>\nMy daughter, Ezabella, is almost 4.  I started out spanking (swatting her hand when she was about 18 months) and did timeouts.  I stopped both when she was 2 (spanking and timeouts for a 2 year old!  Terrible, but that&#39;s all I knew to do.  I couldn&#39;t imagine doing that now.)  I&#39;m firmly against spanking and all punishments now, but there have been a few times in the last year where I hit her out of frustration.  One time she smacked me in the face, so I smacked her back.  Each time I *immediately* realized what I had done and appoligized profusely.  <br/>\n<br/>\n<br/>\n<br/>\nI&#39;m getting better all the time about handling my anger.  I&#39;m using meditation, lots of prayer and other things to help me work through my own issues so I can be a better mom.  <br/>\n<br/>\n<br/>\n<br/>\nSo, here&#39;s my question- after screwing up so much in her short life, how do I rebuild trust?  I always apologize when I yell or handle things badly.  We don&#39;t have arbitrary restrictions- food, tv, bedtime (I slowly let those things go, thanks to this list).    <br/>\n<br/>\n<br/>\n<br/>\nIntellectually, I know what I want to do.  What kind of parent I want to be.  I want to be her partner.  I want to help get her needs met.  I want her to trust me.  But I feel like I lack creative problem solving skills and sometimes I just want things *my way.*  It&#39;s like I get stuck and can&#39;t see past my own wants.<br/>\n<br/>\n<br/>\n<br/>\nSome days I hit this awesome groove where I&#39;m flexible and creative and kind and helpful.  And other days..... not so much.        <br/>\n<br/>\n<br/>\n<br/>\nWill it just take more time of practice, fail, practice, fail, before I start to feel like I&#39;m succeeding at this and she trusts me again?  Any suggestions of things I can do (or not do) to build trust?  <br/>\n<br/>\n<br/>\n<br/>\nA few people on this list- Jenny Cyphers and some others who may not be as active here- have seen Ezabella and I together.  Any observations that might help?<br/>\n<br/>\n<br/>\n<br/>\n(I know my kids are little and maybe we aren&#39;t *really* unschooling yet, but I&#39;m asking here because I appreciate the honesty and clarity of thought on this list).  <br/>\n<br/>\n<br/>\n<br/>\nEmily        <br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      <br/>\n<br/>\n    <br/>\n    <br/>\n\t<br/>\n\t<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t \t\t \t   \t\t  <br/>\n_________________________________________________________________<br/>\nNouveau! Découvrez le Windows phone Samsung Omnia II disponible chez SFR. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/FRM/go/175819072/direct/01/\">http://clk.atdmt.com/FRM/go/175819072/direct/01/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255563190","msgId":47996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhiNW4zbSt1NW83QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdhMDlmNDFmMDkxMDE0MDc1NHM5ZTJmMmIxZ2Y2NWMxMGYwM2ZhNjQyZTlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":47979,"nextInTopic":48216,"prevInTime":47995,"nextInTime":47997,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... Yes I did.  I think it s important to speak for my children when they cannot for whatever reason.  My dd did email her friends but they just didn t write","messageBody":"<div id=\"ygrps-yiv-1946132342\"><blockquote><span title=\"ireply\">&gt; Did you invite the girls to visit you? Have you had an opportunity<br/>\n&gt; to talk with the moms and find out what&#39;s going on?<br/>\n<br/>\n </span></blockquote>Yes I did.  I think it&#39;s important to speak for my children when they cannot for whatever reason.  My dd did email her friends but they just didn&#39;t write back.  After a month or so, I finally emailed the mom I knew longer asking if there was anything we could talk about.  She sent me a nice response that said her dd just decided she didn&#39;t want to hang out with Allie anymore and that she couldn&#39;t make her dd be with my dd.  I totally understood that part, but I didn&#39;t find out why.  It was just left so unresolved.  The more I thought about it, I understood it wasn&#39;t her responsibility to provide an explanation about the situation.  She was being protective of her dd.  It just sucks to be on the other side.<br/>\n<br/>\nI think it can be hard for any child to make friends, not just unschoolers or homeschoolers.  I have learned to be proactive in getting her around other people.  We&#39;ve found lots of things to do and have met some nice people.  Too bad that the children she&#39;s met are either in public school and have limited schedules, or homeschoolers with busy schedules.  Still, we keep busy.  <br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Building Trust","postDate":"1255532931","msgId":47979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGRjZBQ0FBLTU3NDgtNDExMy04NEY1LUFBMDlGNjhDMDRFOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDdhMDlmNDFmMDkxMDE0MDc1NHM5ZTJmMmIxZ2Y2NWMxMGYwM2ZhNjQyZTlAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGhiMzlxdCtuNWp1QGVHcm91cHMuY29tPiA8aGI0bXNqK3YybDdAZUdyb3Vwcy5jb20+IDw3YTA5ZjQxZjA5MTAxNDA3NTRzOWUyZjJiMWdmNjVjMTBmMDNmYTY0MmU5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":47977,"nextInTopic":47996,"prevInTime":47978,"nextInTime":47980,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"-=-Allie (11) is such a social butterfly and is so eager to be friends, that she comes on too strongly.-=- Kirby had a tendency to hog the room, even at","messageBody":"<div id=\"ygrps-yiv-1185582321\">-=-Allie (11) is such a social butterfly and is so eager to be friends,<br/>\nthat she comes on too strongly.-=-<br/>\n<br/>\nKirby had a tendency to hog the room, even at someone else&#39;s birthday  <br/>\nparty.  He&#39;s an attention getter, and others often forgave him  <br/>\nentirely and were amused by things that mortified me.<br/>\n<br/>\nI used to coach him, when it wasn&#39;t his party or his birthday, or if  <br/>\nthere were other kids there I knew were undecided about whether to  <br/>\ncome back (to a playgroup or a regular gaming night or whatever), to  <br/>\nshare the attention.   This is what I said:<br/>\n<br/>\n&quot;Don&#39;t use more than your share of the oxygen.&quot;<br/>\n<br/>\nHe had the ability, and still has, to draw the attention to himself  <br/>\nand to be charming.  And that can be entertaining, and useful in a  <br/>\nmanagement/teacher context.  He was pretty good with the talent show  <br/>\nat Good Vibrations (he did most of the MCing).   He won a big Guitar  <br/>\nHero contest at a company party at a hotel, mostly on style and courage.<br/>\n<br/>\nWhat was good about the situation with Kirby was that in addition to  <br/>\nhis ability to steal all the air and attention, he also had the  <br/>\nability, awareness and compassion to consciously share it, or give  <br/>\nsomeone else the spotlight.  If a child has the ability to get  <br/>\nattention, he probably can also focus it on another person, or share  <br/>\nit out.   Coaching a social kid in ways like that is similar to  <br/>\ncoaching a jock kid about stretching and drinking water, or a musical  <br/>\nkid on not leaving wooden instruments in the trunk of the car.   It&#39;s  <br/>\nsomething crucial that they might not think of on their own, but that  <br/>\nthey&#39;ll understand and use to great effect with just a little help.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":383312070,"authorName":"Cara Barlow","from":"Cara Barlow &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Building Trust","postDate":"1255532073","msgId":47977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdhMDlmNDFmMDkxMDE0MDc1NHM5ZTJmMmIxZ2Y2NWMxMGYwM2ZhNjQyZTlAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGhiNG1zait2Mmw3QGVHcm91cHMuY29tPg==","referencesHeader":"PGhiMzlxdCtuNWp1QGVHcm91cHMuY29tPiA8aGI0bXNqK3YybDdAZUdyb3Vwcy5jb20+"},"prevInTopic":47976,"nextInTopic":47979,"prevInTime":47976,"nextInTime":47978,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":" I coach my kids prior to going out if I think they","messageBody":"<div id=\"ygrps-yiv-1968025034\">&lt;&lt;&lt; Allie (11) is such a social butterfly and is so eager to be friends,<br/>\nthat she comes on too strongly.&gt;&gt;&gt;<br/>\n<br/>\nI coach my kids prior to going out if I think they are going to have<br/>\nproblems navigating socially. We talk about what might happen and how to<br/>\nrespond. If I observe them making a social gaffe, depending on the situation<br/>\nI may redirect what they&#39;re doing and/ or I&#39;ll talk with them about it later<br/>\nin private.<br/>\n<br/>\n&lt;&lt;&lt;She is still hurt by trying to be friends with two unschoolers last year.<br/>\nThese two girls were close friends before one of the families moved to our<br/>\nstate, and I think they just didn&#39;t need or want a third girl in their lives<br/>\nonce they were able to hang out daily. Unfortunately, Allie was dropped<br/>\ncompletely with no explanations. No more emails, no more visits.&gt;&gt;&gt;<br/>\n<br/>\nDid you invite the girls to visit you? Have you had an opportunity to talk<br/>\nwith the moms and find out what&#39;s going on? It may have nothing to do with<br/>\nyour daughter.<br/>\n<br/>\nBest wishes, Cara B<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Building Trust","postDate":"1255530737","msgId":47976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyMTM2MUQ5LUIzRUEtNDg0QS1CNDEyLTY0NEFCN0M1OTZGOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDdDMjFGOEU4QTlDMTRBNkI4MTc2RjA5QjdEQTM3MDIzQFJvYnluUEM+","referencesHeader":"PGhiMzlxdCtuNWp1QGVHcm91cHMuY29tPiA8QkNGRDNDMzktMzI5MC00NEI1LTlDNkMtQTQ2QTU3ODE0MTVGQFNhbmRyYWRvZGQuY29tPiA8N0MyMUY4RThBOUMxNEE2QjgxNzZGMDlCN0RBMzcwMjNAUm9ieW5QQz4="},"prevInTopic":47974,"nextInTopic":47977,"prevInTime":47975,"nextInTime":47977,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"-=-. I think it might be better to take the host mom aside, given some of the variables Sandra mentioned (like pretty frocks etc) being compatible with the","messageBody":"<div id=\"ygrps-yiv-1382736714\">-=-. I think it might be better to take the host mom aside, given<br/>\nsome of the variables Sandra mentioned (like pretty frocks etc) being<br/>\ncompatible with the activity, and ask her privately whether it would  <br/>\nbe ok<br/>\nto ask for (eg) some painting stuff, with the clear proviso that  <br/>\nyou&#39;re fine<br/>\nwith her &quot;no&quot;. Then you have better knowledge with which to guide your<br/>\nchild.-=-<br/>\n<br/>\nI agree.  I wouldn&#39;t mind saying no to a mom, and at that point we  <br/>\ncould make a deal, like &quot;after pretty-frock family goes home, we can&quot;  <br/>\nor I could give them paints and paper to take home, because I&#39;m still  <br/>\nworking through paper I was given when a print shop I had worked in  <br/>\nclosed in the late 1980&#39;s.<br/>\n<br/>\nFor a parent to send a kid to ask directly, knowing or hoping the  <br/>\nother parent will &quot;be nice&quot; and not say no can be a very low move.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255530195","msgId":47974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhiNG1zait2Mmw3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhiMzlxdCtuNWp1QGVHcm91cHMuY29tPg=="},"prevInTopic":47973,"nextInTopic":47976,"prevInTime":47973,"nextInTime":47975,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"About the way to act when hanging out with others: I need help on this as well.  Allie (11) is such a social butterfly and is so eager to be friends, that she","messageBody":"<div id=\"ygrps-yiv-711977419\">About the way to act when hanging out with others:<br/>\n<br/>\nI need help on this as well.  Allie (11) is such a social butterfly and is so eager to be friends, that she comes on too strongly.  She is still hurt by trying to be friends with two unschooers last year.  These two girls were close friends before one of the families moved to our state, and I think they just didn&#39;t need or want a third girl in their lives once they were able to hang out daily.  Unfortunately, Allie was dropped completely with no explanations.  No more emails, no more visits.  As she has carried this hurt for so long, she&#39;s asked me what is wrong with her many times.  I try to comfort and reassure her she is a super great person.  And she is!  She has an assertive, vivacious personality that is just maybe too much at her age?<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":129999023,"authorName":"fourslaterz","from":"&quot;fourslaterz&quot; &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255524694","msgId":47973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhiNGhnbSs3cmJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJDRkQzQzM5LTMyOTAtNDRCNS05QzZDLUE0NkE1NzgxNDE1RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47972,"nextInTopic":47974,"prevInTime":47972,"nextInTime":47974,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... **** I might indicate an interest without asking.  For example:  If your dd wants to paint, you might ask the host mom if she will bring her kids to your","messageBody":"<div id=\"ygrps-yiv-617265194\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; -=So, from people who are more outgoing in that way- at what point is  <br/>\n&gt; it rude? When you&#39;re at someone&#39;s house and your child wants to do  <br/>\n&gt; this and then that and the other would you help them ask for  <br/>\n&gt; everything? Or if it did feel like it was getting rude, how would you  <br/>\n&gt; provide that information without backhandedly saying no?-=-<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>****<br/>\nI might indicate an interest without asking.  For example:  If your dd wants to paint, you might ask the host mom if she will bring her kids to your house to paint soon.  Which then leaves her to say &quot;yes&quot;, &quot;we are going on vacation&quot;, or &quot;would you like to paint today&quot;.  If your dd likes their easel, you can ask where they bought it.  The answer can be &quot;toys r us&quot; or &quot;would you like to use it&quot;.  <br/>\n<br/>\nYou are still not giving your dd exactly what she wants now, but it lets you feel out the situation without putting the mom on the spot. And your dd will feel heard. <br/>\n<br/>\nIn our case, it is almost always movies that Eli wants to watch.  That is one of the reasons we have Netflix.  I can always offer to get the movie/show for him in the next few days.  It is not quite as good as now, but he knows he can watch it soon.<br/>\n<br/>\nAnd if my child was constantly asking for other things, I would ask if they would rather go home.  <br/>\n<br/>\nAmanda<br/>\nEli 8, Samuel 6</div>","specialLinks":[]},{"userId":383312070,"authorName":"Cara Barlow","from":"Cara Barlow &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Building Trust","postDate":"1255521306","msgId":47972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdhMDlmNDFmMDkxMDE0MDQ1NWwxZWExYzBlN2k2OThkN2RlMTE3YjZmMjkyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDdDMjFGOEU4QTlDMTRBNkI4MTc2RjA5QjdEQTM3MDIzQFJvYnluUEM+","referencesHeader":"PGhiMzlxdCtuNWp1QGVHcm91cHMuY29tPgkgPEJDRkQzQzM5LTMyOTAtNDRCNS05QzZDLUE0NkE1NzgxNDE1RkBTYW5kcmFkb2RkLmNvbT4JIDw3QzIxRjhFOEE5QzE0QTZCODE3NkYwOUI3REEzNzAyM0BSb2J5blBDPg=="},"prevInTopic":47969,"nextInTopic":47973,"prevInTime":47971,"nextInTime":47973,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":" This situation happens to","messageBody":"<div id=\"ygrps-yiv-1618993764\">&lt;&lt;&lt;&quot;I think we&#39;re going to do thus and such today instead - but maybe we can<br/>\nmake a playdate to do that specifically next time.&quot;&gt;&gt;&gt;<br/>\n<br/>\nThis situation happens to me fairly often - my younger daughter (11yo) has a<br/>\nfew friends that always bring up another activity, usually complicated, and<br/>\nthey often want to do it right before they leave. Or when their parent comes<br/>\nto pick them up the friend begs to be allowed to stay overnight (even though<br/>\nthat&#39;s never come up in the conversation before).<br/>\nI always suggest that since we can&#39;t do that activity right now or they<br/>\ncan&#39;t stay overnight because we have other plans, that we will arrange a<br/>\ntime for them to return and do the activity or stay overnight. We know these<br/>\nfamilies well, and the kids know that yes, they&#39;ll be back.<br/>\n<br/>\nWhen kids or parents are over that I don&#39;t know well, and I feel like they<br/>\nare making unrealistic demands on me or my children and creating an unhappy<br/>\nsituation, I just don&#39;t invite them back.  One of the beauties, for me, of<br/>\nhomeschooling is that we *do* get to choose who we spend our time with.<br/>\n<br/>\nBest wishes, Cara B<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Building Trust","postDate":"1255495188","msgId":47969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDMjFGOEU4QTlDMTRBNkI4MTc2RjA5QjdEQTM3MDIzQFJvYnluUEM+","inReplyToHeader":"PEJDRkQzQzM5LTMyOTAtNDRCNS05QzZDLUE0NkE1NzgxNDE1RkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhiMzlxdCtuNWp1QGVHcm91cHMuY29tPiA8QkNGRDNDMzktMzI5MC00NEI1LTlDNkMtQTQ2QTU3ODE0MTVGQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":47968,"nextInTopic":47972,"prevInTime":47968,"nextInTime":47970,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"This is an interesting thread. So much depends on the prior relationships and the situation. For me, I tend to be overly protective of other people,","messageBody":"<div id=\"ygrps-yiv-424669443\">This is an interesting thread. So much depends on the prior relationships <br/>\nand the situation.<br/>\n<br/>\nFor me, I tend to be overly protective of other people, excessively <br/>\nconservative in my predictions of what they might be willing to consider.<br/>\n<br/>\nAt the same time even I have my limits of what I will be happy to accept in <br/>\nterms of requests from other kids when they are visiting. I sometimes find <br/>\nit hard because I have conflicting mental tapes going on.<br/>\n<br/>\nOn one hand there is &quot;they are guests and should have their way&quot; in my mind <br/>\nfrom  my own childhood.<br/>\n<br/>\nOn the other hand I have &quot;they are here to play with Jayn not treat our <br/>\nhouse like an amusement park&quot; - eg one girl basically refusing to get out of <br/>\nthe pool and play another game while Jayn stands around gradually getting <br/>\nmore frustrated because she wants to move on from pool play after a couple <br/>\nof hours.<br/>\n<br/>\nPlus sometimes it is a bit hard to have a child seeing dh&#39;s last Hawaiian <br/>\nPunch in the fridge and wanting that instead of the juice boxes or whatever <br/>\nelse I have already offered. I usually say &quot;well that&#39;s Jayn&#39;s Daddy&#39;s&quot;. <br/>\nThen once I got told &quot;he should share&quot;.(!)<br/>\n<br/>\nThen other kids laugh with delight when I come over and hold out my hand for <br/>\ntheir candy wrappers to throw away for them, because they have to get up and <br/>\nput them in the bin themselves at home, or I say &quot;just leave it&quot; about their <br/>\nglasses and dishes so they can play more and I&#39;ll collect them later.<br/>\n<br/>\nSo it&#39;s all a balance between being courteous hosts and then having guests <br/>\nnot expecting the whole world from me.<br/>\n<br/>\nI don&#39;t know. I think it might be better to take the host mom aside, given <br/>\nsome of the variables Sandra mentioned (like pretty frocks etc) being <br/>\ncompatible with the activity, and ask her privately whether it would be ok <br/>\nto ask for (eg) some painting stuff, with the clear proviso that you&#39;re fine <br/>\nwith her &quot;no&quot;. Then you have better knowledge with which to guide your <br/>\nchild.<br/>\n<br/>\n&quot;I think we&#39;re going to do thus and such today instead - but maybe we can <br/>\nmake a playdate to do that specifically next time.&quot;<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Building Trust","postDate":"1255487924","msgId":47968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRkQzQzM5LTMyOTAtNDRCNS05QzZDLUE0NkE1NzgxNDE1RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhiMzlxdCtuNWp1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhiMzlxdCtuNWp1QGVHcm91cHMuY29tPg=="},"prevInTopic":47967,"nextInTopic":47969,"prevInTime":47967,"nextInTime":47969,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"-=-That was no . You didn t say the word, but you effectively said no . She s not yet 4! When we get home is AGES and AGES away, it doesn t exist. Not","messageBody":"<div id=\"ygrps-yiv-1736022893\">-=-That was &quot;no&quot;. You didn&#39;t say the word, but you effectively said  <br/>\n&quot;no&quot;. She&#39;s not<br/>\nyet 4! &quot;When we get home&quot; is AGES and AGES away, it doesn&#39;t exist.  <br/>\n&quot;Not saying<br/>\nno&quot; doesn&#39;t mean finding kinder and gentler words to use to mean &quot;no&quot;,  <br/>\nit means<br/>\nsaying &quot;yes&quot; as often as is possible.-=-<br/>\n<br/>\nYES!  At your own house.  Not at my house.<br/>\n<br/>\n-=-I&#39;ve always taken the attitude that there&#39;s no harm in asking - it  <br/>\nused to make<br/>\nmy ex-husband VERY uncomfortable, but I found most people are  <br/>\nperfectly willing<br/>\nand able to make their own choices about what they will or won&#39;t do  <br/>\nwith or for<br/>\nmy boys - I don&#39;t need to say &quot;no&quot; first to avoid imagined discomfort.- <br/>\n=-<br/>\n<br/>\nHere&#39;s the harm:  Those people might be &quot;perfectly willing&quot; to say yes  <br/>\nor no to your boys, but why would you put them in a position to say no  <br/>\nto your boys?  And to feel bad about it?<br/>\nHere&#39;s why:  So you the mom can be &quot;the good guy&quot; and have said yes.<br/>\n<br/>\nIt&#39;s one thing to say yes to your children and to visiting children,  <br/>\nbut to encourage your kids to put other people (especially those who  <br/>\nhave invited you generously into their homes) to either agree to  <br/>\nsomething they don&#39;t want to, or to say &quot;no&quot; to a child who might cry  <br/>\nor think they&#39;re mean, you&#39;re not being a very good guest.<br/>\n<br/>\n-=So, from people who are more outgoing in that way- at what point is  <br/>\nit rude? When you&#39;re at someone&#39;s house and your child wants to do  <br/>\nthis and then that and the other would you help them ask for  <br/>\neverything? Or if it did feel like it was getting rude, how would you  <br/>\nprovide that information without backhandedly saying no?-=-<br/>\n<br/>\nIf someone is at my house, especially if there are lots of kids, and  <br/>\nif I don&#39;t know their kids very well and the situation is already  <br/>\npotentially stressful and some parents have to leave soon, or  <br/>\nsomeone&#39;s wearing really nice clothes, or I need to get everyone happy  <br/>\nand then gone because I have another thing I need to do an hour  <br/>\nafterwards, someone asking me if I would get out paint or playdough or  <br/>\nwater guns wouldn&#39;t be a good idea.<br/>\n<br/>\nIf one family is over, they know me very well, they know I have water  <br/>\nguns or paints, and I know their kids and trust them, that&#39;s a whole  <br/>\nentire different deal.<br/>\n<br/>\nThe harm in asking is the loss of friendships, and the possibility of  <br/>\nsetting your kids up to think that other people are meaner than you  <br/>\nare when actually, in that situation, you-the-mom might have been  <br/>\ncreating stress and being less courteous than you could have been.<br/>\n<br/>\nI could walk up to any of you in your own home and ask to borrow  <br/>\n$50.   Is there any harm in asking?  You might be willing and able to  <br/>\nmake your own choices about what you will or won&#39;t do for me.   Or  <br/>\nwhat if I sent Holly instead?  If she said to me, quietly, when we&#39;re  <br/>\nat someone else&#39;s house, &quot;Do you think they would give me $50?&quot;  I  <br/>\ncould say &quot;That&#39;s not a good idea,&quot; or I could ask, but if I say  <br/>\n&quot;There&#39;s no harm in asking&quot; I think that&#39;s harmful to the example I  <br/>\nwould be setting, to the friendship, and to the way in which they see  <br/>\nHolly (if they ever see her again, I mean).<br/>\n<br/>\nTrust building involves being trustworthy.  Respect involves being  <br/>\nrespectable.<br/>\n<br/>\nPart of parenting is providing for our children.  But it&#39;s not the  <br/>\nresponsibility of other people to provide for my children.   And when  <br/>\nI&#39;m a guest, I should accept the tea or water or soda they offer and  <br/>\nsmile, and see what they want to offer for me to do with them, and not  <br/>\nsay &quot;OOH!  Let&#39;s watch a movie!&quot; or &quot;Do you have any oil paints?  Do  <br/>\nyou have an extra canvas?&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255484061","msgId":47967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhiMzlxdCtuNWp1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhiMjJuYytlc2dyQGVHcm91cHMuY29tPg=="},"prevInTopic":47965,"nextInTopic":47968,"prevInTime":47966,"nextInTime":47968,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... Thanks Caren, this is what I m having a hard time with.  I m not sure what the difference is sometimes between providing information and an underhanded way","messageBody":"<div id=\"ygrps-yiv-275259343\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;carenkh&quot; &lt;dharmamama1@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-I was gentle about it, and I didn&#39;t even say no.  I stated my reservations about asking them, but I did it kindly.[...] I don&#39;t think I say no a lot.-=- <br/>\n&gt; <br/>\n&gt; &quot;I don&#39;t think they were planning on painting since they didn&#39;t put any paints out, but we can paint when we get home.&quot;<br/>\n&gt; <br/>\n&gt; That was &quot;no&quot;. You didn&#39;t say the word, but you effectively said &quot;no&quot;. She&#39;s not yet 4! &quot;When we get home&quot; is AGES and AGES away, it doesn&#39;t exist. &quot;Not saying no&quot; doesn&#39;t mean finding kinder and gentler words to use to mean &quot;no&quot;, it means saying &quot;yes&quot; as often as is possible.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Thanks Caren, this is what I&#39;m having a hard time with.  I&#39;m not sure what the difference is sometimes between providing information and an underhanded way of saying no.  I really was trying to just provide information- this was the first time I had met them, and a lot of people wouldn&#39;t be willing to get out paints with half a dozen kids running around the house.  At home was only a &quot;mom I want to go home&quot; away.  <br/>\n<br/>\nBut this jumped out at me:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt; I don&#39;t need to say &quot;no&quot; first to avoid imagined discomfort. &lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nWhen I read that I realized that yes, it was about my comfort level.  I don&#39;t asking people for things.  Even little things- I don&#39;t like to think that I may have inconvenienced someone.  <br/>\n<br/>\nSo, from people who are more outgoing in that way- at what point is it rude?  When you&#39;re at someone&#39;s house and your child wants to do this and then that and the other would you help them ask for everything?  Or if it did feel like it was getting rude, how would you provide that information without backhandedly saying no?<br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255483393","msgId":47965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhiMzk2MSs4YnEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM1MUZDM0RBMzRCRTQ2NDg4RTYxNENCRDc4OTM3QzMzQExZTEFMQVAyPg=="},"prevInTopic":47949,"nextInTopic":47967,"prevInTime":47964,"nextInTime":47966,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... Thanks Lyla, I do think that is part of it.  She LOVES meeting new people and everyone is instantly her friend! Emily","messageBody":"<div id=\"ygrps-yiv-1441498030\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; <br/>\n&gt;   i wouldn&#39;t assume it&#39;s about you being a roadblock - or about you at all!   it might be - and it would certainly not hurt to find ways to not be like that - but my daughter ALWAYS loved meeting new people - would pick up her towel if we were at the lake and alllllll the way across the beach to find some other nice family to plop down next to. she always wanted my friends (even if she had just met them) to be the ones to hold her hand, carry her, drive her in their car. etc. &lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks Lyla, I do think that is part of it.  She LOVES meeting new people and everyone is instantly her friend!  <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":336246301,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255444012","msgId":47949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhiMjJuYytlc2dyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhiMG00cStlcmtjQGVHcm91cHMuY29tPg=="},"prevInTopic":47939,"nextInTopic":47965,"prevInTime":47948,"nextInTime":47950,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"-=-I was gentle about it, and I didn t even say no.  I stated my reservations about asking them, but I did it kindly.[...] I don t think I say no a lot.-=- I","messageBody":"<div id=\"ygrps-yiv-696079724\">-=-I was gentle about it, and I didn&#39;t even say no.  I stated my reservations about asking them, but I did it kindly.[...] I don&#39;t think I say no a lot.-=- <br/>\n<br/>\n&quot;I don&#39;t think they were planning on painting since they didn&#39;t put any paints out, but we can paint when we get home.&quot;<br/>\n<br/>\nThat was &quot;no&quot;. You didn&#39;t say the word, but you effectively said &quot;no&quot;. She&#39;s not yet 4! &quot;When we get home&quot; is AGES and AGES away, it doesn&#39;t exist. &quot;Not saying no&quot; doesn&#39;t mean finding kinder and gentler words to use to mean &quot;no&quot;, it means saying &quot;yes&quot; as often as is possible.<br/>\n<br/>\nI&#39;ve always taken the attitude that there&#39;s no harm in asking - it used to make my ex-husband VERY uncomfortable, but I found most people are perfectly willing and able to make their own choices about what they will or won&#39;t do with or for my boys - I don&#39;t need to say &quot;no&quot; first to avoid imagined discomfort.<br/>\n<br/>\nWish I had time to write more, but that really stuck out to me.<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255399340","msgId":47938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhiMG4zYyt2Z3JkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlBMUQzMDEwLTE3MUMtNDQ2Ni04NEIxLTUwQUYzN0JERjEwMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47904,"nextInTopic":47939,"prevInTime":47937,"nextInTime":47939,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... Yes, I like that you re consistent!   That s why I re-joined the group.  Imagine me doing the Homer Simpson DOH! when I read that and realized that you","messageBody":"<div id=\"ygrps-yiv-2066306833\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n <br/>\n&gt; -=-I posted here before and you gave me the same response about  <br/>\n&gt; scheduling failure on my calendar.-=-<br/>\n&gt; <br/>\n&gt; I hope I will respond similarly the next time someone seems to have  <br/>\n&gt; scheduled failure in advance, even if it&#39;s you again!<br/>\n<br/>\n </span></blockquote>Yes, I like that you&#39;re consistent!   That&#39;s why I re-joined the group.  Imagine me doing the Homer Simpson &quot;DOH!&quot; when I read that and realized that you had told me the same thing 6 months ago.  :)  I obviously needed to hear it again.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-Have I learned nothing?! I think I see things too black and white-  <br/>\n&gt; either I&#39;ve succeded or failed. Good mom or bad mom.-=-<br/>\n&gt; <br/>\n&gt; How could you do that if you&#39;d listened to that Peaceful Parenting  <br/>\n&gt; talk and started to make choices mindfully?  How could you not be  <br/>\n&gt; thinking &quot;better mom&quot; if you were making ten or twenty better choices  <br/>\n&gt; every day?<br/>\n<br/>\n </span></blockquote>I guess I have a really internalized sense of &quot;anything less than perfection is failure.&quot;  When I read that page or what you wrote there, it seems really obvious to me.  I can think &quot;Yah, I&#39;m a WAY better mom than I was 2 years ago or a year or 6 months ago.  And I can keep working on being even better.&quot;  But when I mess up, I forget all that.  Maybe I&#39;ll post it on my wall.....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Reading about unschooling without doing it is like reading a cookbook  <br/>\n&gt; without making any food, or reading woodworking projects books without  <br/>\n&gt; owning a saw.  The DOING is the unschooling, not the reading and the  <br/>\n&gt; thinking.  You can&#39;t just read about building trust.  You need to  <br/>\n&gt; *build* some.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Yes, and I&#39;ve been doing LOTS of doing!  I&#39;ve gone from spanking, doing time outs, freaking out about every bite of &quot;junk&quot; food, no tv, stressed and yelling all the time to not doing ANY form of punishment, no food and tv restrictions (tonight I smiled and handed her a candy at from the restaurant&#39;s candy dish and only later thought &quot;hey, I would have never done that a year ago!&quot;).  I&#39;m meditating, still nursing her at almost 4 years old, helping her discover new things every day, spending lots of time just playing and enjoying her company, and my home is much more peaceful.  <br/>\n<br/>\nI&#39;m just hoping to find more ideas of things I can do even better to have even more good moments (moments, not days, I&#39;m thinking in moments now). <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255398362","msgId":47939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhiMG00cStlcmtjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ3MjVGQzRGLUFBRjAtNEE4OC1CRDAwLTJGMjJFOTRGNzg1N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47938,"nextInTopic":47949,"prevInTime":47938,"nextInTime":47940,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... No, there was no shushing or harshness or meanness.  I was gentle about it, and I didn t even say no.  I stated my reservations about asking them, but I","messageBody":"<div id=\"ygrps-yiv-1188268249\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; If she were to ask you &quot;Do you think they would let me watch a movie?&quot;  <br/>\n&gt; would you say &quot;I don&#39;t want to ask them&quot;?<br/>\n&gt; Or if she said &quot;Do you think they would let me draw&quot; you would say &quot;If  <br/>\n&gt; they want you to draw they&#39;ll bring you a pencil and paper. shush!&quot;?<br/>\n<br/>\n </span></blockquote>No, there was no shushing or harshness or meanness.  I was gentle about it, and I didn&#39;t even say no.  I stated my reservations about asking them, but I did it kindly.  <br/>\n<br/>\n    <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Because on the one hand if you go to someone&#39;s house and they have  <br/>\n&gt; toys and projects planned it&#39;s not totally okay to ask to do other  <br/>\n&gt; kinds of things.   But if it&#39;s something pretty innocuous, it&#39;s not a  <br/>\n&gt; big deal.  I think the conversations with her about this should be  <br/>\n&gt; before you go at all, about what to expect, and how to be courteous as  <br/>\n&gt; a guest.<br/>\n&gt; If you&#39;re a mom who says no a lot, though, if she&#39;s a smart kid she&#39;ll  <br/>\n&gt; start asking other people.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>I don&#39;t think I say no a lot.  I definately say yes WAY more than any mainstream parent I know.  I don&#39;t feel like I&#39;m very creative at finding solutions, but I try.  <br/>\n<br/>\nI guess what I&#39;m struggling with is what does it sound like, what words are used, when parent provides information, states preferences, explains what to expect, without it sounding like NO or some form of NO?  <br/>\n<br/>\nSo, when I&#39;m trying to just provide useful information and say a form of yes, I say things like:<br/>\n<br/>\n&quot;I don&#39;t think they were planning on painting since they didn&#39;t put any paints out, but we can paint when we get home.&quot; or<br/>\nIf you keep playing with the toy like that it might break.  How could you play with it more gently?&quot;  <br/>\nor this one happened last night:<br/>\n&quot;I understand you really want to keep the movie for one more night.  We&#39;ve already had it for two nights, and I can&#39;t afford to keep it for another night.  I can find it for you on youtube or get it from the library.&quot;<br/>\n<br/>\nI don&#39;t know if there are things I could say that would be more helpful or work better towards finding solutions.  <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Building Trust","postDate":"1255354769","msgId":47904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlBMUQzMDEwLTE3MUMtNDQ2Ni04NEIxLTUwQUYzN0JERjEwMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhhdWIyYiszanJwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhhdWIyYiszanJwQGVHcm91cHMuY29tPg=="},"prevInTopic":47903,"nextInTopic":47938,"prevInTime":47903,"nextInTime":47905,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"-=-Maybe it wasn t there before, or just not as relevant to me before.- =- That always happens with any reading.  If someone read Oliver Twist as a kid she","messageBody":"<div id=\"ygrps-yiv-1584493373\">-=-Maybe it wasn&#39;t there before, or just not as relevant to me before.- <br/>\n=-<br/>\n<br/>\nThat always happens with any reading.  If someone read Oliver Twist as  <br/>\na kid she probably identified with the kids in there.  If you read it  <br/>\nas an adult, you identify with the adults.  I&#39;m sure there is  <br/>\nliterature out there I&#39;ll read differently when I&#39;m a grandparent.<br/>\n<br/>\nSame with non-fiction.  Ex-presidents and royalty must read history  <br/>\nvery differently than kids do, or housewives who&#39;ve stayed away from  <br/>\npolitics do.<br/>\n<br/>\n-=-I posted here before and you gave me the same response about  <br/>\nscheduling failure on my calendar.-=-<br/>\n<br/>\nI hope I will respond similarly the next time someone seems to have  <br/>\nscheduled failure in advance, even if it&#39;s you again!<br/>\n<br/>\n-=-Have I learned nothing?! I think I see things too black and white-  <br/>\neither I&#39;ve succeded or failed. Good mom or bad mom.-=-<br/>\n<br/>\nHow could you do that if you&#39;d listened to that Peaceful Parenting  <br/>\ntalk and started to make choices mindfully?  How could you not be  <br/>\nthinking &quot;better mom&quot; if you were making ten or twenty better choices  <br/>\nevery day?<br/>\n<br/>\nReading about unschooling without doing it is like reading a cookbook  <br/>\nwithout making any food, or reading woodworking projects books without  <br/>\nowning a saw.  The DOING is the unschooling, not the reading and the  <br/>\nthinking.  You can&#39;t just read about building trust.  You need to  <br/>\n*build* some.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Building Trust","postDate":"1255353836","msgId":47903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MjVGQzRGLUFBRjAtNEE4OC1CRDAwLTJGMjJFOTRGNzg1N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhhdWQwbys0Z25oQGVHcm91cHMuY29tPg==","referencesHeader":"PGhhdWQwbys0Z25oQGVHcm91cHMuY29tPg=="},"prevInTopic":47902,"nextInTopic":47904,"prevInTime":47902,"nextInTime":47904,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"-=-At the same time, I wanted to be respectful of their home and not have her just doing whatever she wanted without asking. -=- But you just told us this: -=-","messageBody":"<div id=\"ygrps-yiv-1987363534\">-=-At the same time, I wanted to be respectful of their home and not  <br/>\nhave her just doing whatever she wanted without asking. -=-<br/>\n<br/>\nBut you just told us this:<br/>\n-=- and Ezabella kept asking them to help her with things or if she  <br/>\ncould watch a movie or draw or eat their snacks or whatever.-=<br/>\n<br/>\nShe was asking.<br/>\n<br/>\n-=-So, I feel like, if she trusted me to be her partner and help her,  <br/>\nand if I was better at finding solutions, she wouldn&#39;t feel the need  <br/>\nto always be asking other people for things. -=-<br/>\n<br/>\nIf she were to ask you &quot;Do you think they would let me watch a movie?&quot;  <br/>\nwould you say &quot;I don&#39;t want to ask them&quot;?<br/>\nOr if she said &quot;Do you think they would let me draw&quot; you would say &quot;If  <br/>\nthey want you to draw they&#39;ll bring you a pencil and paper. shush!&quot;?<br/>\n<br/>\nBecause on the one hand if you go to someone&#39;s house and they have  <br/>\ntoys and projects planned it&#39;s not totally okay to ask to do other  <br/>\nkinds of things.   But if it&#39;s something pretty innocuous, it&#39;s not a  <br/>\nbig deal.  I think the conversations with her about this should be  <br/>\nbefore you go at all, about what to expect, and how to be courteous as  <br/>\na guest.<br/>\nIf you&#39;re a mom who says no a lot, though, if she&#39;s a smart kid she&#39;ll  <br/>\nstart asking other people.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Building Trust","postDate":"1255336909","msgId":47902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1MUZDM0RBMzRCRTQ2NDg4RTYxNENCRDc4OTM3QzMzQExZTEFMQVAyPg==","inReplyToHeader":"PGhhdWQwbys0Z25oQGVHcm91cHMuY29tPg==","referencesHeader":"PGhhdWQwbys0Z25oQGVHcm91cHMuY29tPg=="},"prevInTopic":47901,"nextInTopic":47903,"prevInTime":47901,"nextInTime":47903,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... and ... So, I feel like, if she trusted me to be her partner and help her, and if I was better at finding solutions, she wouldn t feel the need to always","messageBody":"<div id=\"ygrps-yiv-827214275\">----- <br/>\n<br/>\n<br/>\n    <br/>\n<br/>\n  ---&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;Part of the reason I feel like she doesn&#39;t trust me is because of the fact that she is always asking other people for help, even when I am right there and available. <br/>\n  and<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n </span></blockquote>  So, I feel like, if she trusted me to be her partner and help her, and if I was better at finding solutions, she wouldn&#39;t feel the need to always be asking other people for things. &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n  hi emily :)<br/>\n<br/>\n   i wanted to respond to these few snippets because it reminded me so  much of my daughter (now 14) at ezabella&#39;s age.<br/>\n<br/>\n  i wouldn&#39;t assume it&#39;s about you being a roadblock - or about you at all!   it might be - and it would certainly not hurt to find ways to not be like that - but my daughter ALWAYS loved meeting new people - would pick up her towel if we were at the lake and alllllll the way across the beach to find some other nice family to plop down next to. she always wanted my friends (even if she had just met them) to be the ones to hold her hand, carry her, drive her in their car. etc.<br/>\n<br/>\n  we joked that it was &quot;novelty person syndrome&quot; - and just this weekend, we had a bunch of family and friends in town for a wedding, and my now 14 year old said &quot;i think i still have novelty person syndrome mom - i kinda want to ride with someone else to the restaurant&quot;.<br/>\n<br/>\n  she&#39;s exactly the opposite of my son that way, and it seems to be a part of her extroverted temperament, just as his preference for me to do stuff for him is part of his introverted temperament.<br/>\n<br/>\n  just thought i&#39;d share that in case it helps you be a little less hard on yourself, although i think it&#39;s great you are looking for more ways to be her partner.  i am positive i could have benefited from that approach when my kids were younger too.<br/>\n<br/>\n  warmly, lyla<br/>\n  Recent Activity<br/>\n    a..  19New Members<br/>\n    b..  1New Links<br/>\n  Visit Your Group <br/>\n  Give Back<br/>\n  Yahoo! for Good<br/>\n<br/>\n  Get inspired<br/>\n<br/>\n  by a good cause.<br/>\n<br/>\n  Y! Toolbar<br/>\n  Get it Free!<br/>\n<br/>\n  easy 1-click access<br/>\n<br/>\n  to your groups.<br/>\n<br/>\n  Yahoo! Groups<br/>\n  Start a group<br/>\n<br/>\n  in 3 easy steps.<br/>\n<br/>\n  Connect with others.<br/>\n  . <br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255323480","msgId":47900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhdWQwbys0Z25oQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgyODY4MC40NTU1OS5xbUB3ZWIxMTA0MDcubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":47899,"nextInTopic":47901,"prevInTime":47899,"nextInTime":47901,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... Thanks Jenny, I was hoping you d chime in!  She is almost always gracious about Lilana s needs at home too.  I try to find lots of ways where she doesn t","messageBody":"<div id=\"ygrps-yiv-1811885451\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Jenny Cyphers &lt;jenstarc4@...&gt; wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; What I see, is that Ezabella is very independent, articulate, and very aware.  She sometimes takes a back seat to her little sister, who&#39;s needs are more immediate.  She&#39;s always seemed gracious about that, but, then there are always others around to help her out when you need to take care of her sister, so maybe that isn&#39;t so much the case when it&#39;s just you guys at home.  I like Ezabella a lot!  She&#39;s very clear about what she wants, at least, that&#39;s been my experience with her.  I can see how that might be hard when there are times, when what she wants, don&#39;t meet what others want.  &gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Thanks Jenny, I was hoping you&#39;d chime in!  She is almost always gracious about Lilana&#39;s needs at home too.  I try to find lots of ways where she doesn&#39;t have to wait for her sister.  Part of the reason I feel like she doesn&#39;t trust me is because of the fact that she is always asking other people for help, even when I am right there and available.  <br/>\n<br/>\nFor example, we were at playdate at another unschooler&#39;s house, and Ezabella kept asking them to help her with things or if she could watch a movie or draw or eat their snacks or whatever.  They had already put out a ton of toys to play with, and this was my first time meeting them, so I didn&#39;t know how they would be with all of her requests.  So, I would say things like &quot;I think they probably weren&#39;t planning on all the mess of paints tonight since they didn&#39;t put them out&quot; and &quot;we brought snacks and they haven&#39;t offered anything, so let&#39;s just eat our snacks&quot; and &quot;he wanted to watch the other movie, and this is his house, so we need to respect that.&quot;<br/>\n<br/>\nI felt like I was being more of a roadblock than a partner, especially when she would just turn around and ask them and they were fine with it.  They were happy to accomodate all her requests, and were much better than me at negotiating the differing needs of multiple kids so everyone there got what they wanted.  At the same time, I wanted to be respectful of their home and not have her just doing whatever she wanted without asking.  <br/>\n<br/>\nIt seems like other people (even people who aren&#39;t unschoolers) are usually willing to help her get what she wants when she asks them.  I end up being the one always pointing out why we might not want to do something.  I try to only say something if it&#39;s a matter of safety or respect, but sometimes I just think people will think we are rude if she&#39;s always asking them for something and I just stand there.  Then I&#39;m always surprised at how nice people are, and I feel like a jerk.  And for her it turns into one more case of me seeming like I&#39;m trying to stop her and someone else joyfully saying SURE.  <br/>\n<br/>\nSo, I feel like, if she trusted me to be her partner and help her, and if I was better at finding solutions, she wouldn&#39;t feel the need to always be asking other people for things.        <br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255321483","msgId":47899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhdWIyYiszanJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDREQzhCMTY5LTM4QTItNDU1NC1CMTg5LTc0N0REQUFDMTJBRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47881,"nextInTopic":47900,"prevInTime":47898,"nextInTime":47900,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... Thank for those links.  I ve read them several time before, but something jumped out at me this time.  Maybe it wasn t there before, or just not as","messageBody":"<div id=\"ygrps-yiv-966250870\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n <br/>\n&gt; There are a few things collected up here that might help you:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<br/>\n </span></blockquote>Thank for those links.  I&#39;ve read them several time before, but something jumped out at me this time.  Maybe it wasn&#39;t there before, or just not as relevant to me before.  The mom on the parenting peacefully page that is quoted saying that part of the problem is that she doesn&#39;t trust herself- I think I have that problem too.  <br/>\n<br/>\nReading that and this helped- <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Why practice?  Just do.  Why fail?  You&#39;ve scheduled in some failure  <br/>\n&gt; on your calendar here.<br/>\n </span></blockquote>Sandra&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI posted here before and you gave me the same response about scheduling failure on my calendar.  Have I learned nothing?!  I think I see things too black and white- either I&#39;ve succeded or failed.  Good mom or bad mom.  I&#39;ve made great strides in seeing my daughter&#39;s choices as choices without judging them, but I&#39;m not so easy on myself.  I expect that I *will* fail, so I do.  Though if I look back over the last year, I&#39;ve changed SO much.  <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Building Trust","postDate":"1255320593","msgId":47901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhdWE2aCttYTJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyNTc5NC42NzkwNy5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":47900,"nextInTopic":47902,"prevInTime":47900,"nextInTime":47902,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... There is a pattern.  I noticed it when my husband was gone for a week last month.  When he was gone, things went really smoothly, and I took some time to","messageBody":"<div id=\"ygrps-yiv-27370505\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Is there a pattern to the difficult days? Are you busier and more likely to forget to eat, are you more tired? Can you feel the tension building? If you can are there things you can do to alleviate it? Watch a movie, go through a drive in and get some food, do something slower for a bit. &lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>There is a pattern.  I noticed it when my husband was gone for a week last month.  When he was gone, things went really smoothly, and I took some time to notice the differences.  When he was gone, I *knew* all the childcare was all up to me, and I had things planned out better.  I worked when they slept, I played a lot with them, I took time out every day to go to the park or the library or a friend&#39;s house.  I put them first, because I knew that there was no one else there for me to say &quot;take the kids while I do.... &quot;  I was amazed that I still managed to get most of my work done AND have time alone at the end of the day!  <br/>\n<br/>\nI think now that my husband is back (he works from home too, so he&#39;s always around), I&#39;m falling back into my habit of just expecting him to take care of the kids while I work.  Expecting them to all fall into my routine and schedule instead of being flexible and in the moment.  I&#39;m glad you brought this up, because it helped me remember what I had noticed about the difference while he was gone!  <br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Building Trust","postDate":"1255203625","msgId":47881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyODY4MC40NTU1OS5xbUB3ZWIxMTA0MDcubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":47877,"nextInTopic":47899,"prevInTime":47880,"nextInTime":47882,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"... I think everyone experiences that to some degree, even more so with really young children. ... What I see, is that Ezabella is very independent,","messageBody":"<div id=\"ygrps-yiv-2124881607\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Intellectually, I know what I want to do. What kind of parent I want to be. I want to be her partner. I want to help get her needs met. I want her to trust me. But I feel like I lack creative problem solving skills and sometimes I just want things *my way.* It&#39;s like I get stuck and can&#39;t see past my own wants.&gt;&gt;&gt;<br/>\n<br/>\n&gt;&gt;&gt;Some days I hit this awesome groove where I&#39;m flexible and creative and kind and helpful. And other days..... not so much.&gt;&gt;&gt; <br/>\n<br/>\n </span></blockquote>I think everyone experiences that to some degree, even more so with really young children.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Will it just take more time of practice, fail, practice, fail, before I start to feel like I&#39;m succeeding at this and she trusts me again? Any suggestions of things I can do (or not do) to build trust?&gt;&gt;&gt; <br/>\n<br/>\n&gt;&gt;&gt;A few people on this list- Jenny Cyphers and some others who may not be as active here- have seen Ezabella and I together. Any observations that might help?&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>What I see, is that Ezabella is very independent, articulate, and very aware.  She sometimes takes a back seat to her little sister, who&#39;s needs are more immediate.  She&#39;s always seemed gracious about that, but, then there are always others around to help her out when you need to take care of her sister, so maybe that isn&#39;t so much the case when it&#39;s just you guys at home.  I like Ezabella a lot!  She&#39;s very clear about what she wants, at least, that&#39;s been my experience with her.  I can see how that might be hard when there are times, when what she wants, don&#39;t meet what others want.<br/>\n<br/>\nBoth of your girls are get up and go kids, who will do things on their own even if it seems like they can&#39;t or need help.  I&#39;m sure they get themselves into situations where they need help and get frustrated.  You can correct me if I&#39;m wrong, because I&#39;m not sure what it&#39;s like with just you guys.  Ezabella might do really well with an older kid play buddy, since she&#39;s very social and will talk with just about anybody and seems to thrive on that kind of interaction.  When it&#39;s just you guys, are you able to help her with that, while attending to the baby?  If not, it may be a source of frustration for her that you could work to alleviate.<br/>\n<br/>\nWhen you can help little ones alleviate frustrations in their lives, then things tend to go much more smoothly on all the other things that life brings.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Building Trust","postDate":"1255187571","msgId":47877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDREQzhCMTY5LTM4QTItNDU1NC1CMTg5LTc0N0REQUFDMTJBRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhhb3NsaStxZGxxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhhb3NsaStxZGxxQGVHcm91cHMuY29tPg=="},"prevInTopic":47876,"nextInTopic":47881,"prevInTime":47876,"nextInTime":47878,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"-=-I m getting better all the time about handling my anger. I m using meditation, lots of prayer and other things to help me work through my own issues so I","messageBody":"<div id=\"ygrps-yiv-730644282\">-=-I&#39;m getting better all the time about handling my anger. I&#39;m using  <br/>\nmeditation, lots of prayer and other things to help me work through my  <br/>\nown issues so I can be a better mom.-=-<br/>\n<br/>\nThere are a few things collected up here that might help you:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<br/>\n-=-So, here&#39;s my question- after screwing up so much in her short  <br/>\nlife, how do I rebuild trust? I always apologize when I yell or handle  <br/>\nthings badly. -=-<br/>\n<br/>\nYou don&#39;t get to build her trust.  You have to earn it.  She&#39;ll build  <br/>\nher own trust, at her own pace.<br/>\n<br/>\n-=-But I feel like I lack creative problem solving skills and  <br/>\nsometimes I just want things *my way.* It&#39;s like I get stuck and can&#39;t  <br/>\nsee past my own wants.-=-<br/>\n<br/>\nThe best problem-solving skills I can suggest are to live by  <br/>\nprinciples and to base each tiny decision on those principles.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\nDo the more peaceful thing, the more learning-oriented thing, the more  <br/>\nrelationship-building thing, the kinder thing, the thing you wish  <br/>\nsomeone had done for you when you were that age.  If you don&#39;t think  <br/>\nof two options before you act, you haven&#39;t made a decision at all.<br/>\n<br/>\n-=-Some days I hit this awesome groove where I&#39;m flexible and creative  <br/>\nand kind and helpful. And other days..... not so much.<br/>\n-=-<br/>\n<br/>\nThen when you&#39;re making decisions for the rest of today (or the week,  <br/>\nor your life), think before acting and go with &quot;what&#39;s more helpful?&quot;  <br/>\nor &quot;What&#39;s more creative?&quot;<br/>\n<br/>\n-=-Will it just take more time of practice, fail, practice, fail,  <br/>\nbefore I start to feel like I&#39;m succeeding at this and she trusts me  <br/>\nagain? Any suggestions of things I can do (or not do) to build trust? - <br/>\n=-<br/>\n<br/>\nWhy practice?  Just do.  Why fail?  You&#39;ve scheduled in some failure  <br/>\non your calendar here.<br/>\nHere&#39;s what not to do.  Avoid all these things:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/screwitup\">http://sandradodd.com/screwitup</a><br/>\n<br/>\nHere&#39;s why to just do it now instead of practice/fail/practice/fail:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/doit\">http://sandradodd.com/doit</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Building Trust","postDate":"1255185839","msgId":47876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3NzcyOEZBLTA0MjAtNDhDRC1BN0VBLUI3MEU3NUYzMEFCMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEyNTc5NC42NzkwNy5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGhhb3NsaStxZGxxQGVHcm91cHMuY29tPiA8MTI1Nzk0LjY3OTA3LnFtQHdlYjg2MjA5Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":47875,"nextInTopic":47877,"prevInTime":47875,"nextInTime":47877,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"Schuyler s post was really great.  I ve put it on the peaceful parenting page and am working on quoting and linking back from the pages on breathing, spanking","messageBody":"<div id=\"ygrps-yiv-511119514\">Schuyler&#39;s post was really great.  I&#39;ve put it on the peaceful  <br/>\nparenting page and am working on quoting and linking back from the  <br/>\npages on breathing, spanking and living in the moment rather than in  <br/>\n&quot;the day,&quot; so they might not all be there yet but will be soon (two  <br/>\nare there).<br/>\n<br/>\nThe original poster, Steph, responded but she appended the whole  <br/>\nthread.   Here&#39;s the good thing she said, though:<br/>\n<br/>\n-=-Thank you so much for this!  Your post was like a little refresher  <br/>\ncourse for when I start slipping back into old habits.  Just what I  <br/>\nneeded to read this week!-=-<br/>\n<br/>\nThanks, Schuyler, for summarizing how you came to be calm and patient  <br/>\n(-er) :-)<br/>\n<br/>\nSandra<br/>\n<br/>\nOh!  The links:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a> (third or so down)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a> (righthand side, second section)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spanking\">http://sandradodd.com/spanking</a> (it will be right under the directory  <br/>\nbox)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/moment\">http://sandradodd.com/moment</a> (top, when it&#39;s there)</div>","specialLinks":[]},{"userId":77070457,"authorName":"Sanguinegirl83@aol.com","from":"Sanguinegirl83@...","profile":"sanguinegirl83","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Building Trust","postDate":"1255167715","msgId":47875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzE3QTUwOTlFODI3Ni01RTg4LTI2QjZAd2VibWFpbC1tMDM5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDEyNTc5NC42NzkwNy5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGhhb3NsaStxZGxxQGVHcm91cHMuY29tPiA8MTI1Nzk0LjY3OTA3LnFtQHdlYjg2MjA5Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":47874,"nextInTopic":47876,"prevInTime":47874,"nextInTime":47876,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1152870566\">&lt;&lt;&lt;It took looking at<br/>\nthe toll not doing better took. Simon would ball up and get smaller and smaller. Linnaea would rage back and scream and defend. Nobody heard what I was saying anyhow. My raging, my approach to problems didn&#39;t help anything. &gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWow. I don&#39;t know why these particular words sparked an epiphany, but they did-and I&#39;ve probably heard this idea many times before, but for some reason, these words made it *click*: <br/>\n<br/>\n<br/>\n<br/>\nTraditional parenting (the way I began parenting) is all about either making sure the child doesn&#39;t ever have any power, or about taking away a child&#39;s power and?making sure?the adult/parent has all the power.? When I started parenting more mindfully, I quit trying to take that power. I wanted to say I gave the power back, but I never really *had* my child&#39;s power! I think with a lot of effort you can take away someone else&#39;s power, but I don&#39;t think you can really take it in as your own...<br/>\n<br/>\n<br/>\n<br/>\nAt any rate, Wyl, now 10, is a far different person than he would have been if I hadn&#39;t taken those steps to change. He did cower from me when I yelled and threw a tantrum (that&#39;s really all I can call it)-he put his arms over his head?so that his biceps covered his ears and his forearms crossed over his head. When I started yelling at him about that, he changed to covering his ears or face with his hands. I hated it when he did that, but I didn&#39;t examine *why* I didn&#39;t like it!<br/>\n<br/>\n<br/>\n<br/>\nThese past few weeks have been kind of a revelation to me-finding out in random conversations how he feels about me as?a parent. He described me as a &quot;patient, kind, thoughtful&quot; parent-that was amazing to me! Last night he scoffed at the idea that I would abuse him or his brother. Oddly enough, that didn&#39;t make me feel free, it made me want to take the steps to *make certain* that I never backslide into that parenting I first started with, and I keep trying to be a better parent, a better person.<br/>\n<br/>\n<br/>\n<br/>\nThank you, Schuyler, for helping focus those ideas in my brain.<br/>\n<br/>\n<br/>\n<br/>\nPeace,<br/>\n<br/>\nDe<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Building Trust","postDate":"1255165283","msgId":47874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNTc5NC42NzkwNy5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGhhb3NsaStxZGxxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhhb3NsaStxZGxxQGVHcm91cHMuY29tPg=="},"prevInTopic":47873,"nextInTopic":47875,"prevInTime":47873,"nextInTime":47875,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"Is there a pattern to the difficult days? Are you busier and more likely to forget to eat, are you more tired? Can you feel the tension building? If you can","messageBody":"<div id=\"ygrps-yiv-584264400\">Is there a pattern to the difficult days? Are you busier and more likely to forget to eat, are you more tired? Can you feel the tension building? If you can are there things you can do to alleviate it? Watch a movie, go through a drive in and get some food, do something slower for a bit. <br/>\n<br/>\nI started out spanking. I spanked until Simon was 5 and Linnaea was 2. Spanking was all about my way and my frustration and my inability to seek out a different way. It was amazing when I stopped. It was hard not to turn to the quick solution that never solved anything and left everyone upset, me included, me, maybe the most. But it was amazing to have to expand into the vacuum left by not having that blunt tool in my toolbox. Both Simon and Linnaea grew to trust me. It took less time than I expected. They didn&#39;t want to think of me as a bad mom, it was easy to rewrite myself as a no-longer-hitting mom than I expected. <br/>\n<br/>\nTwo days ago I got irritated at David. And I raged at him for about 1/2 second and I stopped. I breathed and I apologized and it was gone. There is no way that I could have done that when Simon and Linnaea were little, not because of them, but because I hadn&#39;t taken the small steps to get from where I was to where I am. It took recognizing that what I wanted from them and what they gave didn&#39;t have to be different things. It took more and more seeing how much I enjoyed them and being with them and all that they did. As a side note, when I feel myself getting annoyed I find it helps a lot to just hang out more with them and appreciate them all over again.  It took seeing that I didn&#39;t need to get to the end of a tirade to apologize for it. I could stop midstream. It took using Ronnie Maier&#39;s rewind and do-over requests and having two children who had the generosity to give me those momentary reprieves. It took doing better each time. It took looking at<br/>\n the toll not doing better took. Simon would ball up and get smaller and smaller. Linnaea would rage back and scream and defend. Nobody heard what I was saying anyhow. My raging, my approach to problems didn&#39;t help anything. <br/>\n<br/>\nI can remember talking about it, thinkiing about it, it was like a switch I could feel turning. I went from calm and in control to *switch* furious in no time at all. And I couldn&#39;t figure out how to not turn the switch on, to make the switch a thoughtful process. When it flipped the other day I felt it go and I stepped away and I turned it off. Most days I stop long before the switch goes. The thoughtful process was recognizing the grumpiness earlier in the day. Feeling a shortness that isn&#39;t normally there and doing things to respond to that like going for a quick breath outside or having a chocolate milk or a chai latte or something else that just ups my energy budget a bit. Taking 5 minutes to close my eyes and be still helps, too. Whatever works for you to buffer yourself is good, come up with lots of little things. With an almost 4 year old little things and little moments are what you are most likely going to get. <br/>\n<br/>\nt helps a lot to try for better moments not days. Don&#39;t judge a day by one upset, judge it as a bad moment and move forward. A little bit better each moment. A little bit more aware. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Emily S &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:saturnfire16@...\">saturnfire16@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Saturday, 10 October, 2009 3:48:18<br/>\nSubject: [AlwaysLearning] Building Trust<br/>\n<br/>\nMy name is Emily, and this is my reintroduction to the group.  I was here for a while (a year maybe?) and then I left.  I was spending too much time reading about unschooling and not spending enough time with my kids.  I&#39;m doing better with that, and I needed to come back to ask some questions.<br/>\n<br/>\nHere&#39;s some background:<br/>\n<br/>\nMy daughter, Ezabella, is almost 4.  I started out spanking (swatting her hand when she was about 18 months) and did timeouts.  I stopped both when she was 2 (spanking and timeouts for a 2 year old!  Terrible, but that&#39;s all I knew to do.  I couldn&#39;t imagine doing that now.)  I&#39;m firmly against spanking and all punishments now, but there have been a few times in the last year where I hit her out of frustration.  One time she smacked me in the face, so I smacked her back.  Each time I *immediately* realized what I had done and appoligized profusely.  <br/>\n<br/>\nI&#39;m getting better all the time about handling my anger.  I&#39;m using meditation, lots of prayer and other things to help me work through my own issues so I can be a better mom.  <br/>\n<br/>\nSo, here&#39;s my question- after screwing up so much in her short life, how do I rebuild trust?  I always apologize when I yell or handle things badly.  We don&#39;t have arbitrary restrictions- food, tv, bedtime (I slowly let those things go, thanks to this list).    <br/>\n<br/>\nIntellectually, I know what I want to do.  What kind of parent I want to be.  I want to be her partner.  I want to help get her needs met.  I want her to trust me.  But I feel like I lack creative problem solving skills and sometimes I just want things *my way.*  It&#39;s like I get stuck and can&#39;t see past my own wants.<br/>\n<br/>\nSome days I hit this awesome groove where I&#39;m flexible and creative and kind and helpful.  And other days..... not so much.        <br/>\n<br/>\nWill it just take more time of practice, fail, practice, fail, before I start to feel like I&#39;m succeeding at this and she trusts me again?  Any suggestions of things I can do (or not do) to build trust?  <br/>\n<br/>\nA few people on this list- Jenny Cyphers and some others who may not be as active here- have seen Ezabella and I together.  Any observations that might help?<br/>\n<br/>\n(I know my kids are little and maybe we aren&#39;t *really* unschooling yet, but I&#39;m asking here because I appreciate the honesty and clarity of thought on this list).  <br/>\n<br/>\nEmily        <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Building Trust","postDate":"1255142898","msgId":47873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhb3NsaStxZGxxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47874,"prevInTime":47872,"nextInTime":47874,"topicId":47873,"numMessagesInTopic":0,"msgSnippet":"My name is Emily, and this is my reintroduction to the group.  I was here for a while (a year maybe?) and then I left.  I was spending too much time reading","messageBody":"<div id=\"ygrps-yiv-910765414\">My name is Emily, and this is my reintroduction to the group.  I was here for a while (a year maybe?) and then I left.  I was spending too much time reading about unschooling and not spending enough time with my kids.  I&#39;m doing better with that, and I needed to come back to ask some questions.<br/>\n<br/>\nHere&#39;s some background:<br/>\n<br/>\nMy daughter, Ezabella, is almost 4.  I started out spanking (swatting her hand when she was about 18 months) and did timeouts.  I stopped both when she was 2 (spanking and timeouts for a 2 year old!  Terrible, but that&#39;s all I knew to do.  I couldn&#39;t imagine doing that now.)  I&#39;m firmly against spanking and all punishments now, but there have been a few times in the last year where I hit her out of frustration.  One time she smacked me in the face, so I smacked her back.  Each time I *immediately* realized what I had done and appoligized profusely.  <br/>\n<br/>\nI&#39;m getting better all the time about handling my anger.  I&#39;m using meditation, lots of prayer and other things to help me work through my own issues so I can be a better mom.  <br/>\n<br/>\nSo, here&#39;s my question- after screwing up so much in her short life, how do I rebuild trust?  I always apologize when I yell or handle things badly.  We don&#39;t have arbitrary restrictions- food, tv, bedtime (I slowly let those things go, thanks to this list).    <br/>\n<br/>\nIntellectually, I know what I want to do.  What kind of parent I want to be.  I want to be her partner.  I want to help get her needs met.  I want her to trust me.  But I feel like I lack creative problem solving skills and sometimes I just want things *my way.*  It&#39;s like I get stuck and can&#39;t see past my own wants.<br/>\n<br/>\nSome days I hit this awesome groove where I&#39;m flexible and creative and kind and helpful.  And other days..... not so much.        <br/>\n<br/>\nWill it just take more time of practice, fail, practice, fail, before I start to feel like I&#39;m succeeding at this and she trusts me again?  Any suggestions of things I can do (or not do) to build trust?  <br/>\n<br/>\nA few people on this list- Jenny Cyphers and some others who may not be as active here- have seen Ezabella and I together.  Any observations that might help?<br/>\n<br/>\n(I know my kids are little and maybe we aren&#39;t *really* unschooling yet, but I&#39;m asking here because I appreciate the honesty and clarity of thought on this list).  <br/>\n<br/>\nEmily</div>","specialLinks":[]}],"prevTopicId":48203,"nextTopicId":48238}}