{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"About what made unschooling work for us","postDate":"1353449059","msgId":69671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0QTc3QTc3LUEyMTAtNDlEQS04MkY2LURCODkwQTgzMzg5RUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":69670,"nextInTime":69672,"topicId":69671,"numMessagesInTopic":0,"msgSnippet":"Below is something I wrote to a longtime real-life / non-unschooling / childless friend who is doing an anthropology paper on unschooling. :-) If others here","messageBody":"<div id=\"ygrps-yiv-2071518288\">Below is something I wrote to a longtime real-life / non-unschooling / childless friend who is doing an anthropology paper on unschooling. :-)<br/>\n<br/>\nIf others here have ideas I should send to her, I&#39;ll pass them on.  But I thought some of this might be interesting to newer people in the discussion here.<br/>\n<br/>\nSandra<br/>\n<br/>\n----------------------------------------------------------<br/>\n<br/>\n-=- I know your own experiences with both being a student and a teacher led you to unschooling.  How have you been able to do it? Obviously you and Keith have made financial decisions that allow you to be at home with the kids when they were small.  You and Keith both appear to have the same philosophy about learning.  It &#39;s hard to come up with the right questions, but what has made it work for your family?  What do you think are the necessary means to successfully unschool?  It seems to me that unschooling is not for everyone but I can&#39;t quite identify why?<br/>\n <br/>\nAnswer just lead to more questions.... -=-<br/>\n<br/>\nThat&#39;s one way to make it work.  Learning all the time.<br/>\n<br/>\nWhat helped it work for me and Keith was that we had been together for a while before we had kids.  When we first met, I had &quot;a good job&quot; (I was a teacher, and as it took a college degree, that=&quot;good job&quot;) and Keith was working random minimum wage jobs.  <br/>\n<br/>\nThen we did lots of SCA projects together and had faith in each other&#39;s abilities and integrity.<br/>\n<br/>\nThen we got pregnant by accident and decided that was okay.<br/>\n<br/>\nAs I gradually moved toward more and more mindfulness and research about what to do, and how, and why, with baby Kirby, and then with Marty...   Keith was often a step or three behind me, but he didn&#39;t have great memories of his own upbringing, and knew that I was stepping away from the alcoholic aspect of my own.  My dad was not an alcoholic, and he died just about the time I got together with Keith.  Keith met him once, in the VA hospital.<br/>\n<br/>\nIt is harder when a couple has decided from the beginning that they will both work full time and build up a lot of money and property and possessions.<br/>\nIt&#39;s harder when the husband doesn&#39;t think the wife is very bright.<br/>\nIt&#39;s harder when they can&#39;t afford for one parent to stay home.  That&#39;s true with LOTS and lots of options in life--owning a yacht, skiing around the country, collecting expensive whatever, owning horses or a racecar or a plane.   It&#39;s kind of a big deal, and a longterm project.<br/>\n<br/>\n-=-You and Keith both appear to have the same philosophy about learning. -=-<br/>\n<br/>\nI always cared a lot about learning, and Keith knew that and knew that I was responsible and well informed.   What solidified his confidence in unschooling was seeing the things the kids learned, and the casual and fun ways they had learned them.<br/>\n<br/>\nSeeing other families&#39; kids helps, too.  Too often a dad will have imaginary six- or eight-year-olds in his head and might (sometimes horribly and unfairly) compare his child to that ideal fantasy child.  Nearly always, when parents know enough other families, they are calmer about their own children&#39;s abilities and comparative merits.  Or perhaps they see that their child has a quirk or difference that needs to be protected and not laid out to other people&#39;s meanness.  But they are better able to see their child when they&#39;ve seen other children, too.  So it helped us that we had been in a La Leche League babysitting co-op and playgroup, and had an unschooling park group and went to some gatherings of other families, and (increasingly) conferences.<br/>\n<br/>\nWe couldn&#39;t really easily have afforded conferences, but I was invited to speak.  Occasionally the whole family would go, but more often it was me and one of the kids.<br/>\n<br/>\nIt helps for the kids to have interactions with other families and adults, too.  Some of Keith&#39;s confidence came from hearing back from others in the SCA about our kids being helpful and responsible when we parents weren&#39;t around.<br/>\n<br/>\n<br/>\n-=-What do you think are the necessary means to successfully unschool?  It seems to me that unschooling is not for everyone but I can&#39;t quite identify why?-=-<br/>\n<br/>\nThe parents need to be truly interested in their children as people, not just as symbols or irritants or mistakes or property.<br/>\nThey need to care more what their children think than what other adults think, and that is very rare in the world.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":69610,"nextTopicId":69639}}