{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":31740294,"authorName":"Inna Manni","from":"Inna Manni &lt;SpinFrog@...&gt;","profile":"spinfrog","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] formal mealtime","postDate":"1076606825","msgId":90954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjEyMTcyNzA1LjgwNDE3LnFtYWlsQHdlYjQwOTA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwMDkwMWMzZjE3ZiRlOTg2NGZhMCRkMjgzYjE0MkBuYXRlYml0Y2g+"},"prevInTopic":90940,"nextInTopic":0,"prevInTime":90953,"nextInTime":90955,"topicId":90927,"numMessagesInTopic":0,"msgSnippet":"I grew up in a family of bookworms so while we did eat at the table, often even all together, we usually all brought our books to the table and all ate while","messageBody":"<div id=\"ygrps-yiv-1365020680\">I grew up in a family of bookworms so while we did eat at the table,<br/>\noften even all together, we usually all brought our books to the<br/>\ntable and all ate while reading ;)<br/>\n<br/>\nI still love to do that, but I realize that a lot of people find it<br/>\nrude. My husband has talked about eating as a family but in truth he<br/>\nprefers to eat in front of the TV. Nothing wrong with that! The only<br/>\nperson who wants to eat as a family (and often tells both him and me<br/>\nto &#39;sit&#39; at the table) is our 2 yr old daughter! But big part of her<br/>\nwanting us at the table is that there are still a lot of foods she<br/>\neats messily and is therefore told she can only have them at the<br/>\ntable. As she learns to keep her soup off the couch, things will<br/>\nchange!<br/>\n<br/>\n--Inna<br/>\n<br/>\n<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Finance: Get your refund fast by filing online.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://taxes.yahoo.com/filing.html\">http://taxes.yahoo.com/filing.html</a></div>","specialLinks":[]},{"userId":174907773,"authorName":"Holly Selden","from":"&quot;Holly Selden&quot; &lt;HLSelden@...&gt;","profile":"holly_selden","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] formal mealtime","postDate":"1076601017","msgId":90940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDkwMWMzZjE3ZiRlOTg2NGZhMCRkMjgzYjE0MkBuYXRlYml0Y2g+","referencesHeader":"PEJDNTBGQjc5LjE0NjglaGVhdGhlcmV0dGVAY29tY2FzdC5uZXQ+"},"prevInTopic":90927,"nextInTopic":90954,"prevInTime":90939,"nextInTime":90941,"topicId":90927,"numMessagesInTopic":0,"msgSnippet":"When I was a kid, we always had formal mealtime.  Everyone sat down together and ate dinner and talked.  It was a very pleasant time (up until I was a teenager","messageBody":"<div id=\"ygrps-yiv-194256328\">When I was a kid, we always had formal mealtime.  Everyone sat down together and ate dinner and talked.  It was a very pleasant time (up until I was a teenager and even now a grown woman).  As I got older and my relationship with my mother deteriorated, mealtime got to be a stressful time.  My food couldn&#39;t digest.<br/>\n<br/>\nSince I&#39;ve had kids, we haven&#39;t had a formal mealtime.  Not because I don&#39;t want to...but because of lack of ability.  We do all eat at the same time, but there is no place for all 5 of us to sit down and eat together.  It&#39;s always been a combination of financial reasons and lack of space to put a table big enough to sit us all.  <br/>\n<br/>\nThe kids have a &quot;kid&#39;s&quot; table that doubles as an art space.  (I spraypainted it a few years ago with slate so they could do chalk on it on rainy days).  DH and I usually sit on the couch or on the floor and eat.  <br/>\n<br/>\nI have hopes and dreams of one day being able to sit down as a family and eat, but while we can&#39;t, we still try to interact during that time frame.<br/>\n<br/>\nHolly<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":98863955,"authorName":"Heather Hall","from":"Heather Hall &lt;Heatherette@...&gt;","profile":"harrietsmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] formal mealtime","postDate":"1076597065","msgId":90927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDNTBGQjc5LjE0NjglaGVhdGhlcmV0dGVAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDEwNzY1OTU2NjUuMzc5NC40ODcwOC5tNEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":90940,"prevInTime":90926,"nextInTime":90928,"topicId":90927,"numMessagesInTopic":0,"msgSnippet":"... I grew up with an iron rule about being at the table by 6 pm and eating whatever was on my plate with a smile or my chair got taken away - yuck! I do still","messageBody":"<div id=\"ygrps-yiv-1230262825\"><blockquote><span title=\"ireply\">&gt; &lt;&lt;Do the rest of you guys feel a formal mealtime is important?&gt;&gt;<br/>\n </span></blockquote>I grew up with an iron rule about being at the table by 6 pm and eating<br/>\nwhatever was on my plate with a smile or my chair got taken away - yuck!<br/>\n<br/>\nI do still like the idea of a shared meal.  When my husband and I got<br/>\ntogether I always nagged him to slow down and eat with me.  He thought I was<br/>\nnuts.  Now that we have kids he really wants us all to eat together and goes<br/>\ngreat lengths to accomplish that even on nights when I teach or have to<br/>\nleave.  He grew up eating in front of the TV.<br/>\n<br/>\nMy kids aren&#39;t always interested in sitting as long as it takes for us to<br/>\neat, they need to get down and wander around, and then come back for more.<br/>\nI&#39;m ok with this but dh goes freakin&#39; ballistic every time.  *sigh*  I&#39;ve<br/>\ncreated a monster ;)<br/>\n<br/>\nI have only recently found patience with my children, where I had none<br/>\nbefore.  I think it&#39;s just his turn to vent since he had to be the patient<br/>\none while I went nuts for awhile.  I am just trying to not get upset with<br/>\nhim and flame the fires.  Instead I guess I have just been trying to kind of<br/>\nnarrate when the kids are doing something that I know will bother him.  &#39;Oh,<br/>\ndo you need a break for a minute?  Well, you can come back for more if you<br/>\nwant to&#39;  that kind of stuff.  Seems like if I speak up before he starts<br/>\nhuffing and puffing, he can deal with it better.<br/>\n<br/>\nHe is so concerned about Harriet starting to read soon because he and his<br/>\nsister both read at about 4.  This list has been an amazing help for me<br/>\nbecause I can just throw out little tidbits whenever he says &#39;we really have<br/>\nto get you reading FOR REAL&#39;.  This morning he said something like that<br/>\nBecause the kids were sitting together in our recliner and Harriet was<br/>\nreading to Crispin.  She knows the story by heart and was saying the<br/>\nappropriate phrases with the right pictures.  To me, that is reading,<br/>\nespecially for a 4 year old.  I just said, &#39;well I&#39;ve read several times<br/>\nthat fine motor skills are really the first step in reading, maybe you guys<br/>\ncan do a project&#39;  <br/>\nI&#39;m not sure if it&#39;s ideal, but he is so curriculum focused.  I am trying to<br/>\nease him into some more unschooling ideas without shoving it down his<br/>\nthroat.  That won&#39;t work with him.<br/>\nAlthough he would never used anyone else&#39;s published curriculum, I can see<br/>\nhim going to great lengths to put together a very detailed plan of his own.<br/>\nI really want to do more natural learning.  I have a ways to go myself<br/>\nbefore I can truly foster natural learning in my kids.  Thanks for the help.<br/>\n-- <br/>\nHeather, mom to<br/>\nHarriet 12.15.99<br/>\nCrispin 01.25.02<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherette@...\">heatherette@...</a></div>","specialLinks":[]}],"prevTopicId":90942,"nextTopicId":90934}}