{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"John O. Andersen","from":"&quot;John O. Andersen&quot; &lt;editor@...&gt;","replyTo":"LIST","senderId":"tO5Wcw5G7maL3apZMYtH68g57ukjPu0RT3cPM-AuXoELGJqxwktH3yCawHdL_w07HqmQZW7JBNUA6U3p7Gv5nvH5Cxgb87-dEuG0yNGvqIjW23Zo6ZJyd8FC","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Hostelling newsletter","postDate":"974209206","msgId":14132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjAwMWMwNGU0MCQ2OWU0MGFjMCQ1MmYyODJkMEBhbmRlcnNlbj4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14131,"nextInTime":14133,"topicId":14132,"numMessagesInTopic":0,"msgSnippet":"If you re interested in hostelling (an inexpensive alternative to pricey lodging), you may want to subscribe to the free newsletter below.  It has lots of","messageBody":"<div id=\"ygrps-yiv-1217189704\">If you&#39;re interested in hostelling (an inexpensive alternative to pricey<br/>\nlodging), you may want to subscribe to the free newsletter below.  It has<br/>\nlots of helpful information.<br/>\n<br/>\nJohn Andersen<br/>\nUncoventional Ideas:  A Collection of Short Essays Which Question Mainstream<br/>\nValues<br/>\nhttp://www.unconventionalideas.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &lt;ejones@...&gt;<br/>\nTo: &lt;andersen@...&gt;<br/>\nSent: Monday, November 13, 2000 1:26 PM<br/>\nSubject: HI Travel Bytes - November Issue<br/>\n<br/>\n<br/>\n&gt; ****************************<br/>\n&gt; HI Travel Bytes<br/>\n&gt; Get in the know ...  before you go!<br/>\n&gt; ****************************<br/>\n&gt; A service for members and friends of Hostelling International.<br/>\n&gt;<br/>\n&gt; THIS IS AN AUTOMATED LIST SERVER.<br/>\n&gt; PLEASE DO NOT REPLY TO THIS MESSAGE.<br/>\n&gt;<br/>\n&gt; November 2000<br/>\n&gt; ===========<br/>\n&gt; Editor&#39;s note:<br/>\n&gt;<br/>\n&gt; Keep those comments and suggestions rolling in to HItravelbytes@....<br/>\nForward this issue to your friends, or tell them to subscribe at<br/>\nhttp://www.hiayh.org/newsletter/newsletter.htm.<br/>\n&gt;<br/>\n&gt; *We will never sell or share your e-mail address.   To unsubscribe, visit<br/>\nhttp://www.hiayh.org/newsletter/newsletter.htm.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ****************************<br/>\n&gt; ===========<br/>\n&gt; In this issue.<br/>\n&gt; ===========<br/>\n&gt;<br/>\n&gt; 1. WHAT THE GUIDEBOOKS DON&#39;T TELL YOU<br/>\n&gt; &quot;Six New Ways to Score Cheap Flights on the Net&quot;<br/>\n&gt;<br/>\n&gt; 2. HOSTEL NEWS<br/>\n&gt; --Hostel accommodations near major ski resorts<br/>\n&gt; --Ole! Visit our youth hostels in Mexico City<br/>\n&gt;<br/>\n&gt; 3. READERS SHARE THEIR FAVORITE HOSTELS<br/>\n&gt;<br/>\n&gt; 4. TRAVEL TRIVIA<br/>\n&gt; Answers, winners and new questions<br/>\n&gt;<br/>\n&gt; 5. TRAVELERS WANTED<br/>\n&gt; Paging travelers in Washington DC, the Research Triangle, and San Diego...<br/>\n&gt;<br/>\n&gt; 6. YOU&#39;RE INVITED!<br/>\n&gt; Chicago Hostel Ribbon Cutting Scheduled for December 4<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; 1. WHAT THE GUIDEBOOKS DON&#39;T TELL YOU...<br/>\n&gt; &quot;Six New Ways to Score Cheap Flights on the Net&quot;<br/>\n&gt; By Michael Shapiro<br/>\n&gt;<br/>\n&gt; If you watch TV or listen to the radio, you&#39;ve probably heard William<br/>\nShatner &quot;sing&quot; the praises of Priceline.com, the web site where you can name<br/>\nyour price for airline tickets, rental cars and hotel rooms. But what if<br/>\nyou&#39;re not comfortable bidding for travel products, or if you can&#39;t live<br/>\nwith Priceline&#39;s severe restrictions? (Priceline lets you pick travel dates<br/>\nbut not flights times or airline.) Well, there&#39;s a slew of new travel sites<br/>\nthat offer bargains with better terms.<br/>\n&gt;<br/>\n&gt; Hotwire (http://www.hotwire.com) launched in October and is similar to<br/>\nPriceline in that you can&#39;t choose travel times or airline. But there&#39;s a<br/>\nkey difference: Hotwire doesn&#39;t ask you to bid - the site shows you the best<br/>\nprice for that route. Of course you still have to be flexible; your flight<br/>\nmay leave anytime between early morning and late evening, though Hotwire<br/>\nwill not put you on an overnight flight unless you agree.<br/>\n&gt;<br/>\n&gt; Orbitz (http://www.orbitz.com) is the spawn of major airlines, and thus<br/>\nnot a place you&#39;d expect to find good deals. But this is a good place to<br/>\nsurvey prices because Orbitz has an excellent search tool that shows far<br/>\nmore options than other leading travel sites. However Orbitz just a place to<br/>\nlook until next year when it launches its booking capability.<br/>\n&gt;<br/>\n&gt; Qixo (http://www.qixo.com) scans about a dozen online travel sites,<br/>\nincluding budget outlets like CheapTickets.com, to find the best price. So<br/>\nQixo can help you save another valuable commodity: time.<br/>\n&gt;<br/>\n&gt; Savvio (http://www.savvio.com) lowers the price for flights and cruises as<br/>\nthe departure date approaches. This makes sense because once a plane flies<br/>\nor a ship sails, the seat or cabin is worthless. Though Savvio&#39;s prices<br/>\nmight not be as low as Priceline&#39;s or Hotwire&#39;s, there&#39;s no risk of getting<br/>\nstuck on a 6 a.m. flight because you can see flight times before deciding to<br/>\nbuy. Its air offerings are limited to TWA, ATA and other marginal carriers,<br/>\nbut it hopes to expand by January. Savvio plans to focus on overseas flights<br/>\nto Asia and Europe, but the company also features domestic airfares.<br/>\n&gt;<br/>\n&gt; At iDerive (http://www.iderive.com) a consumer buys a discount ticket, but<br/>\nif the airline needs the ticket back to sell to a higher paying business<br/>\ntraveler, it bumps the iDerive customer five days before departure. As<br/>\npayment for getting bumped, the consumer receives a full refund, plus a<br/>\nsizable bounty. With a motto of &quot;Save or get paid,&quot; iDerive targets the<br/>\nultra-flexible traveler, for example college students or someone who could<br/>\ndrive if they get bumped. Maybe a better motto would be &quot;Get bumped without<br/>\ndriving to the airport.&quot;<br/>\n&gt;<br/>\n&gt; Revelex (http://www.revelex.com) is creating an online marketplace where<br/>\nbuyers and sellers negotiate until a sale is made. So a hotel could offer a<br/>\nroom for $100; a traveler could bid $60, and then the hotel could choose to<br/>\nlower its price to $80 and see if the traveler will raise her bid.<br/>\n&gt;<br/>\n&gt; If all this sounds complicated, well, it is. In the end it may be just as<br/>\neasy, and just as affordable, to check your newspaper&#39;s Sunday travel<br/>\nsection and call discounters in your area.<br/>\n&gt;<br/>\n&gt; * Michael Shapiro is the author of the book Internet Travel Planer<br/>\n(http://www.internettravelplanner.com) and a travel columnist for the San<br/>\nFrancisco Examiner. For more online travel news, subscribe to his free<br/>\ne-travel newsletter at (http://www.thestandard.com/newsletters).<br/>\n&gt;<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; 2. HOSTEL NEWS<br/>\n&gt;<br/>\n&gt; Go Skiing Without Paying Ski Resort Prices. Hostel Accommodations Near<br/>\nMajor Ski Resorts for Just $7-28!<br/>\n&gt;<br/>\n&gt; You don&#39;t have to pay resort prices for a great skiing holiday -- if you<br/>\nchoose Hostelling International-American Youth Hostels (HI-AYH) for your<br/>\novernight accommodations.  Overnight fees at 36 HI-AYH hostels located in<br/>\nsome of the USA&#39;s top ski areas range from just $7 to $28 per person, per<br/>\nnight.  Many hostels have arranged special ski packages and a variety of<br/>\ndiscounts.<br/>\n&gt;<br/>\n&gt; Hostels in the west range from Alaska to New Mexico.  Five Colorado<br/>\nhostels have bargain overnight rates near such great ski areas as<br/>\nBreckenridge, Crested Butte, Purgatory, Aspen, Vail and Copper Mountain.  In<br/>\nthe Midwest go cross-country skiing out of the hostel&#39;s back door in Itasca<br/>\nState Park, Minnesota, and the Cuyahoga Valley National Recreation Area in<br/>\nOhio.  You can also pick one of three great locations in Wisconsin near<br/>\nSunburst, Cascade Mountain or Kettlebowl Hill Ski Areas.  Pennsylvania<br/>\nboasts six hostels near ski areas -- several in state parks -- including the<br/>\nPocono Mountains.<br/>\n&gt;<br/>\n&gt; In New England, you can ski the top places in Vermont, New Hampshire and<br/>\nMassachusetts for just $12-18 a night for your accommodations.   HI-White<br/>\nMountains Hostel in Conway, New Hampshire, includes linen and a continental<br/>\nbreakfast for the low $18 overnight fee.  Vermont hostels are near<br/>\nKillington, Middlebury College Snow Bowl, and Suicide Six and Sonnenberg Ski<br/>\nAreas.<br/>\n&gt;<br/>\n&gt; HI-AYH hostels provide affordable dormitory-style lodgings for travelers<br/>\nof all ages.  Separate accommodations are provided for males and females.<br/>\nMany hostels have private couple and family rooms available with advance<br/>\nreservations.  Most have fully-equipped self-service kitchens, dining areas,<br/>\nand common rooms for relaxing and socializing.  Some hostels even have<br/>\nunexpected amenities such as hot tubs and fireplaces.<br/>\n&gt;<br/>\n&gt; For a listing of HI-AYH ski hostels and the Ski Areas they are near,<br/>\ndiscounts, etc. go to our Web site at<br/>\nhttp://www.hiayh.org/skihostels/ski.htm<br/>\n&gt;<br/>\n&gt; ===========<br/>\n&gt; Mexico City - Ole!<br/>\n&gt;<br/>\n&gt; Bustling Mexico City is the longest continuously inhabited city in the<br/>\nWestern Hemisphere and is now the largest city in the world.  Visitors will<br/>\nfind an abundance of historic sites, museums, parks and gardens, and<br/>\ncathedrals along with restaurants for every taste, theater and more.<br/>\n&gt;<br/>\n&gt; Hostelling International has two hostels in Mexico City.  Hostel Catedral<br/>\nis located in the Zocalo, or central plaza, which is the world&#39;s largest<br/>\nsquare and Mexico City&#39;s main historic district.  The hostel is just one<br/>\nblock from the Zocalo subway station which brings you to The Anthropology<br/>\nMuseum, Chapultepec Park, the Zona Rosa and many other sites.<br/>\n&gt;<br/>\n&gt; Hostel Catedral has 24-hour access, an Internet Center, a restaurant which<br/>\nserves Mexican and Italian specialties, laundry facilities and a travel<br/>\nagency.  The hostel has 209 beds and until January 1, 2001, the overnight<br/>\nfee is just $9 (U.S.), which includes breakfast!  After January 1st, the<br/>\nprice will rise to the princely sum of $12.<br/>\n&gt;<br/>\n&gt; The other hostel, Hostel Home, is a cozy 20-bed, located in the Colonia<br/>\nRoma, convenient to the subway.  The hostel has 24-hour access, guest<br/>\nkitchen facilities, a TV room, tourist information and bicycle rentals.  The<br/>\novernight fee at Hostel Home is just $8 - a bargain anywhere.<br/>\n&gt;<br/>\n&gt; Both hostels can make reservations at other hostels in Mexico.<br/>\n&gt;<br/>\n&gt; Hostel Catedral<br/>\n&gt; Guatemala 4, Colonia Centro<br/>\n&gt; Mexico City<br/>\n&gt; Telephone: (52) (5) 662 82 44<br/>\n&gt; Fax: (52) (5) 663 15 56<br/>\n&gt; E-mail: hostellingmexico@...<br/>\n&gt;<br/>\n&gt; Hostel Home<br/>\n&gt; Tabasco 303, Colonia Roma<br/>\n&gt; Mexico City<br/>\n&gt; Telephone/Fax: (52) (5) 511 26 98<br/>\n&gt;<br/>\n&gt; Check out both hostels, complete with photos, at their Web site:<br/>\nhttp://www.remaj.com.<br/>\n&gt;<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; 3. READERS SHARE THEIR FAVORITE HOSTEL<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; *Olympic Hostel, Port Townsend in Port Townsend, Washington*<br/>\n&gt;<br/>\n&gt; Lynn Jones comments, &quot;I have to write to praise a wonderful hostel we<br/>\nstayed at a  month ago. It is the Port Townsend Hostel in Washington State.<br/>\nIt sits on a gorgeous spot overlooking the Puget Sound. It is by far the<br/>\nCLEANEST, most well-run hostel I have ever stayed at. Port Townsend is very<br/>\nexpensive to visit as the hotels are geared to the tourist trade, but I<br/>\ndon&#39;t think there is a nicer place to stay than the hostel and for a<br/>\nfraction of the price. There are wonderful things to do and see in the area.<br/>\nA fascinating hands-on marine museum, beautifully restored historic<br/>\nbuildings, beach front meandering, and great restaurants and shops to name a<br/>\nfew. This is a real destination spot. Thanks HI-AYH!&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; *Loch Lomond and the Oban Hostel in Scotland*<br/>\n&gt;<br/>\n&gt; Nancy Wilson comments, &quot;In September 2000, we stayed in two hostels in<br/>\nScotland that were special. One was the castle on Loch Lomond mentioned in<br/>\nthe recent HI online newsletter. It has a beautiful view of Loch Lomond,<br/>\nwith a three story atrium as well as carved wooden panels and fireplaces.<br/>\nOur room was up in a dormer under the roof -- 77 steps up! But worth it. The<br/>\nother hostel we enjoyed was the one in Oban, Scotland. The hostel sits on<br/>\nthe Esplanade and has a view out towards the sea and islands. The hostel was<br/>\ncomfortable and remarkable.&quot;<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; 4. TRAVEL TRIVIA<br/>\n&gt;<br/>\n&gt; And the answers from last issue&#39;s trivia questions are:<br/>\n&gt;<br/>\n&gt; Hostel #1<br/>\n&gt; Answer: Bar Harbor Hostel in Bar Harbor, Maine<br/>\n&gt;<br/>\n&gt; Hostel #2<br/>\n&gt; Answer: New Chicago Hostel in Chicago, Illinois<br/>\n&gt;<br/>\n&gt; Congratulations to... Chris Gunther for his correct answers. We received<br/>\nmany correct answers so a random drawing was held to determine the winner.<br/>\nChris won a Casio Thermo travel alarm.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; NEW TRAVEL TRIVIA<br/>\n&gt;<br/>\n&gt; Unscramble the names of these ski hostels. Please refer to<br/>\nhttp://www.hiayh.org/skihostels/ski.htm for a complete ski hostel listing.<br/>\n&gt;<br/>\n&gt; *rodguan<br/>\n&gt; *pleans<br/>\n&gt; *telltotni<br/>\n&gt; *poolyeih<br/>\n&gt; *carhinure<br/>\n&gt; *cospoon<br/>\n&gt; *seelwi<br/>\n&gt; *duldimyber<br/>\n&gt;<br/>\n&gt; Send your answers to hitravelbytes@.... The prize will be an Eagle<br/>\nCreek Travel Pillow. In the case of a tie, a random drawing will be held to<br/>\ndetermine the winner. So don&#39;t delay, go to the link provided and submit<br/>\nyour entries. Good Luck!<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; 5. TRAVELERS WANTED<br/>\n&gt; Paging travelers in Washington DC, the Research Triangle, and San Diego...<br/>\n&gt;<br/>\n&gt; Love to travel but still weeks or months away from your last trip?  Do you<br/>\nget the travel bug more often than the common cold?  Do you find yourself<br/>\nbrowsing the travel section of every bookstore you set foot in?  Are you<br/>\nalways on the lookout for fresh new international films or music?  Do you<br/>\nattend workshops and seminars that feature distant lands and different<br/>\ncultures?  Can&#39;t get enough of the Travel Channel?  Do you spend time<br/>\nlearning (or thinking about learning) foreign languages?  Is your favorite<br/>\nthing about hostelling the other travelers that you meet in the kitchens and<br/>\ncommon rooms?  Is it all about the journey rather than the destination?<br/>\n&gt;<br/>\n&gt; If you&#39;re nodding your head to any of this, you&#39;re not alone.  And if you<br/>\nlive in or near Washington, DC, San Diego, CA or the Raleigh/Durham/Chapel<br/>\nHill area of North Carolina, there&#39;s a new way to do something about it.  In<br/>\nthese cities, HI-AYH is helping local groups of travelers like yourself get<br/>\ntogether so that they can socialize a little and locally promote the rewards<br/>\nof independent travel and hostelling.  Sound like fun?  To find out more,<br/>\nsend an email to traveler@....<br/>\n&gt;<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; 6. YOU&#39;RE INVITED!<br/>\n&gt; Chicago Hostel Ribbon Cutting Scheduled for December 4<br/>\n&gt;<br/>\n&gt; The Honorable Neil F. Hartigan and Hostelling International - American<br/>\nYouth Hostels proudly invite you to attend the ribbon cutting and dedication<br/>\nof Hostelling International - Chicago, the J. Ira & Nicki Harris Family<br/>\nHostel on Monday, December 4, 2000, 10:30am, 24 E. Congress Parkway,<br/>\nChicago, Illinois.  Tours of the hostel will follow the ceremony. Check out<br/>\nhttp://www.hichicago.org for more information.<br/>\n&gt;<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; TALK TO US!<br/>\n&gt; We really value our reader&#39;s comments and suggestions. We&#39;d like to know<br/>\nwhat you would like us to feature in upcoming issues of our newsletter. Send<br/>\nyour thoughts in an e-mail to: HItravelbytes@....<br/>\n&gt;<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; NEED GUIDEBOOKS?<br/>\n&gt; Purchase them though our partnership with Amazon.com, and support<br/>\nhostelling at the same time!  Visit http://www.hiayh.org/amazon/amazon.htm.<br/>\n&gt;<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; HELP SUPPORT THE FUTURE OF HOSTELLING<br/>\n&gt; We are a nonprofit organization with a charitable mission:  &quot;To help all,<br/>\nespecially the young, gain a greater understanding of the world and its<br/>\npeople, through hostelling.&quot;  Support the future of hostelling by making a<br/>\nfinancial contribution to HI-AYH through our secure online donations site at<br/>\nhttp://www.hiayh.org/support/ways2.htm or contact Susan Hyatt at<br/>\nshyatt@....<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; NEW ONLINE PARTNERSHIP WITH SNAPFISH<br/>\n&gt; Sign up for Snapfish and receive FREE film developing, FREE set of prints<br/>\non Kodak paper, FREE email picture sharing with friends and FREE online<br/>\nphoto albums. Plus, easy reprint ordering... from digital camera pictures<br/>\ntoo. Plus, you contribute to HI-AYH when you register for the Snapfish<br/>\nservice. Just visit our Web site at http://www.hiayh.org and click on the<br/>\nbanner ad.<br/>\n&gt;<br/>\n&gt; ****************************<br/>\n&gt;<br/>\n&gt; FOOTNOTES...<br/>\n&gt;<br/>\n&gt; To join HI-AYH...  http://www.hiayh.org/membship/membindx.htm<br/>\n&gt;<br/>\n&gt; To find HI-AYH sponsored travel workshops near you...<br/>\nhttp://www.hiayh.org/btw/btwsched.htm<br/>\n&gt;<br/>\n&gt; To volunteer...  http://www.hiayh.org/support/volunteer.htm<br/>\n&gt;<br/>\n&gt; To shop and support HI-AYH...  http://www.hiayh.org/amazon/amazon.htm<br/>\n&gt;<br/>\n&gt; To make a donation...  http://www.hiayh.org/support/ways2.htm<br/>\n&gt;<br/>\n&gt; To subscribe or unsubscribe...<br/>\n&gt; http://www.hiayh.org/newsletter/newsletter.htm<br/>\n&gt;<br/>\n&gt; ===========<br/>\n&gt; OUR MISSION ...<br/>\n&gt; Hostelling International-American Youth Hostels is a nonprofit<br/>\norganization dedicated to helping all, especially the young, gain a greater<br/>\nunderstanding of the world and its people through hostelling.<br/>\n&gt; ===========<br/>\n&gt; HI-Travel Bytes is published as a service for members and friends of<br/>\nHostelling International.   Information may be reprinted with permission.<br/>\nSend e-mail to HItravelbytes@....<br/>\n&gt; ===========<br/>\n&gt; c.  2000 Hostelling International<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ---<br/>\n&gt; You are currently subscribed to hitravelbytes as: andersen@...<br/>\n&gt; To unsubscribe send a blank email to<br/>\nleave-hitravelbytes-3245526M@... </span></blockquote></div>","specialLinks":[]}],"prevTopicId":14130,"nextTopicId":14137}}