{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":2523757,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Special needs children","postDate":"1045087618","msgId":58560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBIQTcwMEtaTVVSTVNaQG10YTYuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":58559,"nextInTime":58561,"topicId":58560,"numMessagesInTopic":0,"msgSnippet":"... snip ... snip ... This last part is simply what I would do. Explain that because the controllers keep getting broken and you can t afford to keep buying","messageBody":"<div id=\"ygrps-yiv-1268667576\"><blockquote><span title=\"ireply\">&gt;So, I am going to pick one thing that is really <br/>\n&gt; causing a lot of stress, upset, and emotional turmoil in our home right now.<br/>\n </span></blockquote>snip<br/>\n<blockquote><span title=\"ireply\"> &gt; Video games.   Yes, both of my sons ( 7 and 11) love them.<br/>\n </span></blockquote>snip<br/>\n<blockquote><span title=\"ireply\"> &gt; Well, Ethan threw the controller on the Xbox within a week of getting it.. I<br/>\n&gt; bought a new one ( to the suggestion of list members).. He threw it and broke<br/>\n&gt; it in less than 2 weeks..  We had to wait another 2 weeks to get one .. (<br/>\n&gt; money and time issues).. So, I bought a new one. He broke it the next day.<br/>\n&gt; OK.. in the mean time.. I had also bought ANOTHER N64 to help with the<br/>\n&gt; &quot;sharing&quot; problem.   There were a total of 5 controllers for N64.. Now, we&#39;re<br/>\n&gt; down to 1.. Either Ethan or JP broke all of them.   They love the action of<br/>\n&gt; playing the games.. BUT, neither of them can take the frustration of losing<br/>\n&gt; or not &quot;getting&quot; what they want in the game.  They scream, cry, cuss, throw<br/>\n&gt; things.   Hit each other, basically throw INTENSE temper tantrums.  I have<br/>\n&gt; tried to play the games with them..<br/>\n<br/>\n </span></blockquote>This last part is simply what I would do. Explain that because the<br/>\ncontrollers keep getting broken and you can&#39;t afford to keep buying new<br/>\nones, that you&#39;re going to help them learn to calm down enough not to break<br/>\nthem when they play.<br/>\n<br/>\nSit right next to the one playing, and if he looks like he&#39;s about to lose<br/>\nit, be ready to catch the throwing arm. :) Keep the controllers with you<br/>\notherwise, and make as much time as you can (and hopefully as your husband<br/>\ncan) to play with them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;( also, they tend to get<br/>\n&gt; frustrated with games and I have to continually buy new ( used) ones)..<br/>\n<br/>\n </span></blockquote>This is only a problem if it is not affordable and is cutting into other<br/>\nthings the family needs and wants. If this is the case, an allowance for<br/>\neveryone in the house may help, and if they have enough to buy a game, fine,<br/>\nif not, time to save up.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thier days are rounds of playing, screaming, crying, tantrums. more playing..<br/>\n&gt; They are NOT interested in anything else.. I have to MAKE.. yes.. MAKE,<br/>\n&gt; physically pick up or manuever them to go out  with me.  Its not a good idea<br/>\n&gt; to leave a 7 and 11 yo at home alone and its not fair for the Anna and I to<br/>\n&gt; stay home all the time.. I try to do most of my &quot;outside&quot; stuff when my<br/>\n&gt; oldest son gets home or my husband so they boys can stay.. But, I cant do it<br/>\n&gt; ALL after 3:00.. Anna wants to go to band, the library, other homeschool<br/>\n&gt; activites.  Its a BIG TIME &quot;struggle&quot; ( and thats a mild word)  to get them<br/>\n&gt; to stop playing video games for anything..<br/>\n<br/>\n </span></blockquote>This has little to do with the specifics of video games and much to do with<br/>\nthe frustration in any family over scheduling. We are lucky that my husband<br/>\nand I both work at home, so when Brit wants to go with me on errands and<br/>\nMikey does not, it&#39;s very easy to leave Mikey at home with Dad. If we did<br/>\nnot have that, we would have to work out compromises.<br/>\n<br/>\nOne compromise might be hand-held games for the boys they can take with them<br/>\n(once they&#39;ve gotten beyond the throwing things stage, perhaps). The library<br/>\nis probably open after 3 p.m. some days? If Anna can be dropped off with<br/>\nanother Mom at some activities (or, better yet, picked up by another Mom at<br/>\nyour door) you can ask for that kind of help and can stay more often where<br/>\nthe boys want to be. In any family, these things will be a balancing act at<br/>\nsome points.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  You know, if they were happily<br/>\n&gt; playing,  loving every minute of it.. at least I could understand why they<br/>\n&gt; dont want to stop to go somewhere ( thats the only time I make them stop..<br/>\n&gt; not to eat, sleep or &quot;anything&quot; else)   But they are NOT happy at least half<br/>\n&gt; the time they are playing.. They are mad, angry, flailing about throwing<br/>\n&gt; tantrums, breaking stuff, fighting each other.  WHAT THE HELL IS FUN ABOUT<br/>\n&gt; THAT??? Or.. what is being &quot;learned&quot;??  Its nothing but a terriblly<br/>\n&gt; exhaustive stress on me and them and thier sibs.<br/>\n<br/>\n </span></blockquote>Do they never have any kind of tantrums or fighting ever except over video<br/>\ngames? Ever? I am pretty sure the answer is that they have trouble with<br/>\nimpulse control (not necessarily surprising in a couple of boys of their<br/>\nages, though not universal) and that you&#39;re just seeing more of it with<br/>\nvideo games -- perhaps because you don&#39;t like video game playing, perhaps<br/>\nbecause since that&#39;s their main activity at the moment it would naturally be<br/>\nwhere you would see it, perhaps because it&#39;s new and very important to them<br/>\ntheir emotions run higher there than anywhere.<br/>\n<br/>\nBut as for what they are learning: they are learning how to handle<br/>\nfrustration. If you leave them to their own devices, they will learn poorly<br/>\n(learning to throw the controls, learning to brangle with each other). If<br/>\nyou are right there to protect property and life and limb, to prevent them<br/>\nfrom assaulting each other or the game itself, they can learn (perhaps not a<br/>\nquickly as you&#39;d like) how to be more controlled in their behavior.<br/>\n<br/>\nIt might also help to have you and your husband start playing the games they<br/>\nlike. You will play badly &lt;g&gt;. There&#39;s no helping that, the only way to play<br/>\nas well as they do will be to play as often as they do, which will probably<br/>\nnot happen. Ask for their help. If you get to a stuck point where they&#39;ve<br/>\nalready succeeded and they can take the controls and show you what to do,<br/>\nall the better.<br/>\n<br/>\nPam</div>","specialLinks":[]}],"prevTopicId":58519,"nextTopicId":58526}}