{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":31740294,"authorName":"Inna Manni","from":"Inna Manni &lt;SpinFrog@...&gt;","profile":"spinfrog","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: The Hidden Agenda of Teaching","postDate":"1074568356","msgId":89565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTIwMDMxMjM2Ljk1MTgucW1haWxAd2ViNDA5MDgubWFpbC55YWhvby5jb20+","inReplyToHeader":"PGJ1ZWg3NytzNGg5QGVHcm91cHMuY29tPg=="},"prevInTopic":89351,"nextInTopic":0,"prevInTime":89564,"nextInTime":89566,"topicId":89244,"numMessagesInTopic":0,"msgSnippet":"Hi Linda, I have also considered teaching childbirth ed. I have taken a class a few years ago to be a doula and one of my teachers was a childbirth educator as","messageBody":"<div id=\"ygrps-yiv-482718768\">Hi Linda,<br/>\n<br/>\nI have also considered teaching childbirth ed. I have taken a class a<br/>\nfew years ago to be a doula and one of my teachers was a childbirth<br/>\neducator as well as a doula, so I got to sit in on one of her<br/>\nclasses. Then when I was pregnant I spent all my time studying for<br/>\nthe birth. I feel like I know a lot. I cannot do it yet because my<br/>\ndaughter is only two, but as she gets older I think it would be good<br/>\nfor her if she got to be around classes like that. <br/>\n<br/>\nWhat I know about my teacher&#39;s practice: she started out as a Bradley<br/>\ninstructor but by the time I met her she had decided that she did not<br/>\nagree with everything this method teaches. So she did not renew her<br/>\ncertification, but was teaching from her own &#39;curriculum&#39;. The class<br/>\nI attended has 5 couples and she charged $100 a couple. <br/>\n<br/>\nI have talked &#39;business issues&#39; to other doulas and childbirth<br/>\neducators, and it seems that while being compensated is a nice perk,<br/>\nthe big thing also is respect. A lot of couples will sign up for<br/>\nclass and then never go, unless they spent money. And same with<br/>\ndoulas - if the client didn&#39;t pay, there is a good chance that they<br/>\nwill not evel call you for the birth. <br/>\n<br/>\nI know how it can feel really strange asking to be paid for something<br/>\nyou&#39;d do for free, and asking actual people and not a company. But I<br/>\nthink at least a symbolic charge is necessary in order for you to be<br/>\nrespected. <br/>\n<br/>\nInna - IL<br/>\n<br/>\n<br/>\n--- eaglefalconlark &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:eaglefalconlark@...\">eaglefalconlark@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; because of a <br/>\n&gt; desire to help people with knowledge and skills that I have, I have<br/>\n&gt; <br/>\n&gt; known for a long time that I would like to teach childbirth <br/>\n&gt; education. And be compensated for it of course. Yet money creates <br/>\n&gt; problems with my vision on many levels. <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Hotjobs: Enter the &quot;Signing Bonus&quot; Sweepstakes<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://hotjobs.sweepstakes.yahoo.com/signingbonus\">http://hotjobs.sweepstakes.yahoo.com/signingbonus</a></div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The Hidden Agenda of Teaching","postDate":"1074487857","msgId":89351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5LjM2M2FmYTkuMmQzY2JjMzFAYW9sLmNvbT4="},"prevInTopic":89341,"nextInTopic":89565,"prevInTime":89350,"nextInTime":89352,"topicId":89244,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/18/2004 4:44:54 PM Central Standard Time, ... I guess I wasn t thinking of classes so much, we are not big class people here at least not","messageBody":"<div id=\"ygrps-yiv-1213916964\">In a message dated 1/18/2004 4:44:54 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think it&#39;s tough to offer a class to unschoolers. <br/>\n<br/>\n </span></blockquote>I guess I wasn&#39;t thinking of classes so much, we are not big class people <br/>\nhere at least not in the sense I am seeing so much of these days. I think it&#39;s <br/>\ngreat for those who want it but my kids have always resisted anything that felt <br/>\nlike school. But they will do very short term things and they will try things <br/>\nthat are not age segregated. My 16yro and I did a weekend airbrush body tattoo <br/>\nworkshop together this past fall and then my 12yros and husband took a one <br/>\nday airbrush class. <br/>\nLaura<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: The Hidden Agenda of Teaching","postDate":"1074482410","msgId":89341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGJ1ZWg3NytzNGg5QGVHcm91cHMuY29tPg=="},"prevInTopic":89331,"nextInTopic":89351,"prevInTime":89340,"nextInTime":89342,"topicId":89244,"numMessagesInTopic":0,"msgSnippet":"You might find a way in by becoming a doula. Usually it is an apprentice situation for the learning. Robyn L. Coburn ","messageBody":"<div id=\"ygrps-yiv-233620992\">You might find a way in by becoming a doula. Usually it is an apprentice<br/>\nsituation for the learning.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;evidence of a certain level of expertise, which means training and <br/>\ncertification (which in itself would cost *me* quite a bit of money) <br/>\nand the classes would need to cover a range of things that I am not <br/>\nnecessarily interested in teaching about&gt;&gt;<br/>\n<br/>\n<br/>\n---<br/>\nIncoming mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.561 / Virus Database: 353 - Release Date: 1/13/2004<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.561 / Virus Database: 353 - Release Date: 1/13/2004<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163132749,"authorName":"ivorygrace7@aol.com","from":"ivorygrace7@...","profile":"ivorygrace7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The Hidden Agenda of Teaching","postDate":"1074467865","msgId":89331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4LjE3ZDI5OTYuMmQzYzZlMTlAYW9sLmNvbT4="},"prevInTopic":89320,"nextInTopic":89341,"prevInTime":89330,"nextInTime":89332,"topicId":89244,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/18/2004 5:44:44 PM Eastern Standard Time, danielle.conger@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-1860901245\">In a message dated 1/18/2004 5:44:44 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n&lt;&lt;Initially, my girls really wanted to sign up but then lost interest part <br/>\nway through. I was still interested and felt an obligation (in a good way) to <br/>\ncontinue to attend, so I told my girls that they could color while I paid <br/>\nattention. Chances are we were more disruptive than anyone because my kids were the <br/>\nyoungest members there. Overall, I really enjoyed taking the class and learned <br/>\na lot, which my kids then picked up at home while I was practicing. So I <br/>\nthink it was a positive experience overall, for us. But I don&#39;t know that my <br/>\nfriend will ever offer another class again.&gt;&gt;<br/>\n<br/>\n<br/>\nI have been thinking about classes a lot lately.  My oldest daughter <br/>\ncurrently takes ballet in a group with other teens and adults and voice in a private <br/>\nlesson.  She has also studied violin, both privately and in a group off and on, <br/>\nsince she was 3.  My other 5 kids have never taken any formal lessons with <br/>\nthe exception of Antonio playing Pop Warner football one year.<br/>\n<br/>\nI often feel guilty that I don&#39;t have enough money for all of my kids to take <br/>\nlessons in a lot of things right now.  I&#39;m starting to let it go because I <br/>\nrealize that although some of them have expressed interest in classes, I was <br/>\nusually the one who brought lessons up and made them seem great.  I&#39;m starting to <br/>\nrealize that I was the one who always wanted to take all these lessons, and <br/>\nthat right now, I am the one who should probably take them if we can afford it. <br/>\n I&#39;ve always felt guilty spending money on lessons for me.  I&#39;ve thought that <br/>\nI owed it to my kids to give them all these advantages.  Now I&#39;ve realized <br/>\nthat I really need to listen to what they want and not my expectations of what <br/>\nwould be fun for them.  Right now, Emily teaches ballet to Antonio, Paige, <br/>\nJoAnn, and me a couple of times a week, very informally, and that is probably <br/>\nenough of that for now.  If they want lessons in the future, we&#39;ll work it out.  <br/>\nFor now, if I want to learn something and I can&#39;t teach myself, I&#39;m going to <br/>\ninvest our money in my learning.  Then if my children express an interest, I <br/>\nwill be able to show them what I learned without the structure and challenges of <br/>\nmore formal learning situations.<br/>\n<br/>\n--Jacqueline<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The Hidden Agenda of Teaching","postDate":"1074463804","msgId":89320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGMwMWMzZGUwZiRkMzFlOWI2MCQ2NDAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PDc1LjIwYzYwMmFmLjJkM2I3YjJjQGFvbC5jb20+"},"prevInTopic":89306,"nextInTopic":89331,"prevInTime":89319,"nextInTime":89321,"topicId":89244,"numMessagesInTopic":0,"msgSnippet":"I came across this article while browsing tonight and it hit on some things I have been thinking about lately, about how we can find ways to share what we know","messageBody":"<div id=\"ygrps-yiv-292971710\">I came across this article while browsing tonight and it hit on some things I <br/>\n  have been thinking about lately, about how we can find ways to share what we <br/>\n  know and get others to share. I used to try to think of more ways to make <br/>\n  money but now I find myself thinking about more ways to bring people together. <br/>\n  Lately I&#39;ve been thinking more about how to make more of a difference in the <br/>\n  world around me, I mean the immediate world around me like friends and family and <br/>\n  hoping it would branch out from there. OK, enough rambling, here&#39;s the link &lt;<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.life.ca/nl/49/art.html\">http://www.life.ca/nl/49/art.html</a>&gt;<br/>\n  Laura Buoni<br/>\n  =========================================================================================<br/>\n<br/>\nI think it&#39;s tough to offer a class to unschoolers. My kids take art classes and karate, but they&#39;re in a more formal setting where they are expected to behave in a certain way and we are free to stop coming for whatever reason (out the $$, of course). And we&#39;re likely the only homeschoolers in the class, never mind unschoolers.<br/>\n<br/>\nBut we had a friend offer an American Sign Language class (she might be reading this now and could speak to the issue better than I) where most of the students were unschoolers of vastly different ages. I know she struggled with a lot of the same issues that the article raises--how much structure to enforce or expect, what to do when students or her son were no longer interested in what was going on, how to gear the lessons to kids of varying ages, etc. <br/>\n<br/>\nInitially, my girls really wanted to sign up but then lost interest part way through. I was still interested and felt an obligation (in a good way) to continue to attend, so I told my girls that they could color while I paid attention. Chances are we were more disruptive than anyone because my kids were the youngest members there. Overall, I really enjoyed taking the class and learned a lot, which my kids then picked up at home while I was practicing. So I think it was a positive experience overall, for us. But I don&#39;t know that my friend will ever offer another class again. <br/>\n<br/>\nI don&#39;t know how you can do something structured with a whole group of unschoolers. I don&#39;t know how that would work really, but it&#39;s interesting to think about.<br/>\n<br/>\n--danielle<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157311507,"authorName":"eaglefalconlark","from":"&quot;eaglefalconlark&quot; &lt;eaglefalconlark@...&gt;","profile":"eaglefalconlark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The Hidden Agenda of Teaching","postDate":"1074448423","msgId":89306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1ZWg3NytzNGg5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1LjIwYzYwMmFmLjJkM2I3YjJjQGFvbC5jb20+"},"prevInTopic":89252,"nextInTopic":89320,"prevInTime":89305,"nextInTime":89307,"topicId":89244,"numMessagesInTopic":0,"msgSnippet":"Laura, thanks for posting that, it was a timely thing for me to read. I ve been thinking about this a lot lately -- because of a desire to help people with","messageBody":"<div id=\"ygrps-yiv-226411391\">Laura, thanks for posting that, it was a timely thing for me to <br/>\nread. I&#39;ve been thinking about this a lot lately -- because of a <br/>\ndesire to help people with knowledge and skills that I have, I have <br/>\nknown for a long time that I would like to teach childbirth <br/>\neducation. And be compensated for it of course. Yet money creates <br/>\nproblems with my vision on many levels. For one thing, if I&#39;m <br/>\ncharging I have to consider doing what people have come to expect <br/>\nfrom people in this field. Starting out, I would be expected to show <br/>\nevidence of a certain level of expertise, which means training and <br/>\ncertification (which in itself would cost *me* quite a bit of money) <br/>\nand the classes would need to cover a range of things that I am not <br/>\nnecessarily interested in teaching about; it seems a simple enough <br/>\nthing to just offer an approach I am comfortable with, yet because <br/>\nno one else is doing it yet (and I have not done it yet myself) <br/>\nthere is not a precedent to help me and clients determine cost-<br/>\nworth. There are other problems with it as well. One is from the <br/>\nclient side -- the client cannot be in it just for the learning that <br/>\nthey are ready for and desire, they feel they also have to &quot;get <br/>\nsomething for my money.&quot; <br/>\n<br/>\nLast year I witnessed something heartbreaking that really made me <br/>\naware of this in a big way. I signed my boys up for an art class. <br/>\nThe children&#39;s ages in the class ranged from 3-6 years old, so my <br/>\ndaughter (who was 2 at the time) could not be officially enrolled, <br/>\nbut the teacher was fine with her using the art supplies. Sometimes <br/>\nmy daughter would be into it, but sometimes she would be more <br/>\ninterested in running around in a nearby room normally used for <br/>\ndance classes. Well, there was a very young boy, probably only just <br/>\nturned 3, who related to my daughter more than to the other kids in <br/>\nthe class, who were all older than him. He also seemed to be just <br/>\nbarely interested in working with the art materials. So everyone <br/>\nwould be sitting around doing their projects and my daughter would <br/>\nwander off and immediately he would be aware of this and would want <br/>\nto wander off with her. His mom was pretty successful at keeping him <br/>\nworking at the table. The trouble began when my boys decided to go <br/>\nrun around with their sister, which I had no problem with; nor did <br/>\nit interfere with the teacher&#39;s teaching, as really it only amounted <br/>\nto laying out basic projects and supplies and letting everyone have <br/>\nat it. But now this little boy couldn&#39;t stand it, because other kids <br/>\nin the class were allowed a freedom he wasn&#39;t. It clearly didn&#39;t <br/>\nmake sense to him. Usually his mom could coerce him into staying in <br/>\nthe classroom, but one day he just absolutely rebelled. He would not <br/>\nlisten to her. He started running around with my daughter gleefully <br/>\n(my boys were still working on their projects.) His mom tolerated <br/>\nthis for a minute or two, then told him he had to get back to the <br/>\nclass. The teacher herself tried to coax him back to class, no doubt <br/>\nfeeling guilty that she was taking his mother&#39;s money yet couldn&#39;t <br/>\ndo her job, i.e., keep his attention. But he was just absolutely <br/>\ndone with art and wouldn&#39;t go back. This is when it got ugly. She <br/>\nstarted guilt tripping him (&quot;I pay all this money, and you&#39;re not <br/>\neven doing it. Well maybe I just won&#39;t ever pay for you to take a <br/>\nclass again.&quot;) He still resisted, and she got more angry and more <br/>\nforceful. This struggle went on for quite a while, and finally he <br/>\ngave in and went back with her. It was awful. I thought, geez, good <br/>\nway to encourage a love of art and learning in this poor kid. But <br/>\nall she could think about was that she wasn&#39;t getting her money&#39;s <br/>\nworth. I&#39;m not suggesting that the teacher should have done these <br/>\nclasses for free (she appeared to be a poor art-student type, for <br/>\nall I know she was relying on those classes to pay her rent,) only <br/>\nthat the experience for both teacher and student was spoiled because <br/>\nmoney and obligation were primary concerns for the adults involved.<br/>\n<br/>\nAnyway, I don&#39;t know yet what the answer for me is, how I will be <br/>\nable to reconcile these things. Maybe this would only be a temporary <br/>\nfix, I don&#39;t know how satisfying it would ultimately be, but the <br/>\nother night it occured to me that I could just leave money out of <br/>\nthe equation until it naturally becomes part of the equation (could <br/>\nit be possible that it would?) It really opens things up when you <br/>\ndon&#39;t expect to be monetarily compensated. It opens *people* up, <br/>\nbecause whatever relationship develops has nothing to do with it <br/>\nbeing a business deal, which makes people tend to feel guarded and <br/>\nsnarky and vulnerable. It would give me flexibility and freedom to <br/>\ndiscover the approach to this work that is most personally <br/>\nfulfilling to me. As far as mentorship goes, if I expect to be paid <br/>\nI have to expect to pay (in money and obligations attached to that <br/>\nmoney.) But instead I could call the local midwife up and say, &quot;I&#39;m <br/>\nhere, I&#39;m not competition and I don&#39;t expect anything in return, I <br/>\njust want to learn and give something to the community (teach). Can <br/>\nyou use me or help me find a way to do this?&quot; How could she resist?<br/>\n<br/>\nStill thinking about this, but while I can (that is, while money <br/>\ndoes not *need* to be the focus for me) do it this way, it is <br/>\nlooking like a pretty attractive way to do what I want to do.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The Hidden Agenda of Teaching","postDate":"1074408761","msgId":89252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5MTFFQjhELTQ5ODItMTFEOC1BRERBLTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDc1LjIwYzYwMmFmLjJkM2I3YjJjQGFvbC5jb20+","referencesHeader":"PDc1LjIwYzYwMmFmLjJkM2I3YjJjQGFvbC5jb20+"},"prevInTopic":89244,"nextInTopic":89306,"prevInTime":89251,"nextInTime":89253,"topicId":89244,"numMessagesInTopic":0,"msgSnippet":"I just love Natural Life magazine and it s sister , Life Learning magazine.  :)  Thanks for reminding me that I want to renew since I m on my final issue of","messageBody":"<div id=\"ygrps-yiv-1249460481\">I just love Natural Life magazine and it&#39;s &quot;sister&quot;, Life Learning <br/>\nmagazine.  :)  Thanks for reminding me that I want to renew since I&#39;m <br/>\non my final issue of each subscription.  -Tracy-<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 18, 2004, at 1:01 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BonKnit@...\">BonKnit@...</a> wrote:<br/>\n<br/>\n&gt; I came across this article while browsing tonight and it hit on some <br/>\n&gt; things I<br/>\n&gt; have been thinking about lately, about how we can find ways to share <br/>\n&gt; what we<br/>\n&gt; know and get others to share.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.life.ca/nl/49/art.html\">http://www.life.ca/nl/49/art.html</a> </span></blockquote></div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Hidden Agenda of Teaching","postDate":"1074405676","msgId":89244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1LjIwYzYwMmFmLjJkM2I3YjJjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":89252,"prevInTime":89243,"nextInTime":89245,"topicId":89244,"numMessagesInTopic":0,"msgSnippet":"I came across this article while browsing tonight and it hit on some things I have been thinking about lately, about how we can find ways to share what we know","messageBody":"<div id=\"ygrps-yiv-914040538\">I came across this article while browsing tonight and it hit on some things I <br/>\nhave been thinking about lately, about how we can find ways to share what we <br/>\nknow and get others to share. I used to try to think of more ways to make <br/>\nmoney but now I find myself thinking about more ways to bring people together. <br/>\nLately I&#39;ve been thinking more about how to make more of a difference in the <br/>\nworld around me, I mean the immediate world around me like friends and family and <br/>\nhoping it would branch out from there. OK, enough rambling, here&#39;s the link &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.life.ca/nl/49/art.html\">http://www.life.ca/nl/49/art.html</a>&gt;<br/>\nLaura Buoni<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":89456,"nextTopicId":89534}}