{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":47,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Re: Beliefs is this unschooling?","postDate":"1064336724","msgId":81306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGNDkyQzAwLUVERTgtMTFENy1BRTQ0LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDAwMDgwMWMzODFlOCQ0YWExNWEzMCRkM2NkMDMwNEBhbHljZWRlc2s+"},"prevInTopic":81305,"nextInTopic":81315,"prevInTime":81305,"nextInTime":81307,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"On Tuesday, September 23, 2003, at 08:35  AM, Alyce - ... Hi!!! Welcome! ... Yeah - but, what if he was supposed to molest several others - what if he d","messageBody":"<div id=\"ygrps-yiv-124857902\">On Tuesday, September 23, 2003, at 08:35  AM, Alyce - <br/>\nVintageGuitarPro.com wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hey there Pam.<br/>\n<br/>\n </span></blockquote>Hi!!! Welcome!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; First let me say to this... UGH... Secondly though... If<br/>\n&gt; we wanted to believe this was all specifically spelled out before we <br/>\n&gt; got<br/>\n&gt; here... And I&#39;m not saying it was (specifically being the operative -<br/>\n&gt; there are myriad ways to learn whatever it is we&#39;re here to learn)...<br/>\n&gt; But if it were, wouldn&#39;t the jailing of the molester be part of the<br/>\n&gt; whole grand plan as well?  They should not be let go!  NO!  What would<br/>\n&gt; be the value of a lesson learned by a molester who goes free?  Not as<br/>\n&gt; valuable a lesson as that learned by a molester who is penalized I<br/>\n&gt; should think.<br/>\n<br/>\n </span></blockquote>Yeah - but, what if he was &quot;supposed&quot; to molest several others - what <br/>\nif he&#39;d contracted with them, too? If we jailed him, we&#39;d prevent him <br/>\nfrom doing that. But, no, if it was predestined, then the prosecutors <br/>\nand judges and everybody else involved must have contracted in advance <br/>\ntoo, either to jail him or not.<br/>\n<br/>\nOkay - enough - this is kind of a sickening conversation and beyond <br/>\ngiving me a headache just trying to follow it, its getting too <br/>\ndepressing for me. UGH is right.<br/>\n<br/>\nI liked this though: &quot;there are myriad ways to learn whatever it is <br/>\nwe&#39;re here to learn&quot; and I&#39;d add that we seem well able to keep finding <br/>\nways to learn the lessons we need to learn, until we do learn them.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064335245","msgId":81302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFERDhFOUJELUVERTQtMTFENy1BRTQ0LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDFkOS4xMTJmNzEyMi4yY2ExYzViYkBjcy5jb20+"},"prevInTopic":81290,"nextInTopic":81305,"prevInTime":81301,"nextInTime":81303,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... Its just sort of like there is a right path for him, and with the right support from his parents and others around him, he might be enabled to tread that","messageBody":"<div id=\"ygrps-yiv-1830296310\">On Tuesday, September 23, 2003, at 08:50  AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AimeeL73@...\">AimeeL73@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This applies to unschooling because we might not know what&#39;s going to <br/>\n&gt; happen<br/>\n&gt; in our lives, but we can learn as we live, to do our best when the <br/>\n&gt; worst comes<br/>\n&gt; along.   My son is living life and learning about himself, is <br/>\n&gt; following his<br/>\n&gt; own path with courage and confidence.  That might enable him to live <br/>\n&gt; his<br/>\n&gt; purpose, his path, his destiny, whatever you want to call it, whatever <br/>\n&gt; he was born<br/>\n&gt; to do.<br/>\n<br/>\n </span></blockquote>  Its just sort of like there is a right path for him, and with the <br/>\nright support from his parents and others around him, he might be <br/>\nenabled to tread that right path?<br/>\n<br/>\nIt doesn&#39;t sound like predestination to me, particularly not like a <br/>\npredestined path that he&#39;s chosen already and contracted with everyone <br/>\nelse who would need to carry out their part to make it all happen <br/>\nexactly as it is supposed to. It sounds like hopefulness that he&#39;ll <br/>\nlive a life that is meaningful to him, regardless of what life throws <br/>\nat him, and awareness that how he is parented matters in that process.<br/>\n<br/>\nI&#39;d say there are many, infinitely many, possible paths that are open <br/>\nto him and that this is more like a joint interactive story - a sort of <br/>\n&quot;choose your own adventure&quot;  life - that our life&#39;s path is being <br/>\ncreated by how we respond to the tests and difficulties (and joys and <br/>\ntriumphs and everything else) along the way AND how other people are <br/>\nresponding in their own lives.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":70316959,"authorName":"AimeeL73@cs.com","from":"AimeeL73@...","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064332219","msgId":81290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkOS4xMTJmNzEyMi4yY2ExYzViYkBjcy5jb20+"},"prevInTopic":81279,"nextInTopic":81302,"prevInTime":81289,"nextInTime":81291,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... That s the problem that most people have with it as well, and I understand that.  In it s simplest version that s exactly what it sounds like.  That s why ","messageBody":"<div id=\"ygrps-yiv-1584181837\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; I wasn&#39;t promoting it - I was saying that it would be dangerous if too  <br/>\n&gt; many people believed it. It is the most extreme version of &quot;blame the  <br/>\n&gt; victim&quot; I&#39;ve ever heard.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n<br/>\n </span></blockquote>That&#39;s the problem that most people have with it as well, and I understand <br/>\nthat.  In it&#39;s simplest version that&#39;s exactly what it sounds like.  That&#39;s why <br/>\nI wasn&#39;t surprised when Judie did not get a warm reception about her beliefs.  <br/>\nIt seemed to me that she may have had a incomplete understanding at the time <br/>\nand wasn&#39;t comfortable answering about that aspect.  Sometimes I am as well.  <br/>\n<br/>\nIt&#39;s incredibly difficult to understand and explain that blaming the victim <br/>\nis not at all what I am implying when I tell someone that maybe something was <br/>\nmeant to be.  I am only thinking that when something has already happened and <br/>\nthe person is trying to move on from, to heal from, to recover from, that <br/>\ntrauma, at a certain point in their life or process, that idea MAY help them. This <br/>\nis not a theory for me, but personal experience.  It is a complicated, painful <br/>\nexperience, to learn a life lesson from something they most definitely DID <br/>\nNOT WANT to happen to them. <br/>\n<br/>\nBut maybe, if that person looks back and sees the progression of their lives <br/>\nfrom that moment, sees the path they have taken and that they like where they <br/>\nare now, they may look back and see that if all that good came from the bad, <br/>\nwould they undo the trauma if they could?  Would they remove all they learned <br/>\nfrom that experience from their life?  In my own experience I could honestly <br/>\nsay, no, I wouldn&#39;t, and part of that acceptance is that maybe it was meant to <br/>\nbe that way.  <br/>\n<br/>\nOur spiritual selves are different in many ways then our physical selves.  We <br/>\nmay choose things on the spiritual plane that we would NEVER AGREE TO if we <br/>\nwere in a body at the time. The spiritual self wants to learn, and does what it <br/>\nneeds to do.  It knows that it will be hard on the physical self. It chooses <br/>\nit anyway.  I think that this idea may be what most people have a hard time <br/>\naccepting or understanding or agreeing with, and without that, the rest makes no <br/>\nsense.<br/>\n<br/>\nThis applies to unschooling because we might not know what&#39;s going to happen <br/>\nin our lives, but we can learn as we live, to do our best when the worst comes <br/>\nalong.   My son is living life and learning about himself, is following his <br/>\nown path with courage and confidence.  That might enable him to live his <br/>\npurpose, his path, his destiny, whatever you want to call it, whatever he was born <br/>\nto do.  I feel that&#39;s my responsiblity to him, to love him and support him as <br/>\nhe learns about this world and how to live in it, in whatever way he sees fit.  <br/>\nSomething inside him knows much better what&#39;s good for him and what is not, <br/>\nthan I do.  I have learned to trust that as much as I can.  <br/>\n<br/>\n~Aimee<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":124927644,"authorName":"Alyce - VintageGuitarPro.com","from":"&quot;Alyce - VintageGuitarPro.com&quot; &lt;alyce@...&gt;","profile":"alyce13j","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: Beliefs is this unschooling?","postDate":"1064331317","msgId":81305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWMzODFlOCQ0YWExNWEzMCRkM2NkMDMwNEBhbHljZWRlc2s+","inReplyToHeader":"PDEwNjQyNzY1MjMuMTg3MS4xMjkzMi5tOUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":81302,"nextInTopic":81306,"prevInTime":81304,"nextInTime":81306,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"Hey there Pam.  First let me say to this... UGH... Secondly though... If we wanted to believe this was all specifically spelled out before we got here... And","messageBody":"<div id=\"ygrps-yiv-349564093\">Hey there Pam.  First let me say to this... UGH... Secondly though... If<br/>\nwe wanted to believe this was all specifically spelled out before we got<br/>\nhere... And I&#39;m not saying it was (specifically being the operative -<br/>\nthere are myriad ways to learn whatever it is we&#39;re here to learn)...<br/>\nBut if it were, wouldn&#39;t the jailing of the molester be part of the<br/>\nwhole grand plan as well?  They should not be let go!  NO!  What would<br/>\nbe the value of a lesson learned by a molester who goes free?  Not as<br/>\nvaluable a lesson as that learned by a molester who is penalized I<br/>\nshould think. <br/>\n<br/>\nLet me just close by saying - so there&#39;s no question in anyone&#39;s mind -<br/>\nI in no way support letting the bad guy go because the good guy might<br/>\nlearn something from it... That&#39;s crap.  If people believe that it was<br/>\nall arranged beforehand for the purpose of a lesson, they would likely<br/>\nfurther believe the molester has a lesson coming too (possibly in the<br/>\nform of several years of torture from his fellow inmates... Sorry this<br/>\ngets me riled)... Else the two would not have been paired.<br/>\n<br/>\nI hope I was clear and non-confrontational... I do so hate getting beat<br/>\nup.  Lol.<br/>\n<br/>\n~Alyce<br/>\n<br/>\n---------<br/>\n   From: pam sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nSubject: Re: Re: Beliefs is this unschooling?<br/>\n<br/>\nIt was a quote from one of my posts, but I wasn&#39;t saying I believe it.  <br/>\nQuite the opposite.<br/>\n<br/>\nMy point was that if someone REALLY believed that individuals had,  <br/>\nbefore this lifetime,  chosen to be molested - in fact had arranged it  <br/>\nwith their molester - that there would be no reason to jail a molester.<br/>\n<br/>\nIf it was supposed to happen it would happen - jailing wouldn&#39;t prevent<br/>\n<br/>\nanything. And, according to the same beliefs, we&#39;re supposed to  <br/>\nrecognize that the poor molester was doing the molested person a favor  <br/>\nby carrying out this horrendous act so that the molested person could  <br/>\nlearn whatever lesson they were supposed to learn.<br/>\n<br/>\nI wasn&#39;t promoting it - I was saying that it would be dangerous if too  <br/>\nmany people believed it. It is the most extreme version of &quot;blame the  <br/>\nvictim&quot; I&#39;ve ever heard.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":70316959,"authorName":"AimeeL73@cs.com","from":"AimeeL73@...","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064325688","msgId":81279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5LjMzYjc3NDEyLjJjYTFhYzM4QGNzLmNvbT4="},"prevInTopic":81264,"nextInTopic":81290,"prevInTime":81278,"nextInTime":81280,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 6:52:59 PM Central Daylight Time, HMSL2@aol.com ... Sweetie, that quote above was a comment that someone made about why this ","messageBody":"<div id=\"ygrps-yiv-1516234555\">In a message dated 9/22/03 6:52:59 PM Central Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> <br/>\nwrites: <br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;There would be no point in locking up child molesters, for <br/>\n&gt; example, if the molester and the child had already CHOSEN in advance <br/>\n&gt; whether or not the molestation was going to take place. &gt;&gt;<br/>\n&gt; WHAT????????????<br/>\n&gt; When I was molested at 13 it was my destiny and he should not have been <br/>\n&gt; locked up? Im surprised at this statement. If this ever happened to your <br/>\n&gt; child you <br/>\n&gt; would NOT be speaking this crap. Try telling DHS &quot;oh my little girl/boy it <br/>\n&gt; &#39;twas his/her destiny to be raped you see&quot; Your destiny would bee the loss <br/>\n&gt; of <br/>\n&gt; your child.<br/>\n&gt; <br/>\n&gt; MY molester just went to jail for molesting his own daughter over the past <br/>\n&gt; 10 <br/>\n&gt; years. She is now a mess you think that is destiny???? <br/>\n&gt; <br/>\n&gt; I think not. Destiny should have been me putting him in jail had the people <br/>\n&gt; around me been less proud. I am putting the SOB away for more time now.  <br/>\n&gt; Statute of limitations to me is my destiny.<br/>\n&gt; <br/>\n&gt; Sick just sick..........<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; LAURA<br/>\n<br/>\n<br/>\n </span></blockquote>Sweetie, that quote above was a comment that someone made about why this <br/>\nbelief/idea does not make sense to them, and why.  I am sorry that we chose to use <br/>\nan example that applies to your personal life.....I&#39;m sorry.  <br/>\n<br/>\n~Aimee<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064300625","msgId":81264,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyLjNlMTI5YTdjLjJjYTE0YTUxQGFvbC5jb20+"},"prevInTopic":81263,"nextInTopic":81279,"prevInTime":81263,"nextInTime":81265,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 09:27:34 PM Central Daylight Time, jvaitkus@hotmail.com writes: I just needed to add this...  I don t think anyone was ever saying ","messageBody":"<div id=\"ygrps-yiv-1842391734\">In a message dated 9/22/03 09:27:34 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jvaitkus@...\">jvaitkus@...</a> writes:<br/>\n  I just needed to add this...  I don&#39;t think anyone was ever saying <br/>\nthat we should not have compassion for other people.  Using <br/>\ndifferent wording, I feel like what was meant is that everything <br/>\nhappens for a reason.  Everything happens in order for each of us to <br/>\nreach enlightenment.  It may feel great or it may feel bad, but it <br/>\nhappened to teach us something we needed to know, to work though, to <br/>\nexperience in order to reach enlightenment and to be truely happy.<br/>\nMaybe YOU feel this way, and I am sure others believe/feel this way too. <br/>\nRegardless, the original poster said in one of her many posts, and I quote; <br/>\n<br/>\n&quot;Whatever lesson they had to learn from it, they chose it.  I don&#39;t have to <br/>\nfeel bad about what they are experiencing.&quot; From Judie, the original poster of <br/>\nthis comment. Who after many direct questions, couldn&#39;t or wouldn&#39;t explain <br/>\nherself or her ideals more clearly. And you can say that you think she may have <br/>\nmeant this in a different way, but we will truly never know one way or the <br/>\nother. All the rest of us can do is accept that what she said is what she meant. <br/>\nIt is faulty logic to say she might have meant something more gentle, when she <br/>\nrepeatedly said that was exactly what she wanted to say and never clarified <br/>\nit with better language. Arguing the point again and again amongst ourselves is <br/>\na moot point, shaming others for posting their opinions of her posts won&#39;t <br/>\nget us further either. She is gone and we can&#39;t interpret what she might have <br/>\nwanted to say because all we have to go on is what she did say. <br/>\n<br/>\nI really must repeat what better people have said before me. Commenting on <br/>\none snip in a post out of hundreds isn&#39;t realistic. Maybe reading the whole <br/>\nthread would help. And that could be hard to do at this point because subject <br/>\nlines have changed, the original poster has left. Without explaining her beliefs <br/>\nmore clearly, I doubt you or anyone could say, I don&#39;t think she meant this or <br/>\nthat. <br/>\n<br/>\n   So again, I don&#39;t believe it was ever meant that we should not <br/>\ncare what happens to people, or that we should say &quot;well it&#39;s her <br/>\nfault such and such happened because she decided it would before she <br/>\ncame to this earth.&quot;<br/>\n   It is really hard to have a conversation like this over email.  <br/>\nNo one can really understand what someone else is saying because you <br/>\ncan&#39;t see the person, you can&#39;t hear his/her tone of voice (infact <br/>\nwe tend to add a tone ouselves wether or not it&#39;s valid) etc....<br/>\n   Anyway, that&#39;s how I feel, thanks<br/>\n-Jennifer V<br/>\nNo, it isn&#39;t hard to have a conversation like this in email, what is hard is <br/>\nwhen people don&#39;t say what they mean. Assigning a tone of voice isn&#39;t a good <br/>\nexcuse either. One of the tenants of this list is to be careful of what you <br/>\nwrite so that people can take what you have written at face value. At the risk of <br/>\nrepeating others, another guideline is that if you don&#39;t want a belief <br/>\nquestioned then don&#39;t hold it out to the group. This is a discussion group, not a <br/>\nsupport group. I hate the subject line of this thread, unschooling isn&#39;t a form <br/>\nof homeschooling, unschooling is beyond that, so when someone questions <br/>\nwhether something is unschooling or not then I realize that someone does not grasp <br/>\nunschooling fully. I am not saying that person is you. I am just making a <br/>\ngeneral observation. I&#39;ve seen this heading before. Unfortunately, I am sure I will <br/>\nsee it again.<br/>\n<br/>\n~Nancy<br/>\n<br/>\nGenius may have its limitations, but stupidity is not thus handicapped. <br/>\nElbert Hubbard <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064294571","msgId":81263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBMDlGMERDLUVEODUtMTFENy1BRTQ0LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGJrb2F1cythNDNiQGVHcm91cHMuY29tPg=="},"prevInTopic":81262,"nextInTopic":81264,"prevInTime":81262,"nextInTime":81264,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... Quote: Whatever lesson they had to learn from it, they chose it.  I don t have to feel bad about what they are experiencing.   -pam","messageBody":"<div id=\"ygrps-yiv-1276066647\">On Monday, September 22, 2003, at 07:25  PM, JenV72 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    So again, I don&#39;t believe it was ever meant that we should not<br/>\n&gt; care what happens to people, or that we should say &quot;well it&#39;s her<br/>\n&gt; fault such and such happened because she decided it would before she<br/>\n&gt; came to this earth.&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>Quote: &quot;Whatever lesson they had to learn from it, they chose it.  I <br/>\ndon&#39;t have to feel bad about what they are experiencing.  &quot;<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064288621","msgId":81262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNkZDMTZELjQwMjAzMDNAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDguM2QzNWFiMjIuMmNhMTExYTdAYW9sLmNvbT4="},"prevInTopic":81259,"nextInTopic":81263,"prevInTime":81261,"nextInTime":81263,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1256271003\">&lt;&lt;No one can really understand what someone else is saying because you<br/>\ncan&#39;t see the person, &gt;&gt;<br/>\n<br/>\n<br/>\nAs a general statement about emotional tone on email lists, it is sure <br/>\nenough true.<br/>\n<br/>\nIt isn&#39;t very often possible to know from people&#39;s general comments if <br/>\nthey believe in predestination in a stern way or in a gentle, <br/>\ncompassionate way.  I think we&#39;re teetering on the brink of the big <br/>\nchasm between &quot;how it sounds&quot; and &quot;how it sounds inside the brain of the <br/>\nperson that wrote it.&quot;<br/>\n<br/>\nNot really intending to argue here.  Just seeing some truth in the one <br/>\nsentence quoted above.<br/>\n<br/>\nIt&#39;s been so hot here that we haven&#39;t wanted to leave the house, except <br/>\nearly in the morning, and we&#39;re all getting kind of crabby.  Tomorrow <br/>\nwill be more exciting because I&#39;m going to the dentist.  (oh, joy) &lt;g&gt;<br/>\n<br/>\nBetsy<br/>\n<br/>\nPS  My 2 cents on predestination: life is harsh enough that I find <br/>\nbelieving that life is harsh on purpose to teach us lessons WAY too <br/>\nharsh to accept.  Even though I&#39;ve seen how terrible experiences can <br/>\nbuild character, I don&#39;t recommend that path to anyone that I&#39;m fond of.<br/>\n<br/>\nPPS  I&#39;ve pretty much read the whole thread, except the ends of some <br/>\nlonger posts that wore me out.</div>","specialLinks":[]},{"userId":3270790,"authorName":"JenV72","from":"&quot;JenV72&quot; &lt;jvaitkus@...&gt;","profile":"JenV72","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Beliefs is this unschooling?","postDate":"1064287092","msgId":81259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrb2UxaytzOXMwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDguM2QzNWFiMjIuMmNhMTExYTdAYW9sLmNvbT4="},"prevInTopic":81258,"nextInTopic":81262,"prevInTime":81258,"nextInTime":81260,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... I read the whole thread...but an interesting question none the less. ... you ... Considering this is an unschooling list and not for specific spiritual","messageBody":"<div id=\"ygrps-yiv-1044277396\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; It was clearly stated.<br/>\n&gt; Why are people commenting who didn&#39;t read the whole thread?<br/>\n<br/>\n </span></blockquote>I read the whole thread...but an interesting question none the less.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;No one can really understand what someone else is saying because <br/>\n </span></blockquote>you <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; can&#39;t see the person, &gt;&gt;<br/>\n&gt; <br/>\n&gt; Should we close the list then?<br/>\n<br/>\n </span></blockquote>Considering this is an unschooling list and not for specific <br/>\nspiritual beliefs, I&#39;d say no. Interesting that you thought that was <br/>\nwhat I was getting at.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; The tool we have is the written word.  People should use it as <br/>\n </span></blockquote>clearly as <br/>\n<blockquote><span title=\"ireply\"> &gt; they can and be willing to clarify and defend statements they <br/>\n </span></blockquote>make.    That&#39;s how <br/>\n<blockquote><span title=\"ireply\"> &gt; it works, and it&#39;s the only way it can work.<br/>\n<br/>\n </span></blockquote>Yes, and even so there are still misunderstandings.  I don&#39;t think <br/>\nJudie ever really explained herself fully.  Most of this thread <br/>\nconsisted of reactions to one statement which was most likely not <br/>\nthe extent of her belief.<br/>\n<br/>\n-Jennifer V</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064286119","msgId":81258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDguM2QzNWFiMjIuMmNhMTExYTdAYW9sLmNvbT4="},"prevInTopic":81257,"nextInTopic":81259,"prevInTime":81257,"nextInTime":81259,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 8:27:46 PM, jvaitkus@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-523282432\">In a message dated 9/22/03 8:27:46 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jvaitkus@...\">jvaitkus@...</a> writes:<br/>\n<br/>\n&lt;&lt; I don&#39;t think anyone was ever saying <br/>\n<br/>\nthat we should not have compassion for other people.  &gt;&gt;<br/>\n<br/>\n&quot;I don&#39;t have to feel bad for her&quot; I believe was the quote.<br/>\n<br/>\n&lt;&lt;   So again, I don&#39;t believe it was ever meant that we should not <br/>\n<br/>\ncare what happens to people, or that we should say &quot;well it&#39;s her <br/>\n<br/>\nfault such and such happened because she decided it would before she <br/>\n<br/>\ncame to this earth.&quot;&gt;&gt;<br/>\n<br/>\nIt was clearly stated.<br/>\nWhy are people commenting who didn&#39;t read the whole thread?<br/>\n<br/>\n&lt;&lt;No one can really understand what someone else is saying because you <br/>\n<br/>\ncan&#39;t see the person, &gt;&gt;<br/>\n<br/>\nShould we close the list then?<br/>\n<br/>\nThe tool we have is the written word.  People should use it as clearly as <br/>\nthey can and be willing to clarify and defend statements they make.    That&#39;s how <br/>\nit works, and it&#39;s the only way it can work.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":3270790,"authorName":"JenV72","from":"&quot;JenV72&quot; &lt;jvaitkus@...&gt;","profile":"JenV72","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Beliefs is this unschooling?","postDate":"1064283932","msgId":81257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrb2F1cythNDNiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNi4yNGE3NWNjMy4yY2EwZmY3NEBhb2wuY29tPg=="},"prevInTopic":81254,"nextInTopic":81258,"prevInTime":81256,"nextInTime":81258,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"I just needed to add this...  I don t think anyone was ever saying that we should not have compassion for other people.  Using different wording, I feel like","messageBody":"<div id=\"ygrps-yiv-464428362\">I just needed to add this...  I don&#39;t think anyone was ever saying <br/>\nthat we should not have compassion for other people.  Using <br/>\ndifferent wording, I feel like what was meant is that everything <br/>\nhappens for a reason.  Everything happens in order for each of us to <br/>\nreach enlightenment.  It may feel great or it may feel bad, but it <br/>\nhappened to teach us something we needed to know, to work though, to <br/>\nexperience in order to reach enlightenment and to be truely happy.<br/>\n   So again, I don&#39;t believe it was ever meant that we should not <br/>\ncare what happens to people, or that we should say &quot;well it&#39;s her <br/>\nfault such and such happened because she decided it would before she <br/>\ncame to this earth.&quot;<br/>\n   It is really hard to have a conversation like this over email.  <br/>\nNo one can really understand what someone else is saying because you <br/>\ncan&#39;t see the person, you can&#39;t hear his/her tone of voice (infact <br/>\nwe tend to add a tone ouselves wether or not it&#39;s valid) etc....<br/>\n   Anyway, that&#39;s how I feel, thanks<br/>\n-Jennifer V</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064281460","msgId":81254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNi4yNGE3NWNjMy4yY2EwZmY3NEBhb2wuY29tPg=="},"prevInTopic":81248,"nextInTopic":81257,"prevInTime":81253,"nextInTime":81255,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 5:44:55 PM, HMSL2@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-158129341\">In a message dated 9/22/03 5:44:55 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> writes:<br/>\n<br/>\n&lt;&lt; When I was molested at 13 it was my destiny and he should not have been <br/>\nlocked up? Im surprised at this statement. &gt;&gt;<br/>\n<br/>\nYeah.<br/>\nWe&#39;re trying to explain WHY people were questioning the philosophy that said <br/>\nthat.<br/>\n<br/>\nNo sense getting grumpy now.  The person who explained that her beliefs <br/>\nincluded that has left the list, but why didn&#39;t you get angry when SHE said it?<br/>\n<br/>\nThere are just too many people here who chose NOT to read all that stuff as <br/>\nit unfolded and now are one after another complaining about the aftermath <br/>\ninstead of having read it all as it happened.<br/>\n<br/>\n&lt;&lt; If this ever happened to your child you <br/>\nwould NOT be speaking this crap.&gt;&gt;<br/>\n<br/>\nI was NOT &quot;speaking that crap,&quot; I was explaining why we weren&#39;t being <br/>\naccepting of the &quot;beliefs&quot; of the person who explained that she believed  that all <br/>\nthose decisions were made before people are born.<br/>\n<br/>\nYes, I think it was crap.<br/>\n<br/>\n&lt;&lt;She is now a mess you think that is destiny???? <br/>\n<br/>\n&lt;&lt;I think not.&gt;&gt;<br/>\n<br/>\nNo, I don&#39;t, but someone on this list did, and then others (blindly, <br/>\ngenerally) defended her.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064276545","msgId":81246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMjZDMkE5LUVENUMtMTFENy1BRTQ0LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDQyLjNlMGU3NjU1LjJjYTBlM2Y2QGFvbC5jb20+"},"prevInTopic":81244,"nextInTopic":81248,"prevInTime":81245,"nextInTime":81247,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"It was a quote from one of my posts, but I wasn t saying I believe it. Quite the opposite. My point was that if someone REALLY believed that individuals had, ","messageBody":"<div id=\"ygrps-yiv-1749599809\">It was a quote from one of my posts, but I wasn&#39;t saying I believe it.  <br/>\nQuite the opposite.<br/>\n<br/>\nMy point was that if someone REALLY believed that individuals had,  <br/>\nbefore this lifetime,  chosen to be molested - in fact had arranged it  <br/>\nwith their molester - that there would be no reason to jail a molester.  <br/>\nIf it was supposed to happen it would happen - jailing wouldn&#39;t prevent  <br/>\nanything. And, according to the same beliefs, we&#39;re supposed to  <br/>\nrecognize that the poor molester was doing the molested person a favor  <br/>\nby carrying out this horrendous act so that the molested person could  <br/>\nlearn whatever lesson they were supposed to learn.<br/>\n<br/>\nI wasn&#39;t promoting it - I was saying that it would be dangerous if too  <br/>\nmany people believed it. It is the most extreme version of &quot;blame the  <br/>\nvictim&quot; I&#39;ve ever heard.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Monday, September 22, 2003, at 04:47  PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> wrote:<br/>\n<br/>\n&gt; In a message dated 9/22/2003 7:44:51 PM Eastern Standard Time,  <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a><br/>\n&gt; writes: SANDRA DID NOT WRITE THIS... IM NOT SURE WHY IT PULLED HER  <br/>\n&gt; NAME BUT IT<br/>\n&gt; IS AN ERROR. LAURA<br/>\n&gt; In a message dated 9/22/2003 2:24:23 PM Eastern Standard Time,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n&gt; &lt;&lt; There would be no point in locking up child molesters, for<br/>\n&gt; example, if the molester and the child had already CHOSEN in advance<br/>\n&gt; whether or not the molestation was going to take place. &gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------ Yahoo! Groups Sponsor  <br/>\n&gt; ---------------------~--&gt;<br/>\n&gt; Buy Remanufactured Ink Cartridges & Refill Kits at MyInks.com for: HP  <br/>\n&gt; $8-20. Epson $3-9, Canon $5-15, Lexmark $4-17. Free s/h over $50 (US &  <br/>\n&gt; Canada).<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.c1tracking.com/l.asp?cid=6351\">http://www.c1tracking.com/l.asp?cid=6351</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/0zJuRD/6CvGAA/qnsNAA/0xXolB/TM\">http://us.click.yahoo.com/0zJuRD/6CvGAA/qnsNAA/0xXolB/TM</a><br/>\n&gt; --------------------------------------------------------------------- <br/>\n&gt; ~-&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; To unsubscribe from this send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:  <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to  <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064274864","msgId":81248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNkY4QkIwLjEwMDA5MDlAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDFkZC4xMTNhNWZiYi4yY2EwZTMyOUBhb2wuY29tPg==","referencesHeader":"PDFkZC4xMTNhNWZiYi4yY2EwZTMyOUBhb2wuY29tPg=="},"prevInTopic":81246,"nextInTopic":81254,"prevInTime":81247,"nextInTime":81249,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... Laura, this was taken *entirely* out of context.  You should really go back and read what Sandra was replying to, honey, because she does NOT share this","messageBody":"<div id=\"ygrps-yiv-1332661399\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;In a message dated 9/22/2003 2:24:23 PM Eastern Standard Time, <br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n&gt;&lt;&lt; There would be no point in locking up child molesters, for <br/>\n&gt;example, if the molester and the child had already CHOSEN in advance <br/>\n&gt;whether or not the molestation was going to take place. &gt;&gt;<br/>\n&gt;WHAT????????????<br/>\n&gt;When I was molested at 13 it was my destiny and he should not have been <br/>\n&gt;locked up? Im surprised at this statement. If this ever happened to your child you <br/>\n&gt;would NOT be speaking this crap<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>Laura, this was taken *entirely* out of context.  You should really go <br/>\nback and read what Sandra was replying to, honey, because she does NOT <br/>\nshare this line of thinking.</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064274422","msgId":81244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyLjNlMGU3NjU1LjJjYTBlM2Y2QGFvbC5jb20+"},"prevInTopic":81243,"nextInTopic":81246,"prevInTime":81243,"nextInTime":81245,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/2003 7:44:51 PM Eastern Standard Time, HMSL2@aol.com writes: SANDRA DID NOT WRITE THIS... IM NOT SURE WHY IT PULLED HER NAME BUT IT IS","messageBody":"<div id=\"ygrps-yiv-1711682009\">In a message dated 9/22/2003 7:44:51 PM Eastern Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> <br/>\nwrites: SANDRA DID NOT WRITE THIS... IM NOT SURE WHY IT PULLED HER NAME BUT IT <br/>\nIS AN ERROR. LAURA<br/>\nIn a message dated 9/22/2003 2:24:23 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n&lt;&lt; There would be no point in locking up child molesters, for <br/>\nexample, if the molester and the child had already CHOSEN in advance <br/>\nwhether or not the molestation was going to take place. &gt;&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064274217","msgId":81243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZC4xMTNhNWZiYi4yY2EwZTMyOUBhb2wuY29tPg=="},"prevInTopic":81223,"nextInTopic":81244,"prevInTime":81242,"nextInTime":81244,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/2003 2:24:23 PM Eastern Standard Time, SandraDodd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-443872696\">In a message dated 9/22/2003 2:24:23 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n&lt;&lt; There would be no point in locking up child molesters, for <br/>\nexample, if the molester and the child had already CHOSEN in advance <br/>\nwhether or not the molestation was going to take place. &gt;&gt;<br/>\nWHAT????????????<br/>\nWhen I was molested at 13 it was my destiny and he should not have been <br/>\nlocked up? Im surprised at this statement. If this ever happened to your child you <br/>\nwould NOT be speaking this crap. Try telling DHS &quot;oh my little girl/boy it <br/>\n&#39;twas his/her destiny to be raped you see&quot; Your destiny would bee the loss of <br/>\nyour child.<br/>\n<br/>\nMY molester just went to jail for molesting his own daughter over the past 10 <br/>\nyears. She is now a mess you think that is destiny???? <br/>\n<br/>\nI think not. Destiny should have been me putting him in jail had the people <br/>\naround me been less proud. I am putting the SOB away for more time now.  <br/>\nStatute of limitations to me is my destiny.<br/>\n<br/>\nSick just sick..........<br/>\n<br/>\n<br/>\nLAURA<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064254875","msgId":81223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Yi4yNDA2OGE2YS4yY2EwOTc5YkBhb2wuY29tPg=="},"prevInTopic":81211,"nextInTopic":81243,"prevInTime":81222,"nextInTime":81224,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 11:20:53 AM, AimeeL73@cs.com writes: ","messageBody":"<div id=\"ygrps-yiv-375877732\">In a message dated 9/22/03 11:20:53 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AimeeL73@...\">AimeeL73@...</a> writes:<br/>\n<br/>\n&lt;&lt; There would be no point in locking up child molesters, for <br/>\nexample, if the molester and the child had already CHOSEN in advance <br/>\nwhether or not the molestation was going to take place. &gt;&gt;<br/>\n<br/>\n&lt;&lt;People who believe in this idea often also believe in karma, reincarnation <br/>\nand that we are spiritual beings in a physical body.  &gt;&gt;<br/>\n<br/>\nKarma doesn&#39;t say you choose anything in advance.<br/>\n<br/>\nIt says people should be and are ultimately striving to be good, and some <br/>\npeople do it in a few lifetimes and some take many more lifetimes because they&#39;re <br/>\nnot focussing.  So their suffering and their ill deeds are affecting others, <br/>\nand eventually they&#39;ll become more enlightened.   <br/>\n<br/>\nBut it doesn&#39;t even BEGIN to say that people deserve or chose to be victims.  <br/>\nBeing a victim is a moment when the victim decides how to act, and his own <br/>\nchoices affect his own karma.<br/>\n<br/>\nEach soul is growing toward a better place.<br/>\nNo soul would choose to be bad or to cause harm in advance of rebirth.  That <br/>\nmakes no sense.<br/>\n<br/>\n<br/>\nAnd the theory someone mentioned earlier that there are just some bad souls <br/>\nwho keep coming back bad is more akin to vampire fantasies than anything else <br/>\nI&#39;ve ever heard in my life.  That or the Christian idea of demons tempting <br/>\npeople so Satan can get the soul instead of God.  <br/>\n<br/>\n&lt;&lt;In order to be a victim, someone must agree to be <br/>\nthe offender.  That offender may offer their life to spend in jail, that <br/>\ncould be one circumstance agreed upon as well.  Maybe that person would try <br/>\nto <br/>\nfind value in that time spent on earth, I dunno.  &gt;&gt;<br/>\n<br/>\nThis kind of stuff is made-up new-age stuff.  People will write and sell all <br/>\nkinds of fantasy &quot;what if&quot; that they thought might make someone feel better.<br/>\n<br/>\nI don&#39;t see it as a religion in any way whatsoever, and that goes back to my <br/>\nother question about what &quot;beliefs&quot; we should honor as someone&#39;s sincerely <br/>\nheld view of the universe and their moral place in it.<br/>\n<br/>\n&lt;&lt; I believe that the idea of heaven and hell <br/>\ncomes from this karmatic balancing. &gt;&gt;<br/>\n<br/>\nKarmic.<br/>\n<br/>\nOne way or another, no matter what people believe, doing good has got to be <br/>\nbetter than doing evil.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":70316959,"authorName":"AimeeL73@cs.com","from":"AimeeL73@...","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064251133","msgId":81211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ni4yNGRiYjU1Yy4yY2EwODhmZEBjcy5jb20+"},"prevInTopic":81144,"nextInTopic":81223,"prevInTime":81210,"nextInTime":81212,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... The way I think of this, it s not the decisions that are made before we are born, but it s the circumstances and experiences we choose to have that are ","messageBody":"<div id=\"ygrps-yiv-1629300585\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t really belief the above, but I&#39;m still a bit fascinated by the <br/>\n&gt; ideas. I can&#39;t get a grasp of why bother to really even &quot;think&quot; about <br/>\n&gt; decisions - whichever decision made would be one that, after the fact, <br/>\n&gt; I&#39;d say, &quot;That was the decision we decided on before this lifetime.&quot;<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>The way I think of this, it&#39;s not the decisions that are made before we are <br/>\nborn, but it&#39;s the circumstances and experiences we choose to have that are <br/>\nthought out and decided upon before we come into the world.  <br/>\n<br/>\nFree will is part of this idea, that we can choose how we react and deal with <br/>\nthe circumstances in our lives.  The feeling that something was supposed to <br/>\nhappen in order for other things to happen is something that I experience <br/>\noften.  I even get the feeling that those experiences were somehow planned, <br/>\norganized, and that there is, indeed, a divine hand at work in the course of my life. <br/>\n <br/>\n<br/>\n&lt;&lt;It is the &quot;belief&quot; itself that seems, not mean, <br/>\nbut dangerous in terms of how society would function if too many people <br/>\nbelieved it. There would be no point in locking up child molesters, for <br/>\nexample, if the molester and the child had already CHOSEN in advance <br/>\nwhether or not the molestation was going to take place. &gt;&gt;<br/>\n<br/>\nPeople who believe in this idea often also believe in karma, reincarnation <br/>\nand that we are spiritual beings in a physical body.  It is the experiences of <br/>\nphysicality that are important, profound, no matter what the experience, good <br/>\nor bad.  The idea follows that if we were a molestor in one life, that we may <br/>\nthen choose to experience the other side of that behavior as the victim. ( <br/>\nThat&#39;s how I understand karma. ) In order to be a victim, someone must agree to be <br/>\nthe offender.  That offender may offer their life to spend in jail, that <br/>\ncould be one circumstance agreed upon as well.  Maybe that person would try to <br/>\nfind value in that time spent on earth, I dunno.  <br/>\n<br/>\n<br/>\n&lt;&lt;In terms of unschooling, it says to me that it doesn&#39;t matter how we <br/>\nparent or educate our children, that its already been decided what they <br/>\nwill experience in their lives.&gt;&gt;<br/>\n<br/>\nI think it does matter what we each one of us choose to do, I believe in free <br/>\nwill.  We can forget about the agreements we have made, we can choose to <br/>\nignore that still small voice that speaks from our hearts.  I believe that this <br/>\nhappens more often than not, and is why the world is as it is. <br/>\n<br/>\nAnd that some children that are molested, for example, did not agree to that <br/>\nexperience, and they have the hardest time with their experience in life.  The <br/>\nperson whom hurt someone else must then attone for the pain they caused, and <br/>\nkarma kicks in.  In their next life, or maybe inbetween lives, they will <br/>\nexperience the pain they inflicted.  I believe that the idea of heaven and hell <br/>\ncomes from this karmatic balancing.  We are all one, what we do to one, we do to <br/>\nourselves, in that way.   <br/>\n<br/>\nThere are some that do remember, and those people don&#39;t necessarily stop <br/>\nlearning lessons, or have a perfect life, either.  Most choose to try to make life <br/>\nbetter for everyone and take on challenges that others aren&#39;t ready for.  I <br/>\nthink of people like Ghandi and Mother Theresa and even Jesus or Buddha.  Those <br/>\npeople didn&#39;t have perfect lives, I believe that they were human and did the <br/>\nbest that they could with the life they chose.  But I believe those people <br/>\nfollowed the path they decided upon much more closely than most do, if that makes <br/>\nsense.  They remembered who they really were.  <br/>\n<br/>\n&lt;&lt; They act like the things they do really matter, they act <br/>\nlike they are making decisions now (not just carrying out decisions <br/>\nmade in a former lifetime or predestined by God or otherwise <br/>\npredecided). They say things like, &quot;We homeschool so that we can do <br/>\nwhat we want.&quot; But that doesn&#39;t even make sense if they really believe <br/>\nthat they&#39;ve already decided, in advance, what is going to happen and <br/>\nnothing could stop it anyway. &gt;&gt;<br/>\n<br/>\n  I hope I shed a little light on the idea by explaining my beliefs, but they <br/>\nare only as I understand them.  I am always learning.  :-) <br/>\n<br/>\n~Aimee<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064166541","msgId":81144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ny4yNGQ0NDQxNy4yYzlmM2U4ZEBhb2wuY29tPg=="},"prevInTopic":81120,"nextInTopic":81211,"prevInTime":81143,"nextInTime":81145,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/21/03 9:11:38 AM, pamsoroosh@mac.com writes: ","messageBody":"<div id=\"ygrps-yiv-713191303\">In a message dated 9/21/03 9:11:38 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\n&lt;&lt;  There would be no point in locking up child molesters, for <br/>\nexample, if the molester and the child had already CHOSEN in advance <br/>\nwhether or not the molestation was going to take place. &gt;&gt;<br/>\n<br/>\nNo, maybe he PLANNED to go to prison, and all involved have already chosen <br/>\nthe lawyers, judge and jury so that it will work out as they &quot;predestined&quot; it to.<br/>\n<br/>\nThe idea of predestination is along the lines of how many angels can dance on <br/>\nthe head of a pin, and can God make a rock so big he himself can&#39;t pick it up.<br/>\n<br/>\nIt&#39;s the idea that if God is omnicient, he must know what he&#39;s going to do <br/>\nand what we&#39;re going to do.  I&#39;ve never heard anyone propose that humans are <br/>\nomnicient, not even spirit-plane humans, so it&#39;s not a philosophical question of <br/>\nomnicience.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064157099","msgId":81120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2NkM5RTM4LUVDNDUtMTFENy1BQjBELTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGJrazkwbys1bTBzQGVHcm91cHMuY29tPg=="},"prevInTopic":81111,"nextInTopic":81144,"prevInTime":81119,"nextInTime":81121,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... It was how it was supposed to be. Chosen by each of us and her, together, in a former lifetime to happen exactly like this. No need to feel bad about it. I","messageBody":"<div id=\"ygrps-yiv-804080992\">On Sunday, September 21, 2003, at 06:27  AM, joanna514 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It was a shame we were left to have to assume.<br/>\n<br/>\n </span></blockquote>It was how it was supposed to be. Chosen by each of us and her, <br/>\ntogether, in a former lifetime to happen exactly like this. No need to <br/>\nfeel bad about it.<br/>\n<br/>\nI don&#39;t really belief the above, but I&#39;m still a bit fascinated by the <br/>\nideas. I can&#39;t get a grasp of why bother to really even &quot;think&quot; about <br/>\ndecisions - whichever decision made would be one that, after the fact, <br/>\nI&#39;d say, &quot;That was the decision we decided on before this lifetime.&quot;<br/>\n<br/>\nI can&#39;t get a hold of what basis there is to trying to make better <br/>\ndecisions. You can&#39;t make a &quot;wrong&quot; decision under this belief system <br/>\nsince all decisions were already decided upon.<br/>\n<br/>\nThe other thing, for us to have all decided on this particular outcome, <br/>\ntogether, before we cam to the life, is an amazing feat of coordination <br/>\nfar beyond that which any computer could accomplish. Every single <br/>\ndecision any of ever made in our lives had to be coordinated to make <br/>\nsure we were all here on this list together and posting exactly what we <br/>\nposted. And that means every decision anybody else any of us have ever <br/>\nhad contact with had to be coordinated to make sure we had the <br/>\nexperiences we had that would guarantee we&#39;d be on this list posting <br/>\nexactly what we posted.<br/>\n<br/>\nAlso, to Joanne, I never thought Judie would be mean. I doubt it very <br/>\nvery much - based on what I saw here I suspect she actually is very <br/>\ncompassionate and kind. It is the &quot;belief&quot; itself that seems, not mean, <br/>\nbut dangerous in terms of how society would function if too many people <br/>\nbelieved it. There would be no point in locking up child molesters, for <br/>\nexample, if the molester and the child had already CHOSEN in advance <br/>\nwhether or not the molestation was going to take place.<br/>\n<br/>\nIn terms of unschooling, it says to me that it doesn&#39;t matter how we <br/>\nparent or educate our children, that its already been decided what they <br/>\nwill experience in their lives.<br/>\n<br/>\nIts the mechanical nature of life, under this kind of belief, that <br/>\nmakes me want to look at it more closely. The people I know who believe <br/>\nthings similar to this don&#39;t, in practice, ACT like they believe it, in <br/>\nmy opinion. They act like the things they do really matter, they act <br/>\nlike they are making decisions now (not just carrying out decisions <br/>\nmade in a former lifetime or predestined by God or otherwise <br/>\npredecided). They say things like, &quot;We homeschool so that we can do <br/>\nwhat we want.&quot; But that doesn&#39;t even make sense if they really believe <br/>\nthat they&#39;ve already decided, in advance, what is going to happen and <br/>\nnothing could stop it anyway.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":59432230,"authorName":"joanna514","from":"&quot;joanna514&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Beliefs is this unschooling?","postDate":"1064150872","msgId":81111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrazkwbys1bTBzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJCOTMxNjZGLjFFQjM4JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":81109,"nextInTopic":81120,"prevInTime":81110,"nextInTime":81112,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... isn t the ... ideas. Just to clarify, my post had nothing to do with Judie, but in figuring out why I had a different reaction to her ideas than others. I","messageBody":"<div id=\"ygrps-yiv-844711530\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Fetteroll <br/>\n&lt;fetteroll@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; on 9/20/03 10:36 PM, joanna514 at Wilkinson6@m... wrote:<br/>\n&gt; <br/>\n&gt; &gt; I don&#39;t think I would ever assume someone with that belief system<br/>\n&gt; &gt; would purposely be mean and say &quot;it was pre planned&quot;  I especially<br/>\n&gt; &gt; wouldn&#39;t assume that of someone unschooling.<br/>\n&gt; <br/>\n&gt; Whether or not we can guess Judie is mean based on her beliefs <br/>\n </span></blockquote>isn&#39;t the<br/>\n<blockquote><span title=\"ireply\"> &gt; issue. The list isn&#39;t for discussing Judie. It&#39;s for discussing <br/>\n </span></blockquote>ideas.<br/>\n<br/>\n<br/>\nJust to clarify, my post had nothing to do with Judie, but in <br/>\nfiguring out why I had a different reaction to her ideas than others.<br/>\nI came to the conclusion that I wouldn&#39;t assume &quot;meaness&quot; behind any <br/>\nof it.  It was a personal reflection of myself (not necessarily a <br/>\ngood one). :-)<br/>\n<br/>\nIt was a shame we were left to have to assume.  <br/>\nJoanna</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064148527","msgId":81109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCOTMxNjZGLjFFQjM4JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGJrajJybCs5dXZlQGVHcm91cHMuY29tPg=="},"prevInTopic":81070,"nextInTopic":81111,"prevInTime":81108,"nextInTime":81110,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... Whether or not we can guess Judie is mean based on her beliefs isn t the issue. The list isn t for discussing Judie. It s for discussing ideas. The ideas","messageBody":"<div id=\"ygrps-yiv-1973320175\">on 9/20/03 10:36 PM, joanna514 at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Wilkinson6@...\">Wilkinson6@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t think I would ever assume someone with that belief system<br/>\n&gt; would purposely be mean and say &quot;it was pre planned&quot;  I especially<br/>\n&gt; wouldn&#39;t assume that of someone unschooling.<br/>\n<br/>\n </span></blockquote>Whether or not we can guess Judie is mean based on her beliefs isn&#39;t the<br/>\nissue. The list isn&#39;t for discussing Judie. It&#39;s for discussing ideas.<br/>\n<br/>\nThe ideas she brought to the list are a topic of discussion. Ideas,<br/>\nprinciples, view points are like filters. They help us decide what are good<br/>\nand bad ideas and solutions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have a whole side of my family into New Age and this type of<br/>\n&gt; thinking.<br/>\n&gt; My Aunt is a New Age minister.  She&#39;s really into Eurancha.<br/>\n&gt; NONE of them would ever purposely cause harm.<br/>\n&gt; I can&#39;t imagine anyone into this type of soul searching trying to<br/>\n&gt; figure out how to be mean and &quot;get away with it&quot;,  which is what<br/>\n&gt; seems to be your fear.<br/>\n<br/>\n </span></blockquote>The ideas of Christianity have helped some people make positive social<br/>\nchanges.<br/>\n<br/>\nThe ideas of Christianity have also justified some horrors and incredible<br/>\nabuses.<br/>\n<br/>\nSame with Islam.<br/>\n<br/>\nI would bet the same with Hinduism but I don&#39;t know for sure.<br/>\n<br/>\nThose belief systems are the filters people used to decide what was right<br/>\nbehavior. Some people have filtered ideas through Christianity and founded<br/>\nleper colonies and soup kitchens. Others have filtered ideas through<br/>\nChristianity and started crusades and come up with charts of rod sizes based<br/>\non age to whip children with.<br/>\n<br/>\nIf someone brings a bit of a belief system to the list that could justify<br/>\nharming children, it&#39;s worth examining those ideas if those ideas have some<br/>\nimpact on people&#39;s ability to filter the solutions that will help them<br/>\ncreate a peaceful joyful homeschooling life.<br/>\n<br/>\nI&#39;m going to seemingly go off on a tangent for a bit: Think about the most<br/>\ndifficult child problem you&#39;ve solved and think about how you went about<br/>\ndeciding what were good and bad solutions.<br/>\n<br/>\nSibling rivalry comes up a lot. One filter that many people have is that<br/>\nsibling rivalry is normal. Another is that it&#39;s mom&#39;s job to fix things.<br/>\nAnother is that it&#39;s a parent&#39;s job to control children&#39;s behavior until<br/>\nthey can control it themselves.<br/>\n<br/>\nThat first filter, that it&#39;s normal, filters out any agressive techniques to<br/>\nforce children to change. It tends to relieve us of guilt we might feel that<br/>\nit&#39;s our fault and that we should be doing something about it. It doesn&#39;t<br/>\nstop us from interfering but it filters out ideas that are based on &quot;These<br/>\nincidents are wrong and need to stop.&quot;<br/>\n<br/>\nThe second filter tends to filter out solutions that tell us to do nothing.<br/>\nIt increases the guilt we feel when we see them fighting. It&#39;s our job to<br/>\nmake them stop. It&#39;s a reflection on our abilities as parents that they&#39;re<br/>\neven fighting to begin with.<br/>\n<br/>\nThe third filter lets through solutions that have control at their<br/>\nfoundation.<br/>\n<br/>\nWhen looked at through those filters, all the solutions make some sense. It<br/>\ndoes make sense to punish kids for fighting because it&#39;s our job to shape<br/>\nthem into decent humans. It does make sense to only step in when there&#39;s<br/>\nblood because sibling rivalry is normal. If someone has all those filters<br/>\nthey have a head full of incompatible solutions and they don&#39;t know what&#39;s<br/>\nright or best and they understandably feel confused.<br/>\n<br/>\nBut none of those filters helps us make the decisions that help our chldren<br/>\nlive more joyful and peaceful lives. Neither does the belief system that<br/>\nJudie brought up. None of those prevents us from joyful peaceful families.<br/>\nJust as Christianity doesn&#39;t prevent people from mindful parenting. But it<br/>\ndoesn&#39;t help them make the distinction between the decisions that will<br/>\ncreate that joyful atmosphere and the decisions that will prevent it.<br/>\n<br/>\nIt&#39;s not that Judie or anyone needs to change her beliefs to be on the list,<br/>\nbut that the ideas she expressed on the list -- and it was the ideas she<br/>\nbrought up *before* she explained her spiritual beliefs that prompted<br/>\nsomeone (Sandra?) to ask for futher clarification since the reasoning behind<br/>\nher words wasn&#39;t clear -- aren&#39;t helpful to people trying to get to unschool<br/>\nand more peaceful families. The ideas don&#39;t help people filter out the<br/>\nsolutions that will help them get to more peaceful family life and the ideas<br/>\nthat will hinder them.<br/>\n<br/>\nThis list is for discussion of ideas. We&#39;re not here to stop people from<br/>\nholding ideas but we are here to hold up ideas brought to the list for<br/>\nexamination and talk about the ideas and why some ideas have helped poeple<br/>\nreach unschooling goals and how some ideas have or could hinder them. No one<br/>\nneeds to stop believing in an idea just because they can&#39;t or don&#39;t want to<br/>\ndiscuss how it helps people get to unschooling. They can hold it quietly.<br/>\nBut if the idea returns to the list, it will get held up for examination<br/>\nagain. Not as punishment for wrong thinking but because the purpose of this<br/>\nlist is for examining and discussing ideas that will help people get to<br/>\nunschooling.<br/>\n<br/>\nIf someone can talk through their ideas and help others see how their ideas<br/>\nare better at getting people from schoolish thought to unschooling thought<br/>\nor to more peaceful families, then that&#39;s awesome! But if someone can&#39;t or<br/>\ndoesn&#39;t want to, if their ideas still look harmful, then the ideas *will* be<br/>\nheld up for examination every time they come up.<br/>\n<br/>\nOne of the misconceptions of the discussions is that we&#39;re trying to tell<br/>\npeople they aren&#39;t allowed to believe the ideas that they do. That they have<br/>\nto toe some group-think line. No. People can *believe* what they want. But<br/>\npeople can&#39;t *express* whatever they want *without it being discussed*. If<br/>\nsomeone thinks an idea is harmful to someone getting unschooling or living<br/>\nmore peaceful lives with their children, that idea is going to be examined.<br/>\nIt&#39;s what this list is for.<br/>\n<br/>\nJoyce<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":59432230,"authorName":"joanna514","from":"&quot;joanna514&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Beliefs is this unschooling?","postDate":"1064111797","msgId":81070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrajJybCs5dXZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE2Ni4yNWQ2NTBkZC4yYzllNjE4MEBhb2wuY29tPg=="},"prevInTopic":81065,"nextInTopic":81109,"prevInTime":81069,"nextInTime":81071,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... heard ... entirety of a ... person who ... experiencing. I see where you are coming from. ( I was perplexed):-) I had read that post, but didn t assume","messageBody":"<div id=\"ygrps-yiv-1911070365\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-You are dismissing something you have said you have never even <br/>\n </span></blockquote>heard <br/>\n<blockquote><span title=\"ireply\"> &gt; of.-=-<br/>\n&gt; <br/>\n&gt; I didn&#39;t say I had never even heard of it.  I&#39;m repeating the <br/>\n </span></blockquote>entirety of a <br/>\n<blockquote><span title=\"ireply\"> &gt; post which seemed to me to be important.  It&#39;s my post, quoting the <br/>\n </span></blockquote>person who <br/>\n<blockquote><span title=\"ireply\"> &gt; said she didn&#39;t have to feel bad about what others were <br/>\n </span></blockquote>experiencing.<br/>\n<br/>\n<br/>\nI see where you are coming from. ( I was perplexed):-)<br/>\nI had read that post, but didn&#39;t assume  the ideas that you did from <br/>\nit.  While I think people can believe there is destiny (Gods will, <br/>\npre planned...whatever) I would never think to take the human element <br/>\nout of it.  Feeling compassion for someone in pain is human.  Our <br/>\nbeliefs don&#39;t take that away.<br/>\nWe can believe it was suppose to happen but still feel sad, sorry, <br/>\ncompassion....<br/>\nThe &quot;I don&#39;t have to feel bad&quot; comment, was read by me as; &quot;this is <br/>\nsomething they have to go through.  This was their plan.  While I&#39;m <br/>\nsad for them as a human,  I don&#39;t feel bad for them because they are <br/>\nfullfillng their plan.&quot;<br/>\n<br/>\nI don&#39;t think I would ever assume someone with that belief system <br/>\nwould purposely be mean and say &quot;it was pre planned&quot;  I especially <br/>\nwouldn&#39;t assume that of someone unschooling.<br/>\nI have a whole side of my family into New Age and this type of <br/>\nthinking.<br/>\nMy Aunt is a New Age minister.  She&#39;s really into Eurancha.<br/>\nNONE of them would ever purposely cause harm.<br/>\nI can&#39;t imagine anyone into this type of soul searching trying to <br/>\nfigure out how to be mean and &quot;get away with it&quot;,  which is what <br/>\nseems to be your fear.<br/>\n<br/>\nI do agree that the original poster dropped the ball here.<br/>\nIf it&#39;s a firm belief, I feel you should stand up for it.<br/>\nIt&#39;s not a firm belief for me.  But, I don&#39;t dismiss what she said. <br/>\nI think we read her differently, and I was just extremely curious why <br/>\nyou seemed to have a whole different view of what she and Rhonda were <br/>\nsaying.<br/>\nThankyou for clarifying.  ;-)<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Beliefs is this unschooling?","postDate":"1064109952","msgId":81065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Ni4yNWQ2NTBkZC4yYzllNjE4MEBhb2wuY29tPg=="},"prevInTopic":81063,"nextInTopic":81070,"prevInTime":81064,"nextInTime":81066,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"-=-You are dismissing something you have said you have never even heard of.-=- I didn t say I had never even heard of it.  I m repeating the entirety of a post","messageBody":"<div id=\"ygrps-yiv-1009501305\">-=-You are dismissing something you have said you have never even heard <br/>\nof.-=-<br/>\n<br/>\nI didn&#39;t say I had never even heard of it.  I&#39;m repeating the entirety of a <br/>\npost which seemed to me to be important.  It&#39;s my post, quoting the person who <br/>\nsaid she didn&#39;t have to feel bad about what others were experiencing.<br/>\n<br/>\nI&#39;ver heard versions of that theory for years, but never this harsh, and <br/>\nnever used as an excuse to not even CARE how other people felt even in extreme <br/>\ncircumstances.  This started with her saying she didn&#39;t care whether others were <br/>\nuncomfortable about nursing, but when questioned in more extreme instances, <br/>\nthe clarification was made the even extreme instances are no exception.  I <br/>\ndidn&#39;t say I had never heard of it.  I wanted to know what the source of its growth <br/>\nand continuance was.  She either didn&#39;t know or didn&#39;t  want to say.  I&#39;m  <br/>\nglad others had a better idea of the origins.<br/>\n<br/>\n[quote from here down]<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 9/19/03 1:00:40 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:adonai@...\">adonai@...</a> writes:<br/>\n<br/>\n&lt;&lt; Since I believe that before we come here, we make an agreement with <br/>\npeople to participate in certain events together, I believe that the <br/>\nperson who might see me naked agreed with me before we came here that <br/>\nwe should both participate in this event.  &gt;&gt;<br/>\n<br/>\nSo unborn people have free will but living breathing people are just acting <br/>\nthrough a play decided before birth?<br/>\n<br/>\nWith a screenname like &quot;Adonai,&quot; with a history of using ABeka and having <br/>\nkids in Christian schools, how did you come so hard and fast to beliefs so <br/>\nbizarrely different?<br/>\n<br/>\n&lt;&lt;Therefore, whatever <br/>\nreaction they have, they chose to have that reaction long before we <br/>\nactually had that experience together.  Whatever lesson they had to <br/>\nlearn from it, they chose it.  I don&#39;t have to feel bad about what <br/>\nthey are experiencing. &gt;&gt;<br/>\n<br/>\nTHIS IS THE BIG ONE:<br/>\n<br/>\n&quot; I don&#39;t have to feel bad about what <br/>\nthey are experiencing. &quot;<br/>\n<br/>\nThat&#39;s why I really don&#39;t like the &quot;this was all decided&quot; theory (and where <br/>\nit came from, I have NO idea, but it&#39;s recent and it&#39;s harmful).<br/>\n<br/>\nIt justifies abuse.<br/>\nIf you abuse your own children, you don&#39;t have to feel bad about what they <br/>\nare experiencing.<br/>\n<br/>\nIf your neighbor comes to you in fright in the middle of the night because <br/>\nher husband is after her with a knife or a gun, you can refuse to let her in <br/>\nbecause she chose that life, and you don&#39;t have to feel bad about what she&#39;s <br/>\nexperiencing.<br/>\n<br/>\nReally, where does that belief/justification come from?<br/>\nWho is promulgating it?<br/>\n<br/>\n&lt;&lt;It&#39;s part of what has to happen to them for <br/>\nthem to choose to make their part of the world better by changing <br/>\ntheir attitudes.  If they don&#39;t, well, there&#39;s a lesson there too, <br/>\nperhaps to be worked out in another lifetime.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>&quot;Other lifetime&quot; belief is traditional in many cultures, but the idea that <br/>\nthe way we live while we ARE here (as opposed to deals we allegedly make with <br/>\nother dead people before we go back onstage) doesn&#39;t have any historical or <br/>\nmoral validity as far as I know or can imagine.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59432230,"authorName":"joanna514","from":"&quot;joanna514&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Beliefs is this unschooling?","postDate":"1064108731","msgId":81063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJraXZycitiOTh0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1My4yNDNhY2UzYi4yYzllMjI2MkBhb2wuY29tPg=="},"prevInTopic":81061,"nextInTopic":81065,"prevInTime":81062,"nextInTime":81064,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... see ... you went Ooooh. ... You seem to be saying that these beliefs have been made up here and now and we are defending her right to have them. (which","messageBody":"<div id=\"ygrps-yiv-2108478491\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; This is The Emperor&#39;s New Clothes in action, people!  Don&#39;t say you <br/>\n </span></blockquote>see <br/>\n<blockquote><span title=\"ireply\"> &gt; something and it&#39;s &quot;valid&quot; just because some other people around <br/>\n </span></blockquote>you went &quot;Ooooh.  <br/>\n<blockquote><span title=\"ireply\"> &gt; Cool.&quot;   <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>You seem to be saying that these beliefs have been made up here and <br/>\nnow and we are defending her right to have them. (which she does) <br/>\n  <br/>\nI have heard and read about and discussed beliefs very similiar to <br/>\nJudies for many years with people I like and respect and some I think <br/>\nare way out there.<br/>\nThese ideas may be new (relatively), but they are wide spread.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If we don&#39;t look for ourselves and be honest, we (humans, parents, <br/>\n&gt; unschooling parents) won&#39;t do our kids NEARLY as much good as we <br/>\n </span></blockquote>will if we model <br/>\n<blockquote><span title=\"ireply\"> &gt; critical thinking.<br/>\n<br/>\n<br/>\n </span></blockquote>You are dismissing something you have said you have never even heard <br/>\nof.</div>","specialLinks":[]},{"userId":158112576,"authorName":"TeresaBnNC@aol.com","from":"TeresaBnNC@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Beliefs is this unschooling?","postDate":"1064098145","msgId":81061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3My4xZmQxYmVjYS4yYzllMzM2MUBhb2wuY29tPg=="},"prevInTopic":81049,"nextInTopic":81063,"prevInTime":81060,"nextInTime":81062,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/20/03 5:37:36 PM Eastern Daylight Time, ... Actually, that sounds about right to me.. LOL.. And, it really clears up alot of that","messageBody":"<div id=\"ygrps-yiv-2065493133\">In a message dated 9/20/03 5:37:36 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I were to say &quot;I believe that when a cat dies it comes back as a female <br/>\n&gt; human, and when a dog dies, it comes back as a male, and that&#39;s why women <br/>\n&gt; are <br/>\n&gt; generally smaller than men and why men are the defenders and women take more <br/>\n&gt; <br/>\n&gt; naps,&quot; would anyone defend my right to that &quot;valid&quot; belief?<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Actually, that sounds about right to me.. LOL.. And, it really clears up alot <br/>\nof that Venus/Mars stuff.. <br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Beliefs is this unschooling?","postDate":"1064093794","msgId":81049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1My4yNDNhY2UzYi4yYzllMjI2MkBhb2wuY29tPg=="},"prevInTopic":81018,"nextInTopic":81061,"prevInTime":81048,"nextInTime":81050,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/20/03 11:21:19 AM, Dnowens@aol.com writes:  Apparently people didn t even","messageBody":"<div id=\"ygrps-yiv-913964689\">In a message dated 9/20/03 11:21:19 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Dnowens@...\">Dnowens@...</a> writes:<br/>\n<br/>\n&lt;&lt; If it comes from just <br/>\nyou or just Judie, then just say so.  &gt;&gt;<br/>\n<br/>\nApparently people didn&#39;t even read what Judie said, in some cases, but just <br/>\ndefended the idea that she had valid, dep beliefs without really looking at <br/>\nthem.<br/>\n<br/>\nIf I were to say &quot;I believe that when a cat dies it comes back as a female <br/>\nhuman, and when a dog dies, it comes back as a male, and that&#39;s why women are <br/>\ngenerally smaller than men and why men are the defenders and women take more <br/>\nnaps,&quot; would anyone defend my right to that &quot;valid&quot; belief?<br/>\n<br/>\nWould people believe I believed it just beause I started a paragraph &quot;I <br/>\nbelieve...&quot;?<br/>\n<br/>\nThis is The Emperor&#39;s New Clothes in action, people!  Don&#39;t say you see <br/>\nsomething and it&#39;s &quot;valid&quot; just because some other people around you went &quot;Ooooh.  <br/>\nCool.&quot;   <br/>\n<br/>\nIf we don&#39;t look for ourselves and be honest, we (humans, parents, <br/>\nunschooling parents) won&#39;t do our kids NEARLY as much good as we will if we model <br/>\ncritical thinking.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Beliefs is this unschooling?","postDate":"1064078326","msgId":81018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNmYwMWMzN2Y5YiRiNGJhYjgyMCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDE0Zi4yM2Y0YTNhYi4yYzlkZDg3YUBhb2wuY29tPg=="},"prevInTopic":81016,"nextInTopic":81049,"prevInTime":81017,"nextInTime":81019,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"... learning, and I m always tempted to say not much, but I sure am learning a lot Isn t that the truth?  I feel like a kid in a candy store with","messageBody":"<div id=\"ygrps-yiv-1398929235\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;My MIL always wonders what exactly it is that the kids are <br/>\n </span></blockquote>learning, and I&#39;m always tempted to say not much, but I sure am learning a lot&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIsn&#39;t that the truth?  I feel like a kid in a candy store with endless choices of things to learn.  I want to grab armloads and learn it all!<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":122876306,"authorName":"susan marie","from":"susan marie &lt;seanachai3@...&gt;","profile":"celticrose56","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Beliefs is this unschooling?","postDate":"1064076798","msgId":81016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGNkU3NUYxLUVCOEEtMTFENy05M0FGLTAwMzA2NUZCODJCOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDE0Zi4yM2Y0YTNhYi4yYzlkZDg3YUBhb2wuY29tPg=="},"prevInTopic":81013,"nextInTopic":81018,"prevInTime":81015,"nextInTime":81017,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"http://www.brianweiss.com/thebooks.htm#mlmm I think he talks about predestination and difficult times. It s been a while since I read this, but you might give","messageBody":"<div id=\"ygrps-yiv-643608096\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.brianweiss.com/thebooks.htm#mlmm\">http://www.brianweiss.com/thebooks.htm#mlmm</a><br/>\n<br/>\nI think he talks about predestination and difficult times. It&#39;s been a <br/>\nwhile since I read this, but you might give this a try. Sylvia Browne <br/>\nwas already mentioned - she&#39;s a kind of love her or hate her kind of <br/>\nthing. (not offering an opinion here, just info).<br/>\n<br/>\nAnother book is &quot;Karma and Reincarnation&quot; by Elizabeth Claire Prophet. <br/>\nIt&#39;s a little purple book, found in the new age section. Info on <br/>\nreincarnation can be found in Buddhist, Hindu, new age, Wiccan, pagan, <br/>\nGnostic Christian writings. It varies some, but has a lot of <br/>\nsimilarities too.<br/>\n<br/>\nMost of what I&#39;ve read doesn&#39;t talk about &quot;predestination&quot; as much as <br/>\nlife lessons and karmic debts, which is similar but does have some <br/>\nsimilarites. I think the key difference is that in karmic debts/life <br/>\nlessons, we are presented with a choice (this is pre-determined) but it <br/>\nis up to us what we choose. In predestination, how we choose is also <br/>\npredetermined, rather than simply the situation. And then of course, <br/>\nonce you choose, a whole different set of options, lessons, experiences, <br/>\nopen up based on which choice you made.<br/>\n<br/>\nhth,<br/>\nsusan<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Saturday, September 20, 2003, at 12:21  PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Dnowens@...\">Dnowens@...</a> wrote:<br/>\n<br/>\n&gt; In a message dated 9/20/03 01:16:45 AM Central Daylight Time,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:RJHill241@...\">RJHill241@...</a> writes:<br/>\n&gt; Pam,<br/>\n&gt;<br/>\n&gt; The very first paragraph from my last post addressed my own beliefs.<br/>\n&gt;<br/>\n&gt; As for needing evidence that such a theory exists, if one were to <br/>\n&gt; google:<br/>\n&gt; theory of predestination, predestination or predestination in <br/>\n&gt; religions, a<br/>\n&gt; vrtual<br/>\n&gt; plethera of sites come up<br/>\n&gt; ##################################<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Beliefs is this unschooling?","postDate":"1064074874","msgId":81013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Zi4yM2Y0YTNhYi4yYzlkZDg3YUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":81016,"prevInTime":81012,"nextInTime":81014,"topicId":81013,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/20/03 01:16:45 AM Central Daylight Time, RJHill241@aol.com writes: Pam, The very first paragraph from my last post addressed my own","messageBody":"<div id=\"ygrps-yiv-226916800\">In a message dated 9/20/03 01:16:45 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:RJHill241@...\">RJHill241@...</a> writes:<br/>\nPam,<br/>\n<br/>\nThe very first paragraph from my last post addressed my own beliefs. <br/>\n<br/>\nAs for needing evidence that such a theory exists, if one were to google: <br/>\ntheory of predestination, predestination or predestination in religions, a <br/>\nvrtual <br/>\nplethera of sites come up<br/>\n##################################<br/>\n<br/>\nOkay, I am sure others have posted on this already, but I&#39;m just getting <br/>\ngoing this morning and so I took this challenge up myself! &lt;g&gt; I spent well over <br/>\nan hour reading through countless predestination sites from Google. I&#39;ve known <br/>\nabout predestination for quite some time so I didn&#39;t find much new to me on <br/>\nany of the sites. The one thing that has been new to me recently is that a form <br/>\nof predestination that says; rapists, murderers, child molesters, all the way <br/>\ndown to bad parents, kids who stomp bugs, and eat their boogers, and throw <br/>\ntemper tantrums in the middle of the store, all chose that particular *thing* <br/>\nbefore birth. I&#39;ve heard of the Mormon belief that we all chose our birth parents <br/>\nand we are all destined to live again with God and become gods and goddesses <br/>\nin our own right after we die. (that is if we do all the right things on <br/>\nearth) I have heard of many many ideas revolving around predestination. Some even <br/>\nsound valid to me, although *I* don&#39;t believe them, I do recognize that the <br/>\nbeliefs are true and valid to others. <br/>\n<br/>\nWhat I didn&#39;t find was the idea or form of predestination presented here on <br/>\nthis list by Judie and seconded by Rhonda. Not to say it doesn&#39;t exist or isn&#39;t <br/>\ntrue to them, but I myself, did not find it on Google. BUT that is certainly <br/>\nnot to say Google is the definitive place for answers about obscure religions <br/>\nand belief systems. So, I called my pastor, who is currently going through <br/>\nmore school to further his degree and since he is close to the source of <br/>\ninformation and knowledge right now, I thought maybe he could give me an answer. No <br/>\nsuch luck. (He recommended Google &lt;g&gt;) So I am now stuck. Google didn&#39;t do it <br/>\nfor me and neither did my pastor, I&#39;m sure there are other places and people I <br/>\ncould go to for information, but really all the people here wanted to know was <br/>\nwhere THIS form or idea of predestination comes from. If it comes from just <br/>\nyou or just Judie, then just say so. <br/>\n<br/>\nAs for is this unschooling or not, I think it is, I never stop learning. Many <br/>\ndiscussions here spark my interest and I learn more and more everyday. I&#39;ve <br/>\nchanged political beliefs, educational beliefs, parenting ideals, food beliefs, <br/>\n(is there such a thing?) beliefs about TV and video games.... The list is <br/>\nlong and wide! My MIL always wonders what exactly it is that the kids are <br/>\nlearning, and I&#39;m always tempted to say not much, but I sure am learning a lot! So if <br/>\nyou could please tell me where this one particular idea of predestination <br/>\ncomes from then there is one more thing I will have learned!<br/>\n<br/>\n~Nancy<br/>\n<br/>\nGenius may have its limitations, but stupidity is not thus handicapped. <br/>\nElbert Hubbard <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":32263,"nextTopicId":81438}}