{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":66,"messages":[{"userId":183013896,"authorName":"elfmama@comcast.net","from":"elfmama@...","profile":"elfmama_2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086363390","msgId":95102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MDQyMDA0MTUzNi4yNDIzNy40MEMwOTZGRTAwMDZEMjU1MDAwMDVFQUQyMjAwNzM0ODQwMEUwMzBFMDMwMDA0MEFAY29tY2FzdC5uZXQ+"},"prevInTopic":95094,"nextInTopic":95103,"prevInTime":95101,"nextInTime":95103,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"I think what happens when people who come to this list and jump right in, with out reading and getting a good feel for the tone of the group, get offended.","messageBody":"<div id=\"ygrps-yiv-540690946\">I think what happens when people who come to this list and jump right in, with out reading and getting a good feel for the &quot;tone&quot; of the group, get offended. They want everyone to be sweetness and light. Then they post and their &quot;tone&quot; tends to be confrontational and snarky and that&#39;s what I&#39;ve noticed tends to set people off more than enything. <br/>\n<br/>\nThen you have those that come in and read for a while and then ask a question, and the &quot;tone&quot;-intent if you will-is different and it does come across, and they are much more likely to get a better, more open, response.<br/>\n<br/>\nI would love to believe that every one that come to this group is coming with the intent to be an intelligent adult :), but I don&#39;t think that has always been the case, some come spoiling for a fight, and the longer and more you&#39;ve read you can tell by the end of the first post what&#39;s going on. <br/>\n<br/>\nI think that  if you come to unschooling with an open mind and an open heart you are able to get more from these exchanges and you are more likely to embrace every thing that tends to fall into place with unschooling. <br/>\n<br/>\nIf you come with fear and doubt, and everyone that is trying to help has to break through all the doubts and fear with each new concept, it takes longer, and may never happen as fully as if you can let go and let it happen.<br/>\n<br/>\nI&#39;m not sure if I&#39;ve strayed waaayyy off topic here, but it is something I&#39;ve notice, as a long time lurker and seldom poster in this forum, that the intent, tone, meaning what ever you want to call it, does come through and people respond to that and then everything seems to escalate.<br/>\n<br/>\n~Rebecca<br/>\n<br/>\n--<br/>\nYou know, Hobbes, some days even my lucky rocketship underpants don&#39;t help.&quot;<br/>\n-Calvin<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; In a message dated 06/03/2004 1:51:24 PM Eastern Daylight Time, <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; Is it wrong, y&#39;think, to assume that participants here (those who choose to <br/>\n&gt; &gt; post, I mean) are intelligent adults?   It amazes me when someone will say <br/>\n&gt; &gt; &quot;you <br/>\n&gt; &gt; don&#39;t treat me like you treat your children.&quot;   Maybe they mean &quot;you don&#39;t <br/>\n&gt; &gt; let me fart around for six years, confident that I&#39;ll learn what I need.&quot;   <br/>\n&gt; &gt; But <br/>\n&gt; &gt; I think more often it means &quot;You expected me to be an adult.&quot;<br/>\n&gt; &gt; <br/>\n&gt; &gt; I think it would be much less respectful to treat people like they were <br/>\n&gt; &gt; fragile or slow-witted.<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;        I really do wonder about this, and have before. <br/>\n&gt; <br/>\n&gt;        Couldn&#39;t it also be asked in an unschooling sense, as in why don&#39;t we <br/>\n&gt; share unschooling with new adults using the same principles we use so <br/>\n&gt; successfully with our children? <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086360197","msgId":95094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQzA4QTg1LjgwNTA2MDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDMyQTFFMjBFLUI1RjktMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","referencesHeader":"PDU0LjJiMzVlMWMwLjJkZjBlY2Y5QGFvbC5jb20+IDwzMkExRTIwRS1CNUY5LTExRDgtQjVGOS0wMDBBOTVFMjkyQzZAbWFjLmNvbT4="},"prevInTopic":95089,"nextInTopic":95102,"prevInTime":95093,"nextInTime":95095,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"** I love the bike riding analogy - and have to say that no matter how many articles one reads about bicycling or how much time spent watching people ride","messageBody":"<div id=\"ygrps-yiv-848137222\">** I love the bike riding analogy - and have to say that no matter how<br/>\nmany articles one reads about bicycling or how much time spent watching<br/>\npeople ride bikes, you just can&#39;t really &quot;get&quot; bike riding until you<br/>\nride a bike. Unschooling is truly the same way.**<br/>\n<br/>\n<br/>\nOr to go back to a really old analogy, you can&#39;t learn to swim sitting <br/>\non the side of the pool chatting.<br/>\n<br/>\n--Betsy    (who learns many other types of things from chatting)<br/>\n<br/>\nOh!!!  Maybe that&#39;s the confusion.  When I&#39;m reading here and writing <br/>\nposts here, and chatting, I feel like I&#39;m &quot;learning&quot; a lot about <br/>\nunschooling because I&#39;m thinking and I&#39;m picking up ideas.  So some <br/>\nlearning is clearly happening.  But I&#39;m NOT learning about MY son from <br/>\nbeing online and batting words around.  (He&#39;s asleep now, but other <br/>\ntimes I&#39;m tuning him out when I&#39;m on the computer.)  I&#39;m not &quot;walking <br/>\nthe walk&quot; or &quot;riding the bike&quot; &lt;g&gt; or seeing how my child lives and <br/>\nlearns when I&#39;m here in front of the computer.<br/>\n<br/>\nIt&#39;s a lot like the difference between &quot;classroom learning&quot; (no offense) <br/>\nand &quot;life learning&quot;.  It&#39;s certainly the difference between secondhand <br/>\nstudying and firsthand experience.<br/>\n<br/>\n--Betsy</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Meet A Person Where She&#39;s At","postDate":"1086353114","msgId":95089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5cHFzcStkdDhpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5b3QwMytjamd1QGVHcm91cHMuY29tPg=="},"prevInTopic":95088,"nextInTopic":95094,"prevInTime":95088,"nextInTime":95090,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... A month to get the difference between what I was doing and what this list was showing me. Lol. It has taken all 18 mos since then to change and I m still","messageBody":"<div id=\"ygrps-yiv-994912398\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, mulwiler@h... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; Julie B wrote:<br/>\n&gt; &lt;&lt;&lt;&lt;&lt;  It took a month of reconsidering my entire parenting <br/>\n&gt; philosophy to &quot;get it&quot; and I felt a bit chagrined on several <br/>\n&gt; occasions.   &gt;&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Only a month????????<br/>\n<br/>\n </span></blockquote>A month to get the difference between what I was doing and what this list was showing <br/>\nme. Lol. It has taken all 18 mos since then to change and I&#39;m still changing. &lt;bwg&gt;<br/>\n<br/>\nI&#39;m with you. It&#39;s hard work to make the shift. I shift, then I take it back, then I shift some <br/>\nmore.<br/>\n<br/>\nThe biggest help in changing, though, has been working with teens who aren&#39;t my kids. <br/>\nI&#39;ve been amazed at how many are comfortable lying about who they are to please their <br/>\nparents. (And these are kids raised with religious convictions...)<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Meet A Person Where She&#39;s At","postDate":"1086352009","msgId":95088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyN2MwMWM0NGEyZiQzNzViZDRlMCQ2NDAxYThjMEBNT0xFMjY5MDA+","referencesHeader":"PDJCN0FBMUQ0LUI1QTEtMTFEOC05M0M0LTAwMEE5NUYwRjU2QUBicmF2ZXdyaXRlci5jb20+IDwwMDEzMDFjNDQ5YTckNTA0ZDg0NDAkMDIwMWE4YzBAYW8ubG9wLmNvbT4gPDAyMzAwMWM0NDlkNiQ0MDljNGE3MCQ2NDAxYThjMEBNT0xFMjY5MDA+IDwwMDMzMDFjNDQ5ZWMkOGYxMDBkYzAkMDIwMWE4YzBAYW8ubG9wLmNvbT4="},"prevInTopic":95083,"nextInTopic":95089,"prevInTime":95087,"nextInTime":95089,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"But if your kids weren t doing stuff that looked like school for extended periods of time (like several months), would you be ok with that? ... school stuff","messageBody":"<div id=\"ygrps-yiv-1537006514\">But if your kids weren&#39;t doing stuff that looked like school for extended<br/>\nperiods of time (like several months), would you be ok with that?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;   Its when kids elect to do their own thing and it *doesn&#39;t* look like<br/>\n </span></blockquote>school stuff that parents have to decide where they stand.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;   For us, that was where the rubber met the road.<br/>\n&gt;<br/>\n&gt;   Kristen<br/>\n </span></blockquote>================<br/>\n<br/>\nThey do stuff all the time that doesn&#39;t look like &quot;school stuff,&quot; but<br/>\nthey&#39;re still learning. I just don&#39;t believe it&#39;s possible to live in this<br/>\nworld and not learn. It honestly doesn&#39;t matter to me what they choose to<br/>\nlearn about or do as long as they are happy, growing and loving their life.<br/>\nMy kids go days without doing something that looks schooly, but invariably,<br/>\nit pops up again. After the Survivor final show, the girls were writing all<br/>\nkinds of names down on slips of paper and asked me for a pottery jug like<br/>\nthe one used in tribal councils. They played their own version of Survivor<br/>\nfor a week, writing names down on slips of paper every day. Writing.<br/>\nCouldn&#39;t&#39;ve, wouldn&#39;t&#39;ve made &#39;em do it, but they did it on their own.<br/>\n<br/>\n=================<br/>\nPam wrote:<br/>\nBut - when the kids are older, the requirements are more specific.<br/>\nEighth grade is American History. If the kid is into Magic, the<br/>\nGathering, skateboarding, and Russian novels &lt;G&gt; it is hard to call<br/>\nthat fulfilling the American History requirement.<br/>\n=================<br/>\n<br/>\nSee, there&#39;s the rub. Maryland has this really annoying legal wording<br/>\n&quot;regular and thorough instruction in the subjects usually taught&quot;--that&#39;s<br/>\nwhat really gets me going. Why in the world, should a person have to learn<br/>\nAmerican History or anything for that matter just because someone else says<br/>\nthat it&#39;s time to do that? ARGH! That is my biggest, biggest beef with the<br/>\nMD hsing law and with curriculum in general! Everything Pam named that the<br/>\nchild might be interested in offers wonderful learning opportunities. That<br/>\nchild, pursuing Magic, skateboarding and Russian novels, is learning a<br/>\ntremendous amount, much of which could relatively easily be translated into<br/>\nschooly terms though it likely looks nothing like school. The only thing<br/>\nthat has changed is that some arbitrary person has laid some arbitrary time<br/>\ntable over top a child&#39;s life and judged them unworthy.<br/>\n<br/>\nDamn if I&#39;d want someone to do that to my life! My passion for several years<br/>\nhas been learning all about gardening, landscaping, plant identification,<br/>\nLatin names, etc. Now, I&#39;m learning about chickens, heirloom breeds,<br/>\nlayers--chickens, for heaven&#39;s sake! Never would&#39;ve predicted that! Point<br/>\nis, I&#39;m learning all the time about different things that fit no one&#39;s<br/>\ntimetable or agenda but my own (chickens don&#39;t even fit dh&#39;s, but we won&#39;t<br/>\ngo there *g*). But my life is rich, fulfilling and worthwhile.<br/>\n<br/>\nOnce we remove artificial timetables and expectations, kids learn. Many of<br/>\nthem even learn despite those things, but they shouldn&#39;t have to.  Kids<br/>\nlearn all the time about all kinds of things in a way that&#39;s broader and<br/>\nricher than any contrived curriculum could be. I honestly believe that. If I<br/>\ncan see all this in my children now and trust them to find their own path<br/>\nthrough their world, then as they get older, that trust is the same. My<br/>\nchildren may look different and their path may have changed, but my trust<br/>\nand faith in them should be the same if not stronger because it has so many<br/>\nyears of foundation under it. That&#39;s what I hope for myself and my children<br/>\nanyway. Time will tell.<br/>\n<br/>\n--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a></div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Meet A Person Where She&#39;s At","postDate":"1086349510","msgId":95083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5cG5jNis2bDR2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyMzAwMWM0NDlkNiQ0MDljNGE3MCQ2NDAxYThjMEBNT0xFMjY5MDA+"},"prevInTopic":95074,"nextInTopic":95088,"prevInTime":95082,"nextInTime":95084,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... My original comment at the top comes from a different perspective than what you express here. Moms who want both usually mean they want to *ensure* that","messageBody":"<div id=\"ygrps-yiv-1303666953\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Danielle Conger&quot; <br/>\n&lt;danielle.conger@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Those who think they can have both - unschooling and some reassurance<br/>\n&gt; &gt; that they are fulfilling the requirements of school - feel threatened<br/>\n&gt; &gt; when they have to make a true choice about what they believe about<br/>\n&gt; &gt; education.<br/>\n&gt; &gt; **************************<br/>\n&gt; &gt; &gt; I think this is it in a nutshell.  <br/>\n<br/>\n&gt; <br/>\n&gt; Gee, I don&#39;t think that&#39;s unschooling in a nutshell. My kids do things all<br/>\n&gt; the time that could appear quite schooly and go far towards &quot;fulfilling the<br/>\n&gt; requirements of school.&quot; Those are exactly the kinds of things I talk about<br/>\n&gt; for my portfolio reviews. Of course, my kids are still young so that could<br/>\n&gt; change, but I kind of doubt it.<br/>\n<br/>\n&gt; I guess my point is that along with all the other wonderful, fun, amazing<br/>\n&gt; things we do on a daily basis, several things &quot;fulfilling the requirements<br/>\n&gt; of school&quot; emerge without fail and without force.<br/>\n&gt; <br/>\n&gt; --Danielle<br/>\n<br/>\n </span></blockquote>My original comment at the top comes from a different perspective than what you express <br/>\nhere. Moms who &quot;want both&quot; usually mean they want to *ensure* that their children are <br/>\ngetting what they &quot;need.&quot; They aren&#39;t focused on watching the learning process unfold and <br/>\nthen quantifying it for a year end assessment.<br/>\n<br/>\nThey are following a child&#39;s natural interests for some of the day and then using a <br/>\nworkbook for math. Or they are teaching an 8 year old how to read using a phonics <br/>\nprogram, but are following a child&#39;s desires for non-essentials.<br/>\n<br/>\nAnd you are right. As kids get older, anxiety grows. Moms want to be sure their kids aren&#39;t <br/>\nmissing anything that would be important. So instead of letting kids set the agenda, mom <br/>\ntries to find better kid-friendly materials or allows the child to structure his day or she <br/>\nuses a minimum of curricula with most of the day free.<br/>\n<br/>\nAll of these approaches are seen as unschooling in some circles. It was easier for me to <br/>\nignore school requirements when my kids were little. But the pressure to &quot;prepare for <br/>\ncollege&quot; undid much of my early unschooling enthusiasm. <br/>\n<br/>\nThe only way I was able to make the shift myself was to completely give up fulfilling <br/>\ncollege admissions requirements. I really had to face down my fears and admit that I was <br/>\nstill enmeshed with the education model that school offered me.<br/>\n<br/>\nOnce I let that go, I really did find unschooling to be something totally different than the <br/>\nboth/and model I had tried to make work before.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086336128","msgId":95074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5RkQwNDlBLUI1RkQtMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDQwQkZGRjAzLjIwMTAwMDNAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDJiLjU5MTM2MTViLjJkZjEzY2Y4QGFvbC5jb20+IDw0MEJGRkYwMy4yMDEwMDAzQGVhcnRobGluay5uZXQ+"},"prevInTopic":95072,"nextInTopic":95083,"prevInTime":95073,"nextInTime":95075,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... They can take as long as they want, of course. But if you re asking why we try to push them to make the leap quickly, it is because their 13 yo whom","messageBody":"<div id=\"ygrps-yiv-2144320740\">On Jun 3, 2004, at 9:48 PM, Elizabeth Hill wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;&quot;If it&#39;s okay for our kids to take 5 years before they come around to,<br/>\n&gt; say, learning the multiplication table, why isn&#39;t it okay for someone <br/>\n&gt; to<br/>\n&gt; take 5 years for a parent on this forum to be &quot;developmentally ready&quot; <br/>\n&gt; to<br/>\n&gt; unschool? &quot;&quot;<br/>\n&gt;<br/>\n&gt; Is it just that adults are full-grown and should already be mature<br/>\n&gt; enough and developmentally ready for any grown-up task?  Or is coming <br/>\n&gt; on<br/>\n&gt; to the list and asking for information a sign of readiness?  Is it a<br/>\n&gt; misleading sign?<br/>\n<br/>\n </span></blockquote>They can take as long as they want, of course. But if you&#39;re asking why <br/>\nwe try to push them to make the leap quickly, it is because their 13 yo <br/>\nwhom they&#39;ve just taken out of school and they&#39;re dithering about <br/>\nunschooling - will be grown up and an adult by the time they finally <br/>\nrealize that they should have &quot;just done it.&quot;<br/>\n<br/>\nKids grow up REALLY quickly.<br/>\n<br/>\n-pam<br/>\n<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Meet A Person Where She&#39;s At","postDate":"1086334827","msgId":95072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyNDA3RkUyLUI1RkEtMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDAyMzAwMWM0NDlkNiQ0MDljNGE3MCQ2NDAxYThjMEBNT0xFMjY5MDA+","referencesHeader":"PDJCN0FBMUQ0LUI1QTEtMTFEOC05M0M0LTAwMEE5NUYwRjU2QUBicmF2ZXdyaXRlci5jb20+IDwwMDEzMDFjNDQ5YTckNTA0ZDg0NDAkMDIwMWE4YzBAYW8ubG9wLmNvbT4gPDAyMzAwMWM0NDlkNiQ0MDljNGE3MCQ2NDAxYThjMEBNT0xFMjY5MDA+"},"prevInTopic":95071,"nextInTopic":95074,"prevInTime":95071,"nextInTime":95073,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... Danielle -- I think it IS really different as the kids get older. When they are young, the school requirements are primarily intended to help kids learn","messageBody":"<div id=\"ygrps-yiv-2133068402\">On Jun 3, 2004, at 6:50 PM, Danielle Conger wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Gee, I don&#39;t think that&#39;s unschooling in a nutshell. My kids do things <br/>\n&gt; all<br/>\n&gt; the time that could appear quite schooly and go far towards <br/>\n&gt; &quot;fulfilling the<br/>\n&gt; requirements of school.&quot; Those are exactly the kinds of things I talk <br/>\n&gt; about<br/>\n&gt; for my portfolio reviews. Of course, my kids are still young so that <br/>\n&gt; could<br/>\n&gt; change, but I kind of doubt it.<br/>\n<br/>\n </span></blockquote>Danielle -- I think it IS really different as the kids get older. When <br/>\nthey are young, the school requirements are primarily intended to help <br/>\nkids learn skills - reading, writing, basic numerical concepts. Well - <br/>\nmost of what young kids DO is helping them learn those things so it <br/>\nisn&#39;t hard to see that they actually ARE fulfilling the requirements.<br/>\n<br/>\nBut - when the kids are older, the requirements are more specific. <br/>\nEighth grade is American History. If the kid is into Magic, the <br/>\nGathering, skateboarding, and Russian novels &lt;G&gt; it is hard to call <br/>\nthat fulfilling the American History requirement.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086334290","msgId":95071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyQTFFMjBFLUI1RjktMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDU0LjJiMzVlMWMwLjJkZjBlY2Y5QGFvbC5jb20+","referencesHeader":"PDU0LjJiMzVlMWMwLjJkZjBlY2Y5QGFvbC5jb20+"},"prevInTopic":95070,"nextInTopic":95072,"prevInTime":95070,"nextInTime":95072,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... People learn about unschooling by talking to unschoolers in person, reading books and articles about unschooling, reading email lists, observing unschooled","messageBody":"<div id=\"ygrps-yiv-1850656752\">On Jun 3, 2004, at 2:07 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;        Perhaps more like, why can&#39;t they &quot;learn about unschooling lots <br/>\n&gt; of<br/>\n&gt; different ways?&quot;<br/>\n<br/>\n </span></blockquote>People learn about unschooling by talking to unschoolers in person, <br/>\nreading books and articles about unschooling, reading email lists, <br/>\nobserving unschooled children and teens, asking questions of <br/>\nunschoolers, asking questions of people who choose NOT to unschool, <br/>\ngoing to conferences and listening to speakers, thinking about learning <br/>\nand child development, pondering our own experience of schooling and <br/>\nlearning, finding out about other people&#39;s experiences, and, finally <br/>\nand by FAR the most important - taking the plunge and learning how <br/>\nunschooling works by DOING it.<br/>\n<br/>\nI love the bike riding analogy - and have to say that no matter how <br/>\nmany articles one reads about bicycling or how much time spent watching <br/>\npeople ride bikes, you just can&#39;t really &quot;get&quot; bike riding until you <br/>\nride a bike. Unschooling is truly the same way.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086325234","msgId":95070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MS4yOWQ3MzRhNC4yZGYxNWJmMkBhb2wuY29tPg=="},"prevInTopic":95068,"nextInTopic":95071,"prevInTime":95069,"nextInTime":95071,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/04 10:42:48 PM, ecsamhill@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-481830939\">In a message dated 6/3/04 10:42:48 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt;  So to some <br/>\n<br/>\nextent, this list tends to discourage the starting to unschool by <br/>\n<br/>\ndipping your toe in slowly and then stopping method. &gt;&gt;<br/>\n<br/>\nI&#39;ve never seen this list withhold a link or book recommendation.  I&#39;ve never <br/>\nseen this list tell people anything remotely like &quot;All the information  you <br/>\nneed is here.  Don&#39;t even look around.  Don&#39;t use the real world, use just <br/>\nexactly what we tell you.&quot;<br/>\n<br/>\n-=-** Have we ever kept anyone from learning all different ways?  **-=-<br/>\n<br/>\nI think we haven&#39;t, haven&#39;t tried, and couldn&#39;t if we DID try.<br/>\nBut they cannot possibly learn all different ways on this list.  This list is <br/>\njust words.  It&#39;s not personal experience with one&#39;s own child.  It&#39;s not the <br/>\nin-person observance of other homeschooling families.  It&#39;s not feeling one&#39;s <br/>\nfeelings about childhood sorrows.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Meet A Person Where She&#39;s At","postDate":"1086324907","msgId":95068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQzAwMEFCLjYwMTA2MDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGM5b3QwMytjamd1QGVHcm91cHMuY29tPg==","referencesHeader":"PGM5b3QwMytjamd1QGVHcm91cHMuY29tPg=="},"prevInTopic":95067,"nextInTopic":95070,"prevInTime":95067,"nextInTime":95069,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"** THEN I found out that my boys - at 19 (while not living at home anymore) and at 16 were making some choices that I was surprised at. I guess surprised is","messageBody":"<div id=\"ygrps-yiv-2078924654\">** THEN<br/>\n<br/>\nI found out that my boys - at 19 (while not living at home anymore)<br/>\nand at 16 were making some choices that I was surprised at. I guess<br/>\nsurprised is too mild  - devastated more like. The thing they were<br/>\ndoing wasn&#39;t horrible, or mean, or even unusual, but to me it was<br/>\ndevastating. I felt betrayed.  I had done everything &quot;right&quot;<br/>\n- how could this be?<br/>\n<br/>\n**<br/>\n<br/>\nHi, Mercedes --<br/>\n<br/>\nI just wanted to make sure that you know that I hadn&#39;t read your post <br/>\nwhen I wrote lightly about not wanting people to &quot;learn about <br/>\nunschooling&quot; by messing up the first kid.  I didn&#39;t mean to post <br/>\nsomething that hits so close to home.<br/>\n<br/>\nSorry for say something that seemed so personal.<br/>\nBetsy</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086324483","msgId":95067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQkZGRjAzLjIwMTAwMDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDJiLjU5MTM2MTViLjJkZjEzY2Y4QGFvbC5jb20+","referencesHeader":"PDJiLjU5MTM2MTViLjJkZjEzY2Y4QGFvbC5jb20+"},"prevInTopic":95066,"nextInTopic":95068,"prevInTime":95066,"nextInTime":95068,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"** ","messageBody":"<div id=\"ygrps-yiv-604758590\">** &lt;&lt;  [Betsy]  If there are many ways for our children<br/>\nto learn, say &quot;handwriting&quot;, why are there stricter guidelines about how<br/>\nto unschool, or at least how to be within the boundary of &quot;that&#39;s good<br/>\nunschooling practice&quot; rather than falling into &quot;that&#39;s not good<br/>\nunschooling practice&quot;. &gt;&gt;<br/>\n<br/>\n[ Sandra ]But if we can&#39;t read what they write, they don&#39;t &quot;have <br/>\nhandwriting&quot; yet.<br/>\nIf kids aren&#39;t learning in a peaceful, natural way and if the parents <br/>\nare all<br/>\njittery and ready to give up at any moment, they don&#39;t &quot;have <br/>\nunschooling&quot; yet.**<br/>\n<br/>\n<br/>\nA tranquilizer gun might come in handy for calming the most jittery <br/>\npeople down.&lt;g&gt;  &lt;kidding&gt;<br/>\n<br/>\nI was thinking that maybe a better way to rephrase the complaint -- <br/>\n&quot;You&#39;re not treating me as well as you treat your kids&quot; would be this:<br/>\n<br/>\n&quot;&quot;If it&#39;s okay for our kids to take 5 years before they come around to, <br/>\nsay, learning the multiplication table, why isn&#39;t it okay for someone to <br/>\ntake 5 years for a parent on this forum to be &quot;developmentally ready&quot; to <br/>\nunschool? &quot;&quot;<br/>\n<br/>\nIs it just that adults are full-grown and should already be mature <br/>\nenough and developmentally ready for any grown-up task?  Or is coming on <br/>\nto the list and asking for information a sign of readiness?  Is it a <br/>\nmisleading sign?<br/>\n<br/>\nOverall, we are very patient with giving our children as much time and <br/>\nattention as they need.  I agree that it&#39;s not possible or desirable to <br/>\ngive list posters the same amount of attention that we give to our <br/>\nchildren.  But apparently that&#39;s what some people wish they could get.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086324161","msgId":95066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQkZGREMxLjIwMTAwMDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDZkLjJiMmZmZWEzLjJkZjEzZTU0QGFvbC5jb20+","referencesHeader":"PDZkLjJiMmZmZWEzLjJkZjEzZTU0QGFvbC5jb20+"},"prevInTopic":95064,"nextInTopic":95067,"prevInTime":95065,"nextInTime":95067,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"** Have we ever kept anyone from learning all different ways?  **   Well, we TRY to discourage people from learning from big mistakes, e.g. messing up the","messageBody":"<div id=\"ygrps-yiv-1847568496\">** Have we ever kept anyone from learning all different ways?  **<br/>\n<br/>\n<br/>\n&lt;g&gt;  Well, we TRY to discourage people from learning from big mistakes, <br/>\ne.g. messing up the first kid badly and then deciding to raise the next <br/>\nkid completely differently.  BUT I think there are fine and valid <br/>\nreasons for discouraging that kind of learning.<br/>\n<br/>\nAnd sometimes we don&#39;t want people who are hemi-semi-demi-unschooling to <br/>\ngive us the credit for the (poor) outcome that we think they might <br/>\nhave.  So they do get kind of &quot;disavowed&quot;.  They aren&#39;t told they must <br/>\nchange their ways.  But they are told not to attribute their practices <br/>\nto this list if we think their practices aren&#39;t sound.  So to some <br/>\nextent, this list tends to discourage the starting to unschool by <br/>\ndipping your toe in slowly and then stopping method.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Meet A Person Where She&#39;s At","postDate":"1086323382","msgId":95064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzMwMWM0NDllYyQ4ZjEwMGRjMCQwMjAxYThjMEBhby5sb3AuY29tPg==","referencesHeader":"PDJCN0FBMUQ0LUI1QTEtMTFEOC05M0M0LTAwMEE5NUYwRjU2QUBicmF2ZXdyaXRlci5jb20+IDwwMDEzMDFjNDQ5YTckNTA0ZDg0NDAkMDIwMWE4YzBAYW8ubG9wLmNvbT4gPDAyMzAwMWM0NDlkNiQ0MDljNGE3MCQ2NDAxYThjMEBNT0xFMjY5MDA+"},"prevInTopic":95062,"nextInTopic":95066,"prevInTime":95063,"nextInTime":95065,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... as middle ground when you are talking about unschooling. ... you re not in the middle anymore.  You have to make a choice. ... ","messageBody":"<div id=\"ygrps-yiv-1431792994\"><blockquote><span title=\"ireply\">&gt; Those who think they can have both - unschooling and some reassurance<br/>\n  &gt; that they are fulfilling the requirements of school - feel threatened<br/>\n  &gt; when they have to make a true choice about what they believe about<br/>\n  &gt; education.<br/>\n  &gt; **************************<br/>\n  &gt; &gt; I think this is it in a nutshell.  I don&#39;t think there is any such thing<br/>\n </span></blockquote>  as middle ground when you are talking about unschooling.<br/>\n<blockquote><span title=\"ireply\">   &gt;<br/>\n  &gt; The path to get there might take the middle ground, but when you&#39;re there,<br/>\n </span></blockquote>  you&#39;re not in the middle anymore.  You have to make a choice.<br/>\n<blockquote><span title=\"ireply\">   &gt;<br/>\n  &gt; Kristen<br/>\n </span></blockquote>  ==========================================<br/>\n<br/>\n  Gee, I don&#39;t think that&#39;s unschooling in a nutshell. My kids do things all<br/>\n  the time that could appear quite schooly and go far towards &quot;fulfilling the<br/>\n  requirements of school.&quot; Those are exactly the kinds of things I talk about<br/>\n  for my portfolio reviews. <br/>\n<br/>\n  **********************<br/>\n<br/>\n  But if your kids weren&#39;t doing stuff that looked like school for extended periods of time (like several months), would you be ok with that?<br/>\n<br/>\n  Its when kids elect to do their own thing and it *doesn&#39;t* look like school stuff that parents have to decide where they stand.<br/>\n<br/>\n  For us, that was where the rubber met the road.<br/>\n<br/>\n  Kristen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":36584094,"authorName":"mulwiler@hotmail.com","from":"mulwiler@...","profile":"mhf1978","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Meet A Person Where She&#39;s At","postDate":"1086322499","msgId":95062,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5b3QwMytjamd1QGVHcm91cHMuY29tPg=="},"prevInTopic":95061,"nextInTopic":95064,"prevInTime":95061,"nextInTime":95063,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote: ","messageBody":"<div id=\"ygrps-yiv-1948622458\">Sandra wrote:<br/>\n<br/>\n&lt;&lt;&lt;&lt;   That&#39;s sometimes the biggest jump. Sometimes someone can <br/>\nunschool a while before moving toward having more real respect for <br/>\nand faith in the child.  &gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nTook me about three years. . . .    :-(<br/>\n<br/>\n<br/>\nBetsy wrote:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;  We could discuss how we all came to unschooling, which <br/>\nchanges we made first and which later, if it was a slow process.  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>As one who came to unschooling very late - and mindful parenting <br/>\n(which I think is different from unschooling) even later - it was a <br/>\nslow - and sometimes painful process.<br/>\n<br/>\nPartly because I was trained as a teacher (that&#39;s why the<br/>\nunschooling <br/>\npart took so long), partly because I had always been<br/>\n&quot;admired&quot; (or <br/>\nsomething - can&#39;t think of a better word - &quot;looked-up-to&quot; <br/>\nor &quot;respected&quot; maybe?)  as a really &quot;good&quot; mom by<br/>\nboth friends and <br/>\nfamily, it took alot to shake those firm beliefs that I was doing the <br/>\nRIGHT thing - the best thing. I realize now that it was my kids <br/>\nability to adapt to me that made me look so good.  I controlled it <br/>\nall - bedtime(curfew), food, videos, we didn&#39;t  even have a TV, <br/>\nschoolwork after we started homeschooling - and still  my children <br/>\nwere respectful, happy (mostly), and &quot;successful&quot;.<br/>\n<br/>\nTHEN<br/>\n<br/>\nI found out that my boys - at 19 (while not living at home anymore) <br/>\nand at 16 were making some choices that I was surprised at. I guess <br/>\nsurprised is too mild  - devastated more like. The thing they were <br/>\ndoing wasn&#39;t horrible, or mean, or even unusual, but to me it was <br/>\ndevastating. I felt betrayed.  I had done everything &quot;right&quot;<br/>\n- how could this be? <br/>\n<br/>\n<br/>\n<br/>\nSandra wrote:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;  And anyone who CAN or has done so is (in my opinion) not <br/>\nanalytical enough in a philosophical way to be a good unschooler <br/>\nanyway, and there&#39;s no sense blaming the rest of us.  &gt;&gt;&gt;&gt;<br/>\n<br/>\nMy biggest problem was not seeing that traditional parenting <br/>\ninterferes with unschooling in a very big way.  The biggest way. <br/>\n<br/>\nI really think that as long as a child has a mindful parent, they can <br/>\nsail through anything - that includes school. It&#39;s not ideal but <br/>\nmindful parenting is the key.<br/>\n<br/>\n<br/>\nKristin writes:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;  But I&#39;m really glad I persisted long enough to find them <br/>\nbecause now it all makes total sense (and resembles common sense more <br/>\nthan anything &quot;radical&quot;).   &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nCommon Sense Unschooling?   Much more descriptive that radical <br/>\nunschooling but not catchy enough. . . <br/>\n<br/>\n<br/>\nJulie B wrote:<br/>\n&lt;&lt;&lt;&lt;&lt;  It took a month of reconsidering my entire parenting <br/>\nphilosophy to &quot;get it&quot; and I felt a bit chagrined on several <br/>\noccasions.   &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nOnly a month????????<br/>\n<br/>\n<br/>\nMercedes<br/>\nthe slow one. . . . . .  who spends alot of time pointing out to her <br/>\n23yo and 19yo the insidious effects of having controlling <br/>\nparents. . . . .</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086320336","msgId":95061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Zi4yNTZjYTMxMi4yZGYxNDhkMEBhb2wuY29tPg=="},"prevInTopic":95060,"nextInTopic":95062,"prevInTime":95060,"nextInTime":95062,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/04 9:23:31 PM, jrossedd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-554610983\">In a message dated 6/3/04 9:23:31 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\n       I thought it was a productive discussion about ways unschooling <br/>\ndiscussion (not just here but anywhere) might be productive. No?  &gt;&gt;<br/>\n<br/>\nI think this list is quite productive.<br/>\nUnschooling.com&#39;s message boards are too.<br/>\n<br/>\nWe don&#39;t need to be anyone be-all/end-all.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086319356","msgId":95060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjLjJjZWFhYzAzLjJkZjE0NGZjQGFvbC5jb20+"},"prevInTopic":95058,"nextInTopic":95061,"prevInTime":95059,"nextInTime":95061,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... I thought it was a productive discussion about ways unschooling discussion (not just here but anywhere) might be productive. No? [Non-text portions of this","messageBody":"<div id=\"ygrps-yiv-93907955\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In a message dated 6/3/04 4:03:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt;     Perhaps more like, why can&#39;t they &quot;learn about unschooling lots of <br/>\n&gt; different ways?&quot; &gt;&gt;<br/>\n&gt; <br/>\n&gt; Can&#39;t they?<br/>\n&gt; <br/>\n&gt; Have we ever kept anyone from learning all different ways?<br/>\n&gt; <br/>\n&gt; Nobody can learn all about unschooling on this list and then go and begin to <br/>\n&gt; <br/>\n&gt; do it.  They need to see it in their kids, not in us.  They need to feel it <br/>\n&gt; in <br/>\n&gt; their own souls and bodies, not have us say &quot;Yeah, okay, that&#39;s it.&quot;<br/>\n&gt; <br/>\n&gt; -=-Would it be useful to think of the ways that what we do <br/>\n&gt; to help people unschool successfully IS like unschooling itself? -=-<br/>\n&gt; <br/>\n&gt; We&#39;re offering information and ideas.  We&#39;re not &quot;unschooling them.&quot;  We&#39;re <br/>\n&gt; providing a place for discussions, and trying to keep the discussions <br/>\n&gt; productive.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>       I thought it was a productive discussion about ways unschooling <br/>\ndiscussion (not just here but anywhere) might be productive. No? <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086317652","msgId":95058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZkLjJiMmZmZWEzLjJkZjEzZTU0QGFvbC5jb20+"},"prevInTopic":95055,"nextInTopic":95060,"prevInTime":95057,"nextInTime":95059,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/04 4:03:44 PM, jrossedd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1256788222\">In a message dated 6/3/04 4:03:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> writes:<br/>\n<br/>\n&lt;&lt;     Perhaps more like, why can&#39;t they &quot;learn about unschooling lots of <br/>\ndifferent ways?&quot; &gt;&gt;<br/>\n<br/>\nCan&#39;t they?<br/>\n<br/>\nHave we ever kept anyone from learning all different ways?<br/>\n<br/>\nNobody can learn all about unschooling on this list and then go and begin to <br/>\ndo it.  They need to see it in their kids, not in us.  They need to feel it in <br/>\ntheir own souls and bodies, not have us say &quot;Yeah, okay, that&#39;s it.&quot;<br/>\n<br/>\n-=-Would it be useful to think of the ways that what we do <br/>\nto help people unschool successfully IS like unschooling itself? -=-<br/>\n<br/>\nWe&#39;re offering information and ideas.  We&#39;re not &quot;unschooling them.&quot;  We&#39;re <br/>\nproviding a place for discussions, and trying to keep the discussions <br/>\nproductive.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086317304","msgId":95055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJiLjU5MTM2MTViLjJkZjEzY2Y4QGFvbC5jb20+"},"prevInTopic":95054,"nextInTopic":95058,"prevInTime":95054,"nextInTime":95056,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/04 2:20:48 PM, ecsamhill@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-2060563430\">In a message dated 6/3/04 2:20:48 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt;  If there are many ways for our children <br/>\n<br/>\nto learn, say &quot;handwriting&quot;, why are there stricter guidelines about how <br/>\n<br/>\nto unschool, or at least how to be within the boundary of &quot;that&#39;s good <br/>\n<br/>\nunschooling practice&quot; rather than falling into &quot;that&#39;s not good <br/>\n<br/>\nunschooling practice&quot;. &gt;&gt;<br/>\n<br/>\nBut if we can&#39;t read what they write, they don&#39;t &quot;have handwriting&quot; yet.<br/>\nIf kids aren&#39;t learning in a peaceful, natural way and if the parents are all <br/>\njittery and ready to give up at any moment, they don&#39;t &quot;have unschooling&quot; yet.<br/>\n<br/>\nWe don&#39;t have to tell them they are or aren&#39;t riding a bike.  They either are <br/>\nmoving along without falling off, or they&#39;re not.<br/>\n<br/>\n-=-What I don&#39;t understand is why people feel insulted if told &quot;that&#39;s not <br/>\n<br/>\nunschooling&quot;.-=-<br/>\n<br/>\nSometimes, I think they see that other people declared themselves to be <br/>\nunschoolers, and they don&#39;t need to buy a curriculum or perform certain schoolish <br/>\nduties or test-to-prove, and so they say &quot;Oh!  I&#39;m an unschooler too!&quot;   I <br/>\nthink they might think it&#39;s the moment of saying &quot;I&#39;m an unschooler&quot; that makes it <br/>\ntrue, rather than considering that maybe others have thought, attempted, <br/>\ntweaked and succeeded first and THEN said &quot;I&#39;m an unschooler.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086316318","msgId":95054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYi4yMzM3ODQxNC4yZGYxMzkxZUBhb2wuY29tPg=="},"prevInTopic":95052,"nextInTopic":95055,"prevInTime":95053,"nextInTime":95055,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/04 12:15:12 PM, jrossedd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1554827599\">In a message dated 6/3/04 12:15:12 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> writes:<br/>\n<br/>\n&lt;&lt; And I&#39;ve been <br/>\nwondering why I for one am endlessly patient and much more likely to respond <br/>\nwith humor to people who already &quot;get&quot; it than to people who don&#39;t seem to <br/>\nget it <br/>\nat all. You&#39;d think the latter would be more like children needing the best <br/>\nI&#39;ve got to offer. &gt;&gt;<br/>\n<br/>\nMaybe because we all spend SO much time with our children we are impatient <br/>\nwith other adults who want to be treated like children?     <br/>\n<br/>\nAlthough I have a lot of confidence that my kids will learn what they need, <br/>\nthere are situations in which they need to be as alert as possible and do what <br/>\nthey went to do.  Marty, when he played ice hockey.  They need him to do his <br/>\nbest right then, or he&#39;s wasting the other kids&#39; time and the coach&#39;s time.   <br/>\nKirby, at karate.  It&#39;s not okay to stop during a class and go look at the <br/>\nphotos on the wall.<br/>\n<br/>\n-=-       And having rules, -=-<br/>\n<br/>\nLike guidelines for this list?<br/>\n<br/>\nHolly has kids over.  One left a can in the den.  If it&#39;s still there in a <br/>\nfew hours, I&#39;ll ask him to go get it.  It&#39;s not a rule, it&#39;s a principle.  I <br/>\nimagine, though, that someone else will pass through there later and bring it <br/>\nupstairs.  Or when these guys decide it&#39;s time to crush cans (we&#39;ve saved cans <br/>\nthis week for them to crush because they like the can crusher we have mounted on <br/>\nthe wall), they&#39;ll probably remember it&#39;s down there.  <br/>\n<br/>\nIs that &quot;a rule,&quot; that I think cans should be crushed and put in the <br/>\nrecycling?  Probably.  Maybe.  If they want to continue to have overnighters here, <br/>\nthey&#39;ll do best not to waste time or be tacky.  But they&#39;re not tacky, because <br/>\nthey like to be here.<br/>\n<br/>\n-=-But I&#39;m uncomfortable to realize that learning <br/>\nabout unschooling can feel pretty authoritarian.-=-<br/>\n<br/>\nNobody needs our permission, or our certification, or our ANYTHING to <br/>\nunschool, or to learn about unschooling.  They just need to be cooperative enough if <br/>\nthey want to stay on this list.<br/>\n<br/>\n-=-Can unschooling be unschooled?-=-<br/>\n<br/>\nThough I can point back to lots of things through the years that contributed <br/>\nto my own understanding and ease with unschooling, when I decided I wanted to <br/>\ndo that, I had already looked at both unschooling and structured homeschooling <br/>\nfamilies.  I subscribed to Growing Without Schooling.  I bought and read a <br/>\ncopy of &quot;Teach Your Own.&quot;  <br/>\n<br/>\nIn those days, there was nothing like this available.  People can learn as <br/>\nmuch in a month now as took a year or more in those days.  But they don&#39;t HAVE <br/>\nto do that.  They have tons of options, including asking around, subscribing to <br/>\nHEM or Life Learning, reading Holt...<br/>\n<br/>\nIf people want to take a long time to get there, they can.  If they want to <br/>\ntake a couple of giant steps and get there this week, they can.  If they want <br/>\nto waste a bunch of my time and insult me as they maybe think about getting <br/>\nthere, or say they&#39;ve been there since their kids were born, or that they don&#39;t <br/>\nhave to listen to us, nanny-nanny-boo-boo,  that&#39;s not okay with me.  They can <br/>\ngo away and NOT waste my time; that&#39;s fine.  But to stay in the faces of <br/>\nunschoolers who just honestly want to discuss it on a more analytical level is <br/>\nsomewhere between immaturity and social vandalism.  I don&#39;t want vandals to <br/>\ngradually consider learning to stop painting fences and busting mailboxes.  I want <br/>\nthem to stop all of a sudden or do it the hell away from MY yard.  Because my <br/>\nkids are living a happy unschooling life, and I don&#39;t want their back gate <br/>\nwrecked, their trees toilet papered or their mother&#39;s time totally wasted.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Meet A Person Where She&#39;s At","postDate":"1086313800","msgId":95052,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMzAwMWM0NDlkNiQ0MDljNGE3MCQ2NDAxYThjMEBNT0xFMjY5MDA+","referencesHeader":"PDJCN0FBMUQ0LUI1QTEtMTFEOC05M0M0LTAwMEE5NUYwRjU2QUBicmF2ZXdyaXRlci5jb20+IDwwMDEzMDFjNDQ5YTckNTA0ZDg0NDAkMDIwMWE4YzBAYW8ubG9wLmNvbT4="},"prevInTopic":95046,"nextInTopic":95054,"prevInTime":95051,"nextInTime":95053,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... as middle ground when you are talking about unschooling. ... you re not in the middle anymore.  You have to make a choice. ... ","messageBody":"<div id=\"ygrps-yiv-2141862463\"><blockquote><span title=\"ireply\">&gt; Those who think they can have both - unschooling and some reassurance<br/>\n&gt; that they are fulfilling the requirements of school - feel threatened<br/>\n&gt; when they have to make a true choice about what they believe about<br/>\n&gt; education.<br/>\n&gt; **************************<br/>\n&gt; &gt; I think this is it in a nutshell.  I don&#39;t think there is any such thing<br/>\n </span></blockquote>as middle ground when you are talking about unschooling.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The path to get there might take the middle ground, but when you&#39;re there,<br/>\n </span></blockquote>you&#39;re not in the middle anymore.  You have to make a choice.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Kristen<br/>\n </span></blockquote>==========================================<br/>\n<br/>\nGee, I don&#39;t think that&#39;s unschooling in a nutshell. My kids do things all<br/>\nthe time that could appear quite schooly and go far towards &quot;fulfilling the<br/>\nrequirements of school.&quot; Those are exactly the kinds of things I talk about<br/>\nfor my portfolio reviews. Of course, my kids are still young so that could<br/>\nchange, but I kind of doubt it.<br/>\n<br/>\nThis morning for instance, Emily wanted to play a game where we tried to<br/>\ncome up with all the words that start with D. So, we were all calling out as<br/>\nmany D words as we could think of over second breakfast. Not long afterward,<br/>\nshe wanted to know what 9,999 + 203 was. She&#39;s fascinated by numbers and is<br/>\nconstantly asking me things like that. I don&#39;t know about hers, but boy,<br/>\nhave my math skills been sharpened over the past year!<br/>\n<br/>\nWhat makes this unschooling is that I had nothing to do with either game. I<br/>\ndidn&#39;t sit the kids down and tell them that these were &quot;good&quot; things for<br/>\nthem to do and that they should really spend their time doing this rather<br/>\nthan playing x, y or z. I didn&#39;t make them do all the C words yesterday, the<br/>\nB words the day before and the A words the day before that. We&#39;re not going<br/>\nto do all the E words tomorrow or the next day unless that spontaneously<br/>\ncomes up in our living. I also didn&#39;t tell Em to go look the D words up in<br/>\nthe dictionary or to get a pencil and paper and figure out the addition<br/>\nproblem for herself. Those might have been very schooly responses. I did,<br/>\nhowever, tell her later in the day after another addition lob that the neat<br/>\nthing about number is when you add two even number or two odd numbers, the<br/>\nanswer is always even. But when you add and even plus an odd, then the<br/>\nanswer is odd. She thought that was pretty cool because she&#39;s interested in<br/>\nevens and odds now. Come to think of it, I need to show her how to do the<br/>\nevens/odds finger throwing game...<br/>\n<br/>\nBack to my point: My youngest daughter is really into writing. She<br/>\npainstakingly writes out all her favorite character&#39;s names in her diary,<br/>\nloves to write with the quill she bought down in Colonial Williamsburg. I<br/>\nfigure the number of times she does this per month of her own accord go much<br/>\nfurther toward her learning to write, spell and have good penmanship than<br/>\nall the curriculum touted in the country and enforced on children today. My<br/>\nkids are learning tremendous amounts every day, some of which is schooly<br/>\nstuff.<br/>\n<br/>\nI guess my point is that along with all the other wonderful, fun, amazing<br/>\nthings we do on a daily basis, several things &quot;fulfilling the requirements<br/>\nof school&quot; emerge without fail and without force.<br/>\n<br/>\n--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a></div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086299465","msgId":95046,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQkY5RDQ5LjgwNTA2MDdAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGQyLmU1Yzk4YzIuMmRmMGYyNmVAYW9sLmNvbT4=","referencesHeader":"PGQyLmU1Yzk4YzIuMmRmMGYyNmVAYW9sLmNvbT4="},"prevInTopic":95045,"nextInTopic":95052,"prevInTime":95045,"nextInTime":95047,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"** Because we re a clique, Betsy! Sheesh!** Well, yeah, fer shure.  (Smacks self in forehead.)  But some of my best friends use math workbooks.  I m","messageBody":"<div id=\"ygrps-yiv-2034163118\">** Because we&#39;re a clique, Betsy!<br/>\n<br/>\nSheesh!**<br/>\n<br/>\n<br/>\nWell, yeah, fer shure.  (Smacks self in forehead.)  But &quot;some of my best <br/>\nfriends&quot; use math workbooks.  I&#39;m tolerably tolerant.  Mostly.<br/>\n<br/>\n&lt;eg&gt;<br/>\n<br/>\nBetsy<br/>\n<br/>\nPS  What I&#39;m trying to say is that just because I don&#39;t like math <br/>\nworkbooks and don&#39;t bring them into my life doesn&#39;t mean that I don&#39;t <br/>\nlike people who DO use math workbooks and that I don&#39;t bring those <br/>\npeople into my life.<br/>\n<br/>\nWooooo!  A quintuple negative!</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086298222","msgId":95045,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyLmU1Yzk4YzIuMmRmMGYyNmVAYW9sLmNvbT4="},"prevInTopic":95044,"nextInTopic":95046,"prevInTime":95044,"nextInTime":95046,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/2004 4:20:23 PM Eastern Daylight Time, ecsamhill@earthlink.net writes: What I  don t understand is why people feel insulted if told","messageBody":"<div id=\"ygrps-yiv-1137641926\">In a message dated 6/3/2004 4:20:23 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\nWhat I  don&#39;t understand is why people feel insulted if told &quot;that&#39;s not  <br/>\nunschooling&quot;.<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\n <br/>\nBecause we&#39;re a clique, Betsy!<br/>\n<br/>\nSheesh!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086296825","msgId":95044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0LjJiMzVlMWMwLjJkZjBlY2Y5QGFvbC5jb20+"},"prevInTopic":95043,"nextInTopic":95045,"prevInTime":95043,"nextInTime":95045,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... Perhaps more like, why can t they learn about unschooling lots of different ways? I don t know. Would it be useful to think of the ways that what we do ","messageBody":"<div id=\"ygrps-yiv-2063121288\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I&#39;m uncomfortable to realize that <br/>\n&gt; learning<br/>\n&gt; about unschooling can feel pretty authoritarian, if not like school then an<br/>\n&gt; awful lot like professional experts or maybe church.**<br/>\n&gt; <br/>\n&gt; Oh, yeah.  I think I see this.  If there are many ways for our children <br/>\n&gt; to learn, say &quot;handwriting&quot;, why are there stricter guidelines about how <br/>\n&gt; to unschool, or at least how to be within the boundary of &quot;that&#39;s good <br/>\n&gt; unschooling practice&quot; rather than falling into &quot;that&#39;s not good <br/>\n&gt; unschooling practice&quot;.<br/>\n&gt; <br/>\n&gt; People may be asking why they can&#39;t &quot;unschool any way they want to&quot;.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>       Perhaps more like, why can&#39;t they &quot;learn about unschooling lots of <br/>\ndifferent ways?&quot; <br/>\n<br/>\n       I don&#39;t know. Would it be useful to think of the ways that what we do <br/>\nto help people unschool successfully IS like unschooling itself?  For example, <br/>\nseems to me all those intriguing little hints and mentions in various <br/>\nencounters could count as the strewing principle. &lt;grin&gt;   JJ<br/>\n<br/>\n       <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"Julie Bogart &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Meet A Person Where She&#39;s At","postDate":"1086296483","msgId":95041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJCN0FBMUQ0LUI1QTEtMTFEOC05M0M0LTAwMEE5NUYwRjU2QUBicmF2ZXdyaXRlci5jb20+"},"prevInTopic":95038,"nextInTopic":95043,"prevInTime":95040,"nextInTime":95042,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... not ... Truth is, unschooling is cool. Most people who don t unchool say, I wish I could do that, but I m just not cut out for it. Or, I don t know how","messageBody":"<div id=\"ygrps-yiv-1488316347\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Elizabeth Hill <br/>\n&lt;ecsamhill@e...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; What I don&#39;t understand is why people feel insulted if told &quot;that&#39;s <br/>\n </span></blockquote>not<br/>\n<blockquote><span title=\"ireply\">  &gt; unschooling&quot;.<br/>\n<br/>\n </span></blockquote>Truth is, unschooling is cool. Most people who don&#39;t unchool say, &quot;I <br/>\nwish I could do that, but I&#39;m just not cut out for it.&quot;<br/>\n<br/>\nOr, &quot;I don&#39;t know how you do it. I&#39;m just too ______________ to <br/>\nunschool.&quot;<br/>\n<br/>\nThose who think they can have both - unschooling and some reassurance <br/>\nthat they are fulfilling the requirements of school - feel threatened <br/>\nwhen they have to make a true choice about what they believe about <br/>\neducation.<br/>\n<br/>\nAnd there is just a lot of information on unschooling that is <br/>\ninaccurate so people think they are unschooling when they are not (that <br/>\nwas me).<br/>\n<br/>\nThat&#39;s my take anyway.<br/>\n<br/>\nJulie B<br/>\n<br/>\nP.S. I came here initially for resources - you know, good ideas for <br/>\nstrewing. I had no idea that what I did wasn&#39;t &quot;real&quot; unschooling. It <br/>\ntook a month of reconsidering my entire parenting philosophy to &quot;get <br/>\nit&quot; and I felt a bit chagrined on several occasions.<br/>\n<br/>\nBut the good news is that the constant affirmation that kids thrive <br/>\nwhen respected, loved and attended to won the day. And my understanding <br/>\nof unschooling expanded to include every aspect of parenting. I think <br/>\nthat&#39;s where the rubber meets the road.<br/>\n<br/>\nI read on another site the other day: &quot;We do classical schooling in the <br/>\nmornings but unschool in the afternoons.&quot; Clearly there&#39;s lots of <br/>\nmisunderstanding of what unschooling is out there.</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Meet A Person Where She&#39;s At","postDate":"1086293641","msgId":95043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTMwMWM0NDlhNyQ1MDRkODQ0MCQwMjAxYThjMEBhby5sb3AuY29tPg==","referencesHeader":"PDJCN0FBMUQ0LUI1QTEtMTFEOC05M0M0LTAwMEE5NUYwRjU2QUBicmF2ZXdyaXRlci5jb20+"},"prevInTopic":95041,"nextInTopic":95044,"prevInTime":95042,"nextInTime":95044,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"Those who think they can have both - unschooling and some reassurance that they are fulfilling the requirements of school - feel threatened when they have to","messageBody":"<div id=\"ygrps-yiv-663569837\">Those who think they can have both - unschooling and some reassurance <br/>\nthat they are fulfilling the requirements of school - feel threatened <br/>\nwhen they have to make a true choice about what they believe about <br/>\neducation.<br/>\n<br/>\n<br/>\n**************************<br/>\n<br/>\nI think this is it in a nutshell.  I don&#39;t think there is any such thing as middle ground when you are talking about unschooling.<br/>\n<br/>\nThe path to get there might take the middle ground, but when you&#39;re there, you&#39;re not in the middle anymore.  You have to make a choice.<br/>\n<br/>\nKristen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086292288","msgId":95038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQkY4MTQwLjkwODA1QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGFjLjU5OWI2NjlkLjJkZjBjNDQ2QGFvbC5jb20+","referencesHeader":"PGFjLjU5OWI2NjlkLjJkZjBjNDQ2QGFvbC5jb20+"},"prevInTopic":95030,"nextInTopic":95041,"prevInTime":95037,"nextInTime":95039,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"**And I ve been wondering why I for one am endlessly patient and much more likely to respond with humor to people who already get it than to people who don t","messageBody":"<div id=\"ygrps-yiv-854794928\">**And I&#39;ve been<br/>\nwondering why I for one am endlessly patient and much more likely to <br/>\nrespond<br/>\nwith humor to people who already &quot;get&quot; it than to people who don&#39;t seem <br/>\nto get it<br/>\nat all. You&#39;d think the latter would be more like children needing the best<br/>\nI&#39;ve got to offer.**<br/>\n<br/>\nI think that sometimes the people who &quot;don&#39;t get it&quot; aren&#39;t here asking <br/>\nto &quot;get it&quot;.  They&#39;re just here to learn about &quot;all the options&quot;, even <br/>\nif they don&#39;t much like the sound of this one.<br/>\n<br/>\nI&#39;ve been thinking about some old flamewars, and I now think when <br/>\nsomeone posts something like &quot;now don&#39;t yell at me, but aren&#39;t your kids <br/>\ngoing to all be rude and ignorant?&quot; (less bluntly than that) they aren&#39;t <br/>\nreally wishing to have *their* minds changed.  They may sincerely want <br/>\nto know our reasons, but I think it&#39;s more likely that they just want to <br/>\npont out the error of our ways.<br/>\n<br/>\n**        And having rules, not taking people&#39;s feelings seriously when <br/>\nwe think<br/>\nthey are &quot;wrong&quot; and sometimes just saying &quot;because I said so, and if you<br/>\ndon&#39;t like it, you need to leave.&quot; I am NOT saying these things aren&#39;t <br/>\nnecessary<br/>\nin online adult conversation. But I&#39;m uncomfortable to realize that <br/>\nlearning<br/>\nabout unschooling can feel pretty authoritarian, if not like school then an<br/>\nawful lot like professional experts or maybe church.**<br/>\n<br/>\nOh, yeah.  I think I see this.  If there are many ways for our children <br/>\nto learn, say &quot;handwriting&quot;, why are there stricter guidelines about how <br/>\nto unschool, or at least how to be within the boundary of &quot;that&#39;s good <br/>\nunschooling practice&quot; rather than falling into &quot;that&#39;s not good <br/>\nunschooling practice&quot;.<br/>\n<br/>\nPeople may be asking why they can&#39;t &quot;unschool any way they want to&quot;.<br/>\n<br/>\nWhat I don&#39;t understand is why people feel insulted if told &quot;that&#39;s not <br/>\nunschooling&quot;.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Meet A Person Where She&#39;s At","postDate":"1086289228","msgId":95030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5bnNnYytpZDRAZUdyb3Vwcy5jb20+","inReplyToHeader":"PDE1ZC4zNmI3NzgxNC4yZGYwYmU5N0Bhb2wuY29tPg=="},"prevInTopic":95028,"nextInTopic":95038,"prevInTime":95029,"nextInTime":95031,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"... were ... Scott Adams (Dilbert creator) has a great line: we re all idiots about something. I worked at a computer help desk for years and even when I was ","messageBody":"<div id=\"ygrps-yiv-667800898\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think it would be much less respectful to treat people like they <br/>\n </span></blockquote>were <br/>\n<blockquote><span title=\"ireply\"> &gt; fragile or slow-witted.<br/>\n<br/>\n </span></blockquote>Scott Adams (Dilbert creator) has a great line: we&#39;re all idiots <br/>\nabout something. <br/>\n<br/>\nI worked at a computer help desk for years and even when I was <br/>\nsupposed to be doing something else, still got asked questions <br/>\nbecause I gave nicer answers than some. <br/>\n<br/>\nFor a while, my dh and I were both working at A Famous University and <br/>\nwe&#39;d see one of &quot;our&quot; professors on the news, as the world&#39;s leading <br/>\nexpert in such-and-such and we&#39;d giggle about his/her inability to <br/>\nfind the on/off switch on his/her computer while being a genius in <br/>\nother areas.<br/>\n<br/>\nSo now I give people the benefit of the doubt that they are generally <br/>\nintelligent and just haven&#39;t used their brain enough in one <br/>\nparticular area, or haven&#39;t been exposed to some ideas, like <br/>\nunschooling, or are so afraid (e.g., of having WILD children) that <br/>\nthey can&#39;t open their brains and see the button on the screen that <br/>\nsays &quot;click here&quot;. <br/>\n<br/>\nSometimes I&#39;m wrong, that&#39;s for sure. <br/>\n<br/>\n--aj</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086286406","msgId":95028,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFjLjU5OWI2NjlkLjJkZjBjNDQ2QGFvbC5jb20+"},"prevInTopic":95021,"nextInTopic":95030,"prevInTime":95027,"nextInTime":95029,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"In a message dated 06/03/2004 1:51:24 PM Eastern Daylight Time, ... I really do wonder about this, and have before. Couldn t it also be asked in an unschooling","messageBody":"<div id=\"ygrps-yiv-1990726299\">In a message dated 06/03/2004 1:51:24 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Is it wrong, y&#39;think, to assume that participants here (those who choose to <br/>\n&gt; post, I mean) are intelligent adults?   It amazes me when someone will say <br/>\n&gt; &quot;you <br/>\n&gt; don&#39;t treat me like you treat your children.&quot;   Maybe they mean &quot;you don&#39;t <br/>\n&gt; let me fart around for six years, confident that I&#39;ll learn what I need.&quot;   <br/>\n&gt; But <br/>\n&gt; I think more often it means &quot;You expected me to be an adult.&quot;<br/>\n&gt; <br/>\n&gt; I think it would be much less respectful to treat people like they were <br/>\n&gt; fragile or slow-witted.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>       I really do wonder about this, and have before. <br/>\n<br/>\n       Couldn&#39;t it also be asked in an unschooling sense, as in why don&#39;t we <br/>\nshare unschooling with new adults using the same principles we use so <br/>\nsuccessfully with our children? <br/>\n<br/>\n       Others touched on this question, Sandra I think with the irony of <br/>\nsharing unschooling in lecture form, to neat rows of note-takers. And I&#39;ve been <br/>\nwondering why I for one am endlessly patient and much more likely to respond <br/>\nwith humor to people who already &quot;get&quot; it than to people who don&#39;t seem to get it <br/>\nat all. You&#39;d think the latter would be more like children needing the best <br/>\nI&#39;ve got to offer.<br/>\n<br/>\n       And having rules, not taking people&#39;s feelings seriously when we think <br/>\nthey are &quot;wrong&quot; and sometimes just saying &quot;because I said so, and if you <br/>\ndon&#39;t like it, you need to leave.&quot; I am NOT saying these things aren&#39;t necessary <br/>\nin online adult conversation. But I&#39;m uncomfortable to realize that learning <br/>\nabout unschooling can feel pretty authoritarian, if not like school then an <br/>\nawful lot like professional experts or maybe church.<br/>\n<br/>\n       That kind of thing. Can unschooling be unschooled?<br/>\n<br/>\n     <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086284951","msgId":95021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZC4zNmI3NzgxNC4yZGYwYmU5N0Bhb2wuY29tPg=="},"prevInTopic":95010,"nextInTopic":95028,"prevInTime":95020,"nextInTime":95022,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/04 10:35:49 AM, kbcdlovejo@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1850720963\">In a message dated 6/3/04 10:35:49 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\n&lt;&lt; But when  someone comes to a place like this, with a description like this <br/>\ngroup  has, they&#39;ve already stepped to the far side of the continuum and <br/>\ninvited  <br/>\npeople to help them see it more  clearly.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n&lt;&lt;You&#39;d THINK!!&gt;&gt;<br/>\n<br/>\nI rightly assume, and am willing to act on my reasonable assumption. &lt;g&gt;<br/>\n<br/>\n&lt;&lt;But past events tell a different story! :-( &gt;&gt;<br/>\n<br/>\nSome people just don&#39;t know what they want.  I refuse to believe anyone would <br/>\naccidentally stumble in here and stay very long but still not know what the <br/>\ntopic of discussion involved.     And anyone who CAN or has done so is (in my <br/>\nopinion) not analytical enough in a philosophical way to be a good unschooler <br/>\nanyway, and there&#39;s no sense blaming the rest of us.<br/>\n<br/>\nIs it wrong, y&#39;think, to assume that participants here (those who choose to <br/>\npost, I mean) are intelligent adults?   It amazes me when someone will say &quot;you <br/>\ndon&#39;t treat me like you treat your children.&quot;   Maybe they mean &quot;you don&#39;t <br/>\nlet me fart around for six years, confident that I&#39;ll learn what I need.&quot;   But <br/>\nI think more often it means &quot;You expected me to be an adult.&quot;<br/>\n<br/>\nI think it would be much less respectful to treat people like they were <br/>\nfragile or slow-witted.<br/>\n<br/>\nPerhaps I&#39;m off the topic, but probably that&#39;s okay.  The world is full of <br/>\ntopics and facets thereof, and the past, presents and futures of those aspects, <br/>\nand the connections of those to the badillion OTHER topics with their <br/>\numpty-dimensional realities.   <br/>\n<br/>\nConnections.<br/>\n<br/>\nSome people are resistant.   Some people aren&#39;t.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Meet A Person Where She&#39;s At","postDate":"1086280333","msgId":95010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlNi4yMWU0ZWFlZC4yZGYwYWM4ZEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":95021,"prevInTime":95009,"nextInTime":95011,"topicId":95010,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/2004 11:49:06 AM Eastern Daylight Time, SandraDodd@aol.com writes: But when  someone comes to a place like this, with a description like","messageBody":"<div id=\"ygrps-yiv-1974625575\">In a message dated 6/3/2004 11:49:06 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nBut when  someone comes to a place like this, with a description like this <br/>\ngroup  has, they&#39;ve already stepped to the far side of the continuum and <br/>\ninvited  <br/>\npeople to help them see it more  clearly.&lt;&lt;&lt;&lt;&lt;<br/>\nYou&#39;d THINK!!<br/>\nBut past events tell a different story! :-(<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":95437,"nextTopicId":95462}}