{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":66835036,"authorName":"RJHill241@aol.com","from":"RJHill241@...","profile":"rjhill241","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] was: just a vent Re:Twins","postDate":"1055400078","msgId":73799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFkLjJmM2VmYWM1LjJjMTk3YThlQGFvbC5jb20+"},"prevInTopic":73789,"nextInTopic":0,"prevInTime":73798,"nextInTime":73800,"topicId":73789,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/03 8:55:04 PM Pacific Daylight Time, ... Olga, First off that whole good twin /bad twin thing is totally a wives tale. Personailty","messageBody":"<div id=\"ygrps-yiv-1726289846\">In a message dated 6/11/03 8:55:04 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:britcontoo@...\">britcontoo@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (really, if you are going <br/>\n&gt; to have twins, isn&#39;t one of them supposed to be mild tempered?..LOL) <br/>\n&gt; and she is really having a hard time.  Anyone with twins have some <br/>\n&gt; suggestions.  She tries to distract and such and does keep them <br/>\n&gt; busy.   They bite and hit eachother and of course, being that there <br/>\n&gt; are two of them they put those little brains to work to figure out <br/>\n&gt; things one would not.  Any advice, books, websites for her. <br/>\n<br/>\n </span></blockquote>Olga,<br/>\n<br/>\nFirst off that whole good twin /bad twin thing is totally a wives tale. <br/>\nPersonailty differences, yes, but mild mannered vs. quick tempered, has never <br/>\nexisted in our house. Kass & Kree are 11 and very much the same, but different. LOL <br/>\nKass is very girlly, very nuturing, very confrontational and very much the <br/>\noverseer of her twin. Kree OTOH is very much a tomboy, very quick to forgive and <br/>\nvery much the jokester, sometimes to the point of going too far. Although my <br/>\nDH for some reason has completely forgotten the rough times, I can assure you <br/>\nand your friend that it was between 2 1/2 and 3 1/2. I can&#39;t say why, other <br/>\nthan in my experience they are learning to function without each other, yet <br/>\nstill have an indescribable bond, that to this day amazes me. They very much had a <br/>\nlanguage of their own and were always protective of one another. They were <br/>\nonly 2 when they had their first physical confrontation with another child. A <br/>\nneighbor had a daycare and I would often take the twins there to play with the <br/>\nchildren she watched and to have some adult interaction myself. Well, one day <br/>\nthis 4 yr old knocked Kass down and before I could even get up, Kree had run <br/>\nacross the yard, pushed the 4 yr old down and said quite clearly in 2 yr old <br/>\ndialogue, &quot;No push my Sissy!&quot; The neighbor and I  were so astounded that we never <br/>\neven had to get up, besides which we were laughing so hard, the 4 yr old got <br/>\nup and went to play something else. He never again messed with either one when <br/>\nwe were over. <br/>\n<br/>\nAs far as qualifying herself to anyone, I wouldn&#39;t bother. People often think <br/>\nbecause twins are so &quot;neat&quot; they forget they are still individuals trying to <br/>\nmake the world see them as such and yet the bond they share is beyond words. I <br/>\nmean really, I can&#39;t even conceive the notion of having to share since the <br/>\npoint of conception. Then you come out and everyone immediately tries to <br/>\npersonify you when you have barely been in the world. <br/>\n<br/>\nI remember feeling overwhelmed during that 2 - 3 year old stage. In fact, <br/>\nKass and Kree were so difficult at that age, we laugh because there is an entire <br/>\nyear of no photos of them. Everytime I got them dressed to get their picture <br/>\ndone, it ended in tears,  primarily mine!!! LOL I remember doing anything and <br/>\neverything to not have to go in public. I mean there are two little people who <br/>\nnow walk, don&#39;t really want to be in a stroller and there&#39;s only one of me. <br/>\nAnd of course whichever stroller I took would just be the battle for that day. <br/>\nFacing each other they&#39;d talk in that mysterious language they had and end up <br/>\nfighting, side by side they&#39;d pinch or bite, and front to back, the one in back <br/>\nwould pull the hair of the one in front. It was an all around lose-lose <br/>\nsituation and I wondered if I&#39;d make it to them hitting 4 without completely losing <br/>\nmy marbles. Then for some miraculous reason they hit 4 and all was well. <br/>\nAgain, I couldn&#39;t tell you why, but they just changed. They went back to being <br/>\ninseparable, which they still are today to a large extent. <br/>\n<br/>\nThey each have their own room, we have a total of 6 beds (4 queen, 1 full & <br/>\n1king) in our house. They have never once slept alone. Generally they end up in <br/>\nour room, but never apart from each other. They also still sleep completely <br/>\ncuddled together. The only time in their life they slept apart was the first <br/>\nweek they came home from the hospital because I had no idea that if they slept <br/>\ntogether they would sleep through the night. Hello, light bulb moment...put <br/>\nthem back together and tada...12 hours of restfull bliss. That&#39;s right 12 hours. <br/>\n7:30 pm to 7:30 am the first 2 years of their lives. They never woke up during <br/>\nthe nite as long as they had each other. Made sense though. So when they have <br/>\nacted horrible or hateful to each other all we have to do is mention that <br/>\nperhaps they should sleep apart and all the ill-will goes right out the window. <br/>\n&quot;Heck no, mom, my sister totally bugs but that doesn&#39;t mean we don&#39;t still need <br/>\neach other.&quot; LOL Could I ask for a better response? It will be kind of sad <br/>\nthe day they decide they do in fact want their own sleep space. <br/>\n<br/>\nPlease tell your friend to keep up the good work and believe it or not one <br/>\nday you wake up and wonder what you were so worried about. Not to mention <br/>\ngetting a little peeved at the audacity people have when it comes to how they think <br/>\nyou should parent. I always countered sarcasm with do you have twins? If not, <br/>\nare you a twin? And finally, when you give birth to more than one person at a <br/>\ntime, talk to me then, otherwise, mind your own business. <br/>\n<br/>\nRhonda - who knows exactly why her daughters have no problem with <br/>\nconfrontation.LOL<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":139549710,"authorName":"Olga","from":"&quot;Olga&quot; &lt;britcontoo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"was: just a vent Re:Twins","postDate":"1055390032","msgId":73789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjOHRnZytsY3I1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":73799,"prevInTime":73788,"nextInTime":73790,"topicId":73789,"numMessagesInTopic":0,"msgSnippet":"Alan & Brenda Leonard  ","messageBody":"<div id=\"ygrps-yiv-936055348\">Alan & Brenda Leonard &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abtleo@...\">abtleo@...</a>&gt;<br/>\n<br/>\n&lt;People tell me all the time that I need to &quot;let Tim go&quot; more, or <br/>\nhe&#39;ll<br/>\nalways be attached to my apron strings&gt;<br/>\n<br/>\nThis reminded me of something I wanted to post/ask about but got so <br/>\nbehind I forgot &lt;g&gt;.  My gf has twin girls (2 1/2yo) and a 5yo.  They <br/>\nwere at her dd graduation and the twins, of course at that attached <br/>\nto mom phase, wanted no one else.  When she went up to take pictures, <br/>\none of the twins screamed her head off with dad.  Everyone proceded <br/>\nto tell her how rough it must be on her dh, and this was why her <br/>\nmarriage had problems, etc, etc,.  One friend called her and bluntly <br/>\ntold her she had no control over her kids, that they were running the <br/>\nhousehold.  I was horrified, she was in tears over this.  I told her <br/>\nsome postive, supportive things, poor woman!  Anyway, she is really <br/>\nstruggling with the twins.  All her girls are fiesty.  My first was a <br/>\nbreeze, my second harder so I can see that personality difference.  <br/>\nShe got 3 kids, none of which are a breeze (really, if you are going <br/>\nto have twins, isn&#39;t one of them supposed to be mild tempered?..LOL) <br/>\nand she is really having a hard time.  Anyone with twins have some <br/>\nsuggestions.  She tries to distract and such and does keep them <br/>\nbusy.   They bite and hit eachother and of course, being that there <br/>\nare two of them they put those little brains to work to figure out <br/>\nthings one would not.  Any advice, books, websites for her.  She is a <br/>\ngreat mom who tries to be relaxed,) I think with a little confidence <br/>\nand advice she would have few problems because she has the right <br/>\nattitude. She always starts things with &quot;my little monsters&quot;, or <br/>\nsuch.  At first, I didn&#39;t really think about it, but I think people <br/>\nare making her feel like she needs to validate what she thinks they <br/>\nthink about her.  Does that make sense?? I have been reading FOREVER, <br/>\nLOL.I am soooo behind!  Thanks for feedback :)<br/>\n<br/>\nOlga :)</div>","specialLinks":[]}],"prevTopicId":73797,"nextTopicId":73806}}