{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":449386029,"authorName":"pbiegler67","from":"&quot;pbiegler67&quot; &lt;pbiegler67@...&gt;","profile":"pbiegler67","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dad&#39;s roles, concerns and unschooling resources","postDate":"1316831198","msgId":63114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1amY0dSs5NmpxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg=="},"prevInTopic":62948,"nextInTopic":0,"prevInTime":63113,"nextInTime":63115,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"Sorry for the very late response - focused on my corporate job this week :-) There is a Facebook group called SSUDS (Secret Society of Unschooling Dads) as","messageBody":"<div id=\"ygrps-yiv-1056983545\">Sorry for the very late response - focused on my corporate job this week :-)<br/>\n<br/>\nThere is a Facebook group called SSUDS (Secret Society of Unschooling Dads) as well as LinkedIn group by the same name. If your husband is a member of those social media sites he can join for views from some other Dads who are or have been in the same position.<br/>\n<br/>\nPhil</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dad&#39;s roles, concerns and unschooling resources","postDate":"1316281737","msgId":62948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1Mm1pOStob2toQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1MGszdStqcTUzQGVHcm91cHMuY29tPg=="},"prevInTopic":62930,"nextInTopic":63114,"prevInTime":62947,"nextInTime":62949,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"... ******************* What drew George most strongly to unschooling was the knowledge that he didn t have to be his dad. Specifically, he didn t have to be","messageBody":"<div id=\"ygrps-yiv-2016148080\">&quot;VanessaL&quot; &lt;fancyness07@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;He has/had a traumatic and then no relationship with his mom (lifelong alcoholic) and a not a very good one with his dad until he became an adult (not an alcoholic but divorce and other stuff). I do think that this colors his ideas about bonding with his children.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nWhat drew George most strongly to unschooling was the knowledge that he didn&#39;t have to be his dad. Specifically, he didn&#39;t have to be &quot;an asshole&quot; (his words) in order to be a &quot;good father&quot;. That was probably the greatest gift to his relationship with Ray, knowing he could be kind and sweet and thoughtful to his son. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":277265547,"authorName":"maltmanjamie","from":"&quot;maltmanjamie&quot; &lt;jamie.maltman@...&gt;","profile":"maltmanjamie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dad&#39;s roles, concerns and unschooling resources","postDate":"1316237310","msgId":62930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1MWI1dStnZW82QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRDODc3MzA4LTQ4NUMtNEIyMy05Q0YxLTQ1RjE0RkQxQTZDM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62924,"nextInTopic":62948,"prevInTime":62929,"nextInTime":62931,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"I m a Dad who was the one exploring this first, so I was doing a lot of searching myself, and loved Holt from the beginning, and Sandra s stuff more and more","messageBody":"<div id=\"ygrps-yiv-679622164\">I&#39;m a Dad who was the one exploring this first, so I was doing a lot of searching myself, and loved Holt from the beginning, and Sandra&#39;s stuff more and more as I deschooled myself further. :)<br/>\n<br/>\nIn addition to getting him to read as much as he wants to from all these great sources that are mentioned, I recommend this blog by a breadwinning, former military, Unschooling Dad, who Sandra has quoted before:<br/>\n<br/>\nJeff Sabo&#39;s &quot;Just a Bald Man Blog&quot;<br/>\n<br/>\nThis one is his &quot;I am that Dad&quot; - might be particularly topical:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justabaldman.blogspot.com/2010/07/impromptu-blog-carnival-i-am-that-dad.html\">http://justabaldman.blogspot.com/2010/07/impromptu-blog-carnival-i-am-that-dad.html</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justabaldman.blogspot.com/2010/08/guy-on-plane.html\">http://justabaldman.blogspot.com/2010/08/guy-on-plane.html</a><br/>\nThat&#39;s one of his most popular posts, and I really like it. <br/>\n<br/>\nI&#39;d recommend he surf through some of the popular ones on the left.<br/>\n<br/>\nIt connected to me, and it sounds like your husband might have even more in common with him. He even has posts talking about his passion for hockey and how he&#39;s handled it with his sons (mine is basketball - though I grew up with baseball too). <br/>\n<br/>\nCheers,<br/>\nJamie</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dad&#39;s roles, concerns and unschooling resources","postDate":"1316218998","msgId":62924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDODc3MzA4LTQ4NUMtNEIyMy05Q0YxLTQ1RjE0RkQxQTZDM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo1MGszdStqcTUzQGVHcm91cHMuY29tPg==","referencesHeader":"PGo1MGszdStqcTUzQGVHcm91cHMuY29tPg=="},"prevInTopic":62923,"nextInTopic":62930,"prevInTime":62923,"nextInTime":62925,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"-=-He has/had a traumatic and then no relationship with his mom (lifelong alcoholic)-=- It s not too late for him to go to Adult Children of Alcoholics","messageBody":"<div id=\"ygrps-yiv-257055553\">-=-He has/had a traumatic and then no relationship with his mom (lifelong alcoholic)-=-<br/>\n<br/>\nIt&#39;s not too late for him to go to Adult Children of Alcoholics meetings.  The harm that comes from growing up in that environment can be passed on without the middleman even drinking.  And while he&#39;s healing himself, he will become a better dad and partner.  And while he&#39;s becoming a better dad and partner, he will be further healing himself.<br/>\n<br/>\nBuy him a copy of a little book called Daily Affirmations for Adult Children of Alcoholics (more often just &quot;Daily Affirmations&quot;), even if he doesn&#39;t go to the meetings, but those meetings can transform his life in just a few months or a couple of years.  It made a huge difference in mine.  I started going before I was pregnant with Kirby, and went until Marty was a toddler.  I would&#39;ve kept going but we lost our meeting room and the group never quite formed back up in attempted new locations.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Daily-Affirmations-Adult-Children-Alcoholics/dp/0932194273\">http://www.amazon.com/Daily-Affirmations-Adult-Children-Alcoholics/dp/0932194273</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":325777836,"authorName":"VanessaL","from":"&quot;VanessaL&quot; &lt;fancyness07@...&gt;","profile":"fancyness07","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dad&#39;s roles, concerns and unschooling resources","postDate":"1316213694","msgId":62923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1MGszdStqcTUzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1MGVodCtuN3VpQGVHcm91cHMuY29tPg=="},"prevInTopic":62919,"nextInTopic":62924,"prevInTime":62922,"nextInTime":62924,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"Wow everyone, thank you so much. I know he ll appreciate it. He s headed on a two week business trip so he ll have some down time for reading. (he s a","messageBody":"<div id=\"ygrps-yiv-1358187448\">Wow everyone, thank you so much. I know he&#39;ll appreciate it. He&#39;s headed on a two week business trip so he&#39;ll have some down time for reading. (he&#39;s a corporate trainer not a teacher but has been in some sort of instructing position most of his working years, even in the Navy). I see now that so many of his (and my) fears aren&#39;t about unschooling specifically but about growing up/family/parenthood. Life? However unschooling has definitely provided an slew of jumping off points for us. Our marriage has been directly affected (in a positive way) by things that have been said on these lists and played out in real life. <br/>\n<br/>\nThere are lots of things I&#39;m tempted to clarify but it really wouldn&#39;t add to the discussion, I don&#39;t think. There is already plenty for him to read and think about. Me too. And there are many things I really loved reading personally. We look forward to reading all the links too. <br/>\n<br/>\nOn second thought for others who may relate, I did want to add that his relationship with his parents came to mind when I was reading the responses. He has/had a traumatic and then no relationship with his mom (lifelong alcoholic) and a not a very good one with his dad until he became an adult (not an alcoholic but divorce and other stuff). I do think that this colors his ideas about bonding with his children. He is an awesome dad but his fear of not having a son who likes baseball probably comes from not following his dad&#39;s team but rather an uncle who liked those teams and took the time to share his enthusiastic with him. I think he knows it&#39;s not baseball that ultimately matters but that was his example (one close to his heart)to describe his fears. That his kids wouldn&#39;t mind him. I think he&#39;ll find the post with the family and the festive college games particularly touching. There is a lot of hurt from the past. He&#39;s not home to discuss but he&#39;ll read this too and knowing him  he&#39;d agree. I think it&#39;s been very tricky for him to make the connection between his childhood, the way he relates to the boys and I, and the hopes he has for his children, until now (we&#39;ve had conversations abut this recently). Lots of layers here . . .<br/>\n<br/>\nI&#39;ll post more if he has anything else to add but really just wanted to jump in and say thank you to everyone who responded/is responding.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;VanessaL&quot; &lt;fancyness07@&gt; wrote:<br/>\n&gt; &gt;&gt; His role. What is the dad&#39;s role? Will his children still accept his influence? (rooting for his fav baseball team is super important to him) Will his son grow up NOT reading the Count of Monte Cristo? He knows, even school wouldn&#39;t guarantee that but he&#39;s having trouble figuring out his place.<br/>\n&gt; ****************<br/>\n&gt; <br/>\n&gt; As young as your kids are, it&#39;s natural for a dad to be questioning his &quot;role&quot; regardless of any interest in unschooling. Right now, your kids are probably still very very interested in their mommy. That will change! But it can feel very precarious to dads at first to have all this focus on mom and babies and he&#39;s just the provider. Be sure you&#39;re giving Him lots of appreciation and affection! That will help. <br/>\n&gt; <br/>\n&gt; As for accepting his influence - how much is he interested in accepting Their influence? That can make a big difference in his relationship with his kids. Is he willing to take an interest in and get involved with things They like to do? If he wants the whole relationship to be about validating him as a person, that&#39;s not going to work very well for very long. <br/>\n&gt; <br/>\n&gt; My partner, George, and his son Ray have very different interests and personalities in a lot of respects. We didn&#39;t unschool from the start, and there have been issues with Ray&#39;s bio mom over the years - in many ways, Ray is more like his mom than his dad, and that&#39;s hard when parents are divorced. It&#39;s sometimes a struggle for George to see Ray and not Ray&#39;s mom. But even with all that baggage thrown into the mix, they&#39;re able to connect and have a pretty good relationship. There are things they share, things they have in common. They go out to see live music together sometimes and go to local events and parties sometimes. They both got to be extras in a movie that was shot around here, and that was fun for both of them - they both look like variations on the stereotypical hippie guy, so they were in all the same scenes, where a group of hippies was needed. They have some of the same friends. But a whole lot of that came out of George actively making an effort to be interested in what Ray likes and does And inviting Ray along when George is doing something Ray will enjoy. It didn&#39;t start by Ray tagging along with pop, it started by dad reaching out to his son. <br/>\n&gt; <br/>\n&gt; &gt; Is it common for parents to pursue unusual sources of income? <br/>\n&gt; <br/>\n&gt; Since unschooling requires a lot of time and attention from at least one parent, its not uncommon for unschooling families to be a bit more flexible and creative in terms of income. Plus, lets face it, a lot of unschoolers are idealists - that tends to lead to some unconventional career decisions. <br/>\n&gt; <br/>\n&gt; &gt;He&#39;s jealous that his family is taking an &quot;indefinite vacation.&quot; He wants to be part of that too.... Do other dad&#39;s feel this way? And what do they do about it?<br/>\n&gt; *****************<br/>\n&gt; <br/>\n&gt; I&#39;m not a dad ;) but currently I&#39;m the main breadwinner in my family. Having been the &quot;at home&quot; parent, I think I have an easier time seeing what I do as a gift I&#39;m giving the people I love. At the same time, having been &quot;the provider&quot; in the past, George does a good job of letting me know my efforts are appreciated - that&#39;s important! It helps a whole lot to come home to smiles and welcome And a clean kitchen since that&#39;s the first room I see and I usually want a snack when I get home. Oh! and it&#39;s also helpful that George will sit and listen to me complain about my day for a little while, too. That lets me &quot;leave work behind&quot; when I&#39;m home and focus on being with my family better. <br/>\n&gt; <br/>\n&gt; &gt;&gt; How is his position as a teacher so valuable at work but not at home?<br/>\n&gt; ***************<br/>\n&gt; <br/>\n&gt; The kids where he works don&#39;t have the luxury of a full time parent whom they don&#39;t have to share with two dozen other kids. He&#39;s All the adult contact they may get, and they don&#39;t get very much of him. Limits make things valuable. <br/>\n&gt; <br/>\n&gt; Which isn&#39;t to say he&#39;s not valuable at home, but his value is very different. He gets to have a very different kind of relationship with his kids - he doesn&#39;t Have To be their teacher because he gets something bigger and more wonderful. Teacher is a sad second best to partnership. It only feels important when its the best you have available. <br/>\n&gt; <br/>\n&gt; &gt; Dogma. Is unschooling a cult?<br/>\n&gt; <br/>\n&gt; If your husband is interested in reading about unschooling, send him to Joyce&#39;s site or print out parts of it. Joyce&#39;s writing is so clear and logical it goes a long way toward dispelling fears of dogma and cults. <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n&gt; <br/>\n&gt; It could also help, if he&#39;ll read something short to print out Pam Sorooshian&#39;s &quot;Principles of Unschooling&quot;. The nice thing about those is they&#39;re really principles of learning - and That&#39;s what unschooling is about, its seeing how people learn and becoming more responsive, as a parent, to how your kids learn. <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pam/principles\">http://sandradodd.com/pam/principles</a><br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Dad&#39;s roles, concerns and unschooling resources","postDate":"1316207997","msgId":62919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1MGVodCtuN3VpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg=="},"prevInTopic":62916,"nextInTopic":62923,"prevInTime":62918,"nextInTime":62920,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"... **************** As young as your kids are, it s natural for a dad to be questioning his role regardless of any interest in unschooling. Right now, your","messageBody":"<div id=\"ygrps-yiv-520935454\">&quot;VanessaL&quot; &lt;fancyness07@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; His role. What is the dad&#39;s role? Will his children still accept his influence? (rooting for his fav baseball team is super important to him) Will his son grow up NOT reading the Count of Monte Cristo? He knows, even school wouldn&#39;t guarantee that but he&#39;s having trouble figuring out his place.<br/>\n </span></blockquote>****************<br/>\n<br/>\nAs young as your kids are, it&#39;s natural for a dad to be questioning his &quot;role&quot; regardless of any interest in unschooling. Right now, your kids are probably still very very interested in their mommy. That will change! But it can feel very precarious to dads at first to have all this focus on mom and babies and he&#39;s just the provider. Be sure you&#39;re giving Him lots of appreciation and affection! That will help. <br/>\n<br/>\nAs for accepting his influence - how much is he interested in accepting Their influence? That can make a big difference in his relationship with his kids. Is he willing to take an interest in and get involved with things They like to do? If he wants the whole relationship to be about validating him as a person, that&#39;s not going to work very well for very long. <br/>\n<br/>\nMy partner, George, and his son Ray have very different interests and personalities in a lot of respects. We didn&#39;t unschool from the start, and there have been issues with Ray&#39;s bio mom over the years - in many ways, Ray is more like his mom than his dad, and that&#39;s hard when parents are divorced. It&#39;s sometimes a struggle for George to see Ray and not Ray&#39;s mom. But even with all that baggage thrown into the mix, they&#39;re able to connect and have a pretty good relationship. There are things they share, things they have in common. They go out to see live music together sometimes and go to local events and parties sometimes. They both got to be extras in a movie that was shot around here, and that was fun for both of them - they both look like variations on the stereotypical hippie guy, so they were in all the same scenes, where a group of hippies was needed. They have some of the same friends. But a whole lot of that came out of George actively making an effort to be interested in what Ray likes and does And inviting Ray along when George is doing something Ray will enjoy. It didn&#39;t start by Ray tagging along with pop, it started by dad reaching out to his son. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is it common for parents to pursue unusual sources of income? <br/>\n<br/>\n </span></blockquote>Since unschooling requires a lot of time and attention from at least one parent, its not uncommon for unschooling families to be a bit more flexible and creative in terms of income. Plus, lets face it, a lot of unschoolers are idealists - that tends to lead to some unconventional career decisions. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He&#39;s jealous that his family is taking an &quot;indefinite vacation.&quot; He wants to be part of that too.... Do other dad&#39;s feel this way? And what do they do about it?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nI&#39;m not a dad ;) but currently I&#39;m the main breadwinner in my family. Having been the &quot;at home&quot; parent, I think I have an easier time seeing what I do as a gift I&#39;m giving the people I love. At the same time, having been &quot;the provider&quot; in the past, George does a good job of letting me know my efforts are appreciated - that&#39;s important! It helps a whole lot to come home to smiles and welcome And a clean kitchen since that&#39;s the first room I see and I usually want a snack when I get home. Oh! and it&#39;s also helpful that George will sit and listen to me complain about my day for a little while, too. That lets me &quot;leave work behind&quot; when I&#39;m home and focus on being with my family better. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; How is his position as a teacher so valuable at work but not at home?<br/>\n </span></blockquote>***************<br/>\n<br/>\nThe kids where he works don&#39;t have the luxury of a full time parent whom they don&#39;t have to share with two dozen other kids. He&#39;s All the adult contact they may get, and they don&#39;t get very much of him. Limits make things valuable. <br/>\n<br/>\nWhich isn&#39;t to say he&#39;s not valuable at home, but his value is very different. He gets to have a very different kind of relationship with his kids - he doesn&#39;t Have To be their teacher because he gets something bigger and more wonderful. Teacher is a sad second best to partnership. It only feels important when its the best you have available. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Dogma. Is unschooling a cult?<br/>\n<br/>\n </span></blockquote>If your husband is interested in reading about unschooling, send him to Joyce&#39;s site or print out parts of it. Joyce&#39;s writing is so clear and logical it goes a long way toward dispelling fears of dogma and cults. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nIt could also help, if he&#39;ll read something short to print out Pam Sorooshian&#39;s &quot;Principles of Unschooling&quot;. The nice thing about those is they&#39;re really principles of learning - and That&#39;s what unschooling is about, its seeing how people learn and becoming more responsive, as a parent, to how your kids learn. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pam/principles\">http://sandradodd.com/pam/principles</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":177967425,"authorName":"teresa","from":"&quot;teresa&quot; &lt;treesock@...&gt;","profile":"treesock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dad&#39;s roles, concerns and unschooling resources","postDate":"1316201270","msgId":62916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1MDd2bSttODZpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg=="},"prevInTopic":62911,"nextInTopic":62919,"prevInTime":62915,"nextInTime":62917,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"... My husband is a raving LSU fan. Game nights are Big Fun at our house. They love it, because it s a fun, whole-family activity. The game is on. The laptop","messageBody":"<div id=\"ygrps-yiv-1843801567\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;VanessaL&quot; &lt;fancyness07@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; So I had a much longer post but the baby deleted it. Perhaps it&#39;s just as well. So take two:<br/>\n&gt; <br/>\n&gt; My husband is a corporate trainer and I&#39;m a stay at home mom with two boys (4 and 1.5). I&#39;ve been reading about unschooling for 7-8 months. Normally my husband leaves the research about kid related things to me. He speaks up if something doesn&#39;t sit well but is normally a go with the flow type. However he&#39;s coming up with questions about unschooling I just can&#39;t answer. Not well anyway. He&#39;s ready to learn more and really would love a dad&#39;s/male perspective on it. <br/>\n&gt; <br/>\n<br/>\n<br/>\n&gt; Some of his main concerns/questions are:<br/>\n&gt; <br/>\n&gt; His role. What is the dad&#39;s role? Will his children still accept his influence? (rooting for his fav baseball team is super important to him) <br/>\n<br/>\n </span></blockquote>My husband is a raving LSU fan. Game nights are Big Fun at our house. They love it, because it&#39;s a fun, whole-family activity. The game is on. The laptop is queued up to other scores and to Facebook, where my husband is talking about the game with his cousins and brothers, and tells the kids what Uncle John just said, etc. My husband made up this silly RAWR paw-slap-high 5 kind of a thing for touchdowns. Everybody wears their purple and gold. We have chips and salsa.<br/>\n<br/>\nThe kids are mostly into it. Sometimes they check out, go in the other room to play, hang out with me doing something else, etc. But his fanship--which is important to him--is definitely a bonding opportunity for them. I think some dads got from their dads/uncles/etc. a lot of quality, loving, fun time from spectator sports. Maybe it&#39;s more about wanting to share all that good stuff with them, wanting to offer to them everything that fanship has offered to him. <br/>\n<br/>\nIt could be that that happens in other ways, too, though, if the kids aren&#39;t that into baseball.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Will his son grow up NOT reading the Count of Monte Cristo? He knows, even school wouldn&#39;t guarantee that but he&#39;s having trouble figuring out his place. <br/>\n<br/>\n </span></blockquote>I just read something about a 3rd grader getting in trouble at school for reading the 6th grade books. I can&#39;t recall now where I saw that. But I was thinking at the time how funny it is that we separate books into 3rd grade/6th grade, classic literature and pulp fiction, Important Works and kid stuff. <br/>\n<br/>\nSometimes, those kinds of distinctions can be helpful as we think about how to discuss works, and time periods, and influences. But what if we lifted those categories as judgments. What if we thought of all literature as equal in their opportunity to enrich someone&#39;s life and help them to learn? What if your child discovers Dumas&#39; Count of Monte Cristo at 18 because a friend of his put the story in his hands, knowing that he loved the dark beauty of Edgar Allen Poe, and had been reading Poe since age 16? And maybe he got to Poe because he was watching a Simpson&#39;s episode at 14 that referenced &quot;The Raven,&quot; and it stuck with him. And maybe your husband is a fan of the Simpsons, and was the one to buy the DVD because he thought it would be a fun thing to watch together. <br/>\n<br/>\nSometimes, I&#39;m so glad that we can&#39;t see all ends, because we could never have guessed how terrific things would turn out all on their own.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; He&#39;s jealous that his family is taking an &quot;indefinite vacation.&quot; He wants to be part of that too, while still providing a stable healthy environment for his family. <br/>\n<br/>\n </span></blockquote>Maybe here, it would be helpful to focus on &quot;he wants to be a part of that, too.&quot; That&#39;s great! Sometimes we meet my husband at the park during his lunch hour so we can all play together. Or we make a really big deal about him coming home--sometimes we hide so that he can &quot;find us&quot; when he walks in, or else we made him something yummy to have when he gets home, or we make an extra of whatever was the most fun to play with so that he can join in right away. I email him funny stories from the day, especially if one of the kids said something really funny or sweet about their dad.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;How is his position as a teacher so valuable at work but not at home? (his feelings, NOT mine)<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I was a teacher before I stayed home. And others here have helped me to see that learning in a classroom, from a teacher, is one way to learn. It&#39;s often a very cost-effective way, and it works fine for some people. The grown-ups in his class are choosing to be there. (And he probably gets reviews, right? And people respond that he did a good job providing the material for others to learn from?) You guys are making a different choice for and with your kids, that&#39;s all. In some ways, I think a teaching background has helped me to feel more confident in unschooling; I know the best practices. I know the very best things that a teacher can throw at my kid in a classroom. And I know how much *more* I can do with them at home and in the rest of the world!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve gotten a bit zealous about what I&#39;m learning and I think he sees that as red flag. We&#39;ve always been able to pick and choose what works for us (in AP, holistic living, diet changes ect) but this is the first philosophy I have spoken with such conviction about.<br/>\n<br/>\n </span></blockquote>In a similar situation, it was helpful for me to say to my husband, &quot;This makes a lot of sense to me, given what I know about learning, about our kids, and about how I like to be treated myself, so I want to give it a try for X (amount of time).&quot; I also judiciously pepper our conversations about the day with little &quot;success&quot; stories to keep him in the loop. Last night, for example, I was able to show him the 3/4 pan of brownies that were left after the kids had had their fill; it was a big moment for us where the easing up on food controls had paid off. That was one we&#39;d struggled to find common parenting ground on. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;He&#39;d love to hear more personal experiences and thoughts, especially with the male in mind, and is more apt to read a web article or blog post than a book. Yet. And is not interested in joining the list. Yet. But is very interested in hearing back what people reply. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>My husband is not interested in doing the level of research that I do, either. But what he likes, in his words, are talking points. He likes the rationale, an example of an application, and some specific language to use in specific situations. Then, we can talk about the results together, as they worked out in our family. <br/>\n<br/>\nTeresa<br/>\nMama to Woody, almost 6, and Fox, 2 1/2</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dad&#39;s roles, concerns and unschooling resources","postDate":"1316188379","msgId":62911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyRTIwM0U0LTBCNDctNDkzOC1BRjRELTk2QUJDRDFFNEZFQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg=="},"prevInTopic":62910,"nextInTopic":62916,"prevInTime":62910,"nextInTime":62912,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"... His place can be to focus on the time his son spends with him being enjoyable. :-) It grows a great relationship. What better role can there be? :-) If he","messageBody":"<div id=\"ygrps-yiv-1351032060\">On Sep 16, 2011, at 10:32 AM, VanessaL wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; His role. What is the dad&#39;s role? Will his children still accept his  <br/>\n&gt; influence? (rooting for his fav baseball team is super important to  <br/>\n&gt; him) Will his son grow up NOT reading the Count of Monte Cristo? He  <br/>\n&gt; knows, even school wouldn&#39;t guarantee that but he&#39;s having trouble  <br/>\n&gt; figuring out his place.<br/>\n<br/>\n </span></blockquote>His place can be to focus on the time his son spends with him being  <br/>\nenjoyable. :-) It grows a great relationship. What better role can  <br/>\nthere be? :-)<br/>\n<br/>\nIf he can focus on sharing his enjoyment of his favorite baseball team  <br/>\nwith his son in a way that his son enjoys, rather than focusing on the  <br/>\ngame, it&#39;s likely his son will like it to. Sure worked with my husband  <br/>\nand our daughter :-)<br/>\n<br/>\nIf his focus is on enjoyment rather than getting his son to enjoy  <br/>\nsomething, that will work way better! If he loves the Count of Monte  <br/>\nCristo, I know there are movie versions. If his experiences with the  <br/>\nstory are positive, it&#39;s way more likely he&#39;ll read it with enjoyment  <br/>\nat some point than if anyone ever makes him.<br/>\n<br/>\nIf there are little build ups, jokes, references to it in other  <br/>\nthings, connections, that will create a curiosity.<br/>\n<br/>\nWhich is true of anything. It&#39;s the building feeling of &quot;Hey, that  <br/>\nsounds interesting,&quot; that is likely to draw a child to explore  <br/>\nsomething. If the parent is pushing, it&#39;s likely to wreck the feeling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is it common for parents to pursue unusual sources of income?<br/>\n<br/>\n </span></blockquote>Not common but if the drive is strong enough, people find a way to do  <br/>\nit.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do other dad&#39;s feel this way?<br/>\n<br/>\n<br/>\n </span></blockquote>Certainly some do. (And I see Sandra provided a link.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How is his position as a teacher so valuable at work but not at  <br/>\n&gt; home? (his feelings, NOT mine)Is it common to experience so much  <br/>\n&gt; dissonance in the beginning?<br/>\n<br/>\n<br/>\n </span></blockquote>Because someone values the idea of putting a specific chunk of  <br/>\ninformation into employees enough to pay him to do it to people ;-)<br/>\n<br/>\nBut because one person values an idea enough to pay for it doesn&#39;t  <br/>\nmake the idea universally valuable. It means one person thinks it&#39;s a  <br/>\ngood idea for his goal.<br/>\n<br/>\nIn a workplace, there often is a certain common body of knowledge, a  <br/>\ncertain way of doing things, that it&#39;s helpful for people to have. A  <br/>\nworkplace is often much like a factory even if it&#39;s not a factory.  <br/>\nEveryone has a specific role to play and there&#39;s the company&#39;s way of  <br/>\ndoing it.<br/>\n<br/>\nLife isn&#39;t like that though! We don&#39;t have to take on predefined roles  <br/>\n(unless we want to). We each have unique talents that we can use in  <br/>\nunique ways to do new things. And the nifty thing is that no one needs  <br/>\nto teach us how to do it. We can choose draw in ways others have done  <br/>\nthings successfully when we want to. But to do and learn, all we need  <br/>\nis the interest and the support to explore.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Dogma. Is unschooling a cult? I&#39;ve gotten a bit zealous about what  <br/>\n&gt; I&#39;m learning and I think he sees that as red flag.<br/>\n<br/>\n<br/>\n </span></blockquote>Many new things are like a new love where there seem to be only good  <br/>\nparts and you want to know everything about them :-)<br/>\n<br/>\nWhen I first stumbled on the homeschooling boards on AOL, I sucked in  <br/>\neverything from the most structured to the least structured. It wasn&#39;t  <br/>\nuntil I&#39;d sucked in a huge chunk (about 4 years worth going back  <br/>\nthrough the archives) that I felt ready to pull it apart and start  <br/>\nlooking at its underbelly and questioning what I was reading.<br/>\n<br/>\nIt&#39;s a phase where it feels like it all makes so much sense and  <br/>\nperfect as is. Until you try to use it to solve your own problems.  <br/>\nThen you need to work on building your own understanding of it and  <br/>\npicking it apart to see how it works rather than operating from other  <br/>\npeople&#39;s understanding and trusting they understand how it works.<br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dad&#39;s roles, concerns and unschooling resources","postDate":"1316188227","msgId":62910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1QzQzNDMzLURCRkEtNDJFOS1BM0Y0LTVGNTQxMURGMTE1MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTYxODcyNjkuNTE1ODUuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPiA8MTMxNjE4NzI2OS41MTU4NS5ZYWhvb01haWxOZW9Ad2ViODE1MDUubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":62908,"nextInTopic":62911,"prevInTime":62909,"nextInTime":62911,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"-=- Maybe he would like reading John Holt. I would get him some of his books.-=- Yes, or read here: http://SandraDodd.com/johnholt (for reading some and not","messageBody":"<div id=\"ygrps-yiv-1810587928\">-=- Maybe he would like reading John Holt. I would get him some of his books.-=-<br/>\n<br/>\nYes, or read here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://SandraDodd.com/johnholt\">http://SandraDodd.com/johnholt</a><br/>\n(for reading some and not all; for some things short enough to print out)<br/>\n<br/>\n<br/>\nThere was a great collection of Holt quotes on a blog just yesterday or so... <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://another-roadside-attraction.blogspot.com/2011/09/when-i-first-read-john-holts-writing-i.html\">http://another-roadside-attraction.blogspot.com/2011/09/when-i-first-read-john-holts-writing-i.html</a><br/>\nRue Kream&#39;s collection of quotes.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dad&#39;s roles, concerns and unschooling resources","postDate":"1316187269","msgId":62908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTYxODcyNjkuNTE1ODUuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg=="},"prevInTopic":62907,"nextInTopic":62910,"prevInTime":62907,"nextInTime":62909,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"  ","messageBody":"<div id=\"ygrps-yiv-1205888392\"> <br/>\n<br/>\n&lt;&lt;&lt;&lt;His role. What is the dad&#39;s role? &gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhat role does he want to take?  Isn&#39;t he already being a dad? A great supportive dad? Would he be less or more if the children went to school?<br/>\nIs he feeling left out? Why? Those are rhetorical questions but it may help you figure out his concerns or ask him and listen to what they are.<br/>\nThere is a great page on dad&#39;s here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dads\">http://sandradodd.com/dads</a><br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;Will his children still accept his influence? (rooting for his fav baseball team is super important to him)&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nHow can one guarantee that???My  is into basketball because of his dad. My daughter is into cows like her dad. I can see how my kids do  and like a lot of what their dad does and likes. Some maybe genetics some maybe be influenced by him or both. <br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;Will his son grow up NOT reading the Count of Monte Cristo? He knows, even school wouldn&#39;t guarantee that but he&#39;s having trouble figuring out his place. &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n Maybe , maybe not.  Maybe they will love for dad to talk about the book or read it to them.  What if you were not unschooling, how would that be diferent?<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;His job. He was in the Navy for 8 years, corporate worker for 5. Teacher/instructor for many of those years. He wants to pursue comedy.  He&#39;s jealous that his family is taking an &quot;indefinite vacation.&quot; He wants to be part of that too, while still providing a stable healthy environment for his family. Is it common for parents to pursue unusual sources of income?&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI have heard some do. Others do not. This sounds more about him and how he may not be satisfied with his work than unschooling.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;Do other dad&#39;s feel this way? And what do they do about it? &gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThat is not about unschooling and no one in this list can tell you and your husband what to do. If he is not happy with his job and what he does then maybe you guys should look into changing it. <br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;How is his position as a teacher so valuable at work but not at home? (his feelings, NOT mine)&gt;&gt;&gt;&gt;<br/>\n<br/>\n Maybe he would like reading John Holt. I would get him some of his books. His position as a dad, facilitator, supporter is much much more important than if he was a teacher. As a dad he is so much more important to his children than being a teacher to ANYONE at work.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;Is it common to experience so much dissonance in the beginning?&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI would not know as every family is different. <br/>\n<br/>\nI shared things with my husband when I was learning about unschooling slowly. Nothing changed much because we were already parenting <br/>\npretty much this way. It helped my husband to meet a couple of wonderful unschooling dad&#39;s and mom&#39;s that he really loved and still talks about them.<br/>\nMy husband used to call Sandra Dodd  Sandra God. He really liked listening to her Peaceful Parenting podcast. It was not on purpose, I was listening and he did to and got into it. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;Dogma. Is unschooling a cult? I&#39;ve gotten a bit zealous about what I&#39;m learning and I think he sees that as red flag. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nBut that is about you not unschooling.<br/>\nIt seems like you may not be deeply understanding what unschooling is  and following some perceived unschooling rules. That is why the &quot;read a little, .......<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;We&#39;ve always been able to pick and choose what works for us (in AP, holistic living, diet changes ect) but this is the first philosophy I have spoken with such conviction about. Even if I don&#39;t fully understand it myself! It&#39;s just making too much sense to ignore. And only seems wise that I learn as much as I can from those who have been there done that. But yeah, &quot;Sandra Dodd&#39;s website says . . .&quot; or the &quot;on the always learning list . . .) have been common phrases here. I think he&#39;s worried that a commitment to unschooling could trump our clarity regarding our children/family. I know Sandra&#39;s saying &quot;Read a little, try a little, wait a while, watch&quot; applies here but I&#39;m not sure what else to say. I really think if he does his own research and comes to his own conclusions this won&#39;t be an issue but it&#39;s one that is important to him so I&#39;m including it in the post for discussion.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nI have never said: &quot; Sandra Dodd;s website says......&quot; It was about the ideas and not  rules that I needed to follow because someone said it.<br/>\nUnschooling should not trump your family. If it was to choose between unschooling and keeping my family together it would be my family first.<br/>\n<br/>\nMy husband just left after doing chores for 6 hours to take my son and trap some golphers in the hay field. That is what my husband used to do when he was my sons age to make some money and now my son is doing it. <br/>\n<br/>\nMy husband feels like I care if I help him with chores just a bit. He feels loved and valued. I do  a lot for him to feel that way because he is the one working 365 a year for many many hours a day to make it a go so I can stay home with the children and unschool.<br/>\nI tend to our relationship as a couple. IT is very important to keep our family together and our marriage strong. <br/>\nOur marriage is better because of unschooling. It has changed how I treat my husband in super positive ways.<br/>\nJust last night I was tired and my husband was in the mood for some love. While I waited for my daughter to sleep I made the effort to go &quot;visit&quot; him after that.<br/>\nI can sleep in in the morning but he gets up at 4:30 AM everyday . It was great for both of us. It is great to take time to tend to us as a couple.<br/>\nWhen my husband feels that  he is important and that his needs are important he is much more  likely to to the same for the kids and I. He feels loved and important and not left out.<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dad&#39;s roles, concerns and unschooling resources","postDate":"1316186083","msgId":62907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExQzI0RTkxLUZFQzYtNDZEQi05MjM5LUU4QzIyMjAwRkI0MUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg=="},"prevInTopic":62906,"nextInTopic":62908,"prevInTime":62906,"nextInTime":62908,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"... Has your husband seen this one? http://seanheritage.blogspot.com/2010/02/waterpark-educational-development-and.html It s written by a naval officer about","messageBody":"<div id=\"ygrps-yiv-208714009\"><blockquote><span title=\"ireply\">&gt; Thanks so much for reading and thanks in advance for responding. We  <br/>\n&gt; have Sandra&#39;s big book of Unschooling and he loved the post on her  <br/>\n&gt; site Phil Biegler wrote <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/philbiegler/NEUC2010\">http://sandradodd.com/philbiegler/NEUC2010</a>  <br/>\n&gt; When I read the article I thought it was nice but didn&#39;t think much  <br/>\n&gt; beyond that but for my husband he finally felt someone was speaking  <br/>\n&gt; to him. It made a huge impact and I think he&#39;s really craving more  <br/>\n&gt; of that. He&#39;d love to hear more personal experiences and thoughts,  <br/>\n&gt; especially with the male in mind, and is more apt to read a web  <br/>\n&gt; article or blog post than a book. Yet. And is not interested in  <br/>\n&gt; joining the list. Yet. But is very interested in hearing back what  <br/>\n&gt; people reply.<br/>\n<br/>\n </span></blockquote>Has your husband seen this one?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://seanheritage.blogspot.com/2010/02/waterpark-educational-development-and.html\">http://seanheritage.blogspot.com/2010/02/waterpark-educational-development-and.html</a><br/>\n<br/>\nIt&#39;s written by a naval officer about his experience at the  <br/>\nunschoolers&#39; waterpark gathering last year.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dad&#39;s roles, concerns and unschooling resources","postDate":"1316185229","msgId":62906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU4RTlCQzY0LTdDRUQtNDE3Ny04NUE2LUQzNzlDNjk5NUU5QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg=="},"prevInTopic":62904,"nextInTopic":62907,"prevInTime":62905,"nextInTime":62907,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"-=-His role. What is the dad s role? Will his children still accept his influence? (rooting for his fav baseball team is super important to him) Will his son","messageBody":"<div id=\"ygrps-yiv-23555356\">-=-His role. What is the dad&#39;s role? Will his children still accept his influence? (rooting for his fav baseball team is super important to him) Will his son grow up NOT reading the Count of Monte Cristo? He knows, even school wouldn&#39;t guarantee that but he&#39;s having trouble figuring out his place. -=-<br/>\n<br/>\nDid he inherit his favorite baseball team from his dad?  (I mean as opposed to watching baseball and naturally gravitating toward a favorite of his own?)<br/>\n<br/>\nThere are a LOT of novels in the world.  What&#39;s special about The Count of Monte Cristo to him?  How does he feel about watching movie versions with his kid?  Or reading it to them?  Or getting an audio book?  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dads\">http://sandradodd.com/dads</a><br/>\n<br/>\nRather than thinking of &quot;having a role&quot; as though it&#39;s all designed and pre-formatted, it will help more to think of what kind of relationship he&#39;s having with each child.<br/>\n<br/>\n-=-Is it common to experience so much dissonance in the beginning?-=-<br/>\n<br/>\nYes.<br/>\n<br/>\n-=-His job. He was in the Navy for 8 years, corporate worker for 5. Teacher/instructor for many of those years. He wants to pursue comedy. He&#39;s jealous that his family is taking an &quot;indefinite vacation.&quot; He wants to be part of that too, while still providing a stable healthy environment for his family.-=-<br/>\n<br/>\nThat&#39;s definitely a &quot;don&#39;t quit your day job&quot; situation, though, even if he&#39;s a great comic.  It can be on the side of providing a stable environment for his family.   <br/>\n<br/>\nEven if he didn&#39;t have children and a wife, he would need to have a job to pay for a house, car and food.  Don&#39;t let him blame you for needing to have a job.   If the kids are in school, his job would be just as important, and maybe moreso if you were paying for private school or lots of extra-curricular  activities.  So don&#39;t let him blame the idea of unschooling for the need for him to keep a job. :-)<br/>\n<br/>\nAnd &quot;indefinite vacation&quot; is a way to think about deschooling, how to move from school to natural learning.  But once that transition is made, life isn&#39;t &quot;a vacation&quot; from life, life IS life.  Learning is part of a rich life.  But  a rich life needs a dwelling place, heat, lights, warm beds...<br/>\n<br/>\nPerhaps the way he&#39;s seeing and naming his relationship to his children and their learning is the problem.  New terminology, a clearer point of view could help.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":325777836,"authorName":"VanessaL","from":"&quot;VanessaL&quot; &lt;fancyness07@...&gt;","profile":"fancyness07","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Dad&#39;s roles, concerns and unschooling resources","postDate":"1316183570","msgId":62904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0dm1taSs3MjhmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62906,"prevInTime":62903,"nextInTime":62905,"topicId":62904,"numMessagesInTopic":0,"msgSnippet":"So I had a much longer post but the baby deleted it. Perhaps it s just as well. So take two: My husband is a corporate trainer and I m a stay at home mom with","messageBody":"<div id=\"ygrps-yiv-1640358160\">So I had a much longer post but the baby deleted it. Perhaps it&#39;s just as well. So take two:<br/>\n<br/>\nMy husband is a corporate trainer and I&#39;m a stay at home mom with two boys (4 and 1.5). I&#39;ve been reading about unschooling for 7-8 months. Normally my husband leaves the research about kid related things to me. He speaks up if something doesn&#39;t sit well but is normally a go with the flow type. However he&#39;s coming up with questions about unschooling I just can&#39;t answer. Not well anyway. He&#39;s ready to learn more and really would love a dad&#39;s/male perspective on it. <br/>\n<br/>\nSome of his main concerns/questions are:<br/>\n<br/>\nHis role. What is the dad&#39;s role? Will his children still accept his influence? (rooting for his fav baseball team is super important to him) Will his son grow up NOT reading the Count of Monte Cristo? He knows, even school wouldn&#39;t guarantee that but he&#39;s having trouble figuring out his place. <br/>\n<br/>\nHis job. He was in the Navy for 8 years, corporate worker for 5. Teacher/instructor for many of those years. He wants to pursue comedy.  He&#39;s jealous that his family is taking an &quot;indefinite vacation.&quot; He wants to be part of that too, while still providing a stable healthy environment for his family. Is it common for parents to pursue unusual sources of income? Do other dad&#39;s feel this way? And what do they do about it? How is his position as a teacher so valuable at work but not at home? (his feelings, NOT mine)Is it common to experience so much dissonance in the beginning?<br/>\n<br/>\nDogma. Is unschooling a cult? I&#39;ve gotten a bit zealous about what I&#39;m learning and I think he sees that as red flag. We&#39;ve always been able to pick and choose what works for us (in AP, holistic living, diet changes ect) but this is the first philosophy I have spoken with such conviction about. Even if I don&#39;t fully understand it myself! It&#39;s just making too much sense to ignore. And only seems wise that I learn as much as I can from those who have been there done that. But yeah, &quot;Sandra Dodd&#39;s website says . . .&quot; or the &quot;on the always learning list . . .) have been common phrases here. I think he&#39;s worried that a commitment to unschooling could trump our clarity regarding our children/family. I know Sandra&#39;s saying &quot;Read a little, try a little, wait a while, watch&quot; applies here but I&#39;m not sure what else to say. I really think if he does his own research and comes to his own conclusions this won&#39;t be an issue but it&#39;s one that is important to him so I&#39;m including it in the post for discussion.<br/>\n<br/>\nThanks so much for reading and thanks in advance for responding. We have Sandra&#39;s big book of Unschooling and he loved the post on her site Phil Biegler wrote <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/philbiegler/NEUC2010\">http://sandradodd.com/philbiegler/NEUC2010</a> When I read the article I thought it was nice but didn&#39;t think much beyond that but for my husband he finally felt someone was speaking to him. It made a huge impact and I think he&#39;s really craving more of that. He&#39;d love to hear more personal experiences and thoughts, especially with the male in mind, and is more apt to read a web article or blog post than a book. Yet. And is not interested in joining the list. Yet. But is very interested in hearing back what people reply. <br/>\n<br/>\n<br/>\nVanessa</div>","specialLinks":[]}],"prevTopicId":63003,"nextTopicId":63109}}