{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":8226888,"authorName":"the_clevengers &lt;diamondair@email.msn.com&gt;","from":"&quot;the_clevengers &lt;diamondair@...&gt;&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Need help on finding the balance - this got long...","postDate":"1039802758","msgId":51466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF0ZDdpNys3M2p2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":51465,"nextInTime":51467,"topicId":51466,"numMessagesInTopic":0,"msgSnippet":"... unclear on ... like that ... comes around ... Interesting, but not really relevant to what I was saying. I ve seen and heard stories like that from real","messageBody":"<div id=\"ygrps-yiv-436718930\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s too bad. <br/>\n&gt; I&#39;ve heard stories like that, of course, but from people who were <br/>\n </span></blockquote>unclear on <br/>\n<blockquote><span title=\"ireply\"> &gt; what unschooling was or who had NOT seen it work well.  And stories <br/>\n </span></blockquote>like that <br/>\n<blockquote><span title=\"ireply\"> &gt; have been around for years, perpetrated by structured homeschooling <br/>\n&gt; leadership who wanted to warn &quot;their people&quot; away from the ungodly, <br/>\n&gt; neglectful &quot;unschoolers.&quot;   <br/>\n&gt; <br/>\n&gt; The source material for some of those stories is out there and <br/>\n </span></blockquote>comes around <br/>\n<blockquote><span title=\"ireply\"> &gt; periodically.<br/>\n<br/>\n </span></blockquote>Interesting, but not really relevant to what I was saying. I&#39;ve seen <br/>\nand heard stories like that from real life unschoolers (not just <br/>\nsupposedly made-up stories on a list), people who definitely embrace <br/>\nan unschooling belief, but struggle with implementing it and <br/>\nintegrating it into a parenting style. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;But it doesn&#39;t mean that when I&#39;m half <br/>\n&gt; asleep at midnight I will read them twenty more pages of their Star <br/>\n&gt; Wars book, or whatever.&gt;&gt;<br/>\n&gt; <br/>\n&gt; This is a straw man.<br/>\n<br/>\n </span></blockquote>Funny, that kid didn&#39;t feel like straw at midnight, with his Star <br/>\nWars book in hand :-). Though his hair *is* straw colored...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To call it a &quot;free-for-all lifestyle&quot; reveals a prejudice. <br/>\n<br/>\n </span></blockquote>No, it is simply a term I&#39;ve chosen for that lifestyle. It&#39;s not a <br/>\nparenting style that I embrace, but it&#39;s another one out there. It <br/>\nmay work for some people and their kids, and if so it&#39;s neither <br/>\nbetter nor worse than any other.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You can probably <br/>\n&gt; unschool and maintain that prejudice against other unschoolers, but <br/>\n </span></blockquote>it won&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; really benefit you emotionally to do that. <br/>\n<br/>\n </span></blockquote>I don&#39;t believe I hold any prejudice against others that unschool <br/>\nlike that. If it works for them, great.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve never read when I needed to go to sleep.  I&#39;ve said, &quot;I&#39;m <br/>\n </span></blockquote>sorry, I&#39;m too <br/>\n<blockquote><span title=\"ireply\"> &gt; tired.&quot;  And so my kids feel comfortable also saying when they&#39;re <br/>\n </span></blockquote>too tired <br/>\n<blockquote><span title=\"ireply\"> &gt; to go and get me something, or too tired to help a sibling, but I <br/>\n </span></blockquote>see them <br/>\n<blockquote><span title=\"ireply\"> &gt; frequently do something special to make up for it the next day.  <br/>\n </span></blockquote>it&#39;s not &quot;do <br/>\n<blockquote><span title=\"ireply\"> &gt; whatever you want whenever you want,&quot; as someone said here <br/>\n </span></blockquote>earlier.  It&#39;s do <br/>\n<blockquote><span title=\"ireply\"> &gt; things for real reasons, not arbitrary reasons.<br/>\n<br/>\n </span></blockquote>I think we&#39;re saying very close to the same thing. The thing that I <br/>\nwas trying to get across to the original poster is that it&#39;s *okay* <br/>\nto say &quot;I&#39;m sorry, I&#39;m too tired.&quot; She seemed to feel very <br/>\nuncomfortable with setting any kind of personal limit like that, and <br/>\nI think therein can lie the road to burnout, if you feel that you <br/>\nalways have to be doing things for your kids, beyond your own <br/>\npersonal comfort or boundaries. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Most of the homeschooling burnout comes from structure-using <br/>\n </span></blockquote>families.<br/>\n<br/>\nI&#39;d agree with that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Truly, those who have claimed &quot;burnout&quot; who are unschoolers and who <br/>\n </span></blockquote>have come <br/>\n<blockquote><span title=\"ireply\"> &gt; and told us about it seem to be people who never really got into <br/>\n </span></blockquote>the flow of <br/>\n<blockquote><span title=\"ireply\"> &gt; natural learning, but where hoping for it to happen during off <br/>\n </span></blockquote>hours, and <br/>\n<blockquote><span title=\"ireply\"> &gt; hoped for it to look like school structure.<br/>\n<br/>\n </span></blockquote>I guess I&#39;ve seen something different, I&#39;ve seen people who do <br/>\nembrace unschooling, but struggle with the issue I discussed above, <br/>\nsetting personal limits so they don&#39;t feel like they personally have <br/>\nto be everything to everybody in the household.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Our limits are philosophical and very real.<br/>\n&gt; They just don&#39;t look like deadlines with rules and kids being <br/>\n </span></blockquote>grounded or <br/>\n<blockquote><span title=\"ireply\"> &gt; sent to their rooms for breaking rules.  It&#39;s a whole different way <br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; looking at and living life.<br/>\n<br/>\n </span></blockquote>Ditto. And that&#39;s what I was trying to get across, that you *can* set <br/>\npersonal limits, and that it is a very different thing from setting <br/>\narbitrary rules.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s not the &quot;STYLE&quot; of being, it&#39;s the understanding behind it, <br/>\n </span></blockquote>and the <br/>\n<blockquote><span title=\"ireply\"> &gt; trust in human nature and goodness, and the respect for children as <br/>\n&gt; individual people that has the effect some of us (I&#39;m not the only <br/>\n </span></blockquote>one) are <br/>\n<blockquote><span title=\"ireply\"> &gt; trying to share.<br/>\n<br/>\n </span></blockquote>I&#39;d like to think you&#39;re not implying that I (or other people who <br/>\nhave discussed personal limits) *don&#39;t* have that trust in human <br/>\nnature, goodness, and respect for children. I think it&#39;s completely <br/>\npossible to respect your children and yet respect yourself, and I do <br/>\nsee people struggling with how to do that. It&#39;s not always easy to <br/>\nimplement, and it&#39;s a daily decision-making process. For instance, <br/>\nI&#39;m working on a new novel, and that usually takes me out of the <br/>\nhouse for 2 hours a day to write. But lately, my kids have been <br/>\ngetting stressed whenever I go to write (my husband is always here <br/>\nwith them when I&#39;m not, so they&#39;re not being left in arbitrary care). <br/>\nSo should I respect my children&#39;s signs of stress and stop going to <br/>\nwrite? Or should I respect my own need to have creative outlet and <br/>\ncontinue going to write? It doesn&#39;t work for me to write every few <br/>\ndays, I lose the flow of the novel. It also doesn&#39;t work to write <br/>\nhere in the house with the kids, and it doesn&#39;t work to write in <br/>\nsmaller increments than 2 hours. Right now, my answer was to quit <br/>\nwriting for awhile, but I&#39;d be lying if I said I&#39;m completely <br/>\nthrilled with that. Still, the need of my children came first in this <br/>\ncircumstance. But that doesn&#39;t mean it&#39;s an easy decision. There&#39;s a <br/>\nconstant gap in this place in my life where my novel lies, half <br/>\nfinished. That emptiness will remain until such time as I can work on <br/>\nit again. Decisions like this happen every day, to real life <br/>\nunschooling families. Those who respect their children, and yet <br/>\nstruggle with respecting their own needs as well.<br/>\n<br/>\nI think for any homeschooling parent, whether structured or not, <br/>\nthere&#39;s always a fine balance between giving the kids what they need, <br/>\nand respecting your own needs for privacy, space, intimate time with <br/>\nspouse, time to exercise or do something creative, read a book <br/>\nuninterrupted, or whatever. As parents who are with their kids all <br/>\nday long, we *do* have in common with more structured homeschoolers <br/>\nthis basic issue of time. Schooling parents simply ship their kids <br/>\noff for 7 hours a day, but we make a choice not to do that. Finding <br/>\npersonal balance and setting personal limits are not issues that are <br/>\nlimited to structured homeschoolers. And for many of us whose <br/>\nchildren are still quite young, it can be a big issue. I can see as <br/>\nmy kids get older that it will be less and less of an issue as the <br/>\nyears go by and they develop more of their own interests and an <br/>\nability to play independently.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Well nobody used the word &quot;servant&quot; but you.<br/>\n&gt; And your characterization of people &quot;doing whatever their children <br/>\n </span></blockquote>ask&quot; is <br/>\n<blockquote><span title=\"ireply\"> &gt; not a good picture of what&#39;s happening in those families where <br/>\n </span></blockquote>unschooling is <br/>\n<blockquote><span title=\"ireply\"> &gt; working effortlessly.<br/>\n<br/>\n </span></blockquote>No, nor was it intended to be. It was in answer to a lengthy question <br/>\nposed by a parent for whom this is *not* working. And I&#39;d have to say <br/>\nthat I feel that unschooling works very well in our family (most of <br/>\nthe time!), so I was trying to share some things that I&#39;ve discovered <br/>\nthat help to make it work smoothly for us.<br/>\n<br/>\nAs I said, if a parenting style works for someone, that&#39;s fine. Some <br/>\npeople may be much more inclined to follow their children&#39;s wishes <br/>\n100% of the time. Indeed, I have friends for whom they feel that is <br/>\ntheir life calling, to just be and do everything that their kids are <br/>\ninterested in. And they&#39;re great parents, and great unschoolers too. <br/>\nThey are perfectly happy playing dolls with their youngest, or <br/>\nreading books to their tribe, or making up plays and puppet shows all <br/>\nday long. They go to bed when their kids do, and wake up when their <br/>\nkids do. That is precisely what they want to be doing with their <br/>\nlife, and this child-centered approach works very well for them. For <br/>\nothers, who may have outside interests of their own, there is <br/>\nsometimes a conflict between what the parent wants and what the child <br/>\nwants. Or even with no outside interests, there might be a difference <br/>\nof goals. Like the parent wants to stay up for some intimate time <br/>\nwith their spouse, but one child doesn&#39;t go to sleep until midnight <br/>\nwhile another one wakes up at 5:30 in the morning. Where does one <br/>\nfind time to sleep, even, in such a circumstance? These are the <br/>\nthings that parents, real true unschooling parents (whether they fit <br/>\nyour personal definition or no) struggle with. There is not *one* <br/>\nanswer that works for all these people, and there never will be. <br/>\nThere&#39;s not one way to go about parenting as an unschooler, nor one <br/>\ndecision that works for all. Sometimes even the best decision isn&#39;t <br/>\ngoing to be the one that makes *everyone* in a family happy (as in my <br/>\nexample with my writing above).<br/>\n<br/>\nI think each parenting style brings its own gifts and deficits to a <br/>\nfamily. While a parent who concentrates 100% on her kids all the time <br/>\nhas a special gift of unlimited time and energy with her kids, it <br/>\nmight have the deficit of her children not seeing her pursue any of <br/>\nher own goals and plans. She might never take time for herself, and <br/>\nher own needs. Whereas a parent who chooses to spend time pursuing <br/>\ntheir own goals will have to do more problem-solving as conflicts <br/>\narise between the parents needs and the children&#39;s needs, they also <br/>\ngive their kids the gift of seeing a parent who loves to learn and <br/>\nfollow their own stars. There are, of course, many different styles <br/>\nand many styles in between these two. I even know unschooling <br/>\nfamilies where both of the parents work and they hire a nanny to <br/>\nunschool their kids. That&#39;s one extreme. I know another family where <br/>\nthey&#39;ve chosen to live in a bus so that neither parent had to work <br/>\nmuch and they could spend all their time doing what their kids are <br/>\ninterested in. That&#39;s another extreme. Most families fall somewhere <br/>\nin the middle, and thus have to learn (and maybe constantly re-learn) <br/>\nhow to balance the needs and wants of everyone in the family. <br/>\n<br/>\nBlue Skies,<br/>\n<br/>\n-Robin-</div>","specialLinks":[]}],"prevTopicId":51449,"nextTopicId":51354}}