{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":40,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Not how unscholing works","postDate":"1110208858","msgId":104219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2YmY3NjI2ZDA1OGUzYWMwMjM1YTE5Mzc0YjFmMzk3QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGQwZ280cytyMWhiQGVHcm91cHMuY29tPg==","referencesHeader":"PGQwZ280cytyMWhiQGVHcm91cHMuY29tPg=="},"prevInTopic":104218,"nextInTopic":104224,"prevInTime":104218,"nextInTime":104220,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... I don t think expose them to a lot of things is necessarily schooly. I think it is part of what unschooling parents do. Betsy - if he goes along with 20","messageBody":"<div id=\"ygrps-yiv-929829954\">On Mar 6, 2005, at 9:17 PM, kayb85 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I  really think it was a bit of schooly &quot;expose them to a lot of<br/>\n&gt; educational things&quot; kind of feeling that still pops up every once in<br/>\n&gt; awhile.<br/>\n<br/>\n </span></blockquote>I don&#39;t think &quot;expose them to a lot of things&quot; is necessarily schooly. <br/>\nI think it is part of what unschooling parents do.<br/>\n<br/>\nBetsy - if he goes along with 20 to 30 percent of what you suggest (you <br/>\nsaid 70 to 80 percent of the time he didn&#39;t), then what&#39;s wrong with <br/>\nthat? Sounds like a good chunk of the time, to me.<br/>\n<br/>\nI see absolutely nothing wrong with thinking that he ought to be <br/>\nexposed to a theater experience. Find a local high school  or community <br/>\ncollege production of a lively rousing good-time show and say you want <br/>\nhim to go with you. Don&#39;t take him to an opera for his first live <br/>\ntheater performance, though - use good sense about what is likely to be <br/>\nmore fun for a novice theater-goer.<br/>\n<br/>\nSame with other outings. We have local baseball and hockey teams - <br/>\ntheir games are very entertaining. Be willing to stay for an inning or <br/>\ntwo, only. Local festivals of all kinds - again - be willing to just <br/>\nhave a taste of them and then go. This will be Irish festival weekend - <br/>\ngo spend 20 minutes watching some Irish dancers somewhere. Mention to <br/>\nhim that their dresses can cost over a thousand dollars - wonder why? <br/>\nWonder how often they wear out their shoes? YOU read up on it a bit in <br/>\nadvance so that you can throw out a few tidbits of information - make <br/>\nit interesting for him.<br/>\n<br/>\nStop by somewhere new on your way to a familiar place - &quot;I just want to <br/>\nstop in and see what this place is like....then we&#39;ll go to park day <br/>\nafter that.&quot;<br/>\n<br/>\nGrocery shopping - pick up a fruit you&#39;ve never tried and just say, &quot;I <br/>\nwonder what this is like - I&#39;m going to buy one and cut it open at <br/>\nhome.&quot; When&#39;s the last time you had a pineapple or a coconut or a mango <br/>\nor kiwi?<br/>\n<br/>\nThe first time you went the aquarium was the FIRST time. There had to <br/>\nbe a first time for all those things you listed as being tried and true <br/>\noutings.<br/>\n<br/>\nI&#39;m not saying you have to be on the go constantly - but if you&#39;re <br/>\nspending time at home, then home ought to be filled with opportunities <br/>\nand experiences.<br/>\n<br/>\nMaybe you&#39;re expecting too much in terms of &quot;showing interest&quot; for a <br/>\nkid who doesn&#39;t express himself that way. He doesn&#39;t need to be wild <br/>\nabout things - just mild notice for a few minutes is enough. With a kid <br/>\nwho is so selective, who turns his nose up at so many of your <br/>\nofferings, I don&#39;t see why you&#39;d cut back and not offer much - why not <br/>\nmake more experiences and opportunities available so he has more to <br/>\nchoose from. Twenty percent of a hundred things is 20 --- twenty <br/>\npercent of 10 things is only 2.<br/>\n<br/>\nAlso - you read 50/50 into what I wrote - when, in fact, what I wrote <br/>\nwas that sometimes one leads and sometimes the other.<br/>\n<br/>\nI&#39;m definitely not doing 50 percent of the initiating of my kids&#39; <br/>\nexperiences and exposure anymore. They&#39;re too involved in their own <br/>\nthings for that. But I gave them a bit of exposure to all kinds of <br/>\nthings when they were younger and now they&#39;re &quot;specializing&quot; more and <br/>\nmore. And, even just a few months ago, I really pushed Rosie to try out <br/>\nkarate - and she loved it and it is now one of the main activities in <br/>\nher life.  If she hadn&#39;t liked it, she&#39;d have tried a few classes and <br/>\nthen stopped. The karate studio has a 2 weeks free trial period.<br/>\n<br/>\nBut, I am on the lookout for things to share with them - for <br/>\ninteresting little tidbits of information - for a comic strip or a <br/>\nwebsite or a book or movie or tv show that I think they&#39;ll like.<br/>\n<br/>\nWhen the kids were younger, I did buy a LOT of stuff in which they <br/>\nshowed absolutely no interest - I made a lot of mistakes. Sometimes, <br/>\nlater,  one of them discovered something I&#39;d bought years earlier and <br/>\nloved it. Don&#39;t give up on providing interesting things and experiences <br/>\nbecause you have only a 70 percent track record - that sounds pretty <br/>\ngood to me.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Not how unscholing works","postDate":"1110172636","msgId":104218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwZ280cytyMWhiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQyMjhBNTU2LjEwMjAzMDRAZWFydGhsaW5rLm5ldD4="},"prevInTopic":104215,"nextInTopic":104219,"prevInTime":104217,"nextInTime":104219,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"Because he has shown himself to be ... chance he ... Do you do yard sales and flea markets/thrift stores?  One thing that I did this week was make peanut","messageBody":"<div id=\"ygrps-yiv-409815167\">Because he has shown himself to be <br/>\n<blockquote><span title=\"ireply\"> &gt; quite selective about what he&#39;ll approach, it seems like a waste of <br/>\n&gt; money to bring something home if there seems to be only a 25% <br/>\n </span></blockquote>chance he <br/>\n<blockquote><span title=\"ireply\"> &gt; will like it. <br/>\n<br/>\n </span></blockquote>Do you do yard sales and flea markets/thrift stores?  One thing that <br/>\nI did this week was make peanut butter from a peanut butter machine <br/>\nthat I got at a flea market (My dad&#39;s flea market, so I didn&#39;t have <br/>\nto pay for it, but he would&#39;ve sold it for $1.00 so it wouldn&#39;t have <br/>\nbeen expensive for anyone).  I also found one of those cookie press <br/>\nthings at the flea market($1.00) because my son has seen ads for them <br/>\non tv and has pointed them out to me several times, so I knew he&#39;d <br/>\nwant that.  There was also an old kitchen chemistry kit put out for a <br/>\nquarter, and there were really neat ideas in there and even some <br/>\nsupplies that could still be used.  So I bought peanuts and cookie <br/>\ningredients and yeast for the kitchen chemistry kit, and made peanut <br/>\nbutter and soft pretzels and (will make) cookies.  If the kids hadn&#39;t <br/>\ngotten interested that would have been okay, because I have to make <br/>\nthem food anyway, so I could&#39;ve just made them myself and then given <br/>\nthem the peanut butter and pretzels to eat.  But they REALLY got into <br/>\nthe pretzels, and my 5 year old REALLY got into punching down that <br/>\ndough.   <br/>\n<br/>\nI tend to go crazy at yard sales buying stuff (which are summer <br/>\nweather occasions only around here), and it&#39;s okay if I get so much <br/>\nthat we don&#39;t get to it for months or years or never, because I get <br/>\nit REALLY cheap.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When I am *following* his lead, and going with interests that I <br/>\n </span></blockquote>know he <br/>\n<blockquote><span title=\"ireply\"> &gt; has (e.g. Garfield books), then I&#39;d probably buy it. <br/>\n<br/>\n </span></blockquote>Is he happy and content?  Does he seem to be needing something new?  <br/>\nHow does he spend his time?  <br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; **Do you never hear about a place to go and suggest it?**<br/>\n&gt; <br/>\n&gt; I would say that seventy or eighty percent of the time he doesn&#39;t <br/>\n </span></blockquote>want <br/>\n<blockquote><span title=\"ireply\"> &gt; to go to new places. Maybe the answer there is always to have <br/>\n </span></blockquote>someone to <br/>\n<blockquote><span title=\"ireply\"> &gt; go with, so he can have some kid companionship. <br/>\n<br/>\n </span></blockquote>This sounds familiar &lt;grin&gt;.  Remember the hot dog/play date <br/>\nconversation.  Maybe he just doesn&#39;t want to go anywhere.  It can get <br/>\nto the point where you&#39;re working SO hard to try to find some little <br/>\nway that you might possibly be able to get them to agree to go <br/>\nsomewhere.  When I find myself at that point, I remind myself that <br/>\nI&#39;m probably trying to get him to do something he doesn&#39;t want to do <br/>\nbecause *I* am worried that he &quot;should&quot; go out and do more things.  <br/>\nIt really is a hard thing to balance though!  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve been thinking about going to the theater, <br/>\n<br/>\n </span></blockquote>Why? I&#39;m not saying it&#39;s wrong, but I&#39;ve learned to examine my <br/>\nmotives before I plan a trip.  It&#39;s one way I&#39;ve found that helps me <br/>\nfind that balance between offering cool stuff and pushing for <br/>\nsomething because I think I/we *should*.   Is it something you want <br/>\nto do?  Is it something you would want to go to even if he didn&#39;t <br/>\ncome along?  Is it something that you *know* would trhill him, or is <br/>\nit something that maybe you might be able to get him to go to without <br/>\na major amount of complaint?  Are you doing it just because <br/>\nyou &quot;should&quot; get him out more?  <br/>\n<br/>\nWhen there was a winter festival at a nearby farm, I tried to get all <br/>\nmy kids to go.  They all said no, and so we didn&#39;t go.  I could&#39;ve <br/>\ngone by myself, but when I seriously considered it, I realized that I <br/>\ndidn&#39;t really want to go for myself.  I wanted to go for them.  I <br/>\nthought it would have neat stuff to &quot;expose&quot; them to.  After the <br/>\nfestival was over there was a story and pictures in the paper about <br/>\nit, and I felt a pang of &quot;Darn, I wish we could&#39;ve gone&quot;, and again <br/>\nrealized that I wouldn&#39;t have felt that if I didn&#39;t have kids.  I <br/>\nreally think it was a bit of schooly &quot;expose them to a lot of <br/>\neducational things&quot; kind of feeling that still pops up every once in <br/>\nawhile.  I wasn&#39;t so much attracted to taking them to the festival <br/>\nbecause of anything there that I thought would particularly interest <br/>\nany one of them.  It was just that it was a &quot;good experience&quot; that I <br/>\nwanted to &quot;expose&quot; them to.  It would make me feel like a good, well-<br/>\nrounded unschooler.  And it would make me feel &quot;normal&quot;, like I go <br/>\nlots of cool places with my kids like everyone else.  <br/>\n<br/>\nIt&#39;s easier to explain unschooling to friends/relatives when you can <br/>\ntell them about theatre productions and festivals and museums that <br/>\nyou went to, because all that sounds very &quot;educational&quot; and <br/>\nimpressive. In my state, it also makes good fodder for the <br/>\nportfolio.  But when your homebody kids stay home and read and cook <br/>\nand play video games and watch tv and play, and it seems that every <br/>\ntime you tell them about what your kids are doing it&#39;s the same <br/>\nthing, you feel a pressure to be &quot;exposing them&quot; to more so that you <br/>\nsound more impressive.  I know that it&#39;s not the same old thing every <br/>\nday and that they learn and do interesting stuff all the time but to <br/>\nother people who don&#39;t get unshcooling, it sounds like the same old <br/>\nthing sometimes I think.  That&#39;s been my experience, anyway.  Good <br/>\nthing we didn&#39;t choose to be parents for the purpose of impressing <br/>\nour friends, huh? ;) <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] how unscholing works","postDate":"1110157436","msgId":104215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0LjY0N2MxYWMxLjJmNWQwMjdjQGFvbC5jb20+"},"prevInTopic":104214,"nextInTopic":104218,"prevInTime":104214,"nextInTime":104216,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/6/2005 6:00:56 PM Mountain Standard Time, ecsamhill@earthlink.net writes: If I say  Hey, I m sure it will be fabulous , he makes a","messageBody":"<div id=\"ygrps-yiv-18057796\">In a message dated 3/6/2005 6:00:56 PM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\nIf I say  &quot;Hey, I&#39;m sure it will be fabulous&quot;, he makes a skeptical  face. <br/>\n<br/>\n<br/>\n----------------<br/>\n <br/>\nSometimes I just don&#39;t want to go by myself, and so I ask a kid to please  go <br/>\nwith me.  Sometimes they end up having lots of fun, and sometimes a  little, <br/>\nand sometimes the best part for them is the ride there and back, and the  <br/>\nfeeling that they did me a favor.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] how unscholing works","postDate":"1110157326","msgId":104214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMkJBODBFLjUwNDAxMDRAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGFkYmJiNjNjOGJiYzEzMjQ1NjZmNzZhMjkwMGVmZGE1QGVhcnRobGluay5uZXQ+","referencesHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4gPDY1NzMyOGVkOTBkY2ZlYzk1M2NkNzRhMGI1OTE0NzA2QGVhcnRobGluay5uZXQ+IDw0MjI4QTU1Ni4xMDIwMzA0QGVhcnRobGluay5uZXQ+IDxhZGJiYjYzYzhiYmMxMzI0NTY2Zjc2YTI5MDBlZmRhNUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":104201,"nextInTopic":104215,"prevInTime":104213,"nextInTime":104215,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"** Betsy? If you are doing nothing but waiting around for him to express an interest, not offering any input, how does he have a clue what there is available","messageBody":"<div id=\"ygrps-yiv-230016533\">**<br/>\n<br/>\nBetsy? If you are doing nothing but waiting around for him to express <br/>\nan interest, not offering any input, how does he have a clue what there <br/>\nis available in the world in which to express an interest?**<br/>\n<br/>\nI wasn&#39;t trying to say that I initiate nothing, just that it is a far cry from a fifty-fifty balance of me leading then him leading, which is what I thought your tango metaphor was expressing.<br/>\n<br/>\nI&#39;m still thinking about how to give him as much access to the whole wide world as he will take.  I will continue to consider your question abovr.  What he has abundantly are TV stations, library books, play dates, walks, interesting used stuff and time and freedom.  <br/>\n<br/>\nIt&#39;s not that we stay home all the time, it&#39;s that if I think we&#39;d both be happier with an outing then what I offer is a familiar and deeply enjoyed outing (park, friend&#39;s house, toy store, beach, aquarium) not an unfamiliar outing, since his willingness to be talked into trying something new is very low.  This is why I say I am not leading him in new directions or putting my efforts deliberately towards broadening him.<br/>\n<br/>\nSince I don&#39;t find his interests very similar to mine and find them sometimes hard to guess since he is fairly closemouthed, I don&#39;t have a great track record picking outings.  If I say &quot;Hey, I&#39;m sure it will be fabulous&quot;, he makes a skeptical face.  And I think it&#39;s reasonable for him to be skeptical.  It&#39;s not clear to me how to get past that.  When to try to sway him and when to fully accept his decision without argument.<br/>\n<br/>\nI think it would be incompatible with unschooling for me to insist on him going places when he declined.  I get advice from my conventional homeschooling friends to do that, but it seems like the wrong way to go.<br/>\n<br/>\nI&#39;m sure it isn&#39;t incompatible with unschooling for me to learn to be a better saleswoman. (If you&#39;ve seen cartoons showing how bad Dilbert is at salesmanship because he&#39;s the stereotypical engineer, that applies pretty well to me, too.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling com?","postDate":"1110106073","msgId":104201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFNTA0QTA4LjMxQUY3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGQzMDg3ZWIyMmE2MjdiZGIxNjBjNzM1NWFhYmVhZTM3QGVhcnRobGluay5uZXQ+"},"prevInTopic":104198,"nextInTopic":104214,"prevInTime":104200,"nextInTime":104202,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... Here s a link that will take you directly to the message boards: http://www.unschooling.info/forum/ Joyce","messageBody":"<div id=\"ygrps-yiv-901525736\">on 3/6/05 12:02 AM, Pam Sorooshian at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;unschooling.info&gt; is up and running!!!<br/>\n<br/>\n </span></blockquote>Here&#39;s a link that will take you directly to the message boards:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info/forum/\">http://www.unschooling.info/forum/</a><br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling com?","postDate":"1110093326","msgId":104198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDguNjNhMmJkMzMuMmY1YzA4MGVAYW9sLmNvbT4="},"prevInTopic":104196,"nextInTopic":104201,"prevInTime":104197,"nextInTime":104199,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"All the HEM sites are currently down, so my best guess (not having yet official confirmation) is that they are in the middle of or having trouble with the ","messageBody":"<div id=\"ygrps-yiv-1805003514\">All the HEM sites are currently down, so my best guess (not having yet <br/>\nofficial confirmation) is that they are in the middle of or having trouble with the <br/>\nplanned upgrade of the sites. Hopefully it&#39;ll all be up again sooner than it <br/>\nwas last august!<br/>\n<br/>\nDeborah<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling com?","postDate":"1110085351","msgId":104195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzMDg3ZWIyMmE2MjdiZGIxNjBjNzM1NWFhYmVhZTM3QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNC41YzQ0MzljYS4yZjViYjk0YUBhb2wuY29tPg==","referencesHeader":"PDEwNC41YzQ0MzljYS4yZjViYjk0YUBhb2wuY29tPg=="},"prevInTopic":104194,"nextInTopic":104196,"prevInTime":104194,"nextInTime":104196,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":" is up and running!!! Maybe this is a good time for people to go take a look there? -pam","messageBody":"<div id=\"ygrps-yiv-275356441\">&lt;unschooling.info&gt; is up and running!!!<br/>\n<br/>\nMaybe this is a good time for people to go take a look there?<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 5, 2005, at 5:39 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n&gt; Is the  unschooling.com site down, or is it just my puter?  I&#39;ve tried <br/>\n&gt; a<br/>\n&gt; couple  of times this afternoon, but get the &#39;site can&#39;t be found&#39; <br/>\n&gt; message.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --------------<br/>\n&gt;<br/>\n&gt; Down.<br/>\n&gt; Don&#39;t know why.<br/>\n&gt; Once it was down for a month.  Once for a half a day.  This is  the <br/>\n&gt; middlest<br/>\n&gt; &quot;down,&quot; then. <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":52507282,"authorName":"mkesinding","from":"&quot;mkesinding&quot; &lt;drbruce@...&gt;","profile":"mkesinding","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling com?","postDate":"1110077863","msgId":104196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwZHJqNytlbW5pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDUwMzA2MDEzNjMzLjk2OTY0LnFtYWlsQHdlYjUzODA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":104195,"nextInTopic":104198,"prevInTime":104195,"nextInTime":104197,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"I haven t been able to get on the message boards for two days.  I miss lurking -- I m starting to get lurkers withdrawal.  What s going on? Maria ... tried a","messageBody":"<div id=\"ygrps-yiv-510725044\">I haven&#39;t been able to get on the message boards for two days.  I <br/>\nmiss lurking -- I&#39;m starting to get lurkers withdrawal.  What&#39;s <br/>\ngoing on?<br/>\n<br/>\nMaria<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Sylvia Toyama <br/>\n&lt;sylgt04@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Is the unschooling.com site down, or is it just my puter?  I&#39;ve <br/>\n </span></blockquote>tried a couple of times this afternoon, but get the &#39;site can&#39;t be <br/>\nfound&#39; message.  <br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt; Sylvia<br/>\n&gt; <br/>\n&gt; \t\t<br/>\n&gt; ---------------------------------<br/>\n&gt; Celebrate Yahoo!&#39;s 10th Birthday! <br/>\n&gt;  Yahoo! Netrospective: 100 Moments of the Web <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling com?","postDate":"1110074613","msgId":104194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzA2MDIwMzMzLjI0NzU1LnFtYWlsQHdlYjUzODA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNC41YzQ0MzljYS4yZjViYjk0YUBhb2wuY29tPg=="},"prevInTopic":104193,"nextInTopic":104195,"prevInTime":104193,"nextInTime":104195,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"I remember it being down for a month.  We have a new computer, and the toolbars were doing weird things earlier... Syl ... Celebrate Yahoo! s 10th Birthday! ","messageBody":"<div id=\"ygrps-yiv-724249874\">I remember it being down for a month.  We have a new computer, and the toolbars were doing weird things earlier...<br/>\n <br/>\nSyl<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nCelebrate Yahoo!&#39;s 10th Birthday! <br/>\n Yahoo! Netrospective: 100 Moments of the Web <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling com?","postDate":"1110073926","msgId":104193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzA2MDE1MjA2LjIyMjY0LnFtYWlsQHdlYjUzODA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNC41YzQ0MzljYS4yZjViYjk0YUBhb2wuY29tPg=="},"prevInTopic":104192,"nextInTopic":104194,"prevInTime":104192,"nextInTime":104194,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"I remember it being down for a month.  We have a new computer, and the toolbars were doing weird things earlier... Syl ... Celebrate Yahoo! s 10th Birthday! ","messageBody":"<div id=\"ygrps-yiv-659911729\">I remember it being down for a month.  We have a new computer, and the toolbars were doing weird things earlier...<br/>\n <br/>\nSyl<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nCelebrate Yahoo!&#39;s 10th Birthday! <br/>\n Yahoo! Netrospective: 100 Moments of the Web <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling com?","postDate":"1110073162","msgId":104192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNC41YzQ0MzljYS4yZjViYjk0YUBhb2wuY29tPg=="},"prevInTopic":104191,"nextInTopic":104193,"prevInTime":104191,"nextInTime":104193,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/5/2005 6:38:21 PM Mountain Standard Time, sylgt04@yahoo.com writes: Is the  unschooling.com site down, or is it just my puter?  I ve tried","messageBody":"<div id=\"ygrps-yiv-1603066301\">In a message dated 3/5/2005 6:38:21 PM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a> writes:<br/>\n<br/>\nIs the  unschooling.com site down, or is it just my puter?  I&#39;ve tried a <br/>\ncouple  of times this afternoon, but get the &#39;site can&#39;t be found&#39; message.   <br/>\n<br/>\n<br/>\n--------------<br/>\n <br/>\nDown.<br/>\nDon&#39;t know why.<br/>\nOnce it was down for a month.  Once for a half a day.  This is  the middlest <br/>\n&quot;down,&quot; then.  <br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling com?","postDate":"1110072992","msgId":104191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzA2MDEzNjMzLjk2OTY0LnFtYWlsQHdlYjUzODA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGQwZGgzNis3bmZ0QGVHcm91cHMuY29tPg=="},"prevInTopic":104187,"nextInTopic":104192,"prevInTime":104190,"nextInTime":104192,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"Is the unschooling.com site down, or is it just my puter?  I ve tried a couple of times this afternoon, but get the site can t be found message. Sylvia ... ","messageBody":"<div id=\"ygrps-yiv-912264717\">Is the unschooling.com site down, or is it just my puter?  I&#39;ve tried a couple of times this afternoon, but get the &#39;site can&#39;t be found&#39; message.  <br/>\n <br/>\nSylvia<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nCelebrate Yahoo!&#39;s 10th Birthday! <br/>\n Yahoo! Netrospective: 100 Moments of the Web <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":120206043,"authorName":"averyschmidt","from":"&quot;averyschmidt&quot; &lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Not how unscholing works","postDate":"1110067110","msgId":104187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwZGgzNis3bmZ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk3YzQ4OWI0MzdhMDBlZTQyMjc1Zjg3OGRmNWI1OTk4QGVhcnRobGluay5uZXQ+"},"prevInTopic":104180,"nextInTopic":104191,"prevInTime":104186,"nextInTime":104188,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... (or ... input. I see what you re saying.  But those are all things (internet, tv, people, places, magazines) that would be there even if the child wasn t.","messageBody":"<div id=\"ygrps-yiv-1548745209\"><blockquote><span title=\"ireply\">&gt; &gt; but this may be a function of how many<br/>\n&gt; &gt; people are in the child&#39;s life besides Mom, whether or not cable <br/>\n </span></blockquote>(or<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; at least tv) is available, whether the internet is available,<br/>\n&gt; &gt; whether there are magazine subscriptions, whether the child is<br/>\n&gt; &gt; included on outings of various natures, etc.<br/>\n&gt; <br/>\n&gt; Those would all be examples of what I meant by parents providing <br/>\n </span></blockquote>input.<br/>\n<br/>\nI see what you&#39;re saying.  But those are all things (internet, tv, <br/>\npeople, places, magazines) that would be there even if the child <br/>\nwasn&#39;t.  I thought from Betsy&#39;s posts that she was referring more to <br/>\nspecial things gotten specifically to catch a child&#39;s interest... <br/>\nconscious input as opposed to input (like conversation) that&#39;s a by-<br/>\nproduct of living a busy life.<br/>\n<br/>\nMy energy as an unschooling mother ebbs and flows, with my higher <br/>\nenergy times resulting in more of the conscious type of input, but <br/>\nI&#39;ve found that even when I&#39;m exhausted or stressed for a while and <br/>\nnot doing much leading my kids go right on learning and discovering <br/>\nthings anyway.  I remember one time bringing a book of short <br/>\nbiographies home from the library thinking that it was important for <br/>\nme to &quot;expose&quot; my kids to these historical figures.  It turned out <br/>\nthat they already knew about many of them from a time travel cartoon <br/>\non cable. :-)<br/>\n  <br/>\nMany of my children&#39;s various passions over the years, while <br/>\nnurtured and supported by me, were definitely not introduced by me.  <br/>\n<br/>\nPatti</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Not how unscholing works","postDate":"1110050521","msgId":104180,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3YzQ4OWI0MzdhMDBlZTQyMjc1Zjg3OGRmNWI1OTk4QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGQwYnVqbytkNThhQGVHcm91cHMuY29tPg==","referencesHeader":"PGQwYnVqbytkNThhQGVHcm91cHMuY29tPg=="},"prevInTopic":104175,"nextInTopic":104187,"prevInTime":104179,"nextInTime":104181,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... Those would all be examples of what I meant by parents providing input. -pam","messageBody":"<div id=\"ygrps-yiv-926242679\">On Mar 5, 2005, at 1:36 AM, averyschmidt wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but this may be a function of how many<br/>\n&gt; people are in the child&#39;s life besides Mom, whether or not cable (or<br/>\n&gt; at least tv) is available, whether the internet is available,<br/>\n&gt; whether there are magazine subscriptions, whether the child is<br/>\n&gt; included on outings of various natures, etc.<br/>\n<br/>\n </span></blockquote>Those would all be examples of what I meant by parents providing input.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: School scene -- basis for comparison","postDate":"1110037435","msgId":104175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwY2szcit2bmpjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBJQ1UwME1ZMkJQNjJJTDBAdm1zMDQ0Lm1haWxzcnZjcy5uZXQ+"},"prevInTopic":104172,"nextInTopic":104180,"prevInTime":104174,"nextInTime":104176,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"I didn t have the patience to download the video (dial-up) but read the transcript, and some of the discussion about the incident. My thought is, how awful for","messageBody":"<div id=\"ygrps-yiv-1046952892\">I didn&#39;t have the patience to download the video (dial-up) but read <br/>\nthe transcript, and some of the discussion about the incident. My <br/>\nthought is, how awful for everyone concerned. They are stuck in an <br/>\ninhuman and inhumane system which has as its chief goal, to further <br/>\nitself. It isn&#39;t about educating kids, it&#39;s about keeping the system <br/>\ngoing. It&#39;s about mechanical efficiency. Somehow, applying <br/>\nthe &quot;science&quot; of efficiency to human beings, isn&#39;t working, in more <br/>\nways than disrespectful teenagers. <br/>\n<br/>\nblessings, HeidiC<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Julie&quot; <br/>\n&lt;julesmiel@v...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; For anyone interested in reliving a little bit of school life and<br/>\n&gt; recognizing how far you&#39;ve come, take a look at this brief video <br/>\n </span></blockquote>shot<br/>\n<blockquote><span title=\"ireply\"> &gt; through a student&#39;s mobile phone.  The teacher is awful, but I pity <br/>\n </span></blockquote>him at<br/>\n<blockquote><span title=\"ireply\"> &gt; the same time.  He&#39;s just so uselessly frustrated in a broken <br/>\n </span></blockquote>system.  It&#39;s<br/>\n<blockquote><span title=\"ireply\"> &gt; especially ironic how the scene ends as &quot;O&#39;er the land of the free&quot; <br/>\n </span></blockquote>is<br/>\n<blockquote><span title=\"ireply\"> &gt; playing in the background.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fatwallet.com/t/69/440608/\">http://www.fatwallet.com/t/69/440608/</a> <br/>\n&gt; (Click on the video link.)<br/>\n&gt; <br/>\n&gt; (Another slice of school life for you sociologists out there:  My <br/>\n </span></blockquote>husband is<br/>\n<blockquote><span title=\"ireply\"> &gt; still teaching because we haven&#39;t yet figured out how to earn <br/>\n </span></blockquote>enough money<br/>\n<blockquote><span title=\"ireply\"> &gt; from other sources, so he was especially interested in this.  In <br/>\n </span></blockquote>contrast to<br/>\n<blockquote><span title=\"ireply\"> &gt; the situation in this video, he said that about two people per day <br/>\n </span></blockquote>decide to<br/>\n<blockquote><span title=\"ireply\"> &gt; stand for the pledge of allegiance in his homeroom.)<br/>\n&gt; <br/>\n&gt; Julie in NY<br/>\n&gt; ________________________________________________<br/>\n&gt; <br/>\n&gt; &quot;Acquire the courage to believe in yourself. Many of the things <br/>\n </span></blockquote>that you<br/>\n<blockquote><span title=\"ireply\"> &gt; have been taught were at one time the radical ideas of individuals <br/>\n </span></blockquote>who had<br/>\n<blockquote><span title=\"ireply\"> &gt; the courage to believe what their own hearts and minds told them <br/>\n </span></blockquote>was true,<br/>\n<blockquote><span title=\"qreply\"> &gt; rather than accept the common beliefs of their day.&quot;<br/>\n&gt; -Ching Ning Chu<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingourselves/\">http://groups.yahoo.com/group/unschoolingourselves/</a>   </span></blockquote></div>","specialLinks":[]},{"userId":120206043,"authorName":"averyschmidt","from":"&quot;averyschmidt&quot; &lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Not how unscholing works","postDate":"1110015416","msgId":104172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwYnVqbytkNThhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGFkYmJiNjNjOGJiYzEzMjQ1NjZmNzZhMjkwMGVmZGE1QGVhcnRobGluay5uZXQ+"},"prevInTopic":104171,"nextInTopic":104175,"prevInTime":104171,"nextInTime":104173,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... initiating, ... interest ... express ... there ... I don t know how old Betsy s child is (what I m about to say may not apply to very young children) but","messageBody":"<div id=\"ygrps-yiv-1219978952\"><blockquote><span title=\"ireply\">&gt; &gt; (I&#39;m wanting to look more closely at the prior statement that<br/>\n&gt; &gt; unschooling parents do a substantial amount of leading or <br/>\n </span></blockquote>initiating,<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; whereas I think I mostly wait around for him to express an <br/>\n </span></blockquote>interest<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; before taking any action.)<br/>\n&gt; <br/>\n&gt; Betsy? If you are doing nothing but waiting around for him to <br/>\n </span></blockquote>express <br/>\n<blockquote><span title=\"ireply\"> &gt; an interest, not offering any input, how does he have a clue what <br/>\n </span></blockquote>there <br/>\n<blockquote><span title=\"ireply\"> &gt; is available in the world in which to express an interest?<br/>\n<br/>\n </span></blockquote>I don&#39;t know how old Betsy&#39;s child is (what I&#39;m about to say may not <br/>\napply to very young children) but this may be a function of how many <br/>\npeople are in the child&#39;s life besides Mom, whether or not cable (or <br/>\nat least tv) is available, whether the internet is available, <br/>\nwhether there are magazine subscriptions, whether the child is <br/>\nincluded on outings of various natures, etc.<br/>\n  <br/>\nIf a family has a rich, busy, involved life the parents don&#39;t <br/>\nnecessarily have to make an out-of-context-point to introduce <br/>\nsomething in order for a child to have access to it.  In fact, my <br/>\nchildren have introduced *me* to a few things along the way. :-)  <br/>\nThat&#39;s not to say that out-of-context introducing things isn&#39;t a <br/>\ngood thing, just that it&#39;s possible for children to discover things <br/>\nwithout their parents&#39; pointed intentions.<br/>\n<br/>\nPatti</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Not how unscholing works","postDate":"1110009979","msgId":104171,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFkYmJiNjNjOGJiYzEzMjQ1NjZmNzZhMjkwMGVmZGE1QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDQyMjhBNTU2LjEwMjAzMDRAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4gPDY1NzMyOGVkOTBkY2ZlYzk1M2NkNzRhMGI1OTE0NzA2QGVhcnRobGluay5uZXQ+IDw0MjI4QTU1Ni4xMDIwMzA0QGVhcnRobGluay5uZXQ+"},"prevInTopic":104170,"nextInTopic":104172,"prevInTime":104170,"nextInTime":104172,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... Betsy? If you are doing nothing but waiting around for him to express an interest, not offering any input, how does he have a clue what there is available","messageBody":"<div id=\"ygrps-yiv-31574977\">On Mar 4, 2005, at 10:13 AM, Elizabeth Hill wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (I&#39;m wanting to look more closely at the prior statement that<br/>\n&gt; unschooling parents do a substantial amount of leading or initiating,<br/>\n&gt; whereas I think I mostly wait around for him to express an interest<br/>\n&gt; before taking any action.)<br/>\n<br/>\n </span></blockquote>Betsy? If you are doing nothing but waiting around for him to express <br/>\nan interest, not offering any input, how does he have a clue what there <br/>\nis available in the world in which to express an interest?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Not how unscholing works","postDate":"1110001674","msgId":104170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDQyMjhBNTU2LjEwMjAzMDRAZWFydGhsaW5rLm5ldD4="},"prevInTopic":104169,"nextInTopic":104171,"prevInTime":104169,"nextInTime":104171,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1799195430\">&lt;&lt;&lt;&lt;&lt;You know, this is going to sound unimaginable, but since we moved <br/>\nrecently ...snip... I would say that seventy or eighty percent of the time<br/>\nhe doesn&#39;t want to go to new places. Maybe the answer there is always to<br/>\nhave someone to go with, so he can have some kid companionship.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nMaybe he is just taking a longer time than some other family members to<br/>\nsettle in, emotionally, to the new location.<br/>\n <br/>\n&lt;&lt;&lt;&lt;&lt;We did a big outing to the Monterey Aquarium during the three day <br/>\nweekend, but that&#39;s an &quot;old&quot; place for us.  We bought a membership and <br/>\ntold our friends that any time they wanted to go we would carpool down <br/>\nwith them.  (We may not go to another &quot;museum&quot; for four months.)&gt;&gt;&gt;&gt;<br/>\n<br/>\nWe were just there too. And we also bought a membership. There is a nature<br/>\nmuseum in Redding, CA that has a huge number of reciprocal memberships all<br/>\nover the country. It is called Turtle Bay, and the membership seems<br/>\ncomparatively inexpensive. <br/>\n<br/>\nThere is a very cool newt in the film &quot;Matilda&quot;. (Just some &quot;unconnected&quot;<br/>\ntrivia.)<br/>\n<br/>\n&lt;&lt;&lt;&lt;(Neither of them would be panting by the <br/>\ndoor, like dogs that want to walk to the park, which is the kind of <br/>\nenthusiastic response to theater that I imagine some people may get.<br/>\n&lt;g&gt;)&gt;&gt;&gt;&gt;<br/>\n<br/>\nAs someone who has worked in the theater at all levels for most of my<br/>\nprofessional life, and really loved the life, I finally had to accept that I<br/>\nwas, nonetheless, *not* a theater-goer. Maybe he would be interested in<br/>\nworking in a theater rather than seeing it.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;My husband&#39;s idea <br/>\nof viewing pleasure is to surf and watch whatever *he wants* (normally <br/>\nthe History Channel), not anything that I have picked.&gt;&gt;&gt;&gt;<br/>\n<br/>\nAha! My husband&#39;s long lost twin separated at birth!!!<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;Unschooling at my house is so different from unschooling at your house<br/>\n<br/>\nthat I&#39;m not sure that what I do could possibly still be unschooling.<br/>\n<br/>\nBetsy (under dark rainy clouds today) &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nDear Betsy, the clouds will pass (maybe they already have). We have all been<br/>\nreading your posts for long enough to know that you are unschooling (unless<br/>\nyou have secretly instituted some kind of imposed lesson regime that you are<br/>\nkeeping from us). One great brilliance of Unschooling is that it does look<br/>\ndifferent in everyone&#39;s home, and with each individual child - but the<br/>\nfreedom is still there - even the freedom to grump about and not seem to be<br/>\ninto much just now. <br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.300 / Virus Database: 266.6.0 - Release Date: 3/2/2005</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Not how unscholing works","postDate":"1110000732","msgId":104169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDQyMjhDMzMyLjEwNDA1MDRAZWFydGhsaW5rLm5ldD4="},"prevInTopic":104150,"nextInTopic":104170,"prevInTime":104168,"nextInTime":104170,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1443072986\">&lt;&lt;&lt;&lt;&lt;There are a lot of books donated from townspeople and the library<br/>\ndoesn&#39;t normally shelve them.  There are a lot of affluent people in this<br/>\ntown who buy their kids books.  But the selection does skew towards fiction.<br/>\nThe really bells-and-whistles fun nonfiction (i.e. Excavate your own mummy!)<br/>\ndoesn&#39;t tend to show up.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhat is wrong with fiction? Is this an anti-fiction/pro-&quot;educational&quot; book<br/>\nbias of yours showing up, or did I miss some important piece of info in a<br/>\nprior post regarding your ds&#39;s book preferences? (The latter perfectly<br/>\npossible as I am trying to clear a backlog).<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.300 / Virus Database: 266.6.0 - Release Date: 3/2/2005</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Not how unscholing works","postDate":"1109974977","msgId":104150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmQwMWM1MjEwOCRkYTQ0OTViMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4gPDY1NzMyOGVkOTBkY2ZlYzk1M2NkNzRhMGI1OTE0NzA2QGVhcnRobGluay5uZXQ+IDw0MjI4QTU1Ni4xMDIwMzA0QGVhcnRobGluay5uZXQ+"},"prevInTopic":104147,"nextInTopic":104169,"prevInTime":104149,"nextInTime":104151,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... Sometimes, but not often.  He wants to make his own selections. Jackie (9) usually prefers to see a movie or read a book that she has already","messageBody":"<div id=\"ygrps-yiv-68930153\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;**Do you watch tv and movies together at your suggestion? **<br/>\n<br/>\n </span></blockquote>Sometimes, but not often.  He wants to make his own selections.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nJackie (9) usually prefers to see a movie or read a book that she has already experienced.  So when I ask if she wants to watch a movie of my choosing, she usually says no.<br/>\n<br/>\nIf it&#39;s a movie I want to see, I put it in for me.  Sometimes she&#39;ll end up watching and sometimes not.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Not how unscholing works","postDate":"1109967666","msgId":104145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMjhDMzMyLjEwNDA1MDRAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDFlNC4zNjVhNTk2MS4yZjVhMGY1MUBhb2wuY29tPg==","referencesHeader":"PDFlNC4zNjVhNTk2MS4yZjVhMGY1MUBhb2wuY29tPg=="},"prevInTopic":104144,"nextInTopic":104147,"prevInTime":104144,"nextInTime":104146,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"** -=-I can t get anyone to consent to watch either of these with  me.  (But we ve only had them 3-4 days, so maybe I m giving up too  soon.) -=- Put it on.","messageBody":"<div id=\"ygrps-yiv-757628821\">**<br/>\n<br/>\n-=-I can&#39;t <br/>\nget anyone to consent to watch either of these with  me.  (But we&#39;ve only <br/>\nhad them 3-4 days, so maybe I&#39;m giving up too  soon.) -=-<br/>\n <br/>\nPut it on.  Do something in the room where it is. **<br/>\n<br/>\nThe things that I want to do aren&#39;t in the room where it is.  Maybe that&#39;s a structural part of the problem.  (Yeah, I could move the clean laundry from the room with the TV and VCR into the room (living room) with the TV and the DVD player.<br/>\n<br/>\n**Is it better than school?**<br/>\n<br/>\nYes.<br/>\n<br/>\n**Are you doing as well as you can do?**<br/>\n<br/>\nNo.<br/>\n<br/>\n**Can you find ways to be perkier and less negative?**<br/>\n<br/>\nIt&#39;s been a bad week.  I&#39;m starting to think about Prozac.<br/>\n<br/>\n**Yes, sometimes there are good books at library book sales, I know.  **<br/>\n<br/>\nThere are a lot of books donated from townspeople and the library doesn&#39;t normally shelve them.  There are a lot of affluent people in this town who buy their kids books.  But the selection does skew towards fiction.  The really bells-and-whistles fun nonfiction (i.e. Excavate your own mummy!) doesn&#39;t tend to show up.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":140747339,"authorName":"Jen A","from":"Jen A &lt;salten@...&gt;","profile":"brownaltenbach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Not how unscholing works","postDate":"1109967095","msgId":104147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMjhDMEY3LjQwMzAxMDZAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDQyMjhBNTU2LjEwMjAzMDRAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4gPDY1NzMyOGVkOTBkY2ZlYzk1M2NkNzRhMGI1OTE0NzA2QGVhcnRobGluay5uZXQ+IDw0MjI4QTU1Ni4xMDIwMzA0QGVhcnRobGluay5uZXQ+"},"prevInTopic":104145,"nextInTopic":104150,"prevInTime":104146,"nextInTime":104148,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... Hi Betsy, Have you looked to see if there is a freecycle group near you?  People are always giving away books, household items, etc.  If you can get stuff","messageBody":"<div id=\"ygrps-yiv-89684633\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt; PS  Balancing all the negative with a positive example, I did grab a<br/>\n&gt; book of Optical Illusions at last month&#39;s library booksale and James and<br/>\n&gt; Rick spent a lot of time looking at this together.  This type of<br/>\n&gt; activity-oriented book isn&#39;t commonly found at booksales, which is what<br/>\n&gt; made me start pondering what I might be missing by not going to<br/>\n&gt; full-price bookstores.  At last months library sale, I did buy for James<br/>\n&gt; (or for our collection) -- The Whipping Boy, Coraline, I Was a Rat,<br/>\n&gt; Artemis Fowl, Midnight for Charlie Bone, and a Star Wars graphic novel. <br/>\n&gt; All 35 cents a piece.  We are fortunate to be able to get cool stuff<br/>\n&gt; like this at a price where I can say &quot;I don&#39;t care if we EVER read this<br/>\n&gt; or not&quot;.  I also bought eight princessy or historically set books for a<br/>\n&gt; friend&#39;s daughter&#39;s birthday at the same sale.<br/>\n<br/>\n<br/>\n </span></blockquote>Hi Betsy,<br/>\nHave you looked to see if there is a freecycle group near you?  People <br/>\nare always giving away books, household items, etc.  If you can get <br/>\nstuff for free, you can definitely not worry if he is going to use it or <br/>\nnot.  I&#39;ve seen things like craft supplies, old magazines, building <br/>\nmaterials, games, toys, puzzles, clothes, furniture--you name it!<br/>\n<br/>\nwww.freecycle.org<br/>\n<br/>\nJenny</div>","specialLinks":[]},{"userId":135609248,"authorName":"julie w","from":"julie w &lt;jjjwoolfolk@...&gt;","profile":"juliewinar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Not how unscholing works","postDate":"1109966643","msgId":104144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMjhCRjMzLjYwNjAxQHNiY2dsb2JhbC5uZXQ+","inReplyToHeader":"PDQyMjhBNTU2LjEwMjAzMDRAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4gPDY1NzMyOGVkOTBkY2ZlYzk1M2NkNzRhMGI1OTE0NzA2QGVhcnRobGluay5uZXQ+IDw0MjI4QTU1Ni4xMDIwMzA0QGVhcnRobGluay5uZXQ+"},"prevInTopic":104142,"nextInTopic":104145,"prevInTime":104143,"nextInTime":104145,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... We so, so sosososos love this book. It gave me nightmares. My website is called The Other Mother.... Julie W ... No virus found in this outgoing message. ","messageBody":"<div id=\"ygrps-yiv-573193497\">Elizabeth Hill wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    Coraline,<br/>\n<br/>\n </span></blockquote>We so, so sosososos love this book.<br/>\nIt gave me nightmares.<br/>\nMy website is called The Other Mother....<br/>\nJulie W<br/>\n<br/>\n  ----------<br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.308 / Virus Database: 266.6.0 - Release Date: 3/2/2005<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Not how unscholing works","postDate":"1109964113","msgId":104140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlNC4zNjVhNTk2MS4yZjVhMGY1MUBhb2wuY29tPg=="},"prevInTopic":104132,"nextInTopic":104142,"prevInTime":104139,"nextInTime":104141,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/4/2005 11:21:47 AM Mountain Standard Time, ecsamhill@earthlink.net writes: -=-I  just need to convert my good intention to action, without","messageBody":"<div id=\"ygrps-yiv-1583685852\">In a message dated 3/4/2005 11:21:47 AM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n-=-I  just need <br/>\nto convert my good intention to action, without any upfront  enthusiasm <br/>\nfrom my kid or my spouse.-=-<br/>\n<br/>\n<br/>\n===================<br/>\n <br/>\nYes, with much upfront enthusiasm from you!<br/>\n <br/>\n<br/>\n**Do you tell him about your childhood?**<br/>\n-=-Not a lot.  We  don&#39;t talk much.  He doesn&#39;t seem interested in talking <br/>\nto me.   Even in the car.  But if I sit with him and watch television for <br/>\nan  hour (as Sandra has recommended) sometimes words to start leaking out <br/>\nof  him.-=-<br/>\n <br/>\nIf it takes an hour for him to start talking, consider this:<br/>\nPlan two hours.<br/>\nDo non-verbal things instead of watching TV if you want talking to  happen.  <br/>\nDrive around.  Work puzzles.  Mess with something.<br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck_\">http://sandradodd.com/truck_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck)\">http://sandradodd.com/truck)</a> <br/>\n <br/>\n-=- We have <br/>\nfinally run through everything he wanted from  Netflix,-=-<br/>\n <br/>\nEverything he wanted when he looked at their list in one way in one  season?<br/>\n <br/>\nNetflix has over 35,000 DVDs.  I doubt he&#39;s seen 100 of them.  <br/>\nThey get hundreds of new ones every month.  How did you come to  &quot;finally&quot;?<br/>\n <br/>\n-=-I can&#39;t <br/>\nget anyone to consent to watch either of these with  me.  (But we&#39;ve only <br/>\nhad them 3-4 days, so maybe I&#39;m giving up too  soon.) -=-<br/>\n <br/>\nPut it on.  Do something in the room where it is.  Maybe someone  will come <br/>\nand join you.  Be willing to start it over, or to pause and  summarize what he <br/>\nmissed.  Or watch it alone, and tell each person what you  saw that you <br/>\nthought they would like.  If they watch it, you can talk about  it.  If not, send it <br/>\nback.<br/>\n <br/>\nIf you&#39;re only going to have fun or feel successful if they do something  <br/>\nwith you, that&#39;s a kind of codependency.<br/>\n <br/>\n-=-Unschooling at my house is so different from unschooling at your house  <br/>\nthat I&#39;m not sure that what I do could possibly still be  unschooling.-=-<br/>\n <br/>\nIs it better than school?<br/>\nAre you doing as well as you can do?<br/>\nCan you find ways to be perkier and less negative?<br/>\nWould he be better off in school?<br/>\n <br/>\n-=-type of <br/>\nactivity-oriented book isn&#39;t commonly found at booksales,  which is what <br/>\nmade me start pondering what I might be missing by not going  to <br/>\nfull-price bookstores. -=-<br/>\n <br/>\nYou could at least LOOK at full-price bookstores and maybe look then on  <br/>\namazon for a used copy of something you liked.<br/>\n <br/>\nPeople shouldn&#39;t try to unschool for free.  Seriously, having a kid in  <br/>\nschool costs money, even a public school.  There are expenses.  Not  spending ANY <br/>\nmoney on things for a kid could be neglectful.<br/>\n <br/>\n-=-We are fortunate to be able to get cool stuff <br/>\nlike this at a price  where I can say &quot;I don&#39;t care if we EVER read this <br/>\nor not&quot;. -=-<br/>\n <br/>\nBut the books in that pile are there because the library didn&#39;t want to  <br/>\nbother to put them in the library, right?  Someone donated it to the  library <br/>\n(rejected it) and the library sold it cheap (rejected it).  Maybe  twice-rejected <br/>\nbook sales isn&#39;t the best use of your time.<br/>\n <br/>\nYes, sometimes there are good books at library book sales, I know.   <br/>\nLibraries will jettison books for not having been checked out or for being no  longer <br/>\non the recommended lists.  Those books are old, though, and  something is <br/>\nwrong with them one way or another.  I own pretty many ex  library books, so I&#39;m <br/>\nnot condemning them as a class of books, but it&#39;s not the  best pile to dig <br/>\nthrough in general.<br/>\n <br/>\nSandra<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180118032,"authorName":"Julie","from":"&quot;Julie&quot; &lt;julesmiel@...&gt;","profile":"julesmiel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"School scene -- basis for comparison","postDate":"1109961397","msgId":104142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBJQ1UwME1ZMkJQNjJJTDBAdm1zMDQ0Lm1haWxzcnZjcy5uZXQ+","inReplyToHeader":"PGQwODJqdCtscmRuQGVHcm91cHMuY29tPg=="},"prevInTopic":104140,"nextInTopic":104144,"prevInTime":104141,"nextInTime":104143,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"For anyone interested in reliving a little bit of school life and recognizing how far you’ve come, take a look at this brief video shot through a student’s","messageBody":"<div id=\"ygrps-yiv-1168759001\">For anyone interested in reliving a little bit of school life and<br/>\nrecognizing how far youve come, take a look at this brief video shot<br/>\nthrough a students mobile phone.  The teacher is awful, but I pity him at<br/>\nthe same time.  Hes just so uselessly frustrated in a broken system.  It&#39;s<br/>\nespecially ironic how the scene ends as &quot;O&#39;er the land of the free&quot; is<br/>\nplaying in the background.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fatwallet.com/t/69/440608/\">http://www.fatwallet.com/t/69/440608/</a> <br/>\n(Click on the video link.)<br/>\n<br/>\n(Another slice of school life for you sociologists out there:  My husband is<br/>\nstill teaching because we havent yet figured out how to earn enough money<br/>\nfrom other sources, so he was especially interested in this.  In contrast to<br/>\nthe situation in this video, he said that about two people per day decide to<br/>\nstand for the pledge of allegiance in his homeroom.)<br/>\n<br/>\nJulie in NY<br/>\n________________________________________________<br/>\n<br/>\n&quot;Acquire the courage to believe in yourself. Many of the things that you<br/>\nhave been taught were at one time the radical ideas of individuals who had<br/>\nthe courage to believe what their own hearts and minds told them was true,<br/>\nrather than accept the common beliefs of their day.&quot;<br/>\n-Ching Ning Chu<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingourselves/\">http://groups.yahoo.com/group/unschoolingourselves/</a>  </div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Not how unscholing works","postDate":"1109960022","msgId":104132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMjhBNTU2LjEwMjAzMDRAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDY1NzMyOGVkOTBkY2ZlYzk1M2NkNzRhMGI1OTE0NzA2QGVhcnRobGluay5uZXQ+","referencesHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4gPDY1NzMyOGVkOTBkY2ZlYzk1M2NkNzRhMGI1OTE0NzA2QGVhcnRobGluay5uZXQ+"},"prevInTopic":104118,"nextInTopic":104140,"prevInTime":104131,"nextInTime":104133,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"Do you never hear about a place to go and suggest it? Do you not have conversations in which you offer information and ideas? Do you tell him about your","messageBody":"<div id=\"ygrps-yiv-1590012917\">Do you never hear about a place to go and suggest it? Do you not have <br/>\nconversations in which you offer information and ideas? Do you tell him <br/>\nabout your childhood? Do you read books and suggest ones he might like? <br/>\nDo you watch tv and movies together at your suggestion? If you&#39;re in the <br/>\ngrocery store and you notice cactus candy do you not point it out to him <br/>\nand maybe buy a bit to have a taste?**<br/>\n<br/>\n<br/>\n(I&#39;m wanting to look more closely at the prior statement that <br/>\nunschooling parents do a substantial amount of leading or initiating, <br/>\nwhereas I think I mostly wait around for him to express an interest <br/>\nbefore taking any action.)<br/>\n<br/>\nIt&#39;s fairly uncommon for me to buy anything for him that costs more than <br/>\n$3 that he hasn&#39;t pre-approved.  Because he has shown himself to be <br/>\nquite selective about what he&#39;ll approach, it seems like a waste of <br/>\nmoney to bring something home if there seems to be only a 25% chance he <br/>\nwill like it.  (Having more kids and having more positive kids would <br/>\nchange the cost-benefit picture, I think).  Having three kids who like <br/>\nsay 50% of all well-selected new things could raise one&#39;s likely success <br/>\nrate to 87.5%)  (Right?)<br/>\n<br/>\nWhen I am *following* his lead, and going with interests that I know he <br/>\nhas (e.g. Garfield books), then I&#39;d probably buy it.  But, to me, that <br/>\nfits in the category of waiting until he has an interest and then <br/>\nsupporting it.  It isn&#39;t me initiating something *new*.  The whole idea <br/>\nof broadening his horizons and cultivating new interests feels <br/>\nmysterious and undoable to me.  Maybe because I just am not willing to <br/>\nstrike out that often.  (&quot;If at first you don&#39;t succeed, try, try again&quot; <br/>\nis a tough philosophy for me to embrace.)<br/>\n<br/>\nSince we aren&#39;t in stores often, because he dislikes shopping, it&#39;s not <br/>\nthat common for us to even see cool new stuff.  (Remember we aren&#39;t <br/>\ngetting to museums with any frequency, so we aren&#39;t getting to museum <br/>\ngift shops either.)  We aren&#39;t even seeing cool books, games and <br/>\nthingies at Barnes and Noble, because we don&#39;t go there.  We try to get <br/>\nall of our books at the library and at library book sales, because that <br/>\nis what fits our restricted budget.<br/>\n<br/>\nYou know, this is going to sound unimaginable, but since we moved <br/>\nrecently and signed up with the direct marketing preference thingie to <br/>\nreduce junk mail, we don&#39;t even get homeschooling and toy catalogs in my <br/>\nhouse!  (We find out about cool new things when our better-informed <br/>\nfriends give us birthday presents.  &quot;Hey, I&#39;ve never seen one of <br/>\nthese!&quot;)  (I think we did get catalogs in December, but don&#39;t get very <br/>\nmany.)<br/>\n<br/>\n**Do you never hear about a place to go and suggest it?**<br/>\n<br/>\nI would say that seventy or eighty percent of the time he doesn&#39;t want <br/>\nto go to new places. Maybe the answer there is always to have someone to <br/>\ngo with, so he can have some kid companionship. <br/>\n<br/>\nOf the things that our co-op group talked about doing this year, the one <br/>\nthat he was enthusiastic about was going on a newt walk.  Unfortunately, <br/>\nrain and illnesses and birthday parties have postponed this for many weeks.<br/>\n<br/>\nWe did a big outing to the Monterey Aquarium during the three day <br/>\nweekend, but that&#39;s an &quot;old&quot; place for us.  We bought a membership and <br/>\ntold our friends that any time they wanted to go we would carpool down <br/>\nwith them.  (We may not go to another &quot;museum&quot; for four months.)<br/>\n<br/>\nI&#39;ve been thinking about going to the theater, but am often discouraged <br/>\nby the ticket prices.  (even if only multiplied by three people)  *I do <br/>\nneed a better planning method*, though.  I got an email last week that <br/>\nthe local community college is doing &quot;Seussical&quot;, and that seems like a <br/>\ngood combination of kid-appeal, convenience, and low cost.  I just need <br/>\nto convert my good intention to action, without any upfront enthusiasm <br/>\nfrom my kid or my spouse.  (Neither of them would be panting by the <br/>\ndoor, like dogs that want to walk to the park, which is the kind of <br/>\nenthusiastic response to theater that I imagine some people may get. &lt;g&gt;)<br/>\n<br/>\n**Do you tell him about your childhood?**<br/>\n<br/>\nNot a lot.  We don&#39;t talk much.  He doesn&#39;t seem interested in talking <br/>\nto me.  Even in the car.  But if I sit with him and watch television for <br/>\nan hour (as Sandra has recommended) sometimes words to start leaking out <br/>\nof him.<br/>\n<br/>\n**Do you watch tv and movies together at your suggestion? **<br/>\n<br/>\nSometimes, but not often.  He wants to make his own selections.  (I do <br/>\nTiVo things that I think he might possibly be interested in.)  We have <br/>\nfinally run through everything he wanted from Netflix, so when I saw <br/>\nthat Mork and Mindy was being released, I picked that for him. (He loves <br/>\ncomedy and television and space, and pretty much everybody loves Robin <br/>\nWilliams.)  That was a big hit.  Currently we also have out Children of <br/>\nHeaven (because I heard it was good) and The Right Stuff (which dh and I <br/>\nhave already seen, but thought James would find interesting.)  I can&#39;t <br/>\nget anyone to consent to watch either of these with me.  (But we&#39;ve only <br/>\nhad them 3-4 days, so maybe I&#39;m giving up too soon.)  My husband&#39;s idea <br/>\nof viewing pleasure is to surf and watch whatever *he wants* (normally <br/>\nthe History Channel), not anything that I have picked.  With two TVs, we <br/>\nfind ourselves in separate rooms a lot.  All of us would rather be alone <br/>\nthan be &quot;stuck&quot; watching something we don&#39;t find appealing.<br/>\n<br/>\nUnschooling at my house is so different from unschooling at your house <br/>\nthat I&#39;m not sure that what I do could possibly still be unschooling.<br/>\n<br/>\nBetsy (under dark rainy clouds today)<br/>\n<br/>\nPS  Balancing all the negative with a positive example, I did grab a <br/>\nbook of Optical Illusions at last month&#39;s library booksale and James and <br/>\nRick spent a lot of time looking at this together.  This type of <br/>\nactivity-oriented book isn&#39;t commonly found at booksales, which is what <br/>\nmade me start pondering what I might be missing by not going to <br/>\nfull-price bookstores.  At last months library sale, I did buy for James <br/>\n(or for our collection) -- The Whipping Boy, Coraline, I Was a Rat, <br/>\nArtemis Fowl, Midnight for Charlie Bone, and a Star Wars graphic novel.  <br/>\nAll 35 cents a piece.  We are fortunate to be able to get cool stuff <br/>\nlike this at a price where I can say &quot;I don&#39;t care if we EVER read this <br/>\nor not&quot;.  I also bought eight princessy or historically set books for a <br/>\nfriend&#39;s daughter&#39;s birthday at the same sale.</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Not how unscholing works","postDate":"1109913059","msgId":104118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1NzMyOGVkOTBkY2ZlYzk1M2NkNzRhMGI1OTE0NzA2QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4="},"prevInTopic":104110,"nextInTopic":104132,"prevInTime":104117,"nextInTime":104119,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"... So - do you never see something in a store and think, Oh I should get that for my son? Do you never hear about a place to go and suggest it? Do you not","messageBody":"<div id=\"ygrps-yiv-757477924\">On Mar 3, 2005, at 2:04 PM, Elizabeth Hill wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m very available to my kid and very responsive to him, but I&#39;m not<br/>\n&gt; sure if much of anything at my house is &quot;parent led&quot;.<br/>\n<br/>\n </span></blockquote>So - do you never see something in a store and think, &quot;Oh I should get <br/>\nthat for my son?&quot;<br/>\nDo you never hear about a place to go and suggest it? Do you not have <br/>\nconversations in which you offer information and ideas? Do you tell him <br/>\nabout your childhood? Do you read books and suggest ones he might like? <br/>\nDo you watch tv and movies together at your suggestion? If you&#39;re in <br/>\nthe grocery store and you notice cactus candy do you not point it out <br/>\nto him and maybe buy a bit to have a taste?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Not how unscholing works","postDate":"1109890706","msgId":104110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM0LjIyNTc0NGUzLjJmNThmMDkyQGFvbC5jb20+"},"prevInTopic":104109,"nextInTopic":104118,"prevInTime":104109,"nextInTime":104111,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/3/2005 5:33:58 P.M. Eastern Standard Time, ... together (and  hopefully still are but it is especially evident in the first bloom of a","messageBody":"<div id=\"ygrps-yiv-1006811693\">In a message dated 3/3/2005 5:33:58 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debra.rossing@...\">debra.rossing@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Think about when you and spouse/SO were first <br/>\n </span></blockquote>together (and  hopefully still are but it is especially evident in <br/>\nthe first bloom of a  relationship) - if she/he discovered a love for <br/>\nbig band music, you&#39;d keep  your ears open for concerts in your area, <br/>\nyou&#39;d pick up books and CDs if  you spotted something and sometimes <br/>\neven go  &lt;&lt;<br/>\n<br/>\n<br/>\nI love this explanation.    I can think of several people  that I&#39;ve tried to <br/>\nexplain unschooling to that just didn&#39;t grasp what I  was saying.  I think <br/>\nthey would understand this.  In particular,  I&#39;m thinking about my ex-husband <br/>\nwho seems very open to our lifestyle but  really isn&#39;t grasping what we do <br/>\naround here.  I&#39;ll add it to my  repertoire of explanations for people who seem <br/>\nsincerely interested in  unschooling or at least in what in the world we&#39;re doing <br/>\naround here! :-)<br/>\n <br/>\nGail<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Not how unscholing works","postDate":"1109888445","msgId":104109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwODJqdCtscmRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4="},"prevInTopic":104108,"nextInTopic":104110,"prevInTime":104108,"nextInTime":104110,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"Sometimes the illustration of respectful parenting that is used is would you say/do that with your spouse/SO/best friend? I think in some ways you might","messageBody":"<div id=\"ygrps-yiv-1073039331\">Sometimes the illustration of respectful parenting that is used <br/>\nis &quot;would you say/do that with your spouse/SO/best friend?&quot; I think <br/>\nin some ways you might extend that to this topic too (but don&#39;t <br/>\nstretch it too far). Think about when you and spouse/SO were first <br/>\ntogether (and hopefully still are but it is especially evident in <br/>\nthe first bloom of a relationship) - if s/he discovered a love for <br/>\nbig band music, you&#39;d keep your ears open for concerts in your area, <br/>\nyou&#39;d pick up books and CDs if you spotted something and sometimes <br/>\neven go the extra mile to get something that you knew would be &quot;just <br/>\nright&quot;. You didn&#39;t &quot;instruct&quot; in the finer points of big band music <br/>\nor &quot;study&quot; the social and economic situations of the times, you <br/>\ndidn&#39;t require the interest to last x amount of time or go to y <br/>\ndepth and didn&#39;t require some z level of mastery of the subject. You <br/>\nsupported and enjoyed their enjoyment until that interest passed <br/>\nperhaps or perhaps it became a permanent fixture at your home. I <br/>\nthink in many ways that&#39;s the way it works with our kids too - the <br/>\nmain difference being their dependence on us for things like money <br/>\nand transportation. And, for an adult you might pick up something <br/>\nand say Gee this looks like something s/he might like? and you bring <br/>\nit around and they like it or not and that&#39;s that - you don&#39;t try to <br/>\nmake them do or use or like whatever it is. And it might sit around <br/>\na bit until it gets looked at, and it&#39;s generally okay, adult to <br/>\nadult (I know I&#39;ve bought books and things for DH and it was quite a <br/>\nwhile before he touched them and sometimes they just aren&#39;t a good <br/>\nfit at all).</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Not how unscholing works","postDate":"1109887462","msgId":104108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMjc4OUU2LjkwMDAzMDRAZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":104109,"prevInTime":104107,"nextInTime":104109,"topicId":104108,"numMessagesInTopic":0,"msgSnippet":"**I don t consider unschooling to be accurately characterized as child-led learning - I think that expression is part of the difficulty we unschoolers have","messageBody":"<div id=\"ygrps-yiv-83663525\">**I don&#39;t consider unschooling to be accurately characterized as<br/>\n&quot;child-led learning&quot; - I think that expression is part of the<br/>\ndifficulty we unschoolers have in getting the idea across, in fact.<br/>\n<br/>\nAs Tammy said in the below paragraph - unschooling is very<br/>\nparent-involved. It is more of a &quot;learning tango&quot; &lt;G&gt; where parents and<br/>\nchildren interact and their ideas and energies and voices and<br/>\nactivities intertwine. We could think of it as a dance in which<br/>\nsometimes one leads and sometimes the other - but, really, most of the<br/>\ntime it isn&#39;t that one leads - they simply move together. I think the<br/>\nidea of the children &quot;leading&quot; can be misleading and confuse people&#39;s<br/>\nunderstanding of unschooling.<br/>\n<br/>\nSomebody asked me today, &quot;So, do you just sit there and wait until your<br/>\nchild says they want to learn about something? And then you figure out<br/>\nhow teach it to them?&quot;<br/>\n<br/>\nThat is so NOT how unschooling works - but I can see how people would<br/>\nthink that when they hear &quot;child-led learning.&quot;<br/>\n<br/>\n-pam**<br/>\n<br/>\n<br/>\nPam, do you mind me dragging this over (from the HSC list) and using it <br/>\nas a conversation starter here?<br/>\n<br/>\nI&#39;m very available to my kid and very responsive to him, but I&#39;m not <br/>\nsure if much of anything at my house is &quot;parent led&quot;.  I don&#39;t know if <br/>\nthis is my natural temperament, or a carefully evolved strategy that <br/>\nsuits my child, or my exaggerated fear of committing an unschooling <br/>\n&quot;sin&quot; by pushing to hard.  (It could even be poor recollection on my <br/>\npart.  Maybe my softshoe shuffle really is like a tango. &lt;g&gt;)<br/>\n<br/>\nIn the absence of an expressed interest from my child, I find it hard to <br/>\nknow what to do other than go to the park, visit friends, or hang out <br/>\naround the house.  Really.  But my kid strongly prefers staying home <br/>\nover going out and having adventures, so maybe I&#39;m just being respectful <br/>\nof his wishes.<br/>\n<br/>\nMaybe I&#39;m just not seeing the trees for the forest, or something.  But <br/>\nsometimes I think I am doing this all wrong because it doesn&#39;t resemble <br/>\nthe pictures I get of other people&#39;s lives.<br/>\n<br/>\nCould you paint some footprints on the floor for me and the other <br/>\nremedial unschoolers?  &lt;g&gt;<br/>\n<br/>\nThanks,<br/>\nBetsy</div>","specialLinks":[]}],"prevTopicId":104103,"nextTopicId":103216}}