{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] This is starting to feel like fun!","postDate":"1242823835","msgId":45322,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhmNzRiNzg3ZDk3MzcxODU4ZWIwMDQyYjc3ODAzOWZkQGdtYWlsLmNvbT4=","inReplyToHeader":"PGd1dmRuNitnY28wQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1dmRuNitnY28wQGVHcm91cHMuY29tPg=="},"prevInTopic":45320,"nextInTopic":0,"prevInTime":45321,"nextInTime":45323,"topicId":45320,"numMessagesInTopic":0,"msgSnippet":"... computer.  We looked at LOL Cats for a while, then we watched a TV show on the web - we d caught the very end of it the previous night and regretted not","messageBody":"<div id=\"ygrps-yiv-1401904769\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; This morning we sat together in pyjamas and played with the <br/>\n </span></blockquote>computer.  We looked at LOL Cats for a while, then we watched a TV show <br/>\non the web - we&#39;d caught the very end of it the previous night and <br/>\nregretted not seeing it all.  It was a trivia show that hung its <br/>\nmaterial around the theme of earthquakes, and it set us off on loads of <br/>\ntangents - we were glad of the pause button so we could sit and chat <br/>\nwhen we wanted.  Jess knew I&#39;d been at the top of a tall building in an <br/>\nearthquake and wanted to hear about it again.  Because the presenter <br/>\ntalked about the use of seismography in detecting nuclear tests, she <br/>\nwanted to know what the cold war was about.  She wanted to know why <br/>\ncommunism and capitalism were different. She picked out the background <br/>\nmusic on the piano.  She asked about hallucinogens - because we heard <br/>\nthat the oracle at Delphi was probably stoned on the gases that <br/>\nemanated from her temple, which sat on two faultlines.  That led to us <br/>\ntalking about shamanism - especially important to Jess as her favourite <br/>\ncomedy show, &quot;The Mighty Boosh&quot; features several inept shamen.  Several <br/>\nof these things looked conventionally educational but we hadn&#39;t set out <br/>\nto learn anything, just to watch a show that looked interesting.  All <br/>\nin all, the one hour show took us two and a half hours.  And then we <br/>\nwent back to surfing Failblog.  What felt great was that at no point <br/>\nwas I tempted to ask Jess to write anything down for future reference.  <br/>\nAt no point did I try to keep her on-topic and, if she&#39;d got bored part <br/>\nway through, I&#39;m certain I&#39;d now say, &quot;yes, let&#39;s do something else&quot;.  <br/>\nHopefully a sign that I&#39;m at least BEGINNING to deschool? &lt;&lt;&lt;&lt;<br/>\n<br/>\nYes.  The more experiences the merrier.  I&#39;ve been experiencing over <br/>\nand over what Jude talks about here.  And though we&#39;ve still not even <br/>\ngotten *to* Karl&#39;s technical school ages, I&#39;ve had many times to hang <br/>\nout with Karl and get to know what he likes, wants to know, the way he <br/>\nquestions things (multiple), and the scads of possibilities of how <br/>\nother areas hook into his interests and explorations.  Which means I&#39;m <br/>\nconfident now ... already ... about unschooling Karl.  Which is good <br/>\nbecause it frees me to focus on the logistics of making it happen <br/>\ninstead of wandering about still unsure.  The more learning experiences <br/>\nwe have with our kids the better we&#39;ll feel.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":62589750,"authorName":"shepherdlass","from":"&quot;shepherdlass&quot; &lt;JudithAnneMurphy@...&gt;","profile":"shepherdlass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"This is starting to feel like fun!","postDate":"1242774054","msgId":45320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1dmRuNitnY28wQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45322,"prevInTime":45319,"nextInTime":45321,"topicId":45320,"numMessagesInTopic":0,"msgSnippet":"Just want to say thank you to everyone who s been giving advice as we take our first faltering steps out into the unknown. We ve ditched all curriculum","messageBody":"<div id=\"ygrps-yiv-2146644303\">Just want to say thank you to everyone who&#39;s been giving advice as we take our first faltering steps out into the unknown.  <br/>\n<br/>\nWe&#39;ve ditched all curriculum materials unless Jess specifically wants to look at them.  Our pace of family life has slowed down to something more manageable - although my part-time job (necessary to keep a roof over our heads as I&#39;m the only wage-earner) tends to ramp things up occasionally.  We are talking more about ideas and things that interest us and less about where we&#39;re meant to be and at what time.  Jess is getting incredibly creative with Windows Movie-Maker.  And today, I realized how different and lovely it is to be free from the overwhelming shadow of the timetable.  <br/>\n<br/>\nThis morning we sat together in pyjamas and played with the computer.  We looked at LOL Cats for a while, then we watched a TV show on the web - we&#39;d caught the very end of it the previous night and regretted not seeing it all.  It was a trivia show that hung its material around the theme of earthquakes, and it set us off on loads of tangents - we were glad of the pause button so we could sit and chat when we wanted.  Jess knew I&#39;d been at the top of a tall building in an earthquake and wanted to hear about it again.  Because the presenter talked about the use of seismography in detecting nuclear tests, she wanted to know what the cold war was about.  She wanted to know why communism and capitalism were different. She picked out the background music on the piano.  She asked about hallucinogens - because we heard that the oracle at Delphi was probably stoned on the gases that emanated from her temple, which sat on two faultlines.  That led to us talking about shamanism - especially important to Jess as her favourite comedy show, &quot;The Mighty Boosh&quot; features several inept shamen.  Several of these things looked conventionally educational but we hadn&#39;t set out to learn anything, just to watch a show that looked interesting.  All in all, the one hour show took us two and a half hours.  And then we went back to surfing Failblog.  What felt great was that at no point was I tempted to ask Jess to write anything down for future reference.  At no point did I try to keep her on-topic and, if she&#39;d got bored part way through, I&#39;m certain I&#39;d now say, &quot;yes, let&#39;s do something else&quot;.  Hopefully a sign that I&#39;m at least BEGINNING to deschool?  <br/>\n<br/>\nIt&#39;s starting to feel less like that terrifying leap in Indian Jones (whoever came up with that simile was spot on), and more ... well, fun!<br/>\n<br/>\nJude x</div>","specialLinks":[]}],"prevTopicId":45250,"nextTopicId":45225}}