{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"UNSCHOOLING.COM ONLINE NEWS Mid January 2003","postDate":"1042703751","msgId":55298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzLjJlZjE1Yzk2LjJiNTdiZjg3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":55297,"nextInTime":55299,"topicId":55298,"numMessagesInTopic":0,"msgSnippet":"... UNSCHOOLING.COM ONLINE NEWS Mid-January 2003 ... In this Issue: How to Raise a Respected Child Life, the Universe, and Everything A Mind At A Time Parental","messageBody":"<div id=\"ygrps-yiv-610126498\">::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS<br/>\n<br/>\nMid-January 2003<br/>\n<br/>\n<br/>\n::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\n<br/>\nIn this Issue:<br/>\n<br/>\n<br/>\nHow to Raise a Respected Child<br/>\nLife, the Universe, and Everything<br/>\nA Mind At A Time<br/>\nParental Failure<br/>\nSocial Mythology<br/>\nBook Lovers<br/>\nLearning Relationships<br/>\nCelebrating Freedom<br/>\nWhy Not Do Both?<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nWelcome to 2003, and a new edition of the best unschooling newsletter<br/>\nonline! Due to the illness and death of my father, the Unschooling.com<br/>\nOnline News was not published in November or December. I hope you&#39;ve<br/>\nmissed it just a little bit. And as always, I hope this collection of<br/>\nthoughts and musings leaves you thinking and searching for more.<br/>\n<br/>\nDeborah A Cunefare<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nHow to Raise a Respected Child<br/>\n<br/>\n&quot;I really believe that unschooling works best when parents trust a child&#39;s<br/>\npersonhood, his intelligence, his instincts, his potential to be mature and<br/>\ncalm. Take any of that away, and the child becomes smaller and<br/>\npowerless to some degree.<br/>\n<br/>\nGive them power and respect, and they become respected and powerful.<br/>\n<br/>\nIs it just that simple? That a parent can GIVE a child power and respect?<br/>\nCan a parent give a child freedom?&quot;<br/>\n<br/>\nSandra Dodd writing in the January/February issue of Home Education<br/>\nMagazine<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nLife, the Universe, and Everything<br/>\n<br/>\nOne way to get the student to come out from hiding is to do all we can to<br/>\nlegitimize his interests. In other words, to make him feel that whatever<br/>\nhe is interested in is OK, a perfectly good place from which to look at and <br/>\nbegin to explore the world, as good as any other, indeed better than any<br/>\nother. We will not make him feel this unless we understand ourselves<br/>\nthat it is true. This will be hard for people who have for years been mis-<br/>\nschooled into thinking that life, the world, human experience, are divided<br/>\nup into disciplines or subjects or bodies of knowledge, some of them<br/>\nserious, noble, important, others ignoble and trivial. It is not so. The<br/>\nworld and human experience are one whole. There are no dotted lines in it<br/>\nseparating History from Geography or Chemistry or Physics. In fact, out<br/>\nthere, there are no such things as History or Geography or Chemistry or<br/>\nPhysics. Out there is --- out there. But the world, the universe, human<br/>\nexperience, are vast. We can&#39;t take them in all at once. So we choose,<br/>\nsensibly enough, to look at this part of reality, or that; to ask this kind<br/>\nof question about it, or that. If we look at one part, in one way, and ask<br/>\none kind of question, we may be thinking like a historian; if we look at<br/>\nanother part, ask another question, we may be thinking like a physicist,<br/>\nor a chemist, or a psychologist, or a philosopher. But these different<br/>\nways of looking at reality should not make us forget that it is all one<br/>\npiece, and that from any one place in it we can get to all the other<br/>\nplaces.&quot;<br/>\n<br/>\nJohn Holt<br/>\nfrom Freedom and Beyond <br/>\nE. P. Dutton - 1972<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nA Mind At A Time<br/>\n<br/>\nIt&#39;s taken for granted in adult society that we cannot all be generalists<br/>\nskilled in every area of learning and mastery. Nevertheless, we apply<br/>\ntremendous pressure on our children to be good at everything. Every day<br/>\nthey are expected to shine in math, reading, writing, speaking, spelling,<br/>\nmemorization, comprehension, problem solving, socialization, athletics,<br/>\nand following verbal directions. Few if any children can master all of<br/>\nthese &quot;trades.&quot; And none of us adults can. In one way or another, all<br/>\nminds have their specialties and their frailties. <br/>\n<br/>\nMel Levine, M.D.<br/>\nfrom A Mind At A Time<br/>\nSimon and Schuster 2002<br/>\n<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nParental Failure<br/>\n<br/>\n<br/>\nI&#39;m trying to follow my children&#39;s lead. I&#39;ve learned by failing. When I fail<br/>\nto follow their lead things go wrong. Homeschooling doesn&#39;t work in my<br/>\nfamily if my children don&#39;t feel trusted. When I fail to trust and I inch<br/>\nback toward the other end of the continuum; the more traditional side,<br/>\nwhat *I* was taught learning was and how *I* was taught to teach, then<br/>\nI fail with my own children. That failure propels me towards the more<br/>\nunstructured-trusting-joyful side of the learning continuum. Another<br/>\nperson might think failing should lead to me trying harder to press my<br/>\nown will on my children, but we don&#39;t have that kind of relationship; I&#39;ve<br/>\nbeen learning how to follow their lead every since they were babies and it<br/>\nseems more natural to continue to develop that trust as they get older.<br/>\nI&#39;m learning something I never learned in school: that failure is a valuable<br/>\nteacher and not a shame or a disgrace.<br/>\n<br/>\n<br/>\nFrom the HEM-Unschooling email list.<br/>\n<br/>\nJoin the conversation! Send a blank email to:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Unschooling-subscribe@yahoogroups.com\">HEM-Unschooling-subscribe@yahoogroups.com</a><br/>\n<br/>\nOr visit the email list website at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/HEM-Unschooling\">http://groups.yahoo.com/group/HEM-Unschooling</a><br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n<br/>\nSocial Mythology<br/>\n<br/>\n<br/>\nThe need for schooling is bolstered by two well-entrenched pieces of<br/>\ncultural mythology. The first and most pernicious of these is that<br/>\nchildren will not learn unless they&#39;re compelled to--in school. It is part of<br/>\nthe mythology of childhood itself that children hate learning and will avoid<br/>\nit at all costs. Of course, anyone who has had a child knows what an<br/>\nabsurd lie this is. From infancy onward, children are the most fantastic<br/>\nlearners in the world. If they grow up in a family in which four languages<br/>\nare spoken, they will be speaking four languages by the time they&#39;re<br/>\nthree or four years old--without a day of schooling, just by hanging<br/>\naround the members of their family, because they desperately want to<br/>\nbe able to do the things they do. Anyone who has had a child knows that<br/>\nthey are tirelessly curious. As soon as they&#39;re able to ask questions,<br/>\nthey ask questions incessantly, often driving their parents to<br/>\ndistraction. Their curiosity extends to everything they can reach, which<br/>\nis why every parent soon learns to put anything breakable, anything<br/>\ndangerous, anything untouchable up high--and if possible behind lock and<br/>\nkey. We all know the truth of the joke about those childproof bottle caps:<br/>\nthose are the kind that only children can open. <br/>\n<br/>\nDaniel Quinn<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ishmael.org/education/writings/unschooling.shtml\">http://www.ishmael.org/education/writings/unschooling.shtml</a><br/>\nIshmael Community<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nBook Lovers<br/>\n<br/>\n<br/>\n&quot;I am the product of long corridors, empty sunlit rooms, upstair indoor<br/>\nsilences, attics explored in solitude, distant noises of gurgling cisterns<br/>\nand pipes, and the noise of wind under the tiles. Also, of endless books.<br/>\nThere were books in the study, books in the drawing-room, books in the<br/>\ncloakroom, books (two deep) in the great bookcase on the landing, books<br/>\nin a bedroom, books piled as high as my shoulder in the cistern attic,<br/>\nbooks of all kinds reflecting every transient stage of my parents&#39;<br/>\ninterests, books readable and unreadable, books suitable for a child and<br/>\nbooks most emphatically not. Nothing was forbidden me. In the seemingly<br/>\nendless rainy afternoons I took volume after volume from the shelves.&quot;<br/>\nC.S. Lewis<br/>\n<br/>\nBooks to the ceiling<br/>\nBooks to the sky<br/>\nMy piles of books are a mile high!<br/>\nHow I love them!<br/>\nHow I need them!<br/>\nI&#39;ll have a long beard<br/>\nBy the time I read them!<br/>\nArnold Lobel<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nLearning Relationships<br/>\n<br/>\n<br/>\nWe begin our life as an embryo attached to the wall of our mother&#39;s<br/>\nwomb. It&#39;s our first relationship. Not much in the way of interaction but,<br/>\nquite literally, a vital connection. We are dependent on an umbilical cord<br/>\nfor nutrients and oxygen, on a sack of fluid for warmth and safety. This<br/>\nis our first interpersonal experience. Parents provide, and we survive.<br/>\n<br/>\nSiblings, peers, teachers, and others may exert greater influence on our<br/>\ntastes, attitudes, and behavior in the long run than our parents do.<br/>\nPeople our own age, especially during adolescence, tend to have more to<br/>\nsay about the way we act, how we dress, how we groom. But what we<br/>\nthink relationships are, what we expect out of them, and what we know<br/>\nabout participating in them is largely based on how our parents treated<br/>\nus when we were young. If it was with respect and affection, we figure<br/>\nthat&#39;s the way people will deal with us and how we will deal with them. If,<br/>\nhowever, we are treated without regard, with cruelty, or with<br/>\nindifference, then that&#39;s the interpersonal language we know.<br/>\n<br/>\nParents bestow upon us the cornerstone for all subsequent relationships<br/>\n- our capacity and orientation for love, trust, and fellowship.<br/>\n<br/>\n...The relationship we have with our parents is more than just where we<br/>\nbegin our relational development. It remains an important reference<br/>\npoint for the remainder of our relational lives. &quot;How it was with my<br/>\nparents at home when I was a kid&quot; can be a warm and nostalgic memory,<br/>\na precious model to replicate and perpetuate. Or it can be a terrible one,<br/>\nfrightening, to be avoided at all costs. Or it can be something in between.<br/>\nBut it is always where we start. And it will always be the foundation on<br/>\nwhich we build our interpersonal world.<br/>\n<br/>\nAlexander Levy<br/>\nfrom The Orphaned Adult<br/>\n<br/>\nPerseus Books 1999<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nCelebrating Freedom<br/>\n<br/>\nRecently I stumbled across a wonderful unschooling family on the web:<br/>\n<br/>\n&quot;My name is Nanda, I am married to Hans and together we have four<br/>\nboys: Rutger (10), Stijn (7), Jochem (5) and Koen (2). We are a Dutch<br/>\nfamily but four years ago we left the Netherlands and moved to the USA<br/>\nto be able to un-school our children. (If you want to know more about why<br/>\nwe made that decision read; &#39;An Unschooling Adventure&#39; also on this<br/>\nsite.) Every two weeks from now on I will write about our un-schooling<br/>\nlife; what we do and don&#39;t do and why it works for us. I have to warn you<br/>\nup front though, because you may want to start un-schooling too!&quot;<br/>\n<br/>\nNanda&#39;s site is small but packed tight with her delightful musings on<br/>\nunschooling. For instance, this excerpt from an article entitled &quot;So what<br/>\ndo you do all day?&quot;<br/>\n<br/>\n&quot;Un-schooling is a very natural thing for children to do but it didn&#39;t<br/>\nalways come that natural to me. I often had a tendency to teach my<br/>\nchildren at first. Because I went to school myself, part of me still<br/>\nthought that you could only learn if you sit behind a desk and listen to a<br/>\nteacher. Then when we get the teachers approval, in the form of a good<br/>\ngrade, we have learned something, right? But if that&#39;s true, how can it be<br/>\nthat I don&#39;t remember anything of all the things I&#39;ve learned this way?<br/>\nAnd how can you explain that all the situations that have really taught<br/>\nme and helped me grow as a person took place outside of school in real<br/>\nlife?<br/>\n<br/>\nMy father always says that there is a big difference between knowledge<br/>\nand wisdom, and I think he&#39;s right about that. Knowledge is taught in<br/>\nconventional schools but wisdom is something that you have to find<br/>\nthrough real life experiences. As un-schoolers we live our life and we try<br/>\nto learn as much as we can from every situation we encounter.<br/>\nEveryday, our children learn about who they are, what they believe in,<br/>\nwhat they can do and what makes them happy; now that&#39;s wisdom. The<br/>\nknowledge just comes to them because they are curious about the world<br/>\nthey live in, because they love to read and because they encounter<br/>\nanyone and everything with an open mind and an open heart.<br/>\n<br/>\nSo what do we do all day? I think Rutger explained it very well to one of<br/>\nhis aunts when she once asked him this question; &quot; We do exactly as we<br/>\nplease.&quot; he said and I can only agree.&quot;<br/>\n<br/>\nYou&#39;ll find Nanda and her family at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.alternative-learning.org/ale/us-series.html\">http://www.alternative-learning.org/ale/us-series.html</a><br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nWhy Not Do Both?<br/>\n<br/>\nLike other people, educators often hold theories about how the world<br/>\nworks, or how one ought to act, that are never named, never checked<br/>\nfor accuracy, never even consciously recognized. One of the most<br/>\npopular of these theories is a very appealing blend of pragmatism and<br/>\nrelativism that might be called &quot;the more, the merrier.&quot; People<br/>\nsubscribing to this view tend to dismiss arguments that a given<br/>\neducational practice is bad news and ought to be replaced by another.<br/>\n&quot;Why not do both?&quot; they ask. &quot;No reason to throw anything out of your<br/>\ntoolbox. Use everything that works.&quot; <br/>\n<br/>\nBut what if something that works to accomplish one goal ends up<br/>\nimpeding another?  And what if two very different strategies are<br/>\ninversely related, such that they work at cross purposes? As it happens,<br/>\nconverging evidence from different educational arenas tends to support<br/>\nexactly these concerns. Particularly when practices that might be called,<br/>\nfor lack of better labels, progressive and traditional are used at the<br/>\nsame time, the latter often has the effect of undermining the former. <br/>\n<br/>\nExample 1 comes from the world of math instruction. A few years back,<br/>\na researcher named Michelle Perry published a study in the journal<br/>\nCognitive Development that looked at different ways of teaching children<br/>\nthe concept of equivalence, as expressed in problems such as<br/>\n&quot;4 + 6 + 9 =___ + 9.&quot; Fourth and 5th graders, none of whom knew how<br/>\nto solve such problems, were divided into two groups. Some were taught<br/>\nthe underlying principle (&quot;The goal of a problem like this is to find ...&quot;),<br/>\nwhile others were given step-by-step instructions (&quot;Add up all the<br/>\nnumbers on the left side, and then subtract the number on the right<br/>\nside&quot;). <br/>\n<br/>\nBoth approaches were effective at helping students solve problems just<br/>\nlike the initial one. Consistent with other research, however, the principle-<br/>\nbased approach was much better at helping them transfer their<br/>\nknowledge to a slightly different kind of problem—for example,<br/>\nmultiplying and dividing numbers to reach equivalence. Direct instruction<br/>\nof a technique for getting the right answer produced shallow learning. <br/>\n<br/>\n But why not do both? What if students were taught the procedure and<br/>\nthe principle? Here&#39;s where it gets interesting. Regardless of the order in<br/>\nwhich these two kinds of instruction were presented, students who were<br/>\ntaught both ways didn&#39;t do any better on the transfer problems than did<br/>\nthose who were taught only the procedure—which means they did far<br/>\nworse than students who were taught only the principle. Teaching for<br/>\nunderstanding didn&#39;t offset the destructive effects of telling them how<br/>\nto get the answer. Any step-by-step instruction in how to solve such<br/>\nproblems put learners at a disadvantage; the absence of such<br/>\ninstruction was required for them to understand. <br/>\n<br/>\nFind the rest of this fascinating article at:<br/>\nEducation Week<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.alfiekohn.org/teaching/edweek/rotten.htm\">http://www.alfiekohn.org/teaching/edweek/rotten.htm</a><br/>\nEducation&#39;s Rotten Apples By Alfie Kohn<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\n<br/>\nFor information on purchasing advertising space in this newsletter,<br/>\nplease contact the editor at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\n________________________<br/>\n<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\n<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\n<br/>\nLooking for something to do? Why not:  ** Stage a Costume Ball from <br/>\n<br/>\nthe Middle Ages ** Fly Through Human Anatomy ** Take a Virtual Walk <br/>\n<br/>\nthrough the Rainforest ** Program a Robot ** Build a Computer Game ** <br/>\n<br/>\nThe Resourceful Homeschooler carries great books, science materials <br/>\n<br/>\nand kits, learning games, and the most interesting software. Visit <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.resourcefulhomeschooler.com\">http://www.resourcefulhomeschooler.com</a> Materials to involve, inspire <br/>\n<br/>\nand support independent learners of all ages!<br/>\n<br/>\n<br/>\n________________________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\n<br/>\nThe Jan/Feb 2003 issue of Home Education Magazine has articles on <br/>\n<br/>\nsurviving tough times, non-school recess, homeschool empowerment, <br/>\n<br/>\nmath renovation and more.  From the columnists: the Kaseman&#39;s keep <br/>\n<br/>\nyour privacy; Becky Rupp tells folktales; David Albert learns to love <br/>\n<br/>\nmath; Sandra Dodd respects children; Elizabeth McCullough reviews <br/>\n<br/>\n&quot;Fundamentals of Homeschooling&quot;; and Carol Narigon (that&#39;s me) gets <br/>\n<br/>\ndad off your back. Other columnists include Ann Zeise, Peter Kowalke, <br/>\n<br/>\nLinda Dobson, and Laura Weldon. HEM also offers a special essay by <br/>\n<br/>\npublisher Helen Hegener, classified ads, letters and discussion, pen <br/>\n<br/>\npals and networking, and more. <br/>\n<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/201/issuecontent.html)\">http://www.home-ed-magazine.com/HEM/201/issuecontent.html)</a><br/>\n<br/>\n<br/>\nCheck out the HEM web site for a free sample issue and the best<br/>\nsubscription deals:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\n<br/>\nOr write Home Education Magazine, PO Box 1083, Tonasket, WA 98855;<br/>\n<br/>\norders: toll-free 1-800-236-3278; email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a><br/>\n<br/>\nMC/Visa/Disc cards accepted.<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThe Last Word<br/>\n<br/>\nThe important thing is not to stop questioning. Curiosity has it&#39;s own<br/>\nreason for existing. One cannot help but be in awe when he contemplates<br/>\nthe mysteries of eternity, of life, of the marvelous structure of reality.<br/>\nIt is enough if one tries merely to comprehend a little of this mystery<br/>\neveryday. Never lose a holy curiosity.<br/>\n<br/>\nAlbert Einstein<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n<br/>\nThanks for reading the Unschooling.com newsletter! Feel free to forward<br/>\n<br/>\nthis newsletter to all your friends, your local support group, and your<br/>\n<br/>\nmother-in-law!<br/>\n<br/>\n<br/>\nTo subscribe, visit our web site at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> or send<br/>\nan email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words subscribe<br/>\nunschooling-newsletter followed by your name@your address.com in the<br/>\n<br/>\nbody of the email.<br/>\n(e.g. subscribe unschooling-newsletter youremailaddress).<br/>\n<br/>\n<br/>\nTo unsubscribe, send an email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the<br/>\nwords unsubscribe unschooling-newsletter followed by<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yourname@...\">yourname@...</a> in the body of the email.<br/>\n<br/>\n(e.g. unsubscribe unschooling-newsletter youremailaddress).<br/>\n<br/>\n<br/>\nTo change the address at which you receive the newsletter, unsubscribe<br/>\nyour old address and then subscribe with your new one.<br/>\n<br/>\n<br/>\nSee you in February!<br/>\n<br/>\n<br/>\nDeborah A Cunefare, Newsletter Editor<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\n<br/>\nUnschooling.com is a service of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":55297,"nextTopicId":55212}}