{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Yelling unschoolers :)","postDate":"1029512388","msgId":41271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzLjFmYTY3Y2ZjLjJhOGU3NmM0QGNzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":41270,"nextInTime":41272,"topicId":41271,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/16/02 10:21:35 AM Central Daylight Time, Unschooling-dotcom@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-1603781080\">In a message dated 8/16/02 10:21:35 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; By the way, they did clean up the blueberries - to a point, there are <br/>\nstill stains I can&#39;t seem to get out... but only after me yelling - and I <br/>\nhate to do that.... yelling is the worst - and it seems so hard sometimes to <br/>\nnot yell in these circumstances.....  It&#39;s hard to imagine anyone else here <br/>\nas a &quot;yelling, unschooler&quot;....<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>Waving my arms over here Heather.<br/>\nI am a natural yeller. Sounds ridiculous, but I have fought long and hard to <br/>\novercome my tendency to raise my voice when under stress.<br/>\nI do pretty good most of the time now, but smashed blueberries might have got <br/>\nme upset....hard to say what all of the circumstances surrounding it was.<br/>\nI ask my kids to eat at the table, not a hard and fast rule, but just <br/>\nsomething I ask for to help me keep things from getting trashed.<br/>\nI do think young children need a lot of supervision and when you can&#39;t give <br/>\nit things can get out of hand. Unschooling does not mean letting them do <br/>\nwhatever they want....although when I advocate letting children choose it <br/>\nprobably sounds like that.<br/>\nI think a huge part of it is being there with them,  explaining why smashed <br/>\nblueberries will ruin the carpet and asking them how we could avoid that.<br/>\nKeeping art supplies available is great, but you better take into account the <br/>\ndevelopmental stage of each child and what they can handle.<br/>\nI want them to get me for things beyond their developmental abilities. I need <br/>\nto be with them, available, but also guiding them.<br/>\nUnschooling doesn&#39;t mean give them access to whatever you&#39;ve got and turn <br/>\nthem loose. Understanding child development is crucial to being an effective <br/>\nparent in my opinion.  Blueberries are probably not the best thing to leave <br/>\nout when you&#39;re in the shower. Or maybe they could all come in the bathroom <br/>\nand eat them while you&#39;re washing? I personally, would have waited. Waited <br/>\nuntil they were done eating them to shower, or if they didn&#39;t care, waited to <br/>\nfeed them blueberries until I was done showering.<br/>\nArt supplies that they can handle should be available, others should be only <br/>\nwhere the older kids can get to them.<br/>\nThat doesn&#39;t mean I don&#39;t let my baby boy dabble with things. I do. But I <br/>\nwant to be the one getting it out and giving him access while in a high chair <br/>\nor safely in my lap.<br/>\nyk?  I think it&#39;s easy to read here and think everyone is just turning their <br/>\nkids loose. Remember there are a lot of older kids being discussed here that <br/>\ncan have access equally to parents.<br/>\nBut there are little ones not ready for access to the entire household. You <br/>\ncould make yourself crazy trying to be &quot;free&quot; and creative.<br/>\nI think you&#39;re on the right track, but just try to remember that age matters <br/>\nand access at young ages is hugely different than at older ages.<br/>\nI hope I&#39;m not assuming too much.....maybe I&#39;m totally off the mark. But <br/>\nthat&#39;s the feel I get from your post.<br/>\nDon&#39;t feel bad about losing it, or do feel bad and then let it go.  No one <br/>\nhere is a perfect parent, I bet most of us have yelled. I do it more than I&#39;d <br/>\nlike for sure.<br/>\nBut that&#39;s what I love about this forum. It&#39;s my touchstone for gentle <br/>\nparenting, a reminder to not do the things that may come easily (yelling),  <br/>\nbut to do better.<br/>\nMost of the time it&#39;s something that we, as parents, need to do different.<br/>\nHindsights great that way isn&#39;t it? I usually can see after the fact, that if <br/>\nI had done something different the event wouldn&#39;t have happened that stressed <br/>\nme out in the first place.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":41268,"nextTopicId":41273}}