{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"college (was Re: Older teen sleep/motivation problems)","postDate":"1098880469","msgId":100883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Yi4yYjU0NjQ0OS4yZWIwZWZkNUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":100882,"nextInTime":100884,"topicId":100883,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/26/04 3:52:35 PM, julie@bravewriter.com writes: ","messageBody":"<div id=\"ygrps-yiv-285300892\">In a message dated 10/26/04 3:52:35 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a> writes:<br/>\n<br/>\n&lt;&lt; &quot;I like it because I&#39;m good at working there. I like the atmosphere and <br/>\npeople and it isn&#39;t a stressful job. It doesn&#39;t pump up my adrenaline and it <br/>\ndoesn&#39;t depress me. I can do it and still do all the other things that I really <br/>\nenjoy doing away from work.&quot; &gt;&gt;<br/>\n<br/>\nMarty and I met lots of people on our three day &quot;explore&quot; of the far SW <br/>\ncorner of New Mexico.   We sat and talked, we heard stories, we messed with 19th <br/>\ncentury stuff (little &quot;museums&quot; which are more like extended junkrooms where you <br/>\ncan pick the dusty stuff up) and asked questions and heard more stories.<br/>\n<br/>\nWe met a lot of enthusiastic people.  The youngest was 20 or 21.  The oldest <br/>\nwere in their 60&#39;s, maybe 70 on a couple of them.   But they were happy, and <br/>\nknowledgeable, and enthusiastically glad to see us.<br/>\n<br/>\nMaybe some of them had college degrees, but nothing we saw or talked to them <br/>\nabout or that they were doing when we saw them had to do with those degrees.   <br/>\n<br/>\nI hope I will get the mood to write an account of the weekend, but Marty was <br/>\ngreat and learned TONS and made lots of connections and got many future trails <br/>\nto follow (literally and figuratively), and all this learning came from <br/>\npeople who were doing what was fascinating to them.<br/>\n<br/>\nThe youngest person is the oldest granddaughter of the man who currently owns <br/>\na ghosttown called Stein&#39;s (pronounced &quot;steens&quot; and sometimes spelled that <br/>\nway in historic mentions).   As she was giving me and Marty our little private <br/>\ntour, for which we had paid $2 apiece, I asked her if she thought she would <br/>\nstill be doing this when she was fifty.   &quot;If I&#39;m lucky!&quot; she said very brightly. <br/>\n  My real question had been whether she might want to stay there and become <br/>\nthe owner someday, and I guess I had my answer.<br/>\n<br/>\nWhat college degree would be the best for owning and operating a ghost town?  <br/>\nMaybe archeology, or history?  Museum curatorship?    She and her family had <br/>\nmet 200 people who had lived in that town at one time or another, who had come <br/>\nthrough and told stories.   She told some to us.  Had she been off at college <br/>\ninstead, she wouldn&#39;t have known so many of those stories.  <br/>\n<br/>\nI didn&#39;t mention this to Marty; never said &quot;college.&quot;  We just basked in the <br/>\nwonder of the journey and the many unplanned stops.  We had never heard of <br/>\nthat town, but as we showed up to Shakespeare (a more famous ghost town) two <br/>\nhours early and had already read all we could at the graveyard, we had those two <br/>\nhours to kill, so perused the map for side trips.  There was Stein&#39;s.    They <br/>\nwere closed too.  So we drove to Arizona just so Marty could say he had, found <br/>\na candy machine at a rest stop that gave us two KitKats for the price of one, <br/>\nthrew a u-turn and went back to New Mexico where we followed other odd roads <br/>\nuntil we hit gates and turned back.<br/>\n<br/>\nHow could a weekend be better than to be filled with things like that?  And <br/>\nwe listened to music and sang and laughed and admired different mountain <br/>\nskylines and different desert flora than we were used to.   We live around cholla, a<br/>\nnd this place had mesquite, and barrel cactus--very exotic for us. &lt;g&gt; We&#39;d <br/>\nonly seen barrel cactus 2&quot; high in little pots.  Some of these were three feet <br/>\ntall and healthy.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":100881,"nextTopicId":100886}}