{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1160699,"authorName":"Penn Acres","from":"&quot;Penn Acres&quot; &lt;pennacres@...&gt;","profile":"mtnsky2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"For the Mathematically  Inclined","postDate":"1071729718","msgId":86380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWMzYzUzMiQwOWM0NDQ0MCQxN2UwYjVkMEBHcmFjZVBlbm4+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":86379,"nextInTime":86381,"topicId":86380,"numMessagesInTopic":0,"msgSnippet":"December 1, 2003 (AP). At New York s Kennedy airport today, an individual  later discovered to be a public school teacher was arrested trying to board  a plane","messageBody":"<div id=\"ygrps-yiv-1721744933\">December 1, 2003 (AP). At New York&#39;s Kennedy airport today, an individual  later discovered to be a public school teacher was arrested trying to board  a plane in possession of a ruler, a protractor, a setsquare, a slide rule, and a calculator.<br/>\n<br/>\nAt a hastily-called press conference, Attorney General John Ashcroft said he believes  the man is a member of the notorious al-Jebra movement. He is being charged by the FBI with carrying weapons of math instruction.<br/>\n<br/>\n&quot;Al-Jebra is a fearsome cult,&quot;  Ashcroft said. &quot;They pursue their processes by means and extremes, and sometimes go off on tangents in a  search of absolutes. They use secret code names like &quot;x&quot; and &quot;y&quot; and refer frequently to &quot;unknowns&quot;.<br/>\n<br/>\n&quot;But as the Greek philanderer Isosceles used to say, there are 3 sides to every triangle,&quot; Ashcroft declared. &quot;We have determined they belong to a common denominator of the Axis of co-eval with coordinates in every country.&quot;<br/>\n<br/>\nWhen asked to comment on the arrest, President Bush said, &quot;If God had wanted us to have better weapons of math instruction, He would have given us more fingers and toes.<br/>\n<br/>\n&quot;I am gratified that our homeland defenders has given us a sine that they are protracting us from these math-dogs who are willing to disintegrate us with calculus disregard.  Murky statisticians love to inflict plane on every<br/>\nsphere of influence,&quot; the President said, adding: &quot;Under the circumferences, we must differentiate their root,  make our point, and draw the line.&quot;<br/>\n<br/>\nPresident Bush warned, &quot;These weapons of math instruction have the potential to decimal everything in their math on a scalene never before seen unless we become exponents of a higher power and begin to factor-in random facts of  vertex.&quot;<br/>\n<br/>\nBush concluded: &quot;To al-Jebra, I say: &#39;Read my ellipse. Though you may  continue to multiply, your days are numbered as the hypotenuse tightens around your neck.&#39;&quot;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":86375,"nextTopicId":86395}}