{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":40010184,"authorName":"American Homeschool Association","from":"American Homeschool Association &lt;AHA@...&gt;","profile":"ahadirector","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The AHA Quarterly Journal, Jan/Feb 2002","postDate":"1009935854","msgId":30586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkzZGI4NTgxNWQ4ZjhlZEBbMjA4LjI2LjIzNS4xNDVdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":30585,"nextInTime":30587,"topicId":30586,"numMessagesInTopic":0,"msgSnippet":"~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~ THE AMERICAN HOMESCHOOL ASSOCIATION JOURNAL http://www.americanhomeschoolassociation.org ","messageBody":"<div id=\"ygrps-yiv-532350350\">~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nTHE AMERICAN HOMESCHOOL ASSOCIATION JOURNAL<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.americanhomeschoolassociation.org\">http://www.americanhomeschoolassociation.org</a><br/>\nProduced quarterly, this issue dated January, 2002<br/>\nPermission is granted to print, repost or forward this newsletter<br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\n      Several years ago, the American Homeschool Association&#39;s free <br/>\nonline newsletter was one of the first online publications to take <br/>\nadvantage of the power of the emailed word. Since the mid-1990&#39;s, <br/>\nfree online newsletters have proliferated like topsy (what is that <br/>\nstuff, anyway?), so we were hesitant to recreate this one, wondering <br/>\nif people really wanted still more reading material to keep them at <br/>\ntheir little glowing screens. However, our goal as a service <br/>\norganization is to provide information and resources about <br/>\nhomeschooling, and so, to that end, this newsletter provides access <br/>\nsome of the best.<br/>\n<br/>\n      William Shakespeare wrote &quot;Brevity is the soul of wit,&quot; and we <br/>\ndo want to be witty, at least some of the time, so we&#39;ll keep this <br/>\nintroductory piece brief. This time, anyway. Enjoy!<br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nFree Agent Nation: How America&#39;s New Independent<br/>\nWorkers Are Transforming the Way We Live<br/>\nby Daniel H. Pink<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freeagentnation.com/2book.html\">http://www.freeagentnation.com/2book.html</a><br/>\n<br/>\n      This new book by a contributing editor of the business magazine <br/>\nFast Company includes some of the most interesting writing about <br/>\neducation we&#39;ve read in many years. For example: &quot;Compulsory mass <br/>\nschooling is an aberration in both history and modern society. Yet it <br/>\nwas the ideal preparation for the Organization Man economy, a highly <br/>\nstructured world dominated by large, bureaucratic corporations that <br/>\nroutinized the workplace. Compulsory mass schooling equipped <br/>\ngenerations of future factory workers and middle managers with the <br/>\nbasic skills and knowledge they needed on the job. The broader <br/>\nlessons it conveyed were equally crucial. Kids learned how to obey <br/>\nrules, follow orders, and respect authority -- and the penalties that <br/>\ncame with refusal.&quot;<br/>\n<br/>\n      Now remember that these words are not written by a rabblerousing <br/>\nunschooler, but by a respected writer from a mainstream business <br/>\nmagazine. He continues: &quot;We don&#39;t teach little kids how to talk or <br/>\nwalk or understand the world. We simply put them in nurturing <br/>\nsituations and let them learn on their own. Sure, we impose certain <br/>\nrestrictions. (&quot;Don&#39;t walk in the middle of the street.&quot;) But we <br/>\ndon&#39;t go crazy. (&quot;Please practice talking for 45 minutes until a bell <br/>\nrings.&quot;) It&#39;s the same for home-schoolers. Kids can become agents of <br/>\ntheir own education rather than merely recipients of someone else&#39;s <br/>\nnoble intentions.&quot;<br/>\n<br/>\n      To read an except from the book which was reprinted in Reason <br/>\nMagazine&#39;s October issue, click here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://reason.com/0110/fe.dp.schools.shtml\">http://reason.com/0110/fe.dp.schools.shtml</a><br/>\n<br/>\n      To check out Daniel Pink&#39;s own website, which he calls &quot;an <br/>\ninformation hub for people working on their own,&quot; click this link: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freeagentnation.com/index.html\">http://www.freeagentnation.com/index.html</a><br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nThe Kingdom That Never Was: Inaccuracies in a Sociological Study of <br/>\nHomeschooling<br/>\nTaking Charge column, by Larry and Susan Kaseman<br/>\nHome Education Magazine January/February, 2002<br/>\n<br/>\n      A recently published sociological study of homeschooling <br/>\ncontains serious misinformation that we homeschoolers need to <br/>\nunderstand and be able to counter. We may not be able to prevent this <br/>\nbook from contributing to the mainstream media&#39;s and the academic <br/>\nworld&#39;s misunderstanding of homeschooling. But if we don&#39;t at least <br/>\nrespond to these ideas, misunderstanding of homeschooling will <br/>\nincrease. It&#39;s our responsibility as homeschoolers to correct <br/>\naccounts like this because we are the ones who know the most and <br/>\nbecause we will be most strongly affected by the inaccuracies and <br/>\nmisunderstandings. It is especially important that we work to prevent <br/>\nthe book from distorting the understanding that we and other <br/>\nhomeschoolers have of the history of homeschooling. If we don&#39;t <br/>\nunderstand how we have regained and maintained our freedoms so far, <br/>\nwe are unlikely to understand how to continue to maintain them.<br/>\n<br/>\n      Read a critical review of the book &quot;Kingdom of Children: Culture <br/>\nand Controversy in the Homeschooling Movement,&quot; by Mitchell Stevens <br/>\n(2001, Princeton University Press):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/191/jftch.html\">http://www.home-ed-magazine.com/HEM/191/jftch.html</a><br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nJohn Holt&#39;s Growing Without Schooling is Gone<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.holtgws.com/gws.htm#STATUS\">http://www.holtgws.com/gws.htm#STATUS</a><br/>\n<br/>\n      A page of homeschooling history has turned. An icon, an <br/>\ninstitution, one of the founding documents of a movement, Growing <br/>\nWithout Schooling, known to thousands as simply GWS, ceased <br/>\npublication in October. Citing insurmountable financial difficulties, <br/>\nthe staff wrote in their farewell message, &quot;As we know you can <br/>\nimagine, this was a very hard decision to make. On the one hand, we <br/>\nlook back at the 16 years since John Holt&#39;s death and realize how <br/>\nsignificant it is that the magazine did keep publishing all that <br/>\ntime. On the other hand, we feel deep regret that it cannot continue <br/>\nbeyond this point.&quot;<br/>\n<br/>\n      A fascinating interview with GWS publisher Patrick Farenga was <br/>\npublished in the July/August 1997 issue of Home Education Magazine. <br/>\nPatrick talks about John Holt, describing what he was like and why he <br/>\nfounded Growing Without Schooling in 1977: &quot;What John wrote surprised <br/>\nand rang true for many people and made him a celebrity, but it didn&#39;t <br/>\nreally change schools since he never had a &#39;good reputation&#39; within <br/>\nthe schools. John was always an outsider, even when speaking to <br/>\nschools. One of the reasons John could see how homeschooling could <br/>\nwork and embraced it so soon was that he was sick of talking about <br/>\nchanging schools when all that meant was creating &#39;better curricula&#39; <br/>\nand &#39;tougher standards.&#39;&quot;<br/>\n<br/>\n      Read the complete interview with GWS publisher Patrick Farenga,<br/>\nfrom the July/August 1997 issue of Home Education Magazine:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/HEM144.97/144.97_art_ipf.html\">http://www.home-ed-magazine.com/HEM/HEM144.97/144.97_art_ipf.html</a><br/>\n<br/>\n      Back issues of GWS are available from FUN Books:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fun-books.com/\">http://www.fun-books.com/</a><br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nHistory of Homeschooling<br/>\n<br/>\n      The AHA&#39;s History of Homeschooling series provides wide-ranging <br/>\nperspective, by knowledgeable writers, on where we&#39;ve been as a <br/>\nhomeschooling movement and where we&#39;re going in the future. A lengthy <br/>\ncollection of helpful and informative articles, columns, essays, <br/>\neditorials, FAQs and other formats showcase the best writing on a <br/>\nwide variety of topics, from sources all across the Internet. To <br/>\naccess, go to the AHA website&#39;s Information page and scroll down to <br/>\nHistory of Homeschooling:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.americanhomeschoolassociation.org/info.html\">http://www.americanhomeschoolassociation.org/info.html</a><br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nInterviews & Political Action<br/>\n<br/>\n      The American Homeschool Association web site includes links to <br/>\ninterviews with many homeschooling personalities, including Linda <br/>\nDobson, David Albert, Mary Griffith, Cafi Cohen, Patrick Farenga, <br/>\nMarty Layne, Grace Llewellyn, and others. Also included is a <br/>\nseveral-year collection of columns from Home Education Magazine by <br/>\nLarry and Susan Kaseman, authors of &quot;Taking Charge Through <br/>\nHomeschooling: Personal and Political Empowerment&quot; (1990, Koshkonong <br/>\nPress), addressing issues such as Working for Homeschooling Freedoms, <br/>\nCurfews, &quot;Homeschooling&quot; Programs in the Public Schools, User <br/>\nFriendly Homeschooling Records, Tax Credits and Homeschooling, <br/>\nHomeschoolers&#39; Playing Public School Sports, the Question of <br/>\nCredentials, the School-to-Work program, Homeschooling Legislation, <br/>\nDoing the Minimum to Comply With Homeschooling Laws, and much more. <br/>\nTo check it out, click here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.americanhomeschoolassociation.org/info.html\">http://www.americanhomeschoolassociation.org/info.html</a><br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nThe winter issue of &quot;Self-University Newsletter is posted at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.autodidactic.com/selfnews.htm\">http://www.autodidactic.com/selfnews.htm</a><br/>\n<br/>\n      The theme of this edition is Education, Work, and Economic <br/>\nInequality. Books featured are:<br/>\n           &quot;Good Work&quot;, by Howard Gardner, Mihaly Csikszentmihalyi, <br/>\nand William Damon<br/>\n           &quot;Free Agent Nation&quot;, by Daniel H. Pink<br/>\n           &quot;Next&quot;, by Michael Lewis<br/>\n           &quot;The Working Life&quot;, by Joanne B. Ciulla<br/>\n           &quot;White-Collar Sweatshop&quot;, by Jill Andresky Fraser<br/>\n           &quot;Nickel and Dimed&quot;, by Barbara Ehrenreich<br/>\n           &quot;Affluenza&quot;, by John De Graaf, David Wann, and Thomas H. Naylor<br/>\n      Thoughtful reviews and commentary, dedicated to furthering <br/>\neducation not as something you get but as something you take. Be sure <br/>\nto check out the Essays for Independent Thinkers by author Charles D. <br/>\nHayes, lifelong learning advocate, a self-taught philosopher, and an <br/>\nauthor and publisher.<br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nHome Education Magazine<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\nThe most widely respected magazine about homeschooling, published by <br/>\na second-generation homeschooling family since 1983. Winner of a <br/>\nParents&#39; Choice Recommended Award. Best subscription prices are <br/>\nusually found at the website - and many articles, services, a monthly <br/>\nnewsletter, a large support group network, information about laws & <br/>\nregulations and much more are absolutely free. Jean Reed, author of <br/>\nThe Home School Source Book, writes: &quot;If I had to choose only one <br/>\nhomeschooling magazine to read, it would be this one!&quot;<br/>\n<br/>\nSupport the magazine that supports homeschooling families!<br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nNational Home Education Network<br/>\nNHEN-Legislative email discussion list<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/NHEN-Legislative/\">http://groups.yahoo.com/group/NHEN-Legislative/</a><br/>\n<br/>\n      The National Home Education Network&#39;s NHEN-Legislative email <br/>\ndiscussion list is &quot;for all homeschoolers interested in keeping up <br/>\nwith legal and legislative issues across the country.&quot; As such, many <br/>\nissues of importance to homeschoolers are discussed, top news stories <br/>\naffecting homeschooling are posted and analyzed, legal and <br/>\nlegislative affairs are tracked, and much, much more. The ongoing <br/>\nexchange of opinions and commentary from the list&#39;s members offer <br/>\nsome of the most thoughtful and thought-provoking reading available <br/>\nto homeschoolers. The last week of December, 2001 offered these posts <br/>\n(grateful appreciation to those who granted permission to reprint <br/>\nexcerpts here):<br/>\n<br/>\n      Each of us can grow with every book we read and every discussion <br/>\nwe have. We develop understanding and perspective throughout our <br/>\nlives -- that&#39;s what real education is all about! (This list is very <br/>\neducational most of the time &lt;g&gt;) And as we grow and change, thank <br/>\ngoodness, our democratic republic lets us exercise freedom as we <br/>\nchoose at any given point in time, while allowing us to say any silly <br/>\nthing we please but still protects us from each other&#39;s tyranny in <br/>\nthe process. Most importantly, it allows each of us to make our own <br/>\nprivate decisions for ourselves and our families with some confidence <br/>\nin the rule of law, and plenty of ways to redress grievances.<br/>\n\t\tJ.J. Ross, Ed.D., Homeschooling mom of two in Tallahassee, FL<br/>\n\t\t<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdirectededucation.org\">http://www.parentdirectededucation.org</a><br/>\n<br/>\n      ...There are lawyers out there that want to convey to the <br/>\ngeneral public that their minds are so much greater, and that the <br/>\naverage person is so stupid, they couldn&#39;t possibly understand plain <br/>\nEnglish.  Perhaps the real motivation for this attitude is to make <br/>\nun-Constitutional laws with as few as possible people squawking. <br/>\nAfter all, if they are successful with convincing the general public <br/>\nthat it&#39;s too hard for them to understand so don&#39;t bother, look what <br/>\nunscrupulous, power seeking, individuals can accomplish.  My hope <br/>\nstill is for the general public to be more aware of what the <br/>\nConstitution actually states, not what some justice wanted to twist <br/>\nit into to fit their political leaning. The Constitution is the <br/>\nfoundation block for this country and it is straight forward and <br/>\nclear.<br/>\n\t\t<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:asmith@...\">asmith@...</a>, Okanogan County, WA<br/>\n<br/>\n      No time to join another email list? The NHEN ADVOCACY REPORT <br/>\nprovides a monthly synopsis of the issues. To subscribe to The NHEN <br/>\nAdvocacy Report, send email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:advocacy@...\">advocacy@...</a> and put &quot;Subscribe&quot; <br/>\nin the subject heading.<br/>\n<br/>\n      To subscribe to the NHEN-Legislative list via email, send an <br/>\nemail message to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:NHEN-Legislative-subscribe@yahoogroups.com\">NHEN-Legislative-subscribe@yahoogroups.com</a> (the <br/>\nsubject and body can be left blank)<br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nRESOURCE RECOMMENDATIONS<br/>\n<br/>\n      Looking for all the best new books - or time-honored old <br/>\nfavorites? Seeking science kits, arts & crafts supplies, music <br/>\nlessons or used instruments at bargain prices? Wondering where to <br/>\nfind all the best unschooling websites? For a listing of our <br/>\nrecommended homeschooling resources send an email message to <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AHA@...\">AHA@...</a> with the following in the <br/>\nsubject header:  FREE Homeschooling Information and Resources<br/>\n<br/>\n      For a fast, easy, reliable way to find information about <br/>\nanything you can imagine, check out our favorite searcher: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.google.com\">http://www.google.com</a> We recommend using Google to find reviews and <br/>\ninformation about anything homeschooling-related or not - simply <br/>\nenter one or two associated words and click search.<br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nAHA FAQ: Frequently Asked Questions about the American Homeschool Association<br/>\n<br/>\nWho&#39;s behind the American Homeschool Association?<br/>\n      The publishers of Home Education Magazine founded the AHA in <br/>\n1995, and have maintained it since that time as a free services <br/>\norganization for homeschoolers, working online to provide <br/>\ninformation, resources, networking opportunities and more.<br/>\n<br/>\nHow can we join your program?<br/>\n      The American Homeschool Association does not offer a program of <br/>\nstudy, only free information and networking with homeschoolers <br/>\nonline. The name of the organization is similar to a well-known <br/>\ncorrespondence program, The American School, but there is no <br/>\nconnection between the two.<br/>\n<br/>\nWhy don&#39;t you offer any publications or materials in print?<br/>\n      For the first few years of the AHA&#39;s existence we did provide a <br/>\npublished (print) newsletter, informational brochures, etc., but now <br/>\nthe Internet provides a much faster, more convenient, and totally <br/>\nfree way to do the work we want to do.<br/>\n<br/>\nDoes the American Homeschool Association hold a conference?<br/>\n      Over the years we have considered the idea of a national <br/>\nconference from time to time, but with the formation of the National <br/>\nHome Education Network in 1999 we tabled the idea indefinitely. If <br/>\nenough interest is shown we might again consider the idea of hosting <br/>\na national get-together for homeschooling families. The best place <br/>\nfor exploring the possibilities if anyone is truly interested is on <br/>\nthe AHA-Discussion email list:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AHA-Discussion\">http://groups.yahoo.com/group/AHA-Discussion</a><br/>\n<br/>\nOther Homeschooling FAQ&#39;s and Q&A&#39;s<br/>\n<br/>\n      The AHA website offers a collection of FAQ&#39;s (Frequently Asked <br/>\nQuestions) and Q&A&#39;s (Questions and Answers) from some of the best <br/>\nhomeschooling sites on the web, including the sites for Home <br/>\nEducation Magazine, the National Home Education Network, <br/>\nUnschooling.com, Ann Zeise&#39;s A to Z Home&#39;s Cool, and Holt Associates. <br/>\nGot a question? Check it out:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.americanhomeschoolassociation.org/info.html\">http://www.americanhomeschoolassociation.org/info.html</a><br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nThanks for Reading - Pass it Along!<br/>\n<br/>\n      We appreciate your taking time to read this newsletter and we <br/>\nhope you&#39;ll recommend and/or forward it to your friends, support <br/>\ngroup lists and other email lists. We&#39;re especially grateful when <br/>\npeople share our online journal beyond homeschooling circles, sending <br/>\nit to parenting and educational resources where people might not <br/>\notherwise learn about homeschooling options. Why not forward it to <br/>\nyour favorite newsletter or magazine editor, your local librarian, or <br/>\nthe site content manager of your local parenting publication website? <br/>\nThe sole purpose of the American Homeschool Association is to promote <br/>\nhomeschooling - which we can do best with your help!<br/>\n<br/>\n      Permission is granted to print, repost or forward this newsletter.<br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nAMERICAN HOMESCHOOL ASSOCIATION<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.americanhomeschoolassociation.org\">http://www.americanhomeschoolassociation.org</a><br/>\nFor information contact: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AHA@...\">AHA@...</a><br/>\n<br/>\n      The American Homeschool Association (AHA), is a service <br/>\norganization created in 1995 to network homeschoolers on a national <br/>\nlevel and to provide news and information about homeschooling. <br/>\nCurrent AHA services include a free online discussion list providing <br/>\nnews, information, networking, and resources; a free email <br/>\nnewsletter; an email discussion list for homeschoolers interested in <br/>\nworking with their local public libraries to promote homeschooling, <br/>\nand a web site providing categorized links to the most helpful and <br/>\ninformative pages of homeschooling information on the Internet. The <br/>\nAHA is a free services organization. There are no membership fees, <br/>\nand no fees to use the services provided by the AHA.<br/>\n<br/>\n* AHA Email Discussion List: For news, updates, information and support<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AHA-Discussion\">http://groups.yahoo.com/group/AHA-Discussion</a><br/>\n<br/>\n* AHA Email Discussion List: Libraries<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AHA-LibraryList\">http://groups.yahoo.com/group/AHA-LibraryList</a><br/>\n<br/>\n~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~:~<br/>\n<br/>\nTo unsubscribe to this newsletter or to set preferences to read it at <br/>\nthe website:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AHA-Newsletter\">http://groups.yahoo.com/group/AHA-Newsletter</a><br/>\n<br/>\nThe American Homeschool Association<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.americanhomeschoolassociation.org\">http://www.americanhomeschoolassociation.org</a><br/>\n<br/>\nPermission is granted to print, repost or forward this newsletter.<br/>\n<br/>\n[end of file]</div>","specialLinks":[]}],"prevTopicId":30572,"nextTopicId":30589}}