{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Shannon Nicoletta Manns","from":"&quot;Shannon Nicoletta Manns&quot; &lt;snmanns@...&gt;","replyTo":"LIST","senderId":"yZOQRKDl1P50jnnZkSJExHZ-BB9yBkpTxWLxnTqUWz4Gbi7K2Du_vT87GBnzsgYvW--LAlRRG26K46vM2bU9D_dFGrMkcKp7Hnb9-N8Ofa0VPl7xgrG_","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Subject: Hagelin for President","postDate":"968172598","msgId":12737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWQwMWMwMTc1OSQ4OTc3NTA0MCQ0ODZhOWE4ZUBmbWFubnM+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":12736,"nextInTime":12738,"topicId":12737,"numMessagesInTopic":0,"msgSnippet":"I read this on one of the e-groups I belong to. I think it s worth checking out if you are in the US (I am in Canada) or know people in the US. I usually stay","messageBody":"<div id=\"ygrps-yiv-59531797\">I read this on one of the e-groups I belong to. I think it&#39;s worth checking<br/>\nout if you are in the US (I am in Canada) or know people in the US.<br/>\n<br/>\nI usually stay away from politics, but this looked worth it to me.<br/>\n<br/>\nNicoletta<br/>\n<br/>\n<br/>\n<br/>\nSubject: Hagelin for President<br/>\n<br/>\nAmericans UNITE for freedom and human rights!!!<br/>\n<br/>\nSpread the word -- grassroots! Tell 10 who tell 10 who tell 10 more . . .<br/>\nFor Your Future<br/>\nfor the children<br/>\nfor your health<br/>\nfor your wealth<br/>\nfor the world<br/>\nCopy the material and brochures from his website. Get companies to finance<br/>\nmaking<br/>\ncopies, get your kids to take one to every house in town  . . .<br/>\nWord about this man could sweep the country in a matter of days!<br/>\nTape his speeches, have meetings, get involved, turn off the TV<br/>\n<br/>\nI&#39;ve talked to 4 people so far and no one has heard of him. Well, I&#39;m about<br/>\nto change<br/>\nthat! Get out your email address book, get on the phone, and with these<br/>\nemail, I&#39;m<br/>\nreaching another 300. Heck, why stop at 10. I&#39;ll bet you could tell 1,000 or<br/>\n10,000!<br/>\nNetworking at its finest!<br/>\n<br/>\nCheck out the rest of the stuff on his website, and print, print, print.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hagelin.org/brochure/what.html\">http://www.hagelin.org/brochure/what.html</a><br/>\n<br/>\nDr. John Hagelin is a Harvard-trained quantum physicist; Director of the<br/>\nInstitute of<br/>\nScience, Technology and Public Policy; and Reform Party and Natural Law<br/>\nParty<br/>\npresidential candidate, who has worked for decades to promote public<br/>\npolicies in<br/>\nhealth care, education, energy and the environment, crime, defense, etc.,<br/>\nthat are<br/>\nprevention-oriented, scientifically proven, and in accord with natural law.<br/>\nThe following<br/>\nare excerpts from an interview with Dr. Hagelin in which he describes his<br/>\nsolutions to<br/>\nmany of America&#39;s critical problems and his vision of a forward-looking,<br/>\nhealthy, and<br/>\nprosperous nation.<br/>\n<br/>\nStrengthening education: &quot;As Americans, we pride ourselves on our<br/>\neducational<br/>\nopportunities. But the fact is, education is not working. Even though we<br/>\nspend more<br/>\nmoney per student than any other country, our students still rank far behind<br/>\nmost of<br/>\ntheir international peers in math and science-and well behind U.S. test<br/>\nscores of 20<br/>\nyears ago. I would promote proven educational programs that directly<br/>\nincrease<br/>\nintelligence and creativity and simultaneously improve moral reasoning,<br/>\nself-reliance,<br/>\nand mental and physical health and well-being. These programs include sound<br/>\napproaches to nutrition; natural, preventive health education; effective<br/>\ndrug prevention;<br/>\nand innovative curriculum development, including programs to develop the<br/>\nfull mental<br/>\npotential of students.&quot;<br/>\n<br/>\n<br/>\n John Hagelin is a powerful national voice for campaign and election law<br/>\nreforms that<br/>\nwill open the political process to new ideas, new solutions and new<br/>\nleadership for the<br/>\nnew millennium.<br/>\n    Protecting health care: &quot;Too many Americans suffer from poor health. We<br/>\nendure<br/>\nsome of the worst health statistics of all the industrialized nations, yet<br/>\nwe have the<br/>\nhighest per capita health costs of any nation. Why? The answer is that our<br/>\nhealth care<br/>\nsystem is really a disease care system. It focuses on the management of<br/>\nillness<br/>\nrather than on the prevention of disease and the promotion of health. Recent<br/>\nresearch<br/>\nshows that 50% of deaths and 70% of disease in America are<br/>\nself-inflicted-caused<br/>\nby an epidemic of unhealthy habits. Yet we spend only 1% of our health care<br/>\ndollars<br/>\non prevention. I would support cost-effective, prevention-oriented health<br/>\ncare programs<br/>\nthat have been scientifically shown to prevent disease and save money in the<br/>\nbest<br/>\npossible way-by keeping people healthy.&quot;<br/>\n<br/>\nSafeguarding our food supply: &quot;Current agricultural practices erode and<br/>\ndegrade our<br/>\nprecious topsoil. These practices require large-scale use of of chemical<br/>\npesticides and<br/>\nfertilizers that pollute our groundwater and are unhealthy for consumers and<br/>\nfarmers. In<br/>\ncontrast, I support sustainable, organic agricultural practices proven to<br/>\nproduce<br/>\nhealthy, high-quality food without hazardous chemical fertilizers and<br/>\npesticides. These<br/>\npractices will preserve our environment and our agricultural economy for<br/>\nfuture<br/>\ngenerations.&quot;<br/>\n<br/>\nMoratorium on genetically engineered food: &quot;Given the far-reaching<br/>\necological and<br/>\nhealth risks posed by genetic engineering, I would support a moratorium on<br/>\nthe<br/>\ncommercialization of genetically engineered foods and their release into the<br/>\nenvironment until the safety of such organisms can be firmly established. In<br/>\naddition,<br/>\nto protect the public&#39;s right to know, I would enforce mandatory labeling of<br/>\ngenetically<br/>\nengineered foods.&quot;<br/>\n<br/>\n<br/>\n John Hagelin speaks to millions of people through media interviews that<br/>\nhighlight his<br/>\nproven, forward-looking, prevention-oriented solutions.<br/>\n    Ensuring a strong economy: &quot;In today&#39;s information-based economy,<br/>\nintelligence<br/>\nand creativity-innovation and ideas-drive economic growth. Clearly,<br/>\nAmerica&#39;s most<br/>\nprecious natural resource is our human resource-the unlimited creative<br/>\npotential of<br/>\nour 270 million citizens. Given today&#39;s low test scores and high dropout<br/>\nrates, I believe<br/>\nthat the most crucial economic strategy that government can adopt is to<br/>\nharness<br/>\nAmerica&#39;s untapped creativity. So, in addition to my powerful, pro-growth<br/>\ntax and fiscal<br/>\npolicies, I would support proven education, job training and apprenticeship<br/>\nprograms<br/>\nthat develop intelligence and creativity and prevent school dropouts.&quot;<br/>\n<br/>\nPromoting balanced trade: &quot;Trade is vital to a thriving U.S. economy. Trade<br/>\nstimulates<br/>\ncompetition that gives American consumers more choices, better product<br/>\nquality, and<br/>\nlower prices. Especially today, with America leading the global information<br/>\nrevolution-the largest technological and economic explosion in history-it is<br/>\nvitally<br/>\nimportant to U.S. jobs and the economy that we achieve broad access to the<br/>\ninternational marketplace with American products. Unfortunately, as in other<br/>\nareas of<br/>\nU.S. government policy, our trade policies are dictated by special<br/>\ninterests.<br/>\n<br/>\n&quot;Current trade policies<br/>\n<br/>\nleave American workers and businesses at an unfair disadvantage;<br/>\nthreaten our environment;<br/>\nundermine U.S. sovereignty and that of other nations; and<br/>\npromote human rights violations.<br/>\n&quot;I support a balanced, tailored trade program that<br/>\n<br/>\npromotes the economic welfare of all our citizens;<br/>\nprovides markets for our domestic small businesses;<br/>\nsafeguards American employment and labor standards-and upholds our ban on<br/>\nthe<br/>\nimport of products of child and slave labor; and<br/>\nensures that imported goods meet our environmental and product safety<br/>\nstandards.<br/>\n&quot;Our crucial trade treaties, such as NAFTA, must be revisited and vigorously<br/>\nrenegotiated-with adequate representation by labor, environmental, and human<br/>\nrights<br/>\nproponents to ensure that America&#39;s interests are truly upheld. In<br/>\nparticular, the World<br/>\nTrade Organization (WTO), with its sweeping authority to adjudicate<br/>\ninternational trade<br/>\ndisputes, has become a tool of multinational corporations, which have inside<br/>\naccess to<br/>\nWTO negotiations that typically occur in secret. I would give the WTO twelve<br/>\nmonths<br/>\nto adopt more open, democratic procedures-with adequate labor, environmental<br/>\nand<br/>\nhuman rights input-or I would withdraw the U.S. from the WTO and negotiate<br/>\nindividual, tailored trade relationships with our various trade partners.&quot;<br/>\n<br/>\nPreventing crime: &quot;Our young people are 12 times more likely to die by<br/>\ngunfire than<br/>\ntheir peers in other nations. We have the highest percentage of our citizens<br/>\nin jail of<br/>\nany nation in the world. Clearly, our &#39;get-tough&#39; policy, focusing on new<br/>\nprison<br/>\nconstruction and stiffer sentencing, is not enough. Effective crime<br/>\nprevention is also<br/>\ncrucial. That is why I support a truly comprehensive, field-tested,<br/>\nscientifically proven<br/>\nstrategy, including effective prison rehabilitation and reducing societal<br/>\nstress, to<br/>\nprevent and reduce crime.&quot;<br/>\n<br/>\n<br/>\nProtecting the environment: &quot;I am committed to increasing both energy<br/>\nefficiency and<br/>\nthe use of renewable, safe, and nonpolluting energy sources, such as wind,<br/>\nsolar, and<br/>\nbiomass. This approach will protect our environment, create energy<br/>\nself-sufficiency,<br/>\nand add to the economic prosperity of the nation. Through programs that will<br/>\ncreate<br/>\nnew jobs and new industries in energy conservation and renewable energy<br/>\nsources, I<br/>\nwill move away from our hazardous and wasteful dependence on fossil fuels,<br/>\nwhile<br/>\nsaving the nation hundreds of billions of dollars in health and<br/>\nenvironmental costs.&quot;<br/>\n<br/>\nLowering taxes: &quot;The most powerful fiscal action our government can take to<br/>\nstimulate<br/>\nthe economy is to lower taxes. I will cut taxes deeply-and<br/>\nresponsibly-without<br/>\nadding to the deficit or cutting essential services. Many presidential<br/>\ncandidates have<br/>\npromised lower taxes, but they have been unable to fulfill their promises<br/>\ndue to the<br/>\ncost and complexity of problems faced by government. Through my<br/>\ncost-effective<br/>\nsolutions to crime, spiraling health costs, and other social problems, I can<br/>\nsave the<br/>\nnation hundreds of billions of dollars annually. I also support the<br/>\nsimplification and<br/>\noverhaul of our tax structure, thereby eliminating corporate welfare and<br/>\nspecial interest<br/>\ncontrol of our convoluted tax code. On that basis, I can offer a realistic<br/>\nstrategy for<br/>\nsignificant tax reduction that protects the integrity of our important<br/>\nsocial programs.&quot;<br/>\n<br/>\nEnding special interest control: &quot;The election process is far too long and<br/>\nexpensive.<br/>\nElected representatives spend too much of their terms fundraising and<br/>\ncampaigning for<br/>\nreelection. We have the longest campaign season, yet the lowest voter<br/>\nturnout, of any<br/>\ndemocracy in the world. The exorbitant cost of campaigns favors wealthy<br/>\ncandidates<br/>\nand those who receive large contributions from political action committees<br/>\n(PACs) and<br/>\nother special interest groups. Research has shown that 90% of all campaigns<br/>\nare won<br/>\nby the candidate who spends the most. Consequently, government has become a<br/>\ncompetition for money and thus is hostage to special interests rather than<br/>\nresponsive<br/>\nto the people. I will promote crucial democratic reform, including (1)<br/>\npublic sponsorship<br/>\nof election campaigns, (2) elimination of PACs and &#39;soft money,&#39; and (3)<br/>\nprevention of<br/>\nlobbying by former public servants on behalf of domestic and foreign<br/>\ninterests.&quot;<br/>\n<br/>\n<br/>\n<br/>\nJohn Hagelin is forging the largest third-party coalition in U.S. history<br/>\nand giving Americans across the country a reason to vote in the 2000<br/>\nelection.<br/>\n<br/>\n    Foreign policy: &quot;Two thirds of U.S. foreign aid is military aid. I would<br/>\ncreate an<br/>\nimmediate shift away from the export of weapons-the U.S. is one of the<br/>\nlargest arms<br/>\ndealers in the world-toward a more life-supporting policy based on the<br/>\nexport of U.S.<br/>\nknow-how. American expertise and technical assistance in such critical areas<br/>\nas<br/>\nbusiness, entrepreneurship, education, sustainable agriculture, and<br/>\nenvironmental<br/>\ntechnologies, supplemented where necessary with economic support, should<br/>\nreplace<br/>\nmilitary aid as our principal instrument of U.S. foreign policy. Such a<br/>\nforeign policy will<br/>\nallow many developing countries to become financially self-sufficient, help<br/>\nto eliminate<br/>\nhunger and poverty, and contribute to a flourishing global trade in a more<br/>\nprosperous<br/>\nand harmonious family of nations.&quot;<br/>\n<br/>\n John Hagelin will have the endorsement of as many as 2000 dynamic Natural<br/>\nLaw<br/>\nParty candidates for federal, state and local offices on the ballot in 50<br/>\nstates who will<br/>\nfight heart and soul for the ideas we all believe in.<br/>\n    Developing consciousness: &quot;The full development of human potential is<br/>\nthe<br/>\ncornerstone of my platform. This is because, in the final analysis,<br/>\nAmerica&#39;s problems<br/>\nare human problems-crime, domestic violence, drug dependency, and declining<br/>\nhealth in the face of an epidemic of unhealthy habits. The way to uplift<br/>\nhuman behavior<br/>\nis not through legislation regulating the details of our lives. You can&#39;t<br/>\nhave police in<br/>\nevery home, playground, business, and classroom. Instead, the way to elevate<br/>\nhuman<br/>\nbehavior is through education that expands creativity and intelligence and<br/>\nbrings broad<br/>\ncomprehension, and that harnesses America&#39;s most precious resource-our human<br/>\nresource-bringing national life into harmony with natural law. This will<br/>\nempower<br/>\npeople to govern their own lives better, so they create fewer mistakes and<br/>\nfewer<br/>\nproblems for themselves and others, and lead healthier, more productive,<br/>\nmore<br/>\nsatisfying lives.&quot;</div>","specialLinks":[]}],"prevTopicId":12441,"nextTopicId":12526}}