{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"HellElena@xxx.xxx","from":"HellElena@...","replyTo":"LIST","senderId":"AckRk8em8W7DE8h2FewvC9QkBDV88-pgaNpgtbBz0-j6yaP3cqR87CbQdkUt6QZAioixkN7wCNc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: New to the List","postDate":"937412673","msgId":2955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMDcuMjk1NS45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":2952,"nextInTopic":0,"prevInTime":2954,"nextInTime":2956,"topicId":2952,"numMessagesInTopic":0,"msgSnippet":"Hi Sheri, We do have a lot in common with our sons.  My son also has a speech problem and the school has never done anything about it.  He was evaluated once","messageBody":"<div id=\"ygrps-yiv-551004023\">Hi Sheri,<br/>\n  We do have a lot in common with our sons.  My son also has a speech problem <br/>\nand the school has never done anything about it.  He was evaluated once and <br/>\nthey decided he was ok.  He doesn&#39;t always pronounce his consonants right <br/>\neither.  As an example,  my daughters name is Chandel and he always says, <br/>\n&quot;Chanel&quot; unless I slow him down and have him pronounce it out better.  Of <br/>\ncourse I have a hearing loss so maybe that&#39;s why it&#39;s so obvious to me, he&#39;s <br/>\nway harder for me to understand.  <br/>\n  I tried like heck to get Everett into IEP but they keep refusing me.  I <br/>\nthink the school system is going down hill fast.  I can&#39;t believe they dont&#39; <br/>\nwant to catch up the kids who are little behind to save them from being <br/>\nreally behind.  It just makes no logical sense to me what so ever.<br/>\n  Everett doesn&#39;t hate learning but he&#39;s not thrilled with &quot;school work&quot; <br/>\neither.  I kept him home today and we&#39;re doing a trial run here.  I had him <br/>\nsit down with me and read the paper.  We plotted places on a map where the <br/>\nstories were taking place.  He liked that.  He wasn&#39;t into Dear Ann and Abby <br/>\nas much as I was though.  &lt;g&gt;  I&quot;m getting ready to play with money with him <br/>\nright now.  He&#39;s so happy to be home day he is right this minute cleaning the <br/>\nlivingroom for me.  He&#39;s a sweet kid.<br/>\n  Thanks for responding, we&#39;ll have to keep in touch as our sons grow.<br/>\n  Thank you to everyone who has welcomed me so far.  I&#39;m enjoying the list.<br/>\nSmiles,<br/>\nChelle<br/>\n<br/>\nIn a message dated 9/15/99 7:45:29 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SLMICHETTI@...\">SLMICHETTI@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He was in a similar situation as your son and it <br/>\n&gt;  was so frustrating!  Last year mine started 1st grade with an IEP for <br/>\n </span></blockquote>speech, <br/>\n<blockquote><span title=\"qreply\"> &gt;  reading resource and occupational therapy (for small movements).  This is <br/>\n&gt;  what he had the previous year at a different school (where he was in 1st <br/>\n&gt;  grade also).  Upon evaluation at his new school they pretty much cancelled <br/>\n&gt;  all aspects of the IEP (they said he wasn&#39;t far enough behind too!) except <br/>\n&gt;  speech - but only because he create stories that moved in a logical (or <br/>\n&gt;  chronological) order.  This all despite the fact that he is very hard to <br/>\n&gt;  understand when he talks (he has problems pronouncing many consonants and <br/>\n&gt;  letter blends).  I was so upset when they removed his IEP and he lost all <br/>\n&gt;  extra help he was getting (and desperately needed). </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"SLMICHETTI@xxx.xxx","from":"SLMICHETTI@...","replyTo":"LIST","senderId":"ICU-2PDmuBZO6KLYuZdYuk1suJt1uUoEk-sUd-PEnGl-JEbviObvuyNoeY3GL8Sfq6xVarYXN7-M","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New to the List","postDate":"937406706","msgId":2952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMDcuMjk1Mi45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":2955,"prevInTime":2951,"nextInTime":2953,"topicId":2952,"numMessagesInTopic":0,"msgSnippet":"Hello Chelle, I am farily new to this list too.  I have an 8yo boy that I pulled out of public school this year.  He was in a similar situation as your son and","messageBody":"<div id=\"ygrps-yiv-1306347504\">Hello Chelle,<br/>\n<br/>\nI am farily new to this list too.  I have an 8yo boy that I pulled out of <br/>\npublic school this year.  He was in a similar situation as your son and it <br/>\nwas so frustrating!  Last year mine started 1st grade with an IEP for speech, <br/>\nreading resource and occupational therapy (for small movements).  This is <br/>\nwhat he had the previous year at a different school (where he was in 1st <br/>\ngrade also).  Upon evaluation at his new school they pretty much cancelled <br/>\nall aspects of the IEP (they said he wasn&#39;t far enough behind too!) except <br/>\nspeech - but only because he create stories that moved in a logical (or <br/>\nchronological) order.  This all despite the fact that he is very hard to <br/>\nunderstand when he talks (he has problems pronouncing many consonants and <br/>\nletter blends).  I was so upset when they removed his IEP and he lost all <br/>\nextra help he was getting (and desperately needed).  I wish I had pulled him <br/>\nout right then and there, but I was still working full time and didn&#39;t see <br/>\nhow I was going to be able to stay home to homeschool.  He struggled so much <br/>\nthis past school year, that it just broke my heart.  He ended up HATING <br/>\nschool with a passion and has such an aversion to everything &quot;schoolish&quot; now. <br/>\n I had signed him up for a reading comprehension class this summer that I <br/>\nthought was geared towards kids that were behind in some way.  Boy was I <br/>\nwrong.  This teacher had no compassion or care for a child that wasn&#39;t <br/>\nkeeping up in her summer school class.  After many tears and feelings of <br/>\nfailure from him, I yanked him from the class.  What is sad is he didn&#39;t have <br/>\nany desire to attend a science experiments class (which he loves) due to the <br/>\nbad experience in the other class.  <br/>\n<br/>\nWe are now taking our first homeschooling year very slow and very relaxed.  I <br/>\nam hoping that he will get his love of learning back and begin to enjoy <br/>\nlearning new things.  Right now all he wants to do is play with his cars, <br/>\ntrains or Nintendo or watch tv.  We do a lot of &quot;fun&quot; learning things <br/>\ntogether like baking, playing lots of games and lots of art projects.  I just <br/>\nwanted you to know that you are not alone in the frustrating battle against <br/>\npublic schools and their lack of priority with our children.  <br/>\n<br/>\nSheri<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I talked to his teacher last week and voiced my concerns and her comments <br/>\n </span></blockquote>were &quot;Well, he isn&#39;t the lowest in the class and you can always retain him <br/>\nnext year.&quot;  Sheesh, that didn&#39;t fill me with a lot of hope.  The school has <br/>\ndecided he compensates so qualifies for no extra help though he is 2 grade <br/>\nlevels behind.  I guess you have to be 3 or 4 grade levels behind to get help <br/>\naround there which just does not make sense to me. &gt;&gt;</div>","specialLinks":[]}],"prevTopicId":2951,"nextTopicId":2958}}