{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","replyTo":"LIST","senderId":"Xn2diEIECQaSM6pWYSZSfVwqkNLXZLn0lv8us62Qm9O6eklM2Zau-7NlZ5PVWZidpwtIloxEBy9-jadTCehT3yQkdurr5MikKnlP-TNylw4MB6vW4Ho","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Paths of Learning Resource Center News:  March 2000","postDate":"953069567","msgId":7162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHYwNDAwM2ExOWI0ZjQ2MDcwMGIwNUBbMjA4LjI2LjIzNS4xMjJdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7161,"nextInTime":7163,"topicId":7162,"numMessagesInTopic":0,"msgSnippet":"Forwarded FYI: Paths of Learning Resource Center News:  March 2000 ... This newsletter is the first of a series of bi-annual announcements about the growing","messageBody":"<div id=\"ygrps-yiv-2014331371\">Forwarded FYI:<br/>\n<br/>\nPaths of Learning Resource Center News:  March 2000<br/>\n----------------------------------------------------<br/>\n<br/>\nThis newsletter is the first of a series of bi-annual announcements about<br/>\nthe growing Paths of Learning Resource Center. You are receiving this email<br/>\nbecause at some time you expressed an interest in Paths of Learning,<br/>\nholistic education, or corresponded with Robin Martin (the coordinator of<br/>\nthe Resource Center) about education issues. By being on this mailing list,<br/>\nyou will also receive occasional Book Reviews throughout the year about new<br/>\nresources being added to the Paths of Learning Resource Center.<br/>\n<br/>\nIf you would like to be removed from this mailing list, simply reply to<br/>\nthis email with the word &quot;unsubscribe&quot; at the top of your message, and you<br/>\nwill be immediately removed.<br/>\n<br/>\nIf you enjoy this newsletter, we encourage you to pass it on to your<br/>\nfriends. If you&#39;ve received this from a friend and would like to subscribe,<br/>\nplease send an email to: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:news@...\">news@...</a> with the word &quot;subscribe&quot;<br/>\nin the body of the message.<br/>\n<br/>\nAlso, please let us know if you find this newsletter useful, or if there<br/>\nare other kinds of information that you feel should be included in future<br/>\nissues.<br/>\n<br/>\n<br/>\nCONTENTS<br/>\n<br/>\n\tDecember Launch<br/>\n\tResource Highlights<br/>\n\tTips on Using the Resource Center<br/>\n\tPriorities for 2000<br/>\n\tExpanding Partnerships<br/>\n\tConferences in May and June<br/>\n\tOther Clearinghouses in Education<br/>\n\tAbout this Newsletter<br/>\n<br/>\n<br/>\n***********************************<br/>\nDecember Launch:  The Grand Opening<br/>\n***********************************<br/>\n<br/>\nAs you may know, in December the Paths of Learning Resource Center<br/>\nofficially opened its arms to the wider Internet community at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.PathsOfLearning.net\">http://www.PathsOfLearning.net</a><br/>\n<br/>\nAfter seven months of initial research, design, and development, the Center<br/>\nnow contains summaries of over 300 innovative educational publications. The<br/>\nCenter is a free online tool for anyone making decisions about<br/>\neducation--choosing between student-centered alternatives, seeking more<br/>\nways to nourish different learning styles, or wanting to know more about<br/>\nsocial/political issues involved with systemic change in education. If you<br/>\nor your organization have not already linked to our web site, we welcome<br/>\nyou to do so. On your &quot;links&quot; page, simply place the following information:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.PathsOfLearning.net\">http://www.PathsOfLearning.net</a> - a magazine and *free* online resource<br/>\ncenter to help parents, educators, researchers and policymakers who wish to<br/>\nlearn more about holistic, democratic, or learner-centered approaches to<br/>\nteaching and learning.<br/>\n<br/>\nIf the content or focus of your web site revolves around education,<br/>\neducational change, school alternatives, or related topics, we also invite<br/>\nyou to paste a free search tool of the Center&#39;s resources directly into<br/>\nyour web site. Then, your visitors can look for relevant education<br/>\nresources from our Resource Center directly from your own web site. To see<br/>\nhow this search tool works on other web sites and to access information on<br/>\nhow to set it up on your own site, please visit the sample currently posted<br/>\nat the Center for Inspired Learning:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.inspiredinside.com/learning/\">http://www.inspiredinside.com/learning/</a><br/>\n<br/>\n<br/>\n*******************<br/>\nResource Highlights<br/>\n*******************<br/>\n<br/>\nAs a searchable database, the types of materials indexed by Paths of<br/>\nLearning Resource Center that you will not often find in other databases<br/>\ninclude:<br/>\n<br/>\n* Tables of contents to back issues of such journals as the Holistic<br/>\nEducation Review, SKOLE: The Journal of Alternative Education, and Radical<br/>\nTeacher magazine.<br/>\n<br/>\n* Summary reviews of such directories and guides as the Almanac of<br/>\nEducation Choices, The Parents&#39; Guide to Alternatives in Education, and A<br/>\nto Z Home&#39;s Cool Homeschooling Web Site.<br/>\n<br/>\n* Carefully selected summaries from the Department of Education&#39;s resource<br/>\nclearinghouse (ERIC) of resources especially pertaining to learner-centered<br/>\nand holistic education options.<br/>\n<br/>\n* Current as well as out-of-print books that have significantly impacted<br/>\nhow holistic education practices are implemented which are often overlooked<br/>\nby mainstream resource clearinghouses. For all books, we try to include<br/>\ndirect links to the publishers (or out-of-print book resellers). This<br/>\nallows you to purchase the book more easily and also support small<br/>\npublishers rather than Amazon. Currently, our database contains over 90<br/>\npublishers.<br/>\n<br/>\nComing soon (in April), we encourage you to visit the Summary Reports<br/>\nsection of our web site, where you will find reports highlighting resources<br/>\nof special interest to families (parents and students), teachers,<br/>\nadministrators, and researchers.<br/>\n<br/>\n<br/>\n*********************************<br/>\nTips on Using the Resource Center<br/>\n*********************************<br/>\n<br/>\nBased on the feedback we receive from you, the users of the Center, we may<br/>\nsoon add new tools for searching and browsing our reviews and indexes of<br/>\neducational resources.  Currently, on our main &quot;simple search&quot; page, you<br/>\ncan select the search method that best reflects the type of information<br/>\nthat you are seeking. Below is a general guide that describes our primary<br/>\nsearch options. (Please let us know which search options you find most<br/>\nuseful or most frustrating.)<br/>\n<br/>\n* Search by Keywords - when you have a number of words that you wish to<br/>\nsearch across various fields (title, descriptors, or summary). Or, use<br/>\nKeywords when you want to do a quick search about a particular concept and<br/>\nare wondering whether our Resource Center suggests anything about it. Since<br/>\nthis option scans several fields (title, descriptors, summary, and biases),<br/>\nit may often yield more results than you wish. Please see<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.PathsofLearning.net/help.htm#narrow\">http://www.PathsofLearning.net/help.htm#narrow</a> for tips on &quot;Narrowing Your<br/>\nSearch&quot; to help you avoid this dilemma.<br/>\n<br/>\n* Search for an Author - when you&#39;re looking for resources created by a<br/>\nspecific person (includes editors for works by multiple authors).<br/>\n<br/>\n* Search for a Title - when you know specifically the name of the resource<br/>\nyou are seeking.<br/>\n<br/>\n* &quot;What do you wish to accomplish?&quot; provides you multiple options that<br/>\nsummarize the primary purposes, intended or unintended, of the materials<br/>\nindexed in this Resource Center.<br/>\n<br/>\n* &quot;What learning options do you would to learn more about?&quot; lists the types<br/>\nof educational alternatives which are the primary focus of this Resource<br/>\nCenter.<br/>\n<br/>\n* &quot;Whose viewpoints would you like to learn more about?&quot; lists any<br/>\nresources written ABOUT the perspectives of a particular population, such<br/>\nas students, teachers, parents, etc. (For materials written FOR a specific<br/>\naudience, please see the our Summary Reports at http://<br/>\nwww.PathsofLearning.net/reports.htm )<br/>\n<br/>\nFor more help on customizing the Resource Center to your search needs,<br/>\nplease visit our Search  Help page at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.PathsofLearning.net/help.htm,\">http://www.PathsofLearning.net/help.htm,</a> or write to us directly with your<br/>\nquestions at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:help@...\">help@...</a>. We promise to respond as soon as we<br/>\ncan (usually within 48 hours).<br/>\n<br/>\n<br/>\n*******************<br/>\nPriorities for 2000<br/>\n*******************<br/>\n<br/>\nAs we continue to expand the content in the Resource Center, the kinds of<br/>\ninformational materials that you&#39;ll find later this year include:<br/>\n<br/>\n* Resources that critically examine more learning options, such as<br/>\ndemocratic schools, folk education, home schooling (unschooling model),<br/>\nMontessori schools, teacher education, Waldorf (Steiner) schools, higher<br/>\neducation (progressive), and specific well-known alternatives (such as<br/>\nSummerhill, Sudbury, and many others) for which we have been accumulating<br/>\nmany leads into lesser known but greatly valued materials.<br/>\n<br/>\n* Resources that cover an array of purposes, such as differences between<br/>\nschooling options; outcomes of education (what really gets learned in<br/>\nschool), including alumni studies; money matters: effective funding<br/>\nstrategies; improve schools through reform and organizational management;<br/>\nprogram development within or beyond schools; ideas to integrate parenting<br/>\nand educating.<br/>\n<br/>\nFor more input to share your educational research and resource needs, we<br/>\nencourage you to visit our feedback page:<br/>\n<br/>\n\t<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.PathsofLearning.net/feedback.htm\">http://www.PathsofLearning.net/feedback.htm</a><br/>\n<br/>\nOn this page, you can sign our guestbook, complete a survey about your<br/>\ncontent needs, or participate in an online forum about the Center&#39;s ongoing<br/>\ndevelopment.<br/>\n<br/>\n<br/>\n**********************<br/>\nExpanding Partnerships<br/>\n**********************<br/>\n<br/>\nIn addition to many excellent small publishers around the globe who have<br/>\nbegun to share their materials with us, we wish to extend special thanks to<br/>\nsome of the organizations whose directors or coordinators have been so<br/>\nfriendly and forthright in offering their frank feedback and ongoing access<br/>\nto their resources.<br/>\n<br/>\nAlternative Education Resource Organization (AERO), Jerry Mintz<br/>\nCenter for School Change, Joe Nathan<br/>\nDown to Earth Books, Mary Leue<br/>\nEnCompass, Ba and Josette Luvmour and Scott Forbes<br/>\nFolk Education Association of America, Chris Spicer<br/>\nGreat Ideas in Education, Psychology Press / Holistic Education Press,<br/>\nCharlie Jakiela<br/>\nHolt Associates/Growing Without Schooling, Patrick Farenga<br/>\nHome Education Magazine, Helen Hegener<br/>\nNational Association for Core Curriculum (NACC), Gordon Vars<br/>\nNational Coalition of Alternative Community Schools (NCACS), Alan Benard<br/>\nNational Coalition for Education Activists (NCEA), Debi Duke<br/>\nResearch for Action, Kia Moore<br/>\nRethinking Schools, Michael Trokan<br/>\n<br/>\nAlthough we have not yet fully reviewed and indexed the resources made<br/>\navailable to us by all of the organizations listed above, we are in deep<br/>\ngratitude to them and many others for offering to help us grow our<br/>\ndatabase. In addition, special thanks to: Jean Reed (BrookFarm Books) for<br/>\nher many friendly comments and tips on great homeschooling resources, Ann<br/>\nZeise for her homeschooling and web resource help, and Sunny Gulati for his<br/>\nhelp with the web site graphic.<br/>\n<br/>\nEvery quarter or so as we become more aware of the innovative projects and<br/>\nresources in which our partners are actively engaged in creating, we will<br/>\nbe sharing and highlighting them in the &quot;Other Great Resources&quot; section of<br/>\nour web site.<br/>\n<br/>\n<br/>\n*****************************************<br/>\nConferences in May and June: Sign Up Now<br/>\n*****************************************<br/>\n<br/>\nIf you like meeting &quot;alternative&quot; folks in education, the National<br/>\nCoalition of Alternative Community Schools is sponsoring an excellent &quot;Hope<br/>\nfor Our Children&quot; Conference in May, which you are each warmly invited to<br/>\nattend. Among other workshop leaders (including Joseph Chilton Pearce and<br/>\nHerb Kohl), I will be making some small presentations on using the Internet<br/>\nfor information and networking in educationÖto help people unfamiliar with<br/>\nthe Net to begin sorting the chaff from the grain (realizing that it&#39;s<br/>\nmostly chaff). The conference is at Antioch College in Yellow Springs,<br/>\nOhio, May 10-14. For more information, please visit:<br/>\n<br/>\n\t<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ncacs.org/Conf2000/\">http://www.ncacs.org/Conf2000/</a><br/>\n<br/>\nAnd if you do attend the conference, be sure to introduce yourself to me!<br/>\n(You can recognize me...as I&#39;ll be the one passing out Paths of Learning<br/>\nmagazines.)<br/>\n<br/>\nAnother upcoming conference that we&#39;d like to recommend is IPEA 2000:<br/>\nInstitute for People&#39;s Education and Action.  This conference is June 26 -<br/>\nJune 30, 2000, in Deerfield, MA, and is sponsored by the Folk and People&#39;s<br/>\nEducation Association of America.  The FPEAA&#39;s 3rd annual Institute for<br/>\nPeople&#39;s Education and Action will bring together students, teachers, and<br/>\ncommunity leaders to deepen their knowledge of and extend their practice of<br/>\npeople&#39;s education: popular, folk, and community-based learning for the<br/>\npurpose of building more just and sustainable communities. &quot;People&#39;s<br/>\neducation&quot; is defined as &quot;inclusive learning among peers, based in culture<br/>\nand experience, that builds democratic communities through dialogue and<br/>\naction.&quot; For more details on this conference, please see:<br/>\n<br/>\n\t<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.peopleseducation.org/\">http://www.peopleseducation.org/</a><br/>\n<br/>\n<br/>\n*********************************<br/>\nOther Clearinghouses in Education<br/>\n*********************************<br/>\n<br/>\nFinally, if you can&#39;t find the educational materials that you are seeking<br/>\nin our Resource Center, we have also compiled a list of other<br/>\nclearinghouses that offer everything from curriculum ideas to conventional<br/>\neducational research. You will find this list of recommended sites at:<br/>\n<br/>\n\t<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.PathsOfLearning.net/other.htm\">http://www.PathsOfLearning.net/other.htm</a><br/>\n<br/>\nWhile we certainly hope to develop our database over the next few years so<br/>\nthat most of what you need for diverse ideas in holistic, alternative<br/>\noptions in education can be found at Paths of Learning, we can not be all<br/>\nthings to all people.<br/>\n<br/>\n<br/>\n----------------------------------------<br/>\nABOUT THIS NEWSLETTER<br/>\n<br/>\nThe Paths of Learning Resource Center News is a bi-annual and freely<br/>\ndistributed newsletter dealing with learner-center and holistic options in<br/>\neducation. If you would like to contribute something for the next<br/>\npublication, send it to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin@...\">robin@...</a><br/>\n<br/>\nCopyright 2000 - Foundation for Educational Renewal.<br/>\n<br/>\nYou may redistribute this newsletter for noncommercial purposes. You may<br/>\nalso redistribute individual articles in their entirety, provided you<br/>\nreference the Paths of Learning Resource Center web site at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.PathsOfLearning.net\">http://www.PathsOfLearning.net</a> and attach this paragraph.<br/>\n<br/>\n<br/>\n--<br/>\n<br/>\nRobin Ann Martin, Coordinator<br/>\nPaths of Learning Resource Center<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.PathsOfLearning.net\">http://www.PathsOfLearning.net</a><br/>\nmailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin@...\">robin@...</a></div>","specialLinks":[]}],"prevTopicId":7161,"nextTopicId":7117}}