{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Testing and the ADHD article","postDate":"1081470531","msgId":19267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYi4xZDU2ZGEyNi4yZGE3NDg0M0Bhb2wuY29tPg=="},"prevInTopic":19253,"nextInTopic":0,"prevInTime":19266,"nextInTime":19268,"topicId":19253,"numMessagesInTopic":0,"msgSnippet":" Schwa. When a vowel goes","messageBody":"<div id=\"ygrps-yiv-115035617\">&lt;&lt; Now he is playing, though a minute ago he was asking me about the word <br/>\nDragon. The o is silent mom. Then jenga. is the a silent? &gt;&gt;<br/>\n<br/>\nSchwa.<br/>\nWhen a vowel goes dull near the end of a word, it&#39;s called a schwa.  It&#39;s <br/>\nnotated (for linguistic purposes, and in some dictionaries for pronunciations) <br/>\nwith an upside-down &quot;e&quot; but they all sound the same no matter what letter is it. <br/>\n Kind of the mouth-hanging-open &quot;uh&quot; sound.<br/>\n<br/>\nI enjoyed the stories, and I&#39;m glad you&#39;re happier with his attention levels. <br/>\n Distraction (like the coin counting) works well here too.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Testing and the ADHD article","postDate":"1081269907","msgId":19253,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwMDg3MDQuMTA4MTI2OTkwODE0NS5KYXZhTWFpbC5yb290QGZvenppZS5wc3AucGFzLmVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":19267,"prevInTime":19252,"nextInTime":19254,"topicId":19253,"numMessagesInTopic":0,"msgSnippet":"Hi Friends, My hubby left the ADHD article up on the desktop yesterday. Thank you for the quick comments. I know many families in school with brilliant,","messageBody":"<div id=\"ygrps-yiv-1929732592\">Hi Friends,<br/>\n<br/>\nMy hubby left the ADHD article up on the desktop yesterday. Thank you for the quick comments. I know many families in school with brilliant, energetic kids who have medicated them because they can&#39;t behave. Every time one of these kids is around my kids, I spend hours in conversation with them. They are talkers and thinkers and are in trouble because they don&#39;t have the environment to express their idea. i.e. no one listens for very long.<br/>\n<br/>\n My 7 year old is drawn to TV. Sandra has freed me to follow his lead, not restrict something he enjoys, and hang out with him when he watches. We have a more peaceful house now, and we have seen some great shows. Just now he was banging on the piano because he likes to pester his 9 year old sis. She gives great squeals in response to his actions. I was reading the comments about ADHD and thinking this kid would be labeled so quickly if someone looked through our windows right now. He wouldn&#39;t listen to A or I, was literally bouncing to the sound of his banging. I reached up, gave him our family money jar and he has been happily counting for 5 minutes, focused, absorbed, what a teacher would want in the class. He is done now, and back to banging the piano while A tries her newest song. Now he is listening to her explain something. He has banged again, she has yelled stop. He is waiting for a turn. Now he is playing, though a minute ago he was asking me about the word Dragon. The o is silent mom. Then jenga. is the a silent?. He is starting to read and gets stumped with vowels. Obviously I have been interrupted a few times trying to compose this message. Riley is now playing gamecube, asking me is a sweet voice to help him fix the TV and read the options to him. We all are still in our pj&#39;s.  I so glad to have taken a different route.<br/>\n<br/>\nNow a bit about tests. My 9 year old loves tests. She thinks it is fun, like workbooks and things. She likes to fiqure out the tough questions afterwards with me to see how she thought through them. She will take the 4th grade Star test. I have asked her if she wants to and she said yes. Same thing last year. We are in the public school system with an independent study program which is working well for Ashley.<br/>\n<br/>\nNow Riley is a different child. Any test would freak him out. He is extremely competitive and would only want to score perfect. He would equate his scores with his self worth. He will not take any of the tests. He also does not like sit still and doesn&#39;t gravite towards holding a pencil for long, unless you are playing tic-tac-toe, hang man or other game with him. I bet he would spend most of his time filling in perfect bubbles, because he would see that any incomplete bubble is not right and all his bubbles would need to be perfect.<br/>\n<br/>\n I really don&#39;t have anything else to add. Just wanted to point out that for us, testing is seen differently depending on which child is given the test.<br/>\n<br/>\nMary H.</div>","specialLinks":[]}],"prevTopicId":19266,"nextTopicId":19257}}