{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":5047879,"authorName":"Joseph Fuerst","from":"&quot;Joseph Fuerst&quot; &lt;fuerst@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:states of being","postDate":"1009576307","msgId":30349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTAwMWMxOGZlOSRkOTZjNzQ0MCRlYTg5ODUwYUBwYXZpbGlvbj4=","referencesHeader":"PDEwMDk1NjYxNTMuMTE4MC4zMzMxMi5tMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":30348,"nextInTime":30350,"topicId":30349,"numMessagesInTopic":0,"msgSnippet":"If you don t watch out,  you may knock me right out of my denial of having grown up downwind and down water from the Fernald Uranium Processing plant. I was","messageBody":"<div id=\"ygrps-yiv-573018544\">If you don&#39;t watch out,  you may knock me right out of my denial of having<br/>\ngrown up downwind and down water from the Fernald Uranium Processing plant.<br/>\nI was never able to take advantage of the Medical monitoring due to<br/>\npregnancy, nursing.<br/>\n<br/>\nWonder if I can cleanse my self of the toxins before any cancer would begin<br/>\nto take hold.<br/>\nSusan<br/>\n<br/>\nn Fri, 28 Dec 01 11:14:16 -0500 Kolleen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kolleen@...\">Kolleen@...</a>&gt; writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m SURE that has a lot to do with it. when one&#39;s body gets to a<br/>\n </span></blockquote>certain<br/>\n<blockquote><span title=\"ireply\"> &gt; toxic level, any predisposition to disease is going to happen and<br/>\n&gt; happen fast.<br/>\n<br/>\n </span></blockquote>It&#39;s possible that my mom&#39;s very rare thyroid cancer was related to her<br/>\nbeing irradiated when she was a child, back in the forties. I can&#39;t<br/>\nremember the exact gland, maybe adrenal? a gland that&#39;s often much bigger<br/>\nin children than adults, but doctors during that time period thought that<br/>\nwas a problem and gave kids large doses of radiation to shrink it...<br/>\nwhich worked, except that the gland was supposed to be the size it<br/>\nwas....<br/>\n<br/>\nAnyway, exposure to radiation is the only known factor that will increase<br/>\nyour chances of developing anaplastic thyroid cancer - and often there<br/>\nare 20 or more years between exposure and the cancer developing, in my<br/>\nmom&#39;s case it was more like 50 years - but I imagine there are a lot of<br/>\nother toxic events that happen to people over their lives, and we just<br/>\ndon&#39;t know what effect they&#39;re having.<br/>\n<br/>\nOne in every three people will eventually develop some kind of cancer...<br/>\n<br/>\nDar<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 9<br/>\n   Date: Fri, 28 Dec 2001 11:42:03 -0500<br/>\n   From: Sarah Carothers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a>&gt;<br/>\nSubject: Re: I have picked up the book I never got a chance to really read<br/>\nQuit School and<br/>\n<br/>\nI&#39;m going to chop up the posts, too, to respond.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;On Thursday, December 27, 2001, at 06:53 PM, dljones0 wrote:<br/>\n&gt;<br/>\n&gt;&gt; Get a Life.<br/>\n<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~`<br/>\nWhen I first read this, I missed reading the subject line and<br/>\nwondered if somebody had made you mad! (did anybody else miss the<br/>\nsubject line that led into this sentence?&lt;G&gt;)<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>Mimi wrote:<br/>\n I consider unschooling to be more of a<br/>\n<blockquote><span title=\"ireply\"> &gt;style<br/>\n&gt;of parenting (or lifestyle) than purely a method of educating my<br/>\n&gt;children.  Unschooling encourages a child to grow up to be a<br/>\n&gt;happy,<br/>\n&gt;self-confident, auto-didactic, self-regulating,<br/>\n&gt;self-entertaining,<br/>\n&gt;curious and  a self-assured person.  If a person is lucky enough<br/>\n&gt;to have<br/>\n&gt;some or all of those traits then that person&#39;s education will be<br/>\n&gt;a<br/>\n&gt;natural and painless part of his/her life and s/he will be<br/>\n&gt;learning all<br/>\n&gt;the time.<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nSo true. When we go with the natural talents a child has, it *is* a<br/>\npainless procedure. But to get there, we have to release our past<br/>\nupbringing of &quot;this is how it&#39;s done&quot; and &quot;this is what you need to<br/>\nknow&quot; stuff. Hard to do but well worth it in the end.<br/>\n<br/>\nDebbie wrote:<br/>\n Since quitting school in April, I am wondering if he<br/>\n<blockquote><span title=\"ireply\"> &gt;needs<br/>\n&gt;&gt; more time to deschool because academics is just not setting<br/>\n&gt;well with<br/>\n&gt;&gt; him at all.<br/>\n&gt;+++++++++++++++++++++++<br/>\n </span></blockquote>Mimi responded:<br/>\n<blockquote><span title=\"ireply\"> &gt;That&#39;s not even nine months.  I would probably wait at least<br/>\n&gt;another<br/>\n&gt;year before I would even think about introducing academics to him<br/>\n&gt;again,<br/>\n&gt;if ever.  Deschooling can take a long time and requires a lot of<br/>\n&gt;patience on your part.  You have to totally change your ideas of<br/>\n&gt;what<br/>\n&gt;learning really is and how it happens.<br/>\n&gt;++++++++++++++++++++++++<br/>\n </span></blockquote>my response: I&#39;ve head for every year of school, deschooling takes a<br/>\nmonth so in your case, a minimum of 10 months of doing *NOTHING*<br/>\nschoolish (on your part anyway) would be needed.  When we went<br/>\nthrough the de-schooling process, dd had only been in Kindergarten<br/>\nfor about 3 months and we &#39;deschooled&#39; for 6 months before she came<br/>\nto me wanting to do something other than watch tv and play games. It<br/>\nwas well worth the wait!!!!!<br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He has just been diagnosed with ADD-inattentive type, so<br/>\n&gt;&gt; I know that hasn&#39;t helped his self-esteem, and he says he can&#39;t<br/>\n&gt;pick<br/>\n&gt;&gt; up a book because he can&#39;t retain anything he reads. That is so<br/>\n&gt;&gt; different for him, because he always used to love reading.<br/>\n&gt;++++++++++++++++++++++++++<br/>\n </span></blockquote>I have that problem as well. Try the following to see if any of it<br/>\nhelps:<br/>\n1. no florescent lighting (it can drive me crazy)<br/>\n2. try tinted overlays on the page (or tinted glasses... soft pink<br/>\nseems to work in our family)<br/>\n3. Make sure he&#39;s reading something he&#39;s *really* interested in.<br/>\nWhat happens in my case is while I&#39;m reading, I&#39;m thinking of a<br/>\nthousand other things I need to do. Have him keep a notepad beside<br/>\nhim and when he finds he&#39;s thinking about something else, jot it down<br/>\nso he won&#39;t forget about it but it will give him the sense that he&#39;s<br/>\nreleased from trying to remember whatever &#39;it&#39; is.<br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n&gt;&gt; What I would love is encouragement, advice on unschooling, and<br/>\n&gt;please<br/>\n&gt;&gt; no ridiculing because it&#39;s not as easy for me to just jump in<br/>\n&gt;like<br/>\n&gt;&gt; some of the rest of you who have done it for so long.<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nmy response: I hope I don&#39;t sound like I&#39;m ridiculing anyone; I&#39;m<br/>\nsincere and if there&#39;s ever any doubt, please ask me what I meant.<br/>\nPeople get tired of my &quot;:-)&quot; and &quot;&lt;g&gt;&quot; &#39;s so I&#39;m trying to trust that<br/>\nmy words will convey my message without the graphics but... :-) ;-)<br/>\n<br/>\nDebbie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I really admire<br/>\n&gt;&gt; this way of learning instead of having everything shoved down<br/>\n&gt;their<br/>\n&gt;&gt; throats. I grew up thinking we had to be pushed all the time and<br/>\n&gt;&gt; never had the opportunity to just sit back and make the<br/>\n&gt;decision on<br/>\n&gt;&gt; my own to learn when I wanted to.<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nmy response:<br/>\nDidn&#39;t you write somewhere that your dh isn&#39;t so supportive of your<br/>\nunschooling leanings? IMO, that&#39;s a battle all in itself that would<br/>\nbe most beneficial if you could win him over to your way of thinking.<br/>\nYou both need to show a face of confidence to your son that he *will*<br/>\nsucceed at whatever he pursues and that unschooling *is* learning<br/>\nwithout pain (which is the way it should be!).<br/>\n<br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So, please explain where I go from here. I&#39;m feeling like<br/>\n&gt;backing off<br/>\n&gt;&gt; and letting him do whatever he chooses for a while.<br/>\n<br/>\n </span></blockquote>Mimi responded:<br/>\n<blockquote><span title=\"ireply\"> &gt;++++++++++++++++++++++++++<br/>\n&gt;I think that is exactly what you should do.  Try and relax (I<br/>\n&gt;know it&#39;s<br/>\n&gt;hard).  Just let him hang out and have fun.  Let him do his<br/>\n&gt;computer<br/>\n&gt;programming.  I don&#39;t know what your relationship is like with<br/>\n&gt;him, but<br/>\n&gt;do you think you two could do stuff together like go camping or<br/>\n&gt;do some<br/>\n&gt;traveling together.  I would spend lots of time with him and<br/>\n&gt;maybe see<br/>\n&gt;if you can strengthen your relationship.  Just have lots of fun<br/>\n&gt;with him<br/>\n&gt;and FORGET school and academics.  Concentrate on being HAPPY!!!<br/>\n&gt;++++++++++++++++++++++++<br/>\n </span></blockquote>my response: DO WHAT MIMI SAID... She&#39;s right!<br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;ve tried it,<br/>\n&gt;&gt; but then I start feeling like he needs to learn, or should I<br/>\n&gt;say, do<br/>\n&gt;&gt; academics. My husband&#39;s attitude about that may tend to sway me<br/>\n&gt;in<br/>\n&gt;&gt; that direction more than I tend to want to go. My son is<br/>\n&gt;intelligent,<br/>\n&gt;&gt; has big ideas, but has trouble implementing.<br/>\n<br/>\n </span></blockquote>my response: Debbie, look at it this way. WHO says one has to finish<br/>\nhigh school by &quot;x&quot; age? If you approach it that way, what&#39;s one year<br/>\nof doing nothing? There&#39;s no catching up that needs to be done. If<br/>\nyour son were very ill and had to take a year off of school, would<br/>\nyou be in such a panic or would you sigh and say, we&#39;ll, he&#39;ll be<br/>\nfine? There&#39;s no race here to the educational finish line... there<br/>\n*is* no finish line! So consider this an experiemental year... you<br/>\nhave nothing to lose and everything to gain.<br/>\n<br/>\n<br/>\nMimi wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;I suggest you think happy and positive thoughts and think about<br/>\n&gt;how<br/>\n&gt;lucky your son is that he doesn&#39;t have to waste his time in a<br/>\n&gt;school.<br/>\n&gt;Think about how lucky you are to have him around all day.  How<br/>\n&gt;you can<br/>\n&gt;enjoy each other&#39;s company, etc.<br/>\n<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nmy response:<br/>\nYou&#39;ll have to find some things the two of you can do together once<br/>\nin awhile. Sitting at home bored to tears won&#39;t work for long. You<br/>\nsay he&#39;s crazy about computers... can you make plans to go to a<br/>\ncomputer show/extravaganza? How about just going to the bookstore and<br/>\nfinding books that interest him on computers? How about lining up a<br/>\ntrip for the two of you to a business that does what he&#39;s interested<br/>\nin? If you called and said your son would like to spend an hour or<br/>\ntwo with a mentor there and would anyone be interested in showing him<br/>\nthe business, *somebody* will be interested. Somebody will have a kid<br/>\nand relate to your situation and offer help.<br/>\n<br/>\nMimi wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;With regard to your husband, I have the same problem.  I suggest<br/>\n&gt;you try<br/>\n&gt;and educate him as best you can about unschooling.<br/>\n </span></blockquote>~~~~~~~~~~~~~~<br/>\nmy response:<br/>\nAnd if he refuses to learn about unschooling, then tell him *you*<br/>\nhave done the research and *you* think this is best for your child.<br/>\nIf he&#39;s not willing to learn about the alternatives, then he needs to<br/>\nrelinquish that parenting responsibility over to you and not<br/>\ncriticize it! :-) I had to take this approach and although dh has<br/>\nnever read any John Holt other than what I&#39;ve read out loud to him,<br/>\njust observing our kids has brought him around full circle.<br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think in time,<br/>\n&gt;&gt; however, he will do great things so I&#39;m not sure why I&#39;m<br/>\n&gt;concerned.<br/>\n </span></blockquote>Mimi wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; +++++++++++++++++++++<br/>\n&gt;He&#39;s lucky to have a mother with so much confidence in him.  Just<br/>\n&gt;keep<br/>\n&gt;thinking that way and try to relax.<br/>\n </span></blockquote>~~~~~~~~~~~~~<br/>\nmy response:<br/>\nI agree. I think you&#39;re concerned because uncharted territory is<br/>\nalways a little unsettling. But if you stick around the unschooling<br/>\nboards and lists you&#39;ll soon start feeling more at ease with your<br/>\ninclinations to unschool.  Just give it *one* year and I truly<br/>\nbelieve you&#39;ll be where you want to be.<br/>\nSarah<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 10<br/>\n   Date: Fri, 28 Dec 2001 11:57:03 -0500<br/>\n   From: Sarah Carothers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a>&gt;<br/>\nSubject: Re: I have picked up the book I never got  a chance to really read<br/>\nQuit School and<br/>\n<br/>\nIn the elementary grades, there&#39;s less emphasis on speed and grasping<br/>\nthings quickly than in  middle and high school. The pace picks up<br/>\nquite a bit. So, in your son&#39;s case, it&#39;s probably safe to say that<br/>\nhe&#39;s been able to cover up his inability to comprehend for quite some<br/>\ntime.  Now that there&#39;s this diagnosis, he&#39;s bound to be upset.<br/>\nMaybe he&#39;s angry/frustrated that he struggled for so long and nobody<br/>\never realized it or figured it out. Maybe he&#39;s gotten into more<br/>\ndetailed material so that covering up is now impossible and he&#39;s<br/>\nfeeling defeated.  (I don&#39;t know... just making assumptions based on<br/>\nmy friend&#39;s son who also had the same problem).  In my friend&#39;s case,<br/>\nher son began taking a medication (don&#39;t know which one but it was<br/>\nakin to a mild sedative) and within three weeks, he experienced<br/>\npositive results. Further, more detailed diagnosis was done and it<br/>\nwas determined that he could do the work when not put under the<br/>\nnormal time constraints.  *Maybe* by being at home your son will<br/>\nlearn to relax without the medication (that is probably a bad choice<br/>\nof wording)... I&#39;m trying to say that your son may not need<br/>\nmedications (then again, he may) but at least try<br/>\nunschooling/deschooling before drugs. There are side effects and<br/>\nconcequences to the drug route and you may very well be able to avoid<br/>\nthat if given time.<br/>\n~xx~ ~xx~ ~xx~<br/>\nSarah Carothers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, 28 Dec 2001 03:50:56 -0800 (PST), debbie jones wrote:<br/>\n&gt;His problem is in<br/>\n&gt;comprehension. Attention Deficit Disorder. That is the reason he<br/>\n&gt;gives for not being able to read. He does read on the net, yes.<br/>\n&gt;That&#39;s in smaller spurts though. He was just diagnosed with ADD<br/>\n&gt;the other day, so the label wasn&#39;t given to him until then. The<br/>\n&gt;problem with reading began, and the not wanting any form of<br/>\n&gt;academics, in the last few years. They say that all goes along<br/>\n&gt;with having ADD. If anyone on this list is familiar with it,<br/>\n&gt;please speak up.<br/>\n&gt;Debbie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 11<br/>\n   Date: Fri, 28 Dec 2001 12:06:33 -0500<br/>\n   From: Sarah Carothers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a>&gt;<br/>\nSubject: Re: Re: Superior parents...was digest 1710<br/>\n<br/>\nHi Susan,<br/>\nI totally expect to have very close ties with my dd&#39;s when they&#39;re<br/>\ngrown up. In thinking about all my hsing mom-friends, it seems we all<br/>\nhave struggles with our moms. It&#39;s also pretty clear that we&#39;re all<br/>\nstriving to not repeat the same patterns that put us in this<br/>\nposition.<br/>\n My oldest is now a teen, 15 and we&#39;re going through that stage where<br/>\nshe&#39;s a goddess and I&#39;m poison :( but compared to others I have<br/>\nobserved, we have a milder case of this than most. It&#39;s very<br/>\ndisturbing to me even though I know it&#39;s just a stage because I<br/>\n*want* to be a part of her life. So, for now, I have to choose my<br/>\nbattles because in the end, I want to be able to go to lunch with my<br/>\nadult children and laugh and tell secrets and all that good stuff. I<br/>\ndon&#39;t want to alienate her now just to make a point.<br/>\n Maybe one day *we&#39;ll* stroll in the grocery store together and have<br/>\na good time even there!<br/>\n~xx~ ~xx~ ~xx~<br/>\nSarah Carothers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a><br/>\n<br/>\n<br/>\nOn Fri, 28 Dec 2001 11:00:32 -0500, Joseph Fuerst wrote:<br/>\n&gt;Just curious,  do we (on this list) expect our children to<br/>\n&gt;have close<br/>\n&gt;relationships with us when they&#39;re grown up?<br/>\n&gt;Susan....ramblings of the day<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 12<br/>\n   Date: Fri, 28 Dec 2001 12:10:37 -0500<br/>\n   From: Sarah Carothers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a>&gt;<br/>\nSubject: Re: States of being<br/>\n<br/>\nKolleen,<br/>\nI&#39;m glad you&#39;re doing well and let&#39;s home the buggie viruses steer<br/>\nclear of you!<br/>\nYou&#39;re so right about staying de-stressed. It&#39;s so easy to get caught<br/>\nup in situations, isn&#39;t it? I have to step outside of myself and<br/>\ndecide if it&#39;s worth feeling so bad over (I get skin ulcers under<br/>\nstress). Usually I can quickly decide things are not worth the pain!<br/>\n~xx~ ~xx~ ~xx~<br/>\nSarah Carothers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a><br/>\n<br/>\n<br/>\nOn Fri, 28 Dec 01 11:14:16 -0500, Kolleen wrote:<br/>\n&gt;<br/>\n&gt;oh, and staying destressed. because emotions and happiness are a<br/>\n&gt;BIG key.<br/>\n&gt;<br/>\n&gt;warm regards,<br/>\n&gt;kolleen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 13<br/>\n   Date: Fri, 28 Dec 2001 09:35:16 -0800<br/>\n   From: Home Education Magazine &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>&gt;<br/>\nSubject: 48 Hours Article<br/>\n<br/>\n48 Hours: A Family That Plays Together<br/>\n* Suburban Family Moves To Rural Maine And Finds Peace and Love In Music:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cbsnews.com/now/story/0,1597,322113-412,00.shtml\">http://cbsnews.com/now/story/0,1597,322113-412,00.shtml</a><br/>\n<br/>\n&quot;The biggest reason why I home school is because I feel like we, as a<br/>\nnation, don&#39;t expect enough out of our kids,&quot;<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 14<br/>\n   Date: Fri, 28 Dec 2001 09:42:25 -0800<br/>\n   From: Helen Hegener &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>&gt;<br/>\nSubject: Re: state involment in H.S.<br/>\n<br/>\nAt 1:21 PM -0500 12/27/01, Wendy Silver wrote:<br/>\n&gt;Hello,<br/>\n&gt;   If anyone is involved in h.s state sponsored programs, or is<br/>\nknowledgeable<br/>\n&gt;of them, or has an opinion, please write to me at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wew99@...\">wew99@...</a>. Our<br/>\n&gt;local districts haven&#39;t done anything to entice the homeschooling<br/>\ncommunity,<br/>\n&gt;but one is asking questions, and if they are going to implement a program,<br/>\nI<br/>\n&gt;would like to offer them favorable examples or ideas.<br/>\n&gt;Wendy<br/>\n<br/>\nThere is a long-running discussion of this topic on this list:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/PPSP-H/\">http://groups.yahoo.com/group/PPSP-H/</a><br/>\n<br/>\nPublic and Private Schools and Homeschooling (PPSP-H), sponsored by<br/>\nHome Education Magazine (HEM), was created for the discussion of<br/>\nissues relating to public and private school programs which are<br/>\ndirected at and marketed to homeschooling families.<br/>\n<br/>\nTo subscribe via email send a blank emailing to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:PPSP-H-subscribe@yahoogroups.com\">PPSP-H-subscribe@yahoogroups.com</a><br/>\n<br/>\nThe archives of that list comprise what is probably the most in-depth<br/>\nexamination of the issues surrounding these programs available<br/>\nanywhere.<br/>\n<br/>\nHelen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 15<br/>\n   Date: Fri, 28 Dec 2001 09:48:42 -0800<br/>\n   From: Helen Hegener &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>&gt;<br/>\nSubject: Re: state involment in H.S.<br/>\n<br/>\nThe bookmarks area of that list offers one of the most comprehensive<br/>\ncollections of articles, essays, faqs and more on the subject of<br/>\npublic schools marketing their programs to homeschoolers:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/PPSP-H/links/Home_Education_Magaz_000979063069\">http://groups.yahoo.com/group/PPSP-H/links/Home_Education_Magaz_000979063069</a><br/>\n/<br/>\n<br/>\nFor example, here&#39;s the collection from Home Education Magazine, all<br/>\navailable online (a sloppy cut and paste, please forgive the<br/>\nformatting messies):<br/>\n<br/>\nA Homeschooler Is a Homeschooler Is a...<br/>\nLetter to the editor from Mary Griffith, May/June, 1998: &quot;We don&#39;t<br/>\nneed to divide ourselves into yet another Us and Them, Real<br/>\nHomeschoolers and Pretend Homeschoolers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ns.net/~mgriff/essays/homily.html\">http://www.ns.net/~mgriff/essays/homily.html</a><br/>\n<br/>\nLarry and Susan Kaseman, Taking Charge Column, Nov/Dec, 1997<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/HEM146.97/146.97_clmn_tkch.html\">http://www.home-ed-magazine.com/HEM/HEM146.97/146.97_clmn_tkch.html</a><br/>\n<br/>\nHomeschoolers, Is Our Good Name for Sale?<br/>\nLarry and Susan Kaseman, Taking Charge Column, Sept/Oct, 2000<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/175/tch.html\">http://www.home-ed-magazine.com/HEM/175/tch.html</a><br/>\n<br/>\nHomeschooling in Public Schools: A Dangerous Oxymoron<br/>\nLarry and Susan Kaseman, Taking Charge Column, Jan/Feb, 1999<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/HEM161.99/161.99_clmn_tch.html\">http://www.home-ed-magazine.com/HEM/HEM161.99/161.99_clmn_tch.html</a><br/>\n<br/>\nLabeling Publicly Funded Programs for Homeschooling, by Christine Webb<br/>\n From a feature section on the subject, Sept/Oct, 1998<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/HEM155.98/155.98_art_w-psap.html\">http://www.home-ed-magazine.com/HEM/HEM155.98/155.98_art_w-psap.html</a><br/>\n<br/>\nNational Homeschool Association Roundtable, 1996<br/>\nJan/Feb, 1997: &quot;Government programs to supplement homeschoolers&#39;<br/>\neducational resources (by providing services or funding) would have<br/>\naccountability strings attached.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/HEM141.97/141.97_art_nhar.html\">http://www.home-ed-magazine.com/HEM/HEM141.97/141.97_art_nhar.html</a><br/>\n<br/>\nPsst! Homeschooler, Have I Got a Carrot for You!<br/>\nLinda Dobson&#39;s NewsWatch column, July/Aug, 1997 (part two; part one<br/>\nis not online)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/HEM154.98/154.98_clmn_nws.html\">http://www.home-ed-magazine.com/HEM/HEM154.98/154.98_clmn_nws.html</a><br/>\n<br/>\nPublic School Programs and our Communities, by Janie Levine<br/>\n From a feature section on the subject, Sept/Oct, 1998<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/HEM155.98/155.98_art_l-psap.html\">http://www.home-ed-magazine.com/HEM/HEM155.98/155.98_art_l-psap.html</a><br/>\n<br/>\nThe Third Great Lie, by Chris Cardiff<br/>\nFeature article, Nov/Dec, 1996<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/136/cardiff.html\">http://www.home-ed-magazine.com/HEM/136/cardiff.html</a><br/>\n<br/>\nThe Third Great Lie: Response, by Cathy Earle<br/>\nA letter to the editors, by Cathy Earle, Jan/Feb, 1997<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cahomeschoolnet.org/counterp.htm\">http://www.cahomeschoolnet.org/counterp.htm</a><br/>\n<br/>\nHelen Hegener, Managing Editor<br/>\nHome Education Magazine<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n~Ask me about HEM&#39;s email lists! ~<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 16<br/>\n   Date: Fri, 28 Dec 2001 09:30:15 -0800<br/>\n   From: Tia Leschke &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a>&gt;<br/>\nSubject: Re: I have picked up the book I never got a chance to really read<br/>\nQuit School and<br/>\n<br/>\n<br/>\n<br/>\n&gt;  My son knows all about some of the famous people (Edison, Einstein, etc)<br/>\n&gt; who had ADD and he knows he is smart. He admires Bill Gates and has<br/>\n&gt; bought a biography of his. His problem is in comprehension. Attention<br/>\n&gt; Deficit Disorder. That is the reason he gives for not being able to read.<br/>\n&gt; He does read on the net, yes. That&#39;s in smaller spurts though. He was<br/>\n&gt; just diagnosed with ADD the other day, so the label wasn&#39;t given to him<br/>\n&gt; until then. The problem with reading began, and the not wanting any form<br/>\n&gt; of academics, in the last few years. They say that all goes along with<br/>\n&gt; having ADD. If anyone on this list is familiar with it, please speak up.<br/>\n<br/>\nWell I&#39;m probably no more familiar with it than you.  But your description<br/>\nof your son could be a description of mine.  &lt;g&gt;  And, while he hasn&#39;t been<br/>\ndiagnosed, I&#39;m more and more sure that he *is* ADD.<br/>\n<br/>\nYou say your son is keen on programming.  Is he very far along that<br/>\npath?  My son has expressed an interest, but I have no idea how to get him<br/>\nstarted.  (I started learning programming in 1970, never finished the<br/>\ncourse, and it&#39;s *way* different now.)  Do you think your son would have<br/>\nsome ideas to help mine get started?<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 17<br/>\n   Date: Fri, 28 Dec 2001 09:36:18 -0800<br/>\n   From: Tia Leschke &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a>&gt;<br/>\nSubject: Re: I have picked up the book I never got a chance to really read<br/>\nQuit School and<br/>\n<br/>\n<br/>\n&gt;  Now my only question is how to provide the necessary documentation to<br/>\n&gt; please the school district at the end of the year. I think that has been<br/>\n&gt; some of the most pressure I&#39;ve been feeling. Still a prisoner and they<br/>\n&gt; don&#39;t even attend ps anymore.<br/>\n<br/>\nI was just reading recently about MA and satisfying their regs.  It might<br/>\nhave been here, in which case you&#39;d find it in the archives.  But one of<br/>\nthe suggestions was for a MA hs list.  If you don&#39;t find it in the<br/>\narchives, maybe you could search Yahoogroups.  Or it might show up on<br/>\nunschooling.com.  At any rate, it sounded like it wouldn&#39;t be that hard to<br/>\ndo.<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 18<br/>\n   Date: Fri, 28 Dec 2001 09:43:06 -0800<br/>\n   From: Tia Leschke &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a>&gt;<br/>\nSubject: Re: Re: Superior parents...was digest 1710<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt;Why is it that we&#39;re (people in general) reduced to being our parents<br/>\n&gt;children even after we&#39;ve grown up?  It is rare to find the adult<br/>\n&gt;child/adult parent relationship that honors each other as adults.<br/>\n<br/>\nMy mother and I relate as adults.  And so do my daughter and I.  Her<br/>\nfather, on the other hand, has yet to learn that she is no longer a<br/>\nchild.  It&#39;s kind of ironic.  He spent her childhood trying to turn her<br/>\nagainst me.  And now she and I are *much* closer than they are.  She&#39;s<br/>\nactually had to write him out of her life a few times already.<br/>\n<br/>\n&gt;     The wounds inflicted (knowingly or not) by parents seem to linger at<br/>\n&gt;least a lifetime.  Have you found families you actually have friendships<br/>\n&gt;with who have manged to develop adult-adult relationships with grown<br/>\n&gt;children?<br/>\n<br/>\nI&#39;d say that we&#39;ve got that with all three of our grown kids.  We&#39;re still<br/>\nparents, and we still worry about them, but we do our best to only *offer*<br/>\nadvice, in the sense that they are free to accept or reject without hurting<br/>\nour feelings.  (And we&#39;re not perfect at this.  The &quot;kids&quot; know we&#39;re<br/>\ntrying though.)<br/>\n<br/>\n&gt;     Just curious,  do we (on this list) expect our children to have close<br/>\n&gt;relationships with us when they&#39;re grown up?<br/>\n<br/>\nI certainly always have, and it&#39;s worked.  (And the older ones all went to<br/>\nschool.)<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 19<br/>\n   Date: Fri, 28 Dec 2001 10:11:02 -0800<br/>\n   From: Helen Hegener &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>&gt;<br/>\nSubject: Relationships<br/>\n<br/>\nAt 11:00 AM -0500 12/28/01, Joseph Fuerst wrote:<br/>\n&gt;     Just curious,  do we (on this list) expect our children to have close<br/>\n&gt;relationships with us when they&#39;re grown up?<br/>\n<br/>\nI always expected a close relationship with my kids when they were<br/>\ngrown, and so far we have just that, even though three of them live<br/>\nquite a ways away (two in Alaska, one 60+ miles away), and the other<br/>\ntwo are gone more than they&#39;re home most of the time.<br/>\n<br/>\nWhat do I mean by close? Well... I was visiting the kids in Alaska<br/>\njust before Christmas and we were out doing some Christmas shopping;<br/>\nI was picking out one of those noisy-obnoxious kinds of toys grandmas<br/>\nlove to give grandkids when my oldest son grabbed me from behind,<br/>\nlifted me right up off my feet with a big bearhug, and said &quot;Mom, I<br/>\nlove you to pieces but if you get that for my daughter I&#39;m going to<br/>\nmail both it and her down to YOU!&quot; &lt;BWG&gt;<br/>\n<br/>\nSo I snuck back the next day, bought the noisemaker, wrapped it up<br/>\nand tucked it under the tree for HIM to open on Christmas - after I&#39;d<br/>\nleft! &lt;ggg&gt;<br/>\n<br/>\nRight now I&#39;m waiting for Jim, the son who lives 60 miles away, to<br/>\nshow up with his family. I was over at their place last night (yeah,<br/>\nwe all travel A LOT), and thought about just spending the night<br/>\nthere, but it was a beautiful clear moonlit night and the drive<br/>\nbetween here and there is through some of the most beautiful<br/>\nmountains anywhere, over the highest pass in the state... (and<br/>\nbesides, there&#39;s nothing like one&#39;s *own* bed and snugglies &lt;g&gt;)<br/>\n<br/>\nI&#39;d been home about ten minutes when the phone rang. It was Jim, just<br/>\nchecking to make sure I&#39;d made it home safely. Mark said it was his<br/>\nthird call, and on his call before that he&#39;d said he was giving me<br/>\nanother half hour before he started out looking for me. (Yes, I carry<br/>\na cellphone, but it doesn&#39;t work out in those mountains.)<br/>\n<br/>\nI credit my parents with teaching me how to parent. What goes around<br/>\ncomes around.<br/>\n<br/>\nHelen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 20<br/>\n   Date: Fri, 28 Dec 2001 13:27:27 -0500<br/>\n   From: Sarah Carothers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a>&gt;<br/>\nSubject: Re: Relationships<br/>\n<br/>\nI appreciate hearing  about your family, Helen.  So let&#39;s hope that<br/>\nall of us ladies here who are trying to break a bad cycle will be<br/>\nsuccessful!  Ya gotta start somewhere... why not within?<br/>\n~xx~ ~xx~ ~xx~<br/>\nSarah Carothers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a><br/>\n<br/>\n<br/>\nOn Fri, 28 Dec 2001 10:11:02 -0800, Helen Hegener wrote:<br/>\n&gt;<br/>\n&gt;I credit my parents with teaching me how to parent. What goes<br/>\n&gt;around<br/>\n&gt;comes around.<br/>\n&gt;<br/>\n&gt;Helen<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 21<br/>\n   Date: Fri, 28 Dec 2001 13:36:09 EST<br/>\n   From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nanandter@...\">nanandter@...</a><br/>\nSubject: Subject: Re: re:.......more of an unschooling approach<br/>\n<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 21<br/>\nDate: Thu, 27 Dec 2001 14:32:29 -0600<br/>\nFrom: Mimi Moorehead &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:groundhoggirl@...\">groundhoggirl@...</a>&gt;<br/>\nSubject: Re: re:.......more of an unschooling approach<br/>\n<br/>\n<br/>\nOn Thursday, December 27, 2001, at 12:38 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nanandter@...\">nanandter@...</a> wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt; Public schools &quot;say&quot; they accommodate ADD children, but let me tell you<br/>\n&gt; it is impossible for them to do so.<br/>\n&gt;<br/>\n&gt; The last year that my son was in public school they put off his 504<br/>\n&gt; Accomodation Plan meeting until January. (it should have taken place no<br/>\n&gt; later<br/>\n&gt; than October). At the meeting I asked the teacher why she had not made<br/>\n&gt; the<br/>\n&gt; accomodations that were outlined in the plan ( I had asked her on an<br/>\n&gt; almost<br/>\n&gt; daily basis up to this point), she replied that she didn&#39;t have a copy<br/>\n&gt; of the<br/>\n&gt; plan. That&#39;s when the special ed director realized that this teacher<br/>\n&gt; was a<br/>\n&gt; complete idiot, as I had been telling her. (she could&#39;ve gotten a copy<br/>\n&gt; from<br/>\n&gt; me or the special ed director, but never asked) Anything the teacher<br/>\n&gt; said<br/>\n&gt; after that point in the meeting was looked upon with suspision and I<br/>\n&gt; caught<br/>\n&gt; her in an out-and-out lie and called her on it. (she responded by<br/>\n&gt; stating<br/>\n&gt; that she &quot;didn&#39;t remember saying that&quot;).<br/>\n<br/>\n&gt;I don&#39;t want to sound like I&#39;m defending the teacher here, I&#39;m sure if<br/>\n&gt;you felt she lied, then she probably did. But, my question is, HOW COME<br/>\n&gt;THE SPECIAL ED ADMINISTRATORS DIDN&#39;T MAKE SURE SHE WAS GIVEN A &gt;COPY OF<br/>\n&gt;THE MODIFICATIONS TO KEEP IN HER FILES IN HER CLASSROOM? I feel that<br/>\n&gt;should be part of that administrators job - to make sure all the<br/>\n&gt;teachers have their mods in their classrooms.<br/>\n<br/>\nThe first day of school I informed the teacher that Andrew has Asperger<br/>\nSyndrome and he had a 504 Accomodation plan-she said that she saw that in<br/>\nhis<br/>\nfile, and she never asked for a copy so I assumed that she had one.<br/>\n<br/>\n<br/>\n<br/>\n&gt; I didn&#39;t feel it was right that it be eaten up by continuous<br/>\n&gt;trips to the Special Ed office, ESPECIALLY WHEN THE ADMINISTRATORS &gt;THERE<br/>\n&gt;HAVE SEVERAL SECRETARIES AND STUDENT HELPERS WHO COULD &gt;EASILY<br/>\n&gt;HAND-DELIVER THESE VERY IMPORTANT MODIFICATIONS TO THE VERY &gt;BUSY<br/>\n&gt;TEACHERS.<br/>\n<br/>\nI can understand the frustration,but in our case, the teacher never even<br/>\nmade<br/>\nany attempt to get his file, and you are right about the admin staff--the<br/>\nprincipal didn&#39;t give a rat&#39;s butt about my son&#39;s situation.<br/>\n<br/>\n<br/>\n&gt;The administrators should remember that the teachers are very busy<br/>\n&gt;serving their many students. They should be the ones who put those mods<br/>\n&gt;in the teacher&#39;s box or deliver them to the classroom. The teachers are<br/>\n&gt;under much more stress and are much busier than those administrators.<br/>\n<br/>\nIn this case the principal wouldn&#39;t give me the time of day. After many<br/>\n(15+)<br/>\nattempts to get a new 504 meeting, and no one returning my calls, I finally<br/>\nleft a note for the principal saying that Andrew wasn&#39;t going to school<br/>\nuntil<br/>\nshe saw me. It took her 9 school days to call me- then they marked him as<br/>\ntruant for those days because I failed to date the note and had no proof of<br/>\nwhen I left it.<br/>\n<br/>\n<br/>\n&gt;Also, was this a new teacher? Was she new to the school? Did she know<br/>\n&gt;how the system worked? I remember my first year at my last high<br/>\n&gt;school. I was totally on my own. I didn&#39;t know who anyone was, where<br/>\n&gt;anything was, or what the policies and systems were. All the other<br/>\n&gt;teachers are so incredibly busy, they don&#39;t have time to teach and/or<br/>\n&gt;direct you. I didn&#39;t have a mentor teacher to help me because I was not<br/>\n&gt;a first-year teacher. It took me almost an entire school-year before I<br/>\n&gt;felt comfortable with how things worked there.<br/>\n<br/>\nYes, she was a new teacher but I was there every day, trying to talk to her<br/>\nand get help for whatever she needed. She resisted all my efforts and also I<br/>\nstopped volunteering because she complained evey time I was there about what<br/>\nI was doing and how much time I spent with my son. She made excuses for not<br/>\ncommunicating with me and not meeting the accomodations that I asked for.<br/>\n<br/>\n<br/>\n&gt;IMO, in your son&#39;s case, the administrators should have taken some of<br/>\n&gt;the blame for not having the accommodations or modifications put into<br/>\n&gt;the hands of the teacher. There is the possibility the teacher was<br/>\n&gt;totally overwhelmed and the administrators should have realized that.<br/>\n<br/>\nI agree--everyone dropped the ball--but there&#39;s more to this story...<br/>\nI work in a major grocery chain in our community and on 3 different<br/>\noccasions<br/>\nI had kids from his classrom some in the store and tell me that &quot;Mrs.<br/>\nBrennan<br/>\nwas being mean to Andrew&quot;--lots of verbal abuse--screaming at him and<br/>\nslamming her hand down on his desk. Of course when I questiond her she<br/>\nalways<br/>\ndenied it, and Andrew never told me because he was too afraid. I know that<br/>\nhe<br/>\nwas not a behavior problem--he just required too much of her time ......<br/>\n<br/>\nNancy S<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 22<br/>\n   Date: Fri, 28 Dec 2001 12:39:02 -0600<br/>\n   From: Mimi Moorehead &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:groundhoggirl@...\">groundhoggirl@...</a>&gt;<br/>\nSubject: Re: Relationships<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt; At 11:00 AM -0500 12/28/01, Joseph Fuerst wrote:<br/>\n&gt;&gt;     Just curious,  do we (on this list) expect our children to have<br/>\n&gt;&gt; close<br/>\n&gt;&gt; relationships with us when they&#39;re grown up?<br/>\n&gt;<br/>\nYes.  My husband and I are very close to our boys now and we hope to<br/>\nremain so forever.  My husband had an extremely close and beautiful<br/>\nrelationship with his &quot;Pop&quot; (his step-grandfather).  My husband was<br/>\nraised by this wonderful man.  I credit him for the fact that my husband<br/>\nis such an excellent and loving father.  Wes, my husband, was very lucky<br/>\nto have his Pop.  He&#39;s been gone now for over 25 years, and Wes still<br/>\nmisses him terribly.  I&#39;m quite certain that my boys will be just as<br/>\nclose to my husband as he was to his Pop.  I have learned a lot from my<br/>\nhusband about how to be a loving and caring parent.<br/>\n<br/>\nMimi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 23<br/>\n   Date: Fri, 28 Dec 2001 13:36:37 -0500<br/>\n   From: &quot;Wendy Silver&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wew99@...\">wew99@...</a>&gt;<br/>\nSubject: thanks Helen<br/>\n<br/>\nThanks for all of the sites concerning states involvement in home education.<br/>\nMy own instincts tell me to run far away, but I am looking forward to<br/>\nreading many other opinions, and examples, and maybe it can help someone<br/>\nthat would never stray from the system or maybe not, I don&#39;t know.<br/>\nWendy<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wew99@...\">wew99@...</a><br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 24<br/>\n   Date: Fri, 28 Dec 2001 14:00:38 EST<br/>\n   From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:RValvo7626@...\">RValvo7626@...</a><br/>\nSubject: Re: Digest Number 1710<br/>\n<br/>\nIn a message dated 12/28/01 2:32:29 AM Mountain Standard Time,<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n&gt; They were chatting and smiling and<br/>\n&gt; clearly enjoying each others&#39; company.  I was green with envy but I<br/>\n&gt; also wanted to go up to them and tell them how lucky they are!  It&#39;s<br/>\n&gt; just not meant to be for me (and you? :( ) but one thing is sure...<br/>\n&gt; I&#39;m going to do all I can to not repeat the same mistakes with my own<br/>\n&gt; girls.<br/>\n&gt;<br/>\n&gt;    I hope to have a great relationship w/ my dd as well. My mother doesn&#39;t<br/>\nunderstand why we don&#39;t,of course it is all me and something is wrong w/ me.<br/>\nWe can sit and have tea and chat,I keep my opinions to myself and listen<br/>\nmostly. She is like a strong cup of espresso you try and drink. Just can&#39;t<br/>\ndo<br/>\nit often.<br/>\n<br/>\n   NICKI~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\nMessage: 25<br/>\n   Date: Fri, 28 Dec 2001 14:02:28 EST<br/>\n   From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:RValvo7626@...\">RValvo7626@...</a><br/>\nSubject: Re: Digest Number 1710<br/>\n<br/>\nIn a message dated 12/28/01 2:32:29 AM Mountain Standard Time,<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n&gt; About 2 years ago she threw a<br/>\n&gt; glass of water in Leroy&#39;s face because he was crying.<br/>\n<br/>\n    Awful.<br/>\n<br/>\n   NICKI~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\n________________________________________________________________________<br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":30340,"nextTopicId":30323}}