{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] can you tell me what you did today","postDate":"1044579477","msgId":58161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNjhDMDY3LjFEQkYlYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNDQ1Njc0MTguMTYwNy40NzgwNS5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":58160,"nextInTime":58162,"topicId":58161,"numMessagesInTopic":0,"msgSnippet":"... No workbooks unless your kids choose them out of the pile of workbooks, sticker books, coloring books, etc.  Their choice, no rules about having to do them","messageBody":"<div id=\"ygrps-yiv-483991522\">2/6/03 22:36:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Right now my oldest just wants to read his Garfield comic books or watch TV<br/>\n&gt; or listen to the radio or play on the computer or go sledding.  ANYTHING,<br/>\n&gt; but &quot;school&quot;.<br/>\n<br/>\n </span></blockquote>No workbooks unless your kids choose them out of the pile of workbooks,<br/>\nsticker books, coloring books, etc.  Their choice, no rules about having to<br/>\ndo them or having to spend X minutes doing &quot;seatwork&quot;.<br/>\n<br/>\nWhat you&#39;ve told us to far is that your child is capable of reading, because<br/>\nhe can read Garfield.  He&#39;s choosing to learn things visually and orally<br/>\nfrom radio and TV.  He is computer literate, and likes physical activity.<br/>\nToss our the concept of &quot;school&quot;, and you&#39;ll be unschooling!<br/>\n<br/>\nAs far as what WE did today, let&#39;s see:<br/>\n<br/>\nMy son is 6.  He played PacMan on his gameboy and beat the entire game on<br/>\nthe &quot;normal&quot; setting.  Very exciting for him.  I read email during that.<br/>\n<br/>\nWe made breakfast together.  (Instant grits.  Not THAT exciting!)<br/>\n<br/>\nTim had a l-o-n-g bath, I had a shower, and we got dressed.  He played with<br/>\nhis cars, and we repaired the broken one.  We spent some time working on his<br/>\nnew piano pieces, and he was thrilled to be able to play all the way through<br/>\na song using 2 hands together.  He read Calvin and Hobbs while I returned<br/>\nphone calls.<br/>\n<br/>\nI made lunch, and we gulped it down and ran out the door.  (We had too much<br/>\nfun this moring and were running late!)<br/>\n<br/>\nRan 3 errands, including picking up our mail on post (we&#39;re military), and<br/>\nHOORAY! our box finally came (29 days!) from BarnesandNoble.com.  A new<br/>\nCalvin book, and 2 more Garfield.  Had to drive 45 miles to buy new tap<br/>\ndancing shoes, so Tim read parts of his new books on the way.<br/>\n<br/>\nBought the shoes, went to the ATM, went to the Pharmacy, went to get some<br/>\nfried rice because Tim was &quot;starving&quot; again, and then to a friend&#39;s house.<br/>\n<br/>\nI taught my friend&#39;s son his cello lesson, and Tim read his current novel<br/>\n(From the Mixed Up Files of Mrs. Basil E. Frankweiler), and then we stayed<br/>\nfor dinner, so the boys attempted to kill each other while my friend and I<br/>\ncooked.  I think they called it wrestling, and everyone involved was<br/>\ngiggling.  We got regular reports from her little girl, so I stayed out of<br/>\nit.<br/>\n<br/>\nI went to church choir, and Tim stayed on there.  I&#39;m told he spent most of<br/>\nthe evening watching the other boy play a gameboy game.<br/>\n<br/>\nTypical day?  Well, usually we spend more time at home and less time running<br/>\nerrands.  But that&#39;s pretty typical.  Books, comics, gameboy, music,<br/>\nsomething physical, toys, maybe a movie or something, some cooking.<br/>\n<br/>\nDoes that help?<br/>\nbrenda</div>","specialLinks":[]}],"prevTopicId":58156,"nextTopicId":58137}}