{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":118406848,"authorName":"joylyn","from":"joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] RE: child&#39;s eating","postDate":"1066875524","msgId":16950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOTczQTg0LjMwOTA2MDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDIwMDMxMDIyMTMzMTUyLjUyNTkxLnFtYWlsQHdlYjE0MjAzLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDMxMDIyMTMzMTUyLjUyNTkxLnFtYWlsQHdlYjE0MjAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":16907,"nextInTopic":0,"prevInTime":16949,"nextInTime":16951,"topicId":16907,"numMessagesInTopic":0,"msgSnippet":"... I agree with this.  Forcing kids to finish the plate, or take that last bite--that gives a message I don t wanna give. Joylyn ... [Non-text portions of","messageBody":"<div id=\"ygrps-yiv-1024814086\">Retta wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Dear Julie S.,<br/>\n&gt;<br/>\n&gt; Was the child small and thin as an infant?  In other words does he <br/>\n&gt; fall into the same category he&#39;s been in historically?  Are there any <br/>\n&gt; relatives who have the appearance you described in your son?  As the <br/>\n&gt; problem started when he came off the bottle, I think I&#39;d offer him a <br/>\n&gt; bottle; go back to when it started.<br/>\n&gt;<br/>\n&gt; I think I&#39;d drop the rule about &quot;if you take it please eat it.&quot;  That <br/>\n&gt; can create pressure that prevents experimenting.  <br/>\n<br/>\n </span></blockquote>I agree with this.  Forcing kids to finish the plate, or take that last <br/>\nbite--that gives a message I don&#39;t wanna give. <br/>\n<br/>\nJoylyn<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I abhor wasting food too, and the kids understand that is a problem <br/>\n&gt; for me, but if someone takes a bite of something and doesn&#39;t like it, <br/>\n&gt; I&#39;ll eat it myself if I want to or my son will if he&#39;s interested, or <br/>\n&gt; else it gets tossed.  No one would force a baby to eat past the point <br/>\n&gt; where they indicate they&#39;re through.  We trust the baby to know her <br/>\n&gt; own body.  Why do we try to start torturous regimens after they&#39;re <br/>\n&gt; past babyhood?  If I thought I had to eat a lot of anything I took a <br/>\n&gt; bite of, I would only go for foods I already know I like and want, <br/>\n&gt; which, for your son, is junk food.  Gaging ourselves is a later skill, <br/>\n&gt; but still not a rule.<br/>\n&gt;<br/>\n&gt; If your son is addicted to highly processed carbs, then no, I wouldn&#39;t <br/>\n&gt; keep them in the house.  I&#39;d keep lots of fresh fruit though, and <br/>\n&gt; offer to cut them up and put them in a bag.  (Most recovering <br/>\n&gt; alcoholics don&#39;t keep alcohol in the house or hang out in bars if they <br/>\n&gt; really want to be free.  I&#39;m not saying your son is addicted, just <br/>\n&gt; drawing a parallel.)  You&#39;ll save money not buying expensive processed <br/>\n&gt; foods, making throwing away half-eaten foods more tolerable to the <br/>\n&gt; budget.  I have to ask myself, really, am I going to be homeless if 2 <br/>\n&gt; or 5% of food is wasted?  We&#39;re on a tight budget too, but when <br/>\n&gt; friends come over hungry I don&#39;t think twice about what the food costs.<br/>\n&gt;<br/>\n&gt; I was short and thin and had veins popping out when I was a kid.  <br/>\n&gt; (Some of my sibs are tall, some short.  I&#39;m no longer thin!)  I was <br/>\n&gt; sick all the time too.  We had plenty of sugar/white flour products in <br/>\n&gt; my house when I was a kid.  I&#39;ll bet some people can handle that, but <br/>\n&gt; my family was so dysfunctional I became a sugar junkie.  The <br/>\n&gt; &quot;sweetness&quot; was missing in our relationships, so I craved it.  I still <br/>\n&gt; like sweets, but I use them more normally now because I&#39;ve spent years <br/>\n&gt; in therapy learning to be &quot;sweet&quot; to myself in other ways.<br/>\n&gt;<br/>\n&gt; Are you unconsciously doing things that you know are bad for you?  Did <br/>\n&gt; you experience any pressure around eating when you were young?  I find <br/>\n&gt; this kind of parallel is consistently the source of difficulty for <br/>\n&gt; me.  I hold this metaphysical belief that my children have come as <br/>\n&gt; beings of light to set me free, and they&#39;ll go to any length to do it. <br/>\n&gt;<br/>\n&gt; When I&#39;m uncomfortable with what my kids do, I know it&#39;s just the <br/>\n&gt; &quot;fire&quot; and I move towards the burning of the situation rather than <br/>\n&gt; away.  If I can tolerate the heat inside myself without trying to get <br/>\n&gt; them to change to make me comfortable and without &#39;running away&#39; from <br/>\n&gt; the situation or thinking about what it all means, I fall into a place <br/>\n&gt; of clarity and obtain a mysterious knowing of how to proceed.  Like <br/>\n&gt; when I see the kids waste food - I really go inside and feel what I <br/>\n&gt; don&#39;t want to feel, because there&#39;s information for me, intelligence <br/>\n&gt; in it for me.  Our culture is not accustomed to emotional information, <br/>\n&gt; only intellectual.<br/>\n&gt;<br/>\n&gt; It sounds like you&#39;re not about to &#39;run away&#39; or try to avoid this <br/>\n&gt; problem.  And you&#39;re already in the fire, so just go into your heart <br/>\n&gt; and check out what&#39;s there.  It might break your heart, but it just <br/>\n&gt; breaks open, and that&#39;s the only way to deal with children, from an <br/>\n&gt; open heart.<br/>\n&gt;<br/>\n&gt; Please let us know how you progress.<br/>\n&gt;<br/>\n&gt; Retta<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ---------------------------------<br/>\n&gt; Do you Yahoo!?<br/>\n&gt; The New Yahoo! Shopping - with improved product search<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Sponsor<br/>\n&gt; ADVERTISEMENT<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=194081.4074964.5287182.1261774/D=egroupweb/S=1705542111:HM/A=1754016/R=0/SIG=11pv1u2ju/*http://www.ediets.com/start.cfm?code=30529&media=atkins\">http://rd.yahoo.com/M=194081.4074964.5287182.1261774/D=egroupweb/S=1705542111:HM/A=1754016/R=0/SIG=11pv1u2ju/*http://www.ediets.com/start.cfm?code=30529&media=atkins</a>&gt; <br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109501676,"authorName":"Retta","from":"Retta &lt;rettafontana@...&gt;","profile":"rettafontana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: child&#39;s eating","postDate":"1066829511","msgId":16907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDIyMTMzMTUyLjUyNTkxLnFtYWlsQHdlYjE0MjAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":16950,"prevInTime":16906,"nextInTime":16908,"topicId":16907,"numMessagesInTopic":0,"msgSnippet":"Dear Julie S., Was the child small and thin as an infant?  In other words does he fall into the same category he s been in historically?  Are there any","messageBody":"<div id=\"ygrps-yiv-259004551\">Dear Julie S.,<br/>\n <br/>\nWas the child small and thin as an infant?  In other words does he fall into the same category he&#39;s been in historically?  Are there any relatives who have the appearance you described in your son?  As the problem started when he came off the bottle, I think I&#39;d offer him a bottle; go back to when it started.<br/>\n <br/>\nI think I&#39;d drop the rule about &quot;if you take it please eat it.&quot;  That can create pressure that prevents experimenting.  I abhor wasting food too, and the kids understand that is a problem for me, but if someone takes a bite of something and doesn&#39;t like it, I&#39;ll eat it myself if I want to or my son will if he&#39;s interested, or else it gets tossed.  No one would force a baby to eat past the point where they indicate they&#39;re through.  We trust the baby to know her own body.  Why do we try to start torturous regimens after they&#39;re past babyhood?  If I thought I had to eat a lot of anything I took a bite of, I would only go for foods I already know I like and want, which, for your son, is junk food.  Gaging ourselves is a later skill, but still not a rule.<br/>\n <br/>\nIf your son is addicted to highly processed carbs, then no, I wouldn&#39;t keep them in the house.  I&#39;d keep lots of fresh fruit though, and offer to cut them up and put them in a bag.  (Most recovering alcoholics don&#39;t keep alcohol in the house or hang out in bars if they really want to be free.  I&#39;m not saying your son is addicted, just drawing a parallel.)  You&#39;ll save money not buying expensive processed foods, making throwing away half-eaten foods more tolerable to the budget.  I have to ask myself, really, am I going to be homeless if 2 or 5% of food is wasted?  We&#39;re on a tight budget too, but when friends come over hungry I don&#39;t think twice about what the food costs.<br/>\n <br/>\nI was short and thin and had veins popping out when I was a kid.  (Some of my sibs are tall, some short.  I&#39;m no longer thin!)  I was sick all the time too.  We had plenty of sugar/white flour products in my house when I was a kid.  I&#39;ll bet some people can handle that, but my family was so dysfunctional I became a sugar junkie.  The &quot;sweetness&quot; was missing in our relationships, so I craved it.  I still like sweets, but I use them more normally now because I&#39;ve spent years in therapy learning to be &quot;sweet&quot; to myself in other ways.<br/>\n <br/>\nAre you unconsciously doing things that you know are bad for you?  Did you experience any pressure around eating when you were young?  I find this kind of parallel is consistently the source of difficulty for me.  I hold this metaphysical belief that my children have come as beings of light to set me free, and they&#39;ll go to any length to do it.  <br/>\n <br/>\nWhen I&#39;m uncomfortable with what my kids do, I know it&#39;s just the &quot;fire&quot; and I move towards the burning of the situation rather than away.  If I can tolerate the heat inside myself without trying to get them to change to make me comfortable and without &#39;running away&#39; from the situation or thinking about what it all means, I fall into a place of clarity and obtain a mysterious knowing of how to proceed.  Like when I see the kids waste food - I really go inside and feel what I don&#39;t want to feel, because there&#39;s information for me, intelligence in it for me.  Our culture is not accustomed to emotional information, only intellectual.<br/>\n <br/>\nIt sounds like you&#39;re not about to &#39;run away&#39; or try to avoid this problem.  And you&#39;re already in the fire, so just go into your heart and check out what&#39;s there.  It might break your heart, but it just breaks open, and that&#39;s the only way to deal with children, from an open heart.<br/>\n <br/>\nPlease let us know how you progress.<br/>\n <br/>\nRetta<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nThe New Yahoo! Shopping - with improved product search<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":16945,"nextTopicId":16913}}