{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] table manner issues","postDate":"1089739870","msgId":96222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyOC40NjIyOTUxNC4yZTI1NzY1ZUBhb2wuY29tPg=="},"prevInTopic":96192,"nextInTopic":0,"prevInTime":96221,"nextInTime":96223,"topicId":96131,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/12/2004 12:57:43 PM Eastern Daylight Time, cmvw@comcast.net writes: It s not  about learning how to hold a knife.  To her it s about","messageBody":"<div id=\"ygrps-yiv-577121348\">In a message dated 7/12/2004 12:57:43 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cmvw@...\">cmvw@...</a> writes:<br/>\n<br/>\nIt&#39;s not  about learning how to hold a <br/>\nknife.  To her it&#39;s about learning to do  it &quot;her own way.&quot;  She sees what <br/>\nshe sees.  She knows the  difference.  We&#39;ve &quot;been there.&quot;  It&#39;s the <br/>\ncriticism, and the  correction she simply cannot handle from outside <br/>\nsources. Knowing that she  is doing it differently, of course, just <br/>\ncompounds the sensitivity of the  issue since it makes her very shy<br/>\n<br/>\n<br/>\n <br/>\n <br/>\nMy 20 yr. old son&#39;s last THREE girlfriends had problems with silverware and  <br/>\nnot being able to cut their own meat at dinner.  All were from very well to  <br/>\ndo million dollar home type families, one is the daughter of a politician  even.<br/>\n <br/>\nYou would think they could use a knife at the table without  embarrassment.  <br/>\nNo one in my family embarrassed them about it, but you  could tell asking John <br/>\nto cut their meat after a struggle with it on the plate  was embarrassing to <br/>\nthem.<br/>\n <br/>\nI think it was simply clearly a lack of practice or having a parent do it  <br/>\nfor them.  They all learned after some time of family dinners and were  using a <br/>\nknife very well before they moved on to different young men.<br/>\n <br/>\n<br/>\nWe eat dinner together every night, knives are used almost every  meal.  Not <br/>\nsome stuffy requirement but just are there.  My kids have  had the practice.  <br/>\nOther families that don&#39;t have big family meals all the  time don&#39;t get the <br/>\nsame experience.<br/>\n <br/>\nJust like everything else in life, when the need presents itself, one will  <br/>\nlearn to use the knife and fork IF it&#39;s important to them.<br/>\n <br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":90576071,"authorName":"Tosca","from":"&quot;Tosca&quot; &lt;toscasac@...&gt;","profile":"toscasac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: table manner issues","postDate":"1089676641","msgId":96192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjdjhoMSs5dXEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYuMS4yLjAuMi4yMDA0MDcxMjA5MzA1Ni4wMWNkODM1MEBtYWlsLmNvbWNhc3QubmV0Pg=="},"prevInTopic":96185,"nextInTopic":96222,"prevInTime":96191,"nextInTime":96193,"topicId":96131,"numMessagesInTopic":0,"msgSnippet":"Sadly I must add that some of these issues do not come from school. My daughter never went to school and I am not overly critical of her but she is strong","messageBody":"<div id=\"ygrps-yiv-1389451819\">Sadly I must add that some of these issues do not come from school.<br/>\nMy daughter never went to school and I am not overly critical of her <br/>\nbut she is strong willed and opionated {grumbles something about sins <br/>\nof the mother} LOL so sometimes I can&#39;t tell her anything or help her <br/>\nwith anything ie. how to use a knife for more than just sliding the <br/>\nfood around on her plate.....<br/>\n<br/>\nShe just has this wall up that says she wants to be a Big Girl <br/>\nwithout any help when clearly she needs some help or indeed has never <br/>\nbeen given any instruction in an area and isn&#39;t mastering it on her <br/>\nown.<br/>\n<br/>\nI find these struggles agonizing but I am learning to let go and try <br/>\nto just talk to her about why I want to help and how she can receive <br/>\nhelp in the way of instruction from me without giving up control or <br/>\nthe ability to try new things on her own succeed or fail.<br/>\n<br/>\nMaybe these are just normal parenting issues some of us have to face <br/>\nis how I look at it.<br/>\n<br/>\nTosca<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Christina Morrissey <br/>\nMy 12 yr abhors being corrected about ANYTHING!!!!! (Again, because <br/>\nof the pencil and school thing.) .... Had she not been made aware of <br/>\nall these &quot;differences,&quot; maybe there wouldn&#39;t have been, or not for <br/>\nas long?  or whatever...</div>","specialLinks":[]},{"userId":155725321,"authorName":"Christina Morrissey","from":"Christina Morrissey &lt;cmvw@...&gt;","profile":"cvw98012","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] table manner issues","postDate":"1089651281","msgId":96185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMS4yLjAuMi4yMDA0MDcxMjA5MzA1Ni4wMWNkODM1MEBtYWlsLmNvbWNhc3QubmV0Pg==","inReplyToHeader":"PGNlLjUxYzUzNGFkLjJlMjE2MGM5QGFvbC5jb20+","referencesHeader":"PGNlLjUxYzUzNGFkLjJlMjE2MGM5QGFvbC5jb20+"},"prevInTopic":96135,"nextInTopic":96192,"prevInTime":96184,"nextInTime":96186,"topicId":96131,"numMessagesInTopic":0,"msgSnippet":"At 08:10 ... The school aspect I m referring to is the philosophy of the one and only right way and the constant criticism she experienced doing it the","messageBody":"<div id=\"ygrps-yiv-405751636\">At 08:10<br/>\n<blockquote><span title=\"ireply\"> &gt;  AM 7/10/2004, you wrote:<br/>\n&gt;<br/>\n&gt;&lt;&lt; My son, the former sixth grader, still occasionally rants at her about <br/>\n&gt;it, and about how she holds her silverware! Both kids may never<br/>\n&gt;completely recover from &quot;school.&quot;  &gt;&gt;<br/>\n&gt;<br/>\n&gt;{{That&#39;s not a school issue.}}<br/>\n<br/>\n </span></blockquote>The &quot;school&quot; aspect I&#39;m referring to is the philosophy of the &quot;one and only <br/>\nright way&quot; and the constant criticism she experienced doing it the &quot;wrong&quot; <br/>\nway.  My son (now 16and 6&#39;..no &#39;little kid&#39; kid but a very physically <br/>\nintimidating soul) in his endearing sibling way continues to remind her of <br/>\nthe &quot;right&quot; way to do things.  (Whole &#39;nother subject and issue...what&#39;s <br/>\ngoing on between them...)<br/>\n<br/>\n&lt;&lt;There&#39;s no sense letting a little boy rant at her, but couldn&#39;t you talk <br/>\nto her about the silverware?&gt;&gt;<br/>\n<br/>\nMy 12 yr old daughter can hold a fork just fine.  It&#39;s wielding a knife <br/>\nthat she has problems with.  She holds it in her fist at a &quot;different&quot; <br/>\nangle.  She abhors being corrected about ANYTHING!!!!! (Again, because of <br/>\nthe pencil and school thing.)  So I don&#39;t anymore.  I just occasionally <br/>\nindicate the other way to hold a knife.  I figure she&#39;ll get where she <br/>\nneeds to be when she needs to.  Doesn&#39;t bother me.  It isn&#39;t messy or <br/>\nanything unsightly.  But it isn&#39;t successful.  She&#39;ll work on it in her own <br/>\nway as she has most things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&lt;&lt;    When kids don&#39;t know enough table etiquette to eat at a nice <br/>\n&gt;restaurant, it&#39;s not a good thing.  If someone never eats with the mayor <br/>\n&gt;or with the 2012 governor&#39;s council on natural learning, it would be nice <br/>\n&gt;if it was because they just didn&#39;t want to, not because they had never <br/>\n&gt;learned to hold a fork.&gt;&gt;<br/>\n </span></blockquote>Agreed, and thanks for the concern.  It&#39;s not about learning how to hold a <br/>\nknife.  To her it&#39;s about learning to do it &quot;her own way.&quot;  She sees what <br/>\nshe sees.  She knows the difference.  We&#39;ve &quot;been there.&quot;  It&#39;s the <br/>\ncriticism, and the correction she simply cannot handle from outside <br/>\nsources. Knowing that she is doing it differently, of course, just <br/>\ncompounds the sensitivity of the issue since it makes her very shy about <br/>\npracticing and even more touchy.  Had she not been made aware of all these <br/>\n&quot;differences,&quot; maybe there wouldn&#39;t have been, or not for as long?  or <br/>\nwhatever...</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] table manner issues","postDate":"1089509532","msgId":96135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzExMDEzMjEyLkJJSUgxMjg4Ny5tdGExMC5hZGVscGhpYS5uZXRAbGVpZ2g+","inReplyToHeader":"PGNlLjUxYzUzNGFkLjJlMjE2MGM5QGFvbC5jb20+"},"prevInTopic":96131,"nextInTopic":96185,"prevInTime":96134,"nextInTime":96136,"topicId":96131,"numMessagesInTopic":0,"msgSnippet":"I have a funny related story.  For background you need to know that my dh sometimes used phrases like... that guy was two cans short of a six pack or missing","messageBody":"<div id=\"ygrps-yiv-971509159\">I have a funny related story.  For background you need to know that my dh<br/>\nsometimes used phrases like...&quot;that guy was two cans short of a six pack&quot; or<br/>\n&quot;missing a couple of limbs off his tree&quot; when someone does something stupid<br/>\nesp. with regards to driving or politics.  A year or two ago when Lilly was<br/>\n5 or 6 she took a close look at the to of dh&#39;s head and said with regards to<br/>\nthe top of his head, &quot;Daddy, I think your a few pupils short of a<br/>\nschoolhouse.&quot;  I almost broke a gut laughing over that one. <br/>\n <br/>\nA little more on-topic, I think that it&#39;s important at some point to show<br/>\nyour children how to eat using common etiquette but I think that many people<br/>\nreally over do table manners rules at home.  Home should be where you can<br/>\neat and relax and not worry about someone correcting you, as long as your<br/>\nnot being overtly offensive. i.e.. picking your nose or some other<br/>\ndisgusting habit.    We&#39;ve always taken our children out to eat and we eat<br/>\nmore formally in a restaurant than we do at home.  It seemed like the kids<br/>\npicked up on this at a young age and we gently remind them if things get out<br/>\nof hand that we are dining in a public place and we need to act<br/>\nrespectfully.  They learned how to hold a fork by watching us so that&#39;s<br/>\nnever been an issue.  <br/>\n <br/>\nAngela ~  :0)<br/>\n &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n <br/>\nSandra wrote:<br/>\n Yesterday Marty and I was coaching Holly about NOT mentioning to a man (her<br/>\n<br/>\ndad, in this case) that his hair was getting thin up top.   What they can&#39;t<br/>\nsee <br/>\ndoesn&#39;t hurt them, just don&#39;t talk about it. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"table manner issues","postDate":"1089472201","msgId":96131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlLjUxYzUzNGFkLjJlMjE2MGM5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":96135,"prevInTime":96130,"nextInTime":96132,"topicId":96131,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-67044662\">&lt;&lt; My son, the former sixth grader, still occasionally rants at her <br/>\nabout it, and about how she holds her silverware! Both kids may never <br/>\ncompletely recover from &quot;school.&quot;  &gt;&gt;<br/>\n<br/>\nThat&#39;s not a school issue.<br/>\n<br/>\nThere&#39;s no sense letting a little boy rant at her, but couldn&#39;t you talk to <br/>\nher about the silverware?    When kids don&#39;t know enough table etiquette to eat <br/>\nat a nice restaurant, it&#39;s not a good thing.   Sometimes people are invited <br/>\nto banquets, at least for weddings but sometimes for social or political <br/>\npurposes, and it&#39;s nice if they know what to do with two forks, where to put the <br/>\nknife, how to use a breadplate and so forth.  And I think it starts with knowing <br/>\nhow to use a spoon for cereal and soup.  <br/>\n<br/>\nSome families don&#39;t even ask their kids to eat with their mouths closed.   <br/>\nSomeone will ask them later, and it might be the potential housemate or love <br/>\ninterest, in listing the reasons for not wanting to be with the person.   <br/>\n<br/>\nSome things, like courtesy with bathroom sharing and eating and not leaving d<br/>\nirty clothes where others have to walk (dangerous for the walker, bad for the <br/>\nclothes, bad for the relationship) and not leaving the mik out to go bad, or <br/>\nthe bread bag open for the bread to dry out or get soggy (depending where the <br/>\nbread is)...  Those aren&#39;t the kinds of choices that are good to encourage.   <br/>\n<br/>\nThe days of people using pencils for money (bookkeeping by hand, clerical <br/>\nwork by hand) are pretty much gone, and so how a person holds a pencil is minor <br/>\nin the day of keyboard/computer/data entry.   But spoons and forks are still <br/>\ncommonly used at every meal.<br/>\n<br/>\nIf I moved to Japan, I&#39;d really have to practice using chopsticks before I <br/>\ncould eat in a formal situation.   But I&#39;d expect people who grew up there to <br/>\njust know, and do it &quot;right.&quot;<br/>\n<br/>\nIf I moved to a place where they eat with pieces of flatbread, same thing.  <br/>\nI&#39;d have to forget what I know about forks, and figure out how to eat politely <br/>\ntheir-style.<br/>\n<br/>\nYesterday Marty and I was coaching Holly about NOT mentioning to a man (her <br/>\ndad, in this case) that his hair was getting thin up top.   What they can&#39;t see <br/>\ndoesn&#39;t hurt them, just don&#39;t talk about it.  She was skeptical, but we <br/>\npressed that if she didn&#39;t understand it, just trust us and never to ANYone say <br/>\nanything like that.   Marty, who often has his head shaved, said he would <br/>\nprobably feel bad when he started balding, because when he goes bald now, it&#39;s out of <br/>\nchoice.<br/>\n<br/>\nIf someone never eats with the mayor or with the 2012 governor&#39;s council on <br/>\nnatural learning, it would be nice if it was because they just didn&#39;t want to, <br/>\nnot because they had never learned to hold a fork.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":96219,"nextTopicId":96227}}