{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...&gt;","replyTo":"LIST","senderId":"nauaA10C6MBPqG30gUbGwAcVB40YtxGjP6_msSbZgwGN7yTArIh_ATRfpErbgdYEJ8eGl6ho2XhUMHo6gDieCFxM2A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] please advise","postDate":"986492266","msgId":18092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4wLjI1LjIuMjAwMTA0MDUxMjUwMTUuMDBhOTgyODBAcG9wLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDk4NjQ2MTE2Mi4zMjEuMjcwNTcubDEwQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":18091,"nextInTime":18093,"topicId":18092,"numMessagesInTopic":0,"msgSnippet":"Juli, I can t give you any more good advice than others have already given, but I had to post to you, at least to give you a virtual hug. :-)  Your story","messageBody":"<div id=\"ygrps-yiv-2008212058\">Juli, I can&#39;t give you any more good advice than others have already given, <br/>\nbut I had to post to you, at least to give you a virtual hug. :-)  Your <br/>\nstory touched me as the mom of a spirited, perfectionist and often moody <br/>\n(for lack of a better word) child, and having been a withdrawn and fearful <br/>\nkid myself. It pains us so as parents to hear our children say things that <br/>\nreflect deep emotions that are different than those prized by society: the <br/>\nworld loves confident, happy and outgoing people who have no problems. My <br/>\nson has said many times in the past that he always feels sad, that he has a <br/>\nmiserable life, and that things always go wrong for him. He takes things <br/>\nvery personally. That was so very hard to hear since we have tried so much <br/>\nto show our love and provide him with a happy and supportive home. I have <br/>\nseen him happy, although he can&#39;t seem to focus on those feelings, but <br/>\nrather concentrates on the bad things that happen. This is part of his <br/>\nbasic personality, and I still have to remind myself that his mood is not <br/>\nalways my fault. Homeschooling has gradually allowed him to grow past this <br/>\nnegativity somewhat, probably because he is free to go through these up and <br/>\ndown periods without being criticized by teachers or ostracized by other <br/>\nkids, and he spends his days in the comfort of his own routines, not those <br/>\nof others.<br/>\n<br/>\nI think we all go through mood swings in our life, like growth spurts in <br/>\nkids. Who is happy all the time?? And we all have crutches to soothe us <br/>\nemotionally in times of stress. I chewed dozens of pencils and pens as a <br/>\nkid (probably ingested a lot of lead!), and my son still chews his fingers <br/>\nand clothing when he is scared or bored. (In fact, I have urged him to chew <br/>\nhis clothing rather than his fingers when we are out to avoid the germs on <br/>\nhis fingers.) I have to admit that after 41 years, I still &quot;twirl&quot; my hair <br/>\nwith my fingers when I am nervous or while concentrating or reading (OK, <br/>\nI&#39;m doing it right now!), and it STILL bothers my mother! It is just a <br/>\nmeans for occupying my hands while my mind is at work. Your daughter has <br/>\ndeveloped a way to soother herself when she is stressed which is actually <br/>\ngood. I wish I had more concrete advice where the blanket is concerned, <br/>\nexcept to not make an issue out of it but rather focus on the positives of <br/>\nher life.<br/>\n<br/>\nI have written a lot and not helped any. I like what Laura said in another <br/>\npost:<br/>\n&quot;&quot;Is something wrong with me?&quot; is a question that haunts many of us from <br/>\nour childhood, and it breaks my heart when a child starts to wonder this. <br/>\nYou are a good and strong and loving mother. She is your perfect child. You <br/>\nare so lucky to have each other. Don&#39;t let false worries and fear creep in.<br/>\nBreathe deeply and then start to search for some truth. :)&quot;<br/>\n<br/>\nOlivia<br/>\n<br/>\n<br/>\nAt 08:59 AM 4/5/01 +0000, you wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;This might be a long one, so I understand some of you<br/>\n&gt;might have to skip it. But I&#39;d appreciate any advice<br/>\n&gt;or support from those of you with the kindness and<br/>\n&gt;patience to hear me out.<br/>\n&gt;<br/>\n&gt;My dd is 8yo. There&#39;s some suspicion she might be<br/>\n&gt;bipolar, but we haven&#39;t gotten so far yet as to seek a<br/>\n&gt;diagnosis. Partly that&#39;s because I&#39;m appalled at the<br/>\n&gt;idea of her taking medication. Partly it&#39;s a learned<br/>\n&gt;mistrust of doctors. Partly it&#39;s fear/denial.<br/>\n&gt;<br/>\n&gt;Anyway, today&#39;s incident, which has me in tears off<br/>\n&gt;and on, concerns her blanket. She has had this special<br/>\n&gt;blanket she calls BB since she was, oh, 2 or 3. It&#39;s<br/>\n&gt;very special to her, though it&#39;s nothing more than a<br/>\n&gt;raggedy scrap by now. It has to be washed frequently<br/>\n&gt;because she chews on it. We&#39;ve talked to her about the<br/>\n&gt;dye from the blanket getting into her system (she<br/>\n&gt;sometimes has bright green poop) and about the<br/>\n&gt;bacteria that grow on it from her saliva. She<br/>\n&gt;understands this, but she isn&#39;t able to give up the<br/>\n&gt;chewing. She also still sucks her thumb when trying to<br/>\n&gt;sleep or calm herself.<br/>\n&gt;<br/>\n&gt;My ds (10yo) asked her today if she would rather give<br/>\n&gt;up BB or the cat. She looked horrified at the thought<br/>\n&gt;of either choice, then said the cat. Ds and I were<br/>\n&gt;shocked, but I realized it wasn&#39;t a fair question<br/>\n&gt;because of the completely different functions the cat<br/>\n&gt;and the blanket serve for her. That&#39;s like asking me,<br/>\n&gt;would you rather give up books or your friends?<br/>\n&gt;<br/>\n&gt;Then ds asked, &quot;Would you rather lose BB or Mama?&quot; She<br/>\n&gt;thought and thought and thought for so long I started<br/>\n&gt;feeling insulted. I said, &quot;Now, really, you don&#39;t<br/>\n&gt;know? I&#39;m your Mama!&quot; She replied, &quot;I&#39;m sorry, Mama,<br/>\n&gt;but I reeeeeeally need BB.&quot; Ds was horrified and<br/>\n&gt;hugged me and petted my hair. He pressed her and she<br/>\n&gt;shouted, &quot;It&#39;s my personality, it&#39;s my life,<br/>\n&gt;everything!&quot; And then she wouldn&#39;t (or couldn&#39;t) say<br/>\n&gt;anything else at all about it.<br/>\n&gt;<br/>\n&gt;Now before anyone jumps to the conclusion that we<br/>\n&gt;somehow have a troubled relationship (I&#39;d give up my<br/>\n&gt;dad before I&#39;d give up coffee, but then, he&#39;s never<br/>\n&gt;liked me) let me assure you that we are very close,<br/>\n&gt;very open and communicative, very<br/>\n&gt;attachment-parenting. We adore each other. The other<br/>\n&gt;day she woke me with breakfast in bed just because she<br/>\n&gt;wanted to see my pleased surprise.<br/>\n&gt;<br/>\n&gt;However, I can&#39;t help being hurt. I keep crying. I<br/>\n&gt;tell myself we&#39;ll talk this over tomorrow and it&#39;ll be<br/>\n&gt;fine. Right now, she&#39;s still in her uncommunicative<br/>\n&gt;stage. Dh is out of town for work, and so is my best<br/>\n&gt;friend, and so I don&#39;t even have them to turn to for<br/>\n&gt;perspective.<br/>\n&gt;<br/>\n&gt;I really think that the reason I&#39;m so teary over this<br/>\n&gt;is NOT that I believe she loves the blanket more than<br/>\n&gt;me. In fact, I&#39;ve always believed that blankies or<br/>\n&gt;pacifiers or special teddy bears are a symbol of the<br/>\n&gt;mother. I think the reason I&#39;m so teary is that I&#39;m<br/>\n&gt;realizing that, first, the deep need of her comfort<br/>\n&gt;object, and second, the inability to speak after<br/>\n&gt;saying something that probably horrified her as much<br/>\n&gt;as it did me, I&#39;m realizing that I&#39;m scared shitless<br/>\n&gt;that she really is bipolar.<br/>\n&gt;<br/>\n&gt;I mean, ONE of the reasons (there are many)<br/>\n&gt;unschooling is so good for her is that if she&#39;s (for<br/>\n&gt;example) writing one of her illustrated stories, and<br/>\n&gt;she can&#39;t get her letters to line up perfectly and<br/>\n&gt;goes into an uncontrollable fit, she can stop, go to<br/>\n&gt;her room, cuddle up with her blanket and come back to<br/>\n&gt;the story when she&#39;s feeling better.<br/>\n&gt;<br/>\n&gt;When she was in school (kindergarten and first grade<br/>\n&gt;and the beginning of second) each year, the teachers<br/>\n&gt;started off raving about what a happy, cooperative,<br/>\n&gt;friendly child she was, so well-loved by the other<br/>\n&gt;children, so kind, etc. Then, each year, there came a<br/>\n&gt;time when we got a phone call from the teacher,<br/>\n&gt;wondering if someone had died or if there was a<br/>\n&gt;divorce going on, because Aubrey had suddenly changed<br/>\n&gt;dramatically and was now  a sullen, teary,<br/>\n&gt;non-participatory girl who had tantrums and hid from<br/>\n&gt;the other kids at recess. I would assure them there<br/>\n&gt;was no problem, that Aubrey is, in fact a very moody<br/>\n&gt;person, and that this new Aubrey was every bit as much<br/>\n&gt;the &quot;real&quot; Aubrey as the one they first met. Of course<br/>\n&gt;they thought I was covering some family secret or<br/>\n&gt;something. But one day soon, a smiling teacher would<br/>\n&gt;approach me and say maybe Aubrey had been sick or<br/>\n&gt;maybe whatever the problem was had been solved but<br/>\n&gt;they were happy to see Aubrey was back to her &quot;old<br/>\n&gt;self.&quot; This cycle would usually occur once, twice, or<br/>\n&gt;maybe three times a school year. There&#39;d be referrals<br/>\n&gt;to the school counselor for various &quot;problems&quot; such as<br/>\n&gt;perfectionism, inability to stop a creative project<br/>\n&gt;when it was time to line up (I know, I can see you<br/>\n&gt;rolling your eyes!)which was called &quot;transition<br/>\n&gt;problems&quot; and so forth. The the school counselor would<br/>\n&gt;feel the sweet thrill of success as Aubrey would<br/>\n&gt;suddenly become sunny and sweet again.<br/>\n&gt;<br/>\n&gt;I don&#39;t know how to wrap all this up, so I guess I<br/>\n&gt;just won&#39;t. I hope someone had the extraordinary<br/>\n&gt;patience to read it all.<br/>\n&gt;<br/>\n&gt;Juli, who is tearing up again. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":18038,"nextTopicId":18098}}