{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":76,"messages":[{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Sometimes it doesn&#39;t seem to work","postDate":"1086371093","msgId":95120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjMwMWM0NGE1YiRhNGVhODlkMCQwMjAxYThjMEBhby5sb3AuY29tPg==","referencesHeader":"PDFlMC4yMjUzY2E4MS4yZGYxZmRlM0Bhb2wuY29tPg=="},"prevInTopic":95118,"nextInTopic":95121,"prevInTime":95119,"nextInTime":95121,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"I wanted to make a suggestion for the computer as well. We have 5 people and 1 computer that is limping along. Our guideline was you could stay on 1 hour (we","messageBody":"<div id=\"ygrps-yiv-880270779\">I wanted to make a suggestion for the computer as well.<br/>\n<br/>\nWe have 5 people and 1 computer that is limping along.<br/>\n<br/>\nOur guideline was you could stay on 1 hour (we increased that to 2 hours) if someone was waiting to get on.  Otherwise, one person would be on for the entire day.<br/>\n<br/>\nSince then, we&#39;ve gone to each of them negotiating when they&#39;ll get off and on amongst themselves.<br/>\n<br/>\nThat seems to work well.<br/>\n<br/>\nKristen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"Julie Bogart &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sometimes it doesn&#39;t seem to work","postDate":"1086369319","msgId":95107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxODk2NEIyLUI2NEEtMTFEOC1CNUFCLTAwMEE5NUYwRjU2QUBicmF2ZXdyaXRlci5jb20+"},"prevInTopic":95106,"nextInTopic":95108,"prevInTime":95106,"nextInTime":95108,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"...  wrote: Yuck! Shyrley, this sounds very hard. ... They all appear to hate each other. The fights will reach a physical level if I","messageBody":"<div id=\"ygrps-yiv-361272338\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SHYRLEY WILLIAMS <br/>\n&lt;shyrley.williams@b...&gt; wrote:<br/>\n<br/>\nYuck! Shyrley, this sounds very hard.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; The 3 of them (12, 10 and 9) spend their time fighting and bitching. <br/>\n </span></blockquote>They all appear to hate each other. The fights will reach a physical <br/>\nlevel if I don&#39;t intervene so I spend my entire day asking one or the <br/>\nother to leave one of their siblings alone. And its quite nasty <br/>\nfighting. Name calling, punching, threatening etc.<br/>\n<br/>\nHave you ever read _Siblings Without Rivalry_ by Faber and Mazlisch? <br/>\nThat book really helped my husband and me.<br/>\n<br/>\nI see my role as the person to help facilitate communication between my <br/>\nkids. We have a practice in our home that when a kid has a beef with <br/>\nanother kid (usually shows up in yelling or calling a name), they both <br/>\nsit on the couch with one of us (parents) and we act like a therapist <br/>\nhelping create space for both perspectives and making sure that both <br/>\nkids really hear the other perspective.<br/>\n<br/>\nThis practice takes consistency and a lot of work, but the results are <br/>\ntotally worth it. Sometimes sitting on the couch all together has taken <br/>\ntwo hours to get through the issues. But the key has been making it a <br/>\nhabit.<br/>\n<br/>\nSometimes we&#39;re asked if we &quot;required&quot; them to sit and discuss if they <br/>\ndidn&#39;t want to. We used to when they were little. But now we don&#39;t. <br/>\nInstead, if they can&#39;t resolve the crisis themselves, we put the <br/>\nactivities on hold until they are ready to discuss or we schedule a <br/>\ntime to take up the issue.<br/>\n<br/>\nWe have a policy that everyone in the home deserves respectful <br/>\ntreatment. When respectful treatment isn&#39;t happening, we see it as our <br/>\njob to reset the thermostat so that all of our kids can regain their <br/>\nvoice and dignity. It&#39;s just too easy for the older ones or the more <br/>\nverbally skilled ones to run over their siblings.<br/>\n<br/>\nI know it&#39;s worked because my teens now tell me they are shocked when <br/>\nthey see other families allow the siblings to mistreat each other.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n &gt; As for the computer, they fight over it constantly. Initially we had <br/>\n </span></blockquote>it so they had an hour then gave up the machine for the one next in <br/>\nline but even then they fight or claim they have 10 minutes more. It&#39;s <br/>\nnot like its limited, they can play 24/7 and do so but still they <br/>\nfight.<br/>\n<br/>\nHave another family meeting. We discovered that our time lengths were <br/>\ntoo short (after discussing for two hours). We changed the time amounts <br/>\nto two hour turns and bought an additional computer. That changed <br/>\neverything. They just about never argue. The person who goes after the <br/>\none on the computer gives a ten minute warning to help the one on the <br/>\ncomputer to transition off of it.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n &gt; Right now I cant see any way out of this. I have to drag them to <br/>\n </span></blockquote>various hospital appointments for the sick baby which they all resent <br/>\nbut careful explanations of why we have to go and how its not the <br/>\nbaby&#39;s fault she&#39;s brain damaged fall on deaf ears.<br/>\n<br/>\nDo they have gameboys? Can they go to a friend&#39;s house? Kids often <br/>\nresent sick siblings. Can your husband help out in some way (coming <br/>\nhome during the doctor&#39;s appointments and making up the work hours on <br/>\nthe weekends)?<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n &gt; Bedtimes are a pain too. We abolished bedtimes about 4 years ago. I <br/>\n </span></blockquote>figured kids know when they are tired but nooooooooooooooo. They stay <br/>\nup as late as possible, sometimes to annoy a sibling who wishes to go <br/>\nto bed (Heather wont go upstairs unless someone else is going to bed as <br/>\nshe&#39;s scared of vampires) then they all leap out of bed at 7am after 5 <br/>\nhours sleep to beat each other to the computer. Which means they are <br/>\ncrabby and bad tempered all day.<br/>\n<br/>\nHow about rotating who starts the day on the computer? We do that with <br/>\nfront seat turns in the car.<br/>\n<br/>\nI&#39;m worried about &quot;wanting to annoy&quot; siblings. This seems bigger than <br/>\nbedtimes.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n &gt; Housework. They never want to help. Sometimes they will do a task if <br/>\n </span></blockquote>I ask, sometimes they say no. But I now feel like a skivvy. Its worse <br/>\nas the baby is very needy. She feeds hourly and needs to be held <br/>\nconstantly. The house is falling apart round my ears. I am exhausted <br/>\ndoing all the washing, cleaning, laundry. None of them will wash up as <br/>\nits &#39;yucky&#39;. They wont hang the laundry outside as they reckon the line <br/>\nis too high. My mother wouldn&#39;t have stood for this and we were *made* <br/>\nand expected to do chores. They leave their stuff lying around and then <br/>\ncomplain when something isn&#39;t washed.<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n &gt; Ay tips, or even better, anyone want them?<br/>\n<br/>\n </span></blockquote>You sound exhausted and understandably so. Hanging laundry and hand <br/>\nwashing dishes is a pain (did it in Morocco for years).<br/>\n<br/>\nCouple of thoughts.<br/>\n<br/>\nPut loose change in the washing up water. Kid who washes digs for <br/>\nchange. Light candles and play CD of choice for kid who does dishes.<br/>\n<br/>\nGet a step ladder for the wash line. Ask kids to wash and hang only <br/>\ntheir own clothes. If they don&#39;t wash and hang them, then they wear <br/>\ndirty ones. You can skip doing their laundry for three weeks at a time. <br/>\nIf they still wear filthy clothes, after three weeks, ask your dh to <br/>\ntake the kids to the park while you do laundry for one day. Then start <br/>\nover.<br/>\n<br/>\nHire a teen neighbor to do light housekeeping. I earned money in high <br/>\nschool doing that. Just let her come once a week to vacuum, clean <br/>\nbathrooms and dust.<br/>\n<br/>\nWill your baby let a teen hold her? Perhaps hire her to hold the baby <br/>\nand you do the cleaning...<br/>\n<br/>\nHope some of this helps. I really feel for you.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Sometimes it doesn&#39;t seem to work","postDate":"1086369306","msgId":95118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjA0MTcxNTA2Ljk4OTI0LnFtYWlsQHdlYjQxNzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEMxODk2NEIyLUI2NEEtMTFEOC1CNUFCLTAwMEE5NUYwRjU2QUBicmF2ZXdyaXRlci5jb20+"},"prevInTopic":95116,"nextInTopic":95120,"prevInTime":95117,"nextInTime":95119,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"I ll add my voice to those who ve said have the kids do their own laundry.  By 10 they can certainly start being responsible for their own clean clothes.  I","messageBody":"<div id=\"ygrps-yiv-1375311322\">I&#39;ll add my voice to those who&#39;ve said have the kids do their own laundry.  By 10 they can certainly start being responsible for their own clean clothes.  I started Will on his own laundry at 10 or 11.  For a time, it meant he wore dirty clothes, and a few times after three or so weeks of that, I would do the laundry for him.  My rule was I got to keep whatever spare change fell out in my washer or dryer.  He&#39;s terrible about leaving stuff in his pockets and I don&#39;t check pockets for people old enough to do their own laundry.  I would dig up all sorts of change in the washer, as well as a few ruined items (pocket video games, notes from friends, etc.) from pockets. It only took a few times of that for him to decide that he&#39;d rather not have me doing his laundry!   My mil added a few later steps -- things like how to sort, how to choose a dryer cycle, etc -- the summer he spent with them when he was 13.  <br/>\n <br/>\nAlready, the boys (3 & 8) have their own hampers in their rooms, and both put away their own clothes once folded.  Each has tried his hand at folding, and they sometimes help me fold laundry as it comes off the line.  I&#39;m beginning to think it&#39;s time to show Andy how the washer and dryer work, because he will change clothes three times some days.  He&#39;s become quite the clothes-horse.  Dan, at 3, is just the opposite -- he chooses an outfit and wants to wear it until it falls off his body in rags.  Gary reminds me it saves on laundry.  <br/>\n <br/>\nAnother huge bonus for us is that Gary&#39;s employer provides dry cleaning for uniforms, saving me three loads a week.  When we both worked office jobs, things went to the cleaners as much as possible, leaving my weekends free of special laundry and ironing.   Could you send some clothes to the cleaners -- at least your husband&#39;s things?<br/>\n <br/>\nAlso, what about paper plates and other disposable dishes/flatware?  Not terribly spendy if you shop for good sales, and certainly less hassle about dishwashing.<br/>\n <br/>\nGotta go -- Dan&#39;s just brought me a &#39;present&#39; of something in the picnic cooler.<br/>\n <br/>\nSyl<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nFriends.  Fun. Try the all-new Yahoo! Messenger<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086368433","msgId":95116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5LjQxNDg0OTQzLjJkZjIwNGIxQGFvbC5jb20+"},"prevInTopic":95113,"nextInTopic":95118,"prevInTime":95115,"nextInTime":95117,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":" The unschooling philosophy isn t a thing. ... ","messageBody":"<div id=\"ygrps-yiv-884137200\">&lt;&lt; &gt; &quot;The unschooling philosophy&quot; isn&#39;t a thing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not in the way that it takes anything into consideration.<br/>\n<br/>\n<br/>\n </span></blockquote>&lt;&lt;This isn&#39;t helpful to me.  This seems like quibbling over semantics.  &gt;&gt;<br/>\n<br/>\nMaybe it&#39;s helpful to some of the other 1500+ people signed up for the list.<br/>\n<br/>\n<br/>\nI think you&#39;re saying &quot;Give me the one answer,&quot; and I&#39;m saying &quot;The answer is <br/>\ninside you,&quot; and you&#39;re saying, &quot;No, I want the one unschooling answer.&quot;<br/>\n<br/>\nThere isn&#39;t one unschooling way.  We&#39;re talking about ideas and principles.  <br/>\nThere is no monolith.  There is no majority opinion binding on the others.<br/>\n<br/>\n-=-I was afraid I woudn&#39;t word my question or explanation in<br/>\n<br/>\njust the right, most efficient, clear and intelligent language and then the<br/>\n<br/>\nheart of my questions would go unanswered while I defended or apologized for<br/>\n<br/>\nmy mistatement, which obviously missed it&#39;s mark.  -=-<br/>\n<br/>\nWe&#39;re dealing in words.  It&#39;s all we have.<br/>\n<br/>\nI&#39;m not a good athlete.  If I go and play soccer and I miss an easy ball, <br/>\nwhat will it help if I say &quot;Right.  I was afraid to play because then when I <br/>\nmissed you would all say &#39;you missed&#39; and then I would have to defend myself&#39;&quot;?<br/>\n<br/>\nYou don&#39;t have to defend yourself.  Just consider what you read, or not.<br/>\n<br/>\n-=-I just want to know your<br/>\n<br/>\nopinions about whether someone who unschools with their family would be<br/>\n<br/>\n&quot;wrong&quot; or &quot;disrespectful&quot; if they chose to protect their young children<br/>\n<br/>\nfrom the harms of  being in front of a screen for too many hours a day, and<br/>\n<br/>\nif yes, why? -=-<br/>\n<br/>\nI think you had a pretty general idea of what kind of responses you would <br/>\nget, right?<br/>\n<br/>\n-=-Isn&#39;t the heart of what I am asking  plain<br/>\n<br/>\nenough?  Can&#39;t I get an answer without being nitpicked apart on this small<br/>\n<br/>\nstuff?-=-<br/>\n<br/>\nI didn&#39;t get the posts in that same order.  I responded to a quote in someone <br/>\nelse&#39;s and went to sleep.  Luckily, I&#39;m not the only person on this list, so <br/>\nit shouldn&#39;t have mattered.  And waiting a few hours shouldn&#39;t be too <br/>\ninconveniencing.   <br/>\n<br/>\n-=-&gt; Lots of people are giving their best advice, and the best of the best of<br/>\n<br/>\nall<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; that advice is (in my opinion, when I give advice) that which is closest<br/>\n<br/>\n </span></blockquote>to<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; natural and un-selfconscious everyday stuff (where &quot;everyday&quot; might still<br/>\n<br/>\n </span></blockquote>apply<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; to really COOL days).-=-<br/>\n<br/>\n </span></blockquote>-=-Okay, maybe I&#39;m just tired, but I&#39;m not getting this.  Could you put this<br/>\n<br/>\nanother way for me?-=-<br/>\n<br/>\nSorry. It was convoluted.  <br/>\nPeople are trying to share with you what happens on a good day.<br/>\nThey&#39;re honestly offering freely to show you how it can be.<br/>\n<br/>\n-=- Why not guide them or choose for them until<br/>\n<br/>\nthey older and more able to see and understand the effect their choices<br/>\n<br/>\ncause?-=-<br/>\n<br/>\nBecause they don&#39;t learn to choose for themselves.<br/>\nThat&#39;s one reason.<br/>\nBecause the parent won&#39;t know the child as well if the child lives to the <br/>\nparent&#39;s specifications.  That&#39;s another reason.<br/>\n<br/>\n-=-I don&#39;t want to miss something importand and useful because I didn&#39;t push <br/>\npast my own<br/>\n<br/>\ncurrent understandings.-=-<br/>\n<br/>\nBut you don&#39;t want the answers to involve semantics?<br/>\nThoughts very often involve words, terms, connotations of words.  <br/>\nIf you don&#39;t think those things matter, it will be more difficult for people <br/>\nto share their ideas with you, when words are all they have to use.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":7527178,"authorName":"CelticFrau@aol.com","from":"CelticFrau@...","profile":"celticfrau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Sometimes it doesn&#39;t seem to work","postDate":"1086368034","msgId":95113,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNkLjNmNzBiMTA5LjJkZjIwMzIyQGFvbC5jb20+"},"prevInTopic":95109,"nextInTopic":95116,"prevInTime":95112,"nextInTime":95114,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/4/2004 4:52:02 AM Eastern Standard Time, ... they wont go to the event becasue they wish to annoy one of the others. If we find an HE","messageBody":"<div id=\"ygrps-yiv-538344524\">In a message dated 6/4/2004 4:52:02 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shyrley.williams@...\">shyrley.williams@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We rarely go out as one of them wont want to go. Sometimes they announce <br/>\n </span></blockquote>they wont go to the event becasue they wish to annoy one of the others. If we <br/>\nfind an HE class only one will wish to go, usually Heather while the boys will <br/>\ncomplain and moan and make the whole experience hell as they don&#39;t want to <br/>\nparticipate or wait outside. Bryn never wants to leave the house so we can&#39;t go on <br/>\nthe home-education camps this month as he wont come. If I *make* him he&#39;ll <br/>\nruin the week for everyone else. I don&#39;t believe in making him go but it means <br/>\nnone of us can go :-(&lt;&lt;&lt;<br/>\n********************<br/>\nIt doesn&#39;t seem fair that one or two kids can have this much power over <br/>\neveryone else.  Isn&#39;t this the same as parents forcing kids to go someplace or do <br/>\nsomething?  Can you tell the child you&#39;re sorry he&#39;s not interested, but <br/>\nsometimes he&#39;ll have to go, then maybe find something really interesting for him to <br/>\ndo while he&#39;s there?  Puzzle books?  Games?  Something you could hide then <br/>\npull out for these trips?<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Housework. They never want to help. Sometimes they will do a task if I <br/>\n </span></blockquote>ask, sometimes they say no. But I now feel like a skivvy. Its worse as the baby <br/>\nis very needy. She feeds hourly and needs to be held constantly. The house is <br/>\nfalling apart round my ears. I am exhausted doing all the washing, cleaning, <br/>\nlaundry. None of them will wash up as its &#39;yucky&#39;. They wont hang the laundry <br/>\noutside as they reckon the line is too high. My mother wouldn&#39;t have stood for <br/>\nthis and we were *made* and expected to do chores. They leave their stuff lying <br/>\naround and then complain when something isn&#39;t washed.&lt;&lt;&lt;<br/>\n******************************<br/>\nWalmart has really cheap laundry baskets.  Could you get each kid a basket, <br/>\nput their name on it, put it in their room, for them to put their own dirty <br/>\nclothes in?  When the basket&#39;s full, they could do their own clothes, and hang <br/>\nthem (lower the line).  If they choose not to do it, then they don&#39;t have clean <br/>\nclothes.  No arguing, complaining or fussing.  Maybe you need to put the ball <br/>\nin their court quite a bit more.  One person can only do so much, and you&#39;re <br/>\ntaking care of a baby too.  I&#39;d just let everyone know, that you&#39;ll do what you <br/>\ncan, but you&#39;re spread so thin right now that unless everyone helps, some <br/>\nthings just won&#39;t get done.  Teach the kids how to cook.  Find things around the <br/>\nhouse that they LIKE to do, and have them do that.  Pay them to pick up some <br/>\nslack and do some extra things.  <br/>\n<br/>\nNancy B.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAy tips, or even better, anyoe want them?<br/>\n<br/>\nShyrley<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Sometimes it doesn&#39;t seem to work","postDate":"1086366691","msgId":95109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMC4yMjUzY2E4MS4yZGYxZmRlM0Bhb2wuY29tPg=="},"prevInTopic":95108,"nextInTopic":95113,"prevInTime":95108,"nextInTime":95110,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/4/04 2:52:08 AM, shyrley.williams@btinternet.com writes: ","messageBody":"<div id=\"ygrps-yiv-739011218\">In a message dated 6/4/04 2:52:08 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shyrley.williams@...\">shyrley.williams@...</a> writes:<br/>\n<br/>\n&lt;&lt; Bryn never wants to leave the house so we can&#39;t go on the home-education <br/>\ncamps this month as he wont come. &gt;&gt;<br/>\n<br/>\nLeave him with your husband or your mom.  Ship him by train to your mom&#39;s.<br/>\nGive him a choice where one of the choices is less attractive than the camp, <br/>\nbut NONE of the choices are preventing the rest of the family from going.<br/>\n<br/>\n-=-As for the computer, they fight over it constantly. Initially we had it so <br/>\nthey had an hour then gave up the machine for the one next in line but even <br/>\nthen they fight or claim they have 10 minutes more. It&#39;s not like its limited, <br/>\nthey can play 24/7 and do so but still they fight.-=-<br/>\n<br/>\nWe&#39;ve always had whoever has it can play until he&#39;s through.  The other <br/>\ncannot bug him, remind him, whine or beg.  The other has to leave him alone.  It&#39;s <br/>\nworked since they were little, but I had to enforce the &quot;get away and leave <br/>\nhim alone) a few times.     It still works now, with two computers and five <br/>\npeople.  Someone can say &quot;I&#39;d like to be next&quot; and the person lets that one know <br/>\nwhen he&#39;s off.<br/>\n<br/>\n-=-Right now I cant see any way out of this. I have to drag them to various <br/>\nhospital appointments for the sick baby which they all resent but careful <br/>\nexplanations of why we have to go and how its not the baby&#39;s fault she&#39;s brain <br/>\ndamaged fall on deaf ears.-=-<br/>\n<br/>\nCan your husband come home to stay with them while you go to the doctor?  Is <br/>\nhis schedule ever flexible, or could he take family leave?<br/>\n<br/>\n-=-Bedtimes are a pain too. We abolished bedtimes about 4 years ago.-=-<br/>\n<br/>\nInstead of &quot;abolishing&quot; anything it works better when people loosen up, see <br/>\nwhat&#39;s really necessary and what&#39;s not, and say &quot;yeah, sure!&quot; to their kids <br/>\nlots and lots of times instead of one big confusing &quot;I don&#39;t care anymore.&quot;<br/>\n<br/>\n-=-then they all leap out of bed at 7am after 5 hours sleep to beat each <br/>\nother to the computer. Which means they are crabby and bad tempered all day.-=-<br/>\n<br/>\nWhoever had it when he decided to turn it off and go to bed has finished his <br/>\nturn, and it&#39;s the next kid&#39;s turn in the morning as soon as he gets up.  If <br/>\nthe last-last-night gets up first, he can have it until the rightful-turn kid <br/>\ngets up and claims it (maybe after toilet and breakfast, at that kid&#39;s option). <br/>\n That&#39;s the way it works here.   &quot;I&#39;m next&quot; can easily roll around the clock.<br/>\n<br/>\n-=-They wont hang the laundry outside as they reckon the line is too high. My <br/>\nmother wouldn&#39;t have stood for this and we were *made* and expected to do <br/>\nchores. -=-<br/>\n<br/>\nMake a lower line, or get them a box to stand on.  <br/>\nIf your mothers methods seem better to you, you should use them.  Really.<br/>\n<br/>\nUnschooling should only even be attempted if it seems better than the <br/>\nalternatives.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086365881","msgId":95108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkLmU2ZjI2NjAuMmRmMWZhYjlAYW9sLmNvbT4="},"prevInTopic":95107,"nextInTopic":95109,"prevInTime":95107,"nextInTime":95109,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/4/04 2:50:51 AM, salten@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-1671550515\">In a message dated 6/4/04 2:50:51 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salten@...\">salten@...</a> writes:<br/>\n<br/>\n&lt;&lt; &lt;&lt;&lt;&quot;Exhibiting behaviors&quot;?<br/>\nThat&#39;s so clinical.  Do you mean he was making choices?&gt;&gt;&gt;<br/>\n <br/>\n&lt;&lt;Sorry-that&#39;s the scientist in me talking.  I was referring to the<br/>\nmoodiness, lethargy, circles under the eyes, etc. that Andrea had<br/>\ndescribed as being a result of watching TV in her daughter.  Do you mean<br/>\nhe was choosing to be grouchy?  Gosh it sure seems like it sometimes ;) &gt;&gt;<br/>\n<br/>\nIf my mom were looking for justifications for limiting my choices, I would be <br/>\ngrouchy.  If there was a cause, it might be my mom&#39;s treatment and my <br/>\ninability to figure out, at a young age, how to assert myself otherwise.<br/>\n<br/>\n-=-I was using the word control because it was used in an earlier post<br/>\nabout parents controlling what the child eats.  Here, I was wondering<br/>\nhow much control the media has over what the child eats.  But you are<br/>\nsaying that ultimately he is just following his desires, and that he can<br/>\nnot be manipulated by advertising?  I&#39;m not quite sure I understand this<br/>\npart.-=-<br/>\n<br/>\nIf someone uses the word &quot;control&quot; three times in one post, that&#39;s <br/>\nindiciative that they are thinking in terms of control, I think.  <br/>\n<br/>\nThe media has NO control over what your child eats.   None.  No control.  <br/>\nInfluence?  &quot;Power of suggestion&quot;?  Maybe.  Parents have influence too.  And if <br/>\nthey use it carefully, children are unlikely to prefer other input over <br/>\nparental same-old/same-old.<br/>\n<br/>\n-=-But you are<br/>\nsaying that ultimately he is just following his desires, and that he can<br/>\nnot be manipulated by advertising?  I&#39;m not quite sure I understand this<br/>\npart.<br/>\n-=-<br/>\n<br/>\nAre you manipulated by advertising?<br/>\nI&#39;m not.<br/>\nAre you manipulated by things you read here?<br/>\nI&#39;m not.<br/>\nDo you think about things you read here, filtering them through your own <br/>\nknowledge and experience?   <br/>\n<br/>\nGosh I hope so.<br/>\n<br/>\nWhen I see an advertisement for food, on a billboard, side of a truck, <br/>\nmagazine ad, TV commercial, I might think &quot;Oh, I should thaw out that chicken,&quot; or <br/>\n&quot;I wonder if Kirby will have eaten when he gets home?&quot;   I have never once in <br/>\n50 years jumped up zombie-like and gone to that eatery or to a store and bought <br/>\nthat product.    It never occurred to me that my kids might, either.   And <br/>\nthey haven&#39;t.  <br/>\n<br/>\n-=-&lt;&lt;&lt;&lt;-=-he would<br/>\nchoose to eat the junk food, and therefore be under the control of the<br/>\nfood industry and the advertisers, which to me is less preferable than<br/>\nbeing under my control. -=-<br/>\n-=-I&#39;m not so much worried about what you think (although I do care) as I<br/>\nam curious about how you navigate these kinds of issues. -=-<br/>\n<br/>\nI don&#39;t navigate things that don&#39;t exist.<br/>\nMy children have never been under the control of the food industry and the <br/>\nadvertisers.<br/>\nMy children have never been NEARLY under the control of the food industry and <br/>\nthe advertisers, so you&#39;re asking how people nagivate an issue that doesn&#39;t <br/>\nexist.<br/>\n<br/>\nThe way people &quot;navigate&quot; their own fears is to pluck them out and lay them <br/>\nin the sunshine to dry, instead of keeping them in the moist emotional depths <br/>\nof themselves, unexamined.<br/>\n<br/>\n-=-But for a more concrete example, what if the child has a<br/>\nsevere food allergy?  Clearly in this case the parents DO need to limit<br/>\nthe child&#39;s food choices.  -=-<br/>\n<br/>\nLet&#39;s not ALL live as though our children have food allergies.  That&#39;s an <br/>\nexception.<br/>\nLet&#39;s not say &quot;What if your child is blind?&quot; when someone is recommending <br/>\npicture books.<br/>\n<br/>\n-=-At your house, they have helped cause you to<br/>\nunschool, and to be afraid, and to prefer controlling your child.&gt;&gt;&gt;&gt;<br/>\n <br/>\n-=-Hey, at least they did one good thing! -=-<br/>\n<br/>\nI really hope that was a joke.  It doesn&#39;t reflect well on you if it was an <br/>\nhonest sentiment.<br/>\n<br/>\n-=-He&#39;s only a victim of it if he has not learned<br/>\nto think for himself, and he can&#39;t learn to think for himself if he is<br/>\nnever given any choices.  I think I understand.-=-<br/>\n<br/>\nMaybe starting to get a glimpse. <br/>\nIt&#39;s not enough to understand that bicycles can work in theory...<br/>\n<br/>\n-=-It reminds me of the idea that when you resent<br/>\nsomeone, you give your life over to him, and he controls you.  I do have<br/>\nsome pretty strong feelings about this as you can tell. -=-<br/>\n<br/>\nI really (really) would prefer NOT to have this discussion on the list, but <br/>\nit might help you (or anyone else with similar deepseated anger that&#39;s keeping <br/>\nyou from spending that time and energy with your child) to consider farming in <br/>\nANY place and time in history, and whether after mass agriculture (from the <br/>\nMesopotanian cultures on) there was food grown without some form of slave <br/>\nlabor.  Don&#39;t talk about it here.  Just go and look at history, various cultures, <br/>\nvarious places, anything past subsistence farming.  Whether serfs or <br/>\nsharecroppers or farmers having as many kids as they could and taking in orphans, it&#39;s <br/>\nnot the current situations that are surprising, it&#39;s the lack of historical <br/>\nperspective of someone who would be that concerned and yet not look at it in <br/>\ncontext.<br/>\n<br/>\n[and as the policies of the list say don&#39;t post what you don&#39;t want <br/>\ndiscussed, I must play my &quot;keep it about unschooling&quot; card and say that I&#39;ve just <br/>\ncancelled it out, and this is a small part of a long post, and I don&#39;t want it <br/>\ndiscussed here]<br/>\n<br/>\nSandra<br/>\n1/3 of &quot;the listowner&quot; triumverate</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086364713","msgId":95106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0LjRmYjViMGRiLjJkZjFmNjI5QGFvbC5jb20+"},"prevInTopic":95105,"nextInTopic":95107,"prevInTime":95105,"nextInTime":95107,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/04 9:04:10 PM, aburlingame@centurytel.net writes: ","messageBody":"<div id=\"ygrps-yiv-1060586626\">In a message dated 6/3/04 9:04:10 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> writes:<br/>\n<br/>\n&lt;&lt; This isn&#39;t really a problem in and of<br/>\n<br/>\nitself, but inevitably she wants to watch movies just all the time,<br/>\n<br/>\nsometimes even asking for a movie before the sleep is dried from her eyes in<br/>\n<br/>\nthe morning.  &gt;&gt;<br/>\n<br/>\nWhy &quot;inevitably&quot;?<br/>\nI don&#39;t think it&#39;s a matter of inevitability.  That&#39;s a damning word to use.<br/>\n<br/>\n-=-sometimes even asking for a movie before the sleep is dried from her eyes <br/>\nin<br/>\n<br/>\nthe morning-=-<br/>\n<br/>\nIf she woke up and started reading a book before you got there, would you say <br/>\n&quot;inevitably&quot;?  Would you feel you should never have let her have access to <br/>\nbooks?<br/>\n<br/>\n-=- When I tried out just letting them have unlimited access, the<br/>\n<br/>\ngirls, especially Stella, would want to do nothing but watch movies.  -=-<br/>\n<br/>\nIf you had actually done it intead of trying it out, you would have had <br/>\ndifferent results.  Honestly, kids can tell when something is a trial run, and they <br/>\nwill often grasp desperately at whatever they can get out of it before the <br/>\nmom [inevitably] changes her mind.<br/>\n<br/>\n-=-And Icould plainly see it wasn&#39;t good for them.  After watching for an <br/>\nhour or<br/>\n<br/>\ntwo or sometimes more, they would be SO grumpy  or completely wound up.-=-<br/>\n<br/>\nGrumpy when you made them stop?<br/>\nOr grumpy when it was ongoing and you were sharing it with them and being <br/>\nwith them?<br/>\n<br/>\n-=-  And I could plainly see it wasn&#39;t good for them.  ...<br/>\n<br/>\nStella even gets circles under her eyes after a long bout of tv.-=-<br/>\n<br/>\nWell you were plainly looking for proof it wasn&#39;t any good, so for you I <br/>\nthink it was inevitable (imperative) that you find some.<br/>\n<br/>\n-=- Also, Stella&#39;s play started to be really regimented and<br/>\n<br/>\nunimaginative.  She would no longer combine stories and add her own elements<br/>\n<br/>\nto them, but she would say exactly what she heard on the show.-=-<br/>\n<br/>\nDo you every  hear people quote their favorite authors or quote Shakespeare <br/>\nor report something really interesting someone else said, in their exact words? <br/>\n It&#39;s not considered to be a low-intelligence failing.<br/>\n<br/>\n-=-While she would occassionally  learn something interesting, I felt she <br/>\nlearned much<br/>\n<br/>\nmore and had more fun when she was getting more varied input. -=-<br/>\n<br/>\nHow varied are books?  They&#39;re always paper, and they always go from front to <br/>\nback, in English.  Top to bottom.  Every single book.  Maybe more varied <br/>\ninput...<br/>\n<br/>\n-=-I went back to limiting tv, because I felt she<br/>\n<br/>\ndidn&#39;t know how to self-limit yet. -=-<br/>\n<br/>\nSo your only acceptable outcome would have been if she had made the choices <br/>\nyou would have made for her?  <br/>\n<br/>\n-=-In other words, I protected her from herself.  Is that disrespectful?  -=-<br/>\n<br/>\nI think it shows a lack of real observation and analysis, honestly.<br/>\nFrom your report, she was watching kid movies without you.  If you watched <br/>\nwith her, you and she would have new common interests and experiences.  You <br/>\ncould quote the movies with her.  You could tie the in to other experiences as the <br/>\ndays, weeks and years come by.   <br/>\n<br/>\n-=- Does the unschooling philosophy not take<br/>\n<br/>\ninto consideration that children may not yet be able to determine what is<br/>\n<br/>\ngood for them in certain situations?-=-<br/>\n<br/>\nI don&#39;t think you&#39;re guaranteed to be always right about what&#39;s good for her. <br/>\n If you think what&#39;s good for her is keeping you happy, then procede as <br/>\nyou&#39;re going.<br/>\n<br/>\n-=-We do have a<br/>\n<br/>\ngeneral rule that if you decide not to eat what is served (or what I made<br/>\n<br/>\nspecial for you), or if you only eat a few bites and say, &quot;I&#39;m full,&quot; it is<br/>\n<br/>\nnot okay to turn right around eat candy, chips, cookies or whatever as an<br/>\n<br/>\nalternative.  Oh, they sometimes ask, but I do say &quot;No,&quot; except on some rare<br/>\n<br/>\noccasions like a birthday party or a family outing when we completely skip<br/>\n<br/>\nlunch in favor of ice cream and pretzels or something like that.  Clearly, I<br/>\n<br/>\ndo control food to an extent-=-<br/>\n<br/>\nYou control it singlehandedly if &quot;we&quot; have a rule that&#39;s a rule of your <br/>\nmaking.<br/>\n<br/>\nHere&#39;s a collection of food tales from families who&#39;ve moved away from <br/>\ncontrol:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<br/>\nand about TV and videos<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":129294861,"authorName":"christy_imnotred","from":"&quot;christy_imnotred&quot; &lt;christy_imnotred@...&gt;","profile":"christy_imnotred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086364471","msgId":95104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5cTV2bitzZmsyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyZWEwMWM0NGE0NyQ1ZmJlZjRlMCQ2NDAxYThjMEBNT0xFMjY5MDA+"},"prevInTopic":95101,"nextInTopic":95105,"prevInTime":95103,"nextInTime":95105,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"...  wrote: They ve also been welcomed to watch things like Star Wars and, more recently, Lord of the Rings that would have seemed beyond","messageBody":"<div id=\"ygrps-yiv-2056183367\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Danielle Conger&quot; <br/>\n&lt;danielle.conger@c...&gt; wrote:<br/>\nThey&#39;ve also been welcomed to watch things like Star Wars and, more <br/>\nrecently, Lord of the Rings that would have seemed beyond their reach <br/>\nbefore. I couldn&#39;t wait until I could share those things that are so <br/>\nimportant to me with my kids. This list helped me to see that I <br/>\ndidn&#39;t have to wait just because some expert said I should, and you <br/>\nknow what, I&#39;m really glad that I didn&#39;t wait.-=-<br/>\n<br/>\nMy 4 year old loves the Star Wars movies.  He pretend to be a Jedi <br/>\nall the time.  I got him a bunch of the Star Wars lego sets and he <br/>\nmakes up elaborate stories with them.  I&#39;m so glad I &quot;let&quot; him watch <br/>\nthem.  We haven&#39;t watched Lord of the Rings yet, but will be getting <br/>\nthem all on DVD soon.<br/>\n<br/>\nChristy O</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Sometimes it doesn&#39;t seem to work","postDate":"1086364369","msgId":95105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQzA5QUQxLjYwMzAyMDlAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDIwMDQwNjA0MDgzOTQ0LjE1NzExLnFtYWlsQHdlYjg2MjA1Lm1haWwudWtsLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDQwNjA0MDgzOTQ0LjE1NzExLnFtYWlsQHdlYjg2MjA1Lm1haWwudWtsLnlhaG9vLmNvbT4="},"prevInTopic":95104,"nextInTopic":95106,"prevInTime":95104,"nextInTime":95106,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"** I feel like I m at my wits end at the moment :-(  ** {{{{{{{{{{{{{{{{Shyrley}}}}}}}}}}}}}}}}} The weekend s coming.  Can you get out of the house a bit?  To","messageBody":"<div id=\"ygrps-yiv-685304504\">** I feel like I&#39;m at my wits end at the moment :-(  **<br/>\n<br/>\n<br/>\n{{{{{{{{{{{{{{{{Shyrley}}}}}}}}}}}}}}}}}<br/>\n<br/>\nThe weekend&#39;s coming.  Can you get out of the house a bit?  To be off by <br/>\nyourself (with the baby) or to visit with one sympathetic mom, maybe one <br/>\nfrom the post-partum group?<br/>\n<br/>\nAlternatively, can you take one of the kids who likes to go out and <br/>\ndoesn&#39;t get to much and walk or do errands and enjoy being a bit <br/>\nseparate from the others?  (I don&#39;t think that&#39;s wrong.)  If you are too <br/>\nphysically tired or overwhelmed can you insist that your husband take <br/>\none of the kids out Saturday?<br/>\n<br/>\nParents who aren&#39;t &quot;unschooling all the way&quot; and have videogame limits <br/>\nget to use gameboy bribery to get kids to go along on outings.  That is <br/>\nthey save the gameboy and only allow it when stuck at a sibling&#39;s <br/>\nevents.  I know it isn&#39;t the recommended way to unschool, but I&#39;m <br/>\nthinking pragmatically about preserving Shyrley&#39;s sanity.  There are <br/>\ntimes when I&#39;m willing to be &quot;unscrupulous&quot;.  (Maybe a kinder way to do <br/>\nit would be to buy a new game and just control the timing of when it is <br/>\ngiven to the kid.)<br/>\n<br/>\nPersonally,  I would be tempted to scrape up money somehow for a <br/>\nbabysitter twice a week so that kids that want to be home and kids that <br/>\nwant to go out can both get what they want, if at all possible.  If I <br/>\nwas really grouchy, I&#39;d find the money by cutting back something that I <br/>\nspent on the kids.  I&#39;d get a nice child-minder, not a mean one.  But <br/>\nI&#39;d let the kids know the financial truth, that money could be saved for <br/>\nother purposes if they didn&#39;t need to stay away from an activity or <br/>\nappointment.  I would really prefer not to have to cancel all of the <br/>\nactivities for the other kid(s). <br/>\n<br/>\nDarn.  If you were near people who knew you, getting free rides for one <br/>\nor two kids to go to an outing should be pretty easy to arrange.  People <br/>\nusually do want to help when you have a baby.<br/>\n<br/>\nI figure you can&#39;t make everybody happy all the time right now.  (When I <br/>\nhad a newborn I couldn&#39;t even make myself happy, much less another kid, <br/>\nor a husband.)  So take your eyes down from that goal and look at, for <br/>\nstarters, the ONE thing, ONE outing or other form of fun that&#39;s most <br/>\nimportant to each of the three older kids each week.  (I&#39;d ask them <br/>\nprivately and then start brainstorming on the logistics.  If it&#39;s <br/>\nimpossible to meet all three first choices, then swap in one of the <br/>\nsecond choices for awhile.  This time period isn&#39;t forever.)  (Each <br/>\nmonth, if each week isn&#39;t feasible.)<br/>\n<br/>\nI know that the move and the new baby and the health worries about the <br/>\nnew baby are extremely stressful for everyone.  I&#39;m sure that those <br/>\nfeelings have a big impact on the kids behavior, especially if you have <br/>\nkids that don&#39;t find it easy to express themselves with words or tears.  <br/>\nDo you have some demolition work that the kids can do?  Something that <br/>\nthey can pound to smithereens to relieve their feelings?  I&#39;ve heard <br/>\nthat sweating works almost as well as crying for getting the stress <br/>\nchemicals out of your body.<br/>\n<br/>\nThese answers are pretty general, as I don&#39;t know your kids personally.  <br/>\nAnd I got started writing early in your post and only addressed the <br/>\nfirst question or two.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":234387,"authorName":"andrea@ns.sympatico.ca","from":"&quot;andrea@...&quot; &lt;andrea@...&gt;","profile":"runmum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and  tv","postDate":"1086362984","msgId":95099,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4xLjEuMS4yMDA0MDYwNDEyMTU0NC4wMmM0YjRkMEBwb3AxLm5zLnN5bXBhdGljby5jYT4=","inReplyToHeader":"PEJDRTVEQTRCLjI3QjcwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDAwMDAwMWM0NGEwMCQ2YTNjNzkyMCQ2NTAxYThjMEBqZW5sYXB0b3A+IDxCQ0U1REE0Qi4yN0I3MCVmZXR0ZXJvbGxAZWFydGhsaW5rLm5ldD4="},"prevInTopic":95098,"nextInTopic":95100,"prevInTime":95098,"nextInTime":95100,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"I can t remember which post it was but someone mentioned how she does the family s shopping and cooking and so controls the food to a large extent. I do all","messageBody":"<div id=\"ygrps-yiv-1959294647\">I can&#39;t remember which post it was but someone mentioned how she does the <br/>\nfamily&#39;s shopping and cooking and so &quot;controls&quot; the food to a large extent.<br/>\n<br/>\nI do all the cooking and shopping for my family of five. In that way I am <br/>\n&quot;in control&quot; as far as what gets made, but it is with respect to everyone <br/>\nelse&#39;s input and preferences. I ask them what they want at the store, what <br/>\ndinners they prefer, if they have any meal requests, etc. If they want <br/>\nCaptain Crunch I buy it but I have to say they don&#39;t ask for that kind of <br/>\nstuff much, i.e. highly processed. Eric (9) wanted pears last week and <br/>\nSimon (4) wanted popsicles. When I cook a meal and they don&#39;t like it I <br/>\ndon&#39;t make it again, and if they do like it they will ask to have it again.<br/>\n<br/>\nMost of the time when I ask what they want at the store or for dinner they <br/>\nsay &quot;nothing&quot;. They mean nothing special because they are content with what <br/>\nI buy and prepare.<br/>\n<br/>\nSomething I do that helps a lot is to make extra of most meals. We either <br/>\neat the leftovers for lunches or have them for an alternative when someone <br/>\ndoesn&#39;t like the dinner. William doesn&#39;t eat fish and never would, but the <br/>\nrest of us like fish. When we had salmon this week he had a leftover <br/>\nsausage from the freezer.<br/>\n<br/>\nDonna</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086362817","msgId":95098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2EwMWM0NGE0OCQ2MDUzMDIxMCQwMjAxYThjMEBhby5sb3AuY29tPg==","referencesHeader":"PGMwLmU2N2NmNmYuMmRmMTViNDdAYW9sLmNvbT4gPDAwMzQwMWM0NGExOCQwMThmMzcxMCQzMWFlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":95097,"nextInTopic":95099,"prevInTime":95097,"nextInTime":95099,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... What if a child is being allowed plenty of choice, but is consistently choosing something that is making them ill  or surly or depressed--something that is","messageBody":"<div id=\"ygrps-yiv-1148471145\"><blockquote><span title=\"ireply\">&gt;<br/>\n<br/>\n </span></blockquote>  What if a child is being allowed plenty of choice, but is consistently<br/>\n  choosing something that is making them ill  or surly or depressed--something<br/>\n  that is yummy and quite fine  for anyone in small amounts-- and over time<br/>\n  the parent feels the need to protect the child from herself, because she is<br/>\n  not self-regulating in a way that is healthy?  This isn&#39;t happening in my<br/>\n  home with food, but it was with movies.  It goes to my original question,<br/>\n  which put another way, asks:  Why not guide them or choose for them until<br/>\n  they older and more able to see and understand the effect their choices<br/>\n  cause?<br/>\n<br/>\n<br/>\n  More basically, how do I give my children choices, while also protecting<br/>\n  them? <br/>\n<br/>\n  ******************************<br/>\n<br/>\n  Over time, they will make the connection *because* they will finally decide they don&#39;t like how they feel.  Some take longer than others.  But rather than setting limits on these things, think about what you could offer as an alternative that they would *choose*.<br/>\n<br/>\n  You said they were watching too many movies for your comfort at one time.<br/>\n<br/>\n  What could you offer them to do instead?  And sometimes the trick is not to walk up and say &quot;hey lets to do this today&quot; (only to hear &quot;nah, I just want to watch Spiderman&quot;).<br/>\n<br/>\n  Sometimes, you have to work the environment.  Set it up so that *you* are the center of the room, doing something really cool.  Plant yourself somewhere where you can&#39;t be missed.  Watch how fast they come and ask you what you are doing.  This is how I did it when I took the Girl Scouts camping 2 weeks ago.  I didn&#39;t think anyone would really be that interested in identifying leaves.  But it was part of a badge and I knew they wouldn&#39;t be interested if I said &quot;ok everyone, lets identify leaves&quot;.<br/>\n<br/>\n  Instead, I had some leaves (which they picked for me the day before), and I had 2 field guides.  I sat down in the middle of the porch and just started identifying them.  Before long I had a whole group of girls around me doing the same thing.<br/>\n<br/>\n  Chances are, after a little while, they&#39;ll want to migrate back to the tv (or whatever their latest passion is).  But, you just got them interested in something else for 20 minutes.  It will give you more ideas and you can scatter those 20 minute safaris throughout the day.<br/>\n  ****************************<br/>\n<br/>\n  For me the answer is as clear as a bell for some things, but not for<br/>\n  others.  I mean, of course I let my children choose some of what we buy to<br/>\n  eat, and sometimes it isn&#39;t something I would choose for them myself.  But I<br/>\n  still primarily decide what I am going to cook, and while I may let them<br/>\n  choose to eat something else, most of the time I would not let them choose<br/>\n  candy,  for instance, as the alternative. <br/>\n<br/>\n  ***********************<br/>\n<br/>\n  I don&#39;t &quot;let&quot; them choose anything.  They just choose.  If my kids want to eat candy instead of dinner, I might give them all the reasons why I think its a bad idea, especially if all they&#39;ve eaten is junk all day.  But ultimately the choice is theirs.  Sometimes they find out I was right.  <br/>\n<br/>\n<br/>\n  Kristen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086362386","msgId":95101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZWEwMWM0NGE0NyQ1ZmJlZjRlMCQ2NDAxYThjMEBNT0xFMjY5MDA+","referencesHeader":"PGM5bm85Zys4bG10QGVHcm91cHMuY29tPiA8MDBlMTAxYzQ0OWFiJGYyNzM2MmUwJGVmYjZjZWQxQGhlcm9ub2ZmaWNlPg=="},"prevInTopic":95100,"nextInTopic":95104,"prevInTime":95100,"nextInTime":95102,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"Andrea wrote: Now she has come to enjoy watching kid s movies, as she calls them.  She ... in ... the ... I ... was ... physical ... around ... ","messageBody":"<div id=\"ygrps-yiv-1209860792\">Andrea wrote:<br/>\nNow she has come to enjoy watching &quot;kid&#39;s movies,&quot; as she calls them.  She<br/>\n<blockquote><span title=\"ireply\"> &gt; and Annie, the 3 yo, love to sit down in the afternoon/evening when I&#39;m<br/>\n&gt; cooking dinner and watch a movie.  This isn&#39;t really a problem in and of<br/>\n&gt; itself, but inevitably she wants to watch movies just all the time,<br/>\n&gt; sometimes even asking for a movie before the sleep is dried from her eyes<br/>\n </span></blockquote>in<br/>\n<blockquote><span title=\"ireply\"> &gt; the morning.  When I tried out just letting them have unlimited access,<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; girls, especially Stella, would want to do nothing but watch movies.  And<br/>\n </span></blockquote>I<br/>\n<blockquote><span title=\"ireply\"> &gt; could plainly see it wasn&#39;t good for them.  After watching for an hour or<br/>\n&gt; two or sometimes more, they would be SO grumpy  or completely wound up.<br/>\n&gt; Stella even gets circles under her eyes after a long bout of tv.  If it<br/>\n </span></blockquote>was<br/>\n<blockquote><span title=\"ireply\"> &gt; early in the day, I could take them outside to do something fun and<br/>\n </span></blockquote>physical<br/>\n<blockquote><span title=\"ireply\"> &gt; afterwards, but in the evenings, they&#39;d just be fit to be tied right<br/>\n </span></blockquote>around<br/>\n<blockquote><span title=\"ireply\"> &gt; bedtime.  Also, Stella&#39;s play started to be really regimented and<br/>\n&gt; unimaginative.<br/>\n </span></blockquote>=====================================<br/>\n<br/>\nWhen my kids were little (they&#39;re now 6, 5 and just 4--still pretty little),<br/>\nwe had a similar tv life that Andrea describes. We got no tv reception,<br/>\ncouldn&#39;t afford cable and didn&#39;t want it, so our tv was strictly for viewing<br/>\nmovies and videos. This was a decision I made when I went to grad school. I<br/>\nhad *very* limited funds, and the decision to sit down and watch a movie was<br/>\nmore carefully weighed than just getting sucked into a &quot;must see&quot; tv night.<br/>\nWhen we had children in grad school, time became even more precious. Emily&#39;s<br/>\nfavorite movie when she was 18 mos. old was _Little Mermaid_. We&#39;d sit down<br/>\nand watch movies with her or teletubbies videos, but there was a clear<br/>\nbeginning and end to these. Unless we put another tape in, there wasn&#39;t<br/>\nsomething that came on immediately after. This may or may not have been<br/>\nformative in helping my kids turn off the tv when they&#39;re done watching Kim<br/>\nPossible or whatever else it is they want to watch. For Emily, probably, for<br/>\n Sam who&#39;s had tv around all his life and free access to videos and later to<br/>\ntv, probably not.<br/>\n<br/>\nEven when we had no tv, my kids watched lots of movies, none of which ever<br/>\nstifled their imaginations. On the contrary, they would spend hours role<br/>\nplaying The Land Before Time and many other stories from the movies and tv<br/>\nshows they watched.  They still have wonderful imaginations and engage in<br/>\nall kinds of interactive play. Movies and tv fuel their play as much as<br/>\nbooks.<br/>\n<br/>\nSam (just turned 4) will often wake up and request his Scooby Doo DVD while<br/>\nthe sleep is still in his eyes. The answer is always yes. Sometimes he&#39;ll<br/>\nwatch half an episode and then wander away. Sometimes he&#39;ll veg out and<br/>\nwatch episode after episode on the DVD set he got for his birthday--the<br/>\ncomplete 1st and 2nd season of Scooby-Doo that I picked up for him because I<br/>\nknew he&#39;d love it. Some days are just watching days. But, even on the days<br/>\nwhere it seems like they&#39;ve watched tv most of the day, the reality is<br/>\nthey&#39;ve done lots of other things, too. Same thing with computer games or<br/>\nwhatever else.<br/>\n<br/>\nWe&#39;ve always practiced attachment parenting, but we&#39;ve moved towards<br/>\nnon-coercive parenting more and more over the last year and a half in large<br/>\npart because my youngest is so challenging. He balks at controls the girls<br/>\ntook in stride, and he&#39;s given me the opportunity to question positions I<br/>\ntook for granted. I had always made a very kid-friendly home, set up to<br/>\nallow my children to make as many decisions for themselves as possible and<br/>\ndo as many things for themselves as possible. But there were still controls<br/>\nin smaller ways that I am working to let go of completely. Much of that has<br/>\nnaturally to do with the kids getting older and more self-sufficient, but<br/>\nmuch of that also has to do with reading I&#39;ve done here, at unschooling.com<br/>\nand in TCS.<br/>\n<br/>\nFor instance, the kids always had free access to videos, but now, they also<br/>\nhave free access to tv. In part, because we now have cable, but also in part<br/>\nbecause I&#39;ve let them explore the different channels. They have a *huge*<br/>\nvideo collection, but in truth, that&#39;s still pretty controlling even when<br/>\nthey get to choose and put them in whenever. Their world is larger now with<br/>\nfree access to tv as well. They&#39;ve also been welcomed to watch things like<br/>\nStar Wars and, more recently, Lord of the Rings that would have seemed<br/>\nbeyond their reach before. I couldn&#39;t wait until I could share those things<br/>\nthat are so important to me with my kids. This list helped me to see that I<br/>\ndidn&#39;t have to wait just because some expert said I should, and you know<br/>\nwhat, I&#39;m really glad that I didn&#39;t wait. The kids are capable of deciding<br/>\nwhat they can/ want to handle. When I brought home Spiderman from the<br/>\nlibrary, they decided it was too scary to watch, so we turned it off. We&#39;ll<br/>\ntry it again later.<br/>\n<br/>\nThe kids have always had free access to a computer and have had their own<br/>\ncomputer for the past 4 years (they have 2 now). For a long time, they had<br/>\nonly Reader Rabbit, Sesame, Curious George type software--again, much of<br/>\nthis was simply developmental rather than my own controls but limited<br/>\nnonetheless. Over the past year, though, we&#39;ve been building our game<br/>\ncollection--all the Magic School Bus, Zoombinis, Carmen Sandiego but also<br/>\nthings like Ages of Empires, Majesty, Lego (which always crashes! grrrr!),<br/>\nnot just &quot;educational&quot; software. And I&#39;ve realized how much they&#39;re learning<br/>\nno matter what they&#39;re playing.<br/>\n<br/>\nBedtimes: they used to have a vague bedtime when they would get a tub and dh<br/>\nwould read to them and tuck them in. They never had to turn off the light or<br/>\nstop playing, but it was time for quiet play in their bedrooms. They decided<br/>\nwhen they were really ready to crawl in bed and go to sleep. Now, they no<br/>\nlonger have a bedtime. They still get tub when they&#39;re ready for it, but<br/>\nthey&#39;re just as welcome to play on the computer or watch a movie (or Justice<br/>\nLeague, which comes on Cartoon Network at 10:30pm) after the tub as before<br/>\nit. We still read to them, but it&#39;s no longer part of the bed time<br/>\nritual--we&#39;ve found and created new rituals.<br/>\n<br/>\nWeapons--they just weren&#39;t going to happen. I&#39;ve done a total 180 on that<br/>\none last November. Emily was marching through the yard, singing &quot;Women of<br/>\nWar, we are Women of War!&quot; She made several declarations that she wanted to<br/>\nbe a soldier, to which I responded with my own beliefs, yadda, yadda. I<br/>\nrealized that I was doing her a major disservice by denying her need to feel<br/>\nbrave and explore concepts of bravery and heroism. Out the door with my<br/>\ncontrols and in the door with many different kinds of swords, swordfighting<br/>\nmovies, books about the history of weaponry, etc.<br/>\n<br/>\nPart of this is just a natural part of the kids being older, but honestly,<br/>\nmore of it is about letting go of controls and my own agendas. Controls are<br/>\neasy to justify when kids are very little, but conrol grows and becomes more<br/>\nelaborate as children get older when it should be disappearing. That&#39;s what<br/>\nthis list has let me see. That&#39;s what non-coercive parenting lets me<br/>\npractice. I am grateful to have come to these realizations as my children<br/>\nare growing into themselves. For them, it will seem that it has always been<br/>\nthis way.<br/>\n<br/>\n--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a></div>","specialLinks":[]},{"userId":129294861,"authorName":"christy_imnotred","from":"&quot;christy_imnotred&quot; &lt;christy_imnotred@...&gt;","profile":"christy_imnotred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086361539","msgId":95097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5cTM0MytjbTBzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwZTEwMWM0NDlhYiRmMjczNjJlMCRlZmI2Y2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":95093,"nextInTopic":95098,"prevInTime":95096,"nextInTime":95098,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"-=-I went back to limiting tv, because I felt she didn t know how to self-limit yet.   In other words, I protected her from ... not take into consideration","messageBody":"<div id=\"ygrps-yiv-884441592\">-=-I went back to limiting tv, because I felt she didn&#39;t know how to <br/>\nself-limit yet.   In other words, I protected her from<br/>\n<blockquote><span title=\"ireply\"> &gt; herself.  Is that disrespectful?  Does the unschooling philosophy <br/>\n </span></blockquote>not take into consideration that children may not yet be able to <br/>\ndetermine what is good for them in certain situations?-=-<br/>\n<br/>\nHow long did you let your watch unlimited?  You said she hadn&#39;t even <br/>\nseen TV until she was 3, so TV was something pretty new to her.  <br/>\nGiven time she would have started doing other things.  If you saw it <br/>\naffecting her behavior you could try discussing that with her.  Tell <br/>\nher I notice you get grumpy when you watch tv for awhile, have you <br/>\nnoticed that?  This is what I did with my son (he is 4) over the food <br/>\nthing.  He was eating a lot of sugary foods and it was affecting his <br/>\nmood.  So I talked to him about how people need different types of <br/>\nfood or they get grumpy and don&#39;t have enough energy to play.  I <br/>\ntalked to him abot protein and how important that was for mood and <br/>\nenergy.  He started eating more protein and noticed a difference in <br/>\nhimself.  He now makes sure (on his own) that he eats enough protein <br/>\neveryday.  He asks me for each food if it has protein or not.  <br/>\nSometimes he&#39;ll eat it anyway (if it doesn&#39;t have protein) but it is <br/>\nhis decision.<br/>\n<br/>\nKeeping healthy foods in the house is great.  Giving them control <br/>\nover food choices doesn&#39;t mean you buy every processed food in the <br/>\nstore, but if they want to try one you let them.  You can certainly <br/>\nstill educate them about food and what is and isn&#39;t good for us.  But <br/>\nin the end it would be their choice what to eat.<br/>\n<br/>\nBy saying no to sweets you are giving the sweets the power.  You are <br/>\ntelling your kids that sweets are so tempting you won&#39;t be able to <br/>\ncontrol yourself if I let you eat them.  It makes a kid doubt their <br/>\npower.  To me it is the same with tv and commercials.  If I don&#39;t let <br/>\nmy son watch them, I&#39;m telling him that these things are more <br/>\npowerful than you are.  You can&#39;t handle them.  Instead I watch with <br/>\nhim and we discuss what he&#39;s seen.  He&#39;s only 4 but he is very <br/>\nsceptical of all commercials.  He knows what there purpose is and he <br/>\nknows that they lie to make things look cool.  We have bought a few <br/>\nthings he&#39;s seen on commercials and most haven&#39;t lived up to what the <br/>\ncommercial said.  He learned so much from those few experiences.  <br/>\n<br/>\nAt some point we have to let our kids make choices, I&#39;d rather do it <br/>\nnow when he is young and I can help him.  If he makes bad choices now <br/>\nthe consequences are much smaller than they will be when he is older.<br/>\n<br/>\nChristy O</div>","specialLinks":[]},{"userId":234387,"authorName":"andrea@ns.sympatico.ca","from":"&quot;andrea@...&quot; &lt;andrea@...&gt;","profile":"runmum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] ? ? re: limiting food choices and  tv  Was:Meet A Person Where She&#39;s At","postDate":"1086361100","msgId":95100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4xLjEuMS4yMDA0MDYwNDExNTAwMC4wMmM0ZWUyMEBwb3AxLm5zLnN5bXBhdGljby5jYT4=","inReplyToHeader":"PDAwMDAwMWM0NGEwMCQ2YTNjNzkyMCQ2NTAxYThjMEBqZW5sYXB0b3A+","referencesHeader":"PGMwLmU2N2NmNmYuMmRmMTViNDdAYW9sLmNvbT4gPDAwMDAwMWM0NGEwMCQ2YTNjNzkyMCQ2NTAxYThjMEBqZW5sYXB0b3A+"},"prevInTopic":95099,"nextInTopic":95101,"prevInTime":95099,"nextInTime":95101,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... Those evil/godly words are opinions. As you have already said you are a scientist, you know that it is important to separate your opinions and biases from","messageBody":"<div id=\"ygrps-yiv-970928126\">At 03:51 AM 6/4/04, Jennifer wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Not that ice cream is evil<br/>\n&gt;and broccoli is godly, but that Roundup Ready soybeans are EVIL and the<br/>\n&gt;tomato that we grew in the backyard is godly.  My biases will clearly<br/>\n&gt;come through here, but I&#39;ll try not to use those exact words<br/>\n<br/>\n </span></blockquote>Those evil/godly words are opinions. As you have already said you are a <br/>\nscientist, you know that it is important to separate your opinions and <br/>\nbiases from the facts. I consider it my responsibility to get as much truth <br/>\nas possible to my children, as much as it is possible to know the truth <br/>\nabout something. I also share my opinions but I want them to understand <br/>\nthat they don&#39;t have to have the same opinions and that their opinions are <br/>\njust as valid as mine.<br/>\n<br/>\nWhat if your son ends up working for Monsanto? It could happen.<br/>\n<br/>\nDonna</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086358809","msgId":95093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQzA4NTE5LjkwMjA5QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGMwLmU2N2NmNmYuMmRmMTViNDdAYW9sLmNvbT4=","referencesHeader":"PGMwLmU2N2NmNmYuMmRmMTViNDdAYW9sLmNvbT4="},"prevInTopic":95086,"nextInTopic":95097,"prevInTime":95092,"nextInTime":95094,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"** There are many here who know without any doubt that a child who is NOT made to eat a certain way at a certain time will still eat enough, and a variety, and","messageBody":"<div id=\"ygrps-yiv-645819148\">** There are many here who know without any doubt that a child who is <br/>\nNOT made<br/>\nto eat a certain way at a certain time will still eat enough, and a <br/>\nvariety,<br/>\nand more peacefully and happily.<br/>\n<br/>\nHow can a child know when he&#39;s tired and wants to go to bed, if he&#39;s <br/>\nmade to<br/>\ngo to bed before he&#39;s tired, consistently?  Alone?  In the dark?**<br/>\n<br/>\nTraditional parenting practices are like a crutch that weakens the <br/>\nchild&#39;s judgement?  I see that.<br/>\n<br/>\n** It sounds like advertisers have infiltrated your life and is causing <br/>\nyou to<br/>\nmake major life decisions based on hiding from them.   At my house, <br/>\nthey&#39;re not<br/>\ncontrolling me or my kids.  At your house, they have helped cause you to<br/>\nunschool, and to be afraid, and to prefer controlling your child.**<br/>\n<br/>\nWhen my son was little (2) he seemed to be influenced by the pictures on <br/>\ncereal boxes.  At least I noticed that he wanted any kind of cereal with <br/>\na spaceship on the box.  The fact that I don&#39;t remember the names of <br/>\nthese kinds of cereal tells me that he didn&#39;t stick with these varied <br/>\nspace cereals for long.  Two months ago, he wanted to try American <br/>\ncheese in pre-wrapped slices.  (I think I&#39;ve seen ads for American <br/>\ncheese (Kraft singles) on TV. )<br/>\nI said sure.  He ate the first one and didn&#39;t like it.  (His dad also <br/>\nfind Am. cheese strange, so all the slices are still in the fridge until <br/>\nI toss them or figure out away to use them as a casserole ingredient.)  <br/>\nAnyway, tossing one pack of cheese isn&#39;t &quot;waste&quot;, it&#39;s &quot;learning materials&quot;.<br/>\n<br/>\nMy conclusion is that advertising can make a child interested in trying <br/>\na food.  But after trying the food once, previous purchasing decisions <br/>\nare made on what the food tastes like.  (Sounds obvious, doesn&#39;t it?)<br/>\n<br/>\nIf I had said &quot;No&quot; every time, I wouldn&#39;t have been able to observe this <br/>\nbehavior, and I might have increased his curiosity about the forbidden <br/>\nfoods.  If I had said leadingly &quot;You don&#39;t really want that, do you?&quot; I <br/>\nwould have confused him quite a bit.<br/>\n<br/>\n** -=-How do you know when they<br/>\nare ready to make the decisions on their own?  -=-<br/>\n<br/>\nHow did you know when they were ready to start talking?  Stand up?  Walk? **<br/>\n<br/>\nSo, it seems they are ready to start making decisions when they start <br/>\ntrying to make decisions and falling down.  Their decision-making <br/>\nperformance isn&#39;t likely to be &quot;perfect&quot; on the first day?<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv \tWas:Meet A Person Where She&#39;s At","postDate":"1086351652","msgId":95086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRTVFMTY0LjI3Qjc2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMzQwMWM0NGExOCQwMThmMzcxMCQzMWFlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":95085,"nextInTopic":95093,"prevInTime":95085,"nextInTime":95087,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... But why would you not let them? Is the reason because you fear the draw of candy more than you fear the consequences of making them feel like you don t ","messageBody":"<div id=\"ygrps-yiv-978127308\">on 6/4/04 5:40 AM, Andrea Burlingame at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I<br/>\n&gt; still primarily decide what I am going to cook, and while I may let them<br/>\n&gt; choose to eat something else, most of the time I would not let them choose<br/>\n&gt; candy,  for instance, as the alternative.<br/>\n<br/>\n </span></blockquote>But why would you not let them? Is the reason because you fear the draw of<br/>\ncandy more than you fear the consequences of making them feel like you don&#39;t<br/>\ncare?<br/>\n<br/>\nMy daughter is allowed to eat candy instead of dinner and always has been<br/>\nable to. Even when her tastes were limited to a few foods, she didn&#39;t<br/>\nsubsist on candy. She has always had Halloween candy and Easter candy<br/>\nhanging around months (and sometimes years!) after the holidays.<br/>\n<br/>\nIt&#39;s not that you can&#39;t control their food or not control except for a<br/>\nlittle bit. But if you want to treat them how you&#39;d want someone else to<br/>\ntreat you, then you&#39;ll find a different way to get what you want.<br/>\n<br/>\nIf your goal is respect and healthy eating, then a better option than no<br/>\ncandy if you dont eat dinner is other easily grabbed or made options. Like<br/>\nPBJ and PB and banana and trail mix in a baggie and muffins and canned<br/>\nfruit.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that I&#39;m pretty comfortable with this<br/>\n&gt; approach, but I wonder if I&#39;m missing some illumination that might make me<br/>\n&gt; completely rethink this.<br/>\n<br/>\n </span></blockquote>What you&#39;re missing is how it feels from inside of them. Imagine a world<br/>\nwhere you can&#39;t choose what you eat. Where someone makes something -- and<br/>\nit&#39;s usually yucky -- and you have to eat it or have some boring snack or go<br/>\nhungry. Even though there&#39;s something yummy in easy reach.<br/>\n<br/>\nChildren will respond the way *they* see the world. No matter how wonderful<br/>\nwe think the meal is, if it&#39;s yucky to them and the alternatives have been<br/>\ndone to death, they&#39;re going to react as though life were like the above<br/>\nscenario.<br/>\n<br/>\nLife with kids *is* inconvenient. But it&#39;s way more inconvenient for them!<br/>\nAnd if we make it more yucky for our convenience when they know we could<br/>\nchoose to make it less yucky, we&#39;re saying &quot;I don&#39;t care,&quot; and too many of<br/>\nthose do build up.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086351516","msgId":95085,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmQwMWM0NGEyZSQxMDQ0OWU2MCQ5MzRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PGMwLmU2N2NmNmYuMmRmMTViNDdAYW9sLmNvbT4gPDAwMzQwMWM0NGExOCQwMThmMzcxMCQzMWFlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":95084,"nextInTopic":95086,"prevInTime":95084,"nextInTime":95086,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... Andrea writes: This isn t helpful to me.  This seems like quibbling over semantics. ... I d venture to guess that it would be helpful if you didn t see it","messageBody":"<div id=\"ygrps-yiv-1382481833\"><blockquote><span title=\"ireply\">&gt;Sandra writes:<br/>\n  &gt; &quot;The unschooling philosophy&quot; isn&#39;t a thing.<br/>\n  &gt; Not in the way that it takes anything into consideration.<br/>\n<br/>\n </span></blockquote>  Andrea writes:<br/>\n  This isn&#39;t helpful to me.  This seems like quibbling over semantics.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  I&#39;d venture to guess that it would be helpful if you didn&#39;t see it has quibbling. Instead of writing it off as unhelpful put some work into thinking about it and how it may challenge what you currently think.<br/>\n<br/>\n  I just want to know your<br/>\n  opinions about whether someone who unschools with their family would be<br/>\n  &quot;wrong&quot; or &quot;disrespectful&quot; if they chose to protect their young children<br/>\n  from the harms of  being in front of a screen for too many hours a day, and<br/>\n  if yes, why?  And what might be better? <br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  I don&#39;t think it&#39;s the limiting that&#39;s the real problem, but rather how you seem unwilling to challenge the assumption that &#39;being in front of a screen for too many hours&#39; is a bad thing. How long did you lift your limits? Did you consider that you childrens reaction to limitless TV was not the TV&#39;s fault but the years before where they had little exposure to it? Are you willing to challenge the thought that TV is not a bad thing?<br/>\n<br/>\n   I&#39;m not trying to prove you wrong,<br/>\n  or find holes in unschooling;  I&#39;m just trying to get a handle on some of<br/>\n  the more slippery parts for me.  I understand that you are thinking of all<br/>\n  the readers on this list and that you want people to push past the habits in<br/>\n  the way they think.   Maybe that&#39;s why you felt it important to point out<br/>\n  this misstep in the logic of my language, but couldn&#39;t I just get a real<br/>\n  answer to my real question.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  I thought Sandra&#39;s response was a real answer. If there&#39;s a specific answer you want like, yes, what you&#39;re doing is just fine, maybe tell everyone that when you ask the question. :)<br/>\n<br/>\n    I mean, afterall, I AM trying to push past the<br/>\n  habits of my thinking to get to a deeper understanding of unschooling and<br/>\n  how it can liberate my family.  Isn&#39;t the heart of what I am asking  plain<br/>\n  enough?  Can&#39;t I get an answer without being nitpicked apart on this small<br/>\n  stuff?  I&#39;m truly not trying to be beligerent here.  I just feel really<br/>\n  frustrated.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  I think the way of answering here is  more geared towards helping the questioner find out the answer for himself. I find the nitpicking gives me a bunch of points to take from the list and consider. I much prefer that to a straight yes or no...The people on this list don&#39;t really know me so it&#39;s up to me to think through what&#39;s been said and come to my own conclusion. Maybe you&#39;ve still got that teacher model in your head where there&#39;s an expectation (though false) that they know the right answer.<br/>\n<br/>\n<br/>\n<br/>\n  Yes.  This sounds pretty bad, alright, but what if this isn&#39;t what&#39;s going<br/>\n  on.  What if a child is being allowed plenty of choice, but is consistently<br/>\n  choosing something that is making them ill  or surly or depressed--something<br/>\n  that is yummy and quite fine  for anyone in small amounts-- and over time<br/>\n  the parent feels the need to protect the child from herself, because she is<br/>\n  not self-regulating in a way that is healthy? <br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;.<br/>\n<br/>\n </span></blockquote>  Let her keep making the choice and she&#39;ll make the connection. Any reasonable person would. <br/>\n<br/>\n   This isn&#39;t happening in my<br/>\n  home with food, but it was with movies.  <br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  You kept TV out of you house to a large part for a long time though. It should be expected that they&#39;ll binge for awhile. And really, how unhealthy was it? Were their teeth falling out? Limbs being broken? Rashs breaking out?<br/>\n<br/>\n  It goes to my original question,<br/>\n  which put another way, asks:  Why not guide them or choose for them until<br/>\n  they older and more able to see and understand the effect their choices<br/>\n  cause?<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  They can see and understand the effects now if you let them. They&#39;ll never have a chance to if you&#39;re constantly blocking those effects by throwing up limits. How long do you really think your children would be zombies to the TV? Do you honestly think they might not get sick of it in a few weeks or months? That they would forever be slaves to it?You&#39;re having a hard time getting this because you&#39;re not willing (yet) to believe you can trust your kids. <br/>\n<br/>\n  More basically, how do I give my children choices, while also protecting<br/>\n  them?  <br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  Protecting them to me means supervising them in a pool or keeping the big knives out of my toddlers reach (while he&#39;s in his everything&#39;s-a-sword Aragorn phase), not rationing their chocolate or Dragontales intake<br/>\n<br/>\n  , For me the answer is as clear as a bell for some things, but not for<br/>\n  others.  I mean, of course I let my children choose some of what we buy to<br/>\n  eat, and sometimes it isn&#39;t something I would choose for them myself.  But I<br/>\n  still primarily decide what I am going to cook, and while I may let them<br/>\n  choose to eat something else, most of the time I would not let them choose<br/>\n  candy,  for instance, as the alternative.  In that way I control their<br/>\n  eating to an extent.  I think that I&#39;m pretty comfortable with this<br/>\n  approach, but I wonder if I&#39;m missing some illumination that might make me<br/>\n  completely rethink this.  This is why I ask these questions.  I don&#39;t want<br/>\n  to miss something importand and useful because I didn&#39;t push past my own<br/>\n  current understandings.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  Here&#39;s the limit you&#39;ve put in place for yourself...&#39;I can&#39;t trust my kids to recognize the concequences of their choices or make reasonable choices&#39;. That&#39;s what you have to challenge or any advice you get here will just continue to frustrate you. I also think you have an exaggerated sense of danger if you think TV and candy are so dangerous that you have to compromise your quest to unschool. They will not keel over after 3 days of eating gumballs (I really doubt they&#39;d get anywhere near that far as they&#39;d notice how bad they felt after the first day) or 2 weeks of movies. <br/>\n<br/>\n  Dawn (in NS)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv \tWas:Meet A Person Where She&#39;s At","postDate":"1086349835","msgId":95084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRTVEQTRCLjI3QjcwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMDAwMWM0NGEwMCQ2YTNjNzkyMCQ2NTAxYThjMEBqZW5sYXB0b3A+"},"prevInTopic":95082,"nextInTopic":95085,"prevInTime":95083,"nextInTime":95085,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... Because there was something that was worth feeling grouchy for! But that s not his only option. I m sure he d much rather find a way to get the good parts","messageBody":"<div id=\"ygrps-yiv-1769555992\">on 6/4/04 2:51 AM, Jennifer Altenbach at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salten@...\">salten@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you mean<br/>\n&gt; he was choosing to be grouchy?  Gosh it sure seems like it sometimes ;)<br/>\n<br/>\n </span></blockquote>Because there was something that was worth feeling grouchy for!<br/>\n<br/>\nBut that&#39;s not his only option. I&#39;m sure he&#39;d much rather find a way to get<br/>\nthe good parts while minimizing the bad parts. That&#39;s all part of learning<br/>\nhow to problem solve.<br/>\n<br/>\nIf we really like something, we&#39;re willing to put up with the bad parts.<br/>\nVegetarians are willing to make eating more difficult (or expensive) because<br/>\nthey feel they&#39;re getting something that&#39;s worth it. A baby comes with<br/>\n*lots* of bad parts, but we seem to think the good parts more than outweigh<br/>\nthe bad. ;-) Working on a project might be worth staying up all night and<br/>\nfeeling grumpy the next day for.<br/>\n<br/>\nBut for many things, once we&#39;ve experienced the good for a while, the bad<br/>\nisn&#39;t worthwhile any more. It might be fun staying up for 24 hours a few<br/>\ntimes, but it wears thin pretty quick for most people!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But you are<br/>\n&gt; saying that ultimately he is just following his desires, and that he can<br/>\n&gt; not be manipulated by advertising?  I&#39;m not quite sure I understand this<br/>\n&gt; part.<br/>\n<br/>\n </span></blockquote>I think they can understand advertising. I think they can sample things<br/>\nadvertised and make judgments about whether they&#39;re good or bad and in the<br/>\nprocess learn more about how advertising companies try to manipulate them<br/>\ninto wanting something that turns out not to be &quot;exactly as advertised.&quot; And<br/>\nthe more the do this, the less influence advertising has on them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For me, it&#39;s<br/>\n&gt; social justice issues and environmental considerations that are limiting<br/>\n&gt; factors.<br/>\n<br/>\n </span></blockquote>And if your husband were a card carrying member of the NRA and wanted guns<br/>\ndisplayed prominently, would that feel like he was respecting your values?<br/>\n<br/>\nWe teach others to respect us by us respecting them. Part of respecting<br/>\nsomeone is accepting that they do value what they&#39;re choosing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But for a more concrete example, what if the child has a<br/>\n&gt; severe food allergy?  Clearly in this case the parents DO need to limit<br/>\n&gt; the child&#39;s food choices.<br/>\n<br/>\n </span></blockquote>It&#39;s best to stick with real examples than made up ones. While some children<br/>\ndo have allergies, not all allergies are the same nor do they need treated<br/>\nthe same. The answers for helping someone treat the child respectfully while<br/>\nhelping them keep themselves safe will lie in why the child is behaving as<br/>\nthey do -- like why the child is reaching for peanuts for instance -- rather<br/>\nthan in what is wrong.<br/>\n<br/>\nIf you put safety first, then control seems a viable option. If you put<br/>\nrespect first, then control doesn&#39;t look so great. But loosing control as  a<br/>\ntool doesn&#39;t mean we&#39;ve lost all options! There are other options and people<br/>\non the list can help.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":36584094,"authorName":"mulwiler@hotmail.com","from":"mulwiler@...","profile":"mhf1978","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: ? ? re: limiting food choices and tv Was:Meet A Person Where She&#39;s At","postDate":"1086348895","msgId":95082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5cG1vdit2OTc4QGVHcm91cHMuY29tPg=="},"prevInTopic":95080,"nextInTopic":95084,"prevInTime":95081,"nextInTime":95083,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"Betsy wrote: ","messageBody":"<div id=\"ygrps-yiv-2009179033\">Betsy wrote:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  I didn&#39;t mean to post something that hits so close to home. <br/>\nSorry for say something that seemed so personal.   &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nDon&#39;t be  :-)   I&#39;m just glad I have my daughter still home<br/>\nso I can do things better.  <br/>\n<br/>\nAnd, as she reminds me regularly, &quot;I won&#39;t have to make those<br/>\nsame mistakes, Mom.&quot;<br/>\n<br/>\nAndrea wrote:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  but couldn&#39;t I just get a real answer to my real question.  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>But Andrea, it was a real answer.  The unschooling philosophy really <br/>\nisn&#39;t a thing so much as something you do (think of the bike<br/>\nriding analogy - you just have to DO it . . . . . )<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  if they chose to protect their young children from the harms <br/>\nof being in front of a screen for too many hours a day, and if yes, <br/>\nwhy?  &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nFor some reason, this young child wants/needs to watch movies. Watch <br/>\nthem with her - really BE with her while she is watching. <br/>\nUncritically. Put yourself in her shoes and try to really see what <br/>\nshe is getting out of them. Find pleasure in what she finds pleasure <br/>\nin. Take alot of time and watch with her each time she wants to <br/>\nwatch. <br/>\n<br/>\nDo this with her for a week - or two weeks - or however long it takes <br/>\nfor you to SEE what she is getting out of it. Really look at her - <br/>\nwatch her - try feel what she feels about the movie.  Bring her food, <br/>\ndiscuss the movie(s), relate it to other things in her life, point <br/>\nout things you find amusing, appreciate the movie. <br/>\n<br/>\nAnd do it without any criticism or negativity.<br/>\n<br/>\nMost children &quot;know&quot; if we disapprove even if we don&#39;t<br/>\nverbalize it.  <br/>\n<br/>\nMadelyn can tell just by the set of my lips.  I&#39;ve been known to<br/>\ngo into another room and talk to her through the door just so she<br/>\ncan&#39;t see my face :-)  Her main intelligence is interpersonal, <br/>\nthough, so she has a gift for &quot;knowing&quot; what people feel - if<br/>\nyou&#39;re child has a different gift, it may be easier for you to<br/>\nhide your displeasure/discomfort/negativity . . . . .<br/>\n<br/>\n<br/>\nMake it your priority to watch with her and after a week or two you <br/>\nwill know about the pleasure your daughter is getting from watching <br/>\nand she will know that you support her need/want.<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  Why not guide them or choose for them until they older and <br/>\nmore able to see and understand the effect their choices cause?   <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Because you are sowing the seed of self doubt.<br/>\n<br/>\n<br/>\nYour child is capable right now of deciding how things make her feel. <br/>\nShe doesn&#39;t want to feel yucky and be grumpy. You can help her<br/>\nbut first you have to &quot;get&quot; why she is watching. Then you can<br/>\npoint things out - and she will take into consideration what you say <br/>\nbecause she trusts that you are on her side - that you want for her <br/>\nwhat she wants. <br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt; I don&#39;t want to miss something importand and useful because I <br/>\ndidn&#39;t push past my own current understandings.   &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nKeep pushing - it&#39;s worth it!<br/>\n<br/>\n<br/>\n<br/>\nMercedes<br/>\nwho just got back from the midnight showing of the new Harry Potter <br/>\nand should be in bed - the birds just started chirping. . . . .</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv \tWas:Meet A Person Where She&#39;s At","postDate":"1086348432","msgId":95080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRTVENEQwLjI3QjZFJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMDAwMWM0NDllNyQyYTliNGI3MCQ2NTAxYThjMEBqZW5sYXB0b3A+"},"prevInTopic":95079,"nextInTopic":95082,"prevInTime":95079,"nextInTime":95081,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... The question you re really asking isn t when are they ready to make decisions but when will they make the same decisions I would make for them. ... By","messageBody":"<div id=\"ygrps-yiv-111723740\">on 6/3/04 11:51 PM, Jennifer Altenbach at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salten@...\">salten@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But at four?  Five?  How do you know when they<br/>\n&gt; are ready to make the decisions on their own?<br/>\n<br/>\n </span></blockquote>The question you&#39;re really asking isn&#39;t when are they ready to make<br/>\ndecisions but when will they make the same decisions I would make for them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But as he gets a little older and is exposed to<br/>\n&gt; more advertising and more kids and more people&#39;s houses, I feel that we<br/>\n&gt; are about to start down a slippery slope.  How do we proceed from here?<br/>\n<br/>\n </span></blockquote>By trusting that the choices you make for yourself are good for a reason. By<br/>\ntrusting that nothing he&#39;s likely to want to do at 4 or 5 is as dangerous or<br/>\nwonderful as you fear it will be and can be sampled. (And you&#39;re there to<br/>\nprotect him from real danger and explain when something looks deceptively<br/>\nfun and safe. Meaning traffic as opposed to Doritos or Survivor.)<br/>\n<br/>\nThe reason advertisers need to spend so much money on advertising is because<br/>\nit&#39;s not all that effective! As soon as someone gets the very easily grasped<br/>\nconcept that someone is trying to make something look so wonderful that<br/>\nyou&#39;ll give them your money, it&#39;s pretty easy to see commercials for what<br/>\nthey are.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv \tWas:Meet A Person Where She&#39;s At","postDate":"1086347686","msgId":95079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRTVEMUU2LjI3QjY3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMDAwMWM0NDllNyQyYTliNGI3MCQ2NTAxYThjMEBqZW5sYXB0b3A+"},"prevInTopic":95078,"nextInTopic":95080,"prevInTime":95078,"nextInTime":95080,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... If we see our goal as helping them make decisions rather than helping them make good decisions (or, more likely, the decisions we d want them to make) then","messageBody":"<div id=\"ygrps-yiv-1392243432\"><blockquote><span title=\"ireply\">&gt; Does the unschooling philosophy not take into consideration that children may<br/>\n&gt; not yet be able to determine what is good for them in certain situations?<br/>\n<br/>\n </span></blockquote>If we see our goal as helping them make decisions rather than helping them<br/>\nmake good decisions (or, more likely, the decisions we&#39;d want them to make)<br/>\nthen the question doesn&#39;t need asked.<br/>\n<br/>\nWe shouldn&#39;t be giving them choices that are imminently dangerous, like<br/>\nwhether or not to play in the street.<br/>\n<br/>\nWe should be examining the truth of what we&#39;ve decided not to direct into<br/>\ntheir path. The street is a dangerous place to play! But is a bag of chips<br/>\nor even a month of chips or grumpiness from TV on the same level of danger?<br/>\n<br/>\nWe should live our values and respect their need to explore -- which<br/>\nincludes doing things that have negative consequences -- and respect that<br/>\nthey&#39;re trusting us to not let them harm themselves and trusting us to help<br/>\nthem solve their problems.<br/>\n<br/>\nA grumpy child doesn&#39;t want to feel grumpy any more than an adult does! But<br/>\na grumpy child -- or a grumpy adult! -- doesn&#39;t want what they&#39;re enjoying<br/>\ntaken away from them. Children and adults want tools to help them get what<br/>\nthey want. We can give them feed back about how their behavior is affecting<br/>\nus so they can become aware of a problem. We can help them become aware of<br/>\nwhat might be causing the problem. The problem isn&#39;t simply too much TV and<br/>\nthe solution isn&#39;t simply limiting the time. The problem is perhaps being<br/>\ninactive for to long and one solution might be moving around while watching<br/>\nor watching in short spurts. The problem might be there aren&#39;t enough other<br/>\nopportunities that are as much fun as TV and as easily available. Or ...<br/>\n<br/>\nIf your child were doing something you saw as valuable -- like creating<br/>\namazing scultures or ??? -- which made them grumpy, what would your answer<br/>\nbe? Would it be controling the time they were allowed to be creative?<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv \tWas:Meet A Person Where She&#39;s At","postDate":"1086344507","msgId":95078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRTVDNTdBLjI3QjY1JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwZTEwMWM0NDlhYiRmMjczNjJlMCRlZmI2Y2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":95077,"nextInTopic":95079,"prevInTime":95077,"nextInTime":95079,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... If you were spending a lot of time on the computer and your husband decided to limit your computer time because you obviously didn t know how to self ","messageBody":"<div id=\"ygrps-yiv-1869755225\">on 6/3/04 4:46 PM, Andrea Burlingame at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I went back to limiting tv, because I felt she<br/>\n&gt; didn&#39;t know how to self-limit yet.   In other words, I protected her from<br/>\n&gt; herself.  Is that disrespectful?<br/>\n<br/>\n </span></blockquote>If you were spending a lot of time on the computer and your husband decided<br/>\nto limit your computer time because you obviously didn&#39;t know how to self<br/>\nlimit, would that be disrespectful?<br/>\n<br/>\nWhat if he said &quot;Here&#39;s some of the problems ...&quot; and &quot;How can we work this<br/>\nout?&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We do have a<br/>\n&gt; general rule that if you decide not to eat what is served (or what I made<br/>\n&gt; special for you), or if you only eat a few bites and say, &quot;I&#39;m full,&quot; it is<br/>\n&gt; not okay to turn right around eat candy, chips, cookies or whatever as an<br/>\n&gt; alternative.<br/>\n<br/>\n </span></blockquote>What if you were served something you detest or something that you normally<br/>\nliked but had had too much recently so it was looking a bit repulsive and<br/>\nthere were something you loved for dessert would that rule feel respectful?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does this go against an unschooling philosophy?<br/>\n<br/>\n </span></blockquote>Some unschoolers will unschool only academics. Some unschoolers will extend<br/>\nthe philosophy that kids will learn by living a full and rich life into<br/>\nparenting.<br/>\n<br/>\nIt depends what you&#39;re goals and values are. I think the most valuable thing<br/>\nwe can do is offer what actually happens in our families when children are<br/>\nrespected and our thoughts (which includes debate and new viewpoints and<br/>\nasking hard questions and so on). From that people can weigh the goals and<br/>\nvalues and decide if it sounds like something they want.<br/>\n<br/>\nThe real questions are what are your goals and values. What methods are you<br/>\nchoosing to meet them and why?<br/>\n<br/>\nIf you want your children to be adult healthy eaters, forbidding cookies<br/>\nunless sufficient dinner is consumed isn&#39;t the only choice. If your want<br/>\nyour children to not be grumpy after they watch TV, limiting TV isn&#39;t the<br/>\nonly way.<br/>\n<br/>\nFor people who want to put respect high on their priority list, we&#39;re<br/>\noffering ways put respect first and how to work other things around that.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086342041","msgId":95077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzQwMWM0NGExOCQwMThmMzcxMCQzMWFlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PGMwLmU2N2NmNmYuMmRmMTViNDdAYW9sLmNvbT4="},"prevInTopic":95076,"nextInTopic":95078,"prevInTime":95076,"nextInTime":95078,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... This isn t helpful to me.  This seems like quibbling over semantics. One reason I haven t posted in the past when I wanted to understand something more","messageBody":"<div id=\"ygrps-yiv-287517043\"><blockquote><span title=\"ireply\">&gt; &lt;&lt; Does the unschooling philosophy not take<br/>\n&gt; into consideration  &gt;&gt;<br/>\n&gt;<br/>\n&gt; &quot;The unschooling philosophy&quot; isn&#39;t a thing.<br/>\n&gt; Not in the way that it takes anything into consideration.<br/>\n<br/>\n </span></blockquote>This isn&#39;t helpful to me.  This seems like quibbling over semantics. One<br/>\nreason I haven&#39;t posted in the past when I wanted to understand something<br/>\nmore clearly or because I recognized some truth, but couldn&#39;t quite grasp<br/>\nit,  is because I was afraid I woudn&#39;t word my question or explanation in<br/>\njust the right, most efficient, clear and intelligent language and then the<br/>\nheart of my questions would go unanswered while I defended or apologized for<br/>\nmy mistatement, which obviously missed it&#39;s mark.  I just want to know your<br/>\nopinions about whether someone who unschools with their family would be<br/>\n&quot;wrong&quot; or &quot;disrespectful&quot; if they chose to protect their young children<br/>\nfrom the harms of  being in front of a screen for too many hours a day, and<br/>\nif yes, why?  And what might be better?  I&#39;m not trying to prove you wrong,<br/>\nor find holes in unschooling;  I&#39;m just trying to get a handle on some of<br/>\nthe more slippery parts for me.  I understand that you are thinking of all<br/>\nthe readers on this list and that you want people to push past the habits in<br/>\nthe way they think.   Maybe that&#39;s why you felt it important to point out<br/>\nthis misstep in the logic of my language, but couldn&#39;t I just get a real<br/>\nanswer to my real question.  I mean, afterall, I AM trying to push past the<br/>\nhabits of my thinking to get to a deeper understanding of unschooling and<br/>\nhow it can liberate my family.  Isn&#39;t the heart of what I am asking  plain<br/>\nenough?  Can&#39;t I get an answer without being nitpicked apart on this small<br/>\nstuff?  I&#39;m truly not trying to be beligerent here.  I just feel really<br/>\nfrustrated.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Lots of people are giving their best advice, and the best of the best of<br/>\n </span></blockquote>all<br/>\n<blockquote><span title=\"ireply\"> &gt; that advice is (in my opinion, when I give advice) that which is closest<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; natural and un-selfconscious everyday stuff (where &quot;everyday&quot; might still<br/>\n </span></blockquote>apply<br/>\n<blockquote><span title=\"ireply\"> &gt; to really COOL days).<br/>\n<br/>\n </span></blockquote>Okay, maybe I&#39;m just tired, but I&#39;m not getting this.  Could you put this<br/>\nanother way for me?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Traditionally, it doesn&#39;t matter WHAT a child thinks about a situation.<br/>\n </span></blockquote>If<br/>\n<blockquote><span title=\"ireply\"> &gt; the parents say &quot;Sit down, right there, this way, and eat the food we put<br/>\n </span></blockquote>in<br/>\n<blockquote><span title=\"ireply\"> &gt; front of you, without complaining.  Eat all of it.  With a fork.   Then we<br/>\n </span></blockquote>will<br/>\n<blockquote><span title=\"ireply\"> &gt; give you a treat/dessert.  Eat it.  With a fork.  Now clean up (or submit<br/>\n&gt; yourself to be cleaned up) and get in the bed and shut up and go to<br/>\n </span></blockquote>sleep.&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; If a child determines that he&#39;s not hungry, or doesn&#39;t like green beans,<br/>\n </span></blockquote>or<br/>\n<blockquote><span title=\"ireply\"> &gt; would rather just have the apple pie and the chicken and no bread or<br/>\n </span></blockquote>potatoes,<br/>\n<blockquote><span title=\"ireply\"> &gt; he will be told he does not know what is good for him.  Worse, he might be<br/>\n&gt; told &quot;If you know what is good for you, you will do what I say.&quot;<br/>\n&gt;<br/>\n&gt; HOW ON EARTH can kids know what&#39;s good for them in circumstances like<br/>\n </span></blockquote>that?<br/>\n<br/>\nYes.  This sounds pretty bad, alright, but what if this isn&#39;t what&#39;s going<br/>\non.  What if a child is being allowed plenty of choice, but is consistently<br/>\nchoosing something that is making them ill  or surly or depressed--something<br/>\nthat is yummy and quite fine  for anyone in small amounts-- and over time<br/>\nthe parent feels the need to protect the child from herself, because she is<br/>\nnot self-regulating in a way that is healthy?  This isn&#39;t happening in my<br/>\nhome with food, but it was with movies.  It goes to my original question,<br/>\nwhich put another way, asks:  Why not guide them or choose for them until<br/>\nthey older and more able to see and understand the effect their choices<br/>\ncause?<br/>\n<br/>\nMore basically, how do I give my children choices, while also protecting<br/>\nthem?  For me the answer is as clear as a bell for some things, but not for<br/>\nothers.  I mean, of course I let my children choose some of what we buy to<br/>\neat, and sometimes it isn&#39;t something I would choose for them myself.  But I<br/>\nstill primarily decide what I am going to cook, and while I may let them<br/>\nchoose to eat something else, most of the time I would not let them choose<br/>\ncandy,  for instance, as the alternative.  In that way I control their<br/>\neating to an extent.  I think that I&#39;m pretty comfortable with this<br/>\napproach, but I wonder if I&#39;m missing some illumination that might make me<br/>\ncompletely rethink this.  This is why I ask these questions.  I don&#39;t want<br/>\nto miss something importand and useful because I didn&#39;t push past my own<br/>\ncurrent understandings.<br/>\n<br/>\nAm I making any sense here?<br/>\n<br/>\n~Andrea</div>","specialLinks":[]},{"userId":182360290,"authorName":"SHYRLEY WILLIAMS","from":"=?iso-8859-1?q?SHYRLEY=20WILLIAMS?= &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sometimes it doesn&#39;t seem to work","postDate":"1086338384","msgId":95076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjA0MDgzOTQ0LjE1NzExLnFtYWlsQHdlYjg2MjA1Lm1haWwudWtsLnlhaG9vLmNvbT4=","inReplyToHeader":"PEM4OTdBNkQ1LUI1RkMtMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":95075,"nextInTopic":95077,"prevInTime":95075,"nextInTime":95077,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"I feel like I m at my wits end at the moment :-( I ve always advocated non-coercive parenting, talking with your children, letting them make their own choices","messageBody":"<div id=\"ygrps-yiv-1490001979\">I feel like I&#39;m at my wits end at the moment :-(<br/>\n<br/>\nI&#39;ve always advocated non-coercive parenting, talking with your children, letting them make their own choices re food, tv, computers etc etc.<br/>\n<br/>\nI appear to have bred litle brats.<br/>\n<br/>\nThe 3 of them (12, 10 and 9) spend their time fighting and bitching. They all appear to hate each other. The fights will reach a physical level if I don&#39;t intervene so I spend my entire day asking one or the other to leave one of their siblings alone. And its quite nasty fighting. Name calling, punching, threatening etc.<br/>\n<br/>\nWe rarely go out as one of them wont want to go. Sometimes they announce they wont go to the event becasue they wish to annoy one of the others. If we find an HE class only one will wish to go, usually Heather while the boys will complain and moan and make the whole experience hell as they don&#39;t want to participate or wait outside. Bryn never wants to leave the house so we can&#39;t go on the home-education camps this month as he wont come. If I *make* him he&#39;ll ruin the week for everyone else. I don&#39;t believe in making him go but it means none of us can go :-(<br/>\n<br/>\nWe don&#39;t have relatives or friends nearby who could watch the child who doesn&#39;t wish to leave the house - and who&#39;d want to come to my house, leaving their own kids anyway? At 10 and 9 I don&#39;t believe the boys are old enough to be left for several hours anyway. Lots of people knock on the door throughout the day which would scare them. I did try a group for women with post-natal depression. I managed 20 minutes before the boys called on the mobile asking me to come back. I was hoping to do an hour.<br/>\n<br/>\nAs for the computer, they fight over it constantly. Initially we had it so they had an hour then gave up the machine for the one next in line but even then they fight or claim they have 10 minutes more. It&#39;s not like its limited, they can play 24/7 and do so but still they fight.<br/>\n<br/>\nRight now I cant see any way out of this. I have to drag them to various hospital appointments for the sick baby which they all resent but careful explanations of why we have to go and how its not the baby&#39;s fault she&#39;s brain damaged fall on deaf ears.<br/>\n<br/>\nBedtimes are a pain too. We abolished bedtimes about 4 years ago. I figured kids know when they are tired but nooooooooooooooo. They stay up as late as possible, sometimes to annoy a sibling who wishes to go to bed (Heather wont go upstairs unless someone else is going to bed as she&#39;s scared of vampires) then they all leap out of bed at 7am after 5 hours sleep to beat each other to the computer. Which means they are crabby and bad tempered all day.<br/>\n<br/>\nHousework. They never want to help. Sometimes they will do a task if I ask, sometimes they say no. But I now feel like a skivvy. Its worse as the baby is very needy. She feeds hourly and needs to be held constantly. The house is falling apart round my ears. I am exhausted doing all the washing, cleaning, laundry. None of them will wash up as its &#39;yucky&#39;. They wont hang the laundry outside as they reckon the line is too high. My mother wouldn&#39;t have stood for this and we were *made* and expected to do chores. They leave their stuff lying around and then complain when something isn&#39;t washed.<br/>\n<br/>\nAy tips, or even better, anyoe want them?<br/>\n<br/>\nShyrley<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\n  Yahoo! Messenger - Communicate instantly...&quot;Ping&quot; your friends today! Download Messenger Now<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv Was:Meet A Person Where She&#39;s At","postDate":"1086335830","msgId":95073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM4OTdBNkQ1LUI1RkMtMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDAwMDAwMWM0NDllNyQyYTliNGI3MCQ2NTAxYThjMEBqZW5sYXB0b3A+","referencesHeader":"PDAwMDAwMWM0NDllNyQyYTliNGI3MCQ2NTAxYThjMEBqZW5sYXB0b3A+"},"prevInTopic":95069,"nextInTopic":95075,"prevInTime":95072,"nextInTime":95074,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"... He s four. You do the shopping - let him have a chance to make A choice when you re at the store. You don t have to fill your kitchen up with unhealthy","messageBody":"<div id=\"ygrps-yiv-436678811\">On Jun 3, 2004, at 8:51 PM, Jennifer Altenbach wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; BUT, I worry right now at<br/>\n&gt; the age of 4 that if I did not choose healthy, organic foods for my son<br/>\n&gt; AND he was exposed to the barrage of advertising for junk food (and<br/>\n&gt; pesticide-laden food and highly processed food and food harvested by<br/>\n&gt; slave laborers and food that is unsustainably grown, etc), he would<br/>\n&gt; choose to eat the junk food, and therefore be under the control of the<br/>\n&gt; food industry and the advertisers, which to me is less preferable than<br/>\n&gt; being under my control.<br/>\n<br/>\n </span></blockquote>He&#39;s four. You do the shopping - let him have a chance to make &quot;A&quot; <br/>\nchoice when you&#39;re at the store. You don&#39;t have to fill your kitchen up <br/>\nwith unhealthy not organic foods if you prefer to buy healthy organic <br/>\nfoods.<br/>\n<br/>\nAnd - this idea that our kids will be under the control of the <br/>\nadvertisers shows SO little faith in parents and kids abilities to <br/>\nthink for themselves. Advertising isn&#39;t magic. They aren&#39;t casting <br/>\nspells on us. We&#39;re smart - we think - we know they&#39;re trying to <br/>\nmanipulate us. We watch HOW they&#39;re trying to do it, we talk about it, <br/>\nwe analyze it, and we simply do not have to fall for it. It really is <br/>\njust NOT that tough to become advertising-savvy. My kids are totally <br/>\nunimpressed by advertising, especially television advertising. They <br/>\nare, in fact, as likely to be turned OFF to a product because they find <br/>\nthe advertising manipulative.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":140747339,"authorName":"Jennifer Altenbach","from":"&quot;Jennifer Altenbach&quot; &lt;salten@...&gt;","profile":"brownaltenbach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086331910","msgId":95075,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM0NGEwMCQ2YTNjNzkyMCQ2NTAxYThjMEBqZW5sYXB0b3A+","inReplyToHeader":"PGMwLmU2N2NmNmYuMmRmMTViNDdAYW9sLmNvbT4="},"prevInTopic":95073,"nextInTopic":95076,"prevInTime":95074,"nextInTime":95076,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"Yay!  I m glad I stayed up late-it s all buzzing around in my head and I would have been up a while thinking about it anyway.  Let s see... ","messageBody":"<div id=\"ygrps-yiv-714078552\">Yay!  I&#39;m glad I stayed up late-it&#39;s all buzzing around in my head and I<br/>\nwould have been up a while thinking about it anyway.  Let&#39;s see...<br/>\n <br/>\n<br/>\n&lt;&lt;&lt;Traditionally, it doesn&#39;t matter WHAT a child thinks about a<br/>\nsituation.  If <br/>\nthe parents say &quot;Sit down, right there, this way, and eat the food we<br/>\nput in <br/>\nfront of you, without complaining.  Eat all of it.  With a fork.   Then<br/>\nwe will <br/>\ngive you a treat/dessert.  Eat it.  With a fork.  Now clean up (or<br/>\nsubmit <br/>\nyourself to be cleaned up) and get in the bed and shut up and go to<br/>\nsleep.&gt;&gt;<br/>\n <br/>\nWell, we&#39;re already pretty far from traditional.  We don&#39;t tell our kids<br/>\nwhen, where, or how to eat, nor do we use dessert as a motivator.  We<br/>\nusually only clean them up if they are goopy.  The what to eat part<br/>\ndoesn&#39;t come at meal time, rather at grocery shopping time.  If my son<br/>\ndoesn&#39;t want to eat a portion of his meal, he doesn&#39;t have to, although<br/>\nI do encourage (not force) him to at least taste it.  <br/>\n<br/>\n&lt;&lt;If a child determines that he&#39;s not hungry, or doesn&#39;t like green<br/>\nbeans, or <br/>\nwould rather just have the apple pie and the chicken and no bread or<br/>\npotatoes, <br/>\nhe will be told he does not know what is good for him.  Worse, he might<br/>\nbe <br/>\ntold &quot;If you know what is good for you, you will do what I say.&quot;<br/>\n<br/>\nHOW ON EARTH can kids know what&#39;s good for them in circumstances like<br/>\nthat?&gt;&gt;&gt;<br/>\n <br/>\nLOL-- my son thinks that &quot;good for him&quot; means that it tastes good.<br/>\nHe&#39;ll specifically say that about things that he really likes.<br/>\n<br/>\n&lt;&lt;There are many here who know without any doubt that a child who is NOT<br/>\nmade <br/>\nto eat a certain way at a certain time will still eat enough, and a<br/>\nvariety, <br/>\nand more peacefully and happily.&gt;&gt;<br/>\n <br/>\nThis has been the case with my son.  But he has not been exposed to lots<br/>\nof junk food, so I guess I wasn&#39;t sure if it would stay that way when he<br/>\nwas.<br/>\n<br/>\n(snip)<br/>\n<br/>\n&lt;&lt;&lt;&quot;Exhibiting behaviors&quot;?<br/>\nThat&#39;s so clinical.  Do you mean he was making choices?&gt;&gt;&gt;<br/>\n <br/>\nSorry-that&#39;s the scientist in me talking.  I was referring to the<br/>\nmoodiness, lethargy, circles under the eyes, etc. that Andrea had<br/>\ndescribed as being a result of watching TV in her daughter.  Do you mean<br/>\nhe was choosing to be grouchy?  Gosh it sure seems like it sometimes ;)<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;-=-You all were discussing whether we control our kids wrt food, or<br/>\nwhether<br/>\nthey control themselves.  This, I understand.-=-<br/>\n<br/>\nI keep trying to get people NOT to talk about whether a child is <br/>\n&quot;controlling&quot; or &quot;regulating&quot; himself.   Ideally, he will not be<br/>\n&quot;controlling&quot; anything, <br/>\nbut will be honestly feeling and paying attention to his body, moods,<br/>\netc., to <br/>\ndecide whether he needs food, or sleep, or some alone time.  For real<br/>\nreasons. <br/>\nNot because he knows it&#39;s time to eat, but because he can tell he needs <br/>\njuice, or protein, or vegetables.&gt;&gt;&gt;&gt;<br/>\n <br/>\nRight, gotcha.  You were making the same point recently to someone who<br/>\nwas talking about their child &quot;self-regulating&quot;.<br/>\n<br/>\n(snip)<br/>\n<br/>\n&lt;&lt;&lt;You just talked about control and you&#39;re doing it again.<br/>\nWhy would you not think he could be &quot;under the control&quot; of his own<br/>\ndesires <br/>\nand curiosity?&gt;&gt;&gt;<br/>\n <br/>\nI was using the word control because it was used in an earlier post<br/>\nabout parents controlling what the child eats.  Here, I was wondering<br/>\nhow much control the media has over what the child eats.  But you are<br/>\nsaying that ultimately he is just following his desires, and that he can<br/>\nnot be manipulated by advertising?  I&#39;m not quite sure I understand this<br/>\npart.<br/>\n <br/>\n<br/>\n&lt;&lt;&lt;-=-if I did not choose healthy, organic foods for my son. . .-=-<br/>\n<br/>\nDo you tell him what to eat and when?  Is he getting to make any choices<br/>\nfrom <br/>\nthe available foods?&gt;&gt;&gt;&gt;<br/>\n <br/>\nThe only way I limit his choices is in what we have in the house.  Today<br/>\nhe had cereal for breakfast, lunch, and dinner--his choice.  My inner<br/>\nvoice objected, but outwardly I did not.<br/>\n<br/>\n&lt;&lt;&lt;&lt;-=-he would<br/>\nchoose to eat the junk food, and therefore be under the control of the<br/>\nfood industry and the advertisers, which to me is less preferable than<br/>\nbeing under my control. -=-<br/>\n<br/>\nDo what you prefer to do.  Don&#39;t worry about what we think.  Just do<br/>\nwhat you <br/>\nthink is best and right.   If control is preferable to you than<br/>\nsomething <br/>\nelse, then hang on to your control.&gt;&gt;&gt;&gt;&gt;<br/>\n <br/>\nI&#39;m not so much worried about what you think (although I do care) as I<br/>\nam curious about how you navigate these kinds of issues.  For me, it&#39;s<br/>\nsocial justice issues and environmental considerations that are limiting<br/>\nfactors.  But for a more concrete example, what if the child has a<br/>\nsevere food allergy?  Clearly in this case the parents DO need to limit<br/>\nthe child&#39;s food choices.  <br/>\n<br/>\n&lt;&lt;&lt;&lt;-= Those ad companies have put millions into<br/>\nresearching just how to get the kids to want the product being<br/>\nadvertised, and they have infiltrated kids&#39; lives through the media and<br/>\nof course in the schools too (one of the zillions of reasons we<br/>\nhomeschool). -=-<br/>\n<br/>\nIt sounds like advertisers have infiltrated YOUR life and is causing you<br/>\nto <br/>\nmake major life decisions based on hiding from them.   At my house,<br/>\nthey&#39;re not <br/>\ncontrolling me or my kids.  At your house, they have helped cause you to<br/>\n<br/>\nunschool, and to be afraid, and to prefer controlling your child.&gt;&gt;&gt;&gt;<br/>\n <br/>\nHey, at least they did one good thing!  OK, so it would be helpful for<br/>\nme to remember that all the research that has been done about how kids<br/>\nare victimized by advertising has been done on schooled kids within the<br/>\ntraditional framework.  He&#39;s only a victim of it if he has not learned<br/>\nto think for himself, and he can&#39;t learn to think for himself if he is<br/>\nnever given any choices.  I think I understand.<br/>\n<br/>\n<br/>\n(snip)<br/>\n<br/>\n&lt;&lt;&lt;&lt;  I <br/>\ndidn&#39;t tell her that some foods were evil and some were godly.&gt;&gt;&gt;<br/>\n <br/>\nAaaaahhhh, this one&#39;s gonna be hard for me!  Not that ice cream is evil<br/>\nand broccoli is godly, but that Roundup Ready soybeans are EVIL and the<br/>\ntomato that we grew in the backyard is godly.  My biases will clearly<br/>\ncome through here, but I&#39;ll try not to use those exact words (they&#39;ve<br/>\nbeen flung around enough lately anyway..)<br/>\n <br/>\n <br/>\n&lt;&lt;&lt;-=-How do you know when they<br/>\nare ready to make the decisions on their own?  -=-<br/>\n<br/>\nHow did you know when they were ready to start talking?  Stand up?<br/>\nWalk?&gt;&gt;&gt;&gt;<br/>\n <br/>\nWhy didn&#39;t I expect this question to be answered with a question?  (Just<br/>\nplaying &quot;Questions Only&quot; here &lt;g&gt;)  So you just know, huh.  OK.  <br/>\n<br/>\n&lt;&lt;&lt;&lt;My advice is to look at him directly, not through the lens of your<br/>\nfear of <br/>\nadvertising.  Advertising is between you and him.  Advertising is WAY,<br/>\nway <br/>\nbigger in your life than it is at my house, and we have broadcast TV,<br/>\nand magazines <br/>\nlying around.&gt;&gt;&gt;&gt;<br/>\n <br/>\nGood advice, Sandra.  It reminds me of the idea that when you resent<br/>\nsomeone, you give your life over to him, and he controls you.  I do have<br/>\nsome pretty strong feelings about this as you can tell.  I&#39;ll try to<br/>\nkeep them out of my relationship with my kids.<br/>\n<br/>\nThanks,<br/>\nJenny <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086325063","msgId":95069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMwLmU2N2NmNmYuMmRmMTViNDdAYW9sLmNvbT4="},"prevInTopic":95065,"nextInTopic":95073,"prevInTime":95068,"nextInTime":95070,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/04 10:36:52 PM, salten@comcast.net writes:  The unschooling","messageBody":"<div id=\"ygrps-yiv-614425080\">In a message dated 6/3/04 10:36:52 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salten@...\">salten@...</a> writes:<br/>\n<br/>\n&lt;&lt; Does the unschooling philosophy not take<br/>\ninto consideration  &gt;&gt;<br/>\n<br/>\n&quot;The unschooling philosophy&quot; isn&#39;t a thing.<br/>\nNot in the way that it takes anything into consideration.<br/>\n<br/>\nLots of people are giving their best advice, and the best of the best of all <br/>\nthat advice is (in my opinion, when I give advice) that which is closest to <br/>\nnatural and un-selfconscious everyday stuff (where &quot;everyday&quot; might still apply <br/>\nto really COOL days).<br/>\n<br/>\n-=-children may not yet be able to determine what<br/>\nis good for them in certain situations?-=-<br/>\n<br/>\nTraditionally, it doesn&#39;t matter WHAT a child thinks about a situation.  If <br/>\nthe parents say &quot;Sit down, right there, this way, and eat the food we put in <br/>\nfront of you, without complaining.  Eat all of it.  With a fork.   Then we will <br/>\ngive you a treat/dessert.  Eat it.  With a fork.  Now clean up (or submit <br/>\nyourself to be cleaned up) and get in the bed and shut up and go to sleep.&quot;<br/>\n<br/>\nIf a child determines that he&#39;s not hungry, or doesn&#39;t like green beans, or <br/>\nwould rather just have the apple pie and the chicken and no bread or potatoes, <br/>\nhe will be told he does not know what is good for him.  Worse, he might be <br/>\ntold &quot;If you know what is good for you, you will do what I say.&quot;<br/>\n<br/>\nHOW ON EARTH can kids know what&#39;s good for them in circumstances like that?<br/>\n<br/>\nThere are many here who know without any doubt that a child who is NOT made <br/>\nto eat a certain way at a certain time will still eat enough, and a variety, <br/>\nand more peacefully and happily.<br/>\n<br/>\nHOW can a child know when he&#39;s tired and wants to go to bed, if he&#39;s made to <br/>\ngo to bed before he&#39;s tired, consistently?  Alone?  In the dark?<br/>\n<br/>\n-=- We have done<br/>\nunlimited TV for a few months now with my 4yo and he was exhibiting many<br/>\nof the same behaviors that -=-<br/>\n<br/>\n&quot;Exhibiting behaviors&quot;?<br/>\nThat&#39;s so clinical.  Do you mean he was making choices?  <br/>\n<br/>\n-=-You all were discussing whether we control our kids wrt food, or whether<br/>\nthey control themselves.  This, I understand.-=-<br/>\n<br/>\nI keep trying to get people NOT to talk about whether a child is <br/>\n&quot;controlling&quot; or &quot;regulating&quot; himself.   Ideally, he will not be &quot;controlling&quot; anything, <br/>\nbut will be honestly feeling and paying attention to his body, moods, etc., to <br/>\ndecide whether he needs food, or sleep, or some alone time.  For real reasons. <br/>\n Not because he knows it&#39;s time to eat, but because he can tell he needs <br/>\njuice, or protein, or vegetables.<br/>\n<br/>\n-=-BUT, I worry right now at<br/>\nthe age of 4 that if I did not choose healthy, organic foods for my son<br/>\nAND he was exposed to the barrage of advertising for junk food (and<br/>\npesticide-laden food and highly processed food and food harvested by<br/>\nslave laborers and food that is unsustainably grown, etc), he would<br/>\nchoose to eat the junk food, and therefore be under the control of the<br/>\nfood industry and the advertisers-=-<br/>\n<br/>\nYou just talked about control and you&#39;re doing it again.<br/>\nWhy would you not think he could be &quot;under the control&quot; of his own desires <br/>\nand curiosity?<br/>\n<br/>\n-=-if I did not choose healthy, organic foods for my son. . .-=-<br/>\n<br/>\nDo you tell him what to eat and when?  Is he getting to make any choices from <br/>\nthe available foods?<br/>\n<br/>\n-=-he would<br/>\nchoose to eat the junk food, and therefore be under the control of the<br/>\nfood industry and the advertisers, which to me is less preferable than<br/>\nbeing under my control. -=-<br/>\n<br/>\nDo what you prefer to do.  Don&#39;t worry about what we think.  Just do what you <br/>\nthink is best and right.   If control is preferable to you than something <br/>\nelse, then hang on to your control.<br/>\n<br/>\n-= Those ad companies have put millions into<br/>\nresearching just how to get the kids to want the product being<br/>\nadvertised, and they have infiltrated kids&#39; lives through the media and<br/>\nof course in the schools too (one of the zillions of reasons we<br/>\nhomeschool). -=-<br/>\n<br/>\nIt sounds like advertisers have infiltrated YOUR life and is causing you to <br/>\nmake major life decisions based on hiding from them.   At my house, they&#39;re not <br/>\ncontrolling me or my kids.  At your house, they have helped cause you to <br/>\nunschool, and to be afraid, and to prefer controlling your child.<br/>\n<br/>\n-=- I presume that unschooled kids can<br/>\nand should be trusted to critically analyze the advertising and know<br/>\nwhen they are being manipulated.  I can see someone like Sandra&#39;s Holly<br/>\nbeing able to do this.  But at four?  Five? -=-<br/>\n<br/>\nHolly is the way she is because she has been treated as a seeing being all <br/>\nher life.   (&quot;Seeing being&quot; is a term from &quot;Whole Child, Whole Parent.&quot;)  I <br/>\ndidn&#39;t wait for her to be four or six or ten to let her make decisions about when <br/>\nshe was hungry, or whether she wanted to turn down a food she didn&#39;t want.   I <br/>\ndidn&#39;t tell her that some foods were evil and some were godly.  I didn&#39;t <br/>\nscare her about food.  And she loves artichokes, and cheese, and spinach.   She <br/>\nturned down some pudding she was given today after a taste,  because it was too <br/>\nsweet for her.   She gave it to someone else who did want it.<br/>\n<br/>\n-=-How do you know when they<br/>\nare ready to make the decisions on their own?  -=-<br/>\n<br/>\nHow did you know when they were ready to start talking?  Stand up?  Walk?  <br/>\n<br/>\n-=- But as he gets a little older and is exposed to<br/>\nmore advertising and more kids and more people&#39;s houses, I feel that we<br/>\nare about to start down a slippery slope.  How do we proceed from here?<br/>\n-=-<br/>\n<br/>\nMy advice is to look at him directly, not through the lens of your fear of <br/>\nadvertising.  Advertising is between you and him.  Advertising is WAY, way <br/>\nbigger in your life than it is at my house, and we have broadcast TV, and magazines <br/>\nlying around.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":140747339,"authorName":"Jennifer Altenbach","from":"&quot;Jennifer Altenbach&quot; &lt;salten@...&gt;","profile":"brownaltenbach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] ? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086321066","msgId":95065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM0NDllNyQyYTliNGI3MCQ2NTAxYThjMEBqZW5sYXB0b3A+","inReplyToHeader":"PDAwZTEwMWM0NDlhYiRmMjczNjJlMCRlZmI2Y2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":95057,"nextInTopic":95069,"prevInTime":95064,"nextInTime":95066,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"I would be interested in the replies to this question, particularly this part: ","messageBody":"<div id=\"ygrps-yiv-1055912293\">I would be interested in the replies to this question, particularly this<br/>\npart:<br/>\n <br/>\n&lt;&lt;&lt;Does the unschooling philosophy not take<br/>\ninto consideration that children may not yet be able to determine what<br/>\nis<br/>\ngood for them in certain situations?&gt;&gt;&gt;<br/>\n <br/>\nIn our case, I am interested in how this applies to food.  We have done<br/>\nunlimited TV for a few months now with my 4yo and he was exhibiting many<br/>\nof the same behaviors that Andrea referred to, but now he watches less<br/>\nand turns it off on his own, so I guess he has found how he wants to do<br/>\nit, and honestly he would choose playing with me over TV watching any<br/>\nday, I&#39;m just not always available. I do have to say that he only<br/>\nwatches public television or movies because we don&#39;t have cable so he<br/>\nsees very little advertising, which brings me to my real question..<br/>\n <br/>\n<br/>\nYou all were discussing whether we control our kids wrt food, or whether<br/>\nthey control themselves.  This, I understand.  BUT, I worry right now at<br/>\nthe age of 4 that if I did not choose healthy, organic foods for my son<br/>\nAND he was exposed to the barrage of advertising for junk food (and<br/>\npesticide-laden food and highly processed food and food harvested by<br/>\nslave laborers and food that is unsustainably grown, etc), he would<br/>\nchoose to eat the junk food, and therefore be under the control of the<br/>\nfood industry and the advertisers, which to me is less preferable than<br/>\nbeing under my control.  Those ad companies have put millions into<br/>\nresearching just how to get the kids to want the product being<br/>\nadvertised, and they have infiltrated kids&#39; lives through the media and<br/>\nof course in the schools too (one of the zillions of reasons we<br/>\nhomeschool).  Now I have thought about this a lot in the context of what<br/>\nyou all have been talking about, and I presume that unschooled kids can<br/>\nand should be trusted to critically analyze the advertising and know<br/>\nwhen they are being manipulated.  I can see someone like Sandra&#39;s Holly<br/>\nbeing able to do this.  But at four?  Five?  How do you know when they<br/>\nare ready to make the decisions on their own?  <br/>\n <br/>\nRight now, I&#39;m comfortable buying my son something he sees at the<br/>\ngrocery store that he wants to try, even if it is candy or chips or<br/>\nsomething-but we only go to the natural foods store.  I do let him taste<br/>\nfoods that I would never buy at other people&#39;s houses.  So far we have<br/>\nnot had many problems.  But as he gets a little older and is exposed to<br/>\nmore advertising and more kids and more people&#39;s houses, I feel that we<br/>\nare about to start down a slippery slope.  How do we proceed from here?<br/>\n <br/>\nVery interesting.<br/>\n <br/>\nJenny<br/>\n <br/>\n            <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"? ? re: limiting food choices and tv  Was:Meet A Person Where She&#39;s At","postDate":"1086295615","msgId":95057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZTEwMWM0NDlhYiRmMjczNjJlMCRlZmI2Y2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PGM5bm85Zys4bG10QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":95065,"prevInTime":95056,"nextInTime":95058,"topicId":95057,"numMessagesInTopic":0,"msgSnippet":"From: christy_imnotred I got in a  huge discussion on a pre-unschooling list about not controlling tv and food.  I said I didn t control these things","messageBody":"<div id=\"ygrps-yiv-1031400694\">From: &quot;christy_imnotred&quot;<br/>\n<br/>\n&quot;I got in a  huge &quot;discussion&quot; on a pre-unschooling list about not<br/>\ncontrolling tv and food.  I said I didn&#39;t control these things because I<br/>\nrespected my son as a whole person who knew what he wanted and needed.&quot;<br/>\n<br/>\nThis is something I have difficulty with as someone still coming to<br/>\nunderstand unschooling at a deeper level.  We don&#39;t currently have tv<br/>\naccess, mostly because where we live, we would have to purchase cable to get<br/>\nit, but also because my husband and I aren&#39;t really much into tv.   But we<br/>\ndo rent dvd&#39;s or check them out from the library.  Now, my 4 yo girl,<br/>\nStella, didn&#39;t watch anything on the television screen until she was almost<br/>\n3 (except for the very occasional time we had something on and she looked at<br/>\nit and then toddled away to do something else) and I felt good about that<br/>\nnot only because of the research that talks about the dangers to a child&#39;s<br/>\ndeveloping brains, but also because she didn&#39;t seem interested.  Also, she<br/>\njust LOVES being read to and we do this alot.  Stories we read to her spark<br/>\nher imagination in really great ways when she plays.<br/>\n<br/>\nNow she has come to enjoy watching &quot;kid&#39;s movies,&quot; as she calls them.  She<br/>\nand Annie, the 3 yo, love to sit down in the afternoon/evening when I&#39;m<br/>\ncooking dinner and watch a movie.  This isn&#39;t really a problem in and of<br/>\nitself, but inevitably she wants to watch movies just all the time,<br/>\nsometimes even asking for a movie before the sleep is dried from her eyes in<br/>\nthe morning.  When I tried out just letting them have unlimited access, the<br/>\ngirls, especially Stella, would want to do nothing but watch movies.  And I<br/>\ncould plainly see it wasn&#39;t good for them.  After watching for an hour or<br/>\ntwo or sometimes more, they would be SO grumpy  or completely wound up.<br/>\nStella even gets circles under her eyes after a long bout of tv.  If it was<br/>\nearly in the day, I could take them outside to do something fun and physical<br/>\nafterwards, but in the evenings, they&#39;d just be fit to be tied right around<br/>\nbedtime.  Also, Stella&#39;s play started to be really regimented and<br/>\nunimaginative.  She would no longer combine stories and add her own elements<br/>\nto them, but she would say exactly what she heard on the show.  While she<br/>\nwould occassionally  learn something interesting, I felt she learned much<br/>\nmore and had more fun when she was getting more varied input.  We&#39;d still<br/>\nread to her during this time of unlimited tv, and she loved that, but her<br/>\nplay was so much different.  I went back to limiting tv, because I felt she<br/>\ndidn&#39;t know how to self-limit yet.   In other words, I protected her from<br/>\nherself.  Is that disrespectful?  Does the unschooling philosophy not take<br/>\ninto consideration that children may not yet be able to determine what is<br/>\ngood for them in certain situations?<br/>\n<br/>\nFood is another thing.  People are always asking me, &quot;How do you get your<br/>\nkids to eat that?&quot;   Usually this refers to vegetables, but sometimes they<br/>\nmean almost anything but processed snack food stuff.  I&#39;ve just not had the<br/>\nfood problems some people seem to have.  I think much of this is just my<br/>\nkids&#39; taste, but also I just always had healthy food options in the house<br/>\nand not alot of processed food.  I didn&#39;t worry to much about it, although<br/>\nmy husband has needed some coaching (which he is very resistant to.  He<br/>\nsometimes says things like &quot;good job&quot; when one of the girls eats everything<br/>\non her plate.  That makes me cringe!  I usually say, &quot;You must have been<br/>\nhungry&quot; when one of my children shows me their &quot;clean plate.&quot;)  I do<br/>\noccassionally prepare a seperate meal for someone who doesn&#39;t want what the<br/>\nrest of us are having, so there is sometimes a choice, but not always,<br/>\ndepending on what we are having, my energy level, etc...  We do have a<br/>\ngeneral rule that if you decide not to eat what is served (or what I made<br/>\nspecial for you), or if you only eat a few bites and say, &quot;I&#39;m full,&quot; it is<br/>\nnot okay to turn right around eat candy, chips, cookies or whatever as an<br/>\nalternative.  Oh, they sometimes ask, but I do say &quot;No,&quot; except on some rare<br/>\noccasions like a birthday party or a family outing when we completely skip<br/>\nlunch in favor of ice cream and pretzels or something like that.  Clearly, I<br/>\ndo control food to an extent, even though I always make healthy food<br/>\navailable that they can eat anytime, even right before dinner, like fruit<br/>\nand baby carrots.  Does this go against an unschooling philosophy?<br/>\n<br/>\n~Andrea</div>","specialLinks":[]}],"prevTopicId":95262,"nextTopicId":95431}}