{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":689589,"authorName":"KT","from":"KT &lt;Tuck@...&gt;","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] The NEA","postDate":"1029011818","msgId":40629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENTU3OTZBLjEwNjA5MDdAbWlkc291dGgucnIuY29tPg==","referencesHeader":"PDRmLjIxYjNmMWQ5LjJhODYwYjRlQGFvbC5jb20+"},"prevInTopic":40559,"nextInTopic":0,"prevInTime":40628,"nextInTime":40630,"topicId":40559,"numMessagesInTopic":0,"msgSnippet":"First, Pam, I want to know who those typos in the NEA s part of the exchange belonged to?  If you transcribed the letter, than you re absolved.   But was it","messageBody":"<div id=\"ygrps-yiv-1280092599\">First, Pam, I want to know who those typos in the NEA&#39;s part of the <br/>\nexchange belonged to?  If you transcribed the letter, than you&#39;re <br/>\nabsolved.  &lt;g&gt; But was it sent to NHEN like that?<br/>\n<br/>\nSecond, I&#39;m curious about how the NEA feels about private school <br/>\nstudents who don&#39;t used state curricula?<br/>\n<br/>\nI know that resolution, verbatim, has been renewed every year since I <br/>\nstarted homeschooling.  You&#39;d think they had the time to at least <br/>\nre-word it after 14 years!<br/>\n<br/>\nTuck</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The NEA","postDate":"1028960590","msgId":40559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRmLjIxYjNmMWQ5LjJhODYwYjRlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":40629,"prevInTime":40558,"nextInTime":40560,"topicId":40559,"numMessagesInTopic":0,"msgSnippet":"You all may be interested to know that the National Home Education Network wrote to the NEA not too long ago and received a reply. Dear Mr. Chase: I saw your","messageBody":"<div id=\"ygrps-yiv-1486009364\">You all may be interested to know that the National Home Education Network <br/>\nwrote to the NEA not too long ago and received a reply. <br/>\n<br/>\nDear Mr. Chase:<br/>\nI saw your recent speech to the National Press Club on CSPAN. I was <br/>\narrested in my spin around the dial by a man who said he was a <br/>\nhistory teacher. Since I, too, was a history teacher, I stopped to <br/>\nlisten to what he had to say. I was immediately impressed by this <br/>\nman&#39;s authenticity and humility, as well as by his compelling <br/>\npresentation – all hallmarks of an excellent teacher. I was very <br/>\npleased to discover that this man was Bob Chase, President of the <br/>\nNational Education Association. I am a former member of your <br/>\norganization, but for the past twenty years I have been retired from <br/>\nclassroom teaching. Instead, I have been homeschooling with our two <br/>\nchildren, the younger of whom is now in her first year of college. <br/>\n<br/>\nIt is as a homeschool advocate that I now write you. I am currently <br/>\nthe Legislative Director of the National Home Education Network <br/>\n(NHEN). NHEN was formed two years ago as a grassroots organization, <br/>\ncommitted to celebrating the diversity of homeschoolers. In our <br/>\nshort life, we have grown to include thousands of homeschoolers in <br/>\nour network and have been successful in showing the public the <br/>\ndiversity of homeschoolers, through numerous media articles. (one <br/>\nincluded) Homeschoolers are indeed a diverse bunch, but the one thing <br/>\nwe all have in common is our commitment to assume responsibility for <br/>\nour children&#39;s education. We know, from the successes we see in our <br/>\nown families and those of our friends, that homeschooling really <br/>\nworks. So we cannot comprehend why the NEA would see the need to <br/>\nadopt a resolution opposing homeschooling. (see copy attached)<br/>\n<br/>\nThe resolution is well known in the homeschooling community and has <br/>\ngenerated hard feelings among a population that is now numbering <br/>\nbetween 1.5 and 2.5 million students, according to a recent <br/>\ngovernment survey. I am certain that an objective review of the <br/>\navailable evidence will reveal that NEA&#39;s categorical position cannot <br/>\nbe supported. I am enclosing with this letter a short list of <br/>\nresearch articles that are available on the web; I would be pleased <br/>\nto provide you with as much additional information as you would care <br/>\nto read.<br/>\n<br/>\nWhen I saw you on television, I was convinced that with your common-<br/>\nsense approach you would be able either to provide a coherent <br/>\nexplanation of the NEA&#39;s reasoning and motivation in adopting that <br/>\nresolution, or to consider eliminating the resolution from your <br/>\nplatform the next time around.<br/>\n<br/>\nI would welcome a chance to meet with you by phone or in person to <br/>\ndiscuss home education as it exists across the United States today. <br/>\nI would like to hear your thoughts on the possibility of persuading <br/>\nthe NEA not to re-adopt that resolution another time, and what steps <br/>\nhomeschoolers might take to help persuade NEA.<br/>\n<br/>\n(It was signed by Nicky Hardenbergh, an NHEN board member)<br/>\n<br/>\n***************************<br/>\n<br/>\nDear Ms. Hardenbergh;<br/>\nThank you for your recent comments about my speech at the National Press<br/>\nClub. I also appreciate the information on homeschooling and the National<br/>\nHome Education Network.<br/>\nThe Association is very concerned about the education and well-being of all<br/>\nchildren, and works to ensure that they are taught in an environment<br/>\nconducive to effective learning. The NEA Representative Assembly, made up of<br/>\n9,000 delegates who represent the 2.6 million members throughout the country,<br/>\nis the Association&#39;s primary policy-making body. This body thoroughly<br/>\ndiscusses and debates every proposed policy before voting to approve or<br/>\nreject it.<br/>\nDuring the 1988 RA, delegates approved the policy on homeschooling. They were<br/>\nconcerned that homeschooled students were not provided a comprehensive<br/>\neducation experience because they did not have an opportunity to interact<br/>\nwith students of different cultures, economic status, or learning styles. The<br/>\nfelt homeschooled students learned in a setting primarily made up [of] family<br/>\nmembers and friends.<br/>\nWe know that parental involvement is imperative for school achievement, but<br/>\ndelegates were concerned that home schools were not required to use<br/>\nstate-approved curricula. The agreed that homeschooled students have done<br/>\nwell on national tests and were the top spellers in the National Spelling Bee<br/>\ntwo years ago, but felt home school instruction should meet certain state<br/>\neducation standards.<br/>\nThese are some of the reasons delegates approved the 1988 resolution on<br/>\nhomeschooling, and reconfirmed their position at the 2000 annual meeting.<br/>\nMembers who want this policy reviewed my submit a proposal to the Resolutions<br/>\nCommittee for presentation at the RA.<br/>\nThank you again for your comments and the materials on homeschooling.<br/>\nSincerely,<br/>\n<br/>\nBob Chase<br/>\nPresident</div>","specialLinks":[]}],"prevTopicId":40614,"nextTopicId":40632}}