{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Johanna","from":"&quot;Johanna&quot; &lt;saninocencio1@...&gt;","replyTo":"LIST","senderId":"c5lMwhf92ka3wdrQlnZbYai10p_NU8G3DdTS9u8LoVVC7ByNcrjLbLoD-JMhOMN1kvCl4b9yK2xTUt1fSZAwnWM4fbL7OjEZ2cbaDw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Montessori preschool","postDate":"987121635","msgId":18589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWMwYzNiMCQ3ZWY0YjI4MCQyZmVjYWRjZkBvZW1jb21wdXRlcj4=","referencesHeader":"PDk4NjIzNjc5OS45MjguODAyNDYubDhAeWFob29ncm91cHMuY29tPiA8MDBiNDAxYzBjMzZhJDI3ZmIzYzYwJDU3ZDMwZTNmQDgzOGYzMDE+"},"prevInTopic":18566,"nextInTopic":0,"prevInTime":18588,"nextInTime":18590,"topicId":17789,"numMessagesInTopic":0,"msgSnippet":"I can so identify with the pink stereotype. When my son was two he had a pink sweatshirt that had a magical looking carousel horse on it and he loved it, but","messageBody":"<div id=\"ygrps-yiv-1659643438\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div><font color=\"#008080\" size=\"4\">I can so identify with the &quot;pink&quot; stereotype. \nWhen my son was two he had a pink sweatshirt that had a magical looking carousel \nhorse on it and he loved it, but people used to make comments to him, whenever \nhe wore it. a family member had given it to him so it was special.</font></div>\n<div>Johanna<br>&quot;Education is not the filling of a bucket but the lighting of a \nfire&quot;<br>William Butler Yeats</div>\n<blockquote><span title=\"qreply\"> <blockquote\n style=\"BORDER-LEFT:#008080 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;PADDING-RIGHT:0px;\">\n  <div style=\"FONT:10pt arial;\">----- Original Message ----- </div>\n  <div\n style=\"BACKGROUND:#e4e4e4;FONT:10pt arial;\"><b>From:</b> \n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamondair@...\"\n title=\"diamondair@...\">DiamondAir</a> </div>\n  <div style=\"FONT:10pt arial;\"><b>To:</b> <a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\"\n title=\"Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> \n  </div>\n  <div style=\"FONT:10pt arial;\"><b>Sent:</b> Thursday, April 12, 2001 10:42 \n  AM</div>\n  <div style=\"FONT:10pt arial;\"><b>Subject:</b> [Unschooling-dotcom] Re: \n  Montessori preschool</div>\n  <div><br></div><tt>Hi georgeanne. This was in my &quot;Drafts&quot; folder waiting to be \n  finished, but I<br>saw your recent post and realized that you were still \n  searching for answers.<br>So here&#39;s my 2 cents, for what that&#39;s worth \n  :-)<br><br>=========<br>&gt;&nbsp;&nbsp;&nbsp; From: <a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:GeorganneD@...\">GeorganneD@...</a><br>&gt;(I remember \n  once reading a book<br>&gt; about parenting by a woman who the jacket said had \n  written a book called<br>&gt; something like &quot;the Uncoloring Book&quot;.&nbsp; \n  Anybody know anything about that<br>&gt; book?)<br><br>I don&#39;t know about that \n  book specifically, but we have many &quot;uncoloring<br>books&quot; around our house \n  (otherwise known as blank paper and crayons :-)<br><br>&gt;&nbsp; My boys are \n  very normal boys.&nbsp; They hardly ever let each other sit and be<br>&gt; \n  involved in anything. There has recently been quite a bit of \n  improvement<br>in<br>&gt; that area and I wonder if this too will be \n  outgrown.&nbsp; That&#39;s hard for<br>anyof<br>&gt; you to say, as three of your \n  kids aren&#39;t the same age and stage!<br><br><br>If you&#39;d like, I&#39;ll pass this \n  email on to someone I know with older<br>homeschooled triplets (I think \n  they&#39;re about 10 y.o. now). She might even<br>be on this list, though I \n  haven&#39;t seen her post. As for siblings not letting<br>each other sit and be \n  involved in anything, that happens here too (and I<br>daresay in any house \n  with more than one child :-).<br><br><br>&gt;&nbsp;&nbsp;&nbsp;&nbsp; So, at \n  the moment I am wavering between thinking a year or two of<br>&gt; expensive \n  Montessori might set us up for personally directed learning, and<br>&gt; \n  thinking that the sports classes and nursery at the health club is all \n  we<br>&gt; need for preschool.&nbsp; Help!&nbsp; REgistration is sooner rather \n  than later if I<br>&gt; want three spots at the Children&#39;s House!<br><br><br>I \n  guess my 2 cents would be to sit down and think of the positives \n  and<br>negatives of each situation and see if you can see a clear case where \n  one<br>would outweigh the other. I have occasionally thought about sending my \n  son<br>to preschool, primarily so I&#39;d have some one-on-one time with my \n  daughter,<br>and he&#39;d have some time where he didn&#39;t have to contend with a \n  toddler into<br>everything he&#39;s doing. So I basically did a cost-benefit \n  analysis of the<br>situation and decided that for us it makes more sense to \n  have him at home. I<br>don&#39;t just mean monetary costs, I included things like \n  &quot;He will have to eat<br>on a schedule&quot;, &quot;I&#39;ll have to get him out of the house \n  at a certain time<br>every morning&quot; and &quot;He&#39;ll learn all kinds of things I \n  don&#39;t want him to<br>know&quot; in the &quot;cost&quot; section as well as the $$$ it would \n  cost us and<br>non-monetary benefits under the benefits side as \n  well.<br><br><br>&gt;&nbsp;&nbsp;&nbsp;&nbsp; Barda, you referred to an eye \n  opening Montessori story.&nbsp; I would<br>&gt; appreciate hearing it if you \n  have time to write it down!&nbsp; And welcome.<br><br><br>I don&#39;t know what \n  this story is, but I do know someone who had real problems<br>with a \n  Montessori-type preschool (in Washington) with their 3 year old<br>daughter. I \n  guess they (Montessori) are real big on finishing what you&#39;ve<br>started, and \n  finishing one &quot;level&quot; of tasks before you can move on to<br>something else. My \n  friend&#39;s daughter was not allowed to move on to one<br>exercise (something to \n  do with cuisinaire rods, I think) because she hadn&#39;t<br>finished the previous \n  one yet.&nbsp; I guess I get the concept, but it sort of<br>runs against what \n  I believe in about how kids learn, which is that each<br>child learns in their \n  own individual way. I think if you&#39;re planning on<br>unschooling, this may be \n  something you want to consider - will having to<br>learn things a certain way \n  interfere with the way they think about learning<br>and their own abilities? \n  Only you know the answer for your own kids.<br><br><br><br>&gt;When I joined \n  this list a month or two ago I thought I was really driven<br>&gt; to be doing \n  it so soon.&nbsp; My boys won&#39;t even be three until June!<br><br><br>Well, I \n  believe that &quot;unschooling&quot;, unlike schooling has no stopping or<br>starting \n  place. It could just as easily be called &quot;lifelong natural<br>learning&quot;. It \n  seems bizarre to me that people will now be considering my son<br>to be \n  &quot;school aged&quot;, when really nothing magical occurs. He will learn<br>tomorrow \n  the same way he learns today. It *is* great to think about doing it<br>before \n  putting kids into a school situation. I know many unschoolers have \n  to<br>&quot;deschool&quot; and undo the damage a formal learning system can do to a \n  child&#39;s<br>natural desire to learn. This is one reason I&#39;ve leaned away from \n  doing any<br>kind of formal preschool, but each person has to make their own \n  decision. If<br>I ever did preschool for my kid, I think I&#39;d lean more towards \n  Waldorf than<br>Montessori. Waldorf schools, especially for very young \n  children, emulate a<br>home-like atmosphere. They are very gentle and natural \n  and believe kids<br>learn through play and through emulation (of adults who \n  are cooking,<br>cleaning, doing &quot;fingerwork&quot; or knitting, sewing, etc. ) at \n  the preschool<br>age.<br><br>One other reason I have stayed away from the idea \n  of preschool is that I<br>want to keep my child&#39;s imagination from being \n  prematurely limited. The<br>other day he wanted to paint his fingernails pink, \n  which he said looked<br>&quot;magical&quot; and made him look &quot;like a fairy&quot;. I can \n  imagine that other<br>preschool-aged kids would quickly quash this sort of \n  instinct as most 4 year<br>olds in constant contact with the TV and other \n  sources are pretty well aware<br>already that little boys shouldn&#39;t want to \n  look fairy-like. In fact, we were<br>at a bike store the other day when he was \n  admonished by another 4 y.o. there<br>because he was riding &quot;a girl&#39;s bike&quot; \n  (it had a pink seat, but was otherwise<br>blue). My son wouldn&#39;t have known \n  that pink is mysteriously reserved for<br>girls until this. I know he will \n  encounter this eventually, but I&#39;d like to<br>preserve the magic of a \n  non-limited imagination for a couple more years if<br>possible. Advertisers \n  and manufacturers of children&#39;s products have done<br>such an impressive and \n  thorough job of pounding certain attributes into our<br>youth (even looking at \n  the toy advertisements in the local newspaper, it is<br>painfully obvious that \n  only little boys play with trucks, and the &quot;pink<br>pages&quot; are for little \n  girls), that I feel it actually closes down some of<br>their ability to think \n  in different ways before they&#39;re ready to understand<br>such sex stereotyping. \n  In any case, that&#39;s just another thing that I<br>considered thoroughly before \n  making my decision.<br><br>Best of luck, I hope you find a solution that works \n  for you!<br><br>Blue Skies!<br>&nbsp;&nbsp; -Robin-<br>Mom to Mackenzie \n  (8/28/96) &quot;Asa is running her voice out&quot;<br>and Asa (10/5/99) Who sings &quot;the \n  alien song&quot;<br><a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>&nbsp;&nbsp; \n  Flying Clevenger Family<br><br></tt><br><br><tt>Message \n  boards, timely articles, a free newsletter and more!<br>Check it all out at: \n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br><br>To \n  unsubscribe, set preferences, or read archives:<br><a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br><br>Another \n  great list sponsored by Home Education Magazine!<br><a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a> \n  <br><br></tt><br><br><tt>Your use of Yahoo! Groups is subject to the <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">Yahoo! Terms of Service</a>.</tt> \n<br></blockquote></span></blockquote></html> \n</div>","specialLinks":[]},{"userId":0,"authorName":"DiamondAir","from":"&quot;DiamondAir&quot; &lt;diamondair@...&gt;","replyTo":"LIST","senderId":"yhtkc2ADfPyfbPuM1FFe2ZDisfXGYsbEZZdAcmRsSQgDGYkFL1vulYUeGGC7Rn3pSee5HlZFAZwNNHhvCTTvtCmiYNbkZgQ-JbSFgtwH","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Montessori preschool","postDate":"987090130","msgId":18566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYjQwMWMwYzM2YSQyN2ZiM2M2MCQ1N2QzMGUzZkA4MzhmMzAxPg==","referencesHeader":"PDk4NjIzNjc5OS45MjguODAyNDYubDhAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":17789,"nextInTopic":18589,"prevInTime":18565,"nextInTime":18567,"topicId":17789,"numMessagesInTopic":0,"msgSnippet":"Hi georgeanne. This was in my Drafts folder waiting to be finished, but I saw your recent post and realized that you were still searching for answers. So","messageBody":"<div id=\"ygrps-yiv-2105135807\">Hi georgeanne. This was in my &quot;Drafts&quot; folder waiting to be finished, but I<br/>\nsaw your recent post and realized that you were still searching for answers.<br/>\nSo here&#39;s my 2 cents, for what that&#39;s worth :-)<br/>\n<br/>\n=========<br/>\n<blockquote><span title=\"ireply\"> &gt;    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:GeorganneD@...\">GeorganneD@...</a><br/>\n&gt;(I remember once reading a book<br/>\n&gt; about parenting by a woman who the jacket said had written a book called<br/>\n&gt; something like &quot;the Uncoloring Book&quot;.  Anybody know anything about that<br/>\n&gt; book?)<br/>\n<br/>\n </span></blockquote>I don&#39;t know about that book specifically, but we have many &quot;uncoloring<br/>\nbooks&quot; around our house (otherwise known as blank paper and crayons :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  My boys are very normal boys.  They hardly ever let each other sit and be<br/>\n&gt; involved in anything. There has recently been quite a bit of improvement<br/>\n </span></blockquote>in<br/>\n<blockquote><span title=\"ireply\"> &gt; that area and I wonder if this too will be outgrown.  That&#39;s hard for<br/>\n </span></blockquote>anyof<br/>\n<blockquote><span title=\"ireply\"> &gt; you to say, as three of your kids aren&#39;t the same age and stage!<br/>\n<br/>\n<br/>\n </span></blockquote>If you&#39;d like, I&#39;ll pass this email on to someone I know with older<br/>\nhomeschooled triplets (I think they&#39;re about 10 y.o. now). She might even<br/>\nbe on this list, though I haven&#39;t seen her post. As for siblings not letting<br/>\neach other sit and be involved in anything, that happens here too (and I<br/>\ndaresay in any house with more than one child :-).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;     So, at the moment I am wavering between thinking a year or two of<br/>\n&gt; expensive Montessori might set us up for personally directed learning, and<br/>\n&gt; thinking that the sports classes and nursery at the health club is all we<br/>\n&gt; need for preschool.  Help!  REgistration is sooner rather than later if I<br/>\n&gt; want three spots at the Children&#39;s House!<br/>\n<br/>\n<br/>\n </span></blockquote>I guess my 2 cents would be to sit down and think of the positives and<br/>\nnegatives of each situation and see if you can see a clear case where one<br/>\nwould outweigh the other. I have occasionally thought about sending my son<br/>\nto preschool, primarily so I&#39;d have some one-on-one time with my daughter,<br/>\nand he&#39;d have some time where he didn&#39;t have to contend with a toddler into<br/>\neverything he&#39;s doing. So I basically did a cost-benefit analysis of the<br/>\nsituation and decided that for us it makes more sense to have him at home. I<br/>\ndon&#39;t just mean monetary costs, I included things like &quot;He will have to eat<br/>\non a schedule&quot;, &quot;I&#39;ll have to get him out of the house at a certain time<br/>\nevery morning&quot; and &quot;He&#39;ll learn all kinds of things I don&#39;t want him to<br/>\nknow&quot; in the &quot;cost&quot; section as well as the $$$ it would cost us and<br/>\nnon-monetary benefits under the benefits side as well.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;     Barda, you referred to an eye opening Montessori story.  I would<br/>\n&gt; appreciate hearing it if you have time to write it down!  And welcome.<br/>\n<br/>\n<br/>\n </span></blockquote>I don&#39;t know what this story is, but I do know someone who had real problems<br/>\nwith a Montessori-type preschool (in Washington) with their 3 year old<br/>\ndaughter. I guess they (Montessori) are real big on finishing what you&#39;ve<br/>\nstarted, and finishing one &quot;level&quot; of tasks before you can move on to<br/>\nsomething else. My friend&#39;s daughter was not allowed to move on to one<br/>\nexercise (something to do with cuisinaire rods, I think) because she hadn&#39;t<br/>\nfinished the previous one yet.  I guess I get the concept, but it sort of<br/>\nruns against what I believe in about how kids learn, which is that each<br/>\nchild learns in their own individual way. I think if you&#39;re planning on<br/>\nunschooling, this may be something you want to consider - will having to<br/>\nlearn things a certain way interfere with the way they think about learning<br/>\nand their own abilities? Only you know the answer for your own kids.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;When I joined this list a month or two ago I thought I was really driven<br/>\n&gt; to be doing it so soon.  My boys won&#39;t even be three until June!<br/>\n<br/>\n<br/>\n </span></blockquote>Well, I believe that &quot;unschooling&quot;, unlike schooling has no stopping or<br/>\nstarting place. It could just as easily be called &quot;lifelong natural<br/>\nlearning&quot;. It seems bizarre to me that people will now be considering my son<br/>\nto be &quot;school aged&quot;, when really nothing magical occurs. He will learn<br/>\ntomorrow the same way he learns today. It *is* great to think about doing it<br/>\nbefore putting kids into a school situation. I know many unschoolers have to<br/>\n&quot;deschool&quot; and undo the damage a formal learning system can do to a child&#39;s<br/>\nnatural desire to learn. This is one reason I&#39;ve leaned away from doing any<br/>\nkind of formal preschool, but each person has to make their own decision. If<br/>\nI ever did preschool for my kid, I think I&#39;d lean more towards Waldorf than<br/>\nMontessori. Waldorf schools, especially for very young children, emulate a<br/>\nhome-like atmosphere. They are very gentle and natural and believe kids<br/>\nlearn through play and through emulation (of adults who are cooking,<br/>\ncleaning, doing &quot;fingerwork&quot; or knitting, sewing, etc. ) at the preschool<br/>\nage.<br/>\n<br/>\nOne other reason I have stayed away from the idea of preschool is that I<br/>\nwant to keep my child&#39;s imagination from being prematurely limited. The<br/>\nother day he wanted to paint his fingernails pink, which he said looked<br/>\n&quot;magical&quot; and made him look &quot;like a fairy&quot;. I can imagine that other<br/>\npreschool-aged kids would quickly quash this sort of instinct as most 4 year<br/>\nolds in constant contact with the TV and other sources are pretty well aware<br/>\nalready that little boys shouldn&#39;t want to look fairy-like. In fact, we were<br/>\nat a bike store the other day when he was admonished by another 4 y.o. there<br/>\nbecause he was riding &quot;a girl&#39;s bike&quot; (it had a pink seat, but was otherwise<br/>\nblue). My son wouldn&#39;t have known that pink is mysteriously reserved for<br/>\ngirls until this. I know he will encounter this eventually, but I&#39;d like to<br/>\npreserve the magic of a non-limited imagination for a couple more years if<br/>\npossible. Advertisers and manufacturers of children&#39;s products have done<br/>\nsuch an impressive and thorough job of pounding certain attributes into our<br/>\nyouth (even looking at the toy advertisements in the local newspaper, it is<br/>\npainfully obvious that only little boys play with trucks, and the &quot;pink<br/>\npages&quot; are for little girls), that I feel it actually closes down some of<br/>\ntheir ability to think in different ways before they&#39;re ready to understand<br/>\nsuch sex stereotyping. In any case, that&#39;s just another thing that I<br/>\nconsidered thoroughly before making my decision.<br/>\n<br/>\nBest of luck, I hope you find a solution that works for you!<br/>\n<br/>\n Blue Skies!<br/>\n   -Robin-<br/>\nMom to Mackenzie (8/28/96) &quot;Asa is running her voice out&quot;<br/>\nand Asa (10/5/99) Who sings &quot;the alien song&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>   Flying Clevenger Family</div>","specialLinks":[]},{"userId":0,"authorName":"GeorganneD@aol.com","from":"GeorganneD@...","replyTo":"LIST","senderId":"ufht7I69YrAJL3Gal9uUrN2SkdPNdsnG-lGMdkBFQw-oCLCtB8Q0oba6JcjN2fCoU0vpLosdb8Zw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Montessori preschool","postDate":"986235969","msgId":17789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjEzMmJiY2YyLjI3ZmExZTQxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":18566,"prevInTime":17788,"nextInTime":17790,"topicId":17789,"numMessagesInTopic":0,"msgSnippet":"I d like to thank those of you who responded to my email awhile back about my plans to send my 3 yo triplet boys to preschool before unschooling.  Boy, was ","messageBody":"<div id=\"ygrps-yiv-295811516\">I&#39;d like to thank those of you who responded to my email awhile back about my <br/>\nplans to send my 3 yo triplet boys to preschool before unschooling.  Boy, was <br/>\nthat said in ignorance!  Since then I have visited three preschools and was <br/>\nhorrified at two of them.  They truly are little schools!<br/>\n]<br/>\n    The one I like was a very well known Montessori preschool in our area.  <br/>\nI&#39;m attracted because of the patterns of working without being interupted, <br/>\nputting things away, and following one&#39;s own interest.  I didn&#39;t observe any <br/>\nart going on, so don&#39;t know whether art experiences would be as directed as <br/>\nthe ones I saw at the other preschools.  (I remember once reading a book <br/>\nabout parenting by a woman who the jacket said had written a book called <br/>\nsomething like &quot;the Uncoloring Book&quot;.  Anybody know anything about that <br/>\nbook?)   <br/>\n<br/>\n    My boys are very normal boys.  They hardly ever let each other sit and be <br/>\ninvolved in anything.  There has recently been quite a bit of improvement in <br/>\nthat area and I wonder if this too will be outgrown.  That&#39;s hard for any of <br/>\nyou to say, as three of your kids aren&#39;t the same age and stage!<br/>\n    We recently joined a big health club with a big nursery and I&#39;ve noticed <br/>\nthat George, who loves to build with blocks, is usually at the block table <br/>\nwith other kids, not his brothers, and that he is allowed to build <br/>\nuninterrupted.  Also, when I am in the room and someone sets up a howl at <br/>\nbeing messed with and I ask them if they want to do it (puzzle, play with <br/>\ndinosaurs, or whatever) alone, and they say yes, and I explain to the <br/>\nintruder that his brother wants to do it alone, then it is okay and they are <br/>\nleft alone.<br/>\n    <br/>\n    So, at the moment I am wavering between thinking a year or two of <br/>\nexpensive Montessori might set us up for personally directed learning, and <br/>\nthinking that the sports classes and nursery at the health club is all we <br/>\nneed for preschool.  Help!  REgistration is sooner rather than later if I <br/>\nwant three spots at the Children&#39;s House!<br/>\n    <br/>\n    Barda, you referred to an eye opening Montessori story.  I would <br/>\nappreciate hearing it if you have time to write it down!  And welcome.<br/>\n<br/>\n    When I joined this list a month or two ago I thought I was really driven <br/>\nto be doing it so soon.  My boys won&#39;t even be three until June!  But I&#39;ve <br/>\nalways wanted to unschool and I love to learn things and think the next <br/>\nfifteen years learning with and from them is the way I&#39;d be happiest.  DH at <br/>\nthis point doesn&#39;t have a concept but I&#39;m making him a file of posts to help <br/>\nhim out!!!<br/>\n    I&#39;m so pleased I joined this list that I just sent in my membership check <br/>\nof $25 to the local homeschool support group.  Even if I just read their <br/>\nnewsletter, it will be local info and good to share with DH.<br/>\n<br/>\n    Thanks in advance for anyone who responds to this cry for info.<br/>\n<br/>\nGeorganne, proud mom to Julian, Cristiano and George</div>","specialLinks":[]}],"prevTopicId":18574,"nextTopicId":18458}}