{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re-thinking shielding children from knowledge sexual or otherwise","postDate":"1311459659","msgId":61977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUENTNkFYMTRpQWJEekR6VTREbnMzNTk4VUZvdEY0YXJwMmZPUlhQQlplVms5c1k4QUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":61976,"nextInTime":61978,"topicId":61977,"numMessagesInTopic":0,"msgSnippet":"Knowledge is power--its an adage I firmly believe. It occurs to me that parents worry about appropriateness they often want to protect their child s ","messageBody":"<div id=\"ygrps-yiv-410107195\">Knowledge is power--its an adage I firmly believe. It occurs to me that<br/>\nparents worry about appropriateness they often want to protect their child&#39;s<br/>\n&quot;innocence&quot; about sexual humour or &quot;real life&quot;.   I remember as a child<br/>\nreading and watching &quot;inappropriate things&quot;.  I would watch inappropriately<br/>\nsexual movies or violent movies on television late at night as my parents<br/>\nslept.  I watched Love American Style when I was young.  So, as an eleven<br/>\nyear old girl I knew how to avoid child molesters, knew that the creepy men<br/>\noffering car rides or conversation were not always safe.<br/>\n<br/>\nI also knew how to recognize safe situations and safe adults, too.  I<br/>\ndeveloped through tv and books deemed too old a safe way to experience the<br/>\nworld.  Everything contradicted everything else; so I learned to make<br/>\ndecisions and choices that seemed logical to me.<br/>\n<br/>\nMost fears protecting children from sexual &quot;knowledge&quot;  are misplaced.<br/>\n Judgement and knowledge are important skills we should all foster.  I think<br/>\nafter finding myself targeted by creepy men and one woman as a child under<br/>\nthe age of thirteen I was able to understand what was happening, but<br/>\nunfortunately couldn&#39;t tell the appropriate adults in a manner that would<br/>\nnot have them gasping in horror at my precocious and inappropriate<br/>\nknowledge.  How to explain why and how I understood this person&#39;s interest<br/>\nand keep myself safe were not possible in the world adults constructed for<br/>\ncute innocent little girls.<br/>\n<br/>\nI remember at a camping trip organized by the Catholic School I went to one<br/>\nof the employees was very interested in me.  He sat next to me and as he<br/>\nflattered me my guard was up.  The moment his hand touched my thigh and<br/>\ncreeped higher toward my groin, I knew to avoid him and without missing a<br/>\nbeat looked him in the eye and intercepted his hand as it reached my groin<br/>\nand moved it.  He felt safe enough doing this as other children and teachers<br/>\nat the school sat having dinner.  Ah, the long tablecloths. I changed seats<br/>\nand gave him a long glare. He started chatting with another girl on the<br/>\nother side of him. I had to play a very scary cat and mouse game.<br/>\n<br/>\nNeedless to say I did not enjoy the trip.  I couldn&#39;t tell my friends or the<br/>\nguardians responsible for my well-being about creepyman&#39;s creepy behaviour.<br/>\n I did feel very smug when I reached home that I had outsmarted the man who<br/>\nhad wanted to &quot;touch&quot; me.  I wasn&#39;t sure whether he would have raped me:  it<br/>\nscared me and angered me.  But I had a lot of bravado and indignation.<br/>\n Looking back I can&#39;t believe the situations I managed to get myself out of<br/>\nand back then my secret weapon was that they (the sexual predators) did not<br/>\nexpect me to &quot;recognize&quot; or contextualize their behaviour. I could also not<br/>\ntell my parents about the creepy situations because then I would have had to<br/>\nexplain the years of sneaking inappropriate books and watching inappropriate<br/>\nmovies.<br/>\n<br/>\nI remember one man at a family reunion asking one of the younger kids to get<br/>\nme to go into a dark bedroom where he was waiting on a water bed.  Years<br/>\nlater the younger cousin as a teen, who still remembered the incident after<br/>\nthe man who hadn&#39;t been a blood relative was divorced from his &quot;ticket&quot; into<br/>\nthe family, said he was really horrified by what could have happened to me.<br/>\n He realized with horror what the man&#39;s talk about how pretty I was meant<br/>\nand he could get over his part in trying to trick me into going upstairs to<br/>\nbe alone with this guy.  He said he couldn&#39;t believe what happened when he<br/>\nthought about it and I said it was fine, because  I had known as soon as I<br/>\nswung the door open not go in the room and what to say.  We marveled at the<br/>\nthings that had gone on under the noses of our parents.<br/>\n<br/>\nBut they knew more I discovered years later when my cousin&#39;s mother and I<br/>\ntalked.  I said one of the things that hurt me the most as a girl was when<br/>\nshe took a picture I had given her down.  She said she took the picture down<br/>\nafter a couple of grown men had made inappropriate comments about me as a<br/>\n thirteen year old, and she was worried about me starting to draw<br/>\ninappropriate attention.  I remember her face when I told her some of the<br/>\nstories had happened before I&#39;d even turned thirteen.<br/>\n<br/>\nI even had memorized Statutory Rape Law, and could spout it.  I&#39;d have to<br/>\nsay the line between scaring a child straight with discipline for her own<br/>\ngood and a child understanding humour or danger is blurred by most parents.<br/>\nHaving someone safe to talk to and having a safe space to encounter<br/>\nsituations is a good thing. Knowing &quot;sexual humour&quot; or understanding how to<br/>\njudge adult intentions was a positive factor for me.  Being able to tell<br/>\nadults around me about other adults being dangerous and the reasons why they<br/>\nwere would have probably saved other children from danger and possibly harm.<br/>\n<br/>\n<br/>\nAs I meet more and more adults who weren&#39;t lucky enough to recognize<br/>\npredators--good little girls who had their innocence and obedience create<br/>\nhavoc in their lives I wonder at the idea of sheltering children we have<br/>\ncreated.  In older days on farms children saw life, death and sex through<br/>\nthe life of animals.  We don&#39;t see the rooster and the hen mating, nor eat<br/>\nthe pig slaughtered in the yard--but life hasn&#39;t changed much.  Sheltering<br/>\nchildren from work or exploitation in factories is different from hiding<br/>\nlife from them.<br/>\n<br/>\nPerhaps this was the reason I got into so many arguments with other parents<br/>\nabout how I respected my children&#39;s personal boundaries and sovereignty.<br/>\n Protecting children with vague streetproofing drills is silly--though<br/>\npossibly better than nothing.  Scaring them is horrible.  Protecting them<br/>\nfrom the Family Guy, which spoofs the elderly pedophile in a safe space<br/>\nseems much better to introduce a topic.<br/>\n<br/>\nLife is out there in all its elements--laugh at it in a safe space, and ask<br/>\nand answer questions.  But I don&#39;t think its wise to go out of our way to<br/>\nshield children.  Its better to build relationships based on love and trust<br/>\nand see the world as partners.<br/>\n<br/>\nMarina<br/>\n<br/>\n-- <br/>\n&quot;Insomnia is almost an oasis in which those who have to think or suffer<br/>\ndarkly take refuge.&quot; --Colette--<br/>\nRent our cottage:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://davehoward.ca/cottage/\">http://davehoward.ca/cottage/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":61889,"nextTopicId":61852}}