{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"Home Education Magazine","from":"Home Education Magazine &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"We Stand for Homeschooling","postDate":"1054863092","msgId":72441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkxN2JiMDU5ZjY4MjQwNEBbMTIuMTEwLjc0LjMzXT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":72440,"nextInTime":72442,"topicId":72441,"numMessagesInTopic":0,"msgSnippet":"Dear Fellow Homeschoolers, Long-time readers of Home Education Magazine know we ve addressed the issue of charter, cyber, e-schools and related programs for","messageBody":"<div id=\"ygrps-yiv-1740809142\">Dear Fellow Homeschoolers,<br/>\n<br/>\nLong-time readers of Home Education Magazine know we&#39;ve addressed the <br/>\nissue of charter, cyber, e-schools and related programs for several <br/>\nyears now, highlighting the pros and cons of these programs, <br/>\nexplaining the dangers we see and offering potential solutions. As <br/>\nthese programs have grown and proliferated in state after state we&#39;ve <br/>\ncome to feel they are perhaps the single most important issue <br/>\naffecting the future of homeschooling.<br/>\n<br/>\nIf the lines between homeschooling and public school become too <br/>\nblurred, or are even erased, how then will future generations view <br/>\nthis moment in time? Our fervent hope is that we won&#39;t be remembered <br/>\nas those who clumsily dropped the ball and let the promising <br/>\npotential of homeschooling in freedom and independence be lost.<br/>\n<br/>\nUnderstanding the dynamics involved is critical to ensuring that <br/>\nhomeschoolers are not eventually drawn back into the public and <br/>\nprivate school systems. Among those working the hardest to bring <br/>\nclarification and understanding to this issue is a group known as &quot;We <br/>\nStand for Homeschooling,&quot; whose website can be found at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.westandforhomeschooling.org\">http://www.westandforhomeschooling.org</a><br/>\n<br/>\nThe publishers of Home Education Magazine have chosen to sign the &quot;We <br/>\nStand for Homeschooling&quot; Statement and Resolution, and are <br/>\ndistributing the announcement below. We encourage you to stand with <br/>\nus as an individual homeschooler, and to share the &quot;We Stand for <br/>\nHomeschooling&quot; Statement and Resolution with your support group or <br/>\norganization through your newsletter, web site, group discussion <br/>\nlist, park days, meetings and other avenues of information. We hope <br/>\nyour group will join the many groups and organizations already <br/>\nsupporting this effort to stand together for homeschooling.<br/>\n<br/>\nSincerely,<br/>\nMark and Helen Hegener<br/>\nHome Education Magazine<br/>\n<br/>\n*******************<br/>\n<br/>\nFOR IMMEDIATE RELEASE<br/>\n<br/>\nYour support needed to make strong stand for homeschooling<br/>\n<br/>\nJune 5, 2003 - Please join many homeschoolers and their allies who <br/>\nare publicly taking a stand for homeschooling. Why is this necessary? <br/>\nBecause homeschooling freedoms are being threatened by the increase <br/>\nin both corporately-owned cyber charter schools and the creation of <br/>\nschool district-sponsored programs directed at homeschoolers. Both <br/>\nare designed to bring homeschoolers under the control of public <br/>\nschools.<br/>\n<br/>\nMost homeschoolers understand the difference between enrollment in <br/>\ntaxpayer funded schools and homeschooling, which requires neither <br/>\nenrollment nor taxpayer funding. With the We Stand for Homeschooling <br/>\n(WSFH) Statement and Resolution, homeschoolers and their allies can <br/>\nstand together to clearly identify these important distinctions.<br/>\n<br/>\nThe WSFH Statement and Resolution distinguishes between homeschoolers <br/>\nand those who would make a profit from publicly funded, home-based <br/>\neducation. Citing a variety of media reports, the Statement clearly <br/>\nshows why it is important to take this stand for homeschooling.<br/>\n<br/>\nNo one can or should claim to define homeschooling, and the authors <br/>\nof WSFH were careful not to do so. However, it is not difficult to <br/>\nidentify what homeschooling is not. Because cyber charter schools <br/>\nwork hard to be so visible and so public, they could easily become <br/>\nthe standard of identity that the general public and legislators <br/>\nexpect when they think of homeschooling. &quot;Blending&quot; homeschooling <br/>\nwith public schools risks the same outcome.<br/>\n<br/>\nThe WSFH Statement and Resolution was authored by an ad hoc <br/>\ncommittee. Joining the committee are many original signers from <br/>\ndiverse political, philosophical, religious, and activist <br/>\nperspectives. All are standing together to preserve homeschooling and <br/>\nthe opportunity for the many families who want to choose <br/>\nhomeschooling, free from the government regulation and other <br/>\nrequirements that come with taxpayer funding. You are encouraged to <br/>\nvisit <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.westandforhomeschooling.org\">http://www.westandforhomeschooling.org</a> to view the WSFH <br/>\nStatement and Resolution and to add your name to those standing for <br/>\nhomeschooling.<br/>\n<br/>\n###</div>","specialLinks":[]}],"prevTopicId":72415,"nextTopicId":72453}}