{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Digest Number 4413","postDate":"1074528991","msgId":89385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTE5LjA4MTY0Ny4xNzMxLjE1MDE5OTlAd2VibWFpbDA2Lm55Yy51bnRkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":89384,"nextInTime":89386,"topicId":89385,"numMessagesInTopic":0,"msgSnippet":"What I m seeing in your interactions is Sarah trying to do something to help and what you want is conscripted labor. I agree. My first thought was that Sarah","messageBody":"<div id=\"ygrps-yiv-1506529335\">&quot;What I&#39;m seeing in your interactions is Sarah trying to do something to help<br/>\nand what you want is conscripted labor.&quot;<br/>\n<br/>\nI agree. My first thought was that Sarah didn&#39;t choose to have more children and the busyness that goes with it, she isn&#39;t automatically responsible for her siblings just because her Dad is gone. <br/>\nThat doesn&#39;t mean she won&#39;t help or you shouldn&#39;t ASK for help, it just means that all the pressure for assistance shouldn&#39;t fall on her just because you and dh chose more children and he chose a job in which he&#39;d be gone for periods of time. None of that is her choice.<br/>\n<br/>\nMy second thought was about a show we watched last night. It&#39;s called K-9 to 5, about working dogs. One of the trainers was talking about a specific breed and how you never, ever tell the dog it didn&#39;t do something good. Even if the dog does not perform the way they&#39;d like, they praise it and keep working with that dog. She said if you get upset with them for anything, it shuts them down and they&#39;ll quit working for you.<br/>\nKinda like humans.:)<br/>\nNow praise can be unhealthy too. But a sincere &quot;thank you, I really appreciated your help&quot; is always a good idea.<br/>\nYour dd WAS helping, in her way. That should be appreciated. Each child helps in the way they can, or the way they enjoy participating. And we can slowly make recommendations about more efficient ways to help, but only if we&#39;re truly appreciating the things they DO first. I know my oldest is still quite resistant about how much help he gives, because he didn&#39;t get much appreciation for doing things his way several years ago.<br/>\nIt&#39;s tough to make a switch to gentle parenting when you&#39;ve not been that way. The kids are going to re-learn behaviors, because they&#39;re used to the old way. It takes time, but it does make for a MUCH happier, healthier household.<br/>\nSo hang in there. Respect her the way you would dh. If your dh had been carrying the baby and you&#39;d recommended the bottle, would you have treated him the same way? Probably not.<br/>\nI have one other recommendation...a SLING!!<br/>\nThe sling puts the baby right up against your body where they feel comforted and safe (and they could be breastfeeding or drinking their bottle) while your hands are free to help another child.<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\n&quot;I never teach my pupils; I only attempt to provide the conditions in which they can learn.&quot;<br/>\nAlbert Einstein</div>","specialLinks":[]}],"prevTopicId":89337,"nextTopicId":89371}}