{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Defend Your Dollar","from":"&quot;Defend Your Dollar&quot; &lt;dyd@...&gt;","replyTo":"LIST","senderId":"G_et7QTo7PPrY_L5dmU8pkK3it6RMK9wKGGqA31NnNnaHuV3aRSHBMF-1EsOjNdJ0DYk0HyTw6X2TBt1NkUl1bTCdHD5iwcic3T8hvm2","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Homeschooling with an Active Toddler","postDate":"992398741","msgId":22605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzNDIwMWMwZjNhZiQzNzM0YWZjMCQ5ZjZjZTJkMUBsb29rLmNhPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":22604,"nextInTime":22606,"topicId":22605,"numMessagesInTopic":0,"msgSnippet":"Last week I asked a number of homeschooling lists for suggestions on how to homeschool my older children with my little firecracker around and I received lots","messageBody":"<div id=\"ygrps-yiv-2117123222\">Last week I asked a number of homeschooling lists for suggestions on how to homeschool my older children with my little firecracker around and I received lots of great suggestions that I plan to implement.  I promised many that I would compile the suggestions and submit them to the group so here goes.  I hope you find them helpful.  This is my way of saying thank you to all those that helped my by offering their suggestions.<br/>\n* Try to plan your intensive learning (for example when you introduce a new topic) during nap time or make arrangements with another family to care for your child in exchange for a break for them another day. <br/>\n<br/>\n*Have your older children practice their reading skills with their younger children.  This may give you a few minutes to mark work, plan lessons, organize papers etc. <br/>\n<br/>\n*Remember that homeschooling does allow flexibility.  Learning can occur on weekends and weeknights when Dad is home if you take advantage of the opportunity.  Learning can occur over a period of short intervals so 15 minutes on, 15 minutes off isn&#39;t necessarily a bad thing.  Think of it as though you are allowing your oldest time to absorb the new knowledge rather than interrupting his learning.  Many special needs children will respond to this routine of teaching better as opposed to longer stretches.<br/>\n<br/>\n *Plan learning activities that can be done orally. (Anyone have suggestions?) The only oral learning game that we use is Test Your Knowledge where the children sit on the stairs and I rhyme off questions applicable to the skills that I am presently teaching.  Each correct answer earns a move down a stair and the game is over when the first child reaches the bottom. (Although they always want to play again)<br/>\n<br/>\n *Put away some special toys in case of emergency.  If your toddler is becoming a handful a new toy or a toy he/she hasn&#39;t seen in a while may be just the ticket.  Some ideas include: Play-Doh, Bubbles, stickers to stick on paper, blocks, large Crayola crayons, a large cardboard box etc.<br/>\n<br/>\n*Rotate your toys often so old ones seem new and don&#39;t overwhelm your child with too many toys either so they can focus on one activity at a time. <br/>\n<br/>\n *On a day that you plan on mopping the kitchen floor, allow your toddler to engage in some water play.  Fill a basin with some water, bubbles, plastic toys and cups and let him splash until his heart is content.<br/>\n<br/>\n *In the summer, plan lessons that can be done outdoors so your youngest can entertain himself in a sandbox, with sidewalk chalk, playing independently but well-supervised in the park etc.  Although I had to keep my eyes on my youngest at all times, yesterday we accomplished quite a bit while he played bubbles and splashed in the children&#39;s pool in our backyard.  <br/>\n<br/>\n *I don&#39;t really like cleaning up big messes (who does) but some moms suggested allowing the youngster to finger paint.<br/>\n<br/>\n *Other toys and activities you could share with your toddler include a magna doodle, dry erase boards, pots and pans or plastic bowls if you need peace and quiet.  <br/>\n<br/>\n *Toddlers love to sing so try include singing and dancing into your curriculum.  If it&#39;s not possible then sing when tidying up etc.  Let them help as much as possible with little things like pasting pictures, stirring food, putting things away etc.  They love to be included and should be whenever the activity allows.<br/>\n<br/>\n *Plan a lesson during your toddler&#39;s snack time.  If your little one will sit long enough, give them some cheerios, frozen mixed vegetables anything that requires a hand to mouth skill.  I know, they should be using a spoon but if he/she prefers fingers these snacks might give you a few minutes to complete your teaching activity.<br/>\n<br/>\n If all else fails a Teletubbies video should do the trick.:-)<br/>\n<br/>\n Here&#39;s some links I found on how to entertain your toddler:<br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.childfun.com/baby/toddler.shtml\">http://www.childfun.com/baby/toddler.shtml</a>  Article with tips<br/>\n<br/>\nActivities and Crafts for children ages 2-4 from About.com<br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://babyparenting.about.com/parenting/babyparenting/msubtdlr2.htm\">http://babyparenting.about.com/parenting/babyparenting/msubtdlr2.htm</a>  <br/>\n<br/>\n101 Activities To Do With Your Toddler- Great site!  Look around<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www-personal.engin.umich.edu/~ajdrake/toddler/list.htm\">http://www-personal.engin.umich.edu/~ajdrake/toddler/list.htm</a><br/>\n<br/>\nActivities for Babies, Toddler&#39;s, Preschoolers and Kindergarten Children<br/>\n<br/>\n(I put you on the toddler page)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scholastic.com/parentandchild/activity/toddler.htm\">http://www.scholastic.com/parentandchild/activity/toddler.htm</a> <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.icomm.ca/daycare/\">http://www.icomm.ca/daycare/</a>  More ideas plus lots of excellent links<br/>\n<br/>\nThis should get you started. please let me know how you&#39;re doing.  I&#39;d love to know what works for you so I can try it myself.<br/>\n<br/>\nAlso, membership to HS-For-Less is now open to all parents and homeschoolers.  I created the group last week and over 100 members joined.  I was overwhelmed so I restricted membership for a while.  I really wanted to take a moment to welcome each and every person but it was a difficult task when more new members kept coming.  Now that I&#39;m caught up, I think we can handle a few more<br/>\n<br/>\nCrystal<br/>\n<br/>\nHomeschooling On A Budget<br/>\n***********************************<br/>\n<br/>\nExchange time & money saving tips, low cost educational ideas, activities & resources<br/>\nwith homeschooling families interested in providing a quality education for less.<br/>\nSubscribe today! <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HS-For-Less-subscribe@yahoogroups.com\">HS-For-Less-subscribe@yahoogroups.com</a> <br/>\nLearn more about us at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/HS-For-Less\">http://groups.yahoo.com/group/HS-For-Less</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22588,"nextTopicId":22599}}