{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":112,"messages":[{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215381030","msgId":36216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwNTMyOEY2LTEzMTUtNDdCMi1BNzFDLUUxNUE4MkM1RUY0M0BtYWMuY29tPg==","inReplyToHeader":"PDQ4NzEwRTk2LjUwMzAxMDhAZ21haWwuY29tPg==","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8Q0U5NEU3OUItRDk0QS00RjI1LThDNTItRDc4RjA3NjFCNEQyQHNhbmRyYWRvZGQuY29tPiA8NDg3MEU2QzcuNTA4MDUwOEBnbWFpbC5jb20+IDxGQUQzRkZDQi1BMzA4LTQ3NjUtOTE1My1CNDc2MjFEMEQyRUZAc2FuZHJhZG9kZC5jb20+IDw0ODcxMEU5Ni41MDMwMTA4QGdtYWlsLmNvbT4="},"prevInTopic":36215,"nextInTopic":36217,"prevInTime":36215,"nextInTime":36217,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... I think it can help a lot to ponder the difference between negligent and non-restrictive. We re NOT talking about negligence. So, when they start sounding","messageBody":"<div id=\"ygrps-yiv-961603602\">On Jul 6, 2008, at 11:27 AM, Robin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I&#39;m in a situation where the kids I am now raising have been in  <br/>\n&gt; less<br/>\n&gt; restricted environments and I feel in a way that they have never had a<br/>\n&gt; healthier option available as a choice. So part of de-schooling in our<br/>\n&gt; situation, I&#39;m thinking (perhaps wrongly, I admit), is figuring out  <br/>\n&gt; how<br/>\n&gt; to let them truly experience healthier options so they then actually<br/>\n&gt; have something to choose between.<br/>\n<br/>\n </span></blockquote>I think it can help a lot to ponder the difference between negligent  <br/>\nand non-restrictive.<br/>\n<br/>\nWe&#39;re NOT talking about negligence. So, when they start sounding the  <br/>\nsame to you, it means you&#39;re missing something important. I&#39;m  <br/>\nsuggesting that you look for that missing link - see if you can find,  <br/>\nin our posts, what makes what we&#39;re doing different than negligence.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215380602","msgId":36215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3OTdDRTZDLUNBNEYtNDFGNy1BRDI1LTQ2MUI2NUE5RDUyRkBtYWMuY29tPg==","inReplyToHeader":"PDQ4NzExMjVFLjEwMTAwMDBAZ21haWwuY29tPg==","referencesHeader":"PDk2OTI5Mi4zNDQzNC5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+IDw0ODcxMTI1RS4xMDEwMDAwQGdtYWlsLmNvbT4="},"prevInTopic":36214,"nextInTopic":36216,"prevInTime":36214,"nextInTime":36216,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... When we go grocery shopping, different kids will go with me, depending on what else is going on. Or, sometimes, I go alone. I always ask, Anybody have","messageBody":"<div id=\"ygrps-yiv-962289188\">On Jul 6, 2008, at 11:43 AM, Robin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I always have the kids pop in the firdge and they seldom drink it.  <br/>\n&gt;&gt; Last time MD had pop was when Simon and Linneae where here a month  <br/>\n&gt;&gt; ago.<br/>\n&gt;&gt; I still have some of the pop I bought them.<br/>\n&gt;<br/>\n&gt; Out of curiosity, what do your kids drink?<br/>\n<br/>\n </span></blockquote>When we go grocery shopping, different kids will go with me, depending  <br/>\non what else is going on. Or, sometimes, I go alone.<br/>\n<br/>\nI always ask, &quot;Anybody have anything they want at the store?&quot;<br/>\n<br/>\nThey almost always have something - yesterday Rosie asked me to check  <br/>\nwhether there were any good-looking avocados at decent prices. Roxana  <br/>\nwanted wheat bread (we had only sourdough bread in the house). They  <br/>\noften want me to get frozen foods like frozen macaroni and cheese. I  <br/>\ndon&#39;t think any of them have ever asked for a soda. Whenever we shop  <br/>\nat Target, though, we almost always buy a soda at the checkout - there  <br/>\nis something about that store that leaves us extremely thirsty by the  <br/>\ntime we&#39;re ready to leave - and they have really cold soda at the  <br/>\ncheck stands.<br/>\n<br/>\nMy kids drink lots of water - usually cold from the fridge. We drink  <br/>\nwater with meals - always have. We have some of those packets that you  <br/>\nadd to water to flavor them - every once in a while one of us will  <br/>\nhave one of those, but they mostly sit here for months and months.   <br/>\nThe kids drink soda sometimes, or lemonade, when we&#39;re eating out. I  <br/>\nusually have coffee and my dh usually has tea.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: bad role models","postDate":"1215379541","msgId":36214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc0cmQ4bCs5M2VoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4NzBFNkM3LjUwODA1MDhAZ21haWwuY29tPg=="},"prevInTopic":36212,"nextInTopic":36215,"prevInTime":36213,"nextInTime":36215,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... complete ... Parents don t have to have complete control over what a toddler eats. Parents ultimately do have that control because they are bigger and have","messageBody":"<div id=\"ygrps-yiv-407996754\"><blockquote><span title=\"ireply\">&gt; On the one hand, we do teach our kids what to eat (parents have<br/>\n </span></blockquote>complete<br/>\n<blockquote><span title=\"ireply\"> &gt; control over what a 2-year-old has access to or not). OTOH, I can see<br/>\n&gt; that too limited an offering of choices, especially with older kids,<br/>\n&gt; limits their ability to figure out how to make choices that work for<br/>\n&gt; them. This makes sense to me.<br/>\n<br/>\n<br/>\n </span></blockquote>Parents don&#39;t have to have complete control over what a toddler eats. <br/>\nParents ultimately do have that control because they are bigger and have<br/>\nthe money, but it doesn&#39;t have to be that way within a household or a<br/>\ngrocery store outing.  Plenty of 2 yr olds know exactly what they want<br/>\nto eat and don&#39;t hesitate to say so and the parents have the power to<br/>\nempower their 2 yr old.<br/>\n<br/>\nThis is exactly how unschooling unfolds when you start at the beginning.<br/>\nIf you are starting with older kids, the same principles apply.  Older<br/>\nkids often know exactly what they want to eat and parents have the power<br/>\nto empower them too.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But the kids hate it<br/>\n&gt; when I take all the &quot;fun&quot; foods out of the house, too.<br/>\n<br/>\n </span></blockquote>What do you consider fun foods?  All food can be fun.  Almost anything<br/>\ncan be prepared and presented in such a way as to be fun and pleasurable<br/>\nto eat.  By seperating a certain type of food as fun and others as not,<br/>\nyou are perpetuating the cycle that you are wishing to avoid in regards<br/>\nto food that you consider healthy and not so healthy.<br/>\n<br/>\nWhat I&#39;ve found is that there are healthier alternatives to almost<br/>\neverything.  My discovery was prompted by my allergies to food, but it&#39;s<br/>\nbeen a good one for my whole family.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d like us to eat more healthily together. I&#39;m a carb addict and its<br/>\n&gt; hard for me to not eat doughnuts, pasta, ice cream, etc. when everyone<br/>\n&gt; around me is. (There&#39;s spouse issues in here, too!) But I don&#39;t like<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; effect it has on my body!<br/>\n<br/>\n </span></blockquote>Just for the record, ice cream isn&#39;t a carb.  Doughnuts, pasta, and ice<br/>\ncream aren&#39;t necessarily &quot;bad&quot; for you foods either.  It&#39;s more about<br/>\nlistening to your body and eating with balance and moderating your own<br/>\npersonal intake of food.  If you don&#39;t like the way food effects your<br/>\nbody, eat differently, or excercise, so that your body metabolizes<br/>\ndifferently (If you are refering to the effects of gaining weight, and<br/>\nnot the effects of other things, like digestive.).<br/>\n<br/>\nHow a person metabolizes food seems to be genetic.  A person can spend<br/>\nloads of energy and thought on how to eat and not gain weight, and still<br/>\ngain weight simply because that is how they are genetically.  Some<br/>\npeople can eat and eat and eat and not gain any weight.<br/>\n<br/>\nMy daughter (14) started gaining weight at around 11 and continued until<br/>\nrecently when she decided that she wanted to do something about it. <br/>\nI&#39;ve never ever told her she needed to do anything different with her<br/>\nbody.  I made note of the changes that she was experiencing physically,<br/>\nbut I&#39;ve always been more focused on her internal changes, how she<br/>\nfeels.  I figured if she was round and happy, then I was happy, if she<br/>\nwas thin and happy then I was happy.<br/>\n<br/>\nLarge bodies, don&#39;t necessarily mean unhappiness.  I see way too many<br/>\nrounder women focus their entire lives on trying not to be round, so<br/>\nmuch so, that the focus ceases to be about living and living happily,<br/>\nbut instead is about trying to be something they are not.  My daughter<br/>\nhas 2 sets of genetics within her, my family is thin, all of the women<br/>\nin my husband&#39;s family are large.  She is built like my inlaws.  There<br/>\nis absolutely nothing I can do about that.  She will have enormous<br/>\nbreasts and thin legs with a propensity to roundness in the belly.  She<br/>\ncan choose to live happily with that or she can spend the rest of her<br/>\nlife unhappily fighting it like her relatives.<br/>\n<br/>\nChamille can make any food choices that she wants.  She chooses to eat<br/>\nhealthy.  She sees her relatives, their weight issues and diabetes<br/>\nissues.  She made a choice not to go down that road.  She spent months<br/>\non end hardly eating anything.  She was testing her own limits, her own<br/>\nbody, getting back to a clean slate to work with within herself.  The<br/>\nparents of her best friend accused her of being anorexic (which I&#39;m sure<br/>\nthey used it some argument with their daughter against her).  I will<br/>\nadmit that at first in concerned me.  I decided to let it go, because<br/>\nfor one, I trust her absolutely, and for two,  loads of people fast for<br/>\nlong periods of time and live to tell about it.<br/>\n<br/>\nThere is something innately spiritual about our connection with food and<br/>\nhow it keeps us alive.  I feel that my daughter has experienced this<br/>\ndeeply and because of this, is very careful and decisive about  her food<br/>\nchoices and what she puts into her body.<br/>\n<br/>\nI could have done a lot to damage that process.  The worst thing I<br/>\ncould&#39;ve done is to force her to eat, force her to eat things she didn&#39;t<br/>\nwant to in the name of &quot;good for you&quot;.  I could have shamed her into<br/>\nthinking that what she was doing was wrong or dangerous.  I silenced<br/>\nthose voices.  Afterall those with food disorders have all been known to<br/>\ncenter around control or the lack there of.  How awesome and empowering<br/>\nfor a teenager to be able to have absolute control over something so<br/>\nintimate as how to eat to live.<br/>\n<br/>\nOver the years, I have met many many people that have had eating<br/>\ndisorders, that still have issues with eating disorders.  It leaves a<br/>\nlasting scar over their lives.  Eating should be pleasant and enjoyable,<br/>\nafterall we have to eat in order to live.  Once tainted with a disorder,<br/>\nit ceases to be pleasant and can never ever be whole, truly whole. <br/>\nPeople can do a lot to get over eating disorders and eventually have a<br/>\nhealthier attitude about food, but those issues will always be there<br/>\ndeep inside, like a scar is forever on your skin to remind you.<br/>\n<br/>\nI don&#39;t want that for my kids ever!  Period!  My answer to avoid that is<br/>\nto allow my kids to know what they want and give it to them.  If a<br/>\ncertain food will make them feel good, then I will give it to them.  If<br/>\nat some point they decide that certain food doesn&#39;t make them feel good,<br/>\nI trust they will eliminate it from their choices.</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215378094","msgId":36212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5NzEyNC4yMzgxNS5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":36209,"nextInTopic":36214,"prevInTime":36211,"nextInTime":36213,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"Out of curiosity, what do your kids drink?     -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-   My kids like water. Period. A juice once in a great while. My oldest","messageBody":"<div id=\"ygrps-yiv-548112164\">Out of curiosity, what do your kids drink?<br/>\n <br/>\n <br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n <br/>\nMy kids like water. Period. A juice once in a great while. My oldest sometimes like milk with ovaltine or a chocolate milk shake.<br/>\nBut they really want to drink water.<br/>\nI have one of those water coolers with a big water jug like you see in offices and they just drink out of the little faucet.<br/>\n <br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nI know my kids do this, at least to some degree. But when we have <br/>\n&quot;carb-a-holic&quot; foods available they choose them over healthier options. <br/>\nWhat do you think you are doing (right?) that you think has resulted in <br/>\nyour kids making healthier food choices?<br/>\n <br/>\n <br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\nI don&#39;t limit. I make food available all the time and offer food every 2- 3 hours.<br/>\nI make &quot;Goodies Plates&quot; or some call &quot;Monkey Platter&quot;<br/>\nI offer those every 3-4 hour.<br/>\nI put in them( for example)<br/>\nfruit in pieces<br/>\ncrackers<br/>\ncheeses<br/>\ncelery<br/>\nbaby carrots<br/>\ngrape tomatoes,<br/>\ncereal<br/>\nchocolate chips<br/>\ndried fruit<br/>\ncookies<br/>\ndeli-meat<br/>\npieces of chicken<br/>\n lots of different snack easy stuff.<br/>\nThey can it as much or as little as they want and whatever they want<br/>\nI f I ask what they want for lunch and MD say ice-cream I give him ice-crea,, than I will  some other healthy stuff to eat and he will most likely have a go on it too, or not!<br/>\n <br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: bad role models","postDate":"1215372578","msgId":36209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NEM2Mjk0LUJGNEItNDk1Mi05MEZELTY4NEU0NkQ1NUI5Q0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGc0cjU5ZCt1dmZiQGVHcm91cHMuY29tPg==","referencesHeader":"PGc0cjU5ZCt1dmZiQGVHcm91cHMuY29tPg=="},"prevInTopic":36208,"nextInTopic":36212,"prevInTime":36208,"nextInTime":36210,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=- Out of curiosity, what do your kids drink? -=-I know the questions not for me and I have to get going but ......-=- Questions like this should be","messageBody":"<div id=\"ygrps-yiv-1780310408\">-=-&gt; Out of curiosity, what do your kids drink?<br/>\n<br/>\n-=-I know the questions not for me and I have to get going but ......-=-<br/>\n<br/>\nQuestions like this should be considered to be for anyone in the  <br/>\ndiscussion!<br/>\n<br/>\nHolly likes Izze sodas and Kern (?) fruit sodas.  So does Keith.  And  <br/>\nthey like grapefruit sodas (I forget the name).  Marty drinks Dr  <br/>\nPepper and root beer, but Marty and Holly and their friends go  <br/>\nthrough a lot of bottled water, even though we keep a drawer of sodas  <br/>\nin the fridge all the time (and more in the garage).<br/>\n<br/>\nIn the fridge we keep a pitcher of sweet tea (ends from pots of tea,  <br/>\nor sometimes made directly for iced tea purposes in the summer), and  <br/>\na Britta filter pitcher of cold water (in the summer).  We always   <br/>\nhave milk.  Sometimes I make milk shakes.<br/>\n<br/>\nKeith and I like lassi, a yogurt drink with milk, lemon, salt and  <br/>\ncumin.  I make it.  It&#39;s good on crazy-hot days.  The kids don&#39;t like  <br/>\nit.<br/>\n<br/>\nUntil kids have had all they want of something, they won&#39;t start  <br/>\nturning it down.  When kids have had choices their whole lives, it&#39;s  <br/>\neasy for them to know what &quot;all they want&quot; is--for my kids, that  <br/>\nhappened before they can remember.  They&#39;re not needy.  It&#39;s a huge  <br/>\ndifference.  It goes against &quot;common knowledge,&quot; but if common  <br/>\nknowledge were worth a damn, wouldn&#39;t this culture be a paradise of  <br/>\nmental health and joy, with empty prisons and long-lasting marriages?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: bad role models","postDate":"1215372062","msgId":36208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCNzc0QTIyLUQ2NDItNDZGNS04M0VDLUMwMzVFREZEQkE5NEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ4NzExNUI5LjgwMTA2MDZAZ21haWwuY29tPg==","referencesHeader":"PGc0cGJpNyt2Zmx0QGVHcm91cHMuY29tPiA8NDg3MTE1QjkuODAxMDYwNkBnbWFpbC5jb20+"},"prevInTopic":36207,"nextInTopic":36209,"prevInTime":36207,"nextInTime":36209,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=-If I stop being all ucky around food (up tight and negative all the time) and just enjoy, then they are more likely to be interested in even trying what I m","messageBody":"<div id=\"ygrps-yiv-503190484\">-=-If I stop being all ucky around food (up tight<br/>\nand negative all the time) and just enjoy, then they are more likely to<br/>\nbe interested in even trying what I&#39;m eating!-=-<br/>\n<br/>\nYes!  And even if they&#39;re not interested, you still have taken out  <br/>\nsome uck and negativity.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nThere are sound files at the bottom (thanks to the Stranahan family!)<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models: TV","postDate":"1215371964","msgId":36207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENDNzY1MEY5LTRCRUYtNENBOS05Qzk2LUIzQjJFNDc4MTExQ0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ4NzEwOEU1LjgwMTAxMDFAZ21haWwuY29tPg==","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8Q0U5NEU3OUItRDk0QS00RjI1LThDNTItRDc4RjA3NjFCNEQyQHNhbmRyYWRvZGQuY29tPiA8NDg3MEU2QzcuNTA4MDUwOEBnbWFpbC5jb20+IDxGQUQzRkZDQi1BMzA4LTQ3NjUtOTE1My1CNDc2MjFEMEQyRUZAc2FuZHJhZG9kZC5jb20+IDw0ODcxMDhFNS44MDEwMTAxQGdtYWlsLmNvbT4="},"prevInTopic":36206,"nextInTopic":36208,"prevInTime":36206,"nextInTime":36208,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=-I need some help finding balance with this one, too. TV was basically my father s drug of choice ... It s also my kid s mother s drug of choice -=- I","messageBody":"<div id=\"ygrps-yiv-968169840\">-=-I need some help finding<br/>\nbalance with this one, too.<br/>\n  TV was basically my father&#39;s &quot;drug of choice&quot;... It&#39;s also my kid&#39;s  <br/>\nmother&#39;s<br/>\n&quot;drug of choice&quot; -=-<br/>\n<br/>\nI don&#39;t think you want balance.  I think you want justification for  <br/>\ncontrols. If you insist on villifying TV, as a drug (with or without  <br/>\nquotation marks), you won&#39;t find balance.  You&#39;ll find fear and  <br/>\ncontrol, and you will broadcast fear and control.<br/>\n<br/>\n-=-how do I help find a healthier balance for the kids so they have  <br/>\nthe option to choose it if they want to?-=-<br/>\n<br/>\nYou&#39;re using words like &quot;balance&quot; and &quot;option&quot; and &quot;choose,&quot; but you  <br/>\nseem to be missing what people are sharing with you about REAL  <br/>\nbalance and options and choices.<br/>\n<br/>\n-=-So, ok, were moving to a new community (at least that&#39;s the plan!)  <br/>\nwhere we will hopefully find more appropriate playmates for all the  <br/>\nkids,-=-<br/>\n<br/>\n#1, Rocky Horror is not &quot;X rated&quot;<br/>\n<br/>\n#2, My kids watched it, but they never acted it out.<br/>\n<br/>\nSo why are you blaming the playmates?  Children need advice on how to  <br/>\nbehave with other children, but you&#39;re talking to us about school,  <br/>\nand religious groups, and that&#39;s not what unschooling is about.<br/>\n<br/>\n<br/>\n<br/>\n-=-Providing X-rated movies for the pre-pubescent is one extreme that  <br/>\nI assume everyone would agree isn&#39;t a good idea-=-<br/>\n<br/>\nIn this discussion, that&#39;s your &quot;whiskey for two-year-olds&quot; example,  <br/>\nthen.  No one here needs to agree what&#39;s a good idea or not.  You can  <br/>\ntake in ideas and make your own decisions without looking for a  <br/>\nconsensus on this list (or anywhere).<br/>\n<br/>\n-=-How do I find a happy medium where I am not stifling their ability  <br/>\nto choose but I&#39;m not doing injury to their developing selves either?  <br/>\n(and I&#39;m not even talking about the horror movies they were forced to  <br/>\nwatch as toddlers!)-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help\">http://sandradodd.com/help</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/movies\">http://sandradodd.com/movies</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\n<br/>\n<br/>\nPlease read there.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215371521","msgId":36206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyRTUwQ0FFLTI5REEtNDgyQS04RkU5LTM2MjgyOTJFQjBDQkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ4NzEwRTk2LjUwMzAxMDhAZ21haWwuY29tPg==","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8Q0U5NEU3OUItRDk0QS00RjI1LThDNTItRDc4RjA3NjFCNEQyQHNhbmRyYWRvZGQuY29tPiA8NDg3MEU2QzcuNTA4MDUwOEBnbWFpbC5jb20+IDxGQUQzRkZDQi1BMzA4LTQ3NjUtOTE1My1CNDc2MjFEMEQyRUZAc2FuZHJhZG9kZC5jb20+IDw0ODcxMEU5Ni41MDMwMTA4QGdtYWlsLmNvbT4="},"prevInTopic":36205,"nextInTopic":36207,"prevInTime":36205,"nextInTime":36207,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=-wasn t saying we should over control what a 2-year-old eats but I also don t think anyone would agree that 2-year-olds need to experience the choice of","messageBody":"<div id=\"ygrps-yiv-1053311044\">-=-wasn&#39;t saying we should over control what a 2-year-old eats but I  <br/>\nalso<br/>\ndon&#39;t think anyone would agree that 2-year-olds need to experience the<br/>\nchoice of whiskey or they wont be able to handle it later.-=-<br/>\n<br/>\nYou seem to be wanting to call upon the list to agree with you, or to  <br/>\nstate things in such ways that you have the backing of a large group  <br/>\nof people.  &quot;I also don&#39;t think anyone would agree that ...&quot; and  <br/>\n&quot;...is one extreme that I assume everyone would agree isn&#39;t a good  <br/>\nidea.&quot;<br/>\n<br/>\nTry not to speak for others.  This is a VERY big list.  Let&#39;s talk  <br/>\nabout the ideas themselves, from the point of view of what leads to  <br/>\nlearning and peace, not about what most people do.  Most people send  <br/>\ntheir kids to school, punish them, ground them, deprive and limit  <br/>\nthem.   The list isn&#39;t about what most people do.<br/>\n<br/>\nDrop discussion of extremes like whiskey.  It&#39;s a waste of energy and  <br/>\ntime.  If you&#39;re lucky, your posts will be read by hundreds of  <br/>\npeople.  Make them worth reading.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":137349367,"authorName":"cathyandgarth","from":"&quot;cathyandgarth&quot; &lt;familialewis@...&gt;","profile":"cathyandgarth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: bad role models","postDate":"1215371373","msgId":36205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc0cjU5ZCt1dmZiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4NzExMjVFLjEwMTAwMDBAZ21haWwuY29tPg=="},"prevInTopic":36204,"nextInTopic":36206,"prevInTime":36204,"nextInTime":36206,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... it. Last time MD had pop was when Simon and Linneae where here a month ago. ... I know the questions not for me and I have to get going but ... We buy soda","messageBody":"<div id=\"ygrps-yiv-1332573686\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin &lt;GaiaAlive@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; I always have the kids pop in the firdge and they seldom drink <br/>\n </span></blockquote>it. Last time MD had pop was when Simon and Linneae where here a <br/>\nmonth ago.<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I still have some of the pop I bought them.<br/>\n&gt; <br/>\n&gt; Out of curiosity, what do your kids drink?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I know the questions not for me and I have to get going but ...<br/>\n<br/>\nWe buy soda for the kids when they ask for it -- I wish they sold the <br/>\nkind they like in those little half-size cans because I throw away a <br/>\nlot of half empty cans of soda.  We will also have soda around for <br/>\nmonths, because everyone had what they wanted and then lost <br/>\ninterest.  Mostly my kids prefer water.  They like milk, but go <br/>\nthrough phases.  It&#39;s summer so we had been making pink lemonade <br/>\n(from concentrate), but I just dumped half a pitcher that got moldy <br/>\nsitting in the fridge, so I guess we are out of the phase.  I have a <br/>\ncouple of cases of Caprisuns they wanted at the grocery store, I <br/>\nhaven&#39;t seen them drink much of them, but they have had a couple of <br/>\nfriends come over who have had several of them.  My kids love chai <br/>\nright now (Oregon brand) and will go through phases of drinking <br/>\nseveral glasses of that each day.  But mostly, at the end of each <br/>\nday, when I look at what they drank throughout the day, most of what <br/>\nthey drink is just plain old water.<br/>\n<br/>\nCathy</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: bad role models","postDate":"1215371226","msgId":36204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwNUZCMjE2LTJDRTctNDEzNC1BQzM2LTJEQzc0Qzc2RkY5MEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGc0cjRpais0MTQ5QGVHcm91cHMuY29tPg==","referencesHeader":"PGc0cjRpais0MTQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":36203,"nextInTopic":36205,"prevInTime":36203,"nextInTime":36205,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=-Since you are looking for and expecting this same phenomena in your kids you find evidence to support it and ignore evidence to the contrary. For example,","messageBody":"<div id=\"ygrps-yiv-628160234\">-=-Since you are looking for and expecting this same<br/>\nphenomena in your kids you find evidence to support it and ignore<br/>\nevidence to the contrary. For example, you say that your kids will<br/>\nchoose chips over fruit, like this is a bad thing, but do they really<br/>\ndo this every single time? -=-<br/>\n<br/>\nThis thought crossed my  mind too when I read what Robin wrote.<br/>\n<br/>\nAnyone who feels sure they know what their children will do, and who  <br/>\ntakes steps to prevent it in advance, should read this:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifilet\">http://sandradodd.com/ifilet</a><br/>\n<br/>\nRead LOTS of it.  Slowly.<br/>\n<br/>\nNone of those writers have actually *tried* the thing they&#39;re writing  <br/>\nabout.<br/>\n<br/>\nAt my house there are chips and fruit all the time.  I bought new  <br/>\nchips this morning because there&#39;s still some homemade guacamole, but  <br/>\nthe last chips went stale.  (We&#39;re not used to humidity here and it&#39;s  <br/>\nbeen humid.)  The chips went stale even though there was good  <br/>\nguacamole.  The kids don&#39;t gorge.  I offered Holly and her boyfriend  <br/>\nhomemade cheesecake last night.  They refused it politely.  They&#39;ve  <br/>\nhad some; it&#39;s good.  They&#39;re just not in the habit of rewarding  <br/>\nthemselves with food, and because food is readily available, there is  <br/>\nno desperation to eat it.<br/>\n<br/>\nWhat they had eaten earlier was tuna salad rolled up in lettuce  <br/>\nleaves.  One drank chocolate milk and the other drank tea (leftover  <br/>\nfrom hot tea, cold in the fridge).  There were sodas.<br/>\n<br/>\nYou could say &quot;yes but they&#39;re older&quot; but Holly is on her seventeenth  <br/>\nyear of being able to taste what she wants to taste and put it down  <br/>\nor spit it out if she doesn&#39;t like it.<br/>\n<br/>\nAt a fourth of July party, she ate corn on the cob.  I think that&#39;s  <br/>\nall she had, but she really had fun with it and finished it all and  <br/>\nput the cob in recycling.  There were sodas and chips and cake, but I  <br/>\ndidn&#39;t see  her getting those, though she could&#39;ve.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: bad role models","postDate":"1215370681","msgId":36203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NzExNUI5LjgwMTA2MDZAZ21haWwuY29tPg==","inReplyToHeader":"PGc0cGJpNyt2Zmx0QGVHcm91cHMuY29tPg==","referencesHeader":"PGc0cGJpNyt2Zmx0QGVHcm91cHMuY29tPg=="},"prevInTopic":36202,"nextInTopic":36204,"prevInTime":36202,"nextInTime":36204,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... LOL  ... This is what is really exciting me right now--support for freeing myself so that I can allow my kids to find freedom. I did not realize how ","messageBody":"<div id=\"ygrps-yiv-1178457580\">cathyandgarth wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin &lt;GaiaAlive@...&gt; wrote:<br/>\n&gt;&gt; Like, how do I trust my kids to eat a healthy diet when I don&#39;t <br/>\n&gt; myself!<br/>\n&gt; Hi Robin,<br/>\n&gt; When I read this sentence all I could hear was Shaggy&#39;s voice ... <br/>\n<br/>\n </span></blockquote>LOL<br/>\n<br/>\n&lt;snip&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that an important part of unschooling for me, so far, has <br/>\n&gt; been has been learning to give myself the freedom to trust _myself_ <br/>\n&gt; around issues like food, tv, and computer.  While I easily saw the <br/>\n&gt; advantage of letting go and really trusting my children, that process <br/>\n&gt; really served as a magnifying glass on my own personal/self trust <br/>\n&gt; issues.  It was and is such a great opportunity for me to continue my <br/>\n&gt; own growth and developement as a human being.  And, just as you can <br/>\n&gt; imagine how empowering it is for the kids in our lives to make free <br/>\n&gt; choices, imagine how empowering it will be for you to give up your <br/>\n&gt; judgements and critical views of your own diet?  <br/>\n<br/>\n </span></blockquote>This is what is really exciting me right now--support for freeing myself <br/>\nso that I can allow my kids to find freedom. I did not realize how <br/>\nempowering and supportive of spiritual growth Unschooling would be. This <br/>\ncompletely ties in with the Awakening I have been pursuing for myself <br/>\nspiritually. I had been wondering how to share that with the kids, and <br/>\nduh!, be open, authentic and present. I don&#39;t have to &quot;teach&quot; what I am <br/>\nfinding and learning. I just have to BE it. (piece of cake, right?)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; For me, a great weight lifted off my shoulders when I (sincerely and <br/>\n&gt; honestly) stopped critically judging eveything that I ate:  Oh, I ate <br/>\n&gt; healthy today, or I shouldn&#39;t have had that second bowl of icecream, <br/>\n&gt; or I wish I ate more green vegies they are so healthy.  I am not sure <br/>\n&gt; if I eat more or less *healthy* than I did before, but I feel great <br/>\n&gt; and I feel healthy and I really just enjoy my food.  I haven&#39;t done <br/>\n&gt; this *for* my kids, but in writing this down I can really see how <br/>\n&gt; shifting my interactions with and internal conversations about food <br/>\n&gt; is super positive for them.  (I found Byron Katie&#39;s The Work <br/>\n&gt; thework.com incredibly helpful in jumpstarting and solidifying this <br/>\n&gt; process.) <br/>\n&gt;  <br/>\n&gt; Cathy <br/>\n<br/>\n </span></blockquote>This makes sense to me. If I stop being all ucky around food (up tight <br/>\nand negative all the time) and just enjoy, then they are more likely to <br/>\nbe interested in even trying what I&#39;m eating!<br/>\n<br/>\nI&#39;ll check the site out. Thanks!<br/>\nRobin</div>","specialLinks":[]},{"userId":137349367,"authorName":"cathyandgarth","from":"&quot;cathyandgarth&quot; &lt;familialewis@...&gt;","profile":"cathyandgarth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: bad role models","postDate":"1215370643","msgId":36201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc0cjRpais0MTQ5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPg=="},"prevInTopic":36200,"nextInTopic":36202,"prevInTime":36200,"nextInTime":36202,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... maybe some pastry and candy thrown in for good measure ... options ... house. Hi Robin, I just wanted to pull out a few of the things that you have written","messageBody":"<div id=\"ygrps-yiv-1232150684\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin &lt;GaiaAlive@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; a healthy diet when I don&#39;t myself!<br/>\n <br/>\n&gt; is becoming pudgy--like everyone in his family <br/>\n<br/>\n&gt; I am concerned about diabetes.<br/>\n <br/>\n&gt; We switched to juice instead of drinks with added sugar. <br/>\n<br/>\n&gt; if he ever experienced a diet full of less processed meat, <br/>\n&gt; vegetables and fruits that had real flavor (good, fresh, flavorful, <br/>\n&gt; fruits and vegetables and meats).<br/>\n<br/>\n&gt; the &quot;fun&quot; foods<br/>\n<br/>\n&gt; I&#39;m a carb addict<br/>\n<br/>\n&gt; This seems horribly unhealthy <br/>\n<br/>\n&gt; The kids, of course, want to live off soda and chips, mainly, with<br/>\n </span></blockquote>maybe some pastry and candy thrown in for good measure <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; because the foods they have not been exposed to healthier<br/>\n </span></blockquote>options<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but they&#39;d choose chips over fruit if we had the chips in the<br/>\n </span></blockquote>house.<br/>\n<br/>\n<br/>\nHi Robin,<br/>\n<br/>\nI just wanted to pull out a few of the things that you have written <br/>\nand let you look at them *out of context*.  You seem to be coming <br/>\nfrom a place of a lot of judgement and fear.  You have a very <br/>\nspecific idea of what healthy food is and judge all foods based on <br/>\nthis opinion.  You seem to have a very specific concept of what a <br/>\nhealthy body looks like, and based on this, judge your step-son&#39;s and <br/>\neveryone else in families&#39; food choices and activity levels.   <br/>\n<br/>\nThere is a lot of contradictory information and research about what <br/>\ndefines *healthy* foods and *healthy* bodies.  What is healthy for <br/>\none person may not be healthy for another.  Just because the media <br/>\nhas created a certain image of what a healthy body looks like, <br/>\ndoesn&#39;t mean it is the truth.  Sometimes &quot;pudgy&quot; can be way better <br/>\nfrom a health perspective than thin.  Adolescents often gain weight <br/>\nand sleep a lot, but it has nothing to do with their diet per se, but <br/>\na whole lot to do with hormones and growth.  <br/>\n<br/>\nAlso, it feels like that you assume that since you have certain &quot;hang-<br/>\nups&quot; about food your step kids must also have the same issues.  From <br/>\nwhat you have written it feels like you believe that you have to <br/>\neither totally control yourself or you totally lose control of <br/>\nyourself.  Since you are looking for and expecting this same <br/>\nphenomena in your kids you find evidence to support it and ignore <br/>\nevidence to the contrary.  For example, you say that your kids will <br/>\nchoose chips over fruit, like this is a bad thing, but do they really <br/>\ndo this every single time?  <br/>\n<br/>\nAlso, if they have been living with food controls, even if they are <br/>\nunspoken covert emotional controls (like, &quot;Oh, I can&#39;t eat donuts, <br/>\nthey are so unhealthy -- but you all can just enjoy them away from <br/>\nme.&quot;), they are really going to have to go through a period of <br/>\ndeschooling food.  When you first release controls and embrace trust, <br/>\nyou can pretty much trust that kids are going to test you and <br/>\nthemselves fully, for months, and you just have to keep smiling and <br/>\nnodding and loving them.<br/>\n<br/>\nMeredith, who writes on the AlwaysUnschooling list has written a lot <br/>\nabout her process of radical unschooling her stepson (whose mother <br/>\nhas very different parenting ideas) and his process of deschooling.  <br/>\nYou might find some great bits of wisdom reading through her blog.  I <br/>\nwould link the blog, but I can&#39;t find it ... maybe someone else can <br/>\nfind the adress of her blog, I thought I had it bookmarked and then I <br/>\nthought I could find it over at AU, but I am striking out and I&#39;ve <br/>\ngot to start packing for our camping trip.<br/>\n<br/>\nCathy</div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215369822","msgId":36199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NzExMjVFLjEwMTAwMDBAZ21haWwuY29tPg==","inReplyToHeader":"PDk2OTI5Mi4zNDQzNC5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDk2OTI5Mi4zNDQzNC5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":36197,"nextInTopic":36200,"prevInTime":36198,"nextInTime":36200,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"...  ... Out of curiosity, what do your kids drink? ... I know my kids do this, at least to some degree. But when we have carb-a-holic foods available","messageBody":"<div id=\"ygrps-yiv-1086538572\">BRIAN POLIKOWSKY wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Food limits.<br/>\n&gt;  <br/>\n </span></blockquote>&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I always have the kids pop in the firdge and they seldom drink it. Last time MD had pop was when Simon and Linneae where here a month ago.<br/>\n&gt; I still have some of the pop I bought them.<br/>\n<br/>\n </span></blockquote>Out of curiosity, what do your kids drink?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; These kids even remember whatever stuff I had months ago and ask for it. They really do gorge on it like its their last meal.<br/>\n&gt; She thinks she is &quot;teaching&quot; them to eat sensible and health and all they are learning is that they need to stuff in as much prohibit or limited food they can while they can  because they don&#39;t know when they will be able to have some more of that. She is making those foods more appealing than the &quot;allowed&quot; ones. She does not see that. Her fears that they will be overweight and unhealthily prevent her from seeing it.<br/>\n&gt; She and her DH are overweight and I think they are afraid their kids will be too.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I know my kids do this, at least to some degree. But when we have <br/>\n&quot;carb-a-holic&quot; foods available they choose them over healthier options. <br/>\nWhat do you think you are doing (right?) that you think has resulted in <br/>\nyour kids making healthier food choices?<br/>\n<br/>\nNeighbor kids had no food restrictions and constantly ate snack foods <br/>\nand candy. The 11 year old is slightly pudgy and frequently mentions how <br/>\noften she throws up (like, &quot;I wont drink apple juice because I once <br/>\ndrank so much I threw up&quot;).<br/>\n<br/>\nMaybe the question is how do I present healthy choices and make them <br/>\nappealing so they have a fighting chance? I especially have trouble with <br/>\nvegetables and protein foods.<br/>\n<br/>\nRobin</div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215368854","msgId":36200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NzEwRTk2LjUwMzAxMDhAZ21haWwuY29tPg==","inReplyToHeader":"PEZBRDNGRkNCLUEzMDgtNDc2NS05MTUzLUI0NzYyMUQwRDJFRkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8Q0U5NEU3OUItRDk0QS00RjI1LThDNTItRDc4RjA3NjFCNEQyQHNhbmRyYWRvZGQuY29tPiA8NDg3MEU2QzcuNTA4MDUwOEBnbWFpbC5jb20+IDxGQUQzRkZDQi1BMzA4LTQ3NjUtOTE1My1CNDc2MjFEMEQyRUZAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":36199,"nextInTopic":36201,"prevInTime":36199,"nextInTime":36201,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"Sandra Dodd wrote:  ... No, no! I don t see only two choices :) I m just trying to understand the continuum (the gray in between)","messageBody":"<div id=\"ygrps-yiv-1573564392\">Sandra Dodd wrote:<br/>\n&lt;rearranged from the bottom&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-I don&#39;t think anyone hands whiskey to a 2-year-old! -=-<br/>\n&gt; <br/>\n&gt; If you see only two choices (full control or giving them shots of  <br/>\n&gt; whiskey), your world is too small.<br/>\n<br/>\n </span></blockquote>No, no! I don&#39;t see only two choices :)<br/>\n<br/>\nI&#39;m just trying to understand the continuum (the gray in between) and <br/>\nfind the right balance for the complex situation we&#39;re in (partly <br/>\nbecause of my unhealed food issues, but also because of other factors).<br/>\n<br/>\nI wasn&#39;t saying we should over control what a 2-year-old eats but I also <br/>\ndon&#39;t think anyone would agree that 2-year-olds need to experience the <br/>\nchoice of whiskey or they wont be able to handle it later.<br/>\n<br/>\nI have seen my friend&#39;s 2 and 3 year old being given the choice of soda, <br/>\ncandy and whatever he wants, and he never eats meals with the family and <br/>\nactually steals candy on the rare occasions he is told &quot;no&quot;.<br/>\n<br/>\n&lt;back to the beginning of post&gt;<br/>\n<blockquote><span title=\"ireply\">  &gt; -=-I&#39;m pretty sure I have made sure (mea culpa!) I so hear my mom in my<br/>\n &gt; side of this discussion...Talk about food hang-ups!-=-<br/>\n &gt;<br/>\n &gt; Here&#39;s a tool for you.  We just made a list lately of ways to screw<br/>\n &gt; up unschooling.<br/>\n &gt;<br/>\n &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/screwitup\">http://sandradodd.com/screwitup</a><br/>\n<br/>\n </span></blockquote>I think that&#39;s what started this question for me. Reading the posts <br/>\nabout what&#39;s on the list mostly made sense to me, but they also included <br/>\nitems that implied to me that NO restrictions or limitations should be <br/>\nplaced on either food or TV. Those were the only two on the list that <br/>\nstuck for me. I think because I have a family history of what seems to <br/>\nme like addictive behavior around both.<br/>\n<br/>\nI&#39;ve started a new topic to talk about TV so as not to get to complex here.<br/>\n<br/>\nI know that I place WAY too many restrictions and I am learning some <br/>\ngood suggestions for how I can relax more and trust more. I&#39;d say I&#39;m <br/>\nlooking for help in the De-Schooling phase, I guess. And I see my <br/>\ncomfort level with freedom as a good chunk of what I&#39;m working on, I <br/>\nhear that and want to do my best.<br/>\n<br/>\nBut I&#39;m in a situation where the kids I am now raising have been in less <br/>\nrestricted environments and I feel in a way that they have never had a <br/>\nhealthier option available as a choice. So part of de-schooling in our <br/>\nsituation, I&#39;m thinking (perhaps wrongly, I admit), is figuring out how <br/>\nto let them truly experience healthier options so they then actually <br/>\nhave something to choose between.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n &gt;<br/>\n &gt; We could have made a list of ways to screw up a marriage, but we<br/>\n &gt; don&#39;t need to.  That list will work for many purposes.<br/>\n &gt;<br/>\n &gt; So maybe look at that link and imagine it a list of ways to give kids<br/>\n &gt; food issues.  Then you&#39;ll have a list in your head of what not to do!<br/>\n<br/>\n </span></blockquote>My concern is that they already have food issues, partly from me and <br/>\npartly from other family influences (not to mention that their mother is <br/>\nbulimic). How do I help both them and me heal (WITHOUT making them <br/>\nco-dependent!)<br/>\n<br/>\nFor example, the youngest was not quite 3 when I met the family. The <br/>\nmother rarely spoke to her except with extreme hostility in her voice <br/>\n(she was severely depressed at the time) but when the little girl cried <br/>\nshe was given sugar (soda or candy or the like). This mollified her and <br/>\nyears later (at 5 and 6) when upset the girl would say &quot;I just need <br/>\ncandy and I&#39;ll feel better&quot;. BTW when a toddler she would have a &quot;sugar <br/>\nreaction&quot; resulting in lots of energy which caused more hostile <br/>\nreactions...and the cycle continued (one night the mother gave the 3 <br/>\nyear-old an entire can of soda then tried to make her go to <br/>\nbed--threatening to beat her with a belt if she didn&#39;t &quot;lie down and got <br/>\nto sleep&quot;--my SO and I intervened, taking her into our room where she <br/>\nbounced on the bed with her eyes literly bugged out for a full 45 minutes!)<br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; Years ago, mid-70&#39;s, I was babysitting my all-natural niece, and we<br/>\n &gt; lost her.  She was in the garden, between thick rows, with an open<br/>\n &gt; sack of sugar, shovelling it in with both hands.  She was five or so.<br/>\n<br/>\n </span></blockquote>Where did she get the sugar from?<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n &gt; If a child is allowed to eat a sugar packet at a restaurant, or to<br/>\n &gt; play with (and maybe taste or eat) sugar cubes, or allowed to have<br/>\n &gt; more sugar on oatmeal or cereal if she wants it, instead of being<br/>\n &gt; told &quot;no&quot; or &quot;you have enough&quot; or &quot;sugar is bad,&quot; then I bet she will<br/>\n &gt; never, EVER squat in the field over a four lb. bag of sugar hoping to<br/>\n &gt; load up before she&#39;s caught.<br/>\n<br/>\n </span></blockquote>I&#39;d agree. But on the other hand, what about &quot;if your good, I&#39;ll give <br/>\nyou a candy bar&quot; or even presenting sugary foods as desirable treats? <br/>\nI&#39;m not sure I made up my own mind about candy--it was a &quot;prize&quot; and so <br/>\nI experienced it as such. If we actually freely tasted a lot of American <br/>\ncandy it&#39;s so sweet it almost hurts. I was given value judgments <br/>\n(positive ones) about sweets before I had the opportunity to form my own <br/>\nopinions. And, yeah, I&#39;m really mad at my mother for that (kidding!)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n &gt; -=-OTOH, I can see that too limited an offering of choices,<br/>\n &gt; especially with older kids, limits their ability to figure out how to<br/>\n &gt; make choices that work for them. This makes sense to me.-=-<br/>\n &gt;<br/>\n &gt; If they&#39;ve made choices since they were two, since they were babies,<br/>\n &gt; there is no &quot;especially with older kids&quot; time coming.<br/>\n<br/>\n </span></blockquote>I agree wholeheartedly! Next time around I am doing things sooo differently!<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;<br/>\n &gt; If babies can nurse or not when they want to, if they can reach for<br/>\n &gt; food or turn their head to refuse it, that&#39;s the start of their<br/>\n &gt; choicemaking and of parents&#39; trust.    It&#39;s no good to control or<br/>\n &gt; force or forbid and then at some point decide they&#39;re old enough to<br/>\n &gt; decide.<br/>\n<br/>\n </span></blockquote>I sure wish kids came with a practice round. I have learned so much <br/>\nabout myself and how not to do what I always planned not to do by <br/>\nlooking back over what I did do. Is there a &quot;do over&quot; button?<br/>\n<br/>\nAlso, I feel like I&#39;m just figuring out how to be really good with 4 and <br/>\n5 year olds and my youngest is turning 9 in two weeks! Yikes! I totally <br/>\nhear you when you talk about how urgent &quot;getting&quot; this stuff is. I <br/>\nblinked and my pre-schoolers are pubescent!<br/>\n<br/>\nThanks for giving me a place where I can talk about my doubts and <br/>\nstruggles to be better for my kids.<br/>\n<br/>\nRobin</div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models: TV","postDate":"1215367397","msgId":36202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NzEwOEU1LjgwMTAxMDFAZ21haWwuY29tPg==","inReplyToHeader":"PEZBRDNGRkNCLUEzMDgtNDc2NS05MTUzLUI0NzYyMUQwRDJFRkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8Q0U5NEU3OUItRDk0QS00RjI1LThDNTItRDc4RjA3NjFCNEQyQHNhbmRyYWRvZGQuY29tPiA8NDg3MEU2QzcuNTA4MDUwOEBnbWFpbC5jb20+IDxGQUQzRkZDQi1BMzA4LTQ3NjUtOTE1My1CNDc2MjFEMEQyRUZAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":36201,"nextInTopic":36203,"prevInTime":36201,"nextInTime":36203,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"So one of the items on the how to screw up list is something like place restrictions on the TV they watch . I need some help finding balance with this one,","messageBody":"<div id=\"ygrps-yiv-520250974\">So one of the items on the &quot;how to screw up&quot; list is something like <br/>\n&quot;place restrictions on the TV they watch&quot;. I need some help finding <br/>\nbalance with this one, too.<br/>\n<br/>\nTV was basically my father&#39;s &quot;drug of choice&quot; (when my mom cut off his <br/>\nmoney (that he was earning) so he could no longer drink heavily--how&#39;s <br/>\nTHAT for co-dependent! And he let her). It&#39;s also my kid&#39;s mother&#39;s <br/>\n&quot;drug of choice&quot; (it&#39;s pretty much all she does, she&#39;s on disability and <br/>\nsits at home watching TV more or less 24/7). So my concern is that <br/>\ndamage has been done, perhaps, and how do I help find a healthier <br/>\nbalance for the kids so they have the option to choose it if they want to?<br/>\n<br/>\nFor example, when I met the family the 4-year-old&#39;s favorite movie was <br/>\nthe &quot;Rocky Horror Picture Show&quot;. The 2-year-old liked it a lot, too. <br/>\nNow, I personally love that movie and think it&#39;s healing for those of us <br/>\nwith constrained and self-hating sexuality (and who in our culture isn&#39;t <br/>\nin some ways?). BUT this was in a context where none of the kids were <br/>\nbeing talked to about sexuality or bodies--they were seeing it on <br/>\nTV/videos but it was completely taboo to discuss it or help them in any <br/>\nway figure out about it. The idea was that kids aren&#39;t sexual at all and <br/>\nhave no feelings like that so it&#39;s harmless to show them adult sexuality.<br/>\n<br/>\nThen they were sent to school and to play with kids whose parents were <br/>\nreligious and they imitated what they saw in the movies and everyone <br/>\nfreaked out! The youngest is nearly shunned in the small town where we <br/>\nlived for years (and their Granny still lives so we visit often), I <br/>\nthink in part because parents think she&#39;s going to be (what they <br/>\nconsider for religious reasons) physically inappropriate with their <br/>\nkids. The kids in one family even started calling her the devil and <br/>\nrunning away whenever they saw her. So, ok, were moving to a new <br/>\ncommunity (at least that&#39;s the plan!) where we will hopefully find more <br/>\nappropriate playmates for all the kids, but I&#39;d like some help figuring <br/>\nout how best to help the kids grow into healthy adult sexuality and lives.<br/>\n<br/>\nProviding X-rated movies for the pre-pubescent is one extreme that I <br/>\nassume everyone would agree isn&#39;t a good idea (although it is becoming a <br/>\ngenuine question for the 13-year-old boy, or at least the idea of <br/>\nPlayboy is on the table). Never letting them see any hint of love or <br/>\nsexuality would be the other extreme, I guess. How do I find a happy <br/>\nmedium where I am not stifling their ability to choose but I&#39;m not doing <br/>\ninjury to their developing selves either? (and I&#39;m not even talking <br/>\nabout the horror movies they were forced to watch as toddlers!)<br/>\n<br/>\nSomewhere on the continuum are hip-hop and rap videos that emphasize <br/>\nwhat would have been considered soft-porn when I was a kid. It feels <br/>\ngood to watch them! But do they help either the boy or the girls develop <br/>\nself-esteem based on anything but external appearance and whether they <br/>\nare &quot;hot&quot; or not? I&#39;m not saying not ever letting them participate in <br/>\npopular media-driven culture, but how do I find balance and provide <br/>\ngenuine alternatives when what they have been exposed to feels so good?<br/>\n<br/>\nAny thoughts would be appreciated.<br/>\n<br/>\nRobin</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215365095","msgId":36197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1MDc1Ni4zMzIxLnFtQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":36196,"nextInTopic":36199,"prevInTime":36196,"nextInTime":36198,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"And just to add to my post. All her other kids( not the baby of course ) do the same even her 29 month old!   Alex Polikowsky ","messageBody":"<div id=\"ygrps-yiv-881293558\">And just to add to my post. All her other kids( not the baby of course&lt;G&gt;) do the same even her 29 month old!<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\nhttp://polykow.blogspot.com/<br/>\n <br/>\nhttp://groups.yahoo.com/group/unschoolingmn/<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;<br/>\nTo: AlwaysLearning@yahoogroups.com<br/>\nSent: Sunday, July 6, 2008 12:04:25 PM<br/>\nSubject: Re: [AlwaysLearning] bad role models<br/>\n<br/>\n<br/>\nFood limits.<br/>\n <br/>\nI have a friend that I have know since we were together at La Leche. Ours sons are the same age, 6 years old. She then has a girl and after that she has a boy same age as my dd Gigi that is 29 months old. She has also a little 8 week baby girl.<br/>\nShe is a homeschooler.<br/>\nWhen I met her I really like that she was so gentle and patient with her kids. Fast forward today she is still soft spoken but pretty controlling.<br/>\n(The difference is me and not the way she parents. I changed.)<br/>\nShe just controls them with a soft voice. She does not &quot;punish &quot; them or so she thinks she does not.<br/>\nSo anyway I was going to talk  about what limiting does.<br/>\nHer oldest is a husky guy. He is tall like MD ( my son) is but he is &quot;solid&quot;. Her pediatrician last year told her he needed to go on a diet.<br/>\nSo during the Summer he had his food totally controlled even more than she already did before.<br/>\nNeedles to say he comes to my house and will sneak as much food as he can. He will eat a box of oreos (when she is not looking) in minutes.<br/>\nHe will ask for pop every time he comes because she does not allow him to drink pop.<br/>\nI always have the kids pop in the firdge and they seldom drink it. Last time MD had pop was when Simon and Linneae where here a month ago.<br/>\nI still have some of the pop I bought them.<br/>\nThese kids even remember whatever stuff I had months ago and ask for it. They really do gorge on it like its their last meal.<br/>\nShe thinks she is &quot;teaching&quot; them to eat sensible and health and all they are learning is that they need to stuff in as much prohibit or limited food they can while they can  because they don&#39;t know when they will be able to have some more of that. She is making those foods more appealing than the &quot;allowed&quot; ones. She does not see that. Her fears that they will be overweight and unhealthily prevent her from seeing it.<br/>\nShe and her DH are overweight and I think they are afraid their kids will be too.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\nhttp://polykow. blogspot. com/<br/>\n <br/>\nhttp://groups. yahoo.com/ group/unschoolin gmn/<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215363865","msgId":36196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2OTI5Mi4zNDQzNC5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":36195,"nextInTopic":36197,"prevInTime":36195,"nextInTime":36197,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"Food limits.   I have a friend that I have know since we were together at La Leche. Ours sons are the same age, 6 years old. She then has a girl and after","messageBody":"<div id=\"ygrps-yiv-256823263\">Food limits.<br/>\n <br/>\nI have a friend that I have know since we were together at La Leche. Ours sons are the same age, 6 years old. She then has a girl and after that she has a boy same age as my dd Gigi that is 29 months old. She has also a little 8 week baby girl.<br/>\nShe is a homeschooler.<br/>\nWhen I met her I really like that she was so gentle and patient with her kids. Fast forward today she is still soft spoken but pretty controlling.<br/>\n(The difference is me and not the way she parents. I changed.)<br/>\nShe just controls them with a soft voice. She does not &quot;punish &quot; them or so she thinks she does not.<br/>\nSo anyway I was going to talk  about what limiting does.<br/>\nHer oldest is a husky guy. He is tall like MD ( my son) is but he is &quot;solid&quot;. Her pediatrician last year told her he needed to go on a diet.<br/>\nSo during the Summer he had his food totally controlled even more than she already did before.<br/>\nNeedles to say he comes to my house and will sneak as much food as he can. He will eat a box of oreos (when she is not looking) in minutes.<br/>\nHe will ask for pop every time he comes because she does not allow him to drink pop.<br/>\nI always have the kids pop in the firdge and they seldom drink it. Last time MD had pop was when Simon and Linneae where here a month ago.<br/>\nI still have some of the pop I bought them.<br/>\nThese kids even remember whatever stuff I had months ago and ask for it. They really do gorge on it like its their last meal.<br/>\nShe thinks she is &quot;teaching&quot; them to eat sensible and health and all they are learning is that they need to stuff in as much prohibit or limited food they can while they can  because they don&#39;t know when they will be able to have some more of that. She is making those foods more appealing than the &quot;allowed&quot; ones. She does not see that. Her fears that they will be overweight and unhealthily prevent her from seeing it.<br/>\nShe and her DH are overweight and I think they are afraid their kids will be too.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215362022","msgId":36195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0MzBBRThCLTlDRTMtNEQyQi1CQ0VGLUE2RkM5NUU3Q0NFNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ4NzBFODgyLjQwNDAxMDlAZ21haWwuY29tPg==","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8MjAwODA3MDUxOTMwLm02NUpVVmJ3MDMyNzM4QG9tcjEubmV0d29ya3NvbHV0aW9uc2VtYWlsLmNvbT4gPDQ4NzBFODgyLjQwNDAxMDlAZ21haWwuY29tPg=="},"prevInTopic":36194,"nextInTopic":36196,"prevInTime":36194,"nextInTime":36196,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=-I could also ask for their help in avoiding the foods I tend to binge on--it s hard for me to not eat them when other s are eating them around me. ... Maybe","messageBody":"<div id=\"ygrps-yiv-489764885\">-=-I could also ask for their help in avoiding the foods I tend to binge<br/>\non--it&#39;s hard for me to not eat them when other&#39;s are eating them around<br/>\nme. ... Maybe the kids would be willing to not eat doughnuts<br/>\nin front of me -=-<br/>\n<br/>\nDon&#39;t make the kids codependent on you.  That&#39;s no good at ALL.<br/>\n<br/>\nDon&#39;t make it their responsibility to keep you on your chosen diet.   <br/>\nThey&#39;re kids.<br/>\n<br/>\n-=-but they&#39;d choose chips over fruit if we had the chips in the  <br/>\nhouse.-=-<br/>\n<br/>\nUnless you keep chips and fruit both, they&#39;re unable to choose at all.<br/>\n<br/>\nIf chips and donuts are forbidden, they will want them, dream of  <br/>\nthem, seek them out, eat LOTS when you&#39;re not there.<br/>\n<br/>\nDon&#39;t set foods up with values that way.  Learn to choose in the  <br/>\nmoment.  It will be way easier for your kids if they start not, than  <br/>\nif they wait until they&#39;re as old as you are.<br/>\n<br/>\n-=-eating candy all day also works for hypoglycemics.-=-<br/>\n<br/>\n&quot;Works&quot; meaning what!?  Sorry--that doesn&#39;t even make sense.  If he&#39;s  <br/>\nlosing the ability to focus, or getting a headache, candy won&#39;t help  <br/>\na bit, but protein will.  When I was young I had audio distortions  <br/>\nfrom no protein (I was being a poor college student vegetarian in a  <br/>\nshared house of stoners), and boiled eggs and nuts were like miracle  <br/>\nfood.  Cheese was like spinach for Popeye.  When Kirby was little, he  <br/>\nwas having scary feelings and we figured out it was similar audio  <br/>\ndistortions.  Not hallucinations, not hearing things that weren&#39;t  <br/>\nthere, but hearing things in &quot;wrong&quot; ways (and sometimes seeing  <br/>\nthings in distotred ways, like from a high angle, which some people  <br/>\nlike to think of as an indication of out-of-body experience, but  <br/>\nprotein will fix that too. &lt;g&gt;<br/>\n<br/>\nTry more protein snacks.  It will probably help anyone, and will keep  <br/>\npeople from getting hungry enough to feel they &quot;need&quot; a bunch of  <br/>\nchips, too.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215361333","msgId":36191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBRDNGRkNCLUEzMDgtNDc2NS05MTUzLUI0NzYyMUQwRDJFRkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ4NzBFNkM3LjUwODA1MDhAZ21haWwuY29tPg==","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8Q0U5NEU3OUItRDk0QS00RjI1LThDNTItRDc4RjA3NjFCNEQyQHNhbmRyYWRvZGQuY29tPiA8NDg3MEU2QzcuNTA4MDUwOEBnbWFpbC5jb20+"},"prevInTopic":36189,"nextInTopic":36192,"prevInTime":36190,"nextInTime":36192,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=-I m pretty sure I have made sure (mea culpa!) I so hear my mom in my side of this discussion...Talk about food hang-ups!-=- Here s a tool for you.  We just","messageBody":"<div id=\"ygrps-yiv-1446123310\">-=-I&#39;m pretty sure I have made sure (mea culpa!) I so hear my mom in my<br/>\nside of this discussion...Talk about food hang-ups!-=-<br/>\n<br/>\n<br/>\n<br/>\nHere&#39;s a tool for you.  We just made a list lately of ways to screw  <br/>\nup unschooling.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/screwitup\">http://sandradodd.com/screwitup</a><br/>\n<br/>\n<br/>\n<br/>\nWe could have made a list of ways to screw up a marriage, but we  <br/>\ndon&#39;t need to.  That list will work for many purposes.<br/>\n<br/>\nSo maybe look at that link and imagine it a list of ways to give kids  <br/>\nfood issues.  Then you&#39;ll have a list in your head of what not to do!<br/>\n<br/>\n-=-On the one hand, we do teach our kids what to eat -=-<br/>\n<br/>\nDo you?  I advise against that.<br/>\n<br/>\n-=-(parents have complete control over what a 2-year-old has access  <br/>\nto or not)-=-<br/>\n<br/>\nDo you really?  TRULY?  I seriously advise against over-controlling  <br/>\nwhat a two year old eats too, or can&#39;t eat.<br/>\n<br/>\nYears ago, mid-70&#39;s, I was babysitting my all-natural niece, and we  <br/>\nlost her.  She was in the garden, between thick rows, with an open  <br/>\nsack of sugar, shovelling it in with both hands.  She was five or so.<br/>\n<br/>\nIf a child is allowed to eat a sugar packet at a restaurant, or to  <br/>\nplay with (and maybe taste or eat) sugar cubes, or allowed to have  <br/>\nmore sugar on oatmeal or cereal if she wants it, instead of being  <br/>\ntold &quot;no&quot; or &quot;you have enough&quot; or &quot;sugar is bad,&quot; then I bet she will  <br/>\nnever, EVER squat in the field over a four lb. bag of sugar hoping to  <br/>\nload up before she&#39;s caught.<br/>\n<br/>\n-=-OTOH, I can see that too limited an offering of choices,  <br/>\nespecially with older kids, limits their ability to figure out how to  <br/>\nmake choices that work for them. This makes sense to me.-=-<br/>\n<br/>\nIf they&#39;ve made choices since they were two, since they were babies,  <br/>\nthere is no &quot;especially with older kids&quot; time coming.<br/>\n<br/>\nIf babies can nurse or not when they want to, if they can reach for  <br/>\nfood or turn their head to refuse it, that&#39;s the start of their  <br/>\nchoicemaking and of parents&#39; trust.    It&#39;s no good to control or  <br/>\nforce or forbid and then at some point decide they&#39;re old enough to  <br/>\ndecide.<br/>\n<br/>\n-=-I don&#39;t think anyone hands whiskey to a 2-year-old! -=-<br/>\n<br/>\nIf you see only two choices (full control or giving them shots of  <br/>\nwhiskey), your world is too small.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215360808","msgId":36194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NzBFRjI4LjYwMTAwQGdtYWlsLmNvbT4=","inReplyToHeader":"PEFEOTJGNEJELTY4Q0MtNEQ0OS04NTkyLTc5RjlDOTZGMDgzRkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8QUQ5MkY0QkQtNjhDQy00RDQ5LTg1OTItNzlGOUM5NkYwODNGQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":36193,"nextInTopic":36195,"prevInTime":36193,"nextInTime":36195,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... We ve done this. He even took peanuts to school (before we homeschooled) and had special dispensation to eat them whenever he needed (tho sometimes he had","messageBody":"<div id=\"ygrps-yiv-2038589955\">Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-When I joined this family, the oldest had hypoglycemic symptoms. I  <br/>\n&gt; have<br/>\n&gt; tried to show him that eating less refined flour and sugar in his diet<br/>\n&gt; frees him from this metabolic condition, and he has proved this to<br/>\n&gt; himself, but it&#39;s hard not to want what all his friends, family (and<br/>\n&gt; everyone on TV) is eating.-=-<br/>\n&gt; <br/>\n&gt; Hypoglycemia needs protein.  Instead of showing him what he should  <br/>\n&gt; avoid, it would be happier, more positive and more honest to show him  <br/>\n&gt; what he does need to eat--what will help.  Make a list, or always  <br/>\n&gt; bring a couple of things when you shop.  String cheese, nuts, peanut  <br/>\n&gt; butter (maybe make peanut butter balls with coconut)...<br/>\n<br/>\n </span></blockquote>We&#39;ve done this. He even took peanuts to school (before we homeschooled) <br/>\nand had special dispensation to eat them whenever he needed (tho&#39; <br/>\nsometimes he had to do it in the nurse&#39;s office, I think). He knows that <br/>\nwhen he eats more protein his body works better, but eating candy all <br/>\nday also works for hypoglycemics. If you just eat sugar every couple <br/>\nhours (or more) you never &quot;crash&quot;, but it makes the hypoglycemia more <br/>\nbrittle (you have to eat sugar more and more often or you crash). <br/>\nEventually, diabetes is a real possibility. Kids as young as 7 are <br/>\ngetting &quot;adult onset&quot; diabetes these days (Type II).<br/>\n<br/>\nI think some of my &quot;issues&quot; are also step-parent stuff. I wasn&#39;t there <br/>\nwhen he was a toddler and had no input to the diet he got used to (or <br/>\nthe girls either for that matter--the youngest was about to turn 3 when <br/>\nI joined the family). My significant other would tend to snack all <br/>\nday--always with a soda open--only eating a meal at dinner, if anyone <br/>\nfeels like cooking one except for negotiations between us. This seems <br/>\nhorribly unhealthy to me and I don&#39;t like how I feel when I eat that <br/>\nway. The kids, of course, want to live off soda and chips, mainly, with <br/>\nmaybe some pastry and candy thrown in for good measure &lt;grin&gt;. They are <br/>\nused to eating this way and their mom eats this way (she rarely eats <br/>\nprotein) and I&#39;m just a big meany for trying to give them a more healthy <br/>\noption.<br/>\n<br/>\nWhen we substituted fruit juice for sugary drinks the boy (13) actually <br/>\ndidn&#39;t like the drinks he&#39;d liked before. He said they tasted funny now <br/>\nthat he was used to the juice. I know from personal experience that the <br/>\nsame thing happens when I just eat fresh veggies and meats (avoiding <br/>\nprocessed and convenient foods that are mostly flavored by stuff they <br/>\nmake in labs). But it doesn&#39;t work (at least for me) if I&#39;m also eating <br/>\nprocessed foods at the same time.<br/>\n<br/>\nI feel like the kids haven&#39;t had the option to find this out for <br/>\nthemselves because the foods they have not been exposed to healthier <br/>\noptions. And when I try to give them that option I&#39;m just an odd-ball!<br/>\n<br/>\nThanks!<br/>\nRobin<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Well  here:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; It will have answers to lots of your questions and there&#39;s a list of  <br/>\n&gt; protein ideas for picky kids.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------------------<br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: bad role models","postDate":"1215359353","msgId":36193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NzBFOTc5LjgwMjAwMDFAZ21haWwuY29tPg==","inReplyToHeader":"PGc0b3FjcytqOWd2QGVHcm91cHMuY29tPg==","referencesHeader":"PGc0b3FjcytqOWd2QGVHcm91cHMuY29tPg=="},"prevInTopic":36192,"nextInTopic":36194,"prevInTime":36192,"nextInTime":36194,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... This does work for us. When we have lots of fruit they eat it happily--but they d choose chips over fruit if we had the chips in the house. Robin","messageBody":"<div id=\"ygrps-yiv-8089535\">MLewis wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve noticed that if my children are hungry and I haven&#39;t prepared <br/>\n&gt; something for them to eat, they eat whatever is handy in the <br/>\n&gt; kitchen.  If I buy a lot of bread and marshmallows and chips, and not <br/>\n&gt; much in the way of veggies, then they won&#39;t be eating much in the way <br/>\n&gt; of veggies.  I know that sounds simple, but I sometimes have to <br/>\n&gt; remind myself!  When I grocery shop, I probably buy about 80% produce <br/>\n&gt; and 20% other stuff.  And I try to buy veggies that are grabbers: <br/>\n&gt; cucumbers, red or orange bell peppers, carrots, fruit, nuts.  My 17yo <br/>\n<br/>\n </span></blockquote>This does work for us. When we have lots of fruit they eat it <br/>\nhappily--but they&#39;d choose chips over fruit if we had the chips in the <br/>\nhouse.<br/>\n<br/>\n<br/>\nRobin</div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215359106","msgId":36192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NzBFODgyLjQwNDAxMDlAZ21haWwuY29tPg==","inReplyToHeader":"PDIwMDgwNzA1MTkzMC5tNjVKVVZidzAzMjczOEBvbXIxLm5ldHdvcmtzb2x1dGlvbnNlbWFpbC5jb20+","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8MjAwODA3MDUxOTMwLm02NUpVVmJ3MDMyNzM4QG9tcjEubmV0d29ya3NvbHV0aW9uc2VtYWlsLmNvbT4="},"prevInTopic":36191,"nextInTopic":36193,"prevInTime":36191,"nextInTime":36193,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... I want to eat more healthily, too! ... Yeah, I know... ... I like this idea. Whether they agree to join me or not, at least they d understand what I m","messageBody":"<div id=\"ygrps-yiv-2077705430\">marji wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; At 11:38 7/5/2008, you wrote:<br/>\n&gt; <br/>\n&gt;&gt; How can I trust the kids when I don&#39;t trust myself?  (vis-a-vis poor <br/>\n&gt;&gt; food choices)<br/>\n&gt; <br/>\n&gt; Hi, Robin. I don&#39;t think you can ask your kids to do something you&#39;re <br/>\n&gt; not willing to do yourself.  I don&#39;t know the ages that we&#39;re talking <br/>\n&gt; about, but to me ~ strictly in my opinion ~ it seems disingenuous to <br/>\n&gt; ask kids to adhere to dietary practices that you&#39;re not willing to <br/>\n&gt; adhere to for yourself.  Even if you were following a better diet, <br/>\n<br/>\n </span></blockquote>I want to eat more healthily, too!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; really, the best I think you can do is model for them.  You can&#39;t <br/>\n&gt; *make* them eat anything (you can try, but that kind of thing <br/>\n&gt; generally leads to way more problems than it solves).<br/>\n<br/>\n </span></blockquote>Yeah, I know...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Were I in this situation, I would present my case this way:  I would <br/>\n&gt; sit down with them and announce that *I* want to change *my* dietary <br/>\n&gt; habits.  I&#39;d tell precisely why, and discuss my concerns about MY <br/>\n&gt; diet.  I would ask for support and see if anyone was interested in <br/>\n&gt; buddying up with me for this adventure.  If I had takers, I would, if <br/>\n<br/>\n </span></blockquote>I like this idea. Whether they agree to join me or not, at least they&#39;d <br/>\nunderstand what I&#39;m trying to do and why I want to do it--for myself.<br/>\n<br/>\nI could also ask for their help in avoiding the foods I tend to binge <br/>\non--it&#39;s hard for me to not eat them when other&#39;s are eating them around <br/>\nme. Maybe we could talk about the different foods we like and tend to <br/>\nhave in the house and make choices (like pasta and doughnuts get me, but <br/>\nhot cheetos don&#39;t. Maybe the kids would be willing to not eat doughnuts <br/>\nin front of me if they could eat hot cheetos whenever they wanted...)<br/>\n<br/>\nThis helps, thanks!<br/>\nRobin<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; they were into it, embark on it as an adventure, researching <br/>\n&gt; together, coming up with interesting recipes, cooking together *to <br/>\n&gt; the extent they were interested*.  I would do my level best to make <br/>\n&gt; this eating adventure fun and wonderful for *me* and be open to <br/>\n&gt; whoever would like to join me, either full time or part time.  No <br/>\n&gt; shame, no blame, no pressure.  Just love and support and joy.  Food, <br/>\n&gt; like life, should be joyful ~ first and foremost!<br/>\n&gt; <br/>\n&gt; I hope this is helpful.<br/>\n&gt; <br/>\n&gt; ~Marji<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; No virus found in this outgoing message.<br/>\n&gt; Checked by AVG. <br/>\n&gt; Version: 8.0.136 / Virus Database: 270.4.5/1536 - Release Date: 7/5/2008 10:15 AM<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------------------<br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215358663","msgId":36189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NzBFNkM3LjUwODA1MDhAZ21haWwuY29tPg==","inReplyToHeader":"PENFOTRFNzlCLUQ5NEEtNEYyNS04QzUyLUQ3OEYwNzYxQjREMkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPiA8Q0U5NEU3OUItRDk0QS00RjI1LThDNTItRDc4RjA3NjFCNEQyQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":36173,"nextInTopic":36191,"prevInTime":36188,"nextInTime":36190,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"Sandra Dodd wrote:  ... I m pretty sure I have made sure (mea culpa!) I so hear my mom in my side of this discussion...Talk about food hang-ups! On the","messageBody":"<div id=\"ygrps-yiv-1170024284\">Sandra Dodd wrote:<br/>\n&lt;snip&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; Without choices, no one can make a choice.  Have you thought about  <br/>\n&gt; why you make the food choices you make?  Do you think your kids will  <br/>\n&gt; have those same factors in their life?  Can you figure out how to  <br/>\n&gt; make sure they DO have whatever reactionary thoughts or neediness you  <br/>\n&gt; have that influences your food choices?<br/>\n<br/>\n </span></blockquote>I&#39;m pretty sure I have made sure (mea culpa!) I so hear my mom in my <br/>\nside of this discussion...Talk about food hang-ups!<br/>\n<br/>\nOn the one hand, we do teach our kids what to eat (parents have complete <br/>\ncontrol over what a 2-year-old has access to or not). OTOH, I can see <br/>\nthat too limited an offering of choices, especially with older kids, <br/>\nlimits their ability to figure out how to make choices that work for <br/>\nthem. This makes sense to me.<br/>\n<br/>\nI&#39;m just a newbie and trying to figure out where the best balance is. I <br/>\ndon&#39;t think anyone hands whiskey to a 2-year-old! But the kids hate it <br/>\nwhen I take all the &quot;fun&quot; foods out of the house, too.<br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have no guarantees, but we can help you see alternatives from  <br/>\n&gt; which choices can be made.<br/>\n<br/>\n </span></blockquote>I think that&#39;s what I&#39;m hoping for. And the comments I&#39;ve received have <br/>\ngiven me much to think about. Thanks!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; So...<br/>\n&gt; -=-Like, how do I trust my kids to eat a healthy diet when I don&#39;t  <br/>\n&gt; myself!-=-<br/>\n&gt; <br/>\n&gt; If you choose not to trust them (not to give them choices), how will  <br/>\n&gt; they eat a healthy diet when you don&#39;t yourself?<br/>\n<br/>\n </span></blockquote>I&#39;d like us to eat more healthily together. I&#39;m a carb addict and its <br/>\nhard for me to not eat doughnuts, pasta, ice cream, etc. when everyone <br/>\naround me is. (There&#39;s spouse issues in here, too!) But I don&#39;t like the <br/>\neffect it has on my body!<br/>\n<br/>\nI can see I&#39;ve got a lot more thinking to do on this...<br/>\n<br/>\nRobin<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------------------<br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":137349367,"authorName":"cathyandgarth","from":"&quot;cathyandgarth&quot; &lt;familialewis@...&gt;","profile":"cathyandgarth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: bad role models","postDate":"1215312263","msgId":36173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc0cGJpNyt2Zmx0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPg=="},"prevInTopic":36163,"nextInTopic":36189,"prevInTime":36172,"nextInTime":36174,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... myself! ... Hi Robin, When I read this sentence all I could hear was Shaggy s voice ... But seriously, I do think that kids diets will reflect our diets","messageBody":"<div id=\"ygrps-yiv-392659937\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin &lt;GaiaAlive@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Like, how do I trust my kids to eat a healthy diet when I don&#39;t <br/>\n </span></blockquote>myself!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>Hi Robin,<br/>\nWhen I read this sentence all I could hear was Shaggy&#39;s voice ... <br/>\n<br/>\nBut seriously, I do think that kids&#39; diets will reflect our diets to <br/>\nsome extent.  I do notice that my kids&#39; tend to eat a more diverse <br/>\ndiet when I am tending to eat a more diverse diet.  <br/>\n<br/>\nHowever, they also have their own likes that have nothing to do with <br/>\nmine nor my DH&#39;s diet.  I never eat marshmellows for breakfast and I <br/>\ncan&#39;t stand boiled eggs -- my 3 year old regularly has marshmellows <br/>\nand sliced boiled egg slices for breakfast (I shudder as I write that <br/>\ndown).  I don&#39;t really like popsicles, my kids love them.  I love <br/>\nscrambled eggs with loads of stuff mixed in, none of my kids can <br/>\nstand their eggs that way (cheese maybe, dd will do ham sometimes, <br/>\nmaybe).  <br/>\n<br/>\nI think that an important part of unschooling for me, so far, has <br/>\nbeen has been learning to give myself the freedom to trust _myself_ <br/>\naround issues like food, tv, and computer.  While I easily saw the <br/>\nadvantage of letting go and really trusting my children, that process <br/>\nreally served as a magnifying glass on my own personal/self trust <br/>\nissues.  It was and is such a great opportunity for me to continue my <br/>\nown growth and developement as a human being.  And, just as you can <br/>\nimagine how empowering it is for the kids in our lives to make free <br/>\nchoices, imagine how empowering it will be for you to give up your <br/>\njudgements and critical views of your own diet?  <br/>\n<br/>\nFor me, a great weight lifted off my shoulders when I (sincerely and <br/>\nhonestly) stopped critically judging eveything that I ate:  Oh, I ate <br/>\nhealthy today, or I shouldn&#39;t have had that second bowl of icecream, <br/>\nor I wish I ate more green vegies they are so healthy.  I am not sure <br/>\nif I eat more or less *healthy* than I did before, but I feel great <br/>\nand I feel healthy and I really just enjoy my food.  I haven&#39;t done <br/>\nthis *for* my kids, but in writing this down I can really see how <br/>\nshifting my interactions with and internal conversations about food <br/>\nis super positive for them.  (I found Byron Katie&#39;s The Work <br/>\nthework.com incredibly helpful in jumpstarting and solidifying this <br/>\nprocess.) <br/>\n <br/>\nCathy</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: bad role models","postDate":"1215304152","msgId":36163,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFQjA2RjcxLTE5QkItNDY4My1CQzZCLTI5QUVFNEUzMjk3REBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGc0b3FjcytqOWd2QGVHcm91cHMuY29tPg==","referencesHeader":"PGc0b3FjcytqOWd2QGVHcm91cHMuY29tPg=="},"prevInTopic":36157,"nextInTopic":36173,"prevInTime":36162,"nextInTime":36164,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=-Make good nutritious meals, and I bet they ll eat it up! caviat: my son has sensory stuff, so he only wears clothes with certain feels and he eats according","messageBody":"<div id=\"ygrps-yiv-225974791\">-=-Make good nutritious<br/>\nmeals, and I bet they&#39;ll eat it up! caviat: my son has sensory<br/>\nstuff, so he only wears clothes with certain feels and he eats<br/>\naccording to texture a lot. So just any nutritious meal ain&#39;t gonna<br/>\ndo it!-=-<br/>\n<br/>\n<br/>\n<br/>\nSometimes we make tuna salad or egg salad, and roll little two-bite- <br/>\nsize (give or take) amounts in lettuce leaves, and that&#39;s fun.  That  <br/>\nreminds me I should go and so something like that right now!<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195979760,"authorName":"MLewis","from":"&quot;MLewis&quot; &lt;m9f9l@...&gt;","profile":"m9f9l","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: bad role models","postDate":"1215294684","msgId":36157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc0b3FjcytqOWd2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDgwNzA1MTkzMC5tNjVKVVZidzAzMjczOEBvbXIxLm5ldHdvcmtzb2x1dGlvbnNlbWFpbC5jb20+"},"prevInTopic":36155,"nextInTopic":36163,"prevInTime":36156,"nextInTime":36158,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"I ve noticed that if my children are hungry and I haven t prepared something for them to eat, they eat whatever is handy in the kitchen.  If I buy a lot of","messageBody":"<div id=\"ygrps-yiv-1460243622\">I&#39;ve noticed that if my children are hungry and I haven&#39;t prepared <br/>\nsomething for them to eat, they eat whatever is handy in the <br/>\nkitchen.  If I buy a lot of bread and marshmallows and chips, and not <br/>\nmuch in the way of veggies, then they won&#39;t be eating much in the way <br/>\nof veggies.  I know that sounds simple, but I sometimes have to <br/>\nremind myself!  When I grocery shop, I probably buy about 80% produce <br/>\nand 20% other stuff.  And I try to buy veggies that are grabbers: <br/>\ncucumbers, red or orange bell peppers, carrots, fruit, nuts.  My 17yo <br/>\njust told me I need carrots actually.  He also lets me know if I need <br/>\nto buy sandwich meat since I don&#39;t tend to eat it myself!LOL  They&#39;re <br/>\nso happy and gracious if I ask if they&#39;d like me to make something <br/>\nfor them: a sandwich or tortilla wrap, which I put lots of extras in <br/>\nlike romaine and cucumber, baby spinach, etc.  <br/>\nI don&#39;t think you need to &quot;launch&quot; a new eating program up front, but <br/>\ntry incorporating better choices in general.  Make good nutritious <br/>\nmeals, and I bet they&#39;ll eat it up!  caviat: my son has sensory <br/>\nstuff, so he only wears clothes with certain feels and he eats <br/>\naccording to texture a lot.  So just any nutritious meal ain&#39;t gonna <br/>\ndo it!LOL  But I know what he does and doesn&#39;t like, so I make things <br/>\nfor him without onions or mushrooms.  He likes cooked broccoli but <br/>\nnot raw.  He often doesn&#39;t eat the main dish that we&#39;re having, but <br/>\nhe&#39;ll eat the rice, or the broccoli, or the green beans (if they&#39;re <br/>\ncooked to the right texture)...<br/>\nIf figuring out what to buy and make overwhelms you, you might <br/>\nconsider finding a place for food support.  Look for recipe groups <br/>\nonline, or start googling!<br/>\nMary<br/>\n<br/>\nIn <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, marji &lt;marji@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; At 11:38 7/5/2008, you wrote:<br/>\n&gt; <br/>\n&gt; &gt;How can I trust the kids when I don&#39;t trust myself?  (vis-a-vis <br/>\n </span></blockquote>poor <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;food choices)<br/>\n&gt; <br/>\n&gt; Hi, Robin. I don&#39;t think you can ask your kids to do something <br/>\n </span></blockquote>you&#39;re <br/>\n<blockquote><span title=\"ireply\"> &gt; not willing to do yourself.  I don&#39;t know the ages that we&#39;re <br/>\n </span></blockquote>talking <br/>\n<blockquote><span title=\"ireply\"> &gt; about, but to me ~ strictly in my opinion ~ it seems disingenuous <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; ask kids to adhere to dietary practices that you&#39;re not willing to <br/>\n&gt; adhere to for yourself.  Even if you were following a better diet, <br/>\n&gt; really, the best I think you can do is model for them.  You can&#39;t <br/>\n&gt; *make* them eat anything (you can try, but that kind of thing <br/>\n&gt; generally leads to way more problems than it solves).<br/>\n&gt; <br/>\n&gt; Were I in this situation, I would present my case this way:  I <br/>\n </span></blockquote>would <br/>\n<blockquote><span title=\"ireply\"> &gt; sit down with them and announce that *I* want to change *my* <br/>\n </span></blockquote>dietary <br/>\n<blockquote><span title=\"ireply\"> &gt; habits.  I&#39;d tell precisely why, and discuss my concerns about MY <br/>\n&gt; diet.  I would ask for support and see if anyone was interested in <br/>\n&gt; buddying up with me for this adventure.  If I had takers, I would, <br/>\n </span></blockquote>if <br/>\n<blockquote><span title=\"ireply\"> &gt; they were into it, embark on it as an adventure, researching <br/>\n&gt; together, coming up with interesting recipes, cooking together *to <br/>\n&gt; the extent they were interested*.  I would do my level best to make <br/>\n&gt; this eating adventure fun and wonderful for *me* and be open to <br/>\n&gt; whoever would like to join me, either full time or part time.  No <br/>\n&gt; shame, no blame, no pressure.  Just love and support and joy.  <br/>\n </span></blockquote>Food, <br/>\n<blockquote><span title=\"ireply\"> &gt; like life, should be joyful ~ first and foremost!<br/>\n&gt; <br/>\n&gt; I hope this is helpful.<br/>\n&gt; <br/>\n&gt; ~Marji<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; No virus found in this outgoing message.<br/>\n&gt; Checked by AVG. <br/>\n&gt; Version: 8.0.136 / Virus Database: 270.4.5/1536 - Release Date: <br/>\n </span></blockquote>7/5/2008 10:15 AM<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215286225","msgId":36155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDgwNzA1MTkzMC5tNjVKVVZidzAzMjczOEBvbXIxLm5ldHdvcmtzb2x1dGlvbnNlbWFpbC5jb20+","inReplyToHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPg==","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPg=="},"prevInTopic":36153,"nextInTopic":36157,"prevInTime":36154,"nextInTime":36156,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"... Hi, Robin. I don t think you can ask your kids to do something you re not willing to do yourself.  I don t know the ages that we re talking about, but to","messageBody":"<div id=\"ygrps-yiv-893039249\">At 11:38 7/5/2008, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;How can I trust the kids when I don&#39;t trust myself?  (vis-a-vis poor <br/>\n&gt;food choices)<br/>\n<br/>\n </span></blockquote>Hi, Robin. I don&#39;t think you can ask your kids to do something you&#39;re <br/>\nnot willing to do yourself.  I don&#39;t know the ages that we&#39;re talking <br/>\nabout, but to me ~ strictly in my opinion ~ it seems disingenuous to <br/>\nask kids to adhere to dietary practices that you&#39;re not willing to <br/>\nadhere to for yourself.  Even if you were following a better diet, <br/>\nreally, the best I think you can do is model for them.  You can&#39;t <br/>\n*make* them eat anything (you can try, but that kind of thing <br/>\ngenerally leads to way more problems than it solves).<br/>\n<br/>\nWere I in this situation, I would present my case this way:  I would <br/>\nsit down with them and announce that *I* want to change *my* dietary <br/>\nhabits.  I&#39;d tell precisely why, and discuss my concerns about MY <br/>\ndiet.  I would ask for support and see if anyone was interested in <br/>\nbuddying up with me for this adventure.  If I had takers, I would, if <br/>\nthey were into it, embark on it as an adventure, researching <br/>\ntogether, coming up with interesting recipes, cooking together *to <br/>\nthe extent they were interested*.  I would do my level best to make <br/>\nthis eating adventure fun and wonderful for *me* and be open to <br/>\nwhoever would like to join me, either full time or part time.  No <br/>\nshame, no blame, no pressure.  Just love and support and joy.  Food, <br/>\nlike life, should be joyful ~ first and foremost!<br/>\n<br/>\nI hope this is helpful.<br/>\n<br/>\n~Marji<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG. <br/>\nVersion: 8.0.136 / Virus Database: 270.4.5/1536 - Release Date: 7/5/2008 10:15 AM<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215285711","msgId":36153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFEOTJGNEJELTY4Q0MtNEQ0OS04NTkyLTc5RjlDOTZGMDgzRkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPg==","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPg=="},"prevInTopic":36152,"nextInTopic":36155,"prevInTime":36152,"nextInTime":36154,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=-When I joined this family, the oldest had hypoglycemic symptoms. I have tried to show him that eating less refined flour and sugar in his diet frees him","messageBody":"<div id=\"ygrps-yiv-1773095602\">-=-When I joined this family, the oldest had hypoglycemic symptoms. I  <br/>\nhave<br/>\ntried to show him that eating less refined flour and sugar in his diet<br/>\nfrees him from this metabolic condition, and he has proved this to<br/>\nhimself, but it&#39;s hard not to want what all his friends, family (and<br/>\neveryone on TV) is eating.-=-<br/>\n<br/>\nHypoglycemia needs protein.  Instead of showing him what he should  <br/>\navoid, it would be happier, more positive and more honest to show him  <br/>\nwhat he does need to eat--what will help.  Make a list, or always  <br/>\nbring a couple of things when you shop.  String cheese, nuts, peanut  <br/>\nbutter (maybe make peanut butter balls with coconut)...<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWell  here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<br/>\n<br/>\n<br/>\nIt will have answers to lots of your questions and there&#39;s a list of  <br/>\nprotein ideas for picky kids.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] bad role models","postDate":"1215285541","msgId":36152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENFOTRFNzlCLUQ5NEEtNEYyNS04QzUyLUQ3OEYwNzYxQjREMkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPg==","referencesHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPg=="},"prevInTopic":36147,"nextInTopic":36153,"prevInTime":36151,"nextInTime":36153,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"-=-Like, how do I trust my kids to eat a healthy diet when I don t myself!-=- Did anyone say trust your kids to eat a healthy diet ?  I want to see where the","messageBody":"<div id=\"ygrps-yiv-1793442655\">-=-Like, how do I trust my kids to eat a healthy diet when I don&#39;t  <br/>\nmyself!-=-<br/>\n<br/>\nDid anyone say &quot;trust your kids to eat a healthy diet&quot;?  I want to  <br/>\nsee where the first step is on this path you&#39;ve envisioned before I  <br/>\nwalk it.<br/>\n<br/>\nWithout choices, no one can make a choice.  Have you thought about  <br/>\nwhy you make the food choices you make?  Do you think your kids will  <br/>\nhave those same factors in their life?  Can you figure out how to  <br/>\nmake sure they DO have whatever reactionary thoughts or neediness you  <br/>\nhave that influences your food choices?<br/>\n<br/>\nHere&#39;s me:  I love chocolate and I can point to MANY things in my  <br/>\nlife that gave me the feeling that when I was grown I would eat  <br/>\nchocolate if I wanted to.  I can go a long time without any, but  <br/>\nsometimes I binge.  Not one of my children has ever, once binged on  <br/>\nchocolate.  Something&#39;s different.<br/>\n<br/>\n-=--=-Like, how do I trust my kids to eat a healthy diet when I don&#39;t  <br/>\nmyself!-=--=-<br/>\n<br/>\nWhen you ask a question, consider an alternative.  Not &quot;the  <br/>\nalternative,&quot; because there&#39;s more than one, but for instance if you  <br/>\nsay &quot;but what if we homeschool and my child is still unhappy?&quot;  I&#39;d  <br/>\nwant to say &quot;If you leave him in school will she be happy?&quot;<br/>\n<br/>\nWe have no guarantees, but we can help you see alternatives from  <br/>\nwhich choices can be made.<br/>\n<br/>\nSo...<br/>\n-=-Like, how do I trust my kids to eat a healthy diet when I don&#39;t  <br/>\nmyself!-=-<br/>\n<br/>\nIf you choose not to trust them (not to give them choices), how will  <br/>\nthey eat a healthy diet when you don&#39;t yourself?<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":348924346,"authorName":"Robin","from":"Robin &lt;GaiaAlive@...&gt;","profile":"robinnidana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"bad role models","postDate":"1215272295","msgId":36147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NkY5NTY3LjUwMjA5MDlAZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":36152,"prevInTime":36146,"nextInTime":36148,"topicId":36147,"numMessagesInTopic":0,"msgSnippet":"I am new to unschooling and I have questions about some tricky stuff. Like, how do I trust my kids to eat a healthy diet when I don t myself! When I joined","messageBody":"<div id=\"ygrps-yiv-1379193834\">I am new to unschooling and I have questions about some tricky stuff.<br/>\n<br/>\nLike, how do I trust my kids to eat a healthy diet when I don&#39;t myself!<br/>\n<br/>\nWhen I joined this family, the oldest had hypoglycemic symptoms. I have <br/>\ntried to show him that eating less refined flour and sugar in his diet <br/>\nfrees him from this metabolic condition, and he has proved this to <br/>\nhimself, but it&#39;s hard not to want what all his friends, family (and <br/>\neveryone on TV) is eating. Since we&#39;ve been homschooling his activity <br/>\nlevel has dropped and he is becoming pudgy--like everyone in his family <br/>\n(including me)!<br/>\n<br/>\nI am concerned about diabetes.<br/>\n<br/>\nRecently we switched to a &quot;meat and vegetables&quot; diet. We switched to <br/>\njuice instead of drinks with added sugar. When we bought some sugar <br/>\ndrinks the oldest said he no longer liked them because we&#39;ve been <br/>\ndrinking juice and they no longer tasted good to him. I believe this <br/>\nwould happen with most of the less healthy foods if he ever experienced <br/>\na diet full of less processed meat, vegetables and fruits that had real <br/>\nflavor (good, fresh, flavorful, fruits and vegetables and meats).<br/>\n<br/>\nHe&#39;s never had this experience at home OR when he was eating two meals a <br/>\nday at public school. He&#39;s used to a high-carb, low protein and low <br/>\nvegetable diet. We tend to eat like typical Americans: grab &quot;convenient&quot; <br/>\npackaged meals, chips, soda, etc. where most of the flavor was made in a <br/>\nfood lab. Lots of pasta and potatoes and breads. And so does everyone <br/>\nelse in the kids&#39; extended family.<br/>\n<br/>\nHow can I trust the kids when I don&#39;t trust myself?<br/>\n<br/>\nAny thoughts would be welcome,<br/>\nRobin</div>","specialLinks":[]}],"prevTopicId":36485,"nextTopicId":36413}}