{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":324333020,"authorName":"pegstamps","from":"&quot;pegstamps&quot; &lt;pegstamps@...&gt;","profile":"pegstamps","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Mom, I&#39;m bored!&quot; and What to say that we do all day?","postDate":"1252849380","msgId":47223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4aXN0NCtoOTJhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdhMDlmNDFmMDkwOTEwMTEyOXY3Njg2YjIyM28zMGNjNmNkMTQzOGMxZjM5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":47209,"nextInTopic":0,"prevInTime":47222,"nextInTime":47224,"topicId":47202,"numMessagesInTopic":0,"msgSnippet":"... ========================================== Love the Invention Box idea!!! My 8 yr old just wants to do simple things, talk about them and be creative. She","messageBody":"<div id=\"ygrps-yiv-395029281\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Cara Barlow &lt;carabarlow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; H Sherri:<br/>\n&gt; <br/>\n&gt; ***my youngest, 7, is constantly telling me that she is bored. I just don&#39;t<br/>\n&gt; understand it because she has many, many things to do at our home as well as<br/>\n&gt; the many outings that we go on. She has to be doing something 24/7 or she is<br/>\n&gt; bored****<br/>\n </span></blockquote>==========================================<br/>\n<br/>\nLove the Invention Box idea!!!<br/>\n<br/>\nMy 8 yr old just wants to do simple things, talk about them and be creative. She wants MY time. She wants me to TEACH her something new.<br/>\nLoom Knitting, Scrapbooking, Baking Bread, Sewing, Canning, Laundry...<br/>\nAnything I do on a daily/weekly/monthly basis.<br/>\n<br/>\nListen and pick up on her clues. Ask her if she wants to help you in any of your chores, but make them fun and interesting....you could make it a race to music, take photos, document the time. Have a treat afterwards. <br/>\n<br/>\nGood Luck!</div>","specialLinks":[]},{"userId":337265206,"authorName":"bhmjones","from":"&quot;bhmjones&quot; &lt;bhmjones@...&gt;","profile":"bhmjones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Mom, I&#39;m bored!&quot; and What to say that we do all day?","postDate":"1252634144","msgId":47209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4Y2FuMCs0aDh2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQzAwMzdERjFFRkQ0My0zN0E4LTIxNDAxQHdlYm1haWwtZDA4My5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":47208,"nextInTopic":47223,"prevInTime":47208,"nextInTime":47210,"topicId":47202,"numMessagesInTopic":0,"msgSnippet":"... Brad- My child does this as well. It is normal. It simply means they want to be entertained by you, not anything else. My child loves to sit beside me","messageBody":"<div id=\"ygrps-yiv-500603669\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, KaitKalKenz3@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I just started unschooling my children a few weeks ago. My older two children, 16 and 14, have no problem finding things that interest them and learning about them. However, my youngest, 7, is constantly telling me that she is bored.<br/>\n<br/>\n </span></blockquote>Brad-<br/>\nMy child does this as well. It is normal. It simply means they want to be entertained by you, not anything else. My child loves to sit beside me watching me play online poker. That unbores her.<br/>\n <br/>\nSherri-<br/>\nI just don&#39;t understand it because she has many, many things to do at our home as well as the many outings that we go on.<br/>\n<br/>\nBrad-<br/>\nAll those *things* aren&#39;t you. She desires you.<br/>\n<br/>\nSherri-<br/>\nShe has to be doing something 24/7 or she is bored.<br/>\n<br/>\nBrad-<br/>\nWe all are like that.<br/>\n<br/>\nSherri-<br/>\nHow do you all handle if your child tells you that she/he is bored?<br/>\n<br/>\nBrad-<br/>\nAt first, I did as you do below. Then luckily I came across this site and learned that it was me that needed to adjust. My child is doing the same thing every child does, including us when we were children.<br/>\n<br/>\nSherri-<br/>\nI give her many suggestions of things that she or we can do. She usually says &quot;no&quot; to most if not all of them. She whines and cries but she doesn&#39;t want to do any of my suggestions. So I ask her if she has any suggestions and the answer is always &quot;I don&#39;t know&quot;. I am with her almost every waking moment of her day so it&#39;s not that she isn&#39;t getting enough attention. Sometimes I feel that she may be getting too much attention because she doesn&#39;t seem to want to do anything on her own.<br/>\n<br/>\nBrad-<br/>\nLike Cara, another poster here, says: It is usually not enough just being physically in the same room. They desire interaction.<br/>\n<br/>\nSherri-<br/>\nI told her that we have done so much this year. We&#39;ve gone to Florida to Disney World and the beach. We&#39;ve gone to the Cleveland Zoo. We went to Amish Country. We&#39;ve gone bowling, to parks, playgrounds, picnics, Lake Erie beaches, library programs, festivals, fairs, a pottery painting place in town, other community events, and the list goes on. Does anyone have any suggestions of what I can do when she continually tells me that she&#39;s bored?<br/>\n<br/>\nBrad-<br/>\nAs you&#39;ve probably come to realize, asking them to appreciate all that stuff does not make them any less bored at the moment. No need in any further attempts with that strategy.<br/>\n<br/>\nSherri-<br/>\nIt happens at least once every day or two. And when I saw once, I mean that she whines and cries about being bored for an hour or more until she finally finds something to do, agrees to one of my suggestions, or forgets that she was bored.<br/>\n<br/>\nBrad-<br/>\nYes, they eventually get bored with telling you they are bored. The thing to realize here is what damage is being done. They feel abandoned.<br/>\n<br/>\nSherri-<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My second question has to do with what to tell people that ask what we do everyday.<br/>\n<br/>\n </span></blockquote>Brad-<br/>\nThere are too many suggestions to mention here all in one post. The answer solely depends on many factors. Are they asking rhetorically, or are they actually curious?<br/>\n<br/>\nIf they are genuinely curious, be aware that they may allow their own phobias and fears to rear their heads depending on what you say. <br/>\n<br/>\nI suggest answering their questions with questions.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;Mom, I&#39;m bored!&quot; and What to say that we do all day?","postDate":"1252607548","msgId":47205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzMzMzNS45NjYxNi5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDhDQzAwMzdERjFFRkQ0My0zN0E4LTIxNDAxQHdlYm1haWwtZDA4My5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDhDQzAwMzdERjFFRkQ0My0zN0E4LTIxNDAxQHdlYm1haWwtZDA4My5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":47203,"nextInTopic":47208,"prevInTime":47204,"nextInTime":47206,"topicId":47202,"numMessagesInTopic":0,"msgSnippet":"... Is there an emphasis on finding things to do to learn from, or is the emphasis on finding things to do that are interesting and enjoyable, and through the","messageBody":"<div id=\"ygrps-yiv-736781053\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&quot;I just started unschooling my children a few weeks ago. My older two children, 16 and 14, have no problem finding things that interest them and learning about them. &quot;&gt;&gt;&gt;<br/>\n </span></blockquote>Is there an emphasis on finding things to do to learn from, or is the emphasis on finding things to do that are interesting and enjoyable, and through the enjoyment, learning happens?<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&quot;However, my youngest, 7, is constantly telling me that she is bored.&quot;&gt;&gt;&gt;<br/>\n </span></blockquote> Boredom is interesting.  Something that I&#39;ve seen with school kids, is that they are expecting someone else to tell them what to do, and will wait for that to happen, even be bored while waiting.  A 7 yr old&#39;s boredom could be a side effect of school, and waiting for someone to entertain and give them an activity to alleviate the boredom.<br/>\nLots of kids in school are bored.  It doesn&#39;t magically disappear when they come home.  In part they&#39;ve been trained to be bored and wait until something comes along to change their state of being.  It&#39;s very passive, school is something that is done TO kids, and while that environment can be engaging sometimes, it&#39;s very often not on the part of the child to be engaged.  Eventually, kids do find ways to engage their own minds, even within school.  Even with my own experience in school, I had to find ways to engage my mind or I would have completely lost it!<br/>\nOutside of school, with the world open, it doesn&#39;t have to be a coping mechanism to engage the mind.<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&quot;That is not true because McKenzie was STILL bored when she was in school. Then my mother asked me what we do all day. I paused before starting to answer but she cut me off and said &quot;nothing.... you don&#39;t do anything&quot;.&quot;&gt;&gt;&gt;<br/>\n </span></blockquote>If it comes up again, you could tell her about the deschooling process.  Even school at homers recognize that deschooling is really important.  I wouldn&#39;t talk about schooling with your relatives for a while.  If they ask, tell them what cool things they ARE doing, and it doesn&#39;t have to be about schoolish things at all.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&quot; McKenzie can read and write. If she doesn&#39;t know a word in a book, I have her spell it and try to sound it out or give her a clue to help her figure it out.&quot;&gt;&gt;&gt; <br/>\n </span></blockquote>When my kids have asked about a word, I just tell them what it is.  I don&#39;t try to have them figure it out.  If I&#39;m not sitting right next to them, I&#39;ll have them spell it to me, so that I know what the word is.  I don&#39;t like to use their love of reading and turn it into a reading lesson.  I&#39;m very careful not to do that.  I do the same thing when they ask what a word means.  I tell them and then look it up for them and tell them what the official dictionary meaning is.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&quot;As far as math, she is learning that as well. When we are cooking, I let her help me measure ingredients, for example, if we need 2 cups of flour but I give her a 1/2 cup measuring cup, then we figure out how many 1/2 cups will make 2 whole cups. We also learn math with money when she saves her money and we go shopping. I told my mom that she is learning constantly all the time. And she surprises me all the time by asking me questions that I do not know either (and I&#39;m a high school graduate, lol)&quot;&gt;&gt;&gt;<br/>\n </span></blockquote>Finding learning in everything is a good first step in unschooling.  Relaxing and KNOWing that learning is in everything, is the next big one!  If the mom or dad knows that learning happens because a person is alive and interested, then all the rest of it falls into place.  Baking can be about making a yummy treat, it doesn&#39;t have to be a math lesson.  Saving money can be about purchasing something cool, it doesn&#39;t have to be a math lesson.<br/>\nHumans learn all the time, it&#39;s unavoidable!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; &quot;When she does, we come home and look them up on the internet and if we want to know more, we go to the library to get books about the topic. &quot;&gt;&gt;&gt;<br/>\n </span></blockquote>Books aren&#39;t the only places to find answers!  The internet is great!  It&#39;s almost always my first stop, but books usually aren&#39;t next.  Next would be to get out there.  If my kids are interested in Japanese food, we don&#39;t get books about it, we go and eat some or go to the Japanese grocery store.  Books have their place for sure, but exploring life is waaaay more fun than reading about it!<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":383312070,"authorName":"Cara Barlow","from":"Cara Barlow &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;Mom, I&#39;m bored!&quot; and What to say that we do all \tday?","postDate":"1252607388","msgId":47208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdhMDlmNDFmMDkwOTEwMTEyOXY3Njg2YjIyM28zMGNjNmNkMTQzOGMxZjM5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDhDQzAwMzdERjFFRkQ0My0zN0E4LTIxNDAxQHdlYm1haWwtZDA4My5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDhDQzAwMzdERjFFRkQ0My0zN0E4LTIxNDAxQHdlYm1haWwtZDA4My5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":47205,"nextInTopic":47209,"prevInTime":47207,"nextInTime":47209,"topicId":47202,"numMessagesInTopic":0,"msgSnippet":"H Sherri: ***my youngest, 7, is constantly telling me that she is bored. I just don t understand it because she has many, many things to do at our home as well","messageBody":"<div id=\"ygrps-yiv-1152849240\">H Sherri:<br/>\n<br/>\n***my youngest, 7, is constantly telling me that she is bored. I just don&#39;t<br/>\nunderstand it because she has many, many things to do at our home as well as<br/>\nthe many outings that we go on. She has to be doing something 24/7 or she is<br/>\nbored****<br/>\n<br/>\nWhen my daughters were that age I realized that when they said they were<br/>\nbored, they were needing my attention - if I chatted with them, if we played<br/>\na game,or went for a walk, their &quot;boredness&quot; evaporated. They&#39;re 11 and 13<br/>\nnow, and I still find that largely true. Just being physically in the same<br/>\nroom is usually not enough - they need my focused attention. Hugs help too,<br/>\nor sitting close to each other on the couch &lt;g&gt;.<br/>\n<br/>\n***We&#39;ve gone to Florida to Disney World and the beach. We&#39;ve gone to the<br/>\nCleveland Zoo. We went to Amish Country. We&#39;ve gone bowling, to parks,<br/>\nplaygrounds, picnics, Lake Erie beaches, library programs, festivals, fairs,<br/>\na pottery painting place in town, other community events, and the list goes<br/>\non. ****<br/>\n<br/>\nYou don&#39;t need to leave the house to find something to do, and a<br/>\nseven-year-old may prefer doing things at home. One favorite activity of my<br/>\nyounger daughter&#39;s when she was that age was for me to put together an<br/>\n&quot;invention box&quot; for her . The invention box was me walking around the house<br/>\nfor a few minutes with an empty dishpan putting interesting things in it<br/>\nlike tape, pipe cleaners, Polly Pockets, a partial roll of toilet paper,<br/>\ncardboard from a discarded box, markers and so on. We&#39;d then sit together<br/>\nand talk while she created an invention from what was in the dishpan.<br/>\n<br/>\nBest wishes, Cara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Boredom [AlwaysLearning] &quot;Mom, I&#39;m bored!&quot; and What to say that we do all day?","postDate":"1252600022","msgId":47203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3M0RBMEMyLTJGMTQtNEZDQi05OTc3LTJBODhCMzE3OEQ2NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDhDQzAwMzdERjFFRkQ0My0zN0E4LTIxNDAxQHdlYm1haWwtZDA4My5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDhDQzAwMzdERjFFRkQ0My0zN0E4LTIxNDAxQHdlYm1haWwtZDA4My5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":47202,"nextInTopic":47205,"prevInTime":47202,"nextInTime":47204,"topicId":47202,"numMessagesInTopic":0,"msgSnippet":"-=-Thanks for listening to me ramble on. I tend to be long-winded. Sorry!=- Long isn t bad, but if you can use smaller paragraphs or break those big ones up a","messageBody":"<div id=\"ygrps-yiv-486648162\">-=-Thanks for listening to me ramble on. I tend to be long-winded.  <br/>\nSorry!=-<br/>\n<br/>\nLong isn&#39;t bad, but if you can use smaller paragraphs or break those  <br/>\nbig ones up a bit, it will be easier for others to read and skim back  <br/>\nthrough to what they wanted to comment on.  Also, keep different  <br/>\ntopics in different threads.  That will help you and readers and  <br/>\ncommenters all.<br/>\n<br/>\nI have this on boredom:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n<br/>\nShe&#39;s young and her understanding of the world is not the same as an  <br/>\nolder child/teen/adult, so don&#39;t expect reminders that she had fun  <br/>\nlast month to make her feel better now.  This might help you think  <br/>\nabout that:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/piaget\">http://sandradodd.com/piaget</a><br/>\n<br/>\nAccording to Piaget&#39;s take (My words, for unschoolers, about Piaget&#39;s  <br/>\ntheories, which are not the only ones out there), she&#39;s in one of  <br/>\nhalf&#39;n&#39;half-both of these stages of cognitive ability:<br/>\n<br/>\n&quot;Preoperational&quot; stage: language use to age 7, more or less.<br/>\nIdeas begin to form about things that can&#39;t be seen. The names of  <br/>\nthings are sorted out, and differences and similarities are important  <br/>\nto them. Speech can get ahead of concepts, though. A child who can  <br/>\ntalk about time in hours or days or weeks can&#39;t really conceptualize  <br/>\nit or use it as well as he will later. Parents expect too much too  <br/>\noften, of children this young. Try to respect their imaginary friends  <br/>\nor their theories of how the world might work. Don&#39;t discourage their  <br/>\nfantasies.<br/>\n<br/>\n&quot;Concrete Operations&quot;: age 7 to puberty, give or take.<br/>\nIdeas start to be more realistic and logical. They might want to  <br/>\ndiscuss things longer than the parents like. Parents should tough this  <br/>\nstage out. A huge amount of learning is taking place, and the child&#39;s  <br/>\ninternal model of the universe is starting to form up. You can help!<br/>\n<br/>\n--------------------------<br/>\n<br/>\nRather than suggesting things for her to do, YOU could do things that  <br/>\nshe might want to join in on for a moment or longer, or just watch.   <br/>\nOr put a happy, musical video on while she&#39;s thinking of something to  <br/>\ndo, or get some new art supplies and put them out where she can see a  <br/>\nmovie while she&#39;s working on them.  There are lots of ideas here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/youngchildren\">http://sandradodd.com/youngchildren</a> (some will be &quot;too young&quot; but many  <br/>\nwill not be)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":330448208,"authorName":"KaitKalKenz3@aol.com","from":"KaitKalKenz3@...","profile":"kaitkalkenz3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"&quot;Mom, I&#39;m bored!&quot; and What to say that we do all day?","postDate":"1252591951","msgId":47202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzAwMzdERjFFRkQ0My0zN0E4LTIxNDAxQHdlYm1haWwtZDA4My5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":47203,"prevInTime":47201,"nextInTime":47203,"topicId":47202,"numMessagesInTopic":0,"msgSnippet":"I just started unschooling my children a few weeks ago. My older two children, 16 and 14, have no problem finding things that interest them and learning about","messageBody":"<div id=\"ygrps-yiv-249207596\">I just started unschooling my children a few weeks ago. My older two children, 16 and 14, have no problem finding things that interest them and learning about them. However, my youngest, 7, is constantly telling me that she is bored. I just don&#39;t understand it because she has many, many things to do at our home as well as the many outings that we go on. She has to be doing something 24/7 or she is bored. How do you all handle if your child tells you that she/he is bored? I give her many suggestions of things that she or we can do. She usually says &quot;no&quot; to most if not all of them. She whines and cries but she doesn&#39;t want to do any of my suggestions. So I ask her if she has any suggestions and the answer is always &quot;I don&#39;t know&quot;. I am with her almost every waking moment of her day so it&#39;s not that she isn&#39;t getting enough attention. Sometimes I feel that she may be getting too much attention because she doesn&#39;t seem to want to do anything on her own. I told her that we have done so much this year. We&#39;ve gone to Florida to Disney World and the beach. We&#39;ve gone to the Cleveland Zoo. We went to Amish Country. We&#39;ve gone bowling, to parks, playgrounds, picnics, Lake Erie beaches, library programs, festivals, fairs, a pottery painting place in town, other community events, and the list goes on. Does anyone have any suggestions of what I can do when she continually tells me that she&#39;s bored? It happens at least once every day or two. And when I saw once, I mean that she whines and cries about being bored for an hour or more until she finally finds something to do, agrees to one of my suggestions, or forgets that she was bored.<br/>\n<br/>\nMy second question has to do with what to tell people that ask what we do everyday. My mother and sister weren&#39;t thrilled with my decision to unschool. My sister is actually not speaking to me, if you can believe that. It&#39;s unbelievable. She&#39;s choosing not to speak to me or see her nieces and nephew because she doesn&#39;t agree with my decision to unschool. My mother is supporting me even though she doesn&#39;t agree. I think that she&#39;s afraid that she won&#39;t be able to see her grandkids if she doesn&#39;t which tells me how little she knows me. I would never keep my kids from seeing their grandmother or their aunt. Anyway, I was telling her about McKenzie&#39;s &quot;being bored&quot; problem. I should have never done that because her response was that McKenzie wouldn&#39;t be bored if she were in school. That is not true because McKenzie was STILL bored when she was in school. Then my mother asked me what we do all day. I paused before starting to answer but she cut me off and said &quot;nothing....you don&#39;t do anything&quot;. I told her that I paused because it is really too hard to explain. I told her that we aren&#39;t sitting there doing schoolwork at home. She asked me how McKenzie was going to learn spelling and math. I told her that McKenzie is learning spelling and math all the time. McKenzie can read and write. If she doesn&#39;t know a word in a book, I have her spell it and try to sound it out or give her a clue to help her figure it out. Also, when she is writing she asks me to spell words that she doesn&#39;t know so she IS learning to spell all the time. As far as math, she is learning that as well. When we are cooking, I let her help me measure ingredients, for example, if we need 2 cups of flour but I give her a 1/2 cup measuring cup, then we figure out how many 1/2 cups will make 2 whole cups. We also learn math with money when she saves her money and we go shopping. I told my mom that she is learning constantly all the time. And she surprises me all the time by asking me questions that I do not know either (and I&#39;m a high school graduate, lol)<br/>\n<br/>\n<br/>\n. When she does, we come home and look them up on the internet and if we want to know more, we go to the library to get books about the topic. <br/>\n<br/>\nI am really amazed at how much she is learning on her own. My problems are just what to do when she tells me she&#39;s bored because she has to be doing something every minute but she doesn&#39;t like my suggestions and she has no suggestions of her own AND how to explain to my Mom what unschooling really is? I told her that I could give her some books on it or she can look on the internet. I&#39;m just getting tired of having to justify my actions to her. Why isn&#39;t she asking my sister &quot;Why do you make your son go to school? What is he learning everyday?&quot;. I know that the many times that I&#39;ve picked him up from school and asked how school was and what did he learn, he&#39;s said &quot;okay and nothing&quot;.<br/>\n<br/>\nThanks for listening to me ramble on. I tend to be long-winded. Sorry!<br/>\n<br/>\nSherri<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":18284,"nextTopicId":47227}}