{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"wild planet","postDate":"1060231648","msgId":78064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MS4xNmQ1MmVhMy4yYzYzMzNlMEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":78063,"nextInTime":78065,"topicId":78064,"numMessagesInTopic":0,"msgSnippet":"FOR IMMEDIATE RELEASE Calling All Kids:  Wild Planet Combs the Country for Kid Inventors Kid Inventor Challenge Turns Kids Ideas into Real Toys! (SAN","messageBody":"<div id=\"ygrps-yiv-1062878642\">FOR IMMEDIATE RELEASE<br/>\n<br/>\nCalling All Kids:  Wild Planet Combs the Country for Kid Inventors Kid<br/>\nInventor Challenge Turns Kids&#39; Ideas into Real Toys!<br/>\n<br/>\n(SAN FRANCISCO, May 2003) - No one knows more about toys than kids do -<br/>\nit&#39;s their area of expertise!  Which is why every year, Wild Planet goes<br/>\nstraight to the source of toy ingenuity with Kid Inventor Challenge, the<br/>\ncontest that invites kids across the country to submit their ideas for<br/>\nthe coolest, most innovative playthings imaginable.<br/>\n<br/>\nKid Inventor Challenge is open to kids ages 6-12 and has an annual<br/>\ndeadline of October 31- Halloween.  Kids enter by drawing, naming and<br/>\ndescribing their toy idea and sending it to Wild Planet with their<br/>\nparent or guardian&#39;s approval.  Whether entries arrive as part of a<br/>\nclass project, or as a solo submission, kids have the chance to win<br/>\ngreat prizes and possibly have their idea turned into a real toy.<br/>\n<br/>\nOne hundred winners will become Wild Planet toy consultants for one<br/>\nyear. This honor includes the responsibilities of being among the first<br/>\nkids to play with new toys and receiving secret sneak peeks at products<br/>\nbefore they are available to the public.  Kids get to keep all the toys<br/>\nthey review and are given other special Wild Planet prizes as initiation<br/>\nto the Kid Inventor Team.<br/>\n<br/>\nThe top 10 finalists are showered with the full range of Wild Planet<br/>\ntoys, and also act as kid consultants.  One of the top 10 winners will<br/>\nearn the ultimate prize of having his or her idea turned into a real<br/>\ntoy, and will collect royalty checks for every unit sold for the life of<br/>\nthe product!<br/>\n<br/>\nKid Inventor Challenge is Wild Planet&#39;s way of championing kids and<br/>\nexemplifying that kids&#39; ideas are important and their opinions matter -<br/>\nespecially when it comes to toys!  By engaging kids in the &quot;how-to&quot;<br/>\nprocess of toy development, from brainstorming and design to prototypes<br/>\nand promotion, kids get to see how a toy grows from an idea into a<br/>\nproduct. They dabble in mathematics, problem solving, and writing along<br/>\nthe way and learn that subjects such as geography, science and language<br/>\nare involved in the making of toys.<br/>\n<br/>\nAccompanied by a corresponding curriculum that helps educators and<br/>\nparents guide kids through each step of toy invention, Kid Inventor<br/>\nChallenge is a hands-on tool for learning, teaching and inventing at<br/>\nhome or in school. Plus, it&#39;s tons of fun!<br/>\n<br/>\nWild Planet received thousands of entries in last year&#39;s Kid Inventor<br/>\nChallenge, and is expecting an increase in submissions for the 2003<br/>\ncontest. Beginning July 15, entry forms (and curriculum) can be<br/>\ndownloaded for free<br/>\nat www.kidinventorchallenge.com.   All entries must be mailed by Friday,<br/>\nOctober 31, 2003, to:<br/>\n<br/>\nWild Planet&#39;s Kid Inventor ChallengeT 2003<br/>\nPO Box 194087<br/>\nSan Francisco, CA  94119-4087<br/>\n<br/>\nWild Planet&#39;s kid-invented and other products are available nationwide<br/>\nat more than 8,000 toy, specialty, on-line, mail-order and department<br/>\nstores,including: Toys &#39;R&#39; Us, Target, Zany Brainy, FAO Schwarz,<br/>\nLearning Express,and toysrus.com.   For more information on Kid Inventor<br/>\nChallenge, please visit www.kidinventorchallenge.com, or call the Kid<br/>\nInventor Challenge hotline at 1-800-247-6570 x183.<br/>\n<br/>\nAbout Wild Planet Toys<br/>\nFounded in 1993 in San Francisco, Wild Planet Toys creates innovative<br/>\nproducts that appeal to both parents and kids.  Wild Planet focuses on<br/>\nfun without relying on violence, and involves kids in the creation<br/>\nprocess of all of its toys.  Through monthly Toy Opinion Panels and an<br/>\nannual Kid Inventor Challenge contest, Wild Planet connects with kids<br/>\nand turns their ideas into real toys -- toys that encourage active<br/>\nimaginations and dynamic play.  For more information on Wild Planet and<br/>\nits Spy GearT, Undercover GirlT, Room GearT, Off the MapT, WaterballT<br/>\nand Outdoor AnticsT brands, please visit www.wildplanet.com.<br/>\n<br/>\nContact:<br/>\nKim Bratcher<br/>\n(415) 705-8300 x139<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bratcher@...\">bratcher@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":78063,"nextTopicId":78059}}