{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":24,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363712915","msgId":71027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpYTYyaisyMWRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU1ODkuNTk5YzNhNC4zZTc5MGQ3ZkBhb2wuY29tPg=="},"prevInTopic":71026,"nextInTopic":0,"prevInTime":71026,"nextInTime":71028,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"... School kids say things like that to each other. I remember comments like that from when I was a schoolgirl, decades ago - about kids who had to check in,","messageBody":"<div id=\"ygrps-yiv-2106948883\">AngelOvFaith@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; One girl the same age  called her &quot;pathetic that you have to let your mom <br/>\n&gt; know&quot;. For some reason  this is seen this way and i&#39;m not sure why.<br/>\n<br/>\n </span></blockquote>School kids say things like that to each other. I remember comments like that from when I was a schoolgirl, decades ago - about kids who had to check in, girls who couldn&#39;t wear make-up and shorts skirts, that sort of thing. The &quot;right answer&quot; in school circles is to then complain about how horrible one&#39;s parents are and plot ways around them. That might be useful information to pass on to your daughter, that if she wants to blend in a bit more, she could complain about &quot;having to&quot; check in with you. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;she <br/>\n&gt; would rather be  inside drawing or on the computer or doing something with <br/>\n&gt; me <br/>\n&gt; than playing  with these children who knock for her after school <br/>\n<br/>\n </span></blockquote>If she doesn&#39;t want to play and doesn&#39;t want to hurt their feelings, she can say she has to do homeschool right now - she didn&#39;t get her work done in time. Again, that makes her seem a little more &quot;normal&quot; in the eyes of other kids - not the homeschool part, but the fact that she&#39;d be expected to finish school work before playing with friends. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;a lot of them dont  &quot;get&quot; what unschooling <br/>\n&gt; is and think that &quot;homeschooling&quot; is a luxury we have  taken because I&#39;m <br/>\n&gt; not <br/>\n&gt; working. <br/>\n<br/>\n </span></blockquote>And they&#39;re right - homeschooling Is a luxury and unschooling even more so. There are places it&#39;s not possible, places it&#39;s not legal. And even in places where it&#39;s easy to home/unschool not everyone can pull together enough resources to do so.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":459359078,"authorName":"D. Regan","from":"D. Regan &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363708306","msgId":71026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5MEI2MDk0LThBRTAtNDJEOC05NDAwLTVCNDM0RjlCNDlDRUBiaWdwb25kLmNvbT4=","inReplyToHeader":"PDcwOTAuNWMwYWZhY2EuM2U3OTFlMGZAYW9sLmNvbT4=","referencesHeader":"PDcwOTAuNWMwYWZhY2EuM2U3OTFlMGZAYW9sLmNvbT4="},"prevInTopic":71021,"nextInTopic":71027,"prevInTime":71025,"nextInTime":71027,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"... Those kinds of experiences can result in strong bonds forming.  I think of the types of relationships that can form in war zones.  People can form strong","messageBody":"<div id=\"ygrps-yiv-1950142213\"><blockquote><span title=\"ireply\">&gt; -=- ...I DO know my daughter, she and I have been through hell and back together, are best  friends...  -=-<br/>\n<br/>\n </span></blockquote>Those kinds of experiences can result in strong bonds forming.  I think of the types of relationships that can form in war zones.  People can form strong bonds through the shared experience, through finding comfort in each other when others do not understand or relate to what they have been through.<br/>\n<br/>\nHowever people who have lived through those kinds of experiences as children, in which the adults around them are frequently panicking, fearful, angry or bitter, often look back with regret at a &#39;missed&#39; childhood.  They have often put their natural needs aside for extended periods, and functioned on some sort of emergency mode much of the time.<br/>\n<br/>\nChildren prosper when parents are able to provide enough sense of safety, calmness and support, that feelings of peace and joy are close at hand.  From there the business of childhood - exploring and learning about the world can progress unimpeded by stress.  Stress is a distraction from the natural flow of curiosity, focus, joy, excitement, engagement, creativity, emotional awareness, learning...<br/>\n<br/>\nThe more peace and mindfulness I bring in my home, the more all those good things swirl around.<br/>\n<br/>\nDebbie.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363704004","msgId":71020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4NDlGM0ZDLThBOTctNDVGQS1CQzE2LTM5MzBEQjRBODkzNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDcwOTAuNWMwYWZhY2EuM2U3OTFlMGZAYW9sLmNvbT4=","referencesHeader":"PDcwOTAuNWMwYWZhY2EuM2U3OTFlMGZAYW9sLmNvbT4="},"prevInTopic":71019,"nextInTopic":71021,"prevInTime":71019,"nextInTime":71021,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"-=-while there may have been indications for some to re examine unschooling as a whole, I must respond with, I DO know my daughter, -=- If you re not","messageBody":"<div id=\"ygrps-yiv-1585700179\">-=-while there may have been indications <br/>\nfor some to re examine unschooling as a whole, I must respond with, I DO <br/>\nknow my daughter, -=-<br/>\n<br/>\nIf you&#39;re not interested in examining unschooling as a whole, this list won&#39;t be helpful to you, nor will you be an asset to the list.<br/>\n<br/>\nIt&#39;s not about your daughter.  It&#39;s about the principles of unschooling.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363697106","msgId":71021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTE3My1EUzEwNUI0RTkzOUM0RTlBNjZCODlBNURDNEU5MEBwaHguZ2JsPg==","inReplyToHeader":"PDcwOTAuNWMwYWZhY2EuM2U3OTFlMGZAYW9sLmNvbT4=","referencesHeader":"PDcwOTAuNWMwYWZhY2EuM2U3OTFlMGZAYW9sLmNvbT4="},"prevInTopic":71020,"nextInTopic":71026,"prevInTime":71020,"nextInTime":71022,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"I think it sounds like you and your daughter are having an exciting adventure together.  I would imagine she s learning a ton of life lessons in being a part","messageBody":"<div id=\"ygrps-yiv-1092421499\">I think it sounds like you and your daughter are having an exciting adventure together.  I would imagine she&#39;s learning a ton of life lessons in being a part of this divorce and watching you become an advocate for yourself.  As long as you are able to maintain an upbeat, fun attitude about it I can imagine the two of you having lots of fun finding creative ways to save money and have fun on a small budget.  I grew up without a lot of money and I was fortunate that my parents were pretty creative and we didn&#39;t feel deprived for the most part (of physical pleasures, definitely longed for love and attention).  That creativity came out of a need to stretch a dollar but it is a gift that still permeates my life.  There is a sense of power and contentedness from  knowing how to survive on a budget and from making your own things, whether that be graham crackers, clothing and accessories, finding something that other people think is garbage and giving it new life or whatever.  I remember my parents saving old candles and melting down the wax to make colorful new ones.  I remember having a sense of wonder and excitement when looking at that box of old candles.  What kind of wonderful creations would we make from those raw materials?  There is a reality show called &quot;Dirty Money&quot; where two NYC brothers take street finds and discarded items and give them the most amazing new lives.  There are some scenes here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://dsc.discovery.com/tv-shows/other-shows/videos/dirty-money-cart-for-sale.htm&lt;http://dsc.discovery.com/tv-shows/other-shows/videos/dirty-money-cart-for-sale.htm\">http://dsc.discovery.com/tv-shows/other-shows/videos/dirty-money-cart-for-sale.htm&lt;http://dsc.discovery.com/tv-shows/other-shows/videos/dirty-money-cart-for-sale.htm</a>&gt;<br/>\n<br/>\nI am a people pleaser myself and I do not feel like I have a responsibility to share the details of our lives with other people.  I don&#39;t feel like I have the strength or confidence to announce to folks &quot;Hey we&#39;re doing something different over here!&quot; cuz most folks find that to be very threatening to their own status quo.  99% of the time when it comes up I just tell people that we homeschool.  Most people get an overwhelmed look in their eyes just thinking about the idea and they do not want to hear more.  People have a preconceived idea of what homeschooling is so I just let them make that assumption.  Only one time have I been pressed for more information and that was at an event at a friend&#39;s house when two moms cornered me and asked how it was going.  I like both of the women and consider them friends so I felt comfortable to open up to them.  The main thing they wanted to know was &quot;do they listen to you?&quot;.  When I said &quot;no&quot; and explained that we are taking a different approach you could see the relief in both mom&#39;s eyes.  What they were really saying to me was &quot;I can&#39;t make my children mind me and I&#39;m going to feel like an utter failure if you tell me that you have.&quot;  I explained to them a bit about the unschooling philosophy and they both felt reassured that there was no secret way I had stumbled onto to make the children obedient.  <br/>\n<br/>\nSo I would say have fun with your daughter and try not to get drawn into detailed conversations about unschooling with people.  I portray an air of &quot;this is working for us, we are happy and we are not soliciting opinions on the matter&quot;.  It&#39;s easy for me to portray that because that&#39;s how I feel.  The more I believe in myself, my instincts and my ability to take care of my family the stronger I feel within myself.  Let your daughter&#39;s laughter and joy wash over you like a healing balm and take pride in knowing that you have given her the opportunity to feel that sense of safety and happiness.  You have a lot to be proud of!!  And lots and lots of great memory making opportunities ahead of you!<br/>\n<br/>\nBest of luck,<br/>\nCass<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363660520","msgId":71019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZEMzAxRjVGLTdBRUQtNDI2QS1BNjg3LUQ0ODBBOTI1QzI5NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU3NGEuMjdmNjlmY2MuM2U3OTBlMWZAYW9sLmNvbT4=","referencesHeader":"PDU3NGEuMjdmNjlmY2MuM2U3OTBlMWZAYW9sLmNvbT4="},"prevInTopic":71018,"nextInTopic":71020,"prevInTime":71018,"nextInTime":71020,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"-=-I agree, ever since children have started being given cell phones, my own included, there are unwritten rules to follow.  -=- If you think of it as being","messageBody":"<div id=\"ygrps-yiv-2071857232\">-=-I agree, ever since children have started being given cell <br/>\nphones, my own included, there are unwritten rules to follow.  -=-<br/>\n<br/>\nIf you think of it as being courteous and considerate, it&#39;s not about rules.<br/>\n<br/>\n-=-All parents of  any orientation may talk with their children about this. -=-<br/>\n<br/>\nAny parent who has not talked to a child about phone courtesy shouldn&#39;t be letting the child use a phone.<br/>\n<br/>\n-=-I even knew as a  child when i got a private line for my room. -=-<br/>\n<br/>\nKnew that there was etiquette involved?  Knew that there were times when it was too late to call?<br/>\n<br/>\n-=-I just prefer parents to come to me before taking it out on the children involved or taking phones away.-=-<br/>\n<br/>\nIt&#39;s none of your business, though, what other parents do with their own children.  <br/>\n<br/>\nWhen a child has been rude here, I more often speak directly to the child than the parent.  Sometimes it&#39;s because I don&#39;t want the kid to get into trouble with a parent who punishes. Sometimes it&#39;s because I don&#39;t think the parent is very good at helping them out.   <br/>\n<br/>\nNo parent has an obligation to deal with any other parent.  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363657744","msgId":71018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwOTAuNWMwYWZhY2EuM2U3OTFlMGZAYW9sLmNvbT4="},"prevInTopic":71017,"nextInTopic":71019,"prevInTime":71017,"nextInTime":71019,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"===It must be difficult living with so much doubt. I think it would help to step back from the idea of unschooling if you re not able to feel confident that","messageBody":"<div id=\"ygrps-yiv-1157810765\">===It must be difficult living with so much doubt. I think it would help to <br/>\n step back from the idea of unschooling if you&#39;re not able to feel <br/>\nconfident that  what you&#39;re doing is awesome for your daughter. Step back from a big <br/>\nidea like  unschooling and take smaller steps that you can feel confident <br/>\nof. Sometimes  people get so caught up in the big picture that they&#39;ve heard <br/>\nabout, that they  miss all the little things that come together to make the <br/>\nbig picture. Without  their own little things building their own big <br/>\npicture, they can find themselves  trying to live someone else&#39;s big picture, not <br/>\nreally understanding why, unable  to *know* that it makes sense or to feel <br/>\nconfident about it.<br/>\nTake more time  to really see and get to know your daughter. What does your <br/>\ndaughter love to  do?, what makes her light up with joy?, what does she <br/>\ntalk about at night when  all is quiet? Can you help her explore those things, <br/>\nhelp her feel delight and  joy many times a day. If she has lived with a lot <br/>\nof chaos, it will help if you  listen sensitively, as she begins to become <br/>\nmore aware of her own feelings and  desires.====<br/>\n <br/>\nWhile I do appreciate the recap of my posts of insecurities from 2012  year <br/>\non... i realize i havnt posted anything positive on here since my divorce,  <br/>\nand turn of life events, which is quite different form who i am and how i <br/>\ncame  to be here on this list form meeting a lot of people at a conference, <br/>\nwhile  i was very happy and positive.  while there may have been indications  <br/>\nfor some to re examine unschooling as a whole, I must respond with, I DO  <br/>\nknow my daughter, she and I have been through hell and back together, are <br/>\nbest  friends and havnt been apart at all in years except for an occasional <br/>\nsleepover  (which im usually hosting) or girl scout camp. I can say yes to all <br/>\nthe  questions about knowing what she wants, like and dlights in. that I do <br/>\nhonestly  believe the only reason Im going through the doubts and fears that <br/>\nI am have  been due to geographically where we were placed, and now living, <br/>\nand that  unschooling DOES work and thrive IN our home, and the reason i <br/>\ndeal with so  many naysayers is because the other single mothers or neighbors <br/>\naround me  couldnt imagine not having school to fall back on so they can <br/>\nhave their kids be  somewhere so they may continue drinking, drugging and <br/>\nsleeping around. doing  things with their children simply to see them light up <br/>\nwith joy like taking them  to see a christmas tree lighting (lol) is not <br/>\nsomething they care to do or  bother to attend even when i bring their children <br/>\nwith me, and if i hadnt  fallen on rough times finacially and been placed in <br/>\nsuch an area of  poverty, grief and rampant drug use, and people who are <br/>\nnothing like me, if we  were perhaps able to be around a community of other <br/>\nhomeschoolers, let alone  unschoolers, i doubt i would have to answer to as <br/>\nmuch as i do. there is a group  pending now waiting to be approved to start off <br/>\nthat is a branch of unschoolers  in a suburban area of my city but we are <br/>\nstill waiting as there is no train or  bus to that suburban area for that. I <br/>\ndo listen, we are sensitive, and im not  going to put my child in the public <br/>\nschool down the road just to get through my  own uncertainty and money <br/>\nproblems look up, because i DO KNOW we have something  special here, i just dont <br/>\nlike the people we are surrounded by. if i came here  for support seeming <br/>\ntoo negative or fearful its not my intention. <br/>\n-Lynne<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363654253","msgId":71017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVhZTEuMWEwNThiMjYuM2U3OTEwNmRAYW9sLmNvbT4="},"prevInTopic":71016,"nextInTopic":71018,"prevInTime":71016,"nextInTime":71018,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"Robyn, I like that you added a new way to answer for family, for those who love or are truly concerned, and how to handle it delicately. Often I forget and get","messageBody":"<div id=\"ygrps-yiv-524902285\">Robyn, I like that you added a new way to answer for family, for those who  <br/>\nlove or are truly concerned, and how to handle it delicately. Often I  <br/>\nforget and get more defensive with my own mother and tend to whine at her  <br/>\n&quot;mom! <br/>\nwe know what we are doing,&quot; lol, and ive given her all the books i  bought <br/>\nor show her websites, etc. The older relatives get very worried yes,  and <br/>\nthen there are some who have heard about it and know good things.  <br/>\n<br/>\nBefore my grandparents passed I remember on her street there was a house  <br/>\namidst the row homes where a family lived that may have either homeschooled <br/>\n <br/>\nor unschooled, im not sure i wish i had the chance to know them, but it was <br/>\n <br/>\nthe only house where the front porch was a intricate herb garden with  <br/>\npretty twinkly lights and benches and pillows where i would see 3 teens  <br/>\nalways <br/>\nsitting up there reading and hanging out with their parents, they  came <br/>\nover <br/>\nmy grandparents once whiole i was pregnant, and i recall being  fascinated <br/>\nwith their manners and how they were conservatively dressed and  then would <br/>\ngo home, while the rest of the street every stoop was covered  with teens <br/>\nwith beer bottles/cans, cursing, blaring obnoxious music,  sparsely clad <br/>\nclothing on the girls and teen girls carrying crying babies up  and down <br/>\nfrom <br/>\nsouped up cars. im not saying &quot;good&quot; children cant come from  any other <br/>\nthat <br/>\nhome or unschooled families but it made an impact on me. and  its glimpses <br/>\nof <br/>\nwhat im seeing in the 10 year old children in our  neighborhood now. im <br/>\nglad <br/>\nmy daughter is more interested in playing indoors.  I have also <br/>\ncontemplated <br/>\nwriting the family as my mother still gets  christmas cards from them. <br/>\n<br/>\n-Lynne<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363654133","msgId":71016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVhMGUuNGMzMGUzNWIuM2U3OTBmZjVAYW9sLmNvbT4="},"prevInTopic":71015,"nextInTopic":71017,"prevInTime":71015,"nextInTime":71017,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"Yes I did ask her to ask her friends their own times, which may have caused that problem, I know the 2 girls in the situation described had just got new  cell","messageBody":"<div id=\"ygrps-yiv-53343804\">Yes I did ask her to ask her friends their own times, which may have caused <br/>\n that problem, I know the 2 girls in the situation described had just got <br/>\nnew  cell phones  for christmas and were calling one another, since one had  <br/>\n&quot;pinger&quot; with on her phone and they were giggly about it and i should&#39;ve put <br/>\na  stop to it. since this i have asked parents myself and discussed it with <br/>\nthem.  <br/>\n<br/>\n-Lynne<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363653663","msgId":71014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NGEuMjdmNjlmY2MuM2U3OTBlMWZAYW9sLmNvbT4="},"prevInTopic":71012,"nextInTopic":71015,"prevInTime":71013,"nextInTime":71015,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"Yes i would love to read that as well on Robyn s presentation. I agree, ever since children have started being given cell phones, my  own included, there are","messageBody":"<div id=\"ygrps-yiv-940457586\">Yes i would love to read that as well on Robyn&#39;s presentation. <br/>\n <br/>\nI agree, ever since children have started being given cell <br/>\nphones, my  own included, there are unwritten rules to follow. All parents <br/>\nof <br/>\nany  orientation may talk with their children about this. I even knew as a <br/>\nchild  when i got a private line for my room. I just prefer parents to come <br/>\nto <br/>\nme  before taking it out on the children involved or taking phones away. <br/>\n<br/>\nAs  far as social workers, this has always crossed my mind, and elevates my <br/>\nfears.  People have told me this can happen when boxes fill up more than <br/>\nhalf a living  room, or a fridge not being filled with food and drinks. So we <br/>\ntry to mind our  business <br/>\nwhen those things are going on with moving or a monetary issue, and  I <br/>\nagree <br/>\nhow we present ourselves makes a difference. Its always good to be  aware <br/>\nof <br/>\nthe &quot;dark trails&quot; that could happen. I&#39;m glad mentioned that side  of was <br/>\nmentioned<br/>\n<br/>\n-Lynne<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363653503","msgId":71015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1ODkuNTk5YzNhNC4zZTc5MGQ3ZkBhb2wuY29tPg=="},"prevInTopic":71014,"nextInTopic":71016,"prevInTime":71014,"nextInTime":71016,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"yes I am a people pleaser, and when it builds up so much i tend to get a bit confrontational, and that s why i came here to this forum first about this, lol. I","messageBody":"<div id=\"ygrps-yiv-474912288\">yes I am a people pleaser, and when it builds up so much i tend to get a  <br/>\nbit confrontational, and that&#39;s why i came here to this forum first about  <br/>\nthis, lol. I feel the resentment building up and even sometimes dreading  <br/>\nstepping outside to have to engage in a discussion at the elevator our the  <br/>\ncurb. <br/>\nBut i realize that these things will happen whether i see the people  or <br/>\nnot, and its how we conduct ourselves as pointed out in other posts about  <br/>\nrespecting time schedules and so forth. Homeschoolers support <br/>\ngroups-check.,  <br/>\nUnschoolers support group-check. Single parents support groups, only child  <br/>\nsupport groups, divorced parents playgroups, check check check, lol. <br/>\nReading  <br/>\nthrough here, and other places similar always help me renew my confidence  <br/>\nin what we chose and are doing. <br/>\n<br/>\nI agree and they truly dont know how  happy my daughter is. They are only <br/>\nseeing one side of her amongst the  schooled kids on the street who think <br/>\nher <br/>\nmanners, her responsible way she  calls me to go over or inside someones <br/>\nhouse or to let me know if she&#39;s  using a scooter or a bike and to where so <br/>\ni <br/>\ncan see her out the door or  window is being a baby who has no social <br/>\nskills. <br/>\nOne girl the same age  called her &quot;pathetic that you have to let your mom <br/>\nknow&quot;. For some reason  this is seen this way and i&#39;m not sure why. Yet i <br/>\nreally have seen from  experience not to tell these moms what to do about <br/>\ntheir <br/>\nown daughter&#39;s  attitudes, because people dont like it or in some cases <br/>\nwill break out a  baseball bat, lol. We never like to hear what we are <br/>\ndoing <br/>\nwrong with our  children, but I am confident that my child&#39;s social skills <br/>\nwill keep her  safe and attract good people as she gets older. Like me, she <br/>\nwould rather be  inside drawing or on the computer or doing something with <br/>\nme <br/>\nthan playing  with these children who knock for her after school then their <br/>\nmothers have  an opinion of her. <br/>\n<br/>\nI like the comments you offered me to say back. Thank  you very helpful to <br/>\nbe armed with as well as ideas to keep in mind as to why  people are saying <br/>\nonly what they know not really knowing their children. I&#39;m  not mentioning <br/>\nof <br/>\ncourse the other half of parents who always say &quot;oh we  love having her <br/>\nover, she&#39;s so good, she&#39;s the most well behaved girl who  comes over&quot; or <br/>\nsuch <br/>\nstuff. I just say thank you. But a lot of them dont  &quot;get&quot; what unschooling <br/>\nis and think that &quot;homeschooling&quot; is a luxury we have  taken because I&#39;m <br/>\nnot <br/>\nworking. <br/>\n<br/>\nBut to answer your question, my  daughter does get stressed out when she <br/>\nhears these questions or comments,  but about going out? no, we usually <br/>\npick <br/>\nwhat we want to do if an exhibit or  convention comes to town. We LOVE <br/>\nHarry <br/>\nPotter, the books and movies, so we  love to frequent the exhibit and hang <br/>\nout there always seeing new things.  (Its one of the things in New York <br/>\nright <br/>\nnow) and we enjoy the train rides  together as well, talking or reading <br/>\ntogether, walking through the city,  here or new York, if there&#39;s a time we <br/>\nget <br/>\nbored of it, we go home.  <br/>\n<br/>\nFunny i find myself explaining to you, in hopes to give you more insight  <br/>\nbut yet wondering if i do these these things with outside strangers.  <br/>\nBullying <br/>\nis something that can happen in or out of school. To parents and  children <br/>\nalike. But i will definitely try to be more confident when  answering these <br/>\nquestions, raised eyebrows and high pitched endings a to  questions have a <br/>\nway of unnerving me though, i&#39;m working on the armor with  all your help <br/>\nhere, lol thank you:)<br/>\n<br/>\n-Lynne<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363651635","msgId":71012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENUJBOTJELUE4NUEtNEVERC04QTk2LTFFMkY4QzlBMDVFQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDM0NDIuNGM0ZjI3NjMuM2U3OGZkMGRAYW9sLmNvbT4=","referencesHeader":"PDM0NDIuNGM0ZjI3NjMuM2U3OGZkMGRAYW9sLmNvbT4="},"prevInTopic":71011,"nextInTopic":71014,"prevInTime":71011,"nextInTime":71013,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"-=- I tried expressing apologies from each of us to this family and have gotten no response only the gossip we heard. I found that sad because now for whatever","messageBody":"<div id=\"ygrps-yiv-278681736\">-=- I tried expressing <br/>\napologies from each of us to this family and have gotten no response only the <br/>\ngossip we heard. I found that sad because now for whatever real reason she <br/>\nlost this friend, and i have no idea what the little girl was told as to why <br/>\nshe can no longer associate with my daughter. -=-<br/>\n<br/>\nI think it might have been because she called at 10:30.  That might be enough for me, honestly.  <br/>\n<br/>\nI got a phone call at 10:30 Saturday night.  It scared me, because Holly and Marty were both out driving in the desert in other states.  It said Pam Sorooshian.  That still worried me, and there was nobody there by the time I fumbled with the phone.  (I was in bed, but not asleep.)   I called Pam back and she said she had left her phone somewhere, and the person who found it was trying to call the last number called when she got back.  I guess they would&#39;ve said &quot;your friend left her phone here,&quot; and I would&#39;ve called one of her daughters, or her home phone.<br/>\n<br/>\nThat same night, at 12:05, the house phone rang.  The one in our room is LOUD.  It&#39;s an old dial phone.  It was Holly. She and Will were okay, but I didn&#39;t know that for the first minute or two Keith was talking to her.  They were stuck in sand in the Mojave, off on a dirt road.  They were trying to get roadside assistance out there.  Keith was groggy and not being very helpful at first.  I, on the other hand, was filled with fearful adrenaline and hardly slept the rest of the night.<br/>\n<br/>\nHad either of those calls been a child wanting to speak to another child (especially one long asleep who had school the next day), it would have been a major irritation for me.<br/>\n<br/>\n-=-I had spoken with my daughter about not calling schooled friends <br/>\nafter a certain time and to even find out what everyone&#39;s phone time <br/>\nis...-=-<br/>\n<br/>\nYou asked HER to find out?  <br/>\n<br/>\nThat&#39;s too much responsibility for her.  You should be calling instead and arranging play dates, not letting a very young child make phone calls like that, I think.  Unless you know the family VERY well, they shouldn&#39;t need to interact with your daughter directly, nor with ANYone after their child&#39;s bedtime.  <br/>\n<br/>\nMake a guess based on general practices.  Teens probably are in bed at 10:00, and youngest kids by 8:00 or so.  Don&#39;t treat it case-by-case.  Be as courteous as you can be, so that your daughter can see what that looks like in daily practice.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363649532","msgId":71010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2MGYuNWNiMDgzMDAuM2U3OGZkZmNAYW9sLmNvbT4="},"prevInTopic":70995,"nextInTopic":71011,"prevInTime":71009,"nextInTime":71011,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"Colleen, I love what you shared about you son and his schooled friend. Its very inspiring and awesome for the children to learn and know. There are children we","messageBody":"<div id=\"ygrps-yiv-499107799\">Colleen, <br/>\n <br/>\nI love what you shared about you son and his schooled friend. Its very  <br/>\ninspiring and awesome for the children to learn and know. There are children we <br/>\n know like who are respectful of one another that but who do not live  <br/>\nclose by. I love that the parents are mindful of it as well. I do hope my  <br/>\ndaughter can find friends with open minded parents like that. Thank you.<br/>\n <br/>\n-Lynne<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363649293","msgId":71011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NDIuNGM0ZjI3NjMuM2U3OGZkMGRAYW9sLmNvbT4="},"prevInTopic":71010,"nextInTopic":71012,"prevInTime":71010,"nextInTime":71012,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"... happy? Is she engaged? Are you listening to her and her needs rather  than to strangers who want to treat her as a generic thing with generic  needs? ","messageBody":"<div id=\"ygrps-yiv-1421258376\"><blockquote><span title=\"ireply\">&gt;If you need validation, the best one to look to is your daughter. Is  she <br/>\n </span></blockquote>happy? Is she &gt;engaged? Are you listening to her and her needs rather  than <br/>\nto strangers who want &gt;to treat her as a generic thing with generic  needs?<br/>\n <br/>\nJoyce, Yes a lot of these fears were brought to the surface over our recent <br/>\n circumstances in moving, and being a single parent. I try not to show <br/>\nthem, but  there may be times when I could seem frazzled from unpacked boxes or <br/>\na not full  refridgerator, if we are doing low on cash, so maybe this a <br/>\nconcern to some. I  asked my daughter though on this and she stated what she <br/>\nwants, having our own  place to nest and money being tight rather than staying <br/>\nwith people and  having possibilities of other problems that arise from such <br/>\nsituations other  than money. <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;How did you respond to those? Were you defensive? Were you anxious to  <br/>\n </span></blockquote>explain &gt;so they could understand? how would you respond to similar comments  <br/>\nabout same &gt;thing you are confident about? What would your voice sound like?  <br/>\nWhat would your &gt;body language be?<br/>\n <br/>\nI&#39;ve replied with yes we have our things we do at home, and things we do  <br/>\nout. I kept my tone to all those neighbors with a calm even toned voice but <br/>\nit  may have been a bit defensive to the one who thought i was ruining her <br/>\nlife. I  still held steady just chose not to hold conversations with that <br/>\nperson any  longer other than formal hellos. But yes I do see how I need to <br/>\nsound more  confident in some areas as I do get nervous and start thinking they <br/>\nknow better  when that is only my own low self esteem about what ifs not <br/>\nwhat i know about my  daughter. <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m not sure what&#39;s classic about that. She shouldn&#39;t be calling  schooled <br/>\n </span></blockquote>kids that late. &gt;It&#39;s respectful to be aware of other&#39;s needs even  if you <br/>\ndon&#39;t agree with them.<br/>\n <br/>\nI agree, it was only classic to me because it was a mother i trusted to  <br/>\ntalk to me about it not to cut us off. maybe she was waiting for an excuse to  <br/>\nwho knows. I had spoken with my daughter about not calling schooled friends <br/>\n after a certain time and to even find out what everyone&#39;s phone time <br/>\nis...she  was overenthusiastic about talking to the girl and i let it go as a <br/>\nminor  thing when in fact it was not viewed that way. I tried expressing <br/>\napologies from  each of us to this family and have gotten no response only the <br/>\ngossip we heard.  I found that sad because now for whatever real reason she <br/>\nlost this friend, and  i have no idea what the little girl was told as to why <br/>\nshe can no longer  associate with  my daughter. <br/>\n <br/>\n-Lynne<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363573178","msgId":70995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpNXRqcSt1aG8yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhGRkQzODVELUNBQTEtNDI2My05OTNELUFFMjcyRjMxNEY0NUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":70967,"nextInTopic":71010,"prevInTime":70994,"nextInTime":70996,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"Sandra, the presentation was at North East Unschooling Conference but I don t think they routinely record the presentations. The footnotes to the conference","messageBody":"<div id=\"ygrps-yiv-447980936\">Sandra, the presentation was at North East Unschooling Conference but I don&#39;t think they routinely record the presentations.<br/>\n<br/>\nThe footnotes to the conference are here, because it is very important to me to give proper attributions, <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.robyncoburn.blogspot.com/2012/08/unschooling-misconceptions-footnotes.html\">http://www.robyncoburn.blogspot.com/2012/08/unschooling-misconceptions-footnotes.html</a><br/>\nbut they are just your site, Joyce&#39;s and one or two other familiar links, like the &quot;bean dip&quot; defense - except for the really interesting link to the science channel segment about the guy researching psychopaths&#39; brains - so fascinating from an unschooling POV.<br/>\n<br/>\nMy presentation included a power point slide show - but it may not make much sense without the talk. Perhaps I can upload it into the files here. I&#39;ll check.<br/>\n<br/>\nBUT, I will be presenting at Life is Good NEXT year (2014 for posterity) and I hope to present it again. And I believe Mary does have all those recorded.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Robyn, is there a sound recording or online file of your presentation on misconceptions?  <br/>\n&gt; <br/>\n&gt; Your ideas for responses were great, and I&#39;d like to keep them, or link to them if they&#39;re in public already, please.<br/>\n&gt; <br/>\n&gt; Asking them to talk about their kids is a great idea.<br/>\n&gt; <br/>\n&gt; Sometimes I&#39;ve asked them to talk about school, what the liked best, and what the liked least, if it was a situation where I was stuck with them for a while. :-)<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363540259","msgId":70967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGRkQzODVELUNBQTEtNDI2My05OTNELUFFMjcyRjMxNEY0NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtpM21ndStkazRnQGVHcm91cHMuY29tPg==","referencesHeader":"PGtpM21ndStkazRnQGVHcm91cHMuY29tPg=="},"prevInTopic":70965,"nextInTopic":70995,"prevInTime":70966,"nextInTime":70968,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"Robyn, is there a sound recording or online file of your presentation on misconceptions? Your ideas for responses were great, and I d like to keep them, or","messageBody":"<div id=\"ygrps-yiv-963514262\">Robyn, is there a sound recording or online file of your presentation on misconceptions?  <br/>\n<br/>\nYour ideas for responses were great, and I&#39;d like to keep them, or link to them if they&#39;re in public already, please.<br/>\n<br/>\nAsking them to talk about their kids is a great idea.<br/>\n<br/>\nSometimes I&#39;ve asked them to talk about school, what the liked best, and what the liked least, if it was a situation where I was stuck with them for a while. :-)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":459359078,"authorName":"D. Regan","from":"&quot;D. Regan&quot; &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363535551","msgId":70965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCMTRGMTRGLUNFMjQtNEU5NS1COTg1LTUxRDUwQjFEMzU4MEBiaWdwb25kLmNvbT4=","inReplyToHeader":"PDljYWYuNzNlNDhiNy4zZTc0ZmMwN0Bhb2wuY29tPg==","referencesHeader":"PDljYWYuNzNlNDhiNy4zZTc0ZmMwN0Bhb2wuY29tPg=="},"prevInTopic":70962,"nextInTopic":70967,"prevInTime":70964,"nextInTime":70966,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"I remembered that the writer had written posts referring to doubts before, and went and re-read a couple to see if it might help with the situation now. From","messageBody":"<div id=\"ygrps-yiv-1278391177\">I remembered that the writer had written posts referring to doubts before, and went and re-read a couple to see if it might help with the situation now.<br/>\n  <br/>\nFrom January 2012, -=- ...they think strongly that she should be in school. I feel concerned about these remarks. I dont even know where to go from here with this, but i am afraid perhaps of any consequences that could negatively affect her. I see school right now as something that would hinder us both further, but is our situation not prime for unschooling anymore and Im refusing to see it??? -=-<br/>\n<br/>\nFrom August 2012, -=- I dont want to give up, i dont want to stop unschooling and eventually have to give in and send my child back to school. yet little by little i am feeling like a failure in *some* areas and while i do read the posts here every day, i havnt always been able to contribute my thoughts as i would like, wondering if i have a right to chime in as im battling my confidence against some insecurities as a joyful parent. -=-<br/>\n<br/>\nAnd now -=- Why am I so fearful after 2 years of unschooling to the point of checking out this new democratic school just so I can say, &quot;why yes, she has  structure and socialization.&quot; That&#39;s about the only reason I would even consider  it. <br/>\n<br/>\nAre these fears still normal to feel, does any one else have them and if so how do you deal with them? -=-<br/>\n<br/>\nIt must be difficult living with so much doubt.  I think it would help to step back from the idea of unschooling if you&#39;re not able to feel confident that what you&#39;re doing is awesome for your daughter.  Step back from a big idea like unschooling and take smaller steps that you can feel confident of.<br/>\n<br/>\nSometimes people get so caught up in the big picture that they&#39;ve heard about, that they miss all the little things that come together to make the big picture.  Without their own little things building their own big picture, they can find themselves trying to live someone else&#39;s big picture, not really understanding why, unable to *know* that it makes sense or to feel confident about it.<br/>\n<br/>\nTake care to bring a peaceful, mindful attitude to as many moments as you can.  <br/>\n<br/>\nTake more time to really see and get to know your daughter.  What does your daughter love to do?, what makes her light up with joy?, what does she talk about at night when all is quiet?  Can you help her explore those things, help her feel delight and joy many times a day.  If she has lived with a lot of chaos, it will help if you listen sensitively, as she begins to become more aware of her own feelings and desires.<br/>\n<br/>\nBeing well-connected to our children is a fundamental starting point to unschooling.  Starting there helps to build confidence naturally, lessening any need to try to appear confident to others, or to convince them.  <br/>\n<br/>\nDebbie.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363531593","msgId":70962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpNGwwOSsycTQyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpM21ndStkazRnQGVHcm91cHMuY29tPg=="},"prevInTopic":70955,"nextInTopic":70965,"prevInTime":70961,"nextInTime":70963,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"... ************ Just using the word curriculum can go a long way toward reassuring some people. For that matter, in response to comments like the one about","messageBody":"<div id=\"ygrps-yiv-775676833\">&quot;dezignarob&quot; &lt;dezignarob@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I have said things like: &quot;Our personalized curriculum is - or We use - an integrated, highly vocational, individualized learning program that facilitates skills acquisition through deep focus on interests and passions. We&#39;re very happy. I&#39;m not worried.&quot; <br/>\n </span></blockquote>************<br/>\n<br/>\nJust using the word &quot;curriculum&quot; can go a long way toward reassuring some people. For that matter, in response to comments like the one about running around doing things rather than learning at home, you could say something as simple as &quot;it&#39;s in our curriculum.&quot; Another good line, along with &quot;I&#39;m not worried&quot; is &quot;this seems to be working so far&quot;. <br/>\n<br/>\nI&#39;ve said &quot;organic, interest-based curriculum&quot; to other parents and &quot;Arts and science based curriculum&quot; too - the latter most especially on the local form I send in every year. <br/>\n<br/>\nOf course, those kinds of comments by unschoolers could be adding to the lack of general clarity about what unschooling Is - after all, if people like me and Robyn are using a curriculum, then it must be okay ;) <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363500382","msgId":70955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpM21ndStkazRnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMyQTlBRTk4LUQwNzctNDQyMy1CQUQzLTlFNjYzOTU3RTEwOEB2ZXJpem9uLm5ldD4="},"prevInTopic":70943,"nextInTopic":70962,"prevInTime":70954,"nextInTime":70956,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"I ve touched on some of this in my Unschooling Misconceptions presentation. Something that can often be helpful when people are expressing their fears -","messageBody":"<div id=\"ygrps-yiv-960561477\">I&#39;ve touched on some of this in my Unschooling Misconceptions presentation. <br/>\n<br/>\nSomething that can often be helpful when people are expressing their fears - especially when it really is none of their business - is to say &quot;I&#39;m not worried&quot;.<br/>\n<br/>\nThe trick is this works better when you actually aren&#39;t worried. So observe your child and see the learning happening, and the happiness. In the mean time say it with a smile, and maybe a bit of a shoulder shrug, and you aren&#39;t inviting further commentary. <br/>\n<br/>\nAnother thing, is that most people prefer to talk about themselves and their own children/pets/vacation/relatives/operation than to talk about other people. If you can follow up with a question about what they are doing in their life, it may be sufficiently distracting.<br/>\n<br/>\nFor someone persistent, or someone who thinks they know a lot about education and learning, I have said things like: &quot;Our personalized curriculum is - or We use - an integrated, highly vocational, individualized learning program that facilitates skills acquisition through deep focus on interests and passions. We&#39;re very happy. I&#39;m not worried.&quot; <br/>\n<br/>\nJust mash up those key words - integrated, vocational, skills, focus, personalized - very helpful. <br/>\n<br/>\nFor someone who has a reason to love your child particularly like an actual relative, it can be helpful to think of it as you reassuring them that all will be well, and you know what you are doing.    <br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.blogspot.com<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; What isn&#39;t normal is hearing weekly comments. I&#39;m wondering if your fears are too close to the surface? It sounds like others may be picking up on your doubts which triggers their concerns. Which is then fueling your fears further.<br/>\n&gt; <br/>\n&gt; If you&#39;re doing something unconventional and project uncertainty people will pick up on it. It makes you seem unsure which will draw people to offer commentary and advice.<br/>\n&gt; <br/>\n&gt; If you need validation, the best one to look to is your daughter. Is she happy? Is she engaged? Are you listening to her and her needs rather than to strangers who want to treat her as a generic thing with generic needs?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363461404","msgId":70943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxNjhCREM4LUM4MDMtNDg4My05RUVCLUMzOUU4RTVFOTJEMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtpMjJzbytsN2NqQGVHcm91cHMuY29tPg==","referencesHeader":"PGtpMjJzbytsN2NqQGVHcm91cHMuY29tPg=="},"prevInTopic":70941,"nextInTopic":70955,"prevInTime":70942,"nextInTime":70944,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"-=-Another thing to ask is do you think those things never happen in real life? Again, you don t need to explain anything - and if you have a tendency to be","messageBody":"<div id=\"ygrps-yiv-201388163\">-=-Another thing to ask is &quot;do you think those things never happen in real life?&quot; Again, you don&#39;t need to explain anything - and if you have a tendency to be apologetic or lack confidence you Shouldn&#39;t explain anything as it will set you up for more unsolicited advice. But a question like that can do a lot to show people they&#39;re making assumptions based on stereotypes rather than reality. -=-<br/>\n<br/>\nSometimes just saying &quot;What do you mean?&quot; can stump them.   Don&#39;t say it in a mean way, just a request for clarification.  Very often the other person is using a phrase he&#39;s heard (such as &quot;what about socialization&quot;?) and hasn&#39;t thought about At All.   <br/>\n<br/>\nAnd if they DO come back with an actual point they&#39;ve thought up inependently and you hadn&#39;t thought of it, you could say &quot;Hmmm.  I hadn&#39;t though of that.&quot;  It will make them feel better, and give you time to think of what to say the next time you meet with that person, if it comes up again.  <br/>\n<br/>\nAnother tactic is to ask &quot;Have you read much about unschoolers?&quot; or &quot;Are we the only unschoolers you know?&quot;<br/>\n(Or homeschooling, if the discussion is at that level and not particularly about unschooling.)<br/>\n<br/>\nThey will say something that might turn to a conversation, or they might say that you are the only ones, in which case you can nod and go &quot;Hmmm...&quot; in such a way that hints that it&#39;s understandable, then, that your questioner doesn&#39;t have a clue. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363460785","msgId":70941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBNTVFOTlBLUMwQ0ItNDYzOS1CODc0LTE5OTZGNUY2MDk5QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDFFMzc4QUNCLThGMUYtNENGOS04QUM3LTRBRUUzODBBNjkxN0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PDljYWYuNzNlNDhiNy4zZTc0ZmMwN0Bhb2wuY29tPiA8QzJBOUFFOTgtRDA3Ny00NDIzLUJBRDMtOUU2NjM5NTdFMTA4QHZlcml6b24ubmV0PiA8MUUzNzhBQ0ItOEYxRi00Q0Y5LThBQzctNEFFRTM4MEE2OTE3QGNvbWNhc3QubmV0Pg=="},"prevInTopic":70938,"nextInTopic":70943,"prevInTime":70940,"nextInTime":70942,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"-=-But if my son ever forgot her early bedtime and wanted to go visit or call their house late at night, it d be my job as his partner to make sure he didn t -","messageBody":"<div id=\"ygrps-yiv-1828741226\">-=-But if my son ever forgot her early bedtime and wanted to go visit or call their house late at night, it&#39;d be my job as his partner to make sure he didn&#39;t - her parents would be upset (understandably so!) and that would put their play-time together at risk. Similarly, last weekend when she came to play she was all smiles when she came in, telling us that she had headed out the door an hour earlier and her mom caught her and reminded her that &quot;Robbie doesn&#39;t run as early as you do...&quot; :-) <br/>\n... Respect and mindfulness can go a long way with neighbors and friends, just as it does with kids :-) -=-<br/>\n<br/>\nDisrespect and carelessness doesn&#39;t go far, though, and it can&#39;t easily be undone.  <br/>\n<br/>\nWhen a friendship isn&#39;t nurtured and protected it can die.  Worse, if it is destroyed carelessly, it can go past a quiet neutral death to an antagonism and negativity that could, frankly, be dangerous to the freedoms of an unschooling family.  <br/>\n<br/>\nThough some people hop and hoot about freedom when they&#39;re telling others how easy it is to be unschoolers (then they forget, it seems, to talk about learning at all, or about how to unschool... just &quot;how to be unschoolers,&quot; how to join their happy hoppin&#39; hootin&#39; club and Be FREE!), here&#39;s something real that they&#39;re pretending doesn&#39;t exist:<br/>\n<br/>\nNobody has the right to disturb other people&#39;s sleep.   Not adults, not kids.  Since telephones have been invented, the etiquette that goes with them is not to call when others might be sleeping.  An unexpected late-night telephone call now, like a telegram 100 years ago, is likely to mean there&#39;s an emergencydeath, jail, car accident.   And a housephone is likely to wake up everyone in the house, which is triply or quadruply (I don&#39;t know adjectives for more than four rudenesses at once) rude.  <br/>\n<br/>\nPLEASE don&#39;t say or do things that cause your children to think they are exempt from societal expectations outside of going to school.  Not going to school is a big one, of course, and if a family opts out, they should replace that with something way better than school.   And if a family goes further, to radical unschooling, it shouldn&#39;t show outside the house.  It shouldn&#39;t involve illegalities or disturb the peace.<br/>\n<br/>\nDon&#39;t assume that your children will grow up and live in unschooling world.  They are now, and will be, living in the real world.  There isn&#39;t a fantasy world to go to, even though a small subset of unschoolers are trying to magically attract one.  What they&#39;re attracting is more people with a wimpy grasp on reality.<br/>\n<br/>\nHelp your children be whole, thoughtful, impressive people, not wild children who irritate others.<br/>\n<br/>\nEncouraging anything other than a whole, thoughtful, impressive presence isn&#39;t going to impress any neighbors or inlaws. Sometimes neighbors and inlaws who are unimpressed call social workers.<br/>\n<br/>\nEncouraging anything other than a whole, thoughtful, impressive presence isn&#39;t going to impress any social workers or judges.  Sometimes social workers and juges who are unimpressed tell a family to put their kids in school.  In especially unattractive situations, they might just put the children with another family.<br/>\n<br/>\nVery rarely do I go down the negative trails this way, but there ARE such trails.  <br/>\nI like to hope that discussions and links to information about being positive, helpful, useful, happy and considerate can get a family to the point that they&#39;re nowhere near the dangerous cliffs.  <br/>\n<br/>\nPeople with enough money to put kids in expensive alternative schools or move to other countries might find it easier than a family whose only option is that public school down the road.   <br/>\n<br/>\nLive responsibly.  Be a good partner to your child.  Do things as a team (you&#39;ll do most of the thinking and doing, when they&#39;re young) that will cause the neighbors to like you, not to complain and avoid you, if you can.  <br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: a new &#39;democratic&#39; school, & influences & fears","postDate":"1363447512","msgId":70938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpMjJzbytsN2NqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDljYWYuNzNlNDhiNy4zZTc0ZmMwN0Bhb2wuY29tPg=="},"prevInTopic":70937,"nextInTopic":70941,"prevInTime":70937,"nextInTime":70939,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"... That s a lot of commentary on your life from strangers. It leads me to think you re not very good at projecting self-confidence and maybe are a bit of a","messageBody":"<div id=\"ygrps-yiv-1116311929\">AngelOvFaith@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;i still <br/>\n&gt;  get a weekly comment from a neighbor, sometimes an elderly adult, <br/>\n&gt; sometimes a  mother of a child on the block she is playing with, and the worst was <br/>\n&gt; from a  college student who was a guest at a friend&#39;s house we were at, that <br/>\n&gt; gets under  my skin. <br/>\n<br/>\n </span></blockquote>That&#39;s a lot of commentary on your life from strangers. It leads me to think you&#39;re not very good at projecting self-confidence and maybe are a bit of a &quot;people pleaser&quot; or don&#39;t like to offend people. That&#39;s not an innately bad thing - but there&#39;s some skill involved in being able to say &quot;mind your own beeswax&quot; in a way that&#39;s non-confrontational. <br/>\n<br/>\nDon&#39;t set people up to comment in a negative way on your lifestyle. Be positive about your life with your daughter, positive about what she&#39;s doing. Project a sense of assurance that what you&#39;re doing is what&#39;s right for you and your family - in fact, you might want to join some kind of homeschooling support group (online maybe) where other moms will tell you a bazillion times &quot;you&#39;re doing what&#39;s right for your family&quot; and &quot;you&#39;re a great mom&quot; if you feel like you&#39;re lacking in the confidence department. There is a value to that kind of support sometimes! Learn all those stock phrases homeschoolers and others with alternative lifestyles use and bolster yourself with them. If it helps, get mad at the way schools limit kids&#39; worlds so you can look at your child and confidently say &quot;yes, this is Better than school&quot;.<br/>\n<br/>\nThis really isn&#39;t a problem of unschooling or even homeschooling, it&#39;s about being visible as a minority. You need to learn some minority survival/pride skills - it&#39;s not your job to educate the masses about homeschooling, it&#39;s not your job to defend homeschooling, it&#39;s not your job to be a poster mom for the home-ed movement. It is your job to support your kid, so she can stand up under the onslaught of &quot;homeschoolers are stupid and unsocialized&quot;. She needs to see and hear you standing up for her against ignorance and discrimination.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;You are ruining <br/>\n&gt; her  life by running her around the city every day and not giving her any  <br/>\n&gt; structure!<br/>\n<br/>\n </span></blockquote>Does your daughter seem unhappy or stressed out? It sounds like you&#39;re out and about a lot - way too much for my daughter, but Mo&#39;s a pretty solid introvert. If your kid is happy being out and about that much, then it&#39;s important that you find a way to shut down those sorts of comments so your aquaintances don&#39;t feel like they have a right to say them. If you want, you could offer a reading list with titles like &quot;Unschooling: how to use the whole world as your child&#39;s classroom&quot; - not with the expectation that they&#39;ll actually read anything, but with titles which will make a point (and later you can ask &quot;did you read any of those books?&quot; and shut down the conversation that way). Or you could say something like &quot;she&#39;s too inquisitive for dull old bookwork - she learns much better this way&quot; (with Ray I used to say &quot;he&#39;s such an Active Boy, being in a desk was torture - he&#39;s doing So Much Better since we pulled him out&quot; and with Mo: &quot;Oh, she&#39;s Such an Independent learner it&#39;s all I can do to keep up with her&quot;). Or if you want to be a bad-ass you could rant about how incarcerating children who should be actively exploring the world in concrete boxes all day is tantamount to child abuse and you won&#39;t subject your kid to that kind of treatment (or something similar, look around on facebook and you&#39;ll find something). That won&#39;t win you any friends, but it might stop the conversation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&quot;...but it&#39;s a rite of passage to get bullied at school, or not  <br/>\n&gt; invited to the popular girl&#39;s birthday party. she NEEDS to learn these things  <br/>\n&gt; and you are babying her by not letting her go through them. she&#39;s going to be <br/>\n&gt;  stunted as an adult and not know how to cope with things.&quot; <br/>\n<br/>\n </span></blockquote>My dad has come up with stuff like that periodically. One way to respond is to ask something like &quot;do you think we spend all day at the kitchen table doing workbooks? Because that&#39;s not our life at all.&quot; That&#39;s sometimes enough, right there - you don&#39;t have to describe your life, just letting people know they&#39;re operating on a stereotype rather than real information is very helpful.<br/>\n<br/>\nAnother thing to ask is &quot;do you think those things never happen in real life?&quot; Again, you don&#39;t need to explain anything - and if you have a tendency to be apologetic or lack confidence you Shouldn&#39;t explain anything as it will set you up for more unsolicited advice. But a question like that can do a lot to show people they&#39;re making assumptions based on stereotypes rather than reality. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":439465581,"authorName":"Robert and Colleen","from":"Robert and Colleen &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363447506","msgId":70937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFMzc4QUNCLThGMUYtNENGOS04QUM3LTRBRUUzODBBNjkxN0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEMyQTlBRTk4LUQwNzctNDQyMy1CQUQzLTlFNjYzOTU3RTEwOEB2ZXJpem9uLm5ldD4=","referencesHeader":"PDljYWYuNzNlNDhiNy4zZTc0ZmMwN0Bhb2wuY29tPiA8QzJBOUFFOTgtRDA3Ny00NDIzLUJBRDMtOUU2NjM5NTdFMTA4QHZlcml6b24ubmV0Pg=="},"prevInTopic":70934,"nextInTopic":70938,"prevInTime":70936,"nextInTime":70938,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"****and a classic was about me - Her daughter called my daughter at 10:30 on a school night!  I m not allowing them to speak anymore! **** My 10 year old has","messageBody":"<div id=\"ygrps-yiv-1285132976\">****and a classic was about me - &quot;Her daughter called my daughter at 10:30 on a school night!  I&#39;m not allowing them to speak anymore!&quot;****<br/>\n<br/>\nMy 10 year old has a friend who lives in our neighborhood, and who attends fourth grade at the public school in town.  <br/>\n<br/>\nHe knows that weekdays she&#39;s only available occasionally in the afternoons and evenings to play, as often she has homework and chores to do, and she is in bed by 8 PM.  <br/>\n<br/>\nWeekends, she is awake and ready to play by 8 AM, but she knows that he usually isn&#39;t awake and ready to play til closer to 10 AM :-)<br/>\n<br/>\nSometimes when they talk, I&#39;ve heard them comparing their schedules - she finds it amazing that he&#39;s &quot;allowed&quot; :-) to stay up late at night and doesn&#39;t have a mandatory bedtime - and she finds it funny (in a happy way :-)) that when she arrived at our house one recent morning when school was canceled due to snow, to see if he wanted to go sledding, he was still in his pajamas having breakfast, while she&#39;d been up and active for hours.  <br/>\n<br/>\nHe, on the other hand, finds it incredible that she can fall asleep so early - and that she has never in her life been allowed to be up past 9 PM, and then only on special occasions in summer when school is out.  She has a huge backpack that she carries to school, and one of her before-bed requirements is that she always have it packed and ready to go for the next day - he asks her how long that takes and what she puts in it and why.  He tells her he doesn&#39;t have homework or heavy books and she says he&#39;s lucky :-)<br/>\n<br/>\nThey are both very happy kids and they talk in a good-natured way about the differences in their lives.  They afford each other a lot of respect, and they have worked out ways to play despite their rather opposite time schedules.  <br/>\n<br/>\nBut if my son ever forgot her early bedtime and wanted to go visit or call their house late at night, it&#39;d be my job as his partner to make sure he didn&#39;t - her parents would be upset (understandably so!) and that would put their play-time together at risk. Similarly, last weekend when she came to play she was all smiles when she came in, telling us that she had headed out the door an hour earlier and her mom caught her and reminded her that &quot;Robbie doesn&#39;t run as early as you do...&quot;  :-) <br/>\n<br/>\nHer parents have never had a conversation with us about any of this - we are very different people living very different lives, but our kids really enjoy each other and I&#39;m happy to know they&#39;re trying as hard as we are to keep things smooth and happy among us all.  Respect and mindfulness can go a long way with neighbors and friends, just as it does with kids :-) <br/>\n<br/>\nColleen <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363418461","msgId":70934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyQTlBRTk4LUQwNzctNDQyMy1CQUQzLTlFNjYzOTU3RTEwOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDljYWYuNzNlNDhiNy4zZTc0ZmMwN0Bhb2wuY29tPg==","referencesHeader":"PDljYWYuNzNlNDhiNy4zZTc0ZmMwN0Bhb2wuY29tPg=="},"prevInTopic":70933,"nextInTopic":70937,"prevInTime":70933,"nextInTime":70935,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"... While she s still home, while her future still feels like your responsibility, it s natural to have concerns about your decisions. What isn t normal is","messageBody":"<div id=\"ygrps-yiv-322826724\">On Mar 15, 2013, at 6:34 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AngelOvFaith@...\">AngelOvFaith@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are these fears still normal to feel, does any one else have them and if so <br/>\n&gt; how do you deal with them?<br/>\n<br/>\n </span></blockquote>While she&#39;s still home, while her future still feels like your responsibility, it&#39;s natural to have concerns about your decisions.<br/>\n<br/>\nWhat isn&#39;t normal is hearing weekly comments. I&#39;m wondering if your fears are too close to the surface? It sounds like others may be picking up on your doubts which triggers their concerns. Which is then fueling your fears further.<br/>\n<br/>\nIf you&#39;re doing something unconventional and project uncertainty people will pick up on it. It makes you seem unsure which will draw people to offer commentary and advice.<br/>\n<br/>\nIf you need validation, the best one to look to is your daughter. Is she happy? Is she engaged? Are you listening to her and her needs rather than to strangers who want to treat her as a generic thing with generic needs?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Is your Mother teaching you <br/>\n&gt; anything at home that you are going out all the time?&quot; or &quot;You are ruining <br/>\n&gt; her life by running her around the city every day and not giving her any <br/>\n&gt; structure!&quot;,<br/>\n<br/>\n </span></blockquote>How did you respond to those? Were you defensive? Were you anxious to explain so they could understand?<br/>\n<br/>\nHow would you respond to similar comments about something you are confident about? What would your voice sound like? What would your body language be?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  and a classic was about me- &quot;Her daughter called my daughter at <br/>\n&gt; 10:30 on a school night! I&#39;m not allowing them to speak anymore!&quot;. <br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m not sure what&#39;s classic about that. She shouldn&#39;t be calling schooled kids that late. It&#39;s respectful to be aware of other&#39;s needs even if you don&#39;t agree with them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a new &#39;democratic&#39; school, & influences & fears","postDate":"1363386887","msgId":70933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDljYWYuNzNlNDhiNy4zZTc0ZmMwN0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":70934,"prevInTime":70932,"nextInTime":70934,"topicId":70933,"numMessagesInTopic":0,"msgSnippet":"I see since I last logged on, the posts for this thread have stopped but I wanted to post since last night i attended a forum/open house for a new democratic","messageBody":"<div id=\"ygrps-yiv-1286475862\">I see since I last logged on, the posts for this thread have stopped but I  <br/>\nwanted to post since last night i attended a forum/open house for a new  <br/>\n&quot;democratic&quot; school in Philadelphia, at the suggestion of an unschooling <br/>\nparent  I highly respect.<br/>\n <br/>\nThe forum consisted of a rep from a Waldorf school, a Montessorri school,  <br/>\nand a Sudbury school, and much of it was confusing, as I went to learn <br/>\nmostly  about the year old program offered by, (if anyone&#39;s interested in seeing <br/>\nwhat I  mean, the phillyfreeschool.org ), and what they were about. Like the <br/>\nposts I&#39;ve  read, yes this one also is &quot;free from bells, free from grades, <br/>\nfree from tests,  free to learn how they want&quot; program&quot;, but at the cost of <br/>\n10k per year. I  wondered as much as we were highly received there, while my <br/>\ndaughter played  with the other children, how on earth I would pay <br/>\nsomething that I could take  her to Seaworld with twice over or another goal, even <br/>\nif we were  granted financial assistance! <br/>\n <br/>\nMy point for writing is this though-, the area we live in, while urban,  <br/>\ndoes not have any large number of unschoolers in it at all, and no matter how  <br/>\nmany activities we do together and my daughter says loves our life, i still <br/>\n get a weekly comment from a neighbor, sometimes an elderly adult, <br/>\nsometimes a  mother of a child on the block she is playing with, and the worst was <br/>\nfrom a  college student who was a guest at a friend&#39;s house we were at, that <br/>\ngets under  my skin. <br/>\nThey all seem so concerned for my daughter...&quot;Is your Mother teaching you  <br/>\nanything at home that you are going out all the time?&quot; or &quot;You are ruining <br/>\nher  life by running her around the city every day and not giving her any  <br/>\nstructure!&quot;, and a classic was about me- &quot;Her daughter called my daughter  at <br/>\n10:30 on a school night! I&#39;m not allowing them to speak anymore!&quot;. The  <br/>\ncollege student&#39;s attempt to have a full on discussion with me, as she  was <br/>\nfascinated about my choice and that my child was probably unhappy. She  went on <br/>\nto say &quot;...but it&#39;s a rite of passage to get bullied at school, or not  <br/>\ninvited to the popular girl&#39;s birthday party. she NEEDS to learn these things  <br/>\nand you are babying her by not letting her go through them. she&#39;s going to be <br/>\n stunted as an adult and not know how to cope with things.&quot; <br/>\n <br/>\nDo I want my daughter to go through any of those things again and much  <br/>\nmore? NO. But I did get scared by these people&#39;s comments. But not know how to  <br/>\ncope-, I found that funny since she has no idea what we&#39;ve been through in <br/>\nour  own life. Why am I so fearful after 2 years of unschooling to the point <br/>\nof  checking out this new democratic school just so I can say, &quot;why yes, <br/>\nshe has  structure and socialization.&quot; That&#39;s about the only reason I would <br/>\neven consider  it. <br/>\n <br/>\nAre these fears still normal to feel, does any one else have them and if so <br/>\n how do you deal with them?<br/>\n <br/>\nI have been keeping up with posts and know there were some topics on  <br/>\nunsupportive families and more so i&#39;ll reread some of those, but I just wanted  <br/>\nto add that. I dont know how if people see my daughter and i in and out of <br/>\nthe  house attending the Phila. Flower Show, or the local Horror Convention <br/>\nfor the  weekend, instead of wanting to &quot;hang&quot; out on the block with the <br/>\nneighborhood  kids, is damaging to her. Or if we sat in on &quot;school nights&quot; and <br/>\nshe would  talk to other unschooling friends online or we would blast though <br/>\nseasons of  Walking Dead all week to discuss her new actress friend from the <br/>\nshow she  met at the Horror Con, plus the plenty of other things we do or <br/>\nsit in together  and enjoy, ...I&#39;m sure i dont have to ask, but am I stunting <br/>\nher growth??? Wow,  it just is sad to me that i let this fear even seep in <br/>\nfrom these people&#39;s  influences on me. <br/>\n <br/>\n-Lynne, Mom to Faith, (9)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":70998,"nextTopicId":71023}}