{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] The fires above LA   OT","postDate":"1032973166","msgId":9582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2My4xNDdjMTc5Mi4yYWMzNDU2ZUBhb2wuY29tPg=="},"prevInTopic":9579,"nextInTopic":0,"prevInTime":9581,"nextInTime":9583,"topicId":9579,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/25/02 10:14:07 AM, dan@vilter.us writes: ","messageBody":"<div id=\"ygrps-yiv-748343123\">In a message dated 9/25/02 10:14:07 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dan@...\">dan@...</a> writes:<br/>\n<br/>\n&lt;&lt; Imagine a narrow canyon, 600 to 1000 feet high<br/>\nfilled half their height with what appeared to be solid flame. &gt;&gt;<br/>\n<br/>\nwow</div>","specialLinks":[]},{"userId":120688346,"authorName":"Dan Vilter","from":"Dan Vilter &lt;dan@...&gt;","profile":"dvilter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The fires above LA   OT","postDate":"1032970291","msgId":9579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5QjcyRTQzLjcyM0QlZGFuQHZpbHRlci51cz4="},"prevInTopic":0,"nextInTopic":9582,"prevInTime":9578,"nextInTime":9580,"topicId":9579,"numMessagesInTopic":0,"msgSnippet":"The mountains that are burning in LA, that you may have heard about in the news are in the Angelus National forest directly north of the performing arts center","messageBody":"<div id=\"ygrps-yiv-1643077289\">The mountains that are burning in LA, that you may have heard about in the<br/>\nnews are in the Angelus National forest directly north of the performing<br/>\narts center and college where I work in Glendora.  We have been in an<br/>\novercast of smoke for the past two days. Everything is covered in ash.<br/>\nEvery time I approach the theatre there is some awesome display of flames or<br/>\nsmoke columns dominating the view. On Monday afternoon we stood in the<br/>\nparking lot watching 200 year old California oaks being consumed like<br/>\ntorches in just a few minutes. The ridge where the fire line was at that<br/>\ntime is about 2 miles as the crow files. From that perspective, the flames<br/>\nwere as tall as a kitchen match igniting at arms length. Truly humbling. It<br/>\nwas 108 degrees that day and the weather service said that the smoke clouds<br/>\nover our inland valley insulated us from the predicted 110.  In the evening<br/>\nat sunset I was driving to through Glendora, San Dimas, and La Vern to get<br/>\nto a rehearsal at a theatre in Clarermont. There was a solid wall of smoke<br/>\nabove the ridge for the 12 mile drive as the entire valley behind the ridge<br/>\nwas being consumed.  At about 11:00 that night, driving home, there was not<br/>\na place on the mountain range that wasn&#39;t in flames. The entire northern sky<br/>\nwas as bright and orange as the western sky is just a few moments after<br/>\nsunset. I noticed the large tanker helicopters buzzing back a forth from the<br/>\nmountains to the direction of the airport and Puddingstone reservoir. They<br/>\nwere flying at night. It is very dangerous for them to be flying at night.<br/>\nThe only time I have heard of the flight crews working a fire at night is<br/>\nwhen homes are in danger. I stopped in La Vern. I knew of a parking lot<br/>\nbehind a shopping center that have a very nice view of the mountains and<br/>\nthought I could get a good perspective of the range and the fire from there.<br/>\nAs I pulled behind the buildings I meet hundreds of others that had similar<br/>\nideas, including the news trucks. I also noticed that there was about a half<br/>\ndozen helicopters hovering about. I took me a few minutes, at about the time<br/>\nthey were flying away, to figure out that they were news helicopters that<br/>\nhad just finished there live reports for the 11:00 news.  From here it was<br/>\nclear, the entire range was in flames. This range defines the northern<br/>\nboundary of the eastern LA basin. Just a few miles from some of the most<br/>\ndensely packed suburbs and busiest streets of the San Gabriel valley. These<br/>\nare some of the most rugged mountains in the country. Directly in front of<br/>\nme I watched as San Dimas canyon was consumed. Flames hundreds of feet high<br/>\nracing up the canyon walls. Imagine a narrow canyon, 600 to 1000 feet high<br/>\nfilled half their height with what appeared to be solid flame. I couldn&#39;t<br/>\nimagine how any of the homes or stables or camps in that canyon could still<br/>\nbe standing.  This is where the reports say 44 &quot;Cabins&quot; were lost. These<br/>\ncabins are the *homes* for many people. Including a family that was part of<br/>\nour park day group about 5 years ago. I wondered if they had still lived<br/>\nthere. I&#39;m thinking they sold the place about 3 years ago... The dive along<br/>\nFoothill blvd. to the theatre on Tuesday evening saw dozens and dozens of<br/>\nfirefighting vehicles. And trucks full of fire fighters. Fresh clean faces<br/>\ngoing up and tired dirty ones coming down. I Don&#39;t know how they do it. It<br/>\nseems like such an impossible task. On Sunday just a few hours after the<br/>\nfire broke out, I pulled to the side of the road as a forest service Truck,<br/>\na big semi was speeding by with it&#39;s lights and siren going. It was hauling<br/>\na huge, maybe 12 foot wide bulldozer towards the mountains.  Not the usual<br/>\nemergency vehicle needing the right of way. I&#39;ve also seen LA county Sheriff<br/>\ntrucks screaming by towing large trailers, hauling evacuated horses from the<br/>\ncanyon stables.<br/>\n<br/>\nLate yesterday afternoon we got word from the Azusa police that they are<br/>\npreparing to use the college campus where work as an evacuation site if the<br/>\nflames move any further west.<br/>\n<br/>\nThis morning, from our home, about seven miles from the flames, the sunlight<br/>\nis dim and orange from the smoke and you cannot see the mountains at all.<br/>\n<br/>\n<br/>\nFor the past three weeks I have watched as the curve fire burned the south<br/>\nside of the Angelus range above Azusa, recreation area for thousands of<br/>\nAngelenos on any weekend. Now the front range from there east for 12 miles<br/>\nis in flames. These are the mountains that are in my backyard. When I think<br/>\nof the mountains, this is the area I think of. They are the mountains of my<br/>\nyouth.  The deserted mountain roads I ride my bicycle on are now packed with<br/>\nfirefighting people and equipment. And both sides of the road are burned<br/>\ndown to ash. I objectively know that these flames are an integral part of<br/>\nthe ecosystem. Healthy wilderness needs fire to maintain balance but it is<br/>\n*very tough* to watch. It is like watching past generations grow old and die<br/>\nso the new generations can claim there lives and place in this world.<br/>\n<br/>\nWith a tear in my eye, the rebirth begins...<br/>\n<br/>\n-Dan Vilter<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cbsnews.com/stories/2002/09/25/national/main523221.shtml\">http://www.cbsnews.com/stories/2002/09/25/national/main523221.shtml</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.msnbc.com/news/802175.asp?0si=-\">http://www.msnbc.com/news/802175.asp?0si=-</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newsday.com/news/nationworld/nation/wire/sns-ap-wildfires0925sep2\">http://www.newsday.com/news/nationworld/nation/wire/sns-ap-wildfires0925sep2</a><br/>\n5,0,6164139.story?coll=sns-ap-nation-headlines<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://abcnews.go.com/wire/US/ap20020924_2327.html\">http://abcnews.go.com/wire/US/ap20020924_2327.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.signonsandiego.com/news/state/20020924-1313-wst-calwildfires.html\">http://www.signonsandiego.com/news/state/20020924-1313-wst-calwildfires.html</a></div>","specialLinks":[]}],"prevTopicId":9418,"nextTopicId":9560}}