{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] NEWS Homeschooling in Tucson","postDate":"1046209185","msgId":12544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNjEwMWMyZGQxNiRjYjc1YThlMCQ2NTAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDNFNUI5RkM2LjMwNjAyMDFAYWl0YWNjZXNzLmNvbT4gPDAwZTQwMWMyZGNmNCQ1YWU5ZDUwMCQ2NTAxYThjMEBvZW1jb21wdXRlcj4gPDAwZGQwMWMyZGQwNCQ5Y2IwNDJjMCQwOTAwYThjMEB3ZXN0Pg=="},"prevInTopic":12542,"nextInTopic":0,"prevInTime":12543,"nextInTime":12545,"topicId":12537,"numMessagesInTopic":0,"msgSnippet":"Ooh!  Ooh!  Good point! Mary Ellen ... might want to point out to legislators that homeschooled kids on average test out higher than public schooled kids, and","messageBody":"<div id=\"ygrps-yiv-2092788390\">Ooh!  Ooh!  Good point!<br/>\nMary Ellen<br/>\n  ----- snip-----When there&#39;s a threat to require testing in a certain area, homeschoolers<br/>\n  might want to point out to legislators that homeschooled kids on average<br/>\n  test out higher than public schooled kids, and do they really want that fact<br/>\n  widely known?  &lt;g&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] NEWS Homeschooling in Tucson","postDate":"1046195022","msgId":12542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGQwMWMyZGQwNCQ5Y2IwNDJjMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDNFNUI5RkM2LjMwNjAyMDFAYWl0YWNjZXNzLmNvbT4gPDAwZTQwMWMyZGNmNCQ1YWU5ZDUwMCQ2NTAxYThjMEBvZW1jb21wdXRlcj4="},"prevInTopic":12539,"nextInTopic":12544,"prevInTime":12541,"nextInTime":12543,"topicId":12537,"numMessagesInTopic":0,"msgSnippet":"... accountable to the public.  Why should the homeschool parent be accountable to anyone other than self and child? ... the same ... When there s a threat to","messageBody":"<div id=\"ygrps-yiv-1208799911\"><blockquote><span title=\"ireply\">&gt; I disagree.  The public schools are using public money, and should be<br/>\n </span></blockquote>accountable to the public.  Why should the homeschool parent be accountable<br/>\nto anyone other than self and child?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Mary Ellen<br/>\n&gt;   ----- snip----- However, critics say parent-teachers should be held to<br/>\n </span></blockquote>the same<br/>\n<blockquote><span title=\"ireply\"> &gt;   standards that apply to public schools, especially when it comes to<br/>\n&gt;   student achievement testing.<br/>\n<br/>\n </span></blockquote>When there&#39;s a threat to require testing in a certain area, homeschoolers<br/>\nmight want to point out to legislators that homeschooled kids on average<br/>\ntest out higher than public schooled kids, and do they really want that fact<br/>\nwidely known?  &lt;g&gt;<br/>\nTia</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] NEWS Homeschooling in Tucson","postDate":"1046194423","msgId":12539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZTQwMWMyZGNmNCQ1YWU5ZDUwMCQ2NTAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDNFNUI5RkM2LjMwNjAyMDFAYWl0YWNjZXNzLmNvbT4="},"prevInTopic":12537,"nextInTopic":12542,"prevInTime":12538,"nextInTime":12540,"topicId":12537,"numMessagesInTopic":0,"msgSnippet":"I disagree.  The public schools are using public money, and should be accountable to the public.  Why should the homeschool parent be accountable to anyone","messageBody":"<div id=\"ygrps-yiv-1240032215\">I disagree.  The public schools are using public money, and should be accountable to the public.  Why should the homeschool parent be accountable to anyone other than self and child?<br/>\n<br/>\nMary Ellen<br/>\n  ----- snip----- However, critics say parent-teachers should be held to the same <br/>\n  standards that apply to public schools, especially when it comes to <br/>\n  student achievement testing.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":135098343,"authorName":"Peggy","from":"Peggy &lt;durrell@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"NEWS Homeschooling in Tucson","postDate":"1046192070","msgId":12537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNUI5RkM2LjMwNjAyMDFAYWl0YWNjZXNzLmNvbT4="},"prevInTopic":0,"nextInTopic":12539,"prevInTime":12536,"nextInTime":12538,"topicId":12537,"numMessagesInTopic":0,"msgSnippet":"Schooling at home has soared in Pima County By Jennifer Sterba ARIZONA DAILY STAR [PICTURE] The number of home-schooled children in Pima County has grown more","messageBody":"<div id=\"ygrps-yiv-1482360066\">Schooling at home has soared in Pima County<br/>\n<br/>\nBy Jennifer Sterba<br/>\nARIZONA DAILY STAR [PICTURE]<br/>\n<br/>\nThe number of home-schooled children in Pima County has grown more than <br/>\n500 percent in the past decade.<br/>\n<br/>\nThat&#39;s faster than Marana - Arizona&#39;s fastest-growing city.<br/>\n<br/>\nProponents of the expanding effort to keep the classroom at home praise <br/>\nArizona&#39;s shedding of regulations in the mid-1990s that resulted in <br/>\ngiving parents more choice in deciding how, and what, their children <br/>\nlearn. They say Arizona is one of the best states in which to <br/>\nhome-school children.<br/>\n<br/>\nHowever, critics say parent-teachers should be held to the same <br/>\nstandards that apply to public schools, especially when it comes to <br/>\nstudent achievement testing.<br/>\n<br/>\nUntil the mid-1990s, Arizona required standardized testing of its <br/>\nhome-schooled students. Legislators did away with that under pressure <br/>\nfrom organized home-school parents.<br/>\n<br/>\nPima County&#39;s numbers reflect that change.<br/>\n<br/>\nIn 1992, Pima County counted 450 home-schooled children. By 1995, 1,401 <br/>\nstudents were home-schooled in Pima County.<br/>\n<br/>\nThat number has ballooned again this year to 2,906, more than 545 <br/>\npercent in the last 10 years.<br/>\n<br/>\nBy comparison, the number of home-schooled children in Pima County grew <br/>\nfaster in the last decade than Marana&#39;s 520 percent growth rate, <br/>\naccording to 2000 census data.<br/>\n<br/>\nThere are more home-schooled children today in Pima County than students <br/>\nenrolled in the Tanque Verde School District this fall - 1,920. Tanque <br/>\nVerde consists of two elementary schools and one junior high school.<br/>\n<br/>\n&quot;Arizona&#39;s one of the best states in the country for this because it <br/>\ntrusts parents to educate their children properly,&quot; said Debbie <br/>\nGubernick, who maintains a Web site for the Sonoran Desert <br/>\nHomeschoolers, a local support group.<br/>\n<br/>\nArizona ranks with New Mexico, California and Nevada as having the least <br/>\nregulation, according to the Home School Legal Defense Association. The <br/>\nnational, nonprofit advocacy organization defends and advances the <br/>\nconstitutional right of parents to direct the education of their children.<br/>\n<br/>\nIt ranks New York, Massachusetts and Rhode Island among the most heavily <br/>\nregulated home-school states. Their laws include requiring parental <br/>\nnotification of intent to home-school, state-approved curriculum and <br/>\nachievement test scores.<br/>\n<br/>\nArizona requires only that parents who want to home-school their <br/>\nchildren age 6 or older notify their county schools superintendent.<br/>\n<br/>\n&quot;We appreciate the fact our curriculum isn&#39;t shoved down our throats,&quot; <br/>\nsaid Shannon Federoff, a former teacher who home-schools three of her <br/>\nsix children. The other three aren&#39;t old enough. &quot;I have a vision of <br/>\nwhere I want the kids to go, and I don&#39;t want to be told how to get there.&quot;<br/>\n<br/>\nFive Pima County home-school support groups offer parents guidance in <br/>\nestablishing a curriculum, seeking legal advice and offering <br/>\nhome-schooled children an avenue for interaction with other <br/>\nhome-schooled students. Those support groups, and about 80 others across <br/>\nthe state, have successfully made themselves heard in the Arizona <br/>\nLegislature.<br/>\n<br/>\n&quot;Parents who make this choice are a very strong contingent in the <br/>\nLegislature,&quot; said Lorrane McPherson, an assistant superintendent for <br/>\nthe Tucson Unified School District. With more than 62,000 students, TUSD <br/>\nis Tucson&#39;s largest school district. &quot;There is no regulation&quot; of home <br/>\nschooling today, she said. &quot;There&#39;s no way to know how these kids are <br/>\nprogressing.&quot;<br/>\n<br/>\nWhile McPherson said she respects the rights of parents to choose how to <br/>\neducate their children, she questions whether the state should hold <br/>\nparents to the same level of accountability as it does public schools.<br/>\n<br/>\nA public school in Arizona that earns a second consecutive <br/>\nunderperforming label risks state intervention on an administrative <br/>\nlevel. Since Arizona bases a large part of its labeling system on <br/>\nresults of the statewide AIMS achievement test and on whether students <br/>\nshow one year&#39;s academic growth, home-schooled families don&#39;t face the <br/>\nsame pressures and risks that public schools do.<br/>\n<br/>\nBut decreasing regulation increases the number of education options <br/>\navailable to parents, proponents say.<br/>\n<br/>\n&quot;The lawmakers in Arizona have come to the conclusion that the more <br/>\nchoices the parents have, the better it&#39;s going to be,&quot; said Jerry <br/>\nMintz, director of the New York-based Alternative Education Resource <br/>\nOrganization. Mintz founded the nonprofit organization in 1989 to <br/>\nfurther non-traditional educational approaches.<br/>\n<br/>\n&quot;The way the public education system has gotten into trouble is <br/>\noverregulation,&quot; Mintz said. &quot;Basically people can&#39;t teach anymore.&quot;<br/>\n<br/>\nTeachers are focusing classroom efforts on what&#39;s necessary for students <br/>\nto pass standardized tests. Yet across the country, home-schoolers <br/>\ncontinue to score in the 85th percentile on standardized tests, Mintz said.<br/>\n<br/>\nLast year, Pima County fifth-grade students had an average math score in <br/>\nthe 56th percentile and an average reading score in the 36th percentile <br/>\non the Stanford 9 - a national standardized test taken by Arizona <br/>\nstudents. Those percentiles mean that 44 percent of students nationwide <br/>\nscored higher in math and 64 percent did better in reading. <br/>\nHome-schooled children in Arizona are not required to take that <br/>\nstandardized test or any other, disallowing a comparison.<br/>\n<br/>\nAs public schools continue to fall short of national standards, <br/>\nalternative means of education such as charter schools and home <br/>\nschooling appear to be more viable solutions, Mintz said.<br/>\n<br/>\nThe effects of the growing home-school movement are also hitting the <br/>\nwallets of Arizona schools, which receive state money based on the <br/>\naverage daily student attendance.<br/>\n<br/>\nSchools are losing roughly $5,000 to $7,000 for each student not sitting <br/>\nin a public classroom. For Pima County, that amounts to between $14.5 <br/>\nmillion and $20.3 million each year.<br/>\n<br/>\nFederoff belongs to the Holy Family Home Educators - Diocese of Tucson. <br/>\nThe home-school organization for Catholic families meets one Friday a <br/>\nmonth at Hoffman Park, near Niven Avenue and East Broadway.<br/>\n<br/>\nThat is one of the many groups relied upon by home-schoolers for student <br/>\ninteraction, including play dates, field trips and classroom discussions.<br/>\n<br/>\nKaitlyn Torgerson, 12, one of more than 200 children from about 50 <br/>\nfamilies participating in Holy Family Educators, said she enjoys the <br/>\nweekly get-togethers and learning at home.<br/>\n<br/>\n&quot;You don&#39;t have to go to school as long and you get to be with your <br/>\nfriends every Friday,&quot; said Kaitlyn, a home-schooled seventh-grader. <br/>\n&quot;It&#39;s an easier load, but you still learn the same amount.&quot;<br/>\n<br/>\nRight now, Kaitlyn, who wants to be a paramedic and a mother, is <br/>\nstudying life science - about pollution and mammals in particular.<br/>\n<br/>\nChildren in the Holy Family Home Educators group recently visited the <br/>\nstate Capitol - one of the group&#39;s members is a former senator. The <br/>\ngroup also has &quot;Mom&#39;s Night Out,&quot; when one parent volunteers to baby-sit <br/>\nwhile the moms get together for some downtime.<br/>\n<br/>\n&quot;I&#39;d like to see more families get involved in support groups,&quot; Federoff <br/>\nsaid. &quot;It makes the difference between successful home schooling and <br/>\nparents throwing up their hands in despair.&quot;<br/>\n<br/>\n* Contact reporter Jennifer Sterba at 573-4191 or at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jsterba@...\">jsterba@...</a>.<br/>\n<br/>\nBack to Story<br/>\n<br/>\nAll content copyright © 1999, 2000, 2001 AzStarNet, Arizona Daily Star <br/>\nand its wire services and suppliers and may not be republished without <br/>\npermission. All rights reserved. Any copying, redistribution, or <br/>\nretransmission of any of the contents of this service without the <br/>\nexpressed written consent of Arizona Daily Star or AzStarNet is prohibited.</div>","specialLinks":[]}],"prevTopicId":12536,"nextTopicId":11954}}