{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":118406848,"authorName":"Joylyn","from":"Joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Something I wrote","postDate":"1038029702","msgId":10926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEREYxMzg2LjgwODAyMDFAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDFhMS5jMWZmOWU3LjJiMGZjNWM3QGFvbC5jb20+IDwzRERGMTE1NS44MDcwMzA4QGVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":10925,"nextInTime":10927,"topicId":10926,"numMessagesInTopic":0,"msgSnippet":"I wrote this and am trying to get it published. It is a true story. Please do NOT forward it. But I thought it relevent. Joylyn ******* Expectations By Joylyn","messageBody":"<div id=\"ygrps-yiv-681804155\">I wrote this and am trying to get it published. It is a true story. <br/>\nPlease do NOT forward it. But I thought it relevent.<br/>\n<br/>\nJoylyn<br/>\n<br/>\n*******<br/>\n<br/>\nExpectations<br/>\n<br/>\nBy Joylyn Fowler<br/>\n<br/>\ncopywrite 2002<br/>\n<br/>\nIt was my first outing alone as a new mom, and I was trying to nurse <br/>\ndiscreetly. After getting my daughter latched on, I looked around--had <br/>\nanyone been watching? Did anyone see me, or any part of me? I\u0019d read <br/>\nabout moms being asked to cover up, go to the bathroom, or leave&would <br/>\nthat happen to me? Sure enough marching directly toward me was an older <br/>\nlady with a scowl on her face.<br/>\nI wanted to run, but Lexie was just now nursing well, so I made myself <br/>\nbe still. Was this woman going to tell me to go someplace private to <br/>\nfeed my baby? Or maybe it was the fact I was a white woman with a dark, <br/>\nobviously bi-racial child. My husband and I had been together for years, <br/>\npeople had been rude to us in the past. One woman, obviously an older <br/>\none like the one coming so quickly toward me, had phoned our house for <br/>\nweeks after our engagement announcement had appeared in the local paper, <br/>\nbegging me not to marry, leaving long messages about the dangers of <br/>\ninterracial marriage. I knew when I married my husband and decided to <br/>\nhave children that racism was going to be something we would <br/>\nencounter\u0014but I had not wanted to encounter it while feeding my newborn <br/>\nbaby.<br/>\nThe woman sat down beside me, and leaned over to get a good look. She <br/>\nwas about 80 and her face was lined, so that her mouth looked like it <br/>\nwas always frowning. I couldn\u0019t tell what she was thinking, but thinking <br/>\nshe was, it was obvious she had something to say and I was sure I didn\u0019t <br/>\nwant to hear it! I remembered once a few years before when I had <br/>\ncomplained to my mother about people giving Mark and me dirty looks. My <br/>\nmother told me that I had a choice. I could be negative, decide that the <br/>\nlook was directed at me, and internalize those negative feelings, <br/>\nbecoming annoyed, angry and upset. My day would be ruined. Or I could <br/>\nmake another choice. I could choose to think that those people were <br/>\nsimply admiring us. That they felt we were a lovely, attractive couple <br/>\nand that it was wonderful that we were together. I could then lift my <br/>\nhead and smile at them.<br/>\nI had followed this advice for years, and I found that it did make a <br/>\ndifference. Sometimes people weren\u0019t giving me a dirty look but were <br/>\nlooking at the price of eggs behind me, or thinking of their job or the <br/>\nlaundry they needed to do. Either way, when I changed my attitude, and <br/>\nsimply lifted my head and smiled, those same people often would smile at <br/>\nme. And if they didn\u0019t, it was still ok, because I was not allowing <br/>\ntheir attitude to affect me\u0014my choice was to simply smile, and walk on. <br/>\nAnd so now, I did the same thing. I simply smiled at her and gazed at my <br/>\nbaby. Then she spoke.<br/>\n\u001cGood for you!\u001d<br/>\nI must have looked confused because she went on, \u001cGood for you for <br/>\nbreastfeeding. So many moms are not breastfeeding today.\u001d<br/>\nI was shocked, but she didn\u0019t notice, she just began to talk. She talked <br/>\nabout her children and how she nursed them all for \u001ca long time, you <br/>\ndon\u0019t want to know how long!\u001d She spoke about how people would get mad <br/>\nbecause she would nurse her babies anywhere. \u001cI would never feed them on <br/>\nthe toilet, when my babies were hungry I would just nurse them.\u001d She <br/>\ntalked about how sad she was when her daughters did not breastfeed her <br/>\ngrandchildren, but she brightened as she spoke about how her <br/>\ngranddaughter was due any day now with her first great-grandchild. She <br/>\nwas leaving next week and hoped to be there before the birth, her <br/>\ngranddaughter wanted her help with the new baby, and with breastfeeding. <br/>\nAnd I sat there, my daughter comfortably in my arms, and this woman, <br/>\nwhom I had prejudged so harshly, smiling at her excitement, and glad <br/>\nthat I had smiled at her.<br/>\nShe talked for a while, but I could tell there was something else she <br/>\nwanted. After a bit Lexie finished and came off the breast with that <br/>\nmilky grin I had already grown to love. The woman smiled at it herself <br/>\nand then, cautiously, asked if she could hold my baby. I hesitated for a <br/>\nminute and then realized this old woman couldn\u0019t get far, and handed my <br/>\ndaughter over to her. With practiced, sure hands, she held Lexie up for <br/>\na minute and told my daughter what a beautiful child she was. Then this <br/>\nstrong woman, who had obviously earned every wrinkle in her face, pulled <br/>\nmy daughter close to her and said, \u001cI think this is how my great <br/>\ngrandchild will look. You see, my granddaughter married a black man. <br/>\nWhat a fuss that was, in my family. Didn\u0019t know I was related to so many <br/>\ndamn fools!\u001d She raised her eyes in disgust. \u001cThey all told my <br/>\ngranddaughter that I\u0019d never allow it, that I was too old to accept a <br/>\nblack grandson-in-law. But I put them straight. I danced at their <br/>\nwedding, when other folks refused to attend. And now I\u0019m going Arizona <br/>\nto see my new grandbaby!\u001d<br/>\nI watched her cuddle my child, and watched my child cuddle into this <br/>\nremarkable woman. After a bit, she gently placed Lexie back into my <br/>\narms, and as she stood, she thanked me for letting her hold my baby.</div>","specialLinks":[]}],"prevTopicId":10922,"nextTopicId":10921}}