{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":94582929,"authorName":"SandyL2002@aol.com","from":"SandyL2002@...","profile":"twogreatkids2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Funeral Help...","postDate":"1172751939","msgId":28142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiZC5jNDM0OTA1LjMzMTgyMDQzQGFvbC5jb20+"},"prevInTopic":28138,"nextInTopic":0,"prevInTime":28141,"nextInTime":28143,"topicId":28121,"numMessagesInTopic":0,"msgSnippet":"DS is 14. My FIL is in the final stages of Alzheimers and will ... I am coming in late on this conversation..  But I feel that if someone doesn t want to go to","messageBody":"<div id=\"ygrps-yiv-1473866431\">DS is 14. My FIL is in the final stages of Alzheimers and will<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; pass within the next few weeks.<br/>\n&gt; &gt; DH is insistant that ds go to  the funral which is about 11 hours<br/>\n&gt; &gt; away. Dh thinks that is is only  right and proper to go to your<br/>\n&gt; &gt; grandfather&#39;s funeral. If for no  other reason then it will make <br/>\n&gt; &gt; his mother (my MIL) who has just  begun chemo for breast cancer <br/>\n&gt; &gt; happy. Dh belives that in life there  are just somethings one has  <br/>\n&gt; &gt; to do. DS does not want to  go.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I am coming in late on this conversation..  But I feel that if someone  <br/>\ndoesn&#39;t want to go to a funeral they shouldn&#39;t its personal for each  one.....  I <br/>\ntoo have nightmares about my grandmother&#39;s funeral. All I can  remember is her <br/>\nlaying in the casket.<br/>\n <br/>\nNow..the only thing I would worry about is 1. Has he ever gone to a  funeral? <br/>\n2. I wouldn&#39;t want his first funeral experience to be with someone  super <br/>\nclose...like his parents..<br/>\n <br/>\nMy sil didn&#39;t and doesn&#39;t go to funerals...even as an adult. It was  just <br/>\nknow that she couldn&#39;t &quot;do&quot; them...  Well she had to go a couple of  years <br/>\nago..her roommate died suddenly...  She actually did okay.<br/>\n <br/>\nIf you can&#39;t agree on something with your husband.. Maybe if he forces him  <br/>\nto go..it would be with the understanding that if he really can&#39;t handle it he  <br/>\ncan get up and go out in the hall..<br/>\n <br/>\nSandy<br/>\n&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;**************************************&lt;BR&gt; AOL now offers free <br/>\nemail to everyone.  Find out more about what&#39;s free from AOL at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205658009,"authorName":"space_and_freedom","from":"&quot;space_and_freedom&quot; &lt;space_and_freedom@...&gt;","profile":"space_and_freedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Funeral Help...","postDate":"1172694470","msgId":28138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzNG9rNisxMGFhbkBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGVzM2NldStyMzRkQGVHcm91cHMuY29tPg=="},"prevInTopic":28133,"nextInTopic":28142,"prevInTime":28137,"nextInTime":28139,"topicId":28121,"numMessagesInTopic":0,"msgSnippet":"... I second the motion. I was going to suggest that being there to say goodbye while the Grandpa is alive would mean more for your son long term. When I was","messageBody":"<div id=\"ygrps-yiv-1827636048\"><blockquote><span title=\"ireply\">&gt; &gt; Julie W in AR &lt;jjjwoolfolk@&gt;<br/>\n&gt; &gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hi all.<br/>\n&gt; &gt;    <br/>\n&gt; &gt; DS is 14. My FIL is in the final stages of Alzheimers and will<br/>\n&gt; &gt; pass within the next few weeks.<br/>\n&gt; &gt; DH is insistant that ds go to the funral which is about 11 hours<br/>\n&gt; &gt; away. Dh thinks that is is only right and proper to go to your<br/>\n&gt; &gt; grandfather&#39;s funeral. If for no other reason then it will make <br/>\n&gt; &gt; his mother (my MIL) who has just begun chemo for breast cancer <br/>\n&gt; &gt; happy. Dh belives that in life there are just somethings one has  <br/>\n&gt; &gt; to do. DS does not want to go.<br/>\n<br/>\n&gt; &quot;Barbara Mullins&quot; &lt;mozafamily@...&gt; wrote:<br/>\n&gt; Even visit the<br/>\n&gt; Grandpa while he is still alive to say good-byes and then be able to<br/>\n&gt; more easily bow out of going to the funeral? <br/>\n<br/>\n </span></blockquote>I second the motion. I was going to suggest that being there to say<br/>\ngoodbye while the Grandpa is alive would mean more for your son long<br/>\nterm. When I was 12 my grandpa was dying of lung cancer. We visited<br/>\nand before we left my Dad told us to say goodbye. I mumbled goodbye,<br/>\nand now wish I had said more (though he was probably beyond hearing at<br/>\nthat point), but I am *very* glad I had at least that little goodbye.<br/>\nHe died while we were on our drive home.<br/>\n<br/>\nAt the funeral, my sister (then 14) looked in the open casket and has<br/>\nregretted that ever since. She cannot remember our Grandpa in life,<br/>\nthe picture of him in the casket is all she sees when she thinks of him.<br/>\n<br/>\nMaybe the trip to say goodbye would mean enough to the MIL to allow<br/>\nyour husband let your son out of the funeral. <br/>\n<br/>\nCould your son stay home with a &quot;baby sitter&quot; and take care of the<br/>\nanimals while *you* go to the funeral. Maybe your husband needs the<br/>\nextra support during this *very* hard time for him.<br/>\n<br/>\nMy condolences.<br/>\n<br/>\nJen<br/>\nspace_and_freedom</div>","specialLinks":[]},{"userId":99936689,"authorName":"Barbara Mullins","from":"&quot;Barbara Mullins&quot; &lt;mozafamily@...&gt;","profile":"mozafamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Funeral Help...","postDate":"1172649246","msgId":28133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVzM2NldStyMzRkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM3OTcuNzIwNzgucW1Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":28130,"nextInTopic":28138,"prevInTime":28132,"nextInTime":28134,"topicId":28121,"numMessagesInTopic":0,"msgSnippet":"... pass within the next few weeks. ... away. Dh thinks that is is only right and proper to go to your grandfather s funeral. If for no other reason then it","messageBody":"<div id=\"ygrps-yiv-1224659899\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Julie W in AR &lt;jjjwoolfolk@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi all.<br/>\n&gt;    <br/>\n&gt;   DS is 14. My FIL is in the final stages of Alzheimers and will<br/>\n </span></blockquote>pass within the next few weeks.<br/>\n<blockquote><span title=\"ireply\"> &gt;   DH is insistant that ds go to the funral which is about 11 hours<br/>\n </span></blockquote>away. Dh thinks that is is only right and proper to go to your<br/>\ngrandfather&#39;s funeral. If for no other reason then it will make his<br/>\nmother (my MIL) who has just begun chemo for breast cancer happy. Dh<br/>\nbelives that in life there are just somethings one has to do.<br/>\n<blockquote><span title=\"ireply\"> &gt;   DS does not want to go.<br/>\n&gt;   He will not stop going on about it.<br/>\n&gt;   I am trying to be sympthetic since I am not going (too many<br/>\n </span></blockquote>animals, no one to care for them and no money for a kennel) and I do<br/>\nunderstand his points:<br/>\n<blockquote><span title=\"ireply\"> &gt; *He hardly remembers his grandfather<br/>\n&gt;   *It might happen over the weekend of his birthday<br/>\n&gt;   *My nephew (my sister&#39;s son) will be here in a few weeks and ds is<br/>\n </span></blockquote>worred about missing<br/>\n<blockquote><span title=\"ireply\"> &gt;    his visit<br/>\n&gt;   *various and other reasons<br/>\n&gt;    <br/>\n&gt;   I&#39;m almost to the point of bribing him to get him to just go and<br/>\n </span></blockquote>make his dad happy. DH sees this as a serious charecter flaw to not<br/>\nwant to put aside his feelings and do what my husband thinks is the<br/>\nright and expected thing in this situation.<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n<br/>\n </span></blockquote>    I feel your pain. We have seen too many deaths in our family in<br/>\nthe last few years. My grandmother (who I was close to) died last<br/>\nJanuary. I didn&#39;t force my 7yo (at the time) to go to the funeral. He<br/>\ndid join us for the dinner afterwards though and he was like a breath<br/>\nof fresh air after all the sobbing at the funeral. I had bought him a<br/>\nnice outfit because at first he said he wanted to go but when we got<br/>\ninto town he told me he really didn&#39;t want see grandma in the box they<br/>\nwere going to put under the ground and he wanted to remember her<br/>\nalive, so I let him stay at his other Grandma&#39;s house. I was in charge<br/>\nof all the funeral arrangements and so he was pretty well aware what<br/>\nwas going on, plus his Grandpa (other family side) had just died a<br/>\ncouple of years earlier. My mom died when he was just a baby so he<br/>\nonly really knows her from pictures but he knows that I miss her.    <br/>\n       <br/>\n<br/>\n     Anyhow, if I were you I would make sure your ds understands that<br/>\nif he goes he is probably going more for his Dad than anyone else.<br/>\nAlthough I&#39;m sure the Grandma will be happy to see him she will be<br/>\nvery busy with all the guests and probably won&#39;t be able to spend much<br/>\ntime with him. Perhaps he could go and see her now? Even visit the<br/>\nGrandpa while he is still alive to say good-byes and then be able to<br/>\nmore easily bow out of going to the funeral? Funerals are for the<br/>\nliving and honestly I wish they would get rid of the whole ordeal and<br/>\nhave just a big family reunion instead, that would make the deceased a<br/>\nlot more happy than the flowers and everyone talking about how good a<br/>\njob the beauticians did on their corpses! <br/>\n   My oldest cat died just a few weeks ago, I cried and cried as he<br/>\npretty basically died in my arms. I knew he was going as he had been<br/>\nsick and lethargic and I could just tell (he was almost 18) but it was<br/>\nstill really painful for me to let go. My son (who&#39;s 8 now, almost 9)<br/>\nwas so very brave and loving and petted him and told him good-bye and<br/>\nthat he was going to miss him (he also petted me a lot and told me he<br/>\nloved me lots.) He has also been petting our other cats more than<br/>\nusual and we talked about it a little and I think he understands that<br/>\ndeath makes live more important and so we must make good use of our<br/>\nlife. So if anything I think him keeping control over not having to go<br/>\nto the funeral was more useful for him than enduring another funeral<br/>\nwould have been. HTH - Barbara</div>","specialLinks":[]},{"userId":283675851,"authorName":"Vida","from":"Vida &lt;vidamel@...&gt;","profile":"riverwolfspirit","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Funeral Help...","postDate":"1172567466","msgId":28130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4NDIyMENBLUQ5OUItNDM3Qy04Mjg0LUYwRkM1RjcyQjEwMEBtYWMuY29tPg==","inReplyToHeader":"PEVBNjhGNEMwLUFCMjktNDQ1Ny04OTU2LTFENEMzOTREMUY0QUBiZWxsc291dGgubmV0Pg==","referencesHeader":"PDc3MTAwNS4zMDAwNC5xbUB3ZWI4MTUxNC5tYWlsLm11ZC55YWhvby5jb20+IDxFQTY4RjRDMC1BQjI5LTQ0NTctODk1Ni0xRDRDMzk0RDFGNEFAYmVsbHNvdXRoLm5ldD4="},"prevInTopic":28128,"nextInTopic":28133,"prevInTime":28129,"nextInTime":28131,"topicId":28121,"numMessagesInTopic":0,"msgSnippet":"When my FIL was dying I told him I wouldn t come to the funeral OR bring the girls.  Personally, I don t agree with the whole funeral thing and I don t go to","messageBody":"<div id=\"ygrps-yiv-1411627578\">When my FIL was dying I told him I wouldn&#39;t come to the funeral OR  <br/>\nbring the girls.  Personally, I don&#39;t agree with the whole funeral  <br/>\nthing and I don&#39;t go to them.  When my father died, he was cremated.   <br/>\nHe didn&#39;t want funerals either.  He didn&#39;t want the people he loved  <br/>\nin an environment where grief begets more grief.  So he wanted us to  <br/>\ngather together at home and celebrate his life.  It was MUCH better  <br/>\nthan dressing in black and diving head-first into that role.  I&#39;m not  <br/>\nbelittling the pain felt with losing a loved one, but I never  <br/>\nunderstood how the whole idea of respect slips into one&#39;s decision to  <br/>\ngo to a funeral or not (among other things).  When we didn&#39;t show up  <br/>\nat my FIL&#39;s funeral, the village freaked out.  They said all sorts of  <br/>\nthings about me.  But in truth, my respect for him runs deep.  Each  <br/>\ntime I look at the things he loved I remember him with love.  I still  <br/>\ngrieve for both my father and my FIL, but there is no need to make it  <br/>\nall public.  Grieving is a very personal process.<br/>\n<br/>\nWhen my grandparents died, to tell you the truth, I didn&#39;t really  <br/>\ngrieve.  I wasn&#39;t that close to them, so just because they were my  <br/>\ngrandfathers doesn&#39;t mean I automatically HAD to feel connected to  <br/>\nthem.  I didn&#39;t and I also didn&#39;t feel much of a loss because they  <br/>\nweren&#39;t in my life more than 3 or 4 times a year (as a child) and  <br/>\nMUCH less as an adult.  If this is how your son is feeling, then  <br/>\nnaturally other things in his life are more important and IMHO I  <br/>\nthink that&#39;s just fine and as it should be.<br/>\n<br/>\nThe *problem* seems to be 100% with DH and the things he&#39;s dealing  <br/>\nwith.  Is he receptive enough right now to listen to your concerns  <br/>\nabout it all?  I know how difficult it can be when the spouse is not  <br/>\nentirely 100% with you.  My DH, for instance, doesn&#39;t have a problem  <br/>\nwith each person deciding where they want to go or not go (funerals)  <br/>\nbut he does freak a bit when he sees the girls playing runescape, or  <br/>\njust being on the computer for more than 3 hours (I am proud to say  <br/>\nthat I got over that one).  As Robin said, you can guilt him into  <br/>\ngoing.  That would appease DH&#39;s issues and *keep peace* in the house,  <br/>\nbut what about DS?  It would seem that if he absolutely had to go  <br/>\nthat it would help if you could be there too.  From your post it does  <br/>\nseem that he is more connected with you, and since he may have to go,  <br/>\nat least he&#39;ll have someone on his side when the relatives with their  <br/>\nown ideas are around.  If he does have to go, can you get someone to  <br/>\ntake care of the animals so you can go too?<br/>\n<br/>\nPlease know that I write my thoughts with the utmost respect.  I am  <br/>\nnot one to pad my words.  I say what I think.  Take what is useful to  <br/>\nyou and chuck the rest.<br/>\n<br/>\nVida</div>","specialLinks":[]},{"userId":171542997,"authorName":"Robin Marcoccia","from":"Robin Marcoccia &lt;randrs01@...&gt;","profile":"robinmaof2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Funeral Help...","postDate":"1172535655","msgId":28128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBNjhGNEMwLUFCMjktNDQ1Ny04OTU2LTFENEMzOTREMUY0QUBiZWxsc291dGgubmV0Pg==","inReplyToHeader":"PDc3MTAwNS4zMDAwNC5xbUB3ZWI4MTUxNC5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDc3MTAwNS4zMDAwNC5xbUB3ZWI4MTUxNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":28125,"nextInTopic":28130,"prevInTime":28127,"nextInTime":28129,"topicId":28121,"numMessagesInTopic":0,"msgSnippet":"I refused to go to my step-grandfather s funeral when I was 15 and thankfully my parents let it ride.  I was not only extremely disturbed by the funeral-thing","messageBody":"<div id=\"ygrps-yiv-142810284\">I refused to go to my step-grandfather&#39;s funeral when I was 15 and  <br/>\nthankfully my parents let it ride.  I was not only extremely  <br/>\ndisturbed by the funeral-thing in general, I was a real introvert and  <br/>\nalso had things to do which at the time seemed really important to me  <br/>\n(my best friend&#39;s 15th b-day for one).  In my estimation,  funerals  <br/>\nare for the living and if your son doesn&#39;t feel it the appropriate  <br/>\nplace to do his grieving , so be it.  I also think that all of the  <br/>\nstress associated with your family and the talk of imminent death can  <br/>\nplay a role in his anxiety level,  as well as the prospect of  <br/>\nspending a few days alone with his dad who obviously isn&#39;t really  <br/>\nconnecting with him.  You can guilt him into going for the sake of  <br/>\nhis father or grandmother, but it sounds as if this would really  <br/>\ndamage his trust in y&#39;all.<br/>\nRobin<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; .<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":135609248,"authorName":"Julie W in AR","from":"Julie W in AR &lt;jjjwoolfolk@...&gt;","profile":"juliewinar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Funeral Help...","postDate":"1172524467","msgId":28125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3MTAwNS4zMDAwNC5xbUB3ZWI4MTUxNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDc4MUJBNTE3LTg5RDYtNDhCRi1CMTVFLTQ2NDM0NzM4ODNENkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":28122,"nextInTopic":28128,"prevInTime":28124,"nextInTime":28126,"topicId":28121,"numMessagesInTopic":0,"msgSnippet":"Hey Sandra, Oops, my bad. Jim is not the son who never visits. Actually those are the only vacations he takes, the ones to visit his family. DS says he does","messageBody":"<div id=\"ygrps-yiv-1825387470\">Hey Sandra,<br/>\n  Oops, my bad. Jim is not the son who never visits. Actually those are the only vacations he takes, the ones to visit his family.<br/>\n  DS says he does not remember his grandfather, BUT pre alzheimer&#39;s we saw them 3 or 4 times a year from about age 5-10 (aprox I&#39;m always iffy on my memory...before that we saw them more often since we lived closer) and dh has taken ds on each trip he has made since fil got sick. He has only been really bad for the last 2 years (and they did stop by the nursing home on those visits) so DS saw him as much as a lot of kids who&#39;s granparents live far away.<br/>\n  BUT he may really not remember him or have bonded with him even though fil was never cold or indifferant to ds. When we saw them fil always spent time playing with ds or doing &quot;farm stuff&quot; like riding on the tractor when we went to their place.<br/>\n  Jim was just there a few weeks ago to spend a week with mil to care for her after her mastectomy since he had vacation time and his brothers who live there did not. and her mother just died (I know, poor woman) and dh even went along with ds&#39;s wishes not to attend that funeral.<br/>\n   <br/>\n  I guess I want to make everyone happy and I can&#39;t.<br/>\n<br/>\n  <br/>\nSandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n          My first thought is that if your husband really cared about the <br/>\nrelationship, he should&#39;ve taken the grandson to be with the <br/>\ngrandfather pre-Alzheimer&#39;s (if that was possible). He didn&#39;t. He <br/>\nprobably feels bad now.<br/>\n<br/>\nThe dad probably wants to be seen (at the funeral) as a good dad by <br/>\nrelatives he hasn&#39;t seen for a while.<br/>\n<br/>\nIF (not saying is, but if) the dad is unconsciously wanting to use <br/>\nthe boy as a prop, that&#39;s not a good idea for the grandson to be there.<br/>\n<br/>\nMaybe the dad feels that way but doesn&#39;t know it.<br/>\n<br/>\nThat might or might not help.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n<br/>\nJulie Woolfolk<br/>\n<br/>\nwww.damngoodvintage.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Funeral Help...","postDate":"1172523606","msgId":28122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4MUJBNTE3LTg5RDYtNDhCRi1CMTVFLTQ2NDM0NzM4ODNENkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDM3OTcuNzIwNzgucW1Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PDM3OTcuNzIwNzgucW1Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":28121,"nextInTopic":28125,"prevInTime":28121,"nextInTime":28123,"topicId":28121,"numMessagesInTopic":0,"msgSnippet":"My first thought is that if your husband really cared about the relationship, he should ve taken the grandson to be with the grandfather pre-Alzheimer s (if","messageBody":"<div id=\"ygrps-yiv-518776998\">My first thought is that if your husband really cared about the  <br/>\nrelationship, he should&#39;ve taken the grandson to be with the  <br/>\ngrandfather pre-Alzheimer&#39;s (if that was possible).   He didn&#39;t.  He  <br/>\nprobably feels bad now.<br/>\n<br/>\nThe dad probably wants to be seen (at the funeral) as a good dad by  <br/>\nrelatives he hasn&#39;t seen for a while.<br/>\n<br/>\nIF (not saying is, but if) the dad is unconsciously wanting to use  <br/>\nthe boy as a prop, that&#39;s not a good idea for the grandson to be there.<br/>\n<br/>\nMaybe the dad feels that way but doesn&#39;t know it.<br/>\n<br/>\nThat might or might not help.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":135609248,"authorName":"Julie W in AR","from":"Julie W in AR &lt;jjjwoolfolk@...&gt;","profile":"juliewinar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Funeral Help...","postDate":"1172520901","msgId":28121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3OTcuNzIwNzgucW1Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PDQ3MjMzNS43NzUwLnFtQHdlYjUwMTA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":28122,"prevInTime":28120,"nextInTime":28122,"topicId":28121,"numMessagesInTopic":0,"msgSnippet":"Hi all. DS is 14. My FIL is in the final stages of Alzheimers and will pass within the next few weeks. DH is insistant that ds go to the funral which is about","messageBody":"<div id=\"ygrps-yiv-1204680755\">Hi all.<br/>\n   <br/>\n  DS is 14. My FIL is in the final stages of Alzheimers and will pass within the next few weeks.<br/>\n  DH is insistant that ds go to the funral which is about 11 hours away. Dh thinks that is is only right and proper to go to your grandfather&#39;s funeral. If for no other reason then it will make his mother (my MIL) who has just begun chemo for breast cancer happy. Dh belives that in life there are just somethings one has to do.<br/>\n  DS does not want to go.<br/>\n  He will not stop going on about it.<br/>\n  I am trying to be sympthetic since I am not going (too many animals, no one to care for them and no money for a kennel) and I do understand his points:<br/>\n*He hardly remembers his grandfather<br/>\n  *It might happen over the weekend of his birthday<br/>\n  *My nephew (my sister&#39;s son) will be here in a few weeks and ds is worred about missing<br/>\n   his visit<br/>\n  *various and other reasons<br/>\n   <br/>\n  I&#39;m almost to the point of bribing him to get him to just go and make his dad happy. DH sees this as a serious charecter flaw to not want to put aside his feelings and do what my husband thinks is the right and expected thing in this situation.<br/>\n   <br/>\n  I&#39;m kinda tired of listening to the constant bitching since the poor man has not even died yet and I find it distasteful to listen to ds discuss when would be the best time for this wonderful person die....but I also want to be a buffer (and allow ds to express his feelings/opinons) between him and my husband so this does not make this painful time worse for my hubby who really is a good father and his dad was just one of the best human beings I have ever known.<br/>\n   <br/>\n  A bit of background. Dh has never bought into unschooling completely and thinks I&#39;ve spoiled ds some and do not require enough of him, but has been for the most part been outwardly supportive/hands off because ds is really a great teen. Ds also has always had a BIG problem with new situations and have come very far I think some of his issue is more about the fact that he has never been to a funeral. <br/>\n<br/>\n<br/>\nJulie Woolfolk<br/>\n<br/>\nwww.damngoodvintage.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":28084,"nextTopicId":28134}}