{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":36,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Dealing with pet death (was Boundaries was: Re: why are terms delight-driven and child-led  frowned apon by","postDate":"1253226891","msgId":47320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNDExMjNBLUQzMjgtNEI2Ni04RkYwLTI5MjU1MTlCNkFDQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc0MDgyOS40NzAzNy5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGg4dG5rbyt0MzhwQGVHcm91cHMuY29tPiA8NzQwODI5LjQ3MDM3LnFtQHdlYjExMDQwOC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":47315,"nextInTopic":47328,"prevInTime":47319,"nextInTime":47321,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"When my kids were little, one of our dogs died.  I found her in the yard.  She looked comfortable, if a little dehydrated (her tongue was out).  I asked Kirby","messageBody":"<div id=\"ygrps-yiv-1647179581\">When my kids were little, one of our dogs died.  I found her in the  <br/>\nyard.  She looked comfortable, if a little dehydrated (her tongue was  <br/>\nout).  I asked Kirby and Marty if they wanted to see her.  Kirby said  <br/>\nyes.  Marty said no.  So Kirby and went out and with all the solemnity  <br/>\nof a funereal viewing, looked at her and talked about death and what a  <br/>\ngood dog she had been.<br/>\n<br/>\nKirby made a painting of her later.  It&#39;s too big to scan.   It was  <br/>\nmostly black.<br/>\n<br/>\nIn 2000, Holly and I were in England and Kirby was home alone one day  <br/>\nwhen our dog accidentally killed one of the kittens our cat had had.   <br/>\nThe dog was moving the kittens to another place.  Her motherly  <br/>\ninstincts were kicking in and she was putting them in a safer room.    <br/>\nOne didn&#39;t survive the dog transfer.  Luckily, he could IM me and I  <br/>\ncould advise him on what to do to protect the others and how to deal  <br/>\nwith the baby kitten.<br/>\n<br/>\nThere&#39;s no sense having possible-dead-pet drills in the absence of  <br/>\ndeath.<br/>\n<br/>\nWhen one of Holly&#39;s rats died, we buried it in the yard, and Keith  <br/>\ngave a very sweet speech.  It suprised me.  He thanked the rat for  <br/>\ngiving his daughter friendship and pleasure, or something like that.   <br/>\nSurprising sweet, for a rodent, coming from a guy like Keith. :-)<br/>\n<br/>\nIf the children trust the parents and the parents are compassionate  <br/>\ntoward the children, it seems fairly easy for shocking moments to work  <br/>\nthemselves out.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Boundaries was: Re: why are terms delight-driven and child-led  frowned apon by","postDate":"1253223616","msgId":47315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0MDgyOS40NzAzNy5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGg4dG5rbyt0MzhwQGVHcm91cHMuY29tPg==","referencesHeader":"PGg4dG5rbyt0MzhwQGVHcm91cHMuY29tPg=="},"prevInTopic":47304,"nextInTopic":47320,"prevInTime":47314,"nextInTime":47316,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... We do this too. I have a 15 yr old and an 8 yr old.  The way that Chamille was raised when she was little is very different than the way in which Margaux","messageBody":"<div id=\"ygrps-yiv-15049468\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I wait for them to show some interest in the topic or to ask questions,because it seems cruel to force the world&#39;s harsh realities upon them just to tell the truth.  Even then, I proceed slowly and carefully.  When they are satisfied, for the moment, we&#39;re done.  When the answers they have no longer satisfy their need to know, we revisit the topic.&gt;&gt;&gt;<br/>\n </span></blockquote>We do this too.  <br/>\nI have a 15 yr old and an 8 yr old.  The way that Chamille was raised when she was little is very different than the way in which Margaux is being raised.  Chamille rarely watched movies geared for older kids, she did a lot of activities designed for her age, but Margaux hasn&#39;t done that as much, largely because she lives in a house with an older child.  She&#39;s seen plenty of pg-13 movies at her young age.<br/>\nMargaux would be the kid at a park day bringing up ideas that are way older than she is, to other kids, simply because of the fact that her world view involves teenagers who talk about all kinds of subjects in front of her and around her.  Sometimes I do censor them and sometimes I tell them to take it to another room, but it doesn&#39;t entirely stop it from happening around Margaux.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Boundaries was: Re: why are terms delight-driven and child-led  frowned apon by","postDate":"1253219436","msgId":47303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0MzQxNC4xMDIzMy5xbUB3ZWIxMTA0MDkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGg4c2ZhaituZGI5QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4c2ZhaituZGI5QGVHcm91cHMuY29tPg=="},"prevInTopic":47296,"nextInTopic":47304,"prevInTime":47302,"nextInTime":47304,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... I can tell you that from my own experience being a child raised in this manner, that the huge amount of sheltering was more harmful in the long run.  My","messageBody":"<div id=\"ygrps-yiv-599551878\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; Besides going and living under a rock, how can I protect my kids from these unnecessary traumas brought upon them by other people.  And I really do mean trauma because the stuff that has been said to them by another child has been horrible.  I feel bad for that child, but I know that I can&#39;t protect them.  I do, however, want to protect mine.&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I can tell you that from my own experience being a child raised in this manner, that the huge amount of sheltering was more harmful in the long run.  My parents sheltered us from everything potentially dangerous.  They were very religious and conservative.  Our social circle only included other religious conservative people that talked about religious conservative things.  <br/>\nWe weren&#39;t allowed to go to other people&#39;s houses without parent approval.  I didn&#39;t even know that there were potential predators in the world.  I was very naive about stuff like that because my parents sheltered us from all of that information.<br/>\nI chose not to do that with my own kids.  I shelter them from mean people as much as possible, but not from ideas and reality.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":94438829,"authorName":"KarriL","from":"&quot;KarriL&quot; &lt;karri_a_lewis@...&gt;","profile":"karri_a_lewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Boundaries was: Re: why are terms delight-driven and child-led  frowned apon by","postDate":"1253214802","msgId":47304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4dTFvaStianJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNBRDdFQzYyLTdEREMtNERFNS1BRTkwLTlDQkI3QTZBQTE2MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47303,"nextInTopic":47315,"prevInTime":47303,"nextInTime":47305,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... Great point! ... That will definitely work with an adult.  I will keep repeating it too, if they keep going because that has happened when I asked them to","messageBody":"<div id=\"ygrps-yiv-1152386232\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; &lt;&lt;&lt;&lt;&lt;Not sending them to school is some protection.  Kids being at school  <br/>\n&gt; are in danger of hearing about things from teachers.&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Great point!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;&lt;&lt;If someone was saying something to my kids when they ere little, I  <br/>\n&gt; would be quick and strong in my objection.  I would signal them and  <br/>\n&gt; shake my head quickly &quot;no!&quot; or I would say, &quot;SO!  you guys want  <br/>\n&gt; lunch?  Let&#39;s change the subject,&quot; and I would go as quickly to the  <br/>\n&gt; noisy person as I could and say &quot;That&#39;s not good to talk about with  <br/>\n&gt; kids who don&#39;t know about it yet; don&#39;t.&#39;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>That will definitely work with an adult.  I will keep repeating it too, if they keep going because that has happened when I asked them to stop.  I will do that.  The problem that I&#39;ve had is that sometimes it comes from a child.  The child clearly seems distressed too.  That is why it is being brought up to some extent, I think.  These are kids that my kids regularly play with and like.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &lt;&lt;&lt;&lt;If it&#39;s someone or a situation where you&#39;re unable to negotiate the  <br/>\n&gt; topics, then distract your kids away from it and go somewhere else for  <br/>\n&gt; a while.&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I guess this is sometimes where I get tripped up because I feel that I have certain responsibilities that make it so that I can&#39;t leave without it being a huge drama.  I also don&#39;t want to hurt my kids.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &lt;&lt;&lt;&lt;You can&#39;t control other people.  You can  make requests or try to be  <br/>\n&gt; persuasive or you can decide to pick new friends, but you cna&#39;t call  <br/>\n&gt; the shots with other peop;e&#39;s lives.  And if you find yourslf needing  <br/>\n&gt; to protect your kids very often, maybe you&#39;re waiting too long to give  <br/>\n&gt; them a kid-version explanation of the thing, or of the euphemism, like  <br/>\n&gt; &quot;putting a dog to sleep.&quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Yes, it&#39;s only in certain situations that I feel the need to protect my kids more than usual.  I know that I can&#39;t control people or situations.  I do address issues a lot with my kids, especially when this stuff comes up.  I just feel like I have to run interference a lot with specific people and some of the issues have been down right shocking.  I have addressed this fact with my kids and they do seem to ignore a lot, but I worry about trauma or how much they are absorbing and exposed to.<br/>\n<br/>\nThanks for your input.  It kind of confirms what I&#39;ve been thinking/doing.<br/>\n-Karri<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"add this quote![AlwaysLearning] Re: why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1253212611","msgId":47296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMTJBQzdBLTdCRDctNDg4Ni05NzU3LUQzMkQwNzc2QURDQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDdhMDlmNDFmMDkwOTE3MDMwMnQ3NTJiYjg0NXhjYzc2OWI0NjUzMGUzZDUzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGg4bzNqdCtsYXJjQGVHcm91cHMuY29tPiA8QkVBQzE4NjktQkNGQS00MjQwLUEyODQtQzhFMkVBMTZENjg1QFNhbmRyYWRvZGQuY29tPiA8Q09MMTAzLVc1NjI3RkIxMDFFMjRGREExNUNCMkRCRkUzMEBwaHguZ2JsPiA8QUM4QUMxNUItMURCRi00NDEyLThGOTAtQjhGMjk1OERFNjVFQFNhbmRyYWRvZGQuY29tPiA8N2EwOWY0MWYwOTA5MTcwMzAydDc1MmJiODQ1eGNjNzY5YjQ2NTMwZTNkNTNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":47292,"nextInTopic":47303,"prevInTime":47295,"nextInTime":47297,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"-=-Hi Sandra: this quote from your response would be great on the randomized quotes:-=- Thanks! I ll add that, then.  I m wounded and in the bed (my leg kind","messageBody":"<div id=\"ygrps-yiv-137593400\">-=-Hi Sandra: this quote from your response would be great on the  <br/>\nrandomized<br/>\nquotes:-=-<br/>\n<br/>\nThanks!<br/>\n<br/>\nI&#39;ll add that, then.  I&#39;m wounded and in the bed (my leg kind of sort  <br/>\nof had a nervous breakdown) and it&#39;s not as easy as it would otherwise  <br/>\nbe.  I just added a Prescott, Arizona group to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/workd\">http://sandradodd.com/workd</a><br/>\nand it was a surprising amount of work at this angle (me, pillows, in  <br/>\nthe bed, computer kind of eased up on its own pillow.... what a  <br/>\nmess.   But I&#39;m enough better than Keith went to work and I stayed  <br/>\nhere with a little bowl of food to go with each dose of ibuprofen.<br/>\n<br/>\nLast night i sat up a few hours.  I&#39;ll try that again later.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195268684,"authorName":"memismommy","from":"&quot;memismommy&quot; &lt;memismommy@...&gt;","profile":"memismommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Boundaries was: Re: why are terms delight-driven and child-led  frowned apon by","postDate":"1253204440","msgId":47292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4dG5rbyt0MzhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1QTU3REY3LTUwQ0YtNEREMy05Nzc3LTlERjVFMEIxRjI2NkB2ZXJpem9uLm5ldD4="},"prevInTopic":47290,"nextInTopic":47296,"prevInTime":47291,"nextInTime":47293,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... This is a personal subject for us....when our oldest son was 22 months old, our second was born and died within 12 days.  He never left the NICU.  There","messageBody":"<div id=\"ygrps-yiv-1284290386\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; There are several good books about death for kids though the only one  <br/>\n&gt; coming to mind is The Tenth Good Thing About Barney. (It&#39;s about the  <br/>\n&gt; child&#39;s cat who died and he and the father come up with 10 great  <br/>\n&gt; things about the cat. It&#39;s a good read even without a pet dying.) If  <br/>\n&gt; you search the archives here for that book -- or at Amazon and read  <br/>\n&gt; the recommendations for other books -- you&#39;ll find some good  <br/>\n&gt; suggestions.<br/>\n<br/>\n </span></blockquote>This is a personal subject for us....when our oldest son was 22 months old, our second was born and died within 12 days.  He never left the NICU.  There was no shielding our living child from the permanence of &quot;no baby brother&quot;, but we did our utmost to keep his life stable and happy...<br/>\n<br/>\nWe found a great book, Goodbye Mousie, by Robie H. Harris...about a boy who wakes up to find his mouse has died...it&#39;s told with humor and gentleness, the art is great, and it doesn&#39;t shy away from the feelings of grief.  It helped our very young child, and, later, his ssister.  she&#39;s 5 now, and the book is still a cherished part of her personal collection.  It&#39;s hard to read without tearing up, but I recommend it for finding a &quot;soft&quot; way to introduce the concept of death.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not sure I&#39;m getting a clear picture of what you&#39;re trying to  <br/>\n&gt; prevent them from hearing about. If this is happening often, then it  <br/>\n&gt; sounds like you&#39;re shielding them too much. If Kathryn had a personal  <br/>\n&gt; connection with someone who died and I hadn&#39;t yet told her I can  <br/>\n&gt; imagine asking she not be told until I could handle it. But  <br/>\n&gt; situations like that are rare. Why are these situations so frequent  <br/>\n&gt; for you?<br/>\n&gt; <br/>\n&gt; &gt; Besides going and living under a rock, how can I protect my kids  <br/>\n&gt; &gt; from these unnecessary traumas brought upon them by other people.  <br/>\n&gt; &gt; And I really do mean trauma because the stuff that has been said to  <br/>\n&gt; &gt; them by another child has been horrible.<br/>\n&gt; <br/>\n&gt; Are your kids finding these stories traumatic? Are they coming home  <br/>\n&gt; upset? Or are they asking questions that you find upsetting to answer  <br/>\n&gt; but aren&#39;t affecting them as much as you?<br/>\n&gt; <br/>\n&gt; All what you&#39;ve written is about you, not about your kids. It&#39;s all  <br/>\n&gt; about you protecting them and your assumption of hurt. But you  <br/>\n&gt; haven&#39;t said anything about your particular unique kids and how they  <br/>\n&gt; feel.<br/>\n&gt; <br/>\n&gt; More specific examples would be helpful. Because all I can imagine is  <br/>\n&gt; you&#39;re living in a very dangerous area full of traumatized families  <br/>\n&gt; and your priority might be getting out of there or finding people who  <br/>\n&gt; are actively creating more peaceful pockets. Or you&#39;re projecting  <br/>\n&gt; your own imagined feelings onto your kids and assuming the stories  <br/>\n&gt; are more traumatizing to them than they really are. If that&#39;s the  <br/>\n&gt; case, your worry may be heightening their reaction. If you&#39;re  <br/>\n&gt; worried, they&#39;ll feel there&#39;s something to worry about when, if you  <br/>\n&gt; had been more objective, they would have noted it and moved on.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n </span></blockquote>My sister shields her children from anything she finds uncomfortable.  The dog went to a new home (adopting away a member of the family seems scarier, to me; I might fear I was next, if I were very young, or just have a lot of confusion).  She routinely removes dead frogs and bugs from view so the children won&#39;t see them...now the children are beginning to ask about death, and she does&#39;t know what to say.<br/>\n<br/>\nWith my children, now 8 and 5, we made a commitment to tell them the truth...in a version they can easily grasp.  I wait for them to show some interest in the topic or to ask questions,because it seems cruel to force the world&#39;s harsh realities upon them just to tell the truth.  Even then, I proceed slowly and carefully.  When they are satisfied, for the moment, we&#39;re done.  When the answers they have no longer satisfy their need to know, we revisit the topic.<br/>\n<br/>\nYour children will tell you (and maybe others, too) what is comfortable for them.  It can be even more frightening, I think, if a parent can&#39;t bring themselves to allow any exposure to the &quot;bad stuff&quot; in life, once the child begins to sense that the bad stuff exists.  How awful must it be if even Mom can&#39;t stand to talk about it?    <br/>\n<br/>\nDeath happens to us all.  It&#39;s often unpredictable, and ultimately, it&#39;s impossible to shield a child from this fact.  For us, it came very early in parenthood, and in a way that could not be ignored.  And, although I wish it hadn&#39;t, my children are joyful and thriving, largely unbothered by their knowledge of death.  As Joyce put it so aptly, they&#39;ve noted it and then moved on.  There&#39;s lots of stuff to do, right now, because they are alive, and life is fun!<br/>\n<br/>\nPeace,<br/>\nShan</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Boundaries was: Re: why are terms delight-driven and child-led  frowned apon by","postDate":"1253197760","msgId":47290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBRDdFQzYyLTdEREMtNERFNS1BRTkwLTlDQkI3QTZBQTE2MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg4c2ZhaituZGI5QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4c2ZhaituZGI5QGVHcm91cHMuY29tPg=="},"prevInTopic":47289,"nextInTopic":47292,"prevInTime":47289,"nextInTime":47291,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"-=-I feel bad for that child, but I know that I can t protect them. I do, however, want to protect mine.-=- Not sending them to school is some protection.","messageBody":"<div id=\"ygrps-yiv-1889743436\">-=-I feel bad for that child, but I know that I can&#39;t protect them. I  <br/>\ndo, however, want to protect mine.-=-<br/>\n<br/>\nNot sending them to school is some protection.  Kids being at school  <br/>\nare in danger of hearing about things from teachers.   Thinking of  <br/>\nwhat things:  child abuse, murder, abortion, in the discussion of  <br/>\ncurrent events.   And the other kids are likely to spill anything they  <br/>\nknow, conversationally, at any time.<br/>\n<br/>\nIf someone was saying something to my kids when they ere little, I  <br/>\nwould be quick and strong in my objection.  I would signal them and  <br/>\nshake my head quickly &quot;no!&quot; or I would say, &quot;SO!  you guys want  <br/>\nlunch?  Let&#39;s change the subject,&quot; and I would go as quickly to the  <br/>\nnoisy person as I could and say &quot;That&#39;s not good to talk about with  <br/>\nkids who don&#39;t know about it yet; don&#39;t.&#39;<br/>\n<br/>\nIf it&#39;s someone or a situation where you&#39;re unable to negotiate the  <br/>\ntopics, then distract your kids away from it and go somewhere else for  <br/>\na while.<br/>\n<br/>\nYou can&#39;t control other people.  You can  make requests or try to be  <br/>\npersuasive or you can decide to pick new friends, but you cna&#39;t call  <br/>\nthe shots with other peop;e&#39;s lives.  And if you find yourslf needing  <br/>\nto protect your kids very often, maybe you&#39;re waiting too long to give  <br/>\nthem a kid-version explanation of the thing, or of the euphemism, like  <br/>\n&quot;putting a dog to sleep.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Boundaries was: Re: why are terms delight-driven and child-led  frowned apon by","postDate":"1253189094","msgId":47289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1QTU3REY3LTUwQ0YtNEREMy05Nzc3LTlERjVFMEIxRjI2NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGg4c2ZhaituZGI5QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4c2ZhaituZGI5QGVHcm91cHMuY29tPg=="},"prevInTopic":47279,"nextInTopic":47290,"prevInTime":47288,"nextInTime":47290,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... The choices shouldn t be every or none, though. What and how something is said should be based on the individual child not on age or some adult vision of","messageBody":"<div id=\"ygrps-yiv-1385945370\">On Sep 17, 2009, at 12:52 AM, KarriL wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m having trouble with this in a different context in my life in  <br/>\n&gt; where I&#39;ve made a decision to hold off telling my little kids, 5  <br/>\n&gt; and 7, certain traumatic life facts like putting animals to sleep,  <br/>\n&gt; shocking events in the news, etc. Basically, I don&#39;t think they  <br/>\n&gt; need to know every gory detail in life right now.<br/>\n<br/>\n </span></blockquote>The choices shouldn&#39;t be every or none, though.<br/>\n<br/>\nWhat and how something is said should be based on the individual  <br/>\nchild not on age or some adult vision of what happy life means. Lying  <br/>\nabout an animal&#39;s death to maintain a vision of a happy life can be  <br/>\nway more damaging than experiencing the warts of life. Exposing a  <br/>\nchild to pictures of dead children because that&#39;s part of life would  <br/>\njust be cruel. There are other choices!<br/>\n<br/>\nWhile some kids are very sensitive, for most kids death isn&#39;t as  <br/>\nscary for them as it is for adults. It doesn&#39;t mean the same thing.  <br/>\nThey aren&#39;t necessarily lacking in understanding -- like at some ages  <br/>\ndeath may be equated with leaving and they assume the person or  <br/>\nanimal will be back some day like Aunt Sally who visits once every 3  <br/>\nmonths (years to a child ;-). They just don&#39;t internalize death the  <br/>\nsame way.<br/>\n<br/>\nThere are several good books about death for kids though the only one  <br/>\ncoming to mind is The Tenth Good Thing About Barney. (It&#39;s about the  <br/>\nchild&#39;s cat who died and he and the father come up with 10 great  <br/>\nthings about the cat. It&#39;s a good read even without a pet dying.) If  <br/>\nyou search the archives here for that book -- or at Amazon and read  <br/>\nthe recommendations for other books -- you&#39;ll find some good  <br/>\nsuggestions.<br/>\n<br/>\nUnless the child is showing an interest in the world and the news, I  <br/>\ndon&#39;t see a reason to show them. I wouldn&#39;t have taken 5 yo Kathryn  <br/>\nto a lecture on Henry Thoreau and I didn&#39;t turn on the news for her.  <br/>\nThey didn&#39;t interest her. At 18, though she has an awareness of  <br/>\nwhat&#39;s going on in the world, I don&#39;t think she&#39;s seen a whole news  <br/>\nprogram just because it isn&#39;t part of her interests.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It seems to me that we seem to be surrounded by insensitive people  <br/>\n&gt; that have no problem telling my kids about these things and  <br/>\n&gt; sometimes its been other same age kids within our own homeschooling  <br/>\n&gt; circle. Even when I&#39;ve told the person that my kids don&#39;t know that  <br/>\n&gt; information, they seem to keep going or ignore it.<br/>\n<br/>\n </span></blockquote>I&#39;m not sure I&#39;m getting a clear picture of what you&#39;re trying to  <br/>\nprevent them from hearing about. If this is happening often, then it  <br/>\nsounds like you&#39;re shielding them too much. If Kathryn had a personal  <br/>\nconnection with someone who died and I hadn&#39;t yet told her I can  <br/>\nimagine asking she not be told until I could handle it. But  <br/>\nsituations like that are rare. Why are these situations so frequent  <br/>\nfor you?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Besides going and living under a rock, how can I protect my kids  <br/>\n&gt; from these unnecessary traumas brought upon them by other people.  <br/>\n&gt; And I really do mean trauma because the stuff that has been said to  <br/>\n&gt; them by another child has been horrible.<br/>\n<br/>\n </span></blockquote>Are your kids finding these stories traumatic? Are they coming home  <br/>\nupset? Or are they asking questions that you find upsetting to answer  <br/>\nbut aren&#39;t affecting them as much as you?<br/>\n<br/>\nAll what you&#39;ve written is about you, not about your kids. It&#39;s all  <br/>\nabout you protecting them and your assumption of hurt. But you  <br/>\nhaven&#39;t said anything about your particular unique kids and how they  <br/>\nfeel.<br/>\n<br/>\nMore specific examples would be helpful. Because all I can imagine is  <br/>\nyou&#39;re living in a very dangerous area full of traumatized families  <br/>\nand your priority might be getting out of there or finding people who  <br/>\nare actively creating more peaceful pockets. Or you&#39;re projecting  <br/>\nyour own imagined feelings onto your kids and assuming the stories  <br/>\nare more traumatizing to them than they really are. If that&#39;s the  <br/>\ncase, your worry may be heightening their reaction. If you&#39;re  <br/>\nworried, they&#39;ll feel there&#39;s something to worry about when, if you  <br/>\nhad been more objective, they would have noted it and moved on.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":383312070,"authorName":"Cara Barlow","from":"Cara Barlow &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: why are terms delight-driven and child-led \tfrowned apon by some unschoolers?","postDate":"1253181738","msgId":47279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdhMDlmNDFmMDkwOTE3MDMwMnQ3NTJiYjg0NXhjYzc2OWI0NjUzMGUzZDUzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEFDOEFDMTVCLTFEQkYtNDQxMi04RjkwLUI4RjI5NThERTY1RUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGg4bzNqdCtsYXJjQGVHcm91cHMuY29tPgkgPEJFQUMxODY5LUJDRkEtNDI0MC1BMjg0LUM4RTJFQTE2RDY4NUBTYW5kcmFkb2RkLmNvbT4JIDxDT0wxMDMtVzU2MjdGQjEwMUUyNEZEQTE1Q0IyREJGRTMwQHBoeC5nYmw+CSA8QUM4QUMxNUItMURCRi00NDEyLThGOTAtQjhGMjk1OERFNjVFQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":47278,"nextInTopic":47289,"prevInTime":47278,"nextInTime":47280,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"Hi Sandra: this quote from your response would be great on the randomized quotes: ","messageBody":"<div id=\"ygrps-yiv-230046247\">Hi Sandra: this quote from your response would be great on the randomized<br/>\nquotes:<br/>\n<br/>\n&lt;&lt;&lt;it&#39;s a common thought that kids&#39; choices will<br/>\nalways be the wildest and craziest, but wild and crazy seem to be<br/>\nreactions to limitations, not to rational assistance!&gt;&gt;&gt;<br/>\n<br/>\nBest wishes, Cara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":94438829,"authorName":"KarriL","from":"&quot;KarriL&quot; &lt;karri_a_lewis@...&gt;","profile":"karri_a_lewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Boundaries was: Re: why are terms delight-driven and child-led  frowned apon by","postDate":"1253163155","msgId":47277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4c2ZhaituZGI5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBOTI1Qjk1LUEzRUUtNDNGQy1BMDAxLTNFNzFDNDBGN0FGQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47270,"nextInTopic":47278,"prevInTime":47276,"nextInTime":47278,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... I m having trouble with this in a different context in my life in where I ve made a decision to hold off telling my little kids, 5 and 7, certain traumatic","messageBody":"<div id=\"ygrps-yiv-1470513874\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Neither hiding death nor bringing it all out and cataloging it is  <br/>\n&gt; &quot;best.&quot;  It depends on the kid, on the necessity to know, on his  <br/>\n&gt; ability to  handle it.  There are times in people&#39;s lives to share and  <br/>\n&gt; times to shelter them.  If my dog had died during the conference I  <br/>\n&gt; wouldn&#39;t have wanted to know.  (One family got a call on Sunday and  <br/>\n&gt; the kids knew on the way home that their dog had been hit by a car; I  <br/>\n&gt; wouldn&#39;t have shared that info in advance, had i been the house- <br/>\n&gt; sitter, or whatever.  I wouldn&#39;t have shared it with the kids if I&#39;d  <br/>\n&gt; been the parent and had gotten that call.)<br/>\n&gt; <br/>\n&gt; I&#39;m all laid up and drugged up today. It wouldn&#39;t be a good time for  <br/>\n&gt; me to get really bad news.  When I&#39;m home, later, then...<br/>\n&gt; <br/>\n&gt; Sandra&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m having trouble with this in a different context in my life in where I&#39;ve made a decision to hold off telling my little kids, 5 and 7, certain traumatic life facts like putting animals to sleep, shocking events in the news, etc.  Basically, I don&#39;t think they need to know every gory detail in life right now.  I don&#39;t think it helps them live a happy or better life.<br/>\n<br/>\nIt seems to me that we seem to be surrounded by insensitive people that have no problem telling my kids about these things and sometimes its been other same age kids within our own homeschooling circle.  Even when I&#39;ve told the person that my kids don&#39;t know that information, they seem to keep going or ignore it.  Yikes!  Besides going and living under a rock, how can I protect my kids from these unnecessary traumas brought upon them by other people.  And I really do mean trauma because the stuff that has been said to them by another child has been horrible.  I feel bad for that child, but I know that I can&#39;t protect them.  I do, however, want to protect mine.<br/>\n<br/>\nThanks for the input.<br/>\n-Karri<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: why are terms delight-driven and child-led frowned apon by some unschoolers?","postDate":"1253152676","msgId":47270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFDOEFDMTVCLTFEQkYtNDQxMi04RjkwLUI4RjI5NThERTY1RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENPTDEwMy1XNTYyN0ZCMTAxRTI0RkRBMTVDQjJEQkZFMzBAcGh4LmdibD4=","referencesHeader":"PGg4bzNqdCtsYXJjQGVHcm91cHMuY29tPiA8QkVBQzE4NjktQkNGQS00MjQwLUEyODQtQzhFMkVBMTZENjg1QFNhbmRyYWRvZGQuY29tPiA8Q09MMTAzLVc1NjI3RkIxMDFFMjRGREExNUNCMkRCRkUzMEBwaHguZ2JsPg=="},"prevInTopic":47258,"nextInTopic":47277,"prevInTime":47269,"nextInTime":47271,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"-=-With my son at home for the past 2 months i decided to stop suggesting when bed time should happen and let him find his own rythym, which of course he","messageBody":"<div id=\"ygrps-yiv-1058593130\">-=-With my son at home for the past 2 months i decided to stop  <br/>\nsuggesting when bed time should happen and let him find his own  <br/>\nrythym, which of course he has...his now taken to going to bed when we  <br/>\ndo...that of course may change again as he does.<br/>\nBut no more policing from me!! what a relief for us all!! =-<br/>\n<br/>\nThis is cool.   I think it&#39;s a common thought that kids&#39; choices will  <br/>\nalways be the wildest and craziest, but wild and crazy seem to be  <br/>\nreactions to limitations, not to rational assistance!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1253137799","msgId":47258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4NTY0Ni42NzE5MC5xbUB3ZWIxMTA0MDEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGg4cjBuMitncm12QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4cjBuMitncm12QGVHcm91cHMuY29tPg=="},"prevInTopic":47251,"nextInTopic":47270,"prevInTime":47257,"nextInTime":47259,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... I don t understand why people frown on delight-driven or child-led learning either.  The idea is that they are the ones choosing what they want to learn.","messageBody":"<div id=\"ygrps-yiv-523267028\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I think strewing is important.  Our children need exposure to all sorts of topics.  Then we let their own interests determine whether they explore it. <br/>\n<br/>\n </span></blockquote>I don&#39;t understand why people frown on delight-driven or child-led learning either.  The idea is that they are the ones choosing what they want to learn.  Isn&#39;t that foundational to unschooling?&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nWell, since Pam has enlightened me with the fact that Delight Driven is actually a religious curriculum name brand, I can totally see a good reason not to use it to describe unschooling.<br/>\nA child choosing what they want to do during the day isn&#39;t the same thing as a child leading daily activities.  That is why &quot;child led&quot; doesn&#39;t appeal to me.  Plus, I seriously do a lot of the leading.  I find things of interest, like strewing a bit, but I search out things that I know without a doubt they want to do or be involved in, and I find ways to make it happen.<br/>\nI like doing that for my kids, finding ways to make things happen.  I figure, by watching and being involved in that process, they&#39;ll eventually do it themselves.  I guess one could say that my children led me to find them activities.  And in some ways that is the case, but I don&#39;t wait around for them to choose something to learn about and let them tell me.  It&#39;s more organic than that.<br/>\nSince we live together and we know each other pretty well, and we talk and explore the world together, I&#39;m pretty in tune with what they are about and want to do, so I bring things to them.  Sometimes it looks like a buffet and sometimes it looks like a simple meal.  They are free to decline anything that I&#39;ve put before them, but mostly they take it up because I find things that I know they&#39;ll like.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1253128885","msgId":47251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGMUUzNzM1LTgzNkItNEQyRi1CNDZDLTA3NDUwNDFGRENBQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg4cjBuMitncm12QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4cjBuMitncm12QGVHcm91cHMuY29tPg=="},"prevInTopic":47249,"nextInTopic":47258,"prevInTime":47250,"nextInTime":47252,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"-=-I don t understand why people frown on delight-driven or child-led learning either. The idea is that they are the ones choosing what they want to learn.","messageBody":"<div id=\"ygrps-yiv-1158923826\">-=-I don&#39;t understand why people frown on delight-driven or child-led  <br/>\nlearning either. The idea is that they are the ones choosing what they  <br/>\nwant to learn. Isn&#39;t that foundational to unschooling?-=-<br/>\n<br/>\nIt&#39;s not as useful and direct as it is to say &quot;Create a rich  <br/>\nenvironment within which kids can&#39;t help but learn, and give your  <br/>\nchildren choices.&quot;<br/>\n<br/>\nMy children are 23, 20, and 17.  They didn&#39;t go to school.  They  <br/>\ndidn&#39;t &quot;choose what they wanted to learn.&quot;  Neither did I.  We did  <br/>\nthings, I provided things for them to play with and explore and they  <br/>\nlearned.  I was sure they would.  They didn&#39;t always learn the thing I  <br/>\nhad thought they might, but they always learned.  I learned too, more  <br/>\nand more, about how kids learn in the absence of school. And I&#39;ve  <br/>\nlearned how other parents see learning and how that will help or hurt  <br/>\ntheir family&#39;s unschooling.<br/>\n<br/>\nI didn&#39;t &quot;choose to learn&quot; those things.  They were a natural part of  <br/>\nwhat I was doing.<br/>\n<br/>\nOur learning wasn&#39;t &quot;driven&quot; by anything except people&#39;s natural  <br/>\ninstinct to learn.  We had a delightful life, but that wasn&#39;t so that  <br/>\nwe could drive learning around with it.<br/>\n<br/>\nAny terms that require explanations and definitions and arguments  <br/>\nmight be better replaced with ideas like &quot;learning all the time.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":413697532,"authorName":"thetiemensfamily","from":"&quot;thetiemensfamily&quot; &lt;thetiemensfamily@...&gt;","profile":"thetiemensfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1253115426","msgId":47249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cjBuMitncm12QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg4bnA5citjdWxAZUdyb3Vwcy5jb20+"},"prevInTopic":47247,"nextInTopic":47251,"prevInTime":47248,"nextInTime":47250,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"I think strewing is important.  Our children need exposure to all sorts of topics.  Then we let their own interests determine whether they explore it. I don t","messageBody":"<div id=\"ygrps-yiv-1756108290\">I think strewing is important.  Our children need exposure to all sorts of topics.  Then we let their own interests determine whether they explore it.  <br/>\n<br/>\nI don&#39;t understand why people frown on delight-driven or child-led learning either.  The idea is that they are the ones choosing what they want to learn.  Isn&#39;t that foundational to unschooling?<br/>\n<br/>\nLaurie<br/>\nwww.Anotherblessing.com - Pregnancy and Ovulation Predictor Tests for only 50-85 CENTS each with free next day shipping to the USA!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;claire.horsley08&quot; &lt;claire.horsley08@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;&gt;&gt;Hi all, I&#39;m in Australia and I&#39;ve noticed some families here who &gt;&gt;&gt;identify as unscooling/natural learning, saying they disagree with &gt;&gt;&gt;the ideas of delight-driven or child-led learning.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; This is interesting to me because although I&#39;m Australian, virtually everything I know about unschooling I learned here on this list and on Sandra&#39;s site.  So to me it&#39;s almost like there is no other form of unschooling except the principles promoted by Sandra, Pam, Joyce and some of the other experienced posters on this list. And one of these key unschooling principles is the concept of strewing, where a parent actively brings a rich variety of things and experiences into their child&#39;s life, and then allows the child to choose and pursue any of these for as long as they wish.<br/>\n&gt; <br/>\n&gt; To me, strewing encourages an organically evolving form of learning, highly responsive to immediate circumstances, and based on the love and trust shared between parent and child.  So terms like &#39;child-led&#39;, &#39;parent-led&#39;, &#39;family-centred&#39; etc seem to me to putting into concrete something which should be fluid, something which will flow so easily and naturally if we let it.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":256043261,"authorName":"vespertine_nsw","from":"&quot;vespertine_nsw&quot; &lt;kezzdee@...&gt;","profile":"vespertine_nsw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: why are terms delight-driven and child-led frowned apon by some unschoolers?","postDate":"1253052197","msgId":47278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cDJ2NSszaTJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJFQUMxODY5LUJDRkEtNDI0MC1BMjg0LUM4RTJFQTE2RDY4NUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47277,"nextInTopic":47279,"prevInTime":47277,"nextInTime":47279,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"Sandra and Jenny, -=- Is natural learning used interchangably with unschooling in the states, or does it mean something different?-=- ... Ah ha! Got it,","messageBody":"<div id=\"ygrps-yiv-602572118\">Sandra and Jenny,<br/>\n<br/>\n-=- Is natural learning used interchangably with unschooling in the states, or does it mean something different?-=-<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; It&#39;s not a separate, different thing. I use &quot;natural learning&quot; lots of times, for discussing how learning can happen in the absence of teaching and lessons.  &quot;Unschooling&quot; is more about an over-arching commitment to living in such a way that natural learning can happen in the home, and getting the children out so natural learning can happen wherever and however--because all the learning takes place inside the learner. &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote> Ah ha! Got it, thanks. That reminds me, it&#39;s unfortunate there&#39;s a misconception that all &#39;&#39;home education&#39;&#39; happens at home (stemming from the idea that learning only happens from structured lessons.) We are busy outside the home most days of the week. I try to be open to discussing unschooling with anyone who asks, even when I&#39;m a bit nervous about being challenged by a strong personality. Hopefully it will open some doors in people&#39;s minds, but if not, I&#39;ve spoken my own truth and that can&#39;t be a bad thing.</div>","specialLinks":[]},{"userId":256043261,"authorName":"vespertine_nsw","from":"&quot;vespertine_nsw&quot; &lt;kezzdee@...&gt;","profile":"vespertine_nsw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1253050720","msgId":47247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cDFoMCtpdG4yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4OEE3OTkwLUEwNkEtNDYzRC04OTA2LThCRjgxMzZBRkQ0MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47246,"nextInTopic":47249,"prevInTime":47246,"nextInTime":47248,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"Sandra... ... Good point. I wonder why I want to know that others, at least some people, agree with me. Perhaps because have been met with  some negativity","messageBody":"<div id=\"ygrps-yiv-80554313\">Sandra... <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; It doesn&#39;t matter whether others agree.  If this list unanimously  declares one thing or another, it would still be a subset of the  readership because many read and never post, and there are other lists than this one.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Good point. I wonder why I want to know that others, at least some people, agree with me. Perhaps because have been met with  some negativity regarding our decision to home educate, let alone not use any curriculum at all, and am a little weary of justifying. It feels nice to have people agree for a change. Hopefully in time I will stop seeking validation from others so much.<br/>\n<br/>\n <br/>\n-=- It seems to me, in order for our kids to have the secure, free  lives we want for them, we need to let go of the agendas and trying to prove things to others (or ourselves) and just relaaax. And have fun, and just live! Or because my children are young, am I naive?-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;I think you&#39;re not naive, but I would like to apply to have the &quot;just&quot; examined.  Not &quot;just relax&quot; or &quot;just live&quot; but to relax with an open  heart, and to live richly.&lt;&lt;&lt;&lt;&lt;&lt;&lt; <br/>\n<br/>\n </span></blockquote> This part of your post especially is so helpful, thank you!<br/>\n<br/>\nKerrie from Australia.</div>","specialLinks":[]},{"userId":126344350,"authorName":"catherine fox","from":"catherine fox &lt;catherinejfox@...&gt;","profile":"janoby1812","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: why are terms delight-driven and child-led frowned apon by some unschoolers?","postDate":"1253042919","msgId":47246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENPTDEwMy1XNTYyN0ZCMTAxRTI0RkRBMTVDQjJEQkZFMzBAcGh4LmdibD4=","inReplyToHeader":"PEJFQUMxODY5LUJDRkEtNDI0MC1BMjg0LUM4RTJFQTE2RDY4NUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGg4bzNqdCtsYXJjQGVHcm91cHMuY29tPiA8QkVBQzE4NjktQkNGQS00MjQwLUEyODQtQzhFMkVBMTZENjg1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":47245,"nextInTopic":47247,"prevInTime":47245,"nextInTime":47247,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"Hi im catherine and my youngest son(12) goes to A.S.Neills Summer hill school (its the original Democratic school in Suffolk England where kids go to lessons","messageBody":"<div id=\"ygrps-yiv-38783696\">Hi im catherine and my youngest son(12) goes to A.S.Neills Summer <br/>\nhill school (its the original Democratic school in Suffolk England where kids go to<br/>\nlessons if and when they choose to..they make the school laws and run<br/>\non self regulation...its a joy to behold.. with a community of 80 or so<br/>\nkids from 5 to 18 years). I also have 2 dd 27 and 32.<br/>\n<br/>\nI really love and embrace Radical unschooling and as i have deschooled myself<br/>\nover the years I have seen our whole familys life turn around in the<br/>\nmost sane and joyful way. <br/>\n<br/>\nThis is my first post (i think!!). Just<br/>\nwanted to say Hi and a big thankyou to all who brought the Unschooling<br/>\nconference to London this year it was a much needed breath of Sanity blowing into this country which is really insane in its ideas, policies and history<br/>\nof class and education!! <br/>\n<br/>\nI think its been hard for me to post because my son goes to Summerhill for half of the year and therefore is not with me all year round.<br/>\nBut over the years as i have let go of feeling the need to be some sort of police woman in my kids life our relationships have become so much more loving,authentic, trusting and respectful.I was dragged up believing that as a kid i was a wild animal who had to be controlled and tamed, school further confirmed this...its been a long haul into recovering from this for me.<br/>\n<br/>\nWith my son at home for the past 2 months i decided to stop suggesting when bed time should happen and let him find his own rythym, which of course he has...his now taken to going to bed when we do...that of course may change again as he does.<br/>\nBut no more policing from me!! what a relief for us all!! and as people have shared i also didnt bring children into the world to be some sort of authoritarian dictator...the buck can and has stopped here. And your posts and Sandra,s invaluable writings and path blazing has supported as all along the way.<br/>\n<br/>\nMy names Catherine and i wanted to say Hi!!x<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a><br/>\nDate: Tue, 15 Sep 2009 09:54:37 -0700<br/>\nSubject: Re: [AlwaysLearning] Re: why are terms delight-driven and child-led frowned apon by some unschoolers?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n                  -=- Is natural learning used interchangably with unschooling in the  <br/>\n<br/>\nstates, or does it mean something different?-=-<br/>\n<br/>\n<br/>\n<br/>\nIt&#39;s not a separate, different thing. I use &quot;natural learning&quot; lots of  <br/>\n<br/>\ntimes, but for discussing how learning can happen in the absence of  <br/>\n<br/>\nteaching and lessons.  &quot;Unschooling&quot; is more about an over-arching  <br/>\n<br/>\ncommitment to living in such a way that natural learning can happen in  <br/>\n<br/>\nthe home, and getting the children out so natural learning can happen  <br/>\n<br/>\nwherever and however--because all the learning takes place inside the  <br/>\n<br/>\nlearner.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      <br/>\n<br/>\n    <br/>\n    <br/>\n\t<br/>\n\t<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n_________________________________________________________________<br/>\nSave time by using Hotmail to access your other email accounts.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/UKM/go/167688463/direct/01/\">http://clk.atdmt.com/UKM/go/167688463/direct/01/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1253037045","msgId":47245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwNTY1Mi44Mjc0My5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEQwNDZCOEMzLUI5QzYtNDYzRC1BMUQwLUYwNzk1MDIyQzMzNkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPiA8NjM0MTcxLjE0OTQ4LnFtQHdlYjExMDQxNi5tYWlsLmdxMS55YWhvby5jb20+IDxEMDQ2QjhDMy1COUM2LTQ2M0QtQTFEMC1GMDc5NTAyMkMzMzZAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":47244,"nextInTopic":47246,"prevInTime":47244,"nextInTime":47246,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"-=-I think it s easy to describe what small children do as delight driven . Once they are teens, it doesn t seem to apply well. What drives a teen is varied","messageBody":"<div id=\"ygrps-yiv-58426275\">-=-I think it&#39;s easy to describe what small children do as &quot;delight <br/>\ndriven&quot;. Once they are teens, it doesn&#39;t seem to apply well. What <br/>\ndrives a teen is varied and different, and sometimes not delightful at <br/>\nall! -=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Like what, Jenny?<br/>\n </span></blockquote>I think my kids are still &quot;delight driven&quot; (though it&#39;s not a term <br/>\nwe&#39;ve ever used) even as young adults.&gt;&gt;&gt;<br/>\n<br/>\nI was thinking that what motivates Chamille, at least, many times is helping others.  It&#39;s something she is compelled to do, but it isn&#39;t always delightful, sometimes it&#39;s very upsetting and painful.  Although, she does delight in someone else&#39;s happiness that she helped create.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: why are terms delight-driven and child-led frowned apon by some unschoolers?","postDate":"1253036738","msgId":47244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5MjA5Mi42MzczOC5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEJFQUMxODY5LUJDRkEtNDI0MC1BMjg0LUM4RTJFQTE2RDY4NUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGg4bzNqdCtsYXJjQGVHcm91cHMuY29tPiA8QkVBQzE4NjktQkNGQS00MjQwLUEyODQtQzhFMkVBMTZENjg1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":47243,"nextInTopic":47245,"prevInTime":47243,"nextInTime":47245,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... times, but for discussing how learning can happen in the absence of teaching and lessons.  Unschooling is more about an over-arching commitment to living","messageBody":"<div id=\"ygrps-yiv-1586207728\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;It&#39;s not a separate, different thing. I use &quot;natural learning&quot; lots of <br/>\n </span></blockquote>times, but for discussing how learning can happen in the absence of <br/>\nteaching and lessons.  &quot;Unschooling&quot; is more about an over-arching <br/>\ncommitment to living in such a way that natural learning can happen in <br/>\nthe home, and getting the children out so natural learning can happen <br/>\nwherever and however--&gt;&gt;&gt;<br/>\n<br/>\nI use natural learning a lot too, because it IS how people learn.  Unschooling is more than that too.  To me, it&#39;s natural learning, but it&#39;s also hugely about trust and relationships.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;because all the learning takes place inside the <br/>\n </span></blockquote>learner.&gt;&gt;&gt;<br/>\n<br/>\nYes!  This is true for all people, including those that go to school!  I guess, it applies better to unschooling than to schooling, since the basic premise behind school, is that learning must be forced and inserted, and taught, and that kids learn because of this.     <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1253033962","msgId":47243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBOTI1Qjk1LUEzRUUtNDNGQy1BMDAxLTNFNzFDNDBGN0FGQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg4bzRoYis0aHRqQGVHcm91cHMuY29tPg==","referencesHeader":"PGg4bzRoYis0aHRqQGVHcm91cHMuY29tPg=="},"prevInTopic":47242,"nextInTopic":47244,"prevInTime":47242,"nextInTime":47244,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"-=- In hindsight, I think that was because they were trying to protect me. I hope to do things differently with my children, and be open with them about these","messageBody":"<div id=\"ygrps-yiv-1854455356\">-=- In hindsight, I think that was because they were trying to protect  <br/>\nme. I hope to do things differently with my children, and be open with  <br/>\nthem about these kinds of things, welcome their questions etc. I think  <br/>\nthat some things, although they hurt and are unpleasant, we can also  <br/>\nlearn from. Hope that clarifies.-=-<br/>\n<br/>\nTry not to be reactionary, though.  Doing the opposite of what my  <br/>\nparents did would be as wrong as doing exactly what my parents did  <br/>\nwithout thinking.<br/>\n<br/>\nNeither hiding death nor bringing it all out and cataloging it is  <br/>\n&quot;best.&quot;  It depends on the kid, on the necessity to know, on his  <br/>\nability to  handle it.  There are times in people&#39;s lives to share and  <br/>\ntimes to shelter them.  If my dog had died during the conference I  <br/>\nwouldn&#39;t have wanted to know.  (One family got a call on Sunday and  <br/>\nthe kids knew on the way home that their dog had been hit by a car; I  <br/>\nwouldn&#39;t have shared that info in advance, had i been the house- <br/>\nsitter, or whatever.  I wouldn&#39;t have shared it with the kids if I&#39;d  <br/>\nbeen the parent and had gotten that call.)<br/>\n<br/>\nI&#39;m all laid up and drugged up today. It wouldn&#39;t be a good time for  <br/>\nme to get really bad news.  When I&#39;m home, later, then...<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: why are terms delight-driven and child-led frowned apon by some unschoolers?","postDate":"1253033677","msgId":47242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFQUMxODY5LUJDRkEtNDI0MC1BMjg0LUM4RTJFQTE2RDY4NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg4bzNqdCtsYXJjQGVHcm91cHMuY29tPg==","referencesHeader":"PGg4bzNqdCtsYXJjQGVHcm91cHMuY29tPg=="},"prevInTopic":47241,"nextInTopic":47243,"prevInTime":47241,"nextInTime":47243,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"-=- Is natural learning used interchangably with unschooling in the states, or does it mean something different?-=- It s not a separate, different thing. I use","messageBody":"<div id=\"ygrps-yiv-49352980\">-=- Is natural learning used interchangably with unschooling in the  <br/>\nstates, or does it mean something different?-=-<br/>\n<br/>\nIt&#39;s not a separate, different thing. I use &quot;natural learning&quot; lots of  <br/>\ntimes, but for discussing how learning can happen in the absence of  <br/>\nteaching and lessons.  &quot;Unschooling&quot; is more about an over-arching  <br/>\ncommitment to living in such a way that natural learning can happen in  <br/>\nthe home, and getting the children out so natural learning can happen  <br/>\nwherever and however--because all the learning takes place inside the  <br/>\nlearner.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":256043261,"authorName":"vespertine_nsw","from":"&quot;vespertine_nsw&quot; &lt;kezzdee@...&gt;","profile":"vespertine_nsw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1253021035","msgId":47241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4bzRoYis0aHRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYzNDE3MS4xNDk0OC5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":47240,"nextInTopic":47242,"prevInTime":47240,"nextInTime":47242,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"Thanks Jenny, your post was interesting. I am going to try to quote you now... ","messageBody":"<div id=\"ygrps-yiv-616538588\">Thanks Jenny, your post was interesting. I am going to try to quote you now...<br/>\n<br/>\n&lt;&lt;&lt;&lt; Perhaps I&#39;m misreading or misunderstanding, but I DO try very hard to spare my kids and shield them from unpleasantness. There is enough of that stuff naturally in the world that they should have me or their dad protecting them from that as much as possible!&gt;&gt;&gt;&gt;<br/>\n<br/>\n When I talked about not trying to shield my kids, I meant from things that impact our family directly, such as a death. When I was growing up, unfortunately death was a bit of a taboo subject. I remember having a lot of questions and things I wanted to get out about death (when it happened) but it wasn&#39;t encouraged and I was brushed off. Eg an extended family member dying of cancer, I wasn&#39;t told they even had cancer until after they actually died. In hindsight, I think that was because they were trying to protect me. I hope to do things differently with my children, and be open with them about these kinds of things, welcome their questions etc. I think that some things, although they hurt and are unpleasant, we can also learn from. Hope that clarifies.<br/>\n<br/>\nKerrie in Australia</div>","specialLinks":[]},{"userId":256043261,"authorName":"vespertine_nsw","from":"&quot;vespertine_nsw&quot; &lt;kezzdee@...&gt;","profile":"vespertine_nsw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: why are terms delight-driven and child-led frowned apon by some unschoolers?","postDate":"1253020093","msgId":47240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4bzNqdCtsYXJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBQUVFNjk2LjMwNDA4MDZAbWFjLmNvbT4="},"prevInTopic":47238,"nextInTopic":47241,"prevInTime":47239,"nextInTime":47241,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"Thanks for clearing that up Pam, that s really surprising to me! I thought it was just another expression for unschooling, as I have read/heard it used in","messageBody":"<div id=\"ygrps-yiv-146757959\">Thanks for clearing that up Pam, that&#39;s really surprising to me! I thought it was just another expression for unschooling, as I have read/heard it used in unschooling groups (eg people debating about which words best fit what their families do at home).<br/>\n<br/>\nWhilst I&#39;m on the topic, over here in Australia &#39;&#39;natural learning&#39;&#39; seems to be used more often, in place of unschooling. Is natural learning used interchangably with unschooling in the states, or does it mean something different?<br/>\n<br/>\nKerrie from Australia.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On 9/14/2009 3:23 PM, vespertine_nsw wrote:<br/>\n&gt; &gt; Hi all, I&#39;m in Australia and I&#39;ve noticed some families here who identify as unscooling/natural learning, saying they disagree with the ideas of delight-driven or child-led learning. But to me, it seems natural to want to feel happy doing something, and vice versa, when you&#39;re happy learning happens best. Are these terms frowned apon in the USA too? I don&#39;t think the delight-driven or child-led means EXCLUSIVELY this. Eg I often suggest things for our family to do, I guide, and sometimes I want/have to do something that involves the kids coming along to that they&#39;re not so keen on! But I would still say their learning is child-led and delight-driven.<br/>\n&gt; &gt;    <br/>\n&gt; <br/>\n&gt; Delight-driven is a Christian homeschooler approach. Great that they are <br/>\n&gt; approaching it through that paradigm, but it isn&#39;t what we do and not to <br/>\n&gt; be confused with unschooling.<br/>\n&gt; <br/>\n&gt; Child-led is problematic because people often think that unschoolers <br/>\n&gt; just hang back and do nothing except wait for their kids to take the <br/>\n&gt; initiative - to say, &quot;Mom, I want to learn about X.&quot; That isn&#39;t really <br/>\n&gt; the picture of unschooling that I hope people will have in their minds, <br/>\n&gt; so I object when people call it &quot;child-led&quot; because I think it is <br/>\n&gt; misleading.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":363518215,"authorName":"claire.horsley08","from":"&quot;claire.horsley08&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1253009531","msgId":47238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4bnA5citjdWxAZUdyb3Vwcy5jb20+","inReplyToHeader":"PDY4OEE3OTkwLUEwNkEtNDYzRC04OTA2LThCRjgxMzZBRkQ0MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47237,"nextInTopic":47240,"prevInTime":47237,"nextInTime":47239,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... This is interesting to me because although I m Australian, virtually everything I know about unschooling I learned here on this list and on Sandra s site.","messageBody":"<div id=\"ygrps-yiv-2109218697\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Hi all, I&#39;m in Australia and I&#39;ve noticed some families here who &gt;&gt;&gt;identify as unscooling/natural learning, saying they disagree with &gt;&gt;&gt;the ideas of delight-driven or child-led learning.<br/>\n<br/>\n<br/>\n </span></blockquote>This is interesting to me because although I&#39;m Australian, virtually everything I know about unschooling I learned here on this list and on Sandra&#39;s site.  So to me it&#39;s almost like there is no other form of unschooling except the principles promoted by Sandra, Pam, Joyce and some of the other experienced posters on this list. And one of these key unschooling principles is the concept of strewing, where a parent actively brings a rich variety of things and experiences into their child&#39;s life, and then allows the child to choose and pursue any of these for as long as they wish.<br/>\n<br/>\nTo me, strewing encourages an organically evolving form of learning, highly responsive to immediate circumstances, and based on the love and trust shared between parent and child.  So terms like &#39;child-led&#39;, &#39;parent-led&#39;, &#39;family-centred&#39; etc seem to me to putting into concrete something which should be fluid, something which will flow so easily and naturally if we let it.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1252983302","msgId":47237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwNDZCOEMzLUI5QzYtNDYzRC1BMUQwLUYwNzk1MDIyQzMzNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDYzNDE3MS4xNDk0OC5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPiA8NjM0MTcxLjE0OTQ4LnFtQHdlYjExMDQxNi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":47233,"nextInTopic":47238,"prevInTime":47236,"nextInTime":47238,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"-=-I think it s easy to describe what small children do as delight driven . Once they are teens, it doesn t seem to apply well. What drives a teen is varied","messageBody":"<div id=\"ygrps-yiv-332306623\">-=-I think it&#39;s easy to describe what small children do as &quot;delight  <br/>\ndriven&quot;. Once they are teens, it doesn&#39;t seem to apply well. What  <br/>\ndrives a teen is varied and different, and sometimes not delightful at  <br/>\nall! -=-<br/>\n<br/>\nLike what, Jenny?<br/>\nI think my kids are still &quot;delight driven&quot; (though it&#39;s not a term  <br/>\nwe&#39;ve ever used) even as young adults.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1252978279","msgId":47233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4OEE3OTkwLUEwNkEtNDYzRC04OTA2LThCRjgxMzZBRkQ0MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPg=="},"prevInTopic":47232,"nextInTopic":47237,"prevInTime":47232,"nextInTime":47234,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"-=-Are these terms frowned apon in the USA too? I don t think the delight-driven or child-led means EXCLUSIVELY this. -=- I ve seen some Australian","messageBody":"<div id=\"ygrps-yiv-2039685023\">-=-Are these terms frowned apon in the USA too? I don&#39;t think the  <br/>\ndelight-driven or child-led means EXCLUSIVELY this. -=-<br/>\n<br/>\nI&#39;ve seen some Australian defensiveness insisting on &quot;family  <br/>\ncentered&quot;   life.<br/>\n<br/>\nI personally don&#39;t love &quot;child led&quot; as a term.  I&#39;m not speaking for  <br/>\nthe USA, but just think that use of that description can throw people  <br/>\nonto a bad track where they wait for the child to lead.   Learning  <br/>\ndoesn&#39;t have to be led by anyone.<br/>\n<br/>\n-=-I&#39;m there for my kids to comfort them if they need me, but I don&#39;t  <br/>\ntry to &#39;&#39;spare&#39;&#39; them anything. Do others agree?-=-<br/>\n<br/>\nIt doesn&#39;t matter whether others agree.  If this list unanimously  <br/>\ndeclares one thing or another, it would still be a subset of the  <br/>\nreadership because many read and never post, and there are other lists  <br/>\nthan this one.<br/>\n<br/>\nWere there people saying unschoolers shouldn&#39;t be sheltered from the  <br/>\nharsh realities of life or something?  I think ALL children should be  <br/>\nspared the gory details of the worst parts of life when they&#39;re young.<br/>\n<br/>\n-=-because there is alot children wouldn&#39;t learn if they had the  <br/>\noption eg. to just hang out in bed all day. But truly, are there any  <br/>\nkids out there who are happy in their lives and aware of what&#39;s on  <br/>\noffer to them, happy to stay in bed all day? -=-<br/>\n<br/>\nI&#39;ve never seen anyone want to stay in bed who wasn&#39;t sick or depressed.<br/>\n<br/>\n-=-I think it&#39;s ok for parents to lead the way sometimes, but I don&#39;t  <br/>\nsee why it has to happen forcefully? It&#39;s not us against them.-=-<br/>\n<br/>\nWhen I come up with an idea for my husband and me to do something, I  <br/>\nmight be leading, but I couldn&#39;t possibly force him, nor even coerce  <br/>\nhim.  I make the plan seem fun and justifiable, and I&#39;ve already  <br/>\nthought of the details and all...  That&#39;s being persuasive or  <br/>\ninviting. That&#39;s still partnership and teamwork.<br/>\n<br/>\n-=-Suddenly there&#39;s a feeling that we have to prove something to the  <br/>\nworld?-=-<br/>\n<br/>\nThat will always come in spurts and waves.<br/>\n<br/>\n-=- It seems to me, in order for our kids to have the secure, free  <br/>\nlives we want for them, we need to let go of the agendas and trying to  <br/>\nprove things to others (or ourselves) and just relaaax. And have fun,  <br/>\nand just live!<br/>\nOr because my children are young, am I naive?-=-<br/>\n<br/>\nI think you&#39;re not naive, but I would like to apply to have the &quot;just&quot;  <br/>\nexamined.  Not &quot;just relax&quot; or &quot;just live&quot; but to relax with an open  <br/>\nheart, and to live richly.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1252977836","msgId":47232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzNDUwOC43NDEyMS5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRBQUVFNjk2LjMwNDA4MDZAbWFjLmNvbT4=","referencesHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPiA8NEFBRUU2OTYuMzA0MDgwNkBtYWMuY29tPg=="},"prevInTopic":47231,"nextInTopic":47233,"prevInTime":47231,"nextInTime":47233,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... approaching it through that paradigm, but it isn t what we do and not to be confused with unschooling. See now, I didn t even know that!  It s just one","messageBody":"<div id=\"ygrps-yiv-337438911\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Delight-driven is a Christian homeschooler approach. Great that they are <br/>\n </span></blockquote>approaching it through that paradigm, but it isn&#39;t what we do and not to <br/>\nbe confused with unschooling.&gt;&gt;&gt;<br/>\nSee now, I didn&#39;t even know that!  It&#39;s just one more reason to not use it!  It&#39;s an actual brand... I just looked it up.  You can purchase Delight Driven curriculum programs.  I learn something new everyday!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Child-led is problematic because people often think that unschoolers <br/>\n </span></blockquote>just hang back and do nothing except wait for their kids to take the <br/>\ninitiative - to say, &quot;Mom, I want to learn about X.&quot; That isn&#39;t really <br/>\nthe picture of unschooling that I hope people will have in their minds, <br/>\nso I object when people call it &quot;child-led&quot; because I think it is <br/>\nmisleading.&gt;&gt;&gt;<br/>\nNaysayers also like to believe that some kids just aren&#39;t that motivated to ask to learn about X.  Child-led and all the assumptions that go with it make understanding Unschooling, very difficult.  It&#39;s already difficult for most people to get it anyway.<br/>\nThe various new articles about unschooling prove that over and over again, that even smart educated journalists can&#39;t even wrap their minds around what unschooling is.  Child-led, just adds another layer of confusion!<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1252977191","msgId":47231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNDE3MS4xNDk0OC5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPg=="},"prevInTopic":47230,"nextInTopic":47232,"prevInTime":47230,"nextInTime":47232,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... Lots of people in the US use these terms too.  My problem with them, is that they don t accurately portray in easy words, what we do.  Unschooling is","messageBody":"<div id=\"ygrps-yiv-545094370\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Hi all, I&#39;m in Australia and I&#39;ve noticed some families here who identify as unscooling/natural learning, saying they disagree with the ideas of delight-driven or child-led learning. But to me, it seems natural to want to feel happy doing something, and vice versa, when you&#39;re happy learning happens best. Are these terms frowned apon in the USA too?&gt;&gt;&gt;<br/>\n </span></blockquote>Lots of people in the US use these terms too.  My problem with them, is that they don&#39;t accurately portray in easy words, what we do.  Unschooling is pretty accurate, when you come right to it.  We don&#39;t do school, we live as if school didn&#39;t exist, or try to at least.  <br/>\nChild led, implies something that doesn&#39;t actually happen in my house.  While lots of things happen because a child has interest or initiates something, almost all things at my house happen through a large effort on my part.  My children don&#39;t lead in that.  I do.  I find outlets and resource for them.  Chamille, at the age of 15, is just starting to navigate this realm on her own, in little baby steps.<br/>\nDelight driven doesn&#39;s appeal to me either.  While it&#39;s great to delight in things, it isn&#39;t always what drives people to do things, even things they love to do.  Kids out of school, unschooling, learn naturally and the delight doesn&#39;t disappear, they continue to be delighted by all kinds of things as they grow up.  Since, I&#39;m often the driver, both literally and figuratively, sometimes I delight in it and sometimes I don&#39;t.  <br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;I don&#39;t think the delight-driven or child-led means EXCLUSIVELY this. Eg I often suggest things for our family to do, I guide, and sometimes I want/have to do something that involves the kids coming along to that they&#39;re not so keen on! But I would still say their learning is child-led and delight-driven.&gt;&gt;&gt;<br/>\n </span></blockquote>I think it&#39;s easy to describe what small children do as &quot;delight driven&quot;.  Once they are teens, it doesn&#39;t seem to apply well.  What drives a teen is varied and different, and sometimes not delightful at all!  &quot;Child led&quot; feels similar.  Even though my children seem to pull me along in many directions, it&#39;s me that makes it happen for them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I think that sadness, grief etc are all important emotions that can teach us alot, and I don&#39;t think that either those terms mean shielding children from those challenging feelings or experiences. I&#39;m there for my kids to comfort them if they need me, but I don&#39;t try to &#39;&#39;spare&#39;&#39; them anything. Do others agree?&gt;&gt;&gt;<br/>\n </span></blockquote>Perhaps I&#39;m misreading or misunderstanding, but I DO try very hard to spare my kids and shield them from unpleasantness.  There is enough of that stuff naturally in the world that they should have me or their dad protecting them from that as much as possible!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Some who disagree with these terms, insist that they&#39;re &#39;&#39;family-centred&#39; &#39;and that some degree of parent-led learning is necessary, because there is alot children wouldn&#39;t learn if they had the option eg. to just hang out in bed all day. But truly, are there any kids out there who are happy in their lives and aware of what&#39;s on offer to them, happy to stay in bed all day? (and I don&#39;t mean now and then to recharge the batteries, I mean regularly.) I think it&#39;s ok for parents to lead the way sometimes, but I don&#39;t see why it has to happen forcefully? It&#39;s not us against them.&gt;&gt;&gt;<br/>\n </span></blockquote>I think you might be confusing the issues here.  We most definitely live a family centered life, led by the parents, who choose to give our children many many choices and then help them with those choices.  I don&#39;t think this is a case that you can define by what ignorant people choose to say in contrast to what unschooling is all about.  People make a lot of ignorant assumptions about unschooling that just aren&#39;t the reality of what actually happens in unschooling households.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I am starting to realise that I used to share my fellow unschoolers determination not to be child-centred, but that seems now to be presumptuous and somewhat hostile. I don&#39;t think my children ever expected to be the centre of anything. I think my children know they&#39;re part of a wonderful, wide world, and why oh why was I ever defensive and concerned about ensuring they didn&#39;t become &#39;&#39;spoilt&#39;&#39; or &#39;&#39;doted apon.&#39;&#39; &gt;&gt;&gt;<br/>\n </span></blockquote>Both of my kids have expected to be the center of attention at various, and many variety of ways in their lives.  Babies require it.  We work towards natural cohesiveness.  Children who are treated with kindness don&#39;t behave in ways in which others will say &quot;spoiled&quot;.  And just for the record, I DO dote on my kids, it&#39;s something that I enjoy doing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;...as the children turn school-age, there seems to be pressure from society to detach and push independence, and maybe that&#39;s where the defensive attitude comes from? Suddenly there&#39;s a feeling that we have to prove something to the world?<br/>\n<br/>\n </span></blockquote>The irony in this whole thing, though, is that the proof is in the pudding! It seems to me, in order for our kids to have the secure, free lives we want for them, we need to let go of the agendas and trying to prove things to others (or ourselves) and just relaaax. And have fun, and just live!&gt;&gt;&gt;<br/>\nThis is why it&#39;s so much better to focus on what you love to do.  If you are living in a way in which you are still reacting to why schools suck, your focus will be on that big negative, rather than on the big wide world in which you do wonderful things.  Don&#39;t prove anything to anyone.  Others will see how wonderful your kids are, or they won&#39;t.  Some people will choose to focus on what all your kids are lacking in, or why you are completely insane or wrong or whatever.... but you can be confident in knowing the truth!   <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1252976278","msgId":47230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBQUVFNjk2LjMwNDA4MDZAbWFjLmNvbT4=","inReplyToHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPg=="},"prevInTopic":47229,"nextInTopic":47231,"prevInTime":47229,"nextInTime":47231,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"... Delight-driven is a Christian homeschooler approach. Great that they are approaching it through that paradigm, but it isn t what we do and not to be","messageBody":"<div id=\"ygrps-yiv-865108264\">On 9/14/2009 3:23 PM, vespertine_nsw wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi all, I&#39;m in Australia and I&#39;ve noticed some families here who identify as unscooling/natural learning, saying they disagree with the ideas of delight-driven or child-led learning. But to me, it seems natural to want to feel happy doing something, and vice versa, when you&#39;re happy learning happens best. Are these terms frowned apon in the USA too? I don&#39;t think the delight-driven or child-led means EXCLUSIVELY this. Eg I often suggest things for our family to do, I guide, and sometimes I want/have to do something that involves the kids coming along to that they&#39;re not so keen on! But I would still say their learning is child-led and delight-driven.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Delight-driven is a Christian homeschooler approach. Great that they are <br/>\napproaching it through that paradigm, but it isn&#39;t what we do and not to <br/>\nbe confused with unschooling.<br/>\n<br/>\nChild-led is problematic because people often think that unschoolers <br/>\njust hang back and do nothing except wait for their kids to take the <br/>\ninitiative - to say, &quot;Mom, I want to learn about X.&quot; That isn&#39;t really <br/>\nthe picture of unschooling that I hope people will have in their minds, <br/>\nso I object when people call it &quot;child-led&quot; because I think it is <br/>\nmisleading.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":256043261,"authorName":"vespertine_nsw","from":"&quot;vespertine_nsw&quot; &lt;kezzdee@...&gt;","profile":"vespertine_nsw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"why are terms delight-driven and child-led  frowned apon by some unschoolers?","postDate":"1252967036","msgId":47229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4bWZwcytoNm00QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47230,"prevInTime":47228,"nextInTime":47230,"topicId":47229,"numMessagesInTopic":0,"msgSnippet":"Hi all, I m in Australia and I ve noticed some families here who identify as unscooling/natural learning, saying they disagree with the ideas of delight-driven","messageBody":"<div id=\"ygrps-yiv-1672121500\">Hi all, I&#39;m in Australia and I&#39;ve noticed some families here who identify as unscooling/natural learning, saying they disagree with the ideas of delight-driven or child-led learning. But to me, it seems natural to want to feel happy doing something, and vice versa, when you&#39;re happy learning happens best. Are these terms frowned apon in the USA too? I don&#39;t think the delight-driven or child-led means EXCLUSIVELY this. Eg I often suggest things for our family to do, I guide, and sometimes I want/have to do something that involves the kids coming along to that they&#39;re not so keen on! But I would still say their learning is child-led and delight-driven.<br/>\n<br/>\nI think that sadness, grief etc are all important emotions that can teach us alot, and I don&#39;t think that either those terms mean shielding children from those challenging feelings or experiences. I&#39;m there for my kids to comfort them if they need me, but I don&#39;t try to &#39;&#39;spare&#39;&#39; them anything. Do others agree?<br/>\n<br/>\nSome who disagree with these terms, insist that they&#39;re &#39;&#39;family-centred&#39;&#39;and that some degree of parent-led learning is necessary, because there is alot children wouldn&#39;t learn if they had the option eg. to just hang out in bed all day. But truly, are there any kids out there who are happy in their lives and aware of what&#39;s on offer to them, happy to stay in bed all day? (and I don&#39;t mean now and then to recharge the batteries, I mean regularly.) I think it&#39;s ok for parents to lead the way sometimes, but I don&#39;t see why it has to happen forcefully? It&#39;s not us against them.<br/>\n<br/>\nSomething Sandra said once when she visited a forum I&#39;m on, struck with me, why do we have to &#39;&#39;centred&#39;&#39; on anything or anyone at all? Using the word centred, sounds so formal and rigid, when our unscooling life is far from that. It&#39;s flexible and changes all the time. <br/>\n<br/>\nI am starting to realise that I used to share my fellow unschoolers determination not to be child-centred, but that seems now to be presumptuous and somewhat hostile. I don&#39;t think my children ever expected to be the centre of anything. I think my children know they&#39;re part of a wonderful, wide world, and why oh why was I ever defensive and concerned about ensuring they didn&#39;t become &#39;&#39;spoilt&#39;&#39; or &#39;&#39;doted apon.&#39;&#39; <br/>\n<br/>\nI have parented fairly instinctively and naturally from the start, but suddenly as the children turn school-age, there seems to be pressure from society to detach and push independence, and maybe that&#39;s where the defensive attitude comes from? Suddenly there&#39;s a feeling that we have to prove something to the world?<br/>\n<br/>\nThe irony in this whole thing, though, is that the proof is in the pudding! It seems to me, in order for our kids to have the secure, free lives we want for them, we need to let go of the agendas and trying to prove things to others (or ourselves) and just relaaax. And have fun, and just live!<br/>\n<br/>\nOr because my children are young, am I naive?</div>","specialLinks":[]}],"prevTopicId":47262,"nextTopicId":47228}}