{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":41,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: A Request for Feedback Regarding My RU Teen","postDate":"1223998290","msgId":39468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MUVBQ0ZGLTM4MEYtNDAxNy04MEUwLTRCNURCNTQ5OTEwNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdkMWduMytvcmhlQGVHcm91cHMuY29tPg==","referencesHeader":"PGdkMWduMytvcmhlQGVHcm91cHMuY29tPg=="},"prevInTopic":39467,"nextInTopic":39470,"prevInTime":39467,"nextInTime":39469,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"-=-I can definitely see where my stress and overwhelm at the load could appear to be about my daughter and that she probably does take it personally, despite","messageBody":"<div id=\"ygrps-yiv-1058139853\">-=-I can definitely see<br/>\nwhere my stress and overwhelm at the load could appear to be about my<br/>\ndaughter and that she probably does take it personally, despite the<br/>\nfact that I verbalize my awareness of my stress as my own and not<br/>\nabout her. -=-<br/>\n<br/>\nWords don&#39;t trump truth.  You explained to us clearly and at length  <br/>\nthat your daughter&#39;s behavior was affecting your life negatively, and  <br/>\nhers, and your son&#39;s.  Taking it back won&#39;t change what you&#39;ve  <br/>\nalready said here.  Telling your daughter &quot;I&#39;d not about you&quot; won&#39;t  <br/>\nfool her, either.<br/>\n<br/>\n-=-Now that is an even better suggestion than midnight cleaning. Look  <br/>\nfor easy ways to get things solved like dishes. Paper plates are  <br/>\nbrilliant for us when there are lots of people over.-=-<br/>\n<br/>\nHad the original poster actually read Joyce&#39;s pages on chores, that  <br/>\npoint would&#39;ve been a part of her options-list already.  I don&#39;t  <br/>\nthink claiming to have read something is NEARLY as good as actually  <br/>\nreading it and then considering it at some length.<br/>\n<br/>\nI&#39;m further down in my e-mail now and I know some of the morning&#39;s  <br/>\nposts were headed off and returned.  It&#39;s probably for the best, but  <br/>\nmy response here is based on some of what didn&#39;t go to the list.   <br/>\nSorry about that, but the poster could use the feedback, perhaps, and  <br/>\nI&#39;m unwilling to spend energy in private that could benefit others  <br/>\nreading here.<br/>\n<br/>\nThe poster had commented that some of her posts hadn&#39;t gone through.   <br/>\nPlease, to anyone who&#39;s read this far, when you join a list, READ THE  <br/>\nINTRO of the group you&#39;ve just joined.  New posters on this list are  <br/>\nmoderated.  Rude posts might not be let through.  Rude posters might  <br/>\nbe unceremoniously removed.<br/>\n<br/>\n&quot;This is a moderated group, with trapdoors for the uncooperative.  <br/>\n(Not moderated in the advance-approval way, but in the be-nice-to- <br/>\nplay way. New members&#39; posts are moderated, and it&#39;s good to read  <br/>\nseveral dozen posts before jumping in.) &quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n<br/>\nWhen a mom is having trouble with a 14 year old and wants to bat all  <br/>\nsuggestions away as undoable, impossible, inapplicable, and then  <br/>\ninsult the list and listowner what, in the meantime, is going on with  <br/>\nthe relationship with the daughter?  This list doesn&#39;t exist to make  <br/>\nmothers feel better about not changing.  It exists to help fourteen   <br/>\nyear old girls have better mothering.<br/>\n<br/>\nOne glance in the archives will give a clue at how many thousands of  <br/>\nhours of writing hundreds of unschooling parents have done to freely  <br/>\nand generously help others understand unschooling.  For someone to  <br/>\ncome here and say &quot;I joined a year and a half ago...&quot; and then prove  <br/>\nthat none of that was being read or  used does make me want to grease  <br/>\nup my long-unused trapdoor.  But I think it helps others see how far  <br/>\nthey&#39;ve come when someone resists all this help and experience.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: A Request for Feedback Regarding My RU Teen","postDate":"1223997153","msgId":39467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBMUY2OUZCLTg4OUYtNEQ2Qi1CRUU2LTFERjU0MjcxRkE3NUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUwNjg2Ni44ODQyNS5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDUwNjg2Ni44ODQyNS5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":39462,"nextInTopic":39468,"prevInTime":39466,"nextInTime":39468,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"I ve added this to one of the many pages on chores I have collected over the years: Having a clean house isn t anywhere near as important as having a house","messageBody":"<div id=\"ygrps-yiv-827691345\">I&#39;ve added this to one of the many pages on chores I have collected  <br/>\nover the years:<br/>\n<br/>\n&quot;Having a clean house isn&#39;t anywhere near as important as having a  <br/>\nhouse that all of us enjoy living in. Having dishes done isn&#39;t more  <br/>\nimportant than hanging out with Simon and Linnaea. Having a vacuumed  <br/>\nfloor isn&#39;t more important than letting Simon or Linnaea watch a  <br/>\ntelevision show uninterrupted. Having my to do list cleared isn&#39;t  <br/>\nmore important than going to the game store because Simon wants to  <br/>\nget Castlevania Dawn of Sorrow for the DS and we could fit in a 20  <br/>\nminute game of laser tag and check out Casltevania Portrait of Ruin  <br/>\nfrom the library. Actually, I don&#39;t have a to do list, but if I did...&quot;<br/>\n<br/>\n<br/>\n<br/>\nIt&#39;s now the first item after the introduction on this page:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chore/intro\">http://sandradodd.com/chore/intro</a><br/>\n<br/>\nSome people do find those pages and read them and their children&#39;s  <br/>\nlives are made better, and their own lives are made better, and they  <br/>\nget along better with the other people in their lives.  I know it&#39;s  <br/>\ntrue because I get feedback, and because that feedback needs to be  <br/>\nshared with people like Schuyler (who wrote the paragraph above) and  <br/>\ndozens of other people who have written clearly and helpfully and  <br/>\ngenerously, I keep some of it here.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/feedback\">http://sandradodd.com/feedback</a><br/>\n<br/>\nI&#39;ll add some of today&#39;s criticism to the negatives column.  I&#39;m not  <br/>\nsure it was let through to the list.  I got to sleep a long time last  <br/>\nnight and it was great!  Other moderators have been  here before me  <br/>\nand I&#39;m not sure if they let the worst stuff through.  I hit  <br/>\n&quot;approve&quot; on my end, but if it was already rejected that&#39;s fine.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: A Request for Feedback Regarding My RU Teen","postDate":"1223979422","msgId":39462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4RjcxRkQ0LTA0MzAtNEFDOS05OTdDLTUzNzMzRDJGRTA2NEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg==","referencesHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":39461,"nextInTopic":39467,"prevInTime":39461,"nextInTime":39463,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... But what it s sounding like to me is that you ve allowed yourself to overschedule and are depending on your daughter to make the overscheduling work. But","messageBody":"<div id=\"ygrps-yiv-771921730\">On Oct 13, 2008, at 9:46 PM, Jennifer Ironstone wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That said, I have had to<br/>\n&gt; learn the hard way that I do not want to support their happiness at<br/>\n&gt; the *expense of my own*, which has been a difficult hurdle for me as<br/>\n&gt; my own mother was big on sacrifice<br/>\n<br/>\n </span></blockquote>But what it&#39;s sounding like to me is that you&#39;ve allowed yourself to  <br/>\noverschedule and are depending on your daughter to make the  <br/>\noverscheduling work. But she isn&#39;t capable of that. Yes, I understand  <br/>\nshe&#39;s agreeing to put in the time, but at 14 she&#39;s showing you she  <br/>\nisn&#39;t capable.<br/>\n<br/>\nThe original problem is fitting all these activities into the day.  <br/>\nYou&#39;ve chosen the solution of your daughter helping in order to make  <br/>\nthat happen. And now you&#39;ve turned getting your daughter to help into  <br/>\nthe new problem.<br/>\n<br/>\nStart over. Focus on the original problem, not this made up problem  <br/>\nabout 14 yo help that&#39;s obviously not working.<br/>\n<br/>\nPut yourself on the schedule.<br/>\n<br/>\nBe realistic about the number of hours you need to get your stuff  <br/>\ndone. Show the kids what you would like to accomplish to see if they  <br/>\ncan see where you&#39;re maybe making it more difficult for yourself.  <br/>\nTake their ideas seriously, even if they sound off the wall  <br/>\ninitially. (*Don&#39;t* show them the list to guilt them into helping.)  <br/>\nDon&#39;t schedule more than you have time for. If they offer to help,  <br/>\nlet them know ahead of time what activity you won&#39;t be able to take  <br/>\nthem to if something doesn&#39;t get done. Don&#39;t get mad. Don&#39;t expect  <br/>\nthem to help. It&#39;s not a way to punish them. Reality is that there  <br/>\nare just so many hours in the day and if you&#39;ve overbooked an hour,  <br/>\nsomething&#39;s got to give.<br/>\n<br/>\nBring some of the chores that seem to suck up time here and ask what  <br/>\nothers do. The solutions people suggest may not be perfect to your  <br/>\nsituation, but in those cases look at the sideways thinking rather  <br/>\nthan the specific suggestion.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: A Request for Feedback Regarding My RU Teen","postDate":"1223977236","msgId":39461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNjg2Ni44ODQyNS5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":39460,"nextInTopic":39462,"prevInTime":39460,"nextInTime":39462,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"Now that is an even better suggestion than midnight cleaning. Look for easy ways to get things solved like dishes. Paper plates are brilliant for us when there","messageBody":"<div id=\"ygrps-yiv-1883257303\">Now that is an even better suggestion than midnight cleaning. Look for easy ways to get things solved like dishes. Paper plates are brilliant for us when there are lots of people over. Even though there are still other things to be washed, having the plates be paper takes some of it out of the equation. Ask for more specific help and lots of people will offer suggestions. If you want to have a less volatile household you need to move toward being less oppositional with your daughter, move to finding more solutions that don&#39;t include her labor. There are lots of helpful solutions that people come up with for ways of taking care of the things that you feel need to be cared for much easier. I am often impressed with the ideas that others have thought of and use. <br/>\n<br/>\nSimon and Linnaea have never opted in for doing the dishes, well, when Simon was 5 and Linnaea was 2 they did them a couple of times. We have never had a dishwasher and we&#39;ve always managed to have enough clean dishes to serve everyone. Even when David wasn&#39;t around. Even when folks are sick. Even when we are really, really busy. At no time are we requiring Simon or Linnaea to do the dishes. And yet neither of your choices, children washing dishes or no dishes leaving children eating out of their hands, seems to happen. <br/>\n<br/>\nI like doing dishes. I like standing in the kitchen and looking out the window with music playing on the stereo or talk radio thinking wispy thoughts, following the tendrils of ideas for a little while, washing the dishes. It&#39;s very meditative. It&#39;s very relaxing. It doesn&#39;t take long, maybe 15 minutes twice a day, maybe 25 minutes once a day. I do have help. David does the dishes fairly regularly. I think he enjoys doing them too. He plays really loud music while he does the dishes. The dishes air dry, which takes a step out of the labor. And they get put away before the next wash, usually, although sometimes they get used before the next wash happens. Sometimes I let things soak overnight. Sometimes I start doing the dishes and get distracted by something more important, more engaging and go and deal with that and then something else and then it&#39;s too late and when I get up in the morning I drain the sink and refill and they are really easy to finish. <br/>\n<br/>\nHaving a clean house isn&#39;t anywhere near as important as having a house that all of us enjoy living in. Having dishes done isn&#39;t more important than hanging out with Simon and Linnaea. Having a vacuumed floor isn&#39;t more important than letting Simon or Linnaea watch a television show uninterrupted. Having my to do list cleared isn&#39;t more important than going to the game store because Simon wants to get Castlevania Dawn of Sorrow for the DS and we could fit in a 20 minute game of laser tag and check out Casltevania Portrait of Ruin from the library. Actually, I don&#39;t have a to do list, but if I did...<br/>\n<br/>\nSchuyler<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n-----------<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 13, 2008, at 6:46 PM, Jennifer Ironstone wrote:<br/>\n<br/>\n&gt;&gt;<br/>\n&gt;&gt; I call them family jobs because the children like having dishes to use<br/>\n&gt;&gt; for eating, too.  If they were to opt out of using any were there no<br/>\n&gt;&gt; clean ones available, I could see them not minding making an even<br/>\n&gt;&gt; bigger mess with their food if there were no plate/bowl underneath it<br/>\n&gt;&gt; because then they&#39;d likely opt out of cleaning that up, too.<br/>\n<br/>\n&gt;Nancy Wooten wrote:<br/>\n&gt;I&#39;ve never had a dishwasher, so I&#39;ve used paper plates for many  <br/>\n&gt;years.  Sorry, trees ;-)  I do a lot of my grocery shopping at a  <br/>\n&gt;restaurant supply chain called &quot;Smart and Final,&quot; where I get 500  <br/>\n&gt;paper plates for about $7.  We use them for breakfast and lunch, and  <br/>\n&gt;for dinner if we have something like pizza.<br/>\n<br/>\nNancy<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":205473509,"authorName":"Jennifer Ironstone","from":"&quot;Jennifer Ironstone&quot; &lt;vitalharvest@...&gt;","profile":"vitalharvest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: A Request for Feedback Regarding My RU Teen","postDate":"1223968291","msgId":39460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMWduMytvcmhlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdkMTFibytsamtrQGVHcm91cHMuY29tPg=="},"prevInTopic":39459,"nextInTopic":39461,"prevInTime":39459,"nextInTime":39461,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... angry ... -- ... you ... house ... how a ... measuring ... that as ... kids ... I agree with you, Jenny, and thank you for this.  It makes a lot of sense","messageBody":"<div id=\"ygrps-yiv-2066522538\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Jenny C&quot; &lt;jenstarc4@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; Oh, I&#39;d also like to respond to the assumptive comment that I am <br/>\n </span></blockquote>angry<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; when my daughter wakes up in the afternoon/goes to sleep very late <br/>\n </span></blockquote>--<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Perhaps I didn&#39;t read everything, but anger or no anger this is what <br/>\n </span></blockquote>you<br/>\n<blockquote><span title=\"ireply\"> &gt; said<br/>\n&gt; <br/>\n&gt; &quot;So our household has become very<br/>\n&gt; unpredictable and volatile due to her constant deal-breaking and<br/>\n&gt; pattern of hostility. This has become increasingly unrealistic and<br/>\n&gt; stressful for her brother and for me.&quot;<br/>\n&gt; <br/>\n&gt; In the absence of a happy coexistence with a 14 yr old, having a<br/>\n&gt; volatile relationship seems pretty bad.  None of us are in your <br/>\n </span></blockquote>house<br/>\n<blockquote><span title=\"ireply\"> &gt; listening to your interaction with your daughter, but, I don&#39;t see <br/>\n </span></blockquote>how a<br/>\n<blockquote><span title=\"ireply\"> &gt; parent can appear happy and cheerful to a daughter that isn&#39;t <br/>\n </span></blockquote>measuring<br/>\n<blockquote><span title=\"ireply\"> &gt; up in the parent&#39;s standards.  I think both of my kids would see <br/>\n </span></blockquote>that as<br/>\n<blockquote><span title=\"ireply\"> &gt; being angry, or dissappointed, or something, but clearly not happy<br/>\n&gt; coexistence, and certainly not pleasant.<br/>\n&gt; <br/>\n&gt; Your voice could be kind and patient, but your actions are not, and <br/>\n </span></blockquote>kids<br/>\n<blockquote><span title=\"ireply\"> &gt; read those just as much as tone and presence.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I agree with you, Jenny, and thank you for this.  It makes a lot of <br/>\nsense and I&#39;ve been thinking about it all night.  I can definitely see <br/>\nwhere my stress and overwhelm at the load could appear to be about my <br/>\ndaughter and that she probably does take it personally, despite the <br/>\nfact that I verbalize my awareness of my stress as my own and not <br/>\nabout her.</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: A Request for Feedback Regarding My RU Teen","postDate":"1223966796","msgId":39459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY2RjA0QzM1LUM1NDUtNEMyRC1BRDhGLUU1RUU3NDY2RjI0REBjb3gubmV0Pg==","inReplyToHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg==","referencesHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":39458,"nextInTopic":39460,"prevInTime":39458,"nextInTime":39460,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... I ve never had a dishwasher, so I ve used paper plates for many years.  Sorry, trees ;-)  I do a lot of my grocery shopping at a restaurant supply chain","messageBody":"<div id=\"ygrps-yiv-880537700\">On Oct 13, 2008, at 6:46 PM, Jennifer Ironstone wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I call them family jobs because the children like having dishes to use<br/>\n&gt; for eating, too.  If they were to opt out of using any were there no<br/>\n&gt; clean ones available, I could see them not minding making an even<br/>\n&gt; bigger mess with their food if there were no plate/bowl underneath it<br/>\n&gt; because then they&#39;d likely opt out of cleaning that up, too.<br/>\n<br/>\n </span></blockquote>I&#39;ve never had a dishwasher, so I&#39;ve used paper plates for many  <br/>\nyears.  Sorry, trees ;-)  I do a lot of my grocery shopping at a  <br/>\nrestaurant supply chain called &quot;Smart and Final,&quot; where I get 500  <br/>\npaper plates for about $7.  We use them for breakfast and lunch, and  <br/>\nfor dinner if we have something like pizza.<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: A Request for Feedback Regarding My RU Teen","postDate":"1223966670","msgId":39458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzMjc0OUQ5LUJDQTQtNDdFOS1CNzJCLTc2Rjg2MTRGQkJBRUBjb3gubmV0Pg==","inReplyToHeader":"PDlmNzJkNzYyMDgxMDEzMjMwM203MjkyMmU4YnA4OTFiNjE3MTU5NDQ0OWNlQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPiA8OWY3MmQ3NjIwODEwMTMyMzAzbTcyOTIyZThicDg5MWI2MTcxNTk0NDQ5Y2VAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":39456,"nextInTopic":39459,"prevInTime":39457,"nextInTime":39459,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... Oh, heavens!  I hope that wasn t the impression *I* gave, since I m the one who brought it up.  My daughter, who is 21, not 14, will do the dishes before","messageBody":"<div id=\"ygrps-yiv-1970107964\">On Oct 13, 2008, at 11:03 PM, Margaret wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You wrote a long long reply but the thing that stood out to me most  <br/>\n&gt; was this:<br/>\n&gt;<br/>\n&gt;&gt; I LOVE the idea of middle-of-the-night household work! We&#39;ve<br/>\n&gt;&gt; discussed it and are going to give it a try<br/>\n&gt;<br/>\n&gt; I read the thread and if &quot;I should make her do her household work in<br/>\n&gt; the middle of the night&quot; was what you got out of it then I think you<br/>\n&gt; should read the replies again.  The links too.  Really.<br/>\n<br/>\n<br/>\n </span></blockquote>Oh, heavens!  I hope that wasn&#39;t the impression *I* gave, since I&#39;m  <br/>\nthe one who brought it up.  My daughter, who is 21, not 14, will do  <br/>\nthe dishes before she goes to bed.  She might do them at midnight, or  <br/>\n2 a.m. or so.  I don&#39;t *make* her do anything.  She did them this  <br/>\nevening while I was fixing dinner because they hadn&#39;t gotten done  <br/>\nearlier and we needed plates &lt;g&gt;  I&#39;ll admit, it&#39;s really nice to wake  <br/>\nup to a clean kitchen, whether she&#39;s done it, or I&#39;ve done it before  <br/>\ngoing to bed myself.<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":211613982,"authorName":"Margaret","from":"Margaret &lt;margaretz@...&gt;","profile":"margaretzat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: A Request for Feedback Regarding My RU Teen","postDate":"1223964238","msgId":39456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlmNzJkNzYyMDgxMDEzMjMwM203MjkyMmU4YnA4OTFiNjE3MTU5NDQ0OWNlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg==","referencesHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":39454,"nextInTopic":39458,"prevInTime":39455,"nextInTime":39457,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... I read the thread and if I should make her do her household work in the middle of the night was what you got out of it then I think you should read the","messageBody":"<div id=\"ygrps-yiv-1751115432\">You wrote a long long reply but the thing that stood out to me most was this:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I LOVE the idea of middle-of-the-night household work! We&#39;ve<br/>\n&gt; discussed it and are going to give it a try<br/>\n<br/>\n </span></blockquote>I read the thread and if &quot;I should make her do her household work in<br/>\nthe middle of the night&quot; was what you got out of it then I think you<br/>\nshould read the replies again.  The links too.  Really.</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Coming out of the closet","postDate":"1223957163","msgId":39454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhCNDA4MzA1LTdBNEYtNENGQy05QjJBLTgxQjJCQkRCRDJCM0Bjb3gubmV0Pg==","inReplyToHeader":"PGdkMGl1cStwNHRyQGVHcm91cHMuY29tPg==","referencesHeader":"PGdkMGl1cStwNHRyQGVHcm91cHMuY29tPg=="},"prevInTopic":39453,"nextInTopic":39456,"prevInTime":39453,"nextInTime":39455,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... Maybe you could ask your kids and your mom to do a living history project - put together a photo album, explore family history, explore the things your mom","messageBody":"<div id=\"ygrps-yiv-2091830683\">On Oct 13, 2008, at 3:43 PM, Jenny C wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Perhaps have a series of movies and books and activities<br/>\n&gt; that all kind of relate to each other that take up lots of time in a<br/>\n&gt; relaxed kind of way that keeps the kids looking busy and gives your  <br/>\n&gt; mom<br/>\n&gt; something to do that feels helpful.<br/>\n<br/>\n </span></blockquote>Maybe you could ask your kids and your mom to do a living history  <br/>\nproject - put together a photo album, explore family history, explore  <br/>\nthe things your mom remembers from her own life and her relatives&#39;,  <br/>\netc.  Let them surprise you with a presentation; let the kids teach  <br/>\nGrandma how to use PowerPoint or the digital camera &lt;g&gt;<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Request for Feedback Regarding My RU Teen","postDate":"1223954242","msgId":39453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDgxMDEzMjAxN3ExYjNlNzhmazcxM2VkMzRiZmFlZGJhOTVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEYzMkIyRjkyLTgwQ0ItNDZFOC04REQwLTA4NkRBQzc2RDYwRUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPgkgPDY3QzY2QTdFLUVDRjAtNERDQi1BQUZBLTI0MTFFNDQxN0QwQkBzYW5kcmFkb2RkLmNvbT4JIDxFRjEzQTdDQkYyNkU0MzgwQkIxNTg1RENCMTVEMTc2OUBMWUxBTEFQMj4JIDxGMzJCMkY5Mi04MENCLTQ2RTgtOEREMC0wODZEQUM3NkQ2MEVAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":39452,"nextInTopic":39454,"prevInTime":39452,"nextInTime":39454,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"It s not so applicable where it doesn t snow, but I like it anyway: Trying to clean while children are growing, is like trying to shovel while it s still","messageBody":"<div id=\"ygrps-yiv-1269122670\">It&#39;s not so applicable where it doesn&#39;t snow, but I like it anyway:<br/>\n<br/>\nTrying to clean while children are growing,<br/>\nis like trying to shovel while it&#39;s still snowing.<br/>\n<br/>\nI had 4 &quot;loaner&quot; kids at my house last week. My little friend, Willow, 7,<br/>\ncommented several times she was *so* happy our house was as messy as theirs<br/>\n:D Having a house that looks like people *live* there is far more important<br/>\nthan having a house that&#39;s presentable to those who live in museums! Not to<br/>\nmention the free time I have available for fun stuff because I&#39;m not<br/>\nobsessing about any household chore *have-tos*<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Oct 13, 2008 at 3:38 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   -=-our entire relationship has shifted with these changes and i<br/>\n&gt; wouldn&#39;t trade the cleanest house in the world for the way things<br/>\n&gt; were before.-=-<br/>\n&gt;<br/>\n&gt; People never get the cleanest house in the world from forced child<br/>\n&gt; labor anyway. &lt;g&gt; They get a half-assed job and a LOT of<br/>\n&gt; resentment. Better to do it yourself and learn to have fun doing it,<br/>\n&gt; so others will want to help to get to hang out with you.<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: A Request for Feedback Regarding My RU Teen","postDate":"1223952568","msgId":39452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMTFibytsamtrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdkMHY2NCthZjlkQGVHcm91cHMuY29tPg=="},"prevInTopic":39451,"nextInTopic":39453,"prevInTime":39451,"nextInTime":39453,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... Perhaps I didn t read everything, but anger or no anger this is what you said So our household has become very unpredictable and volatile due to her","messageBody":"<div id=\"ygrps-yiv-1014207741\"><blockquote><span title=\"ireply\">&gt; Oh, I&#39;d also like to respond to the assumptive comment that I am angry<br/>\n&gt; when my daughter wakes up in the afternoon/goes to sleep very late --<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Perhaps I didn&#39;t read everything, but anger or no anger this is what you<br/>\nsaid<br/>\n<br/>\n&quot;So our household has become very<br/>\nunpredictable and volatile due to her constant deal-breaking and<br/>\npattern of hostility. This has become increasingly unrealistic and<br/>\nstressful for her brother and for me.&quot;<br/>\n<br/>\nIn the absence of a happy coexistence with a 14 yr old, having a<br/>\nvolatile relationship seems pretty bad.  None of us are in your house<br/>\nlistening to your interaction with your daughter, but, I don&#39;t see how a<br/>\nparent can appear happy and cheerful to a daughter that isn&#39;t measuring<br/>\nup in the parent&#39;s standards.  I think both of my kids would see that as<br/>\nbeing angry, or dissappointed, or something, but clearly not happy<br/>\ncoexistence, and certainly not pleasant.<br/>\n<br/>\nYour voice could be kind and patient, but your actions are not, and kids<br/>\nread those just as much as tone and presence.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: A Request for Feedback Regarding My RU Teen","postDate":"1223951005","msgId":39451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0OTMzMTZDLTcxRkYtNDM2RC1BOTNBLUFCRjUxQjM3RjIxOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg==","referencesHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":39450,"nextInTopic":39452,"prevInTime":39450,"nextInTime":39452,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"-=-It s the going around and around of all this that is just so exhausting. It is cyclical.-=- Yes.  It s a cycle that s causing problems, and we re trying to","messageBody":"<div id=\"ygrps-yiv-246210593\">-=-It&#39;s the going around and around of<br/>\nall this that is just so exhausting. It is cyclical.-=-<br/>\n<br/>\nYes.  It&#39;s a cycle that&#39;s causing problems, and we&#39;re trying to help  <br/>\nyou see how to stop the negative cycle.  You&#39;re blaming your  <br/>\ndaughter, but it&#39;s not your daughter&#39;s doing.<br/>\n<br/>\n<br/>\n-=-Yes, I do &quot;my daughter&#39;s&quot; chores when I cancel my participation in  <br/>\nher<br/>\nactivities. &quot;THE chores&quot; have to get done no matter what, so I do<br/>\nthem when she doesn&#39;t. However, I believe that my standards for the<br/>\nchores are actually deeply relaxed and, yet, there is a certain<br/>\nbaseline standard that I refuse to leave the house without it being<br/>\nmet. We&#39;re talking basic safety & hygiene, here. Nothing even close<br/>\nto extreme at all. The jobs are not *required* of her but I do need a<br/>\ncertain minimum of them done each day in order for our home to<br/>\nfunction, regardless of who they&#39;re done by. -=-<br/>\n<br/>\nThis might help you see this as a choice instead of as a &quot;have to.&quot;   <br/>\nI&#39;m guessing you haven&#39;t gotten a chance to look at the links about  <br/>\nchores, but please do look at them.  It&#39;s a small tweak with a large  <br/>\neffect.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chore/option\">http://sandradodd.com/chore/option</a><br/>\n<br/>\nYou referred to your &quot;RU Teen.&quot;  I&#39;d rather people use full terms on  <br/>\nthis list.   I question whether you should be using &quot;radical  <br/>\nunschooling&quot; if you&#39;re cranky about late hours and requiring lots of  <br/>\nchores.<br/>\n<br/>\nAnother request I&#39;ve made before on this list is for people to really  <br/>\nlook at the euphemisms they might be using, and be honest with  <br/>\nterminology.   To call chores &quot;family jobs&quot; is just a euphemism.  At  <br/>\nmy house there are NO chores.  Zero.  Chore means &quot;unpleasant  <br/>\ntask.&quot;   But we don&#39;t have another tricky  name for chores either.   <br/>\nWe call things what they are.  There is yard work, and laundry.   <br/>\nThere&#39;s cooking (which is fun).  There&#39;s filing books and putting  <br/>\ngames and DVDs back on shelves.  Each thing is done because we need  <br/>\nthe new work space or because we&#39;re looking for something and it&#39;s  <br/>\neasier when things.  One of us puts towels in each bathroom.  When  <br/>\none bathroom is nearly out of toilet paper, they all get toilet  <br/>\npaper.  When it&#39;s the night before trash day, a couple or three  <br/>\npeople go around and empty trash from various little trashcans.   <br/>\nSomeone (not always the same person) takes the can to the curb.   If  <br/>\nI were the only one living here, I would do it all myself, but I&#39;m  <br/>\nnot so I don&#39;t.  Neither do I assign any jobs to anyone else.<br/>\n<br/>\nI know it must seem impossible to picture for anyone who hasn&#39;t  <br/>\nreally, truly and fully let it go and been willing to do it.<br/>\n<br/>\nSame with most of the other parenting aspects of radical  <br/>\nunschooling.  Same with the deschooling itself.  Anyone who isn&#39;t  <br/>\nwilling to take the risk cannot have the benefit.  Anyone who won&#39;t  <br/>\nlet it go until it happens will not have it happen a their house.<br/>\n<br/>\nTo say &#39;I had to cancel my participation&#39; instead of &quot;I told her I  <br/>\nwon&#39;t drive her anywhere before noon&quot; is a dodge.  Mindful parenting  <br/>\nwon&#39;t come without clarity of thought.<br/>\n<br/>\n<br/>\n<br/>\n-=-I call them family jobs because the children like having dishes to  <br/>\nuse for eating, too. If they were to opt out of using any were there  <br/>\nno clean ones available, I could see them not minding making an even  <br/>\nbigger mess with their food if there were no plate/bowl underneath it  <br/>\nbecause then they&#39;d likely opt out of cleaning that up, too. -=-<br/>\n<br/>\nAh.  You didn&#39;t go to Joyce&#39;s site and read what she has to say about  <br/>\ndishes, or you wouldn&#39;t have written this.<br/>\n<br/>\nBefore you post again, please do read what you&#39;ve missed about  <br/>\nchores.  You would have saved SO much energy and time already had you  <br/>\nread those things a year and a half ago.<br/>\n<br/>\n<br/>\n-=-We&#39;ve discussed this one before and she chooses classes over hired  <br/>\nhouse-cleaning help if there is not the option for both. For a short  <br/>\nwhile, we tried an arrangement of her contributing funds from her  <br/>\nbabysitting work to help contribute toward a little bit of hired help  <br/>\nwith the chores (her idea as an alternative to participating in them  <br/>\nherself). -=-<br/>\n<br/>\nThat&#39;s a LOT of words to say (I think) that if she didn&#39;t want to do  <br/>\nchores she would have to pay someone else to do them.  This is not  <br/>\nrelationship building.<br/>\n<br/>\n<br/>\n<br/>\n-=-We have also been down a path of experimentation where I did not ask<br/>\n<br/>\nfor any help with any jobs. Yes, Dd contributed voluntarily, but,<br/>\nyes, it was far less than was realistic to sustain things. The result<br/>\nis that there was far less of me to be available for serving her<br/>\ninterests and yet she kept plugging for my contributions toward her<br/>\ninterest. -=-<br/>\n<br/>\n&quot;A path of experimentation&quot; is not a commitment.  I&#39;m guessing  your  <br/>\nexperiment lasted a couple of weeks.  Just as with deschooling, the  <br/>\nmore you&#39;ve required, the more a child will celebrate the lack of  <br/>\nrequirements by &quot;doing nothing&quot; at first.  A child who hasn&#39;t been  <br/>\nallowed to have food will gorge if the rules are lifted.  You can&#39;t  <br/>\nsay &quot;I&#39;m going to experiment with letting  you play all the video  <br/>\ngames you want for a week,&quot; and NOT expect the child to play 20 hours  <br/>\na day, knowing you&#39;re about to go back to the rules.<br/>\n<br/>\n-=-yet she kept plugging for my contributions toward her interest.  <br/>\nThis pattern effectively dried up my availability to my son and HIS  <br/>\ninterests, which did not sit well with me. -=-<br/>\n<br/>\nYou blame her in harsh words for your life not being more pleasant.   <br/>\nIt&#39;s not loving.  It&#39;s not kind.<br/>\n<br/>\nMaybe if your goal could be learning, and unschooling, more than  <br/>\nkindness, you could make choices with that foremost.<br/>\n<br/>\n-=-So we sat down and I explained to Dd how, if she wanted these  <br/>\nthings from me, I needed more from her in the way of reliable help  <br/>\nwith the jobs. That her contribution toward them meant more of me to  <br/>\nserve her.-=-<br/>\n<br/>\nThis &quot;serve her&quot; sounds a little oogie now, especially since it  <br/>\nsounds like you were (perhaps ad nauseum) explaining to her how she  <br/>\nneeds to serve you if she wants her unschooling life to be rich and  <br/>\nfull.<br/>\n<br/>\n-=-Sandra, you asked for details regarding my participation in my  <br/>\ndaughter&#39;s activities. -=-<br/>\n<br/>\nNo, I asked for a rephrasing of &quot;had to cancel my participation in my  <br/>\ndaughter&#39;s activities.&quot;  I have three kids, each of whom was fourteen  <br/>\nfor a full year.  I know what it means to support their activities,  <br/>\nto drive them around, to wait during classes.   What I don&#39;t know is  <br/>\n&quot;had to cancel my participation.&quot;<br/>\n<br/>\nYou chose to refuse to do something, but you had a fancy way of  <br/>\ndodging the responsibility for that decision.  Maybe you&#39;re even in  <br/>\ndenial within yourself of the kinds of limits and conditions you&#39;re  <br/>\nputting on  your daughter.<br/>\n<br/>\nYour relationship sounds very adversarial.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/adversaries\">http://sandradodd.com/adversaries</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205473509,"authorName":"Jennifer Ironstone","from":"&quot;Jennifer Ironstone&quot; &lt;vitalharvest@...&gt;","profile":"vitalharvest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: A Request for Feedback Regarding My RU Teen","postDate":"1223950340","msgId":39450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMHY2NCthZjlkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":39449,"nextInTopic":39451,"prevInTime":39449,"nextInTime":39451,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"Oh, I d also like to respond to the assumptive comment that I am angry when my daughter wakes up in the afternoon/goes to sleep very late -- I am not *angered*","messageBody":"<div id=\"ygrps-yiv-34793129\">Oh, I&#39;d also like to respond to the assumptive comment that I am angry <br/>\nwhen my daughter wakes up in the afternoon/goes to sleep very late --<br/>\n<br/>\n<br/>\nI am not *angered* by this pattern of hers.  I was feeling afraid for <br/>\nher well-being as many people in my life say things like &quot;that is not <br/>\nnormal&quot; as in &quot;unhealthy&quot; and/or that it is &quot;unacceptable&quot;, etc.  <br/>\nObviously, these are their opinions and not my own but with so many <br/>\npeople saying it and no one to refer to that was/is like us, I became <br/>\nfearful and doubted things.  Again, I am so grateful for the <br/>\nreassurance of this group.  Thank you again.</div>","specialLinks":[]},{"userId":205473509,"authorName":"Jennifer Ironstone","from":"&quot;Jennifer Ironstone&quot; &lt;vitalharvest@...&gt;","profile":"vitalharvest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: A Request for Feedback Regarding My RU Teen","postDate":"1223948810","msgId":39449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMHRtYStoMHQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":39447,"nextInTopic":39450,"prevInTime":39448,"nextInTime":39450,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"Thank you, everyone, for your replies. It is good to know that her sleeping habits are normal amongst Unschooled teens.  We aren t close with any other RU","messageBody":"<div id=\"ygrps-yiv-41714226\">Thank you, everyone, for your replies.<br/>\n<br/>\n<br/>\nIt is good to know that her sleeping habits are normal amongst <br/>\nUnschooled teens.  We aren&#39;t close with any other RU teens and no one <br/>\nelse in our little community of friends is doing anything remotely <br/>\nlike this (even our fellow Unschooling families) so it is VERY helpful <br/>\nto get your feedback in this area.  This part was the main thing I was <br/>\nhoping to get clarity about with my inquiry.  I had already assumed it <br/>\nwas normal, at least for my daughter, because it is simply what is in <br/>\nher reality.  <br/>\n<br/>\n<br/>\nFrom what I see of your responses, this pattern is normal for teens <br/>\nwho are allowed to decide on their own sleeping habits and that is <br/>\nreassuring to know because I don&#39;t like being the only ones!  (Or, <br/>\nrather, I like knowing that we are not so unusual in as many areas as <br/>\nit sometimes feels.  I don&#39;t mind being different, I love it actually, <br/>\nbut with too many things it begins to cause doubt for me.)<br/>\n<br/>\n<br/>\nI LOVE the idea of middle-of-the-night household work!  We&#39;ve <br/>\ndiscussed it and are going to give it a try.<br/>\n<br/>\n<br/>\nBased on some of your responses, I want to elaborate on where I am <br/>\ncoming from in my intentions.  I have always placed mothering my <br/>\nchildren above all other priorities on my list of life goals.  Yes, <br/>\nkindness is my first priority as far as my values go, and mothering is <br/>\nthe vehicle for my kindness as action.  I love nothing more in this <br/>\nworld as much as serving my children and seeing them happy and <br/>\ncreating/getting what they want from life.  That said, I have had to <br/>\nlearn the hard way that I do not want to support their happiness at <br/>\nthe *expense of my own*, which has been a difficult hurdle for me as <br/>\nmy own mother was big on sacrifice and suffering in the name of <br/>\nmothering and was, thus, confused yet outwardly and inwardly unkind.  <br/>\nThis resulted in my extreme dislike for her (my mother) for many,  <br/>\nmany years which, unfortunately, wasn&#39;t resolved before her tragic <br/>\ndeath at age 56 when I was 30, already a mother for nearly 7 years at <br/>\nthe time, and only just beginning to want to get close to her again.  <br/>\nI&#39;ve learned that I think I would have much preferred a kind mother <br/>\nand less options than the many options and stressed-out, demanding <br/>\nmother that were my reality.<br/>\n<br/>\n<br/>\nYes, I do &quot;my daughter&#39;s&quot; chores when I cancel my participation in her <br/>\nactivities.  &quot;THE chores&quot; have to get done no matter what, so I do <br/>\nthem when she doesn&#39;t.  However, I believe that my standards for the <br/>\nchores are actually deeply relaxed and, yet, there is a certain <br/>\nbaseline standard that I refuse to leave the house without it being <br/>\nmet.  We&#39;re talking basic safety & hygiene, here.  Nothing even close <br/>\nto extreme at all.  The jobs are not *required* of her but I do need a <br/>\ncertain minimum of them done each day in order for our home to <br/>\nfunction, regardless of who they&#39;re done by.  There is also the very <br/>\nreal issue of time constraints.  We have no electric dishwasher, live <br/>\nin a tiny little house and eat almost all our meals at home -- so the <br/>\ndishes are a big deal as are any piles of anything around here.  <br/>\n<br/>\n<br/>\nAs far as the suggestion of hiring outside help with the chores:  I do <br/>\nnot have money for that.  I have a very, very limited income.  Nearly <br/>\n70% of my kids&#39; classes are free programs and the others are all <br/>\nreduced-fee/sliding-scale/trade kinds of arrangements.  The money that <br/>\nI do have for their interests is kind of an either/or thing -- classes <br/>\nOR services like house-cleaning help.  We&#39;ve discussed this one <br/>\nbefore and she chooses classes over hired house-cleaning help if there <br/>\nis not the option for both.  For a short while, we tried an <br/>\narrangement of her contributing funds from her babysitting work to <br/>\nhelp contribute toward a little bit of hired help with the chores (her <br/>\nidea as an alternative to participating in them herself).  It didn&#39;t <br/>\nlast, however, because she quickly realized how expensive it was <br/>\ncompared to her realistic earning ability and my limited ability to <br/>\ncontribute financially to the situation, as well.<br/>\n<br/>\n<br/>\nI call them family jobs because the children like having dishes to use <br/>\nfor eating, too.  If they were to opt out of using any were there no <br/>\nclean ones available, I could see them not minding making an even <br/>\nbigger mess with their food if there were no plate/bowl underneath it <br/>\nbecause then they&#39;d likely opt out of cleaning that up, too.  Then <br/>\nthere would be even more cleaning jobs to do.  Personally, I like to <br/>\nkeep the jobs as minimal as possible since there is only so much of me <br/>\nto go around and, again, there is literally no other adult picking up <br/>\nany of the slack, here, and it&#39;s been this way for the better part of <br/>\nmy entire parenting career.  Furthermore, I have health issues that <br/>\ngreatly limit my energies.  <br/>\n<br/>\n<br/>\nWe have also been down a path of experimentation where I did not ask <br/>\nfor any help with any jobs.  Yes, Dd contributed voluntarily, but, <br/>\nyes, it was far less than was realistic to sustain things.  The result <br/>\nis that there was far less of me to be available for serving her <br/>\ninterests and yet she kept plugging for my contributions toward her <br/>\ninterest.  This pattern effectively dried up my availability to my son <br/>\nand HIS interests, which did not sit well with me.  So we sat down and <br/>\nI explained to Dd how, if she wanted these things from me, I needed <br/>\nmore from her in the way of reliable help with the jobs.  That her <br/>\ncontribution toward them meant more of me to serve her.  She gets it <br/>\nentirely but just doesn&#39;t always remember the logic in the day-to-day <br/>\nof things, which I understand.  It&#39;s the going around and around of <br/>\nall this that is just so exhausting.  It is cyclical.<br/>\n<br/>\n<br/>\nSo, basically, I am just running myself too thin. I am the single <br/>\ndriver, food-maker, house-cleaner, day-planner and supporter-of-<br/>\neverything else financially, physically, energetically, mentally, <br/>\nemotionally, etc. I have tried to maintain the same level of life-<br/>\nquality for her even though her contributions and their quality have <br/>\ndeclined because, frankly, I want her to have these things as much as <br/>\nit is possible -- &#39;what is possible&#39; being the key factor. <br/>\n<br/>\n<br/>\nSandra, you asked for details regarding my participation in my <br/>\ndaughter&#39;s activities.  Here is the breakdown:<br/>\n<br/>\n<br/>\n*  paying fees when relevant<br/>\n*  organizing time/schedule-planning<br/>\n*  researching class/activity offerings (and discussing them with her <br/>\nwhich is surprisingly time-consuming)<br/>\n*  talking on the phone/orchestrating daily plans<br/>\n*  driving (huge time-sucker)<br/>\n*  waiting during activities and occupying her brother during the <br/>\nwaiting<br/>\n*  the biggie:  being available to receive and negotiate her Very <br/>\nFrequent requests for lots of things/experiences/opportunities/etc.  <br/>\n(I can elaborate on this one if requested.  Basically, my daughter is <br/>\na very energetic, highly-spirited person who makes tons of requests <br/>\nall the time - she&#39;s been this way for her whole life.  The requests <br/>\nare for information, activities, outings, material things, etc. etc. <br/>\netc. She&#39;s really into planning & doing lots and it all still needs to <br/>\ninvolve me to a large extent, being the only supporter of her <br/>\nreality.)<br/>\n<br/>\n<br/>\nAnyway, I want to mention also how thankful I am for all of your <br/>\ncritical feedback.  It is good to look at this stuff from as many <br/>\nangles as possible and I love that there is this group of people who <br/>\nare all paving their own paths as they go.  I am reminded of just how <br/>\nvaluable support is to me and that I may need to participate in this <br/>\ngroup more regularly so as not to feel so strange compared to nearly <br/>\neveryone else we know.  Most of our local Unschooling friends have <br/>\nchildren that are younger than my daughter&#39;s age, so she is kind of <br/>\nthe pioneer of our little community.  Friends come to US to ask what <br/>\nis normal for their child&#39;s age because I&#39;ve got the oldest one.</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Request for Feedback Regarding My RU Teen","postDate":"1223938579","msgId":39447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwREI5QUVGLUNGNjYtNEMwMS04ODEwLThGNTQzQjZFNEM5RkBtYWMuY29tPg==","inReplyToHeader":"PEYzMkIyRjkyLTgwQ0ItNDZFOC04REQwLTA4NkRBQzc2RDYwRUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPiA8NjdDNjZBN0UtRUNGMC00RENCLUFBRkEtMjQxMUU0NDE3RDBCQHNhbmRyYWRvZGQuY29tPiA8RUYxM0E3Q0JGMjZFNDM4MEJCMTU4NURDQjE1RDE3NjlATFlMQUxBUDI+IDxGMzJCMkY5Mi04MENCLTQ2RTgtOEREMC0wODZEQUM3NkQ2MEVAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":39446,"nextInTopic":39449,"prevInTime":39446,"nextInTime":39448,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... YES. This is what finally got me to completely let go of demands and resentment - I realized that I could yell or cry or shame the kids into submission,","messageBody":"<div id=\"ygrps-yiv-863217492\">On Oct 13, 2008, at 3:38 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; People never get the cleanest house in the world from forced child<br/>\n&gt; labor anyway. &lt;g&gt;  They get a half-assed job and a LOT of<br/>\n&gt; resentment.  Better to do it yourself and learn to have fun doing it,<br/>\n&gt; so others will want to help to get to hang out with you.<br/>\n<br/>\n<br/>\n </span></blockquote>YES. This is what finally got me to completely let go of demands and  <br/>\nresentment - I realized that I could yell or cry or shame the kids  <br/>\ninto submission, but they&#39;d really still not do much, and we&#39;d all be  <br/>\nunhappy. OR I could spend the time I&#39;d have been struggling with them  <br/>\ndoing some of the housework, doing it happily and with an attitude of  <br/>\ndoing it as a gift for them. WHAT a change in dynamics.<br/>\n<br/>\nHonestly, my kids don&#39;t do a lot of housework, definitely not as much  <br/>\nhousework as I would have tried to make them do. But it is very sweet  <br/>\nwhen they do it. I love walking into the kitchen, thinking I&#39;m going  <br/>\nto unload the dishwasher, and discover it&#39;s been done by someone else.  <br/>\nThat&#39;s something they seem to do whenever they see it needs doing. And  <br/>\nthey do all their own laundry unless I happen to think of offering to  <br/>\ndo it - which is only every few months. We&#39;re living in a house that  <br/>\nis often pretty messy - I can live with that for the sake of having  <br/>\nhappy times with my kids. When it gets to me, I clean up.<br/>\n<br/>\nHousework takes a lot less time than I used to think, too. I think  <br/>\nwhen I was a kid and my mom made me do housework that it was such a  <br/>\nnegative experience, with all the badgering and complaining and  <br/>\nresisting, that I built it all up in my head and I think of each task  <br/>\nas HUGE! But I figured out that I can almost completely clean the  <br/>\nkitchen, including doing a big load of dishes, in the time it takes  <br/>\nfor my coffee maker to make one pot of coffee. So I do that almost  <br/>\nevery morning and having a clean kitchen makes the rest of the messy  <br/>\nhouse a lot easier to handle, for me.<br/>\n<br/>\nBy the way, one of my kids lives in her own house now and her  <br/>\nhousekeeping is a lot like mine - somewhat neglected in favor of more  <br/>\nenticing activities, then deep cleaned in a big huge burst of  <br/>\nhousekeeping frenzy. Her house always seems really nice and tidy and  <br/>\ncomfortable to me, but that&#39;s me - I&#39;m used to a lot of clutter from  <br/>\nall the stuff we&#39;re always doing.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Coming out of the closet","postDate":"1223937961","msgId":39446,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNTc2QjcyLURCNTYtNDc1Qi1BREJBLTk1OUNGOTFFMTc2OUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJBWTEwNi1XMTRCMjhCRUM0ODhCOUI1NUU4ODU0OUE1MzYwQHBoeC5nYmw+","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPiA8NjdDNjZBN0UtRUNGMC00RENCLUFBRkEtMjQxMUU0NDE3RDBCQHNhbmRyYWRvZGQuY29tPiA8QkFZMTA2LVcxNEIyOEJFQzQ4OEI5QjU1RTg4NTQ5QTUzNjBAcGh4LmdibD4="},"prevInTopic":39445,"nextInTopic":39447,"prevInTime":39445,"nextInTime":39447,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"-=-Each year, with her encouragement, I buy a curriculum that I never use.-=- This part I don t understand.  What a waste of money.  And it has become a kind","messageBody":"<div id=\"ygrps-yiv-1759383854\">-=-Each year, with her encouragement, I buy a curriculum that I never  <br/>\nuse.-=-<br/>\n<br/>\nThis part I don&#39;t understand.  What a waste of money.  And it has  <br/>\nbecome a kind of a lie.<br/>\n<br/>\n-=-Our lives are very much intertwined. -=-<br/>\n<br/>\nAnd yet you&#39;re not honest with her?<br/>\n<br/>\nYou didn&#39;t say how old your children are.<br/>\n<br/>\n-=-she says that kids need to learn certain things at certain times,  <br/>\nif for no other reason than to not look stupid to others. I think  <br/>\nthat is absolutely ridiculous, but I am having a hard time talking  <br/>\nher out of this mindset. My kids are brilliant. -=-<br/>\n<br/>\nDon&#39;t try to talk her out of it.  Let it be.  But don&#39;t let her be  <br/>\nthe one who decides they &quot;look stupid,&quot; either.  Or if she thinks so,  <br/>\nkeep your kids where they can&#39;t hear it.<br/>\n<br/>\n-=-. I guess I&#39;ll have to come clean. Any thoughts?-=-<br/>\n<br/>\nI still think the vacation plan is best.  Fighting with her or  <br/>\nfeeling stressed during recovery won&#39;t help.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Coming out of the closet","postDate":"1223937818","msgId":39445,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMGl1cStwNHRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEwNi1XMTRCMjhCRUM0ODhCOUI1NUU4ODU0OUE1MzYwQHBoeC5nYmw+"},"prevInTopic":39444,"nextInTopic":39446,"prevInTime":39444,"nextInTime":39446,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... (however loosely). But I am getting ready to have a significant surgery, and will be staying with her for recovery (for 6 weeks). She wants me to bring our","messageBody":"<div id=\"ygrps-yiv-408101248\"><blockquote><span title=\"ireply\">&gt; I have been comfortable letting her think we are using a curriculum<br/>\n </span></blockquote>(however loosely). But I am getting ready to have a significant surgery,<br/>\nand will be staying with her for recovery (for 6 weeks). She wants me to<br/>\nbring our &quot;school&quot; so that the kids won&#39;t get behind. I asked the kids<br/>\nif they would like to use their curriculum for several weeks, and they<br/>\nlooked at me like I was nuts. I guess I&#39;ll have to come clean. Any<br/>\nthoughts?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>The very first thought I had was that when you are in surgery, you could<br/>\ndeclare a vacation for your kids as well.  If you aren&#39;t really wanting<br/>\nto have a big curriculum discussion vs. unschooling discussion with her<br/>\nright before you have surgery.  Perhaps you could put together some fun<br/>\nactivities where your mom only needs to drop them off places or take<br/>\nthem places.  Perhaps have a series of movies and books and activities<br/>\nthat all kind of relate to each other that take up lots of time in a<br/>\nrelaxed kind of way that keeps the kids looking busy and gives your mom<br/>\nsomething to do that feels helpful.<br/>\n<br/>\nYou could even use something from the curriculum as the inspiration for<br/>\nthe activities and call it the hands on activity development or<br/>\nsomething.  Since you did already tell her that you use the curriculum<br/>\nloosely, she could see it&#39;s loose usage and help put it in action.  You<br/>\ncould tell her that you only &quot;do&quot; school from 10-noon each day and some<br/>\ndays you go out.  So during 10-noon they could watch movies and do<br/>\nlittle grandma crafts.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Request for Feedback Regarding My RU Teen","postDate":"1223937506","msgId":39444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzMkIyRjkyLTgwQ0ItNDZFOC04REQwLTA4NkRBQzc2RDYwRUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEVGMTNBN0NCRjI2RTQzODBCQjE1ODVEQ0IxNUQxNzY5QExZTEFMQVAyPg==","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPiA8NjdDNjZBN0UtRUNGMC00RENCLUFBRkEtMjQxMUU0NDE3RDBCQHNhbmRyYWRvZGQuY29tPiA8RUYxM0E3Q0JGMjZFNDM4MEJCMTU4NURDQjE1RDE3NjlATFlMQUxBUDI+"},"prevInTopic":39443,"nextInTopic":39445,"prevInTime":39443,"nextInTime":39445,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"-=-our entire relationship has shifted with these changes and i wouldn t trade the cleanest house in the world for the way things were before.-=- People never","messageBody":"<div id=\"ygrps-yiv-1632043611\">-=-our entire relationship has shifted with these changes and i  <br/>\nwouldn&#39;t trade the cleanest house in the world for the way things  <br/>\nwere before.-=-<br/>\n<br/>\nPeople never get the cleanest house in the world from forced child  <br/>\nlabor anyway. &lt;g&gt;  They get a half-assed job and a LOT of  <br/>\nresentment.  Better to do it yourself and learn to have fun doing it,  <br/>\nso others will want to help to get to hang out with you.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Coming out of the closet","postDate":"1223937382","msgId":39443,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzMTIwM0VFLTJGQUItNDlDRi05MUFDLTBCM0M0MDVGOUQ5MEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDI3YWEyYWU4MDgxMDEzMTUyN3IyOWM0YTIyN2o3NWRhMWZkNGUwNDZiYmY3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPiA8NjdDNjZBN0UtRUNGMC00RENCLUFBRkEtMjQxMUU0NDE3RDBCQHNhbmRyYWRvZGQuY29tPiA8QkFZMTA2LVcxNEIyOEJFQzQ4OEI5QjU1RTg4NTQ5QTUzNjBAcGh4LmdibD4gPDI3YWEyYWU4MDgxMDEzMTUyN3IyOWM0YTIyN2o3NWRhMWZkNGUwNDZiYmY3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39442,"nextInTopic":39444,"prevInTime":39442,"nextInTime":39444,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"-=-If it were me, I would just tell my mom that the family will be stressed enough just dealing with your surgery & recovery so that you are declaring a ","messageBody":"<div id=\"ygrps-yiv-1642910862\">-=-If it were me, I would just tell my mom that the family will be<br/>\nstressed enough just<br/>\ndealing with your surgery & recovery so that you are declaring a<br/>\nvacation from school<br/>\nuntil you are fully recuperated.-=-<br/>\n<br/>\n<br/>\n<br/>\nI agree with this.  And make it clear that as they learn all year  <br/>\nanyway, the WHOLE time should be total vacation.  If she breaths the  <br/>\nleast school-sounding thing, you would only need to say the single  <br/>\nword &quot;vacation.&quot;  (Thinking of Pam&#39;s &quot;towel&quot; here.)<br/>\n<br/>\nMeanwhile, maybe they could show her cool stuff on youTube or on DVDs  <br/>\nor they could do art together and you&#39;d know they were learning but  <br/>\nshe would think &quot;vacation&quot; and if she forgot you could say &quot;vacation.&quot;<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Coming out of the closet","postDate":"1223937298","msgId":39442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVFODQ3MkFCLTcwRTMtNDY2My1CRTk1LUI4NDA5OTBCQjFEREBtYWMuY29tPg==","inReplyToHeader":"PEJBWTEwNi1XMTRCMjhCRUM0ODhCOUI1NUU4ODU0OUE1MzYwQHBoeC5nYmw+","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPiA8NjdDNjZBN0UtRUNGMC00RENCLUFBRkEtMjQxMUU0NDE3RDBCQHNhbmRyYWRvZGQuY29tPiA8QkFZMTA2LVcxNEIyOEJFQzQ4OEI5QjU1RTg4NTQ5QTUzNjBAcGh4LmdibD4="},"prevInTopic":39441,"nextInTopic":39443,"prevInTime":39441,"nextInTime":39443,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... Tell her no. Say, No, I m not planning to do that. Stop there. If she keeps talking about it say something like, I ve decided that I want them to have","messageBody":"<div id=\"ygrps-yiv-728399725\">On Oct 13, 2008, at 2:50 PM, Sheryl Lentine wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  She wants me to bring our &quot;school&quot; so that the kids won&#39;t get behind.<br/>\n<br/>\n </span></blockquote>Tell her no.<br/>\n<br/>\nSay, &quot;No, I&#39;m not planning to do that.&quot;<br/>\n<br/>\nStop there.<br/>\n<br/>\nIf she keeps talking about it say something like, &quot;I&#39;ve decided that I  <br/>\nwant them to have this time free from other worries or stress.&quot;<br/>\n<br/>\nBut you don&#39;t have to explain any more than that. If she argues, use  <br/>\nthe &quot;I&#39;ll give that some thought,&quot; line, but just stick to your guns.<br/>\n<br/>\nAlso, I&#39;m wondering why you all are going to live next door - why  <br/>\ndoesn&#39;t she just come help you out and let you stay in your own house?  <br/>\nSeems that would be so much more comfortable for you and the kids.<br/>\n<br/>\nI hope MY kids want to live next door and all that &lt;G&gt;, but you&#39;re a  <br/>\ngrown woman with children and a husband and you shouldn&#39;t be afraid of  <br/>\nyour own mother anymore. Maybe ask yourself what the worst-case  <br/>\nscenario is if you stand up to her. How bad could it really be? YOU  <br/>\nhave control over her grandkids - ultimately YOU could keep her from  <br/>\neven seeing them at all. Seems to me that YOU have the power in this  <br/>\nrelationship but you don&#39;t act like it. Is it because your husband  <br/>\nworks for her? Maybe that&#39;s a really bad idea if it makes you feel you  <br/>\nhave to kowtow to her.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re: [AlwaysLearning] A Request for Feedback Regarding My RU Teen","postDate":"1223937061","msgId":39441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGMTNBN0NCRjI2RTQzODBCQjE1ODVEQ0IxNUQxNzY5QExZTEFMQVAyPg==","inReplyToHeader":"PDY3QzY2QTdFLUVDRjAtNERDQi1BQUZBLTI0MTFFNDQxN0QwQkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPiA8NjdDNjZBN0UtRUNGMC00RENCLUFBRkEtMjQxMUU0NDE3RDBCQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":39439,"nextInTopic":39442,"prevInTime":39440,"nextInTime":39442,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"i totally agree with the other feedback you have gotten, and i have nothing much to add - except that i have a 13 year old and am a recent convert to *true* RU","messageBody":"<div id=\"ygrps-yiv-1299970375\">i totally agree with the other feedback you have gotten, and i have nothing much to add - except that i have a 13 year old and am a recent convert to *true* RU with regard to chores, sleep, food, all of it.  so perhaps from that perspective, my experience can provide some encouragement.  i would say that until recently, the dynamic between my daughter and me (i have a son too, who&#39;s 10 - different dynamic) was markedly similar to what you describe. i felt torn between wanting help, acknowledgement, demonstration of  &quot;responsibility&quot; and all kinds of other things from her that were beyond her capabilities and really unreasonable for me to expect.<br/>\n<br/>\nalmost as SOON as i backed off and really listened - and really started giving to her unconditionally, and let go of ALL the power struggles, etc. - she shifted to a place of much more peace and willingness to contribute - both on her own initiative, and when i request it.  <br/>\n<br/>\nbut she is NOT responsible for keeping order in our home up to MY expectations.  and she needs nurturing still - in the form of small gestures like me making her bed at night (takes 20 seconds and makes her feel cared for and nurtured), me serving her meals and getting her snacks often (although because i am so willing to do it so often, if i ask her to do it herself she is absolutely fine with it.)<br/>\n<br/>\nour entire relationship has shifted with these changes and i wouldn&#39;t trade the cleanest house in the world for the way things were before.  i have become acutely awared of just how little time left at home she likely has, and just how *extremeley* important our relationship is - above and beyond all else.  <br/>\n<br/>\ni highly recommend giving deep consideration to all the great advice you&#39;ve gotten here.<br/>\n<br/>\nwarmly, Lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":214171486,"authorName":"Heather","from":"Heather &lt;swingdancechick@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Coming out of the closet","postDate":"1223936863","msgId":39439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3YWEyYWU4MDgxMDEzMTUyN3IyOWM0YTIyN2o3NWRhMWZkNGUwNDZiYmY3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEJBWTEwNi1XMTRCMjhCRUM0ODhCOUI1NUU4ODU0OUE1MzYwQHBoeC5nYmw+","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPgkgPDY3QzY2QTdFLUVDRjAtNERDQi1BQUZBLTI0MTFFNDQxN0QwQkBzYW5kcmFkb2RkLmNvbT4JIDxCQVkxMDYtVzE0QjI4QkVDNDg4QjlCNTVFODg1NDlBNTM2MEBwaHguZ2JsPg=="},"prevInTopic":39437,"nextInTopic":39441,"prevInTime":39438,"nextInTime":39440,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"If it were me, I would just tell my mom that the family will be stressed enough just dealing with your surgery & recovery so that you are declaring a vacation","messageBody":"<div id=\"ygrps-yiv-1113628173\">If it were me, I would just tell my mom that the family will be<br/>\nstressed enough just<br/>\ndealing with your surgery & recovery so that you are declaring a<br/>\nvacation from school<br/>\nuntil you are fully recuperated.<br/>\n<br/>\nAnd about knowing the state capitals...<br/>\nDoes she know them all?  And if so, what use is that knowledge to her?<br/>\nI&#39;d just her I&#39;m not worried about my kids, because if they need to<br/>\nknow the capital of some particular state<br/>\nat some future point in time, they know how to look it up on google in seconds.<br/>\n<br/>\nheather<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Oct 13, 2008 at 2:50 PM, Sheryl Lentine &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shlentine@...\">shlentine@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello,<br/>\n&gt;<br/>\n&gt; I was hoping for some advice from some of you all experienced USers. I have<br/>\n&gt; been unschooling for several years now, and am FULLY convinced that I am<br/>\n&gt; doing the right thing. Trouble is, I have a mother that I am very close to.<br/>\n&gt; She lives next door to us, employs my husband, etc. Our lives are very much<br/>\n&gt; intertwined. Each year, with her encouragement, I buy a curriculum that I<br/>\n&gt; never use. I have hinted at our convictions, without ever telling her, that<br/>\n&gt; my kids use the curriculum in a very non-traditional way (if at all). Each<br/>\n&gt; time, I have mentioned it, she says that kids need to learn certain things<br/>\n&gt; at certain times, if for no other reason than to not look stupid to others.<br/>\n&gt; I think that is absolutely ridiculous, but I am having a hard time talking<br/>\n&gt; her out of this mindset. My kids are brilliant. They are good at many<br/>\n&gt; different things, even experts on several subjects, but they can&#39;t tell you<br/>\n&gt; all the state capitals. That REALLY bothers her.<br/>\n&gt;<br/>\n&gt; I have been comfortable letting her think we are using a curriculum (however<br/>\n&gt; loosely). But I am getting ready to have a significant surgery, and will be<br/>\n&gt; staying with her for recovery (for 6 weeks). She wants me to bring our<br/>\n&gt; &quot;school&quot; so that the kids won&#39;t get behind. I asked the kids if they would<br/>\n&gt; like to use their curriculum for several weeks, and they looked at me like I<br/>\n&gt; was nuts. I guess I&#39;ll have to come clean. Any thoughts? </span></blockquote></div>","specialLinks":[]},{"userId":130798593,"authorName":"Sheryl Lentine","from":"Sheryl Lentine &lt;shlentine@...&gt;","profile":"shlentine","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Coming out of the closet","postDate":"1223934631","msgId":39437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNi1XMTRCMjhCRUM0ODhCOUI1NUU4ODU0OUE1MzYwQHBoeC5nYmw+","inReplyToHeader":"PDY3QzY2QTdFLUVDRjAtNERDQi1BQUZBLTI0MTFFNDQxN0QwQkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPiA8NjdDNjZBN0UtRUNGMC00RENCLUFBRkEtMjQxMUU0NDE3RDBCQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":39436,"nextInTopic":39439,"prevInTime":39436,"nextInTime":39438,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"Hello, I was hoping for some advice from some of you all experienced USers.  I have been unschooling for several years now, and am FULLY convinced that I am","messageBody":"<div id=\"ygrps-yiv-949507544\">Hello,<br/>\n <br/>\nI was hoping for some advice from some of you all experienced USers.  I have been unschooling for several years now, and am FULLY convinced that I am doing the right thing.  Trouble is, I have a mother that I am very close to.  She lives next door to us, employs my husband, etc.  Our lives are very much intertwined.  Each year, with her encouragement, I buy a curriculum that I never use.  I have hinted at our convictions, without ever telling her, that my kids use the curriculum in a very non-traditional way (if at all).  Each time, I have mentioned it, she says that kids need to learn certain things at certain times, if for no other reason than to not look stupid to others.  I think that is absolutely ridiculous, but I am having  a hard time talking her out of this mindset.  My kids are brilliant.  They are good at many different things, even experts on several subjects, but they can&#39;t tell you all the state capitals.  That REALLY bothers her.  <br/>\n <br/>\nI have been comfortable letting her think we are using a curriculum (however loosely).  But I am getting ready to have a significant surgery, and will be staying with her for recovery (for 6 weeks).  She wants me to bring our &quot;school&quot; so that the kids won&#39;t get behind.  I asked the kids if they would like to use their curriculum for several weeks, and they looked at me like I was nuts.  I guess I&#39;ll have to come clean.  Any thoughts?<br/>\n <br/>\nSheryl<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nStay up to date on your PC, the Web, and your mobile phone with Windows Live.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/MRT/go/msnnkwxp1020093185mrt/direct/01/\">http://clk.atdmt.com/MRT/go/msnnkwxp1020093185mrt/direct/01/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Request for Feedback Regarding My RU Teen","postDate":"1223933486","msgId":39436,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3QzY2QTdFLUVDRjAtNERDQi1BQUZBLTI0MTFFNDQxN0QwQkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPg==","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPg=="},"prevInTopic":39435,"nextInTopic":39437,"prevInTime":39435,"nextInTime":39437,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"-=-Hello Unschooling friends. I joined this group nearly a year and a half ago. I posted a bit in the beginning but haven t really been around much other than","messageBody":"<div id=\"ygrps-yiv-458399278\">-=-Hello Unschooling friends. I joined this group nearly a year and a<br/>\nhalf ago. I posted a bit in the beginning but haven&#39;t really been<br/>\naround much other than a bit of searching for specific info here and<br/>\nthere, since. -=-<br/>\n<br/>\n<br/>\n<br/>\nHaving read your original post twice, and all the responses,  my  <br/>\nfirst comment is that had you read this list for the past year and a  <br/>\nhalf, you wouldn&#39;t have any of the problems you&#39;ve reported to us.   <br/>\nWe can help, but I maybe you should switch to getting the list by e- <br/>\nmail.  I suspect you intended to just read the responses to this one  <br/>\nquestion on the list.  By doing that, though, you won&#39;t have a feel  <br/>\nfor which of the posters are who and how, and that can make a  <br/>\ndifference in how you see their responses.<br/>\n<br/>\nVery often, the question someone asks isn&#39;t leading to the answer  <br/>\nthey need.  They&#39;re not sure what they need.  That&#39;s why coming  here  <br/>\noccasionally for specific info didn&#39;t net you the full set of  <br/>\nknowledge that would have  helped you move smoothly from having a  <br/>\ntwelve year old girl to having a really happy fourteen year old whose  <br/>\ncompany you were enjoying.<br/>\n<br/>\nIt&#39;s not too late to make changes, but that year 13 is gone.  Don&#39;t  <br/>\nlet fourteen and fifteen pass by the same way.<br/>\n<br/>\nBy the time I got to this part:  &quot;So our household has become very   <br/>\nunpredictable and volatile&quot; it didn&#39;t seem at ALL &quot;unpredictable&quot; to  <br/>\nme.  It seemed inevitable.<br/>\n<br/>\n-=-So our household has become very unpredictable and volatile due to  <br/>\nher constant deal-breaking and pattern of hostility.-=-<br/>\n<br/>\nHow might your daughter describe the situation?  (It doesn&#39;t matter  <br/>\nto us, but you might want to consider it, if you can.)<br/>\n<br/>\n-=-The sleep issue is also affected by her tendency toward  <br/>\nopposition. -=-<br/>\n<br/>\nWas she born with a &quot;tendency toward opposition&quot;?  Or is she  <br/>\nresponding rationally to too much control?<br/>\n<br/>\n-=-She has been honest and said that she wishes she could just have  <br/>\nall the activities and interests AND my high level of service to her -=-<br/>\n<br/>\nWhat you define as your &quot;high level of service to her&quot; might be what  <br/>\nothers here would consider being a good mom.  It&#39;s your job to make  <br/>\nher life easier.  It sounds like you&#39;re making her life hard in some  <br/>\nways, and she&#39;s trying both verbally and through action to  <br/>\ncommunicate with you and you&#39;re ignoring the messages in favor of  <br/>\njudging her oppositional, volatile...<br/>\n<br/>\nI think it would help immensely if you change your policy on chores.   <br/>\nThe first result will be she won&#39;t want to do anything, but that&#39;s  <br/>\nbecause you didn&#39;t start sooner.  It will get worse unless you do  <br/>\nsomething to make it better.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a><br/>\n<br/>\nand there&#39;s more at<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nMy kids all have slept when they wanted to.  Each night we talk about  <br/>\nwho needs to be up when, and whether they have an alarm set or want  <br/>\nto be woken up.  We always have done that.  It&#39;s friendly.  We keep  <br/>\nthe house quiet until noon if possible, and even after if people are  <br/>\nsleeping and there&#39;s no pressing need to use a vacuum or blender.  If  <br/>\neveryone&#39;s awake before noon, the noise can commence.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/sleeping\">http://sandradodd.com/sleeping</a><br/>\n<br/>\nThe boys had jobs at 14 and 15, respectively.  They&#39;re now 19 and  <br/>\n22.  Both of them have had early morning jobs (6:30 five days a week,  <br/>\nfor Marty, for over a year), and both have had late-night jobs.   <br/>\nThey&#39;ve had no problems.<br/>\n<br/>\nHolly is more variable in her sleep schedule.  She&#39;s nearly 17 and  <br/>\nhas just come out of a time of sleeping ten hours or  every night.   <br/>\nShe needs less sleep now than she did.   She just filled in a long  <br/>\nonline application for Toys R Us, applying to work stocking shelves  <br/>\nfor Christmas.  She checked all possible shifts, late and early, any  <br/>\nday of the week.  I don&#39;t know if she&#39;ll get the job, but she wasn&#39;t  <br/>\nlimiting herself to only afternoons.   If she needs to get up, she  <br/>\nwill.  Nowadays, when she wants to get up, she does.<br/>\n<br/>\nAnyone who&#39;s looking forward to what will happen when they wake up  <br/>\nwill be glad to wake up.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Request for Feedback Regarding My RU Teen","postDate":"1223931499","msgId":39435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGQkVGRjgzLTg5RDEtNDNCNi1BRjQ2LTk4MzU2NTVDNUJEOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE3MDg3MS44MjE2LnFtQHdlYjg2MjA4Lm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PDE3MDg3MS44MjE2LnFtQHdlYjg2MjA4Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":39433,"nextInTopic":39436,"prevInTime":39434,"nextInTime":39436,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"-=-even though it s been discussed ad nauseam. ... -=-I turn off of things that are discussed ad nauseum. -=- Everyone does.  That s why they call it ad","messageBody":"<div id=\"ygrps-yiv-1797678815\">-=-even though it&#39;s been discussed ad nauseam.<br/>\n-----------------snip------------------<br/>\n<br/>\n-=-I turn off of things that are discussed ad nauseum. -=-<br/>\n<br/>\n<br/>\n<br/>\nEveryone does.  That&#39;s why they call it &quot;ad naseum.&quot;  You keep on  <br/>\nuntil the other person is sick of it.<br/>\n<br/>\nI think it helps for a mom to write out what she&#39;s frustrated about  <br/>\nand let us point at what she wrote.  It will help her when she stops  <br/>\nbeing cranky and embarrassed about it, and it will help others who  <br/>\nread here to see how clearly someone&#39;s errors show when they pour it  <br/>\nall out at once this way.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Request for Feedback Regarding My RU Teen","postDate":"1223925145","msgId":39433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3MDg3MS44MjE2LnFtQHdlYjg2MjA4Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":39429,"nextInTopic":39435,"prevInTime":39432,"nextInTime":39434,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... I am wondering if those of you with teenagers and adult children could share your thoughts on the following. ... I don t have teenagers or adult children.","messageBody":"<div id=\"ygrps-yiv-84354073\">-----------------snip-------------------<br/>\n<br/>\nI am wondering if those of you with teenagers and adult children could <br/>\nshare your thoughts on the following.<br/>\n-----------------snip-------------------<br/>\n<br/>\nI don&#39;t have teenagers or adult children. My oldest child is 11. I, however, am an adult child and one who is applying the principles of unschooling throughout her life. As a suggestion, you might do well to open the question to all and not just to limit your respondents to those in a similar situation.<br/>\n<br/>\n-----------------snip------------------<br/>\nMy daughter, almost 14, has been going to sleep between 3 and 5 AM <br/>\nconsistently for months, now.  She sleeps until between 12 and 3 on <br/>\naverage, then wakes up and has just enough time to get dressed and eat <br/>\nbefore going to her many classes, activities, sleepovers, etc.  This <br/>\nsituation concerns me for several reasons.  She can&#39;t seem to go to <br/>\nsleep earlier than this without serious challenges biologically, nor <br/>\nis she very cooperative with my requests for her to try.  <br/>\n-----------------snip-----------------<br/>\n<br/>\nFrom the time I was 2 until I was in my 30&#39;s I stayed up late and slept late. It got more extreme in my early teens and stayed that way until I had Simon and Linnaea. And still, if things are stressful I will tend to stay up later in response. As guilty as I felt for being unable to sleep well, I can remember lying in bed at night, tossing and turning, listening to relaxation tapes, having mom or dad tell me to turn my light off, all of that, I never fell asleep easily before about 3 am. Much like your daughter tells you: <br/>\n<br/>\n&quot;For example, when I ask her to TRY to go to sleep earlier than 3-5AM, <br/>\nshe agrees to get into the bed at, say, 11 or 12 with a book (she&#39;s <br/>\nall too quick to make verbal agreements, that is the pattern, but then <br/>\nshe breaks them constantly).  Then, I often come out at 2 or 3 AM and <br/>\nshe tells me that she tried to go to sleep earlier but  it didn&#39;t <br/>\nwork, so there she is on the computer in her room or watching TV, <br/>\nagain. &quot;<br/>\n<br/>\nI could not go to sleep unless I was exhausted. I still can&#39;t. If I don&#39;t fall asleep right away I won&#39;t fall asleep without entertainment. I will lie in bed for hours and hours tossing and turning and getting more and more frustrated until the wee hours of the morning. No matter how tired I am. If, instead, I do something, like read a book or play on my ds or get up and watch television or spend time on the computer, I can fall asleep much more easily. Some nights I will fall asleep reading a book and then wake up enough to turn off the light and be woken too much in the process and the whole thing will start all over again. She isn&#39;t lying to you, she isn&#39;t yanking your chain, she is describing something that happens to me and has happened to me for much of my life. <br/>\n<br/>\nYou wrote: &quot;The sleep issue is also affected by her tendency toward opposition.&quot; A &quot;tendency toward opposition&quot; only comes up when there are requests that are made of someone that they feel oppositional about. I would argue, most strenously, that your perspective that she is staying up late to oppose you is wrong. Maybe not completely, maybe she is rebelling against you. But being a night owl is not unusual. And it isn&#39;t willful. I tried for years to go to sleep at a more &quot;normal&quot; hour, I used to take sleeping pills and melatonin as well as relaxation tapes. It didn&#39;t work, my clock just wasn&#39;t set for early to bed early to rise. <br/>\n<br/>\n-----------------snip------------------<br/>\nOne of the things I need is for her to contribute to the family jobs <br/>\nbefore going to her activities every day in order for me to provide <br/>\nthe level of service that she wants from me <br/>\n-----------------snip------------------<br/>\n<br/>\nWhat are the family jobs that you require from her? How are they negatively impacting your life if they aren&#39;t done. Our house is not the neatest of places much of the time. Dishes usually are done, vacuuming is occasionally done, sweeping and mopping rarely, I do laundry, but  often it isn&#39;t put away. None of that really negatively impacts my life unless I&#39;m having allergy moments. Usually, though, cleaning makes my allergies worse as I stir all the stuff up in the process. But maybe your family jobs are something different then household chores?<br/>\n<br/>\nSpeaking of family jobs, Simon and Linnaea could care less how clean the house is. Maybe there is a standard they have for cleanliness, but I haven&#39;t gotten too far gone for them. The standard of cleanliness that I tend to maintain is my own. It isn&#39;t a &quot;family&quot; job, it&#39;s a personal requirement. There are some things that David maintains to a level that is far beyond my awareness. He doesn&#39;t think about waxing the car as a family job, even though Linnaea and Simon may join in, it&#39;s something he wants to do because he likes the car to be protected from the elements. He doesn&#39;t hound me to clean the car or to change the oil or to check the brake pads. Those are things that are important to his sense of wellbeing, not mine. When we were dating he was appalled by the state of my car. I was fine with it. He didn&#39;t want me to drive it and would swap it for his fairly new truck. His standards are really different than mine. <br/>\n<br/>\n-----------------snip------------------<br/>\n(I am a single parent to <br/>\nher and her brother, who is 8, and am limited in what I can offer plus <br/>\nshe happens to have LOTS of interests, outside commitments and <br/>\nactivities).<br/>\n-----------------snip------------------<br/>\n<br/>\nIt is fantastic that her day is full of things to do and ways to explore the world. I imagine that it can feel overwhelming and disconnecting for you to have her be asleep or out all the time. Still, how fantastic that she is so engaged with so many things. Try and think about all the things that she is committed to as things that bring her joy. Think about helping her to achieve those things as ways of helping her to be happier, more fulfilled, more switched on. It will feel much nicer when you drive her to or pick her up from something or the other and you think about how fantastic it is that you get to help make this thing happen and you get that time between one thing and another with her. It is good to look at the bright side. And to find joy in giving to your children. <br/>\n<br/>\n-----------------snip------------------<br/>\nShe is very good at getting jobs done once she sets her <br/>\nmind to it but seems confused about how it all works logistically, <br/>\neven though it&#39;s been discussed ad nauseam.  <br/>\n-----------------snip------------------<br/>\n<br/>\nI turn off of things that are discussed ad nauseum. I don&#39;t hear when it moves to more than one repetition. My face goes blank and I start thinking about other things or getting really resentful of the speaker. It often feels patronising and rude. Even if I&#39;m being rude in response.<br/>\n<br/>\nWhy are the jobs difficult to comprehend? Is there a standard that you are asking her to achieve? Beth Fuller tells a story of when she used to be quite obsessed with being the perfect homemaker. Her husband Kevin wanted to give her a gift so he vacuumed the whole house, all of it, every room, for her. She smiled and thanked him and started doing it all again because he hadn&#39;t made straight lines with the vacuum cleaner. Are you expecting there to be ruler straight lines in your carpet? Are you asking her to do for you like she was a cleaning service and you need the plates washed and dried and put away in such and such way? I may just not be clear on what the &quot;family jobs&quot; are that you need to have done. <br/>\n<br/>\nLinnaea wants the computer. And a chocolate shake. Sorry I couldn&#39;t write more. <br/>\n<br/>\nSchuyler<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Request for Feedback Regarding My RU Teen","postDate":"1223921015","msgId":39429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzREE2NTA1LTcyMTEtNDlCOS1BNTcwLUI0MUNEOUMxNkU3NkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPg==","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPg=="},"prevInTopic":39428,"nextInTopic":39433,"prevInTime":39428,"nextInTime":39430,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"-=-Lately, I ve had to cancel my participation in several of her classes and activities because things have escalated beyond what I can personally handle. -=- ","messageBody":"<div id=\"ygrps-yiv-1375461126\">-=-Lately, I&#39;ve had to cancel my participation in several of her classes<br/>\nand activities because things have escalated beyond what I can<br/>\npersonally handle. -=-<br/>\n<br/>\nCould you clarify that, please?<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: A Request for Feedback Regarding My RU Teen","postDate":"1223920872","msgId":39428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMDJkOCs2Y3Y3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPg=="},"prevInTopic":39426,"nextInTopic":39429,"prevInTime":39427,"nextInTime":39429,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... This has been a consistent pattern for my 14 yr old too!  However, I don t see this as a problem.  I think teens have a different biological clock than","messageBody":"<div id=\"ygrps-yiv-1897674867\"><blockquote><span title=\"ireply\">&gt; My daughter, almost 14, has been going to sleep between 3 and 5 AM<br/>\n&gt; consistently for months, now. She sleeps until between 12 and 3 on<br/>\n&gt; average, then wakes up and has just enough time to get dressed and eat<br/>\n&gt; before going to her many classes, activities, sleepovers, etc. This<br/>\n&gt; situation concerns me for several reasons. She can&#39;t seem to go to<br/>\n&gt; sleep earlier than this without serious challenges biologically, nor<br/>\n&gt; is she very cooperative with my requests for her to try.<br/>\n<br/>\n </span></blockquote>This has been a consistent pattern for my 14 yr old too!  However, I<br/>\ndon&#39;t see this as a problem.  I think teens have a different biological<br/>\nclock than children and adults.  The house is quiet and her time is<br/>\nuninterupted by her younger sibling.  She can talk to people from<br/>\ndifferent parts of the world because of the time difference, or she can<br/>\ndo other things on her computer without IM interuptions.<br/>\n<br/>\nI don&#39;t schedule anything involving her before noon, ever!  If I do,<br/>\nit&#39;s exceptional and she makes the effort to get to bed earlier and get<br/>\nup earlier because she wants to do the activity.  When she wakes up, I<br/>\ntry to ensure that she has at least an hour to get herself ready in a<br/>\nrelaxed way.  I also don&#39;t force her to attend any of her activities, or<br/>\nour activities.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; One of the things I need is for her to contribute to the family jobs<br/>\n&gt; before going to her activities every day in order for me to provide<br/>\n&gt; the level of service that she wants from me (I am a single parent to<br/>\n&gt; her and her brother, who is 8, and am limited in what I can offer plus<br/>\n&gt; she happens to have LOTS of interests, outside commitments and<br/>\n&gt; activities).<br/>\n<br/>\n </span></blockquote>This would be overwhelming for my daughter!  She wouldn&#39;t even begin to<br/>\nknow how to work under those conditions.  She helps out a lot though,<br/>\nespecially if I ask her kindly and give her the option of saying &quot;no&quot;. <br/>\nShe routinely cleans the bathroom that she uses without my asking.  It&#39;s<br/>\nmessy most of the time, but she will tidy it if I ask her, if there is a<br/>\nguest coming over or something of that nature since it would be the<br/>\nbathroom used by a guest.<br/>\n<br/>\nShe doesn&#39;t clean her room, nor do I ask her to.  She only sometimes<br/>\ndoes the dishes, but she will pick up stray dishes if she sees me doing<br/>\nthem.  Mostly though, I clean up after her because she clearly isn&#39;t<br/>\nready for that task of keeping a household in working order.  In common<br/>\nareas, she really does try to keep her mess contained to her area and is<br/>\nperfectly okay with a quick tidy up.<br/>\n<br/>\nAlso, she often does a poor job<br/>\n<blockquote><span title=\"ireply\"> &gt; at the chores, even though I&#39;ve seen her do way better work many<br/>\n&gt; times, until I approach her with what ends up turning into constant<br/>\n&gt; little micro-managing requests that negate the ability for her to<br/>\n&gt; contribute in the first place if I am needed to do so much guiding (it<br/>\n&gt; gets to where we need to stop the work she&#39;s doing and re-define what<br/>\n&gt; `doing the dishes&#39; means for the thousandth, for example).<br/>\n<br/>\n </span></blockquote>This is the biggest clue that you should stop what you are doing and<br/>\neither stop expecting her to help or accept what she gives to you<br/>\nwithout critique.  If she can&#39;t do the dishes alone, do them with her,<br/>\nyou wash, she dries and puts away.  Really it will go super fast and you<br/>\nwon&#39;t have to worry about wether or not they are clean.  Put her<br/>\nfavorite music on and do it at her pace.<br/>\n<br/>\n<br/>\n  So our household has become very<br/>\n<blockquote><span title=\"ireply\"> &gt; unpredictable and volatile due to her constant deal-breaking and<br/>\n&gt; pattern of hostility. This has become increasingly unrealistic and<br/>\n&gt; stressful for her brother and for me.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Take the pressure off.  Hire someone to come in and clean up major stuff<br/>\nevery other week, so that you have a quick tidy up every other week<br/>\nbefore the cleaning person gets there.  All of you can work on each room<br/>\nof the house together and pick up so that the cleaning person can clean<br/>\nthe floors and bathrooms or whatever it is that you feel absolutely is<br/>\nsoo super necessary for feeling like your house is clean.  Seriously, it<br/>\nwould take about an hour or 2 once every other week or once a week if<br/>\nyou so choose that option.  That is not much time at all!  If you can<br/>\nafford a lot of extra activities for your kids, you can afford<br/>\nhousecleaning service, they are really not very expensive.<br/>\n<br/>\n<br/>\nJust as an example, I have a family of 4 and I do dishes once a day and<br/>\nit takes literally about half and hour, sometimes an hour if it&#39;s really<br/>\nmessy.  That&#39;s such a small chunk of time, and it can be pleasant listen<br/>\nto music and contemplate life time.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The sleep issue is also affected by her tendency toward opposition.<br/>\n&gt; For example, when I ask her to TRY to go to sleep earlier than 3-5AM,<br/>\n&gt; she agrees to get into the bed at, say, 11 or 12 with a book (she&#39;s<br/>\n&gt; all too quick to make verbal agreements, that is the pattern, but then<br/>\n&gt; she breaks them constantly).<br/>\n<br/>\n </span></blockquote>She&#39;s trying to avoid you and get you off her back.  Unless that is your<br/>\ngoal with your relationship, stop trying to get her to do something she<br/>\nclearly doesn&#39;t want to or can&#39;t do!<br/>\n<br/>\n  Then, the next day, we&#39;re back at the same place of her<br/>\n<blockquote><span title=\"ireply\"> &gt; needing to sleep until very close to the time to leave and me feeling<br/>\n&gt; very stressed about her help toward the family jobs because, not only<br/>\n&gt; is she breaking her commitment to my need for her to do her share of<br/>\n&gt; housework a good deal of time before it&#39;s time to go to her activity,<br/>\n&gt; but shortly after she wakes up and for a while afterward is when she<br/>\n&gt; becomes very unkind in her language and behavior, uncooperative and<br/>\n&gt; deal-breaking, etc.<br/>\n<br/>\n </span></blockquote>Back to the housework.  I&#39;m actually trying to imagine what kind of<br/>\nhousehold chores you have since they seem to take precendence over all<br/>\nother things at your house other than making it to activities and<br/>\ngetting enough sleep.  I absolutely don&#39;t clean house everyday!  I can&#39;t<br/>\nimagine what kind of chores one would have to do EVERY day that is<br/>\ntaking up so much of life for your family!  The only things I do every<br/>\nday are dishes, kitty litter boxes, and feeding pets and people, that&#39;s<br/>\nit!  Other things happen here and there, laundry, yard work, clean up,<br/>\nfloor cleaning, but not every day.<br/>\n<br/>\nQuit making her life miserable and about meeting your expectations!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Lately, I&#39;ve had to cancel my participation in several of her classes<br/>\n&gt; and activities because things have escalated beyond what I can<br/>\n&gt; personally handle.<br/>\n<br/>\n </span></blockquote>So, when you cancel your participation, do you go home and do your<br/>\ndaughter&#39;s chores for her?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is a big part of why I have come to the place of canceling my<br/>\n&gt; offers of contribution toward her interests when she breaks her word<br/>\n&gt; about our agreements. Kindness is my very first priority as a person<br/>\n&gt; and as a parent<br/>\n<br/>\n </span></blockquote>However, everything you&#39;ve described is very very unkind to your<br/>\ndaughter, and yourself and you other child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve already told her that I am indefinitely unwilling to participate<br/>\n&gt; in any interests of hers that begin before 1 or 2 in the afternoon<br/>\n&gt; because of the patterns she has. I need for at least *me* to be clear<br/>\n&gt; about reality, here.<br/>\n<br/>\n </span></blockquote>There is nothing wrong with you deciding that your child needs enough<br/>\nsleep and being realistic about starting time of activities.  Before 1<br/>\nor 2 can be time well spent with your younger child or for you to get<br/>\nchores done and other work necessary for living.  After 1 or 2 can be<br/>\ndaughter time, relaxed and free from your expectations of what she<br/>\nshould be doing.  Go and take her to her activities and do all that fun<br/>\nstuff with her.  Create an atmosphere of fun and enjoyment with her<br/>\nwithout all that other stuff getting in the way.<br/>\n<br/>\nIf I know we have to get going sooner than my daughter would like, I&#39;ll<br/>\ngo in and wake her up with a nice warm cup of coffee and be kind and<br/>\ngentle with her to get her going.  I WANT her to be happy and relaxed,<br/>\nso I create whatever atmosphere will help that to happen!</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Request for Feedback Regarding My RU Teen","postDate":"1223918928","msgId":39426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBMzVGQTA3LTQwNzctNEQwNC04RjBFLTVBMTUzQ0ZBMzBGNUBjb3gubmV0Pg==","inReplyToHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPg==","referencesHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPg=="},"prevInTopic":39420,"nextInTopic":39428,"prevInTime":39425,"nextInTime":39427,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"... That s normal in my family.  Both my now 21 y.o. dd and 18 y.o. ds are still in bed, but they ll be up in time to drop Alex at his community college class","messageBody":"<div id=\"ygrps-yiv-1914708318\">On Oct 13, 2008, at 5:11 AM, Jennifer Ironstone wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hello Unschooling friends.  I joined this group nearly a year and a<br/>\n&gt; half ago.  I posted a bit in the beginning but haven&#39;t really been<br/>\n&gt; around much other than a bit of searching for specific info here and<br/>\n&gt; there, since.<br/>\n&gt;<br/>\n&gt; I am wondering if those of you with teenagers and adult children could<br/>\n&gt; share your thoughts on the following.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My daughter, almost 14, has been going to sleep between 3 and 5 AM<br/>\n&gt; consistently for months, now.  She sleeps until between 12 and 3 on<br/>\n&gt; average,<br/>\n<br/>\n </span></blockquote>That&#39;s normal in my family.  Both my now 21 y.o. dd and 18 y.o. ds are  <br/>\nstill in bed, but they&#39;ll be up in time to drop Alex at his community  <br/>\ncollege class (he starts at 12:30) and then on to the stables.   <br/>\nThey&#39;ve been night owls since age 12 or so.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; then wakes up and has just enough time to get dressed and eat<br/>\n&gt; before going to her many classes, activities, sleepovers, etc.  This<br/>\n&gt; situation concerns me for several reasons.  She can&#39;t seem to go to<br/>\n&gt; sleep earlier than this without serious challenges biologically,<br/>\n<br/>\n </span></blockquote>Exactly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; nor<br/>\n&gt; is she very cooperative with my requests for her to try.<br/>\n<br/>\n </span></blockquote>Have you ever tried to keep a hamster awake in the daytime?  Number  <br/>\none reason why kids get bitten &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; One of the things I need is for her to contribute to the family jobs<br/>\n&gt; before going to her activities every day in order for me to provide<br/>\n&gt; the level of service that she wants from me (I am a single parent to<br/>\n&gt; her and her brother, who is 8, and am limited in what I can offer plus<br/>\n&gt; she happens to have LOTS of interests, outside commitments and<br/>\n&gt; activities).  She is very good at getting jobs done once she sets her<br/>\n&gt; mind to it but seems confused about how it all works logistically,<br/>\n&gt; even though it&#39;s been discussed ad nauseam.<br/>\n&gt;<br/>\n&gt; For example, she constantly tries to re-negotiate her way out of doing<br/>\n&gt; the jobs that she&#39;s previously agreed to.  It&#39;s at the point where I<br/>\n&gt; have begun telling her that it&#39;s either re-negotiating or her daily<br/>\n&gt; activities that I can participate in because I do not have the time<br/>\n&gt; and physical/mental energy for both.  Also, she often does a poor job<br/>\n&gt; at the chores, even though I&#39;ve seen her do way better work many<br/>\n&gt; times, until I approach her with what ends up turning into constant<br/>\n&gt; little micro-managing requests that negate the ability for her to<br/>\n&gt; contribute in the first place if I am needed to do so much guiding (it<br/>\n&gt; gets to where we need to stop the work she&#39;s doing and re-define what<br/>\n&gt; `doing the dishes&#39; means for the thousandth, for example).<br/>\n<br/>\n </span></blockquote>Two things:<br/>\n<br/>\nMy dd does the dishes, but in the middle of the night, when she&#39;s  <br/>\nawake.  Is there some reason the chores have to be done in the  <br/>\nmorning?  I mean, vacuuming while people are sleeping would be rude,  <br/>\nand I myself don&#39;t do it in the morning while my kids are asleep, but  <br/>\nhand-washing dishes isn&#39;t noisy.<br/>\n<br/>\nSecondly, does she know what you expect -- I mean, does she really?   <br/>\nYou may think she does, but if she hasn&#39;t been taught to do it the way  <br/>\nyou expect, you can&#39;t hold her to your standard.<br/>\n<br/>\nIt sounds like she&#39;s getting you back by doing a poor job (passive  <br/>\naggression, maybe).  Try accepting the way she finds works best for  <br/>\nher, even if its not exactly how you would do it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; She has been honest and said that she wishes she could just have all<br/>\n&gt; the activities and interests AND my high level of service to her<br/>\n&gt; without having to contribute anything in the way of family jobs in<br/>\n&gt; exchange.  She seems not to want to let go of that wish and it appears<br/>\n&gt; to be a driving force in our daily exchanges.  Also, she has become<br/>\n&gt; increasingly hostile toward me when I remind her of her agreements and<br/>\n&gt; commitments to the job she&#39;s previously agreed to for the day  the<br/>\n&gt; one that ensures that she can be driven to her activity/activities for<br/>\n&gt; *that day* in exchange for.  So our household has become very<br/>\n&gt; unpredictable and volatile due to her constant deal-breaking and<br/>\n&gt; pattern of hostility.  This has become increasingly unrealistic and<br/>\n&gt; stressful for her brother and for me.<br/>\n<br/>\n </span></blockquote>Why don&#39;t you knock it off, then?  You&#39;re the one in control, not her  <br/>\n-- except, of course, if she doesn&#39;t do what you want.  You&#39;re giving  <br/>\nher that power, but it&#39;s her only power.  How about letting go of the  <br/>\njobs, doing them yourself, lowering your standards, etc.?  Find a way  <br/>\nto take her out of the equation.  It takes two to fight.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The sleep issue is also affected by her tendency toward opposition.<br/>\n&gt; For example, when I ask her to TRY to go to sleep earlier than 3-5AM,<br/>\n&gt; she agrees to get into the bed at, say, 11 or 12 with a book (she&#39;s<br/>\n&gt; all too quick to make verbal agreements, that is the pattern, but then<br/>\n&gt; she breaks them constantly).  Then, I often come out at 2 or 3 AM and<br/>\n&gt; she tells me that she tried to go to sleep earlier but  it didn&#39;t<br/>\n&gt; work, so there she is on the computer in her room or watching TV,<br/>\n&gt; again.  Then, the next day, we&#39;re back at the same place of her<br/>\n&gt; needing to sleep until very close to the time to leave and me feeling<br/>\n&gt; very stressed about her help toward the family jobs because, not only<br/>\n&gt; is she breaking her commitment to my need for her to do her share of<br/>\n&gt; housework a good deal of time before it&#39;s time to go to her activity,<br/>\n&gt; but shortly after she wakes up and for a while afterward is when she<br/>\n&gt; becomes very unkind in her language and behavior, uncooperative and<br/>\n&gt; deal-breaking, etc.<br/>\n<br/>\n </span></blockquote>If she goes to sleep at 3 to 5 a.m., and, like all teens, needs 10 to  <br/>\n12 hours of sleep every day, she&#39;s not going to wake up rested until 3  <br/>\nto 5 p.m.  She wakes up to a mom angry at her for *sleeping,* stressed  <br/>\nabout some stupid household chore, calling her a &quot;Deal breaker,&quot; etc.   <br/>\nI&#39;d be unkind, too.  I&#39;d avoid contact with that mom, and I&#39;d be  <br/>\ncranky and uncooperative, too.<br/>\n<br/>\nNow, if my mom *honored* my sleep pattern, recognized that I truly  <br/>\n*cannot fall asleep* sooner than 3 a.m., cannot wake without 10 to 12  <br/>\nhours&#39; sleep, was kind enough to arrange her day to accommodate my  <br/>\nneeds, I might feel more kind and cooperative.  I might suggest doing  <br/>\nthe chores after mom and brother go to bed, so mom wakes to a clean  <br/>\nkitchen, for instance (I call my dd a &quot;house elf,&quot; after Harry  <br/>\nPotter).  And I always say &quot;thank you.&quot;  When I drive my son to a  <br/>\nfriend&#39;s house, he alway says &quot;thanks mom&quot; when he gets out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Lately, I&#39;ve had to cancel my participation in several of her classes<br/>\n&gt; and activities because things have escalated beyond what I can<br/>\n&gt; personally handle.<br/>\n<br/>\n </span></blockquote>What do you have to do in her activities, beyond providing  <br/>\ntransportation and perhaps fees?  Would you have no time and energy to  <br/>\ndo these things if you did all the housework your daughter is failing  <br/>\nto do?  Perhaps you both need to cut back.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Again, there are no other adults committed to<br/>\n&gt; providing for her, so it is up to her and I to create our own reality,<br/>\n&gt; here.<br/>\n<br/>\n </span></blockquote>She might be doing more than she truly wants or needs to do; mine each  <br/>\nhad one activity at a time.  We didn&#39;t try to do lots of classes or  <br/>\nsports.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  There is also my son that I am equally committed to, but it<br/>\n&gt; always seems that Dd&#39;s behavior and interests dominate my time and<br/>\n&gt; energy.<br/>\n&gt;<br/>\n&gt; This is a big part of why I have come to the place of canceling my<br/>\n&gt; offers of contribution toward her interests when she breaks her word<br/>\n&gt; about our agreements.<br/>\n<br/>\n </span></blockquote>Does she have a real choice in these agreements?  If you can cancel,  <br/>\ncan she?<br/>\n<br/>\nIn my home, I&#39;ve never, ever required chores.  If I ask one of my kids  <br/>\nto help or to do something, they do it.  If they ask for my help, like  <br/>\ndriving somewhere, I do it.  No negotiations, though a &quot;Can I do it a  <br/>\nlittle later?&quot; is always a possibility; I try to not ask while  <br/>\nsomeone&#39;s in the middle of a video game, etc.  Now, my *husband,* on  <br/>\nthe other hand, does want to see them help in exchange for their  <br/>\nallowance ($20 a week each, which they use for their own pets, lunches  <br/>\nout, and games tournament entry fees).  There are a few things we  <br/>\nparents don&#39;t usually do anymore, like scooping the yard.  Other  <br/>\nthings, like folding laundry, are done by anyone in the room at the  <br/>\ntime.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Kindness is my very first priority as a person<br/>\n&gt; and as a parent and I&#39;ve learned not to try to push myself past my own<br/>\n&gt; limits so as to continue providing opportunities to my daughter<br/>\n&gt; because I become unkind to myself, to her, and even to my son by way<br/>\n&gt; of his passive involvement when I don&#39;t honor my limits and abilities.<br/>\n&gt; I am also wanting to honor her limits and it appears that her behavior<br/>\n&gt; is more honest about them than her words are, so that is also my<br/>\n&gt; intention in canceling some activities).<br/>\n&gt;<br/>\n&gt; I&#39;ve already told her that I am indefinitely unwilling to participate<br/>\n&gt; in any interests of hers that begin before 1 or 2 in the afternoon<br/>\n&gt; because of the patterns she has.  I need for at least *me* to be clear<br/>\n&gt; about reality, here.<br/>\n<br/>\n </span></blockquote>If she needs to sleep, *she* shouldn&#39;t be making plans that early.  If  <br/>\nthe plans are truly important to *her,* she can be responsible for  <br/>\ngetting there.  Take yourself out of the equation.  If it&#39;s something  <br/>\nyour son wants to do, leave your 14 y.o. daughter home to sleep.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; If anyone has some feedback or experience to share, I would be so<br/>\n&gt; grateful.<br/>\n&gt;<br/>\n&gt; Thank you in advance.<br/>\n<br/>\n </span></blockquote>Hope that helps,<br/>\nNancy</div>","specialLinks":[]},{"userId":205473509,"authorName":"Jennifer Ironstone","from":"&quot;Jennifer Ironstone&quot; &lt;vitalharvest@...&gt;","profile":"vitalharvest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"A Request for Feedback Regarding My RU Teen","postDate":"1223899895","msgId":39420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjdmR0bis5Zm11QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39426,"prevInTime":39419,"nextInTime":39421,"topicId":39420,"numMessagesInTopic":0,"msgSnippet":"Hello Unschooling friends.  I joined this group nearly a year and a half ago.  I posted a bit in the beginning but haven t really been around much other than a","messageBody":"<div id=\"ygrps-yiv-261030289\">Hello Unschooling friends.  I joined this group nearly a year and a <br/>\nhalf ago.  I posted a bit in the beginning but haven&#39;t really been <br/>\naround much other than a bit of searching for specific info here and <br/>\nthere, since.  <br/>\n<br/>\nI am wondering if those of you with teenagers and adult children could <br/>\nshare your thoughts on the following.<br/>\n<br/>\n<br/>\nMy daughter, almost 14, has been going to sleep between 3 and 5 AM <br/>\nconsistently for months, now.  She sleeps until between 12 and 3 on <br/>\naverage, then wakes up and has just enough time to get dressed and eat <br/>\nbefore going to her many classes, activities, sleepovers, etc.  This <br/>\nsituation concerns me for several reasons.  She can&#39;t seem to go to <br/>\nsleep earlier than this without serious challenges biologically, nor <br/>\nis she very cooperative with my requests for her to try.  <br/>\n<br/>\nOne of the things I need is for her to contribute to the family jobs <br/>\nbefore going to her activities every day in order for me to provide <br/>\nthe level of service that she wants from me (I am a single parent to <br/>\nher and her brother, who is 8, and am limited in what I can offer plus <br/>\nshe happens to have LOTS of interests, outside commitments and <br/>\nactivities).  She is very good at getting jobs done once she sets her <br/>\nmind to it but seems confused about how it all works logistically, <br/>\neven though it&#39;s been discussed ad nauseam.  <br/>\n<br/>\nFor example, she constantly tries to re-negotiate her way out of doing <br/>\nthe jobs that she&#39;s previously agreed to.  It&#39;s at the point where I <br/>\nhave begun telling her that it&#39;s either re-negotiating or her daily <br/>\nactivities that I can participate in because I do not have the time <br/>\nand physical/mental energy for both.  Also, she often does a poor job <br/>\nat the chores, even though I&#39;ve seen her do way better work many <br/>\ntimes, until I approach her with what ends up turning into constant <br/>\nlittle micro-managing requests that negate the ability for her to <br/>\ncontribute in the first place if I am needed to do so much guiding (it <br/>\ngets to where we need to stop the work she&#39;s doing and re-define what <br/>\n`doing the dishes&#39; means for the thousandth, for example).  <br/>\n<br/>\nShe has been honest and said that she wishes she could just have all <br/>\nthe activities and interests AND my high level of service to her <br/>\nwithout having to contribute anything in the way of family jobs in <br/>\nexchange.  She seems not to want to let go of that wish and it appears <br/>\nto be a driving force in our daily exchanges.  Also, she has become <br/>\nincreasingly hostile toward me when I remind her of her agreements and <br/>\ncommitments to the job she&#39;s previously agreed to for the day  the <br/>\none that ensures that she can be driven to her activity/activities for <br/>\n*that day* in exchange for.  So our household has become very <br/>\nunpredictable and volatile due to her constant deal-breaking and <br/>\npattern of hostility.  This has become increasingly unrealistic and <br/>\nstressful for her brother and for me.  <br/>\n<br/>\nThe sleep issue is also affected by her tendency toward opposition.  <br/>\nFor example, when I ask her to TRY to go to sleep earlier than 3-5AM, <br/>\nshe agrees to get into the bed at, say, 11 or 12 with a book (she&#39;s <br/>\nall too quick to make verbal agreements, that is the pattern, but then <br/>\nshe breaks them constantly).  Then, I often come out at 2 or 3 AM and <br/>\nshe tells me that she tried to go to sleep earlier but  it didn&#39;t <br/>\nwork, so there she is on the computer in her room or watching TV, <br/>\nagain.  Then, the next day, we&#39;re back at the same place of her <br/>\nneeding to sleep until very close to the time to leave and me feeling <br/>\nvery stressed about her help toward the family jobs because, not only <br/>\nis she breaking her commitment to my need for her to do her share of <br/>\nhousework a good deal of time before it&#39;s time to go to her activity, <br/>\nbut shortly after she wakes up and for a while afterward is when she <br/>\nbecomes very unkind in her language and behavior, uncooperative and <br/>\ndeal-breaking, etc.<br/>\n<br/>\nLately, I&#39;ve had to cancel my participation in several of her classes <br/>\nand activities because things have escalated beyond what I can <br/>\npersonally handle.  Again, there are no other adults committed to <br/>\nproviding for her, so it is up to her and I to create our own reality, <br/>\nhere.  There is also my son that I am equally committed to, but it <br/>\nalways seems that Dd&#39;s behavior and interests dominate my time and <br/>\nenergy.  <br/>\n<br/>\nThis is a big part of why I have come to the place of canceling my <br/>\noffers of contribution toward her interests when she breaks her word <br/>\nabout our agreements.  Kindness is my very first priority as a person <br/>\nand as a parent and I&#39;ve learned not to try to push myself past my own <br/>\nlimits so as to continue providing opportunities to my daughter <br/>\nbecause I become unkind to myself, to her, and even to my son by way <br/>\nof his passive involvement when I don&#39;t honor my limits and abilities.  <br/>\nI am also wanting to honor her limits and it appears that her behavior <br/>\nis more honest about them than her words are, so that is also my <br/>\nintention in canceling some activities).<br/>\n<br/>\nI&#39;ve already told her that I am indefinitely unwilling to participate <br/>\nin any interests of hers that begin before 1 or 2 in the afternoon <br/>\nbecause of the patterns she has.  I need for at least *me* to be clear <br/>\nabout reality, here.<br/>\n<br/>\n<br/>\nIf anyone has some feedback or experience to share, I would be so <br/>\ngrateful.<br/>\n<br/>\nThank you in advance.</div>","specialLinks":[]}],"prevTopicId":40364,"nextTopicId":40416}}