{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] CBS news:  CBS Needs Education on Homeschooling, Say Advocates","postDate":"1066329524","msgId":83015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOEVFNUI0LjYwMDA4MDZAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGJtbWUxOStxdGtmQGVHcm91cHMuY29tPg=="},"prevInTopic":83010,"nextInTopic":0,"prevInTime":83014,"nextInTime":83016,"topicId":83010,"numMessagesInTopic":0,"msgSnippet":"**The series concluded by noting that no states require criminal background checks of the parents who homeschool their children.** Is the government","messageBody":"<div id=\"ygrps-yiv-502663079\">**The series concluded by noting that no states<br/>\nrequire &quot;criminal background checks&quot; of the parents who<br/>\nhomeschool their children.**<br/>\n<br/>\nIs the government considering preventing criminals from having children?<br/>\n<br/>\nThat would be different.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":66170646,"authorName":"V","from":"&quot;V&quot; &lt;live2learninscv@...&gt;","profile":"live2learninscv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"CBS news:  CBS Needs Education on Homeschooling, Say Advocates","postDate":"1066318697","msgId":83010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtbWUxOStxdGtmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":83015,"prevInTime":83009,"nextInTime":83011,"topicId":83010,"numMessagesInTopic":0,"msgSnippet":"CBS Needs Education on Homeschooling, Say Advocates Keep the letters & calls going my friends! It is making them notice! Vicky CBS Needs Education on","messageBody":"<div id=\"ygrps-yiv-1605403756\">CBS Needs Education on Homeschooling, Say Advocates<br/>\n<br/>\nKeep the letters & calls going my friends!<br/>\nIt is making them notice!<br/>\nVicky<br/>\n<br/>\nCBS Needs Education on Homeschooling, Say Advocates<br/>\nBy Marc Morano<br/>\nCNSNews.com Senior Staff Writer<br/>\nOctober 16, 2003<br/>\n<br/>\n(CNSNews.com) - Homeschooling advocates are accusing CBS<br/>\nNews of trying to damage their reputation with a two-part report<br/>\nfocusing on the &quot;dark side&quot; of the &quot;largely unregulated&quot;<br/>\nhomeschool movement. The reports aired Monday and Tuesday<br/>\nnights.<br/>\n<br/>\n&quot;Those who may be opposed to home education are digging<br/>\naround the bottom of the barrel, looking for marginal cases,<br/>\nfamilies who have troubles that far exceed any educational<br/>\nquestion,&quot; said Hal Young, president of North Carolinians for<br/>\nHome Education.<br/>\n<br/>\nYoung was the only person in the Eye on America segments<br/>\nwho defended the practice of homeschooling.<br/>\nAccording to the CBS reports, the practice of educating children<br/>\nat home carries with it the risk that children will be abused or<br/>\neven &quot;killed while homeschooling.&quot;<br/>\n<br/>\nWhile previewing the Eye on America investigation during CBS&#39;s<br/>\nThe Early Show Monday morning, Rather said the following:<br/>\n&quot;Homeschooling has produced some brilliant young minds, but<br/>\nthere is a dark side to the movement that can put some<br/>\nchildren&#39;s lives at risk.&quot;<br/>\n<br/>\nAn estimated 850,000 children are being homeschooled in the<br/>\nU.S., about 2 percent of the nation&#39;s total number of school-aged<br/>\nchildren, according to CBS.<br/>\n<br/>\nOn Monday, CBS News correspondent Vince Gonzales<br/>\npreviewed the following day&#39;s segment by saying: &quot;Tomorrow,<br/>\nhow children nationwide have been put in danger, even killed<br/>\nwhile homeschooling.&quot;<br/>\n<br/>\nThe two-part report included several examples of parents who<br/>\nhad &quot;taught their children at home&quot; but who had ended up<br/>\nabusing and killing the children. Texas mother Andrea Yates,<br/>\nwho drowned her five children in a bathtub, was listed as one of<br/>\nthe examples. The series concluded by noting that no states<br/>\nrequire &quot;criminal background checks&quot; of the parents who<br/>\nhomeschool their children.<br/>\nBut homeschooling advocates like Young are crying foul.<br/>\n&quot;It was plain from the tone of [CBS News&#39;] interview with me that<br/>\nthey had already made up their mind how the story was going to<br/>\nspin out, and they were simply fishing for sound bites in the<br/>\nquestions that they were asking,&quot; Young told CNSNews.com.<br/>\nIn Monday&#39;s first part, correspondent Gonzales reported on the<br/>\ndouble murder, suicide involving two teenage children killed by<br/>\ntheir brother, who subsequently took his own life in Johnston<br/>\nCounty, N.C. The CBS News report noted that the three children<br/>\nhad all been homeschooled and were outside the observation of<br/>\nthe county and state educational systems.<br/>\n<br/>\nBut J. Michael Smith, president of the Virginia-based Home<br/>\nSchool Legal Defense Association, said CBS News left out key<br/>\naspects of the family tragedy.<br/>\n<br/>\nThe CBS report did include one reference to how the parents of<br/>\nthe North Carolina children had tried to prevent social workers<br/>\nfrom visiting their youngsters, but Smith said, &quot;missing from the<br/>\nCBS story was that [North Carolina State] Social Services had<br/>\ncontacted the family 11 times, were well aware of the condition of<br/>\nthe home and had been working with the family.&quot;<br/>\n<br/>\nAccording to Smith, &quot;any fair-minded&quot; viewer of the broadcast<br/>\nwould have been left with the impression &quot;that homeschooling<br/>\nequals child abuse.&quot;<br/>\n<br/>\nThe first of the CBS reports, Smith said, was a &quot;shameless<br/>\nattempt to smear an entire community of committed, dedicated<br/>\nparents.&quot;<br/>\n<br/>\n&quot;We are outraged that CBS would ignore the obvious facts and<br/>\ndraw the erroneous conclusion that homeschoolers need to be<br/>\nstrictly regulated,&quot; he added.<br/>\n<br/>\nThe second segment on homeschooling concluded with CBS<br/>\nNews hinting that parents needed to be investigated for their<br/>\nchildren to be adequately protected.<br/>\n<br/>\n&quot;Unlike teachers, in 38 states and the District of Columbia,<br/>\nparents need virtually no qualifications to homeschool. Not one<br/>\nstate requires criminal background checks to see if parents have<br/>\nabuse convictions,&quot; Gonzales said during the broadcast.<br/>\nYoung was surprised CBS would imply that parents needed to<br/>\nget &quot;criminal background checks.&quot;<br/>\n<br/>\n&quot;That says that CBS feels all parents are suspect, and a criminal<br/>\nbackground check would probably be in order,&quot; Young said. &quot;Not<br/>\njust home educators, but all parents of preschoolers, parents of<br/>\nchildren who are home for summer vacation,&quot; he added.<br/>\nYoung also questioned CBS&#39;s motives for criticizing the lack of<br/>\nstate mandated criminal background checks for parents.<br/>\n&quot;Do they have an agenda that families should be presumed<br/>\ndysfunctional and in need of government intervention in the<br/>\nraising of their own children?&quot; Young asked.<br/>\n<br/>\n&#39;Out of the public eye&#39;<br/>\n<br/>\nAt the beginning of Tuesday&#39;s second segment, Rather<br/>\nconceded that the &quot;overwhelming majority&quot; of parents who<br/>\nhomeschool &quot;have only the best interests of their children at<br/>\nheart.&quot;<br/>\n<br/>\nBut then, Rather introduced Gonzales&#39;s report by telling his<br/>\naudience: &quot;A CBS News investigation found dozens of cases of<br/>\nparents convicted or accused of murder or child abuse who were<br/>\nteaching their children at home, out of the public eye.&quot;<br/>\nGonzales then profiled several cases nationwide in which<br/>\nhomeschooled children had been allegedly killed by their<br/>\nparents.<br/>\n<br/>\n&quot;Andrea Yates gained national attention when she drowned her<br/>\nfive children in a bathtub. Deanna Laney told investigators she<br/>\nbeat her three sons with rocks, killing two of them. Both mothers<br/>\ntaught their children at home,&quot; Gonzales said in the report<br/>\nbroadcast Tuesday evening.<br/>\n<br/>\nGonzales also found the &quot;private dark side&quot; in the education of a<br/>\nNational Spelling Bee participant.<br/>\n<br/>\n&quot;Marjorie Lavery says her father beat her before the National<br/>\nSpelling Bee, then threatened to kill her after she came in<br/>\nsecond. He pleaded guilty to child endangerment after she<br/>\ntestified about years of cruelty,&quot; Gonzales explained on the air.<br/>\nIan M. Slatter, the director of media relations at the Home School<br/>\nLegal Defense Association, said the CBS News reports were<br/>\ncompletely off base.<br/>\n<br/>\n&quot;They profiled some very troubling cases, [that] while tragic, did<br/>\nnot have anything to do with homeschooling. Homeschooling<br/>\nwas not the cause of the tragedies,&quot; Slatter told CNSNews.com.<br/>\n&quot;We definitely believe for CBS to broadcast this story, [the<br/>\nnetwork] displays a bias against homeschooling,&quot; Slatter added.<br/>\nCBS News Publicist Andie Silvers released a network statement<br/>\non the criticism from homeschooling advocates.<br/>\n<br/>\n&quot;These reports examined a group of people who are using<br/>\nhomeschooling as an excuse to hide the physical abuse they<br/>\ninflict on their children, a disturbing reality in this country,&quot; the<br/>\nCBS statement read. &quot;CBS News clearly reported that the<br/>\nmajority of parents who homeschool their kids are doing a fine<br/>\njob of teaching and raising their children.&#39;&quot;<br/>\n<br/>\n&#39;Smearing homeschoolers&#39;<br/>\n<br/>\nTim Graham, director of media analysis for the Media Research<br/>\nCenter, the parent organization of CNSNews.com, said CBS<br/>\nNews was attempting to discredit the whole homeschool<br/>\nmovement.<br/>\n<br/>\n&quot;CBS is doing two things wrong here. First, it&#39;s smearing<br/>\nhomeschoolers by association with child-killers like Andrea<br/>\nYates and perpetuating a stereotype that homeschoolers are<br/>\ndangerous parents,&quot; Graham said.<br/>\n<br/>\n&quot;Second, it&#39;s producing a heavy-handed advertisement for more<br/>\nregulation, insisting that only more government bureaucrats can<br/>\nprevent child homicides and suggesting that public schools are<br/>\na much safer option,&quot; Graham added.<br/>\n<br/>\nDespite CBS&#39;s negative portrayal of homeschooling, the practice<br/>\nhas defenders in high places.<br/>\n<br/>\nLynne Cheney, wife of Vice President Dick Cheney, and a senior<br/>\nfellow at the American Enterprise Institute (AEI), told<br/>\nCNSNews.com last April that homeschooling was a viable<br/>\nsolution to poor public schools.<br/>\n<br/>\n&quot;I think homeschooling is one of the greatly to be admired<br/>\nphenomena of our times. Families who have undertaken it have<br/>\nproduced some kids who know a remarkable amount and<br/>\nperform remarkably well,&quot; Cheney said.</div>","specialLinks":[]}],"prevTopicId":82992,"nextTopicId":83017}}