{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Michelle Harper","from":"&quot;Michelle Harper&quot; &lt;earthmagik@...&gt;","replyTo":"LIST","senderId":"aJYD5Bwfe0U-fFWV4pOT9WCx_DAzNLEVxoww9jRwPzII6dUzez_3TLLcIP4S0H9BJ_RDA-2aeohcKLvpkvZJ_4C1JmouuW4jOcqe90HZpPB9E6Pd","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT:Re: Smoking Tobacco","postDate":"965846188","msgId":11887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWMwMDIzMCRiYzFiZDQwMCRlYjZmOGFkMUBjb21wdXRlcj4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":11886,"nextInTime":11888,"topicId":11887,"numMessagesInTopic":0,"msgSnippet":"My husband and I both smoke, and have since we were very young......I think the health part has alot to do with the way you look at it, I believe what you","messageBody":"<div id=\"ygrps-yiv-1052711814\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div><font face=\"Arial\" size=\"2\">My husband and I both smoke, and have since we were \nvery young......I think the health part has alot to do with the way you look at \nit, I believe what you believe affects how you are affected by things.&nbsp; We \nhave been taught that tobacco(plain tobacco)&nbsp; is sacred, and carries&nbsp; \nprayers to the creator.&nbsp; We do not smoke mainstream brand cigerettes, only \n100% tobacco.....we think that the chemicals that are added to the tobacco, are \nwhat are most addicting &amp; harmful.&nbsp; And we choose not to give money to \nthe cigerette compnaies that put chemicals in their tobacco.&nbsp; But I&#39;ve \nthought alot on this topic, and I tend to think also that there are many other \nfactors contributing to lunge cancer, which are purposefully not being looked at \nclose enough.&nbsp; The pollution that cars &amp; trucks make in our cities \neveryday, must have an effect on the lungs, and no-one is about to say quit \ndriving..they aren&#39;t even going to suggest that this may CAUSE lung \ncancer.&nbsp; How about the pollutants of many businesses.and products.you see \nthe the clouds of chemical smoke going into the air, but are we stopping \nit??&nbsp;People use paints, and cleaning supplies that have harmful chemicals \nto the lungs, everyday. The war on tobacco companies is all about money...the \nfacts, and tests are propaganda for one side or the other in my \nopinion...if.you&nbsp;inflict any extreme ammount of any constituant on any \nthing for a duration of time, and it will become toxic...High levels , and \nextremes are toxic of any one thing..vitamins, Minerals nutrients, Our bodies \nare made as such we need a variety of different things at different stages and \ntimes(in my opinion)&nbsp; Everything in Moderation.... It is not the tobacco \nitself that is the culprit of lung cancer, in my opinion.&nbsp;I am not saying \nthat high levels of nicotine on an already weak lung will not affect it, surely \nit will. I think if one leads an overall healthy life, that this is very \nimportant &amp; this demonstrates respect for oneself, and the environment, but \nwhen it comes down to it, when the time comes , the time comes, whether you&#39;ve \nbeen a smoker or not.&nbsp; I do not think, personally that any death is before \nit&#39;s time, whatever the cause, and I&#39;am not dismmissing the pain caused by \nlosing&nbsp; a loved one.... , and mean deeply not to offend anyone who has lost \na family member whose autopsy stated lung cancer as the cause, Many Blessings to \nyou, and may they be in peace.....but I think the best thing to suggest if you \nwant to quit smoking is to either just STOP...or at least switch to an all \norganic tobacco, with no chemicals or additives, at least you will be more \nlikely to quit when you are ready, and won&#39;t be contributing hard earned dollars \nto a company you do not believe or trust in.&nbsp; Just my 2 cents.......Totally \nNOT intending to make anyone mad, or insult anyone else&#39;s beliefs on this \none.&nbsp; I also believe we all have a right to our place in the mind, meaning, \nI respect others to have the beliefs they have, and to be at the stage in life \nthey are in.&nbsp; Everything is in it&#39;s place, and everything is in \ntransition.&nbsp; But lastly, I do believe all plants, including tobacco to be \nSacred, a gift from the Earth MOther..and Tobacco particularly to be a Sacred \nplant , whose smoke carries our prayers to the Spirit world......I do not \nsupport BIg Tobacco COmpanies, or any other Large Corporate Entity.&nbsp; Many \nBlessings in fullfilling that which you want for yourself.&nbsp; \nMichelle*</font></div></html></div>","specialLinks":[]}],"prevTopicId":11885,"nextTopicId":11808}}