{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Need suggestions for dealing with distressed child","postDate":"1054056713","msgId":71046,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZC4yYTcwYzIxMy4yYzA0ZmIwOUBhb2wuY29tPg=="},"prevInTopic":70656,"nextInTopic":0,"prevInTime":71045,"nextInTime":71047,"topicId":70602,"numMessagesInTopic":0,"msgSnippet":"... I m really behind in responding to posts, but have you heard of the Feingold plan?  There s an article in this issue of Mothering and you can go to ","messageBody":"<div id=\"ygrps-yiv-2025840822\"><blockquote><span title=\"ireply\">&gt; I thought that he might be having a <br/>\n&gt; reaction to some things he had eaten (he&#39;s really sensitive to <br/>\n&gt; certain chemicals) <br/>\n<br/>\n </span></blockquote>I&#39;m really behind in responding to posts, but have you heard of the Feingold <br/>\nplan?  There&#39;s an article in this issue of Mothering and you can go to <br/>\nwww.feingold.org to get more info.<br/>\n<br/>\nI have a 4 year old, asthmatic, many allergies, very chemically sensitive.  <br/>\nWe&#39;ve been doing the plan for about a month and the change in my boy is <br/>\namazing!  The basic plan is to eliminate all artifical colors, flavors and <br/>\npreservatives and, for the first four weeks, all natural salycalites  (apples, grapes, <br/>\noranges, etc.).  It&#39;s hard at first and feels just so restrictive that it <br/>\ndrives you crazy.  But knowing that diet can help my son to feel better is worth <br/>\nit.  He used to have major meltdowns daily that lasted for an hour or two.  Now, <br/>\nhe still gets upset - what 4 year old doesn&#39;t - but he can work through it <br/>\nand get over it.  <br/>\n<br/>\nYesterday he had some Wendy&#39;s chicken nuggets and french fries after a <br/>\nbrownie and frozen waffle.  He felt like he was crawling out of his skin all day.  <br/>\n&quot;Too many chemicals, Mommy.&quot;  I think of the past month as a detox and now we <br/>\nwill be more careful what he eats.  He&#39;s been very involved in the whole <br/>\nprocess and likes being the way he is now.<br/>\n<br/>\nThis may be way off the mark for your situation, but I thought I&#39;d share.<br/>\n<br/>\nElizabeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8226888,"authorName":"Robin Clevenger","from":"&quot;Robin Clevenger&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: Need suggestions for dealing with distressed child","postDate":"1053841576","msgId":70656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTMtREFWMTU0MVRiZGtTbUwwMDAwMDAzZEBob3RtYWlsLmNvbT4=","referencesHeader":"PDEwNTM4MjkzNzcuMTk3OC4xMDQ2OS5tOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":70644,"nextInTopic":71046,"prevInTime":70655,"nextInTime":70657,"topicId":70602,"numMessagesInTopic":0,"msgSnippet":"From: Robyn Coburn  ","messageBody":"<div id=\"ygrps-yiv-332321103\">From: &quot;Robyn Coburn&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a>&gt;<br/>\n&lt;&lt;I thought that he might be having a reaction to some things he had<br/>\neaten (he&#39;s really sensitive to certain chemicals) and tried to get Alex<br/>\nto take some anti-histamine&gt;&gt;<br/>\n<br/>\nThe behavior you describe sounds *exactly* like my son if he gets any dairy<br/>\nin his system. He will get so manic, he&#39;ll throw himself against walls, run<br/>\naround in circles, break down weeping and screaming, etc. It&#39;s really<br/>\nfrightening, both to watch as a parent and feel helpless, and for him being<br/>\ninside of it and not knowing how to handle it. When it happens now, I just<br/>\ntake a deep breath, say to myself &quot;There&#39;s nothing he can do about this,<br/>\nhe&#39;s as scared and upset about this as I am&quot;, and just try and do as best as<br/>\nI can to keep him from hurting himself or others. I hold him if he wants<br/>\nholding, or try to give him options to help equalize the feelings he&#39;s<br/>\nhaving (safe things to bash on, like a big plastic baseball bat he can slam<br/>\nagainst a tree, or something similar), give him deep pressure squeezes if he<br/>\nwants that (sometimes it helps him feel more organized inside). I tell<br/>\nmyself that this will pass, and it always does. Fortunately, now that we&#39;ve<br/>\nidentified the triggers, eliminated most of the allergies that cause it via<br/>\nNAET (www.naet.com) and avoid the one that we haven&#39;t been able to eliminate<br/>\n(dairy), this happens very infrequently.<br/>\n<br/>\nI guess my best suggestions are to do your best to identify and either avoid<br/>\nor fix the allergic reactions that are happening for him. Once you do that,<br/>\nthis kind of day should be very rare and you can recognize it for what it<br/>\nis. When it happens, cancel all plans, remind yourself of the things that<br/>\nare important, and buckle in for the ride. Just try and help him through it.<br/>\nAfterwards, you can talk to him about it and help him understand what is<br/>\nhappening inside him. I know my son really hates the way it feels and he<br/>\nhates being out of control, so it really helps him if I just remind him that<br/>\nit is not his &quot;fault&quot; and that it will pass, it *will* be over. He knows<br/>\nthat I&#39;m on his side and not blaming him or trying to make him feel bad for<br/>\nanything. Mostly, like I said, I just have to make sure he doesn&#39;t hurt<br/>\nhimself or others (once, he almost managed to break through a window with<br/>\nhis body, he slammed into it so hard &lt;shudder&gt; ).<br/>\n<br/>\nIf you&#39;re concerned about how to approach this respectfully, just think<br/>\nabout how you&#39;d want to be treated if you had some kind of fit and a friend<br/>\nwas present. How could they best help you? It *is* hard to go through this.<br/>\nMake sure you are not around unsupportive people in this kind of time,<br/>\nbecause you sure don&#39;t need the extra stress of dealing with that, and<br/>\nneither does the child.<br/>\n<br/>\nBlue Skies!<br/>\n   -Robin-</div>","specialLinks":[]},{"userId":147376218,"authorName":"liza sabater","from":"liza sabater &lt;listdiva@...&gt;","profile":"lm_sabater","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Need suggestions for dealing with distressed child","postDate":"1053826189","msgId":70644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwOEQxMURBLThFNTAtMTFENy1BMTNFLTAwMDM5M0I4NEZCNkBjdWx0dXJla2l0Y2hlbi5jb20+","inReplyToHeader":"PGJhbzNoaCtoMzBnQGVHcm91cHMuY29tPg=="},"prevInTopic":70627,"nextInTopic":70656,"prevInTime":70643,"nextInTime":70645,"topicId":70602,"numMessagesInTopic":0,"msgSnippet":"Hi All, Time to jump in. First, I M BACK! I took a break from the boards after my father passed away. I just needed to have as much quiet time as I could get. ","messageBody":"<div id=\"ygrps-yiv-89525097\">Hi All,<br/>\n<br/>\nTime to jump in. First, I&#39;M BACK! I took a break from the boards after <br/>\nmy father passed away. I just needed to have as much quiet time as I <br/>\ncould get.<br/>\n<br/>\nLife in NYC is getting, let&#39;s say, more and more demanding what with <br/>\nthe recession we are experiencing (nobody wants to call it that, but I <br/>\nwill). So I took the time off to regroup. I must be feeling better <br/>\nbecause I definitely missed you all.<br/>\n<br/>\nI&#39;m happy I am back.<br/>\n<br/>\n<br/>\n<br/>\nNow to the subject at hand.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I thought that he might be having a<br/>\n&gt; reaction to some things he had eaten (he&#39;s really sensitive to<br/>\n&gt; certain chemicals) and tried to get Alex to take some anti-<br/>\n&gt; histamine.  He refused and became more hysterical.<br/>\n<br/>\n </span></blockquote>Lisa, I read your post and I have to say that it does sound like Alex <br/>\nwas having an allergic reaction of some sorts. That used to happen to <br/>\nmy Evan, who was consistently colicky until 6-8 months and <br/>\nintermittently until he was about 2 years old. Even these days (he <br/>\nturns 6 in August), when he is in a crabby mood and throwing tantrums <br/>\nfor no reason, I know it has to do more with a physical reaction than <br/>\nan emotional need.<br/>\n<br/>\nHow have I handled outbursts? He is not a hitter but he will throw <br/>\nhimself on the floor and in the process he has hurt himself. When he <br/>\nwas 3, I would just sit on the floor and hold him. By then, though, we <br/>\nwere on the right track, identifying all his allergies (17 markers) and <br/>\nmaking changes to our health care options. We use homeopathy and <br/>\nchiropractic medicine to deal with his allergies, eczema, asthma and <br/>\nirritable bowel syndrome. We use conventional allopathic drugs when the <br/>\nallergens (especially environmental ones like pollen or dust) are so <br/>\nbad that nothing works.<br/>\n<br/>\nWhen he was that little, after the episode, we would &#39;review&#39; it. We <br/>\nwould talk about what he went through and try to find the words to <br/>\ndescribe it. I remember being surprised by Evan&#39;s first own description <br/>\nof a throat infection --he described it as having a sandshrew stuck in <br/>\nhis throat (for all you Pokemon fans, guess which episode that <br/>\nreference comes from). Given the colic hell we lived through his first <br/>\n2 years of life, I have to say that his explanation was like winning <br/>\nthe lottery. There is nothing more depressing than to have your baby <br/>\nscreaming to the top of his lungs and not knowing how to help them.<br/>\n<br/>\nSo see if you can talk about the incident with him. It actually has <br/>\nbeen one of the most empowering things for Evan --to be able to explain <br/>\nwhat he is going through so that we can figure out what caused the <br/>\ndistress. Because once he knows the cause, then he can control the <br/>\npotential reaction. He is not anymore at the mercy of unknowns <br/>\nattacking his body.<br/>\n<br/>\nBest,<br/>\nl i z a<br/>\n==============================<br/>\nwww.culturekitchen.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":105774918,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Need suggestions for dealing with distressed child","postDate":"1053804403","msgId":70627,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzMjIyYSQ2YzBlMTk2MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PGJhbzNoaCtoMzBnQGVHcm91cHMuY29tPg=="},"prevInTopic":70617,"nextInTopic":70644,"prevInTime":70626,"nextInTime":70628,"topicId":70602,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-539396998\">&lt;&lt;I thought that he might be having a reaction to some things he had<br/>\neaten (he&#39;s really sensitive to certain chemicals) and tried to get Alex<br/>\nto take some anti-histamine&gt;&gt; <br/>\n<br/>\nYou may have hit the nail on the head for the cause if it was a sudden<br/>\nchange in behavior. The first time Jayn (@ 20 mths) got some peanut she<br/>\nfirst started running around wildly, then came up in hives around her<br/>\nmouth, then threw up. Who knew she was sensitive to it? Now if she<br/>\naccidentally ingests some she first becomes very quiet and withdrawn,<br/>\ngoes off to a corner and then throws up after a while. The important<br/>\nthing is to invite her to throw up, to make it go away quicker. <br/>\n<br/>\nShe is also very reluctant to take any medicines on the fortunately rare<br/>\noccasions she has a cold. Since they are really only for her comfort,<br/>\nrather than actually therapeutic, it doesn&#39;t worry me. Sometimes if she<br/>\nreally has had trouble sleeping due to stuffy nose, I will sneak some<br/>\nflavored cold medicine into a juice drink. The problem is that she<br/>\ndoesn&#39;t like the flavors they have, especially cherry. :p Seems like<br/>\nthis solution would not have helped you. I don&#39;t know what we would do<br/>\nif it were some serious issue that needed the medicine. Probably end up<br/>\nhaving to insist, as you did. Sometimes with ointments Jayn refuses, but<br/>\nif I sit quietly and wait, without comments or cajoling, after a few<br/>\nminutes she says, &quot;I&#39;m ready now&quot;. Again, I&#39;m not sure this would have<br/>\napplied in your situation with the wildness. It seems like he may have<br/>\nforgotten and forgiven. I think I would probably talk to him about the<br/>\nneed to sometimes take medicine, and also do some serious investigation<br/>\nwith him as to the cause - either external or internal. I&#39;d be<br/>\ninterested to know if you are able to track it down. BTW did the<br/>\nantihistamine help or have no effect? That would be a clue.<br/>\n<br/>\nMaybe if it occurs again and were possible, take him somewhere where he<br/>\ncould really run, a large park or field; perhaps he needed the physical<br/>\nresponse to help get the &quot;contaminant&quot; out of his system.<br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Need suggestions for dealing with distressed child","postDate":"1053795243","msgId":70617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2LjM5ZGMyNGUwLjJjMDBmZGFiQGFvbC5jb20+"},"prevInTopic":70602,"nextInTopic":70627,"prevInTime":70616,"nextInTime":70618,"topicId":70602,"numMessagesInTopic":0,"msgSnippet":"My thoughts on the diaper situation: Why make him put it on right then? My younger kids 12 mo and when 3yr would often run/crawl around with no diapers on.","messageBody":"<div id=\"ygrps-yiv-1162018424\">My thoughts on the diaper situation: Why make him put it on right then? <br/>\nMy younger kids 12 mo and when 3yr would often run/crawl around with no <br/>\ndiapers on.  With the older one it was more a sign that she was ready to go <br/>\ndiaperless so we did.  It was only a matter of days and she was going in the potty <br/>\nduring the day.<br/>\n<br/>\nMy now 12 mo old began at about 8 month to resist getting his diaper changed. <br/>\nHe would crawl off and did not want any part of laying down.  Since then I <br/>\nlet him crawl away. He may be without a diaper for an hour or if I find him <br/>\nstanding somewhere I just put it on. <br/>\nI think over the past few months I have changed him standing 97% or the time <br/>\nit&#39;s just easier on both of us.<br/>\n<br/>\nWhen it comes to medicine it can be tough esp if the child knows what it is.  <br/>\nI can now give the 3 yr. old say dimeatap but when she was younger I had to <br/>\nput it in her cup. I never force fed it just doesn&#39;t work.  If you have a child <br/>\nthat requires meds more often or resists try a cup. Our DH drinks chocolate <br/>\nso when we needed to she could never taste it.<br/>\nBut again I think it comes down to how much a child gets sick and weather <br/>\nthey know the drill.  <br/>\n<br/>\nLaura D<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 5/24/2003 11:36:48 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:westlisaa@...\">westlisaa@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I haven&#39;t posted before.  I&#39;ve been busy deschooling myself.  I have <br/>\n&gt; an 8 mo (Zack) old and a 3 yr old (Alex). <br/>\n&gt; <br/>\n&gt; Yesterday Alex became a wild child.  He is a very active, sensitive <br/>\n&gt; little boy.  He suddenly started hitting, throwing, yelling, <br/>\n&gt; running.  He was constantly doing things that would hurt himself, his <br/>\n&gt; brother, or me.  Tried keeping Zack (8 mo old) in a sling but Alex <br/>\n&gt; kept trying to hit or pull on him.  I got Zack to sleep in another <br/>\n&gt; room and tried to do some activities with Alex that he enjoys but he <br/>\n&gt; seemed unable to focus or enjoy them.  He just kept running, hitting <br/>\n&gt; things, ect.  Tried talking with him but could not get him to stay in <br/>\n&gt; a room long enough to tell me anything or hear what I was saying.  <br/>\n&gt; Tried taking him outside but it presented too many opportunities to <br/>\n&gt; hurt himself.  He refused to have his diaper changed.  I tried making <br/>\n&gt; it into a game.  He did not want to be touched (this is unusual for <br/>\n&gt; him, he loves to cuddle).   He seemed really distressed but I was <br/>\n&gt; unable to find a way to comfort him.  <br/>\n&gt; <br/>\n&gt; Dh came home and he had to hold Alex to keep him from hitting <br/>\n&gt; himself, the baby, or me.  :-(  I thought that he might be having a <br/>\n&gt; reaction to some things he had eaten (he&#39;s really sensitive to <br/>\n&gt; certain chemicals) and tried to get Alex to take some anti-<br/>\n&gt; histamine.  He refused and became more hysterical.  We finally ended <br/>\n&gt; up forcing him to take the medicine.  All in all, it seemed like we <br/>\n&gt; did a pretty terrible job.  Today Alex is back to his old self.  No <br/>\n&gt; aggressive or frantic behaviors.  He&#39;s playing calmly, and singing to <br/>\n&gt; his brother.  <br/>\n&gt; <br/>\n&gt; I&#39;m wondering what others would have done.  I really need some non-<br/>\n&gt; coersive alternatives in case this happens again.  Sorry for the long <br/>\n&gt; post.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Lisa W.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78397348,"authorName":"westlisaa","from":"&quot;westlisaa&quot; &lt;westlisaa@...&gt;","profile":"westlisaa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Need suggestions for dealing with distressed child","postDate":"1053790577","msgId":70602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJhbzNoaCtoMzBnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70617,"prevInTime":70601,"nextInTime":70603,"topicId":70602,"numMessagesInTopic":0,"msgSnippet":"I haven t posted before.  I ve been busy deschooling myself.  I have an 8 mo (Zack) old and a 3 yr old (Alex). Yesterday Alex became a wild child.  He is a","messageBody":"<div id=\"ygrps-yiv-1792719666\">I haven&#39;t posted before.  I&#39;ve been busy deschooling myself.  I have <br/>\nan 8 mo (Zack) old and a 3 yr old (Alex). <br/>\n<br/>\nYesterday Alex became a wild child.  He is a very active, sensitive <br/>\nlittle boy.  He suddenly started hitting, throwing, yelling, <br/>\nrunning.  He was constantly doing things that would hurt himself, his <br/>\nbrother, or me.  Tried keeping Zack (8 mo old) in a sling but Alex <br/>\nkept trying to hit or pull on him.  I got Zack to sleep in another <br/>\nroom and tried to do some activities with Alex that he enjoys but he <br/>\nseemed unable to focus or enjoy them.  He just kept running, hitting <br/>\nthings, ect.  Tried talking with him but could not get him to stay in <br/>\na room long enough to tell me anything or hear what I was saying.  <br/>\nTried taking him outside but it presented too many opportunities to <br/>\nhurt himself.  He refused to have his diaper changed.  I tried making <br/>\nit into a game.  He did not want to be touched (this is unusual for <br/>\nhim, he loves to cuddle).   He seemed really distressed but I was <br/>\nunable to find a way to comfort him.  <br/>\n<br/>\nDh came home and he had to hold Alex to keep him from hitting <br/>\nhimself, the baby, or me.  :-(  I thought that he might be having a <br/>\nreaction to some things he had eaten (he&#39;s really sensitive to <br/>\ncertain chemicals) and tried to get Alex to take some anti-<br/>\nhistamine.  He refused and became more hysterical.  We finally ended <br/>\nup forcing him to take the medicine.  All in all, it seemed like we <br/>\ndid a pretty terrible job.  Today Alex is back to his old self.  No <br/>\naggressive or frantic behaviors.  He&#39;s playing calmly, and singing to <br/>\nhis brother.  <br/>\n<br/>\nI&#39;m wondering what others would have done.  I really need some non-<br/>\ncoersive alternatives in case this happens again.  Sorry for the long <br/>\npost.<br/>\n<br/>\nThanks,<br/>\nLisa W.</div>","specialLinks":[]}],"prevTopicId":70651,"nextTopicId":70915}}