{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":9440128,"authorName":"ElissaJC@concentric.net","from":"&lt;ElissaJC@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] I&#39;m new to unschooling...","postDate":"1016631138","msgId":5590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyYzkwMWMxZDAxMyRhOGUwMWJhMCQ5YzI0YWRjZUBFbGlzc2FKQz4="},"prevInTopic":5582,"nextInTopic":0,"prevInTime":5589,"nextInTime":5591,"topicId":5578,"numMessagesInTopic":0,"msgSnippet":"Hi Jeni, There is a book you may be interested in, Christian Unschooling by Elissa Wahl and another person (senior moment) I also suggest you go to the message","messageBody":"<div id=\"ygrps-yiv-1412056577\">Hi Jeni,<br/>\nThere is a book you may be interested in, Christian Unschooling by Elissa<br/>\nWahl and another person (senior moment) I also suggest you go to the message<br/>\nboards at www.unschooling.com and read, read, read. There is a section at<br/>\nthe boards called TOPICS if you click on that you can see the all the titles<br/>\nand pick and choose.<br/>\nLurk here for a while, we are a group for those who are &quot;advanced<br/>\nunschoolers&quot; lol and you can learn alot from us by listening for a while.<br/>\nWelcome!!<br/>\nOh yeah! Your daughter will need sometime to deschool, let her be. let her<br/>\nread, watch TV (&quot;educational&quot; or not) goof around on the computer, go for<br/>\nwalks, daydream, paint wild colors on her toenails, whatever. She needs time<br/>\nfor learning to become Fun again. Even something as magical and joyful as<br/>\nlearning can become a chore when forced to do.<br/>\n~Elissa Cleaveland<br/>\n&quot;It is nothing short of a miracle that the modern methods of instruction<br/>\nhave<br/>\nnot yet entirely strangled the holy curiosity of inquiry.&quot; A. Einstein</div>","specialLinks":[]},{"userId":69247285,"authorName":"bearspawprint","from":"&quot;bearspawprint&quot; &lt;bearspawprint@...&gt;","profile":"bearspawprint","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I&#39;m new to unschooling...","postDate":"1016600233","msgId":5582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE3OTRyOStiamhlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNGUwMWMxY2ZhNyQ1MDQzZTc0MCQ2NTAxYThjMEBjaGFydGVyLm5ldD4="},"prevInTopic":5578,"nextInTopic":5590,"prevInTime":5581,"nextInTime":5583,"topicId":5578,"numMessagesInTopic":0,"msgSnippet":"Hi Jeni Your daughter sound just fine to me. What does she like to do for fun? What do you like to do?  Which music does she like? What books is she currently","messageBody":"<div id=\"ygrps-yiv-936994459\">Hi Jeni<br/>\n<br/>\nYour daughter sound just fine to me. What does she like to do for <br/>\nfun? What do you like to do?  Which music does she like? What books <br/>\nis she currently reading? I enjoy reading novels, myself. Am reading <br/>\nThe Last Report on the Miracles at Little No Horse by Louise Erdrich, <br/>\njust now. Bet your DD would enjoy it. She could join the list <br/>\nherself....or lurk.  Slug does not sound like an apt simili (sp?) for <br/>\na human being. Especially one&#39;s beautiful daughter.<br/>\n<br/>\nLive and let live, Jeni. Anna will be fine. Watch out for <br/>\npoltergeists :-) <br/>\n<br/>\nSharon of the Swamp<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My biggest concern is the fact that she is 15, almost 16, and would <br/>\n </span></blockquote>be in the 9th grade right now, according to &quot;traditional&quot; education.  <br/>\nI can see how the natural curiosity of younger children brings about <br/>\nlearning, but frankly, Anna is like a slug.  She only wants to read <br/>\nnovels, some of which I would prefer her not reading, watch t.v., not <br/>\nof the remotely educational variety, or listen to music, and I&#39;m not <br/>\ntalking necessarily Mozart or even John Williams, I am talking rock <br/>\n(which brings up a whole &#39;nuther battle).  As far as helping around <br/>\nthe house, well, we are not doing too well there either.  15 going on <br/>\n16  going on 25 brings more hormones in a female than I almost know <br/>\nwhat to do with.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I am especially anxious to hear from &quot;unschoolers&quot; of older <br/>\n </span></blockquote>students, i.e. teens.  Do any of you have those that appear to be <br/>\nmotivated to do nothing?  I&#39;m open to ANYTHING!  I have told her we <br/>\nare looking into unschooling and she seems remotely interested.  <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; I&#39;m looking forward to your input and getting to know you all!<br/>\n&gt; <br/>\n&gt; jeni <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":99018959,"authorName":"jeni","from":"&quot;jeni&quot; &lt;calicoeyes@...&gt;","profile":"wee_dreamweaver","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] I&#39;m new to unschooling...","postDate":"1016584604","msgId":5578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGUwMWMxY2ZhNyQ1MDQzZTc0MCQ2NTAxYThjMEBjaGFydGVyLm5ldD4="},"prevInTopic":0,"nextInTopic":5582,"prevInTime":5577,"nextInTime":5579,"topicId":5578,"numMessagesInTopic":0,"msgSnippet":"and could use some help.  Hi, my name is jeni and I have homeschooled off and on for years.  My oldest son did wonderfully with the traditional methods and is","messageBody":"<div id=\"ygrps-yiv-53175662\">and could use some help.  Hi, my name is jeni and I have homeschooled off and on for years.  My oldest son did wonderfully with the traditional methods and is now working and in college.  Son #2 is more into the vocational ed direction, though we are muddling through his senior year.  My 15 yo daughter is my main concern and why I am checking out the unschooling approach.  While she was in Christian school, we both would hear, &quot;We know you are capible of the work, so we are passing you to the next grade.&quot;  She enjoyed the social and the outlets with music and drama especially, but hated school.  We finally found a school that seemed to be working, they&#39;re major focus was the fine arts, but unfortunately, it closed after her one year there.  We then began homeschooling, trying every curriculum I could find...BJPress, A Beka, last year I tried tailoring her curriculum using Debbie Bell&#39;s book and The Big Book of Home Learning for my selections.  She hated it.  Her best friend, another homeschooler, had started using Switched on Schoolhouse and Anna had seen her use it and like what she saw.  I ordered it for this year, tailoring it to match her abilities as opposed to age/grade, and she hates that.  Anything to do with any kind of education she hates.  I know she is not dyslexic as her older brother is, but she says she can&#39;t retain anything.  Frankly, it seems to me that she just really doesn&#39;t want to retain anything.  She just hates any form of school work.  So, I am now exploring the &quot;unschooling&quot; approach.  I frankly know very little about it and look forward to learning from your experiences and getting insights into what works and what doesn&#39;t.<br/>\n<br/>\nMy biggest concern is the fact that she is 15, almost 16, and would be in the 9th grade right now, according to &quot;traditional&quot; education.  I can see how the natural curiosity of younger children brings about learning, but frankly, Anna is like a slug.  She only wants to read novels, some of which I would prefer her not reading, watch t.v., not of the remotely educational variety, or listen to music, and I&#39;m not talking necessarily Mozart or even John Williams, I am talking rock (which brings up a whole &#39;nuther battle).  As far as helping around the house, well, we are not doing too well there either.  15 going on 16  going on 25 brings more hormones in a female than I almost know what to do with.<br/>\n<br/>\nI am especially anxious to hear from &quot;unschoolers&quot; of older students, i.e. teens.  Do any of you have those that appear to be motivated to do nothing?  I&#39;m open to ANYTHING!  I have told her we are looking into unschooling and she seems remotely interested.  <br/>\n<br/>\nI&#39;m looking forward to your input and getting to know you all!<br/>\n<br/>\njeni <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":5543,"nextTopicId":5592}}