{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"http://www.unconventionalideas.com/wizard.html","postDate":"1095255541","msgId":99584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Mi4zM2NmYjhkMC4yZTc5OWZmNUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":99583,"nextInTime":99585,"topicId":99584,"numMessagesInTopic":0,"msgSnippet":"Was sent this by another unschooler. ~Kelly We re NOT Off to See the Wizard: REVISITING  THE IDEA OF COLLEGE By JOHN O. ANDERSEN March 9, 2001 Doing the","messageBody":"<div id=\"ygrps-yiv-48402931\">Was sent this by another unschooler.  <br/>\n~Kelly <br/>\n<br/>\nWe&#39;re NOT Off to See the Wizard: <br/>\nREVISITING  THE IDEA OF COLLEGE<br/>\nBy JOHN O. ANDERSEN<br/>\nMarch 9, 2001 <br/>\n<br/>\nDoing the uncommon thing first requires we look at life  through different <br/>\neyes, and consider unusual approaches. <br/>\n&quot;Cowards die many times before their  deaths; the valiant never taste of <br/>\ndeath but once.&quot;<br/>\n--William  Shakespeare from Julius Caesar Act II,  Scene 2.<br/>\n<br/>\nOur culture has more or less bought into the idea that  going to college is <br/>\njust one of those things you&#39;re &quot;supposed&quot; to do.  Increasingly, parents feel <br/>\nthey are &quot;required&quot; to finance their children&#39;s  education even if it means <br/>\nmortgaging themselves to the hilt or working crazy  hours. Few ever dare to <br/>\nquestion this assumption, at least not in public. Yet,  my wife and I question it <br/>\nand are happy to reveal our heretical thoughts to the  world. It&#39;s not that we <br/>\nhave anything against college per se, just that we see  things a bit <br/>\ndifferently.  <br/>\nGenerally, we think college is a good choice for many.  It was a good choice <br/>\nfor me. I enjoyed exposure to a new world of ideas, and  people. I made <br/>\nlifelong friends. I expanded my intellectual horizons. And  frankly, it was a fun <br/>\ntime.  <br/>\nNevertheless, since the years I attended college,  things have changed <br/>\nsomewhat. For instance, in many places careerism has all but  destroyed the notion <br/>\nof a classical education. Not that careerism is necessarily  bad, but rather, <br/>\nit seems to me that far too many colleges have transformed  themselves into <br/>\ncareer training factories. Largely gone is the notion of  fostering renaissance <br/>\nmen and women in embryo, who are more intent on reforming  and improving <br/>\nsociety rather than becoming just another cog in its machinery.  <br/>\nToday&#39;s graduates may have superior vocational  training and more marketable <br/>\nskills relative to the graduates of yesteryear.  However, their grasp of <br/>\nsocial and political issues, breadth of knowledge, and  writing abilities are <br/>\nprobably less noteworthy. Even worse, apathy for these  skills is widespread.  <br/>\nOver and over I read statistics that &quot;prove&quot; that even  with a much higher <br/>\nprice tag, the long-term benefits of a college education  still make it a <br/>\nbargain. But sometimes I wonder whose interest is best served by  that &quot;proof&quot;: the <br/>\nindividual student&#39;s or that of the massive higher education  industry?  <br/>\nFurthermore, I often question whether the &quot;doors of  opportunity&quot; which <br/>\ncollege supposedly unlocks, actually lead to places where  people truly want to go. <br/>\nMaybe the &quot;doors of opportunity&quot; are just the  passageway into an adulthood <br/>\nof Babbittry.  <br/>\nCould college attendance be a sign of cowardice?   Could it be a way to duck <br/>\nfrom the scary thought of being who we really are  inside?  Could we do the <br/>\ncollege thing mainly because that&#39;s what&#39;s  expected of us, or what everyone <br/>\nelse is doing, not because it&#39;s what we truly  should do?<br/>\nAt one time, I  bought into the conventional wisdom that although college <br/>\nwasn&#39;t the only  option, most young people should aim for it. Then I met my wife, <br/>\nMandy. She grew  up in Canada and England. Her father&#39;s military career gave <br/>\nher the advantage of  living in a variety of places. She is well-read, writes <br/>\nbetter than most college  graduates I know, and is well-informed on a variety <br/>\nof subjects. And, she has  never completed a college course.  <br/>\nIn addition to Mandy&#39;s influence, my choice to be  &quot;downwardly mobile&quot; had a <br/>\nmajor impact. After more than a generous helping of  institutional higher <br/>\neducation, and having launched a successful white-collar  career, I felt confined. <br/>\nMy freedom came from quitting my job and opting for  manual labor. That step, <br/>\nmore than any other factor, opened my mind to a new  perspective. <br/>\nOur primary reasons for questioning  college: <br/>\nFor us self-education is what sticks.  <br/>\nWe think that self-education with passion is the  learning which truly <br/>\nbecomes a part of us. We&#39;ve found we generally don&#39;t have  the same retention of the <br/>\n&quot;learning&quot; we&#39;ve done in order to pass a test or get a  degree. We&#39;ve also <br/>\ndiscovered institutional learning sometimes kills off any  interest we have in a <br/>\nsubject.  <br/>\nOccasionally people tell me if I hadn&#39;t gone to  college I wouldn&#39;t be as <br/>\nequipped to be a good self-learner. To a small extent I  agree, but in a larger <br/>\nsense, I believe the passion to know is what makes a good  learner. It&#39;s not <br/>\nthe number of degrees after your name. <br/>\nWe prefer learning at a slower pace and savoring it  along the way. <br/>\nMy experience with &quot;learning&quot; in college was like  drinking from a fire <br/>\nhydrant: too much, too fast. There was rarely ever enough  time to let things sink <br/>\nin. Occasionally it made more sense to give up on  actually learning anything <br/>\nand switch to &quot;binge and purge mode.&quot; In other words,  memorize what is <br/>\nnecessary to get the &quot;A&quot; and then purge it from the brain at  the end of the <br/>\nsemester to make room for the next binge.  <br/>\nWhy the big rush to stuff our brains? Learning, if it  is to take hold, is a <br/>\nslow, lifelong process. We hope our children won&#39;t feel  pressured into the <br/>\nbingeing and purging mode so as to miss the pleasure of  taking it slow and <br/>\nsavoring all of the joys along the way. <br/>\nAnswers to common objections <br/>\nOver the years when we&#39;ve been vocal about our  questioning of college, we&#39;ve <br/>\nbeen pelted with a variety of objections. Below  are four of the most common <br/>\nones and our responses:  <br/>\n1.  You&#39;re pulling a slick one! You&#39;ve had a  &quot;generous helping&quot; of college, <br/>\nyet you&#39;re going to deny your own children the  opportunity to even go to <br/>\ncollege.  <br/>\nWe didn&#39;t say we&#39;re against college. We tell our  children that college is <br/>\nonly one of many valid options they may choose. Equally  valid would be a trade <br/>\nschool, an informal apprenticeship, or simply getting a  job doing something <br/>\nthey enjoy. We make it clear it&#39;s more important to listen  to their heart than <br/>\ntheir peer group when it comes to structuring their life. We  don&#39;t pressure <br/>\nthem to choose one option above another. Rather, we will equip  them with the <br/>\nknowledge and tools to enable them to choose from a variety of  paths.  <br/>\n2.  If your children don&#39;t go to college  they&#39;ll be stuck in grunt jobs for <br/>\nthe rest of their lives.  <br/>\nThere are different interpretations of the term &quot;grunt  jobs.&quot; Many people <br/>\ndefine such jobs as those requiring physical exertion.  Personally, I benefit <br/>\nfrom my physically demanding job. It keeps me in shape,  gives me a constant <br/>\nchange of scenery, and provides abundant time for  contemplation. Not too shabby. <br/>\n <br/>\nJobs that punish creativity, force team play, and  pressure people to wear a <br/>\npublic face which is at odds with who they are inside,  could also be defined <br/>\nas &quot;grunt jobs.&quot; If a &quot;grunt&quot; is someone who does  disagreeable work, <br/>\ncertainly people in such careers are in reality more like  &quot;grunts&quot; than an autonomous <br/>\njanitor.  <br/>\n3.  What about the intangibles of college:  exposure to new ideas, making <br/>\nclose friends, etc.? Aren&#39;t those alone worth the  price of tuition?  <br/>\nCollege can be a way to acquire those intangibles. But  it&#39;s certainly not <br/>\nthe only or necessarily the best way. True learning demands  patience, an <br/>\ninquiring mind and commitment. Shelling out the big bucks doesn&#39;t  foster those <br/>\ntraits. We like to believe that a lifetime of passionate hounding  of public <br/>\nlibraries is an excellent way to become educated. And that requires  zero financial <br/>\noutlay. <br/>\nAnd we don&#39;t need to open our wallets to gain true  friendships either. We <br/>\njust need to open our hearts.  <br/>\n4.  What if your children decide later in life  they want a career that <br/>\nrequires a degree? Wouldn&#39;t it have been better to have  earned that degree before <br/>\nthey took on the responsibilities of work and raising  a family?  <br/>\nWe think going back to school later in life can be a  great way to do it. <br/>\nThat is, if you truly want to learn something, and really  think you need a <br/>\ndegree.  <br/>\nGetting through college while holding down a full-time  job and/or raising a <br/>\nfamily can be a long slog. Yet, we feel such a task is not  impossible and is <br/>\nactually getting easier with the proliferation of evening  programs, <br/>\ncorrespondence courses, and Internet offerings. Personally, after  having entered the <br/>\nwork force, I got much more out of my formal studies. As an  inexperienced <br/>\ncollege student between the ages of 18 and 22, I had only a vague  idea of what <br/>\ngoes on in the outside world. I lacked a practical sense of how  things actually <br/>\nworked or didn&#39;t work. Hence, much of the &quot;learning&quot; didn&#39;t  register.  <br/>\nRegardless of whether a person earns a first college  degree when they&#39;re 22 <br/>\nor 62, or not at all, they will likely find that enjoying  a lifetime of <br/>\nmeaningful work (paid and non-paid) requires a lifetime of  learning. Some of this <br/>\nmay come through taking classes, but we like to believe  the bulk of it comes <br/>\nthrough self-education. The degree to which people succeed  at teaching <br/>\nthemselves new skills, and pursuing interests for which they have a  passion, will <br/>\nto a significant extent, determine their overall state of  happiness. <br/>\nConclusion <br/>\nThe seeds of learning already exist inside of us. We  don&#39;t have to be &quot;off <br/>\nto see the wizard&quot; or pay tuition and room and board to  figure this out. We <br/>\nsimply need to believe it.  <br/>\nCollege can be the best option for many  people. If it is for our children, <br/>\nthey&#39;ll go. But more importantly, we hope  they&#39;ll enjoy the freedom to choose <br/>\nfrom a wide assortment of options without  pressure from the outside world to <br/>\nchoose one thing above another. After all,  they&#39;re the ones living their <br/>\nlives, not the outside world. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":99578,"nextTopicId":99579}}