{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":344783491,"authorName":"blue_mnm98","from":"&quot;blue_mnm98&quot; &lt;mom2blu@...&gt;","profile":"blue_mnm98","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Finding Resources, Building Community, Making Friends","postDate":"1334803504","msgId":66827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGptbnU3ZytwbXZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGptazZhZCsxMGplbUBlR3JvdXBzLmNvbT4="},"prevInTopic":66825,"nextInTopic":66828,"prevInTime":66826,"nextInTime":66828,"topicId":66817,"numMessagesInTopic":0,"msgSnippet":"... closer to an hour. I m not opposed to traveling to take part in good stuff, but I d like to have community at home too.--- One things that always amazes me","messageBody":"<div id=\"ygrps-yiv-1815035880\">----So far the only options are at least a 30min drive away, and many<br/>\ncloser to an hour. I&#39;m not opposed to traveling to take part in good stuff, but I&#39;d like to have community at home too.---<br/>\n<br/>\nOne things that always amazes me and cracks me up when I visit my southern family is how much they drive! They, and their friends, will think nothing of driving 30 minutes or even an hour for something. To go out to eat is at minimum a 15-20 minute drive, and at least 30 if you want something good. So they don&#39;t think twice about driving 30 minutes or more to eat, then 30 minutes to shop. My parents will actually drive the 7 mile trip to town 2 or even 3 times a day. And my Mom works in the complete opposite direction, about 4 miles from a different bigger town. One of their friends was bragging to me &quot;What&#39;s so wrong with it here? I like to slow life, we go out to eat every night, usually in a different town altogether. We&#39;re always going places, driving to other towns!&quot; And I simply replied &quot;What is so slow about that?&quot; <br/>\n<br/>\nMy point being that when you live rurally, 30 minutes IS &quot;home.&quot; Either you stay at your house ALL the time, or you develop a good radius of  miles that you drive to do things regularly. My best friend for many years as a child lived 30 minutes away, but we went to the same exact school. That&#39;s just how it is. I can&#39;t imagine my poor parents, and hour round trip to drop me off for the night and then again to pick me up the next day! Most of my boyfriends, including my current husband, lived 30 minutes away. And my poor boyfriends, pumping their trucks with gas for 30 minute drive to get me for a date, then 30 minutes to a town with a movie theater, then 30 minutes to my house, then 30 minutes home. And how miserable it was if it ended up not working out, you were stuck together in the car for what would feel like ages. LOL<br/>\n<br/>\nAlso, another thought that occurred to me is the small things that you do miss in rural life. Forget zoos or museums, what about things like buying a fresh weird fruit/vegetable? Or even a fresh semi-weird one? (My Mom said she would have NO idea where to even buy me an avocado!)  Those little day to day things that I overlook in my suburban life would disappear in rural life. Though there are perks to rural living too.... perhaps using that southern sun to try growing a banana tree!<br/>\n<br/>\nI think you&#39;d need to greatly consider your current unschool approach. If it&#39;s everyday occurrences or quick trips to the store for some part or another then the smaller town really just might not work. If you mostly go, travel, and visit sites and have field trips then you can still do that with some planning. <br/>\n<br/>\nLet&#39;s just say I&#39;m glad to live in the burbs, but am glad to have a rural place to visit on occasion. <br/>\n<br/>\nAlicia<br/>\n<br/>\n(who also emailed a quick blurb about packages so I didn&#39;t have to make another post to the group. I suppose I should have just held that thought)</div>","specialLinks":[]},{"userId":290776563,"authorName":"Madeline Rains","from":"Madeline Rains &lt;madnic@...&gt;","profile":"madelinerains","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Finding Resources, Building Community, Making Friends","postDate":"1334795411","msgId":66828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQkhyd2o1T0JjenBfPThVYUFfZ1lZLTI5Rk5nZDUwYzJnbm89ZFlUb2paMDFtNnctUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGptazZhZCsxMGplbUBlR3JvdXBzLmNvbT4=","referencesHeader":"PGptazZhZCsxMGplbUBlR3JvdXBzLmNvbT4="},"prevInTopic":66827,"nextInTopic":0,"prevInTime":66827,"nextInTime":66829,"topicId":66817,"numMessagesInTopic":0,"msgSnippet":"I understand your fears as I had fears too when I moved to our small southern town, sixteen years ago. I grew up in Boston and NYC and could not imagine","messageBody":"<div id=\"ygrps-yiv-356303424\">I understand your fears as I had fears too when I moved to our small<br/>\nsouthern town, sixteen years ago. I grew up in Boston and NYC and could not<br/>\nimagine raising kids in such a rural, conservative environment. But<br/>\nmarrying a farmer meant living in the country. So I figured we would just<br/>\ndrive the hour to the big city a lot (we&#39;re an hour from Atlanta).<br/>\n<br/>\nMy kids are now 14 and 11. As it turned out, the older one loooves the<br/>\ncountry, and the south. I don&#39;t share his passion but I have learned to<br/>\nrespect it. He will rarely let me talk him into driving to Atlanta to see a<br/>\nplay or go to a museum. He loves hunting, fishing, farming, riding his bike<br/>\nwith his friends... I wish he had local unschooling friends to hang out<br/>\nwith (he doesn&#39;t want to travel at all to see friends an hour away) but he<br/>\nis happy with just the few local friends who go to school.<br/>\n<br/>\n Maybe your kids will discover resources that you would never have<br/>\nimagined. The trick, for me, is giving these interests as much validity as<br/>\nthe city resources that I have always loved.<br/>\n<br/>\nThe other son is not as much of an outdoorsman. He will go into the city a<br/>\nbit more often with me to do things. As for community, I did end up meeting<br/>\nthree other moms who were interested in home schooling and they began their<br/>\nunschooling journeys soon after we started, so we have a small local<br/>\ncommunity of friends.  A few times a year, we venture further out to meet<br/>\nup with a bigger group of friends in Atlanta and they also come out here.<br/>\nIt all happened mostly organically, and also through lists. We also go on<br/>\nmuch bigger trips, to *far* off places, every year or so. If we didn&#39;t have<br/>\nthe very affordable mortgage that living out here allows, we wouldn&#39;t be<br/>\nable to do this traveling. I think what Sandra says is key - that you have<br/>\nto go into it with a positive attitude. Your family is their main<br/>\ncommunity. And thank God for the internet, eh?<br/>\n<br/>\nOn the other hand, to be completely honest, there are days when I think,<br/>\n&quot;What would Gillen be into if he weren&#39;t raised in this rural southern<br/>\ntown?&quot;  I admit, I do wonder how much his environment has influenced him.<br/>\nBut he is a great kid. My only reason for questioning living out here is<br/>\nthat I don&#39;t share his passions. I wish we shared more. But that&#39;s just my<br/>\nown greed. : )<br/>\n<br/>\nWhat small southern town? Have you posted on the state&#39;s unschooler list?<br/>\n<br/>\nGood luck,<br/>\n<br/>\nMadeline<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Apr 17, 2012 at 12:38 PM, Maggie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maggiehaskett@...\">maggiehaskett@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; We just found out we will be moving, again, to a small (15,000) town in<br/>\n&gt; the South. This will be our 3rd (and hopefully last!) move in the past 4<br/>\n&gt; years and it is now really apparent to me that I need more ideas and<br/>\n&gt; strategies for helping my kids adjust to our new home.<br/>\n&gt;<br/>\n&gt; The kids are going to be 8 and 14 and just under a year when we move. The<br/>\n&gt; 14 year old went to public school for K and 1st grade and no one has gone<br/>\n&gt; since then.<br/>\n&gt;<br/>\n&gt; In the past I&#39;ve always been able to find local groups, even in towns<br/>\n&gt; smaller than the one we&#39;re moving to now. There have been numerous<br/>\n&gt; community offerings that my kids were interested in. But this time -<br/>\n&gt; nothing! No community youth theater, very few youth sports, no local hs<br/>\n&gt; group, no nature center, zoo, etc... :(<br/>\n&gt;<br/>\n&gt; I&#39;ve searched the internet and tried to contact people in the town we&#39;re<br/>\n&gt; moving to, trying to uncover groups, resources, etc, and just haven&#39;t found<br/>\n&gt; anything promising. So far the only options are at least a 30min drive<br/>\n&gt; away, and many closer to an hour. I&#39;m not opposed to traveling to take part<br/>\n&gt; in good stuff, but I&#39;d like to have community at home too.<br/>\n&gt;<br/>\n&gt; We&#39;re visiting in about a month and I&#39;m hoping an in-person visit will<br/>\n&gt; help. I&#39;ll hit the library and ask around... We&#39;ve also considered living<br/>\n&gt; in another town (with more happening), but we feel very strongly that a<br/>\n&gt; long commute for my husband would really strain our family and finances.<br/>\n&gt; Yet we&#39;re also worried that moving to a homeschooling wasteland will be an<br/>\n&gt; equally big strain.<br/>\n&gt;<br/>\n&gt; What would you do? What avenues should I be exploring that I&#39;m not<br/>\n&gt; thinking of? How would you go about finding like-minded homeschooling<br/>\n&gt; friends in such a place? And activities and resources for the kids?<br/>\n&gt;<br/>\n&gt; I&#39;d be especially interested in hearing the experiences of people who have<br/>\n&gt; unschooled in small, conservative, not-so-homeschooling-friendly places!<br/>\n&gt;<br/>\n&gt; Thanks in advance,<br/>\n&gt; Maggie<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Finding Resources, Building Community, Making Friends","postDate":"1334791235","msgId":66825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBMTlFQTQ3LUVBNjYtNDdFRS05MjVELTNGMDNDQjcyMUM4N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGptbXZ1ZCs1MG5qQGVHcm91cHMuY29tPg==","referencesHeader":"PGptbXZ1ZCs1MG5qQGVHcm91cHMuY29tPg=="},"prevInTopic":66824,"nextInTopic":66827,"prevInTime":66824,"nextInTime":66826,"topicId":66817,"numMessagesInTopic":0,"msgSnippet":"We knew a few homeschooling families when my kids were little.  The parents ideal was raising kids more rurally, so they moved out of Albuquerque (a city of","messageBody":"<div id=\"ygrps-yiv-1516079439\">We knew a few homeschooling families when my kids were little.  The parents&#39; ideal was raising kids more rurally, so they moved out of Albuquerque (a city of over half a million people) 20 to 50 miles on the other side of the mountain.  And one parent, usually, commuted--if not all the way to Albuquerque, to some other town to work.<br/>\n<br/>\nWhile it wasn&#39;t bad while the kids were eight or ten, once puberty came there were several problems.  The kids wanted more people in their lives. They go to be old enough to have jobs, and there were not jobs where they lived, and they weren&#39;t old enough to drive.  They got to be old enough to drive, but the drivers&#39; education schools were in Albuquerque.  <br/>\n<br/>\nMeanwhile, my kids were hanging out with people, getting jobs, and learning to drive.  And our house was, luckily for many families, large enough to host some of the kids from those small towns.  We became the emergency in-town house, the transfer station for kids from divorced families, and one boy lived with us for the seven days of the driver&#39;s education course he took.  I drove him back and forth every day.<br/>\n<br/>\nFew of them were eager to go back to their isolated country homes.<br/>\n<br/>\nWhen my kids were old enough to go out to movies, dinner, hanging out with other friends, they were near enough that I could rescue them within fifteen or twenty minutes if there were problems.  I could pick them up after a party or a concert.  Not nearly so easy for the rural families, so their kids either got told &quot;no&quot; more, or they were under less supervision, and in more danger of other kids saying &quot;Your mom won&#39;t know; she&#39;s in Stanley/Edgewood/Cedar Crest.&quot;  And they were right.  Because those kids were told no because of practicality and the cost of gasoline, when they DID get a yes they were over-excited.  My kids were able to ease into a social life with short outings of an hour or two, and weren&#39;t far from home.<br/>\n<br/>\nFor me, the feeling of safety (social and physical) and their ability to get jobs (even casual ones--setting up for tournaments or doing yard work or babysitting, before they got &quot;real jobs&quot;) was hugely valuable to our unschooling, to their learning, and their &quot;resumes,&quot; and the money was good for them, too.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":344783491,"authorName":"blue_mnm98","from":"&quot;blue_mnm98&quot; &lt;mom2blu@...&gt;","profile":"blue_mnm98","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Finding Resources, Building Community, Making Friends","postDate":"1334772493","msgId":66824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGptbXZ1ZCs1MG5qQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGptazZhZCsxMGplbUBlR3JvdXBzLmNvbT4="},"prevInTopic":66822,"nextInTopic":66825,"prevInTime":66823,"nextInTime":66825,"topicId":66817,"numMessagesInTopic":0,"msgSnippet":"Hi! This is my first post, so forgive me if anything is taboo. I ve been trying to avoid posting until I m SURE I get the atmosphere but this really speaks to","messageBody":"<div id=\"ygrps-yiv-1493203787\">Hi!<br/>\nThis is my first post, so forgive me if anything is taboo. I&#39;ve been trying to avoid posting until I&#39;m SURE I get the atmosphere but this really speaks to me. I grew up in a small town in SC, the population amount is strange because the town is small, but the zipcode area is HUGE. Our house was 7 miles from one tiny town and 13 miles from a slightly larger town in the other direction. It took 2 hours to get anywhere, the beach, Charleston, or even the useful parts of Columbia. It was podunk. Now I live equal distance from DC, Baltimore, and Annapolis. I can be in Philly in about 2 hours. <br/>\n<br/>\nAs a child I HATED where I lived. I wasn&#39;t unschooled but there was NOTHING to do. It was even usually to hot and dusty to even play outside. Any group you could get in met at times that made it quite clear they didn&#39;t want visitors. Or you would get preached to the entire time. As an adult I STILL hate it there. BUT my son flourishes there! We recently went for slightly less than a week, without my husband, and when we got back my husband said &quot;He seems so different, like he&#39;s grown up so much.&quot; The atmosphere there, of not having to go anywhere, of having a real yard, he handles it so well I wish I could give him that life always. <br/>\n<br/>\nI&#39;d not worry about the sense of community to much. Southerners are generally quite nice and will make conversation and be friendly. Even if they are trying to convince you to send your kids to school they&#39;ll be quite nice about it. Even just when I visit I end up trying to avoid people because I&#39;m sick of conversing. lol<br/>\n<br/>\nSo I have some thoughts on the predicament. <br/>\n1. If you really end up going going going to meet your kids needs then honestly it may be better for your husband to just have to commute. We recently faced the same thought process (though we ended up not moving for other reasons) and we found that us traveling would use more gas and time then him traveling. So consider which side of that would actually be better. Also consider that could put you and the kids traveling on strange back roads in unfamiliar places. Some roads you could be stranded on for a day with no cell phone signal and not have a single car pass that can help. There could also be areas that are down right unsafe or uncomfortable, some that you may not know about until you know the area. There is a space that is big KKK land where I grew up, I&#39;d feel pretty unsafe today driving my mixed kid through there. When I visit my family still in SC there are large spans of main roads and highways that have no cell phone signal. All food for thought. <br/>\n<br/>\n2. Your kids may surprise you. Kids who usually seem to hate being home for a second may be in love with being at that home for days on end. There may be other small things that fascinate them, like a small local pond that they can fish in whenever they want, or tadpoles in a ditch (I had my fair share of fun with those growing up.) Perhaps you could raise chickens, or other animals you can&#39;t have right now. There will be new local plant life, birds, lizards, and more to identify. I once read (I forget where) about a kid learning blacksmithing and building his own small foundry in the side yard of his house. Something you&#39;d usually have to drive quite a way to take a class in. <br/>\n<br/>\n3. Talk to the kids. They may prefer options like Dad coming home quicker even if it means only taking one field trip a week or even a month. Help them come up with ideas of what they could do at home that may keep them entertained. Also staying home more may provide options like spending more on books and kits of interest, and that may be an option they like more then going places. <br/>\n<br/>\nand lastly, Have you heard of the &quot;Kids Love Travel&quot; books? <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kidslovetravel.com/\">http://www.kidslovetravel.com/</a> They offer LOTS of ideas for field trips that may come in handy. I suggest the books highly, but it might be especially handy to buy a book for where you are moving too. Lots of stuff off the beaten path. <br/>\n<br/>\nHope this helps!<br/>\nAlicia</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Finding Resources, Building Community, Making Friends","postDate":"1334705462","msgId":66822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpta3VmbStqZW00QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGptazZhZCsxMGplbUBlR3JvdXBzLmNvbT4="},"prevInTopic":66819,"nextInTopic":66824,"prevInTime":66821,"nextInTime":66823,"topicId":66817,"numMessagesInTopic":0,"msgSnippet":"... **************** I live in rural Tennessee - nearest town has a population of less than 4,000 ;) It s about 20 minutes away. Nearest homeschool group not","messageBody":"<div id=\"ygrps-yiv-1099354087\">&quot;Maggie&quot; &lt;maggiehaskett@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; We just found out we will be moving, again, to a small (15,000) town in the South...So far the only options are at least a 30min drive away, and many closer to an hour.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI live in rural Tennessee - nearest town has a population of less than 4,000 ;) It&#39;s about 20 minutes away. Nearest homeschool group not related to a church is over an hour&#39;s drive. It helped me to let go of the idea of finding &quot;like minded homeschoolers&quot; and simply look for people we could get along with, and ways to feed my kids&#39; interests. My kids have friends who are older, younger, in school, adults, radical Christian homeschoolers, wild-eyed hippies in the hills... you name it. <br/>\n<br/>\nWhat sorts of things do your kids enjoy? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;we feel very strongly that a long commute for my husband would really strain our family and finances.  Yet we&#39;re also worried that moving to a homeschooling wasteland will be an equally big strain.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIf your kids are really social, and like to be out and doing a lot, then the cost of driving them where they want to be may be as great as that of your husband&#39;s commute. That&#39;s something to look at seriously. It may be better to live somewhere more populous. It may be better to split the difference and find a place in between where he works and whatever larger town has more options. It may be that you need to find a buddy or relative in a bigger town and go visit for a long weekend once a month! And your kids&#39; needs may very well change over the next couple years - it may be better to look for a short term solution and play things by ear while you settle in and learn the lay of the land. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Finding Resources, Building Community, Making Friends","postDate":"1334694210","msgId":66819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwRjBCOUMwLTdFRDgtNEU0Ri1BRkJGLTlBNzc3RjhFNzUzMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGptazZhZCsxMGplbUBlR3JvdXBzLmNvbT4=","referencesHeader":"PGptazZhZCsxMGplbUBlR3JvdXBzLmNvbT4="},"prevInTopic":66817,"nextInTopic":66822,"prevInTime":66818,"nextInTime":66820,"topicId":66817,"numMessagesInTopic":0,"msgSnippet":"-=-we feel very strongly that a long commute for my husband would really strain our family and finances. Yet we re also worried that moving to a homeschooling","messageBody":"<div id=\"ygrps-yiv-1153870712\">-=-we feel very strongly that a long commute for my husband would really strain our family and finances. Yet we&#39;re also worried that moving to a homeschooling wasteland will be an equally big strain.<br/>\n<br/>\n-=-What would you do? What avenues should I be exploring that I&#39;m not thinking of-=-&#92;<br/>\n<br/>\nYou have an image of a homeschooling community in your imagination, and you&#39;re going to test this little southern town, and it&#39;s very likely to fail.<br/>\n<br/>\nWhat I think would help first and foremost is to unravel the idea of &quot;a homeschooling wasteland.&quot;  It&#39;s causing a big strain already.  You&#39;ve told a bunch of people about it on the internet. :-)<br/>\n<br/>\n-=-Finding Resources, Building Community, Making Friends-=-<br/>\n<br/>\nMaking friends could come from community activities and hobbies.  Clubs.  Volunteer work.<br/>\n<br/>\nFinding resources is similar to that.<br/>\n<br/>\nBuilding community shouldn&#39;t be done by people who are new to town.  First find resources and make friends in natural ways.  Whether a community grows from that or not depends on factors beyond your control.<br/>\n<br/>\n-=-We just found out we will be moving, again, to a small (15,000) town in the South. This will be our 3rd (and hopefully last!) move in the past 4 years and it is now really apparent to me that I need more ideas and strategies for helping my kids adjust to our new home.-=-<br/>\n<br/>\nIf the move is a definite thing, start looking at the positive aspects rather than the fearsome negatives, and it will cut down your husband&#39;s stress, and yours, and if the parents are calm and happy and positive, the kids will feel safer.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":430382958,"authorName":"Maggie","from":"&quot;Maggie&quot; &lt;maggiehaskett@...&gt;","profile":"maggiehaskett","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Finding Resources, Building Community, Making Friends","postDate":"1334680717","msgId":66817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGptazZhZCsxMGplbUBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":66819,"prevInTime":66816,"nextInTime":66818,"topicId":66817,"numMessagesInTopic":0,"msgSnippet":"We just found out we will be moving, again, to a small (15,000) town in the South.  This will be our 3rd (and hopefully last!) move in the past 4 years and it","messageBody":"<div id=\"ygrps-yiv-1309426056\">We just found out we will be moving, again, to a small (15,000) town in the South.  This will be our 3rd (and hopefully last!) move in the past 4 years and it is now really apparent to me that I need more ideas and strategies for helping my kids adjust to our new home.<br/>\n<br/>\nThe kids are going to be 8 and 14 and just under a year when we move.  The 14 year old went to public school for K and 1st grade and no one has gone since then. <br/>\n<br/>\nIn the past I&#39;ve always been able to find local groups, even in towns smaller than the one we&#39;re moving to now.  There have been numerous community offerings that my kids were interested in.  But this time - nothing!  No community youth theater, very few youth sports, no local hs group, no nature center, zoo, etc...  :( <br/>\n<br/>\nI&#39;ve searched the internet and tried to contact people in the town we&#39;re moving to, trying to uncover groups, resources, etc, and just haven&#39;t found anything promising.  So far the only options are at least a 30min drive away, and many closer to an hour.  I&#39;m not opposed to traveling to take part in good stuff, but I&#39;d like to have community at home too.  <br/>\n<br/>\nWe&#39;re visiting in about a month and I&#39;m hoping an in-person visit will help.  I&#39;ll hit the library and ask around...  We&#39;ve also considered living in another town (with more happening), but we feel very strongly that a long commute for my husband would really strain our family and finances.  Yet we&#39;re also worried that moving to a homeschooling wasteland will be an equally big strain.<br/>\n<br/>\nWhat would you do?  What avenues should I be exploring that I&#39;m not thinking of?  How would you go about finding like-minded homeschooling friends in such a place?  And activities and resources for the kids?  <br/>\n<br/>\nI&#39;d be especially interested in hearing the experiences of people who have unschooled in small, conservative, not-so-homeschooling-friendly places!  <br/>\n<br/>\nThanks in advance, <br/>\nMaggie</div>","specialLinks":[]}],"prevTopicId":66826,"nextTopicId":66829}}