{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":148348246,"authorName":"SHERRY LANGEVIN","from":"SHERRY LANGEVIN &lt;luckymermaid@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Don&#39;t you wish you lived in the States... (not!)","postDate":"1074800118","msgId":89756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTIyMTkzNTE4Ljk5MzM1LnFtYWlsQHdlYjgwNjA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwNDAwMWMzZTA3ZiQzMGY0NmZhMCQxNGUwYjVkMEBHcmFjZVBlbm4+"},"prevInTopic":89666,"nextInTopic":0,"prevInTime":89755,"nextInTime":89757,"topicId":89666,"numMessagesInTopic":0,"msgSnippet":"I think I ve signed on this list over 2 weeks ago, so please excuse me if I am wrong.  I will say that IMO he s right.  I unschool my oldest, but my special","messageBody":"<div id=\"ygrps-yiv-1502026078\">I think I&#39;ve signed on this list over 2 weeks ago, so please excuse me if I am wrong.  I will say that IMO he&#39;s right.  I unschool my oldest, but my special needs child attends p.s.  She&#39;s 7, has attended since age 3. The first few years, I do think helped her: I had no idea how to work with her, since she needed, and still needs PT, ST & OT.  Once she graduated from PreK (I do think those women were helpful, and supportive, and told me what to look out for in public ed).  Since my kid went to 1st grade/MSPD, I know that the teacher is stymied by tons of paperwork (every time I go there, almost, she&#39;s not there in class, she&#39;s doing paperwork), the therapists, long ago (without my knowledge) relegated the therapy to the special ed teacher (school is still getting funded for my spec. ed kid, though) except for the sometimes twice monthly half hour visit of the PT.  If there is a holiday when the therapist is supposed to come, they dont make it up.  But he is right about the<br/>\n identifying for &#39;better&#39; purposes;  my child goes on regular field trips--to the mall, to McDonalds, to Target,  Safeway, etc etc.  At first it didn&#39;t bother me; we also had to work on public behavior with her,  appropriate behavior, etc, and I thought it helped her to help count money.   WRONG!!  I discovered that the class trips weren&#39;t for her class level specifically, but for ALL levels of special ed each time--showing them all the &quot;great jobs&quot; they can look forward to.  When I realized what all had gone on since the testing she&#39;s taken at age 5 (by the way, they tested her with tests used by speaking children, but &#39;modified it&#39; --yeah right.)My kid has SO much more inside of her than that! And so do those other kids, who will be relegated to mindless crap jobs  (which I&#39;ve held sometimes too<br/>\n  I go regularly, and instruct the teacher on how my kid is learning at home, and what she likes etc.  Think the teacher can only work within certain regulations, she has said as much to me..   The only reason my daughter is still there, is that she WANTS to attend.  There are kids to play with, people are kind to her there (it&#39;s a small rural school, and they are truly nice to the spec needs kids, who are involved in inclusion classes) and though she and I helped her learn to read, she still wants to go to reading class at school.  So it boils down to that.  She likes the daily routine there, and is happy mostly, even though I&#39;m not that impressed.  We&#39;re moving in April, and probably will school her at home, unless she requests.  Depends if I can find an active hs group who have kids that&#39;ll be kind to her and play with her.<br/>\n <br/>\nSherry<br/>\nPenn Acres &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pennacres@...\">pennacres@...</a>&gt; wrote:<br/>\nI see this-&quot;no child left behind&quot; in canadian papers also.<br/>\nOne of the references was from an ad for a preschool workshop.<br/>\ngrace<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\nTo visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nYour use of Yahoo! Groups is subject to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1160699,"authorName":"Penn Acres","from":"&quot;Penn Acres&quot; &lt;pennacres@...&gt;","profile":"mtnsky2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Don&#39;t you wish you lived in the States... (not!)","postDate":"1074731536","msgId":89666,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDAwMWMzZTA3ZiQzMGY0NmZhMCQxNGUwYjVkMEBHcmFjZVBlbm4+"},"prevInTopic":0,"nextInTopic":89756,"prevInTime":89665,"nextInTime":89667,"topicId":89666,"numMessagesInTopic":0,"msgSnippet":"I see this- no child left behind in canadian papers also. One of the references was from  an ad for a preschool  workshop. grace NO CHILD S BEHIND LEFT The","messageBody":"<div id=\"ygrps-yiv-250696827\">I see this-&quot;no child left behind&quot; in canadian papers also.<br/>\nOne of the references was from  an ad for a preschool  workshop.<br/>\ngrace<br/>\n<br/>\nNO CHILD&#39;S BEHIND LEFT<br/>\nThe State of the Union&#39;s New Educational Eugenics<br/>\nby Greg Palast<br/>\n<br/>\nGo ahead, George, and lie to me.  Lie to my dog.  Lie to my sister.  But don&#39;t <br/>\nyou ever lie to my kids.<br/>\n<br/>\nDeep into your State of the Siege lecture tonight, long after sensible adults <br/>\nhad turned off the tube or kicked in the screen, you came after our children. <br/>\n&quot;By passing the No Child Left Behind Act,&quot; you said,  &quot;We are regularly testing <br/>\nevery child ... and making sure they have better options when schools are not <br/>\nperforming.&quot;<br/>\n<br/>\nYou said it ... and then that little tongue came out; that weird way you stick <br/>\nyour tongue out between your lips like the little kid who knows he&#39;s fibbing. <br/>\nLike a snake licking a rat.  I saw that snakey tongue dart out and I thought, <br/>\n&quot;He knows.&quot;<br/>\n<br/>\nAnd what you know, Mr. Bush, is this:  you&#39;ve ordered this testing to hunt down, <br/>\nidentify and target for destruction the hopes of millions of children you find <br/>\ntoo expensive, too heavy a burden, to educate.<br/>\n<br/>\nHere&#39;s how No Child Left Behind and your tests work in the classrooms of Houston <br/>\nand Chicago.  Millions of 8 year olds are given lists of words and phrases. <br/>\nThey are graded, like USDA beef:  some prime, some OK, many failed.<br/>\n<br/>\nOnce the kids are stamped and sorted, the parents of the marked children ask for <br/>\nyou to fill your tantalizing promise, to &quot;make sure they have better options <br/>\nwhen schools are not performing.&quot;<br/>\n<br/>\nBut there is no &quot;better option,&quot; is there, Mr. Bush?  Where&#39;s the money for the <br/>\nbetter schools to take in the kids getting crushed in cash-poor districts? <br/>\nWhere&#39;s the open door to the suburban campuses with the big green lawns for the <br/>\ndark kids with the test-score mark of Cain.<br/>\n<br/>\nAnd if I bring up the race of the kids with the low score, don&#39;t get all snippy <br/>\nwith me, telling me your program is color blind.  We know the color of the kids <br/>\nleft behind; and it&#39;s not the color of the kids you went to school with at <br/>\nPhilips Andover Academy.<br/>\n<br/>\nYou know and I know that the testing is a con.  There is no &quot;better option&quot; at <br/>\nthe other end.  The cash went to the end the inheritance tax, that special <br/>\nprogram to give every millionaire&#39;s son another million.<br/>\n<br/>\nBut you&#39;ll tell me, you took tests as a youth.  I know you did.  And you scored <br/>\non the Air Guard flight test 25 out of 100, one point above too dumb to fly. <br/>\nBut you zoomed past the other would-be flyboys.  They were stamped, &quot;Ready for <br/>\n&#39;Nam.&quot;  And you took a test to get into Yale.  And though your pet rock scored a <br/>\nwee bit higher than you, your grandpa on the Yale board provided the &quot;better <br/>\noption&quot; which got you in.<br/>\n<br/>\nHere in New York City, your educational Taliban, led by Republican Mayor <br/>\nBloomberg, had issued an edict to test the third-graders.  Winnow out the chaff <br/>\nand throw them back, exactly where they started, to repeat the same failed <br/>\nprogram another year.  In other words, the core edict of No Child Left Behind is <br/>\nthat failing children will be left behind another year.  And another year and <br/>\nanother year.<br/>\n<br/>\nYou know and I know that this is not an educational opportunity program - <br/>\nbecause you offer no opportunities, no hope, no plan, no funding.  Rather, it is <br/>\nthe new Republican social Darwinism, educational eugenics:  Identify the <br/>\nnation&#39;s loser-class early on.  Trap them, then train them cheap.  The system <br/>\nwill provide the new worker drones that will clean the toilets at the Yale <br/>\nalumni club, to punch the McDonald&#39;s cash registers color-coded for illiterates, <br/>\nto pamper the winner-class on the higher floors of the new service economy order.<br/>\n<br/>\nGreg Palast is author of, &quot;The Best Democracy Money Can Buy,&quot; which has returned <br/>\nthis week to the New York Times bestseller list.  View Palast&#39;s writings for <br/>\nHarper&#39;s, The Guardian (UK) and BBC television at www.GregPalast.com.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":89740,"nextTopicId":89757}}