{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":197421595,"authorName":"Katy Jennings","from":"&quot;Katy Jennings&quot; &lt;kjennings95@...&gt;","profile":"coyotegoddess95","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion]unschooling and daycare","postDate":"1118984342","msgId":106663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNy1EQVYyNjhCQjAzQzdFNTFCNDVDNjlEOUZCRUY0MEBwaHguZ2JsPg==","referencesHeader":"PDFkNS4zZTMxNDQ2ZC4yZmUzNjAzM0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":106662,"nextInTime":106664,"topicId":106663,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1476555044\">&lt;&lt;&lt;&lt;I have no doubt you were being a mindful parent and all, but &quot;unschooling  <br/>\nall along&quot; can&#39;t co-exist with daycare and school.&gt;&gt;&gt;<br/>\n <br/>\nI agree that unschooling can&#39;t co-exist with school and *most* daycare situations.  But it can work with a loving and understanding child-care home.  <br/>\n<br/>\nMy son has been in a few different daycare situations.  The first was a childcare center, that wasn&#39;t good, I mean it was a good program for most children-will-soon-be-in-school parents, but for Richard it wasn&#39;t good.  Then I found a woman who sounded very unschooly, did lots of great things with the kids, but actually pressured the kids to learn what she thought they should.  Now on days that I work (3 a week) he gets up when he wants, usually around noon, and rides his bike down the street to a childcare home.  The woman who runs it is caring and loving, and doesn&#39;t question our lifestyle at all.  Richard likes it there.  Because he goes to daycare doesn&#39;t mean that we are not unschooling.  At least to me it doesn&#39;t.<br/>\n<br/>\nI think saying that unschooling can&#39;t work with kids in daycare will scare off single parents or parents in other situations where they have to be at work.  Maybe we can&#39;t be with our kids all of the time, but we can unschool.  We have to find jobs and childcare that are flexible and understanding, but it can work.  <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;How does attachment parenting even coexist with daycare?&gt;&gt;&gt;&gt;<br/>\n<br/>\nBy finding someone who is loving and caring and understands your parenting philosophies.  For me it also meant finding a workplace that would allow me to work 3 days a week, paying attention to my son&#39;s needs and pulling him from a daycare when it wasn&#39;t working, and letting him know that he can call me at any time.  I carry my cell phone in my pocket at work, so I am always available.  When he was a baby he was only with relatives while I went to school or worked, grandparents or aunts and uncles.  Of course attachment parenting and unschooling are more difficult if you must include childcare in your life, but it is possible.  <br/>\n<br/>\nI am not saying that I have always been the perfect model of an attachment parent or unschooling parent, but I do my best with the situation that I have.  I have learned a lot from all of you, and think that other single parents can too.  <br/>\n<br/>\nKaty<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":106053,"nextTopicId":106647}}