{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":125056900,"authorName":"ladymagic@mchsi.com","from":"ladymagic@...","profile":"princessdee20012001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"sorry been so long","postDate":"1070645638","msgId":17505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":0,"prevInTime":17504,"nextInTime":17506,"topicId":17505,"numMessagesInTopic":0,"msgSnippet":"with the move  I havent had much time lately but still been trying to read as often as possible. things have been hoping here. my oldest daughter  has a 5 year","messageBody":"<div id=\"ygrps-yiv-1616343832\">with the move  I havent had much time lately but still been trying to read as <br/>\noften as possible.<br/>\nthings have been hoping here.<br/>\nmy oldest daughter  has a 5 year old and  suprised me by putting her in school <br/>\nthis year.keeps calling me saying mom why they pushing destiny to read she <br/>\nreads just not what they want and mom they told me she cant do her abc&#39;s in <br/>\nupper and lower case and the meeting with the teacher led to a fight they <br/>\nmarked her off bunch  because her m&#39;s look like upside down w&#39;s.<br/>\nSuprise  I was shocked they  even did that in kindergarden.she  talked to me <br/>\nabout unschooling and  cirrclumn and so forth. she said mom that is what we <br/>\nhave always done with her  she knew abc and so forth going in there because it <br/>\nwas fun learning before and she and i did things now they  call me assine me <br/>\nhomework to work with her and  she dont always answer them when they ask her <br/>\nthings she says she dont because they are mean and yell.<br/>\nher m&#39;s dolook like upside down w&#39;s big deal. what is that all about?<br/>\nshe called said &quot;mom I like her and me better before and I like her  <br/>\nsocalization before better,as I knew who her fiends where  I am confused  are <br/>\nyou right and my freinds wrong and dad is having fits that I am thinking of <br/>\nhome schooling her.&quot;<br/>\nshe will also have problems with the faternal grand mother as she is a <br/>\nkindergarden teacher. she is afraid they will use  it as a excuse to futher <br/>\nthere case in custody battle.<br/>\nI think I can talk to the faternal grandmother and smooth edges out.as for my <br/>\nex and his mother  no way they  think I am to lax and that destiny wont ever <br/>\nlearn anything ever I had to tell my daughter look hun it your kid not mine I <br/>\ntold you when you put her in school  you would but heads with the system and <br/>\nyou are. They did the testing  and she was way above  grade level because of <br/>\nthe fun you 2 had at home now that you have to do it in there way it not fun <br/>\nfor either of you, you know my opion on it and you know what is right for the 2 <br/>\nof you I will not judge you onyour choice either way and yes will watch my <br/>\ngrand child when you need to work I just wont get up and drive across town if <br/>\nshe is here at 7 in the morning to get her to a school bus. if you keep her in <br/>\nschool you will have to work that one out(we are not big on baby sitters We <br/>\nhave  teens that watch others in family for week end money and mine dont want <br/>\nto get up at 6:30 to do anything and isnt old enough to drive any way)<br/>\noh I might mention  my daughter even tryed switching schools and same thing <br/>\nwith the w&#39;s and m&#39;s what up with that one/<br/>\nwho cares about the  lil points heck I am impressed they dont look like side <br/>\nway e&#39;s and like her mother and me we  will use upper and lower case all wrong. <br/>\nwhen did kindergarden get so ...pissie?<br/>\nDee</div>","specialLinks":[]}],"prevTopicId":17496,"nextTopicId":17502}}