{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would you do to help your child learn to read when HE wants to...","postDate":"1340841324","msgId":68007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDA4NDEzMjQuODg4NjAuWWFob29NYWlsTmVvQHdlYjg3MzA1Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzNDA4Mzc3MjkuNTY2NjYuWWFob29NYWlsTmVvQHdlYjg3MzA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPiA8MTM0MDgzNzcyOS41NjY2Ni5ZYWhvb01haWxOZW9Ad2ViODczMDYubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":68006,"nextInTopic":0,"prevInTime":68006,"nextInTime":68008,"topicId":67992,"numMessagesInTopic":0,"msgSnippet":"I left this hanging, and it bugs me: Meredith wrote about context, reading in context. Meredith wrote about context, reading in context. She was writing","messageBody":"<div id=\"ygrps-yiv-932749610\">I left this hanging, and it bugs me: &quot;Meredith wrote about context, reading in context.&quot;<br/>\n<br/>\nMeredith wrote about context, reading in context. She was writing about deriving a word from the context, from the situation. Maybe within sentence, maybe within environment. Lots of reading is about context. Some of it, like reading Japanese, is a cultural context. Jared Diamond has written about the importance of language for understanding an environment and how, as a group of people dies out or is subsumed by a larger or more dominant population, information about that environment will be lost. Language is derived from culture and environment. As such it is framed by it&#39;s environment, but it also frames the world, the vision of the people involved in that language. Reading and language both expand and contract a vision. And knowing more about the context can help to make reading easier, less guesswork, more predictable situation. Like a call and response at a church. If you know what is expected of you, it is easy to succeed. As your son grows in this<br/>\n context, he will acquire more informaton that will help reading to become just another tool that he can use as and when he is ready to. Reading can also hinder meaning. It can lead one to making false assumptions, or conclusions that aren&#39;t backed up by experience. Your son will be better prepared to question what he is reading. He will have used other tools to derive information for longer than his siblings which may make him better at looking for other source material to verify any assumption reading might lead him to make. I know Simon looks for environmental clues much more readily than either Linnaea or I do. I know that he is much more contextual in his experience of things than I am. If there are words to be read, I read them and derive information from them that may not be backed up by other information available to me. For Simon written words are not the alpha and omega of experience as they often are for me. <br/>\n <br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would you do to help your child learn to read when HE wants to...","postDate":"1340837729","msgId":68006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDA4Mzc3MjkuNTY2NjYuWWFob29NYWlsTmVvQHdlYjg3MzA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg=="},"prevInTopic":68004,"nextInTopic":68007,"prevInTime":68005,"nextInTime":68007,"topicId":67992,"numMessagesInTopic":0,"msgSnippet":"I would talk about the point of reading, about how reading is a means to an end and not necessarily an end in itself. I would be sympathetic. I would be (and","messageBody":"<div id=\"ygrps-yiv-1852044890\">I would talk about the point of reading, about how reading is a means to an end and not necessarily an end in itself. I would be sympathetic. I would be (and was) very interested in what was going on, in how the connections were being made. <br/>\n<br/>\nSimon didn&#39;t read until his 12th birthday. Linnaea, who is 3 years younger, read at 6. Simon never felt that Linnaea&#39;s reading earlier than he read was a statement about him, something that I, who has often envied another&#39;s skill, don&#39;t fully understand why. He never worried that he wouldn&#39;t read. And he didn&#39;t actually actively seek reading as a skill. He didn&#39;t strive to be a reader, he was confident that when he was ready he would read. Again, I don&#39;t know why he had such a strong sense of reading as inevitable, but he was right. He reads now with out difficulty. In situations where he is reading aloud, he will practice the reading material, read it beforehand to make sure that he doesn&#39;t stumble or mispronounce something. <br/>\n<br/>\nReading is an amazing process. It is an accretionary process, where neural connections are laid down over time that make this decoding possible. When I lived in Japan I couldn&#39;t read a bus destination. I couldn&#39;t find tampons at the chemist and had to ask in this increasingly absurd and graphic pantomime with the store clerk that ended with her blushing. It was fascinating to not be able to do what I had been doing since I can remember, reading without thinking about it. I got to a point where I could recognise certain signs, I don&#39;t know that I could do it now, years later, still. I did not achieve any standard of literacy. I was only marginally functionally illiterate. Mostly I depended on others to help me to negotiate those things that reading facilitated. My neural pathways that exist that let me write this, that let me read this, without being aware of any process occurring didn&#39;t hold true for kanji and katakana. I am only good reading what I<br/>\n already know how to read. I am as illiterate as your son in many languages. It would take years and years for me to be able to read Japanese as I read English. More years than I have, probably. And I would need to live in Japan as a Japanese person, probably. Since reading is a cultural experience as well as a technical one. <br/>\n<br/>\nMeredith wrote about context, reading in context. I&#39;m learning to play ukulele. I have been learning to play ukulele for 2 years. I play ukulele a bit and I learn to play more as I play. My lack of ability to read notes written in classic notation hasn&#39;t kept me from playing ukulele. It hasn&#39;t stopped me from watching and listening to other people playing and thinking about technique and approach. It hasn&#39;t kept me from looking for other ways of acquiring information on how to play songs in the absence of an ability to read sheet music. Mostly it&#39;s kept me from transcribing songs, and that only a bit. The more I play the better I hear, and the easier it is for me to figure out how a song would be written out to play. Sandra&#39;s written about how learning to play a song from sheet music is the least valuable method. It&#39;s best to learn it first hand, from folks who know it, to listen to it, to talk it, to learn it. Second is to learn it from listening to<br/>\n folks playing, if not from talking to them. Third is to have a piece of sheet music to learn from. <br/>\n<br/>\nOn this page: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/music/\">http://sandradodd.com/music/</a><br/>\nSandra quotes Sandra:<br/>\nI want to remind people that music doesn&#39;t live in notes on paper, it lives in the air.<br/>\nPeople can be VERY musical without knowing how to read or write music, just as people can be very verbal, tell stories, be poetic and dramatic without reading and writing.<br/>\nThe first and best thing you can do concerning music is to have it in your lives, recorded and live, performed by others, performed by yourselves by singing, at least.<br/>\n<br/>\nSo, if I were to help my son to learn to read, I would help him to be alright with not reading yet. I would help him to see reading as a means and not an end. I would figure out ways that he could access information without having to read to get, to access books without having to read to read them, to access information without having to read to get it. I would talk about how little we know about how reading happens in any individual, about how different reading has looked, there are languages that were written down in knots :<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ee.ryerson.ca/~elf/abacus/inca-khipu.html,\">http://www.ee.ryerson.ca/~elf/abacus/inca-khipu.html,</a> what would it be to have everyone read tactilely and not just those who read Braille. And Braille isn&#39;t even it&#39;s own language, it&#39;s whatever language it is, an alphabet, a letter by letter translation. What would a language written in string be like? How would it infuse your daily life? Presumably it wouldn&#39;t, presumably it wasn&#39;t something that all people knew, it was a<br/>\n special subject for those who traded in information, who were there own elite. Within all of that I would work to make it easier for my son to not read and to not be waiting to read and to recognise that reading is something that happens as opposed to something that can be made to happen. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would you do to help your child learn to read when HE wants to...","postDate":"1340829211","msgId":68004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0QTU4M0UwLUEzODItNEQ4RS1CRTYwLTk0REU4QkNGMjdDRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBT09UYVhPWStISz1nUDNncmdLenJkeVc4dUtBYzltbVJoWkp5YnNlNFk5SytBc3ctd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPiA8Q0FPT1RhWE9ZK0hLPWdQM2dyZ0t6cmR5Vzh1S0FjOW1tUmhaSnlic2U0WTlLK0Fzdy13QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":67999,"nextInTopic":68006,"prevInTime":68003,"nextInTime":68005,"topicId":67992,"numMessagesInTopic":0,"msgSnippet":"http://sandradodd.com/reading Please read the one about advantages of later reading, especially. Sandra","messageBody":"<div id=\"ygrps-yiv-765398746\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nPlease read the one about advantages of later reading, especially.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What would you do to help your child learn to read when HE wants to...","postDate":"1340797724","msgId":67999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzZXJ1cytzZm5yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg=="},"prevInTopic":67997,"nextInTopic":68004,"prevInTime":67998,"nextInTime":68000,"topicId":67992,"numMessagesInTopic":0,"msgSnippet":"... Even at 12, it s possible he s not ready. If he s not ready, then helping him learn is more about helping him feel okay with what he s able to do right","messageBody":"<div id=\"ygrps-yiv-1563519606\">&quot;sebrina w&quot; &lt;sunmamma@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My 12 year old wants to learn to read.<br/>\n<br/>\n </span></blockquote>Even at 12, it&#39;s possible he&#39;s not ready. If he&#39;s not ready, then &quot;helping him learn&quot; is more about helping him feel okay with what he&#39;s able to do right now, reassuring him, and making sure he&#39;s not swimming in a bunch of misconceptions about how people learn to read. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; His younger brothers who are 10 and 8 can read and his sister who is 5 is starting to read as well. He has asked me to help him and we&#39;ve tried a few different methods and it&#39;s not clicking for him.<br/>\n </span></blockquote>***************<br/>\n<br/>\nDepending on the methods, you may be enforcing misconceptions, especially if you&#39;ve been doing anything phonics related. In general, people who read later tend to find letter-sound information gets in the way of reading. If he&#39;s looking at the way his siblings learn and expecting to look like them, he may need you to reassure him that different people learn differently. <br/>\n<br/>\nI&#39;m willing to bet there are words and signs he recognizes. Help him see that That&#39;s reading. Do you have a magnetic poetry set? Those are fun for playing with words and leaving notes. Also word tiles or cards to make labels and short sentences can be a nice way to play with words.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He has a lot of the symptoms of dyslexia.<br/>\n<br/>\n </span></blockquote>All the more reason to avoid phonics like the plague! Read things for him. If he wants to &quot;work on reading&quot; play with words in the context of sentences. My girlfriends daughter could read short sentences before she could identify all the words out of context - context is Important! And do point out that your son probably does recognize many words in context already. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would you do to help your child learn to read when HE wants to...","postDate":"1340768917","msgId":67997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNTJERDI3LTQ1RjMtNDM3OC05RUVDLUY3OUFGQzk1QzU0RkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg=="},"prevInTopic":67996,"nextInTopic":67999,"prevInTime":67996,"nextInTime":67998,"topicId":67992,"numMessagesInTopic":0,"msgSnippet":"... I agree with what Pam wrote. It must be hard with younger kids already reading. I only have one child; she read (to *her* standards, meaning being able to","messageBody":"<div id=\"ygrps-yiv-1285412560\"><blockquote><span title=\"ireply\">&gt; My 12 year old wants to learn to read. His younger brothers who are  <br/>\n&gt; 10 and 8 can read and his sister who is 5 is starting to read as  <br/>\n&gt; well. He has asked me to help him and we&#39;ve tried a few different  <br/>\n&gt; methods and it&#39;s not clicking for him. I&#39;m not sure where to go from  <br/>\n&gt; here. He is sad and frustrated. He has a lot of the symptoms of  <br/>\n&gt; dyslexia. I was diagnosed with dyslexia as a child so I can see it  <br/>\n&gt; very much in him but I don&#39;t know if that means he can or can&#39;t  <br/>\n&gt; learn to read without a trained tutor? I would be happy to wait and  <br/>\n&gt; see but he wants this badly and he is telling me he thinks he is  <br/>\n&gt; stupid because all his younger siblings are passing him :(<br/>\n<br/>\n </span></blockquote>I agree with what Pam wrote. It must be hard with younger kids already  <br/>\nreading. I only have one child; she read (to *her* standards, meaning  <br/>\nbeing able to read &quot;reticulated giraffe&quot;) at 10 1/2 or so.<br/>\n<br/>\nPam mentioned gathering stories of late readers for your son. There  <br/>\nare lots here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nWhat helped my daughter was providing lots of different ways for her  <br/>\nto be around words, so she could read when she was ready. We read to  <br/>\nher every day from early childhood. We had plenty of books, magazines  <br/>\n& newspapers around so she knew we read a lot. She had books that  <br/>\nfocused on her interests (animals) and computer games/Nintendo DS  <br/>\ngames with that focus. We went to zoos, we were part of a naturalists&#39;  <br/>\nclub, we watched tv shows and movies that featured animals. She rode  <br/>\nhorses. We went to &quot;Reading with Rover&quot; days at our local bookstore.  <br/>\nShe collected animal figures (Breyer Horses which came with stories),  <br/>\nwe played animal board games. The printed word is everywhere!<br/>\n<br/>\nCan you see where I&#39;m going with this? :-)<br/>\n<br/>\nDoes your son have a passion, a fascination with something? Surround  <br/>\nhim with opportunities to read when he&#39;s ready through that passion or  <br/>\ninterest.<br/>\n<br/>\nI don&#39;t know if my kid had dyslexia or a learning disability of any  <br/>\nkind. I was already on unschooling lists and websites when she was of  <br/>\nthe age that schools would want her to be reading. *My* reading there  <br/>\nhelped me relax enormously. I didn&#39;t just &quot;trust&quot; she would read,  <br/>\nthough, without providing a conducive environment.<br/>\n<br/>\nIf kids want to play around on starfall, I guess that&#39;s fine. But that  <br/>\nkind of website misses the point, to me. Its purpose is &quot;to teach  <br/>\nreading through phonics&quot;.  People *learn* to read - its an internal  <br/>\nprocess; it&#39;s not a result of teaching of any kind.<br/>\n<br/>\nReading came naturally to my daughter out of her interests. It wasn&#39;t  <br/>\nreading for reading&#39;s sake.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would you do to help your child learn to read when HE wants to...","postDate":"1340767618","msgId":67996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOeUdhdlA2VTZpWmMrWktMZGp4VUtmb1ZEVFgwNHBPS3pKLTJiYWZZdVBzUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBQUd6cGR1d2RaOXNFVjBCTHFXQWZTWk5xaVVtUHhldFhDTDNpSFo5UlhhSF9xK0puQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPgk8Q0FBR3pwZHV3ZFo5c0VWMEJMcVdBZlNaTnFpVW1QeGV0WENMM2lIWjlSWGFIX3ErSm5BQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":67995,"nextInTopic":67997,"prevInTime":67995,"nextInTime":67997,"topicId":67992,"numMessagesInTopic":0,"msgSnippet":"Starfall is a phonics program that is very cutesy - that could be fun for a kid if they happened to be interested in that kind of thing, but it could also be","messageBody":"<div id=\"ygrps-yiv-1407259952\">Starfall is a phonics program that is very cutesy - that could be fun for a<br/>\nkid if they happened to be interested in that kind of thing, but it could<br/>\nalso be hugely frustrating. And, for a 12 yo boy, it might seem really<br/>\nbabyish and very likely insulting.<br/>\n<br/>\nI&#39;d suspect that just when the person posting aboutit got that program for<br/>\nher daughter was exactly when the child happened to be developmentally<br/>\nready to read...this is the problem with teaching and programs - people<br/>\nattribute the child&#39;s success to the program but it is very likely she&#39;d<br/>\nhave learned to read just about the same time and just as well without any<br/>\nspecific program. For sure there is NO program that can teach a child to<br/>\nread who isn&#39;t developmentally ready to read. Wanting to read isn&#39;t enough.<br/>\n<br/>\nI&#39;m sure he is surrounded by opportunities to learn to read - that isn&#39;t<br/>\nhis problem and finding just the right program isn&#39;t a solution. Twelve<br/>\nyears old is really not super late at all for unschooled kids, especially<br/>\nboys.<br/>\n<br/>\nI say protect him from any teasing, give him the words to use when it comes<br/>\nup among friends, and really focus in on the things he does do well. Keep<br/>\nhim busy and distracted from worrying over the reading - time will go by<br/>\nand his time to read will come.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Jun 26, 2012 at 7:18 PM, Melissa Umbaugh &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dammedark@...\">dammedark@...</a>&gt;wrote:<br/>\n<br/>\n&gt; Hi, My daughter is 10 and just learned to read last year. She has a<br/>\n&gt; learning disablitiy and alot of the dyslexa problems. I backed off of<br/>\n&gt; pushing her to read and let her go on starfall.com when ever she wanted<br/>\n&gt; that helped her a good bit then she asked to take it a step further and I<br/>\n&gt; order the reading horizions program. now I can not get the books out of<br/>\n&gt; her hand...Try to give him the oline tools such as games and starfall. I<br/>\n&gt; know starfall is for younger kids but it does help..<br/>\n&gt; Good luck.<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would you do to help your child learn to read when HE wants to...","postDate":"1340764167","msgId":67994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPWStISz1nUDNncmdLenJkeVc4dUtBYzltbVJoWkp5YnNlNFk5SytBc3ctd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg=="},"prevInTopic":67992,"nextInTopic":67995,"prevInTime":67993,"nextInTime":67995,"topicId":67992,"numMessagesInTopic":0,"msgSnippet":"... Poor guy - I m sure you really feel bad for him - it makes it a lot tougher to be a later reader when younger siblings can read. But, there are many other","messageBody":"<div id=\"ygrps-yiv-736024484\">On Tue, Jun 26, 2012 at 4:50 PM, sebrina w &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sunmamma@...\">sunmamma@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would be happy to wait and see but he wants this badly and he is telling<br/>\n&gt; me he thinks he is stupid because all his younger siblings are passing him<br/>\n&gt; :(<br/>\n<br/>\n<br/>\n </span></blockquote>Poor guy - I&#39;m sure you really feel bad for him - it makes it a lot tougher<br/>\nto be a later reader when younger siblings can read. But, there are many<br/>\nother unschooled kids who learned to read well after 12. Collect stories of<br/>\nlater readers and reassure him with those. And, most important, be sure he<br/>\nrecognizes his own strengths in other ways than reading. I do recommend<br/>\nthat maybe at this stage &quot;The Gift of Dyslexia&quot; might be good for you to<br/>\nread because it is really really positive and goes into all kinds of<br/>\npositive strengths that kids with dyslexia characteristics ALSO often have<br/>\n(that are usually ignored because so much focus is put on reading). It<br/>\nwould give you more confidence, I think, and you&#39;d probably pass that on to<br/>\nhim.<br/>\n<br/>\nSympathize with him - it is hard to be outside the norm on things. But<br/>\ndon&#39;t go overboard with your sympathy, either, because the more you treat<br/>\nthis as natural and normal variation, the better.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":434084148,"authorName":"Melissa Umbaugh","from":"Melissa Umbaugh &lt;dammedark@...&gt;","profile":"jindo_lover","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would you do to help your child learn to read when HE wants to...","postDate":"1340763533","msgId":67995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQUd6cGR1d2RaOXNFVjBCTHFXQWZTWk5xaVVtUHhldFhDTDNpSFo5UlhhSF9xK0puQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg=="},"prevInTopic":67994,"nextInTopic":67996,"prevInTime":67994,"nextInTime":67996,"topicId":67992,"numMessagesInTopic":0,"msgSnippet":"Hi, My daughter is 10 and just learned to read last year.  She has a learning disablitiy and alot of the dyslexa problems.  I backed off of pushing her to read","messageBody":"<div id=\"ygrps-yiv-343819246\">Hi, My daughter is 10 and just learned to read last year.  She has a<br/>\nlearning disablitiy and alot of the dyslexa problems.  I backed off of<br/>\npushing her to read and let her go on starfall.com when ever she wanted<br/>\nthat helped her a good bit then she asked to take it a step further and I<br/>\norder the reading horizions program.  now I can not get the books out of<br/>\nher hand...Try to give him the oline tools such as games and starfall. I<br/>\nknow starfall is for younger kids but it does help..<br/>\nGood luck.<br/>\nMelissa<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Jun 26, 2012 at 7:50 PM, sebrina w &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sunmamma@...\">sunmamma@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My 12 year old wants to learn to read. His younger brothers who are 10 and<br/>\n&gt; 8 can read and his sister who is 5 is starting to read as well. He has<br/>\n&gt; asked me to help him and we&#39;ve tried a few different methods and it&#39;s not<br/>\n&gt; clicking for him. I&#39;m not sure where to go from here. He is sad and<br/>\n&gt; frustrated. He has a lot of the symptoms of dyslexia. I was diagnosed with<br/>\n&gt; dyslexia as a child so I can see it very much in him but I don&#39;t know if<br/>\n&gt; that means he can or can&#39;t learn to read without a trained tutor? I would<br/>\n&gt; be happy to wait and see but he wants this badly and he is telling me he<br/>\n&gt; thinks he is stupid because all his younger siblings are passing him :(<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":173560398,"authorName":"sebrina w","from":"&quot;sebrina w&quot; &lt;sunmamma@...&gt;","profile":"sebrinawilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What would you do to help your child learn to read when HE wants to...","postDate":"1340754607","msgId":67992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzZGhyZit1ZTRmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67994,"prevInTime":67991,"nextInTime":67993,"topicId":67992,"numMessagesInTopic":0,"msgSnippet":"My 12 year old wants to learn to read. His younger brothers who are 10 and 8 can read and his sister who is 5 is starting to read as well. He has asked me to","messageBody":"<div id=\"ygrps-yiv-1616585116\">My 12 year old wants to learn to read. His younger brothers who are 10 and 8 can read and his sister who is 5 is starting to read as well. He has asked me to help him and we&#39;ve tried a few different methods and it&#39;s not clicking for him. I&#39;m not sure where to go from here. He is sad and frustrated. He has a lot of the symptoms of dyslexia. I was diagnosed with dyslexia as a child so I can see it very much in him but I don&#39;t know if that means he can or can&#39;t learn to read without a trained tutor? I would be happy to wait and see but he wants this badly and he is telling me he thinks he is stupid because all his younger siblings are passing him :(</div>","specialLinks":[]}],"prevTopicId":67813,"nextTopicId":4231}}