{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":117801964,"authorName":"Todd M.","from":"&quot;Todd M.&quot; &lt;Ozarkren@...&gt;","profile":"trozark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Happy to be a homeschooler :)","postDate":"1034115153","msgId":45802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4xLjYuMi4yMDAyMTAwODE3MDkyNS4wMDlmNzAzMEBlZGlzb24ucmlwaW50ZXJuZXQuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":45801,"nextInTime":45803,"topicId":45802,"numMessagesInTopic":0,"msgSnippet":"Schools test urine to detect student tobacco use Advocates say smoking is precursor of drug use ","messageBody":"<div id=\"ygrps-yiv-748927311\">Schools test urine to detect student tobacco use<br/>\nAdvocates say smoking is precursor of drug use<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sunspot.net/news/health/bal-te.tobacco08oct08,0,4987718.story?coll=bal%2Dhealth%2Dheadlines\">http://www.sunspot.net/news/health/bal-te.tobacco08oct08,0,4987718.story?coll=bal%2Dhealth%2Dheadlines</a><br/>\n--------------------------------------------------------------------------------<br/>\nAssociated Press<br/>\nOriginally published October 8, 2002<br/>\n<br/>\nVESTAVIA HILLS, Ala. - Breath mints won&#39;t cut it anymore for students who <br/>\nhave been smoking in the bathroom; schools around the country are <br/>\nadministering urine tests to teen-agers to find out whether they have been <br/>\nusing tobacco.<br/>\n<br/>\nOpponents say such testing violates students&#39; rights and can keep them out <br/>\nof the extracurricular activities they need to stay on track. But some <br/>\nadvocates say smoking is a ticket to more serious drug use.<br/>\n<br/>\n&quot;Some addicted drug users look back to cigarettes as the start of it all,&quot; <br/>\nsaid Jeff McAlpin, director of marketing for EDPM, a Birmingham <br/>\ndrug-testing company.<br/>\n<br/>\nShort of catching them in the act, school officials previously had no way <br/>\nof proving that students had been smoking.<br/>\n<br/>\nTesting students for drugs has spread in recent years and was given a boost <br/>\nin June when the U.S. Supreme Court affirmed random testing of those in <br/>\nextracurricular activities. Tobacco can easily be added to the usual <br/>\nbattery of tests.<br/>\n<br/>\n&quot;I agree with it,&quot; said 16-year- old Vestavia Hills High School junior <br/>\nRosemary Stafford, a member of the marching band. &quot;It&#39;s illegal, it&#39;s <br/>\naddictive. Maybe the punishment shouldn&#39;t be as severe, but they should <br/>\ntest for it.&quot;<br/>\n<br/>\nIn Alabama, where the legal age for purchasing and smoking tobacco products <br/>\nis 19, about a dozen districts, mostly in the Birmingham area, test for <br/>\nnicotine along with alcohol and illegal drugs, including marijuana.<br/>\n<br/>\nIn most cases, the penalties for testing positive for cotinine - a <br/>\nmetabolic byproduct that remains in the body after smoking or chewing <br/>\ntobacco - are the same as those for illegal drugs: The student&#39;s parents <br/>\nare notified and he or she is usually placed on school probation and <br/>\nbriefly suspended from sports or other activities.<br/>\n<br/>\nAlabama&#39;s Hoover school system randomly tested 679 of its 1,500 athletes <br/>\nfor drug use this past school year. Fourteen high school students tested <br/>\npositive, 12 of them for tobacco.<br/>\n<br/>\nSchools in Blackford County, Ind., test for tobacco use in athletes, <br/>\nparticipants in other extracurricular activities and students who take <br/>\ndriver&#39;s education or apply for parking permits.<br/>\n<br/>\nIn Lockney, Texas, a federal judge recently struck down the district&#39;s <br/>\ntesting of all students for the use of drugs, alcohol and tobacco.<br/>\n<br/>\nIn Columbia County, Fla., the school board will vote today on a testing <br/>\npolicy that would include tobacco. Teen-agers who take part in <br/>\nextracurricular activities or apply for permits to drive to school would be <br/>\nscreened.<br/>\n<br/>\n&quot;Tobacco does and will affect a larger majority of the students than <br/>\nalcohol or drugs,&quot; said Gloria Spizey, the county&#39;s coordinator for Safe <br/>\nand Drug-Free Schools. &quot;Tobacco use can be devastating. We felt it needed <br/>\nto stand with the other drugs.&quot;<br/>\n<br/>\nScreenings can detect cotinine for up to 10 days in regular smokers of <br/>\nabout a half-pack, or 10 cigarettes, a day, McAlpin said. Experts say it is <br/>\nunlikely that cotinine would collect in people exposed to secondhand smoke.<br/>\n<br/>\n&quot;Tobacco is illegal for them to have - it&#39;s also a health and safety <br/>\nissue,&quot; said Phil Hastings, supervisor of safety and alternative education <br/>\nfor schools in Decatur, Ala., which recently adopted a testing program that <br/>\nincludes tobacco. &quot;We&#39;ve got a responsibility to let the kids know the <br/>\ndangers.&quot;<br/>\n<br/>\nWhile random drug testing overall is being fought by the American Civil <br/>\nLiberties Union and students&#39; rights groups, the addition of nicotine <br/>\ntesting has drawn little opposition.<br/>\n<br/>\nShawn Heller, executive director of Students for Sensible Drug Policy in <br/>\nWashington, said tobacco use by teen-agers is a major problem, but testing <br/>\nfor it is just another step in the invasion of students&#39; privacy.<br/>\n<br/>\n&quot;We&#39;re making schools like prisons,&quot; he said.<br/>\n<br/>\nCopyright © 2002, The Baltimore Sun<br/>\n---------------------------------------------------------------<br/>\n&quot;Respect the child. Be not too much his parent. Trespass not on his solitude.&quot;<br/>\n-Ralph Waldo Emerson</div>","specialLinks":[]}],"prevTopicId":45781,"nextTopicId":45807}}