{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":299051558,"authorName":"Michelle Hogan","from":"Michelle Hogan &lt;michelle.hogan@...&gt;","profile":"michelle.hogan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Toy budget/allowance advice?","postDate":"1296758150","msgId":59427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5MzY0My44OTc2My5xbUB3ZWIxNjE3MDkubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PGlpNzd2bCttOHY4QGVHcm91cHMuY29tPg=="},"prevInTopic":59376,"nextInTopic":0,"prevInTime":59426,"nextInTime":59428,"topicId":59347,"numMessagesInTopic":0,"msgSnippet":"Hi! We have gone through periods when kids want to buy all kinds of things - and I think it s very fun and interesting for them to have that kind of control","messageBody":"<div id=\"ygrps-yiv-556284075\">Hi!<br/>\nWe have gone through periods when kids want to buy all kinds of things - and I think it&#39;s very fun and interesting for them to have that kind of control over what they get. We are always tight on $ around here, so we&#39;ve done a couple of things. First, we don&#39;t go out much. I try very hard to reign our own spending in by not going out to stores so much. I&#39;ve also helped the kids curb impulse shopping by giving them bank accounts at the &quot;Hogan&quot; bank. They have accounts on the computer that helps them keep track of their money. We really don&#39;t do allowances - mostly because we all forget about them and then are so far behind I&#39;d have to take out a loan to catch up. Instead, the kids do extra jobs and earn money for them, sell stuff they don&#39;t want anymore and help us sell veggies and other items at the farmers&#39; market. Any money they make, they can spend or bank as they wish. As for those little items...I&#39;ve always just been honest. When I can buy them - I<br/>\n say sure, go ahead. When I can&#39;t afford it - I just say, I&#39;m sorry - I don&#39;t have it right now, but if you still want it the next time we come this way - we&#39;ll try. Usually, either they really want it and we make an effort to get the item - or they forget about it. <br/>\nThe more honest I am with my kids about everything, from money to food or whatever...the more they understand. I rarely have issues with kids resenting us because we can&#39;t afford something. They know we&#39;ll get it for them if/when we can and if we can&#39;t - then it&#39;s disappointing, but it&#39;s not the end of the world. <br/>\nAlso - I have found that offering to make a similar item - whether food or toy - helps when I have to say &quot;I just can&#39;t this time.&quot;<br/>\nGood Luck!<br/>\nMish<br/>\norganicallyinclined.org<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 1/31/11, Alex &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:missalexmissalex@...\">missalexmissalex@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Alex &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:missalexmissalex@...\">missalexmissalex@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Toy budget/allowance advice?<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Monday, January 31, 2011, 4:01 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      Hello all,<br/>\n<br/>\n <br/>\n<br/>\nMy 3 1/2 year old daughter discovered the joy of buying toys in a big way this Christmas. We are on a tight budget due to recently buying a fixer house, me needing some dental work very soon, and saving for an upcoming family vacation that is important to all of us. We&#39;ve been living pretty frugally for quite a while. <br/>\n<br/>\n<br/>\n<br/>\nMy husband and I figured out what we can give as an allowance right now. It&#39;s not much, but I&#39;ve taken every chance I can to help K stretch it by going to garage sales and thrift stores. When she is close I chip in an extra dollar or 2. We tried the dollar store and feel like the stuff there is so frustrating in how quickly it falls apart that we don&#39;t want to do it anymore. I&#39;ve looked on Freecycle for the kinds of things she wants too. It has been 4 weeks and I am really appreciating all the joy and natural learning that is coming out of this. I *would* like to minimize the frustration, while still holding close to our budget. We were thinking of giving her a much larger amount one week a month so that she can buy a larger item once in a while. There are a few things she likes that she would have to save for 6 weeks or more to get and I don&#39;t think that&#39;s fair to ask her to do if I can find a less frustrating way. I&#39;d rather not give her a little more<br/>\n each week instead also because then she buys a small set of something and then still really wants the deluxe set which has the same items plus more. <br/>\n<br/>\n<br/>\n<br/>\nSo, I think that&#39;s what we&#39;re doing, but I wanted to know if any of you have done something else that worked well for you. I know this is a great group to talk to about buying toys! I&#39;d love any suggestions that are respectful of the reality of our budget.<br/>\n<br/>\n<br/>\n<br/>\nThank you! <br/>\n<br/>\n<br/>\n<br/>\nAlex N. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Toy budget/allowance advice?","postDate":"1296589308","msgId":59376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpOW5scys4am0xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpOWtxaSttNHQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":59373,"nextInTopic":59427,"prevInTime":59375,"nextInTime":59377,"topicId":59347,"numMessagesInTopic":0,"msgSnippet":"What has worked best for our 4 year old is not taking him to the store as often. For quite a while, the kids were going with me every time we did errands. He","messageBody":"<div id=\"ygrps-yiv-1195475685\">What has worked best for our 4 year old is not taking him to the store as often. For quite a while, the kids were going with me every time we did errands. He wanted an expensive Lego set ($50+) every week, not the $5 toys his sisters wanted/liked. I started doing errands alone on the weekends and can now give them all a larger amount of pocket money when they do shop with me.<br/>\n<br/>\nAndrea Q<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;Alex&quot; &lt;missalexmissalex@&gt; wrote:<br/>\n&gt; &gt;We were thinking of giving her a much larger amount one week a month so that she can buy a larger item once in a while. There are a few things she likes that she would have to save for 6 weeks or more to get and I don&#39;t think that&#39;s fair to ask her to do if I can find a less frustrating way.<br/>\n&gt; ***************<br/>\n&gt; <br/>\n&gt; I hadn&#39;t seen that particular variation before - at least not in a deliberate sort of way. It could be a good solution for a young child who isn&#39;t really up for saving money, yet, to be able to get little things regularly and big things, sometimes. We&#39;ve done something similar with &quot;extra&quot; income - George is self-employed, part time, so we have regular income and &quot;extras&quot; and use those windfalls for larger ticket purchases. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toy budget/allowance advice?","postDate":"1296586386","msgId":59373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpOWtxaSttNHQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpNzd2bCttOHY4QGVHcm91cHMuY29tPg=="},"prevInTopic":59356,"nextInTopic":59376,"prevInTime":59372,"nextInTime":59374,"topicId":59347,"numMessagesInTopic":0,"msgSnippet":"... *************** I hadn t seen that particular variation before - at least not in a deliberate sort of way. It could be a good solution for a young child","messageBody":"<div id=\"ygrps-yiv-1969637282\">&quot;Alex&quot; &lt;missalexmissalex@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;We were thinking of giving her a much larger amount one week a month so that she can buy a larger item once in a while. There are a few things she likes that she would have to save for 6 weeks or more to get and I don&#39;t think that&#39;s fair to ask her to do if I can find a less frustrating way.<br/>\n </span></blockquote>***************<br/>\n<br/>\nI hadn&#39;t seen that particular variation before - at least not in a deliberate sort of way. It could be a good solution for a young child who isn&#39;t really up for saving money, yet, to be able to get little things regularly and big things, sometimes. We&#39;ve done something similar with &quot;extra&quot; income - George is self-employed, part time, so we have regular income and &quot;extras&quot; and use those windfalls for larger ticket purchases. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Toy budget/allowance advice?","postDate":"1296515601","msgId":59356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltMGpQb014eFFxeXY0MzRIPWpITHpvTU1ET2F0Y0hNTnp0MytqckBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlpNzd2bCttOHY4QGVHcm91cHMuY29tPg==","referencesHeader":"PGlpNzd2bCttOHY4QGVHcm91cHMuY29tPg=="},"prevInTopic":59347,"nextInTopic":59373,"prevInTime":59355,"nextInTime":59357,"topicId":59347,"numMessagesInTopic":0,"msgSnippet":"Our family is very low income, paycheck to paycheck and constantly juggling bills. When we were both working we came up with the idea of giving him a ","messageBody":"<div id=\"ygrps-yiv-62759393\">Our family is very low income, paycheck to paycheck and constantly juggling<br/>\nbills.<br/>\n<br/>\nWhen we were both working we came up with the idea of giving him a<br/>\npercentage of our income.  We worked jobs where we got paid per hour, so our<br/>\nincome fluctuated constantly.  I believe we did 1% at that time.  The idea<br/>\nbehind it was, the more we worked the more Draven had to be independent.<br/>\n This was a great system for us because if I worked a ton (some weeks I<br/>\nworked 75+ hours), a week later he would get a decent amount of money, but<br/>\nif my hours were cut, there was no disappointment when I couldn&#39;t give him<br/>\nas much.  He was older so he also understood when a bill was due and we had<br/>\nto take every spare cent to pay that bill . . . we&#39;d write the amount owed<br/>\nto him on the calendar and the following week he would get both weeks worth.<br/>\n<br/>\nSince then my partner and I have both lost our full time jobs and have been<br/>\nliving off of two very small part time jobs.  We&#39;ve had to move back into my<br/>\nparents house to help out with a medical emergency.  There is NO spare money<br/>\nfor anything.  We had a yard sale and Draven got a percentage for helping<br/>\nout, as well as keeping the income from his toys/clothes that sold.  Perhaps<br/>\nyour daughter is growing out of some clothes/toys and you can offer to list<br/>\nthem on craigslist or ebay.  Draven also tends to (quite often) trade in<br/>\ngames for money towards other used games.<br/>\n<br/>\nIt&#39;s also tax time, and when we get our taxes back he&#39;ll get a percentage of<br/>\nthat, plus we have a list of things we&#39;ve promised him we&#39;ll buy for him.<br/>\n There was some disappointment this week because I expected my taxes this<br/>\npast Friday, or today at the latest, but the IRS is backed up and we&#39;ve been<br/>\ntold it&#39;ll be another week.<br/>\n<br/>\nHe has before, decided to use layaway (back then it was free at walmart, but<br/>\nnow it&#39;s still available at kmart for a fee), so he didn&#39;t spend money on<br/>\nsomething smaller when he was trying to save for something big.<br/>\n<br/>\nAt Christmas I&#39;ve encouraged family to give him cash or gift cards (the<br/>\nprepaid visa type gift cards are the best) and he spreads that money out as<br/>\nmuch as possible.<br/>\n<br/>\nAnother big thing for us has been keeping him involved in the family budget.<br/>\n He has a pretty good idea of what all of our bills are each month, and at<br/>\nthis point has figured out when in the month they&#39;re due.  We played a game<br/>\nof sorts as a family that involved cutting our electricity usage as much as<br/>\npossible to see how low we could get our electric bills.  Once he realized<br/>\nthat keeping the house a little chillier in the winter, and a little warmer<br/>\nin the summer, meant more money for all of us to spend, he was all for<br/>\nbundling up or wearing minimal clothing to stay comfortable.  We did a<br/>\nsimilar thing with water bills.<br/>\n<br/>\nHe also sees us constantly price checking items on our wish list.  When<br/>\nwe&#39;re price checking and looking at things used he likes to chart the prices<br/>\nwe find and will recommend new websites to look stuff up on.<br/>\n<br/>\nI&#39;ve also found it useful to mention to other friends and family members the<br/>\nthings on our wishlist.  Recently I talked to my older sister about us<br/>\nwanting some sort of book reader that will also play games for road trips<br/>\nand stuff.  Turns out she had an older version of the Ipod touch sitting<br/>\naround unused.  She&#39;s sending it to us for free.  I&#39;ve gotten bags of play<br/>\nclothes and other misc. toys over the years just by mentioning to someone<br/>\nthat we&#39;re looking for a good price on that particular thing.<br/>\n<br/>\nThis has gotten WAY too long, but I hope it helps.<br/>\n<br/>\nTina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Jan 31, 2011 at 4:01 PM, Alex &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:missalexmissalex@...\">missalexmissalex@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hello all,<br/>\n&gt;<br/>\n&gt; My 3 1/2 year old daughter discovered the joy of buying toys in a big way<br/>\n&gt; this Christmas. We are on a tight budget due to recently buying a fixer<br/>\n&gt; house, me needing some dental work very soon, and saving for an upcoming<br/>\n&gt; family vacation that is important to all of us. We&#39;ve been living pretty<br/>\n&gt; frugally for quite a while.<br/>\n&gt;<br/>\n&gt; My husband and I figured out what we can give as an allowance right now.<br/>\n&gt; It&#39;s not much, but I&#39;ve taken every chance I can to help K stretch it by<br/>\n&gt; going to garage sales and thrift stores. When she is close I chip in an<br/>\n&gt; extra dollar or 2. We tried the dollar store and feel like the stuff there<br/>\n&gt; is so frustrating in how quickly it falls apart that we don&#39;t want to do it<br/>\n&gt; anymore. I&#39;ve looked on Freecycle for the kinds of things she wants too. It<br/>\n&gt; has been 4 weeks and I am really appreciating all the joy and natural<br/>\n&gt; learning that is coming out of this. I *would* like to minimize the<br/>\n&gt; frustration, while still holding close to our budget. We were thinking of<br/>\n&gt; giving her a much larger amount one week a month so that she can buy a<br/>\n&gt; larger item once in a while. There are a few things she likes that she would<br/>\n&gt; have to save for 6 weeks or more to get and I don&#39;t think that&#39;s fair to ask<br/>\n&gt; her to do if I can find a less frustrating way. I&#39;d rather not give her a<br/>\n&gt; little more each week instead also because then she buys a small set of<br/>\n&gt; something and then still really wants the deluxe set which has the same<br/>\n&gt; items plus more.<br/>\n&gt;<br/>\n&gt; So, I think that&#39;s what we&#39;re doing, but I wanted to know if any of you<br/>\n&gt; have done something else that worked well for you. I know this is a great<br/>\n&gt; group to talk to about buying toys! I&#39;d love any suggestions that are<br/>\n&gt; respectful of the reality of our budget.<br/>\n&gt;<br/>\n&gt; Thank you!<br/>\n&gt;<br/>\n&gt; Alex N.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":321996436,"authorName":"Alex","from":"&quot;Alex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Toy budget/allowance advice?","postDate":"1296507701","msgId":59347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpNzd2bCttOHY4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":59356,"prevInTime":59346,"nextInTime":59348,"topicId":59347,"numMessagesInTopic":0,"msgSnippet":"Hello all, My 3 1/2 year old daughter discovered the joy of buying toys in a big way this Christmas. We are on a tight budget due to recently buying a fixer","messageBody":"<div id=\"ygrps-yiv-1783090123\">Hello all,<br/>\n <br/>\nMy 3 1/2 year old daughter discovered the joy of buying toys in a big way this Christmas. We are on a tight budget due to recently buying a fixer house, me needing some dental work very soon, and saving for an upcoming family vacation that is important to all of us. We&#39;ve been living pretty frugally for quite a while. <br/>\n<br/>\nMy husband and I figured out what we can give as an allowance right now. It&#39;s not much, but I&#39;ve taken every chance I can to help K stretch it by going to garage sales and thrift stores. When she is close I chip in an extra dollar or 2. We tried the dollar store and feel like the stuff there is so frustrating in how quickly it falls apart that we don&#39;t want to do it anymore. I&#39;ve looked on Freecycle for the kinds of things she wants too. It has been 4 weeks and I am really appreciating all the joy and natural learning that is coming out of this. I *would* like to minimize the frustration, while still holding close to our budget. We were thinking of giving her a much larger amount one week a month so that she can buy a larger item once in a while. There are a few things she likes that she would have to save for 6 weeks or more to get and I don&#39;t think that&#39;s fair to ask her to do if I can find a less frustrating way. I&#39;d rather not give her a little more each week instead also because then she buys a small set of something and then still really wants the deluxe set which has the same items plus more. <br/>\n<br/>\nSo, I think that&#39;s what we&#39;re doing, but I wanted to know if any of you have done something else that worked well for you. I know this is a great group to talk to about buying toys! I&#39;d love any suggestions that are respectful of the reality of our budget.<br/>\n<br/>\nThank you! <br/>\n<br/>\nAlex N.</div>","specialLinks":[]}],"prevTopicId":59320,"nextTopicId":59428}}