{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Not a private conversation","postDate":"1361907373","msgId":70702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQcmdtMmFEbnV4Vit6WDdWby1aQkdPRWswcmN6Y3lWRWdVQTBhaiswYXFud0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEU5ODgyQjRGLThBOEEtNDBENi05MkMxLTZBOUFBNEIyRDRFQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBUHVzdEZBa2Z4YktxQlB0Y3JPT253OWl2NFRFQ1pSamREQVY9R3JLZU49YzZWa2dBUUBtYWlsLmdtYWlsLmNvbT4JPEU5ODgyQjRGLThBOEEtNDBENi05MkMxLTZBOUFBNEIyRDRFQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":70700,"nextInTopic":0,"prevInTime":70701,"nextInTime":70703,"topicId":70698,"numMessagesInTopic":0,"msgSnippet":"... I remember when this was said and I have repeated my version of it others many times, telling them, Please listen to Sandra from the point of view that","messageBody":"<div id=\"ygrps-yiv-1754628920\">On Tue, Feb 26, 2013 at 11:15 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;When I got that she was speaking to me as the mother of my children, NOT<br/>\n&gt; the injured child of my mother, that&#39;s when I saw her differently.&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I remember when this was said and I have repeated my version of it others<br/>\nmany times, telling them, &quot;Please listen to Sandra from the point of view<br/>\nthat she&#39;s assuming you&#39;re a strong adult who prefers clear and blunt<br/>\ncomments because it is worth it to hear it, even if, at first, you react<br/>\nwith hurt or anger, because it is for the sake of your children.&quot;<br/>\n<br/>\nI also remind people that they can listen to whatever anybody says and then<br/>\nwalk away completely unchanged if that&#39;s what they want to do. Nothing said<br/>\nhere ever has the power to force anybody to change.<br/>\n<br/>\nIn one of the very first times I heard Sandra speak in person, she talked<br/>\nabout &quot;thinking dangerous thoughts.&quot; She told the audience to be brave,<br/>\nduct tape themselves to a chair, get someone to spot them, and go ahead and<br/>\nthink whatever thoughts they might be afraid to think. When they were done,<br/>\nthey could get up and walk away as if nothing had happened.<br/>\n<br/>\nI have applied that to all unschooling discussion since then - that was<br/>\nalmost 20 years ago. I have had my feelings hurt, have had rushes of<br/>\nadrenaline and anger and defensiveness. I figuratively sit myself down and<br/>\nduct tape myself to a chair and think about why I&#39;m having that reaction -<br/>\nwhy such a strong reaction to something said by someone who can&#39;t do<br/>\nANYTHING to me - can&#39;t make me change anything at all about my life. When I<br/>\nthink I&#39;ve been completely misunderstood or unfairly characterized I think<br/>\n(dangerously) &quot;What if they&#39;re right and that IS what I meant/said/did?&quot;<br/>\n Sometimes it takes me a few days to be clearheaded and calm enough to<br/>\nthink things through - but I always learn about myself and come out of it<br/>\nwith more insight and more determination to be the best parent and person I<br/>\ncan be for my family.<br/>\n<br/>\nWish I had a nickel for every time I&#39;ve told someone that I understood that<br/>\nthis is hard and that they feel insulted and attacked but that IT iS WORTH<br/>\nIT!!<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Not a private conversation","postDate":"1361906116","msgId":70700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5ODgyQjRGLThBOEEtNDBENi05MkMxLTZBOUFBNEIyRDRFQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBUHVzdEZBa2Z4YktxQlB0Y3JPT253OWl2NFRFQ1pSamREQVY9R3JLZU49YzZWa2dBUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBUHVzdEZBa2Z4YktxQlB0Y3JPT253OWl2NFRFQ1pSamREQVY9R3JLZU49YzZWa2dBUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":70698,"nextInTopic":70702,"prevInTime":70699,"nextInTime":70701,"topicId":70698,"numMessagesInTopic":0,"msgSnippet":"I don t want to make parents feel bad about themselves. I want parents to make decisions that lead them not to have things to feel bad about. Big difference. I","messageBody":"<div id=\"ygrps-yiv-1464426514\">I don&#39;t want to make parents feel bad about themselves. I want parents to make decisions that lead them not to have things to feel bad about. Big difference.<br/>\n<br/>\nI pulled that  (I wrote it in 2010) out to use for Just Add Light and Stir.  I wasn&#39;t looking for that.  I was looking to see whether I had put up a blog post about art modelled on Kirby, my oldest, a few years back (a character in an illustrated story/comic book).  I didn&#39;t find it, so I&#39;ll put it up before the links all die off.   He&#39;s been &quot;cartoonized&quot; again, so I figured I would put them in the same place.  A new collection.<br/>\n<br/>\nBut what I did come across was this:  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.blogspot.com/2010/02/me-getting-jumped-on-facebook.html\">http://sandradodd.blogspot.com/2010/02/me-getting-jumped-on-facebook.html</a><br/>\n<br/>\nIt was about someone having posted something cheery on her facebook page (a quote from me) and then came the criticisms.   Then came the defenses.  Someone (I don&#39;t know who, didn&#39;t save the name, it&#39;s nice, but the name doesn&#39;t matter) wrote:  <br/>\n<br/>\n_______<br/>\nI used to dismiss nearly everything Sandra said... I believed if she couldn&#39;t communicate with parents the same way she believed we should communicate with kids, she wasn&#39;t &quot;walking the talk&quot;. As I&#39;ve grown as a parent and unschooler, I see her words so differently now. Where others see (and I *used* to see) harshness and negativity, I see clear, caring communication. I don&#39;t know if I can explain the switch that happened. When I got that she was speaking to me as the mother of my children, NOT the injured child of my mother, that&#39;s when I saw her differently.<br/>\n_______<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":544864751,"authorName":"Roya Dedeaux","from":"Roya Dedeaux &lt;royadedeaux@...&gt;","profile":"royadedeaux","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Not a private conversation","postDate":"1361900682","msgId":70698,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHVzdEZBa2Z4YktxQlB0Y3JPT253OWl2NFRFQ1pSamREQVY9R3JLZU49YzZWa2dBUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":70700,"prevInTime":70697,"nextInTime":70699,"topicId":70698,"numMessagesInTopic":0,"msgSnippet":"==some participants seek, for example, advice about their child who found a workbook and started filling it out and got stuck == There is a disconnect between","messageBody":"<div id=\"ygrps-yiv-1525938232\">==some participants seek, for example, advice about their child who found a<br/>\nworkbook and started filling it out and got stuck ==<br/>\n<br/>\nThere is a disconnect between what people are &quot;seeking&quot; and what they are<br/>\nreceiving. I have been watching people get upset when they ask a question<br/>\n(for example) about workbooks, and get answers that are asking them to<br/>\nthink deeper, or take a step back and have a bigger perspective.<br/>\n<br/>\nOver and over again I watch as people react defensively to &quot;think broader&quot;<br/>\nor &quot;try for even better.&quot;<br/>\n<br/>\nThe moderators of lists over and over again ask people to wait and read<br/>\nbefore posting, so that they have some idea of the purpose of the list and<br/>\nthe tone of the answers.<br/>\n<br/>\n<br/>\nThere are a few things I want people to think about, based on what I&#39;ve<br/>\nseen:<br/>\n<br/>\n1. Semantics do matter. When all we have are the words we write, it is<br/>\nabout semantics. I have seen over and over again people say &quot;we&#39;re just<br/>\narguing about semantics.&quot; Well, yes. How we convey ourselves, what words we<br/>\nchoose - they are all we have in these forums to express what we are<br/>\nthinking. If other people are frequently misunderstanding what you meant to<br/>\nsay, it should be a clue that you are not as articulate a writer as you may<br/>\nhave thought.<br/>\n<br/>\n2. Defining the term and proper usage of the word &quot;unschooling&quot; is also<br/>\nimportant, in discussions where you are talking about unschooling. In<br/>\ndiscussions about how to raise poultry, not so much. But other words would<br/>\nbe important to define. If we have a debate about the best way to build a<br/>\ncoop and then it turns out I&#39;ve been talking about a garden shed the whole<br/>\ntime, it matters. I have also been watching as people say &quot;yes, well, I<br/>\nhate defining things so I don&#39;t.&quot; When someone comes to a forum where<br/>\nunschooling is the topic of discussion and they take issue with defining<br/>\nthe word itself, they basically say &quot;the entire premise of this forum is<br/>\nstupid.&quot; The same goes when someone blithely says &quot;I didn&#39;t like that term<br/>\nso I made up blahblahblah instead.&quot; The only way anyone else will know what<br/>\nit is they are talking about is if they go on to refine the definition.<br/>\n<br/>\n3. You&#39;re asking for it. I fully expect after I hit send this post will be<br/>\ndissected and things that I &quot;didn&#39;t mean to say&quot; will come forward. Which<br/>\nis good - this list is like a mirror to reflect deeper thought. If I plan<br/>\nto continue thinking, writing, and talking about unschooling, I welcome<br/>\nreactions so I can continue to gauge how I&#39;ve been perceived and how I can<br/>\nfurther clarify turning my thoughts to text.<br/>\n<br/>\n4. A lot of other people read this. Your post may open a door to an<br/>\nimportant discussion (moderators will know what else may be important to<br/>\nother people because they have seen every question a lot of times already)<br/>\nwhich will become bigger than the original topic. So you will have to use<br/>\nsome critical thinking when you read, and decide which pieces apply to you.<br/>\nYou also may have to be open to the idea that your question, just by asking<br/>\nit, shows that your thinking could be broader. People will catch that, and<br/>\nchallenge your thinking. If you do not want your words and thoughts to be<br/>\ndiscussed, don&#39;t post.<br/>\n<br/>\nThis is not the first time any of this has been said, but maybe another<br/>\nvoice saying something in a slightly different way will reach a slightly<br/>\ndifferent audience.<br/>\n<br/>\n--Roya Dedeaux<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":50607,"nextTopicId":70683}}