{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: table manners","postDate":"1356880172","msgId":70053,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVGRjFBMkU5LUIyNkUtNDJGMC05N0JGLTQ3MkIxOUI1MzA5QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGticGpyOSs4OW0xQGVHcm91cHMuY29tPg==","referencesHeader":"PGticGpyOSs4OW0xQGVHcm91cHMuY29tPg=="},"prevInTopic":70051,"nextInTopic":0,"prevInTime":70052,"nextInTime":70054,"topicId":70021,"numMessagesInTopic":0,"msgSnippet":"Because the kids were home, we saw them quite a bit, and dinner didn t need to be sacred.   There were reasons, in past times, for food to be served all at","messageBody":"<div id=\"ygrps-yiv-1815009739\">Because the kids were home, we saw them quite a bit, and dinner didn&#39;t need to be sacred.   There were reasons, in past times, for food to be served all at once and for people to eat then or not at all, but few of those reasons apply to a modern home with a refrigerator, a microwave, and no servants.<br/>\n<br/>\nThis was true in our family, too:  &quot; it was clear early on that insisting on any single person&#39;s version wasn&#39;t going to make for good eating nor good company.&quot;    We never &quot;made&quot; our kids sit and eat.  Sometimes they would eat earlier and Keith and I would eat.  Sometimes all but Keith would have eaten, and we would save him a good portion.   Sometimes, and more as the kids were teens and young adults with jobs and cars, and friends with cars, and clubs and interests, when I cook I cook and put it out, and those who are there might eat together, or separately, and those who come in later might eat that food or something else.    And then extra portions are put into little microwavable containers for the next day&#39;s lunches.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":324592498,"authorName":"Tori","from":"&quot;Tori&quot; &lt;tandosmama@...&gt;","profile":"tandosmama@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: table manners","postDate":"1356878505","msgId":70051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGticGpyOSs4OW0xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtibnFrMCsyMXY2QGVHcm91cHMuY29tPg=="},"prevInTopic":70034,"nextInTopic":70053,"prevInTime":70050,"nextInTime":70052,"topicId":70021,"numMessagesInTopic":0,"msgSnippet":"... This is something I learned from our son who s five now. He often asks for someone to keep me company. While he prefers to eat with a minecraft video, he","messageBody":"<div id=\"ygrps-yiv-595425993\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;keetry&quot; &lt;keetry@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Have you ever said nicely that you like to have company while your eating and ask if anyone would sit with you? Maybe your daughter would sit with you longer if you didn&#39;t mind her using her Kindle while she was there.<br/>\n&gt; <br/>\n&gt;<br/>\n </span></blockquote>This is something I learned from our son who&#39;s five now. He often asks for &quot;someone to keep me company.&quot; While he prefers to eat with a minecraft video, he also likes to have at least one other person nearby. He also often offers to keep others company even if he was busy with something else.<br/>\n<br/>\nThe four of us work out different solutions depending upon what each person wants to be doing and with whom. My husband likes everyone at the dinner table together at least for a little while and would prefer to eat while watching a movie of his own choosing.;) But he&#39;s willing to compromise over what we might watch to convince our kids that eating with him can be enjoyable. Generally I prefer quiet meals with conversation, and I lived much of my life without tv by choice. But I&#39;ve found I get a lot of pleasure from the enjoyment my family has in movies during dinner--so much that I enjoy the movies now too!<br/>\n<br/>\nWe&#39;ve all realized that people engrossed in activities need food breaks so it&#39;s not uncommon to find some of us enjoying a meal at the computer.<br/>\n<br/>\nOur daughter frequently takes breaks from eating to perform dances or tell stories for her dinner partner(s). And I&#39;ve now taken to pulling out my new kindle after eating while the kids and my husband finish watching a movie.<br/>\n<br/>\nWe&#39;ve each got slightly different desires as far as family meals go; and these can change from day to day. But it was clear early on that insisting on any single person&#39;s version wasn&#39;t going to make for good eating nor good company. I like to think about the needs &#39;dinner&#39; has come to fulfill for our family. Some of our needs are shared, some are individual.<br/>\n<br/>\nWhat&#39;s interesting to me is that our kids have come to recognize &#39;dinner&#39; as a time when food is prepared and shared in some way. They like to see multiple serving dishes and dinner settings at our little table, to check out what various foods we&#39;re having and to determine what they&#39;ll eat, where and with whom. <br/>\n<br/>\nOne night recently our family dined at a restaurant (a rare treat for us) and when we arrived home later, everyone tired and ready for bed, both kids said, &quot;Wait, we never had dinner tonight! Oh yeah, we ate at the restaurant.&quot;<br/>\n<br/>\nTori</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] table manners","postDate":"1356823290","msgId":70034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTY4MjMyOTAuMzI4MDYuWWFob29NYWlsTmVvQHdlYjE4NjEwMi5tYWlsLmlyMi55YWhvby5jb20+","inReplyToHeader":"PDVENzQ2OTMwLTgwOTctNDBEMS04MTlELUI4RkMxM0Y1QThEN0BnbWFpbC5jb20+","referencesHeader":"PDVENzQ2OTMwLTgwOTctNDBEMS04MTlELUI4RkMxM0Y1QThEN0BnbWFpbC5jb20+"},"prevInTopic":70033,"nextInTopic":70051,"prevInTime":70033,"nextInTime":70035,"topicId":70021,"numMessagesInTopic":0,"msgSnippet":"Resentment is an easy badge to wear. It doesn t make anything better. It doesn t help make a happier more peaceful family. But it is easy to slip into a","messageBody":"<div id=\"ygrps-yiv-1125861374\">Resentment is an easy badge to wear. It doesn&#39;t make anything better. It doesn&#39;t help make a happier more peaceful family. But it is easy to slip into a feeling that you are being wronged, somehow. <br/>\n<br/>\nI say this because I was quickly descending into resentment over a minor thing. Minor thing. We have a fridge that has a water dispenser. It isn&#39;t a plumbed in water dispenser. It&#39;s a plastic jug that you fill and then slip into a slot for it on the inside of the door. It&#39;s a really lovely thing to have in Australia. It is wonderful to go and get cold water from the fridge whenever you want. Except every time I go to get cold water, or most times at least, it&#39;s empty. And I have to take it out and refill it. That last sentence should be read in an exasperated tone, &#39;cause that&#39;s how I was saying it to myself for a little bit. I started feeling resentful about it. Why couldn&#39;t anyone else fill it up when they&#39;d run it out? Why did I seem to be the only one filling it up? Stomp, stomp, stomp from the fridge to the sink and back again. I didn&#39;t like that feeling. That was an awful feeling so I pulled the reality apart. What did it mean that it was empty<br/>\n each time I came for a glass of water? It meant that those people I love were drinking enough in this hot season. Those people I love were coming to the kitchen thirsty and being sated by cold water that I had set up for them. Those people I love were getting lovely, sweet, cold water because I took that minor effort and made it available to them. Totally different perspective on the exact same action. So now each time I fill that jug I fill it thinking about how nice it will be for Simon or for Linnaea or for David to come and have a glass of cold water when they want one. Each time I come and find the door jug run dry I think about how they aren&#39;t growing dehydrated, I think about how they aren&#39;t suffering discomfort and I joyfully fill up the jug. <br/>\n<br/>\nHow can you look at your own issue with your family and your mealtimes in the same light? Look at the joy your daughter is having with her kindle and be pleased. Look at the sweetness of your husband moving from a wonderful repast that you created to a relaxing engagement to aid in digestion. Paint a new picture of what you see going on that is filled with the sweetness of providing lovely food for your family and that allows you to not feel a lump of resentment grow. <br/>\n<br/>\nDeb Lewis talks about resentment here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/unfair.\">http://sandradodd.com/chores/unfair.</a> She ended that post with these words: &quot;Woody Allen said, &quot;The talent for being happy is appreciating and liking what you have instead of what you don&#39;t have.&quot; You don&#39;t have a bunch of kids who are interested in helping around the house right now but you do have a bunch of happy kids. : )&quot;<br/>\n<br/>\nLook at what you do have and enjoy that. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Nancy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nancymachaj@...\">nancymachaj@...</a>&gt;<br/>\nTo: AlwaysLearning &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; <br/>\nSent: Sunday, 30 December 2012, 4:07<br/>\nSubject: [AlwaysLearning] table manners<br/>\n <br/>\nRecently I invited a newish friend and her two kids over for a visit.<br/>\nThe mom actually spent almost the whole visit checking her phone, I  <br/>\ncould see her flipping thru, reading stuff, etc.<br/>\nShe half paid attention to me and her kids, but it was difficult to  <br/>\ntalk to her, as she was distracted and I had to keep repeating  <br/>\nquestions.<br/>\nI was really insulted, but not sure if I should or how I would call  <br/>\nher on it. I am not really planning to pursue a real friendship with  <br/>\nher.<br/>\n<br/>\nThis incident is fresh on my mind along with a couple of other  <br/>\nincidents that happened in my family.<br/>\n<br/>\nThe norm is for me and my husband and two kids to sit down to dinner  <br/>\ntogether. Well, usually my youngest doesnt sit at the table with us,  <br/>\nbut he is nearby. Often my husband finishes eating and gets up and  <br/>\nleaves the table without sayining anything to anyone, just stands up  <br/>\nand walks off, usually to the bedroom, where he lies down and watches  <br/>\ntv for a while. Later he comes back and does the dishes. Now my 8 yo  <br/>\ndaughter has started doing that too, often leaving me to finish eating  <br/>\nby myself. A couple of weeks ago, as the both of them were walking  <br/>\noff, I said, &quot; you are double ditching me!&quot; and my husband retorted  <br/>\nthat I treat dinner as a sacred event, and its not, its just food.<br/>\n<br/>\nFor christmas my daughter got a kindle fire tablet, and she is using  <br/>\nit nonstop, to watch netflix. I am happy she is enjoying it, but she  <br/>\ntries to wear it during meals now, too. I ask her to put it away while  <br/>\nwe we are eating. I think its rude to have headphones on at the table.<br/>\n<br/>\nI wonder if Im the one with unreasonable expectations, like expecting  <br/>\nthat when we all sit down together to eat a meal, that we dont read or  <br/>\nbe otherwise occupied, and that we dont leave until its ok with  <br/>\neveryone. Ive noticed that my children dont eat as much if I dont sit  <br/>\nwith them. If I make them food, but dont sit down with them, they get  <br/>\ndistracted and leave. If I sit and talk with them, they will eat more.<br/>\n<br/>\nI personally feel really bummed when I have made dinner for everyone,  <br/>\nand then have to eat it alone while everyone else is off doing their  <br/>\nthing. I feel really unappreciated and it takes a lot of the joy out  <br/>\nof making them food. Is this my own crazy baggage? Even if my husband  <br/>\nwould get up and start doing dishes but still be nearby, I wouldnt  <br/>\nmind as much. I feel abandoned. Maybe thats too strong an emotion and  <br/>\nI need to work on this? Its not like people have to rush off to other  <br/>\nactivities. They just disappear into their rooms by themselves. Is it  <br/>\nfair to ask them to be sociable and stay at the table until everyone  <br/>\nis finished?<br/>\n<br/>\nI was going to say, if it was the other way around, and I wanted to  <br/>\nleave and my ˙husband felt it was important to remain, I would. But  <br/>\nthen why dont I want to be magnanimous and let him leave when he wants  <br/>\nto?<br/>\n<br/>\nSo I have feelings about it, but also I dont want them to be rude and  <br/>\ndo this to other people. With my husbands large extended family, its  <br/>\ntrue that dinners mostly occur at the large parties, and its buffet  <br/>\nstyle, and its very informal. People eat, get up, more people eat, you  <br/>\nchange tables, etc. But there is also 30 people, and its a party. We  <br/>\ngo to restaurants, and obviously we all have to leave together. But I  <br/>\nknow that &quot;if they dont learn it now&quot; argument is usually false, so  <br/>\nthen I wonder if its just my own hang up.<br/>\n<br/>\nHow can I think differently about this?<br/>\n<br/>\nthank you,<br/>\n<br/>\nNancy<br/>\n<br/>\nZibby age 8<br/>\nHenry age 5<br/>\n<br/>\n(neither have ever been in school. )<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: table manners","postDate":"1356819904","msgId":70033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtibnFrMCsyMXY2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVENzQ2OTMwLTgwOTctNDBEMS04MTlELUI4RkMxM0Y1QThEN0BnbWFpbC5jb20+"},"prevInTopic":70031,"nextInTopic":70034,"prevInTime":70032,"nextInTime":70034,"topicId":70021,"numMessagesInTopic":0,"msgSnippet":"== A couple of weeks ago, as the both of them were walking off, I said,  you are double ditching me! == Have you ever said nicely that you like to have","messageBody":"<div id=\"ygrps-yiv-853281751\">== A couple of weeks ago, as the both of them were walking off, I said, &quot; you are double ditching me!&quot; ==<br/>\n<br/>\nHave you ever said nicely that you like to have company while your eating and ask if anyone would sit with you? Maybe your daughter would sit with you longer if you didn&#39;t mind her using her Kindle while she was there.<br/>\n<br/>\nMy husband is a slow eater. He&#39;s usually only about halfway done eating by the time the rest of us are. The rest of us all get up and wander off and he finishes alone. I have asked him if he minds and he said he doesn&#39;t. I don&#39;t like to eat alone so I might gather my plate and wander into the other room with everyone else. <br/>\n<br/>\n== I personally feel really bummed when I have made dinner for everyone, and then have to eat it alone while everyone else is off doing their thing. I feel really unappreciated and it takes a lot of the joy out of making them food. Is this my own crazy baggage? ==<br/>\n<br/>\nYes, that is your own crazy baggage. Why would you attach any strings to you providing sustenance for your family? Do they want the dinners you make or would they be just as happy with something more simple? If you only make the dinners in order to get some appreciation and they don&#39;t appreciate the dinners, do something else.<br/>\n<br/>\nMy husband likes to cook. He makes fancy, complicated dinners. I appreciate them because they taste good but it&#39;s not important to me to have dinners like that. A lot of times the kids don&#39;t like the meals at all. That&#39;s ok with both of us. They can make themselves something else if they are capable or we will offer something else as needed. When I cook I go for simple because I don&#39;t really like to cook.<br/>\n<br/>\n<br/>\nThere&#39;s a big push in society to make a big deal out of dinner, expecting the entire family to sit down to eat together most nights. It supposedly prevents all kinds of undesirable behavior like drug and alcohol abuse and delinquency. <br/>\n<br/>\nThat&#39;s for families who aren&#39;t together most of the day already. At least one parent is away at a job most of the day. The kids are at school most of the day. Dinner time is the only time they have most week days to reconnect.<br/>\n<br/>\nHomeschooling families are together most hours of the day and are constantly connecting with each other. I don&#39;t think they need to designate specific times when everyone has to be together to socialize, especially if the work out of the home parent isn&#39;t concerned about it. (I&#39;m assuming you are the stay at home parent and your husband works outside the home.) I can understand trying to make dinner special if the out of the home parent likes to have that time to reconnect with everyone. Then I would ask the kids to turn off their devices and sit and talk at least for a little bit. But if Dad doesn&#39;t want that, I&#39;d let it go.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: table manners","postDate":"1356816061","msgId":70031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtibm1ydCtvMnI4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVENzQ2OTMwLTgwOTctNDBEMS04MTlELUI4RkMxM0Y1QThEN0BnbWFpbC5jb20+"},"prevInTopic":70029,"nextInTopic":70033,"prevInTime":70030,"nextInTime":70032,"topicId":70021,"numMessagesInTopic":0,"msgSnippet":"... Those are more than expectations, they re rules you ve adopted with regard to meals without really questioning them. It might help to think about the","messageBody":"<div id=\"ygrps-yiv-1042860456\">Nancy &lt;nancymachaj@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I wonder if Im the one with unreasonable expectations, like expecting  <br/>\n&gt; that when we all sit down together to eat a meal, that we dont read or  <br/>\n&gt; be otherwise occupied, and that we dont leave until its ok with  <br/>\n&gt; everyone. <br/>\n<br/>\n </span></blockquote>Those are more than expectations, they&#39;re rules you&#39;ve adopted with regard to &quot;meals&quot; without really questioning them. It might help to think about the reasons behind those rules - all those things don&#39;t have to be part of every single eating-time! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;when we all sit down together to eat a meal<br/>\n<br/>\n </span></blockquote>Step back from that a little. Why do you: <br/>\nAll<br/>\nSit down<br/>\nTogether<br/>\nto eat a Meal<br/>\n<br/>\nas opposed to eating when you&#39;re hungry? A great deal of that answer is tied up in cultural history - the history of communities and food, as well as the history of power and position.<br/>\n<br/>\nOn the level of the nuclear family, a large number of needs get met (or half-met) by the family meal: social needs, connection needs, nutritional needs, the need to maintain a hierarchy. But it&#39;s not necessary use that particular formula to meet those needs. Probably you, personally, don&#39;t even value The Meal for those same reasons - but you do want it to meet some particular need of yours, for socializing and connection, I&#39;m guessing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my husband retorted  <br/>\n&gt; that I treat dinner as a sacred event, and its not, its just food.<br/>\n<br/>\n </span></blockquote>He has a point! He doesn&#39;t need the daily chow to fill needs beyond food - which might be a compliment of sorts, if you have a good relationship in general: he doesn&#39;t need to smile across a table to feel connected to you. Maybe he doesn&#39;t need as much face-to-face socializing as you do, or he feels more connected in other ways.<br/>\n<br/>\nAt the same time, it might help to have the Occasional &quot;sacred event&quot; sort of meal - make it a real occasion with special treat foods, fancy plates and silver, and all the trappings, as it were. <br/>\n<br/>\nIs it  <br/>\n<blockquote><span title=\"ireply\"> &gt; fair to ask them to be sociable and stay at the table until everyone  <br/>\n&gt; is finished?<br/>\n<br/>\n </span></blockquote>Is it fair to require people to sit around, bored, wishing they were someplace else, for your pleasure?<br/>\n<br/>\nYou can socialize and connect with the people you love in other ways and fill up those needs - but it will help to be more thoughtful about how you do so. Don&#39;t turn &quot;a meal&quot; into enforced socialization! Let it be an opportunity, not a requirement. If you know your husband is going to wash the dishes, plan to pull up a chair and chat with him. If you&#39;re really craving face-to-face conversation, look for ways to create that without a meal - games can be good for that, if you need an excuse. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Recently I invited a newish friend and her two kids over for a visit.<br/>\n&gt; The mom actually spent almost the whole visit checking her phone, I  <br/>\n&gt; could see her flipping thru, reading stuff, etc.<br/>\n&gt; She half paid attention to me and her kids, but it was difficult to  <br/>\n&gt; talk to her, as she was distracted and I had to keep repeating  <br/>\n&gt; questions.<br/>\n<br/>\n </span></blockquote>She had different expectations than you did. Maybe she mostly wanted to get the kids out of the house. Maybe she enjoys your company but doesn&#39;t like to chat, she&#39;s more of an introvert - I can relate to that! I agonize about visiting one particular friend of Morgan&#39;s because the mom expects me to sit and make conversation with her while I&#39;m there and they live too far for me to conveniently drop Mo off. There&#39;s nothing else to do unless I bring a project, so I often bring knitting, but there are days I&#39;d love to bring a book. I don&#39;t mind the company, just the talking part. If I had a nice phone, I&#39;d certainly leave it on while there and set it to buzz at the least little message - heck, if she had wireless internet I&#39;d have my laptop out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was really insulted, but not sure if I should or how I would call  <br/>\n&gt; her on it. I am not really planning to pursue a real friendship with  <br/>\n&gt; her.<br/>\n<br/>\n </span></blockquote>If you&#39;re going to invite her over again, plan some project for yourself so You have something to do other than just make conversation. You might find you and she get along better if there&#39;s no enforced face-to-face socialization. <br/>\n<br/>\nIf face-to-face talking is really important to you, look specifically for ways to fill that, maybe ways that don&#39;t involve your family if that doesn&#39;t work for any of them. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":439465581,"authorName":"Robert and Colleen","from":"&quot;Robert and Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] table manners","postDate":"1356812220","msgId":70029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjUwMWNkZTYwMSQ3NjE5NTVhMCQ2MjRjMDBlMCRAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDVENzQ2OTMwLTgwOTctNDBEMS04MTlELUI4RkMxM0Y1QThEN0BnbWFpbC5jb20+","referencesHeader":"PDVENzQ2OTMwLTgwOTctNDBEMS04MTlELUI4RkMxM0Y1QThEN0BnbWFpbC5jb20+"},"prevInTopic":70026,"nextInTopic":70031,"prevInTime":70028,"nextInTime":70030,"topicId":70021,"numMessagesInTopic":0,"msgSnippet":"*****I wonder if Im the one with unreasonable expectations, like expecting that when we all sit down together to eat a meal, that we dont read or be otherwise","messageBody":"<div id=\"ygrps-yiv-231080516\">*****I wonder if Im the one with unreasonable expectations, like expecting that when we all sit down together to eat a meal, that we dont read or be otherwise occupied, and that we dont leave until its ok with everyone. Ive noticed that my children dont eat as much if I dont sit with them.*****<br/>\n<br/>\n <br/>\n<br/>\nAre you home with your kids all day?  Is your husband home too, or is he off at work during the day and then home for dinner, or how does your day together as a family look?  <br/>\n<br/>\n<br/>\nYou don’t need to answer those questions here – but that’s the sort of things I’d look at, if I were trying to figure out why it felt important to have everyone gather for meals at the same time and without reading, videos, etc.<br/>\n<br/>\n <br/>\n<br/>\nI asked my husband a couple years back if he thought it was odd that the three of us in our family don’t tend to all sit at the table and eat meals together.  Sometimes we do, but often we don’t.  Sometimes my son eats while watching TV or a movie – sometimes (like lunch today) he eats while reading a Lego magazine – sometimes he eats surrounded by Legos or Mario figures or while playing a board game with one of us, etc.  My husband tends to read or catch up on email while eating – and I sometimes do the same, or I sit and watch TV with my son, etc.<br/>\n<br/>\n <br/>\n<br/>\nMy husband’s thought on the matter was “eating like that is for those people who never spend any time together – who are all off at school and work and sports and whatever all day and never see each other – so they try to make up for it at mealtime.  We do things together all the time – so eating doesn’t have to be together-time unless it’s a day when we all want it to be.”  I like that way of thinking – and I can see that if we were living a life with school and dual out-of-home careers and such and we were therefore rarely together, mealtime might feel very important as a point of gathering and catching up.  But since we don’t need that catching-up time, eating for us is simply enjoying good food in ways (and places) that makes us happy – whether together around the dining room table or not.<br/>\n<br/>\n <br/>\n<br/>\nIf my husband were off at work all day and my son and I were home without him – I’d find out what would work best for all of us.  Maybe sometimes my husband would want to come home and eat on his own while he decompressed from his day.  Maybe other times he’d want me to eat with him and talk.  Maybe he’d ask our son to join him at the table – and if so, I’d work with my son to find ways to make that fun for him to do.  <br/>\n<br/>\n <br/>\n<br/>\nTo me, it’s all about finding what works for each family and family member – meeting everyone’s real needs and not trying to emulate the family dinners of TV and the magazines because someone got the idea in their head once upon a time that mealtimes with everyone gathered ‘round the table were going to somehow make life perfect :-)<br/>\n<br/>\n <br/>\n<br/>\nColleen <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] table manners","postDate":"1356809514","msgId":70026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFRDdEODhCLTMzREYtNEEyNi1CRjk0LTdDQTZGNTE0NTAyMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDVENzQ2OTMwLTgwOTctNDBEMS04MTlELUI4RkMxM0Y1QThEN0BnbWFpbC5jb20+","referencesHeader":"PDVENzQ2OTMwLTgwOTctNDBEMS04MTlELUI4RkMxM0Y1QThEN0BnbWFpbC5jb20+"},"prevInTopic":70021,"nextInTopic":70029,"prevInTime":70025,"nextInTime":70027,"topicId":70021,"numMessagesInTopic":0,"msgSnippet":"... If you didn t have that expectation, would you be bummed? If you create meals that are inviting with the assumption you ll be eating alone, won t it then","messageBody":"<div id=\"ygrps-yiv-556472637\">On Dec 29, 2012, at 11:07 AM, Nancy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I personally feel really bummed when I have made dinner for everyone, <br/>\n&gt; and then have to eat it alone while everyone else is off doing their <br/>\n&gt; thing<br/>\n<br/>\n </span></blockquote>If you didn&#39;t have that expectation, would you be bummed?<br/>\n<br/>\nIf you create meals that are inviting with the assumption you&#39;ll be eating alone, won&#39;t it then be a gift or a pleasant surprise if other people join you?<br/>\n<br/>\nIf you focus on them being happy and fed, instead of meeting your need for a family dinner, wouldn&#39;t it be easier to happy?<br/>\n<br/>\nIf you do something everyone likes at dinner, wouldn&#39;t it be more likely for them to join you?<br/>\n<br/>\nIf you reduce your expectation of family dinner to once a week, then focus on making it about them rather than about you -- asking what they need, how it can be better for them -- wouldn&#39;t it be more likely people would gather?<br/>\n<br/>\nIf you reduce your expectation that people touch base together for ten minutes, wouldn&#39;t that be more doable? And then see what people need or would like in that 10 minutes, wouldn&#39;t that make it easier for people to gather?<br/>\n<br/>\nSo, what do they need? How can you meet those needs?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I have feelings about it, but also I dont want them to be rude and <br/>\n&gt; do this to other people<br/>\n<br/>\n </span></blockquote>Coach them before hand. You know it&#39;s something they&#39;re likely to do so help them by giving them information about expectations. Don&#39;t tell them what to do. Say &quot;Grandma likes it when people ask to be excused before leaving the table.&quot; And then help them. Don&#39;t put the burden of remembering on them. Touch them gently. Give them a gentle reminder. *Assume* they don&#39;t want to irritate people so don&#39;t be upset when they do. They&#39;re showing you what they can do. They need your support in doing better.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":522150372,"authorName":"Nancy","from":"Nancy &lt;nancymachaj@...&gt;","profile":"nmachaj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"table manners","postDate":"1356804437","msgId":70021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVENzQ2OTMwLTgwOTctNDBEMS04MTlELUI4RkMxM0Y1QThEN0BnbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":70026,"prevInTime":70020,"nextInTime":70022,"topicId":70021,"numMessagesInTopic":0,"msgSnippet":"Recently I invited a newish friend and her two kids over for a visit. The mom actually spent almost the whole visit checking her phone, I could see her","messageBody":"<div id=\"ygrps-yiv-1066349706\">Recently I invited a newish friend and her two kids over for a visit.<br/>\nThe mom actually spent almost the whole visit checking her phone, I  <br/>\ncould see her flipping thru, reading stuff, etc.<br/>\nShe half paid attention to me and her kids, but it was difficult to  <br/>\ntalk to her, as she was distracted and I had to keep repeating  <br/>\nquestions.<br/>\nI was really insulted, but not sure if I should or how I would call  <br/>\nher on it. I am not really planning to pursue a real friendship with  <br/>\nher.<br/>\n<br/>\nThis incident is fresh on my mind along with a couple of other  <br/>\nincidents that happened in my family.<br/>\n<br/>\nThe norm is for me and my husband and two kids to sit down to dinner  <br/>\ntogether. Well, usually my youngest doesnt sit at the table with us,  <br/>\nbut he is nearby. Often my husband finishes eating and gets up and  <br/>\nleaves the table without sayining anything to anyone, just stands up  <br/>\nand walks off, usually to the bedroom, where he lies down and watches  <br/>\ntv for a while. Later he comes back and does the dishes. Now my 8 yo  <br/>\ndaughter has started doing that too, often leaving me to finish eating  <br/>\nby myself. A couple of weeks ago, as the both of them were walking  <br/>\noff, I said, &quot; you are double ditching me!&quot; and my husband retorted  <br/>\nthat I treat dinner as a sacred event, and its not, its just food.<br/>\n<br/>\nFor christmas my daughter got a kindle fire tablet, and she is using  <br/>\nit nonstop, to watch netflix. I am happy she is enjoying it, but she  <br/>\ntries to wear it during meals now, too. I ask her to put it away while  <br/>\nwe we are eating. I think its rude to have headphones on at the table.<br/>\n<br/>\nI wonder if Im the one with unreasonable expectations, like expecting  <br/>\nthat when we all sit down together to eat a meal, that we dont read or  <br/>\nbe otherwise occupied, and that we dont leave until its ok with  <br/>\neveryone. Ive noticed that my children dont eat as much if I dont sit  <br/>\nwith them. If I make them food, but dont sit down with them, they get  <br/>\ndistracted and leave. If I sit and talk with them, they will eat more.<br/>\n<br/>\nI personally feel really bummed when I have made dinner for everyone,  <br/>\nand then have to eat it alone while everyone else is off doing their  <br/>\nthing. I feel really unappreciated and it takes a lot of the joy out  <br/>\nof making them food. Is this my own crazy baggage? Even if my husband  <br/>\nwould get up and start doing dishes but still be nearby, I wouldnt  <br/>\nmind as much. I feel abandoned. Maybe thats too strong an emotion and  <br/>\nI need to work on this? Its not like people have to rush off to other  <br/>\nactivities. They just disappear into their rooms by themselves. Is it  <br/>\nfair to ask them to be sociable and stay at the table until everyone  <br/>\nis finished?<br/>\n<br/>\nI was going to say, if it was the other way around, and I wanted to  <br/>\nleave and my ˙husband felt it was important to remain, I would. But  <br/>\nthen why dont I want to be magnanimous and let him leave when he wants  <br/>\nto?<br/>\n<br/>\nSo I have feelings about it, but also I dont want them to be rude and  <br/>\ndo this to other people. With my husbands large extended family, its  <br/>\ntrue that dinners mostly occur at the large parties, and its buffet  <br/>\nstyle, and its very informal. People eat, get up, more people eat, you  <br/>\nchange tables, etc. But there is also 30 people, and its a party. We  <br/>\ngo to restaurants, and obviously we all have to leave together. But I  <br/>\nknow that &quot;if they dont learn it now&quot; argument is usually false, so  <br/>\nthen I wonder if its just my own hang up.<br/>\n<br/>\nHow can I think differently about this?<br/>\n<br/>\nthank you,<br/>\n<br/>\nNancy<br/>\n<br/>\nZibby age 8<br/>\nHenry age 5<br/>\n<br/>\n(neither have ever been in school. )<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":70024,"nextTopicId":69984}}