{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: looking for advice/ 13 year old coming from strong rules and no freedoms","postDate":"1322759471","msgId":64032,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiOGNmZitjcnN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlCRDA4RTg5QURBODQ4OEQ5RjRGRDA4RDkzOUIwOTc1QFlPVVJERjJFREU0RkZCPg=="},"prevInTopic":64012,"nextInTopic":0,"prevInTime":64031,"nextInTime":64033,"topicId":63928,"numMessagesInTopic":0,"msgSnippet":"... ******************* To him, that probably sounded like adult prevarication - a no diguised as something else. He s used to the idea that Adults hedge","messageBody":"<div id=\"ygrps-yiv-1715570939\">Whispering Winds Acadmey &lt;whisperingwindsacademy@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; This past weekend, I was having issues with my computer.  When he asked if you could use my computer, I told him he might not be able to this weekend, as I was having some issues, and we would just have to see if I got things working properly again.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nTo him, that probably sounded like adult prevarication - a no diguised as something else. He&#39;s used to the idea that Adults hedge and/or lie as a way to say &quot;no&quot; - that&#39;s normal parenting, especially where technology is concerned, parents tell kids &quot;it&#39;s broken&quot; to keep them from watching tv or when they&#39;ve turned off the modem on the computer. It can help to emphasize the &quot;yes&quot; in what you&#39;re saying, as in &quot;yes, you can certainly try, maybe you can help me figure out what&#39;s wrong with it - I&#39;m having a lot of glitches.&quot; <br/>\n<br/>\nAlso, if he likes to be on the computer, it could help to offer it to him right away so he doesn&#39;t have to ask. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":503532095,"authorName":"Whispering Winds Acadmey","from":"Whispering Winds Acadmey &lt;whisperingwindsacademy@...&gt;","profile":"whisperingwindsacademy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: looking for advice/ 13 year old coming from strong rules and no freedoms","postDate":"1322623443","msgId":64012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCRDA4RTg5QURBODQ4OEQ5RjRGRDA4RDkzOUIwOTc1QFlPVVJERjJFREU0RkZCPg==","referencesHeader":"PGpiMTU0bCtsdnZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":63958,"nextInTopic":64032,"prevInTime":64011,"nextInTime":64013,"topicId":63928,"numMessagesInTopic":0,"msgSnippet":"Thanks for the input! His dad does spend a lot of time with him and make extra efforts with him while he is with us. Yes I have been reading many unschooling","messageBody":"<div id=\"ygrps-yiv-1616964710\">Thanks for the input!<br/>\n<br/>\nHis dad does spend a lot of time with him and make extra efforts with him while he is with us.<br/>\n<br/>\nYes I have been reading many unschooling sites, and books, and I am always looking for more useful information.<br/>\nI have warned my husband... When Will comes to live with us, I think the deschooling process will be extreme...<br/>\nmeaning video games and staying up all night, with the tv or games.  I understand this, he has had so many strong limits on him for so long and the threat of things always being taken away from him.<br/>\nI expect it the deschooling time to be excessive, but I have faith it will level out and work for us.<br/>\n<br/>\nIn the meantime we will work on more &quot;lavish love and caring for him&quot;  :-)<br/>\n<br/>\nHow do you handle the lies and deception?<br/>\nI am not into punishing and taking things away from him.<br/>\n<br/>\nexample:<br/>\n<br/>\nThis past weekend, I was having issues with my computer.  When he asked if you could use my computer, I told him he might not be able to this weekend, as I was having some issues, and we would just have to see if I got things working properly again.<br/>\nSaturday evening, I had set up some virus scans, and other things... turned off my computer screen.<br/>\nI had to pick up my daughter from the movies, asked Will if he wanted to go with us, he declined.<br/>\nI said ok, I would be back in less than 10 minutes.<br/>\n<br/>\nAs I walked in the door he was running away from my computer trying to get back on the couch.<br/>\n<br/>\nI just stood there in shock...<br/>\nI asked him why he was on my computer after I specifically told him not this weekend, as I was worried I really had some things wrong with it.  He just stared at me and gave me no answer.  I did not say anything more, because I know when he is at his mom&#39;s she lectures him for hours often over his bad choices... I have witnessed these lectures and she is very belittling with him and trying to shame him.  Which I can not handle and have to walk away, as I do not want to say anything to cause more conflicts.<br/>\n<br/>\ntwo weekends ago, it was telling us lies about homework and grades and issues with teachers...<br/>\n<br/>\nI understand &quot;why&quot; he does... I just am not sure how to help him out of this behavior.<br/>\n<br/>\nThen sometimes I think it will not change until he does live with us, and the threats of punishment and things taken away from him are gone, and he is treated with respect on a regular basis.<br/>\n<br/>\nAny thoughts/ideas?<br/>\n<br/>\nThanks!<br/>\nStacey<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Meredith <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Monday, November 28, 2011 6:23 PM<br/>\n  Subject: [AlwaysLearning] Re: looking for advice/ 13 year old coming from strong rules and no freedoms<br/>\n<br/>\n<br/>\n    <br/>\n  Whispering Winds Acadmey &lt;whisperingwindsacademy@...&gt; wrote:<br/>\n  &gt;&gt; While he is here we try to treat him the same as Alyssa and our little boys, but it is very hard because then he goes to extremes. I understand that it is because things are so controlled for him at his other house and so many rules...<br/>\n  *********************<br/>\n<br/>\n  Don&#39;t worry about treating him &quot;the same&quot; as the other kids - what&#39;s most important when he visits is spending time nurturing relationships, most especially his relationship with his dad. If that means dad is a little distant from the rest of the family and gives All his time and attention to his son, that&#39;s fine - he has a very small amount of time in which to connect, so its good to make the most of it. If Will wants to do things with other family members, accomodate him and make him feel welcome - not &quot;the same&quot; but a welcome guest in your home. <br/>\n<br/>\n  If dad is spending a ton of time with his son, then there may be less &quot;going to extremes&quot; - hard to know what you mean by that. If you mean things like eating all the cookies and wanting to watch tv all day long, then be sure to buy special food just for him and have dad to plan fun things his son will enjoy doing - even if that&#39;s movie marathons. <br/>\n<br/>\n  &gt; Does anyone have the expierence with much structure and controll and rules, and then going to an unschooling life style? How do you make that work?<br/>\n  ******************<br/>\n<br/>\n  My stepson, Ray, went from living with me and my partner to living with his bio mom for a couple years and going to school to moving back in with us at 13. We were just learning about unschooling when his mom took him to live with her and full-blown radical unschoolers when he came back. <br/>\n<br/>\n  It helped to Lavish love and care on him when he moved in. I bought food I knew he liked and lots of it, took him places he wanted to go, got games and movies and loved him up. It wasn&#39;t enough to treat him the same as my daughter - he needed a looooooot of love and care for awhile. <br/>\n<br/>\n  It helped Me that I had been reading unschooling sites and lists for awhile and knew a bit about deschooling. I didn&#39;t panic when he wanted to play video games for hours on end ;) <br/>\n<br/>\n  &gt; He says he wants to be &quot;homeschooled&quot; and I am sure IF he makes the choice to come here with us, and he is living with us more often than just weekends, it will be easier to find his own way eventually...<br/>\n  ****************<br/>\n<br/>\n  Think hard about how much you want to &quot;homeschool&quot;. I would not have agreed to homeschool Ray when his mom was on the fence about school or no school - she knew we unschooled. It was easier to help him with school work and be his ally in terms of school rather than bring school home and be the adversary. Fortunately, Ray&#39;s mom decided we could give unschooling a try with him - and her relationship with him got so much better she was sold ;) <br/>\n<br/>\n  &gt; Should we keep some limits set up and let up on others..??? <br/>\n<br/>\n  Like what? Rather than thinking in broad terms, look at individual choices. A choice that gives one person more freedom at the expense of others may not be a great choice in the moment! But the next day, that same choice could be congenial to others, too. <br/>\n<br/>\n  I found a lot of the questions about &quot;limits&quot; with Ray went away entirely when the focus was on filling him up with a sense of love and care and belonging - not &quot;you&#39;re one of us, so set the table&quot; but &quot;I&#39;m so glad you&#39;re here I got a box of Every Flavor of jello for you to try and rented this video game I think you&#39;ll enjoy.&quot; <br/>\n<br/>\n  ---Meredith<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":437833022,"authorName":"nicolaphillips88","from":"&quot;nicolaphillips88&quot; &lt;nicolaphillips88@...&gt;","profile":"nicolaphillips88","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: looking for advice/ 13 year old coming from strong rules and no freedoms","postDate":"1322530678","msgId":63958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiMWQxbSsyYTQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgxMDUwRjQ4MkQ0MjQxNDc5RUQzNzQ0MEU2Q0Q1RDVDQFlPVVJERjJFREU0RkZCPg=="},"prevInTopic":63956,"nextInTopic":64012,"prevInTime":63957,"nextInTime":63959,"topicId":63928,"numMessagesInTopic":0,"msgSnippet":"Hi Hi .... sorry if this is no help but your post just reminded me of new girls at the sch i attended... i went to a free school ( summerhill is the most","messageBody":"<div id=\"ygrps-yiv-467030341\">Hi Hi .... <br/>\nsorry if this is no help but your post just reminded me of &#39;new girls&#39; at the sch i attended... i went to a &#39;free school&#39; (&#39;summerhill&#39; is the most famous in UK) when new pupils came from &#39;regular&#39; schools they totally rebelled for at least a term b4 they got in the swings of things ... it sounds a little bit what your step son may do. ... rebel then get in the swing of things. ... ... i remember one girl cut up squares in all the curtains !!! she never got &#39;in trouble&#39; though. .. <br/>\n<br/>\nwould love to hear how your step son gets on if he makes the move to live with you :-) Nicola <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Whispering Winds Acadmey &lt;whisperingwindsacademy@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello!<br/>\n&gt; <br/>\n&gt; First off, I would like to say this list is really wonderful!  I have enjoyed reading the posts, and really have learned much, and they normally change my way of thinking.<br/>\n&gt; <br/>\n&gt; Sandra, all of your replies I read, well they just amaze me at your thoughts!! It&#39;s great!! :-)<br/>\n&gt; Thank you very much for creating and keeping this list going for as long as you have!<br/>\n&gt; <br/>\n&gt; ok, my background... <br/>\n&gt; <br/>\n&gt; I have two daughters, Cassie is in her second year of college, and Alyssa is a freshman in high school.<br/>\n&gt; I was single for most of the years while they were growing up.<br/>\n&gt; I have never been real big on rules and such, I believe in open conversations with my girls and treating them as equals, and letting them make their own choices and decisions.<br/>\n&gt; As far as school goes, I was a bit niave and just never realized I could have really kept them home and made different choices about all that from the beginning.<br/>\n&gt; <br/>\n&gt; I finally found my true partner in life a few years back.  We now have two boys together, Nicholas 4 years old and Ian 2 years old.  Nicholas keeps me on my toes!! lol He is full of energy and into everything and full of curiousity, and everything else you can think of...<br/>\n&gt; Probably close to two years ago, I looked at my husband (Brad) and said...<br/>\n&gt; We can not send him to school, they will want to label him add or adhd and put him on drugs... I can just see it now... <br/>\n&gt; <br/>\n&gt; He agreed and I started my research into homeschool... and then found this term &quot;unschooling&quot;... wow did all of that make more sense than anything!  I read and learn new things every day, especially ways of thinking and looking at things.  Much of it is eye opening and much is &quot;normal&quot; to me.  My girls have never had bedtimes, since being single with them, they were never told to eat what they did not want to, etc. little things like that, which just seemed right to me.  Alyssa wants to go to school, she loves it, does very well and thrives in the envirnoment.  She makes her own decisions, as to how much games she plays, when she goes to sleep, what she eats, she always gets up and ready for school on her own, prides herself in never missing a day of school.  She will routinely stay up till midnight or 1 am or later... but still makes it all work for her in her way.  I have never harped on her about doing school work, or grades.  If she wants to come home take a nap, talk on the phone or play on the cmputer for hours and does not do her homework till 10 pm that is all her choice, and she always completes it, gets straight A&#39;s ... <br/>\n&gt; ok sorry for rambling... <br/>\n&gt; <br/>\n&gt; now for the issue...<br/>\n&gt; <br/>\n&gt; Brad has another son, Will who is 13.  Will visits us every other weekend, and Wednesday nights.  He of course loves the way our household works, and has really made the decision he wants to live with us full time, but he has not approched it with his mother yet.  Which we told him that if living with us is what he really wants, he has to start the conversation with his mom, and then we can go from there.  His life has been very much &quot;controlled&quot; in almost every way I can think of.  I mean she was still picking out which clothes he had to wear everyday.  He has a bed time (very early I think, like 830 or 9), he is not aloud to do anything after school until his homework is done.  Which in turn he has been lying to his mom, and saying its done when infact its not, so that he could do the things he wants to do.  Then he is getting bad grades and in trouble at school... and then more controlling issues with his mother.  She tells him when to get up, what to eat, prepares everything for him.  (I had to teach him how to make a piece of toast in the toaster this weekend)  smh...<br/>\n&gt; <br/>\n&gt; While he is here we try to treat him the same as Alyssa and our little boys, but it is very hard because then he goes to extremes.  I understand that it is because things are so controlled for him at his other house and so many rules...<br/>\n&gt; <br/>\n&gt; Does anyone have the expierence with much structure and controll and rules, and then going to an unschooling life style?  How do you make that work?<br/>\n&gt; Should we keep some limits set up and let up on others..??? <br/>\n&gt; I really think he is going to make the decision to live with us after the holidays.  He is very concerned with his mothers feelings, (which is understandable).<br/>\n&gt; <br/>\n&gt; He says he wants to be &quot;homeschooled&quot; and I am sure IF he makes the choice to come here with us, and he is living with us more often than just weekends, it will be easier to find his own way eventually... <br/>\n&gt; <br/>\n&gt; I don&#39;t know maybe I am not making any sense here, sorry it was a rough weekend.  I want to find easy fixes and I know there are none.  I hate to see the way he is treated on so many levels... <br/>\n&gt; <br/>\n&gt; I guess if anyone has any words of wisdom, I would appreciate them :-)<br/>\n&gt; <br/>\n&gt; Thanks for listening!<br/>\n&gt; Stacey<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: looking for advice/ 13 year old coming from strong rules and no freedoms","postDate":"1322522581","msgId":63956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiMTU0bCtsdnZ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgxMDUwRjQ4MkQ0MjQxNDc5RUQzNzQ0MEU2Q0Q1RDVDQFlPVVJERjJFREU0RkZCPg=="},"prevInTopic":63929,"nextInTopic":63958,"prevInTime":63955,"nextInTime":63957,"topicId":63928,"numMessagesInTopic":0,"msgSnippet":"... ********************* Don t worry about treating him the same as the other kids - what s most important when he visits is spending time nurturing","messageBody":"<div id=\"ygrps-yiv-1259544023\">Whispering Winds Acadmey &lt;whisperingwindsacademy@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; While he is here we try to treat him the same as Alyssa and our little boys, but it is very hard because then he goes to extremes.  I understand that it is because things are so controlled for him at his other house and so many rules...<br/>\n </span></blockquote>*********************<br/>\n<br/>\nDon&#39;t worry about treating him &quot;the same&quot; as the other kids - what&#39;s most important when he visits is spending time nurturing relationships, most especially his relationship with his dad. If that means dad is a little distant from the rest of the family and gives All his time and attention to his son, that&#39;s fine - he has a very small amount of time in which to connect, so its good to make the most of it. If Will wants to do things with other family members, accomodate him and make him feel welcome - not &quot;the same&quot; but a welcome guest in your home. <br/>\n<br/>\nIf dad is spending a ton of time with his son, then there may be less &quot;going to extremes&quot; - hard to know what you mean by that. If you mean things like eating all the cookies and wanting to watch tv all day long, then be sure to buy special food just for him and have dad to  plan fun things his son will enjoy doing - even if that&#39;s movie marathons. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does anyone have the expierence with much structure and controll and rules, and then going to an unschooling life style?  How do you make that work?<br/>\n </span></blockquote>******************<br/>\n<br/>\nMy stepson, Ray, went from living with me and my partner to living with his bio mom for a couple years and going to school to moving back in with us at 13. We were just learning about unschooling when his mom took him to live with her and full-blown radical unschoolers when he came back. <br/>\n<br/>\nIt helped to Lavish love and care on him when he moved in. I bought food I knew he liked and lots of it, took him places he wanted to go, got games and movies and loved him up. It wasn&#39;t enough to treat him the same as my daughter - he needed a looooooot of love and care for awhile. <br/>\n<br/>\nIt helped Me that I had been reading unschooling sites and lists for awhile and knew a bit about deschooling. I didn&#39;t panic when he wanted to play video games for hours on end ;) <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He says he wants to be &quot;homeschooled&quot; and I am sure IF he makes the choice to come here with us, and he is living with us more often than just weekends, it will be easier to find his own way eventually...<br/>\n </span></blockquote>****************<br/>\n<br/>\nThink hard about how much you want to &quot;homeschool&quot;. I would not have agreed to homeschool Ray when his mom was on the fence about school or no school - she knew we unschooled. It was easier to help him with school work and be his ally in terms of school rather than bring school home and be the adversary. Fortunately, Ray&#39;s mom decided we could give unschooling a try with him - and her relationship with him got so much better she was sold ;) <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Should we keep some limits set up and let up on others..??? <br/>\n<br/>\n </span></blockquote>Like what? Rather than thinking in broad terms, look at individual choices. A choice that gives one person more freedom at the expense of others may not be a great choice in the moment! But the next day, that same choice could be congenial to others, too. <br/>\n<br/>\nI found a lot of the questions about &quot;limits&quot; with Ray went away entirely when the focus was on filling him up with a sense of love and care and belonging - not &quot;you&#39;re one of us, so set the table&quot; but &quot;I&#39;m so glad you&#39;re here I got a box of Every Flavor of jello for you to try and rented this video game I think you&#39;ll enjoy.&quot; <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] looking for advice/ 13 year old coming from strong rules and no freedoms","postDate":"1322452126","msgId":63929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MTU5NkVELUNEMTctNEJBQi05NzNBLUI2OERGQjgwQzY0NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDgxMDUwRjQ4MkQ0MjQxNDc5RUQzNzQ0MEU2Q0Q1RDVDQFlPVVJERjJFREU0RkZCPg==","referencesHeader":"PGphdWUxMSt1MWluQGVHcm91cHMuY29tPiA8MEMxN0FEQTItM0YyNi00QUQzLTk4MUMtOEI0NDA1MzA3MkRBQFNhbmRyYWRvZGQuY29tPiA8ODEwNTBGNDgyRDQyNDE0NzlFRDM3NDQwRTZDRDVENUNAWU9VUkRGMkVERTRGRkI+"},"prevInTopic":63928,"nextInTopic":63956,"prevInTime":63928,"nextInTime":63930,"topicId":63928,"numMessagesInTopic":0,"msgSnippet":"-=-Does anyone have the expierence with much structure and controll and rules, and then going to an unschooling life style? How do you make that work?-=- If","messageBody":"<div id=\"ygrps-yiv-783258181\">-=-Does anyone have the expierence with much structure and controll and rules, and then going to an unschooling life style? How do you make that work?-=-<br/>\n<br/>\nIf his mom has primary custody and doesn&#39;t understand or agree to unschooling, it might not be workable for him, and it might keep your other kids&#39; unschooling from working well if he&#39;s there and being very reactionary one way or the other.  <br/>\n<br/>\nIf he&#39;s old enough to make a full decision about where to live then *maybe* it wouldn&#39;t be too hard to make the switch, though it would take so many months for him to deschool that his mom might figure it looks like total neglect, and object.<br/>\n<br/>\nThere are a few things saved on starting later with teens:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/later/unschooling\">http://sandradodd.com/later/unschooling</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen/latertounschooling\">http://sandradodd.com/teen/latertounschooling</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":503532095,"authorName":"Whispering Winds Acadmey","from":"Whispering Winds Acadmey &lt;whisperingwindsacademy@...&gt;","profile":"whisperingwindsacademy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"looking for advice/ 13 year old coming from strong rules and no freedoms","postDate":"1322438375","msgId":63928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxMDUwRjQ4MkQ0MjQxNDc5RUQzNzQ0MEU2Q0Q1RDVDQFlPVVJERjJFREU0RkZCPg==","referencesHeader":"PGphdWUxMSt1MWluQGVHcm91cHMuY29tPiA8MEMxN0FEQTItM0YyNi00QUQzLTk4MUMtOEI0NDA1MzA3MkRBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":0,"nextInTopic":63929,"prevInTime":63927,"nextInTime":63929,"topicId":63928,"numMessagesInTopic":0,"msgSnippet":"Hello! First off, I would like to say this list is really wonderful!  I have enjoyed reading the posts, and really have learned much, and they normally change","messageBody":"<div id=\"ygrps-yiv-1519248472\">Hello!<br/>\n<br/>\nFirst off, I would like to say this list is really wonderful!  I have enjoyed reading the posts, and really have learned much, and they normally change my way of thinking.<br/>\n<br/>\nSandra, all of your replies I read, well they just amaze me at your thoughts!! It&#39;s great!! :-)<br/>\nThank you very much for creating and keeping this list going for as long as you have!<br/>\n<br/>\nok, my background... <br/>\n<br/>\nI have two daughters, Cassie is in her second year of college, and Alyssa is a freshman in high school.<br/>\nI was single for most of the years while they were growing up.<br/>\nI have never been real big on rules and such, I believe in open conversations with my girls and treating them as equals, and letting them make their own choices and decisions.<br/>\nAs far as school goes, I was a bit niave and just never realized I could have really kept them home and made different choices about all that from the beginning.<br/>\n<br/>\nI finally found my true partner in life a few years back.  We now have two boys together, Nicholas 4 years old and Ian 2 years old.  Nicholas keeps me on my toes!! lol He is full of energy and into everything and full of curiousity, and everything else you can think of...<br/>\nProbably close to two years ago, I looked at my husband (Brad) and said...<br/>\nWe can not send him to school, they will want to label him add or adhd and put him on drugs... I can just see it now... <br/>\n<br/>\nHe agreed and I started my research into homeschool... and then found this term &quot;unschooling&quot;... wow did all of that make more sense than anything!  I read and learn new things every day, especially ways of thinking and looking at things.  Much of it is eye opening and much is &quot;normal&quot; to me.  My girls have never had bedtimes, since being single with them, they were never told to eat what they did not want to, etc. little things like that, which just seemed right to me.  Alyssa wants to go to school, she loves it, does very well and thrives in the envirnoment.  She makes her own decisions, as to how much games she plays, when she goes to sleep, what she eats, she always gets up and ready for school on her own, prides herself in never missing a day of school.  She will routinely stay up till midnight or 1 am or later... but still makes it all work for her in her way.  I have never harped on her about doing school work, or grades.  If she wants to come home take a nap, talk on the phone or play on the cmputer for hours and does not do her homework till 10 pm that is all her choice, and she always completes it, gets straight A&#39;s ... <br/>\nok sorry for rambling... <br/>\n<br/>\nnow for the issue...<br/>\n<br/>\nBrad has another son, Will who is 13.  Will visits us every other weekend, and Wednesday nights.  He of course loves the way our household works, and has really made the decision he wants to live with us full time, but he has not approched it with his mother yet.  Which we told him that if living with us is what he really wants, he has to start the conversation with his mom, and then we can go from there.  His life has been very much &quot;controlled&quot; in almost every way I can think of.  I mean she was still picking out which clothes he had to wear everyday.  He has a bed time (very early I think, like 830 or 9), he is not aloud to do anything after school until his homework is done.  Which in turn he has been lying to his mom, and saying its done when infact its not, so that he could do the things he wants to do.  Then he is getting bad grades and in trouble at school... and then more controlling issues with his mother.  She tells him when to get up, what to eat, prepares everything for him.  (I had to teach him how to make a piece of toast in the toaster this weekend)  smh...<br/>\n<br/>\nWhile he is here we try to treat him the same as Alyssa and our little boys, but it is very hard because then he goes to extremes.  I understand that it is because things are so controlled for him at his other house and so many rules...<br/>\n<br/>\nDoes anyone have the expierence with much structure and controll and rules, and then going to an unschooling life style?  How do you make that work?<br/>\nShould we keep some limits set up and let up on others..??? <br/>\nI really think he is going to make the decision to live with us after the holidays.  He is very concerned with his mothers feelings, (which is understandable).<br/>\n<br/>\nHe says he wants to be &quot;homeschooled&quot; and I am sure IF he makes the choice to come here with us, and he is living with us more often than just weekends, it will be easier to find his own way eventually... <br/>\n<br/>\nI don&#39;t know maybe I am not making any sense here, sorry it was a rough weekend.  I want to find easy fixes and I know there are none.  I hate to see the way he is treated on so many levels... <br/>\n<br/>\nI guess if anyone has any words of wisdom, I would appreciate them :-)<br/>\n<br/>\nThanks for listening!<br/>\nStacey<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":63908,"nextTopicId":64029}}