{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":7564419,"authorName":"TFAP@aol.com","from":"TFAP@...","profile":"tfap45373","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Anna Quinlen essay","postDate":"1034951312","msgId":46778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNi4xODhmYzAwMC4yYWUxNzQ5MEBhb2wuY29tPg=="},"prevInTopic":46776,"nextInTopic":0,"prevInTime":46777,"nextInTime":46779,"topicId":46776,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/18/02 10:08:24 AM Eastern Daylight Time, sjogy@aol.com writes:  Your timing couldn t be more","messageBody":"<div id=\"ygrps-yiv-1338028260\">In a message dated 10/18/02 10:08:24 AM Eastern Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sjogy@...\">sjogy@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt; Goodbye, Dr. Spock, by Anna Quindlen &gt;&gt;<br/>\n<br/>\nYour timing couldn&#39;t be more perfect . . . this is exactly where I am in my <br/>\nlife!  Thanks so much for sharing!!!<br/>\n<br/>\nLeonore</div>","specialLinks":[]},{"userId":2018196,"authorName":"sjogy@aol.com","from":"sjogy@...","profile":"sjogypls","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Anna Quinlen essay","postDate":"1034950032","msgId":46776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5LjJmMjlmMWZhLjJhZTE2ZjkwQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":46778,"prevInTime":46775,"nextInTime":46777,"topicId":46776,"numMessagesInTopic":0,"msgSnippet":"Hope this doesn t show up a million times, though. Goodbye, Dr. Spock, by Anna Quindlen If not for the photographs, I might have a hard time believing they","messageBody":"<div id=\"ygrps-yiv-2117384510\">Hope this doesn&#39;t show up a million times, though.<br/>\n<br/>\nGoodbye, Dr. Spock, by Anna Quindlen<br/>\n<br/>\nIf not for the photographs, I might<br/>\nhave a hard time believing they ever existed. The pensive infant with the<br/>\nswipe of dark bangs and the black button eyes of a Raggedy Andy doll. The<br/>\nplacid baby with the yellow ringlets and the high piping voice. The sturdy<br/>\ntoddler with the lower lip that curled into an apostrophe above her chin.<br/>\nALL MY BABIES are gone now.<br/>\n<br/>\nI say this not in sorrow but in disbelief. I take great satisfaction in what<br/>\nI have today: three almost-adults, two taller than I am, one closing in<br/>\nfast. Three people who read the same books I do and have learned not to be<br/>\nafraid of disagreeing with me in their opinion of them, who sometimes tell<br/>\nvulgar jokes that make me laugh until I choke and cry, who need razor blades<br/>\nand shower gel and privacy, who want to keep their doors closed more than I<br/>\nlike. Who, miraculously, go to the bathroom, zip up their jackets and move<br/>\nfood from plate to mouth all by themselves.<br/>\n<br/>\nLike the trick soap I bought for the bathroom with a rubber duckie at its<br/>\ncenter, the baby is buried deep within each, barely discernible except<br/>\nthrough the unreliable haze of the past.<br/>\n<br/>\nEverything in all the books I once pored over is finished for me now.<br/>\nPenelope Leach. T. Berry Brazelton. Dr. Spock. The ones on sibling rivalry<br/>\nand sleeping through the night and early-childhood education, all grown<br/>\nobsolete. Along with Goodnight Moon and Where the Wild Things Are, they are<br/>\nbattered, spotted, well used.<br/>\n<br/>\nBut I suspect that if you flipped the pages dust would rise like memories.<br/>\n<br/>\nWhat those books taught me, finally, and what the women on the playground<br/>\ntaught me, and the well-meaning relations -- what they taught me was that<br/>\nthey couldn&#39;t really teach me very much at all. Raising children is<br/>\npresented at first as a true-false test, then becomes multiple choice, until<br/>\nfinally, far along, you realize that it is an endless essay. No one knows<br/>\nanything. One child responds well to positive reinforcement, another can be<br/>\nmanaged only with a stern voice and a timeout. One boy is toilet trained at<br/>\n3, his brother at 2. When my first child was born, parents were told to put<br/>\nbaby to bed on his belly so that he would not choke on his own spit-up. By<br/>\nthe time my last arrived, babies were put down on their backs because of<br/>\nresearch on sudden infant death syndrome. To a new parent this ever-shifting<br/>\ncertainty is terrifying, and then soothing. Eventually you must learn to<br/>\ntrust yourself. Eventually the research will follow.<br/>\n<br/>\nFirst science said environment was the great shaper of human nature. But it<br/>\ncertainly seemed as though those babies had distinct personalities, some<br/>\ncontemplative, some gregarious, some crabby. And eventually science said<br/>\nthat was right, and that they were hard-wired exactly as we had suspected.<br/>\n<br/>\nStill, the temptation to defer to the experts was huge. The literate parent,<br/>\nwho approaches everything; cooking, decorating, life as though there were a<br/>\npaper due or an exam scheduled, is in particular peril when the kids arrive.<br/>\n<br/>\nHow silly it all seems now, the obsessing about language acquisition and<br/>\nphysical milestones, the riding the waves of normal, gifted, hyperactive,<br/>\nall those labels that reduced individuality to a series of cubbyholes. But I<br/>\ncould not help myself. I had watched my mother casually raise five children<br/>\nborn over 10 years, but by watching her I intuitively knew that I was<br/>\nengaged in the greatest and potentially most catastrophic task of my life. I<br/>\nknew that there were mothers who had worried with good reason, that there<br/>\nwere children who would have great challenges to meet. We were lucky; ours<br/>\nwere not among them.<br/>\n<br/>\nNothing horrible or astonishing happened: there was hernia surgery, some<br/>\nstitches, a broken arm and a fuchsia cast to go with it. Mostly ours were<br/>\nthe ordinary everyday terrors and miracles of raising a child, and our<br/>\nchildren&#39;s challenges the old familiar ones of learning to live as<br/>\nthemselves in the world. The trick was to get past my fears, my ego and my<br/>\ninadequacies to help them do that.<br/>\n<br/>\nI remember 15 years ago poring over one of Dr. Brazelton&#39;s wonderful books<br/>\non child development, in which he describes three different sorts of<br/>\ninfants: average, quiet, and active. I was looking for a sub- quiet codicil<br/>\nfor an 18-month-old who did not walk. Was there something wrong with his fat<br/>\nlittle legs? Was there something wrong with his tiny little mind? Was he<br/>\ndevelopmentally delayed, physically challenged? Was I insane? Last year he<br/>\nwent to China. Next year he goes to college. He can talk just fine. He can<br/>\nwalk, too.<br/>\n<br/>\nEvery part of raising children is humbling, too. Believe me, mistakes were<br/>\nmade. They have all been enshrined in the Remember-When-Mom-Did Hall of<br/>\nFame. The outbursts, the temper tantrums, the bad language, mine, not<br/>\ntheirs. The times the baby fell off the bed. The times I arrived late for<br/>\npreschool pickup. The nightmare sleepover. The horrible summer camp. The day<br/>\nwhen the youngest came barreling out of the classroom with a 98 on her<br/>\ngeography test, and I responded, What did you get wrong? (She insisted I<br/>\ninclude that.) The time I ordered food at the McDonald&#39;s drive-through<br/>\nspeaker and then drove away without picking it up from the window. (They all<br/>\ninsisted I include that.) I did not allow them to watch the Simpsons for the<br/>\nfirst two seasons. What was I thinking?<br/>\n<br/>\nBut the biggest mistake I made is the one that most of us make while doing<br/>\nthis. I did not live in the moment enough. This is particularly clear now<br/>\nthat the moment is gone, captured only in photographs. There is one picture<br/>\nof the three of them sitting in the grass on a quilt in the shadow of the<br/>\nswing set on a summer day, ages 6, 4 and 1. And I wish I could remember what<br/>\nwe ate, and what we talked about, and how they sounded, and how they looked<br/>\nwhen they slept that night. I wish I had not been in such a hurry to get on<br/>\nto the next thing: dinner, bath, book, bed. I wish I had treasured the doing<br/>\na little more and the getting it done a little less.<br/>\n<br/>\nEven today I&#39;m not sure what worked and what didn&#39;t, what was me and what<br/>\nwas simply life. When they were very small, I suppose I thought someday they<br/>\nwould become who they were because of what I&#39;d done. Now I suspect they<br/>\nsimply grew into their true selves because they demanded in a thousand ways<br/>\nthat I back off and let them be. The books said to be relaxed and I was<br/>\noften tense, matter-of-fact and I was sometimes over the top. And look how<br/>\nit all turned out. I wound up with the three people I like best in the<br/>\nworld, who have done more than anyone to excavate my essential humanity.<br/>\n<br/>\nThat&#39;s what the books never told me. I was bound and determined to learn<br/>\nfrom the experts. It just took me a while to figure out who the experts<br/>\nwere.</div>","specialLinks":[]}],"prevTopicId":46490,"nextTopicId":46640}}