{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"DiamondAir","from":"&quot;DiamondAir&quot; &lt;diamondair@...&gt;","replyTo":"LIST","senderId":"slxwd0SYw3q_lJqHeRHnozmRxJacsQ-E8CpHk0dvgCc3inGa4LhX5fmPLKTY-QnW4D9K5-KLlSQf6-G_wHC7y1BnUXUWO8tQvH2YCIYa","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 1215","postDate":"989418279","msgId":20912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMwZDg5NCQzZGU4Y2JjMCQ2ZmQ0MGUzZkA4MzhmMzAxPg==","referencesHeader":"PDk4OTM0MjUwMy40MDE3LjcxNjgubDhAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":20911,"nextInTime":20913,"topicId":20912,"numMessagesInTopic":0,"msgSnippet":"... Right, but the mother can stop eating what they are allergic to. Both my kids are allergic to milk. Well, I haven t had any dairy products in a long time,","messageBody":"<div id=\"ygrps-yiv-1623130404\"><blockquote><span title=\"ireply\">&gt;    From: &quot;Eileen M.&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ravensegg@...\">ravensegg@...</a>&gt;<br/>\n&gt; Yes, under normal circumstances, breast milk is<br/>\n&gt; designed for babies, and the female human breast is<br/>\n&gt; designed to deliver that milk.  But for many reasons<br/>\n&gt; some babies do not thrive on breast milk.  They may be<br/>\n&gt; (as my son was) lactose intolerant *and* allergic to<br/>\n&gt; milk.  Their mother may be eating something to which<br/>\n&gt; they are allergic.<br/>\n<br/>\n<br/>\n </span></blockquote>Right, but the mother can stop eating what they are allergic to. Both my<br/>\nkids are allergic to milk. Well, I haven&#39;t had any dairy products in a long<br/>\ntime, and I sure do miss my ice cream :-) but it&#39;s really not that big of an<br/>\nissue. All that means is that *cow&#39;s* milk is not beneficial to babies, not<br/>\nthat mother&#39;s milk isn&#39;t. The only disease I am aware of that necessitates<br/>\ntotal weaning is Galactosemia, an extremely rare metabolic disorder that<br/>\nnecessitates that the child be on a special diet for life. In this case, it<br/>\nisn&#39;t so much of a case of mother&#39;s milk not being beneficial, but that the<br/>\nbaby has a genetic disease that prevents them from receiving proper<br/>\nnutrition from many different sources.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They may be severely hypoglycemic<br/>\n&gt; (again, as my son was) and the milk simply doesn&#39;t<br/>\n&gt; have enough sugars in it to keep them alive.<br/>\n<br/>\n<br/>\n </span></blockquote>According to LLL:<br/>\n<br/>\n&quot;Symptomatic hypoglycemia in newborns is largely due to delayed or<br/>\ninadequate feeding and is more likely to occur when mother and baby are<br/>\nseparated after birth. Some newborns are given sugar water on the erroneous<br/>\nassumption that this will prevent hypoglycemia. Instead, giving glucose<br/>\nwater causes a sudden rise in the blood glucose levels, which in turn<br/>\nstimulates the secretion of insulin by the pancreas. The high level of<br/>\ninsulin results in an equally sudden drop in glucose levels. It is<br/>\ninteresting to note that the treatment for hypoglycemia in adults is small,<br/>\nfrequent, high-protein meals. That is exactly what the baby gets when he is<br/>\nallowed to breastfeed on demand from birth.<br/>\n<br/>\nImmediate and frequent feedings of colostrum, preferably ten to twelve<br/>\nfeedings per day in the first few days, stabilize blood glucose levels.<br/>\nUndiluted human milk is the best food, particularly for preterm infants. &quot;<br/>\n<br/>\n&quot;In some hospital settings, newborns are at risk for developing hypoglycemia<br/>\neven after an uneventful labor and delivery. Babies who are not fed soon<br/>\nafter birth, are left uncovered in a nursery warmer, or are left in a<br/>\nnursery to cry, are under stress. As a result they use up their stores of<br/>\nglucose and are at risk for developing hypoglycemia. It is important to put<br/>\nthe baby to the breast immediately after birth, make sure the baby is kept<br/>\nwarm and dry (preferably in the mother&#39;s arms), and not allow long<br/>\nseparations when the baby may be left to cry. &quot;<br/>\n<br/>\nand finally:<br/>\n<br/>\n&quot;The best way to stabilize blood sugar and prevent hypoglycemia in all<br/>\ninfants is prompt and frequent feedings of colostrum and human milk.&quot;<br/>\n<br/>\nEven if supplements need to be given - glucose, etc. the baby can still<br/>\nbenefit from breastfeeding. The supplements are a small addition to the<br/>\nmillions of beneficial properties of the breastmilk.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They may<br/>\n&gt; be too weak to suck.  Their mothers may be unable, due<br/>\n&gt; to stress, nutritional problems etc, to provide<br/>\n&gt; sufficient breastmilk.  They may need a different<br/>\n&gt; balance of nutrients for a variety of health reasons<br/>\n&gt; than breast milk can provide.  They may be too<br/>\n&gt; underdeveloped to process breastmilk.<br/>\n<br/>\n </span></blockquote>But as per the original statements, all these babies would *benefit* from<br/>\nbreastfeeding. If they&#39;re too weak to suck, they can be supplemented with an<br/>\neyedropper and breastmilk until they gain their ability to suck -<br/>\nbreastfeeding (left undisturbed) is a relationship of many years, not just<br/>\nthe first few days, weeks, or months. If the mothers are unable to provide<br/>\nsufficient breastmilk, that&#39;s a whole &#39;nother problem. Obviously the mothers<br/>\nshould be supported to the degree that they can provide breastmilk, but if<br/>\nnot that still doesn&#39;t mean that the baby wouldn&#39;t benefit from it, just<br/>\nthat the mom can&#39;t provide it. In many cases, a donor mother can provide<br/>\nbreastmilk (which can even be pasteurized) - this is less rare than you&#39;d<br/>\nthink. I&#39;ve both donated my breastmilk (to an adopted baby) and wet nursed a<br/>\nfriend&#39;s baby when she was in the hospital. If breastfeeding was more<br/>\nsupported, these alternates would be more common.<br/>\nAs for babies needing a different balance of nutrients than breastmilk<br/>\nprovides, the baby would still benefit from breastfeeding, perhaps enhanced<br/>\nby the addition of whatever else breastmilk would be &quot;lacking&quot;. As<br/>\nbreastmilk contains over 400 ingredients that scientists have yet to<br/>\nidentify, and infant formulas contain about 20, I&#39;d be pretty suspect of<br/>\nsomeone claiming that a formula could provide what breastmilk could not<br/>\n(unless of course in the case of those rare disorders where the baby isn&#39;t<br/>\nable to process some things, or where the baby needs something specific,<br/>\nlike glucose drops). In any case, it&#39;s a simple matter to supplement the<br/>\nbaby&#39;s diet in addition to providing the breastmilk. As for a baby being<br/>\nunderdeveloped to process breastmilk, research in the last decade has found<br/>\nthat this is rarely the case. The mother&#39;s milk actually *changes*<br/>\ndramatically when a baby is born prematurely and is ideally suited for the<br/>\npremature infant. Scientists now realize that breastmilk is the best food,<br/>\neven for preemies.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The majority of babies in the NICU my son was in could<br/>\n&gt; not use breastmilk for one reason or another.<br/>\n<br/>\n </span></blockquote>But this was 11 years ago, right? They have learned a lot about the benefits<br/>\nof breastmilk for preemies in the time between then and now. Now mothers<br/>\nwith babies in the NICU are encouraged to pump and to put the baby to the<br/>\nbreast. The babies can be fed with eyedroppers or SNS (supplemental nursing<br/>\nsystems) to prevent nipple confusion. Every mom of a NICU baby that I&#39;ve<br/>\nknown in the last few years has been encouraged strongly to breastfeed as<br/>\npreemies need breastmilk even more than full-term babies.  There is even a<br/>\nbook out now: &quot;Breastfeeding Your Premature Baby&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And<br/>\n&gt; most babies will refuse the breast once they are<br/>\n&gt; initiated on a bottle... the bottle provides faster<br/>\n&gt; service with less work.<br/>\n<br/>\n </span></blockquote>All the more reason that hospitals and new mothers should be aware that<br/>\nthere are alternatives to bottle feeding for babies who need supplementing.<br/>\nDroppers, cups, tube and finger feeding, and SNS are just some of the<br/>\npossibilities that will not induce nipple confusion.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But it is a sweeping generality to say that *all*<br/>\n&gt; children benefit from breast feeding in infancy.  Some<br/>\n&gt; babies would die or fail to thrive from breast<br/>\n&gt; feeding, so it is not factually the case that all<br/>\n&gt; children benefit from breast feeding in infancy.<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;d say other than the genetic disease I mentioned above (in which case the<br/>\nbaby has a host of problems with food, not just breastmilk), *all* babies<br/>\nwould benefit from breastfeeding (even if it is just partial breastfeeding).<br/>\nBreastmilk benefits babies in a thousand different ways, and the nutritional<br/>\naspect is just one of them. The white blood cells and disease protection,<br/>\nthe bonding, the suckling promoting healthy jaw development, the anti-cancer<br/>\nproperties of breastmilk are among the benefits that  a baby would get from<br/>\nbreastfeeding, even *if* they were among the very rare cases that also<br/>\nneeded supplementing with some other nutritional additive.  Typically,<br/>\nbabies that would die or fail to thrive would do so because of lack of<br/>\nsupport and accurate information about breastfeeding.  A lot of that has<br/>\nbeen dispensed by the medical profession in the last few decades of<br/>\ndominance by the formula companies (See the book &quot;Milk, Money, and Madness&quot;<br/>\nfor a thorough treatment of that topic).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Need a lift back onto the soapbox?<br/>\n<br/>\n </span></blockquote>No, thanks :-)<br/>\n<br/>\nOne of the reasons that the breastfeeding soapbox is so important is that so<br/>\nmuch misinformation has been given about breastfeeding. The World Health<br/>\nOrganization estimates that a *MILLION* babies die every year around the<br/>\nworld from *lack* of breastfeeding, including a whopping 10,000 here in the<br/>\n(supposedly modern) United States. It is vitally important that mothers<br/>\nreceive accurate information about breastfeeding, and support to do so.<br/>\nFortunately, scientists and medical professionals are just starting to<br/>\nrealize how important breastfeeding is and how in almost all circumstances<br/>\nit is possible and indeed necessary. Maybe someday we will see it supported<br/>\nproperly. I think it is one of the most vital health issues on this planet.<br/>\n<br/>\nBlue Skies!<br/>\n   -Robin-<br/>\nMom to Mackenzie (8/28/96) inventer of new and wonderful things<br/>\nand Asa (10/5/99) singer of protest songs<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>   Flying Clevenger Family</div>","specialLinks":[]}],"prevTopicId":20911,"nextTopicId":20915}}