{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] being a joyful parent and a passionate feminist at the same time","postDate":"1253185869","msgId":47287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyOTA0MzhGLTc0QkEtNDAzOC04Q0QxLTEyN0NDQ0VGMTZDQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGg4cm03NStoMm44QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4cm03NStoMm44QGVHcm91cHMuY29tPg=="},"prevInTopic":47276,"nextInTopic":0,"prevInTime":47286,"nextInTime":47288,"topicId":47260,"numMessagesInTopic":0,"msgSnippet":"... Don t make it about changing them. Make it about you. Follow your passions as you can without depriving them. Talk about what s important to you when it","messageBody":"<div id=\"ygrps-yiv-1879582494\">On Sep 16, 2009, at 5:44 PM, vespertine_nsw wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would like some tips, if anyone has any, on helping them develop  <br/>\n&gt; a social conscience and the passion to change things, without me  <br/>\n&gt; coming across as a negative, cynical person.<br/>\n<br/>\n </span></blockquote>Don&#39;t make it about changing them. Make it about you. Follow your  <br/>\npassions as you can without depriving them. Talk about what&#39;s  <br/>\nimportant to you when it comes up.<br/>\n<br/>\nInvite them along if you&#39;re doing something you think they might  <br/>\nenjoy helping with.<br/>\n<br/>\nMy husband does sports programs for seniors and for visually impaired  <br/>\nkids. He invited Kathryn along when he thought it might be fun for  <br/>\nher and when she could give him some real help. But there was no  <br/>\nagenda to get her to believe anything or be anything other than who  <br/>\nshe was. The goal was to do something together that she might find  <br/>\nfun and ways for her to feel her time was well spent.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] being a joyful parent and a passionate feminist at the same time","postDate":"1253161243","msgId":47276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2MkQ4MDQzQUMyQzREREE4RDcxNDlCQ0UzQkVFOTczQFJvYnluUEM+","inReplyToHeader":"PGg4cm03NStoMm44QGVHcm91cHMuY29tPg==","referencesHeader":"PGg4cm03NStoMm44QGVHcm91cHMuY29tPg=="},"prevInTopic":47271,"nextInTopic":47287,"prevInTime":47275,"nextInTime":47277,"topicId":47260,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2053221469\">&lt;&lt;&lt;&lt;I&#39;m a feminist who&#39;s very passionate about women&#39;s rights and I do a <br/>\nfair amount of reading on the subject (both Australian and international.) <br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>You might enjoy reading a couple of essays by Danielle Conger where she <br/>\nwrites about her definitely feminist beliefs in the context of being an <br/>\nunschooling mom.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://danielleconger.organiclearning.org/myjourney.html\">http://danielleconger.organiclearning.org/myjourney.html</a><br/>\n<br/>\n&lt;&lt;&lt; I am doing the obvious things like encouraging them to persue what they <br/>\nenjoy, not what society deems appropriate for their sex, being aware of my <br/>\nlanguage, ensuring they have access to a wide range of books, toys and <br/>\nclothes that don&#39;t perpetuate stereotypes.&gt;&gt;&gt;&gt;<br/>\n<br/>\nHaving a daughter gave me a much greater appreciation for the &quot;nature&quot; side <br/>\nof that supposedly old question of nature vs nurture. She is such a girly <br/>\ngirl in her attitudes and desires and tastes.<br/>\n<br/>\nI have no fear of any outside (ie outside our family) force of the media or <br/>\nour culture that might be perpetuating stereotypes impacting Jayn in any <br/>\nsignificant way. Not only do I believe that I am stronger than these, and <br/>\nthat my dd is stronger than these, I also believe that our family is <br/>\nstronger. There is no product, image, toy, item, story, tv show, movie, or <br/>\nphilosophy that is stronger than us and our own principles and how Jayn is <br/>\ntreated in our home.<br/>\n<br/>\nChances are that any time I feel called to expound a critique of some <br/>\nproduct, idea, see-the-list-above, I am met with eye rolling and either &quot;I <br/>\nknow&quot; or &quot;I don&#39;t care.&quot; Jayn doesn&#39;t see the negativity of a world filled <br/>\nwith stereotypes or dangers to be avoided.<br/>\n<br/>\nI have found it better to focus on what is positive and good and interesting <br/>\nabout stuff, than on trying to avoid some idea.<br/>\n<br/>\n&lt;&lt;&lt;&lt; I sway between feeling anger and a criticism (of concepts and <br/>\nattitudes) as healthy and important, then wondering if they&#39;re <br/>\ncounter-intuitive to creating a warm, happy nest which I want for them. &gt;&gt;&gt;<br/>\n<br/>\nI would say that anger is always counter-*productive* to a warm, happy nest. <br/>\nPeace, warmth, happiness, calm begin in the home.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":363518215,"authorName":"claire.horsley08","from":"&quot;claire.horsley08&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: being a joyful parent and a passionate feminist at the same time","postDate":"1253148284","msgId":47271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4czBwcys0NWpzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg4cm03NStoMm44QGVHcm91cHMuY29tPg=="},"prevInTopic":47260,"nextInTopic":47276,"prevInTime":47270,"nextInTime":47272,"topicId":47260,"numMessagesInTopic":0,"msgSnippet":"I am a committed vegetarian, but I buy and cook organic meat for my kids because I don t want my personal ideology to override their enjoyment of and need for","messageBody":"<div id=\"ygrps-yiv-452684690\">I am a committed vegetarian, but I buy and cook organic meat for my kids because I don&#39;t want my personal ideology to override their enjoyment of and need for good quality protein.  In the same way, I don&#39;t think you should try to make your kids passionate about the same issues you hold dear.  If you live a principled life, your kids will respect your integrity, but they won&#39;t necessarily take up the same cause.  After all, it was a specific set of circumstances (including what must have been a horrible experience of domestic violence) that led you to hold the values you hold.  Your kids&#39; experiences will be different, and so with your example they may come to be passionate about an issue equally as important as women&#39;s rights.<br/>\n<br/>\nThe key here is that although you can guide children as they develop their own moral framework, ultimately they will only become passionate about something they have chosen themselves.</div>","specialLinks":[]},{"userId":256043261,"authorName":"vespertine_nsw","from":"&quot;vespertine_nsw&quot; &lt;kezzdee@...&gt;","profile":"vespertine_nsw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"being a joyful parent and a passionate feminist at the same time","postDate":"1253137445","msgId":47260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cm03NStoMm44QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47271,"prevInTime":47259,"nextInTime":47261,"topicId":47260,"numMessagesInTopic":0,"msgSnippet":"Hi group, I am experiencing some internal conflict. I m a feminist who s very passionate about women s rights and I do a fair amount of reading on the subject","messageBody":"<div id=\"ygrps-yiv-1551913197\">Hi group,<br/>\n<br/>\nI am experiencing some internal conflict. I&#39;m a feminist who&#39;s very passionate about women&#39;s rights and I do a fair amount of reading on the subject (both Australian and international.) I have also come out of an abusive relationship so am sensitive and personally connected to issues like domestic violence. I want my children to develop a healthy feminist critique and to be aware and to care about the abuse of women&#39;s rights (and to care about it), but I also want to be a fun parent, and I want our home life to be fun and positive.<br/>\n<br/>\n I am wondering how to balance this. My children are still young, but as they get older, what are appropriate ways to approach these subjects? Right now I am doing the obvious things like encouraging them to persue what they enjoy, not what society deems appropriate for their sex, being aware of my language, ensuring they have access to a wide range of books, toys and clothes that don&#39;t perpetuate stereotypes. <br/>\n<br/>\nBut I sway between feeling anger and a criticism (of concepts and attitudes) as healthy and important, then wondering if they&#39;re counter-intuitive to creating a warm, happy nest which I want for them. I would like some tips, if anyone has any, on helping them develop a social conscience and the passion to change things, without me coming across as a negative, cynical person. I guess it&#39;s also about being genuine, speaking honestly, but doing it in age appropriate ways and ways that won&#39;t stifle their optimism and joy. <br/>\n<br/>\nThanks in advance,<br/>\nKerrie from Australia.</div>","specialLinks":[]}],"prevTopicId":47236,"nextTopicId":47262}}