{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":201771850,"authorName":"leavingemeraldcity","from":"&quot;leavingemeraldcity&quot; &lt;jtmartin@...&gt;","profile":"leavingemeraldcity","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"To: Mommy of 7 plus 1","postDate":"1131510101","msgId":109408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRrcnRnbStwaGhpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":109407,"nextInTime":109409,"topicId":109408,"numMessagesInTopic":0,"msgSnippet":"Hello Susan; First, I want you to know that I understand and identify with your anxieties and fears. I see you as a loving, caring parent who wants the best","messageBody":"<div id=\"ygrps-yiv-326922663\">Hello Susan;<br/>\nFirst, I want you to know that I understand and identify with your<br/>\nanxieties and fears. I see you as a loving, caring parent who wants<br/>\nthe best for her children. We all want our children to experience<br/>\nsuccess, to be accepted by everyone they meet, to be seen as valuable<br/>\nnot only in their own families, but in the eyes of the rest of the<br/>\nworld as well. I am a home schooling mother who is taking the first<br/>\ntentative steps into unschooling, mostly because I have been<br/>\nstruggling with the same thing you have: encountering resistence from<br/>\nmy 8-year-old son. In his case, it is the pencil-and-paper learning he<br/>\nobjects to, not reading, but in many respects I can identify with what<br/>\nyou are expressing. He is a strong-willed child, and I am a<br/>\nstrong-willed mom! Which both helps us to understand each other, and<br/>\ngets us butting heads with each other. I have been attracted to<br/>\nunschooling, but have been reluctant to take the leap for the same<br/>\nreasons that you express: fear of my children not developing important<br/>\nskills, falling behind, etc. But in the end, I have decided that the<br/>\nabsolute most important thing is my relationship with my son. I would<br/>\nlike to hear more about your son&#39;s interests. What really lights his<br/>\nfire? What are some of his great strengths? Where does he shine? I can<br/>\ntell you that, as a former (and recovering!) classroom teacher, I<br/>\ncould always tell the children that would do well in life, even if<br/>\nthey didn&#39;t do well in &quot;academics,&quot; because they had their own<br/>\ninterests, parents that cared about them, and a sense of themselves<br/>\nthat went beyond simply wanting to please me as a teacher. I hope you<br/>\nhave not been put off by some of the strong responses you have<br/>\nreceived. Sometimes in the zeal to promote strong beliefs, it is easy<br/>\nto forget the person behind the questions, to forget to show<br/>\nrespectful tolerance for other views and choices. I applaud your<br/>\ncourage in opening up to this circle, and I applaud your desire to<br/>\nfind better solutions for you and your son. I have found it eases my<br/>\nmind greatly to read the many success stories I find on the web, about<br/>\nchildren who were &quot;late bloomers&quot; as readers, writers, etc. And there<br/>\nare so many greats contributors to the world whose learning was very<br/>\nunorthodox and perplexing to &quot;traditional&quot; ways of learning. So, dig<br/>\nup and print up some of these stories to ease your mind when you&#39;re<br/>\nanxious. You know, the bible is full of stories of late bloomers too!<br/>\nAnd, if any one starts making comments about your son&#39;s reading, break<br/>\nin with some great stories about some of his fabulous talents,<br/>\ninterests, etc. Take heart! Your son&#39;s different path through the<br/>\nworld of reading may just be the opportunity for you to learn to let<br/>\ngo in some ways, as I am learning to do, and it&#39;s actually quite<br/>\nliberating. In the meantime, enjoy reading together, so many great<br/>\nbooks out there to choose from! Good luck, I will be thinking of you!<br/>\nTamara</div>","specialLinks":[]}],"prevTopicId":109403,"nextTopicId":109412}}