{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"5FawqAmghdA4ymzrSZ66z0JViEAInZMBZygKAqckjUvouK7khWAWgCbH__o7aGZsQSl3W4xeFW17eXroyR-1PByDBANHhA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japanese education &quot;reform&quot;?","postDate":"969879534","msgId":13378,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwOTI1MTA1OC5UQUEyNDAzMEBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13377,"nextInTime":13379,"topicId":13378,"numMessagesInTopic":0,"msgSnippet":"Hi all, Not to belabor the point, but here is some Japanese newspaper commentary on the logic (such as it were) of the Japanese government s proposed ","messageBody":"<div id=\"ygrps-yiv-1884019478\">Hi all,<br/>\n<br/>\nNot to belabor the point, but here is some Japanese newspaper commentary <br/>\non the logic (such as it were) of the Japanese government&#39;s proposed <br/>\neducational &quot;reforms,&quot; which include mandatory volunteer service for <br/>\nJapanese schoolchildren.<br/>\n<br/>\nThis biting editorial appears in today&#39;s Mainichi Daily News, having <br/>\noriginally appeared in Japanese the day before yesterday in the <br/>\nvernacular Mainichi Shimbun, a newspaper with nationwide circulation in <br/>\nJapan.<br/>\n<br/>\nRegards,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n-----------------------------<br/>\n<br/>\nMainichi Daily News - Monday, September 25, 2000<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mainichi.co.jp/english/news/opinion.html\">http://www.mainichi.co.jp/english/news/opinion.html</a><br/>\n<br/>\n<br/>\nEDUCATION REFORM (editorial)<br/>\n<br/>\n<br/>\nThe interim report submitted on Friday by the National Commission on <br/>\nEducational Reform to Prime Minister Yoshiro Mori contains suggestions in <br/>\n17 areas and covers all phases of education, from preschoolers to higher <br/>\nlearning. It proposes some bold ideas, such as the establishment of <br/>\n&quot;community schools&quot; and a much more flexible curriculum.<br/>\n<br/>\nAt the same time, there are proposals that would effectively slam the <br/>\ndoor on &quot;problem children.&quot; It is thus difficult to give a general <br/>\nappraisal of its merits and shortcomings.<br/>\n<br/>\nIt appears consistent, though, in its lack of sufficient debate. The 17 <br/>\nsuggestions seem to have been made before they were thoroughly discussed <br/>\nby the 26 commission members. The report is uneven and it is difficult to <br/>\nidentify an overriding theme.<br/>\n<br/>\nOne of its suggestions, which attracted considerable attention when it <br/>\nwas first put forward in a working group, is the requirement for students <br/>\nto do community service. The full commission&#39;s report calls on students <br/>\nto live communally for two weeks (elementary and middle school students) <br/>\nor four weeks (high school students) and perform community service.<br/>\n<br/>\nIt also recommends that all 18-year-olds be required to serve the <br/>\ncommunity for one year in such areas as farming, forest management or <br/>\ncaring for the elderly.<br/>\n<br/>\nThere is no denying that youngsters would benefit from an opportunity to <br/>\nparticipate in such activities, but &quot;community service&quot; has been only <br/>\nvaguely defined; it should obviously cover a much broader spectrum of <br/>\nactivity than simply working close to nature or looking after those <br/>\nneeding nursing care.<br/>\n<br/>\nMoreover, inasmuch as it is a &quot;service&quot; students should not be forced to <br/>\nperform it. A climate conducive to serving the community would certainly <br/>\nbe a help, but there should be greater flexibility to allow the students <br/>\nthemselves to choose what they wish to do.<br/>\n<br/>\nThe idea of having all 18-year-olds devote a year to community service, <br/>\nmoreover, is unrealistic and should be scrapped. Considering that the <br/>\nproposal would mean asking people to make a colossal commitment, the <br/>\nreasoning behind the concept is unbelievably shallow. Trying to push such <br/>\nan idea on the public would jeopardize its trust in the commission.<br/>\n<br/>\nVagueness is also found in the idea of building public &quot;community <br/>\nschools&quot; as well. Such schools are part of an effort to expand <br/>\neducational opportunities. They would be designed to be more responsive <br/>\nto local needs and enable community members themselves to run them. <br/>\nDetails as to what specific needs they will meet, at what schooling level <br/>\nclasses will be taught, and how local governments will take part, though, <br/>\nare as yet unclear.<br/>\n<br/>\nAmong the more promising suggestions in the commission&#39;s report is the <br/>\nformulation of a basic plan for school reform, such as those covering <br/>\nteacher placement, new facilities, teaching of information technology, <br/>\nacceptance of foreign students and greater opportunities for learning <br/>\noutside the classroom. Because what is needed now is not a new set of <br/>\nprinciples but a strategy to steadily implement reform measures, the <br/>\nformulation of such a basic plan would be very significant.<br/>\n<br/>\nPublic outlays for education as a share of gross national product is <br/>\nstill low compared to other industrial nations. Big changes cannot be <br/>\nexpected without sizable investments. We hope that enough funds will be <br/>\nmade available to achieve the necessary reforms.<br/>\n<br/>\n<br/>\nFrom the Mainichi Shimbun - Sept. 23, 2000<br/>\n<br/>\n <br/>\n(c) 2000 The Mainichi Newspapers Co.</div>","specialLinks":[]}],"prevTopicId":13374,"nextTopicId":13384}}