{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Shannon Nicoletta Manns","from":"&quot;Shannon Nicoletta Manns&quot; &lt;snmanns@...&gt;","replyTo":"LIST","senderId":"LgxRv_PbjfOuDa6iLiSeQ3SBIWcEFL7yVIVj0wW-GnU6hXaIMR8qCgVrvWPcKPKBR-Ga4kcFoKaotPy0BSsfqOXOdhato7cfFMBbm6a2iaYTF8YVPOlu","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Teacher","postDate":"968898325","msgId":13138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2EwMWMwMWRmNyRiM2JmZTg0MCQzZDZmOWE4ZUBmbWFubnM+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13137,"nextInTime":13139,"topicId":13138,"numMessagesInTopic":0,"msgSnippet":"I was very moved by this story. Please pass it on. Nicoletta Teacher Her name was Mrs. Thompson.  As she stood in front of her 5th grade class on the very","messageBody":"<div id=\"ygrps-yiv-938002680\">I was very moved by this story. Please pass it on.<br/>\n<br/>\nNicoletta<br/>\n<br/>\n<br/>\nTeacher <br/>\n<br/>\nHer name was Mrs. Thompson.  As she stood in front of her 5th grade<br/>\nclass on the very first day of school, she told the children a lie.<br/>\nLike most teachers, she  looked at her students and said that  she loved<br/>\nthem all the same.  But that was not possible, because there in the<br/>\nfront row, slumped in his seat, was a little boy named Teddy Stoddard.<br/>\nMrs.Thompson had watched Teddy the year before and noticed that he<br/>\ndidn&#39;t play well with the other children, that his clothes were messy<br/>\nand that he constantly needed a bath.  And Teddy could be unpleasant.<br/>\nIt got to the point where Mrs. Thompson would actually  take delight in<br/>\nmarking his papers with a broad red pen, making bold X&#39;s and then<br/>\nputting a big &quot;F&quot; at the top of his papers.<br/>\nAt the school where Mrs. Thompson taught, she was required to review<br/>\neach child&#39;s past records and she put Teddy&#39;s off until last. However,<br/>\nwhen she reviewed his file, she was in for a surprise. Teddy&#39;s first<br/>\ngrade teacher wrote, &quot;Teddy is a bright child with a ready laugh  He<br/>\ndoes his work neatly and has good manners...he is a joy to be around.&quot;<br/>\nHis second grade teacher wrote, &quot;Teddy is an excellent student, well<br/>\nliked by his classmates, but he is troubled because his mother has a<br/>\nterminal illness and life at home must be a struggle.&quot; His third grade<br/>\nteacher wrote, &quot;His mother&#39;s death had been hard on him. He tries to do<br/>\nhis best, but his father doesn&#39;t show much interest and his home life<br/>\nwill soon affect him if some steps aren&#39;t taken.&quot; Teddy&#39;s fourth grade<br/>\nteacher wrote, &quot;Teddy is withdrawn and doesn&#39;t show much interest in<br/>\nschool.  He doesn&#39;t have many friends and he sometimes sleeps in class.&quot;<br/>\n<br/>\nBy now, Mrs. Thompson realized the problem and she was ashamed of<br/>\nherself. She felt even worse when her students brought her Christmas<br/>\npresents, wrapped in beautiful ribbons and bright paper, except for<br/>\nTeddy&#39;s. His present was clumsily wrapped in the heavy, brown paper that<br/>\nhe got from a grocery bag.  Mrs. Thompson took pains to open it in the<br/>\nmiddle of the other presents.  Some of the children started to laugh<br/>\nwhen she found a rhinestone bracelet with some of the stones missing,<br/>\nand a bottle that was one quarter-full of perfume.But she stifled the<br/>\nchildren&#39;s laughter when she exclaimed how pretty the bracelet was,<br/>\nputting it on, and dabbing some of the perfume on her wrist. Teddy<br/>\nStoddard stayed after school that day just long enough to say, &quot;Mrs.<br/>\nThompson, today you smelled just like my Mother used to.&quot;<br/>\nAfter the children left she cried for at least an hour.  On that very<br/>\nday, she quit teaching reading, and writing, and arithmetic. Instead,<br/>\nshe began to teach children.  Mrs.Thompson paid particular attention to<br/>\nTeddy. As she worked with him, his mind seemed to come alive. The more<br/>\nshe encouraged him, the faster he responded.  By the end of the year,<br/>\nTeddy had become one of the smartest children in the class and, despite<br/>\nher lie that she would love all the children the same, Teddy became one<br/>\nof her &quot;teacher&#39;s pets.<br/>\nA year later, she found a note under her door, from Teddy, telling her<br/>\nthat she was still the best teacher he ever had in his whole life. Six<br/>\nyears went by before she got another note from Teddy.  He then wrote<br/>\nthat he had finished high school, third in his class, and she was still<br/>\nthe best teacher he ever had in his whole life. Four years after that,<br/>\nshe got another letter, saying that while things had been tough at<br/>\ntimes, he&#39;d stayed in school, had stuck with it, and would soon graduate<br/>\nfrom college with the highest of honors.  He assured Mrs. Thompson that<br/>\nshe was still the best and favorite teacher he ever had in his whole<br/>\nlife. Then four more years passed and yet another letter came.This time<br/>\nhe explained that after he got his bachelor&#39;s degree, he decided to go a<br/>\nlittle further.  The letter explained that she was still the best and<br/>\nfavorite teacher he ever had.  But now his name was a little longer -<br/>\nthe letter was signed, Theodore F. Stoddard, MD. The story doesn&#39;t end<br/>\nthere. You see, there was yet another letter that spring. Teddy said<br/>\nhe&#39;d met this girl and was going to be married. He explained that his<br/>\nfather had died a couple of years ago and he was wondering if Mrs.<br/>\nThompson might agree to sit in the place at the wedding that was usually<br/>\nreserved for the mother of the groom.  Of course, Mrs Thompson did.  And<br/>\nguess what? She wore that bracelet, the one with several rhinestones<br/>\nmissing. And she made sure she was wearing the perfume that Teddy<br/>\nremembered his mother wearing on their last Christmas together. They<br/>\nhugged each other, and Dr. Stoddard whispered in Mrs. Thompson&#39;s ear,<br/>\n&quot;Thank you, Mrs. Thompson for believing in me. Thank you so much for<br/>\nmaking me feel  important and showing me that I could make a<br/>\ndifference.&quot; Mrs. Thompson, with tears in her eyes, whispered back.  She<br/>\nsaid, &quot;Teddy, you have it all wrong. You were the one who taught  me<br/>\nthat I could make a difference.  I didn&#39;t know how to teach until I met<br/>\nyou.&quot;<br/>\n<br/>\nWarm someone&#39;s heart today .  .  . pass this along.<br/>\n<br/>\nPlease remember that wherever you go, and whatever you do, you will have<br/>\nthe opportunity to touch and/or change a person&#39;s outlook please try to<br/>\ndo it in a positive way. &quot;Friends are angels who lift us to our feet<br/>\nwhen our wings have trouble remembering how to fly.&quot;</div>","specialLinks":[]}],"prevTopicId":13111,"nextTopicId":13142}}