{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":21,"messages":[{"userId":92084939,"authorName":"Heidi Crane","from":"&quot;Heidi Crane&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores and resentment","postDate":"1118930458","msgId":106632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwMi1GOUNEQTMxRUE3MDUzRjg1QzU2MzY5QzBGNTBAcGh4LmdibD4=","inReplyToHeader":"PDExMTg4NzY3NDkuMTE2Mi44MDAyNi5tMjlAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":106627,"nextInTopic":0,"prevInTime":106631,"nextInTime":106633,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"Funny you should bring this up. Until the beginning of June, I had the kids on a rotating dish schedule. Three kids, so that each kid got to do dishes every","messageBody":"<div id=\"ygrps-yiv-602861675\">Funny you should bring this up. Until the beginning of June, I had the kids <br/>\non a rotating dish schedule. Three kids, so that each kid got to do dishes <br/>\nevery third day. (regardless of whose day it was, I did the dishes at least <br/>\nonce every day, simply because I would want them out of my way to do <br/>\nsomething in the itsy bitsy kitchen. which is to say, no one had to do a <br/>\nwhole entire day&#39;s worth. But they were on a schedule)<br/>\n<br/>\nHm. Funny thing. None of them ever did the dishes voluntarily for either <br/>\ntheir sibs, or me. None of them ever did other chores on their own <br/>\ninitiative, though all of them are good about pitching in when it&#39;s pick up <br/>\ntime...YOU know, when the clutter gets freaky and it&#39;s JUST TIME to pick <br/>\nup...<br/>\n<br/>\nWell, about the beginning of June I noticed, though the dishes were getting <br/>\ndone, other things like wiping off the countertops or stove top, or sweeping <br/>\nthe floor, were neglected. I never asked them to do those things, that&#39;s not <br/>\nthe point. The point is, though the dishes were getting done, the kitchen <br/>\nwasn&#39;t getting cleaned. And so, I took over &quot;the dishes&quot; entirely, and the <br/>\nkitchen got cleaned every day, and I was happy. I did tell the kids &quot;I&#39;m <br/>\ntaking over everyone&#39;s dishes. If you see other things that need doing, <br/>\nplease feel free to do them.&quot; but didn&#39;t hand out any other chores or <br/>\nschedule them for anything. And, they didn&#39;t take on any new chores! LOL <br/>\nsilly me.<br/>\n<br/>\nSo, I kept up with the kitchen, and picked up &quot;the big chunks&quot; around the <br/>\nhouse, without comment, keeping in mind the FlyLady mantra &quot;Even housework <br/>\ndone imperfectly, blesses the family.&quot; And last night, I went to bed with <br/>\ndirty dishes in the sink, a cluttered front room, and three alert, <br/>\nwide-awake kids. In fact, the 12 and the 10 year olds told me they were <br/>\ngoing to clean their rooms. I asked them to keep it as quiet as possible, <br/>\nand went to sleep.<br/>\n<br/>\nWhen I got up this morning: the dishes are done! the front room is picked <br/>\nup! and the laundry has been advanced by two loads! including folding! What <br/>\na blessing. I didn&#39;t ask anyone to do any of it, though I did point out the <br/>\ndishes to my oldest, who took her nose out of her costume mending long <br/>\nenough to say &quot;g&#39;night.&quot; All that&#39;s left for me to do is bathrooms, and <br/>\nclearing off the table, and sweep the floors. Isn&#39;t that COOL? :) Cool kids, <br/>\nmine.<br/>\n<br/>\nblessings, HeidiC<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt;Message: 2<br/>\n&gt;    Date: Wed, 15 Jun 2005 09:17:53 EDT<br/>\n&gt;    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\n&gt;Subject: Re: chores and resentment<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;In a message dated 5/19/05 7:00:34 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sandrewmama@...\">sandrewmama@...</a> writes:<br/>\n&gt;<br/>\n&gt;&lt;&lt; .  I&#39;ve noticed that I am having<br/>\n&gt;difficulty not feeling resentful at the lack of help I&#39;m getting<br/>\n&gt;around the house.  We&#39;re relatively new to this RU thing, maybe 6<br/>\n&gt;months into it.<br/>\n&gt;. . .<br/>\n&gt;I&#39;m just not sure what is a good way to handle this situation.<br/>\n&gt;Mostly, I try taking deep breaths and finding the joy in doing the<br/>\n&gt;housekeeping tasks while my kids are happily occupied with their<br/>\n&gt;interests.  &gt;&gt;<br/>\n&gt;<br/>\n&gt;Chris, how is this going?<br/>\n&gt;Any better?<br/>\n&gt;<br/>\n&gt;This was in my &quot;follow up&quot; pile, and I&#39;ve been thinking sometimes lately<br/>\n&gt;about childless friends I have (several were over last night and stirred <br/>\n&gt;this back<br/>\n&gt;up in my mind) and how they have housework too, but no kids to blame it on.<br/>\n&gt;And how some families consider it virtue to make their kids do LOTS and <br/>\n&gt;scads<br/>\n&gt;of the work the parents would have had even if they hadn&#39;t had kids.<br/>\n&gt;<br/>\n&gt;Anyone been having any new thoughts or successes or fears?<br/>\n&gt;<br/>\n&gt;Sandra </span></blockquote></div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1118926232","msgId":106627,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0LjZiNTUxMDU2LjJmZTJjZjk4QGFvbC5jb20+"},"prevInTopic":106625,"nextInTopic":106632,"prevInTime":106626,"nextInTime":106628,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/16/2005 7:23:30 AM Central Standard Time, kashultz@mac.com writes: 3.   Scooch and Clean - Basically what I have been doing lately is ","messageBody":"<div id=\"ygrps-yiv-1144152566\">In a message dated 6/16/2005 7:23:30 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kashultz@...\">kashultz@...</a> writes:<br/>\n<br/>\n3.   Scooch and Clean - Basically what I have been doing lately is <br/>\nfollowing  the baby around the house (in addition to number 2 above), <br/>\nand wherever he  cruises, scooches or crawls, that is where I sit and <br/>\nand play with him  (and whoever else tends to join, since usually one of <br/>\nthe big sisters will  join in wherever we are) and organize whatever <br/>\nstuff is in that area while  we play.  Sometimes the area ends up <br/>\nmessier than when we started,  since everyone gets interested in what <br/>\nthere is to play with, but like  someone said, that&#39;s what you clean up <br/>\nfor anyway, so that they can have  their things available to play with <br/>\nagain.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nThis is a great idea.  I&#39;ve always wondered how to describe it.   You&#39;re <br/>\nsimply being present with your children, maybe getting something done at  the same <br/>\ntime, and interacting with them as need be.  This is what I want  to tell the <br/>\npeople who have littles that fight each other all the time.   Sit down on the <br/>\nfloor where they are.  Be there next to them.  Just be  present.<br/>\n <br/>\nYour whole post was good.  Thanks.<br/>\n <br/>\nKaren<br/>\n <br/>\nwww.badchair.net<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":176439663,"authorName":"Kelly Shultz","from":"Kelly Shultz &lt;kashultz@...&gt;","profile":"shultzfamily5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1118899089","msgId":106625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3NDc0MERBLURFMjYtMTFEOS1BRUE1LTAwMEE5NTkyRjNFQUBtYWMuY29tPg==","inReplyToHeader":"PDE0OS40NzA0MmYwMC4yZmUxODQ4MUBhb2wuY29tPg=="},"prevInTopic":106610,"nextInTopic":106627,"prevInTime":106624,"nextInTime":106626,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"... This is my first post to the group, although I ve been reading enthusiastically for a while.  I feel compelled by the topic, because in our home we seem to","messageBody":"<div id=\"ygrps-yiv-2075788995\"><blockquote><span title=\"ireply\">&gt; Hello,<br/>\n<br/>\n </span></blockquote>This is my first post to the group, although I&#39;ve been reading <br/>\nenthusiastically for a while.  I feel compelled by the topic, because <br/>\nin our home we seem to be seeking a slightly elusive balance between <br/>\nrelaxed living and home comforts - some days all is harmonious, but <br/>\nthen some days when we can&#39;t find the particular fairy we are looking <br/>\nfor, or the baby&#39;s favorite bedtime book, a favorite skirt, etc, it is <br/>\nless than harmonious.  We don&#39;t have assigned chores, and with three <br/>\nkids (dd6,dd4 and ds1) all very creative and active, and two adults, it <br/>\nis a challenge sometimes to stay on top of the things that make a home <br/>\ncomfortable and livable, while still enjoying our day (and avoiding <br/>\nsome of that resentment that can pop up occasionally).<br/>\n<br/>\nWe are unschooling ourselves, though, and the miracle of unschooling is <br/>\nthat it tends to make us think about how we do EVERYTHING, and see if <br/>\nthere is a different way to approach it - wow, didn&#39;t realize we&#39;d be <br/>\ndoing that two years ago when we started this journey!!<br/>\n<br/>\nAnyway, there are a few little things that I&#39;ve been doing differently <br/>\nlately, that have helped and reduced the possible frustration factor, <br/>\nso I thought I&#39;d share in case it might help someone out there.<br/>\n<br/>\n1.  Harnessing Periods of Natural Energy - wow, this one might sound <br/>\nlike a no-brainer, but just recently I realized that I was totally <br/>\ndefeating myself.  Every day I would say &quot;Oh, I&#39;ll clean up that mess <br/>\nafter the kids are asleep for the night.&quot;  Doing everything at night <br/>\nwas a long-time habit from working out of the home for many years.  <br/>\nWell, I am naturally a morning person, and after I nurse and cuddle <br/>\neveryone to sleep at night, the cleaning rarely happens since I&#39;m <br/>\nusually asleep too.  So recently I just started to try and tackle some <br/>\nof the necessary things during the morning, a totally different <br/>\napproach, and it has worked really well - I am less likely to be trying <br/>\nto clean up when I am tired and uninterested, and it also helps because <br/>\nthe kids are generally in a pretty calm mood at that time of day too, <br/>\nso they are fine with me doing a few things.  For some folks, the <br/>\nopposite might hold true, and they might be better able to sort their <br/>\nPolly Pocket/Bionicle pieces at midnight, but using whatever time frame <br/>\nyou have more energy might help avoid the frustration factor and <br/>\ngrumbliness.<br/>\n<br/>\n2.  Following Our Path Through the House - we seem to have a meandering <br/>\npath through the house throughout the course of the day, from breakfast <br/>\ntable to tv/play area, to bathroom to bedroom for naps, and back again. <br/>\n  Recently, I decided that I would just try to do a few things as we use <br/>\neach room, so that the room would be a little bit better than when we <br/>\nstarted (not perfect mind you, just a tiny little bit better).  The <br/>\nlittle bits and pieces that I can put away in a minute here or there <br/>\nreally add up throughout the day, and again, that frustration factor <br/>\nseems reduced.  I think for me a lot of the frustration comes from a <br/>\nlack of control and a sense that the mess is too much to handle at one <br/>\ntime (especially if company is coming soon).  Chipping away at it all <br/>\nday gives a sense of progress that can be encouraging.<br/>\n<br/>\n3.  Scooch and Clean - Basically what I have been doing lately is <br/>\nfollowing the baby around the house (in addition to number 2 above), <br/>\nand wherever he cruises, scooches or crawls, that is where I sit and <br/>\nand play with him (and whoever else tends to join, since usually one of <br/>\nthe big sisters will join in wherever we are) and organize whatever <br/>\nstuff is in that area while we play.  Sometimes the area ends up <br/>\nmessier than when we started, since everyone gets interested in what <br/>\nthere is to play with, but like someone said, that&#39;s what you clean up <br/>\nfor anyway, so that they can have their things available to play with <br/>\nagain.<br/>\n<br/>\nAgain, we don&#39;t have chores, and while I will ask the girls to help <br/>\noccasionally, I feel that they absorb a lot by example; if I can manage <br/>\nour environment in a way that does not feel stressful, they will <br/>\nhopefully also learn to manage their own environment in a healthy and <br/>\nhappy way.<br/>\n<br/>\n<br/>\nKelly in Chicago (who enjoyed seeing Sandra at our conference last <br/>\nyear!)</div>","specialLinks":[]},{"userId":102372243,"authorName":"deedeanne","from":"&quot;deedeanne&quot; &lt;deedeanne@...&gt;","profile":"deedeanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores and resentment","postDate":"1118873797","msgId":106610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4cTljNSsxY2U2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyZi41ZjQ3MTZlNC4yZmUxZGUyMUBhb2wuY29tPg=="},"prevInTopic":106605,"nextInTopic":106625,"prevInTime":106609,"nextInTime":106611,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"... (house priority) has been given as another kind of justification for ... when there  are ... some women DO ... allowed to ... grow up to have ... They are ","messageBody":"<div id=\"ygrps-yiv-1728303820\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n (house priority) has been given as another kind of justification <br/>\nfor  <br/>\n&gt; school, so that the mom has time to do housework.  That&#39;s funny, <br/>\nwhen there  are <br/>\n&gt; pre-schoolers in the picture, but when kids are all schoolage, <br/>\nsome women DO  <br/>\n&gt; have a housework blitz kind of routine and then the kids aren&#39;t <br/>\nallowed to <br/>\n&gt; mess  up the mom&#39;s house.  If they do well in school, they can <br/>\ngrow up to have  <br/>\n&gt; their own houses, but that one isn&#39;t always considered theirs.  <br/>\nThey are  <br/>\n&gt; schoolkids who might or might not be in the process of getting a <br/>\nscholarship to  <br/>\n&gt; Harvard to become doctors and lawyers so they can buy a house and <br/>\nnot share it  <br/>\n&gt; generously with THEIR kids.<br/>\n&gt;  <br/>\n&gt; Sandra<br/>\n<br/>\n<br/>\nYes, my mother has even used that one on me....&quot;With the kids in <br/>\nschool, you would have more time to take care of the house and <br/>\nyourself.&quot;  I told her I would not send the kids to school just so I <br/>\ncould clean and exercise. I don&#39;t find either to be as appealing as <br/>\nbeing with my kids&lt;g&gt;, and it&#39;s just not worth it. Besides, my MIL, <br/>\nwhose house was always &quot;chaotic&quot; until the last of her 4 kids moved <br/>\nout told me that now, &quot;It&#39;s nice and clean, but it&#39;s soooo quiet. <br/>\nIt&#39;s too quiet.&quot;  <br/>\n<br/>\nAnother observation I made since moving to FL is that so many of the <br/>\nretired folks down here have WHITE everything---white cars, white <br/>\nrugs, white couches, white cabinets,etc. Over the years we&#39;ve been <br/>\nfortunate to receive alot of secondhand furnishings and such from my <br/>\nparents friends, but usually in white! Our friends comment on <br/>\nour &quot;fine&quot; furnishings and I always say, &quot;yes, but I never would <br/>\nhave picked white with  3 kids, a cat, and a dog in the house.&quot;  <br/>\nMany of the older folks down here will also look longingly at our <br/>\nkids and say things like, &quot;S/He looks just like my grandkid up <br/>\nnorth, but I haven&#39;t seen him/her since.....&quot; or &quot;My son used to <br/>\nhave hair just like that.&quot; If I get frustrated with the mess, I <br/>\nremind myself I would rather have my kids around me than white <br/>\ncabinets. I&#39;m not really eager for those &quot;white cabinet days&quot;. I <br/>\nthink these days are much more fun, at least they can be if I let <br/>\nthem.<br/>\n<br/>\nDeanne </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1118871146","msgId":106605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhhLjI4ZjhmNDZkLjJmZTFmODZhQGFvbC5jb20+"},"prevInTopic":106603,"nextInTopic":106610,"prevInTime":106604,"nextInTime":106606,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"My kids are really nice to me and pretty nice to each other.  They ll deliver food to their dad in the back or the garage if he s working, and any of them will","messageBody":"<div id=\"ygrps-yiv-1224108770\">My kids are really nice to me and pretty nice to each other.  They&#39;ll  <br/>\ndeliver food to their dad in the back or the garage if he&#39;s working, and any of  <br/>\nthem will bring dirty dishes they pass by as they move through the house.  <br/>\n <br/>\nNone of my kids cleans toilets.  I bet when they have their own places  <br/>\nthey&#39;ll clean toilets better than I do.  (That would be a pretty easy  <br/>\naccomplishment, as I don&#39;t clean toilets very regularly either, but when I do,  they&#39;re <br/>\nCLEAN and then time passes again... &lt;g&gt;)<br/>\n <br/>\nAll of my kids have volunteered or been asked to help unrelated adults do  <br/>\ndifficult things and have never once been sent away for incompetence or lack of  <br/>\nserious.  No one has ever complained about the job my kids did when they  <br/>\nhelped out with whatever it was---moving, cleaning, cutting, stacking, set-up  <br/>\nfor card tournaments, babysitting, party set-up, whatever.  <br/>\n <br/>\nKirby showed up at 11:30 last night to go to a movie with Marty and other  <br/>\nfriends, instead of the 11:00 they had told him to try to do.  That&#39;s the  <br/>\nbiggest failure of months here. &lt;g&gt;<br/>\nThe movie was at midnight.  He was half an hour early, not the hour  the <br/>\ngroup had decided on.  They were waiting for him in the theatre, so it  wasn&#39;t a <br/>\nhuge inconvenience. &lt;g&gt;<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143938653,"authorName":"K Krejci","from":"K Krejci &lt;kraekrej@...&gt;","profile":"kraekrej","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1118865597","msgId":106603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNjE1MTk1OTU3Ljc5NDI4LnFtYWlsQHdlYjU0MzAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEyZi41ZjQ3MTZlNC4yZmUxZGUyMUBhb2wuY29tPg=="},"prevInTopic":106601,"nextInTopic":106605,"prevInTime":106602,"nextInTime":106604,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"I grew up with grandparents with plastic slipcovers and a living room in our house that we were not allowed in unless accompanied by an adult.  My sister was a","messageBody":"<div id=\"ygrps-yiv-997830887\">I grew up with grandparents with plastic slipcovers<br/>\nand a living room in our house that we were not<br/>\nallowed in unless accompanied by an adult.  My sister<br/>\nwas a self-absorbed princess with whom I shared a<br/>\nroom.  I had one dresser drawer that actually held<br/>\nclothes (the rest had my collections of interesting<br/>\nstuff) and a bed that probably had one leg off the<br/>\nground from covering most of my other interesting<br/>\nstuff.  I never had chores but I was constantly<br/>\nhounded, criticized and brow-beaten to &#39;clean.&#39;<br/>\n<br/>\nYes, I was a slob.  But I would also have been more<br/>\nwilling to clean and be helpful if I hadn&#39;t been<br/>\ncontinuously bullied.  As a grown-up-type person, I<br/>\nhave had phases of Susie Homemaker-ness, including<br/>\ncleaning the INSIDE of my vacuum cleaner when I was<br/>\npregnant with my first sweet boy.  Most of the time, I<br/>\nput things away in the same places because I have a<br/>\nreally poor memory.  And I like the kitchen to be free<br/>\nof dirty dishes because gnats are annoying.<br/>\n<br/>\nOther than that, I&#39;m ok with everyone keeping their<br/>\nthings as they wish.  If it bugs me, I&#39;ll move it.  If<br/>\nit&#39;s a huge mess, I&#39;ll offer to help clean up.  But I<br/>\nknow from personal experience that sniping, badgering,<br/>\ndemanding and bossing kill any spirit of cooperation<br/>\nor pleasure in accomplishment that a kid might get out<br/>\nof doing stuff around the old homestead.<br/>\n<br/>\nAs always, your mileage may vary.<br/>\n<br/>\nKathy (whose house is clean enough to be healthy and<br/>\ndirty enough to be happy)<br/>\n<br/>\nIt&#39;s Good 2 B Dog Nutz!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.good2bdognutz.com\">http://www.good2bdognutz.com</a><br/>\n<br/>\n<br/>\n\t\t<br/>\n__________________________________ <br/>\nYahoo! Mail <br/>\nStay connected, organized, and protected. Take the tour: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tour.mail.yahoo.com/mailtour.html\">http://tour.mail.yahoo.com/mailtour.html</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1118864417","msgId":106601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZi41ZjQ3MTZlNC4yZmUxZGUyMUBhb2wuY29tPg=="},"prevInTopic":106600,"nextInTopic":106603,"prevInTime":106600,"nextInTime":106602,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/15/2005 12:30:53 PM Mountain Daylight Time, game-enthusiast@adelphia.net writes: The  people I know whose houses are their top priority,","messageBody":"<div id=\"ygrps-yiv-485536149\">In a message dated 6/15/2005 12:30:53 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> writes:<br/>\n<br/>\nThe  people I know whose houses are their top priority, over their kids, <br/>\naren&#39;t  really the kind of people I enjoy being around,  tbh.<br/>\n<br/>\n<br/>\n<br/>\nThat (house priority) has been given as another kind of justification for  <br/>\nschool, so that the mom has time to do housework.  That&#39;s funny, when there  are <br/>\npre-schoolers in the picture, but when kids are all schoolage, some women DO  <br/>\nhave a housework blitz kind of routine and then the kids aren&#39;t allowed to <br/>\nmess  up the mom&#39;s house.  If they do well in school, they can grow up to have  <br/>\ntheir own houses, but that one isn&#39;t always considered theirs.  They are  <br/>\nschoolkids who might or might not be in the process of getting a scholarship to  <br/>\nHarvard to become doctors and lawyers so they can buy a house and not share it  <br/>\ngenerously with THEIR kids.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1118864247","msgId":106600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhNS4zOTFmMDQ3ZS4yZmUxZGQ3N0Bhb2wuY29tPg=="},"prevInTopic":106598,"nextInTopic":106601,"prevInTime":106599,"nextInTime":106601,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/15/2005 12:13:06 PM Mountain Daylight Time, jjjwoolfolk@sbcglobal.net writes: (I won t  even mention the bacteria experiment that is his","messageBody":"<div id=\"ygrps-yiv-57546109\">In a message dated 6/15/2005 12:13:06 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jjjwoolfolk@...\">jjjwoolfolk@...</a> writes:<br/>\n<br/>\n(I won&#39;t  even mention the bacteria experiment that is his bathroom which <br/>\nis right  off the living room)<br/>\n<br/>\n<br/>\nWould there have been a bathroom there if you hadn&#39;t had a child?<br/>\n <br/>\n-=-But my biggest fear is that when he grows up and gets married, instead  <br/>\nof being a man who can clean up after himself like I got from my MIL, he  <br/>\nwill be a guy who thinks his job is to sit on the sofa playing video  <br/>\ngames while his wife cleans up around him.-=-<br/>\n <br/>\nSome of the laziest adults I know were made to do a LOT of chores and heavy  <br/>\nyardwork and wood hauling, etc., when they were kids.  And the one who is  THE <br/>\nmost industrious and concerned about his house and yard and car is the one  <br/>\nwe used to tease because his mom picked his laundry up and brought it back  <br/>\nfolded and put it in his drawers for him.<br/>\n <br/>\nAnyway, there&#39;s a big genetic component (discovered in studies of adult  <br/>\ntwins who were separated at birth) and so it&#39;s just like trying to make all your  <br/>\nkids be equally good at writing or math or music, to try to make them all want <br/>\n to clean up and do it well.<br/>\n <br/>\n-=-DIL hates me and never lets me see our grandkids lest I infect them with  <br/>\nthe messy gene.-=-<br/>\n <br/>\nToo late on the genes (if the kids are your son&#39;s).<br/>\n <br/>\n-=-Of course this is just silly &#39;cause Josh is a helpful and kind guy who  <br/>\nwould probably share household responsibilities.-=-<br/>\n <br/>\nMaybe the clean genes are dominant. &lt;bwg&gt;<br/>\n <br/>\nSandra<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1118860175","msgId":106598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwNTU1MTI0LjExMTg4NjAxNzUxMzguSmF2YU1haWwucm9vdEB3ZWIxLm1haWwuYWRlbHBoaWEubmV0Pg=="},"prevInTopic":106597,"nextInTopic":106600,"prevInTime":106597,"nextInTime":106599,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"We all eat in the living room regularly.  When I am headed to the kitchen for whatever reason, I always grab a glass or plate and take it with me.  It s pretty","messageBody":"<div id=\"ygrps-yiv-291968770\">We all eat in the living room regularly.  When I am headed to the kitchen for whatever reason, I always grab a glass or plate and take it with me.  It&#39;s pretty easy to keep the dishes out of the living room that way, without it feeling like extra work.  I also mention to the kids, if I notice them heading that way, that they might grab a glass and take it to the kitchen on their way.  The do it without complaint if they are on their way.  <br/>\n<br/>\nMy kids also leave a lot of their things on the floor but I&#39;ve found I can&#39;t really say to them, &quot;don&#39;t you care if it gets trashed?&quot;  becuase in reality we are all (excpet dh sometimes, but he&#39;s away on business as much as he is home) very careful of where we step and things can stay on the floor for ages and be just fine when they eventually get back to them.  (maybe with a little dust on them.)<br/>\n<br/>\nI know some people who had lots of chores as a kid whose houses are always trashed and I know other people who are anal about how clean their houses are, as were their parents.  It probably depends on how your kids see doing chores, as to how they are as an adult with the freedom to do as they choose.  <br/>\n<br/>\nMy own house is fairly cluttered sometimes, very neat for short periods, but generally clean enough to be healthy.  I didn&#39;t have regular chores as a kids, although I was expected to help out now and then when things needed to be done, like help stack wood or help with dishes when the dish washer was broken.  I enjoy a neat house but living an unschooling life and taking the time to follow my interests as well as help my kids follow theirs, doesn&#39;t leave the amount of time it would take to keep my house as neat as I would like it.  It isn&#39;t my first concern nor even my second.  The people I know whose houses are their top priority, over their kids, aren&#39;t really the kind of people I enjoy being around, tbh.</div>","specialLinks":[]},{"userId":135609248,"authorName":"Julie W","from":"Julie W &lt;jjjwoolfolk@...&gt;","profile":"juliewinar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1118858801","msgId":106597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyQjA2RTMxLjQwMzA3MDBAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDE0OS40NzA0MmYwMC4yZmUxODQ4MUBhb2wuY29tPg==","referencesHeader":"PDE0OS40NzA0MmYwMC4yZmUxODQ4MUBhb2wuY29tPg=="},"prevInTopic":106595,"nextInTopic":106598,"prevInTime":106596,"nextInTime":106598,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"... Well sure everyone has some amount of housework, but the more folks in a house the more opportunity for extra housework. The more the other folks in your","messageBody":"<div id=\"ygrps-yiv-489517588\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; This was in my &quot;follow up&quot; pile, and I&#39;ve been thinking sometimes lately<br/>\n&gt; about childless friends I have (several were over last night and <br/>\n&gt; stirred this back<br/>\n&gt; up in my mind) and how they have housework too, but no kids to blame <br/>\n&gt; it on. <br/>\n&gt;<br/>\n&gt;<br/>\n </span></blockquote>Well sure everyone has some amount of housework, but the more folks in a <br/>\nhouse the more opportunity for extra housework.<br/>\nThe more the other folks in your home think its ok to leave their socks, <br/>\nshoes, video games, light sabers, blankets, werewolf mask (yes in the <br/>\nliving room as we speak), blankets and pillows (left on the floor from <br/>\nsleeping out in the living room the night before), ravioli can, fork, <br/>\nbowl, the 4 glasses he used to drink out of the day before without <br/>\nmaking any effort to move some of the items back into their proper place <br/>\n(I won&#39;t even mention the bacteria experiment that is his bathroom which <br/>\nis right off the living room)----well I can see how one might want a <br/>\nlittle help. Then there are all the voices around you are saying that <br/>\nthey &quot;must do chores&quot; and such.<br/>\nI&#39;m way more willing now then I was a few years ago to pick up and clean <br/>\nup after Josh because in a lot of ways they are MY issues. He does the <br/>\nbathroom sometimes, but I do it more because I care more and would hate <br/>\nfor a guest to use that bathroom in its natural state. I&#39;ll move his <br/>\nstuff back to his room to deal with. If I can&#39;t walk through his room <br/>\nI&#39;ll pick up a bit---he really appreciates that and sometimes I think <br/>\nthe mess gets so big he&#39;s unable to figure out where to start 1st.<br/>\nHis father is way less forgiving and much more of a &quot;gotta do the <br/>\nchores&quot; guy.<br/>\nBut my biggest fear is that when he grows up and gets married, instead <br/>\nof being a man who can clean up after himself like I got from my MIL, he <br/>\nwill be a guy who thinks his job is to sit on the sofa playing video <br/>\ngames while his wife cleans up around him. In the end of my nightmare my <br/>\nDIL hates me and never lets me see our grandkids lest I infect them with <br/>\nthe messy gene.<br/>\nOf course this is just silly &#39;cause Josh is a helpful and kind guy who <br/>\nwould probably share household responsibilities.<br/>\n-- <br/>\n<br/>\nJulie W<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://jwoolfolk.typepad.com/theothermother/\">http://jwoolfolk.typepad.com/theothermother/</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler Waynforth","from":"&quot;Schuyler Waynforth&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores and resentment","postDate":"1118855138","msgId":106595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4cG41MitlcXMzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg0QzQ1NEEwLUMxRDMtNEMxNi05ODdCLTRGMzZFNjU0RTkxNUBtY2hzaS5jb20+"},"prevInTopic":106592,"nextInTopic":106597,"prevInTime":106594,"nextInTime":106596,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"I ve recently changed my mind about mess.  I love the stories that each pile tells about our day.  The mahjong tiles and the yu-gi-oh cards and the feathers","messageBody":"<div id=\"ygrps-yiv-796138901\">I&#39;ve recently changed my mind about mess.  I love the stories that<br/>\neach pile tells about our day.  The mahjong tiles and the yu-gi-oh<br/>\ncards and the feathers become quills with the ink bottles lined up on<br/>\nthe kitchen table talk of days of activities.  And while when I&#39;m<br/>\ncleaning up for people coming to dinner or something I may get a<br/>\nlittle testy, it isn&#39;t anywhere near as stressful as it once was<br/>\n&#39;round here.  Talking aloud about it with David (dh) seems to help him<br/>\nchange his view as well.<br/>\n<br/>\nSchuyler<br/>\n<br/>\nP.S. I also really liked Dawn (in NS) saved post at unschooling info<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info/collectedposts/collectedposts1.htm)\">http://www.unschooling.info/collectedposts/collectedposts1.htm)</a> about<br/>\nher take on housework.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Sandrewmama<br/>\n&lt;sandrewmama@m...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; It&#39;s going fine.<br/>\n&gt; <br/>\n&gt; Not much has changed except for my expectations.  I think that my  <br/>\n&gt; frustration levels cycle and lately I&#39;m pretty relaxed.  I have a bit  <br/>\n&gt; of hostess anxiety that kicks in when we&#39;re expecting company and  <br/>\n&gt; that is when I struggle the hardest to not inflict them on the kids.   <br/>\n&gt; I also start preparing for visitors earlier so that any special  <br/>\n&gt; cleaning that needs done is done calmly and not as the clock is  <br/>\n&gt; ticking loudly down to their arrival moment.<br/>\n&gt; <br/>\n&gt; I think that Joyce&#39;s message about Kathryn having had similar needs  <br/>\n&gt; as my 7 year-old Dd helped a lot too.<br/>\n&gt; <br/>\n&gt; The other night, as she sat in bed, drawing, with papers scattered  <br/>\n&gt; around her, she said for the umpteenth time, &quot;I just LOVE to draw so  <br/>\n&gt; much!&quot;  I focus on those moments of pure personality and don&#39;t let  <br/>\n&gt; the various piles of drawings and books (for something hard to draw  <br/>\n&gt; on in bed) and rolling pens, bother me in the morning.<br/>\n&gt; <br/>\n&gt; Thanks for asking.<br/>\n&gt; <br/>\n&gt; Chris<br/>\n&gt; (not in the UK ;-)<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt; On Jun 15, 2005, at 8:17 AM, SandraDodd@a... wrote:<br/>\n&gt; <br/>\n&gt; &gt; Chris, how is this going?<br/>\n&gt; &gt; Any better?<br/>\n&gt; &gt;<br/>\n&gt; &gt; This was in my &quot;follow up&quot; pile, and I&#39;ve been thinking sometimes  <br/>\n&gt; &gt; lately<br/>\n&gt; &gt; about childless friends I have (several were over last night and  <br/>\n&gt; &gt; stirred this back<br/>\n&gt; &gt; up in my mind) and how they have housework too, but no kids to  <br/>\n&gt; &gt; blame it on.<br/>\n&gt; &gt; And how some families consider it virtue to make their kids do LOTS  <br/>\n&gt; &gt; and scads<br/>\n&gt; &gt; of the work the parents would have had even if they hadn&#39;t had kids.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Anyone been having any new thoughts or successes or fears?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Sandra<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores and resentment","postDate":"1118848461","msgId":106592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4cGdrZCs5NzZjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg0QzQ1NEEwLUMxRDMtNEMxNi05ODdCLTRGMzZFNjU0RTkxNUBtY2hzaS5jb20+"},"prevInTopic":106586,"nextInTopic":106595,"prevInTime":106590,"nextInTime":106593,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"... How about a comfy lap desk for her - more space to draw on, less clutter of books scattered on the bed for hard surfaces? I know places like WalMart have","messageBody":"<div id=\"ygrps-yiv-1888177151\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Sandrewmama <br/>\n&lt;sandrewmama@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The other night, as she sat in bed, drawing, with papers &gt;scattered  <br/>\n&gt; around her, she said for the umpteenth time, &quot;I just LOVE to draw <br/>\n&gt;so  <br/>\n&gt; much!&quot;  I focus on those moments of pure personality and don&#39;t &gt;let  <br/>\n&gt; the various piles of drawings and books (for something hard to <br/>\n&gt;draw  <br/>\n&gt; on in bed) and rolling pens, bother me in the morning.<br/>\n&gt; <br/>\n&gt; Thanks for asking.<br/>\n&gt; <br/>\n&gt; Chris<br/>\n&gt; (not in the UK ;-)<br/>\n </span></blockquote>How about a comfy lap desk for her - more space to draw on, less <br/>\nclutter of books scattered on the bed for hard surfaces? I know places <br/>\nlike WalMart have the kind that is a cushion similar to a beanbag <br/>\nchair underneath and a smooth hard surface on top (often with a <br/>\nshallow border to keep things from rolling off). Several years ago DS <br/>\ngot a lap desk type thing (like a breakfast in bed tray, with legs on <br/>\neither end) that had trays on either side for writing implements and <br/>\nwhatever else and the top slid open to store paper, stickers, etc. <br/>\nThat one in particular was designed for use in travel so maybe check <br/>\nboth the bedroom accessories and the vehicle accessories areas.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1118841473","msgId":106586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OS40NzA0MmYwMC4yZmUxODQ4MUBhb2wuY29tPg=="},"prevInTopic":106079,"nextInTopic":106592,"prevInTime":106585,"nextInTime":106587,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/19/05 7:00:34 PM, sandrewmama@mchsi.com writes: ","messageBody":"<div id=\"ygrps-yiv-230913060\">In a message dated 5/19/05 7:00:34 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sandrewmama@...\">sandrewmama@...</a> writes:<br/>\n<br/>\n&lt;&lt; .  I&#39;ve noticed that I am having  <br/>\ndifficulty not feeling resentful at the lack of help I&#39;m getting  <br/>\naround the house.  We&#39;re relatively new to this RU thing, maybe 6  <br/>\nmonths into it. <br/>\n. . .<br/>\nI&#39;m just not sure what is a good way to handle this situation.   <br/>\nMostly, I try taking deep breaths and finding the joy in doing the  <br/>\nhousekeeping tasks while my kids are happily occupied with their  <br/>\ninterests.  &gt;&gt;<br/>\n<br/>\nChris, how is this going? <br/>\nAny better?<br/>\n<br/>\nThis was in my &quot;follow up&quot; pile, and I&#39;ve been thinking sometimes lately <br/>\nabout childless friends I have (several were over last night and stirred this back <br/>\nup in my mind) and how they have housework too, but no kids to blame it on.  <br/>\nAnd how some families consider it virtue to make their kids do LOTS and scads <br/>\nof the work the parents would have had even if they hadn&#39;t had kids.<br/>\n<br/>\nAnyone been having any new thoughts or successes or fears?<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1116769330","msgId":106079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMwLjI4ZWRjZjZmLjJmYzFlNjMyQGFvbC5jb20+"},"prevInTopic":106078,"nextInTopic":106586,"prevInTime":106078,"nextInTime":106080,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/21/2005 6:29:53 PM Central Standard Time, SandraDodd@aol.com writes: If  you re having fun with what you re doing, it can BE   playtime.","messageBody":"<div id=\"ygrps-yiv-514150316\">In a message dated 5/21/2005 6:29:53 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nIf  you&#39;re having fun with what you&#39;re doing, it can BE   playtime.   I do <br/>\npatterns when I put the dishes away.  I  can&#39;t  describe it, as I&#39;ve never <br/>\nthought <br/>\nof it in words before, but  I do tricks with  the silverware and my fingers, <br/>\nor <br/>\nI think patterns  with the glasses and  bowls.  I don&#39;t do it in the same <br/>\norder  every time, because the patterns  kind of randomize it.   (WEIRD--I&#39;ve <br/>\nnever <br/>\nconsidered telling anyone this,  and kinda figured  everyone did it, but I <br/>\nhave <br/>\na friend who never varies her  routines,  and I don&#39;t even HAVE routines.)<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nWhen I worked at FedEx I learned a certain way of stacking the containers  <br/>\nwith the boxes to make them as tightly packed and secure as possible.<br/>\n <br/>\nI found myself in the grocery store stacking my shopping cart the way I  <br/>\nstacked containers!  It&#39;s been a few years since I worked at FedEx, so I  don&#39;t <br/>\nremember much about the stacking techniques, but I do arrange my shopping  cart <br/>\na certain way these days, and put the stuff on the belt a certain  way.  I&#39;m a <br/>\nroutine maker, not a pattern maker.  <br/>\n <br/>\nKaren<br/>\n <br/>\nwww.badchair.net<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1116768915","msgId":106078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmZi4yMWEyNjA5LjJmYzFlNDkzQGFvbC5jb20+"},"prevInTopic":106067,"nextInTopic":106079,"prevInTime":106077,"nextInTime":106079,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/21/2005 11:06:44 PM Mountain Daylight Time, sandrewmama@mchsi.com writes: -=- But he remembers and still feels somewhat  responsible for","messageBody":"<div id=\"ygrps-yiv-194836660\">In a message dated 5/21/2005 11:06:44 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sandrewmama@...\">sandrewmama@...</a> writes:<br/>\n<br/>\n-=- But he remembers  <br/>\nand still feels somewhat  responsible for the kinds of chores that  <br/>\nused to be assigned to  him.  Sometimes when I&#39;m particularly busy  <br/>\nwith chore-like  tasks, he feels guilty, offers to help or just  <br/>\napologizes, for what  he doesn&#39;t know. He also gets on his sister&#39;s  <br/>\ncase about helping me  since she makes the  majority of the messes.-=-<br/>\n <br/>\nI&#39;m guessing you&#39;ve talked to him about this.<br/>\nHave you apologized for having made him feel more responsible than he  should <br/>\nhave to feel, and said you didn&#39;t mean to do it and you&#39;d like to avoid  it <br/>\nwith his sister?<br/>\n <br/>\nI apologize to Kirby sometimes, when I think about things I wish I&#39;d done  <br/>\ndifferently.  I&#39;m hoping if nothing else it will help him know how he  wants to <br/>\nbe with his own children.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1116718161","msgId":106067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxMy4xNDMzNTUxLjJmYzExZTUxQGFvbC5jb20+"},"prevInTopic":106043,"nextInTopic":106078,"prevInTime":106065,"nextInTime":106068,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/21/2005 4:57:58 PM Mountain Daylight Time, sandrewmama@mchsi.com writes: This is  a very good point.  I tend to do that same kind of","messageBody":"<div id=\"ygrps-yiv-801494264\">In a message dated 5/21/2005 4:57:58 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sandrewmama@...\">sandrewmama@...</a> writes:<br/>\n<br/>\nThis is  a very good point.  I tend to do that same kind of division.    <br/>\nHousework is THE enemy of playtime.  I need to work on my multi-  <br/>\ntasking skills.  Cleaning the kitchen while carrying on an  imaginary  <br/>\ncharacter conversation would probably work.  Dd&#39;s  favorite way to  <br/>\nplay is to pretend  together.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n=========================<br/>\n <br/>\nIf you&#39;re having fun with what you&#39;re doing, it can BE  playtime.   I do <br/>\npatterns when I put the dishes away.  I can&#39;t  describe it, as I&#39;ve never thought <br/>\nof it in words before, but I do tricks with  the silverware and my fingers, or <br/>\nI think patterns with the glasses and  bowls.  I don&#39;t do it in the same <br/>\norder every time, because the patterns  kind of randomize it.  (WEIRD--I&#39;ve never <br/>\nconsidered telling anyone this,  and kinda figured everyone did it, but I have <br/>\na friend who never varies her  routines, and I don&#39;t even HAVE routines.)<br/>\n <br/>\nMusic and singing help us when we have things to make or fix or put  away.<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":140144611,"authorName":"chrfath816","from":"&quot;chrfath816&quot; &lt;chrfath@...&gt;","profile":"chrfath816","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores and resentment","postDate":"1116623224","msgId":106043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2bGpobytmOW04QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI1OEFCMTFGLURFOUQtNDRGMi1CNDRFLTM5MDk5QTEwN0MyREBtY2hzaS5jb20+"},"prevInTopic":106031,"nextInTopic":106067,"prevInTime":106042,"nextInTime":106044,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"Thanks for bringing this up.  My DS has not been helping with anything basically since DD was born 2 years ago.  I thought it was because of that.  I am glad","messageBody":"<div id=\"ygrps-yiv-1956417633\">Thanks for bringing this up.  My DS has not been helping with anything <br/>\nbasically since DD was born 2 years ago.  I thought it was because of <br/>\nthat.  I am glad to see he isn&#39;t the only 7 year old who doesn&#39;t like <br/>\nto be interupted to help with housework.  I have been gladly accepting <br/>\nhis answers of &quot;no&quot; and letting him help with what ever he chooses when <br/>\nhe does.<br/>\n<br/>\nIt was nice reading everyones input.  <br/>\n<br/>\nChristi</div>","specialLinks":[]},{"userId":82098222,"authorName":"wilson family","from":"&quot;wilson family&quot; &lt;ssag@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores and resentment","postDate":"1116617371","msgId":106031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGQwMWM1NWQ3MiQ0MTYzMmE0MCQ4ZjRmNWQzZkBzdGVwaD4=","referencesHeader":"PDExMTY1ODMwMDYuMzg5LjkyNTUubTE3QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":106022,"nextInTopic":106043,"prevInTime":106030,"nextInTime":106032,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"Today I had a friend over for breakfast before she had to be at work. This meant that I had to get up at 7am about an hour before I usually do. My kids usually","messageBody":"<div id=\"ygrps-yiv-1836109155\">Today I had a friend over for breakfast before she had to be at work. This<br/>\nmeant that I had to get up at 7am about an hour before I usually do. My kids<br/>\nusually get up later still.Anyway today my daughter heard me cooking in the<br/>\nkitchen and came out and after some time passed I asked if she wanted  to<br/>\nempty the dishwasher well, she sure didn&#39;t seem to thrilled to do that. So I<br/>\njust started doing it -no problem -I didn&#39;t make her feel bad for not<br/>\nfeeling like doing that chore, but then she went on to do the kinds of<br/>\nthings that she does enjoy doing and that she knows needs to be done. She<br/>\ndid this because she knew I could use the help and that I would appreciate<br/>\nher input. She wiped down the table, found a tablecloth to cover it with,<br/>\nset the table including going out to the garden to pick a lovely bouquet of<br/>\nflowers which I would of never had time to do.<br/>\nAnyway I guess my point is that perhaps you and your kids can work out<br/>\ntogether what chores you each like to do. Sometimes my kids don&#39;t do the<br/>\nchore I originally wanted help with, but they&#39;ll do something else that<br/>\nsaves me time or work and its all appreciated. You could all get together<br/>\nand you tell your kids what  your problems  are and then open a<br/>\nbrainstorming session on what can be done to help. Often they come up with<br/>\nideas that are so out of the box and are really great. Just working on<br/>\nproblems in this fashion can be fun and bring each other closer. Often times<br/>\nI found out that they were not aware of any problem and are genuinely eager<br/>\nto help out.  Anyway, just having a casual, not blaming anyone, family<br/>\nmeeting can&#39;t hurt- give it a try.<br/>\n~Steph</div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: chores and resentment","postDate":"1116595083","msgId":106022,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2a28yYis1NzUwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJhZTQyNzNlZmZmZWFkNTdiYzU3MDdmNjM5NTg0Y2MxQGVhcnRobGluay5uZXQ+"},"prevInTopic":106019,"nextInTopic":106031,"prevInTime":106021,"nextInTime":106023,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"Ditto to what Joyce said about finding a workable organization system - even if it just means plastic bins in each room that you toss her stuff into as you go","messageBody":"<div id=\"ygrps-yiv-627452433\">Ditto to what Joyce said about finding a workable organization <br/>\nsystem - even if it just means plastic bins in each room that you <br/>\ntoss her stuff into as you go about the day (if she&#39;s moved on from <br/>\nthe) - that way all her stuff is contained and it&#39;s easier to look <br/>\nin 3 or 4 bins than to have to check floors, under couches and <br/>\ncushions, in cubby holes, etc. We&#39;ve got bins of all sorts all over <br/>\nthe place. If I walk by the couch on the way to something and spot <br/>\nSpiderman sitting on the back of the couch, with DS nowhere insight, <br/>\nI grab Spidey and pop him into the nearest suitable bin. (a) Spidey <br/>\nis safe from predation by the dogs (b) he is findable again when he <br/>\nis needed (c) the couch remains usable without risking bruised buns <br/>\nfrom sitting on action figures (a big risk for DS who, at just about <br/>\n7, still prefers au naturel to clothing much of the time). Rather <br/>\nthan having to do big cleanups, most of the time we use the &#39;drip&#39; <br/>\nmethod - pick up along the way in bits and overall things stay tidy.<br/>\n<br/>\nWith DS, too, we&#39;ve found that if we simply ask him to keep us <br/>\ncompany (which he tends to prefer anyhow - he prefers to play in <br/>\nwhatever room us grownups are in), eventually he pitches in to help. <br/>\nFor instance, we just got a new dresser for our room (hand me down <br/>\nfrom friends - free is good!) So, that initiated a major overhaul of <br/>\ndrawers and closet space (okay closet isn&#39;t completed yet, we&#39;re <br/>\ngetting there...lol). DH and I set about sorting out stuff that was <br/>\nstashed in the back of drawers and needed to (a) be thrown out - <br/>\nlike old, ripped, single socks (b) given away - like the size medium <br/>\nt shirts that I&#39;ll never wear again but are still in good shape (c) <br/>\nmoved to the other dresser - my stuff moved to the new dresser, DH&#39;s <br/>\nstuff got distributed between the two small dressers we had been <br/>\nusing. We started sorting, DS was zooming about playing. As he <br/>\nzoomed by, oneor the other of us might ask him to bring an item to <br/>\nor from one place to another in his trajectory. No problems with <br/>\nthat, just added to his game. Then he decided he would be the <br/>\nofficial delivery person bringing things to and from (the concept of <br/>\nan assembly line is a biggie for him these days). So he was taking <br/>\nitems we indicated to the trash bag, other items to the give away <br/>\nbasket, and other items to whichever location they needed to go to. <br/>\nWhen he wanted to simply play for a bit, he did. Then again, when DH <br/>\nwanted to stop for a minute to watch a bit of TV (Mythbusters was <br/>\non), he did. Same principle.</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1116580156","msgId":106019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJhZTQyNzNlZmZmZWFkNTdiYzU3MDdmNjM5NTg0Y2MxQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PEI1OEFCMTFGLURFOUQtNDRGMi1CNDRFLTM5MDk5QTEwN0MyREBtY2hzaS5jb20+","referencesHeader":"PGQ2Z2VtbCtkZGs5QGVHcm91cHMuY29tPiA8QjU4QUIxMUYtREU5RC00NEYyLUI0NEUtMzkwOTlBMTA3QzJEQG1jaHNpLmNvbT4="},"prevInTopic":106017,"nextInTopic":106022,"prevInTime":106018,"nextInTime":106020,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"... I suspect you re suspecting that the reason your 14 yo helps and your 7 yo doesn t is because the 14 yo had assigned chores and the 7 yo didn t. I think","messageBody":"<div id=\"ygrps-yiv-203265332\">On May 19, 2005, at 8:39 PM, Sandrewmama wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ds (14) is always willing and happy to help when I<br/>\n&gt; ask him to do specific jobs, which is nice.<br/>\n<br/>\n&gt; Dd (7) on the other hand, is almost always unwilling to help at<br/>\n&gt; anytime. She&#39;s never had assigned chores.<br/>\n<br/>\n </span></blockquote>I suspect you&#39;re suspecting that the reason your 14 yo helps and your 7 <br/>\nyo doesn&#39;t is because the 14 yo had assigned chores and the 7 yo <br/>\ndidn&#39;t.<br/>\n<br/>\nI think it&#39;s because 1) he&#39;s 14 and 2) it&#39;s part of his personality.<br/>\n<br/>\nMy daughter never had assigned chores. And if I asked her for help, <br/>\neven something easy like folding towels, when she was younger it was <br/>\nlike she was being asked to climb Mt. Everest. But when she was 11, she <br/>\nstarted noticing things that needed done. She&#39;d carry groceries in and <br/>\nhelp me put them away. And now at 13 she asks several times a day if <br/>\nthere&#39;s any help I need.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Laundry chores used to be shared between Ds and<br/>\n&gt; myself, pre-RU times, but now they have evolved to be almost<br/>\n&gt; exclusively mine.<br/>\n<br/>\n </span></blockquote>How about inviting her to keep you company? Have conversations. Tell <br/>\nstories. If she reads, ask if there&#39;s something she might like to read <br/>\nto you. Listen to a book on tape together.<br/>\n<br/>\nMy mother had a lot of chores when she was a kid and was determined not <br/>\nto do that to my sister and me. But what she did was divide the world <br/>\ninto adult work and children&#39;s play. She never invited us into her <br/>\nworld to help or spend time with her. And then later when we were teens <br/>\nand she resented us not helping it didn&#39;t (in the midst of my teenage <br/>\nsurliness) make sense to me. She&#39;d done it all before and now all of a <br/>\nsudden she needed help?<br/>\n<br/>\nSo invite them to help. Invite them to keep you company. Tasks are <br/>\noften more pleasant when done together.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m considering making a list for the refrigerator, a public posting<br/>\n&gt; so-to-speak.<br/>\n<br/>\n </span></blockquote>How would it feel if your husband put up one for you? Full of things <br/>\nthat you felt were his -- like mowing or paying the bills or getting a <br/>\njob -- or were not worth the time taken away from the things you <br/>\nthought were important like scrubbing the garage floor?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She is constantly asking for help finding things<br/>\n&gt; because she is one of those creative types who leaves her creations<br/>\n&gt; and treasures scattered about the house as she moves from one project<br/>\n&gt; to the next.  Along with her creations are the excess materials and<br/>\n&gt; tools she uses to make them.<br/>\n<br/>\n </span></blockquote>Yup. Sounds like Kathryn at that age :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She also scatters her clothing, shoes,<br/>\n&gt; books and anything else she picks up and moves to another spot<br/>\n&gt; throughout the day. Along with this, she also requests that I HELP<br/>\n&gt; her change clothes, brush teeth, wash face, take a bath, go to sleep<br/>\n&gt; (we cosleep), wipe her tush and many other every day tasks that the<br/>\n&gt; majority of 7-1/2 year olds are usually competent in and willing to<br/>\n&gt; do for themselves.<br/>\n<br/>\n </span></blockquote>Yup, and all that too even the bum wiping. It&#39;s just who she is.<br/>\n<br/>\nAt 13 Kathryn can do all that herself but she still likes company.<br/>\n<br/>\nIt sounds harsh but it&#39;s often helpful to think &quot;What if this were her <br/>\nlast day on Earth? What if tomorrow all this stuff that brings her joy <br/>\nwould be put away never to come out again?&quot;<br/>\n<br/>\nWhat about organizing things for her? Don&#39;t expect it to last! But look <br/>\nfor a sensible system that would make things easier for you to put <br/>\naway. Papers were the bane of my existence ;-) (I swear she must have <br/>\ngone through 2 big cartons of paper.) I put a box near where she drew <br/>\nand tossed the drawing in there when I cleaned up. All her notebooks <br/>\nshare space on the shelf with the DVDs because that&#39;s where she does <br/>\nall her drawing.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] chores and resentment","postDate":"1116565491","msgId":106017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExLjQ1OWNlZWFjLjJmYmVjOWYzQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":106019,"prevInTime":106016,"nextInTime":106018,"topicId":106017,"numMessagesInTopic":0,"msgSnippet":"I m too sleepy to write well, but will look tomorrow.  I was hoping  others would have helped you out! Just in case you haven t already followed all the trails","messageBody":"<div id=\"ygrps-yiv-1895133558\">I&#39;m too sleepy to write well, but will look tomorrow.  I was hoping  others <br/>\nwould have helped you out!<br/>\n<br/>\nJust in case you haven&#39;t already followed all the trails here, this  might <br/>\nhelp:<br/>\n <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores_\">http://sandradodd.com/chores_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores)\">http://sandradodd.com/chores)</a> <br/>\n <br/>\nOr hey, if you have read it all in the past, maybe it&#39;s time to read it  <br/>\nagain, breathing slowly, thinking lovely thoughts.<br/>\n <br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":106631,"nextTopicId":106630}}