{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Safe nests (was Re: OT: Missing Homeschooled Teenager)","postDate":"1132760166","msgId":110155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwNC5lNjMyODkwLjMwYjVlNjY2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":110154,"nextInTime":110156,"topicId":110155,"numMessagesInTopic":0,"msgSnippet":"... As I decided what to do and how with kids, I tried to see the benefits to me, too, so that I wasn t sacrificing.    I would think This will be cool! ","messageBody":"<div id=\"ygrps-yiv-1906091694\">In a message dated 11/23/05 7:43:21 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elainegh8@...\">elainegh8@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-From a personal perspective the father is using emotional blackmail in<br/>\n&gt; his letter to try and get his son back. It might work this time but<br/>\n&gt; eventually it won&#39;t.-=-<br/>\n&gt; <br/>\n </span></blockquote>As I decided what to do and how with kids, I tried to see the benefits to me, <br/>\ntoo, so that I wasn&#39;t &quot;sacrificing.&quot;    I would think &quot;This will be cool!&quot; <br/>\nand &quot;I&#39;ll be learning a lot.&quot;   <br/>\n<br/>\nMy life would have been different without children, we would have had more <br/>\nmoney, I would have gone on trips with my many other childless friends, who <br/>\nunder the circumstances kind of distanced themselves (or in some more recent cases <br/>\nI distanced myself because their attitude and comments about children in <br/>\ngeneral just grated on me).    But we WANTED to have children.   We found after <br/>\nKirby was born that we LIKED being parents, and so it was something for me and <br/>\nKeith, more than for them.   Anyone who pretends to think they did their kids a <br/>\nbig favor by bringing them to earth is showing a mean, delusional streak.   <br/>\nEarth isn&#39;t that great a place, and being alive can be pretty painful and <br/>\nirritating.    I haven&#39;t heard it lately by anyone being serious, but when I was <br/>\nyounger I did hear people saying things like &quot;We gave you life,&quot; and &quot;Your <br/>\nmother risked her life to have you&quot; and &quot;You owe us&quot; and &quot;We&#39;ve done you a big <br/>\nfavor&quot; and other &quot;We are generous and you are insignificant&quot; messages.<br/>\n<br/>\nHaving those in mind has helped me as I&#39;ve tried to keep a better perspective <br/>\nthan that.   I keep them in a collection in my mind as things not to use.   <br/>\nSometimes when one of my kids has been unhappy from treatment by another friend <br/>\nor a sibling, when they were younger, I&#39;ve apologized and said something like <br/>\nthat I knew there were moments like this in life, and I&#39;m sorry that they&#39;re <br/>\nexperiencing that just because I wanted to have kids.   And I&#39;d say I hoped <br/>\nthey didn&#39;t have too many more really bad moments.<br/>\n<br/>\n-=-I&#39;ve had this kind of thing from my mother most of my life. Not as<br/>\novertly as the dad has done, it was much more subtle, but it doesn&#39;t<br/>\nmake you feel loved it just makes you feel permanently disapproved of.<br/>\nBoth me and my brother had left home by the age of 18.-=-<br/>\n<br/>\nThe letter made it pretty clear that the mom&#39;s pain was the son&#39;s fault.   <br/>\nSomething was his fault before he left, and things are his fault now.   He&#39;s a <br/>\nfaulty guy, one way or another. He has surely screwed up those people&#39;s lives, <br/>\npoor parents.   How could he have come to earth against their will and then <br/>\nnot served them on their terms?   (That was sarcasm.)    The letter didn&#39;t say <br/>\n&quot;You were right&quot; about anything, or &quot;If you come back things will be <br/>\ndifferent,&quot; or &quot;We&#39;ll be in New York reclaiming our careers, but if you want a plane <br/>\nticket to see us we&#39;ll gladly pay for it.&quot;<br/>\n<br/>\nBut I&#39;m thinking like an unschooler.   It&#39;s not fair to overlay my attitudes <br/>\ntoward respecting children and being partners with them.   I have to credit La <br/>\nLeche League (again).   All around me parents DO act as though children are <br/>\nalien burdens who weren&#39;t expected or wanted and couldn&#39;t possibly be loved and <br/>\nappreciated.   All over the place parents are complaining to their friends <br/>\nabout how awful it is to be a parent, but *THEY MADE IT HARD.*   They sabotaged <br/>\nany possible joy and hope, and then they martyr themselves about it.   What <br/>\nabout the child?   What about his feelings, and joy and hope?<br/>\n<br/>\nAt my house that&#39;s not a problem.   When they&#39;re joyous I am too.   When <br/>\nthey&#39;re hopeful and creative and energetic, we all get to share that.   When they <br/>\nhave a hard moment, others are not going to say &quot;That&#39;s what you get,&quot; we&#39;re <br/>\ngoing to comfort and sympathize, and when the time is right, we&#39;ll help them <br/>\nrecover and repair.<br/>\n<br/>\nThe other night my kids had &quot;a fight&quot; (in Marty&#39;s words) after the parents <br/>\nwere asleep.   I wrote about it elsewhere, but have the followup now.   I&#39;ll <br/>\npost it separately.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":110150,"nextTopicId":110157}}