{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Age appropriate limits?","postDate":"1339615847","msgId":67646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5Q0I3RTFCLTM3RkUtNEYxNi1CMjIwLTkzMzFDNTExMUFCMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpyYWNtZStyYm01QGVHcm91cHMuY29tPg==","referencesHeader":"PGpyYWNtZStyYm01QGVHcm91cHMuY29tPg=="},"prevInTopic":67639,"nextInTopic":0,"prevInTime":67645,"nextInTime":67647,"topicId":67636,"numMessagesInTopic":0,"msgSnippet":"-=-I am really letting go setting limits with my children and say Yes 99% of time. My daughter who is 11 years old is able to set many limits for herself.","messageBody":"<div id=\"ygrps-yiv-982455831\">-=-I am really letting go setting limits with my children and say &quot;Yes&quot; 99% of time. My daughter who is 11 years old is able to set many limits for herself. She understands that if she eats &quot;lots&quot; of sweets she is likely to feel sick, get a headache and feel agitated all day. She will turn off the computer when she feels tired, &quot;Saying I&#39;ve had enough of watching the computer&quot;. -=-<br/>\n<br/>\nIf you&#39;re measuring when you say yes or no, instead of deciding carefully, mindfully, each time, it&#39;s not good.  <br/>\n<br/>\nYour daughter should not be setting limits for herself.  She should be, with your thoughtful assistance, be making decisions based on real reasons, particular to the day and time.<br/>\n<br/>\n&quot;Lots&quot;?  Putting it in quotes meant something to you, but it comes across as odd.<br/>\n<br/>\nDoes she understand that because it has happened, or because you told her it will happen?  I have never known anyone to &quot;feel agitated all day&quot; about anything except stress, fear or guilt.  If she eats sweets, is she agitated because she knows you wish she hadn&#39;t?  Or that you might think she ha not set a good limit for herself?<br/>\n<br/>\nDo you call computer use &quot;watching the computer&quot;?  <br/>\n<br/>\nWhy would she say &quot;I&#39;ve had enough of watching the computer&quot; instead of &quot;I&#39;m tired&quot;?<br/>\n<br/>\nWhen you choose words, choose them thoughtfully, considering what you&#39;re thinking, what you&#39;re expressing, who is reading, and what the sharing is good for.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Age appropriate limits?","postDate":"1339607949","msgId":67639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyYWkyZCtnOGhzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyYWNtZStyYm01QGVHcm91cHMuY29tPg=="},"prevInTopic":67638,"nextInTopic":67646,"prevInTime":67638,"nextInTime":67640,"topicId":67636,"numMessagesInTopic":0,"msgSnippet":"... ***************** First of all, avoid thinking of no limits as a kind of rule - in fact, it can help to reframe your thinking and take away words like","messageBody":"<div id=\"ygrps-yiv-533444278\">&quot;louise.king76&quot; &lt;louise.j.king@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am not sure I fully understand the concept of not setting limits with young children and would be grateful for any thoughts.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nFirst of all, avoid thinking of &quot;no limits&quot; as a kind of rule - in fact, it can help to reframe your thinking and take away words like &quot;limits&quot; entirely and think in terms of helping your child get what he wants and needs both in the moment and over the longer term. <br/>\n<br/>\nAmong other things, he wants to make choices - and learning to make thoughtful choices takes some experience, including some less-than-perfect outcomes. Set him up to learn from experience, but gently, kindly. Help him out so his mistakes are useful to him, not cruel. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;ve noticed my 5 year son does not have this discernment or maturity of thinking yet and how can I expect him too when he is so little and lives so much in the present moment.<br/>\n </span></blockquote>*************<br/>\n<br/>\nThere are several problems mixed together, here. One is that your son is young and it&#39;s true he lacks a broader perspective - but the other is that you have some predetermined ideas of what &quot;right choices&quot; look like and it&#39;s impeding your ability to help him. You know what you want him to choose and that&#39;s a problem. The other problem is you&#39;re combining problems and needs and need to tease those apart a bit so that single decisions don&#39;t affect so many other things. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; BUT now he wants it in bed with him at night and he stays up to 10.00pm playing on it.  Again, he gets, agitated and can&#39;t sleep after this, so I have had to set limits on game playing.<br/>\n </span></blockquote>****************<br/>\n<br/>\nThis is an example of two issues rolled together. He wants to play a lot of games. That&#39;s to be expected if he&#39;s had limits on games - limits make things more interesting and valuable! And he needs to do restful things at night to &quot;wind down&quot; and get to sleep. Help him find more ways to play games during the day And help him find restful things to do in the evening. Do you have a night time routine where you help him settle in to sleep? Maybe you read something about &quot;no bedtimes&quot; and ditched that - woops! Instead of worrying about limits, think about the fact that he needs rest and sleep and help him do those things kindly. What sorts of things help him settle down? Stories? Baths? Some movies can be calming, too. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He see the sweets and thinks,  &quot;Yummy, i want those now&quot; and he eats until he is sick and often has a restless sleep of bad dreams from eating so much sugar. <br/>\n </span></blockquote>***************<br/>\n<br/>\nMost of that is a reaction to having had limits in the past - he doesn&#39;t know when he&#39;s going to get the wonderful thing again so he&#39;ll take it all now and to heck with the consequences. Being sick and cranky is worth it to him. This is why young adults tend to make all sorts of wild decisions - they&#39;ve had so many years of &quot;no&quot; that possible consequences are irrelevant compared to finally getting what they want. <br/>\n<br/>\nHave sweets and other foods available. Offer him things to eat before he&#39;s over-the-top hungry. Offer him plenty of milk and sweets with nuts in them, so he&#39;s getting a bit of both - the sweet and the protein. Make sure you have nutritious foods which are attractive and convenient and tasty to kids - if the choices are &quot;wait half an hour and I&#39;ll make you something you&#39;ll don&#39;t like very much&quot; and &quot;eat this attractive, convenient, sweet now&quot; it&#39;s a no-brainer what he&#39;s going to pick. Don&#39;t expect kids to want to eat what adults eat, necessarily, especially a 5yo - expect him to want light, sweet, fine textured foods and have lots of those on hand. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Also, when we are out on day trips or shopping it&#39;s becoming really difficult because my son wants a new toy every time.<br/>\n </span></blockquote>****************<br/>\n<br/>\nOften it&#39;s helpful to give a child a specific budget or allowance so he doesn&#39;t have to ask every time. But again, it can help to step away from the idea of &quot;limits&quot; and think in terms of what kids want and need. Part of all that asking is that finances can seem really vague to kids - adults make spending decisions based on some very fuzzy criteria! So that sets kids up to ask and ask and ask, trying to figure out what&#39;s going on. They&#39;re trying to learn about finances, buying and spending, and adults make it too convoluted. Stating a specific dollar amount can help - sometimes a specific amount per store, but it depends on the child. Some kids like to have lots of information about income and expenses, too - my stepson likes to know the nitty gritty details of how much money comes in and where it all goes, but my daughter doesn&#39;t want any of that, she just wants to know how much she has to spend. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I can explain this to my daughter and she get it but son doesn&#39;t and will have a full blown &quot;fit&quot; whenever we are, hitting and screaming at us.<br/>\n </span></blockquote>***************<br/>\n<br/>\nI&#39;m willing to be there are other problems mixed in, too, problems like boredom and hunger. Make sure you have lots of snacks and also fun things for your guy to do. Just because one of your kids is easy-going, doesn&#39;t mean they both will be, even if they were the same age. Personality matters. So make sure running errands isn&#39;t a tedious chore for your guy. Bring things to help him pass the time and brings snacks. Bring snacks for yourself, too! And be sure you&#39;re not rushing him through shops! Sometimes kids will clamor to buy something because they haven&#39;t really had &quot;enough&quot; of shopping, and bringing something home lets them have it longer. Make sure your guy has lots of time to look his fill. <br/>\n<br/>\nIt can also help not to jump right to &quot;no, because&quot; and instead take the time to talk to your child. What&#39;s interesting about that thing? What does it make him think of? What might he do with it? Those sorts of questions don&#39;t necessarily lead to buying - think of how you&#39;d look at a frog or a sunset with someone.  You wouldn&#39;t jump right to &quot;well the suns going to go down so don&#39;t bother looking&quot; - take time to touch base with the wonder and fascination a young child has over the simplest, most banal of things. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My husband and I are very close and cherish our evenings spent together, so our son staying up with us until midnight as he wants, would put a serious strain of our marriage.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nYour kids aren&#39;t going to stay little and go to bed early forever, you know - so when were you planning on ending your marriage? That&#39;s a silly question, it&#39;s meant to be silly. You hadn&#39;t thought past &quot;this works right now&quot;. That&#39;s normal, but it&#39;s a Terrible strategy when you have children because kids change as they grow. At some point, your kids are going to be up later and you&#39;ll need to find other ways to get your marital needs met. It won&#39;t hurt to look for more ways to meet those needs Now, regardless of when your kids go to sleep. <br/>\n<br/>\n&quot;Marital needs&quot; are another good examples of rolling a bunch of issues up with one solution - there&#39;s more than one need being met by &quot;evening adult time&quot; so think about all those needs and how to meet them separately. Find ways to have conversations during the day - around the kids, over the phone or email, in little bits and pieces here and there. Touch each other outside the bedroom - again, that may sound silly, but if you&#39;re saving up all the cuddling for that hour and a half before sleep, that&#39;s a poor strategy as your kids get older. Spread out the contact. Hold hands or play footsie while playing a game or reading to the kids. Cop a quick feel passing each other in the kitchen or hallway. Lock yourselves in the bathroom for ten minutes. Get up in the middle of the night (surprise him, men often like that). <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Age appropriate limits?","postDate":"1339607804","msgId":67638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1OEY2OTE0LUM5RUYtNDFCNy04QjJGLTQ4M0Q0MEFGRDRGOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpyYWNtZStyYm01QGVHcm91cHMuY29tPg==","referencesHeader":"PGpyYWNtZStyYm01QGVHcm91cHMuY29tPg=="},"prevInTopic":67636,"nextInTopic":67639,"prevInTime":67637,"nextInTime":67639,"topicId":67636,"numMessagesInTopic":0,"msgSnippet":"... Making the right decisions shouldn t be the goal. Making thoughtful decisions is what he needs supported. Not making *your* thoughtful decision, but making","messageBody":"<div id=\"ygrps-yiv-820306776\">On Jun 13, 2012, at 11:47 AM, louise.king76 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; BUT, I&#39;ve noticed my 5 year son does not have this discernment<br/>\n&gt; or maturity of thinking yet and how can I expect him too when he is so little <br/>\n<br/>\n </span></blockquote>Making the right decisions shouldn&#39;t be the goal. Making thoughtful decisions is what he needs supported. Not making *your* thoughtful decision, but making a decision with information. He won&#39;t be perfect at it. Right now some of the information will be more important to him than it is to you. Partly because he&#39;s 5. Partly because it&#39;s still new enough that the downsides aren&#39;t bad enough to be annoying. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Again, he gets, agitated and can&#39;t sleep after this, so I have had to set limits on game playing.<br/>\n<br/>\n<br/>\n </span></blockquote>For now it might be because he doesn&#39;t trust you. He sees you as someone who meets his needs when it&#39;s convenient and sometimes puts her own agenda ahead of his. So when you give him information, he hears &quot;No,&quot; instead of something that&#39;s supposed to help him see the situation better.<br/>\n<br/>\n It could be because he&#39;s 5. It&#39;s hard to tell from what you&#39;ve written. There might be several things behind it all. Finding a way to prepare the night as a way to ease into sleep, then this might disappear.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He see the sweets and thinks, &quot;Yummy, i want those now&quot; and he eats <br/>\n&gt; until he is sick and often has a restless sleep of bad dreams from eating so much sugar. <br/>\n<br/>\n </span></blockquote>Which is exactly what happens when anything really liked is limited. When it appears, it&#39;s time to get as much as you can grab before they disappear again.<br/>\n<br/>\nAlso, as a 5 yo he needs more sweets and fats than an adult. Probably more than what you&#39;d choose for him.<br/>\n<br/>\nWhat can help is making a wide variety of foods, including sweet things, easy for him to grab. Create a world of food around him that is healthy then add to it what he asks for.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; His brain is not developed enough in it&#39;s thinking to make an informed choice. <br/>\n<br/>\n </span></blockquote>Sure it is. He&#39;s just not coming to the same conclusion you are. He&#39;s a different person. He (perhaps) is living in a home where access to what he wants is random and not in his control so he&#39;s making decisions based on that, not on the world you live in where you can have whatever you want within normal life restrictions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, when we are out on day trips or shopping it&#39;s<br/>\n&gt; becoming really difficult because my son wants a new toy every time.<br/>\n<br/>\n<br/>\n </span></blockquote>Take him shopping or to places to buy things less. Take him to thrift stores and yard sales. Rotate toys so everything isn&#39;t out at all times. That way he can have &quot;new&quot; things appear occasionally. Put things he really wants on a list and save up for them. (It&#39;s okay if this gets really long.)<br/>\n<br/>\nDon&#39;t think in terms of changing him. Think in terms of creating a more peaceful nest for him to be who he is in.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; so there does have to limits on spending in our family otherwise we would lose home<br/>\n<br/>\n<br/>\n </span></blockquote>Real life does have limits. But it will help him understand it better if it&#39;s used as information rather than reasons to say no. &quot;No, we only have $10,&quot; is a barrier you&#39;ve dropped between him and what he wants. It&#39;s natural for him to want to get around it. &quot;We only have $10,&quot; is information and a place to begin problem solving. Draw him into the process rather than turning him into the problem. Don&#39;t focus on moving him to your right decision. Talk about possibilities. Like finding together something cheaper for dinner. Putting it on a list to save up for. Finding a cheaper toy. And so on. It takes more time now, but saves stress and time in the future.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My daughter is happy to go to bed at the same time as her<br/>\n&gt; brother and loves doing lots of projects in her room uninterrupted by us. <br/>\n<br/>\n </span></blockquote>Your son is not your daughter. It will help hugely not to compare them. Especially if he or she is coming up as a defective version of the other.<br/>\n<br/>\nIt could be your son is more of an extrovert. He needs people. Being away from people is his version of hell. Or it&#39;s because he&#39;s 5 and he needs his parents. If his bucket isn&#39;t full, he&#39;ll keep asking and asking and asking so it seems like he needs more than he really does.<br/>\n<br/>\nYou can&#39;t make him be other than who he is. He has very little power in the world to meet his needs. You and your husband are adults and have a lot more power to manipulate your lives to meet your needs.<br/>\n<br/>\nMaybe start early and give him lots of one on one attention, and a wind down routine. Read to him (and your daughter if she wants). Give him what he needs and he&#39;ll pull at you less to meet his needs.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; loves doing lots of projects in her room uninterrupted by us. <br/>\n<br/>\n<br/>\n </span></blockquote>Does she? Or does she just not complain? Parents often assume kids like what they aren&#39;t complaining about. But if kids learn that complaining gets them nothing, if kids are needful of acceptance, then it can appear they like what they&#39;re doing, when really they&#39;re looking for ways to be appreciated and accepted.<br/>\n<br/>\nIt&#39;s worth asking her. IT&#39;s worth examining how you react to her telling you things you don&#39;t want to hear. It&#39;s worth examining how you react to what you do want to hear. Such as if she says she&#39;s happy to play in her room and you say &quot;Good!&quot; from her point of view if she&#39;d said &quot;No,&quot; that means it would be bad.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also need time to write and paint in the evenings which I do alone.<br/>\n<br/>\n </span></blockquote>Actually you don&#39;t need to. You want to. And you choose to.<br/>\n<br/>\nThe more you can shift to meeting those needs through your children, or finding times that don&#39;t take from your kids or husband, the more peaceful you&#39;ll find life is.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; SO, have I mis-understood no setting limits thing?....bet I have!<br/>\n<br/>\n </span></blockquote>Yes, it&#39;s a totally different mind set. It&#39;s not about mom imposing limits. It&#39;s about helping kids meet their needs within the limits of life. Put the needs first and the limits as part of what you have to work with. Then use your values, greater knowledge of the world, greater ability to think of alternatives to find a way to meet the need. Be someone he sees as one who wants to help him rather than one who wants to point out roadblocks and why he needs to stop.<br/>\n<br/>\nJoye<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":529985200,"authorName":"louise.king76","from":"&quot;louise.king76&quot; &lt;louise.j.king@...&gt;","profile":"louise.king76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Age appropriate limits?","postDate":"1339602446","msgId":67636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyYWNtZStyYm01QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67638,"prevInTime":67635,"nextInTime":67637,"topicId":67636,"numMessagesInTopic":0,"msgSnippet":"I am not sure I fully understand the concept of not setting limits with young children and would be grateful for any thoughts. I am really letting go setting","messageBody":"<div id=\"ygrps-yiv-1449451073\">I am not sure I fully understand the concept of not setting limits with young children and would be grateful for any thoughts.<br/>\n<br/>\nI am really letting go setting limits with my children and say &quot;Yes&quot; 99% of time.  My daughter who is 11 years old is able to set many limits for herself.  She understands that if she eats &quot;lots&quot; of sweets she is likely to feel sick, get a headache and feel agitated all day.  She will turn off the computer when she feels tired, &quot;Saying I&#39;ve had enough of watching the computer&quot;.   <br/>\n<br/>\nBUT, I&#39;ve noticed my 5 year son does not have this discernment or maturity of thinking yet and how can I expect him too when he is so little and lives so much in the present moment.  He see the sweets and thinks,  &quot;Yummy, i want those now&quot; and he eats until he is sick and often has a restless sleep of bad dreams from eating so much sugar.   His brain is not developed enough in it&#39;s thinking to make an informed choice.   <br/>\n<br/>\nI say &quot;Yes&quot; every time he asks if he can play on the iPad, he only asks because sometimes the battery is low and needs charging.   He also watches films whenever he wants too. BUT now he wants it in bed with him at night and he stays up to 10.00pm playing on it.  Again, he gets, agitated and can&#39;t sleep after this, so I have had to set limits on game playing.<br/>\n<br/>\nAlso, when we are out on day trips or shopping it&#39;s becoming really difficult because my son wants a new toy every time.   I do buy them lots of the things they want as I really believe in supporting their interests but there has to be a limit.  We don&#39;t have a big income and are in a lot of debt already from my husband&#39;s failed business and rely on State Benefits,  so there does have to limits on spending in our family otherwise we would lose home.  I can explain this to my daughter and she get it but son doesn&#39;t and will have a full blown &quot;fit&quot; whenever we are, hitting and screaming at us.<br/>\n<br/>\nAnd, just one more thing,, sorry if it&#39;s a lot to put in one post.  <br/>\nMy son does not want to go to bed but wants to stay up with me and his dad.  My husband and I are very close and cherish our evenings spent together, so our son staying up with us until midnight as he wants, would put a serious strain of our marriage.  I also need time to write and paint in the evenings which I do alone.<br/>\nWe tell our son, he doesn&#39;t have to go to sleep, he has LOTS of toys in his room and he will play for a few hours but then later about 9.30, wants to come down stairs and be with us.<br/>\nMy daughter is happy to go to bed at the same time as her brother and loves doing lots of projects in her room uninterrupted by us.  She goes to sleep when she is tired.<br/>\n<br/>\nSO, have I mis-understood no setting limits thing?....bet I have!<br/>\n<br/>\nLouise</div>","specialLinks":[]}],"prevTopicId":67624,"nextTopicId":67548}}