{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Everyone needs a friend like mine","postDate":"1016859018","msgId":33485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAyMDMyMjIwNDkzNS4wMmM1ZDUzMEBsb2NhbGhvc3Q+","inReplyToHeader":"PFBMRUdLTkNDQ0FGQkxKQUxBUEpCSUVNS0NCQUEucHVkZGxlc0B0cmlhZC5yci5jb20+"},"prevInTopic":33458,"nextInTopic":33497,"prevInTime":33484,"nextInTime":33486,"topicId":33458,"numMessagesInTopic":0,"msgSnippet":"This is beautiful, Sarah.  Thanks.  And thank your friend. Tia ... No one can make you feel inferior without your consent. Eleanor Roosevelt ","messageBody":"<div id=\"ygrps-yiv-359454124\">This is beautiful, Sarah.  Thanks.  And thank your friend.<br/>\nTia<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; &gt; By Alan Cohen<br/>\n&gt; &gt; &gt; author of &quot;Living from the Heart.&quot;<br/>\n<br/>\n </span></blockquote>No one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":77610158,"authorName":"Bonni Sollars","from":"Bonni Sollars &lt;BSOLLARS@...&gt;","profile":"truuluvv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Everyone needs a friend like mine","postDate":"1016856766","msgId":33497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMzIyLjIzNDE1My4tMTkyNzc5LjE3LmJzb2xsYXJzQGp1bm8uY29tPg=="},"prevInTopic":33485,"nextInTopic":0,"prevInTime":33496,"nextInTime":33498,"topicId":33458,"numMessagesInTopic":0,"msgSnippet":"Sarah,  I believe I have heard my song, at least the music.  It is strange.  Whenever I am feeling stressed or am super-busy, in the middle of it I will start","messageBody":"<div id=\"ygrps-yiv-1882053628\">Sarah,  I believe I have heard my song, at least the music.  It is<br/>\nstrange.  Whenever I am feeling stressed or am super-busy, in the middle<br/>\nof it I will start humming a song to myself.  It has no words, but I can<br/>\nhear musical instruments playing it.  It gives me peace and harmony and<br/>\njoy.  I can never think of it on purpose, though.  It just comes to me<br/>\nwhen I need it.  I&#39;ve never heard it on the radio or in choirs or<br/>\nsymphonies.  It is the most soothing, beautiful song I&#39;ve ever heard.  It<br/>\nis uniquely mine from God.  Someday I might capture it on tape, if it<br/>\ncomes to me when a tape recorder is near.<br/>\nWhat a wonderful friend!  My best friend is LeeAnn.  We seem to have been<br/>\nborn to be friends.  Even when we get out of touch for a while, when we<br/>\nget back together, it&#39;s like we are twins or something.  We find out the<br/>\nother one has had the same types of problems at the same time.  One time<br/>\nwhen we lived in separate states, my kids got seed ticks at the same time<br/>\nher kids got head lice.  We were both dealing with heebeejeebees over it.<br/>\n Then we called eachother and found out about the other one.  We get<br/>\nsick/healthy at the same time, have marital problems/blessings at the<br/>\nsame time, trouble/blessings with our kids at the same time, go through<br/>\nthe same emotions-positive and negative- at the same time, have money<br/>\nproblems/blessings at the same time.  But it&#39;s not just the experiences,<br/>\nit is the similarity in feelings and beliefs and conclusions that we come<br/>\nto as a result of the experiences that makes it special.  It is like we<br/>\nare always on the same wavelength or something.  Recently, we have moved<br/>\naway from eachother socially, since our kids aren&#39;t little anymore and<br/>\nshe is working and I am busy.  And we are both making other close<br/>\nfriendships at the same time, too.  Even so, it seems like we are closer<br/>\nthan ever.  We meet once a week and support one another as best we can,<br/>\nwhether by helping with housecleaning or giving a shoulder to cry on or<br/>\njust encouraging words.  When I was growing up, my sisters and I were<br/>\nseparated by divorce.  I was alone a lot, and felt an outsider a lot. <br/>\nWhen my friend was growing up, she was separated from her brothers and<br/>\nwas alone alot and felt an outsider a lot.  How good of God to give me a<br/>\n&quot;sister&quot; now that I am grown and my own sisters live so far away.<br/>\nBonni</div>","specialLinks":[]},{"userId":59497572,"authorName":"TheQueen","from":"&quot;TheQueen&quot; &lt;puddles@...&gt;","profile":"sarahjocarothers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Everyone needs a friend like mine","postDate":"1016848812","msgId":33458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBMRUdLTkNDQ0FGQkxKQUxBUEpCSUVNS0NCQUEucHVkZGxlc0B0cmlhZC5yci5jb20+"},"prevInTopic":0,"nextInTopic":33485,"prevInTime":33457,"nextInTime":33459,"topicId":33458,"numMessagesInTopic":0,"msgSnippet":"Some of you may recall that I responded to a question about personality and structure. I said I was going to ask my friend (a brillant person, I might add)","messageBody":"<div id=\"ygrps-yiv-1848185534\">Some of you may recall that I responded to a question about personality and<br/>\nstructure. I said I was going to ask my friend (a brillant person, I might<br/>\nadd) about this since she knows so much about personalities.  She,<br/>\napparently, knows enough about *me* to read between the lines of my post to<br/>\nher. Enough to know that I needed my friend to form a circle around me<br/>\nand sing my song. (Thank you, SarahA.). I thought some of the other ladies<br/>\non this list  might want to consider trying to hear their own songs as well.<br/>\n(ps Thanks, Sarah. I love you!)<br/>\nHer post:<br/>\n&lt;&gt; They&#39;re Playing Your Song<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n&gt; &gt; By Alan Cohen<br/>\n&gt; &gt; author of &quot;Living from the Heart.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; When a woman in a certain African tribe knows she is pregnant,<br/>\n&gt; &gt; she goes out into the wilderness with a few friends and together<br/>\n&gt; &gt; they pray and meditate until they hear the song of the child.<br/>\n&gt; &gt; They recognize that every soul has its own vibration that<br/>\n&gt; &gt; expresses its unique flavor and purpose. When the women<br/>\n&gt; &gt; attune to the song, they sing it out loud. Then they return<br/>\n&gt; &gt; to the tribe and teach it to everyone else.<br/>\n&gt; &gt;<br/>\n&gt; &gt; When the child is born, the community gathers and sings the<br/>\n&gt; &gt; child&#39;s song to him or her. Later, when the child enters<br/>\n&gt; &gt; education, the village gathers and chants the child&#39;s song.<br/>\n&gt; &gt; When the child passes through the initiation to adulthood,<br/>\n&gt; &gt; the people again come together and sing. At the time of<br/>\n&gt; &gt; marriage, the person hears his or her song.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Finally, when the soul is about to pass from this world, the<br/>\n&gt; &gt; family and friends gather at the person&#39;s bed, just as they<br/>\n&gt; &gt; did at their birth, and they sing the person to the next life.<br/>\n&gt; &gt;<br/>\n&gt; &gt; When I have shared this story in my lectures, a fair amount<br/>\n&gt; &gt; of people in the audience come to tears. There is something<br/>\n&gt; &gt; inside each of us that knows we have a song, and we wish<br/>\n&gt; &gt; those we love would recognize it and<br/>\n&gt; &gt; support us to sing it.<br/>\n&gt; &gt;<br/>\n&gt; &gt; In some of my seminars I ask people to verbalize to a partner<br/>\n&gt; &gt; the one phrase they wish their parents had said to them as a<br/>\n&gt; &gt; child. Then the partner lovingly whispers it in their ear. This<br/>\n&gt; &gt; exercise goes very deep, and many significant insights start<br/>\n&gt; &gt; to click. How we all long to be loved, acknowledged, and<br/>\n&gt; &gt; accepted for who we are!<br/>\n&gt; &gt;<br/>\n&gt; &gt; In the African tribe there is one other occasion upon which<br/>\n&gt; &gt; the villagers sing to the child. If at any time during his or her<br/>\n&gt; &gt; life, the person commits a crime or aberrant social act, the<br/>\n&gt; &gt; individual is called to the center of the village and the people in the<br/>\n </span></blockquote>community<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; form a circle around them. Then they sing their song to<br/>\n&gt; &gt; them.<br/>\n&gt; &gt;<br/>\n&gt; &gt; The tribe recognizes that the correction for antisocial behavior<br/>\n&gt; &gt; is not punishment; it is love and the remembrance of identity.<br/>\n&gt; &gt; When you recognize your own song, you have no desire or need<br/>\n&gt; &gt; to do anything that would hurt another.<br/>\n&gt; &gt;<br/>\n&gt; &gt; A friend is someone who knows your song and sings it to you<br/>\n&gt; &gt; when you have forgotten it. Those who love you are not fooled<br/>\n&gt; &gt; by mistakes you have made or dark images you hold about<br/>\n&gt; &gt; yourself. They remember your beauty when you feel ugly; your<br/>\n&gt; &gt; wholeness when you are broken; your innocence when you feel<br/>\n&gt; &gt; guilty; and your purpose when you are confused.<br/>\n&gt; &gt;<br/>\n&gt; &gt; One summer when I was a teenager I went to visit my cousin<br/>\n&gt; &gt; and her family in Wilmington, Delaware. One afternoon she<br/>\n&gt; &gt; took me to the community pool, where I met a man who<br/>\n&gt; &gt; changed my life. Mr. Simmons talked to me for about ten<br/>\n&gt; &gt; minutes. It wasn&#39;t what he said that affected me so deeply;<br/>\n&gt; &gt; it was how he listened to me. He asked me questions about<br/>\n&gt; &gt; my life, my feelings, and my interests.<br/>\n&gt; &gt;<br/>\n&gt; &gt; The unusual thing about Mr. Simmons was that he paid<br/>\n&gt; &gt; attention to my answers. Although I had family, friends,<br/>\n&gt; &gt; and teachers, this man was the only person in my world who<br/>\n&gt; &gt; seemed genuinely interested in what I had to say and valued<br/>\n&gt; &gt; me for who I was.<br/>\n&gt; &gt;<br/>\n&gt; &gt; After our brief conversation I never saw him again. I probably<br/>\n&gt; &gt; never will. I&#39;m sure he had no idea that he gave me the gift<br/>\n&gt; &gt; of a lifetime. Maybe he was one of those angels who show up<br/>\n&gt; &gt; for a brief mission on earth, to give someone faith, confidence,<br/>\n&gt; &gt; and hope when they most need it.<br/>\n&gt; &gt;<br/>\n&gt; &gt; If you do not give your song a voice, you will feel lost, alone,<br/>\n&gt; &gt; and confused. If you express it, you will come to life. I have<br/>\n&gt; &gt; also done a workshop exercise in which everyone in the room<br/>\n&gt; &gt; is given a piece of paper with the name of a simple song on it,<br/>\n&gt; &gt; such as &quot;Mary Had a Little Lamb&quot; or &quot;Twinkle, Twinkle, Little<br/>\n&gt; &gt; Star.&quot; In the whole group there are perhaps eight different<br/>\n&gt; &gt; songs, and a half-dozen people have the same song named<br/>\n&gt; &gt; on their paper.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Each person is then asked to mill around the room while they<br/>\n&gt; &gt; whistle or hum their song. When they find someone else<br/>\n&gt; &gt; playing the same song, they stay together until they find<br/>\n&gt; &gt; everyone who is singing that song. Thus they create small<br/>\n&gt; &gt; groups that serve as touchstones for the duration of<br/>\n&gt; &gt; the program. Life is very much like this exercise. We attract<br/>\n&gt; &gt; people on a similar wavelength so we can support each other<br/>\n&gt; &gt; to sing aloud. Sometimes we attract people who challenge us<br/>\n&gt; &gt; by telling us that we cannot or should not sing our song in<br/>\n&gt; &gt; public. Yet these people help us too, for they stimulate us<br/>\n&gt; &gt; to find greater courage to sing it.<br/>\n&gt; &gt;<br/>\n&gt; &gt; You may not have grown up in an African tribe that sings<br/>\n&gt; &gt; your song to you at crucial life transitions, but life is always<br/>\n&gt; &gt; reminding you when you are in tune with yourself and when<br/>\n&gt; &gt; you are not. When you feel good, what you are doing matches<br/>\n&gt; &gt; your song, and when you feel awful, it doesn&#39;t. In the end,<br/>\n&gt; &gt; we shall all recognize our song and sing it well. You may feel<br/>\n&gt; &gt; a little warbly at the moment, but so have all the great<br/>\n&gt; &gt; singers. Just keep singing and you&#39;ll find your way home.<br/>\n&gt; &gt;<br/>\n&gt; &gt; The Women&#39;s Spiritual Network&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Sarah Carothers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":33494,"nextTopicId":33437}}