{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"WhXeVdqArAnYaIla6LJzWm12YIEDxvGkRxtR3BWv1egUsMojlR_hl_A7u2wnkbeMcWzro4p9q_lS-KjOcvZddcxldg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: AOL6.0","postDate":"973441432","msgId":13996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZDkwMWMwNDc0ZCQ2YjE3MGFlMCQ1YjVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13995,"nextInTime":13997,"topicId":13996,"numMessagesInTopic":0,"msgSnippet":"Of interest, perhaps, to AOL users. Lynda ... know ... been ... your ... had ... Don t ... away. ... soon. ... has ... own ... anytime ... address ... any ... ","messageBody":"<div id=\"ygrps-yiv-1202288382\">Of interest, perhaps, to AOL users.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n&gt;<br/>\n&gt; To Aol 6 or Not to Aol 6 That Is The Question!<br/>\n&gt;<br/>\n&gt; Written by:  Dan Daily<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://dannysdailys.esmartguy.com/tips/dan17.html\">http://dannysdailys.esmartguy.com/tips/dan17.html</a><br/>\n&gt;<br/>\n&gt; Hi Gang<br/>\n&gt;<br/>\n&gt; Well, so many of you are asking about Aol6 it&#39;s time to give you what I<br/>\nknow<br/>\n&gt; about it.  In beta testing, we are sworn to secrecy.  But now that it&#39;s<br/>\nbeen<br/>\n&gt; released; I can comment on it, so here goes:<br/>\n&gt;<br/>\n&gt; I&#39;m sorry to have to be the bearer of bad news,  No one loves new software<br/>\n&gt; more than I.  NO ONE!<br/>\n&gt;<br/>\n&gt; Problems, Problems, Problems<br/>\n&gt;<br/>\n&gt; The main problem I&#39;ve found with AOL 6, is that it changes Windows files.<br/>\n&gt; Many people haven&#39;t had any problems with this, but many people have. (me<br/>\n&gt; included) If you&#39;re one of the unlucky ones, you&#39;re looking at a complete<br/>\n&gt; Windows install at least.  At most; you&#39;re looking at a complete wipe of<br/>\nyour<br/>\n&gt; drive.  So if you&#39;re not prepared to do this, don&#39;t download AOL6.  I&#39;ve<br/>\nhad<br/>\n&gt; to reinstall Windows three times so far.  I really have to do a complete<br/>\n&gt; wipe.  It has screwed up my system beyond repair.  It can be that bad,<br/>\n&gt; REALLY!  If you&#39;ve already downloaded it, and are having no problems.<br/>\nDon&#39;t<br/>\n&gt; worry about it.  If Aol6 is gonna give you problems, it does it right<br/>\naway.<br/>\n&gt;<br/>\n&gt; It&#39;s really a shame; I like Aol6 very much.  Aol6 was just  released too<br/>\nsoon.<br/>\n&gt;<br/>\n&gt; Email<br/>\n&gt;<br/>\n&gt; Aol6 has many email improvements, one of which is HTML email capabilities.<br/>\n&gt; The problem is, it can&#39;t send HTML.  At least not yet.  There are also<br/>\n&gt; problems with Aol5 email showing correctly on Aol6 screens.  This problem<br/>\nhas<br/>\n&gt; been corrected for the most part, except that Aol6 email, still can&#39;t show<br/>\n&gt; background pictures.  This has not been fixed.<br/>\n&gt;<br/>\n&gt; AOL Address Book<br/>\n&gt;<br/>\n&gt; AOL, in their quest for &quot;AOL Anywhere,&quot; has put the address book on their<br/>\nown<br/>\n&gt; servers.  While the intention is to be able to get your address book<br/>\nanytime<br/>\n&gt; anywhere. (even signed on as a guest) You can no longer backup your<br/>\naddress<br/>\n&gt; book on your computer.  If the AOL servers screw up, (and I don&#39;t  know<br/>\nany<br/>\n&gt; that haven&#39;t) you lose your address book forever.  There is no way to back<br/>\nit<br/>\n&gt; up to your hard drive, other then copying and pasting the entire organize<br/>\n&gt; folder to your drive everyday.  I won&#39;t even mention the privacy<br/>\nimplications<br/>\n&gt; of having your address book on someone else&#39;s server.  Many people have<br/>\nhad<br/>\n&gt; their address books filled with double entries, or even tripled.  While<br/>\n&gt; others have had their books cut in half.  (like me)  How can you fix it?<br/>\nYou<br/>\n&gt; have to manually enter, and delete all the problems.  Additionally; your<br/>\n&gt; address book has a finite size now.  They didn&#39;t have the glitches out of<br/>\nit<br/>\n&gt; before it went public.  No matter how much we screamed, they still don&#39;t<br/>\nhave<br/>\n&gt; a backup feature for the address book.  Now I ask you, do you really want<br/>\nme<br/>\n&gt; to put all your addresses for &quot;Danny&#39;s Daily&#39;s&quot; on that server, knowing if<br/>\nit<br/>\n&gt; screws up, your names are toast?  I thought not; until this is changed, I<br/>\n&gt; couldn&#39;t use it even if I wanted to.  That goes for all you &quot;List<br/>\nMasters.&quot;<br/>\n&gt;<br/>\n&gt; Internet Explorer 5.5<br/>\n&gt;<br/>\n&gt; I am presently using 5.5, but only because AOL6 completely destroyed my<br/>\nIE5,<br/>\n&gt; rendering it un-usable, un-fixable, un-uninstallable, and short of a<br/>\ncomplete<br/>\n&gt; system wipe; it can&#39;t be installed again.  5.5 is OK, I don&#39;t really<br/>\nnotice<br/>\n&gt; any difference with it and 5.<br/>\n&gt;<br/>\n&gt; Buddy List<br/>\n&gt;<br/>\n&gt; The new buddy list screen is huge.  It can&#39;t be resized without losing<br/>\n&gt; buttons.  Some problems with it:  When your buddy signs off; the buddy<br/>\nlist<br/>\n&gt; still keeps them on.  This problem was not fixed before final release.<br/>\n&gt;<br/>\n&gt; AOL Speaks<br/>\n&gt;<br/>\n&gt; A clever program that lets you talk, and your computer types for you.<br/>\nThis<br/>\n&gt; will only be available on the CD.  The problem is; after four hours of<br/>\n&gt; reading to it to teach it; it&#39;s only hitting about 60% accuracy. (you can<br/>\n&gt; type a whole lot of emails in four hours).  And, it only works for AOL6.<br/>\nIf<br/>\n&gt; you want it to work for all your Windows aps, it&#39;s 100 bucks.  So, in<br/>\n&gt; essence, it&#39;s useless.<br/>\n&gt;<br/>\n&gt; Internet Access<br/>\n&gt;<br/>\n&gt; It runs about the same, except you&#39;ll notice that all of a sudden, you<br/>\ncan&#39;t<br/>\n&gt; get on the Internet.  You&#39;ll find yourself uninstalling, and reinstalling<br/>\n&gt; your Internet adapters often.<br/>\n&gt; This was not fixed before the release.<br/>\n&gt;<br/>\n&gt; Connect Speeds<br/>\n&gt;<br/>\n&gt; This is a real problem with AOL6.  There is no way to know your connection<br/>\n&gt; speeds.  The sign on screen doesn&#39;t show it, or even flash it by.  At<br/>\nworst;<br/>\n&gt; it connects at 28,800 on a modem.  (which is normal for 6)  That&#39;s it.  At<br/>\n&gt; best; you don&#39;t know what your speed is!  This was not fixed before the<br/>\n&gt; release.<br/>\n&gt;<br/>\n&gt; The Worst Part!!!<br/>\n&gt;<br/>\n&gt; You mean there&#39;s more???  Yes, there is:  The most troublesome part of<br/>\nAOL6;<br/>\n&gt; is that it can also screw up your AOL5.  Again, only a system wipe will<br/>\nfix<br/>\n&gt; these problems.  Basically, Aol6 is still in beta, they shoved it out so<br/>\n&gt; Steve Case could introduce it at the Internet show this week.<br/>\n&gt;<br/>\n&gt; Conclusion<br/>\n&gt;<br/>\n&gt; This is the very first AOL client I can&#39;t recommend for download.  I never<br/>\n&gt; thought I&#39;d see the day I&#39;d have to say this.  The testing went so bad,<br/>\nthat<br/>\n&gt; almost all the experienced testers quit.  This caused problems with always<br/>\n&gt; having an influx of new people, so the questions never went past first<br/>\nweek<br/>\n&gt; questions.  I&#39;m sure you noticed all the ads for testing.  Usually, AOL<br/>\nonly<br/>\n&gt; advertises for testers one half an hour a year!  That in itself should<br/>\ntell<br/>\n&gt; you something.  If you can&#39;t keep experienced testers, who specialize in<br/>\n&gt; crashes, you have a real problem.<br/>\n&gt;<br/>\n&gt; Aol6 will be a great program when it&#39;s finally finished.  I really like<br/>\nit;<br/>\n&gt; but not yet gang ... Stay tuned.<br/>\n&gt;<br/>\n&gt; If you already have it, please email me, and let me know how it&#39;s working<br/>\nfor<br/>\n&gt; you.<br/>\n&gt;<br/>\n&gt; When Aol gets wind of this column, which will be today; two dozen of you<br/>\n&gt; subscribe:  I&#39;ll probably get thrown off the beta program anyway.  But<br/>\nwhat<br/>\n&gt; can I tell ya gang.  You&#39;re my people.  I PAY Aol; but I don&#39;t pay them to<br/>\n&gt; totally screw up my computer.  I can only call it, the way I see it:<br/>\nWhere<br/>\n&gt; the chips fall, they fall...<br/>\n&gt;<br/>\n&gt; I hope this helps you on your road to computer sanity. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":13995,"nextTopicId":13997}}