{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Art Museum Visit","postDate":"1092015882","msgId":97494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNmNmgzbCtkZ2N1QGVHcm91cHMuY29tPg=="},"prevInTopic":97489,"nextInTopic":0,"prevInTime":97493,"nextInTime":97495,"topicId":97489,"numMessagesInTopic":0,"msgSnippet":"Julie, thanks for sharing this. I look forward to reading your individual narratives. If you are ever visiting Houston, you might enjoy the Rothko Chapel.","messageBody":"<div id=\"ygrps-yiv-2058975649\">Julie, thanks for sharing this. I look forward to reading your individual<br/>\nnarratives.<br/>\n<br/>\nIf you are ever visiting Houston, you might enjoy the Rothko Chapel. Usually<br/>\nthere is a Broken Obelisk sculpture outside in the fountain. Last time I was<br/>\nthere it was gone with an official sign posted: Broken Obelisk removed for<br/>\nrepair. It made me chuckle. <br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.735 / Virus Database: 489 - Release Date: 8/6/2004</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Art Museum Visit","postDate":"1092011957","msgId":97489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmNmgzbCtkZ2N1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":97494,"prevInTime":97488,"nextInTime":97490,"topicId":97489,"numMessagesInTopic":0,"msgSnippet":"Narrative of Art Museum Visit One thing I love about Cincinnati is that the art museum isn t *that* far away. We went to it yesterday for the afternoon. We ve","messageBody":"<div id=\"ygrps-yiv-1313427813\">Narrative of Art Museum Visit<br/>\n<br/>\nOne thing I love about Cincinnati is that the art museum isn&#39;t *that* far away. We went to it <br/>\nyesterday for the afternoon. We&#39;ve been many, many times. It was especially apparent to <br/>\nme yesterday. As we walked in the door, Liam exclaimed, &quot;I love that Chihuly chandelier.&quot; <br/>\nJacob added, &quot;I could look at it every day.&quot;<br/>\n<br/>\nWe made our way into the Greek and Egyptian displays and Caitrin noticed that they had <br/>\nrearranged them. She went on to point out which of the vases she liked best compared to <br/>\nlast time. Liam wanted to stop and look at each of the hieroglyphs again.<br/>\n<br/>\nWe moved on and went into an exhibit that was put up by Proctor and Gamble - all <br/>\nCincinnati art. I honestly didn&#39;t recognize the exhibit but the kids did. They started <br/>\nreminiscing about the pieces they had loved the last time we&#39;d been there. We marveled at <br/>\nthe quality of the artwork.<br/>\n<br/>\nLater we found an entire exhibit devoted to Frank Duveneck (Cincinnati native) and were <br/>\nthrilled to see all his paintings together. That was new.<br/>\n<br/>\nWe made our way upstairs to see the Monets that are on loan from Paris and were blown <br/>\naway by the size and colors. Caitrin (7) immediately told me the story of why this <br/>\nparticular &quot;Bridge at Giverny&quot; was so hard to see close-up - &quot;because Monet lost his <br/>\neyesight as he got older and he would make paintings that were less and less realistic as a <br/>\nresult.&quot; She pointed out how much the bridge showed up if we were at the back of the <br/>\nroom compared to up close when we could see each swirl of the brush.<br/>\n<br/>\nLiam (10) reminded me of the &quot;Linnea in Monet&#39;s Garden&quot; book we had read and Jacob <br/>\nremembered the movie.<br/>\n<br/>\nWe were amazed that the Cathedral at Rouen was so dull close up and so vibrant at a <br/>\ndistance. You could see the source of light behind it and it glowed from across the room.<br/>\n<br/>\nWe walked into the modern art exhibit and all agreed again that we don&#39;t like modern art, <br/>\nexcept that I really like Mark Rothko. Rothko asserts that he isn&#39;t interested in form, line or <br/>\ncolor but in creating emotions. He says that he knows he communicates because when <br/>\npeople look at his work, many report that they cry. Jacob (10), who couldn&#39;t remember <br/>\nwho Rothko was when I spoke of him last week, was eager to see our Cincinnati Rothko. <br/>\nHe didn&#39;t cry. He didn&#39;t understand why anyone would. I didn&#39;t cry either, but I did feel this <br/>\nweird surge in my chest.<br/>\n<br/>\nLiam wanted to see a real Van Gogh so I took them to the only one in the museum. He <br/>\nremembered it then and commented that, &quot;that guy must really have liked paint. I like his <br/>\nblue.&quot; Caitrin added, &quot;He uses globs of it. It&#39;s nice to see the real painting so we can see <br/>\nthe globs up close.&quot; We wished for a Van Gogh exhibit to come to Cincinnati.<br/>\n<br/>\nOur favorite rooms were closed for renovation. We were sad. So we went to other rooms <br/>\nwe frequent less and noticed all the Italians. Jacob asked, &quot;Will some of these painters be <br/>\nin Italy when we go next summer?&quot; We discussed the benefits of great art being dispersed <br/>\nthroughout the world rather than collected all in one town. We talked about why the <br/>\nItalians artwork was so much more dramatic than the British in the room next door. We <br/>\nshuddered in front of a boyish, rosy-cheeked David holding the recently severed head of a <br/>\nbloody Goliath.<br/>\n<br/>\nWe ended up in front of a painting that showed a woman deranged with a pale face, <br/>\nflowers dripping down her white gown, restrained by a man in a renaissance costume. <br/>\nThey stood before a queen in anguish and a king with his face in his hands. Jacob called <br/>\nout, &quot;Mom, this is from Hamlet! That&#39;s Ophelia.&quot; And it was. The man was Laertes, her <br/>\nbrother. Apparently this artist had wanted to make a series of Shakespeare paintings to <br/>\ndisplay together in England, but the project failed and the pieces he painted have been <br/>\nbought up by a variety of art connoisseurs. This painting is the first to have been <br/>\npurchased for the Cincinnati Art Museum and its purchase preceded the museum&#39;s <br/>\nconstruction by about five years.<br/>\n<br/>\nIt was a great afternoon. And it was fun to see that repeated visits yielded so much in my <br/>\nkids.<br/>\n<br/>\n Julie B</div>","specialLinks":[]}],"prevTopicId":97401,"nextTopicId":97523}}