{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":291337950,"authorName":"alma","from":"&quot;alma&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Child abusing pets","postDate":"1300739176","msgId":60350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltOGM5OCtkbjJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":60319,"nextInTopic":0,"prevInTime":60349,"nextInTime":60351,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"It sounds from your tone and words that you believe there is something deliberate about your son s behaviour. Do you? And if so, can you be sure? My son, who","messageBody":"<div id=\"ygrps-yiv-2011109472\">It sounds from your tone and words that you believe there is something deliberate about your son&#39;s behaviour. Do you? And if so, can you be sure?<br/>\n<br/>\nMy son, who is 6, finds it very difficult to handle lots of things  toys, things around the house etc. He doesn&#39;t seem to have a strong sense of how much pressure he is exerting. He drops and breaks many things. We found with our fluffy dog that she is best off having a pretty short haircut so that he finds it easier to judge the depth of fur and thus how tight to squeeze.<br/>\n<br/>\nAt three and a half I could not have let him hold an animal at all  he would stroke and pet an animal on my lap. We waited until he was 5 to get a dog. Even then he really struggled, both handling the dog and resisting kicking out if she got in his way. We had to be very, very careful for months.<br/>\n<br/>\nIt may be that your third child finds judging these things more difficult than your first two children did, and then you read all sorts of things into it, and that affects the way you see and handle this issue.<br/>\n<br/>\nAlison <br/>\nDS (8) and DS (6)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Mary Hickcox &lt;disser420@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi everyone,  I am at my wit&#39;s end with this one and really need some encouragement and advice.  I have a son who is 3 1/2 and has been hurting our animals since he was small.  It goes in phases and we have tried to work with him in several different ways.  Although it is completely against what I believe in, we have even tried time outs to instill in him how not OK this behavior is.  I know 1 thing everyone will say is that I need to be with him but I am, he does this right in front of us.  And I have to go out sometimes, so it is impossible for me personally to have my eyes on him every second.<br/>\n&gt; Yesterday things got even worse.  I was out getting errands done and my husband was here.  When I returned I learned that he got one of our chicks (while my husband was in the bathroom very quickly) and he killed it.  This of course was so sad and terrible.  I questioned just about everything and spent a lot of time crying.  We showed it to him and tried to talk to him sternly about how bad it was, then buried it together.  It seemed to have an effect on him so I thought maybe this was something he would learn from.  Then this morning he woke up and left the room without waking me (which he always does).  I was half awake when he got up but it took me 1-2 minutes to get out of bed and follow him.  When I came in he was very roughly playing with the cat.  I did not handle it well.  It breaks my heart that he would do such a thing, so hard for me to understand.  I rose my voice and put him into time out in a rough manner (not proud of that).<br/>\n&gt;   I talked to him more about it afterwards but he just doesn&#39;t get it.  So my question is why is he doing this and what can I do to help him to understand what he is doing?<br/>\n&gt; Thanks so much for any advice.<br/>\n&gt; <br/>\n&gt; Mary  mama to Dylan (11), Colin (7) and Theo (3)  <br/>\n&gt; &quot;Be who you want your children to be.&quot;    Unknown     <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Child abusing pets","postDate":"1300689744","msgId":60319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltNnMwZyttMmJtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":60311,"nextInTopic":60350,"prevInTime":60318,"nextInTime":60320,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"Hi, my son killed two chicks when he was 2 or 3. He had no idea what he was doing.  It was totally my fault for leaving him alone with them. Now that he is 8","messageBody":"<div id=\"ygrps-yiv-740677050\">Hi, my son killed two chicks when he was 2 or 3. He had no idea what he was doing.  It was totally my fault for leaving him alone with them.<br/>\n<br/>\nNow that he is 8 he is much more gentle and would never kill anything.  <br/>\n<br/>\nI remember being scared that his roughness meant something bad about him, but it didn&#39;t.  He is a good and sweet boy.<br/>\n<br/>\nLisa</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Child mishandling pets","postDate":"1300652320","msgId":60311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5NTlEODU5LTI3Q0YtNDU2MS1CNTk0LTY0RkZEMjkxRjZDNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEM1OTNDODg4NUUwRTQ1NkE5QzM1Mzg0MjUxOEJEQkE5QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGltNWJydStsdmluQGVHcm91cHMuY29tPiA8NjRCOEY4NTEtNDI3Ni00RjI4LTk3MjUtRjlCMjFCQTQwNjA0QFNhbmRyYWRvZGQuY29tPiA8QzU5M0M4ODg1RTBFNDU2QTlDMzUzODQyNTE4QkRCQTlAZGVib3JhaDQzZjEzZmQ+"},"prevInTopic":60310,"nextInTopic":60319,"prevInTime":60310,"nextInTime":60312,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"-=-***So pretty bad that you equate the life of a three-week-old chick with your son s.*** -=-I don t think she did that. She said she questioned him and","messageBody":"<div id=\"ygrps-yiv-547680998\">-=-***So pretty bad that you equate the life of a three-week-old chick with your son&#39;s.***<br/>\n<br/>\n-=-I don&#39;t think she did that. She said she questioned him and talked sternly to him about the chick. At best that did no good whatever and at worst she might have caused some temporary distress to her son. If the mom finds better ways to respond (and better ways to protect the animals in her care) she probably won&#39;t cause any long term damage to her so-=-<br/>\n<br/>\nThe definition of &quot;a life&quot; ranges from microscopic organisms to the quality of human life, though.<br/>\n<br/>\nI&#39;m accustomed to anti-bacterial hand soap packaging and Lysol spray disinfectant bottles that say Kills 99.9% of germs.  Unapologetically, they brag about killing.   Is it life?<br/>\n<br/>\nIn India, I stayed with family in Bangalore, and had my own bathroom, on the 13th floor of a high rise housing society.  This is a very modern society, and next to the housing society (a walled community, basically) was a huge, brand new mall with a Taco Bell and all kinds of stuff.    I had a hand soap dispenser in that bathroom.  It said Palmolive.  Only 55 rupees.  Removes Germs.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandraindia2010.blogspot.com/2010/11/soap-for-jains-and-hindus-and-18.html\">http://sandraindia2010.blogspot.com/2010/11/soap-for-jains-and-hindus-and-18.html</a><br/>\n<br/>\nPeople draw the line somewhere.  Deb&#39;s vegetarian.  I had a fish sandwich yesterday.  Someone killed that fish, and not accidentally.  Fish sandwiches are everywhere in Albuquerque for the next month, until Easter, because it&#39;s a very Catholic town and it&#39;s lent.  Many Catholics will avoid meat for 40 days straight, but they will still kill germs while they wash their hands.   <br/>\n<br/>\nIf a mother doesn&#39;t side with her own child against other species, some instinct is being ignored.  I know the chick didn&#39;t attack him, but in an ideal world the chick would have been with its mother, inside chicken wire a three year old couldn&#39;t pass through.<br/>\n<br/>\nIf this were a discussion list for Jains or vegetarians, the discussion might be different.  If it were a PETA list, maybe the mother would&#39;ve been jumped on pretty hard for endangering the lives of chickens in the presence of her abusive child.   But it&#39;s an unschooling list, and my first thought is to side with the child.  We&#39;re here to help children have safe, happy, joyous lives of learning and loving.  So that&#39;s my focus.  Not making the mother feel better, but helping her see options and tools for making her child feel better.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Child mishandling pets","postDate":"1300650990","msgId":60310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3OTQzLjk2MjIxLnFtQHdlYjg2MjA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGltNWJydStsdmluQGVHcm91cHMuY29tPg==","referencesHeader":"PGltNWJydStsdmluQGVHcm91cHMuY29tPg=="},"prevInTopic":60309,"nextInTopic":60311,"prevInTime":60309,"nextInTime":60311,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"I feel he should have the ability to walk around a bit too without me on top of him but you are probably right, for now he needs 100% supervision, even if he ","messageBody":"<div id=\"ygrps-yiv-208815867\">I feel he should have the ability to walk around a bit too without me on top of <br/>\nhim but you are probably right, for now he needs 100% supervision, even if he <br/>\ndoesn&#39;t want it.<br/>\n<br/>\n------------------<br/>\n<br/>\nSupervision doesn&#39;t have to be limiting, supervision can be so totally engaging <br/>\nthat it can be preferable to alone time. Be with your 3 1/2 year old as much as <br/>\nhe needs you and more, be there with a smile and joy and fun things to do. If <br/>\nyou are doing something that you need both eyes and hands and ears for, get him <br/>\nto engage with you or wait to do those things until you can get someone else to <br/>\nbe with him. Make meals easier and faster to produce. Don&#39;t see it as punishing <br/>\nhim to be with him more, see it as a fantastic opportunity to be with your <br/>\nlittle boy. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":186403821,"authorName":"usuheinerfam","from":"&quot;usuheinerfam&quot; &lt;usuheinerfam@...&gt;","profile":"usuheinerfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Child abusing pets","postDate":"1300649823","msgId":60309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltNWwwditvMDJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA5NEZFMjY4MjcwMTRFMjc4MUIxQTNCRjE5MzcxREE4QGRlYm9yYWg0M2YxM2ZkPg=="},"prevInTopic":60308,"nextInTopic":60310,"prevInTime":60308,"nextInTime":60310,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"All of this by Deb was a fantastic response. When my daughter was almost three, I was working in the garden planting strawberries and she was in our shed","messageBody":"<div id=\"ygrps-yiv-700219989\">All of this by Deb was a fantastic response.<br/>\n<br/>\nWhen my daughter was almost three, I was working in the garden planting strawberries and she was in our shed playing with the chicks. She&#39;s a very loving, gentle girl. She had always played so well with them and, well, I had strawberries to plant.<br/>\n<br/>\nShe came out and said &quot;Mommy, all of the chicks went to sleep. I can&#39;t wake them up.&quot; She&#39;d killed all seven of them - their insides were hanging out their bums, she&#39;d squeezed them so hard. I was gagging inside and *so* sad (I am very sensitive about animals) but I never, ever, EVER thought that she&#39;d abused them - and I never suggested that to her. She&#39;d simply hugged them too hard. It was *my* fault. *I* left her alone with the animals. *I* prioritized planting strawberries over sitting by my daughter helping her play with and love the chicks.<br/>\n<br/>\nWhen the animals are that small, you can&#39;t be even two feet away - you have to be right. there.<br/>\n<br/>\nHe&#39;s not going to have any issues with this in later life unless you make it an issue. Please don&#39;t.<br/>\n<br/>\nAlso, don&#39;t label him to his siblings. My older daughter was horrified and said &quot;She KILLED them, Mother!&quot; I said &quot;It was an accident. She didn&#39;t mean to. I should have been there to help her hold them.&quot; We went through a variation of that conversation several times in the next week as my older daughter worked through being compassionate about mistakes other people make that are horrifying to her. It was a good thing for her to learn. I can&#39;t imagine having handled it another way and how that label I would have placed on my younger daughter would affect her and her sister&#39;s view of her.<br/>\n<br/>\nSarah<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unprocessedfamily.blogspot.com\">http://www.unprocessedfamily.blogspot.com</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Deb Lewis&quot; &lt;d.lewis@...&gt; wrote:<br/>\n&gt; ***I know 1 thing everyone will say is that I need to be with him but I am, he does this right in front of us. ***<br/>\n&gt; <br/>\n&gt; When people recommend being with a child more it&#39;s not just about being in the same house or the same room.  It&#39;s about being at the side of the child, engaged with him, as much as possible.   Be near enough and paying enough attention that you can see or guess by his actions, eye direction, etc., what he might be moving toward so that you can help him.    Some kids need  a lot more close attention from their parents.  <br/>\n&gt; <br/>\n&gt; ***It breaks my heart that he would do such a thing, so hard for me to understand.***<br/>\n&gt; <br/>\n&gt; It&#39;s not his responsibility to keep the animals safe, it&#39;s yours.   Find a way for your pets to be safe from him.  Make sure he&#39;s not alone with the animals.   Make a room where cats can get away from him that he can&#39;t get into.        <br/>\n&gt; <br/>\n&gt; ***So my question is why is he doing this...*** <br/>\n&gt; <br/>\n&gt; He&#39;s little and doesn&#39;t understand and he has too much access to pets without the help of an adult.      <br/>\n&gt; <br/>\n&gt; ***... and what can I do to help him to understand what he is doing?***<br/>\n&gt; <br/>\n&gt; Be kind to your pets and keep them safe from him.   Be gentle with him.  He&#39;s learning more every day.   <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Child mishandling pets","postDate":"1300646331","msgId":60308,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1OTNDODg4NUUwRTQ1NkE5QzM1Mzg0MjUxOEJEQkE5QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGltNWJydStsdmluQGVHcm91cHMuY29tPiA8NjRCOEY4NTEtNDI3Ni00RjI4LTk3MjUtRjlCMjFCQTQwNjA0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":60307,"nextInTopic":60309,"prevInTime":60307,"nextInTime":60309,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"***So pretty bad that you equate the life of a three-week-old chick with your son s.*** I don t think she did that.   She said she questioned him and talked","messageBody":"<div id=\"ygrps-yiv-1468591561\">***So pretty bad that you equate the life of a three-week-old chick with your son&#39;s.***<br/>\n<br/>\nI don&#39;t think she did that.   She said she questioned him and talked sternly to him about the chick.   At best that did no good whatever and at worst she might have caused some temporary distress to her son.    If the mom finds better ways to respond  (and better ways to protect the animals in her care) she probably won&#39;t cause any long term damage to her son.    The chick, however nicely anyone treats it from now on, will remain dead.   Dead seems worse than momentarily distressed. (assuming the mom won&#39;t repeat her behavior and create some kind of pathology)    <br/>\n<br/>\n***Do you think he should see a psychologist??***<br/>\n<br/>\nNo.    I doubt a three year old could have intended to kill the chick.  He probably handled it out of curiosity.  He may have dropped it.  They are very delicate little creatures.  They wiggle to be put down and try to rush out of your hands.   Even well intentioned adults are discouraged from handling chicks at ranch supply stores because of the risk of death if they are dropped.  <br/>\n<br/>\nCats are fascinating.  I don&#39;t think a three year old can be expected to stay away from something as wonderful and interesting as a cat.   Since he doesn&#39;t understand how to be gentle with the kitten then he should not be handling it.   The cat will get bigger and your little boy will get older. <br/>\n<br/>\nDeb Lewis <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Child mishandling pets","postDate":"1300646090","msgId":60307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1NTUxOS45MDYxNC5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGltNWJydStsdmluQGVHcm91cHMuY29tPg==","referencesHeader":"PGltNWJydStsdmluQGVHcm91cHMuY29tPg=="},"prevInTopic":60305,"nextInTopic":60308,"prevInTime":60306,"nextInTime":60308,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"When my younger brother was about that age he killed a couple of chicks we had. If I remember correctly he really loved twisting their neck or something ","messageBody":"<div id=\"ygrps-yiv-1432054723\">When my younger brother was about that age he killed a couple of chicks we had.<br/>\nIf I remember correctly he really loved twisting their neck or something <br/>\nhorrible sounding like that.<br/>\nSo I , about 5 years older, hid my 2 chicks under a chair pillow. I forgot about <br/>\nthem.<br/>\nA couple weeks later I found them squished under that pillow. <br/>\nI felt really , really bad.<br/>\nMy brother and I grew up  to be loving  with animals.<br/>\n<br/>\nWhen my niece was about that age, I was raising a chick that was  so adorable!<br/>\nSo one day my sister was letting her play with the chick while sitting with her <br/>\nin the floor to facilitate,<br/>\nMy niece got up , tripped and fell on top of the chick killing it.<br/>\nShe also grew up to be very loving with animals.<br/>\n Right after I got another chick and I closed the door on its head. <br/>\nIt had to be put down as it was suffering. <br/>\nI love animals and I have killed a few chicks myself.<br/>\n<br/>\nMY daugther loves, loves, loves her Guinea Pigs. She was very rough with them <br/>\nwhen younger and<br/>\nmost times I would just end the play time with them after a while, for their <br/>\nsafety.<br/>\n She would have  hurt them and even killed them if she played unattended with <br/>\nthem.<br/>\nI was always there  and I knew when to put a stop to the playtime.<br/>\nI also showed her how to, helped her, stayed with her right there.<br/>\nNow at 5 she can handle them safely. <br/>\nIf I had let her hurt or killed them  by accident or me neglecting to protect <br/>\nthe animals  it would not<br/>\nbe a good reason to &quot;address it&quot; by getting her mental help!!<br/>\n<br/>\nAre you afraid because you have heard that serial killers, psychopaths ans <br/>\nsociopaths usually hurt and kill animals as children??<br/>\n<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Child mishandling pets","postDate":"1300643759","msgId":60305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0QjhGODUxLTQyNzYtNEYyOC05NzI1LUY5QjIxQkE0MDYwNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGltNWJydStsdmluQGVHcm91cHMuY29tPg==","referencesHeader":"PGltNWJydStsdmluQGVHcm91cHMuY29tPg=="},"prevInTopic":60304,"nextInTopic":60307,"prevInTime":60304,"nextInTime":60306,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"-=-I guess my insecurity is that it is abuse rather then just mistreatment.-=- What? Please clarify that. Are you clinging to your claim that it is abuse?  Or","messageBody":"<div id=\"ygrps-yiv-2117332767\">-=-I guess my insecurity is that it is abuse rather then just mistreatment.-=-<br/>\n<br/>\nWhat?<br/>\nPlease clarify that.  <br/>\nAre you clinging to your claim that it is abuse?  Or do you mean to say that you&#39;re concerned that it might be abuse?<br/>\nPlease be as clear as you can be when you write to this list (or anywhere).  I and others here are trying to help you clarify your thoughts.<br/>\n<br/>\nBe careful with the word &quot;just&quot; too as in &quot;abuse rather than just mistreatment.&quot;<br/>\n<br/>\nChoose every single word carefully, when you&#39;re trying to figure out what&#39;s upsetting in a situation like this, and especially if you&#39;re wanting others to help you sort it out.  I&#39;m not just being picky, I&#39;m hoping to help you find tricks for figuring out such things in the future in case others aren&#39;t around to help.<br/>\n<br/>\n-=-&quot;How bad was it?&quot;...Our hen just sat on eggs for 21 days, they hatched, and we have been watching them grow lovingly for 3 weeks...so pretty bad. Not in the sense of money, I don&#39;t care about that, but in the sense that it is another life. Do you think he should see a psychologist??-=-<br/>\n<br/>\nYou were pregnant for nine months, and have been watching your son grow lovingly for three and a half years.  So pretty bad that you equate the life of a three-week-old chick with your son&#39;s.<br/>\n<br/>\nPerhaps I&#39;m exaggerating.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners\">http://sandradodd.com/partners</a><br/>\n<br/>\nWhose partner are you?<br/>\nWhat are your priorities?<br/>\n<br/>\n&quot;We never leave him alone with the animals, but they roam freely...&quot;<br/>\nWhat?<br/>\nI think &quot;we never leave him alone with the animals&quot; is clearly false.<br/>\n<br/>\n&quot;and we have been watching them grow lovingly for 3 weeks&quot;<br/>\n&quot; the cat is a kitten, rescued just recently from a monkeys grasp...literally, and we all love her so much&quot;<br/>\n<br/>\nDo &quot;we&quot; (you and your husband and your three children) all love the kitten and the baby chicks equally?<br/>\nYou signed &quot;Mary mama to Dylan (11), Colin (7) and Theo (3)&quot; and then are using &quot;we.&quot;  Is Theo not part of &quot;we&quot; if you can&#39;t generalize your soft spot for animals to him, too?<br/>\n<br/>\nWas the monkey abusing the kitten or was it mishandling it by accident?<br/>\n<br/>\nTwice in my life I have seen a dog move kittens, gently, and each time one of the kittens died.  Once I was 22 and had never seen it.  The dog was very sad that he had killed the kitten.  He was trying to help the mom cat, who was a friend of his, and who was spastic from a brain injury at birth herself.   The second time, I was in England with Holly.  Kirby was home along, was 11 years old, and the dog accidentally killed a kitten, also trying to move it to where the other kittens were.  Kirby was really upset, and I was grateful to be awake and on instant message so he could ask me for help and comfort.<br/>\n<br/>\nThose dogs weren&#39;t abusing kittens.  They weren&#39;t treating them badly for meanness.  They weren&#39;t &quot;treating them badly&quot; at all.  The dogs didn&#39;t need to go to therapy.  Kirby might have needed to, for having been upset.  I coached him about burying the kitten (I think there might have been two, that day; I don&#39;t remember at the moment).   I felt bad for not being home with him.  I might have benefited from a therapy session had one been conveniently available, but I knew how to think my way to clarity.<br/>\n<br/>\n-=-Do you think he should see a psychologist??-=-<br/>\nNo.<br/>\n-=- I just wonder if I should seek out intervention. Someone else suggested that I NEEDED to as it was a huge concern.-=-<br/>\n<br/>\nThe huge concern is in you, the mom.  Perhaps you yourself should find a therapist to talk to about your own feelings, to get help so that you are helping, and not hurting, your son.  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Child abusing pets","postDate":"1300640863","msgId":60300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwMzU2MS4zMDU0Mi5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":60298,"nextInTopic":60304,"prevInTime":60299,"nextInTime":60301,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"________________________________ I have a son who is 3 1/2 and has been hurting our animals since he was small. ... 3 1/2 is small. He is still a very little","messageBody":"<div id=\"ygrps-yiv-534403319\">________________________________<br/>\nI have a son who is 3 1/2 and has been hurting our animals since he was small. <br/>\n-----------------------------<br/>\n<br/>\n3 1/2 is small. He is still a very little person. Empathy with animals can take <br/>\na long time to grow into. Yesterday when we were walking the dog there was a <br/>\nlittle girl of about 8 who was walking her dog with her mom. They were clearly <br/>\ntaking dog obedience classes somewhere as they stopped to work on some of the <br/>\nexercises one typically works on when taking a dog class. The girl was jerking <br/>\nthe heck out of this little Jack Russell terrier. He cried a couple of times. <br/>\nShe clearly wasn&#39;t seeing what she was doing as being a bit too rough with her <br/>\npup. <br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------------<br/>\n<br/>\n It goes in phases and we have tried to work with him in several different ways. <br/>\n<br/>\n--------------------------------------------------<br/>\n<br/>\nMaybe the phases are about him growing into different kinds of strength and <br/>\npower. Maybe he doesn&#39;t really know what he is doing physically and isn&#39;t <br/>\nterribly aware of the effect of his power on a small creature. <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n Although it is completely against what I believe in, we have even tried time <br/>\nouts to instill in him how not OK this behavior is.  <br/>\n<br/>\n-----------------------------------<br/>\n<br/>\nWhich hasn&#39;t worked because he isn&#39;t, probably, doing anything abusive or cruel <br/>\nby his own standards. He&#39;s playing with animals, not being abusive. He&#39;s just <br/>\ntoo rough and not aware of how that plays out. Rather than try and get him to <br/>\nsuss it out, keep the animals away from him. Make sure cats can get away, <br/>\ninstall a cat door so that they can flee the house if necessary. Don&#39;t keep <br/>\nchickens within hands reach, or climbing reach, or where he can get to. Child <br/>\nproof your animals. Don&#39;t wait for your son to develop the necessary awareness <br/>\nof cause and effect and of empathy, get everything safe so that it isn&#39;t an <br/>\nissue and he&#39;ll become much more aware of how to hold a chick and not kill it as <br/>\nhe ages. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Child abusing pets","postDate":"1300640735","msgId":60298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5NEZFMjY4MjcwMTRFMjc4MUIxQTNCRjE5MzcxREE4QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":60295,"nextInTopic":60300,"prevInTime":60297,"nextInTime":60299,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"***I have a son who is 3 1/2 and has been hurting our animals since he was small. *** He s still small.   One question would be, if you knew he couldn t yet be","messageBody":"<div id=\"ygrps-yiv-1416571713\">***I have a son who is 3 1/2 and has been hurting our animals since he was small. ***<br/>\n<br/>\nHe&#39;s still small.   One question would be, if you knew he couldn&#39;t yet be gentle with animals, why do you have chicks?   <br/>\n<br/>\n***I know 1 thing everyone will say is that I need to be with him but I am, he does this right in front of us. ***<br/>\n<br/>\nWhen people recommend being with a child more it&#39;s not just about being in the same house or the same room.  It&#39;s about being at the side of the child, engaged with him, as much as possible.   Be near enough and paying enough attention that you can see or guess by his actions, eye direction, etc., what he might be moving toward so that you can help him.    Some kids need  a lot more close attention from their parents.  <br/>\n<br/>\n***It breaks my heart that he would do such a thing, so hard for me to understand.***<br/>\n<br/>\nIt&#39;s not his responsibility to keep the animals safe, it&#39;s yours.   Find a way for your pets to be safe from him.  Make sure he&#39;s not alone with the animals.   Make a room where cats can get away from him that he can&#39;t get into.        <br/>\n<br/>\n***So my question is why is he doing this...*** <br/>\n<br/>\nHe&#39;s little and doesn&#39;t understand and he has too much access to pets without the help of an adult.      <br/>\n<br/>\n***... and what can I do to help him to understand what he is doing?***<br/>\n<br/>\nBe kind to your pets and keep them safe from him.   Be gentle with him.  He&#39;s learning more every day.   <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":161610102,"authorName":"DISSER420","from":"&quot;DISSER420&quot; &lt;disser420@...&gt;","profile":"DISSER420","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Child mishandling pets","postDate":"1300640446","msgId":60304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltNWJydStsdmluQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyNEQ2OUU3LUVCRTAtNDk0Mi1CNkNBLTNFNEM1NkNCMEVFOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60300,"nextInTopic":60305,"prevInTime":60303,"nextInTime":60305,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"Thanks so much Sandra.  I guess my insecurity is that it is abuse rather then just mistreatment.  I have a very soft spot for animals so I think their is more","messageBody":"<div id=\"ygrps-yiv-1441985126\">Thanks so much Sandra.  I guess my insecurity is that it is abuse rather then just mistreatment.  I have a very soft spot for animals so I think their is more upset on my part then there needs to be.  I will change that.  We never leave him alone with the animals, but they roam freely (and the cat is a kitten, rescued just recently from a monkeys grasp...literally, and we all love her so much)and every once in a while I am making dinner or something and he gets to them.  I feel he should have the ability to walk around a bit too without me on top of him but you are probably right, for now he needs 100% supervision, even if he doesn&#39;t want it.<br/>\n<br/>\n&quot;How bad was it?&quot;...Our hen just sat on eggs for 21 days, they hatched, and we have been watching them grow lovingly for 3 weeks...so pretty bad.  Not in the sense of money, I don&#39;t care about that, but in the sense that it is another life.  Do you think he should see a psychologist??<br/>\n<br/>\n&quot;suggested he might kill it as he killed the chick &quot;...I did say that, and I think you are right.  Too much for a little boy:(  Thanks for pointing that out.<br/>\n<br/>\nGreat advice, I need to be on top of him and not let it upset me so much.  I guess he probably won&#39;t hurt animals his whole life.  I just wonder if I should seek out intervention.  Someone else suggested that I NEEDED to as it was a huge concern.<br/>\n<br/>\nThanks, Mary</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Child abusing pets","postDate":"1300639927","msgId":60295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2MzQ3Ny42MTk5Ny5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":60293,"nextInTopic":60298,"prevInTime":60294,"nextInTime":60296,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"Some children are too rough with pets. My son was super gentle but my daughter was rough. I had a cat that would not  run from her and let her do everything","messageBody":"<div id=\"ygrps-yiv-2065305921\">Some children are too rough with pets. My son was super gentle but my daughter <br/>\nwas rough.<br/>\nI had a cat that would not  run from her and let her do everything and just took <br/>\nit. I kept that cat away.<br/>\nKeep the animals away from the child. Keep the animals safe.<br/>\nAt 5 now my daughter is gentle with them. <br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Child mishandling pets","postDate":"1300635894","msgId":60293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyNEQ2OUU3LUVCRTAtNDk0Mi1CNkNBLTNFNEM1NkNCMEVFOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":60292,"nextInTopic":60295,"prevInTime":60292,"nextInTime":60294,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"One tweak will help for starters, I think.  I changed (just on my response, it won t change the whole topic) abusing to mishandling. That might help the","messageBody":"<div id=\"ygrps-yiv-628346206\">One tweak will help for starters, I think.  I changed (just on my response, it won&#39;t change the whole topic) &quot;abusing&quot; to &quot;mishandling.&quot;<br/>\n<br/>\nThat might help the way the parents and siblings see the situation.<br/>\n<br/>\nIf he&#39;s not purposefully being mean, it&#39;s not fair to say &quot;abuse.&quot;<br/>\n<br/>\nSometimes the same sensibility (&quot;intelligence&quot; in Howard Gardner&#39;s terminology) that would keep a child from knowing when he was playing too rough or hugging too hard could keep him from judging how softly to touch a cat or a chick.<br/>\n<br/>\n-=-I know 1 thing everyone will say is that I need to be with him but I am, he does this right in front of us.  And I have to go out sometimes, so it is impossible for me personally to have my eyes on him every second.-=<br/>\n<br/>\nThen don&#39;t leave him alone with animals?<br/>\n<br/>\n-=-We showed it to him and tried to talk to him sternly about how bad it was, then buried it together.  -=-<br/>\n<br/>\nHow bad was it?  Was it a $15 chick specially bred?   <br/>\nOne session with a psychologist costs more than the most expensive chick, I think. <br/>\n<br/>\nI&#39;m wondering about &quot;tried to talk to him sternly,&quot; too.<br/>\nIf you expressed shock and dismay in a natural way, and the chick was dead enough to bury, I&#39;m not sure why any more talking would be necessary.<br/>\n<br/>\nThree and a half is very young.  <br/>\n<br/>\n-=- I talked to him more about it afterwards but he just doesn&#39;t get it.-=-<br/>\n<br/>\nDon&#39;t make a bigger deal about it than it is.  Protect your chicks from other animals and children.  Protect your young child from the opportunity to get to your chickens if it upsets you that much.<br/>\n<br/>\n-=-So my question is why is he doing this and what can I do to help him to understand what he is doing?-=-<br/>\n<br/>\nHe&#39;s doing it because he&#39;s little and he&#39;s learning.  The cat can get up and leave, or scratch or bite.   Cats can defend themselves.  If you lectured him at length about the cat, and suggested he might kill it as he killed the chick (just guessing, in case you might have) I think that&#39;s going too far.<br/>\n<br/>\nWhen I was little I killed bugs, with my hands, not to make them hurt, but to see how their legs came off.  I was three or four--maybe five-- when I pulled &quot;the lights&quot; off fireflies and stuck them to my fingers where rings would go.  I was too little to know I was killing the bug (or to think about why it was sticking to my finger).  When I realized it, I stopped doing it.<br/>\n<br/>\nIt is possible for parental reaction to be more harmful than innocent childish roughness.<br/>\n<br/>\nUntil he&#39;s older and gentler, be more vigilant.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":161610102,"authorName":"Mary Hickcox","from":"Mary Hickcox &lt;disser420@...&gt;","profile":"DISSER420","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Child abusing pets","postDate":"1300630330","msgId":60292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyOTYyNy4yNzE0NC5xbUB3ZWIxMTE0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":60293,"prevInTime":60291,"nextInTime":60293,"topicId":60292,"numMessagesInTopic":0,"msgSnippet":"Hi everyone,  I am at my wit s end with this one and really need some encouragement and advice.  I have a son who is 3 1/2 and has been hurting our animals","messageBody":"<div id=\"ygrps-yiv-827279432\">Hi everyone,  I am at my wit&#39;s end with this one and really need some encouragement and advice.  I have a son who is 3 1/2 and has been hurting our animals since he was small.  It goes in phases and we have tried to work with him in several different ways.  Although it is completely against what I believe in, we have even tried time outs to instill in him how not OK this behavior is.  I know 1 thing everyone will say is that I need to be with him but I am, he does this right in front of us.  And I have to go out sometimes, so it is impossible for me personally to have my eyes on him every second.<br/>\nYesterday things got even worse.  I was out getting errands done and my husband was here.  When I returned I learned that he got one of our chicks (while my husband was in the bathroom very quickly) and he killed it.  This of course was so sad and terrible.  I questioned just about everything and spent a lot of time crying.  We showed it to him and tried to talk to him sternly about how bad it was, then buried it together.  It seemed to have an effect on him so I thought maybe this was something he would learn from.  Then this morning he woke up and left the room without waking me (which he always does).  I was half awake when he got up but it took me 1-2 minutes to get out of bed and follow him.  When I came in he was very roughly playing with the cat.  I did not handle it well.  It breaks my heart that he would do such a thing, so hard for me to understand.  I rose my voice and put him into time out in a rough manner (not proud of that).<br/>\n  I talked to him more about it afterwards but he just doesn&#39;t get it.  So my question is why is he doing this and what can I do to help him to understand what he is doing?<br/>\nThanks so much for any advice.<br/>\n<br/>\nMary  mama to Dylan (11), Colin (7) and Theo (3)  <br/>\n&quot;Be who you want your children to be.&quot;    Unknown     <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":60316,"nextTopicId":60285}}