{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":5047879,"authorName":"Joseph Fuerst","from":"&quot;Joseph Fuerst&quot; &lt;fuerst@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] letting go of limits...was grandparents","postDate":"1009754628","msgId":30450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTEwMWMxOTE4OSQwOTA1YjJjMCRlYTg5ODUwYUBwYXZpbGlvbj4=","referencesHeader":"PDEwMDk3Mzg5MjkuMTI0Ny45MzA3OS5tMTBAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":30449,"nextInTime":30451,"topicId":30450,"numMessagesInTopic":0,"msgSnippet":"Welcome pat, there  was a discussion several months back about control etc.   I wouldn t necessarily recommend the archives....for that was a time a great ","messageBody":"<div id=\"ygrps-yiv-882751011\">Welcome pat,<br/>\n<br/>\nthere  was a discussion several months back about &#39;control&#39; etc.   I<br/>\nwouldn&#39;t necessarily recommend the archives....for that was a time a great<br/>\nstrife on this list,  which we are in the process of moving beyond (right,<br/>\neveryone?  :-) )<br/>\n    I remember Tia telling about her mother&#39;s analogy (help me out if you<br/>\nneed to Tia)....about how we as parents set fences for our children to keep<br/>\nthem safe.  As they mature,   the fence gets moved and changed with the<br/>\nchild&#39;s needs.  So,  as unschooling parents,  we want to provide them as<br/>\nmuch autonomy as possible,  within the boundaries they are able to manage.<br/>\n    Sound simple,  huh? LOL.....I think it is what unschoolers struggle with<br/>\nat times.  It&#39;s easy to know that they are born with bodies that know when<br/>\nthey&#39;ve had enough to eat and enough rest,  though for many parents,  even<br/>\nbelieving that is difficult.  As parents,  you decide what many things that<br/>\na child has no control over...housing, etc.    It doesn&#39;t mean handing over<br/>\ncontrol of the household to your children, but thay can become involved in<br/>\nmany things at an early age.  For example,  you stock the pantry,  prepare<br/>\nthe meals (or go out),  but if your child helped with the menu,  or wanted<br/>\nsome certain cereal or vegetable, that is respected.<br/>\n    So you decide the fences...and when to move them.  I know at least one<br/>\nperson on this list said their family doesn&#39;t own a television.  We own<br/>\ntwo.....kept in common family areas;  and we don&#39;t choose to subscribe to<br/>\ncable (though I think some channels and shows would be excellent....we don&#39;t<br/>\nmiss it);  but if there&#39;s something someone wanted to see,  we could ask<br/>\nlots of people to record it for us.  And most cable shows my kids have been<br/>\ninterested in eventually end up on video from the library.   Make sense?<br/>\n    As to chore and manners...at our house,  I don&#39;t like to use the word<br/>\nchores...it conjures up too much of a drudgery image to me!  And I believe<br/>\nin the idea that if I&#39;m the one bothered by it,  I&#39;mthe one who needs to<br/>\nchange it.  I can sum it all up in three words:   example,  example,  and<br/>\nexample.<br/>\nHope you enjoy the list!<br/>\nSusan<br/>\n<br/>\nThanks for your input.  I agree with you that there are many good shows on<br/>\nTV and we are enriched by the History Channel, PBS and other shows like<br/>\nthat.  I guess I just haven&#39;t reached the point where I can just let go of<br/>\nall balancing limits in our house.  I don&#39;t limit altogether, I just limit<br/>\nfor balance.  I remember reading in &quot;Hard Times in Paradise&quot; that the boys<br/>\ndidn&#39;t always like what they were asked to do.  I&#39;m just trying to find a<br/>\nbalance.  When it comes to their education, my kids are in charge.  When it<br/>\ncomes to matters of health, safety and overall values, I discuss, encourage,<br/>\nand sometimes impose limits or require a certain level of effort.  Maybe<br/>\nafter I have been unschooling for their education a while, I will feel more<br/>\nconfident and let them be totally in charge of every thing with only my<br/>\ninput.  I hope so, it would be a lot easier.<br/>\n<br/>\nHow DO unschoolers handle chores, manners, and other things of that nature?<br/>\n<br/>\nPat</div>","specialLinks":[]}],"prevTopicId":30435,"nextTopicId":26805}}