{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":202023256,"authorName":"mfhickman@comcast.net","from":"mfhickman@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:support and reassurance","postDate":"1102092942","msgId":101479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMDMyMDA0MTY1NS4xNDc0MC40MUIwOUE4RTAwMDMyQUE2MDAwMDM5OTQyMjAwNzYzNzA0MDIwRTAzMDUwQzA3MDgwMDAzQGNvbWNhc3QubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":101478,"nextInTime":101480,"topicId":101479,"numMessagesInTopic":0,"msgSnippet":"Hi All, Thank you to those who wrote in about our visitor and his need to see learning broken down. I know I was way tired, the house was a mess and the kids","messageBody":"<div id=\"ygrps-yiv-1613757956\">Hi All,<br/>\n<br/>\nThank you to those who wrote in about our visitor and his need to see learning broken down. I know I was way tired, the house was a mess and the kids cranky, so all together it was a miserable visit for me, but I think our friend had a nice time and he and my husband  reconnected. We had not seen him for over 5 years.<br/>\n<br/>\nI am enjoying the threads lately and just this am was going to write in to talk about how much my kids are enjoying cable, we just got it. I on the other hand get tired of the noise and the sitting around, so I have a lot of work to do inside to help me not bag on my kids for not &quot;doing&quot; anything. My little ones can and have sat for an entire day watching and they still seem to want to watch the next show. I love it mom. I spend time watching with them, I spend time doing intereseting things around the house. Sometimes they join me, but more often than not they watch, get hungry, ask for food, watch until we have someplace to go. <br/>\n<br/>\nRemembering to create a positive space resonated with me, that is why I want to talk about structure and unstructure and other families balance. My kids mostly say no thank you to helping me around the home. Do not spontaneously ask do you need help mom, as I louge all the sports paraphinalia into the garage. Tired from working alone I get cranky during the day which spoils the positive space. They on the other hand are happily watching the next show cuz they love it. So I am rethinking my own boundries and limits yet I sit and think instead of take action, because these days usually pass and my kiddos will come up and help spontaneously. Riley just proved my point. He noticed the cats wanted to swap, one in one out and helped them by getting up and openning the door. Any thoughts would be appreciated. One I am thinking about today is to see the postive in my kids and try to let the negative flow out.<br/>\n<br/>\nMary H.</div>","specialLinks":[]}],"prevTopicId":101363,"nextTopicId":101478}}