{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Riley","postDate":"1040079432","msgId":11350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjE2MjI1NzEyLjEwOTk3LnFtYWlsQHdlYjEzNzA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMzk4NjQ5NjEuNTQ5LjM5MDY4Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":11331,"nextInTopic":0,"prevInTime":11349,"nextInTime":11351,"topicId":11321,"numMessagesInTopic":0,"msgSnippet":"... Mary, I have been meaning to post on this issue, but just do not have a lot of online time right now.  We are out of town through the holidays dealing with","messageBody":"<div id=\"ygrps-yiv-71010159\"><blockquote><span title=\"ireply\">&gt;He does not eat complete meals, he loves bread,<br/>\n&gt;nibbles on other food. 1 slice of pizza fills<br/>\n&gt;him up. He has a limited palette of foods he likes<br/>\n&gt;and is just too busy to bother with sitting down and<br/>\n&gt;eating for a while. <br/>\n<br/>\n </span></blockquote>Mary, I have been meaning to post on this issue, but<br/>\njust do not have a lot of online time right now.  We<br/>\nare out of town through the holidays dealing with my<br/>\nhubby&#39;s accident and subsequent medical and insurance<br/>\nissues.<br/>\n<br/>\nAt any rate, I have a son who is just turning 6,<br/>\nThomas.  Thomas has a number of allergies, both severe<br/>\n(life threatening), to milder (affecting skin or<br/>\nsinuses, etc) to more subtle, behaviorally affecting<br/>\nones.  Thomas cannot eat nuts at all, and we must be<br/>\nvery cautious with eggs, and dairy products.  Thomas<br/>\nis very sensative to what he eats in general.  <br/>\n<br/>\nThomas also suffers from impulse control issues, is<br/>\nextremely passionate and intense, and has obsessive<br/>\ncompulsive tendancies.  He is impatient and easily<br/>\nfrustrated.  He has sensory integration problems also,<br/>\nand insists on only certain types of material for<br/>\nclothing, certain cuts and styles, no tags, seams,<br/>\netc, and will not wear socks or underwear.  He also<br/>\nhas trouble focussing when there are distractions<br/>\naround, like people talking in a room where he is<br/>\ntrying to watch tv.<br/>\n<br/>\nThe best thing we did for him was to go to an all<br/>\norganic diet.  Eliminating the chemicals, dyes and<br/>\npreservatives from his diet made a huge difference in<br/>\nhis ability to get himself under control, and has<br/>\nincreased his patience and ability to cope with<br/>\nstress.  Going organic also increased his tolerance<br/>\nlevel for his many allergies, and he does not have<br/>\nsevere reactions as reasily, nor suffer from chronic<br/>\nsinus congestion as much.<br/>\n<br/>\nThe first thing we did though, before going organic,<br/>\nwas to limit refined sugars.  Rather than rationing<br/>\nhis treat intake, we began using honey and molasses in<br/>\nbaking, and buying organic treats from our local co-op<br/>\nwith cane sugar and other non-refined sweeteners.  He<br/>\nmoderates himself with these kinds of treats much<br/>\nbetter than he was able to with the refined sugars. <br/>\nWe also are careful to not buy breads, soups, juices,<br/>\netc with corn syrup or other refined sugars in them. <br/>\nThis helped his anger management and self control a<br/>\nlot.<br/>\n<br/>\nAnother thing we did was limit his wheat intake.  We<br/>\nnoticed that Thomas was a what junkie, sometimes<br/>\nwanting nothing but wheat products all day, eating<br/>\nplain bread or toast, empty hot dog buns, plain<br/>\nnoodles, etc.  When he was eating this way, he was out<br/>\nof control a lot.  Eliminating wheat from a western<br/>\ndiet is extremely hard.  We simply try to limit his<br/>\nintake by using wheat alternatives as much as we can,<br/>\nand buying bread with little or no wheat gluten in it.<br/>\n I buy spelt, rice, potato, and other flours to keep<br/>\non hand for sauces, gravies, soups, cooking in general<br/>\nand baking.  I use at least half oat flour (grinding<br/>\nup rolled oats in the food processor) in baking most<br/>\nof the time, buy corn and rice noodles, etc.  <br/>\n<br/>\nWith Thomas we also have to just occassionally stay<br/>\nhome when we have plans to go out, because he is not<br/>\nable to cope at that time.  Or one of us stays home<br/>\nwith him.  He needs extra patience when he has a<br/>\nchange in his routine.  We try to keep him away from<br/>\nreally large or overstimulating activites, because he<br/>\ngets overloaded and has meltdowns.  But he can take<br/>\nthem in moderation (like the hockey game with his dad<br/>\nand uncle and brother last week.)  He likes to stay<br/>\nhome a fair amount, and is shy of crowds.  I see this<br/>\nas him regulating his stimulation that way.  We try to<br/>\nfind special things to do with him that he can handle,<br/>\nand when we do go to large or noisy functions, we take<br/>\nour cues from him about how long he can stay before<br/>\ngetting burnt out.<br/>\n<br/>\nHe is improving over time, as he matures.  He is very<br/>\nchallenging and exhausting right now, but I know he<br/>\nwill not always be that way.  At the moment, with our<br/>\nfamily crisis and being away from home, he is proving<br/>\nto be very challenging for us.  But we get by, one day<br/>\nat a time.  You sound like a great Mom, Mary, and I am<br/>\nsure that you and Riley will find solutions for his<br/>\nchallenges.  <br/>\n<br/>\nI was impressed by the self control Riley exhibited in<br/>\nthe car conversation about being left out, and his<br/>\ngreat degree of empathy for Cassie in not wanting to<br/>\nhurt her feelings.  Or maybe he just didn&#39;t want to<br/>\nget into a fight ;-)  Empathy is something Thomas<br/>\nstruggles with.  Some days he is so empthetic he will<br/>\ncry when someone else hurts themselves, and other days<br/>\nhe is downright coldhearted.  Sometimes he cycles<br/>\nthrough varying degrees multiple times, back and<br/>\nforth, in one day.  It all depends on the thousand<br/>\nlittle things going on around and in him every day. <br/>\nAnyway, hang in there Mary, you&#39;re not alone.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Riley","postDate":"1039882117","msgId":11331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuNGE1YjA0ZC4yYjJjYjE4NUBjcy5jb20+"},"prevInTopic":11322,"nextInTopic":11350,"prevInTime":11330,"nextInTime":11332,"topicId":11321,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/14/02 5:22:52 AM Central Standard Time, AlwaysLearning@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-1447269326\">In a message dated 12/14/02 5:22:52 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; I thought about food sensitivity, but frankly I feel it is more his <br/>\ntemperment<br/>\n with a slightly hungry body, and I want him to gain selfcontrol. &gt;&gt;<br/>\n<br/>\nHave you ever closely watched how certain foods make him act? Just try being <br/>\nmore attune and observant maybe, especially with the dyes....just see if you <br/>\ncan figure something out.<br/>\nAlso, from everything you&#39;ve written here (and I&#39;m no expert) he sounds just <br/>\nlike a chammomilla child.  It&#39;s a homeopathic remedy and fairly cheap to get <br/>\na hold of (around 5-7 dollars usually for one bottle) that can be hugely <br/>\ncalming for those irritable, cranky types.<br/>\nThey taste like little sugar pills, so it&#39;s easy to get a child to eat them. <br/>\nAnd it has the added benefit of distraction! When Jalen is getting all worked <br/>\nup it sometimes calms him down just to put a yummy in his mouth.:)<br/>\nTry to get 200cc if you can find it.<br/>\n<br/>\nSpeaking of food dye, Jalen (22mo) got a hold of some bright blue Jelly <br/>\nBelly&#39;s last night. I just changed a diaper that looked like intensely green, <br/>\nmushy playdough...blech! (hope no one was eating when you got that visual) <br/>\ngrins....<br/>\n<br/>\nRen<br/>\n&quot;Knowledge will not always take the place of simple observation.&quot;<br/>\n                                                        ~Arnold Lobel<br/>\nUnschooling support at pensacolaunschoolers.com</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Riley","postDate":"1039816092","msgId":11322,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MS41MTkwMDdmLjJiMmJhZjljQGFvbC5jb20+"},"prevInTopic":11321,"nextInTopic":11331,"prevInTime":11321,"nextInTime":11323,"topicId":11321,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/13/02 2:37:44 PM, maryfhickman@jps.net writes:  Me too.  Sometimes I get an anti-egg spell and can t stand","messageBody":"<div id=\"ygrps-yiv-97948959\">In a message dated 12/13/02 2:37:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a> writes:<br/>\n<br/>\n&lt;&lt; Eggs come and go for him. &gt;&gt;<br/>\n<br/>\nMe too.  Sometimes I get an anti-egg spell and can&#39;t stand them, and other <br/>\ntimes they&#39;re my main food.<br/>\n<br/>\nTeething could be a factore.<br/>\n<br/>\n-=-I thought about food sensitivity, but frankly I feel it is more his <br/>\ntemperment<br/>\nwith a slightly hungry body, and I want him to gain selfcontrol. -=-<br/>\n<br/>\nProbably not just &quot;Slightly hungry, &quot; but hungry for something.<br/>\n<br/>\nSelf control can come later.  If food fixes it, feed him!<br/>\n<br/>\nWill he eat cashews?  PayDay bars?<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"&lt;maryfhickman@...&gt;","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Riley","postDate":"1039815420","msgId":11321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNwcmluZ21haWwuMDk5NC4xMDM5ODE1NDIwLjAuNzUzMjE3MDBAd2VibWFpbC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":11322,"prevInTime":11320,"nextInTime":11322,"topicId":11321,"numMessagesInTopic":0,"msgSnippet":"Ren and Sandra, Both of you bring up some issues I do deal with with Riley. He does not eat complete meals, he loves bread, nibbles on other food. 1 slice of","messageBody":"<div id=\"ygrps-yiv-1705110247\">Ren and Sandra,<br/>\n<br/>\nBoth of you bring up some issues I do deal with with Riley. He does not eat<br/>\ncomplete meals, he loves bread, nibbles on other food. 1 slice of pizza fills<br/>\nhim up. He has a limited palette of foods he likes and is just too busy to<br/>\nbother with sitting down and eating for a while. Fish, chicken, steak are his<br/>\nfavorite protein foods. He will not even stay in the house when I cook beans,<br/>\nlet alone try one. Eggs come and go for him. Cheese sometimes. Peanut butter<br/>\nbugs him, nuts sometimes will be eaten. He does crave sugars. I try complete<br/>\nprotein breads when I can find them at the store. Today he took a nap. Maybe<br/>\nhe has been too busy. Fatigue greatly increases his temper. <br/>\n<br/>\nHis testicles are OK, I do wonder about his teeth, though. He had crowns put<br/>\nin at 2, severe rot on his 2 fronts. 1 was damaged and pulled. His other could<br/>\nbe bugging him. He also is just started to lose teeth, lots are wiggly in his<br/>\nmouth. He has 3  permanant front teeth too, so will need another<br/>\nsurgery/pulling sometime soon. I&#39;ll call his dentist. <br/>\n<br/>\nI thought about food sensitivity, but frankly I feel it is more his temperment<br/>\nwith a slightly hungry body, and I want him to gain selfcontrol. His dad and<br/>\nhis granddad both deal with this. We are trying to show him words work, ask<br/>\nfor help, walk away. We pound pillows. Reading turns him mellow again, yet I&#39;m<br/>\nnot always prepared to do this. And yes, I will find a rope to tie to the<br/>\npole. It was dark and cold the other night and I was finished jumproping too.<br/>\nThank you for giving me ideas to think about. As always, I learn a ton reading<br/>\nfrom the list.<br/>\n<br/>\nMary H.</div>","specialLinks":[]}],"prevTopicId":11337,"nextTopicId":11349}}