{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Deference (was &quot; Respect and polite &quot;)","postDate":"1055873658","msgId":74618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MS4xM2Q4MDcyMS4yYzIwYjQ3YUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":74617,"nextInTime":74619,"topicId":74618,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/17/03 10:38:16 AM, grlynbl@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-862767275\">In a message dated 6/17/03 10:38:16 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> writes:<br/>\n<br/>\n&lt;&lt;  The question of <br/>\nrank is not something that we really deal with on a day in day out basis.  We <br/>\nlive in and among our families and friends and peers and co-workers, and for <br/>\nthe most part, we are all  the same rank, we are people who care for and love <br/>\nand respect each other with no regard for who is &quot;above&quot; whom..   But, on <br/>\noccasion, rank does come to into play, &gt;&gt;<br/>\n<br/>\nDepending how subtly people view things, it can be day to day.<br/>\n<br/>\nWhen expertise is important, those who are newer or less experienced should <br/>\ndefer to people with more experience.  Our friend Mark rides horses.  Once a <br/>\nweek he helps others do the same.  When he&#39;s doing that, he ranks.  They really <br/>\nneed to take his advice and follow his rules, as he&#39;s the one who contracted <br/>\nwith the stables for people to be there that day.<br/>\n<br/>\nWhen we&#39;re playing music, Mark ranks none at all.  His wife plays sometimes <br/>\n(used to) and he might show up to carry her stuff in.  But if we were playing <br/>\nand Mark interrupted, it would be really rude.  He&#39;s not a musician.  And he <br/>\nwouldn&#39;t dream of interrupting!<br/>\n<br/>\nIf Mark&#39;s over, and Keith, and Cathyn, working on armor, I&#39;m nobody.  I can <br/>\nbring them drinks and offer them food, and bring them a phone if someone calls, <br/>\nbut I&#39;m not an armorer, and what they are doing is none of my business.  I <br/>\nwouldn&#39;t say &quot;Stop hammering those rivets, I&#39;m trying to watch TV.&quot;   If they&#39;ve <br/>\narranged to make armor, that&#39;s what&#39;s happening that day.<br/>\n<br/>\nMark used to be a long haired college kid who was my husband&#39;s squire&#39;s <br/>\nsquire (the middle-man having been knighted).  <br/>\nCathyn used to be a long haired drop-out drug dealing brat.  That was a long <br/>\ntime ago.<br/>\n<br/>\nWhen we&#39;re cooking as a group, for a feast or project, Cathyn is IT.  He <br/>\nknows lots.  We defer to him and take his advice.  If Mark Schander (a different <br/>\nMark) shows up, or Marie Heuser, Cathyn will step back and defer to them.  As <br/>\ncooks, they rank him.  He LOVES to watch them cook, and he learns a lot from <br/>\nthem.  So this &quot;rank&quot; I&#39;m talking about isn&#39;t given after a test, doesn&#39;t <br/>\ninvolve a certificate, it&#39;s not claimed king-of-the-mountain style.  It&#39;s deference <br/>\nto people who know more, who have more reason to be in charge, or who are for <br/>\nthat moment in a position of knowledge or authority, and others who are <br/>\ninterested in the horses, armor, music, cooking, whatever, defer.<br/>\n<br/>\nCathyn can also do electricity.  When he works on our fixtures, Keith will <br/>\nstand by and hand him tools, because Keith doesn&#39;t do electricity.<br/>\n<br/>\nMark (of the horses and armor) is a police officer now.  When the subject was <br/>\na young man of our acquaintance who had gotten crazy and threatened a female <br/>\nfriend, we asked Mark what we should do, and we shut up and we listened to him <br/>\nabout what was legal, and what was likely to make things worse.  <br/>\n<br/>\nMark rarely outranks me in social situations (and we&#39;ve intersected half a <br/>\ndozen ways over the years).  When he does, I don&#39;t hesitate to defer to him, <br/>\nmake sure he has whatever tools (space, light, phone, food, chair, table, pen) he <br/>\nneeds to do what he needs to do.  He has done the same for me, when roles <br/>\nwere reversed in other situations.  We&#39;ve been in situations where we were flatly <br/>\nequal.  It&#39;s nice.  They&#39;re all nice.  They can change by the moment.<br/>\n<br/>\nWhen I was in my 20&#39;s, my favorite professor, whom I&#39;d known since I was 18, <br/>\ngot me to join the SCA.  We had done folk music together (equals) I&#39;d taken <br/>\nclasses with him (NOT equal), I had visited him in England when he was there on <br/>\nsabbatical (I was a guest in HIS house, so I got special tourist attention, <br/>\nbut had to follow his house rules and schedule), and he convinced me to join the <br/>\nSCA, where I outranked him within two years.  He was always gracious about <br/>\nthat, and I knew when we were back in academia I was little to his big.   No <br/>\nproblem.<br/>\n<br/>\nKids can learn to ride that adeptly if parents help them  instead of hinder <br/>\nthem. <br/>\n<br/>\nIf a child&#39;s being taught to do introductions, those things DO matter.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":74557,"nextTopicId":74441}}