{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Judie C. Rall","from":"&quot;Judie C. Rall&quot; &lt;adonai@...&gt;","replyTo":"LIST","senderId":"FtNVVC5QHSteIvtYK_i287YovRnLmbkNtpQbfozS7LIvGWqFIE4TqMXrkqkIDrIaCKL9i9O58UZx0QyELSRAZToBKsghHq8FNWA4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Spanking....the book (long)","postDate":"989141278","msgId":20656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTA2MTQyMi5mNDZFTWdKMjI2OTdAbWFpbC5zaXJpbmV0Lm5ldD4=","inReplyToHeader":"PDlkMmxmZitiOWtnQGVHcm91cHMuY29tPg=="},"prevInTopic":20644,"nextInTopic":0,"prevInTime":20655,"nextInTime":20657,"topicId":20644,"numMessagesInTopic":0,"msgSnippet":"... I absolutely would. I would like to explain the whole biblical spanking thing, just so we can get that over with.  I have a website about it, but I will","messageBody":"<div id=\"ygrps-yiv-193692571\"><blockquote><span title=\"ireply\">&gt; I&#39;ve been thinking about the spanking chapter for my book. I <br/>\n&gt; suggested in a post yesterday (half-heartedly) that I would love to <br/>\n&gt; quote the anti-spankers in here and give them credit if they agreed. <br/>\n&gt; I think I might really like to do that. You all spoke so eloquently <br/>\n&gt; and passionately about it. Would any of you consider allowing me to <br/>\n&gt; use your opinions in the book?<br/>\n&gt; <br/>\n&gt; love, Valerie <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I absolutely would.  <br/>\n<br/>\nI would like to explain the whole biblical spanking thing, just so we <br/>\ncan get that over with.  I have a website about it, but I will post the <br/>\ngist of it here.<br/>\n<br/>\nI would also like to say that, I WAS a born-again Christian for 20 <br/>\nyears.  I was fed all their doctrine and pretty much believed it.  <br/>\nFinally, because of basic doctrinal flaws and misteaching,  I no <br/>\nlonger call myself Christian, though I believe in God and still <br/>\nworship him/her in my own way.  One of the basic things I cannot <br/>\ntolerate in a religion of Love is the hurting of other people.  <br/>\n<br/>\nGod does not ever harm us.....he/she allows us to learn from the <br/>\nconsequences of our own actions.  This is how I raise my children, <br/>\nand this is why I believe people have to go through hard things in <br/>\ntheir lives....to learn the lessons they specifically came here to <br/>\nearth to learn.  <br/>\n<br/>\nRead the first five books of the Bible, which we call the Books of <br/>\nLaw or the Torah.  This is the Law which God gave to Moses and <br/>\nwhich he intended the children of Israel to live by.  What is <br/>\nmentioned in these five books about childrearing and discipline? <br/>\n<br/>\nDeuteronomy 1:39 says &quot;And the little ones that you said would be <br/>\ntaken captive, your children who do not yet know good from bad--<br/>\nthey will enter the land.  I will give it to them and they will take <br/>\npossession of it.&quot; <br/>\n<br/>\nFrom this we learn that young children do not know good from bad. <br/>\n Their actions are not intentionally defiant or disobedient.  The <br/>\nreason these children could enter the land is that they were <br/>\nconsidered guiltless.  They were not held accountable for any <br/>\nwrong actions.<br/>\n<br/>\nDeuteronomy 6:6-9 says &quot;These commandments that I give you <br/>\ntoday are to be upon your hearts.  Impress them on your children.  <br/>\nTalk about them when you sit at home and when you walk along <br/>\nthe road, when you lie down and when you get up.  Tie them as <br/>\nsymbols on your hands and bind them on your foreheads.  Write <br/>\nthem on the doorframes of your houses and on your gates.&quot; <br/>\n<br/>\nThis passage injoins the parent to give verbal instruction to their <br/>\nchildren, and to use every opportunity to impress God&#39;s commands <br/>\nupon them.  He also encouraged us to give our children visible <br/>\nreminders of God&#39;s expectations and promises. <br/>\n<br/>\nDeuteronomy 21:18-21 says &quot;If a man has a stubborn and <br/>\nrebellious son who does not obey his father and mother and will not <br/>\nlisten to them when they discipline him, his father and mother shall <br/>\ntake hold of him and bring him to the elders at the gate of his town. <br/>\n They shall say to the elders, &#39;This son of ours is stubborn and<br/>\nrebellious.  He will not obey us.  He is a profligate and a drunkard.&#39;  <br/>\nThen all the men of his town shall stone him to death.  You must <br/>\npurge the evil from among you.  All Israel will hear of it and be <br/>\nafraid.&quot; <br/>\n<br/>\nThis passage is instruction given to parents whose GROWN child <br/>\nhas become a profligate and a drunkard.  A profligate was <br/>\nsomeone who spent all his money on riotous living, like the <br/>\nProdigal Son of Luke 15:11-32.  The purpose of the stoning was not <br/>\nto change the behavior of this adult child, but to purge evil from the <br/>\nhouse of Israel.  The parents said that their discipline had not <br/>\nchanged his behavior, so now he had to be punished.  That<br/>\nis the difference between discipline and punishment.  A child is <br/>\ndisciplined while there is still hope of him changing.  Punishment is <br/>\na final judgement of God against a person when there is no longer <br/>\nany hope of changing his heart.  Punishment is not a form of <br/>\ndiscipline, and this stoning is not an example of discipline.  In<br/>\ndiscipline, we show grace to the child.  In punishment, God shows <br/>\njustice. <br/>\n<br/>\nAs parents, we are required to show to our child the same grace in <br/>\ndiscipline that God has shown us.  Since we no longer live under <br/>\nthe Old Law, punishment is something we leave to God when all <br/>\nour efforts to discipline have failed. <br/>\n<br/>\nThink about this father and mother in the example above.  They <br/>\nknew that stoning would end the life of their child.  No matter what <br/>\na child has done, a mother always loves her child and wants the <br/>\nbest for him.  Before taking their child to the elders of the city, they <br/>\nwould have tried every possible loving method of discipline.  They<br/>\nwould not have taken their child there if there had been any hope <br/>\nthat he would change.  Knowing that children are often impetuous <br/>\nin their youth, but often grow out of this as they mature, they would <br/>\nhave brought the child up until he was an adult, always hoping he <br/>\nwould heed their discipline and change.  Only when he was an adult<br/>\nwould such an extreme measure be taken.  This kind of treatment <br/>\nwould never have been given a child. <br/>\n<br/>\nThese three passages constitute everything God said to the <br/>\nchildren of Israel specifically about parenting.  You will<br/>\nnotice that while they are told to discipline, spanking or the use of <br/>\nthe &quot;rod&quot; is not mentioned anywhere in the books<br/>\nof Law.  Parents were allowed to decide individually what kind of <br/>\ndiscipline was best for their special and unique<br/>\nchild.  The were NOT taught that spanking was required. <br/>\n<br/>\nChristians who maintain that spanking is manditory discipline for <br/>\nchildren are applying a one-size-fits-all approach to parenting which <br/>\nis in contradiction to Proverbs 22:6.  In this passage, the original <br/>\ntext indicates that we are to parent children according to their God-<br/>\ngiven inborn design.  We are to respect their individual differences<br/>\nand train them accordingly.  Spanking is not necessary or <br/>\ndesirable in most cases where discipline is required, and is <br/>\ncertainly not mandatory to good Christian parenting. <br/>\n<br/>\nMany Christians point to Hebrews 12:5-6 which says &quot;My son, do <br/>\nnot make light of the Lord&#39;s discipline, and do not lose heart when <br/>\nhe rebukes you, because the Lord disciplines those he loves, and <br/>\nhe scourges everyone he accepts as a son.&quot;  The writer of <br/>\nHebrews was quoting Proverbs 3:11-12 which makes this same <br/>\nstatement.  They point to the word &quot;scourges&quot; (also translated <br/>\ndisciplines, chastises) and say that this is the same kind of<br/>\nscourging Paul received when he was beaten, perhaps the same <br/>\nkind of scourging Jesus received before he was<br/>\ncrucified. <br/>\n<br/>\nThere are two ways you can take this passage, literally and <br/>\nmetaphorically.  If you take the passage literally, you<br/>\nare saying that you believe that each child should be physically <br/>\nscourged and beaten in the same way Paul and Jesus were.  <br/>\nThese beatings often resulted in a bleeding and bruised body for <br/>\nthe recipient.  I don&#39;t believe that those who advocate spanking <br/>\nwould say that children ought to receive this kind of scourging, <br/>\nwhich would be physically damaging to the child.  So we are forced <br/>\nto conclude that this passage is used metaphorically. <br/>\n<br/>\nGod doesn&#39;t actually beat us up with a whip; he does use the <br/>\ncircumstances of our lives to discipline us.  This is<br/>\nwhat he expects us to do with our children as well.  There are <br/>\nmany creative and effective ways of guiding children<br/>\ntoward right behavior without using spanking or any other form of <br/>\ndiscipline that would hurt them. <br/>\n  <br/>\n<br/>\nA Definition of &quot;Discipline&quot; <br/>\n<br/>\nMy way of defining discipline is simply that it is a framework which <br/>\nprovides motivation for right behavior.  Once the frame of a house is <br/>\nset upon the foundation, the builders are pretty much committed to <br/>\na particular shape and style of house.  While our foundation is, of <br/>\ncourse, Jesus Christ, the framework which we use to shape the <br/>\nhouse is called Attachment Parenting. <br/>\n<br/>\nWhen a child is parented according to attachment parenting <br/>\nprinciples, he has learned to trust his parents because<br/>\nof their consistently sensitive care of him.  He intuitively trusts what <br/>\nthey say, and is easier to discipline.  The<br/>\ndiscipline is based upon their intimate relationship, and his <br/>\ndependence upon it.  When there is a &quot;break&quot; or<br/>\ndisruption in the attachment relationship caused by the child&#39;s <br/>\nbehavior, he is highly motivated to re-establish the<br/>\nsecurity and intimacy of that relationship.  He does not like the <br/>\nfeeling of having physical or psychological space<br/>\nput between him and the parent.  He will change his behavior in <br/>\norder to come back into a right relationship with<br/>\nthe parent, which means he can once again enjoy the physical and <br/>\nemotional comfort and security that this<br/>\nrelationship provides. <br/>\n<br/>\nThis is exactly what God does when we sin.  He does not leave us <br/>\nin the sense that he stops caring for us, but he<br/>\ndoes break fellowship with us until we have repented.  This is what <br/>\nwe as parents should do.  We still continue to<br/>\ncare for the needs of our child, but we withdraw fellowship from <br/>\nhim.  This is so uncomfortable for him emotionally<br/>\nthat he quickly seeks to change his behavior and repent. <br/>\n<br/>\nTrust is based upon the meeting of physical needs.  A child who <br/>\ndoes not trust his parents to take care of him will<br/>\nnot respect their guidance and discipline either.  By not using <br/>\nattachment parenting principles, parents are forced<br/>\ninto a position where they must use more aggressive disciplinary <br/>\ntechniques. <br/>\n<br/>\nWhen a child misbehaves, the first question to ask is, &quot;What need <br/>\ndoes my child need that I have ignored or<br/>\noverlooked?&quot;  or &quot;What aspect of our shared relationship has been <br/>\nviolated? <br/>\n<br/>\nSome researchers believe that over 50% of the adults currently <br/>\nincarcerated in prisons are there as a direct result of<br/>\ndisturbed attachment relationships or complete attachment breaks <br/>\nduring childhood.  Each person needs to be part<br/>\nof a healthy, shared attachment relationship to develop normally.  <br/>\nSpanking is one avenue for introducing attachment breaks into the <br/>\ninternal working model, though it is not the only avenue.  When a <br/>\nchild is spanked, even though the rest of his experiences with his <br/>\nparents are positive, an unknown element has been introduced into<br/>\nhis world which causes him to question his parents.  Spanking <br/>\ncauses the child to feel disrespected on a very basic level.  This <br/>\neffects different children in different ways, depending on their <br/>\nindividual temperaments.  You never know how it is going to effect <br/>\nyour particular child. <br/>\n<br/>\nIn my opinion, with so many other effective disciplinary methods, <br/>\nspanking is undesirable and rarely needed.  Also, since spanking <br/>\nwas not specifically commanded in the Law of Moses, it was not <br/>\nsomething God expected them to do.  Remember that the Law was <br/>\nconsidered perfect, and those who followed it perfectly (which is no <br/>\none, of course) could be considered right with God.  If God didn&#39;t <br/>\nthink spanking was necessary for the parent to be a &quot;good parent&quot; <br/>\nor didn&#39;t think it was necessary for the child, then why do we say <br/>\nthat it IS necessary, since God never wrote a word about it?<br/>\n<br/>\nSince the New Testament is based upon disciplining with grace, <br/>\nspanking would not be in harmony with New Testament teaching. <br/>\n<br/>\nOne final verse which often gives parents trouble is the verse &quot;He <br/>\nwho spares the rod hates his son, but he who loves him is careful <br/>\nto discipline him&quot; (Proverbs 13:24).   The word &quot;rod&quot; is used in <br/>\nvarious ways in scripture, and in the original Hebrew there were <br/>\neight to ten different meanings for the word.  The pole that <br/>\nshepherds used to guide their sheep along the road was called a <br/>\nrod.  It was not used to hit the sheep, but to guide them as they<br/>\nwalked and keep them on the road.  This would correspond to the <br/>\nframework we talked about earlier.  It is simply a guide.  The <br/>\nshepherd also had a large club called a rod which he used to drive <br/>\naway predators, but it never was used to hit the sheep.  God also <br/>\nspoke of the &quot;rod of my mouth&quot; which he used for discipline also.  <br/>\nIn short, the rod was any article or method used to guide, teach, or <br/>\ndiscipline.  It did not have to be a physical method, either, or<br/>\nGod could not have used his mouth as a rod. <br/>\n<br/>\nThe verse is correct in that, if you do not provide discipline for your <br/>\nchild, he will learn to behave badly.  But the rod in this verse is not <br/>\nspecifically referring to spanking, but to any disciplinary method <br/>\nwhich gets the job done. <br/>\n  <br/>\n<br/>\nMany parents prefer spanking because it&#39;s quick and easy, and <br/>\ngets the behavior stopped right away.  But children learn through <br/>\nmodeling, and though spanking does show the child that you <br/>\ndisapprove of this behavior, it does not teach what is right behavior. <br/>\n We can find a similar analogy with the Old and New Testaments.  <br/>\nIn the Old Law, there was a standard, and people were expected to <br/>\nlive by the standard.  Just because people knew the Law and that <br/>\nthey would be punished for disobeying it, that did not keep the <br/>\npeople from disobeying.  In the New Testament, we are given the <br/>\nHoly Spirit to empower us to live righteously.  Yet, we expect our <br/>\nchildren to obey with only the threat of punishment to keep them <br/>\nfrom sinning.  If it did not work in the Old Law, it will not work<br/>\nnow.  Indeed, we have been given a more excellent way.  We need <br/>\nto teach them from the standpoint of an inner knowledge of <br/>\nrightness rather than an externally imposed law.  We need to teach <br/>\nthem to be Spirit-led believers, notPharisaical lawkeepers.  Most <br/>\nimportantly, we need to model grace to them in every encounter we <br/>\nhave. <br/>\n<br/>\nBriefly, I would like to talk about the Proverbs 23:13-14 which says,<br/>\n&quot;Do not withhold discipline from a child; if you punish him with the <br/>\nrod, he will not die. Punish him with the rod and save his soul from <br/>\ndeath.&quot;  Once again, the word punishment is used in this passage, <br/>\nso we know that this passage was talking about an action which <br/>\nwas a last resort type of thing.  It was very physically painful and <br/>\nwould NOT have been applied to anything but a grown child.  Also, <br/>\nthese verses were NOT part of the Law of Moses, but were added <br/>\nmuch later.  They were supposedly wise sayings from a king.  <br/>\nHowever, for much of the history of the Jews these sayings were <br/>\nnot available, and they were not required to adhere to them as part <br/>\nof the Law.  So while some people may like these sayings, the <br/>\nJews were not required (by God) to adhere to them as part of the <br/>\nperfect nature of the Law, although certainly, the Jewish leaders <br/>\nmay have tried to bind this man-made commandment upon the <br/>\npeople.  Indeed, anyone who knows anything about the Jews know <br/>\nthat they loved to write commentaries on the scripture, giving their <br/>\nown interpretation and binding that upon people.  I look at this <br/>\nverse as just one of those commentaries.  <br/>\n<br/>\nSo, there are NO verses in the Law of Moses or the New <br/>\nTestament which in any way lead us to believe spanking is <br/>\nacceptable.  And the commentaries on the law are just <br/>\nthat....commentaries, and open to interpretation.  I believe the <br/>\ncommentaries, and especially the books of poetry (Job, Psalms, <br/>\nProverbs, Ecclesiastes, Song of Solomon) are wonderful books, <br/>\nbut not divinely inspired, simply wisdom literature written by wise <br/>\nindividuals.  They had much to say that was valuable, but they <br/>\nwere not speaking for God in all cases.<br/>\n<br/>\nHope that clears up the confusion.  Thanks.<br/>\n<br/>\nJudie</div>","specialLinks":[]},{"userId":0,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valfitz@...&gt;","replyTo":"LIST","senderId":"lY5quDBBTPTl_cPrxsba4MdwwNWe2PKnhHYOQVafdWVtep5L0_w-Wh5wESXK-b_wHfGQr1TePj7iHJORJqn1Vp1Sd6k","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Spanking....the book","postDate":"989124911","msgId":20644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkMmxmZitiOWtnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":20656,"prevInTime":20643,"nextInTime":20645,"topicId":20644,"numMessagesInTopic":0,"msgSnippet":"I ve been thinking about the spanking chapter for my book. I suggested in a post yesterday (half-heartedly) that I would love to quote the anti-spankers in","messageBody":"<div id=\"ygrps-yiv-334566075\">I&#39;ve been thinking about the spanking chapter for my book. I <br/>\nsuggested in a post yesterday (half-heartedly) that I would love to <br/>\nquote the anti-spankers in here and give them credit if they agreed. <br/>\nI think I might really like to do that. You all spoke so eloquently <br/>\nand passionately about it. Would any of you consider allowing me to <br/>\nuse your opinions in the book?<br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]}],"prevTopicId":20570,"nextTopicId":20658}}