{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Free your Mind - Free the Children (food/Bed issues)","postDate":"1030043561","msgId":8668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwODIyMTkxMjQxLjIwODQ0LnFtYWlsQHdlYjEzNzA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMzAwMzUxNjUuMTkyNS45MTEwLm0xMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":8667,"nextInTime":8669,"topicId":8668,"numMessagesInTopic":0,"msgSnippet":"Okay, so I don t like the use of UN to describe my life in all facets.  I don t even like the term Unschooling.  I would rather be defined by what I/we do than","messageBody":"<div id=\"ygrps-yiv-1978146631\">Okay, so I don&#39;t like the use of UN to describe my<br/>\nlife in all facets.  I don&#39;t even like the term<br/>\nUnschooling.  I would rather be defined by what I/we<br/>\ndo than by what we do not.  Unfooding is not even<br/>\naccuarate (as someone pointed out) and neither is<br/>\nUnbedding, although DeRegulating might be, but is<br/>\nstill a negative.  So I will just use the terms <br/>\nNatural Living and Natural Learning, and the concept<br/>\nof Freedom within the family.<br/>\n<br/>\n&lt;&lt; But what do you do when they are real miserable and<br/>\nit&#39;s obvious it&#39;s because they didn&#39;t get enough<br/>\nsleep? &gt;&gt;<br/>\n<br/>\nThere are plenty of adults that are like this too, who<br/>\ndon&#39;t get enough sleep regularly, and what do you do<br/>\nwith them aside from put up with their miserablness<br/>\nand MAYBE gently suggest that they get more sleep?<br/>\n<br/>\nBut with my kids, I find that they often just do not<br/>\nwant to go to sleep alone.  My oldest in particular,<br/>\nis not able to go to sleep in a room where other<br/>\nactivities are taking place, even if the other<br/>\nactivities are just me using the computer or talking<br/>\nto anyone, but needs to have someone in bed with him. <br/>\nIf I am reading silently in bed (he goes to sleep in<br/>\nmy bed) or knitting, or reading to him or something<br/>\nlike that, he can go to sleep.  It doesn&#39;t take long<br/>\nusually.  Less light helps.  <br/>\n<br/>\nHowever, you do have to be willing to stop what you<br/>\nare doing and take 30 minutes (or more or less) to put<br/>\nthem down when they are asking you to.  Kids do not<br/>\noften use words to ask for this kind of thing.  They<br/>\ntry to show you by their actions what they need.  The<br/>\nyounger they are, the less able they are to even<br/>\nrecognize and articulate their feelings and needs. <br/>\nYou will know by their actions that they are ready to<br/>\ngo to bed, and that they want you to help them get<br/>\nthere.  This is typical kid behavior.  They are<br/>\nconstantly reaching out to the adults around them<br/>\nwanting to be understood, supported, sometimes even<br/>\nwanting to be argued with just so they know you are<br/>\npaying attention and care enough to take a stand about<br/>\ntheir welfare.  You have to read your kids behavior<br/>\nand be available to help them settle into sleep.  Some<br/>\nday they will be able to do it on their own (like we<br/>\ndo) but right now they need us (generally, there are<br/>\nalways exceptions.)<br/>\n<br/>\nGenerally both my kids fall asleep in my bed (or my<br/>\nyoungest sometimes requests his own bed after he lies<br/>\nwith me long enough to get sleepy) and then we move<br/>\nthem to their own beds after they are asleep.  They<br/>\nare welcome to come back if they have bad dreams or<br/>\nwhatever wakes them up, but none of us sleep well when<br/>\nwe are all crammed into one bed all night.  They<br/>\nusually come tumbling sleepily into our bed in the<br/>\nmorning for a cuddle before they start their day as<br/>\nwell, particularly my youngest, who usually asks for<br/>\nhis own bed at night.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Tickling and teasing probably have never helped a<br/>\n&gt;miserable person ever.  <br/>\n<br/>\n </span></blockquote>I agree.  I think it is a totally different situation<br/>\nfor kids to be teasted by adults, because they are not<br/>\non equal footing.  It is like that uncomfortable<br/>\nfeeling you get when you are teased by your boss or<br/>\nanother authority figure.  Kids are dependent on<br/>\nadults, adults are bigger and in control of the world.<br/>\n They intimidate kids.  Kids have to work up the nerve<br/>\nas they grow older to tease back without fear. <br/>\nTeasing an out of sorts kid just adds humiliation to<br/>\nthe bargain.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Kids learn to regulate themselves from failures to do<br/>\n&gt;so, not from the words of other people.<br/>\n<br/>\n </span></blockquote>This is I think the biggest mistake that people make<br/>\nin raising kids: never letting them make their own<br/>\nmistakes.  For example with this food issue, when I<br/>\nwas letting go more about food (which was a long<br/>\nprocess because of my older sons many dangerous<br/>\nallergies, and he had to be old enough to know caution<br/>\nabout what he put in his mouth) I recall a incident. <br/>\nMy younger son, just barely three, had a bag of gummy<br/>\nworms, and he decided to eat the whole thing.  After<br/>\nthat, he threw up.  Now he remembers and doesn&#39;t go<br/>\noverboard with sweets, although he has as much of a<br/>\nsweet tooth as ever.  He is more inclined to ask for<br/>\ntunafish, carrots, a banana, a grilled cheese<br/>\nsandwich, before sweets, and he paces himself and<br/>\ndoesn&#39;t eat too many sweets.  Now if only his brother<br/>\nwould OD on sweets and learn the same lesson, but he<br/>\nseems to have unlimited capacity to live on nothing<br/>\nbut sugar.  :-/  lol<br/>\n<br/>\n&lt;&lt;And finally, my three year old has been asking to<br/>\nsleep with me. &gt;&gt;<br/>\n<br/>\nSandra had good suggestions about this.  I will also<br/>\nadd a couple.  Can you put your mattress set on the<br/>\nfloor and put addditional ones around for the kids? <br/>\nWhat about a family snuggle or cozy place (as someone<br/>\nsuggested - forgive me but I am on digest and<br/>\nsometimes forget authors unless I cut and paste) where<br/>\nthe whole family is free to snuggle down at bedtime,<br/>\nand then you disperse the kids to their own places<br/>\nafter they drift off?<br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":8635,"nextTopicId":8664}}