{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Effortlessly and beautifully (Joyce Fetteroll)","postDate":"1371967794","msgId":71655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0ODI2QkEzLTY5NTktNEIzNS1COUZGLTI2Q0YxQTZENDIyQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":71654,"nextInTime":71656,"topicId":71655,"numMessagesInTopic":0,"msgSnippet":"Joyce wrote something new and wonderful, elsewhere.  This is a rerun for another audience. _______________________________________ Because learning skills is","messageBody":"<div id=\"ygrps-yiv-975589343\">Joyce wrote something new and wonderful, elsewhere.  This is a rerun for another audience.<br/>\n<br/>\n_______________________________________<br/>\n<br/>\nBecause learning skills is often hard in school, it&#39;s assumed learning those skills is hard. What unschoolers have found -- and some of us have been at this for nearly 20 years so it&#39;s not theory -- that the skills are easy to learn. What makes learning hard is pulling the skills out of context then teaching them in isolation to children who don&#39;t yet have a personally meaningful reason to learn them.<br/>\n<br/>\nThe difference between learning algebra in school and learning how to think algebraically is the difference between learning Spanish in school and learning to speak from the time you&#39;re born. The first is hard and works poorly. The second happens effortlessly and works beautifully.<br/>\n<br/>\nOther than learning to speak, and occasionally running across a child who learned to read before school, most people have not seen profound learning happen without instruction. Unschoolers have. So what you&#39;re asking is like an ancient person demanding that someone prove to him the world isn&#39;t flat and that the sun doesn&#39;t go around the earth when what he believes is plain as day before his eyes. You and that ancient person can only believe what is evident before you so what uschoolers -- who&#39;ve figuratively been to the moon and around the spherical earth -- say sounds like fairy tales and nonsense.<br/>\n<br/>\nChildren learn to read, learn to think mathematically, learn about how the world works by living in the world and in a rich home environment, by being supported in pursuing what interests them. All the skills that schools fret over are part of life. It&#39;s hard for schooled people to see the skills in their wild state because schools pull them out of context and wash them with dullness. The skills don&#39;t look like what schools do. Learning mathematical thinking looks like playing video games, cooking, deciding what your allowance will buy, playing with Legos and a myriad of other things that look even less like math. Kids learn to read by having positive experiences with print, being read to, listening to audiobooks, video games (again!), living in a world of signs, having someone to answer their questions and so on though most importantly being developmentally ready. (Most kids struggling in school to read aren&#39;t developmentally ready.)<br/>\n<br/>\nIt sounds arrogant, but long time, analytically minded unschoolers know *way* more about learning than educators. Educators only know kids who&#39;ve been learning in school. They don&#39;t know what natural kids look like. It would be like if all animal experts only knew animals who were kept in cages. People who lived in natural areas with animals would be dismissed for the nonsense they were spouting about how fast cheetahs can run and how polar bears can swim beneath the ice.<br/>\n<br/>\nIt&#39;s a waste of words to try to convince you of what we know because it can&#39;t match your experience with institutionalized children. Please do read what&#39;s been linked. Read how natural learning happens. Once you&#39;ve seen enough of kids learning in the wild to understand we&#39;re not spouting rose-colored wishes, then people here can use their time more efficiently clearing up any questions you still have.<br/>\n_______________________________________<br/>\n<br/>\nI love &quot;fairy tales and nonsense.&quot;  I love the rose-colored wishes.  <br/>\n<br/>\nThe original (for those who have facebook access and time and curiosity) is here:</div>","specialLinks":[]}],"prevTopicId":71628,"nextTopicId":71656}}