{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Lois Hoover","from":"Lois Hoover &lt;lhoover@...","replyTo":"LIST","senderId":"VbCFBKmnb8swVUYzXTErh-Lb_DaLUq5kiDGBGDbRbIvn64mHhIq1vrhOUCLW5ga8gWLQNOj70Q_h8N0ImHRE9M8uHh97","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: FWD: Christian Science Monitor article","postDate":"928603063","msgId":564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41NC41NjQuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":424,"nextInTopic":0,"prevInTime":563,"nextInTime":565,"topicId":424,"numMessagesInTopic":0,"msgSnippet":"... I can t believe this was said. A lot of people have mentioned over the lists how so many family and friends come from traditional ps system and don t","messageBody":"<div id=\"ygrps-yiv-610312883\"><blockquote><span title=\"ireply\">&gt;From: Helen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Helen@...\">Helen@...</a>&gt;<br/>\n&gt;<br/>\n<br/>\n&gt;&quot;If a large percentage of families begin to home-school, the result<br/>\n&gt;would be the loss of a terribly important piece of the community: the<br/>\n&gt;public school,&quot; says Frank Newman, president of the Education Commission<br/>\n&gt;of the States, in Denver.<br/>\n&gt;<br/>\n&gt;&quot;Schools are the community glue, and when people don&#39;t feel they have a<br/>\n&gt;stake in the community, then things deteriorate badly,&quot; Mr. Newman adds.<br/>\n&gt;&quot;This society desperately needs more of a sense of community, not less.&quot;<br/>\n&gt;<br/>\n </span></blockquote>I can&#39;t believe this was said. A lot of people have mentioned over the<br/>\nlists how so many family and friends come from traditional ps system and<br/>\ndon&#39;t understand hsing. But a comment like this seems so unreal to me. In<br/>\nthe days before mass ps, there was community a lot more community.<br/>\nCommunity was found in the neighborhoods not in a classroom, even when ps<br/>\nbecame mandatory. ONe of the greatest sources of information my children<br/>\nhave is the stories from my grandparents who tell them of their adventures<br/>\nfrom life. Many of them involve the cost of food at the first mcdonald&#39;s or<br/>\nexperiences in the war. But they have also learned a great deal about what<br/>\nour area was like &quot;back then&quot;.  <br/>\n<br/>\nONe great story that has to deal with how the community took care of itself<br/>\nis this. My grandfather had a friend (they were teens) who after seeing a<br/>\nset of wine glasses that were brought over from Germany as a family set,<br/>\nstole these glasses and gave them to his mother (family also from germany)<br/>\nas a gift. Upon confronting the friend, the friend admitted the truth.  He<br/>\nbegged my grandfather not to tell his mother. After thinking about it, my<br/>\ngrandfather agreed not to on the condition that he (my grandfather) could<br/>\ntake one item from this boys house to replace the wine glasses. The boy<br/>\nagreed. My grandfather walked in and took a painting of the Ruins of the<br/>\nRhine (painted on the back side of the glass with inlaid mother of<br/>\npearls...). The boy couldn&#39;t believe that this was happening,but he&#39;d made<br/>\na deal.  The ending of the story is that for the rest of their lives this<br/>\nboys parents left the wall empty and would remark from time to time how<br/>\nthey missed the picture that had been there, the boy never (to anyone&#39;s<br/>\nknowledge) stole anything out of his guilt we are told.  My grandfather has<br/>\nnow passed this picture on to me to remember the story, and because I&#39;ve<br/>\ngrown up admiring it and spending hours on end studying it as a child.<br/>\n<br/>\nHere in this story, we have lessons being learned and two families remained<br/>\nfriends even supporting each other over the years. What would happen today.<br/>\nthe boy who stole the glasses would have been reported to the police who<br/>\nwould have slapped his wrists or possibly given him time in Juvinile hall<br/>\nif this wasn&#39;t his first theft. Or maybe everyone would have learned at<br/>\nschool what he had done and they would have picked on him until he broke or<br/>\ndecided to be exactly what they all thought he was, a no good theif who<br/>\ncouldn&#39;t ever be trusted. If he was made to return the glasses or pay<br/>\nrestitution would he have ever learned the lesson he learned?  <br/>\n<br/>\nNo IMO the only community that we have is right in the area we live,<br/>\nschools with their zero tolerance, gangs, or whatever is not community. it<br/>\nis an unnatural environment. to hear people talk about schools as if they<br/>\nhold a significant position in the society seems like a stretch, schools by<br/>\ntheir design are to educate the masses and get them ready for factory work,<br/>\nnot hold the community together. <br/>\n<br/>\nLois</div>","specialLinks":[]},{"userId":0,"authorName":"Helen","from":"Helen &lt;Helen@...","replyTo":"LIST","senderId":"ouMhuT5UCq4GyZmzOVEIXJRpAyPCvja3YQf4Tup-WENN3-i4VwVvxKUXulqaZK9NwzCtLajA0jz1uq1K98UTimD1vLA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FWD: Christian Science Monitor article","postDate":"928511570","msgId":424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40OC40MjQuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":564,"prevInTime":423,"nextInTime":425,"topicId":424,"numMessagesInTopic":0,"msgSnippet":"From: Dale  Reed  http://www.csmonitor.com/durable/1999/06/04/fp3s1-csm.shtml FRIDAY, JUNE 4, 1999 USA Home schooling s latest","messageBody":"<div id=\"ygrps-yiv-1104974996\">From: &quot;Dale  Reed&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dale-reed@...\">dale-reed@...</a>&gt;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.csmonitor.com/durable/1999/06/04/fp3s1-csm.shtml\">http://www.csmonitor.com/durable/1999/06/04/fp3s1-csm.shtml</a><br/>\nFRIDAY, JUNE 4, 1999<br/>\nUSA<br/>\nHome schooling&#39;s latest appeal: safety<br/>\nColorado shootings contribute to a surge of inquiries about teaching at<br/>\nhome.<br/>\n<br/>\nJillian Lloyd<br/>\nSpecial to The Christian Science Monitor<br/>\nDENVER<br/>\n<br/>\nJanice Quitmeyer heard the first news of the Columbine High School<br/>\nshooting on her car radio, while driving with her three children. As she<br/>\nlistened in shock to the report, her 9-year-old son posed a question:<br/>\n&quot;Doesn&#39;t this make you glad that you home- school us, Mommy?&quot; Indeed it<br/>\ndid. And in the weeks since the school massacre in Littleton, Colo., a<br/>\nhost of other parents apparently are nurturing similar sentiments toward<br/>\nhome schooling.<br/>\n<br/>\nHome-school organizations nationwide report that inquiries have<br/>\nincreased almost fourfold since Columbine. And as public faith in<br/>\nAmerica&#39;s schools continues to erode, the choice of a growing number of<br/>\nparents is driven as much by safety concerns as by academic and ethical<br/>\nstandards.<br/>\n<br/>\nTHAT&#39;S A LOT OF HOMEWORK: Eoin Gaj prepares a report for a book group he<br/>\nattends at a local library. His mother, like an increasing number of<br/>\nparents, teaches him at home in Cambridge, Mass.<br/>\nJOHN NORDELL - STAFF<br/>\n------------------------------------------------------------------------<br/>\n--------<br/>\n&quot;The day after Columbine, our phones starting ringing off the hook,&quot;<br/>\nsays Michael Farris, president of the Home School Legal Defense<br/>\nAssociation in Purcellville, Va. &quot;People called us saying, &#39;We really<br/>\nneed to begin home-schooling. We&#39;ve been thinking about this for a long<br/>\ntime, and this is the straw that broke the camel&#39;s back.&#39; &quot; In recent<br/>\nyears, safety issues have been more on the minds of parents who opt for<br/>\nhome schooling. But it was the horror of the April 20 fatal shootings at<br/>\nColumbine - in the heart of suburban America - that brought focus to the<br/>\nissue for many who before were uncertain about educating their children<br/>\nat home.<br/>\n<br/>\n&quot;The main reasons for home schooling that have always existed are still<br/>\nthere. But the safety issue is becoming very prevalent,&quot; says Brian Ray,<br/>\npresident of the National Home Education Research Institute in Salem,<br/>\nOre. &quot;It makes home schooling look more attractive than it ever did.&quot;<br/>\n<br/>\nTrend may peak<br/>\n<br/>\nAn estimated 1.5 million children in the United States are home<br/>\neducated. Since 1985, the number of home-schooled students increased<br/>\nbetween 15 percent and 20 percent each year.<br/>\n<br/>\nYet in the aftermath of the latest wave of school violence, the<br/>\npercentage who switch to home schooling this year may peak.<br/>\n<br/>\n&quot;A young person coming into a school shooting a gun sets people off<br/>\ncompletely. And it&#39;s not just a few kids anymore,&quot; Dr. Ray says. &quot;I<br/>\nthink people recognize that.&quot;<br/>\n<br/>\n&quot;Somehow, school shootings seemed pretty remote to most people before,&quot;<br/>\nagrees Mr. Farris. &quot;After Columbine, it wasn&#39;t remote to anyone anymore.<br/>\nThe whole idea that &#39;this can&#39;t happen in my community&#39; is pretty much<br/>\nshattered.&quot;<br/>\n<br/>\nWhile interest in home schooling is on the upswing nationwide, the most<br/>\ndramatic increase is, not surprisingly, in Colorado. In the days since<br/>\nthe Columbine shooting, calls to the state Department of Education about<br/>\nhome schooling have more than doubled.<br/>\n<br/>\nMany parents readily volunteer that recent school violence prompted<br/>\ntheir call, says Suzie Parker, a program assistant there. &quot;I&#39;ve had<br/>\npeople call from around the state - not just in the Denver area - saying<br/>\nthat they don&#39;t feel their children are safe in the schools.&quot;<br/>\n<br/>\nAt Christian Home Educators of Colorado, the state&#39;s largest advocacy<br/>\norganization for home schooling, inquiry calls have more than quadrupled<br/>\nsince Columbine, reports Ms. Quitmeyer, the group&#39;s public-relations<br/>\ncoordinator.<br/>\n<br/>\nBut Quitmeyer - who home-schools her three children - cautions against<br/>\nhome schooling if parents&#39; motivation is purely for safety, she says.<br/>\n&quot;Home schooling is a way of life. It&#39;s a huge commitment. Your reasons<br/>\nfor home schooling have to go further than [safety].&quot;<br/>\n<br/>\nOther motives<br/>\n<br/>\nSafety concerns take various forms - and aren&#39;t restricted to gun-toting<br/>\nstudents, says Dorothy Karman, a Portland, Ore. mother, who<br/>\nhome-educated her son and daughter for 15 years (both are now enrolled<br/>\nin college).<br/>\n<br/>\nLong before school shootings hit the public consciousness, parents were<br/>\nmotivated by a desire to limit unwanted peer influences like drugs,<br/>\nalcohol, and premarital sex. &quot;Parents choose home schooling to have more<br/>\ninfluence over their child&#39;s life,&quot; she says. &quot;We spent a lot of time<br/>\ntogether as a family. And we still do.&quot;<br/>\n<br/>\nBut accompanying these reasons has been a recognition &quot;that public<br/>\nschools are pretty dangerous,&quot; says Farris of the Home School Legal<br/>\nDefense Association.<br/>\n<br/>\nDespite the benefits to home-schooled children, some identify a<br/>\nsignificant downside to the trend.<br/>\n<br/>\n&quot;If a large percentage of families begin to home-school, the result<br/>\nwould be the loss of a terribly important piece of the community: the<br/>\npublic school,&quot; says Frank Newman, president of the Education Commission<br/>\nof the States, in Denver.<br/>\n<br/>\n&quot;Schools are the community glue, and when people don&#39;t feel they have a<br/>\nstake in the community, then things deteriorate badly,&quot; Mr. Newman adds.<br/>\n&quot;This society desperately needs more of a sense of community, not less.&quot;<br/>\n<br/>\nPhilosophically, Farris doesn&#39;t disagree. &quot;Some parents do regret this,&quot;<br/>\nhe says. &quot;But they believe that the price for their own children is too<br/>\nhigh.&quot; Still, he doesn&#39;t believe the ideal America is one in which<br/>\nchildren are educated at home - or in private schools. &quot;I want public<br/>\nschools to improve to the point where parents can feel safe sending<br/>\ntheir kids there. I don&#39;t want people to have to choose home schooling<br/>\nout of fear. They should choose it on its own merits.&quot;<br/>\n---<br/>\nDo something a robot cannot do.<br/>\n$ <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dale-reed@...\">dale-reed@...</a>  Seattle, Washington U.S.A. $<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------<br/>\nGive back to your community through &quot;Grow to Give.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com\">http://www.onelist.com</a><br/>\nDeadline is June 19.  See homepage for details.<br/>\n------------------------------------------------------------------------<br/>\nKnow your laws, know your legislator</div>","specialLinks":[]}],"prevTopicId":533,"nextTopicId":566}}