{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":12252351,"authorName":"Gwen","from":"Gwen &lt;willow_selene@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"sports competition - update","postDate":"1235989435","msgId":42844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMDY0My4yNDQzNS5xbUB3ZWI1MDQwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":42843,"nextInTime":42845,"topicId":42844,"numMessagesInTopic":0,"msgSnippet":"A few weeks ago I wrote asking for suggestions about my daughter s upcoming Taekwondo tournament. I got some excellent feedback. Megan s tournament was","messageBody":"<div id=\"ygrps-yiv-1159427692\">A few weeks ago I wrote asking for suggestions about my daughter&#39;s upcoming Taekwondo tournament. I got some excellent feedback.<br/>\n<br/>\nMegan&#39;s tournament was Saturday and it went really well.  <br/>\n<br/>\nMegan had a great time hanging out a friend from class that she likes, but doesn&#39;t get to talk to very much.  We had a really long wait from when we got there 8:30am until Megan got to spar at around 3pm.  The biggest issue was that Megan didn&#39;t want to eat any lunch.  She was too excited and focused on other things.  We had packed all her favorite foods, but she didn&#39;t want to eat any of it.  We bought her a hot dog while we were there and she only ate about half of it.  If Megan is focused on something, she will forget to eat.  It isn&#39;t an<br/>\nissue at home and when we are out because there are natural breaks<br/>\nwhere I can remind her to eat or offer different foods.<br/>\n<br/>\nShe was in her sparring gear and sitiing on the mat for about thirty minutes before she was able to compete.  I was watching her sit on the mat waiting her turn and I could see she wasn&#39;t doing well.  But when I signaled her, she signaled back that she was ok.  Then I saw the look on her face that I know means her body has reached that point where it needs food NOW.  I could tell she wasn&#39;t ok, so I sent my husband over with some water (my two year old was alseep on my shoulder and my husband can be amazing at helping Megan to focus and breathe).<br/>\n<br/>\nJust as she and my husband were finishing the breathing exercises it was her turn.  I didn&#39;t know if she&#39;d want to spar at this point because she was so upset.  But she took a couple more deep breaths and got on the mat.  It was definitely a new experience for her (she spars once a week in class, but there is no coaching or direction...it is a bunch of little kids in pads trying to kick eachother, lol).  The boy she was sparring with was much quicker than she was used to and she said the mat was slippery.  It was over very quickly, but I did see that gleam of excitement in her eye, so I know she had fun.  She placed third and got a medal.  She wanted a medal and she got one, so she was happy.<br/>\n<br/>\nAs she came off the mat, her adrenaline dropped and she crashed.  She ate some cheese and we snuggled.  After a few minutes she was fine.  What I really loved was how supportive everyone was.  Her friend&#39;s parents made a special point of coming over to congratulate her and her friend was very sweet too.  Her teacher gave her a pep talk about doing better next time.  I think he was really worried about her (she&#39;s probably the most upbeat student he has).  But I told him that she hadn&#39;t eaten recently and she&#39;d be fine after she ate.  And she was.  By the time she&#39;d finished eating a piece of cheese she was back to her normal self:<br/>\n<br/>\nShe says she&#39;d like to do another tournament, but would like us to be more creative with her downtime.  Next time, I will probably walk her away from the tournament area to get some air/eat/connect and give her a chance to unwind a little.  She loved the sparring part, but didn&#39;t like all the waiting around.  <br/>\n<br/>\nGwen<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42825,"nextTopicId":42772}}