{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":31,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: adults who can&#39;t read?","postDate":"1318171195","msgId":63352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4NUQwMDA1LTM5NjAtNDJGNy1BRTEzLUJFQjQwRUQyMzEyQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJMVTAtU01UUDEzMDVGQzhCQzc2NzMxQTAzQzk4QjQ3QkZGQzBAcGh4LmdibD4=","referencesHeader":"PEJMVTAtU01UUDEzMDVGQzhCQzc2NzMxQTAzQzk4QjQ3QkZGQzBAcGh4LmdibD4="},"prevInTopic":63351,"nextInTopic":63353,"prevInTime":63351,"nextInTime":63353,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"-=-My Son goes to Summerhill A.S.Neills Democratic school and its not prevented OR dis-allowed(?) me from being  close and caring or growing as a a","messageBody":"<div id=\"ygrps-yiv-1004231992\">-=-My Son goes to Summerhill A.S.Neills Democratic school and its not prevented OR dis-allowed(?) me from being &quot; close and caring&quot; or &quot;growing as a a parent&quot;(whatever that means).-=-<br/>\n<br/>\nIf you don&#39;t know what &quot;growing as a parent&quot; might mean, it might be best not to discuss it.  If you put &quot;close and caring&quot; in quotation marks, it suggests sarcasm.<br/>\n<br/>\nIt&#39;s not about a school &quot;allowing&quot; or intending to prevent parents from being close to children, but a child who is at school will offload some of his emotions and opinions there, with other adults or with kids the parents don&#39;t know, and not share everything at home.  There will be may things that are outside the parents&#39;s direct knowledge, and none of the parent&#39;s business.<br/>\n<br/>\n-=-We can all have fantasys of What Ifs..and we can all make daft judgements in order to secure the insecurity of the &quot;rightness&quot; of our choices.Its Good to be aware of that I think.-=-<br/>\n<br/>\nI don&#39;t think unschooling is about fantasy.<br/>\n<br/>\n-=-in order to secure the insecurity of the &quot;rightness&quot; of our choices.-=-<br/>\n<br/>\nI don&#39;t know what that means, but it doesn&#39;t sound nice.<br/>\n<br/>\n-=-we can all make daft judgements-=-<br/>\n<br/>\nIf &quot;daft&quot; is as bad as &quot;ridiculous&quot; or &quot;stupid,&quot; I hope you won&#39;t use it again in these discussions.<br/>\n<br/>\nWhen each decision is made mindfully and with more than one good option in mind, there shouldn&#39;t be any &quot;daft judgements.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: adults who can&#39;t read?","postDate":"1318170197","msgId":63351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2c2FvbCt2NzM5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJMVTAtU01UUDEzMDVGQzhCQzc2NzMxQTAzQzk4QjQ3QkZGQzBAcGh4LmdibD4="},"prevInTopic":63350,"nextInTopic":63352,"prevInTime":63350,"nextInTime":63352,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"=-=Why do you think this? Perhaps this is an issue of your Seperation Anxieties not your kids?-=- I experience no separation anxiety. My kids happily go with","messageBody":"<div id=\"ygrps-yiv-1536361188\">=-=Why do you think this? Perhaps this is an issue of your Seperation Anxieties not your kids?-=-<br/>\n<br/>\nI experience no separation anxiety. My kids happily go with friends, and their Dads, and I am not anxious about separating from them at all. I do very much like being around them - that&#39;s my preference - but there&#39;s no anxiety attached to that.<br/>\n<br/>\nI&#39;m experiencing mild anxiety as Evan learns to drive. That&#39;s not about separation, though.<br/>\n <br/>\n-=-My Son goes to Summerhill A.S.Neills Democratic school and its not prevented OR dis-allowed(?) me from being &quot; close and caring&quot; or &quot;growing as a a parent&quot;(whatever that means).<br/>\n <br/>\nWe can all have fantasys of  What Ifs..and we can all make daft judgements in order to secure the insecurity of the &quot;rightness&quot; of our choices.Its Good to be aware of that I think.-=-<br/>\n<br/>\n<br/>\nThis isn&#39;t a what-if or fantasy. It&#39;s my life. I have experienced sending the boys to school; they both went to preschool and Evan went to a charter school through 2nd grade. I have also experienced NOT sending the boys to school, for the past 10 years. (Well, 9 for Seth, he chose to go to preschool until he was 4).<br/>\n<br/>\nI have experienced that feeling of edginess of &quot;needing&quot; &#39;me time&#39; and knowing it was just around the corner; I could have my time on Monday or the next day. I&#39;ve also experienced that same edginess, and moving *toward* the boys instead, making a happy connection with them, enjoying what they were doing, doing something sweet for them. I was not making the choice to do that when they were going to school. Could I have? Sure, but that wasn&#39;t part of my repertoire; I learned that from reading on this list, and on unschoolingbasics. I wouldn&#39;t have been reading this list had they continued to go to school.<br/>\n<br/>\nI actually didn&#39;t read this list for a few years. I didn&#39;t understand how the list worked, and I thought Sandra was kind of mean and judgmental. That was AS an unschooler, so I certainly wouldn&#39;t have been reading here if unschooling well wasn&#39;t a priority for me. If my kids went to school, why would I read an unschooling list?<br/>\n<br/>\nYou&#39;re right in that I don&#39;t know what my path would have been, had there been a Sudbury School. Isn&#39;t Summerhill a boarding school? I know I wouldn&#39;t have pushed myself to be closer with them if they weren&#39;t around at all - I wouldn&#39;t have had to! Even if they&#39;re day students, knowing I had that frequent time to myself would have stunted my willingness to make the choices I did. Growing closer with my sons wasn&#39;t easy, it involved re-experiencing the awareness of the pain of my own disconnected childhood, and healing from that. It WAS and IS simple, though, and that&#39;s something I learned from these lists, as well.<br/>\n<br/>\nWell, actually - I learned it through doing it! Through making those choices that brought me closer to the boys, not pushing them away, even subconsciously. I read it here, but I suppose some people read it here, and don&#39;t put it into practice. I learned it through experiencing the difference between keeping a distance, and making the choice to connect - a difference I would not have experienced if we hadn&#39;t been together every day. I know that because I didn&#39;t push myself to be closer when they went to school.<br/>\n<br/>\nI had the mistaken beliefs that &#39;parents NEED time away from their kids&#39; and &#39;I&#39;m an introvert, I NEED alone time&#39;. Why would I have challenged those things I &quot;knew&quot;, if I didn&#39;t want to be a better unschooling mom? There is a TON of support for both of those beliefs out there. <br/>\n<br/>\nI&#39;m not saying that someone who chooses to send their kids to school can&#39;t be close to their kids - I&#39;m talking about ME, with my particular childhood, my particular kids, my particular history and self-awareness. I do know I had NO IDEA how close & happy kids and parents could be, though, until I experienced it through being with them all of the time, most days. That&#39;s one of the reasons it&#39;s so difficult to get across the difference radical unschooling can make - until you&#39;ve made that shift, there are things you won&#39;t experience that are hard to put into words.<br/>\n<br/>\n-=-its not prevented OR dis-allowed(?) me from being &quot; close and caring&quot; or &quot;growing as a a parent&quot;(whatever that means).<br/>\n <br/>\nWe can all have fantasys of  What Ifs..and we can all make daft judgements in order to secure the insecurity of the &quot;rightness&quot; of our choices.Its Good to be aware of that I think.-=-<br/>\n<br/>\nI&#39;m going to gently point out here, that this was written by someone whose child does not live with her for months at a time, and who is not a radical unschooler. You cannot know what you haven&#39;t experienced. Why did YOU grow as a parent? Isn&#39;t it partly because you went to the unschooling conference there, and heard Sandra, and began incorporating a few unschooling principles into the time you were with your child? Living with your child a few months out of the year is different from living with them, full-time, every day. There is no way it couldn&#39;t be.<br/>\n<br/>\nI no longer have insecurity about the rightness of my choices - I see and live evidence of those choices every single day, in the happiness of my kids and myself, in their confidence and enthusiasm, learning and growth, and our good relationship. I have no need to make daft judgments - any judgment I make is based on years of experience, as an unschooling mom.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":126344350,"authorName":"Catherine Fox","from":"Catherine Fox &lt;catherinejfox@...&gt;","profile":"catherinejfox1812","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: adults who can&#39;t read?","postDate":"1318148741","msgId":63350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTAtU01UUDEzMDVGQzhCQzc2NzMxQTAzQzk4QjQ3QkZGQzBAcGh4LmdibD4="},"prevInTopic":63348,"nextInTopic":63351,"prevInTime":63349,"nextInTime":63351,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"If there had been a school already in place here and the boys had gone, I would not have allowed myself to become as close and caring with my sons as I have.","messageBody":"<div id=\"ygrps-yiv-2146257074\">&quot;If there had been a school already in place here and the boys had gone, I would not have allowed myself to become as close and caring with my sons as I have. I would not have grown as much as a parent, or as a person outside parenthood. (if there is such a separation)&quot;<br/>\n<br/>\nWhy do you think this? Perhaps this is an issue of your Seperation Anxieties not your kids?<br/>\n<br/>\nMy Son goes to Summerhill A.S.Neills Democratic school and its not prevented OR dis-allowed(?) me from being &quot; close and caring&quot; or &quot;growing as a a parent&quot;(whatever that means).<br/>\n<br/>\n We can all have fantasys of  What Ifs..and we can all make daft judgements in order to secure the insecurity of the &quot;rightness&quot; of our choices.Its Good to be aware of that I think.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: adults who can&#39;t read?","postDate":"1318087162","msgId":63348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQyREY4NjQ2LUJGOTktNDNFOC1BQUJFLUJBNDdFREUyNUVCQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo2bzVlbSt2bG5lQGVHcm91cHMuY29tPg==","referencesHeader":"PGo2bzVlbSt2bG5lQGVHcm91cHMuY29tPg=="},"prevInTopic":63347,"nextInTopic":63350,"prevInTime":63347,"nextInTime":63349,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"-=-I don t think I was ever that happy a day in my life as a kid, but I m pretty happy for him being so exuberantly happy now.-=- I remember feeling rich in","messageBody":"<div id=\"ygrps-yiv-344175314\">-=-I don&#39;t think I was ever that happy a day in my life as a kid, but I&#39;m pretty happy for him being so exuberantly happy now.-=-<br/>\n<br/>\nI remember feeling rich in joy if I had great plans for a few days.  Twenty weeks&#39; worth would have been heaven.<br/>\n<br/>\nAnd for a kid to gauge his happiness by how much he laughs out loud is a kind of self-knowledge few adults have. :-)<br/>\n<br/>\nThose kinds of reports are as indicative to me that unschooling is worth doing as all the tales of discovering science and history. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194427255,"authorName":"Julie","from":"&quot;Julie&quot; &lt;jmarkoski@...&gt;","profile":"jmarkoski","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: adults who can&#39;t read?","postDate":"1318033686","msgId":63347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2bzVlbSt2bG5lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2bzB1NSs1ajUwQGVHcm91cHMuY29tPg=="},"prevInTopic":63344,"nextInTopic":63348,"prevInTime":63346,"nextInTime":63348,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"First entry: Seth loves his iPod touch. Second entry: Seth loves his dog. Third entry: Seth loves his life. ... My 6 year old James said, just last night, that","messageBody":"<div id=\"ygrps-yiv-293016597\">First entry: Seth loves his iPod touch. Second entry: Seth loves his dog. Third entry: Seth loves his life. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; He is exuberantly happy, and I&#39;m grateful every day that we fell into unschooling, then deliberately chose radical unschooling. Evan was recently going through a tough time, and he said he knew it had gotten bad when he hadn&#39;t laughed out loud - really laughed - at least a couple of times every day. I was so surprised by that indicator of a not-bad day for him! And so appreciative that that was his yardstick.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>My 6 year old James said, just last night, that he loved his life so much and he had had so many plans for his day, that he couldn&#39;t get them all done..,that he had enough plans for 20 weeks and he wished he could&#39;ve done it all today!<br/>\n<br/>\nI don&#39;t think I was ever that happy a day in my life as a kid, but I&#39;m pretty happy for him being so exuberantly happy now.<br/>\n<br/>\nJulie<br/>\nJames, 6<br/>\nTyler, 4<br/>\nAudrey, 2</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: adults who can&#39;t read?","postDate":"1318029061","msgId":63344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2bzB1NSs1ajUwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1Vzhtdi12UDNvcDdfMk93T2dnYThIcEt1PWRRdjRLNUNQWXMtQUxzb0JrWHUxd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63342,"nextInTopic":63347,"prevInTime":63343,"nextInTime":63345,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"=-=I would love to know what seasoned unschoolers think of Sudbury Valley Schools?=-= As Sandra pointed out, they are, indeed, school. I was working to start","messageBody":"<div id=\"ygrps-yiv-2139153145\">=-=I would love to know what seasoned unschoolers think of Sudbury Valley Schools?=-=<br/>\n<br/>\n<br/>\nAs Sandra pointed out, they are, indeed, school.<br/>\n<br/>\nI was working to start one here - my introduction to natural learning came through finding out about Sudbury Valley School. I was in tears when I ordered their videotape and watched it for the first time. I thought, &quot;THIS is what school should be!&quot; Free kids (what I saw as free, then!), happy kids.<br/>\n<br/>\nWhile I was studying the model, making plans and finding like-minded folks, we started unschooling. I figured I&#39;d do that until the school got started. Somewhere along there, I got that it&#39;s fine to be close with your kids, it&#39;s fine to want to spend time together, and I dropped the idea of starting a school.<br/>\n<br/>\nIf there had been a school already in place here and the boys had gone, I would not have allowed myself to become as close and caring with my sons as I have. I would not have grown as much as a parent, or as a person outside parenthood. (if there is such a separation)<br/>\n<br/>\nI really, really GOT natural learning. I understood that my kids may well make choices I wasn&#39;t comfortable with, and their learning (had they gone to a Sudbury School) wouldn&#39;t look like school learning. I think I would have been a &quot;good&quot; Sudbury parent, not quizzing the kids, etc.<br/>\n<br/>\nI&#39;m much happier to have grown into being a good unschooling mom.<br/>\n<br/>\nAs I said, a Sudbury School is still school - students are expected to be there a minimum number of hours each day the school is in session, a minimum number of days a year. It&#39;s hard for me to imagine having a life so dictated by external forces now.<br/>\n<br/>\nAs Joyce pointed out, each school will have its own distinct community. To be called a Sudbury School, though, the school must be approved by someone from the Sudbury School itself, and they are rigorous about their guidelines being followed. That&#39;s why so many of these schools are &#39;democratic&#39; or &#39;open&#39;, rather than Sudbury - many of them want to offer classes or limit video games, etc.<br/>\n<br/>\nIf for some reason Seth HAD to go to school, my ideal would be to find the nearest Sudbury School - but I don&#39;t even want to think about that possibility! I captured a screen shot of his facebook page a couple weeks ago. First entry: Seth loves his iPod touch. Second entry: Seth loves his dog. Third entry: Seth loves his life. <br/>\n<br/>\nHe is exuberantly happy, and I&#39;m grateful every day that we fell into unschooling, then deliberately chose radical unschooling. Evan was recently going through a tough time, and he said he knew it had gotten bad when he hadn&#39;t laughed out loud - really laughed - at least a couple of times every day. I was so surprised by that indicator of a not-bad day for him! And so appreciative that that was his yardstick.<br/>\n<br/>\nI am still on the Sudbury discussion email list, because some really good conversations happen there. I&#39;m glad they&#39;ve been there as an alternative to mainstream school - and I&#39;m really, really glad we&#39;re unschoolers.<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: adults who can&#39;t read?","postDate":"1317996547","msgId":63342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBRkJGREQwLUVENTYtNDdERi05MjQ1LTQzNDY4MUVCMEI0NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBRzB1Vzhtdi12UDNvcDdfMk93T2dnYThIcEt1PWRRdjRLNUNQWXMtQUxzb0JrWHUxd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGo2aHZpNCtjcjI0QGVHcm91cHMuY29tPiA8NDdCNzBDMkEtN0UwRS00Nzk5LThCNjMtQUI0QTk3MUJGQTQwQFNhbmRyYWRvZGQuY29tPiA8Q0FHMHVXOG12LXZQM29wN18yT3dPZ2dhOEhwS3U9ZFF2NEs1Q1BZcy1BTHNvQmtYdTF3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63340,"nextInTopic":63344,"prevInTime":63341,"nextInTime":63343,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"... In addition to what Sandra said, they aren t all the same. I believe Sudbury Valley School in Framingham, MA (the original) provides information on how to","messageBody":"<div id=\"ygrps-yiv-1634957713\">On Oct 7, 2011, at 2:28 AM, Claire Darbaud wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would love to know what seasonned unschoolers think of Sudbury  <br/>\n&gt; Valley Schools?<br/>\n<br/>\n </span></blockquote>In addition to what Sandra said, they aren&#39;t all the same. I believe  <br/>\nSudbury Valley School in Framingham, MA (the original) provides  <br/>\ninformation on how to run a democratic school, but what each ends up  <br/>\nlooking like is up to the people running it. Wikipedia says &quot;These  <br/>\nschools are not formally associated in any way, but are a loosely  <br/>\nconnected network that are mutually supportive of each other,  <br/>\noperating as independent entities.&quot;<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: adults who can&#39;t read?","postDate":"1317994655","msgId":63340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5NjJBRjNFLUY2M0YtNDcyNS1CNzNGLTMwNEFGODNDQzkwNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRzB1Vzhtdi12UDNvcDdfMk93T2dnYThIcEt1PWRRdjRLNUNQWXMtQUxzb0JrWHUxd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGo2aHZpNCtjcjI0QGVHcm91cHMuY29tPiA8NDdCNzBDMkEtN0UwRS00Nzk5LThCNjMtQUI0QTk3MUJGQTQwQFNhbmRyYWRvZGQuY29tPiA8Q0FHMHVXOG12LXZQM29wN18yT3dPZ2dhOEhwS3U9ZFF2NEs1Q1BZcy1BTHNvQmtYdTF3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63339,"nextInTopic":63342,"prevInTime":63339,"nextInTime":63341,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"-=-I would love to know what seasonned unschoolers think of Sudbury Valley Schools?-=- Compared to regular schools, they re unschooling. Compared to","messageBody":"<div id=\"ygrps-yiv-516566137\">-=-I would love to know what seasonned unschoolers think of Sudbury Valley Schools?-=-<br/>\n<br/>\nCompared to regular schools, they&#39;re unschooling.<br/>\n<br/>\nCompared to unschooling, they&#39;re schools.<br/>\n<br/>\nThe experience one would have would depend on the other kids there at the time, and the teachers.  Some people would like it more than others.  In a situation in which my children weren&#39;t going to be able or allowed to stay home, I would have preferred that kind of school to regular public school or to traditional sit-down-and-compete public school.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: adults who can&#39;t read?","postDate":"1317968919","msgId":63339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1Vzhtdi12UDNvcDdfMk93T2dnYThIcEt1PWRRdjRLNUNQWXMtQUxzb0JrWHUxd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDQ3QjcwQzJBLTdFMEUtNDc5OS04QjYzLUFCNEE5NzFCRkE0MEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo2aHZpNCtjcjI0QGVHcm91cHMuY29tPgk8NDdCNzBDMkEtN0UwRS00Nzk5LThCNjMtQUI0QTk3MUJGQTQwQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":63331,"nextInTopic":63340,"prevInTime":63338,"nextInTime":63340,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"Peter Gray *********I can speak with more conviction about learning to read at the Sudbury Valley School. ***** I would love to know what seasonned unschoolers","messageBody":"<div id=\"ygrps-yiv-882066751\">Peter Gray *********I can speak with more conviction about learning to<br/>\nread at the Sudbury Valley School. *****<br/>\n<br/>\nI would love to know what seasonned unschoolers think of Sudbury Valley Schools?<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: adults who can&#39;t read?","postDate":"1317916731","msgId":63331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3QjcwQzJBLTdFMEUtNDc5OS04QjYzLUFCNEE5NzFCRkE0MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo2aHZpNCtjcjI0QGVHcm91cHMuY29tPg==","referencesHeader":"PGo2aHZpNCtjcjI0QGVHcm91cHMuY29tPg=="},"prevInTopic":63315,"nextInTopic":63339,"prevInTime":63330,"nextInTime":63332,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"Peter Gray came to comment in the blog comments. ... Peter has commented on: Children Teach Themselves to Read Subject: Role of a community in learning to","messageBody":"<div id=\"ygrps-yiv-1300125707\">Peter Gray came to comment in the blog comments.<br/>\n<br/>\n-----------<br/>\n<br/>\n<br/>\nPeter has commented on: &quot;Children Teach Themselves to Read&quot;<br/>\n<br/>\nSubject: Role of a community in learning to read<br/>\nThank you Angelina, Sandra, Patricia, and Kay for this high-level, deeply<br/>\nfelt discussion. Providing a forum for such discussions is one of the goals<br/>\nof this blog, and I very much appreciate the insights you and others have<br/>\npresented here.<br/>\n<br/>\nYou are right, Angelina, that my survey of unschoolers regarding reading was<br/>\nnot a scientific one. I certainly cannot say that all unschoolers learn to<br/>\nread on their own. All I can talk about is the experiences of those who<br/>\nresponded. My point about there being no critical age for learning to read<br/>\nwas not meant to imply that absolutely everyone will learn to read in the<br/>\nunschooling situation. It is just that those who don&#39;t learn early seem to be<br/>\nat no particular disadvantage when they do become interested and start<br/>\nlearning. But that is based just on this limited sample.<br/>\n<br/>\nI can speak with more conviction about learning to read at the Sudbury Valley<br/>\nSchool. This school, as I said before, is essentially a democratic community<br/>\nin which children of all ages (age 4 through late teens) direct their own<br/>\neducation. As I have said many times, the children spend their time playing,<br/>\nexploring, and pursuing their own interests, and, as a side effect, they<br/>\nbecome educated. Nobody at Sudbury VAlley is pressured or coaxed by staff to<br/>\nread; yet, in this setting, everyone does learn to read. Over the years,<br/>\nhundreds of children have learned to read at SVS. They learn at a wide<br/>\nvariety of ages, but, but, apparently none have gone beyond the age of 14<br/>\nwithout learning. The only exceptions are two who came to the school at age<br/>\n15 unable to read (diagnosed in the public school system as dyslexic), who<br/>\nboth learned to read shortly after enrollment at Sudbury Valley.<br/>\n<br/>\nThe strong motivation to learn to read at Sudbury Valley is the presence of<br/>\nother kids who are reading and clearly enjoying it. The little kids see the<br/>\nolder ones talking about books and they want to &quot;join that club.&quot; They also<br/>\nplay lots of games that involve the written word, and they pick up both<br/>\nreading and typing that way. And, of course today there is texting!<br/>\n<br/>\nSome children at home may not have such a rich environment for learning to<br/>\nread, and so I would not be surprised if some small number fail to learn.<br/>\nKids in general are not so interested in emulating adults; they are much more<br/>\ninterested in emulating other kids, especially those a little older than<br/>\nthemselves. At Sudbury Valley every kid, every day, sees dozens of other kids<br/>\nreading for pleasure, talking about what they read, and so on. The little<br/>\nkids are also regularly read to by older kids, not because the older ones<br/>\nfeel it is their duty to do that, but just because they really enjoy the<br/>\nlittle kids and one fun way to interact with them is to read to them. It<br/>\nwould be impossible for any home to provide such a rich literary kids&#39;<br/>\nenvironment as that provided by this community that includes 150 kids and<br/>\nabout 10 adults.<br/>\n<br/>\nA few kids at Sudbury Valley ask an adult for help in learning to read, but<br/>\nmost do not. They just pick it up through their experiences with other kids.<br/>\nThe two kids diagnosed (mistakenly) with dyslexia did ask for help--in an<br/>\nenvironment where they no longer had to feel shame about not being able read.<br/>\nIn this condition, with just a little help, they learned easily.<br/>\n<br/>\nBest wishes,<br/>\nPeter<br/>\n<br/>\n<br/>\n<br/>\nYou can view the comment at the following url<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/comment_redirect/185613\">http://www.psychologytoday.com/comment_redirect/185613</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: adults who can&#39;t read?","postDate":"1317859835","msgId":63315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM2RTJDRTlBLTIzNzYtNEI2OS1BMDk2LTIwRUVEN0RCODVCM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo2aHZpNCtjcjI0QGVHcm91cHMuY29tPg==","referencesHeader":"PGo2aHZpNCtjcjI0QGVHcm91cHMuY29tPg=="},"prevInTopic":63305,"nextInTopic":63331,"prevInTime":63314,"nextInTime":63316,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"-=-And then I felt grateful for Always Learning, and Sandra s Website, and Just Add Light and Stir, and all these other amazing blogs and websites by wonderful","messageBody":"<div id=\"ygrps-yiv-555754027\">-=-And then I felt grateful for Always Learning, and Sandra&#39;s Website, and Just Add Light and Stir, and all these other amazing blogs and websites by wonderful unschooling parents. -=-<br/>\n<br/>\nWell I was grateful you posted there.  Thanks. :-)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: adults who can&#39;t read?","postDate":"1317831044","msgId":63305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2aHZpNCtjcjI0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhBODZFMDYwLUQxQkItNDk2My05MzkwLTRCNzE5MjVDRTFGNkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63303,"nextInTopic":63315,"prevInTime":63304,"nextInTime":63306,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"... I wrote that response to this Dr. Porter, with Kay being the phonetical spelling of my first initial.  (Sometimes posting in the open public domain makes","messageBody":"<div id=\"ygrps-yiv-1489370983\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I don&#39;t know who this Kay is&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I wrote that response to this Dr. Porter, with &quot;Kay&quot; being the phonetical spelling of my first initial.  (Sometimes posting in the open public domain makes me tend towards anonymous...a result of growing up shrouded in the layers of parents and grandparents who worked at a top secret nuclear laboratory.)<br/>\n<br/>\nHer website was really the motivator for my response.  I made the mistake of reading some of the articles she has posted, like this one:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.leading2learning.com/2011/08/23/11-essential-rules-to-having-a-successful-life-that-you-did-not-and-will-not-learn-in-school/\">http://www.leading2learning.com/2011/08/23/11-essential-rules-to-having-a-successful-life-that-you-did-not-and-will-not-learn-in-school/</a><br/>\n<br/>\nand felt yucky afterwards.  <br/>\n<br/>\nAnd then I felt grateful for Always Learning, and Sandra&#39;s Website, and Just Add Light and Stir, and all these other amazing blogs and websites by wonderful unschooling parents.  I&#39;m so thankful that I don&#39;t have to rely on websites like hers to help me get my kids to do their homework, or to shake off that back-to-school feeling.  My kids both tried school this fall, and after 10 days they were both done.  <br/>\n<br/>\nRight now they are jumping on the trampoline and pretending to be rock stars in the beautiful morning light.</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: adults who can&#39;t read?","postDate":"1317814848","msgId":63303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2aGZvMCtiMHBwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVBRDREQzBBLTY5MTQtNEE0OS1BMjc1LTIxMjJDQURGMUQzMkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":63302,"nextInTopic":63305,"prevInTime":63302,"nextInTime":63304,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"... My wife s mother had a friend back in Belfast who had a brother who couldn t read or write, yet he owned a successful trucking company and was in fact a","messageBody":"<div id=\"ygrps-yiv-695455454\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pamela Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Oct 4, 2011, at 9:17 AM, Ed Wendell wrote:<br/>\n&gt; <br/>\n&gt; &gt; One thing she mentions is very true - a non-reader is dependent upon others to facilitate their learning - but that is what a good unschooling parent does <br/>\n&gt; <br/>\n&gt; Not &quot;very&quot; true..I&#39;ve noticed that the later a kid learns to read well, the better he/she is at learning through listening. The later readers I&#39;ve known have been spectacularly good at absorbing, processing, and remembering audible stuff. <br/>\n&gt; <br/>\n&gt; I think people vastly overestimate the importance of reading in learning.listening is at least as important. Picture college students - what are they doing? Most class time is spent listening to lectures.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>My wife&#39;s mother had a friend back in Belfast who had a brother who couldn&#39;t read or write, yet he owned a successful trucking company and was in fact a millionaire. The only one anybody knew, which was maybe why his story kept coming up in family conversations. He&#39;s gone now, and everybody who knew him personally, and I never found out exactly how he managed his business. He obviously didn&#39;t learn the business through the means of reading and writing. Presumably somebody else helped with the day to day paperwork. I&#39;ve often wondered. Wish I knew more about it.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: adults who can&#39;t read?","postDate":"1317770796","msgId":63302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2ZzRuYytuNHJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA5MzA5OTIyLUFBRTItNDJDMi04RjE4LUQwOTVFMkVBMDE2MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63301,"nextInTopic":63303,"prevInTime":63301,"nextInTime":63303,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"... **************** I know of one - but I wouldn t call what the family was doing unschooling so much as letting the kids run wild while the parents did","messageBody":"<div id=\"ygrps-yiv-747404430\">Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I want to know whether anyone else here knows of these examples.  Not by name, don&#39;t give away anything.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI know of one - but I wouldn&#39;t call what the family was doing &quot;unschooling&quot; so much as &quot;letting the kids run wild while the parents did their own thing&quot;. The thing is, They called it unschooling. I&#39;ve met other families over the years - all &quot;alternative&quot; folks, because that&#39;s my &quot;community&quot; if you will - who call what they do &quot;unschooling&quot; but it&#39;s more like &quot;benign neglect&quot;. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317766862","msgId":63301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBRDREQzBBLTY5MTQtNEE0OS1BMjc1LTIxMjJDQURGMUQzMkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDMxRDZFRjgzODg5NzQ4NUQ5ODdFMzdDQjIwQTYxMjIyQEVkUEM+","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPEE1OTdBQzUxLTgyNjAtNEU2Ri05QzUzLTBEN0FGQzRGNkI3RkBTYW5kcmFkb2RkLmNvbT4gPDY5NkVDMEU3LTlEOTEtNDlDQS05NDU5LTI4RkY3QjBDNTc0NkBTYW5kcmFkb2RkLmNvbT4gPDA5MzA5OTIyLUFBRTItNDJDMi04RjE4LUQwOTVFMkVBMDE2MEBTYW5kcmFkb2RkLmNvbT4gPDMxRDZFRjgzODg5NzQ4NUQ5ODdFMzdDQjIwQTYxMjIyQEVkUEM+"},"prevInTopic":63300,"nextInTopic":63302,"prevInTime":63300,"nextInTime":63302,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"... Not very true…..I ve noticed that the later a kid learns to read well, the better he/she is at learning through listening. The later readers I ve known","messageBody":"<div id=\"ygrps-yiv-1520301103\">On Oct 4, 2011, at 9:17 AM, Ed Wendell wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One thing she mentions is very true - a non-reader is dependent upon others to facilitate their learning - but that is what a good unschooling parent does <br/>\n<br/>\n </span></blockquote>Not &quot;very&quot; true�..I&#39;ve noticed that the later a kid learns to read well, the better he/she is at learning through listening. The later readers I&#39;ve known have been spectacularly good at absorbing, processing, and remembering audible stuff. <br/>\n<br/>\nI think people vastly overestimate the importance of reading in learning�.listening is at least as important. Picture college students - what are they doing? Most class time is spent listening to lectures.<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317766474","msgId":63300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzQ0E4QTkzLTQ1N0ItNEY5MS04M0ZBLTM5NTZEQkUxQUYxMUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDYxODhDNjI0LTE1MTMtNDYxNy05MTA5LTJBODAyNUFBMUVFMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4gPDE1NkZBOUQ0NUJGOTQ4MDNCQ0FFOUExMzJEQTMzOTJEQEVkUEM+IDw2MTg4QzYyNC0xNTEzLTQ2MTctOTEwOS0yQTgwMjVBQTFFRTJAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":63299,"nextInTopic":63301,"prevInTime":63299,"nextInTime":63301,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"On Oct 4, 2011, at 9:57 AM, Sandra Dodd wrote: ... ***** I know someone who gave her son C s and I know why because I asked her.  She had two reasons: (1) he","messageBody":"<div id=\"ygrps-yiv-1627388761\"><blockquote><span title=\"qreply\">On Oct 4, 2011, at 9:57 AM, Sandra Dodd wrote:<br/>\n****<br/>\n&gt; I can&#39;t even finish imagining how a homeschooling/school-at-home mother could give her own child a C, or D, or F, but I do know it happens. And then the kids are punished or limited because of &quot;bad grades,&quot; when they&#39;re such a construct. They don&#39;t have solid reality, and yet they hurt people very badly.<br/>\n*****<br/>\n<br/>\nI know someone who gave her son &quot;C&#39;s&quot; and I know why because I asked her.  She had two reasons: (1) he didn&#39;t do his work up to the level that his older brother had and (2) she knew he was capable of doing better work. <br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317765244","msgId":63299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhBODZFMDYwLUQxQkItNDk2My05MzkwLTRCNzE5MjVDRTFGNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNCNzAyOEQzLUU3MDAtNDA5Qy05OTNFLTkxQUU4QUJCMzJFNEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4gPDE1NkZBOUQ0NUJGOTQ4MDNCQ0FFOUExMzJEQTMzOTJEQEVkUEM+IDw1REEwRUQ4Qi04RDI1LTQ4RTctOTk2NS01REU3NzU1NTZERDBAdmVyaXpvbi5uZXQ+IDxDOTRGOENBOS05MTk2LTQwMkYtOTJCNS0yQTg3QjRCRjcxNTNAU2FuZHJhZG9kZC5jb20+IDwzQjcwMjhEMy1FNzAwLTQwOUMtOTkzRS05MUFFOEFCQjMyRTRAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":63298,"nextInTopic":63300,"prevInTime":63298,"nextInTime":63300,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"Another post brought from the Psychology Today Blog (well, not brought; rescued from notification e-mail). I don t know who this Kay is, but at the moment I m","messageBody":"<div id=\"ygrps-yiv-68469275\">Another post brought from the Psychology Today Blog (well, not brought; rescued from notification e-mail).<br/>\n<br/>\nI don&#39;t know who this Kay is, but at the moment I&#39;m standing and cheering her loudly in my heart.  (And, kind of, on this list!)<br/>\n<br/>\n(Kay, if you&#39;re here reading, THANK YOU!!)<br/>\n<br/>\n<br/>\n<br/>\nKay has commented on: &quot;Children Teach Themselves to Read&quot;<br/>\n<br/>\nSubject: Who is this collective &quot;Let&#39;s&quot;?<br/>\n/Dr Patricia Porter/ wrote:Surely the answer lies somewhere in the middle,<br/>\nalong the continuum between the two opposing views?<br/>\n<br/>\nThe answer to what?<br/>\n<br/>\n/Dr Patricia Porter/ wrote:I have known children who are in a supportive<br/>\nfamily environment learn to read with hardly any intervention. I have known<br/>\nchildren who could not read at age 9, who wanted to read, and who needed<br/>\nquite detailed instruction to help them learn to read.<br/>\n<br/>\nBut were those children in school? My 9-year old homeschooler is learning to<br/>\nread on her own, in her own way, and without any “intervention” from her<br/>\nparents. Her level of reading interest is driven primarily from wanting to<br/>\nread Facebook posts, notes that I write to her daily, and texts sent to her<br/>\nfrom her aunt and myself. She will occasionally pick up a book and read to<br/>\nher little sister. If she doesn’t know the exact words, she will make<br/>\nsomething up without skipping a beat. In the past several weeks I’ve<br/>\nnoticed that she has put forth more effort in the connection between<br/>\ncorrectly spelling words she is writing, and relating that correct spelling<br/>\nto words she reads throughout the day.<br/>\n<br/>\nBut we are not doing this:<br/>\n<br/>\n/Dr Patricia Porter/ wrote:letting the child roam freely in an environment<br/>\nwhere reading is seen as a natural part of life or providing the extra<br/>\nsupport - &#39;teaching&#39; - that children need and perhaps ask for.<br/>\n<br/>\nWe do no “teaching” as a means of providing extra support. I support my<br/>\ndaughter’s interest in spelling correctly by spelling words aloud when she<br/>\nasks me to do so. I support my daughter’s interest in reading things<br/>\naccurately by reading words aloud when she asks me to do so. I do not talk<br/>\nabout phonics, or sound things out in an exaggerated manner, or get impatient<br/>\nwith her for asking. She asks me to spell, I spell. She asks me to read, I<br/>\nread. It is as simple as that. She can accurately spell words as she learns<br/>\nthem in context, as a result of learning in context, and not as a result of<br/>\nbeing drilled or tested. She remembers what she has learned. As I observe<br/>\nthis process I am absolutely fascinated by seeing her method of learning<br/>\nunfold. I support, but I do not “teach,” which implies imparting<br/>\nknowledge into her brain. I can do no such thing.<br/>\n<br/>\n/Dr Patricia Porter/ wrote:Let&#39;s stop talking...Let&#39;s start seeing…Let&#39;s<br/>\nget off our hobby horses…Let&#39;s end this argument about which is best -<br/>\nnatural learning or supported learning (teaching), and start ensuring that<br/>\nschools provide a learning environment that meets the needs of all the<br/>\nchildren in their care. Isn&#39;t that what we all want? Or are we too busy<br/>\narguing amongst ourselves to make this happen?<br/>\n<br/>\nI do not believe that the intention of Dr. Gray’s post is for everyone to<br/>\ncome to a consensus, or to seek a way to ensure that all schools (where, in<br/>\nthe US? Worldwide?) will meet the needs of all children. The way you’ve<br/>\ncrafted your language in those statements reads like you believe that somehow<br/>\nthe comment writers here can somehow band together to save the schools of the<br/>\nworld. That’s fairly ironic since many of the readers are homeschooling,<br/>\nand likely do not have the time nor the interest to ensure that schools do<br/>\nanything at all.<br/>\n<br/>\nSince we are a homeschooling family, the only children in my care are my own.<br/>\nI have neither the time nor the interest to ensure that all schools provide a<br/>\nlearning environment that meets the needs of all children. That’s why we<br/>\nare homeschooling; so we can focus our love and attention on our own<br/>\nbeautiful children without being constrained to time, school schedules, and<br/>\nschool-based rules. If my kids decide to attend school, then I may shift some<br/>\nof my attention towards helping to make their schools better to the best of<br/>\nmy ability. I might even run for the school board or something. But I don’t<br/>\nthink that will happen anytime soon.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317749896","msgId":63298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCNzAyOEQzLUU3MDAtNDA5Qy05OTNFLTkxQUU4QUJCMzJFNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEM5NEY4Q0E5LTkxOTYtNDAyRi05MkI1LTJBODdCNEJGNzE1M0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4gPDE1NkZBOUQ0NUJGOTQ4MDNCQ0FFOUExMzJEQTMzOTJEQEVkUEM+IDw1REEwRUQ4Qi04RDI1LTQ4RTctOTk2NS01REU3NzU1NTZERDBAdmVyaXpvbi5uZXQ+IDxDOTRGOENBOS05MTk2LTQwMkYtOTJCNS0yQTg3QjRCRjcxNTNAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":63297,"nextInTopic":63299,"prevInTime":63297,"nextInTime":63299,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"Ah.  A condescending PhD has come and sprayed rhetorical retardant on the topic.  Good.  It prevents my need to respond. ... Dr Patricia Porter has commented","messageBody":"<div id=\"ygrps-yiv-565232190\">Ah.  A condescending PhD has come and sprayed rhetorical retardant on the topic.  Good.  It prevents my need to respond.<br/>\n<br/>\nIf she were to come and post that here, I would respond, but where it is, what it is, and the effect it will have, is fine:<br/>\n<br/>\n---------------------------<br/>\n<br/>\n<br/>\nDr Patricia Porter has commented on: &quot;Children Teach Themselves to Read&quot;<br/>\n<br/>\nSubject: let&#39;s condense this argument.<br/>\nOn the one hand, children learn naturally, on the other they need &#39;teaching&#39;<br/>\nor at least being in an environment where they are encouraged to learn. At<br/>\nleast, that is what I think most of these posts are about.<br/>\n<br/>\nI don&#39;t think there is any real disagreement here unless you position<br/>\nyourself at either end of the continuum between learning and teaching. What I<br/>\nmean is that you might believe that children learn everything &#39;naturally&#39; and<br/>\nneed no teaching or helpful support. Or you might believe that children need<br/>\n&#39;teaching&#39; or supporting in some way and that this is the only way they<br/>\nlearn.<br/>\n<br/>\nSurely the answer lies somewhere in the middle, along the continuum between<br/>\nthe two opposing views? And where in the middle the answer lies depends on<br/>\nthe child in question. I have known children who are in a supportive family<br/>\nenvironment learn to read with hardly any intervention. I have known children<br/>\nwho could not read at age 9, who wanted to read, and who needed quite<br/>\ndetailed instruction to help them learn to read.<br/>\n<br/>\nIt all depends on the child&#39;s need and how the child learns.<br/>\n<br/>\nA good teacher - and I include parents in this group- knows what children<br/>\nneed and provides it. This might mean letting the child roam freely in an<br/>\nenvironment where reading is seen as a natural part of life or providing the<br/>\nextra support - &#39;teaching&#39; - that children need and perhaps ask for.<br/>\n<br/>\nReading readiness - this is an idea that has been thoroughly dismissed by<br/>\nrenowned educators. It has very little meaning. When is a child ready to<br/>\nlearn to read? How do you know? How do children get ready to read?<br/>\n<br/>\nAll this can be avoided by looking at what the child needs. I have never yet<br/>\nmet a child who did not feel the need to be able to read - either at age 3 or<br/>\nage 25!<br/>\n<br/>\nPeople are illiterate (there is a value laden term if ever there was one!)<br/>\nonly when their learning needs are not met.<br/>\n<br/>\nLet&#39;s stop talking about this or that way of helping children learn, and<br/>\nstart looking at ways that fit each individual learner needs best.<br/>\n<br/>\nLet&#39;s start seeing learners as individuals with unique learning needs and<br/>\nfind a way to meet those needs.<br/>\n<br/>\nLet&#39;s get off our hobby horses and start concentrating on discovering what an<br/>\nindividual&#39;s learning needs really are.<br/>\n<br/>\nLet&#39;s end this argument about which is best - natural learning or supported<br/>\nlearning (teaching), and start ensuring that schools provide a learning<br/>\nenvironment that meets the needs of all the children in their care.<br/>\n<br/>\nThen all children will start to get the support they need and deserve and all<br/>\nchildren will have a chance of reaching their full learning potential.<br/>\n<br/>\nIsn&#39;t that what we all want? Or are we too busy arguing amongst ourselves to<br/>\nmake this happen?<br/>\n<br/>\n<br/>\n---------------------------------------------------<br/>\n<br/>\nOur choice is to agree with all she&#39;s said, or admit we&#39;re too busy arguing.<br/>\nHigher up, I had the choice of admitting I was on a hobby horse, or getting off my hobby horse... (hey... no choice!?) and help concentrate on discovering what the needs of individuals in schools are (I think).<br/>\n<br/>\nMy &quot;hobby horse&quot; is knowledge and dedication to something Dr. P.Porter probably knows very, very little about.  If she had a PhD in it, it would be a field of study.  Because she dismisses it, it&#39;s &quot;a hobby horse.&quot;<br/>\n<br/>\nAnother false-as-false-can-be construct:<br/>\n<br/>\n-=- What I<br/>\nmean is that you might believe that children learn everything &#39;naturally&#39; and<br/>\nneed no teaching or helpful support. Or you might believe that children need<br/>\n&#39;teaching&#39; or supporting in some way and that this is the only way they<br/>\nlearn.-=-<br/>\n<br/>\n-=-Surely the answer lies somewhere in the middle, along the continuum between<br/>\nthe two opposing views?-=-<br/>\n<br/>\nHaving created two straw men, she sets them to fight, and assures us that the answer lies in the middle.    But she&#39;s the one who falsely created a far wall where someone allegedly believes that children need no helpful support.  On one side is a straw scarecrow that nobody really believes, and on the other is the dressed-up straw (but mainstreal looking) idea that children can&#39;t learn a single thing without being taught.<br/>\n<br/>\nSo I&#39;ll leave that rhetorical cheatery to seem like the final word, and stay away from the middle of the road where the tar baby has been set out.  If I went back, I would end up also defending or discussing something I can&#39;t see, that might have been made up.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317748286","msgId":63297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5NEY4Q0E5LTkxOTYtNDAyRi05MkI1LTJBODdCNEJGNzE1M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDVEQTBFRDhCLThEMjUtNDhFNy05OTY1LTVERTc3NTU1NkREMEB2ZXJpem9uLm5ldD4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4gPDE1NkZBOUQ0NUJGOTQ4MDNCQ0FFOUExMzJEQTMzOTJEQEVkUEM+IDw1REEwRUQ4Qi04RDI1LTQ4RTctOTk2NS01REU3NzU1NTZERDBAdmVyaXpvbi5uZXQ+"},"prevInTopic":63296,"nextInTopic":63298,"prevInTime":63296,"nextInTime":63298,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"-=- ... -=-Oh, but then they can blame the child! Or the school can blame the parents.-=- But so am I.  When I hear someone claim there are several unschoolers","messageBody":"<div id=\"ygrps-yiv-380324783\">-=-<br/>\n<blockquote><span title=\"ireply\"> &gt; But what opponents fail to recognize / admit is that there are no <br/>\n&gt; guarantees with learning in school nor with teaching at home either.<br/>\n<br/>\n </span></blockquote>-=-Oh, but then they can blame the child! Or the school can blame the parents.-=-<br/>\n<br/>\nBut so am I.  When I hear someone claim there are several unschoolers who grew up unable to read, my first thought is that the unschooling must never have taken hold at all.   <br/>\n<br/>\nWhen school offers to teach a child something and then blames the parents, that seems harsh.<br/>\nWhen we&#39;ve offered to help parents understand how to help their kids live a life of happy learning, it seems (to me) not really parallel, though.  If the parents are there all the time, for years, and the child isn&#39;t interested in words and saw no reason to want to mess around with reading at all, I think something wrong with the situation.<br/>\n<br/>\nI could be wrong, but I would love to be SHOWN I was wrong, by seeing a family that really is happy, stable and all that and the kids had all the opportunities imaginable and reading didn&#39;t really come up somehow.   It seems to me as unlikely as a kid not learning to put his own shoes on or go to the bathroom on his own.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317747764","msgId":63296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVEQTBFRDhCLThEMjUtNDhFNy05OTY1LTVERTc3NTU1NkREMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDE1NkZBOUQ0NUJGOTQ4MDNCQ0FFOUExMzJEQTMzOTJEQEVkUEM+","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4gPDE1NkZBOUQ0NUJGOTQ4MDNCQ0FFOUExMzJEQTMzOTJEQEVkUEM+"},"prevInTopic":63295,"nextInTopic":63297,"prevInTime":63295,"nextInTime":63297,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"... Oh, but then they can blame the child! Or the school can blame the parents. When school seemingly works for so many that educators have confidence it","messageBody":"<div id=\"ygrps-yiv-230615255\">On Oct 4, 2011, at 12:29 PM, Ed Wendell wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But what opponents fail to recognize / admit is that there are no  <br/>\n&gt; guarantees with learning in school nor with teaching at home either.<br/>\n<br/>\n </span></blockquote>Oh, but then they can blame the child! Or the school can blame the  <br/>\nparents.<br/>\n<br/>\nWhen school seemingly works for so many that educators have confidence  <br/>\nit works, and they give extra attention to the ones who aren&#39;t  <br/>\nfiguring it out, then it *must* (supposedly!) be the child&#39;s fault for  <br/>\nnot trying hard enough if the child is still not succeeding.<br/>\n<br/>\nIt would be hard for educators to know differently. They can&#39;t trust  <br/>\nnot instructing when it&#39;s equated with doing nothing. And doing  <br/>\nnothing for kids in school when instruction is quickly beyond their  <br/>\nability to figure it out without reading, definitely makes things worse.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317747425","msgId":63295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxODhDNjI0LTE1MTMtNDYxNy05MTA5LTJBODAyNUFBMUVFMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE1NkZBOUQ0NUJGOTQ4MDNCQ0FFOUExMzJEQTMzOTJEQEVkUEM+","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4gPDE1NkZBOUQ0NUJGOTQ4MDNCQ0FFOUExMzJEQTMzOTJEQEVkUEM+"},"prevInTopic":63294,"nextInTopic":63296,"prevInTime":63294,"nextInTime":63296,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"-=-But what opponents fail to recognize / admit is that there are no guarantees with learning in school nor with teaching at home either.-=- In unschooling,","messageBody":"<div id=\"ygrps-yiv-1645694385\">-=-But what opponents fail to recognize / admit is that there are no guarantees with learning in school nor with teaching at home either.-=-<br/>\n<br/>\nIn unschooling, failures aren&#39;t necessary.  Failure isn&#39;t required.<br/>\nIn school, especially public school, failure is a necessity.  Without some F&#39;s, the A&#39;s are worthless.<br/>\n<br/>\nI have a friend, though, who taught history at Sandia Preparatory School here in Albuquerque for a few years recently. When she made up her list of grades, there were D&#39;s and F&#39;s in there, for kids who really hadn&#39;t done the projects at all (she was teaching history, but in the artsy hippy personal-history way) and the principal told her that those parents pay a lot of money for their kids to get A&#39;s and B&#39;s, and so the lowest grades needed to be B&#39;s.   She wasn&#39;t happy about that; I was pretty amused, but I did feel sorry for kids in other schools around here whose &quot;grade average&quot; will be lower even if they did more work, and all that.      <br/>\n<br/>\nBut teachers usually are pressed the other direction--that not all the grades can be high, and need to be distributed on a skewed bell curve, with more B&#39;s than D&#39;s, but otherwise  distributed.    So in a way (in a big way) school builds failure into the system in advance.  <br/>\n<br/>\nI can&#39;t even finish imagining how a homeschooling/school-at-home mother could give her own child a C, or D, or F, but I do know it happens.  And then the kids are punished or limited because of &quot;bad grades,&quot; when they&#39;re such a construct.  They don&#39;t have solid reality, and yet they hurt people very badly.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317747295","msgId":63294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4MzgwQTdGLTc5MEUtNDFENi1BMzdELTk3OEIzRkI4REY5MUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDA5MzA5OTIyLUFBRTItNDJDMi04RjE4LUQwOTVFMkVBMDE2MEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPEE1OTdBQzUxLTgyNjAtNEU2Ri05QzUzLTBEN0FGQzRGNkI3RkBTYW5kcmFkb2RkLmNvbT4gPDY5NkVDMEU3LTlEOTEtNDlDQS05NDU5LTI4RkY3QjBDNTc0NkBTYW5kcmFkb2RkLmNvbT4gPDA5MzA5OTIyLUFBRTItNDJDMi04RjE4LUQwOTVFMkVBMDE2MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63293,"nextInTopic":63295,"prevInTime":63293,"nextInTime":63295,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"... Helen Hegener said her at-the-time 16 (or 18) yo son couldn t read. But she then said that it appeared he could but would choose not to and would ask","messageBody":"<div id=\"ygrps-yiv-430547034\">On Oct 4, 2011, at 10:49 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there someone who unschooled well, whose kids grew up without  <br/>\n&gt; shame or pressure or trauma who was around books and internet and  <br/>\n&gt; words and got to be 18 or 20 and cannot read?<br/>\n<br/>\n </span></blockquote>Helen Hegener said her at-the-time 16 (or 18) yo son couldn&#39;t read.  <br/>\nBut she then said that it appeared he could but would choose not to  <br/>\nand would ask people when he needed words read. (I&#39;m remembering  <br/>\ncomputer screens being in her story.)<br/>\n<br/>\nI remember growing up I thought of myself as reading all the magazines  <br/>\naround the house (Popular Science, National Geographic, Popular  <br/>\nMechanics) but actually I just read the captions beneath the pictures.  <br/>\nI remember trying to read the articles -- and I was a good book reader  <br/>\n-- but the information felt too dense. I wanted more pictures to break  <br/>\nit up into chunks. Even though I&#39;ve read hundreds and hundreds of  <br/>\nbooks, I do still like a good balance of pictures and text. If I have  <br/>\na choice between a text dense non-fiction book and one written in  <br/>\ncomic style, I definitely prefer the comics style. So if my reading  <br/>\nhad been judged by how many articles I read, or whether I chose &quot;hard&quot;  <br/>\nbooks or &quot;easy&quot; (comics) books, it would look like I wasn&#39;t a very  <br/>\ngood reader.<br/>\n<br/>\nKathryn also could read but chose not to if it involved more than a  <br/>\nline or two of text. She wanted to read books but she said it didn&#39;t  <br/>\nfeel easy for her. And because it wasn&#39;t easy, she didn&#39;t read. And  <br/>\nbecause she didn&#39;t read, it didn&#39;t get easier. (Or not at the pace she  <br/>\nwanted it to.) When she discovered an adult series she liked (through  <br/>\naudio books, at 14ish), then she had a reason to read that was worth  <br/>\nthe difficulties. And then soon it wasn&#39;t difficult.<br/>\n<br/>\nWhat if she hadn&#39;t found the series? While it&#39;s pure speculation, I  <br/>\ncan&#39;t imagine a child who enjoyed books, wouldn&#39;t *eventually* stumble  <br/>\nacross something she or he wanted to read enough to push past  <br/>\ndifficulties. (Of course I&#39;m talking about a child who can decode but  <br/>\nis choosing not to read and labeled herself as not reading.)<br/>\n<br/>\nWhat would be the experience of a similar child who didn&#39;t have much  <br/>\ninterest in stories or non-fiction books? What if he didn&#39;t try  <br/>\nbecause it was hard and because it was hard he didn&#39;t get better at it  <br/>\nbefore he decided he couldn&#39;t or didn&#39;t want to?<br/>\n<br/>\nTwo things to think about: If it was lack of practice in his way, then  <br/>\nthe forced reading in school might have gotten him past the hurdle.  <br/>\n(Probably would have helped Kathryn.)<br/>\n<br/>\nBut it&#39;s also possible the forced reading would have made him dislike  <br/>\nreading. (Really, publishers should be up in arms at what schools are  <br/>\ndoing to people&#39;s desire to read :-/) I know Kathryn would have  <br/>\nprotested loudly about being made to read anything she didn&#39;t want to!<br/>\n<br/>\nAnd if it *wasn&#39;t* lack of practice but something else, where&#39;s the  <br/>\nguarantee the schools could have done better? Where&#39;s the guarantee  <br/>\nthe schools could have gotten the child reading without damaging him  <br/>\neven more?<br/>\n<br/>\nWhatever the experience, I&#39;d bet good money that if someone has the  <br/>\nability to decode, and haven&#39;t figured it out by the time they&#39;re  <br/>\n18/20, that they&#39;re in *much* MUCH better shape to benefit from adult  <br/>\nliteracy instruction than someone who graduated school without being  <br/>\nable to read.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317745772","msgId":63293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NkZBOUQ0NUJGOTQ4MDNCQ0FFOUExMzJEQTMzOTJEQEVkUEM+","inReplyToHeader":"PDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4="},"prevInTopic":63292,"nextInTopic":63294,"prevInTime":63292,"nextInTime":63294,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"But what opponents fail to recognize / admit is that there are no guarantees with learning in school nor with teaching at home either. As Joyce said It needs","messageBody":"<div id=\"ygrps-yiv-2132791807\">But what opponents fail to recognize / admit is that there are no guarantees with learning in school nor with teaching at home either.<br/>\n<br/>\nAs Joyce said &quot;It needs to be done because someone wants the positives that unschooling will give their families. <br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Joyce Fetteroll <br/>\n  No one here can offer a guarantee that unschooling will work. It needs <br/>\n  to be done because someone wants the positives that unschooling will <br/>\n  give their families. And the more willing they are to put themselves <br/>\n  &quot;out there&quot; for their kids and ask for help when something doesn&#39;t <br/>\n  seem to be working, the more likely they are to succeed.<br/>\n<br/>\n  Joyce.<br/>\n   <br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317745050","msgId":63292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxRDZFRjgzODg5NzQ4NUQ5ODdFMzdDQjIwQTYxMjIyQEVkUEM+","inReplyToHeader":"PDA5MzA5OTIyLUFBRTItNDJDMi04RjE4LUQwOTVFMkVBMDE2MEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPEE1OTdBQzUxLTgyNjAtNEU2Ri05QzUzLTBEN0FGQzRGNkI3RkBTYW5kcmFkb2RkLmNvbT4gPDY5NkVDMEU3LTlEOTEtNDlDQS05NDU5LTI4RkY3QjBDNTc0NkBTYW5kcmFkb2RkLmNvbT4gPDA5MzA5OTIyLUFBRTItNDJDMi04RjE4LUQwOTVFMkVBMDE2MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63291,"nextInTopic":63293,"prevInTime":63291,"nextInTime":63293,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"Zac was in school until 8 1/2 (mid third grade in the USA) labeled as dyslexic, dysgraphic, failing, not reading, not writing, not spelling, couldn t tell","messageBody":"<div id=\"ygrps-yiv-635415344\">Zac was in school until 8 1/2 (mid third grade in the USA) labeled as dyslexic, dysgraphic, failing, not reading, not writing, not spelling, couldn&#39;t tell time, couldn&#39;t remember math facts, couldn&#39;t, couldn&#39;t, couldn&#39;t, etc.  AND yet if you took away the schoolishness people always commented on how smart he was - even the teachers!<br/>\n<br/>\nHis story is one of slowly evolving in unschooling - today at 17 he reads almost non-stop, carries books with him everywhere he goes (in case he gets bored and wants something to do).  His knowledge base is immense and fairly varied.  His knowledge base in what he is interested in is very deep.<br/>\n<br/>\nOne thing she mentions is very true - a non-reader is dependent upon others to facilitate their learning - but that is what a good unschooling parent does - facilitate learning by providing things to further learning.   A good unschooling parent does not say &quot;Oh you can read figure it all out on your own now.&quot;<br/>\n<br/>\nWe read to Zac no matter his age, we helped with gaming, game guides, took him to places of interest, searched for things to go and do that would be of interest to him, movies, TV, books, etc.<br/>\n<br/>\nI can remember Zac begging for certain books and we bought them and he never read them - just carried them around.  He was barely reading and he carried around the entire collection of Tolken for several months.  To this day we&#39;re not sure why he wanted to do that but we facilitated it - we never said &quot;Zac you&#39;ll never read that huge book why would you want it?&quot;<br/>\n<br/>\nOh, and books with lots of pictures with captions - he read those a lot.<br/>\n<br/>\n<br/>\nThis is a child that still to this day feels the failure of school - Unschooling gave him the freedom to succeed!  He talks about possibly going to college.  Yesterday he talked about being a massage therapist and planned it all out with setting up his own business, what it&#39;d take to get the clientele, etc.  In his eyes the world is wide open to him.  He speaks of being in the military, being a massage therapist, a police officer, a chiropractor, and several other things he might do.  Right now he is all excited wanting to go to Japan as an exchange student - not the kind where you go to school with them but where you go and live with them and then they come and live with you for a bit.<br/>\n<br/>\nI wonder how a person can grow up in a print rich, supportive environment, plus get out in the real world and not know how to read - not a word?    She makes it sound like they cannot read at all.<br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<br/>\n  If there&#39;s someone who started unschooling after ten years of school during which time a child was told by professionals that he didn&#39;t know how to read, and if the parents kept the kid away from media and games and said &quot;unschooling&quot; while doing things they weren&#39;t willing to share with successful unschoolers, I&#39;m not sure I would feel the same way about a lack of reading.<br/>\n<br/>\n  Sandra<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317744781","msgId":63291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGNkE4QTFELTBCOTgtNDI5Ni1CMDYzLTI5NDJFMkYzMUUzREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4="},"prevInTopic":63290,"nextInTopic":63292,"prevInTime":63290,"nextInTime":63292,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"-=-That s what s great about radical unschooling (for data collection) as opposed to unschooling just academics. Radical unschooling lacks the confusing factor","messageBody":"<div id=\"ygrps-yiv-85637816\">-=-That&#39;s what&#39;s great about radical unschooling (for data collection) as <br/>\nopposed to unschooling just academics. Radical unschooling lacks the <br/>\nconfusing factor of how the parenting affects the child&#39;s choices.-=-<br/>\n<br/>\nThere&#39;s still the self-reporting, self-selection aspect, and the &#39;it&#39;s so cool&#39; problem, of people saying they&#39;re radical unschoolers (without having witnesses) or some who say they&#39;re radical unschoolers and have witnesses who wince and say &quot;seems like neglect,&quot; but they don&#39;t like to name names in public either.<br/>\n<br/>\n-=-No one here can offer a guarantee that unschooling will work. It needs <br/>\nto be done because someone wants the positives that unschooling will <br/>\ngive their families. And the more willing they are to put themselves <br/>\n&quot;out there&quot; for their kids and ask for help when something doesn&#39;t <br/>\nseem to be working, the more likely they are to succeed.-=-<br/>\n<br/>\nYes.  Joyce is always so soothing to my soul. :-)<br/>\n<br/>\nIt&#39;s not fair to not ask for help and then blame unschooling.  &quot;Unschooling&quot; was there to offer help, but can&#39;t change the past.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317743381","msgId":63290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzOUI0MDc4LTJGQUYtNDEyOC04NTc1LTE3NEY5OURDNDAwNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63289,"nextInTopic":63291,"prevInTime":63289,"nextInTime":63291,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"... Being confident that who you re confessing to will have a sympathetic ear is definitely a big factor on what people will confess to them. I ve brought this","messageBody":"<div id=\"ygrps-yiv-834008841\"><blockquote><span title=\"ireply\">&gt; Maybe people who are having problems with unschooling<br/>\n&gt; just switch away, and don&#39;t wish to contact you about it?<br/>\n<br/>\n </span></blockquote>Being confident that who you&#39;re confessing to will have a sympathetic  <br/>\near is definitely a big factor on what people will confess to them.<br/>\n<br/>\nI&#39;ve brought this point up a couple of times when people wanted  <br/>\nconvinced their children would read (do math, or whatever they were  <br/>\nworried about) if they unschooled.<br/>\n<br/>\nStaying in the unschooling &quot;experiment&quot; is totally voluntary. And any  <br/>\nexperiment where remaining is voluntary has inherent flaws.<br/>\n<br/>\nThe people who stick with the experiment are the ones who are figuring  <br/>\nout how to make it work.<br/>\n<br/>\nThose who drop out??? We can&#39;t know. Because they couldn&#39;t figure out  <br/>\nhow to make it work? Because they gave up rather than asking for help?  <br/>\nBecause they (or a spouse) got impatient for results? Or because  <br/>\ncreating a rich, supportive environment where experiences with text  <br/>\nwere positive wasn&#39;t enough for their child to crack the code?<br/>\n<br/>\nIf someone *says* they were unschooling but it didn&#39;t work, we can&#39;t  <br/>\nknow what they mean by &quot;unschooling.&quot; That&#39;s not a criticism. It means  <br/>\nthat when you&#39;re performing an experiment, collecting data, and  <br/>\ndrawing conclusions from that data, the less variation in the factors  <br/>\nthat affect the outcome, the more confident you can be that it&#39;s  <br/>\nwhat&#39;s being studied and not some other factor that causes the  <br/>\nvariations.<br/>\n<br/>\nThat&#39;s what&#39;s great about radical unschooling (for data collection) as  <br/>\nopposed to unschooling just academics. Radical unschooling lacks the  <br/>\nconfusing factor of how the parenting affects the child&#39;s choices.<br/>\n<br/>\nIf someone is here, offers up what they&#39;re doing for analysis, then  <br/>\nit&#39;s much easier to help the mom zero in on what&#39;s not working than it  <br/>\nis with conventional parenting and much easier to draw conclusions  <br/>\nabout what works and what doesn&#39;t work for unschooling.<br/>\n<br/>\nIf someone&#39;s family life is hidden -- as most of it will be -- their  <br/>\nnegative results won&#39;t carry as much weight as someone whose life is  <br/>\nopen and examined by others. And social niceties prevent people from  <br/>\ndigging in to find out if their &quot;unschooling&quot; matches the  <br/>\n&quot;unschooling&quot; being analyzed on the list.<br/>\n<br/>\nThere *have* been people come here for advice about younger kids who  <br/>\nclaimed unschooling didn&#39;t work for their older kids. But the factors  <br/>\nthey gave for it not working were things that the objective observers  <br/>\non the list could have offered suggestions for. But, analyzing  <br/>\nsomething from the past without being able to try things to figure out  <br/>\nwhat&#39;s beneath it, isn&#39;t very useful. There&#39;s too much guess work  <br/>\ninvolved. And people usually don&#39;t want to look back at a chapter  <br/>\nthey&#39;ve closed and found a solution to.<br/>\n<br/>\n(And that&#39;s why it&#39;s much more useful to discuss current problems.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; After 14 years of<br/>\n&gt; involvement with unschooling, if that is what you would call reading  <br/>\n&gt; about it<br/>\n&gt; and mixing with many families who love the approach, I personally  <br/>\n&gt; know of<br/>\n&gt; several children who didn&#39;t learn to read by adulthood,<br/>\n<br/>\n </span></blockquote>Third hand information doesn&#39;t count for much in court or scientific  <br/>\nstudies ;-) It doesn&#39;t mean nothing! But it just can&#39;t be treated with  <br/>\nthe same confidence as what&#39;s happening in families right here on the  <br/>\nlist who are opening up their lives.<br/>\n<br/>\nNo one here can offer a guarantee that unschooling will work. It needs  <br/>\nto be done because someone wants the positives that unschooling will  <br/>\ngive their families. And the more willing they are to put themselves  <br/>\n&quot;out there&quot; for their kids and ask for help when something doesn&#39;t  <br/>\nseem to be working, the more likely they are to succeed.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317739791","msgId":63289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5MzA5OTIyLUFBRTItNDJDMi04RjE4LUQwOTVFMkVBMDE2MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDY5NkVDMEU3LTlEOTEtNDlDQS05NDU5LTI4RkY3QjBDNTc0NkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPEE1OTdBQzUxLTgyNjAtNEU2Ri05QzUzLTBEN0FGQzRGNkI3RkBTYW5kcmFkb2RkLmNvbT4gPDY5NkVDMEU3LTlEOTEtNDlDQS05NDU5LTI4RkY3QjBDNTc0NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63288,"nextInTopic":63290,"prevInTime":63288,"nextInTime":63290,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"So if there are unschoolers (several) who grew up without reading, I don t want to know names and places. I want to know whether anyone else here knows of","messageBody":"<div id=\"ygrps-yiv-2025924881\">So if there are unschoolers (several) who grew up without reading, I don&#39;t want to know names and places.<br/>\n<br/>\nI want to know whether anyone else here knows of these examples.  Not by name, don&#39;t give away anything.  <br/>\n<br/>\nIs there someone who unschooled well, whose kids grew up without shame or pressure or trauma who was around books and internet and words and got to be 18 or 20 and cannot read?<br/>\n<br/>\nIf there&#39;s someone who started unschooling after ten years of school during which time a child was told by professionals that he didn&#39;t know how to read, and if the parents kept the kid away from media and games and said &quot;unschooling&quot; while doing things they weren&#39;t willing to share with successful unschoolers, I&#39;m not sure I would feel the same way about a lack of reading.<br/>\n<br/>\nI&#39;m not sure how to feel about a vague claim in public.  It&#39;s disturbing.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317739339","msgId":63288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5NkVDMEU3LTlEOTEtNDlDQS05NDU5LTI4RkY3QjBDNTc0NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEE1OTdBQzUxLTgyNjAtNEU2Ri05QzUzLTBEN0FGQzRGNkI3RkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4gPEE1OTdBQzUxLTgyNjAtNEU2Ri05QzUzLTBEN0FGQzRGNkI3RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63287,"nextInTopic":63289,"prevInTime":63287,"nextInTime":63289,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"My response (and then the response I first quoted, now in context, with these questions:   Isn t THIS the point faith comes in?   Undocumented, no detail,","messageBody":"<div id=\"ygrps-yiv-224472882\">My response (and then the response I first quoted, now in context, with these questions:   Isn&#39;t THIS the point &quot;faith&quot; comes in?   Undocumented, no detail, &quot;several&quot; (3?  8?)...   Would a person lie or exaggerate to refute a point?  I wish I could say no, no one would do that.   Is this the point at which it really DOES matter what a person calls unschooling?  What other factors were there?  IF this is true, what went wrong?  What could those families have done differently?  That&#39;s important.   <br/>\n<br/>\nI&#39;m afraid that if I pursue this in those comments, that there will be elaboration on vague possible-dishonesty, or the holding up of failure-to-unschool as typical-of-unschool.<br/>\n<br/>\n=============================================================<br/>\n<br/>\nThey don&#39;t &quot;demand to learn to read&quot;<br/>\nSubmitted by Sandra Dodd on October 4, 2011 - 5:24am.<br/>\n-=-I know children for whom it has failed catastrophically, as in, they were unable to read by adulthood. -=-<br/>\n<br/>\nAfter twenty years of involvement with unschooling, I know of not one single unschooler who didn&#39;t learn to read. I&#39;ve known two adults, in 58 years, who couldn&#39;t read. They both went to school.<br/>\n<br/>\nHere&#39;s where you missed the point and are expecting the wrong thing: &quot; They may never demand to learn to read.&quot;<br/>\n<br/>\nI&#39;ve seen a dozen unschooled kids close-up learn to read (my kids and other local unschoolers), and have accounts of hundreds of others. None of them &quot;demanded to learn to read.&quot; They read. Some suddenly, some gradually, and every single one of them read.<br/>\n<br/>\n-=-I wonder what others think of the approach of *assuming* that the child wants to learn to read, and strewing her path with things to help that?-=-<br/>\n<br/>\nI think &quot;assuming&quot; is for beginners, and having seen in once, you will change that to &quot;knowing.&quot; You&#39;ve used my term &quot;strewing her path,&quot; so I hope you&#39;ll read more of the accounts of how unschoolers have learned to read, because the model you&#39;re using is rooted in schoolishness.<br/>\n<br/>\nIf school or parental pressure doesn&#39;t keep kids from wanting to read, there&#39;s no reason in the world that they wouldn&#39;t want to read. Parents can, if they&#39;re not careful, do the same kind of damage school does to the love of reading, the joy of mathematics, the fascination of history or science... unschooling can help people avoid that damage.<br/>\n<br/>\n-=-Waiting until the child is ready to learn to read - I agree that&#39;s a good approach. But who decides when they are &#39;ready&#39;? Sometimes the signs of readiness may be missed-=-<br/>\n<br/>\nYou&#39;re still thinking it involves teaching. Natural learning happens naturally, without another person being alert and jumping in and doing something. When they&#39;re ready, they read.<br/>\n<br/>\n<br/>\n-------------------------------<br/>\n<br/>\n<br/>\n<br/>\nSubmitted by Angela on October 4, 2011 - 6:23am.<br/>\n&quot;After twenty years of involvement with unschooling, I know of not one single unschooler who didn&#39;t learn to read. &quot;<br/>\n<br/>\nI&#39;m not lying, but clearly it&#39;s not my place to breach confidentiality by identifying people. Maybe people who are having problems with unschooling just switch away, and don&#39;t wish to contact you about it? After 14 years of involvement with unschooling, if that is what you would call reading about it and mixing with many families who love the approach, I personally know of several children who didn&#39;t learn to read by adulthood, from unschooled families. I only found out that they couldn&#39;t read because of personal friendship; it wasn&#39;t known in the wider community. Their parents didn&#39;t shout it from the rooftops, and neither did the children. And there is no suggestion of dyslexia, by the way. One suggestion from a parent was that, by the time teenage years set in, it was much harder for her child to learn, and he was embarrassed at not being able to read when others around him could.<br/>\n<br/>\nIt is not &#39;schoolishness&#39; to refuse to take on faith something which is not adequately supported by the evidence. I was brought up by parents who were proud to question orthodoxy, who gave me autonomy over my own education, and who gave me so much more freedom than anyone else I knew. Not agreeing with you does not mean that I do not understand your argument; it means that I don&#39;t agree.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] adults who can&#39;t read?","postDate":"1317738976","msgId":63287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE1OTdBQzUxLTgyNjAtNEU2Ri05QzUzLTBEN0FGQzRGNkI3RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63286,"nextInTopic":63288,"prevInTime":63286,"nextInTime":63288,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"In comments following this blog post by Dr. Peter Gray at Psychology Today... (and the comments notifications and postings are rough there; the links back go","messageBody":"<div id=\"ygrps-yiv-215081088\">In comments following this blog post by Dr. Peter Gray at Psychology Today...<br/>\n(and the comments notifications and postings are rough there; the links back go to wrong pages sometimes, and a post I only hit &quot;send&quot; on once showed up three times, so I&#39;m hesitant to post there again, for more than one reason)<br/>\n<br/>\nIf this Angela is on Always Learning, I invite more discussion here.<br/>\n<br/>\n=========================================<br/>\nFaith or evidence? This article&#39;s conclusions are not supported by its evidence.<br/>\nSubmitted by Angela on October 4, 2011 - 3:59am.<br/>\nI agree strongly with much of this, but there are some glaring, very unscientific errors. One problem with &#39;How Children Learn...&#39; , which applies to this article very strongly, is that the respondents were entirely self-selecting. People were asked to write about their experiences of autonomous education. There is a very strong selection bias here in that only people who feel this approach has worked well for their family are likely to respond. It tells us that this approach CAN work brilliantly, but what it doesn&#39;t tell us is how often it does so. What would tell us that, would be to follow several hundred unschooling families from toddlerhood and see how they get on, without the benefit of hindsight. I know children for whom it has failed catastrophically, as in, they were unable to read by adulthood. The article here states that:<br/>\n&quot;But the story is entirely different for unschooled children. They may learn to read at any time, with no apparent negative consequences. &quot;<br/>\nThis statement is completely unwarranted. To state that there were no apparent negative consequences, you&#39;d have to look at ALL the children who learned to read at any time, or who attempted to do so, not just the ones whose parents were so pleased with their progress that they took the trouble to write about it. What we can deduce from this article is that there are some great examples of learning to read in this fashion working well. It does not tell us that there are no negative consequences for anybody who takes this approach.<br/>\n<br/>\nI am not an opponent of unschooling; I have a lot of respect for it and draw on it hugely in my family. But whose interests are we serving, if we look uncritically at the approach, and just take it on faith that it works? It starts to sound like a religion then.<br/>\n<br/>\nReading is, surely, such an important tool in the autonomously educated child�s learning armoury. Without reading, the parent is the gatekeeper to learning. The child�s learning is limited to sources which someone else can read to her, or to other media such as videos - again, if she can find and access them herself. With reading, there are no barriers to autonomous education.<br/>\n<br/>\nWaiting until the child is ready to learn to read - I agree that&#39;s a good approach. But who decides when they are &#39;ready&#39;? Sometimes the signs of readiness may be missed; I think a lot of alertness and openness to the possibility that the child may be ready, is called for. I have seen some families where the parents were so ideologically opposed to early reading that it seemed they were not prepared to consider the possibility that the child might like to learn to read. If no attempt is made to learn to read, is the child making a choice? They may never demand to learn to read (there are still countries where illiteracy is rife and people may not feel the need to learn to read, so our cues to learn to read are largely social. If your family and friends are not bothered by your inability to read, will you be?). They may not have built up enough life experience to have the confidence to try, and gentle encouragement could give them that confidence. A friend who was an autonomous educator said that, if she had her time over again, she would jump on the *slightest* sign of interest in learning to read, as soon as it appeared, and really run with it. I wonder what others think of the approach of *assuming* that the child wants to learn to read, and strewing her path with things to help that?<br/>\n<br/>\n<br/>\n======================================<br/>\nThe original is here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read/comments?page=6\">http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read/comments?page=6</a><br/>\n<br/>\n<br/>\n<br/>\nI responded.  Next post.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"adults who can&#39;t read?","postDate":"1317738176","msgId":63286,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhEQ0RGOENELUY3NTMtNDU1QS1CNEY0LUYxODlEMEE3NkY4QUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":63287,"prevInTime":63285,"nextInTime":63287,"topicId":63286,"numMessagesInTopic":0,"msgSnippet":"I m going to leave this here, and then work backwards a bit to where it came from.  The first quote is me. ... Angela has commented on: Children Teach","messageBody":"<div id=\"ygrps-yiv-379475265\">I&#39;m going to leave this here, and then work backwards a bit to where it came from.  The first quote is me.<br/>\n<br/>\n-----------------------------------------------------------<br/>\n<br/>\nAngela has commented on: &quot;Children Teach Themselves to Read&quot;<br/>\n<br/>\nSubject: &quot;After twenty years of<br/>\n&quot;After twenty years of involvement with unschooling, I know of not one single<br/>\nunschooler who didn&#39;t learn to read. &quot;<br/>\n<br/>\nI&#39;m not lying, but clearly it&#39;s not my place to breach confidentiality by<br/>\nidentifying people. Maybe people who are having problems with unschooling<br/>\njust switch away, and don&#39;t wish to contact you about it? After 14 years of<br/>\ninvolvement with unschooling, if that is what you would call reading about it<br/>\nand mixing with many families who love the approach, I personally know of<br/>\nseveral children who didn&#39;t learn to read by adulthood, from unschooled<br/>\nfamilies. I only found out that they couldn&#39;t read because of personal<br/>\nfriendship; it wasn&#39;t known in the wider community. Their parents didn&#39;t<br/>\nshout it from the rooftops, and neither did the children. And there is no<br/>\nsuggestion of dyslexia, by the way. One suggestion from a parent was that, by<br/>\nthe time teenage years set in, it was much harder for her child to learn, and<br/>\nhe was embarrassed at not being able to read when others around him could.<br/>\n<br/>\nIt is not &#39;schoolishness&#39; to refuse to take on faith something which is not<br/>\nadequately supported by the evidence. I was brought up by parents who were<br/>\nproud to question orthodoxy, who gave me autonomy over my own education, and<br/>\nwho gave me so much more freedom than anyone else I knew. Not agreeing with<br/>\nyou does not mean that I do not understand your argument; it means that I<br/>\ndon&#39;t agree.</div>","specialLinks":[]}],"prevTopicId":63281,"nextTopicId":63354}}