{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] VanityFair/Classics/Shakespeare","postDate":"1109794685","msgId":104078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NC40YmZjMDlhYy4yZjU3Nzk3ZEBhb2wuY29tPg=="},"prevInTopic":104076,"nextInTopic":0,"prevInTime":104077,"nextInTime":104079,"topicId":104076,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/2/2005 12:28:57 P.M. Mountain Standard Time, cindyomom@msn.com writes: -=-I know, preaching to the choir....but had to offer my .02!   -=-","messageBody":"<div id=\"ygrps-yiv-592943492\">In a message dated 3/2/2005 12:28:57 P.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cindyomom@...\">cindyomom@...</a> writes:<br/>\n <br/>\n-=-I know, preaching to the choir....but had to offer my .02!   -=-<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSometimes it&#39;s nice to just be able to sit back, fan ourselves and say  <br/>\n&quot;AMEN!&quot; from time to time, before the next big choral number.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185667356,"authorName":"Cindy White","from":"&quot;Cindy White&quot; &lt;cindyomom@...&gt;","profile":"whitehouseacademy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"VanityFair/Classics/Shakespeare","postDate":"1109783557","msgId":104076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWMzBGOUIyMTZBMDE3OTkxN0M0QUFCQ0JDNUEwQHBoeC5nYmw+"},"prevInTopic":0,"nextInTopic":104078,"prevInTime":104075,"nextInTime":104077,"topicId":104076,"numMessagesInTopic":0,"msgSnippet":"... I ve got to come out of serious lurkdom for this thread. It s not just what you must read in order for it to count but also in a very big way how you","messageBody":"<div id=\"ygrps-yiv-952613619\"><blockquote><span title=\"ireply\">&gt;I read in an unschooling magazine the other day an article about <br/>\n&gt;educational superstitions and there was a statement about how <br/>\n&gt;Shakespeare wrote his plays to delight the audience, so if you don&#39;t <br/>\n&gt;enjoy them, you should ignore them.  I think that the majority of <br/>\n&gt;the authors of classic tales would probably feel the same way.  They <br/>\n&gt;wrote to entertain, not educate.  I bet that many of them would be <br/>\n&gt;screenwriters if they were born today!    The snobbery of (some) <br/>\n&gt;classical educators is ridiculous.<br/>\n<br/>\n&gt;Cyndi<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ve got to come out of serious lurkdom for this thread.<br/>\n<br/>\nIt&#39;s not just what you must read in order for it to &quot;count&quot; but also in a very big way how you read it.  It doesn&#39;t count if you listen to books on tape, only if you have actually read the words yourself.  I have one homeschooling friend whose required reading lists for her kids FAR surpasses what I read as an English major in college.  <br/>\n<br/>\nMy oldest LOVES to read but he picks what he wants.  He used to read all those Shakespeare picture books like Coville did a couple of years ago (he&#39;s 12).  But now he also LOVES Everquest, Halo2 and Black Sabbath.  When he turns on the TV it&#39;s usually to the history channel, but he still loves what my hs friends would call &quot;trash tv&quot; like Family Guy and Beavis & Butthead and movies like Without a Paddle.  His homeschooling friends find him to be the exception because he has much more freedom of choice than any of them do and not just in his choice of what to read or watch or listen to, but also in what to do.  He doesn&#39;t play soccer because he hates to run, yet they all play soccer, so when they play they encourage him to goalie.  He still reads voraciously and his reading today includes not just books but also gaming magazines, liner notes in CD&#39;s, Berkley Breathed, etc.<br/>\n<br/>\nMy youngest, who&#39;s 8, is an athlete and a dancer but hates to read.  Even though she knows how to read and is pretty good at it, she hasn&#39;t gotten to the point of letting herself read because she&#39;s so unsure of herself.  But she loves to be read to and loves books on tape.  She&#39;s never wanted to listen to the kinds of stuff my oldest wanted to who used books on tape to read books that were written for older kids that he completely understood but wasn&#39;t ready to actually read.  We are listening to stuff like all the Elizabeth Enright stuff, Nancy Drew, Tales of Despereaux, Wrinkle in Time, etc.....all the &quot;age appropriate&quot; books that if she were in school she might be forced to actually read.  She also loves Hillary Duff, designer clothes, makeup and skin care, cooking and creating her own skin care products.  Even though she hates to read, she&#39;s still probably more well read than any of her hs peers because she &quot;reads&quot; so many books on tape.  And even though she doesn&#39;t care for the headier stuff her brother did at 8, like Rifles for Watie or House of Dies Drear, she still gets to &quot;read&quot; books that her reading skills would keep her from actually reading now, but that she loves dearly.  <br/>\n<br/>\nBeing the only unschooler I know in person, LOL, I&#39;m the enigma who gets to answer all the questions like &quot;but what about college&quot; or &quot;don&#39;t you think they need to know how to spell&quot; or &quot;what if they don&#39;t like to read&quot;. I enjoy &quot;enlightening&quot; my fellow homeschoolers & I think some of them have lightened up a bit although they still require their kids to do school at home.  And I try to get them to understand that listening to books does actually qualify as reading....that driving an hour to see &quot;As You Like It&quot; performed is much more valuable than making your kids read it....and that trying to force an athlete to be a reader is as bad as trying to force a reader to be an athlete....it just won&#39;t work and certainly won&#39;t help them be happy or productive adults.<br/>\n<br/>\nI know, preaching to the choir....but had to offer my .02!  <br/>\nCindy in Virginia<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":103930,"nextTopicId":103626}}