{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Control Withdrawals!","postDate":"1243527817","msgId":45593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2bWRxOSthZ2kyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd2anR2ait2ZW1iQGVHcm91cHMuY29tPg=="},"prevInTopic":45578,"nextInTopic":0,"prevInTime":45592,"nextInTime":45594,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"... comes to teens, because I don t have one, and they seem to inhabit a very different world (even when I was teen I felt this way). ... I don t think teens","messageBody":"<div id=\"ygrps-yiv-625909884\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Really, though, I shouldn&#39;t be dispensing advice, particularly when it<br/>\n </span></blockquote>comes to teens, because I don&#39;t have one, and they seem to inhabit a<br/>\nvery different world (even when I was teen I felt this way).<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I don&#39;t think teens inhabit a different world.  They definitely like to<br/>\nhang with other teens.  Here&#39;s what I see... Unschooled teens will<br/>\nreadily accept friendship and company of many ages and types of people,<br/>\nwhile schooled teens, will begrudgingly do so.  It doesn&#39;t mean they<br/>\nwon&#39;t, it means that their natural instinct to learn from the whole<br/>\nworld around them, including many ages and people, has been squashed by<br/>\nthe school system.  You have to be persistent in interactions with teens<br/>\nthat have been in school for a long time.<br/>\n<br/>\nI&#39;ve been relatively successful in befriending teens of all kinds,<br/>\nincluding schooled ones.  You&#39;ve got to be totally open and accepting of<br/>\nwhatever they are into, even if it&#39;s sex talk and nasty jokes.  Open<br/>\nyour house up, let them play their music, feed them, and just talk about<br/>\nrandom stuff that comes up.  Every time Chamille brings a new friend<br/>\nover, I introduce myself and ask questions of the person, like &quot;do you<br/>\nlive around here?&quot;, &quot;do you have any siblings, and if yes how many and<br/>\nwhat ages?&quot;, &quot;how old are you, when&#39;s your b-day?&quot;, &quot;what&#39;s your<br/>\nfavorite musician and why?&quot;, etc.  It&#39;s not done interogation style,<br/>\nmore in a &quot;I&#39;m interested to get to know you&quot; way.<br/>\n<br/>\nSometimes, for kids who are in school and have really yucky parents,<br/>\nthis can take a long time of multiple interactions before they feel<br/>\ncomfortable with talking to you, the adult.  Teens naturally like<br/>\nadults, they are learning to become one, just like little kids naturally<br/>\nlike slightly older kids, because it&#39;s the next step in their lives. <br/>\nSchools have an insideous way of squashing this natural leaning to<br/>\nbefriend the next step, and discourage the older kids from wanting to be<br/>\naround the younger kids, which is also natural.  It&#39;s natural for older<br/>\nkids to still associate with slightly younger kids, because it&#39;s where<br/>\nthey just came from, and still a part of who they are as they are<br/>\nbecoming older.<br/>\n<br/>\nAll that to say, don&#39;t be intimidated by talking to teens.  They are<br/>\npeople too and kids soon to be adults.  I really dislike the way our<br/>\nculture seperates them out as other than, instead of embracing them and<br/>\nenjoying them!</div>","specialLinks":[]},{"userId":299867162,"authorName":"Maria","from":"&quot;Maria&quot; &lt;maria.veltman@...&gt;","profile":"trinity3857","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Control Withdrawals!","postDate":"1243446067","msgId":45578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2anR2ait2ZW1iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPg=="},"prevInTopic":45564,"nextInTopic":45593,"prevInTime":45577,"nextInTime":45579,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"If it makes you feel better, I m experiencing control withdrawals too.  The first few days of no bedtimes for Seth were great, but now I m feeling like the","messageBody":"<div id=\"ygrps-yiv-746574235\">If it makes you feel better, I&#39;m experiencing control withdrawals too.  The first few days of no bedtimes for Seth were great, but now I&#39;m feeling like the dieter who does really well for the first three days and then feels the cravings hit really hard.  Last night was particularly difficult - for me!  But I managed.  I was taking a lot of breaths and reminding myself of the &quot;whys&quot;.  <br/>\n<br/>\nIf your son is bored you might suggest that he join you in doing what you&#39;re doing.  So long as it isn&#39;t chores!  You might also ask him what kind of life he would like to have and how he might attain it.<br/>\n<br/>\nReally, though, I shouldn&#39;t be dispensing advice, particularly when it comes to teens, because I don&#39;t have one, and they seem to inhabit a very different world (even when I was teen I felt this way). <br/>\n<br/>\nIt&#39;s helped me to take a deep breath and say to myself, &quot;This too, shall pass&quot; and realizing that, try to make the best moment out of it (easier said than done, of course). <br/>\n<br/>\nYou came to the right place.  Just try on for size.  You&#39;ll find what fits.  <br/>\n<br/>\nMaria  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Linda Adair&quot; &lt;lindajane32686@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Help! I have always homeschooled in an eclectic mode but still held the reigns so to speak.  Lately it has become more important to me that my relationship with my last two younger boys is sweet.  We were having way too much friction and I was always cross with them.  Last week I had a more hands off focus and watched them.  As expected they played a LOT of games, and the oldest at 14 spent a lot of time on his phone!  I left it alone.  This week it has begun to bug me more...so I need some encouragement to trust this is not going to always be this way!  My 14 year old has been on the phone almost all day!  My 11 year old stated, again, he doesn&#39;t like his life and he is bored.  I remember reading that boredom is nothing to be concerned with (before I would say &quot;no boredom allowed, if you are bored I&#39;ll find you some chore!&quot;) and that it will give them time to think what they would like to do with their time.  I know I need to be more engaged with them...it is not going to be easy...as I have other interests!  However, how can you be engaged with your son when he is on the phone all the time??? Thanks to all for engaging and enlightening topics.  I have needed this for a looooong time!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Control Withdrawals!","postDate":"1243399542","msgId":45564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMUNDNTc2LjcwMTA3MDJAbWFjLmNvbT4=","inReplyToHeader":"PGd2aGxlbSs4MG9uQGVHcm91cHMuY29tPg==","referencesHeader":"PGd2aGxlbSs4MG9uQGVHcm91cHMuY29tPg=="},"prevInTopic":45563,"nextInTopic":45578,"prevInTime":45563,"nextInTime":45565,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"... Me too. Also, when he hangs up, you can say, How s so-and-so? Show an interest. (But be careful it doesn t sound like you re haranguing him for being on","messageBody":"<div id=\"ygrps-yiv-2146789688\">On 5/26/2009 2:03 PM, Jenny C wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;    &gt;&gt;&gt;However, how can you be engaged with your son when he is on the<br/>\n&gt; phone all the time??? Thanks to all for engaging and enlightening<br/>\n&gt; topics. I have needed this for a looooong time!&gt;&gt;&gt;<br/>\n&gt;    <br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt;      <br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Text him?  Send him cool stuff to check out?  That&#39;s what I would do.  I<br/>\n&gt; don&#39;t have an iphone, nor does my older daughter, but we do text each<br/>\n&gt; other a lot, even from one end of the house to the other!  It&#39;s fun!<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Me too. Also, when he hangs up, you can say, &quot;How&#39;s so-and-so?&quot; Show an <br/>\ninterest. (But be careful it doesn&#39;t sound like you&#39;re haranguing him <br/>\nfor being on the phone, if you&#39;ve done that a lot before.)<br/>\n<br/>\n<br/>\nI wanted to mention that it is super super common for kids to spend a <br/>\nlot of time socializing at that age - just talking talking talking <br/>\ntalking. If you listen in, it can sound inane, but it is research and <br/>\nexperimentation - figuring out relationships and human nature and all <br/>\nthat.  So - if that&#39;s what he is really doing - good for him. Or is it <br/>\nsomething else? I mean, think more about why he&#39;s on the phone all the <br/>\ntime - let us know what you think.<br/>\n<br/>\nAnd - why not invite over the people he&#39;s on the phone with?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Control Withdrawals!","postDate":"1243394649","msgId":45563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGQTMzMEY1LTM0NEItNERBQy1CRjFFLUM4QkFEMTAyMTkzMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEEzNDE4ODVEMjkwQzQ3MkU4RERGREU0MUQ5ODQ4NzdEQFJvYnluUEM+","referencesHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPiA8QTM0MTg4NUQyOTBDNDcyRThEREZERTQxRDk4NDg3N0RAUm9ieW5QQz4="},"prevInTopic":45560,"nextInTopic":45564,"prevInTime":45562,"nextInTime":45564,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"-=My 11 year old stated, again, he doesn t like his life and he is bored. I remember reading that boredom is nothing to be concerned with (before I would say","messageBody":"<div id=\"ygrps-yiv-1005446273\">-=My 11 year old stated, again, he doesn&#39;t like his life and he is  <br/>\nbored.<br/>\nI remember reading that boredom is nothing to be concerned with  <br/>\n(before I<br/>\nwould say &quot;no boredom allowed, if you are bored I&#39;ll find you some  <br/>\nchore!&quot;)<br/>\nand that it will give them time to think what they would like to do with<br/>\ntheir time. I know I need to be more engaged with them-=-<br/>\n<br/>\nRobyn gave a good answer, but think of what kind of mom you want to  <br/>\nbe.  Rather than figuring how little you &quot;have to&quot; do to be a good  <br/>\nmom, look at how much you COULD do.  How good a mom could you be?  How  <br/>\nattentive?  How aware?   Barely getting by is too schoolish.   Don&#39;t  <br/>\nthink of it as whether you&#39;ve done enough for the day.   Think of  <br/>\nwhether there&#39;s one more thing you could do.  And then, whether  <br/>\nthere&#39;s one MORE.  Even if my child is asleep, there still might be  <br/>\none more thing I can do to make his life better when he wakes up, or  <br/>\nwhile he&#39;s sleeping.<br/>\n<br/>\n<br/>\nI think the traditional attitudes about boredom are harmful.  This  <br/>\nmight give you some more ideas:<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Control Withdrawals!","postDate":"1243391679","msgId":45560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzNDE4ODVEMjkwQzQ3MkU4RERGREU0MUQ5ODQ4NzdEQFJvYnluUEM+","inReplyToHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPg==","referencesHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPg=="},"prevInTopic":45558,"nextInTopic":45563,"prevInTime":45559,"nextInTime":45561,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1194229127\">&lt;&lt;&lt;&lt; My 11 year old stated, again, he doesn&#39;t like his life and he is bored.<br/>\nI remember reading that boredom is nothing to be concerned with (before I<br/>\nwould say &quot;no boredom allowed, if you are bored I&#39;ll find you some chore!&quot;)<br/>\nand that it will give them time to think what they would like to do with<br/>\ntheir time.  I know I need to be more engaged with them&gt;&gt;&gt;&gt;<br/>\n<br/>\nI take it when your say &quot;nothing to be concerned about&quot; you really mean <br/>\nnothing to be &quot;worried&quot; about, that sometimes it is a momentary or short <br/>\nterm thing. However here you are saying that your son has stated this more <br/>\nthan once.<br/>\n<br/>\nI think it depends on what &quot;bored&quot; is code for, and I am pretty much always <br/>\nconcerned with, as in deeply interested in, Jayn&#39;s emotional state.<br/>\nWhen Jayn says that she is bored, usually that is very simply translated to <br/>\n&quot;I want more of your focussed attention&quot;, even if it just watching a tv show <br/>\nwith her on the sofa.<br/>\n<br/>\nSince your older boy is so happy with the phone right now, that sounds like <br/>\nan ideal opportunity to do something with your 11 yo. Sometimes when <br/>\nchildren have had their time and activities dictated, they lose track of <br/>\ntheir own passions. I hope you can both discover what your 11 yo&#39;s passions <br/>\nare.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;My 14<br/>\n<blockquote><span title=\"ireply\"> &gt; year old has been on the phone almost all day!  ......I need some<br/>\n&gt; encouragement to trust this is not going to always be this way &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Sometimes it helps to think about a &quot;what if&quot;. What if your older son <br/>\nremains on the phone most every day for a month, a season, a year, for <br/>\nyears? Maybe he is a great verbal communicator, and has the ability to <br/>\norganize his thoughts and speak extemporaneously with clarity. I admire <br/>\nthat - it takes me writing and rewriting to achieve clarity. Maybe he will <br/>\nend up being one of those people that earn their living talking to people on <br/>\nthe phone, like a counsellor (hopefully not a phone psychic). Maybe he is a <br/>\ngreat listener - his future spouse will love that quality about him. It <br/>\nprobably won&#39;t be all day every day for years.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;As expected they played a LOT of<br/>\n<blockquote><span title=\"ireply\"> &gt; games, and the oldest at 14 spent a lot of time on his phone!  I left it<br/>\n&gt; alone. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Leaving &quot;it&quot; alone is not the same as leaving &quot;them&quot; alone.<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Control Withdrawals!","postDate":"1243388740","msgId":45558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ2MjFGMTFCLUVGNTMtNDgzQi05N0Q3LTc4NjZBQUQ1NTdDRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPg==","referencesHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPg=="},"prevInTopic":45557,"nextInTopic":45560,"prevInTime":45557,"nextInTime":45559,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"-=-I have always homeschooled in an eclectic mode but still held the reigns so to speak.-=- I want to note this word not to correct or embarrass you, but","messageBody":"<div id=\"ygrps-yiv-1151647593\">-=-I have always homeschooled in an eclectic mode but still held the  <br/>\nreigns so to speak.-=-<br/>\n<br/>\nI want to note this word not to correct or embarrass you, but because  <br/>\nthis is the third use of &quot;reigns&quot; instead of &quot;reins&quot; in just a couple  <br/>\nof weeks.<br/>\n<br/>\n&quot;Rein&quot; as in the straps to a horse&#39;s bridle is the rein you hold, or  <br/>\ngive freely.    Reign is the period of time someone is king.   Perhaps  <br/>\nthe confusion comes, regarding control or freedom, in the idea of  <br/>\nsomeone commanding someone else.<br/>\n<br/>\nIn this and all other things, in a discussion, if someone is unsure  <br/>\nabout what he or she is writing, and confused about words, or using  <br/>\nwords without being careful, then that will mean the thinking is also  <br/>\nnot as careful or as clear as it could be otherwise.   So it&#39;s okay to  <br/>\nuse the wrong word, but it&#39;s also okay for someone else to point it out.<br/>\n<br/>\nReally, the goal is for people to be able to sort through their own  <br/>\nhabits and reactions and fears to come to a clearing where the  <br/>\nchildren can live freely.<br/>\n<br/>\n-=As expected they played a LOT of games, and the oldest at 14 spent a  <br/>\nlot of time on his phone! I left it alone. This week it has begun to  <br/>\nbug me more...so I need some encouragement to trust this is not going  <br/>\nto always be this way! My 14 year old has been on the phone almost all  <br/>\nday!-=-<br/>\n<br/>\nWas the phone limited before?   Is he talking to someone you could  <br/>\ninvite over, instead?<br/>\n<br/>\n(Doh!  This sat here a long time and someone already asked that.<br/>\n<br/>\nAs to withdrawal from control itself, one thing some moms have found  <br/>\nhelpful is to find other things to control:  clean the store room,  <br/>\nschedule up a bunch of meals and make a gloriously organized shopping  <br/>\nlist, reorganize your bathroom, start a hobby...  control yourself  <br/>\ninstead of your kids.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Control Withdrawals!","postDate":"1243384599","msgId":45557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZDMDVGQjZDLTBDMTctNEQ0RS05N0IxLTU3RTA3NUQ5OTFEQkBzdXBlbm4uY29tPg==","inReplyToHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPg==","referencesHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPg=="},"prevInTopic":45556,"nextInTopic":45558,"prevInTime":45556,"nextInTime":45558,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"... Disclaimer: my oldest child turns 8 tomorrow, so I am speaking out of my hat when talking about older kids. But I have a couple of ideas. One is to wonder","messageBody":"<div id=\"ygrps-yiv-793763978\">On May 26, 2009, at 2:54 PM, Linda Adair wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  However, how can you be engaged with your son when he is on the  <br/>\n&gt; phone all the time???<br/>\n<br/>\n </span></blockquote>Disclaimer: my oldest child turns 8 tomorrow, so I am speaking out of  <br/>\nmy hat when talking about older kids.<br/>\n<br/>\nBut I have a couple of ideas. One is to wonder who he&#39;s on the phone  <br/>\nwith. Is there a friend he&#39;d like to see in person? Can you facilitate  <br/>\nthat? What are they talking about? Is there something they&#39;re  <br/>\ninterested in that you could use as inspiration for an outing together  <br/>\nwith his friend?<br/>\n<br/>\nOn the other hand, if his phone time is private for him, you might  <br/>\njust continue to offer non-phone activities together is a really low- <br/>\nkey way. Again, build on his interests: would he like to go to the  <br/>\ncomic shop? To get some magazines about something he&#39;s interested in?  <br/>\nYou know what he likes.<br/>\n<br/>\nI will say, based on my own little kids, don&#39;t freak out too much  <br/>\nabout him being on the phone so much right now. People who have de- <br/>\nschooled with their kids tell stories like that all the time! My own  <br/>\nkids, who have always been unschooled, also sometimes go through very  <br/>\nfocused phases. Inevitably, just as I am starting to worry (&quot;maybe  <br/>\nthey really ARE playing too many video games!&quot;) they switch it up and  <br/>\nspend a whole day building a spaceship in the living room or  <br/>\nsomething. When I find myself fretting like that, I tell myself, &quot;I&#39;ll  <br/>\ngive it another week before I start to worry&quot; (or, I&#39;ll give it  <br/>\nanother 30 days...). In every case something has happened to relieve  <br/>\nmy worry in the time I&#39;ve set. Sometimes it&#39;s a change in the kids&#39;  <br/>\nhabits, the end of a really focused period--and sometimes it&#39;s me!  <br/>\n(The end of _my_ period, for example :-) I&#39;m more prone to worry  <br/>\nsometimes than others, so my own fretting passes sometimes even if the  <br/>\npattern of the days doesn&#39;t switch-up.<br/>\n<br/>\nI do sometimes check in with my older son, who is more inclined to  <br/>\nlong periods of immersion. I&#39;ll ask something like, &quot;Are you enjoying  <br/>\nwatching movies, or are you wishing there was something else to do?&quot;  <br/>\nIf he tells me he&#39;s just enjoying himself, I might say, &quot;OK, can I get  <br/>\nyou a snack?&quot; or &quot;Let me know if you need my help finding something  <br/>\nnew on Free On Demand.&quot;<br/>\n<br/>\nWhich reminds me--one way to stay connected with your son is to do  <br/>\nsmall thoughtful, non-intrusive things. Bring him a snack, wash and  <br/>\nfold his laundry for him and give him a big smile as you pass him on  <br/>\nthe way to his dresser, buy his favorite food for the freezer.  <br/>\n&quot;Connection&quot; doesn&#39;t have to mean &quot;doing the same thing with him,&quot; it  <br/>\ncan mean, &quot;reminding him he&#39;s valued and you like him.&quot; You might find  <br/>\nseveral opportunities throughout the day for a quick, pleasant moment.<br/>\n<br/>\nSu<br/>\n<br/>\nmom of Eric, 8; Carl, 5; Yehva, almost 2</div>","specialLinks":[]},{"userId":62589750,"authorName":"JudithAnneMurphy@aol.com","from":"JudithAnneMurphy@...","profile":"shepherdlass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Control Withdrawals!","postDate":"1243372458","msgId":45556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmMC41OTZiNjIzZC4zNzRkYjVhYUBhb2wuY29tPg=="},"prevInTopic":45554,"nextInTopic":45557,"prevInTime":45555,"nextInTime":45557,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"In a message dated 26/05/2009 20:50:33 GMT Standard Time, lindajane32686@yahoo.com writes: However, how can you be engaged with your son when he is on the","messageBody":"<div id=\"ygrps-yiv-330110530\">In a message dated 26/05/2009 20:50:33 GMT Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lindajane32686@...\">lindajane32686@...</a> writes:<br/>\n<br/>\nHowever, how can you be engaged with your son when he is on the phone  all <br/>\nthe time??? <br/>\n<br/>\n<br/>\nI used to say this kind of thing about my daughter being on World of  <br/>\nWarcraft.  Certainly, WoW is her space (perhaps the phone time is  your son&#39;s <br/>\nspace?).  It took me ages to realize that this didn&#39;t go  for all her time when <br/>\nshe was engaged with virtual worlds.    <br/>\n <br/>\nBut, since I&#39;ve been trying to put into action the ideas I&#39;ve read about in <br/>\n this group (and finally found time to follow advice over several years <br/>\nfrom  Schuyler), I&#39;ve realized that dd shares far more of her online time with <br/>\nme  than I&#39;d have expected - mainly as a result of my asking  occasional <br/>\nnon-intrusive questions about what she finds amusing (&quot;What&#39;s  new on <br/>\nLOLcats?&quot;, etc), and then chatting and sharing.  And realizing how  sophisticated her <br/>\nhumour can be means I no longer see this type of screentime as  trivial - <br/>\nI&#39;m noticing that the more I respect her choices, the more she&#39;ll  share <br/>\nthese things with me.  WoW remains off limits for me as she doesn&#39;t  want to be <br/>\nembarrassed by my terrible reaction times, but there are lots of  mutual <br/>\ngiggles about other favourite sites.  <br/>\n <br/>\nOf course, a website&#39;s easier to share than a phone conversation - and I  <br/>\nsuppose it&#39;s harder to ask gentle questions without getting into invasions of <br/>\n private territory.  All I&#39;m suggesting from my (admittedly  <br/>\nlimited!)experience is that a young person&#39;s intense engagement with  a virtual world or a <br/>\nvoice on the other end of the line doesn&#39;t  necessarily preclude other <br/>\nengagement.  <br/>\n <br/>\nJude x<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Control Withdrawals!","postDate":"1243371798","msgId":45554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2aGxlbSs4MG9uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPg=="},"prevInTopic":45551,"nextInTopic":45556,"prevInTime":45553,"nextInTime":45555,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"... easy...as I have other interests! There is something really amazing about setting aside your own interests to become thoroughly interested in whatever","messageBody":"<div id=\"ygrps-yiv-2063798774\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I know I need to be more engaged with them...it is not going to be<br/>\n </span></blockquote>easy...as I have other interests!&gt;&gt;&gt;<br/>\n<br/>\nThere is something really amazing about setting aside your own interests<br/>\nto become thoroughly interested in whatever it is your kids are<br/>\ninterested in.  Suddenly, you&#39;ve expanded your own world with infinite<br/>\npossibilities!  Your own personal interests will still be there, or<br/>\nactually grow with more ideas to add to it.  I can&#39;t even begin to say<br/>\nhow wonderful it&#39;s been to be really involved in what my kids are into. <br/>\nI learn so much about them, about our world, and life, just by being<br/>\ninterested in what they are interested in.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;However, how can you be engaged with your son when he is on the<br/>\n </span></blockquote>phone all the time??? Thanks to all for engaging and enlightening<br/>\ntopics. I have needed this for a looooong time!&gt;&gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Text him?  Send him cool stuff to check out?  That&#39;s what I would do.  I<br/>\ndon&#39;t have an iphone, nor does my older daughter, but we do text each<br/>\nother a lot, even from one end of the house to the other!  It&#39;s fun!</div>","specialLinks":[]},{"userId":141961097,"authorName":"Linda Adair","from":"&quot;Linda Adair&quot; &lt;lindajane32686@...&gt;","profile":"lindajane32686","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Control Withdrawals!","postDate":"1243364095","msgId":45551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2aGR0dis0ZXNpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45554,"prevInTime":45550,"nextInTime":45552,"topicId":45551,"numMessagesInTopic":0,"msgSnippet":"Help! I have always homeschooled in an eclectic mode but still held the reigns so to speak.  Lately it has become more important to me that my relationship","messageBody":"<div id=\"ygrps-yiv-471344417\">Help! I have always homeschooled in an eclectic mode but still held the reigns so to speak.  Lately it has become more important to me that my relationship with my last two younger boys is sweet.  We were having way too much friction and I was always cross with them.  Last week I had a more hands off focus and watched them.  As expected they played a LOT of games, and the oldest at 14 spent a lot of time on his phone!  I left it alone.  This week it has begun to bug me more...so I need some encouragement to trust this is not going to always be this way!  My 14 year old has been on the phone almost all day!  My 11 year old stated, again, he doesn&#39;t like his life and he is bored.  I remember reading that boredom is nothing to be concerned with (before I would say &quot;no boredom allowed, if you are bored I&#39;ll find you some chore!&quot;) and that it will give them time to think what they would like to do with their time.  I know I need to be more engaged with them...it is not going to be easy...as I have other interests!  However, how can you be engaged with your son when he is on the phone all the time??? Thanks to all for engaging and enlightening topics.  I have needed this for a looooong time!</div>","specialLinks":[]}],"prevTopicId":45590,"nextTopicId":45595}}