{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":95679678,"authorName":"alaurashome","from":"&quot;alaurashome&quot; &lt;alaurashome@...&gt;","profile":"alaurashome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: SOS!! to Patti","postDate":"1024091886","msgId":38344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFlZG90ZStrMTZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNDRkMwMEU1LjY1QkYwMjEyQG1pbmRzcHJpbmcuY29tPg=="},"prevInTopic":38111,"nextInTopic":0,"prevInTime":38343,"nextInTime":38345,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"... They *want* to make each other ... from. ... never ... My children play happily together and I let them.  When they start fighting, it gets my attention","messageBody":"<div id=\"ygrps-yiv-710395151\"><blockquote><span title=\"qreply\">--- In Unschooling-dotcom@y..., Patti &lt;averyp@m...&gt; wrote:<br/>\n  They *want* to make each other<br/>\n&gt; &quot;pop.&quot;  They seem to find it more entertaining than anything else<br/>\n&gt; available.  And it&#39;s not like they have nothing else to choose <br/>\nfrom.<br/>\n&gt; Our house is brimming with things to do- their schooled friends <br/>\nnever<br/>\n&gt; want to leave when they spend time here.<br/>\n&gt; <br/>\n<br/>\n<br/>\nMy children play happily together and I let them.  When they start <br/>\nfighting, it gets my attention and I suddenly remember all of the <br/>\nchores that need to be done.  <br/>\n<br/>\nThey have slowly learned that solving their disagreements without <br/>\nyelling or hitting is more fun than washing floors or pulling weeds.<br/>\n<br/>\nAlaura </span></blockquote></div>","specialLinks":[]},{"userId":1302501,"authorName":"Patti","from":"Patti &lt;averyp@...&gt;","profile":"lwsskater","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SOS!!","postDate":"1023148261","msgId":38074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDRkMwMEU1LjY1QkYwMjEyQG1pbmRzcHJpbmcuY29tPg==","referencesHeader":"PDIwMDIwNjAyMDI0OTEzLjgwNjI1LnFtYWlsQHdlYjE0NzAyLm1haWwueWFob28uY29tPiA8NS4xLjAuMTQuMC4yMDAyMDYwMjAzMzQyNC4wMjU3Y2VjMEBwb3AzLm5vcnRvbi5hbnRpdmlydXM+"},"prevInTopic":38069,"nextInTopic":38111,"prevInTime":38073,"nextInTime":38075,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"Thanks for the support and suggestions everyone. Yes, I have read Siblings Without Rivalry and will read it again... I keep meaning to pull it out. ... I think","messageBody":"<div id=\"ygrps-yiv-506443496\">Thanks for the support and suggestions everyone.<br/>\nYes, I have read Siblings Without Rivalry and will read it again... I<br/>\nkeep meaning to pull it out.<br/>\n<br/>\nmarji wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  In other words, they may not be hating all this fighting as<br/>\n&gt; much as you do; there may be some kind of unintended reward they get,<br/>\n&gt; like<br/>\n&gt; seeing you in a certain state, or just dragging you into it.<br/>\n<br/>\n </span></blockquote>I think this is a big part of it.  They *love* to have a reason to yell<br/>\n&quot;MOOOOMMMM!!!!&quot;   One will needle the other until the other hits or<br/>\npushes, then the original antagonizer yells for me and acts like a<br/>\nvictim.   They will both actually try to outdo each other after I break<br/>\nup a fight- exaggerating their &quot;injuries&quot; and trying to outcry each<br/>\nother.  Like whoever I feel the most sorry for wins.  Today one of them<br/>\ncaused the other to fall, and the faller *insisted* that his ankle was<br/>\nsprained or broken and that he couldn&#39;t walk.   Within minutes he was<br/>\nrunning around perfectly fine, and they were laughing and playing again.<br/>\n<br/>\nHere are some common scenarios:<br/>\nOlder brother is absorbed in something quiet.  Younger brother notices<br/>\nand decides to purposely do something to get in his way or make loud<br/>\nirritating noises.  Older brother tells him to move it.   Younger<br/>\nbrother says &quot;I don&#39;t have to if I don&#39;t want to.&quot;  Older brother tells<br/>\nhim again to move.  Younger brother does not.  Older brother shoves<br/>\nyounger brother out of the way.  Younger brother falls down dramatically<br/>\nand screams his head off.   I&#39;ve responded to this scenario in a variety<br/>\nof ways from ignoring it (feels wrong) to walking in and sympathizing<br/>\n(feels like stepping into the role they&#39;re designing for me) to acting<br/>\ndisgusted (&quot;oh please!  How can I feel sorry for you when you got<br/>\nexactly what you were looking for?&quot;)  None of these approaches have<br/>\nhelped in the least.<br/>\nAnother common scenario is wrestling or having a pillow fight, insisting<br/>\nthat they want to do it and are having fun.  Invariably someone ends up<br/>\ncrying because someone does something too hard.<br/>\nThey chase each other around, sometimes laughing, sometimes crying.<br/>\nThey slam doors on each other, sometimes laughing and sometimes crying.<br/>\nYounger brother hit older brother with a fly swatter today, out of the<br/>\nblue, for no apparent reason, followed by chasing and screams of &quot;I&#39;M<br/>\nGONNA GET YOU!&quot; from older brother.  More door slamming doors.<br/>\nThere were various other similar scenarios throughout the day.<br/>\nIt&#39;s just the four of us here... their Dad won&#39;t be home until late<br/>\ntonight.<br/>\nWe tried calling the couple of good friends they have to break up the<br/>\nintense togetherness, but they weren&#39;t available.  (More friend options<br/>\nwould help- especially if they had different ones- but where to find<br/>\nthem?)  And we did get out for quite a while, but they just picked on<br/>\neach other while we were out (and in the car, and in the restaurant<br/>\nwaiting for our take out...)<br/>\nI can honestly say I&#39;ve never seen anything quite like it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wonder if there is any way you can avoid breaking up their fights<br/>\n&gt; all the<br/>\n&gt; time.<br/>\n<br/>\n </span></blockquote>The only reason I can&#39;t do this (not break up a fight) is that they&#39;re<br/>\nstrong and capable of really hurting each other.  Plus it upsets their<br/>\nbaby brother.  I feel like I simply have to break it up.<br/>\nThe times I&#39;ve tried just letting them go at it (like when I&#39;m *truly*<br/>\nat the end of my tether) they just escalate until I feel like I have no<br/>\nchoice but to do something.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe they could come up with a code word that means, &quot;This is<br/>\n&gt; serious:  leave me alone right now; I&#39;m about to pop.&quot;<br/>\n<br/>\n </span></blockquote>But that seems to be their whole point.  They *want* to make each other<br/>\n&quot;pop.&quot;  They seem to find it more entertaining than anything else<br/>\navailable.  And it&#39;s not like they have nothing else to choose from.<br/>\nOur house is brimming with things to do- their schooled friends never<br/>\nwant to leave when they spend time here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think one of the best things you can do, though, is try to remove<br/>\n&gt; yourself from their dramas.  When you&#39;re in it, it may become an<br/>\n&gt; unconscious  competition for them in a way to prove their case or get<br/>\n&gt; you<br/>\n&gt; angry or get your sympathy.<br/>\n<br/>\n </span></blockquote>Definitely a big part of it.  But how to remove myself and also keep<br/>\nthem both safe?  How to create a peaceful environment for all of us, and<br/>\nespecially my 3yo, with this craziness going on all the time?<br/>\n<br/>\nThanks again.<br/>\nPatti<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59432230,"authorName":"joanna514","from":"&quot;joanna514&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: SOS!!","postDate":"1023113240","msgId":38111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFkZnQ2bytqb2dzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzZS5mMzMyODY3LjJhMmJhMTliQGFvbC5jb20+"},"prevInTopic":38074,"nextInTopic":38344,"prevInTime":38110,"nextInTime":38112,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"... pretty ... perhaps one is ... I think that is a likelyhood of parents that don t live with and know their children very well.  Neither one of mine is the","messageBody":"<div id=\"ygrps-yiv-2125638564\">--- In Unschooling-dotcom@y..., SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 6/2/02 8:29:49 AM, Wilkinson6@m... writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt; I have an 11yo dd and 8yo ds who like to pick and argue and be <br/>\n </span></blockquote>pretty <br/>\n<blockquote><span title=\"ireply\"> &gt; darn mean to each other and sometimes hit each other.<br/>\n&gt; They seem to enjoy it &gt;&gt;<br/>\n&gt; <br/>\n&gt; It&#39;s probable that one is enjoying it more than the other, and <br/>\n </span></blockquote>perhaps one is <br/>\n<blockquote><span title=\"ireply\"> &gt; being abused by the other.<br/>\n&gt; <br/>\n&gt;<br/>\n </span></blockquote>I think that is a likelyhood of parents that don&#39;t live with and know <br/>\ntheir children very well.  Neither one of mine is the victim.  It <br/>\nwould be a true situation if I left my older son and my younger son <br/>\nalone.  My younger would be the victim in a situation like this and I <br/>\ndo step right in if I hear injustice or feel possible violence coming <br/>\non.  With my older two it is definitely a game of sorts that they try <br/>\nto drag me into.  When times like these happen it is a wake up call.  <br/>\nThey do need something from me and or a change in their daily life <br/>\nand that happens, but I also step out of the &quot;game&quot; and they take <br/>\ncontrol of themselves.  It works.  This past problem was picking and <br/>\nteasing everytime we got in the car.   <br/>\nSometimes one is feeling jealous of the other because of attention <br/>\nthey are getting (my son is a very good soccer player and <br/>\ngrandparents have been raving.  My dd loves theater and she is <br/>\nthe &quot;star&quot; during productions....) We work all of these things out.  <br/>\nWe talk.  We live together.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Those children didn&#39;t choose to live together, they are stuck with <br/>\n </span></blockquote>one <br/>\n<blockquote><span title=\"ireply\"> &gt; another because of parental decisions and actions.  Sometimes <br/>\n </span></blockquote>that&#39;s <br/>\n<blockquote><span title=\"ireply\"> &gt; punishment enough!<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>And they remind me of that when they are not getting along! &lt;g&gt;<br/>\nMy kids are extremely passionate, highly active and a force to be <br/>\nreckoned with.  Nothing is simple when it comes to them, but they <br/>\nsure make life interesting!<br/>\nJoanna</div>","specialLinks":[]},{"userId":1302501,"authorName":"Patti","from":"Patti &lt;averyp@...&gt;","profile":"lwsskater","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SOS!!","postDate":"1023075969","msgId":38043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDRkFFNjgxLkY0OTEzNzVAbWluZHNwcmluZy5jb20+","referencesHeader":"PDIwMDIwNjAyMDI0OTEzLjgwNjI1LnFtYWlsQHdlYjE0NzAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":38039,"nextInTopic":38050,"prevInTime":38042,"nextInTime":38044,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"... Yes.  The answer is usually something like he just bugs me. ... My 9yo has tried various classes (he s taking a break from karate right now) but they","messageBody":"<div id=\"ygrps-yiv-347303193\">Lisa Krause wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  This might sound like a &quot;duh&quot; suggestion, but have you<br/>\n&gt; tried asking them why they&#39;re fighting so much?<br/>\n<br/>\n </span></blockquote>Yes.  The answer is usually something like &quot;he just bugs me.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  If<br/>\n&gt; they want other friends besides each other, could you<br/>\n&gt; let them pick a couple clubs/sports/whatever to join<br/>\n&gt; separately?<br/>\n<br/>\n </span></blockquote>My 9yo has tried various classes (he&#39;s taking a break from karate right<br/>\nnow) but they haven&#39;t really led to any real friendships.  It&#39;s occured<br/>\nto me that this is because classes of this sort are only once or twice a<br/>\nweek, and the other kids in the class have friends from school who they<br/>\nsee every day. The other kids aren&#39;t necessarily looking to meet new<br/>\nfriends in the way my son is.   There are mabye 100 students in all at<br/>\nmy son&#39;s karate dojo, and he&#39;s the only one that doesn&#39;t go to school.<br/>\nIt also seems like most of the students there are there because their<br/>\nparents think it&#39;s good for them, not because *they* want to be there,<br/>\nso that sort of eliminates the idea of finding friends with similar<br/>\ninterests.<br/>\nHis younger brother has thus far had no interest in any classes or clubs<br/>\nat all.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Do they WANT to go to school or is that<br/>\n&gt; just the last resort solution you have come to?<br/>\n<br/>\n </span></blockquote>It&#39;s a last resort solution pretty much, but they do often talk about<br/>\nhow they&#39;d like to at least try school so they have some frame of<br/>\nreference since most of their friends attend, most of the books they<br/>\nread and movies they watch have a schooly frame of reference, and of<br/>\ncourse there&#39;s that meeting-new-friends aspect that&#39;s appealing to them.<br/>\n<br/>\nOn the other hand they can&#39;t imagine sitting still and quiet most of the<br/>\nday and doing whatever they&#39;re told.  Mixed feelings all around you<br/>\ncould say.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  How<br/>\n&gt; much of the time are they fighting vs getting along?<br/>\n<br/>\n </span></blockquote>Hmmm.  At least 50/50 I&#39;d say.  It&#39;s a fine line.  Even when they&#39;re<br/>\n&quot;getting along&quot; they are doing things which are borderline, like<br/>\nwrestling.  Unfortunately I have a hard time relaxing when they&#39;re<br/>\ngetting along since it can turn at any moment and I&#39;m always tensed up<br/>\nwaiting for it.  It&#39;s a horrible dynamic, and I can&#39;t imagine how to<br/>\nbreak out of it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not<br/>\n&gt; trying to grill you, just offering some points to<br/>\n&gt; ponder<br/>\n<br/>\n </span></blockquote>Thanks for pondering with me.  It&#39;s exactly what I need to do!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think a lot of home/unschoolers have burn-out<br/>\n&gt; periods.<br/>\n<br/>\n </span></blockquote>I think so too.  I wish it was more openly discussed, especially among<br/>\nthe veteran home/unschoolers so that those of us that are newer at it<br/>\nwouldn&#39;t feel like such failures.<br/>\nMy burnout periods are usually in the dead of winter and during shitty<br/>\nweather, so this springtime, warm weather burnout is new and, I think,<br/>\ncoming from a deeper place.<br/>\n<br/>\nPatti<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1302501,"authorName":"Patti","from":"Patti &lt;averyp@...&gt;","profile":"lwsskater","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SOS!!","postDate":"1023068659","msgId":38038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDRkFDOUYzLjZFNEU2NjVGQG1pbmRzcHJpbmcuY29tPg==","referencesHeader":"PDEwMy4xNjIyYzE2Yy4yYTJhYzA3NkBhb2wuY29tPg=="},"prevInTopic":38036,"nextInTopic":38039,"prevInTime":38037,"nextInTime":38039,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"... It s true that getting out helps, but unfortunately my kids don t care to take a drive (usually considerable distance) to meet up with other homeschoolers,","messageBody":"<div id=\"ygrps-yiv-1220297900\"><blockquote><span title=\"ireply\">&gt; Sign up for homeschool activities or if you do not have a group<br/>\n&gt; to join for support create your own activites and put it on a calendar<br/>\n&gt; chart<br/>\n&gt; that your sons can see and look forward to, ask them for suggestions<br/>\n&gt; of<br/>\n&gt; things to do.<br/>\n<br/>\n </span></blockquote>It&#39;s true that getting out helps, but unfortunately my kids don&#39;t care<br/>\nto take a drive (usually considerable distance) to meet up with other<br/>\nhomeschoolers, whom we&#39;ve learned from experience that we generally<br/>\ndon&#39;t fit in with- the few that I can find are generally school-at-home,<br/>\nno sugar/tv, waldorf types.  Or else there&#39;s the Christian group or two<br/>\nwhich are even worse (not that they&#39;re Christians, but the attitude<br/>\ntoward children that tends to go with it).<br/>\nThe types of outings they like (skateboard parks, arcade type places)<br/>\nnot only add up financially but are difficult with a busy toddler in<br/>\ntow.  So yes, it helps to get out when possible but that gets exhausting<br/>\nas well, for other reasons.  I&#39;m a homebody, and I like my home to feel<br/>\nlike a haven.  I don&#39;t want to feel like I need to stay out of it as<br/>\nmuch as possible in order to survive.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have had great luck in m;y community with job shadowing.  I<br/>\n&gt; find people with interesting jobs that my son is interested in and<br/>\n&gt; call them<br/>\n&gt; and they are very nice about letting him spend the day or part of the<br/>\n&gt; day<br/>\n&gt; watching them do their job.<br/>\n<br/>\n </span></blockquote>What a great idea... I&#39;ve never thought of this.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do this because I have an only child and I want to keep him excited<br/>\n&gt; and not bored or he does not want to do any school work.  Also, he has<br/>\n&gt; made<br/>\n&gt; friends in the community of all ages.  He has really become quite well<br/>\n&gt; know<br/>\n&gt; and it has given a real boust to the homeschooling community.<br/>\n<br/>\n </span></blockquote>When I spend one on one time with either of the older boys it&#39;s<br/>\nabsolutely amazing how different they are.  It&#39;s like getting a glimpse<br/>\nof who they really are, and I remember how much I can enjoy their<br/>\ncompany.<br/>\nAnd then the moment they&#39;re back together it&#39;s right back to<br/>\nsilliness/chasing/yelling/teasing, &quot;MOM he hit me!!!&quot; &quot;MOM, he took my<br/>\nseat!!&quot;  &quot;MOM tell him to stop!!!&quot; &quot;MOOOMMMMM!!!!&quot;   I tried to take a<br/>\nfew minutes earlier to rock my cranky toddler on the porch swing with a<br/>\nbook while they seemed to be engrossed enough in something to get along<br/>\nfor a few minutes.   We were soon interrupted by screams and crying and<br/>\nI had to run inside to break up a fistfight.  I&#39;m absolutely horrified<br/>\nthat they do this, and so sad that my toddler has to see it.<br/>\nI just don&#39;t know what to do anymore.  It&#39;s to the point where I simply<br/>\ncannot deal with them being together.  I&#39;ve even tried creating separate<br/>\nspaces for them in the house and encouraging them to just seek solitude<br/>\nand do their own thing when they&#39;re on each other&#39;s nerves, but it<br/>\nactually seems like they&#39;d *rather* fight than be apart.  One will<br/>\neventually seek out the other and just start making faces or purposely<br/>\ndoing something annoying.  I just don&#39;t get it.<br/>\nHas anyone else gone through this with close in age boys?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; People are<br/>\n&gt; always impressed and think he is so lucky to be learning this way<br/>\n&gt;            I did not mean to go on and on ,  but this is such a great<br/>\n&gt; part of<br/>\n&gt; our homeschooling<br/>\n<br/>\n </span></blockquote>Unfortunately, to those close to us (close family and friends) who know<br/>\nmy kids well and how they are with each other, the impression of<br/>\nhome/unschooling isn&#39;t good.  It looks like homeschooling sucks, as I&#39;m<br/>\nusually completely frazzled and burned out and desperately looking for a<br/>\nbreak.  My MIL has actually told me that I should stop being a martyr<br/>\nalready and just put them in school.<br/>\nI just want to tell them &quot;but you don&#39;t understand!  Unschooling isn&#39;t<br/>\n*supposed* to be this way!  In all the books and magazine articles and<br/>\nonline forums it sounds wonderful!&quot;<br/>\nMy day to day reality just doesn&#39;t match the rosy picture, and it&#39;s so<br/>\nfrustrating to me.<br/>\n<br/>\n&lt;sigh&gt;<br/>\n<br/>\nPatti<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1302501,"authorName":"Patti","from":"Patti &lt;averyp@...&gt;","profile":"lwsskater","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"SOS!!","postDate":"1023055836","msgId":38035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDRkE5N0RDLjVFQUY4NTlDQG1pbmRzcHJpbmcuY29tPg=="},"prevInTopic":0,"nextInTopic":38036,"prevInTime":38034,"nextInTime":38036,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"Hi everyone.  I m at a point right now where I might be signing my kids up for school in the fall despite years of dedicated unschooling, and I m feeling","messageBody":"<div id=\"ygrps-yiv-2084488850\">Hi everyone.  I&#39;m at a point right now where I might be signing my kids<br/>\nup for school in the fall despite years of dedicated unschooling, and<br/>\nI&#39;m feeling extremely torn and anxious about it and afraid that if they<br/>\ndo go I will regret it.  Perhaps you all can talk me out of it, or give<br/>\nme some alternate advice...<br/>\nMy sons (ages 7 and 9) fight, bicker and torment each other pretty much<br/>\nconstantly-  to the point where it&#39;s driving my husband and I insane.<br/>\nI&#39;m not exaggerating when I say that peace is practically nonexistant.<br/>\nI used to think it was something I was doing wrong as their mother, or<br/>\nthat it was somehow my fault, but I&#39;m no longer sure... I think it&#39;s a<br/>\ncombination of the personalities they were born with and the fact that<br/>\nthey spend practically all of their waking hours together and are tired<br/>\nof each other.  An hour or two out of the house alone with me or their<br/>\nDad doesn&#39;t seem to help... they seem to make up for lost time when<br/>\nthey&#39;re back together.<br/>\nBoth of them want more friends that are their *own* friends, not shared<br/>\nwith each other, and I just don&#39;t know where to find them, and honestly<br/>\nI&#39;m tired of trying.<br/>\nThere are only a handful of homeschoolers within a reasonable distance<br/>\nof us, and they haven&#39;t clicked with any of them, nor do they have<br/>\nanything in common.  They basically spend their days watching cartoons,<br/>\nfighting with each other and complaining &quot;when&#39;s it gonna be three<br/>\no&#39;clock??&quot;<br/>\n(when their schooled friends arrive back home in the neighborhood).<br/>\nI&#39;m feeling extremely discouraged that I&#39;m not living up to what I think<br/>\nan ideal unschooling family looks like.  It would hurt me to see them in<br/>\nschool since I believe in unschooling so much, but I just don&#39;t know<br/>\nwhat to do at this point.<br/>\nFamily and friends tell my husband and I that they need to go to school,<br/>\nmake different friends, not be stuck alone with each other all the<br/>\ntime.  I&#39;m starting to wonder if they&#39;re right. :-/<br/>\nI have more to say, but I have to go break up a fight.  Seriously.<br/>\n<br/>\nPatti</div>","specialLinks":[]},{"userId":689589,"authorName":"KT","from":"KT &lt;Tuck@...&gt;","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: SOS!!","postDate":"1023039896","msgId":38069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDRkE1OTk4LjUwMDA1MDBAbWlkc291dGgucnIuY29tPg==","referencesHeader":"PDEzZS5mMzMyODY3LjJhMmJhMTliQGFvbC5jb20+"},"prevInTopic":38067,"nextInTopic":38074,"prevInTime":38068,"nextInTime":38070,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"... When I was a single working mother of two sons (born two years apart) who were still in school, I instituted a now patently absurd rule that I would not","messageBody":"<div id=\"ygrps-yiv-1736411852\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;I wouldn&#39;t even let strangers wail on each other without intervening, let <br/>\n&gt;alone my own kids.  As a kid who was hit by another kid, I have to register <br/>\n&gt;the possibility that one of your children is already in a dangerous situation <br/>\n&gt;and saying &quot;Don&#39;t tell me your problems&quot; isn&#39;t a momly thing to do if that <br/>\n&gt;could be the case.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>When I was a single working mother of two sons (born two years apart) <br/>\nwho were still in school, I instituted a now patently absurd rule that I <br/>\nwould not intervene in their fights, and that if they did choose to <br/>\nfight, that I didn&#39;t want to know about it. I expected this to foster in <br/>\nthem a sense of cooperation and negotiating and getting along.<br/>\n<br/>\nWhat began instead was the quiet and frequent victimization of my <br/>\ntrusting and loving younger son by my more experienced and powerful <br/>\nolder son (not sexual and not usually violent, lest anyone should <br/>\nwonder).  I discovered this when the youngest was 14 and no longer in <br/>\nschool and enough healing time had passed for him to be able to tell me <br/>\nabout all the times in which the way things &quot;worked out&quot; was that he <br/>\n&quot;gave in&quot; under threat of physical harm or tattling.  <br/>\n<br/>\nSince then, I have encouraged them to bring their problems to me, and I <br/>\npractice hearing what each of them has to say, and relating it back to <br/>\nthe other, concentrating on making sure we&#39;re talking about perceptions <br/>\nand not necessarily facts, and making sure that it all comes down to <br/>\neach of them taking responsibility for their own actions, regardless. <br/>\n It&#39;s hard work to help them see that we can only control our own <br/>\nactions, and we always have choice.  And it doesn&#39;t stick the first <br/>\ntime.  In an emotionally charged relationship, it&#39;s tempting to say &quot;I <br/>\ndid this because always does that!&quot;  But it can&#39;t be true.  We&#39;ve even <br/>\nbeen working on it this week, with them at almost 20 and 18!<br/>\n<br/>\nHow will they learn to negotiate if they have no model?  Who is most <br/>\nlikely to lose when children are left to their own to work out <br/>\nconflicts?  Even James Dobson says you should always protect the younger <br/>\nor weaker kid.  I failed at that for many years.  That my younger son <br/>\ngrandly forgives me is no condolence.  <br/>\n<br/>\nI would be consoled if someone else learned from my experience, though.<br/>\n<br/>\nTuck</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: SOS!!","postDate":"1023035291","msgId":38067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzZS5mMzMyODY3LjJhMmJhMTliQGFvbC5jb20+"},"prevInTopic":38063,"nextInTopic":38069,"prevInTime":38066,"nextInTime":38068,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/2/02 8:29:49 AM, Wilkinson6@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-614558111\">In a message dated 6/2/02 8:29:49 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Wilkinson6@...\">Wilkinson6@...</a> writes:<br/>\n<br/>\n&lt;&lt; I have an 11yo dd and 8yo ds who like to pick and argue and be pretty <br/>\ndarn mean to each other and sometimes hit each other.<br/>\nThey seem to enjoy it &gt;&gt;<br/>\n<br/>\nIt&#39;s probable that one is enjoying it more than the other, and perhaps one is <br/>\nbeing abused by the other.<br/>\n<br/>\n&lt; They can <br/>\ncome to me for help before it gets out of control, but if they have <br/>\nchosen to let it get to a point that they are hitting and name <br/>\ncalling  and eventually crying, I don&#39;t want to hear about it.  &gt;&gt;<br/>\n<br/>\nMy parents raised two cousins of ours.  One was horribly mean and felt she <br/>\nhad nothing to lose.  She hit the rest of us and the others defended <br/>\nthemselves, but I would just roll up and let her hit me because I felt too <br/>\nawful to hit her back and it would have just infuriated her.  I can&#39;t imagine <br/>\nsomeone leaving a situation like that going.  Kids at home should be safer <br/>\nthan that.<br/>\n<br/>\nI wouldn&#39;t even let strangers wail on each other without intervening, let <br/>\nalone my own kids.  As a kid who was hit by another kid, I have to register <br/>\nthe possibility that one of your children is already in a dangerous situation <br/>\nand saying &quot;Don&#39;t tell me your problems&quot; isn&#39;t a momly thing to do if that <br/>\ncould be the case.<br/>\n<br/>\nAn older child won&#39;t want to admit fear of a younger one.  A boy won&#39;t want <br/>\nto admit fear of a girl.<br/>\n<br/>\nI could be offbase, but I could be more on than you think.  It&#39;s possible.<br/>\n<br/>\n&lt;My <br/>\noldest one also seems to get angry at me for &quot;dropping out of the <br/>\ngame&quot;.  But I hold strong and it always gets better.  I just have to <br/>\ntry to keep vigilant on not getting sucked back in down the road.&gt;&gt;<br/>\n<br/>\nThose children didn&#39;t choose to live together, they are stuck with one <br/>\nanother because of parental decisions and actions.  Sometimes that&#39;s <br/>\npunishment enough!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":114490997,"authorName":"TheFadels@aol.com","from":"TheFadels@...","profile":"madrahci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SOS!!","postDate":"1023029354","msgId":38063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2LjI4NDgwYWYzLjJhMmI4YTZhQGFvbC5jb20+"},"prevInTopic":38062,"nextInTopic":38067,"prevInTime":38062,"nextInTime":38064,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"Mabe concentrate and reinforce the 50% of the getting along. Another good thing is cub scouts. They will each have 8-10 boys just their age. I contacted our","messageBody":"<div id=\"ygrps-yiv-482592340\">Mabe concentrate and reinforce the 50% of the getting along.  <br/>\n<br/>\nAnother good thing is cub scouts. They will each have 8-10 boys just their <br/>\nage.<br/>\nI contacted our boy scout office and they knew of a den and pack that was <br/>\nmostly homeschoolers.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":114490997,"authorName":"TheFadels@aol.com","from":"TheFadels@...","profile":"madrahci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SOS!!","postDate":"1023029128","msgId":38062,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNC4xMjNmZTI5Yy4yYTJiODk4OEBhb2wuY29tPg=="},"prevInTopic":38061,"nextInTopic":38063,"prevInTime":38061,"nextInTime":38063,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"dear Patti, It sounds like you are completely burned out and discourged.  Sometimes our attitutes and feelings set a subtle pace in our home. Usually when","messageBody":"<div id=\"ygrps-yiv-228459541\">dear Patti,<br/>\n   It sounds like you are completely burned out and discourged.  Sometimes <br/>\nour attitutes and feelings set a subtle pace in our home. Usually when things <br/>\nat my house are out of order I can look at myself and see that I created it. <br/>\nThis is a difficult thing for me to admit and it was a good friend that <br/>\npointed out the possibiliy because of her own experiences.  What we have been <br/>\ndoing is having some stuff special just for moms.  A homeschool Moms retreat <br/>\nand a monthly book club with a dinner. We do this at someones house and each <br/>\nbring a dish., If kids need to come we hired a sitter to be at the house and <br/>\nentertain them. this way we can still come if we have our kids and we know <br/>\nthey are safe and we still get to have our time.  We each pitch in a couple <br/>\nof dollars .The kids have fun too.  <br/>\n    I know what you mean about fitting in, it took me quite a while to find a <br/>\ngroup. I think I was a lot like you in what I did not want.<br/>\n         Try to to hang in there. I think the lesser of two evils is to work <br/>\nit out.<br/>\nWhat about just ignoring all the fighting and don&#39;t intervine at all. Just <br/>\nrefuse to hear about the dispute and let them fight it out. At the same time, <br/>\nnot during the fighting, ofer some suggestions on conflict resolution. There <br/>\nare some great books if you need ideas. Any library should have them. <br/>\n    I personally think keeping them apart is the wrong message, letting them <br/>\nbe together and fight it out is better, they will eventually figure it out.<br/>\n        Anyway, I can feel your frustration so I am just throughing out a few <br/>\nideas. I know I do not have any idea of what you are dealing with bu;t <br/>\nsometimes an outside perspective is helpful.<br/>\n            Best of Luck, you sound like a great Mom<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59432230,"authorName":"joanna514","from":"&quot;joanna514&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: SOS!!","postDate":"1023028117","msgId":38061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFkZGEybCt1ajdsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNDRkFFNjgxLkY0OTEzNzVAbWluZHNwcmluZy5jb20+"},"prevInTopic":38056,"nextInTopic":38062,"prevInTime":38060,"nextInTime":38062,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"... up ... Have you read Siblings Without Rivalry by Adele Faber and Elaine Mazlish? It could help you very much. I have an 11yo dd and 8yo ds who like to","messageBody":"<div id=\"ygrps-yiv-767947904\">--- In Unschooling-dotcom@y..., Patti &lt;averyp@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; Lisa Krause wrote:<br/>\n&gt; <br/>\n&gt; Hmmm.  At least 50/50 I&#39;d say.  It&#39;s a fine line.  Even when they&#39;re<br/>\n&gt; &quot;getting along&quot; they are doing things which are borderline, like<br/>\n&gt; wrestling.  Unfortunately I have a hard time relaxing when they&#39;re<br/>\n&gt; getting along since it can turn at any moment and I&#39;m always tensed <br/>\n </span></blockquote>up<br/>\n<blockquote><span title=\"ireply\"> &gt; waiting for it.  It&#39;s a horrible dynamic, and I can&#39;t imagine how to<br/>\n&gt; break out of it.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Have you read &quot;Siblings Without Rivalry&quot; by Adele Faber and Elaine <br/>\nMazlish?<br/>\nIt could help you very much.<br/>\nI have an 11yo dd and 8yo ds who like to pick and argue and be pretty <br/>\ndarn mean to each other and sometimes hit each other.<br/>\nThey seem to enjoy it and I realize that I am a huge part of the <br/>\ndynamics when it starts to get really bad. We sit down and make big <br/>\nchanges and it usually gives them a very unsettled feeling because my <br/>\npart of the change is to put their behavior back in their hands.  I <br/>\ndon&#39;t know why , but it seems to be a cycle of them getting along <br/>\nfine-then starting to fight more often and me trying to intervene-<br/>\nthem fighting more-me starting to yell- then an wake up call <br/>\nincedent, and a big family discussion and changes.  It just happened <br/>\nhere a few of days ago!  <br/>\nI told them not to involve me anymore.  If they chose to be rude and <br/>\nhurtful, not to bring it to me when it got out of control. They can <br/>\ncome to me for help before it gets out of control, but if they have <br/>\nchosen to let it get to a point that they are hitting and name <br/>\ncalling  and eventually crying, I don&#39;t want to hear about it.  <br/>\nBasically I was hearing the aftermath or trying to stop something <br/>\nfrom forming.  It never worked and I was being sucked in.  We talked <br/>\na lot about alternatives they could choose and ways I could be <br/>\nhelpful IF ASKED.  They tested me once or twice after the <br/>\nconversation, but we haven&#39;t had an incedent in a couple of days <br/>\nnow.  <br/>\nThis works for my 2 oldest kids.  I am more protective of my younger <br/>\nones and wouldn&#39;t leave them to fend for themselves against their <br/>\nolder siblings. (though there usually isn&#39;t much incedent there <br/>\nanyway) My older 2 understand the consequences of their actions.  <br/>\nWhen I put it all back on them and they realize that they don&#39;t have <br/>\nme to come running to, they are more wary of starting trouble.  My <br/>\noldest one also seems to get angry at me for &quot;dropping out of the <br/>\ngame&quot;.  But I hold strong and it always gets better.  I just have to <br/>\ntry to keep vigilant on not getting sucked back in down the road.<br/>\nI hope things get better.  I don&#39;t know if you&#39;ve read the book <br/>\nabove.  If you have, maybe skim it again, if not, go get it!<br/>\nMaybe others have more book suggestions??  <br/>\nJoanna</div>","specialLinks":[]},{"userId":10722572,"authorName":"Nora or Devereaux Cannon","from":"&quot;Nora or Devereaux Cannon&quot; &lt;dcannon@...&gt;","profile":"thatincase","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SOS!!","postDate":"1023023413","msgId":38056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1MDYwMWMyMGEzNiRkNmU4ZmJlMCQ2NDIyZmVhOUBkYnE1MjBiPg==","referencesHeader":"PDIwMDIwNjAyMDI0OTEzLjgwNjI1LnFtYWlsQHdlYjE0NzAyLm1haWwueWFob28uY29tPiA8NS4xLjAuMTQuMC4yMDAyMDYwMjAzMzQyNC4wMjU3Y2VjMEBwb3AzLm5vcnRvbi5hbnRpdmlydXM+"},"prevInTopic":38050,"nextInTopic":38061,"prevInTime":38055,"nextInTime":38057,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"Marji - I don t think they are goofy suggestions or observations at al!  In reading the e-mails I noticed the mentions of a toddler - and that a fight had","messageBody":"<div id=\"ygrps-yiv-1951278433\">Marji - I don&#39;t think they are goofy suggestions or observations<br/>\nat al!  In reading the e-mails I noticed the mentions of a<br/>\ntoddler - and that a fight had broken out while Mom was trying to<br/>\nget in some time with the toddler.  It could well be simple<br/>\nattention seeking - pick a fight and get Mom&#39;s time.  Kids (like<br/>\nadults) aren&#39;t too picky about whether the attention they get is<br/>\npositive or negative when they really want attention.  Depending<br/>\non what talking to the kids at a calm time yields, a couple of<br/>\nthoughts were spurred by your suggestions.<br/>\n<br/>\nFirst Patti might want to alter her response.  Rather than<br/>\ngetting in there and sorting it out for them with lots of<br/>\nemotional and actual time, she might devise a strategy in advance<br/>\nto separate them and withdraw.  Think of 2 separate, non-punitive<br/>\nplaces.  When there is a fight, do not address the fight, simply<br/>\nsend each boy to the designated (in her head) place and tell them<br/>\nnot to come out for 15 minutes or until called.  Low Mom<br/>\ncontact/involvement - takes away the incentive to fight, if time<br/>\nand involvement are the incentive.<br/>\n<br/>\nSecond Patti might set up a token economy based on &quot;Mom time.&quot;<br/>\nOur 5 yo craves &quot;Mom time&quot; and &quot;Papa time&quot; more than the other<br/>\nkids and calls it by name - Mama time or Papa time, which is what<br/>\nmakes me use those terms.  That time for her is separate from the<br/>\nroutine of &quot;lots of time together&quot; that is part of our life - it<br/>\nis time to pick out a special book for reading aloud, over and<br/>\nabove the bed time stories ritual - or to go to see something<br/>\nthat isn&#39;t part of the routine - or to move an activity ahead of<br/>\nwhere it would fall in a logical critical path plan.  Perhaps<br/>\nPatti can determine how much of that &quot;at your service, dear&quot; time<br/>\nis feasible for her and dock it with the time she spends breaking<br/>\nup fights.<br/>\n<br/>\nOn a different front, it is June.  Even if the kids want to go to<br/>\nschool, they aren&#39;t headed anywhere for at least a couple of<br/>\nmonths.  There is no reason at all to engage them or Patti in the<br/>\nschool/unschool issue right now.  They may be pushing her buttons<br/>\nwith that issue, just for fun.  Patti places a value on<br/>\nunschooling - the boys can take that away from her at will by<br/>\nrejecting unschooling.  What a fun way to pass the time!  Just<br/>\ndon&#39;t engage on the topic for a while.  As in - &quot;Mom, we want to<br/>\ngo to school!&quot; &quot;Fine dear, when school is in, we will talk about<br/>\nit; right now I have to deal with what you and your brother are<br/>\ndoing right now; John 1 go to &quot;x&quot;; John 2 go to&quot;y&quot;&quot;  Calm, quiet,<br/>\nbuttons hidden.<br/>\n<br/>\nJust a few more thoughts that might work - or might spur some<br/>\nbetter ones from some other folks.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;marji&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zintz@...\">zintz@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Sunday, June 02, 2002 6:10 AM<br/>\nSubject: Re: [Unschooling-dotcom] SOS!!<br/>\n<br/>\n<br/>\n| Hey, Patti!<br/>\n|<br/>\n| You have my sympathy!  And, my empathy.  You sound like you&#39;re<br/>\nwriting from<br/>\n| a spot that&#39;s between a rock and a hard place, which is a<br/>\nterrible place to<br/>\n| make a long-term decision from (but a great place to make a<br/>\nshort-term<br/>\n| decision!). </span></blockquote></div>","specialLinks":[]},{"userId":698073,"authorName":"marji","from":"marji &lt;zintz@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SOS!!","postDate":"1023016243","msgId":38050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMjA2MDIwMzM0MjQuMDI1N2NlYzBAcG9wMy5ub3J0b24uYW50aXZpcnVzPg==","inReplyToHeader":"PDNDRkFFNjgxLkY0OTEzNzVAbWluZHNwcmluZy5jb20+","referencesHeader":"PDIwMDIwNjAyMDI0OTEzLjgwNjI1LnFtYWlsQHdlYjE0NzAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":38043,"nextInTopic":38056,"prevInTime":38049,"nextInTime":38051,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"Hey, Patti! You have my sympathy!  And, my empathy.  You sound like you re writing from a spot that s between a rock and a hard place, which is a terrible","messageBody":"<div id=\"ygrps-yiv-1207625365\">Hey, Patti!<br/>\n<br/>\nYou have my sympathy!  And, my empathy.  You sound like you&#39;re writing from <br/>\na spot that&#39;s between a rock and a hard place, which is a terrible place to <br/>\nmake a long-term decision from (but a great place to make a short-term <br/>\ndecision!).<br/>\n<br/>\nI&#39;m absolutely no expert at all here!  But, I do have some thoughts on this <br/>\nwhich you are free to completely ignore:<br/>\n<br/>\nThere are two things that occurred to me when I was reading your SOS, the <br/>\nanswers you got, and the answers you gave.  Here they are, mushed together <br/>\nin one thought.  Lisa had wondered if you had asked them why they are <br/>\nfighting.  You said that their answers are usually pretty basic (&quot;he just <br/>\nbugs me&quot;).   The first thing that struck me was that I wondered if they had <br/>\nthe vocabulary to express what&#39;s going on for them.  There could be a lot <br/>\nof reasons for their fighting that they just don&#39;t know how to express to <br/>\nyou - or to themselves!  But the very first thing I thought when I read <br/>\nyour first message was, &quot;Those guys are getting something out of this <br/>\nsituation.&quot;  In other words, they may not be hating all this fighting as <br/>\nmuch as you do; there may be some kind of unintended reward they get, like <br/>\nseeing you in a certain state, or just dragging you into it.  Or, there may <br/>\nbe some other reward I can&#39;t conceive of.<br/>\n<br/>\nI wonder if there is any way you can avoid breaking up their fights all the <br/>\ntime.  I wonder if you might sit down with them either together or <br/>\nseparately at a time when things are really peaceful and good and tell them <br/>\nyour feelings on the subject:  &quot;I love you but I hate all the fighting you <br/>\ndo.&quot;  Then, you could ask them to brainstorm with you to find solutions to <br/>\nprevent the fighting.  They may come up with nothing at all, but they may <br/>\ncome up with something that totally surprises you.  Even if they come up <br/>\nwith nothing at all, you might have planted a seed that would make them <br/>\nmore conscious of the whole thing and they may look for solutions at other <br/>\ntimes.<br/>\n<br/>\nI could be way off the mark here, but I&#39;m getting the impression that this <br/>\nfighting has become a habit for them, and they may be able to replace it <br/>\nwith something better, if they and you can come up with what that <br/>\nis.  Maybe the solution will just be something like &quot;when I&#39;m feeling angry <br/>\ntowards my brother and I want to hit him, I&#39;m going to go __________ (some <br/>\nother place).&quot;<br/>\n<br/>\nI also think about the TV analogy:  They may just not have something that&#39;s <br/>\nmore interesting to them than fighting with each other.  All that putting <br/>\nthem in PS would do would be to remove the amount of time they spend <br/>\ntogether, so I wonder if there is a way they can achieve that end by a <br/>\ndifferent means (which I know you have been trying, but maybe they can <br/>\nbrainstorm on that, too).<br/>\n<br/>\nMaybe they could come up with a code word that means, &quot;This is <br/>\nserious:  leave me alone right now; I&#39;m about to pop.&quot;<br/>\n<br/>\nThese are all goofy suggestions, I know, but they may help them come up <br/>\nwith some better ideas that they would be able to do and feel good <br/>\nabout.  I think one of the best things you can do, though, is try to remove <br/>\nyourself from their dramas.  When you&#39;re in it, it may become an <br/>\nunconscious  competition for them in a way to prove their case or get you <br/>\nangry or get your sympathy.<br/>\n<br/>\nDisclaimer:  I am not any kind of expert at all!  I only have one kid, but <br/>\nI did grow up with an older sister and an older brother.  But, I have done <br/>\na lot of reading and talking and these are things that have occurred to me <br/>\nbased on that and observation.<br/>\n<br/>\nLove and light,<br/>\n<br/>\n~marji~<br/>\n<br/>\nP.S.  You probably have already, but have you read the books written by <br/>\nAdele Faber and Elaine Mazlish?  They wrote How To Talk So Kids Will Listen <br/>\n& Listen So Kids Will Talk, which I would recommend for folks who don&#39;t <br/>\nhave kids to read, and Siblings Without Rivalry, which I haven&#39;t read, but <br/>\nI&#39;ll bet there&#39;s some good stuff in there, too.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":73611765,"authorName":"Lisa Krause","from":"Lisa Krause &lt;lckrause2001@...&gt;","profile":"lckrause2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SOS!!","postDate":"1022986153","msgId":38039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNjAyMDI0OTEzLjgwNjI1LnFtYWlsQHdlYjE0NzAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDNDRkFDOUYzLjZFNEU2NjVGQG1pbmRzcHJpbmcuY29tPg=="},"prevInTopic":38038,"nextInTopic":38043,"prevInTime":38038,"nextInTime":38040,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"Hi Patti, This might sound like a duh suggestion, but have you tried asking them why they re fighting so much?  If they want other friends besides each","messageBody":"<div id=\"ygrps-yiv-1129179320\">Hi Patti,<br/>\n<br/>\nThis might sound like a &quot;duh&quot; suggestion, but have you<br/>\ntried asking them why they&#39;re fighting so much?  If<br/>\nthey want other friends besides each other, could you<br/>\nlet them pick a couple clubs/sports/whatever to join<br/>\nseparately?  Do they WANT to go to school or is that<br/>\njust the last resort solution you have come to?  How<br/>\nmuch of the time are they fighting vs getting along? <br/>\nThose questions are mainly rhetorical, BTW.  I&#39;m not<br/>\ntrying to grill you, just offering some points to<br/>\nponder.<br/>\n<br/>\nI&#39;m pretty lucky in that my kids don&#39;t fight all that<br/>\nmuch (yet).  They have their little brawls, sure, but<br/>\nif I remember correctly, my brother and I fought a lot<br/>\nmore.  We also got along splendidly when we weren&#39;t<br/>\nfighting, however.  How do your boys get along when<br/>\nthey&#39;re not going at it?  If you stay home all the<br/>\ntime, maybe they are just getting on each other&#39;s<br/>\nnerves.  Even a little daily trip to the park or<br/>\nsomething might help.  My son and I are both<br/>\nhomebodies, but my daughter needs to get out more or<br/>\nshe gets grouchy.  Both kids take dance, and we have a<br/>\npark nearby that we visit often, and a little library<br/>\nwe go to once every week or two.  This stuff is all in<br/>\na little town of 1500 people so it&#39;s not like we are<br/>\ntraveling the world, but it does keep them from<br/>\ngetting restless.<br/>\n<br/>\nI think a lot of home/unschoolers have burn-out<br/>\nperiods.  We had one for pretty much the entire month<br/>\nof April and most of May.  I stopped doing anything<br/>\nthat was remotely school like and they eventually<br/>\nsettled back down.  Now they are back on track and<br/>\nasking for &quot;stuff&quot; again.  Normally my son loves to do<br/>\nworksheets and things like that (he asks for them),<br/>\nbut he was so not interested for that burnout period. <br/>\nI am veering off topic here but what I&#39;m saying is<br/>\nthat maybe the overall balance in your<br/>\nhouse/life/whatever is upset and your sons are<br/>\nfighting BECAUSE of that, instead of vice versa.  It<br/>\ndoesn&#39;t mean anyone is doing anything wrong.  It just<br/>\nhappens.<br/>\n<br/>\nMy advice is sounding less than sage so I&#39;ll stop now.<br/>\n Good luck with your boys.<br/>\n<br/>\nLisa<br/>\n<br/>\n<br/>\n=====<br/>\n&quot;Thinking about life, by the time you get old enough to understand what it&#39;s all about, you die.&quot;  -- Ozzy Osbourne<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! - Official partner of 2002 FIFA World Cup<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://fifaworldcup.yahoo.com\">http://fifaworldcup.yahoo.com</a></div>","specialLinks":[]},{"userId":114490997,"authorName":"TheFadels@aol.com","from":"TheFadels@...","profile":"madrahci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SOS!!","postDate":"1022977654","msgId":38036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMy4xNjIyYzE2Yy4yYTJhYzA3NkBhb2wuY29tPg=="},"prevInTopic":38035,"nextInTopic":38038,"prevInTime":38035,"nextInTime":38037,"topicId":38035,"numMessagesInTopic":0,"msgSnippet":"Hi Patti, I our homeschool group, I have heard a few people talk about the same thing. It seem that the problem is when they are at home. Try staying active","messageBody":"<div id=\"ygrps-yiv-928955545\">Hi Patti,<br/>\n  I our homeschool group, I have heard a few people talk about the same <br/>\nthing.<br/>\nIt seem that the problem is when they are at home. Try staying active out of <br/>\nthe house.  Sign up for homeschool activities or if you do not have a group <br/>\nto join for support create your own activites and put it on a calendar chart <br/>\nthat your sons can see and look forward to, ask them for suggestions of <br/>\nthings to do. I have had great luck in m;y community with job shadowing.  I <br/>\nfind people with interesting jobs that my son is interested in and call them <br/>\nand they are very nice about letting him spend the day or part of the day <br/>\nwatching them do their job. They have fun and so does my son. Some of the <br/>\nthings he has done is spend a day watching our vet treat animals and even do <br/>\nsurgery, also going to a horse barn and watching the vet treat the horses. He <br/>\nhas seen everything from shots to insemination.  He is 10 now and is even <br/>\nable to help. He has spent the day with our prosecuting attorney and a day in <br/>\nour state capital with our senator.  He has walked streams with and <br/>\nenviormental scientist------just to name a few.  He is ten but has been doing <br/>\nthis since age 8.  I have had such great cooperation and I really think that <br/>\nthe professionals enjoy him as well.  <br/>\n    There are a lot of my friends that  say thier kids fight at home.  You <br/>\nwon&#39;t have to do it forever just until you break the pattern.<br/>\n      I do this because I have an only child and I want to keep him excited <br/>\nand not bored or he does not want to do any school work.  Also, he has made <br/>\nfriends in the community of all ages.  He has really become quite well know <br/>\nand it has given a real boust to the homeschooling community. People are <br/>\nalways impressed and think he is so lucky to be learning this way<br/>\n           I did not mean to go on and on ,  but this is such a great part of <br/>\nour homeschooling<br/>\n                            Don&#39;t send them to school, you may be sorry<br/>\nhang in there and just work it out with your kids<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38054,"nextTopicId":38345}}