{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"brendaclaspell@aol.com","from":"brendaclaspell@...","replyTo":"LIST","senderId":"R_xM9IbfREgvM6FAFQ45fgLGvYQqYL65HaNzdWN0cm-_SgwpdjDDmozs_Z_yrg769ZXL_NJx9SDElwOlQA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: How to respond? continuation","postDate":"998537119","msgId":23511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlLmIxNzFjMjcuMjhiNWQxOWZAYW9sLmNvbT4="},"prevInTopic":23494,"nextInTopic":0,"prevInTime":23510,"nextInTime":23512,"topicId":23494,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/22/01 10:43:56 AM US Eastern Standard Time, ... i thought that was great! sort of sums up the whole thing. and sure she replied that yes","messageBody":"<div id=\"ygrps-yiv-1048788503\">In a message dated 8/22/01 10:43:56 AM US Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jefhdvm@...\">jefhdvm@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Could you, right now, write a brief paragraph on Brownian movement?  <br/>\n&gt; Osmosis?  Calculate the volume of a cylinder?  Probably not.  But you could <br/>\n&gt; look it up.  So could someone who had never heard of these concepts before.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>i thought that was great! sort of sums up the whole thing. and sure she <br/>\nreplied that yes she could. well, if she was being honest, it was the luck of <br/>\nthe draw. i find it impossible to believe that she retained most of what she <br/>\nlearned in twelve years of force fed information. hell, computers even lose a <br/>\nfile from time to time. she was trying to dodge the point.<br/>\n<br/>\ni wanted to point out that she seems to be trying to back off. and i don&#39;t <br/>\nthink her way of doing so is very respectful. it seems she was trying to <br/>\ndiminish the fact that she&#39;s being condescending to you....like asking where <br/>\nyou got the crazy idea that she wasn&#39;t agreeing with you or that she was <br/>\nsuggesting you were doing something wrong. <br/>\n<br/>\nbrenda<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Janet F Hamlin","from":"&quot;Janet F Hamlin&quot; &lt;jefhdvm@...&gt;","replyTo":"LIST","senderId":"3ygUrgPxxyESZmUYa3ufGfa0zzO_9sbRgYI52ZruLwEt4PkmslgT2kFpff_cmRNTlaUGM7FQH34WYxmw_jxWy2xMGi8I5etmOWk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: How to respond? continuation","postDate":"998493659","msgId":23494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTgwMWMxMmIxZSQ3OGQzMjAwMCQ4ZGRlZmVhOUB0aWMuY29tPg=="},"prevInTopic":0,"nextInTopic":23511,"prevInTime":23493,"nextInTime":23495,"topicId":23494,"numMessagesInTopic":0,"msgSnippet":"Then I replied: Just out of curiosity, when was the last time in your adult life that you needed to dissect a sentence?  The last time I remember doing it was","messageBody":"<div id=\"ygrps-yiv-172312063\">Then I replied:<br/>\n<br/>\nJust out of curiosity, when was the last time in your adult life that you needed to dissect a sentence?  The last time I remember doing it was 8th grade English with Mr. Bolduc......and while I know the parts of speech, how often do I think about them or use them in everyday life?  Never.   However, if she decides to go to college and discovers that there is an English pre-requisite, I&#39;m sure she&#39;ll fulfill the requirements she needs to.  Many of the teen homeschoolers around here take classes at the community college in order to meet college requirements.  My point is that if a child or teen (or even adult for that matter) has no use for the information, why force them to learn (or rather memorize, spit it out on a test, then forget it), because IF the knowledge becomes necessary, it can be learned WHEN it is needed in a short amount of time and will likely be remembered because it is useful.<br/>\n<br/>\nI hope this is coming across as I mean it....it&#39;s hard in print when you can&#39;t hear my tone or see my face.  We have different opinions, experiences, and goals, and neither is right or wrong, just different.  I know that most teachers are dedicated and care deeply for their students and love learning, and most kid do ok in that environment, some thrive, and some fail.  For some kids school is just a poor fit, like trying to force a square peg in a round hole.  It doesn&#39;t work.<br/>\n<br/>\nI sense from what you&#39;ve written that you agree with me in theory, but you still feel that there are some things kids should be required to learn whether they want to or not.  I guess my question is why?  <br/>\n<br/>\nAs to the parts of speech, it is necessary to have an understanding of them for proper written communication.  Communication is essential.....it is one of the first things babies do :).  When kids are older, they will have a need and use for written communication, and these things, believe it or not, do come up.  A child that is read to will have a basic understanding of how sentences are put together, even if they don&#39;t know the correct term for each part.  A child who reads for pleasure is learning vocabulary, sentence structure, etc. by seeing and internalizing it.<br/>\n<br/>\nWhen a child is reading a book or watching a movie and an unfamiliar idea is presented (ie war, hydroponics, etc), they will ask questions about what it means, why it happened, etc and seek out information to answer their questions.  Sometimes a simple one sentence answer is enough.  Other times a trip to the library is in order.  I guess I don&#39;t understand the reasoning behind a learning time line, where certain topics are presented at a certain age, in a certain order.  Lots of what I remember in school was the repetitiveness of it all, because we forgot from the year before since we had no real use for the information at that time.  Information repeated over and over and over and still not remembered long after high school graduation.  Could you, right now, write a brief paragraph on Brownian movement?  Osmosis?  Calculate the volume of a cylinder?  Probably not.  But you could look it up.  So could someone who had never heard of these concepts before.<br/>\n<br/>\nWhat things do you feel are important for kids to learn that you think they wouldn&#39;t want to learn on their own?  From your experiences with your kids and your students?  What experiences have you had with homeschooling families  where they have not done it appropriately or abused the unschooling system?  What do you feel are the strengths and weaknesses of homeschooling?<br/>\n<br/>\nI am enjoying our conversation and wanting to learn more from someone with your educational background.  Just because I have chosen a different path for my kids doesn&#39;t mean I think that anyone who chooses differently is wrong.  This is just what works for us.  I am enjoying our exchange because it is helping me put on paper my thoughts and experiences, which is sometimes hard for me to do.<br/>\n<br/>\nJanet  <br/>\n<br/>\nAnd she replied:<br/>\n <br/>\nThe part I&#39;m not getting is why you think this method is so different than others.  I never said anything about a timeline.  I understand using a child&#39;s natural curiosity to teach concepts.  I also know children well enough to know that dissecting a sentence will never come up.  I guess I picked a bad example.....my children are very gifted writers.  Ashley&#39;s love is journalism, but Ashley didn&#39;t come to me and ask about sentence structure.  I noticed a weakness and taught her the concept one summer and it improved her writing immensely.  That is an example of teaching something for the good of the child not because the child naturally was interested in it.  I think writing is extremely important.......you obviously do, too.  Just curious, how are you teaching spelling......are you letting Caroline write phonetically or is she just picking things up from reading.  I only have one child, out of 4 who notices how things are spelled and spells the word correctly after seeing it in print.  I agree that there is a lot out there to learn and I also agree that a good parent will use the child&#39;s natural curiosity to teach.  I never said anything about a timeline. Oh, and yes I DO remember most of what was taught me when I was in school.  I remember the Brownian movement, I just explained osmosis to Chelsey yesterday without having to look it up and yes, I still remember how to dissect a sentence.  The difference is, that I loved school and I loved learning.  It&#39;s the reason I choose my profession.  Not all children are like that.  The paper you sent yesterday said &quot;What if my child wants to play computer games all day?  Should I let him?&quot;  The answer should have been no........children need some discipline and do not naturally make the best choice for themselves in every situation.  Go back and read what the expert said for that circumstance.....it&#39;s weak.   You seem determined to separate your type of schooling from all others.  I thing a good teacher/parent should cater to the child.  I really see no difference between your method and the one most parents use every day in the home.   You don&#39;t need to be defensive........I never said that you were wrong for choosing to keep your kids home.  Where did you get that from?  Are you getting flack from parents or something?   I think all in all, your way is working and that&#39;s what you should use. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":23458,"nextTopicId":23349}}