{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":472959096,"authorName":"catiamaciel@want.com.pt","from":"&quot;=?utf-8?B?Y2F0aWFtYWNpZWxAd2FudC5jb20ucHQ=?=&quot; &lt;catiamaciel@...&gt;","profile":"catiamaciel@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"So many Unsolved things","postDate":"1316223106","msgId":62927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":0,"prevInTime":62926,"nextInTime":62928,"topicId":62927,"numMessagesInTopic":0,"msgSnippet":"Dear all I m catia, mother of sebastiao who did 2 years this week. I ve being reading about unshooling in this list plus always unscooling and i m gratefull","messageBody":"<div id=\"ygrps-yiv-21200795\">Dear all<br/>\nI&#39;m catia, mother of sebastiao who did 2 years this week.<br/>\n<br/>\nI&#39;ve being reading about unshooling in this list plus always unscooling and i&#39;m gratefull for all your insigths, many of them are making my life easyer, specially in the way i see myself.<br/>\n<br/>\nI manage to understant that unschooling is more about us than about our kids. My sun can show me several times a day what is natural learning, presence and whole life, i wish i will be more and more able to see it.<br/>\n<br/>\nIn<br/>\nMany times i&#39;m reading this list and i have eureka moments, ot seams i discovered the besy kept secred but then, i just forget it and go back to my fears.<br/>\n<br/>\nMany other times, i feel agressed by your opinions and i have to read again and again to see if it gets easyer. For exemple:<br/>\n<br/>\n gave up of tv one year ago and it makes me nervous when i read about it in the unschooling context. Even if i agree with your arguments (after reading Sandra&#39;s blog i must admit that i do) it&#39;s really hard to get out of my &quot;TV free&quot; ego. I&#39;m also afraid that in my bad days i will jump on the tv and do anything else. So, your opinion about tv is an agression to me because it is an issue i still have to solve.<br/>\n<br/>\nSometimes i also feel agressed by your hapiness and how much unschooling values hapiness and adequate activities to children needs. I feel agressed because sometimes i dont know how to be that happy mother. Today i asked my husband to come back from work because i could not stop crying and did not want our sun to have a bad day with me (the reason is not important). In other days i&#39;m not crying but i feel and see i cant respond to is needs (fisical smart, i supose) and i&#39;m to tyred to do fisical stuff. The other day i was reading here about a trampolin, we will love one like that but have no space.<br/>\n<br/>\nOur house is very small<br/>\n(48m2) so, any advice on having a busy todler inside is welcome. We have no deco objects or fourniture on the way. The sleeping room as the sise of the bed, living room, kitchen, corridor and 2nd room are avayable to toys and play. Where i go, he goes and mimics me. We cook toguether, (un)fold clothes toguether and when he sleeps i cleam all the cpmfusion. I&#39;m nornally ok with that but when i&#39;m not... i cry.<br/>\n<br/>\nmany times he wants to go out all day, since 11 months that he walks so e goes to the door and asks to go out, if i dont respond he screams. I normaly go but many times we have no place to go. I cant just go in the flat of my friend because it will be more complicated then at home. On those days i  feel sad that my son does not like our nest and i&#39;m not a good mother and all that guilt coming from deap inside....<br/>\n<br/>\n2 things he likes is bath and youtube. Even tried tv but he wants to undo the cartons he likes and it&#39;s not possible.<br/>\n<br/>\nSandra said on one list that working in a restaurant can mean free food. So, i went look for one to work in and found one where i will work in the garden, with my son, and they give us the food. I feel blessed for the open air time with my son and the help to the family budget because food is. our main expense. Thanks for this idea and for show me that my family is more important than my ego. I will start monday on this new &quot;job&quot;.<br/>\n<br/>\nFrom the experience i have, must say that it is very interesting to see how some people are rude with us just because they think we are less than they are because we work &quot;for them&quot;. Another ego chalange.<br/>\n<br/>\nLast year i was also working for food (just lunch for me and baby), and pl<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":62892,"nextTopicId":62917}}