{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"95gINJ_iPe22Ud5zrdO9Dy14N55JcaDvaP8a1dq4BMVgX5TaS6B9QodYBzHRc7WusaR9rgWX08Is","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Choose for them or let them choose","postDate":"991489722","msgId":22353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5LjE1YTI3NTkxLjI4NGE0OGJhQGFvbC5jb20+"},"prevInTopic":22348,"nextInTopic":0,"prevInTime":22352,"nextInTime":22354,"topicId":22299,"numMessagesInTopic":0,"msgSnippet":"Although school is regimented, some schools are moving away from that.  I managed to have lots of choices in school because I would propose things and pull","messageBody":"<div id=\"ygrps-yiv-1756976416\">Although school is regimented, some schools are moving away from that.  I <br/>\nmanaged to have lots of choices in school because I would propose things and <br/>\npull them off (a friend and I designed a current-events class where the kids <br/>\ndid the presentations and the teacher was just kind of a class sponsor, and <br/>\nwe got history credit), and I took lots of music, which has its own kind of <br/>\nstructure-traditions (group music has to), but I was in there because I <br/>\nreally wanted to be and so the structure was of my own choosing.<br/>\n<br/>\nI believe there are people whose joy and imagination are snuffed out by <br/>\nschool.  Lots of people.  I believe there are some who use school as a drab <br/>\nbackground on which to play out their imaginations, and they use the extra <br/>\ntime the structure saddles them with to be creative in their heads, or on <br/>\npaper.<br/>\n<br/>\nI also believe that off all the people in the world there are more followers <br/>\nthan leaders, and there are more who need social attention than there are <br/>\nloners.  And so some seem to crave and appreciate school, or the military, or <br/>\njobs so structured there is NO question what to do or when or where--you go <br/>\nto work and you follow the procedures and your work is inspected for you.  <br/>\nThere are some brain-damaged druggies who prefer prison to being out and <br/>\ntrying to find a place to live and something to eat without the convenience <br/>\nof robbing convenience stores.<br/>\n<br/>\nIt&#39;s sad to me, but it seems objectively and really true that some people are <br/>\nfollowers and they really want to be told what to do and how.  I&#39;m sure that <br/>\nwas happening before schools were created.<br/>\n<br/>\nWe went to a historical museum the other day.  It has existed here for over <br/>\n20 years, but I had never gone.  They&#39;re collecting and re-creating buildings <br/>\nfrom around the state.  I saw a museum in Salt Lake City which was similar, <br/>\nand they had gathered buildings from around the valley.  But theirs are of a <br/>\ncloser range of time, being all late 19th century.   The one here ranged in <br/>\nintent and such from early 17th century to the late 18th.  They had brought a <br/>\nschoolhouse from Raton (a couple of hundred miles away, from a town near the <br/>\nborder of SE Colorado, in post-railroad, coal-mining days.<br/>\n<br/>\nPutting that school near the older buildings was a heck of an anachronism.  <br/>\nThe way the inside was set up was 1915, 1920.  But it didn&#39;t seem to matter.<br/>\n<br/>\nMaybe I&#39;m just too picky, but it seemed to me that the illusion was being <br/>\ncreated (and certainly will be for young impressionable kids who aren&#39;t clear <br/>\nabout the difference between &quot;built in 1880&quot; and &quot;built in 1710&quot; or in &quot;the <br/>\nbuilding up the hill was here when they were using wooden oxcarts&quot; and &quot;this <br/>\nbuilding was moved from a distant town that was railroad-based.&quot;<br/>\n<br/>\nI haven&#39;t read the Josefina Montoya books, but I sincerely hope they don&#39;t <br/>\nhave her going to that one-room schoolhouse in the 1820&#39;s.  If so, the <br/>\nschoolbus might as will pick her up and take her down there, it will be so <br/>\nthoroughly anachronistic.<br/>\n<br/>\nFor one thing, there&#39;s a picture of Abraham Lincoln on the wall! &lt;g&gt;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"Nicki Clark","from":"&quot;Nicki Clark&quot; &lt;nicki@...&gt;","replyTo":"LIST","senderId":"D1JsbImO3GPnA2c2fA7YdrCUgZ5Ar1ATmqdQva6smD15TjjmJDOgl7i9MLsv_OGvvhEJv6HXOhdBceMcpvYAacOn2AIrYGY1bb8MUQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Re: Choose for them or let them choose","postDate":"991486680","msgId":22348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFRU1JTUFDSUxPTUlMTERHTklOR0VFR0RBQUEubmlja2lAZGV0cm9pdG1hbWEuY29tPg==","inReplyToHeader":"PDhmLmI1NWZhNzUuMjg0ODU5YTRAYW9sLmNvbT4="},"prevInTopic":22299,"nextInTopic":22353,"prevInTime":22347,"nextInTime":22349,"topicId":22299,"numMessagesInTopic":0,"msgSnippet":" Ok, but I still don t entirely","messageBody":"<div id=\"ygrps-yiv-1975061174\">&lt;&lt;What a sad world this would be if our choices were taken away from<br/>\nus--even<br/>\nthose that are not appropriate  for some of us&gt;&gt;<br/>\n<br/>\nOk, but I still don&#39;t entirely understand this. I mean, school *is* an<br/>\nenvironment lacking in choice. Someone else makes ALL your choices - what<br/>\nyou do, how you do it, when you do it, even what you eat sometimes, when you<br/>\ngo to the bathroom a lot of times, when you &quot;get to&quot; exercise, sing, do art.<br/>\nI mean the lack of choices is horrifying! Your entire day is controlled for<br/>\nyou in almost every way. Except for the (20 minutes here) of recess twice a<br/>\nday when you (hopefully) get to decided what you want to do and how to do<br/>\nit, school is the place devoid of choice by it&#39;s vary nature.<br/>\n<br/>\nI often wonder if adults who feel that they thrive on structure, that they<br/>\nneed a very segmented and structure day and life are those we just suffered<br/>\nat the hands of the institutionalized educational system. Once they left and<br/>\nhad no one telling them what to do all day, they had no idea how to function<br/>\nso had to create their own rigid structure.<br/>\n<br/>\nWhat reminded me of this is that my son has always loved our carefree<br/>\nlifestyle and now is suddenly &quot;booooored&quot; if there is not someone telling<br/>\nhim what to do all day. This is obviously a result of PS (even in daycare he<br/>\ncould create his own days). I&#39;ve been trying to decide how to best de-school<br/>\nhim: whether to just go cold-turkey or to do some modified curriculum and<br/>\nslowly decrease it until it&#39;s normal for him to conjure his own days. In the<br/>\nend, I decided to just make a calendar for the summer (as much for his good<br/>\nas mine - to try to keep up with the pre-registrations for different things<br/>\nwe&#39;d all like to do) and let the kids fill it in. But now I wonder if that<br/>\nwas just supporting this theory that he&#39;s unnecessarily structured and rigid<br/>\nand in need of being told what&#39;s next all the time and I wonder if I&#39;m doing<br/>\nhim a disservice by inadvertently supporting that?<br/>\n<br/>\nNicki</div>","specialLinks":[]},{"userId":0,"authorName":"nanandter@aol.com","from":"nanandter@...","replyTo":"LIST","senderId":"2HyRe9XKy8H01XKzTq3pJmSzZZ8kOpDTu3fxaYKUPtIK768DpCSlHNbqL4mL8XNwcQjX8NAq7mI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Choose for them or let them choose","postDate":"991362980","msgId":22299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhmLmI1NWZhNzUuMjg0ODU5YTRAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":22348,"prevInTime":22298,"nextInTime":22300,"topicId":22299,"numMessagesInTopic":0,"msgSnippet":"My feelings are that homeschooling (or unschooling) is just another choice--I still have one kid in ps and she wouldn t have it any other way. She is very ","messageBody":"<div id=\"ygrps-yiv-1441926109\">My feelings are that homeschooling (or unschooling) is just another choice--I <br/>\nstill have one kid in ps and she wouldn&#39;t have it any other way. She is very <br/>\nactive in extracirricular activities and an honor roll student. She&#39;s a <br/>\n&quot;social butterfly&quot; and very well-liked--by people of every type. She has been <br/>\ntaught never to judge people by their looks, so she enjoys the company of <br/>\nnearly every person she encounters. She has never been &quot;damaged&quot; by her <br/>\nchoice of education--she has thrived on it.<br/>\nWhat a sad world this would be if our choices were taken away from us--even <br/>\nthose that are not appropriate  for some of us. (including my son)</div>","specialLinks":[]}],"prevTopicId":22314,"nextTopicId":22351}}