{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":77817828,"authorName":"LOWRIEK@aol.com","from":"LOWRIEK@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re:&quot;Getting&quot; Unschooling, was Math phobia, again","postDate":"1051682666","msgId":66799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3YS4xOWZlMzczYy4yYmUwYzE2YUBhb2wuY29tPg=="},"prevInTopic":66565,"nextInTopic":0,"prevInTime":66798,"nextInTime":66800,"topicId":66565,"numMessagesInTopic":0,"msgSnippet":"In a message dated 29/04/2003 06:14:08 Pacific Daylight Time, ... Kathryn, that was a great post, and I forwarded that to some friends that are questioning","messageBody":"<div id=\"ygrps-yiv-1735674379\">In a message dated 29/04/2003 06:14:08 Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:KathrynJB@...\">KathrynJB@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The best way in the world to unschool, that I have seen, is to live your <br/>\n&gt; life <br/>\n&gt; beside your children and to support them in living their own<br/>\n<br/>\n </span></blockquote>Kathryn, that was a great post, and I forwarded that to some friends that are <br/>\nquestioning unschooling possibilities. I have them reading at unschooling.com <br/>\nand Sandra&#39;s articles, but that was great!<br/>\nNancy ,in BC<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":40256956,"authorName":"jmcseals SEALS","from":"&quot;jmcseals SEALS&quot; &lt;jmcseals@...&gt;","profile":"sevenhavei","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re:&quot;Getting&quot; Unschooling, was Math phobia, again","postDate":"1051622938","msgId":66565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtRjI5S0JFcjhwa3BMa1QwMDAwNTg1ZEBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":66799,"prevInTime":66564,"nextInTime":66566,"topicId":66565,"numMessagesInTopic":0,"msgSnippet":"Kathryn, This is a beautiful post!!!  (No, not just because my love of Alaska is mentioned either. )  I just want to add that MY love of Alaska has spilled","messageBody":"<div id=\"ygrps-yiv-719095107\">Kathryn,<br/>\n<br/>\nThis is a beautiful post!!!  (No, not just because my love of Alaska is <br/>\nmentioned either. &lt;BG&gt;)  I just want to add that MY love of Alaska has <br/>\nspilled over into my entire household.  I actually DO all those things you <br/>\nmentioned.  It is my obsession.  My husband rolls his eyes here and there, <br/>\nhehe, but my family definitely KNOWS how much I love it.  In turn, my kids <br/>\nrush in to tell me everytime Alaska is on TV.  They bring ME books at the <br/>\nlibrary, they tell me tidbits they have learned on their own about Alaska.  <br/>\nBecause *I* love it so much, THEY want to gobble up every word associated <br/>\nwith it.  My oldest daughter doesn&#39;t like the fact that it is so cold, so <br/>\nshe is hesitant to want to live there, but she &quot;plans&quot; trips with me, we <br/>\ndaydream about fun things to do there, fun things we DID there.  She sees my <br/>\nadoration and jumps right in to enjoy it with me.  There is a fervent <br/>\n&#39;arctic air&#39; in our house, brought on because of MY love of Alaska.  I don&#39;t <br/>\nforce them to watch documentaries with me.  I don&#39;t call family gatherings <br/>\nto peruse every Alaskan book in our home.  I don&#39;t throw Alaskan brochures <br/>\nall over their rooms, hoping they, too will learn to love it.  I just love <br/>\nit fervently, completely and passionately and they can&#39;t help but want to <br/>\njump in on my dreams.<br/>\n<br/>\nMy children are unschooling ME!  It is a beautiful thing!<br/>\n<br/>\nJennifer<br/>\n<br/>\nGlena, this post kind of summed up to me why you seemed to be missing what<br/>\npeople are trying to tell you. And I really do believe it&#39;s just a matter of<br/>\nthat one little spark of &quot;getting it&quot; that hasn&#39;t happened yet, rather than<br/>\nyour not WANTING to get it.<br/>\n<br/>\nThe best way in the world to unschool, that I have seen, is to live your <br/>\nlife<br/>\nbeside your children and to support them in living their own. Someone<br/>\nmentioned that it was unlikely that if Tiger Woods had kids that they<br/>\nwouldn&#39;t more or less have golf in their blood. They might not be champions,<br/>\nor even like it much....but being around someone who had a passion for it,<br/>\nbeing part the culture of tournaments, etc...the child would Get Golf.<br/>\nLikewise, lots of children of musicians become musicians, because music is<br/>\njust a part of what they live with.<br/>\n<br/>\nI think to unschool effectively means that we parents have to have lives and<br/>\ninterests. We have to have a passion for learning stuff, to like to do <br/>\nstuff.<br/>\nWe CAN&#39;T just do it for the kids. Then it becomes a sacrifice, which IS <br/>\nabout<br/>\nus. Kids don&#39;t want us to sacrifice ourselves...that&#39;s leads to guilt.<br/>\n<br/>\nMy parents did not homeschool me (although my mom said it was too bad they<br/>\ndidn&#39;t know about that, because it would have been perfect for me), but in<br/>\ntheir own way, they did kind of unschool us. They had interesting lives, and<br/>\nwe were always welcome to be there. If they had interesting folks over to<br/>\nvisit, we were never sent to our rooms -- we were welcomed into the<br/>\nconversation.<br/>\n<br/>\nWhen we had interests, we were always encouraged and supported in them, and<br/>\nnever told it was silly or impossible.<br/>\n<br/>\nSo, reading the above... I was a bit baffled. Sure, there&#39;s nothing wrong<br/>\nwith buying the brand of toilet paper your family likes -- but why are you<br/>\nthe only one who replaces the roll? (I can&#39;t remember how old your kids are,<br/>\nbut if there&#39;s a concern about algebra and med school, I assume they&#39;re not<br/>\n3). If your child likes her linens sprayed with linen spray, why isn&#39;t it<br/>\nnext to her bed for HER to do it?<br/>\n<br/>\nIt&#39;s not that it isn&#39;t fine for you to have a couple of &quot;Lovey Nurturey&quot;<br/>\nthings you do for your family, but the impression I get is that these are<br/>\njust the tip of the iceberg. I think the first thing you need to do is to <br/>\nGet<br/>\na Life.<br/>\n<br/>\nI don&#39;t mean that in a mean, nasty way. I mean that to model to kids that<br/>\nthere&#39;s a cool world of stuff to learn and experience, we need to DO it. <br/>\nWhat<br/>\nhave YOU always wanted to learn or do?  What are YOUR dreams?  Someone here<br/>\nmentioned that she&#39;d love to live in Alaska, but it just isn&#39;t in the cards<br/>\nfor her family right now. But I bet she reads about it, watches<br/>\ndocumentaries, and spend lots of time planning her next trips there. Her <br/>\nkids<br/>\nmay never care about Alaska, but they&#39;ll see that Mom is a person with her<br/>\nown dreams, and see how she gets tastes of Alaska in her life. They&#39;ll learn<br/>\nhow to apply that to their own lives.<br/>\n<br/>\nSo, I think maybe you DO need to do stuff that&#39;s about YOU, but not having <br/>\nto<br/>\ndo with your kids. Most of us, particularly early in unschooling, have had<br/>\nthose panicked moments where we blow it. This is scary stuff!  So we<br/>\napologize and move on. She may never like algebra. If she really wants to <br/>\nget<br/>\nto Med School, and it&#39;s a real dream for her, she&#39;ll figure out what she<br/>\nneeds to get there and do it.<br/>\n<br/>\nMy favorite unschooling book isn&#39;t about unschooling or even parenting at<br/>\nall. It&#39;s called Wishcraft: How to Get What You Really Want, by Barbara <br/>\nSher.<br/>\nI believe if we all just raised our kids that way everyone would be happier.<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nSTOP MORE SPAM with the new MSN 8 and get 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":66673,"nextTopicId":66654}}