{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":99944316,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;ikonstitcher@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re:mystery, magic, and myth (long)","postDate":"1057596021","msgId":15423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCMkVGMDg0LjMzNUU2JWlrb25zdGl0Y2hlckBjb3gubmV0Pg==","inReplyToHeader":"PGVhLjNhY2MyY2JiLjJjM2FhZmI3QGFvbC5jb20+"},"prevInTopic":15420,"nextInTopic":0,"prevInTime":15422,"nextInTime":15424,"topicId":15420,"numMessagesInTopic":0,"msgSnippet":"... I imagine many people on this list already know about it, but for those who don t, a cool, free resource is the Experiment of the Week yahoo list. Here s a","messageBody":"<div id=\"ygrps-yiv-1691720301\">on 7/7/03 4:12 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:KathrynJB@...\">KathrynJB@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:KathrynJB@...\">KathrynJB@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Knowing how they&#39;re made doesn&#39;t make them<br/>\n&gt; less amazing... and doesn&#39;t need to take them away from the awe.<br/>\n&gt; <br/>\n&gt; I suspect your daughter would have gotten to a point where she wondered about<br/>\n&gt; the Why. Probably depends how old she is, because little ones tend to<br/>\n&gt; appreciate the magic of not knowing longer.<br/>\n<br/>\n </span></blockquote>I imagine many people on this list already know about it, but for those who<br/>\ndon&#39;t, a cool, free resource is the Experiment of the Week yahoo list.<br/>\n<br/>\nHere&#39;s a different arm trick from the list (I never clean out my Outlook<br/>\nfiles &lt;g&gt;):  <br/>\n<br/>\n Robert Krampf&#39;s Experiment of the Week<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n  <br/>\nThis Week&#39;s Experiment - #316 Arm Raising<br/>\n<br/>\nWhat a nice week this has been.   I still did not get the truck cleaned out,<br/>\nbut I did get a lot of other things accomplished.   I helped Lisa in the<br/>\ngarden, worked on training our dog, did lots of paperwork, and watched lots<br/>\nof movies.   For the next two weeks I will be doing shows in the area around<br/>\nFt. Myers and Naples, Florida.   We still have some openings in this area,<br/>\nso <br/>\nif you know of a school or homeschool group that would like a show, let me<br/>\nknow.   You can e-mail me or call James Ashley at (904) 388-6381.<br/>\n<br/>\nThis week&#39;s experiment is something that we used do for fun when I was a<br/>\nkid. <br/>\n  (No jokes about dinosaurs or the Dark Ages, please.)   It was back in the<br/>\ndays before Gameboys and the internet.   Back in the days when there were<br/>\nonly 4 TV channels and you had to get up and turn the dial on the TV to<br/>\nchange the channel.   Even so, we still had lots of fun.   This is a party<br/>\ntrick that always amazes people, but it is based on science.   To try it,<br/>\nyou <br/>\nwill need:<br/>\n<br/>\na doorway<br/>\n<br/>\nOK, it is really very simple.   Stand in the doorway.   Start with your arms<br/>\nhanging down by your sides.   Lift them outwards until the backs of your<br/>\nhands are touching the doorframe on each side of you.   Now press outwards<br/>\nwith your arms, as hard as you can.   Keep pressing while you count to 60,<br/>\nor <br/>\nas long as you can without it hurting.   Then take one step forward and<br/>\nrelax <br/>\nyour arms.   Your arms will seem to rise upwards all by themselves.<br/>\n<br/>\nWhat is going on?   Two things are working together to make this happen.<br/>\nThe first is muscle tension. If you tense a muscle until it gets tired, it<br/>\nwill keep some of that tension even after your brain stops sending it a<br/>\nsignal to push.   You can try that by making a fist and squeezing it as<br/>\ntight <br/>\nas you can for about a minute.   Then if you slowly open your hand, you can<br/>\nfeel the muscle tension that is still trying to keep your hand closed.<br/>\n<br/>\nThis muscle tension by itself is not enough to explain what happens to your<br/>\narms.   The other part of the experiment involves suggestion.   An important<br/>\npart of this trick is telling the person that is trying it what will happen.<br/>\n Because they are expecting it to happen and they are prepared for it, as<br/>\nsoon as they feel the muscle tension lifting their arms, they unconsciously<br/>\nhelp.   <br/>\n<br/>\nTry testing the experiment with several people that do not know what to<br/>\nexpect.   They may still get some arm raising from the muscle tension, but<br/>\nyou will probably find that you get a much stronger response from someone<br/>\nthat has been told what to expect.<br/>\n<br/>\nWe have done experiments on suggestion before. (Remember when we saw that<br/>\njust thinking about your nose itching could make it itch?   If you did not<br/>\nget that experiment, try to go for 5 minutes without scratching your nose.)<br/>\nThis experiment is another example of how the mind and the body work<br/>\ntogether, sometimes in ways that we do not realize.   For example, just<br/>\nsaying the words &quot;ice cream&quot; over and over can cause my body to go to the<br/>\nfreezer for a snack, all on its own.<br/>\n<br/>\nHave a fantastic week.<br/>\n<br/>\n****************************************<br/>\nThis weekly e-mail list is free from charge.   You are welcome to forward it<br/>\nto friends, print it in your newsletter, repost it on the Internet, etc., as<br/>\nlong as you do not charge for them and my name and e-mail address are<br/>\nincluded. <br/>\n<br/>\nPlease forward this e-mail to anyone that you think might enjoy it. <br/>\n<br/>\nTo join the list, send a blank e-mail to:  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:krampf-subscribe@yahoogroups.com\">krampf-subscribe@yahoogroups.com</a><br/>\n<br/>\nTo unsubscribe, send a blank e-mail to:  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:krampf-unsubscribe@yahoogroups.com\">krampf-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nAn on-line archive is located at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/krampf/messages\">http://groups.yahoo.com/group/krampf/messages</a></div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:mystery, magic, and myth (long)","postDate":"1057576375","msgId":15420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhLjNhY2MyY2JiLjJjM2FhZmI3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":15423,"prevInTime":15419,"nextInTime":15421,"topicId":15420,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/7/2003 5:23:57 AM Eastern Standard Time, ... Ah, this is such a cool post, even though I know you felt awful at the time. To me, it brings","messageBody":"<div id=\"ygrps-yiv-752131235\">In a message dated 7/7/2003 5:23:57 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Here&#39;s what happened:  The girls were watching an episode of Zoom on <br/>\n&gt; Nickelodeon (a pre-teen show where they show games, experiments, and <br/>\n&gt; projects).  They came to find me, all excited, to show me this:  stand <br/>\n&gt; facing a wall so that one outstretched hand can just touch the wall by <br/>\n&gt; the tips of your fingers.  Touch the wall.  Now bend that same arm quite <br/>\n&gt; hard and rub your elbow with the other hand.  Now try to touch the wall <br/>\n&gt; again with the original arm.  Your arm won&#39;t reach.  <br/>\n&gt; <br/>\n&gt; So the girls and I thought this was amazing and wierd and we ran all <br/>\n&gt; over the house doing it over and over.  We called the grandparents and <br/>\n&gt; all our friends to have them do it.  It was fun and strange. I was <br/>\n&gt; wondering why this happened and thought a lot about it.  As usual, I was <br/>\n&gt; talking about the hows and whys to the girls.  I finally decided that it <br/>\n&gt; must happen because when the arm is bent, the muscle contracts and <br/>\n&gt; doesn&#39;t completely stretch out right away, thus making the arm appear <br/>\n&gt; magically shorter.  Makes sense to me.  The whole elbow rubbing thing is <br/>\n&gt; just for drama, like a magicians waving wand.<br/>\n&gt; <br/>\n&gt; Then Aislinn burst into tears and was furious with me for ruining the <br/>\n&gt; fun.  Since I had figured it out, the magic of it was gone.  And I felt <br/>\n&gt; SO bad.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Ah, this is such a cool post, even though I know you felt awful at the time.<br/>\n<br/>\nTo me, it brings up the uses of religion/spirituality (I&#39;m a Unitarian <br/>\nUniversalist, and those things are not different for me, although I know they are <br/>\nfor some) and science. Both are ways that people try to make sense of the world <br/>\nfor themselves. And as cold and precise as scientists rep is, the joy as they <br/>\nlearn more about their topic of interest is often as wonderful as someone&#39;s <br/>\nexperience of enlightenment or finding God, or whatever.<br/>\n<br/>\nAgain, I know you felt bad, but what I see is that your daughter was still in <br/>\nthe awe of this discovery. She loved it just for her experience of awe. You <br/>\nloved it too, and like a scientist, your love drove you to want to find out all <br/>\nabout it. I suspect that your figuring out the Why of it didn&#39;t make you love <br/>\nit any less, which is why you excitedly shared it with your daughter. I&#39;m <br/>\nsorry for both of you that it worked out the way it did, because you were both <br/>\nsad.<br/>\n<br/>\nFor me, it&#39;s like a new relationship. When you first fall in love with <br/>\nsomeone, it&#39;s ...well.. awesome. They seem perfect, and you&#39;re amazed that anyone <br/>\nthis perfect is just wandering about, and that somehow they love YOU!  Then you <br/>\ndiscover chinks in the perfection. Over lots of time, you&#39;re aware that the <br/>\nchinks are actually enormous gaps...but that you actually like that more! (It&#39;s <br/>\nhard to ever feel really comfortable with a God/Goddess)  The first time your <br/>\nBeloved, watching tv, burps loudly and you giggle and feel a flash of <br/>\nendearment, you&#39;re hooked and you KNOW this person. That initial awe rush is <br/>\nwonderful...but the Knowing is why you stay.<br/>\n<br/>\nMy partner and I have spent the last year working on a curriculum for the <br/>\nReligious Education program at our church (and will now be field-tested across <br/>\nthe country by some other churches) about Science and Religion. The topic was <br/>\nactually the result of my asking the kids at church (from little ones to <br/>\nteenagers) and getting a resounding &quot;Science!&quot;<br/>\n<br/>\nWell, I realized that in one of the parts of the &quot;sources&quot; of UUism is that <br/>\nwe respect the teachings of science. Well, that&#39;s a pretty radical position of <br/>\na religion, so, apparently, the kids were right on. We had two different kinds <br/>\nof &quot;lessons.&quot; (That&#39;s in quotes because as we did this, we realized that most <br/>\nof the stuff was new to the Adult volunteers as well as the kids, and they <br/>\nwere all learning together rather than have wisdom imparted.) One type was <br/>\nlearning about UU scientists in history. (Lots of cool ones, and you may be using <br/>\nthe inventions of two of them RIGHT NOW!!!!)<br/>\n<br/>\nThe other type was about exactly what you are talking about: Awe and <br/>\ndiscovery. One of the things they did was about geodes. They each got a complete geode <br/>\nand examined it, then they broke them open to find the crystals. Then they <br/>\nlearned a bit about how they&#39;re made. Knowing how they&#39;re made doesn&#39;t make them <br/>\nless amazing... and doesn&#39;t need to take them away from the awe.<br/>\n<br/>\nI suspect your daughter would have gotten to a point where she wondered about <br/>\nthe Why. Probably depends how old she is, because little ones tend to <br/>\nappreciate the magic of not knowing longer.<br/>\n<br/>\nThank you for sharing this... Obviously I&#39;ve REALLY gotten into this stuff :)<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15419,"nextTopicId":15421}}