{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":288405080,"authorName":"diana lea jenner","from":"diana lea jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Fw: [AlwaysLearning] Mums and computers","postDate":"1312022929","msgId":62072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSkNXd3BweCtVN1pRK3VFcWMxamdDVmRhQ2tGOFloc1hDNWpyME54RGo2Z2YxOUF3QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":61959,"nextInTopic":0,"prevInTime":62071,"nextInTime":62073,"topicId":61923,"numMessagesInTopic":0,"msgSnippet":"And what about the kids who know (as ALL ADULTS know) there just might NOT be a tomorrow? Why not do what it takes to foster JOY in today? Now is truly all we","messageBody":"<div id=\"ygrps-yiv-100056732\">And what about the kids who know (as ALL ADULTS know) there just might NOT<br/>\nbe a tomorrow?<br/>\nWhy not do what it takes to foster JOY in today?<br/>\nNow is truly all we have.<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.wordpress.com<br/>\nhannahsashes.blogspot.com<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Jul 22, 2011 at 7:26 AM, Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I got sent this off list. I&#39;ve removed the name of the person who posted it<br/>\n&gt; to<br/>\n&gt; me, but I figured it would be better being discussed in the open than in a<br/>\n&gt; private series of e-mails.<br/>\n&gt;<br/>\n&gt; Schuyler<br/>\n&gt;<br/>\n&gt; There is always tomorrow and yes my kids have the same fits mine even say<br/>\n&gt; they<br/>\n&gt; will die if they don&#39;t get to play the computer. If you give in to him once<br/>\n&gt; you<br/>\n&gt; set up a pattern of continually giving in to him. They will wake up<br/>\n&gt; tomorrow<br/>\n&gt; and be refreshed. Sometimes it is good to just talk to them and explain the<br/>\n&gt;<br/>\n&gt; next day how busy you were and how tired he was after such a long fun<br/>\n&gt; filled day<br/>\n&gt; and that we can&#39;t always do everything, there is always tomorrow. They<br/>\n&gt; eventually get the picture. It&#39;s just that we have to weather the storm in<br/>\n&gt; the<br/>\n&gt; process. Nobody told us there would be days like this, but it does get<br/>\n&gt; better.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311395019","msgId":61959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1NEQ4QTQ5LTg3QUQtNEM4Qi1CMThGLTMzRUUwOTM0OUQ1N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":61932,"nextInTopic":62072,"prevInTime":61958,"nextInTime":61960,"topicId":61923,"numMessagesInTopic":0,"msgSnippet":"The side-mail below was sent to Schuyler by mistake, I m assuming.  It s very irritating. People join this list to read about unschooling, and to ask questions","messageBody":"<div id=\"ygrps-yiv-496751500\">The side-mail below was sent to Schuyler by mistake, I&#39;m assuming.  It&#39;s very irritating.<br/>\n<br/>\nPeople join this list to read about unschooling, and to ask questions of experienced unschoolers, NOT to be encouraged in private on the side to ignore unschoolers.<br/>\n<br/>\nIf I had received that e-mail myself, I would have removed the sender from the list, but Schuyler&#39;s nicer than I am and probably didn&#39;t.  <br/>\n<br/>\n----------------------------<br/>\nThere is always tomorrow and yes my kids have the same fits mine even say they <br/>\nwill die if they don&#39;t get to play the computer. If you give in to him once you <br/>\nset up a pattern of continually giving in to him. They will wake up tomorrow <br/>\nand be refreshed. Sometimes it is good to just talk to them and explain the <br/>\nnext day how busy you were and how tired he was after such a long fun filled day <br/>\nand that we can&#39;t always do everything, there is always tomorrow. They <br/>\neventually get the picture. It&#39;s just that we have to weather the storm in the <br/>\nprocess. Nobody told us there would be days like this, but it does get better.<br/>\n----------------------------<br/>\n<br/>\nSpeaking in cliches, in other people&#39;s words and phrases, is not a good use of the time of the readers of the Always Learning list.  <br/>\nA string of comments like this could have been robot-generated.<br/>\n<br/>\nThere is always tomorrow  (twice)<br/>\nIf you give in to him once ...<br/>\nThey eventually get the picture.<br/>\nNobody told us there would be days like this, but it does get better.<br/>\n<br/>\nIf that&#39;s the best someone has to offer, it should be kept quiet.<br/>\n<br/>\n&quot;There is always tomorrow.&quot;<br/>\n<br/>\nThere is NO guarantee that a child will be living tomorrow, nor that the mother will.  There is NOT &quot;always tomorrow.&quot;  One of these days will be the last.<br/>\n<br/>\nThe guidelines for this list, which some people read and others think don&#39;t apply to them say:<br/>\n<br/>\nALL posts should be<br/>\nhonest<br/>\nproofread<br/>\nsincere<br/>\nclear<br/>\nAnd there&#39;s more.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearningPOSTS\">http://sandradodd.com/lists/alwayslearningPOSTS</a><br/>\n<br/>\nThis is adversarial:  &quot;If you give in to him once ...&quot;<br/>\n<br/>\nIf your child is the enemy or the trickster in your mind, unschooling won&#39;t work.<br/>\n<br/>\n-=-They eventually get the picture.-=-<br/>\n<br/>\n&quot;The picture?&quot;  What is the picture, then?  That mothers get their way and children should just give up?  <br/>\nThe picture, on this list, is of a peaceful unschooling life.  I hope the person who posted the anti-child lump of writing above will eventually get that picture.<br/>\n<br/>\n-=-Nobody told us there would be days like this, but it does get better.-=-<br/>\n<br/>\nTreating children disdainfully does not make children&#39;s lives better.  <br/>\n<br/>\n-=-Sometimes it is good to just talk to them and explain the <br/>\nnext day how busy you were and how tired he was -=-<br/>\n<br/>\nIf you explain to a child how he felt, how will he learn for himself? <br/>\nIf you explain the next day what happened, and you are incorrect and delusional and you&#39;re justifying selfish, bad, disdainful behavior,  the child will understand more about the parent than the parent understands about the child.<br/>\n<br/>\n-=- They eventually get the picture. It&#39;s just that we have to weather the storm in the process.-=-<br/>\n<br/>\nChildren&#39;s needs are not &quot;the storm.&quot;  Advice for parents to do whatever selfish thing they want and then to endure until the child is finished trying to reason and appeal is NOT welcome on this list.  It will take people in the opposite direction from being compassionate, mindful parents.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Fw: [AlwaysLearning] Mums and computers","postDate":"1311354601","msgId":61932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowY2F0OSt1M2pzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowYzl2YStwcTgyQGVHcm91cHMuY29tPg=="},"prevInTopic":61931,"nextInTopic":61959,"prevInTime":61931,"nextInTime":61933,"topicId":61923,"numMessagesInTopic":0,"msgSnippet":"... who don t want to negotiate with Palestinians use as their excuse. A common, and shudder-worthy idiom is, Offer a hand and they ll take your whole arm.","messageBody":"<div id=\"ygrps-yiv-274491633\">----This comment reminds me, maybe because I grew up in the region, of what Israelis<br/>\nwho don&#39;t want to negotiate with Palestinians use as their excuse. A common, and<br/>\nshudder-worthy idiom is, &quot;Offer a hand and they&#39;ll take your whole arm.&quot; I&#39;d<br/>\nhate thinking of my relationship with my daughter in terms used for bloody<br/>\nconflicts.------<br/>\n<br/>\nI realize that Palestinian/Israeli metaphors probably aren&#39;t that helpful for most folks, so I apologize for the muddiness of  that knee-jerk reaction.<br/>\n<br/>\nInstead, try out the OP&#39;s claim, &quot;If you give in to him once you set up a pattern of continually giving in to him&quot; by changing the statement to:<br/>\n<br/>\n&quot;If you give in to a women once, you set up a pattern of continually giving in to her&quot;<br/>\n<br/>\nOr,<br/>\n<br/>\n&quot;If you give in to a black/yellow/purple/green/gay/christian/jewish/muslim once, you set up a pattern of continually giving in to them.&quot;<br/>\n<br/>\nThese are the kind of statements people make when they believe that one group is better and more deserving than another, and that one group has more intrinsic rights than another. <br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Fw: [AlwaysLearning] Mums and computers","postDate":"1311353642","msgId":61931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYzl2YStwcTgyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":61929,"nextInTopic":61932,"prevInTime":61930,"nextInTime":61932,"topicId":61923,"numMessagesInTopic":0,"msgSnippet":"... This comment reminds me, maybe because I grew up in the region, of what Israelis who don t want to negotiate with Palestinians use as their excuse. A","messageBody":"<div id=\"ygrps-yiv-1944072615\">----- If you give in to him once you set up a pattern of continually giving in to him.----<br/>\n<br/>\nThis comment reminds me, maybe because I grew up in the region, of what Israelis who don&#39;t want to negotiate with Palestinians use as their excuse. A common, and shudder-worthy idiom is, &quot;Offer a hand and they&#39;ll take your whole arm.&quot;  I&#39;d hate thinking of my relationship with my daughter in terms used for bloody conflicts.<br/>\n<br/>\nJust think how different world conflict resolution could be if people saw each other as equally deserving of freedoms, shelter, food, love, safety, pleasure......(the saying, &quot;It starts at home.....&quot; comes to mind)<br/>\n<br/>\nConnie, another member of this group, often talks about how children are the most marginalized population in our culture because they have absolutely NO rights or power whatsoever (<a rel=\"nofollow\" target=\"_blank\" href=\"http://mystifiedmom.blogspot.com/2011/07/human-rights-question.html)\">http://mystifiedmom.blogspot.com/2011/07/human-rights-question.html)</a>.  If the saying, &quot;We&#39;re all in this together&quot; only works for parents bemoaning their children&#39;s unreasonable/unworthy requests, but comes nowhere near including children themselves in the &quot;All/together,&quot; I don&#39;t see how unschooling is possible.  <br/>\n<br/>\n---- They eventually get the picture. It&#39;s just that we have to weather the storm in the<br/>\nprocess. ----<br/>\n<br/>\nRight, like a baby left alone to cry it out eventually learns that her parents won&#39;t come to sooth her pain; she learns that she&#39;s on her own and that her needs and wants aren&#39;t important or worthy of her parents&#39; support.  That isn&#39;t the kind of picture I want engraved in my daughter&#39;s psyche.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311351701","msgId":61929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzNTE3MDEuMzA2MjIuWWFob29NYWlsUkNAd2ViODczMTAubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":61928,"nextInTopic":61931,"prevInTime":61928,"nextInTime":61930,"topicId":61923,"numMessagesInTopic":0,"msgSnippet":"... There is a comic book called Asterix and Obelix. It s French, or Gaulish. One of the characters, the mayor, Chief Vitalstatistix, says that the sky may","messageBody":"<div id=\"ygrps-yiv-1803412286\"><blockquote><span title=\"ireply\">&gt;&gt;&quot;There is always tomorrow &quot;&lt;&lt;<br/>\n<br/>\n </span></blockquote>There is a comic book called Asterix and Obelix. It&#39;s French, or Gaulish. One of <br/>\nthe characters, the mayor, Chief Vitalstatistix, says that the sky may fall on <br/>\nhis head tomorrow, and adds but tomorrow never comes. Tomorrow is a fairy tale <br/>\nfuture event. Today, now, this moment, that&#39;s what you&#39;ve got. If you want <br/>\nthings to be better with your children, work for now, work for this minute. <br/>\nDon&#39;t wait for tomorrow. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;and yes my kids have the same fits&lt;&lt;<br/>\n<br/>\n </span></blockquote>That would suggest that what you and the original poster are doing is something <br/>\nsimilarly not working. Simon and Linnaea have both lost their temper, have both <br/>\nbeen unhappy, but I wouldn&#39;t say there were having a fit. A fit suggests <br/>\nsomething sudden and with no reasonable cause. Like a seizure. Although seizures <br/>\nare supposed to be more likely under stress. Maybe it is an apt term. <br/>\n<br/>\n<br/>\nIf you are working to help someone to make things better it helps to have <br/>\nsomething that makes it better in your own home. If all you can offer is <br/>\ncommiseration, it may be better to read what people are offering that has <br/>\nimproved their own relationships. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;mine even say they will die if they don&#39;t get to play the computer. &lt;&lt;<br/>\n<br/>\n </span></blockquote>That&#39;s a really powerless person hoping that you will care enough to help. <br/>\nGoodness. Saying that you will die if you don&#39;t have something is a last ditch <br/>\neffort to try and get some sympathy, some support. Linnaea used to get really <br/>\nupset with Simon when he wouldn&#39;t do what she wanted him to do and would <br/>\nthreaten to hurt herself or him. Simon, when he got really upset, would threaten <br/>\nto kill himself. I didn&#39;t belittle them. I didn&#39;t hush them. I did what I could <br/>\ndo to help them feel better. Sometimes that was just sitting in the same room <br/>\nwith them. Sometimes that was fixing them something to eat or getting them a <br/>\ndrink. Sometimes it was cuddling them while they cried. Sometimes it was so hard <br/>\nnot to just break down and cry, to take their unhappiness personally. Sometimes <br/>\nI failed and took it personally. Each time I went that route they stayed <br/>\nmiserable so much longer. I&#39;d added so much more weight to their unhappiness <br/>\nwith the burden of my hurt feelings that it took longer for them to find a way <br/>\nout of being miserable. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If you give in to him once you <br/>\n </span></blockquote>set up a pattern of continually giving in to him.&lt;&lt;<br/>\n<br/>\nGiving in to someone is not about working hand in hand, side by side, to make a <br/>\nfantastic life together. Giving in means that you hold the cards and get to <br/>\ndecide which ones he gets to play. Giving in argues that you and he aren&#39;t on <br/>\nthe same side. <br/>\n<br/>\n<br/>\nContinually is always. It is every moment. It is all moments. It is yesterday <br/>\nand today and tomorrow. Maybe continually giving in could be worded a different <br/>\nway. Instead of continually giving in it becomes working together to meet goals <br/>\nand desires. So helping your son to play on the computer game that he saved up <br/>\nhis allowance to pay for by feeding him at the computer and letting him shower <br/>\nin the morning. Or just washing his hands and face and feet where he&#39;s sitting. <br/>\nOr not worrying too much about a 6.5 year old being dirty. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;They will wake up tomorrow <br/>\n </span></blockquote>and be refreshed.&lt;&lt;<br/>\n<br/>\nNot if they went to bed angry and resentful and not tired yet. Sometimes they&#39;ll <br/>\njust wake up pissed off still. And not trusting you more. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Nobody told us there would be days like this, but it does get better.&lt;&lt;<br/>\n<br/>\n </span></blockquote>I bet you lots of people told you. The parent who wished that you would have a <br/>\nchild just like you. The parents who you watched on television growing up, Cosby <br/>\nor Roseanne or Happy Days. Lots of people told you that sometimes a parent has <br/>\nto hold the line against a child for the child&#39;s own good. I&#39;m telling you that <br/>\nit doesn&#39;t have to be like that. Even in moments when it feels really, really <br/>\nhard. If you can see yourself as your children&#39;s partner, advocate, helpmate, it <br/>\nwill go a long way to making the moments fewer and easier to move through. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":383312070,"authorName":"Cara Barlow","from":"Cara Barlow &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Fw: [AlwaysLearning] Mums and computers","postDate":"1311350383","msgId":61928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRWhNejUrbkdnRlJBUHpDbWU1cE45cHk0PW9BcExxYk50cGhfOGdrMF9LVnpqTF9NZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":61924,"nextInTopic":61929,"prevInTime":61927,"nextInTime":61929,"topicId":61923,"numMessagesInTopic":0,"msgSnippet":" If you give in to him once you set up a pattern of continually giving in to him.  You re using the slippery slope argument, which is a logical fallacy  ","messageBody":"<div id=\"ygrps-yiv-729114704\">&quot; If you give in to him once you set up a pattern of continually giving in<br/>\nto him. &quot;<br/>\n<br/>\nYou&#39;re using the slippery slope argument, which is a logical fallacy  &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nizkor.org/features/fallacies/slippery-slope.html\">http://www.nizkor.org/features/fallacies/slippery-slope.html</a>&gt;<br/>\n<br/>\nPeople use the slippery slope argument to justify doing what *they* want to<br/>\ndo, not because it has any real-life applicability. That sentence also<br/>\ndescribes your way of relating to your child as adversarial - it reads as if<br/>\nyou think he&#39;s going to take advantage of you. Just something to think<br/>\nabout.<br/>\n<br/>\nMy daughters are 13 and 15. They&#39;re both in a production of MacBeth.<br/>\nYesterday I was at work, so another parent drove them to the dress rehearsal<br/>\nat 1:30 and then the show was at 6:00pm.<br/>\n<br/>\nThe parent that brought them home was an over an hour late picking them up -<br/>\nwhen I got home from work last night at 9:30 they still weren&#39;t home.<br/>\n<br/>\nThe girls commuted 35 minutes to get to rehearsal, rehearsed/performed for<br/>\n6.5 hours with a dinner break, waited for over an hour for their ride to get<br/>\nthere, then commuted 35 minutes to get home. All of this on a day when the<br/>\ntemperature was in the 90s.<br/>\n<br/>\nWhen they did get home at 10pm after that long, hot, intense day,  the first<br/>\nthing they wanted to do was take a shower, then Anna (15) wanted to be by<br/>\nherself to play WoW and talk with her online friends, and Molly (13)  wanted<br/>\nto watch Battlestar Galactica with me. It&#39;s how they wanted to decompress.<br/>\n<br/>\nSo that&#39;s what we did. I brought Anna a snack and a cold ginger<br/>\nale/pomegranate juice drink while she played WoW and chatted with her online<br/>\nfriends in an upstairs room by herself. Then I went downstairs and watched<br/>\ntwo episodes of Battlestar Galactica with Molly while she ate a Popsicle. I<br/>\nfell asleep on the couch for a little bit.<br/>\n<br/>\nThe world didn&#39;t end because they were up playing computer games and<br/>\nwatching TV after a long hot, demanding day - it was actually content and<br/>\nhappy. It was what they needed to do.<br/>\n<br/>\nEveryone went to bed around midnight. The girls slept until about 9 this<br/>\nmorning. They have another show tonight that I&#39;ll be able to attend, and<br/>\nI&#39;ll be the driver tonight, so everyone will get home on time &lt;g&gt;.<br/>\n<br/>\nBest wishes, Cara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311346918","msgId":61924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwRkJFMTc0LTNDMjYtNDE1MC04MTUzLTBDQjFBQTUzM0YwQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":61923,"nextInTopic":61928,"prevInTime":61923,"nextInTime":61925,"topicId":61923,"numMessagesInTopic":0,"msgSnippet":"... If you see your relationship as adversaries with you on the side of right behavior and them on the side of desire for emotional indulgence, then that is","messageBody":"<div id=\"ygrps-yiv-1365185885\"><blockquote><span title=\"ireply\">&gt; If you give in to him once you<br/>\n&gt; set up a pattern of continually giving in to him.<br/>\n<br/>\n </span></blockquote>If you see your relationship as adversaries with you on the side of  <br/>\nright behavior and them on the side of desire for emotional  <br/>\nindulgence, then that is what will happen.<br/>\n<br/>\nIf instead of &quot;giving in&quot; you help them find ways to do what they want  <br/>\nin ways that are respectful of others then you become partners and  <br/>\ngrow a better relationship with them. A relationship where they feel  <br/>\nyour ideas are directed at helping them navigate the world rather than  <br/>\nconfining them to behavior that you feel is right.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  They will wake up tomorrow<br/>\n&gt; and be refreshed<br/>\n<br/>\n<br/>\n </span></blockquote>Or if they had played the game they could wake up with memories of  <br/>\nwonderful accomplishments. Or still be up. Or be tired and grumpy  <br/>\nbecause they pushed their limits.<br/>\n<br/>\nBut by deciding that they need to conform to your idea that sleep is  <br/>\nmore valuable than play, they don&#39;t get to explore the good parts and  <br/>\nbad parts of their choices. They don&#39;t get to decide for themselves  <br/>\nwhat *they* value. What they get are rules to memorize: Sleep is more  <br/>\nimportant than play. Mom&#39;s idea of what is right is better than my  <br/>\nidea of what is right. It rocks to have the power to make people  <br/>\nbehave the way you think is right. It sucks not to have that power.<br/>\n<br/>\nIn fact your whole post is full of rules that you&#39;ve memorized about  <br/>\nhow to behave right in the world. We can&#39;t know what the world our  <br/>\nkids will be living in will be like. We can&#39;t hand them rules for  <br/>\nwhat&#39;s right and what&#39;s wrong. We can, though, help them explore the  <br/>\nworld in safe ways so they can make thoughtful choices and decide for  <br/>\nthemselves what they value and what is less important to them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sometimes it is good to just talk to them and explain the<br/>\n&gt; next day how busy you were and how tired he was after such a long  <br/>\n&gt; fun filled day<br/>\n&gt; and that we can&#39;t always do everything,<br/>\n<br/>\n<br/>\n </span></blockquote>When this is true, it&#39;s obvious (like when rain cancels a picnic) and  <br/>\ndoesn&#39;t need explained.<br/>\n<br/>\nWhen it&#39;s your decision to prevent them from doing what they want and  <br/>\nto make them do what you want, then it feels like it needs explained.<br/>\n<br/>\nBut your certainty that you&#39;re right doesn&#39;t make it universally  <br/>\nright. They aren&#39;t necessarily understanding what you think you&#39;re  <br/>\nexplaining. The lesson they&#39;re very likely picking up is that your  <br/>\nagenda is more important than their feelings and you get to force your  <br/>\nagenda on them because you have the power to do so.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They<br/>\n&gt; eventually get the picture.<br/>\n<br/>\n<br/>\n </span></blockquote>They eventually learn that they can&#39;t always get help from you to do  <br/>\nwhat they want. They learn that you get to decide what you want to  <br/>\nhelp them with and otherwise will give them a lecture on why they&#39;re  <br/>\nwrong to want what they want.<br/>\n<br/>\nWhat you set up by doing that is a relationship where they may ask you  <br/>\nfirst since you&#39;re convenient, but if you say no to something they  <br/>\nfeel is important to them, they&#39;ll go around you. Or find someone else  <br/>\nto help. Someone that may not have their best interest in mind so  <br/>\nwon&#39;t care if they&#39;re finding safe ways to do it.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s just that we have to weather the storm in the<br/>\n&gt; process. Nobody told us there would be days like this, but it does  <br/>\n&gt; get better.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>What&#39;s your definition of better?<br/>\n<br/>\nIf kids give up asking, knowing you won&#39;t say yes, that&#39;s more  <br/>\nconvenient but not necessarily better. It *seems* like you&#39;ve &quot;fixed&quot;  <br/>\nthem so they no longer have the wants and desires you don&#39;t approve  <br/>\nof. That&#39;s an illusion. Some of the wants and desires will go away  <br/>\nbecause they get older. But the lack, the emptiness will stay with  <br/>\nthem. Some of the wants and desires they will hide from you because  <br/>\nyou&#39;ve taught them you will react negatively to them and they&#39;ll find  <br/>\nother ways to meet them.<br/>\n<br/>\nYour &quot;better&quot; will mean their relationship with you won&#39;t be a strong  <br/>\nas it would be if they saw you as a partner who will help them find  <br/>\nsafe and respectful ways to meet their needs. It means they will see  <br/>\nyou as a gate that opens and closes based on your feelings and in  <br/>\ndisregard to theirs.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Fw: [AlwaysLearning] Mums and computers","postDate":"1311344762","msgId":61923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzNDQ3NjIuNzI3NTQuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":61924,"prevInTime":61922,"nextInTime":61924,"topicId":61923,"numMessagesInTopic":0,"msgSnippet":"I got sent this off list. I ve removed the name of the person who posted it to me, but I figured it would be better being discussed in the open than in a ","messageBody":"<div id=\"ygrps-yiv-888089715\">I got sent this off list. I&#39;ve removed the name of the person who posted it to <br/>\nme, but I figured it would be better being discussed in the open than in a <br/>\nprivate series of e-mails. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\nThere is always tomorrow and yes my kids have the same fits mine even say they <br/>\nwill die if they don&#39;t get to play the computer.  If you give in to him once you <br/>\nset up a pattern of continually giving in to him.  They will wake up tomorrow <br/>\nand be refreshed.  Sometimes it is good to just talk to them and explain the <br/>\nnext day how busy you were and how tired he was after such a long fun filled day <br/>\nand that we can&#39;t always do everything, there is always tomorrow.  They <br/>\neventually get the picture. It&#39;s just that we have to weather the storm in the <br/>\nprocess.  Nobody told us there would be days like this, but it does get better.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":61890,"nextTopicId":62010}}