{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":818735,"authorName":"Joylyn","from":"Joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] What would you do? Was: Questions about this list   and Un...","postDate":"1020279883","msgId":6611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDRDAzQzRCLkE5RTVGRjQ1QGd0ZS5uZXQ+","referencesHeader":"PGJjLjI1ZTE5NWM1LjJhMDE5MzY3QGFvbC5jb20+"},"prevInTopic":6608,"nextInTopic":0,"prevInTime":6610,"nextInTime":6612,"topicId":6594,"numMessagesInTopic":0,"msgSnippet":"Some of the most prejudiced people I have ever met have been black. THeir is a neighbor girl, Ajin.  She s Korean.  She can play with Lexie at our house, go","messageBody":"<div id=\"ygrps-yiv-2073535245\">Some of the most prejudiced people I have<br/>\never met have been black.<br/>\n<br/>\nTHeir is a neighbor girl, Ajin.  She&#39;s<br/>\nKorean.  She can play with Lexie at our<br/>\nhouse, go into our house, etc. but she has<br/>\ntold us that Lexie is not allowed in her<br/>\nhouse. Only Asian people can go into her<br/>\nhouse, but we have seen another little girl<br/>\nin her house, and that girl is white, so we<br/>\nknow that only black people are not allowed<br/>\nin their house.  I really dislike this child,<br/>\nshe is so powerless, and she gets her power<br/>\noff the other kids by setting them up and<br/>\nthen watching the fight.  I&#39;m pretty sure she<br/>\nis being abused but have no proof and so<br/>\ncan&#39;t make a call or help.  She is a passive<br/>\naggressive little monster and I hate it when<br/>\nshe comes over but as Lexie says, &quot;it&#39;s not<br/>\nAjin&#39;s fault her parents are bigots.&quot;<br/>\n<br/>\nJoylyn (laughing at the Alb and no black<br/>\npeople comment--mark was one of 9 at<br/>\nEldorado.  There is a fair size community<br/>\ndown off 2nd street...)<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; In a message dated 5/1/02 12:30:27 PM,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joylyn@...\">joylyn@...</a> writes:<br/>\n&gt;<br/>\n&gt; &lt;&lt; but what is your definition of &quot;at<br/>\n&gt; risk?&quot;<br/>\n&gt; I&#39;m assuming the teacher is white, but what<br/>\n&gt;<br/>\n&gt; is the race of the child?  Is it OK for the<br/>\n&gt;<br/>\n&gt; child to have contact with a racist person<br/>\n&gt; if<br/>\n&gt; the child is of the same race, but it would<br/>\n&gt;<br/>\n&gt; be wrong if the child was black or another<br/>\n&gt; race? Isn&#39;t that idea racist? &gt;&gt;<br/>\n&gt;<br/>\n&gt; We are friends with an African American<br/>\n&gt; family.  The dad is pretty<br/>\n&gt; prejudiced.  The mom and dad met at a<br/>\n&gt; meeting of the Afro-American Student<br/>\n&gt; Union in the early 1970&#39;s, in college.  The<br/>\n&gt; dad can thereby assume the mother<br/>\n&gt; will not be too stunned by a fairly<br/>\n&gt; separatist attitude.<br/>\n&gt;<br/>\n&gt; Unfortunately for him, they moved to<br/>\n&gt; Albuquerque, and the kids have all white<br/>\n&gt; friends so far.<br/>\n&gt;<br/>\n&gt; Would it be okay for another Black family<br/>\n&gt; to hang around with them?  (I think<br/>\n&gt; it&#39;s okay for us to, but I know it&#39;s not as<br/>\n&gt; pleasant for the dad as we&#39;d all<br/>\n&gt; like for it to be, that his kids like me<br/>\n&gt; and mine so much.)  Should only<br/>\n&gt; other prejudiced people hang around with<br/>\n&gt; him?<br/>\n&gt;<br/>\n&gt; I think we&#39;re softening him up.  (Not just<br/>\n&gt; our family, but Albuquerque in<br/>\n&gt; general--before they had lived in NYC,<br/>\n&gt; Detroit and Houston, that I can<br/>\n&gt; remember.)<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;            Yahoo! Groups Sponsor<br/>\n </span></blockquote>                ADVERTISEMENT<br/>\n                 [Click Here!]<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; To unsubscribe from this group, send an<br/>\n&gt; email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to the<br/>\n&gt; Yahoo! Terms of Service.<br/>\n<br/>\n </span></blockquote>--<br/>\nJoylyn<br/>\nMom to Lexie (6) and Janene (3)<br/>\nFor great nursing clothes and slings, go to<br/>\nwww.4mommyandme.com<br/>\n<br/>\n&quot;Wasn&#39;t it Mark Twain who said it takes a<br/>\nvery dull person to spell a word only one<br/>\nway?&quot;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":818735,"authorName":"Joylyn","from":"Joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] What would you do? Was: Questions about this list  and Un...","postDate":"1020277604","msgId":6608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDRDAzMzY0LkQwN0FDNkFFQGd0ZS5uZXQ+","referencesHeader":"PDEwLjFlMjExYWU5LjJhMDEyZTAwQGFvbC5jb20+"},"prevInTopic":6594,"nextInTopic":6611,"prevInTime":6607,"nextInTime":6609,"topicId":6594,"numMessagesInTopic":0,"msgSnippet":"... but what is your definition of at risk? I m assuming the teacher is white, but what is the race of the child?  Is it OK for the child to have contact","messageBody":"<div id=\"ygrps-yiv-2129307241\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I bet there are millions of VERY<br/>\n&gt; interesting people that have &quot;unsavory&quot;<br/>\n&gt; interests that no one knows about---but<br/>\n&gt; they&#39;re good at what they do, and it<br/>\n&gt; doesn&#39;t enter into their daily language. As<br/>\n&gt; long as my child weren&#39;t &quot;at<br/>\n&gt; risk&quot;, I wouldn&#39;t worry about it.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>but what is your definition of &quot;at risk?&quot;<br/>\nI&#39;m assuming the teacher is white, but what<br/>\nis the race of the child?  Is it OK for the<br/>\nchild to have contact with a racist person if<br/>\nthe child is of the same race, but it would<br/>\nbe wrong if the child was black or another<br/>\nrace? Isn&#39;t that idea racist?<br/>\n<br/>\nOne reason we homeschool is because research<br/>\nsays that black childrne are touched less<br/>\nthan white children.  And dark black children<br/>\nare touched less than light black children.<br/>\nThis is true even if the teacher is black<br/>\nherself and doesn&#39;t have a website saying<br/>\nwhites are better.  It is true even if the<br/>\nteacher is teaching something not related to<br/>\nrace or social studies.  How we interact with<br/>\nothers is important. Body language is 60-80%<br/>\nof our communication, and is very powerful.<br/>\n<br/>\nAnother reason is because of subtle messages.<br/>\nI read an article about this little girl who<br/>\nin 2nd grade was doing wonderfully.  Then in<br/>\n3rd grade she started having problems.<br/>\nTeacher reporting lots of problems, problems<br/>\ngetting along with kids, with teachers, etc.<br/>\nAt a conference, the teacher said things like<br/>\n&quot;she just doesn&#39;t seem to know who to be<br/>\nfriends with&quot; and other telling statements<br/>\nthat let the parents know the teacher felt<br/>\nthe child had social issues.  The teacher<br/>\nalso said she was having problems with math.<br/>\nEnds up the teacher had decided that as the<br/>\nchild was multiracial that the child was<br/>\ngoing to have problems figuring out whether<br/>\nshe was black or white, and have problems<br/>\nknowing who she should be firends with, the<br/>\nblack kids or the white kids.  The teacher<br/>\nalso assumed the child would have problems in<br/>\nmath and in other areas.  The parents removed<br/>\nthe child from that classroom and the<br/>\n&quot;problems&quot; went away.  The teacher, I&#39;m sure,<br/>\nwas unaware of her own inherent racism and<br/>\nhow it affected her relationship with the<br/>\nchild and expectations of the child.<br/>\n<br/>\nSubtle racism is everywhere and I don&#39;t<br/>\nparticularly want it to hurt my children more<br/>\nthan necessary. I cannot control every aspect<br/>\nof their lives but I can control a lot of it,<br/>\nespecially when they are younger.  As you<br/>\nsaid, we don&#39;t know the hidden interests of<br/>\npeople around us, but in this case, we DO<br/>\nknow the hidden interest of this man.<br/>\n<br/>\nLast night I did a home visit (I&#39;m a LLL<br/>\nLeader).  As I&#39;m asking my usual questions, I<br/>\nask about circ.  Baby is intact and I know my<br/>\nrelief was apparent.  This is my bias.  The<br/>\nmom noticed this and asked me and I just said<br/>\nthe standard line of how babies that are<br/>\ncirced often have problems breastfeeding, but<br/>\nmy bias showed.  We ALL have biases, and they<br/>\nwill come out. I certainly don&#39;t want a<br/>\nperson&#39;s bias against black people to come<br/>\nout while that person is teaching my<br/>\ndaughter, even if the subject matter has<br/>\nnothing to do with black people.<br/>\n<br/>\nMy husband clearly remembers when a teacher<br/>\ntold him that he shouldn&#39;t be running for<br/>\nstudent body president or taking honors<br/>\nEnglish because he wasn&#39;t going to be able to<br/>\ngo to college anyway, he might as well take<br/>\nauto shop and learn a trade.  The young<br/>\ncollege age checker at the grocery store<br/>\ndidn&#39;t realize what his words meant when he<br/>\nasked me, in front of my two children, how<br/>\nlong I&#39;d had my &quot;foster children.&quot;  White<br/>\nlady, black children, those kids must be in<br/>\nfoster care.  Whether the ignorant statements<br/>\nor messages are intended to cause pain or<br/>\nnot, they have the same ability to cause<br/>\npain.  People often say intentions are<br/>\nimportant, think about intent.  And that&#39;s<br/>\ntrue, but when the little old white lady rubs<br/>\nmy child&#39;s hair and says &quot;she&#39;s so pretty and<br/>\nsmart, oh she is so pretty, what a beautiful<br/>\nchild, oh what beautiful skin&quot; and my own<br/>\nskin is crawling with her forced attempt at<br/>\ntrying not to be racist and  my insticts are<br/>\ntelling me she surely is--well, intent means<br/>\nnothing.  Subtle racism, even when you can&#39;t<br/>\nquite put a finger on it, when you just know<br/>\nsomething isn&#39;t right, is still racism and<br/>\nstill causes harm.<br/>\n<br/>\nMany years ago when I complained to my mom<br/>\nabout the dirty looks my then fiance and I<br/>\ngot when we went someplace, my mom made a<br/>\nvery intersting comment.  She said &quot;you can<br/>\neither assume they are looking at you because<br/>\nthey dislike the fact you are with a black<br/>\nman or that Mark is with a white woman or you<br/>\ncan assume that they are thinking what a nice<br/>\nlooking couple you are, and you can smile<br/>\nback at them.&quot;  I thought about this and<br/>\nrealized that she was right.  Now,<br/>\noccasionally, they really are looking at us<br/>\nwith disgust and hate but by smiling at them<br/>\nI am not allowing their hate to change my<br/>\noutlook, and occassionally I find that I am<br/>\nwrong.  I did the same with breastfeeding in<br/>\npublic.  People would scrowl at me and I<br/>\nwoudl simply lift my head, smile at them, and<br/>\nassume they were admiring my beautiful baby.<br/>\nBut these are strangers, and would I want one<br/>\nof these racist bigots to have contact with<br/>\nmy child?  I don&#39;t think so. I&#39;ve choosen<br/>\nthat my children don&#39;t have contact with<br/>\ntheir great grandmother because she is a<br/>\nracist bigot, although they have met her a<br/>\nfew times with me hovering close.  I would<br/>\nnever leave them alone together, not until<br/>\nthey are much older and better able to handle<br/>\nthings.  But then again, I was in my late<br/>\n20&#39;s when she disowned me for marrying a<br/>\nblack man, and I can&#39;t say I handled it well,<br/>\nand I still feel the pain--so when will they<br/>\nbe old enough?<br/>\n<br/>\nI&#39;m sure all of us can think back and<br/>\nremember one comment or one incident that has<br/>\nchanged us, either for good, or for bad.   I<br/>\nremember my 10th grade writing teacher<br/>\ntelling me that I would never be a writer,<br/>\nwhich is and has always been my dream.  &quot;Find<br/>\nsomething else to do Joylyn, because you&#39;ll<br/>\nnever be a writer.&quot;  I still almost want to<br/>\ncry when I think of those hurtful words,<br/>\nstill remember her name (Mrs. Sleeter, I<br/>\ncalled her Mrs. sleezebutt), the room where<br/>\nwe were, and how I felt afterwards.  Each of<br/>\nus has the power to affect a child&#39;s life,<br/>\nand I just don&#39;t think it&#39;s a good idea to<br/>\nallow a child to be with a man who obviously<br/>\nhas a different opinion on such an important<br/>\nsubject.<br/>\n<br/>\nI admit I haven&#39;t been following this<br/>\nconversation too closely, so I don&#39;t remember<br/>\nthe age of the child, the length of contact,<br/>\nif the child is alone with the man or if the<br/>\nparent is present at all times, etc.  All<br/>\nthose are factors.  Also, does the man know<br/>\nhow you feel, that you know his personal<br/>\nbeliefs and that while you respect him as an<br/>\nexpert on Robots you do not share his beliefs<br/>\nand that you wish for him to make an effort<br/>\nto not share those beliefs with the child?<br/>\nIf he is open to this type of relationship,<br/>\nand if for the most part a parent will be<br/>\nthere at all times, supervising the contact,<br/>\nthen I&#39;d say that it would probably be OK.<br/>\nIf he says that his beliefs are vital to his<br/>\nbeing and that he doesn&#39;t leave them at the<br/>\ndoor, then that is a different story. I can<br/>\nunderstand and respect that viewpoint--I<br/>\nunfortunately have many racists in my family,<br/>\nand my children and I are not welcome in some<br/>\nof their homes--which brings the question....<br/>\nDo I WANT my children to have contact with<br/>\nsuch people, relatives or not.  For the most<br/>\npart the answer is no, but in reality I have<br/>\nchoosen to have limited contact with some of<br/>\nthese people, monitoring closely any contact<br/>\nso that I can head off any problems.<br/>\n<br/>\nThat said, I firmly believe that no person<br/>\ncan make my children believe something they<br/>\ndon&#39;t wish to believe, including myself. I<br/>\nremember having discussions with Lexie, then<br/>\nage 4, about Hell.  She firmly believed that<br/>\nthere was a hell, and I do not, and she would<br/>\nnot back down on her idea that hell was a<br/>\nreal physical place.  This is good (not that<br/>\nshe believes in hell but that she can stand<br/>\nup to her believes,)   I think we need to<br/>\nrespect our children and trust that they will<br/>\nmake good decisions, and that they will not<br/>\nbe swayed by people that come into their<br/>\nlives, just as we trust them to learn and<br/>\ngrow.  It&#39;s an interesting delima, on one<br/>\nhand, to use my example from above, what<br/>\neffect did the words my teacher use when I<br/>\nwas 15, in telling me I would never be a<br/>\nprofessional writer, have on the fact that at<br/>\nage 36 I still WANT to be a professional<br/>\nwriter but that I have difficulty buckling<br/>\ndown and doing it--I certainly wavered in<br/>\ncollege, my degree is in English with an<br/>\nemphases on writing and literature, but I<br/>\nwent into teaching.<br/>\n<br/>\nWell, I&#39;ve rambled enough, I guess in summary<br/>\nI&#39;d say that I&#39;d think long and hard before<br/>\nallowing my child constant and especially<br/>\nunsupervised contact with someone who holds<br/>\nsuch horrible beliefs.  If you&#39;ve read all of<br/>\nthis, thank you.<br/>\n<br/>\nJoylyn<br/>\n--<br/>\nJoylyn<br/>\nMom to Lexie (6) and Janene (3)<br/>\nFor great nursing clothes and slings, go to<br/>\nwww.4mommyandme.com<br/>\n<br/>\n&quot;Wasn&#39;t it Mark Twain who said it takes a<br/>\nvery dull person to spell a word only one<br/>\nway?&quot;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] What would you do? Was: Questions about this list and Un...","postDate":"1020253184","msgId":6594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwLjFlMjExYWU5LjJhMDEyZTAwQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":6608,"prevInTime":6593,"nextInTime":6595,"topicId":6594,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/29/2002 9:24:51 AM Eastern Daylight Time, ... Does it interfere with his knowledge of robotics? Does he push it on your son when they re","messageBody":"<div id=\"ygrps-yiv-1786719389\">In a message dated 4/29/2002 9:24:51 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dvilter@...\">dvilter@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; My question is: What would you do in this situation?<br/>\n&gt; <br/>\n&gt; I&#39;m not asking a political or racial question here, I&#39;m asking an<br/>\n&gt; educational one.<br/>\n&gt; <br/>\n </span></blockquote>Does it interfere with his knowledge of robotics? Does he push it on your son <br/>\nwhen they&#39;re not talking about robotics?<br/>\n<br/>\nIs this your only hang-up? Would you be more/less concerned if he were a <br/>\npedophile or a wife/child beater or a drug pusher? How about a link to child <br/>\nporn sites? <br/>\n<br/>\nI think that if it doesn&#39;t interfere with his (and your son&#39;s) love of <br/>\nrobotics, it shouldn&#39;t matter. You can&#39;t change him. You CAN get as much <br/>\nknowledge from him about robotics and avoid any discussion of race relations <br/>\nwith him.<br/>\n<br/>\nIf this were a genetics class---or anthropology or sociology--it would <br/>\nprobably make a big difference. It&#39;s robotics (are white robots better?).<br/>\n<br/>\nI bet there are millions of VERY interesting people that have &quot;unsavory&quot; <br/>\ninterests that no one knows about---but they&#39;re good at what they do, and it <br/>\ndoesn&#39;t enter into their daily language. As long as my child weren&#39;t &quot;at <br/>\nrisk&quot;, I wouldn&#39;t worry about it.<br/>\n<br/>\nKelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":6605,"nextTopicId":6571}}