{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Movies (was &quot;Good Questions&quot;)","postDate":"1049736934","msgId":63411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0LmU3ZTIxNzcuMmJjMzEwZTZAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":63410,"nextInTime":63412,"topicId":63411,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/7/03 12:12:15 AM, asherbow@starpower.net writes: ","messageBody":"<div id=\"ygrps-yiv-197675451\">In a message dated 4/7/03 12:12:15 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:asherbow@...\">asherbow@...</a> writes:<br/>\n<br/>\n&lt;&lt; More I am worried that *who* I am is not a good enough<br/>\nexample of this kind of learning.  That ultimately I am too well-trained<br/>\nby our larger culture and its measures and definitions of achievement,<br/>\nproductivity, creativity and success to be able to model the kind of<br/>\nself-motivated activity that unschooling is supposed to foster in<br/>\nchildren.  <br/>\n<br/>\n&lt;&lt;Does this make sense? &gt;&gt;<br/>\n<br/>\nSure!<br/>\n<br/>\nIf you have a child who was in school two years, the generally applied <br/>\nformula says he&#39;ll recover from that in a couple of months.<br/>\n<br/>\nI&#39;m guessing you were in school from twelve to seventeen years.  Could be <br/>\nmore.  Maybe you were lucky, and it was not that long.<br/>\n<br/>\nThat gives you at LEAST a year to recover.  More if you taught and so were <br/>\ninvested in providing and maintaining structured education.<br/>\n<br/>\nI think movies are the most productive thing for this switchover.  It&#39;s a <br/>\nsolid vein in a gold mine of ideas.    Just start anywhere and step from one <br/>\nmovie to another like walking on rocks in a shallow stream.    At the moment <br/>\nwe&#39;re on Charlton Heston movies.  We&#39;ve just watched two westerns, Will Penny <br/>\nand The Big Country.  Next we&#39;re going to science fiction.  Historic epics, <br/>\nwe own and have known for years--Ben Hur, El Cid, The Ten Commandments.  <br/>\nSoylent Green next.<br/>\n<br/>\nIt&#39;s not that we&#39;re studying Charlton Heston, it&#39;s that we&#39;re using him as a <br/>\nthread to decide which dot to jump to next.  For a while here it was Kevin <br/>\nSmith.  LOTS of Kevin Smith in January/February (that&#39;s Silent Bob, to some <br/>\nof you, maybe, and &quot;who!?&quot; to others).  <br/>\n<br/>\nAnd this Charlton Heston thing, it&#39;s mostly Keith (my husband) and me.  We&#39;re <br/>\nnot &quot;making&quot; kids watch with us.  They&#39;re in and out.  We&#39;ve shown Marty the <br/>\ngood parts, as he has a particular interest in westerns.   Charlton Heston <br/>\nwrote in his autobiography that aside from jazz, the western movie is the <br/>\nmost uniquely American contribution to the arts.  (I&#39;ll look the exact quote <br/>\nup if anyone really cares.  He said it better.)<br/>\n<br/>\nSo if you start your own movie dot-to-dot, even if it&#39;s just one movie a <br/>\nweek, you&#39;ll start to see patterns and start to be conversant about details, <br/>\nand that will lead to reading about the people, and maybe finding other <br/>\nmovies by the same directors, or with some of the other actors.<br/>\n<br/>\nThat&#39;s WAY easier (and more useful, I think, for being so multi-faceted) than <br/>\nassigning yourself to learn about ancient Chinese swords or Faberge <br/>\nenamelling, where you&#39;ll be limited to books and maybe owning one or two <br/>\npieces (MAYBE) and the kids might not care.<br/>\n<br/>\nMovies have costumes, props, sets, MUSIC, dialog, speeches in the scripts <br/>\nwhich can take your breath away and change your life, acting, stunts, <br/>\nhorses/tanks/fantasy contraptions.<br/>\n<br/>\nAnd they&#39;re relaxing, too.  And moms who are tense about learning NEED to <br/>\nrelax.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":63293,"nextTopicId":63415}}