{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":59469462,"authorName":"Gerard Westenberg","from":"&quot;Gerard Westenberg&quot; &lt;westen@...&gt;","profile":"leonieann2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] First year-end unschooling evaluation","postDate":"1092178654","msgId":97654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYmEwMWM0N2YyZCQ2ZDFkMjkyMCQwMTAwMDAwYUB2aWMuYmlncG9uZC5uZXQuYXU+","referencesHeader":"PGNmNmd2MSthZjFlQGVHcm91cHMuY29tPg=="},"prevInTopic":97488,"nextInTopic":0,"prevInTime":97653,"nextInTime":97655,"topicId":97488,"numMessagesInTopic":0,"msgSnippet":" Hey, Julie - I m interested. I am always looking at new ways of representing our","messageBody":"<div id=\"ygrps-yiv-461121210\">&lt;&lt;If anyone&#39;s interested, I&#39;d be happy to post one of them or email them. &gt;&gt;&gt;<br/>\n<br/>\nHey, Julie - I&#39;m interested. I am always looking at new ways of representing our learning and unschooling for our yearly education department visit. If you prefer, you can email me privately...Leonie <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:westen@...\">westen@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"First year-end unschooling evaluation","postDate":"1092011809","msgId":97488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmNmd2MSthZjFlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":97654,"prevInTime":97487,"nextInTime":97489,"topicId":97488,"numMessagesInTopic":0,"msgSnippet":"I met with the certified teacher here in Ohio to go over our first complete year of unschooling. We are supposed to give evidence of progress in the various","messageBody":"<div id=\"ygrps-yiv-471321507\">I met with the certified teacher here in Ohio to go over our first complete year of <br/>\nunschooling. We are supposed to give evidence of progress in the various subject <br/>\ncategories required by the state. This was my first time that I didn&#39;t have a single <br/>\nworkbook to show her. She&#39;s a wonderful friend and homeschooler who dislikes textbook <br/>\nbased education (she&#39;s more eclectic). So I was comfortable with her but nervous that even <br/>\nstill I might not match the expectations.<br/>\n<br/>\nWhat I decided to do this year is to write an individual narrative for each of my five kids. I <br/>\nfocused on how each one spent his or her time and gave subhead categories. I didn&#39;t <br/>\nflinch. I listed their areas of interest in order so my first category for my 7 year old was <br/>\n&quot;TV&quot; and focused on her extenisve knowledge of Disney sit coms. For my 10 year old son, I <br/>\ndeclared his first category: Computer Gaming. I detailed his mastery of War Craft and Star <br/>\nCraft. For my third child, I began by discussing his passion for all things Lord of the Rings. <br/>\nI went on to express how they learned math etc. but I started with the most controversial <br/>\ntopics.<br/>\n<br/>\nI figured that if my narratives didn&#39;t reveal &quot;enough&quot; education according to the certified <br/>\nteacher&#39;s standards, she&#39;d let me know and I&#39;d figure out a way to meet those <br/>\nexpectations. But if I could be straightforward without finessing the language, then I knew <br/>\nI&#39;d never look back about unschooling.<br/>\n<br/>\nSeveral wonderful things occurred in the process.<br/>\n<br/>\nFirst, I enjoyed writing these narratives. It felt like a time capsule of their treasures. I could <br/>\nsee the way they learned, what they valued and how they spent their lives (well-spent!). <br/>\n<br/>\nSecond, my kids loved hearing me read them. They were astonished at all they had learned <br/>\nthis year. I asked each one to let me know if I had over-stated or forgotten to include <br/>\nanything. My 12 year old who often worries that he isn&#39;t getting an education said at the <br/>\nend of his narration, &quot;Wow! I learned so much this year. Can we write something like this <br/>\neach month? It really helps me to see how I&#39;m learning.&quot;<br/>\n<br/>\nThird, the certified teacher loved what I did for my kids. She said two things, &quot;Now this is <br/>\nwhat I call an education.&quot; She also said, &quot;Let&#39;s always schedule you last. I get so tired of <br/>\nAbeka and Bob Jones paraded through my living room as education.&quot;<br/>\n<br/>\nI told the truth - I shared their strenghts and weaknesses. I expressed it all in common <br/>\nlanguage. And I included personal comments that they the kids had made about what they <br/>\nwere learning.<br/>\n<br/>\nIn addition to the individual narratives, I included a description of a day at the art museum <br/>\nwith my kids. I wanted her to see what a typical outing to the msuem is like for us and all <br/>\nthe ways that the kids reveal the complex, intergrated knowledge they&#39;ve gained and how <br/>\nthey use it. She loved this as well.<br/>\n<br/>\nIf anyone&#39;s interested, I&#39;d be happy to post one of them or email them. I will post the art <br/>\nmuseum narrative. It was an especially fun one to write and helped me to affirm the <br/>\neducation happening within my kids.<br/>\n<br/>\nJust thought those wondering how to quantify unschooling might like some examples and <br/>\nencouragement.<br/>\n<br/>\nJulie B</div>","specialLinks":[]}],"prevTopicId":97630,"nextTopicId":97471}}