{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":112038769,"authorName":"Shyrley","from":"Shyrley &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] pertussis in unimmunized person","postDate":"1048690341","msgId":62100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFODFCRUE1LkQzMTFCQzdAdmVyaXpvbi5uZXQ+","referencesHeader":"PDAxYzcwMWMyZjM1OSQxYWQ5OTA2MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":62089,"nextInTopic":0,"prevInTime":62099,"nextInTime":62101,"topicId":62070,"numMessagesInTopic":0,"msgSnippet":"... I took mine too a homeopath when they had pertussis. It made the symptoms less severe and the whole illness didn t last as long. Shyrley [Non-text portions","messageBody":"<div id=\"ygrps-yiv-1381328479\">Tim and Maureen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi<br/>\n&gt; I have been lurking and have a concern. Wondered if anyone has any experience with this.<br/>\n&gt; I have a friend with a 9 year old unimmunized boy who now has pertussis. She of course went through the guilt shame routine at the doctors and although has very thoroughly explored her choice to not immunise she is feeling some guilt and fear that she could have prevented this. Her son is highly uncomfortable and now has pneumonia and now her 4 year old looks and sounds like he too has it. The doctors have told her that the immunisations have changed greatly over the years so to be safer so she is interested in revisiting her decision to not immunise. So she is looking for up to date info as she is pregnant as well and she also wonders if anybody knows of some things she can do to get her boys through the nights more comfortably as she is not getting a lot of sleep and these guys are coughing to the point of vomiting and pain.<br/>\n&gt;<br/>\n&gt; Maureen<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I took mine too a homeopath when they had pertussis. It made the symptoms less severe and the whole illness didn&#39;t last as long.<br/>\n<br/>\nShyrley<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129979205,"authorName":"Rebecca","from":"&quot;Rebecca&quot; &lt;harvesthearth@...&gt;","profile":"harvesthearth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: pertussis in unimmunized person","postDate":"1048682823","msgId":62089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI1czdnNyt0Z24zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxYzcwMWMyZjM1OSQxYWQ5OTA2MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":62077,"nextInTopic":62100,"prevInTime":62088,"nextInTime":62090,"topicId":62070,"numMessagesInTopic":0,"msgSnippet":"Maureen, Tell your friend to take a deep breath, and to NOT decide to hop on the guilt-train the Doc s are providing her a free-ticket on. I would tell her","messageBody":"<div id=\"ygrps-yiv-870278135\">Maureen,<br/>\n<br/>\nTell your friend to take a deep breath, and to NOT decide to hop on <br/>\nthe &quot;guilt-train&quot; the Doc&#39;s are providing her a free-ticket on.<br/>\n<br/>\nI would tell her to contact the following agency and see what info <br/>\nthey can provide -- they are national, and stay on the top of all <br/>\nvarious lawsuits, research, congressional hearings, etc.<br/>\n<br/>\nNational Vaccine Information Center <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.909shot.com/\">http://www.909shot.com/</a><br/>\n<br/>\nHere is there page on &quot;whooping cough&quot; aka pertussis:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.909shot.com/Diseases/whooping.htm\">http://www.909shot.com/Diseases/whooping.htm</a><br/>\n<br/>\nThe biggest thing your friend needs to remember is that her children <br/>\nCOULD HAVE gotten this ailment EVEN IF she HAD immunized them <br/>\nagainst it to begin with. NONE of the shots are guaranteed <br/>\nresistance, or even long-term resistance.<br/>\n<br/>\nBlessings,<br/>\n<br/>\nBecca</div>","specialLinks":[]},{"userId":50009731,"authorName":"Heidi Wordhouse-Dykema","from":"Heidi Wordhouse-Dykema &lt;heidi@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] pertussis in unimmunized person","postDate":"1048660402","msgId":62077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMzAzMjUyMTU2MDkuMDFjNTRhMzhAbWFpbC5keWtlbWEubmV0Pg==","inReplyToHeader":"PDAxYzcwMWMyZjM1OSQxYWQ5OTA2MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":62070,"nextInTopic":62089,"prevInTime":62076,"nextInTime":62078,"topicId":62070,"numMessagesInTopic":0,"msgSnippet":"Hi, Right up my alley. I m on week 7 or 8 of pertussis - and I was vaccinated, so don t let the docs tell you that vaccinations will protect everyone.  In our","messageBody":"<div id=\"ygrps-yiv-1371961215\">Hi, Right up my alley.<br/>\nI&#39;m on week 7 or 8 of pertussis - and I was vaccinated, so don&#39;t let the <br/>\ndocs tell you that vaccinations will protect everyone.  In our household, <br/>\nwhere three people came down with whoop (and one didn&#39;t), 100% off the vacc <br/>\nfolks got the whoop, but only 50% of the unvacc. did.  It&#39;s just <br/>\nannecdotal, but still...  Please tell her to lay off the guilt, and that <br/>\nvacc&#39;s aren&#39;t protecting a lot of folks and are almost always completely <br/>\ngone after 7 years.  Wouldn&#39;t have helped her older son in the least to <br/>\nhave been vacc&#39;d.  If that doesn&#39;t help her guilt complex, we have friends <br/>\nwho&#39;s kids (vacc.) got it too and we&#39;ve heard stories of dozens more.<br/>\n<br/>\nThere is supposedly no &#39;cure&#39; for pertussis besides time, but there are <br/>\nthings that can make life a little more comfortable.  At least they helped <br/>\nme out some.<br/>\n#1. When they start to whoop, CLEAR their noses of all snot, mucous, <br/>\netc.  Sometimes it helps limit the gagging/barfing at the end of the attack <br/>\nor can help keep them from immediately going into another attack.  SUCTION <br/>\nit out if you have to, don&#39;t wait to get them to blow their noses (although <br/>\nif they&#39;re older and FAST, that will work.)<br/>\n#2.  Meds you might want to consider, but they are all fairly intensive, so <br/>\nconsider well...:<br/>\nMy doc put me on a specific antibiotic (which just makes sure I&#39;m not <br/>\ncontagious, doesn&#39;t help with the symptoms), Albuterol (for short term <br/>\nairway expansion), Advair (for long term airway expansion, but it has <br/>\nsteroids!), Cherrytussin with Codeine (to help me sleep through the night, <br/>\nalthough it didn&#39;t always work) and BEST of all, Flonase (to keep nasal <br/>\ndrip/congestion from aggravating the cough reflex.)  The Flonase and the <br/>\nairway expanders seemed to be the most helpful.  The Flonase cut my attacks <br/>\nin half and let my throat heal up (it was SO raw!) (although they think I <br/>\nhave a cold riding the tail end of the whoop, so maybe it wouldn&#39;t be as <br/>\neffective for her.)  I&#39;d feel an attack coming on, spritz a little <br/>\nalbuterol and sometimes the darn thing went away!  (okay, mostly it didn&#39;t <br/>\nbut still, even once is a blessing.)<br/>\n#3.  If they begin to feel a whoop attack coming on OR feel a lot of mucous <br/>\nin their throat, start to swallow.  Swallow a LOT.  You&#39;re trying to get <br/>\nany mucous that&#39;s in your throat down into your stomach before the attack <br/>\nhits.  Calm Swallowing can help limit the number and/or severity of the <br/>\nattacks. (Be prepared for some BIG burps.) (grin)  Drinking SMALL sips of <br/>\nwater can also help clear matters.  Large drinks of cold beverage can bring <br/>\non attacks.  I don&#39;t know why.  So be attentive with this.<br/>\n#4.  Know the puking is normal for whooping cough.  It&#39;s the main <br/>\ndifference between viral bronchitis and the whoop.  If they puke up mucous, <br/>\ncongratulate them for a job well done.  They&#39;re getting better!  (mucous <br/>\nwith the whoop is usually clear and very sticky, sometimes with white bits <br/>\nin it, so don&#39;t discount it just because it&#39;s not &#39;colored&#39;.  It&#39;s just as <br/>\nnasty to have inside.<br/>\n#5.  Teach them to spit and blow their nose in a nice hot steamy <br/>\nshower.  It&#39;s fun, something to do, and sometimes you can clear out a LOT <br/>\nof &#39;stuff&#39; so you don&#39;t suffer so much later on.  It&#39;s also the place to <br/>\nhave the most productive &#39;attacks&#39;, so if they know how to trigger an <br/>\nattack, tell them that&#39;s the best place to do it.<br/>\n#6.  No milk.  No cheese.  No ice cream.  No smoothies.  Please.  I don&#39;t <br/>\nknow why, but I always had the worst symptoms for several hours after <br/>\neating these.  It was hell.<br/>\n#7.  Put a spit towel on the floor next to their bed.  It will let them <br/>\njust lean over after/during an attack and spit out all the nasties they <br/>\ncoughed up.    That way, they can stay in bed.  Make it a doubled-over <br/>\ntowel, though, able to hold liquid.  Needless to say, boxes of their <br/>\nfavorite tissues next to them, so they can clear their noses!<br/>\n#8.  Don&#39;t look like you think they&#39;re about to die.  It always freaked me <br/>\nout that my kids would come running, as if to see if I was still breathing <br/>\nat the end of an attack.  (kind of sweet, but freaked me out!)  Be <br/>\ncomforting, but matter of fact that they can handle it, eh?<br/>\n#9.  Remember that it will end.  (I have maybe one or two attacks a day <br/>\nnow, none at night.)<br/>\n#10  Unless it was really thick, steam didn&#39;t seem to help me much.<br/>\n#11  Herbatussin tea was very soothing.  I also liked the Throat Coat <br/>\ntea.  I don&#39;t think it stopped or limited the attacks, but it was lovely <br/>\nwith honey and made me happier.<br/>\n#12  Don&#39;t do anything to make them laugh.  Laughing can bring on <br/>\nattacks.  Smiling is okay, but laughing hurts when you whoop.<br/>\n<br/>\nThat&#39;s all I can think of at the moment, but if I think of more, I&#39;ll write <br/>\nit in later.<br/>\nGood luck to her and her kids!<br/>\nHeidiWD<br/>\nby the way,<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.whoopingcough.net\">http://www.whoopingcough.net</a><br/>\nis a pretty good site.<br/>\n<br/>\nAt 09:32 PM 3/25/2003 -0800, you wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;Hi<br/>\n&gt;I have been lurking and have a concern. Wondered if anyone has any <br/>\n&gt;experience with this.<br/>\n&gt;I have a friend with a 9 year old unimmunized boy who now has pertussis. <br/>\n&gt;She of course went through the guilt shame routine at the doctors and <br/>\n&gt;although has very thoroughly explored her choice to not immunise she is <br/>\n&gt;feeling some guilt and fear that she could have prevented this. Her son is <br/>\n&gt;highly uncomfortable and now has pneumonia and now her 4 year old looks <br/>\n&gt;and sounds like he too has it. The doctors have told her that the <br/>\n&gt;immunisations have changed greatly over the years so to be safer so she is <br/>\n&gt;interested in revisiting her decision to not immunise. So she is looking <br/>\n&gt;for up to date info as she is pregnant as well and she also wonders if <br/>\n&gt;anybody knows of some things she can do to get her boys through the nights <br/>\n&gt;more comfortably as she is not getting a lot of sleep and these guys are <br/>\n&gt;coughing to the point of vomiting and pain. </span></blockquote></div>","specialLinks":[]},{"userId":93802122,"authorName":"Tim and Maureen","from":"Tim and Maureen &lt;tmthomas@...&gt;","profile":"wisdom0007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"pertussis in unimmunized person","postDate":"1048656754","msgId":62070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYzcwMWMyZjM1OSQxYWQ5OTA2MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":0,"nextInTopic":62077,"prevInTime":62069,"nextInTime":62071,"topicId":62070,"numMessagesInTopic":0,"msgSnippet":"Hi I have been lurking and have a concern. Wondered if anyone has any experience with this. I have a friend with a 9 year old unimmunized boy who now has","messageBody":"<div id=\"ygrps-yiv-1316268708\">Hi <br/>\nI have been lurking and have a concern. Wondered if anyone has any experience with this.<br/>\nI have a friend with a 9 year old unimmunized boy who now has pertussis. She of course went through the guilt shame routine at the doctors and although has very thoroughly explored her choice to not immunise she is feeling some guilt and fear that she could have prevented this. Her son is highly uncomfortable and now has pneumonia and now her 4 year old looks and sounds like he too has it. The doctors have told her that the immunisations have changed greatly over the years so to be safer so she is interested in revisiting her decision to not immunise. So she is looking for up to date info as she is pregnant as well and she also wonders if anybody knows of some things she can do to get her boys through the nights more comfortably as she is not getting a lot of sleep and these guys are coughing to the point of vomiting and pain.<br/>\n<br/>\nMaureen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":62098,"nextTopicId":62038}}