{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"0lYuOGYrBqzl8HgxLl6kw9cRWhflduGVg0U1EA-HgzpBmCVNH2xQsVA9RcTi92CFHcSU8I6iw8KENt-f0Rleurdt4w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw:  Va.House Voices Regret for Eugenics","postDate":"981306455","msgId":15934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZTcwMWMwOGVkYSRmNTllOTc4MCQ3ZTVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":15933,"nextInTime":15935,"topicId":15934,"numMessagesInTopic":0,"msgSnippet":"There have been various discussions lately about the U.S. s sterilization policy, particularly since the son of the man that pushed this policy was resently","messageBody":"<div id=\"ygrps-yiv-335939436\">There have been various discussions lately about the U.S.&#39;s sterilization<br/>\npolicy, particularly since the son of the man that pushed this policy was<br/>\nresently declared president by the supreme court.  Quite frequently the<br/>\nresponse on lists has been &quot;prove it&quot; and when references have been given,<br/>\ndoubt continued.<br/>\n<br/>\nWell, here is a state that is admitting that eurgenics was practiced.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n&gt;<br/>\n&gt; To view the entire article, go to<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.washingtonpost.com/wp-dyn/articles/A19404-2001Feb2.html\">http://www.washingtonpost.com/wp-dyn/articles/A19404-2001Feb2.html</a><br/>\n&gt;<br/>\n&gt; Va. House Voices Regret for Eugenics<br/>\n&gt;<br/>\n&gt;   RICHMOND, Feb. 2 -- The House of Delegates voted today to express regret<br/>\n&gt; for Virginia&#39; s policies of selective breeding during the 20th century,<br/>\n&gt; including the forced sterilization of 8,000 mostly poor, uneducated men<br/>\nand<br/>\n&gt; women for supposed hereditary &quot;defects.&quot;<br/>\n&gt;<br/>\n&gt;   The 85 to 10 vote came after some of the hundreds of victims of<br/>\nVirginia&#39;s<br/>\n&gt; forced sterilizations spoke out in television and newspaper reports<br/>\n&gt; spotlighting the state&#39;s leading role in a movement called eugenics. It<br/>\n&gt; sought to use government power to breed away such chronic social problems<br/>\nas<br/>\n&gt; poverty, immorality, crime, addiction and ignorance.<br/>\n&gt;<br/>\n&gt;   The resolution, which requires the approval of the state Senate, would<br/>\nmake<br/>\n&gt; Virginia the first among the 30 states that once had forced sterilization<br/>\n&gt; laws to formally express regret. The resolution passed today would declare<br/>\n&gt; &quot;profound regret over the Commonwealth&#39;s role in the eugenics movement in<br/>\n&gt; this country and the incalculable human damage done in the name of<br/>\neugenics.&quot;<br/>\n&gt;<br/>\n&gt;   It was a remarkable moment for a state whose leaders prefer to talk<br/>\nabout<br/>\n&gt; Virginia&#39;s role in helping found the nation -- and lately, its high-tech<br/>\n&gt; dominance -- instead of its prominent role in such historic evils as<br/>\nslavery,<br/>\n&gt; segregation and forced sterilizations.<br/>\n&gt;<br/>\n&gt;   Even today&#39;s resolution was changed to remove the word &quot;apology.&quot; Some<br/>\n&gt; House members, including Del. Harry J. Parrish (R-Manassas), wanted to go<br/>\n&gt; further and remove the passage expressing regret, though he called the<br/>\n&gt; resolution&#39;s intentions admirable.<br/>\n&gt;<br/>\n&gt;   &quot;We&#39;re offering regrets for something that was done legally,&quot; Parrish<br/>\nsaid.<br/>\n&gt; &quot;It&#39;s improper for us to now second-guess the General Assembly then.&quot;<br/>\n&gt;<br/>\n&gt;   Virginia officials and academics had a leading role in the American<br/>\n&gt; eugenics movement, which paralleled the Nazi drive for a super race. The<br/>\nU.S.<br/>\n&gt; Holocaust Memorial Museum has requested documents from Virginia as it<br/>\n&gt; prepares an exhibit in 2004 tentatively called &quot;Nazi Race Science.&quot;<br/>\n&gt;<br/>\n&gt;   The eugenics movement began in the United States at the beginning of the<br/>\n&gt; 20th century. Indiana passed the nation&#39;s first sterilization law based on<br/>\n&gt; eugenics in 1907. Over the next seven decades, government hospitals<br/>\n&gt; sterilized 60,000 men and women. Only California, with 20,000<br/>\nsterilizations,<br/>\n&gt; had more than Virginia.<br/>\n&gt;<br/>\n&gt;   Virginia passed its Eugenical Sterilization Act in 1924 -- which<br/>\ntargeted<br/>\n&gt; &quot;socially inadequate offspring&quot; -- on the same day it passed the Racial<br/>\n&gt; Integrity Act prohibiting marriage between whites and nonwhites. Both grew<br/>\n&gt; out of eugenicists&#39; drive for what they deemed a superior stock of humans.<br/>\n&gt;<br/>\n&gt;   &quot;Virginia eugenicists saw themselves as the vanguard of the future,&quot;<br/>\nsaid<br/>\n&gt; Gregory M. Dorr, a University of Alabama historian who studied Virginia&#39;s<br/>\n&gt; role in the eugenics movement.<br/>\n&gt;<br/>\n&gt;   More than half of Virginia&#39;s sterilizations happened at the Virginia<br/>\nColony<br/>\n&gt; for Epileptics and the Feebleminded in Lynchburg, though others happened<br/>\nat<br/>\n&gt; hospitals in Petersburg, Staunton, Williamsburg and Marion. Most victims<br/>\nwere<br/>\n&gt; white, but some African Americans and Indians also were sterilized,<br/>\n&gt; historians say.<br/>\n&gt;<br/>\n&gt;   &quot;People were sterilized not because they were feebleminded, but because<br/>\n&gt; they were &#39;poor white trash,&#39; &quot; said Steven Selden, a University of<br/>\nMaryland<br/>\n&gt; professor who wrote a book on eugenics that was published last year.<br/>\n&gt;<br/>\n&gt;   The U.S. Supreme Court upheld forced sterilization at the Lynchburg<br/>\n&gt; facility in a case involving a woman named Carrie Buck, who had become<br/>\n&gt; pregnant as a teenager. In allowing her sterilization in 1927, Chief<br/>\nJustice<br/>\n&gt; Oliver Wendell Holmes assessed Buck, her mother and her daughter, then<br/>\n&gt; declared, &quot;Three generations of imbeciles are enough.&quot;<br/>\n&gt;<br/>\n&gt;   A surge of sterilizations followed nationwide, tapering off when Nazi<br/>\n&gt; brutality in World War II turned public opinion against eugenics.<br/>\n&gt;<br/>\n&gt;   &quot;The Nazis took great comfort from the eugenics movement in America,&quot;<br/>\nsaid<br/>\n&gt; Paul A. Lombardo, a University of Virginia historian.<br/>\n&gt;<br/>\n&gt;   Forced sterilizations continued on a very limited basis in Virginia<br/>\nuntil<br/>\n&gt; 1979. Today&#39;s resolution calls on society to &quot;reject absolutely any such<br/>\n&gt; abhorrent pseudo-scientific movement in the future.&quot;<br/>\n&gt;<br/>\n&gt;   State lawmakers urged particular vigilance at a time when scientists are<br/>\n&gt; decoding the human genome and making possible far more profound<br/>\nmanipulation &gt; of genetic traits than envisioned by eugenicists during the<br/>\nlast century.<br/>\n&gt;<br/>\n&gt;   &quot;We&#39;re tampering with DNA, with genes. And scientifically we&#39;re greatly<br/>\n&gt; advanced, but morally we have a problem,&quot; warned Del. Mitchell Van Yahres<br/>\n&gt; (D-Charlottesville), the resolution&#39;s sponsor. &quot;We don&#39;t want to go down<br/>\nthat<br/>\n&gt; road again.&quot;<br/>\n&gt;<br/>\n&gt;   A key supporter of House Resolution 607 was the chamber&#39;s top<br/>\nRepublican,<br/>\n&gt; Speaker S. Vance Wilkins Jr., a veteran lawmaker from the small town of<br/>\n&gt; Amherst, just north of Lynchburg. He helped the resolution get past a<br/>\n&gt; reluctant committee this week.<br/>\n&gt;<br/>\n&gt;   &quot;It&#39;s the right thing to do,&quot; said Wilkins before today&#39;s session.<br/>\n&quot;They&#39;re<br/>\n&gt; facts of history . . . and we shouldn&#39;t try to cover them up.&quot;<br/>\n&gt;<br/>\n&gt;   Claude A. Allen, Virginia&#39;s secretary of health and human resources,<br/>\nsaid<br/>\n&gt; Gov. James S. Gilmore III&#39;s administration had taken no position on the<br/>\n&gt; eugenics resolution and is seeking a legal opinion on the threat of civil<br/>\n&gt; liability for the state before taking a stand. He said forced<br/>\nsterilizations<br/>\n&gt; &quot;clearly were atrocious.&quot;<br/>\n&gt;<br/>\n&gt;   One Virginia victim of sterilization was Jesse Meadows. He was sent to<br/>\nthe<br/>\n&gt; Lynchburg colony in 1940 after his mother died and his father remarried.<br/>\n&gt; Meadows was just 17. More than 60 years later, he can remember the names<br/>\nand<br/>\n&gt; faces of the two doctors and the nurse who performed a vasectomy against<br/>\nhis<br/>\n&gt; will.<br/>\n&gt;<br/>\n&gt;   Meadows married after leaving the facility and made a living as a house<br/>\n&gt; painter, but he could never have children. Now 78, he lives alone in<br/>\n&gt; Lynchburg, in the same neighborhood as several others who were sterilized<br/>\nat<br/>\n&gt; the colony there.<br/>\n&gt;<br/>\n&gt; &quot;They ought to apologize for doing something like that, treating them like<br/>\n&gt; animals,&quot; Meadows said. &quot;They ruined a lot of people&#39;s lives.&quot; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":15836,"nextTopicId":15935}}