{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1665204,"authorName":"Bill Ellis","from":"Bill Ellis &lt;tranet@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Holt and Illich","postDate":"1189885655","msgId":30541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxNTBlM2I3OGQzNzI1ZmU3MDU1YjdiYjlkYTFiMzM4QHJhbmdlbGV5Lm9yZz4=","inReplyToHeader":"PDExODk4NTkzODYuMjQ0Ljc2NzkyLm00MEB5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDExODk4NTkzODYuMjQ0Ljc2NzkyLm00MEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":30540,"nextInTime":30542,"topicId":30541,"numMessagesInTopic":0,"msgSnippet":"... BE: Yes, Sandra, John Holt deserves much credit for making Homeschooling popular. But John was a preceded by Ivan Illich with whom he became a close ","messageBody":"<div id=\"ygrps-yiv-575305828\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;     Posted by: &quot;Sandra Dodd&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a> sandralynndodd<br/>\n&gt;    &quot;If one is lucky, a solitary fantasy can  totally transform one <br/>\n&gt; million realities.&quot;<br/>\n&gt; ~Maya Angelou~<br/>\n&gt;<br/>\n&gt; ===================<br/>\n&gt;<br/>\n&gt; That came from a quote of the day list:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dailyquote@...\">dailyquote@...</a><br/>\n&gt;<br/>\n&gt; It reminded me of John Holt. ... [snip]<br/>\n<br/>\n </span></blockquote>BE:<br/>\nYes, Sandra, John Holt deserves much credit for making Homeschooling <br/>\npopular.<br/>\nBut John was a preceded by Ivan Illich with whom he became a close <br/>\ncolleague.<br/>\nBoth were driven by their concern that education trapped society into <br/>\nthe status quo.<br/>\nIn 1970 Ivan wrote &quot;Deschooling Society&quot; the message of which has been <br/>\nlargely lost by by modern homeschoolers.<br/>\nBelow is a review of that seminal book.  I wrote it on Ivan&#39;s death. It <br/>\nmay have some relevance to you valuable work.<br/>\n<br/>\nBill Ellis<br/>\n      <a rel=\"nofollow\" target=\"_blank\" href=\"http://ezinearticles.com/?expert=Bill_Ellis\">http://ezinearticles.com/?expert=Bill_Ellis</a><br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Review: Illich on &quot;Deschooling Society:<br/>\n&gt; By Bill Ellis<br/>\n&gt;<br/>\n&gt; Before I read of Ivan Illich&#39;s death I had started to write a <br/>\n&gt; commentary on his contributions and ideas of &quot;Deschooling Society.&quot; I <br/>\n&gt; have felt that many homeschoolers and even many Illich fans miss the <br/>\n&gt; message he was trying to deliver. Perhaps my own interpretation is <br/>\n&gt; enhanced by the numerous opportunities I had to talk with him, hear <br/>\n&gt; his lectures, and visit with his &quot;traveling crap game&quot; that met in <br/>\n&gt; various universities around the globe. Or it may be that his way of <br/>\n&gt; developing an idea was to stimulate the listener&#39;s own thought, rather <br/>\n&gt; than to lay an idea out so clearly that every one captured exactly the <br/>\n&gt; same message. Now that Ivan has passed on I am driven to make this <br/>\n&gt; piece a bit longer than it was originally drafted.<br/>\n&gt;<br/>\n&gt; &quot;Deschooling Society&quot; was more about society than about schools. <br/>\n&gt; Society needed deschooling because it was a mime of the school system <br/>\n&gt; that it engendered and that engendered it. In our current society <br/>\n&gt; individuals are expected to work in dull and stultifying jobs for <br/>\n&gt; future rewards. This they are trained to do in schools. They go to <br/>\n&gt; school so that they can get a job to work for future rewards.<br/>\n&gt;<br/>\n&gt; By deschooling illich did not mean taking schooling into the home, nor <br/>\n&gt; did he mean &quot;free schools&quot; in which a curricula was set by the <br/>\n&gt; students. Schooling of any kind that limited a person&#39;s capacity and <br/>\n&gt; desire to self-learn was detrimental to the living a full life by that <br/>\n&gt; person.<br/>\n&gt;<br/>\n&gt; All life, according to Illich, should be &quot;convivial.&quot; That is it <br/>\n&gt; should be lived in joyous collaboration with friends and colleagues. <br/>\n&gt; Learning and work alike should be fun and fulfilling. They should be <br/>\n&gt; entered into as, and not differentiated from, play and recreation. A <br/>\n&gt; society that does not create that kind of convivial learning and <br/>\n&gt; living is not living up to, nor fulfilling the potential of, humanity.<br/>\n&gt;<br/>\n&gt; In later works, like &quot;Tools for Conviviality,&quot; and &quot;Shadow Work,&quot; <br/>\n&gt; Illich developed further the theme of what he meant by living the good <br/>\n&gt; life. He took &quot;good&quot; in both of its connotations, -- good as moral, <br/>\n&gt; and good as a pleasing. &quot;Vernacular&quot; was the word Illich used to <br/>\n&gt; express the good life. The vernacular is the simple, the local, the <br/>\n&gt; communal. Every human and every community has its own natural concept <br/>\n&gt; of the vernacular. It is wrapped up in being a human. It is what a <br/>\n&gt; person can do themselves in the place the are at the time it is <br/>\n&gt; without dependence of external assistance.<br/>\n&gt;<br/>\n&gt; The bicycle was the hardware example Illich often used to exemplify <br/>\n&gt; the vernacular. The bicycle extends one&#39;s own capability and efforts <br/>\n&gt; for transportation. It needs no massive outside system beyond that its <br/>\n&gt; operator&#39;s control. The automobile, on the other hand, is not only a <br/>\n&gt; complex apparatus requires a complex outside system, but it also <br/>\n&gt; requires more work and effort than it produces in transportation. If <br/>\n&gt; you take into account all the hours you spend to buy a car, to <br/>\n&gt; purchase gas and tires, to pay taxes for the road, to insure and <br/>\n&gt; license it, to clean up its pollution, and pay for all of the other <br/>\n&gt; costs your rate of travel is less than that of a bicycle, and that <br/>\n&gt; doesn&#39;t count either the hours, the costs, or the frustration spent in <br/>\n&gt; traffic jams and accidents.<br/>\n&gt;<br/>\n&gt; In &quot;Medical Nemesis&quot; took the same concept to the medical system <br/>\n&gt; showing that not only did the medical not cure ills but in created <br/>\n&gt; them. In every aspects of our lives conviviality and the vernacular <br/>\n&gt; have been overwhelmed and diminished by what Illich called the <br/>\n&gt; &quot;disabling professions.&quot; The law professions have increased crime, the <br/>\n&gt; professional economists have created scarcity and poverty, the <br/>\n&gt; teaching profession has dumbed us down, the farming profession has <br/>\n&gt; incrased hunger. With this loss of the vernacular has come the loss of <br/>\n&gt; the family and the community. The single goal of humans has become to <br/>\n&gt; &quot;make it&quot; in a materialistic global economy.<br/>\n&gt;<br/>\n&gt; In his most recent essays Illich has brought his concepts to a fitting <br/>\n&gt; climax. An essay &quot;The Cultivation of Conspiracy&quot; in &quot;The Challenge of <br/>\n&gt; Ivan Illich&quot; a 2002 book of a collection of essays by many of his <br/>\n&gt; colleagues edited by Lee Honacki and Carl Mitcham. This essay <br/>\n&gt; discusses friendship. The friendship Illich writes of is not just that <br/>\n&gt; of being kind and cooperative to you neighbors. It is a deeper <br/>\n&gt; &#39;conspiriatio&#39;. As in much of his writing Illich goes to great length <br/>\n&gt; to explore the original meaning and related ideas and actions related <br/>\n&gt; to the word. &quot;Conspiriatio&quot; is breathing together. But breathing is <br/>\n&gt; not merely expelling air. It is about the breath of life -- the soul. <br/>\n&gt; &#39;Conspiriatio&#39; is the melding of one&#39;s inner being with others. It is <br/>\n&gt; best exemplified by the wedding kiss that symbolizes, or more exactly <br/>\n&gt; is, the combining of two souls. It is more than the ceremony or the <br/>\n&gt; license of marriage. It is above physical love. It is the unifying of <br/>\n&gt; two beings. This conspiratio, or welding of souls, (although Illich, a <br/>\n&gt; former priest, doesn&#39;t us the word soul) is the root of the vernacular <br/>\n&gt; and of the convivial.<br/>\n&gt;<br/>\n&gt; This brief extension of Illich&#39;s concepts is meant only to put his <br/>\n&gt; book and the idea of deschooling society into context. Homeschooling <br/>\n&gt; grew from the ideas of Illich, Holt and others. During the 1970s a few <br/>\n&gt; scattered families broke away from government schools and started <br/>\n&gt; homeschooling. By 1980 there were some 10,000 to 20,000 such families <br/>\n&gt; homeschooling alone. As the numbers grew these scattered home schools <br/>\n&gt; started linking up, establishing organizations to provide resources, <br/>\n&gt; and to take on special tasks like the legal defence of homeschooling. <br/>\n&gt; By 1990 the cells of homeschooler had become a soup and ad hoc linking <br/>\n&gt; became normal. &quot;Homeschool support groups&quot; spontaneously <br/>\n&gt; self-organized in many communities and on the Internet. By 2000 there <br/>\n&gt; was almost no Ameican community that did not have a Homeschool support <br/>\n&gt; group.<br/>\n&gt;<br/>\n&gt; But, in the practical day to day struggle to homeschool their own <br/>\n&gt; children many, if not most, homeschoolers left behind the social <br/>\n&gt; idealism of Illich and Holt. Parents who were imbued with the concept <br/>\n&gt; of schooling could not really let their children be free to learn <br/>\n&gt; whatever the community and nature offered them. They had been guided <br/>\n&gt; by their schools and parents and they believed it only natural to be <br/>\n&gt; the guides and authorities for their children. They looked to <br/>\n&gt; &quot;experts&quot; to provide school texts and curricula. And exchange <br/>\n&gt; information with other parents on how to keep their children&#39;s&gt; noses <br/>\n&gt; to the books. Their universal cry is for government to &quot;just leave us <br/>\n&gt; alone.&quot; They argued that they have &quot;parental rights&quot; to raise their <br/>\n&gt; children as they wish.<br/>\n&gt;<br/>\n&gt; As homeschooling is becoming accepted by the mainstream it is also <br/>\n&gt; looking again at it roots and recognizing that &quot;homeschooling alone&quot; <br/>\n&gt; is not enough. Conviviality and the vernacular are arising within the <br/>\n&gt; homeschool support groups. The goal of A Coalition for Self-Learning <br/>\n&gt; is to bring the concept of deschooling society into real being. We <br/>\n&gt; seen this transformation as being necessary for the survival of <br/>\n&gt; humanity. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":30535,"nextTopicId":30554}}