{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] thumb sucking/nursing","postDate":"1056119953","msgId":74995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdiLjEzYzA5Zjk2LjJjMjQ3NjkxQGFvbC5jb20+"},"prevInTopic":74959,"nextInTopic":0,"prevInTime":74994,"nextInTime":74996,"topicId":74945,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/20/2003 12:24:48 AM Eastern Daylight Time, ... You re addressing the wrong crowd here with that question. Mostly women? You won t get the","messageBody":"<div id=\"ygrps-yiv-1108472610\">In a message dated 6/20/2003 12:24:48 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What IS the hang up with breasts in <br/>\n&gt; this country?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>You&#39;re addressing the wrong crowd here with that question. Mostly women? You <br/>\nwon&#39;t get the answers you&#39;re looking for! &lt;G&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] thumb sucking/nursing","postDate":"1056093782","msgId":74959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3ZC4xY2MyOGU0Ny4yYzI0MTA1NkBhb2wuY29tPg=="},"prevInTopic":74950,"nextInTopic":74995,"prevInTime":74958,"nextInTime":74960,"topicId":74945,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/19/2003 11:44:40 PM Mountain Daylight Time, ... And it goes again back to the parallel to unschooling. People DO say I wish I had taken","messageBody":"<div id=\"ygrps-yiv-1920757348\">In a message dated 6/19/2003 11:44:40 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joylyn@...\">joylyn@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have spoken to many many women about breastfeeding. <br/>\n&gt; I have never heard a woman say they wish they would have weaned their <br/>\n&gt; child earlier.  I have heard many women say that they wish they nursed <br/>\n&gt; longer, especially those whose children nursed two or fewer years.  As <br/>\n&gt; someone used to say--things that make you go hmmmm.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>And it goes again back to the parallel to unschooling.<br/>\n<br/>\nPeople DO say &quot;I wish I had taken my kids out of school sooner,&quot; and then &quot;I <br/>\nwish I had unschooled sooner,&quot; but they don&#39;t say &quot;I wish I had stalled just a <br/>\nFEW more years with structure before I unschooled.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":118406848,"authorName":"Joylyn","from":"Joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] thumb sucking/nursing","postDate":"1056087450","msgId":74950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFRjI5RDlBLjYwNTA5MDFAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGJjdTIzbCs3dXVvQGVHcm91cHMuY29tPg=="},"prevInTopic":74945,"nextInTopic":74959,"prevInTime":74949,"nextInTime":74951,"topicId":74945,"numMessagesInTopic":0,"msgSnippet":"... I should have probably put in Social Factors in the list of why I think weaning happens before humans would naturally wean.  Society factors into our lives","messageBody":"<div id=\"ygrps-yiv-277078097\">gruvystarchild wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;I disagree and so do a lot of experts on long term breastfeeding<br/>\n&gt; and<br/>\n&gt; natural weaning. I don&#39;t think any child who nurses less than about<br/>\n&gt; 2<br/>\n&gt; 1/2 years naturally weans. Instead, the weaning involves a bunch of<br/>\n&gt; factors, including mom working, the use of artificial nipples<br/>\n&gt; (bottles<br/>\n&gt; and/or pacifiers), people in the family saying the child is &quot;too<br/>\n&gt; old&quot;,<br/>\n&gt; etc. &#39;<br/>\n<br/>\n </span></blockquote>I should have probably put in Social Factors in the list of why I think <br/>\nweaning happens before humans would naturally wean.  Society factors <br/>\ninto our lives in so many ways, and I think sometimes unless we make a <br/>\nhuge effort to be aware of how it does effect us we really can&#39;t on a <br/>\nconscious level go against it.  Children who are toddlers are supposed <br/>\nto act a certain way, be independent, etc.  Even the way we nurse <br/>\nnewborns in this society is different then how people nurse newborns in <br/>\nother societies.  In our society we are taught that babies should nurse <br/>\n10-15 minutes on each side every 2-3 hours (IF they are lucky and dont&#39; <br/>\nfollow horrible advice to feed less or on a strict schedule.)  In other <br/>\nsocieties where mommies hold babies all the time, the baby will nurse <br/>\n1-2 minutes every 5 minutes.  Constantly.  Around the clock.  The mother <br/>\ndoes not put the baby down.  If mother needs to do something, the baby <br/>\nis in the sling right next to her.  Mothers don&#39;t worry about having a <br/>\nfew minutes to take a shower or cook dinner (most societies have <br/>\nprohibitions against moms doing any chores or cooking in the first month <br/>\nor two anyway, mom simply takes care of her personal needs and gets to <br/>\nknow her baby and nurses).  Our society wants our babies to sleep <br/>\nthrough the night and even if a mother is aware that sleeping through <br/>\nthe night is not biologically good for the newborn, or even the older <br/>\nbaby, there is still the pressure as people say &quot;so how&#39;s the baby <br/>\nsleeping?&quot;  Many new parents have rooms for their babies (even if they <br/>\nend up sleeping with their child and not using the crib).  In some <br/>\ncultures the idea that a mother would sleep in a different room or even <br/>\na few feet away from their baby, and that men find breasts sexy--those <br/>\nideas are foreign and laughable.  Some sociologists showed video clips <br/>\nof women from the US taking care of their babies to women who were still <br/>\nbasically  hunters and gatherers and the mothers were appalled at how <br/>\nthe US mothers seemed to ignore the baby&#39;s cries and needs.  Even for <br/>\nthose of us who go against our society by unschooling our children or <br/>\nnursing past a year are, cannot help but be, influenced by society.  <br/>\n<br/>\nToddlers in the US are busy people.  I&#39;m often amazed at how busy.  If <br/>\nthere are older siblings they are even more busy.  There are various <br/>\nclasses, gymnastics, swimming, etc.  Babies and toddlers take mommy and <br/>\nme swimming, gymnastics, etc. classes, and go to play groups, etc.  I <br/>\nused to think, right before a vacation--great, we can spend lots of <br/>\nquality time together, Janene (or Lexie) can nurse more.  But the <br/>\nreality of the vacation was that we were so busy doing fun things, as a <br/>\nfamily, that there didn&#39;t seem to be enough time to sit and cuddle and <br/>\nnurse.  Even at night, it seemed we nursed less because we were so busy <br/>\nand she was so tired that sleep came easily and quickly.  I think we can <br/>\nget caught up in the go go go routine and forget that toddlers <br/>\nespecially need mommy sitting and still to cuzzle (our word for <br/>\nnursing).  That is why I think often our children wean earlier--our <br/>\nlives are busy.  This is not necessarily a bad thing--nursing for 18 <br/>\nmonths, or two years is great in our society and while I do consider it <br/>\npremature weaning, I also think it&#39;s a great thing, to have nursed that <br/>\nlong and provided milk and comfort to a child for that length of time.  <br/>\n<br/>\nI also think there are times when it is OK for a mom to encourage <br/>\nbreastfeeding to continue.  I lost a baby while Lexie was still nursing, <br/>\nand I encouraged her to continue nursing after that loss.  She might <br/>\nhave weaned during Janene&#39;s pregnancy, but I realized that if I had also <br/>\nlost Janene, it would have been even harder if Lexie had been weaned, so <br/>\nI continued to encourage her to nurse, and with the promise of milk when <br/>\nthe baby was born, she was willing to nurse enough to keep up the skill <br/>\nuntil Janene was born.  Then she was THRILLED with the wonderful new <br/>\nmilk supply and kept up for that reason!  <br/>\n<br/>\nOne more thing, on Tandem nursing.  I did tandem nurse, and I&#39;ve given <br/>\ntalks on the subject, but I do not think it is normal for our species to <br/>\ntandem nurse.  Our bodies are not made to nurse two children who are of <br/>\ntwo different ages (it is normal to nurse twins or triplets).  The <br/>\nnormal way of things, biologically, is for moms to not ovulate until a <br/>\nnursing baby is a year or so old (14 months is the average).  This <br/>\nnaturally spaces babies out.  Historically (or should I say <br/>\npre-historically) if a mom got pregnant while she still had a young baby <br/>\nor toddler, she would not continue the pregnancy.  In others, the <br/>\ntoddler would be weaned.  It makes sense that if food is not plentiful <br/>\nto take care of the baby which is alive first.  But in our society, food <br/>\nis plentiful.  So we tandem nurse.  I don&#39;t think there is anything <br/>\nwrong with it, I just don&#39;t think it&#39;s our biological norm.  That said, <br/>\nI wouldn&#39;t do anything different.  It was good to tandem, good for me <br/>\nand my daughters.  I am sad I am no longer lactating.  <br/>\n<br/>\nOne last thing... I have spoken to many many women about breastfeeding. <br/>\n I have never heard a woman say they wish they would have weaned their <br/>\nchild earlier.  I have heard many women say that they wish they nursed <br/>\nlonger, especially those whose children nursed two or fewer years.  As <br/>\nsomeone used to say--things that make you go hmmmm.<br/>\n<br/>\nA great book to read on this subject is our babies ourselves.  Meridith <br/>\nSmall I think.  Excellent book.<br/>\n<br/>\nJoylyn<br/>\n<br/>\nJoylyn</div>","specialLinks":[]},{"userId":150527288,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"thumb sucking/nursing","postDate":"1056082869","msgId":74945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjdTIzbCs3dXVvQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":74950,"prevInTime":74943,"nextInTime":74946,"topicId":74945,"numMessagesInTopic":0,"msgSnippet":"I disagree and so do a lot of experts on long term breastfeeding and natural weaning. I don t think any child who nurses less than about 2 1/2 years naturally","messageBody":"<div id=\"ygrps-yiv-705130754\">&quot;I disagree and so do a lot of experts on long term breastfeeding <br/>\nand <br/>\nnatural weaning. I don&#39;t think any child who nurses less than about <br/>\n2 <br/>\n1/2 years naturally weans. Instead, the weaning involves a bunch of <br/>\nfactors, including mom working, the use of artificial nipples <br/>\n(bottles <br/>\nand/or pacifiers), people in the family saying the child is &quot;too <br/>\nold&quot;, <br/>\netc. &#39;<br/>\n<br/>\nWhile I totally agree that toddlers nursing is natural and <br/>\ndesirable, I also believe that some will wean before 2.5 quite <br/>\nhappily on their own.<br/>\nOut of four children, one weaned at 19 months and one at 2 y.o. <br/>\nwithout anything but on demand feedings from birth.<br/>\nWith Jared (weaned at 19mos) I often wonder if I inadvertantly <br/>\nsent &quot;weaning messages&quot; to him. I wasn&#39;t quite as aware then, but <br/>\nwith Sierra (weaned at 2) I was all too aware and she still weaned <br/>\nherself. It was NOT a sudden thing (I would assume that is a nursing <br/>\nstrike), it was a slow and steady lessening of feedings and finally <br/>\nonly nursing morning and night.<br/>\nShe truly weaned herself, of that I have no doubt. Jared I&#39;m not <br/>\ntotally positive about, poor Trevor had weaning forced on him and <br/>\ndear Jalen is nursing like mad at 2.5 y.o.!! I don&#39;t think he&#39;ll <br/>\never lose interest. <br/>\nI love nursing long term, but I sure would love to sleep all night. <br/>\nugh. He&#39;s very needy and intense, but oh-so-sweet.<br/>\n<br/>\nI do think it&#39;s perfectly natural for some children to wean before <br/>\n2.5, but I imagine the messages sent to most mothers and children <br/>\nmake weaning happen before it would naturally, if we lived in a <br/>\nsociety that wasn&#39;t so hung up on boobs.<br/>\n<br/>\nSpeaking of boobs, can you even imagine pumping milk from a cow to <br/>\nbottle feed her baby!!! Sheesh. What IS the hang up with breasts in <br/>\nthis country?</div>","specialLinks":[]}],"prevTopicId":74820,"nextTopicId":74988}}