{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] I need answers","postDate":"1020099090","msgId":36419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwLjI1MGI2YzdmLjI5ZmVkNDEyQGFvbC5jb20+"},"prevInTopic":36157,"nextInTopic":0,"prevInTime":36418,"nextInTime":36420,"topicId":36157,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/26/2002 2:49:16 PM Pacific Daylight Time, ... Maybe nobody here has to deal with the kinds of difficult laws you have in Tennessee. I know","messageBody":"<div id=\"ygrps-yiv-414769181\">In a message dated 4/26/2002 2:49:16 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ninnyridge03@...\">ninnyridge03@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know he can ace most tests that they give although next year we will be <br/>\n&gt; testing through the school we go through instead of the state.  I&#39;m just <br/>\n&gt; wondering how to handle all the paper work that will be required during the <br/>\n&gt; course of the year.  I know some states don&#39;t have such strict guidelines <br/>\n&gt; for homeschoolers but maybe some of you have dealt with this and can give <br/>\n&gt; me some advice.<br/>\n&gt; Thanks again for the support and encourgagement I get from the group!<br/>\n<br/>\n </span></blockquote>Maybe nobody here has to deal with the kinds of difficult laws you have in <br/>\nTennessee. I know I don&#39;t. I&#39;m really sorry that I can&#39;t offer you much <br/>\nadvice on how to deal with testing and paperwork. I know that in Tennessee <br/>\nthere is a third option of signing up with a church related school as a <br/>\n&quot;satellite.&quot; Maybe there are churches - check out the Quakers/Friends church <br/>\n- that would be more amenable to less paperwork.<br/>\n<br/>\nIt is hard to help you know how to handle it - I don&#39;t have a clue what kind <br/>\nof paperwork they&#39;d want. I do have a sort of &quot;recordkeeping&quot; idea for <br/>\nunschoolers and maybe you could utilize it and then transform it into what <br/>\nthey want.<br/>\n<br/>\nThe idea is that you list &quot;real&quot; things -- like: &quot;reading, writing, watching, <br/>\nlistening, talking, going, making, doing, etc.&quot; Then you observe the kids and <br/>\nrecord what&#39;s going on under those &quot;real&quot; categories. So you&#39;re not recording <br/>\nthings under school subjects like &quot;English,&quot; &quot;History,&quot; &quot;Science,&quot; etc., but <br/>\njust recording what is really happening. It doesn&#39;t really matter where you <br/>\nrecord them - the point is that you are keeping records but not having to <br/>\nconstantly think in terms of school subjects. Also, it encourages you to <br/>\nthink of everything as learning - not just school subjects. You can do a <br/>\nrecord sheet for each day and then, at the end of a month, you can go through <br/>\nthem and categorize into the subjects required by your official paperwork. <br/>\n<br/>\nFor example, if you have a discussion about a movie - say it is about the <br/>\nmusical, &quot;Annie,&quot; you might talk about the time period, what was happening <br/>\nduring the depression, maybe something about who was president, whatever <br/>\nhappens to come up during the discussion about the movie. So -- you could <br/>\nrecord that you watched the movie, Annie, under &quot;watching&quot;. You could also <br/>\nrecord, &quot;Discussed Great Depression era,&quot; under &quot;talking.&quot; It is also a <br/>\nmusical and so you could put it under &quot;listening.&quot;  <br/>\n<br/>\nLater, at the end of the month, if you need to put something under &quot;History,&quot; <br/>\nthen you can include that discussion about the depression or about presidents <br/>\nor whatever came up. If you need something to put under &quot;Music&quot; then you can <br/>\nput &quot;study of various musical genres, including musical theater..&quot;.  The KID <br/>\ndoesn&#39;t have to know that you are doing this kind of listing things under <br/>\nschool subject headings - I would really NOT like my kids to think in those <br/>\nterms. They can just unschool and not have to be aware of what you&#39;re having <br/>\nto do to fulfill stupid state laws.<br/>\n<br/>\nI hope this idea is useful - maybe it will help you come up with something <br/>\nthat works for you.<br/>\n<br/>\n--pamS<br/>\nSome of what is said here may challenge you, shock you, disturb you, or seem <br/>\nharsh. But remember that people are offering it to be helpful and what feels <br/>\nuncomfortable to you might be just what someone else needed to hear.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":58541700,"authorName":"Betty Holder","from":"&quot;Betty Holder&quot; &lt;ninnyridge03@...&gt;","profile":"ninnyridge03","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I need answers","postDate":"1019868273","msgId":36157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzQwMWMxZWQ4NCRiNWZjZTNjMCRhNjlhZDU0M0BqMXUxdTI+"},"prevInTopic":0,"nextInTopic":36419,"prevInTime":36156,"nextInTime":36158,"topicId":36157,"numMessagesInTopic":0,"msgSnippet":"I live in TN and the state requires testing (by the state) for homeschoolers.  We were not required to test this year but we did last year and will be next","messageBody":"<div id=\"ygrps-yiv-1285807643\">I live in TN and the state requires testing (by the state) for homeschoolers.  We were not required to test this year but we did last year and will be next year. It also requires parents to have a college degree to homeschool the high school years.  If no degree is possessed (which we don&#39;t) then we must go through an *umbrella* (I think they call it) school.  We are approaching high school in the upcoming year and have a Christian school in the town near us to work through.  My question is, Do any of you have these requirements?  I was just wondering how to deal with the grades that must be submitted to the school ever so often.  We don&#39;t do much paper and book work except Math and occasionally grammar.  <br/>\nI know he can ace most tests that they give although next year we will be testing through the school we go through instead of the state.  I&#39;m just wondering how to handle all the paper work that will be required during the course of the year.  I know some states don&#39;t have such strict guidelines for homeschoolers but maybe some of you have dealt with this and can give me some advice.<br/>\nThanks again for the support and encourgagement I get from the group!<br/>\nBetty in TN<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":36415,"nextTopicId":36332}}