{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":66835036,"authorName":"RJHill241@aol.com","from":"RJHill241@...","profile":"rjhill241","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] new member intro and beliefs","postDate":"1064246865","msgId":81207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1OS4yNGVhM2YwZC4yY2EwNzg1MUBhb2wuY29tPg=="},"prevInTopic":81205,"nextInTopic":0,"prevInTime":81206,"nextInTime":81208,"topicId":81200,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 8:58:18 AM Pacific Daylight Time, ... Ditto. I hate when my Corporeal mind forgets about my Ethereal self. Then it s like the","messageBody":"<div id=\"ygrps-yiv-1924025419\">In a message dated 9/22/03 8:58:18 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:holly@...\">holly@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My beliefs are more clear in my heart than my head.<br/>\n<br/>\n </span></blockquote>Ditto. I hate when my Corporeal mind forgets about my Ethereal self. Then <br/>\nit&#39;s like the Ethereal self thwaps the back of my earthly head, causing my <br/>\nCorporeal mind to say, &quot;Hey! Oh yeeeaaahhh, I forgot.&quot; ;-)<br/>\n<br/>\nA little cosmic humor!<br/>\n<br/>\nRhonda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] new member intro and beliefs","postDate":"1064244856","msgId":81203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5Q0I4RjAyLUVEMTItMTFENy1BQjBELTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDNGNkYwMTZCLjlGRThGNUMxQHNoYWx0emZhcm0uY29tPg=="},"prevInTopic":81202,"nextInTopic":81205,"prevInTime":81202,"nextInTime":81204,"topicId":81200,"numMessagesInTopic":0,"msgSnippet":"... LOL - although most of the ideas don t appeal to me, I do LIKE the overall attitude expressed in that post, a LOT. When people can say, I take myself with","messageBody":"<div id=\"ygrps-yiv-1163517611\">On Monday, September 22, 2003, at 07:04  AM, Holly Shaltz wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Having said all that &lt;phew!&gt; I bow out, knowing that none of what I <br/>\n&gt; have<br/>\n&gt; written is important to anyone :)  I take myself with a large grain of<br/>\n&gt; salt.  Ultimately, all beliefs are simply aspects of our physical <br/>\n&gt; lives,<br/>\n&gt; and will be discarded when we exit this life.  IOW, &#39;tain&#39;t important<br/>\n&gt; enough to get hot about now or ever.<br/>\n<br/>\n </span></blockquote>LOL - although most of the ideas don&#39;t appeal to me, I do LIKE the <br/>\noverall attitude expressed in that post, a LOT. When people can say, &quot;I <br/>\ntake myself with a large grain of salt,&quot; I think that&#39;s a way of saying <br/>\nthat they aren&#39;t so darn certain that they are &quot;right&quot; and everybody <br/>\nelse &quot;wrong&quot; and that they would be able to handle it if people <br/>\nquestioned their reasons for their beliefs and be comfortable with the <br/>\nidea that others might even think their beliefs were illogical or worse.<br/>\n<br/>\nIf I was going to post about my own personal graspings at a kind of <br/>\nspiritual belief system, I&#39;d say the same thing.  I don&#39;t have any <br/>\ninterest in discussing it, though, so I am not posting about it. That <br/>\nIS what the list is for - people bring up things they WANT to have <br/>\nanalyzed, things they want people to think about and question and <br/>\ncritically examine and give alternative ideas about. Right now, in my <br/>\nlife, I&#39;m more interested in the here-and-now level - not in discussing <br/>\nbefore or after-lives.<br/>\n<br/>\nI do understand holding two ideas that seem to be at odds with each <br/>\nother. That&#39;s what Holly seems to me to be describing.  I think we do <br/>\nthat quite often - it seems to be in our nature. I can say I don&#39;t like <br/>\nto travel, but then describe having a wonderful time on a particular <br/>\ntrip, for example.<br/>\n<br/>\n  I&#39;m interested in how we choose to behave in this life - how we treat <br/>\nour children, how we decide to live our lives. When somebody says that <br/>\nwe decided already - we&#39;re not choosing now - it leaves us with nothing <br/>\nmuch to talk about - our Venn diagram has no intersection if that <br/>\nperson believes we are all simply acting out a prewritten script - a <br/>\nscript we all helped write and fully agree upon in advance.<br/>\n<br/>\nIf someone says, on the other hand, that we chose this KIND of life, <br/>\nbut we chose it in order to have to MAKE all the decisions that this <br/>\nkind of life involves, that leaves us with our whole world of choices <br/>\nto still talk about, whether we agree on how we got here or not.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":3088570,"authorName":"Holly Shaltz","from":"Holly Shaltz &lt;holly@...&gt;","profile":"hollyshaltz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] new member intro and beliefs","postDate":"1064244156","msgId":81205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNkYxM0JDLjM5OEVDNTBEQHNoYWx0emZhcm0uY29tPg==","referencesHeader":"PDFlNC4xMDMzMDdjMC4yY2EwNjkyNEBhb2wuY29tPg=="},"prevInTopic":81203,"nextInTopic":81207,"prevInTime":81204,"nextInTime":81206,"topicId":81200,"numMessagesInTopic":0,"msgSnippet":"Rhonda writes: ","messageBody":"<div id=\"ygrps-yiv-1714303097\">Rhonda writes:<br/>\n<br/>\n&lt;&lt; but it is one of those books that I like to read when I&#39;m feeling far<br/>\nto bogged down with earthiness ;-).&gt;&gt;<br/>\n<br/>\nMe too :)  My beliefs are more clear in my heart than my head.  I can<br/>\nget caught up in the daily grind and forget that &#39;reality&#39; isn&#39;t<br/>\nREALITY.  Illusions is the best quick read I know of to remind me of<br/>\nwhere I am and why I&#39;m here.<br/>\n<br/>\nThanks for the welcome,<br/>\n<br/>\nHolly</div>","specialLinks":[]},{"userId":66835036,"authorName":"RJHill241@aol.com","from":"RJHill241@...","profile":"rjhill241","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] new member intro and beliefs","postDate":"1064242980","msgId":81202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlNC4xMDMzMDdjMC4yY2EwNjkyNEBhb2wuY29tPg=="},"prevInTopic":81200,"nextInTopic":81203,"prevInTime":81201,"nextInTime":81203,"topicId":81200,"numMessagesInTopic":0,"msgSnippet":"Welcome Holly, Your post was beautifully written, and yet another moment of synchronicity occured for me, just this morning. I unloaded my car from the weekend","messageBody":"<div id=\"ygrps-yiv-506084432\">Welcome Holly,<br/>\n<br/>\nYour post was beautifully written, and yet another moment of synchronicity <br/>\noccured for me, just this morning. I unloaded my car from the weekend and my <br/>\nsister had put 2 boxes of books she was done with in my car. I hadn&#39;t gone <br/>\nthrough them when I left, just told her to throw the boxes in so I could head out. <br/>\nMy sister had reassured me that some of my books, that I had shared with her, <br/>\nincluding my John Holt&#39;s, were in the boxes. I laughed a little when I took the <br/>\nsecond box out this morning, and right on the top row, sat &quot;Illisions, the <br/>\nAdventures of a Reluctant Messiah&quot; by Richard Bach (of course it sat next to a <br/>\nbook she has been begging me to read titled, &quot;A Case for Christ&quot;). I kind of <br/>\nsmiled at the sky and gave a little wink. I really don&#39;t know if I planned to <br/>\nshare that his writings in this book are very similar to my beliefs, but it is <br/>\none of those books that I like to read when I&#39;m feeling far to bogged down with <br/>\nearthiness ;-).<br/>\n<br/>\nThanx for sharing it, I guess I needed a shove! Again welcome to the list.<br/>\n<br/>\nRhonda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":3088570,"authorName":"Holly Shaltz","from":"Holly Shaltz &lt;holly@...&gt;","profile":"hollyshaltz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"new member intro and beliefs","postDate":"1064239467","msgId":81200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNkYwMTZCLjlGRThGNUMxQHNoYWx0emZhcm0uY29tPg==","referencesHeader":"PDM1LjNkOGUyODUxLjJjYTA0MzA5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":81202,"prevInTime":81199,"nextInTime":81201,"topicId":81200,"numMessagesInTopic":0,"msgSnippet":"I happened to join this list just as the beliefs thread got going.  I ve been fighting the impulse to respond as Judie s beliefs as stated clearly was","messageBody":"<div id=\"ygrps-yiv-1481168022\">I happened to join this list just as the beliefs thread got going.  I&#39;ve<br/>\nbeen fighting the impulse to respond as Judie&#39;s beliefs as stated<br/>\nclearly was emotionally upsetting to some members. But I was never any<br/>\ngood at sitting on my fingers when interesting and/or controversial<br/>\nissues come up on lists :)  I have less than an hour before I have to<br/>\ndash off to my part-time job, so we&#39;ll see if I can do this in so short<br/>\na time.  Ha!  My boss called half an hour before time to leave to say I<br/>\ndon&#39;t have to come in until 1.  I wish she had called before I got my<br/>\nlunch ready to take in :)<br/>\n<br/>\nI am Holly Shaltz, just turned 45, fiberist &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hjsstudio.com\">http://www.hjsstudio.com</a>&gt;,<br/>\nfarmer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.shaltzfarm.com\">http://www.shaltzfarm.com</a>&gt;, mom to 3 kids (Chris, 24; Jon, 22,<br/>\nand Bethany, 12 on Thursday), retired military spouse, about to<br/>\ncelebrate 25th wedding anniversary with husband Zack--more than a<br/>\nmiracle in military circles :).  Let&#39;s see--yes, former LLL leader, oh,<br/>\nyeah, been unschooling/homeschooling for 13 1/2 years.<br/>\n<br/>\nThe posts about Judie&#39;s beliefs interested me particularly because my<br/>\nspiritual beliefs are somewhat similar.  Here&#39;s a synopsis, FWIW:<br/>\n<br/>\nWe are all part of one spiritual, non-coporeal being or force or<br/>\nwhatever concept we can come up with using words.  You can call this<br/>\nforce God if you like, but in my view that&#39;s limiting and defining it. <br/>\nI don&#39;t personally believe in God or any other form of deity.  All life<br/>\n(some of which our human bodies don&#39;t recognize as life) is part of this<br/>\nspiritual existence.  I call this Tao (not a deity, and Taoism is not a<br/>\nreligion), as Taoism is the closest human belief or philisophical system<br/>\nthat I know of to the concept I have.  &quot;The Tao that can be spoken of is<br/>\nnot true Tao&quot; indicates the limitations of human understanding and<br/>\nexpression when it comes to things beyond our physical existence very<br/>\nwell.<br/>\n<br/>\nBeing non-coporeal, before we enter into this physical life we don&#39;t<br/>\nexperience pain, fear, and suchlike things.  My (limited) experience of<br/>\nfeeling oneness with this spiritual existence suggests that our<br/>\nnon-coporeal existence does experience something I can best describe as<br/>\ntotal acceptance, and which feels like what we humans call unconditional<br/>\nlove.  But other emotions are inevitably tied to humanity&#39;s physical<br/>\nnature, and non-coporeal beings don&#39;t experience it.  There may be other<br/>\nforms of physical life which experience things human&#39;s don&#39;t, as well,<br/>\nand our spiritual selves choose to live in those bodies for a time,<br/>\ntoo.  Animals or aliens, I don&#39;t know, nor does it matter :)<br/>\n<br/>\nA note on that total acceptance thing--as humans, we are constantly<br/>\nsearching for the acceptance we remember from before our birth into<br/>\nphysical life.  When we can recognize where the yearning came from, we<br/>\ncan live with it in a healthy (by our cultural standards) manner.  When<br/>\nwe don&#39;t recognize it, we will be searching for it from other, fallible,<br/>\nhumans forever, or from addictions--and usually failing, because our<br/>\nphysical natures inevitably appear to separate us.  My very posting<br/>\nhere, even my joining this list, is a sign of that yearning in me.<br/>\n<br/>\nSometimes we spiritual beings choose to be born into physical<br/>\nexistence.  _The Reluctant Messiah_ by Richard Bach put that<br/>\nbeautifully, and other books by him develop the concept further.  He<br/>\nwrites that we choose an existence to experience physically for a time<br/>\njust as we humans might choose a movie to watch.  If we want excitement<br/>\nand adventure, or fear, or comedy, we choose different movies.  As<br/>\nnon-coporeal beings unable to experience emotions and other physical<br/>\nconditions, we choose physical life in order to experience those<br/>\nconditions.<br/>\n<br/>\nI don&#39;t believe with Judy that we work out every detail before we are<br/>\nborn.  That would be too boring for me :)  However, maybe some people<br/>\ndo.  Personally, I think we choose the broad outlines of our lives, and<br/>\nleave the rest to happen as it may.  So I chose a stable but sometimes<br/>\nfrustrating marriage, to deal with issues of not feeling worthy, to<br/>\nexperience various losses, to never have enough money for the things I&#39;d<br/>\nlike to have, etc.  Then it&#39;s up to me to do what I like with those<br/>\nexperiences, while I&#39;m wearing this human form.<br/>\n<br/>\nOthers might choose to be born as a severely handicapped child, or a<br/>\nrefugee from war, or a politician &lt;g&gt; in order to experience the<br/>\nbenefits and limitations of each of those physical forms.<br/>\n<br/>\nSo things we, as human beings, label &#39;bad&#39; or &#39;negative&#39; or &#39;evil&#39;<br/>\nhappen because we, as spiritual beings, chose lives that allow those<br/>\nthings to happen, knowing (as spiritual beings) that they are no more<br/>\nreal than a movie is real.<br/>\n<br/>\nHowever, being human in (making some assuptions here for the sake of<br/>\ndiscussion) 21st C North American/Western cultures, we are brought up in<br/>\na culture which emphasizes compassion, responsibility for our own and<br/>\nsometimes others&#39; actions, etc.  If that hypothetical abused wife or<br/>\nrape victim showed up at my door, or Judie&#39;s door, I&#39;m sure I, and she,<br/>\nwould take that person in, call 911, etc.  I know I would, anyway :)  As<br/>\na spiritual being, I know that ultimately the &#39;bad&#39; things are not real;<br/>\nas a physical being, I know that they hurt here and now, and I would<br/>\nlike to relieve my own and others&#39; pain where I can do so responsibly.<br/>\n<br/>\nWould I allow a child molester baby-sit my kids?  No, of course not,<br/>\nbecause it&#39;s not consistent with my values as a human being.  But I can<br/>\nsee that the child molester is a tortured human being, who in turn is a<br/>\n&#39;soul&#39; for want of a better word who chose to live a pain-filled<br/>\nphysical life for the experience of it, just as some people go to see<br/>\nthe &quot;Halloween&quot; movies, which I abhor.  I can feel for both the molester<br/>\nand his/her victims here and now, while knowing that ultimately it&#39;s all<br/>\npart of the movie, not part of the ultimate reality.<br/>\n<br/>\nWhether these beliefs are similar enough to Judie&#39;s that she would agree<br/>\nwith them I don&#39;t know.  I have personally struggled with the<br/>\nimplications Sandra read into Judie&#39;s statments--and again, it&#39;s<br/>\nsomething Richard Bach has written about in his books.  It would be<br/>\nlogically justifiable, based on my belief system, to assume that<br/>\neveryone on earth is in pain, or victimized, or what-have-you because<br/>\nthey chose that life, and no one need feel compassion or take action<br/>\nbased on that negative experience.  However, I am an actor in this<br/>\nculture/timeframe.  I chose to have an upbringing which provides my<br/>\nphysical self with certain values which tend toward ignoring<br/>\nspirituality in terms of favoring physical life for a time.  Those<br/>\nvalues tend my physical actions in favor of helping those I can help in<br/>\nan emotionally positive (by our culture&#39;s standards) way.<br/>\n<br/>\nIt is also logically justifiable that anyone agreeing with my beliefs<br/>\ncould decide to go on a murderous rampage and there would be no negative<br/>\nconsequences for the rampager (other than likely ending his/her life in<br/>\nprison, or shot by police, or executed--all part of the movie, so it<br/>\ndoesn&#39;t matter :)  I don&#39;t choose to act with that degree of freedom,<br/>\nbecause I am influenced by the values my physical self has<br/>\nlearned--including that, for me, the consequence of being executed as a<br/>\nway of exiting this physical existence is not as pleasant as the exit of<br/>\ndying in bed surrounded by loved ones :)<br/>\n<br/>\nHaving said all that &lt;phew!&gt; I bow out, knowing that none of what I have<br/>\nwritten is important to anyone :)  I take myself with a large grain of<br/>\nsalt.  Ultimately, all beliefs are simply aspects of our physical lives,<br/>\nand will be discarded when we exit this life.  IOW, &#39;tain&#39;t important<br/>\nenough to get hot about now or ever.<br/>\n<br/>\nIt shall be interesting to see the reaction (if any :) to this post,<br/>\nthough.  My first impression is one of the list&#39;s atmosphere being<br/>\nsomewhat judgemental--at least when one particular button is pushed. <br/>\nAlas, my physical self includes having been raised by an extremely<br/>\ncritical, judgemental, angry mother and an emotionally unavailable<br/>\nfather, so I&#39;m rather sensitive to judgement.  Something that my<br/>\nphysical being has worked to resolve, with limited success, while my<br/>\nspiritual self is probably laughing that I can&#39;t quite see past that<br/>\nparticular illusion :)<br/>\n<br/>\nHolly<br/>\nwelcoming the first real rain to fall in over 2 months--too late to save<br/>\nour pastures--and wishing she could change the apparent physical reality<br/>\nof the world to not include drought &lt;g&gt;</div>","specialLinks":[]}],"prevTopicId":81198,"nextTopicId":80886}}