{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":2448334,"authorName":"shantinik","from":"&quot;shantinik&quot; &lt;shantinik@...&gt;","profile":"shantinik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Thanks!","postDate":"1048217284","msgId":61445,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI1ZTBzNCs0aW9hQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":61444,"nextInTime":61446,"topicId":61445,"numMessagesInTopic":0,"msgSnippet":"Dear friends -- I wanted to tell you all that my new homeschooling book is out (and I m very proud of it! [:-[] Sorry, proud papa can t help it.) More to the","messageBody":"<div id=\"ygrps-yiv-2094087018\">Dear friends --<br/>\n<br/>\nI wanted to tell you all that my new homeschooling book is out (and<br/>\nI&#39;m very proud of it! [:-[] Sorry, proud papa can&#39;t help it.) More to<br/>\nthe point though, back last summer I put out an announcement for a<br/>\nhomeschool book cover contest, and I wanted to take the opportunity to<br/>\nlet you know about the winner, and to thank all your kids who<br/>\nparticipated! (We had hundreds of entries, from as far away as Kuala<br/>\nLampur, Malaysia, and Capetown, South Africa.)<br/>\n<br/>\nI&#39;m very pleased with it, indeed -- the ship even has a moustache (to<br/>\nresemble me, I guess, though I have never met the artist).<br/>\n<br/>\nAnyhow -- you can see it on my website at www.skylarksings.com<br/>\n<br/>\nAt some future point (once I get myself better organized), I hope to<br/>\npost some of the runnersup on the site -- there were so many good<br/>\nones! [:-)]<br/>\n<br/>\nThanks!<br/>\n<br/>\ndavid<br/>\n<br/>\n<br/>\nTHIRTEEN-YEAR OLD WINS CONTEST TO DESIGN BOOK COVER<br/>\n<br/>\n<br/>\nMonroe, ME: Homeschooler Brianna Kathleen Thomas of Prince George,<br/>\nBritish Columbia has won a contest for the artwork to a book cover for<br/>\nDavid H. Albert&#39;s forthcoming Homeschooling and the Voyage of<br/>\nSelf-Discovery: A Journey of Original Seeking (Common Courage Press,<br/>\n2003). Ingeniously crafted from plasticine, her cover, features three<br/>\nchildren on a boat, nicely echoing the theme in the title. She<br/>\nreceived the prize of $100.<br/>\n<br/>\nThe art work was then used by designers Matt Wuerker and Erica<br/>\nBjerning who placed the title, subtitle and other type on the cover.<br/>\n<br/>\nThomas was surprised to win. &quot;I thought for sure the prize had gone to<br/>\nsomeone else,&quot; she said in a recent phone call informing her that her<br/>\nwork had been selected.<br/>\n<br/>\nWhile writing his book last year, Albert decided to put his faith<br/>\nwhere his commitments were and asked his publisher to run a contest<br/>\nfor a cover for his book. Greg Bates and Flic Shooter, publishers at<br/>\nCommon Courage Press, were worried. &quot;One concern was whether there<br/>\nwere enough young artists out there with the confidence to submit<br/>\nentries,&quot; Bates said. But their real worry was quality. &quot;What<br/>\npublisher in his right mind would entrust a cover--the most important<br/>\npiece of advertising for a book--to a contest whose contestants had to<br/>\nbe 15 years of age or under,&quot; he said. &quot;I spent several sleepless<br/>\nnights worrying that we were running a contest no one would win,&quot;<br/>\nBates continued.<br/>\n<br/>\nBut Albert, long a champion of the passions of homeschoolers, never<br/>\nwavered. &quot;We will have lots of entries and more than one great cover,&quot;<br/>\nhe predicted. Albert was right on both counts.<br/>\n<br/>\nWord spread fast around the net and the network of homeschoolers. &quot;We<br/>\nlive in a tiny town,&quot; noted Bates. &quot;And when we received hundreds of<br/>\nentries, even the post office took notice. It got to the point where<br/>\nthe postal clerk would announce how many entries we received each<br/>\nday,&quot; he said.<br/>\n<br/>\nShooter, in charge of the initial review of entries, said, &quot;We were<br/>\nquickly forced to develop a sorting system to handle the incoming art.<br/>\nI enlisted our seven-year-old daughter to help with the task, and was<br/>\namazed to see how much she loved looking at the entries.&quot;<br/>\n<br/>\n&quot;We received several great entries,&quot; Shooter said. &quot;But Brianna&#39;s work<br/>\ntook my breath away from the moment I opened it,&quot; she said.<br/>\n<br/>\n&quot;We hoped for a good cover,&quot; Bates said. &quot;What we got was a masterpiece.&quot;<br/>\n<br/>\nAbout the cover artist:<br/>\n<br/>\nBrianna Kathleen Thomas did the cover art when she was thirteen years<br/>\nold. She is homeschooled and she loves to make pictures with<br/>\nplasticine and write fantasy and adventure stories. She lives with her<br/>\nMom, dad, her sister Molly, and her two brothers, Kieran and Aidan.<br/>\nShe also lives with her spunky cat, Scarlet and her dog, Griz, plus an<br/>\nassortment of gerbils. For interviews, contact<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gbates@...\">gbates@...</a><br/>\n<br/>\n<br/>\nHomeschooling and the Voyage of Self-Discovery: A Journey of Original<br/>\nSeeking<br/>\nAuthor: David H. Albert<br/>\nIntroduction by Joyce Reed: Associate Dean at Brown University<br/>\nISBN: 1-56751-232-1, paper, $17.95 ISBN 1-56751-233-x, cloth, 29.95<br/>\n288 pages<br/>\n<br/>\nTo contact the author:<br/>\nPhone: 360 352-0506<br/>\nE-mail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shantinik@...\">shantinik@...</a><br/>\nWebsite: www.skylarksings.com</div>","specialLinks":[]}],"prevTopicId":61347,"nextTopicId":61437}}