{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"fantasies and slight possibilities","postDate":"1365523089","msgId":71148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwRjIxQzc4LUI0RjItNDU2Ni1CMTI3LUVBOUQ2OEMxQkUwMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":71147,"nextInTime":71149,"topicId":71148,"numMessagesInTopic":0,"msgSnippet":"This is the text from Lori Odhner s Marriage Moats today, and I want to tell a Marty story after that. ___________________ I read an article about aikido. It","messageBody":"<div id=\"ygrps-yiv-1733071328\">This is the text from Lori Odhner&#39;s &quot;Marriage Moats&quot; today, and I want to tell a Marty story after that.<br/>\n___________________<br/>\nI read an article about aikido. It describes the practice of harnessing conflict. Rather than trying to block its path, the student swivels a threatening force in another direction.<br/>\n <br/>\n&quot;LeBar--now a fourth-degree black belt--loves training with the Japanese jo, or wooden staff. One of his favorite aikido techniques demonstrates how to respond when an attacker tries to grab the weapon. Beginning students have a strong urge to tighten their grip, he says--a futile move, since that just makes it easier for an attacker to wrest the jo out of their hands. Instead, the secret is to hold the staff lightly and let your opponent hang on. A few quick steps and a turn of your body will send him sprawling.&quot;<br/>\n <br/>\nI can remember times I have tightened my grip on what I wanted John to do. Take out the trash. Change the light bulbs. Be ready when I plan to leave. The intensity of my desire made me more vulnerable to losing. But if I stepped back from Expectation to a muted version of hope, I was less enslaved by what I demanded. If he did what I asked, it was a blessing. If he didn&#39;t I could live with that too. I can still feel the constriction through my body as I waited. But no, waiting is too passive a word. I was intending him to walk through the door with all the strength in me. Yet it was a waste of energy that could have been spent enjoying the sounds of spring or composing kind conversation starters. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://archive.aweber.com/marriagemoats/7woYE/h/Marriage_Moats_Aikido.htm\">http://archive.aweber.com/marriagemoats/7woYE/h/Marriage_Moats_Aikido.htm</a><br/>\n___________________<br/>\n <br/>\nWe had a friend a few years ago.  He flaked out and screwed something up, and so hid out for another few years. My kids are seeing him again, sometimes, out and about here and there.<br/>\n<br/>\nBut when the friendship was new and exciting, he had separate friendships, connections, projects and interests, with me, and Holly and Marty.  We drove half the day and stayed overnight to go to his wedding.  Holly spent a week in Silver City, working at his new art gallery (designing business cards, advertisements, and going on a buying trip to Mexico).  We all really liked him.  <br/>\n<br/>\nHe was enthusiastic and would say &quot;Can I come over?  I&#39;ll be there... &quot; and he would state a time, or a window, or after the meeting, or during his  lunch break.    And I would make sure I was home, have a snack ready, or whatever.  And I would be disappointed when he was very late, or (more often) didn&#39;t show up at all.  But sometimes he did show up. :-)  <br/>\n<br/>\nOne day Marty wanted to do something, and I said I couldn&#39;t, that [the guy] was coming over.  Marty said (nicely) he&#39;s probably not going to.  Well, that was statistically true, but still *I* had said I would be here, so it didn&#39;t seem okay for me to leave.  But as we talked about it, Marty, who was 20 or so at the time, said that the way he dealt with unreliable friends was never to really expect that they would do what they said.  Instead of saying &quot;Okay!&quot; or &quot;YES, I will be there,&quot; he would say &quot;That would be nice.&quot;<br/>\n<br/>\nHe treated each plan as a fantasy.  He treated each promise as a slight possibility. :-)   <br/>\n<br/>\nMarty&#39;s much happier than I am, and that was something I learned from Marty that I&#39;m glad to pass on to anyone who wants it.  Holly and I talked about it just a couple of days ago, as a useful tool we got from Marty.  And now Lori&#39;s post reminds me of it again.<br/>\n<br/>\nI have had much more peace and liked my friend better since I allowed myself to think &quot;That woud be nice.&quot;<br/>\n<br/>\nSandra<br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":71114,"nextTopicId":71153}}