{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":54,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257954445","msgId":48558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0NzJERUQ5LUE5OTktNEFBRC1BQjc4LTUzRDU4QUJDMEQ4OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhkZGplYytibWo5QGVHcm91cHMuY29tPg==","referencesHeader":"PGhkZGplYytibWo5QGVHcm91cHMuY29tPg=="},"prevInTopic":48557,"nextInTopic":48559,"prevInTime":48557,"nextInTime":48559,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... If I found out later my husband knowingly watched me eat something that he knew would make me sick later, I d be pissed. That s why, for unschooling -- for","messageBody":"<div id=\"ygrps-yiv-1586908098\">On Nov 11, 2009, at 12:52 AM, Christine wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wasn&#39;t sure whether I should tell them it was wheat or not. I  <br/>\n&gt; knew that the disappointment of that would make them cry and feel  <br/>\n&gt; deprived and ashamed of being different. I chose not to say  <br/>\n&gt; anything. They did really enjoy that cake, and they suffered later.  <br/>\n&gt; I still don&#39;t know how I feel about it--if I made the right  <br/>\n&gt; decision. Either action caused my children some harm.<br/>\n<br/>\n </span></blockquote>If I found out later my husband knowingly watched me eat something  <br/>\nthat he knew would make me sick later, I&#39;d be pissed.<br/>\n<br/>\nThat&#39;s why, for unschooling -- for relationship building --, shifting  <br/>\nthe role from protector to helper makes these kinds of decisions  <br/>\nclearer.<br/>\n<br/>\nIt&#39;s not up to you to protect them -- or yourself! -- from how they  <br/>\nrespond to the world. But they do trust you to protect them from harm  <br/>\nyou&#39;re aware of.<br/>\n<br/>\nIt is up to you to help them deal with their world, warts and all.  <br/>\nPart of their world is being sensitive to wheat. Part of their world  <br/>\nis being faced with pretty and scrumptious looking foods that are  <br/>\nmade of wheat. You took away their decision of whether the pretty  <br/>\ncake was worth a stomach ache later and decided for them.<br/>\n<br/>\nMistakes are opportunities to come up with something better in case  <br/>\nyou&#39;re faced with a similar situation. Planning ahead -- bringing  <br/>\nsomething else for them -- is obviously a great Plan A. But you found  <br/>\nyourself without Plan A and it pointed out you didn&#39;t have a Plan B.  <br/>\nYou have the opportunity to come up with a handful right now.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Dire Consequence (TM) of letting  children eat too much candy","postDate":"1257951346","msgId":48557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkZWo5aSs5am41QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhkZGplYytibWo5QGVHcm91cHMuY29tPg=="},"prevInTopic":48556,"nextInTopic":48558,"prevInTime":48556,"nextInTime":48558,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... I have been in similiar situations with my son, a few times at as young as 3 or 4.  I told him about the cake (or other food item), apoligized for not","messageBody":"<div id=\"ygrps-yiv-994371771\"><blockquote><span title=\"ireply\">&gt; Once we went to picnic that turned out to be a b-day party, and I hadn&#39;t brought an alternative cake for my kids. The b-day cake was so beautiful and they, like all the other children were enamoured with it. I wasn&#39;t sure whether I should tell them it was wheat or not. I knew that the disappointment of that would make them cry and feel deprived and ashamed of being different. I chose not to say anything. They did really enjoy that cake, and they suffered later. I still don&#39;t know how I feel about it--if I made the right decision. Either action caused my children some harm. <br/>\n&gt; <br/>\n&gt; It&#39;s easier now because if they want to know what&#39;s in something, they ask. Otherwise, I&#39;m not involved.<br/>\n&gt;<br/>\n </span></blockquote>I have been in similiar situations with my son, a few times at as young as 3 or 4.  I told him about the cake (or other food item), apoligized for not knowing and bringing some for him and let him know he could try it or when we left we could go pick up a treat for him.  Worked out fine.  Typically he chooses to wait.  He doesnt act like he feels deprived,probably cause he knows he had a choice.<br/>\n<br/>\nAs far as not wanting him to feel different.  He is.  He knows it and he isnt ashamed of it.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257942569","msgId":48556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFNjYxQ0Q4LUY5MDQtNEZCMi05RUI1LTY5RUNDNzY0QjQ4REB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhkZHUwaStqbXRzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhkZHUwaStqbXRzQGVHcm91cHMuY29tPg=="},"prevInTopic":48555,"nextInTopic":48557,"prevInTime":48555,"nextInTime":48557,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... I *know* the discussion seems like it s about a person. But the list is about how to solve problems in ways that: * grow relationships * help kids freely","messageBody":"<div id=\"ygrps-yiv-902809566\">On Nov 11, 2009, at 3:52 AM, Christine wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know how anyone could know if a parent is &quot;making it up&quot;  <br/>\n&gt; and can&#39;t even imagine by what standards this is determined.<br/>\n<br/>\n<br/>\n </span></blockquote>I *know* the discussion seems like it&#39;s about a person.<br/>\n<br/>\nBut the list is about how to solve problems in ways that:<br/>\n<br/>\n* grow relationships<br/>\n<br/>\n* help kids freely explore<br/>\n<br/>\n* help families be more joyful<br/>\n<br/>\n(Right off the top of my head. I&#39;m sure others could add to the list.)<br/>\n<br/>\nThe first question about advice posted to the list isn&#39;t whether it  <br/>\nwill fix the problem. The first question is: is the solution  <br/>\nrespectful of the child? (Some others: Is it kind? Is it safe? Does  <br/>\nit help the child get what he wants? Does it help the child gain  <br/>\ngreater control over his situation? And others could add to that list  <br/>\ntoo.)<br/>\n<br/>\nThough a discussion may reference a poster and their situation, the  <br/>\nlist&#39;s purpose is to pull ideas from posts and discuss whether those  <br/>\nideas will help or hinder relationships, joy, freedom to explore ...,  <br/>\n(in more succinct words: unschooling).<br/>\n<br/>\nIf someone posts to this list -- a list created *for sharing  <br/>\nunschooling ideas* -- and says they restrict their child&#39;s diet  <br/>\nbecause they see a connection between behavior and diet, that piece  <br/>\nof advice won&#39;t help someone grow a better relationship with their  <br/>\nchild.<br/>\n<br/>\nUnschoolers will offer other -- better for relationships, joy,  <br/>\nempowerment ... -- ideas for such a situation. If a child has a  <br/>\nphysical reaction to food -- shock from peanuts, bloody stools  --  <br/>\nthere are other -- better for unschooling, better for relationships  <br/>\n-- ways to approach that than mom being the barrier between her child  <br/>\nand food. There are ideas that *help* the child be empowered in a  <br/>\nworld that has a few more obstacles for them.<br/>\n<blockquote><span title=\"ireply\"> &gt; But philosophically, if a parent chooses it as a lifestyle, is that  <br/>\n&gt; necessarily harmful? I haven&#39;t been here long enough to know, but  <br/>\n&gt; are there no Vegetarian, Vegan, Kosher, Raw Foodist unschoolers?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>People can mix and match all sorts of philosophies. People can alter  <br/>\nseveral philosophies to find something that suits them.<br/>\n<br/>\nPeople who add to and alter unschooling are welcome here. But the  <br/>\nlist is for discussing unaltered unschooling. If someone feels they  <br/>\nneed to restrict their children in some way to fit in some other  <br/>\nphilosophy that&#39;s outside the scope of the list. The list isn&#39;t for  <br/>\nhelping them alter unschooling. The list is for helping them find  <br/>\nsolutions within unschooling. It&#39;s a place where people use the  <br/>\nprinciples of joyful living to find solutions to problems.<br/>\n<br/>\nThe purpose isn&#39;t to restrict people&#39;s thoughts or actions -- they  <br/>\nhave the whole wide world in to think about the whole wide world! The  <br/>\npurpose is to provide a focused location where someone can read and  <br/>\nfind out just about unschooling and how it works. In a world of  <br/>\ninformation overload, targeted, focused information a good choice to  <br/>\nhave available!<br/>\n<blockquote><span title=\"ireply\"> &gt; My parents had a limited repertoire of food and I made choices  <br/>\n&gt; within it.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Natural limitations aren&#39;t the same as parent imposed limitations.<br/>\n<br/>\nA child growing up in an area that doesn&#39;t have Pop-Tarts isn&#39;t the  <br/>\nsame as a child who asks if they can try Pop-Tarts and Mom says  <br/>\n&quot;No.&quot; (Or Mom goes off on a logical discussion about why &quot;we&quot; don&#39;t  <br/>\neat Pop-Tarts.) Both children may have homes free of Pop-Tarts but  <br/>\nthe relationship between mother and child and Pop-Tarts is totally  <br/>\ndifferent.<br/>\n<br/>\nIt won&#39;t help clear thinking to lump the two situations together,  <br/>\nseeing their similarities.<br/>\n<br/>\nIt will help clear thinking to see how their differences effect the  <br/>\nchild and his relationships.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t even understand fruit flavored yogurt<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>If you&#39;re in America (or a part of the world where fruit-flavored  <br/>\nyogurt is a readily offered item -- and I thought apricots were  <br/>\nfruit ???) then you can freely choose to eat or not eat fruit- <br/>\nflavored yogurt.<br/>\n<br/>\nBut unschooling is about how we help our kids explore the world. Your  <br/>\nchoices, your preferences are not automatically their preferences.  <br/>\nHow we help them explore without imposing our fears and prejudices  <br/>\nand biases on them is a big part of unschooling discussion.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m trying to wrap my mind around what is bad about that or any  <br/>\n&gt; lifestyle choice as long as children aren&#39;t bullied, shamed and  <br/>\n&gt; coerced.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Most bullying, shaming and coercing doesn&#39;t feel like it to the  <br/>\nparents. To the parents it feels like common sense and help and love.<br/>\n<br/>\nA lot of what passes through the list is helping parents see the  <br/>\nworld -- and see the parents and their actions and words -- through  <br/>\nthe child&#39;s eyes. A parent who convinces a child that sugar is bad is  <br/>\ndoing it out of love. But to the child it feels the same as if a  <br/>\nhusband had a gentle discussion with his wife every time she looked  <br/>\nat the fantasy book section why &quot;we&quot; don&#39;t read that kind of stuff  <br/>\nbecause it&#39;s bad for our body&#39;s, minds and spirits and how this other  <br/>\nliterature is so much better for &quot;us&quot;.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":191977698,"authorName":"Christine","from":"&quot;Christine&quot; &lt;honeybee@...&gt;","profile":"christine.altman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257929554","msgId":48553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkZHUwaStqbXRzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM2NDM4ODRjMDkxMTEwMjI1NG8yNWRjNDIzYWk4NTZjYTE4ZDEzMGEwY2U4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48552,"nextInTopic":48554,"prevInTime":48552,"nextInTime":48554,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"Yes! Well said. I d like to add that I ve observed a mild disdain for parents of children with food allergies and intolerances out in the world (maybe in this","messageBody":"<div id=\"ygrps-yiv-1888934471\">Yes! Well said.<br/>\n<br/>\nI&#39;d like to add that I&#39;ve observed a mild disdain for parents of children with food allergies and intolerances out in the world (maybe in this group? I don&#39;t know)and I&#39;m not sure what the big deal is. The people I know in this situation are attachment parents who observed little babies, like good parents should. Mamas who know how to listen to, trust, and respond to her infant&#39;s cues, i.e. physical responses, help baby trust his/herself, or so the story goes. <br/>\n<br/>\nTo be so strongly urged for the well being of my children to seek unnecessary invasive medical tests when the observable cause and effect is already definitive feels controlling and hypocritical--a knee jerk reaction and not a truly critical response. <br/>\n<br/>\nThe other thing I want to point out is that the result for people going through this with their children has been an expansion of choices in their diet, not a limitation. A grilled cheese sandwich, fettucini alfredo, pancakes, pizza, goldfish crackers, baguette with brie might seem like variety and choice in some families. To me, it is the same two ingredients repeated six times. Similar items in my diet might be based on rice, coconut, almond, sorghum, miso, cashew, millet, flax seed, etc. The list is endless and entails, a clear expansion of variety, mindfulness and choice.<br/>\n<br/>\nI don&#39;t know how anyone could know if a parent is &quot;making it up&quot; and can&#39;t even imagine by what standards this is determined. It doesn&#39;t strike me as the kind of thing one would choose to do for fun (or attention even). But philosophically, if a parent chooses it as a lifestyle, is that necessarily harmful? I haven&#39;t been here long enough to know, but are there no Vegetarian, Vegan, Kosher, Raw Foodist unschoolers? <br/>\n<br/>\nI grew up in a household where the food was mostly middle eastern fare. My palate is influenced by that: sandwich bread holds no allure, I don&#39;t even understand fruit flavored yogurt and I&#39;d choose sesame and honey, apricot and pistacio over caramel and chocolate any day. My parents had a limited repertoire of food and I made choices within it. The food was nourishing of body and spirit and I was happy and satisfied. I&#39;m trying to wrap my mind around what is bad about that or any lifestyle choice as long as children aren&#39;t bullied, shamed and coerced.<br/>\n<br/>\nC</div>","specialLinks":[]},{"userId":414609447,"authorName":"flhomeschooling","from":"&quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt;","profile":"flhomeschooling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257925397","msgId":48552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkZHB1bCt1aWNmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM2NDM4ODRjMDkxMTEwMjI1NG8yNWRjNDIzYWk4NTZjYTE4ZDEzMGEwY2U4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48551,"nextInTopic":48553,"prevInTime":48551,"nextInTime":48553,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... I meant reminds me of.  I apologize if I used imprecise language. English isn t my first language. I ll try to be more mindful. ... The reason I","messageBody":"<div id=\"ygrps-yiv-1672907845\">Hi L:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; This sounds like the gluten-free, casein-free folks on all the<br/>\n&gt; &gt; homeschooling-autistic-kids lists I used to belong to.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &quot;sounds like&quot; is not the same as &quot;is&quot;.<br/>\n<br/>\n </span></blockquote>I meant &quot;reminds me of.&quot;  I apologize if I used imprecise language. English isn&#39;t my first language. I&#39;ll try to be more mindful.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; if you&#39;d read the<br/>\n&gt; thread, you&#39;d see that it&#39;s a different situation.<br/>\n<br/>\n </span></blockquote>The reason I responded this way is that I didn&#39;t see it as different. I saw a mom posting that there was no diagnosis or intention to get one, but that she felt that eating some things resulted in her child having a behavior she perceived as negative, and it prompted her to restrict that food. I then talked about how I feel like this can be a dangerous and negative slippery slope.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I honestly don&#39;t think that scientific studies are any kind of gold standard<br/>\n&gt; where kids are concerned. <br/>\n<br/>\n </span></blockquote>I didn&#39;t say that they were an exclusive arbiter of things like this. I definitely don&#39;t think that! However, there have been numerous attempts by people to find support for the claims that food restrictions help eliminate or reduce negative behaviors in children, and they have all failed to do so. Across the board. Complete failure to establish causal links. I don&#39;t think that&#39;s insignificant.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  So if your kids like food products, then they&#39;d better be OK with those things. But if your kids know that those things hurt them, then I guess you<br/>\n&gt; had better stick to food, rather than food product.<br/>\n<br/>\n </span></blockquote>To clarify, I&#39;m not using &quot;food product&quot; to mean &quot;refined foods.&quot; I&#39;m using it to mean &quot;edible things.&quot; I&#39;m not sure if you were doing this, but in general, I think making the distinction between &quot;food product&quot; (prepackaged processed food? I think?) and &quot;[real] food&quot; in the context of the dietary choices our kids make is IMHO judgment-laden.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Allergy tests test only IgE, and there&#39;s a range of other allergies and<br/>\n&gt; sensitivities that aren&#39;t covered there. <br/>\n<br/>\n </span></blockquote>OK, but I was addressing a situation in which a mom said the kid(s?) had gotten no tests of any kind and had no apparent intention of doing so. It&#39;s one thing to say, well, my issues may not be covered by this one test - that&#39;s reasonable. It&#39;s another thing to not get tested at all before deciding that your kid can&#39;t eat a whole bunch of foods they like because you&#39;ve surmised it&#39;s somehow bad for them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t happen to like fish. It smells like low tide to me, even when it&#39;s<br/>\n&gt; fresh. I have never found a type of fish, or a style of preparation, that I<br/>\n&gt; like. I think it&#39;s gross. Avoiding fish isn&#39;t burdensome to me.<br/>\n<br/>\n </span></blockquote>I&#39;m not getting the connection to the discussion with this. Fish isn&#39;t your preferred food. You don&#39;t have to eat fish. If your kid doesn&#39;t like fish, you shouldn&#39;t try to make him eat fish. That&#39;s pretty straightforward. <br/>\n<br/>\nThe thing is, it doesn&#39;t matter if it&#39;s because he thinks it&#39;s ugly or smells bad or he&#39;s intuited an allergy to it or whatever. Giving kids free choices means they can choose to limit their own intake for WHATEVER reasons they have.  When my kid doesn&#39;t want something, I don&#39;t try to find out why. He just doesn&#39;t. He doesn&#39;t have to justify it to me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If a child normally likes a wide range of stuff, and that changes as a<br/>\n&gt; result of consumption of one thing, that&#39;s a symptom.<br/>\n<br/>\n </span></blockquote>No, it isn&#39;t. The causal link between food and specific behaviors is a tenuous one at best. If my kid ate a bunch of bread and he suddenly started being cranky or less approachable, he&#39;s not necessarily cranky because he ate a bunch of bread. A lot of people will take the bread away to try to control the child&#39;s crankiness. They don&#39;t see it that way, they will jump through all sorts of hoops to talk about why they&#39;ve decided it&#39;s medically necessary, but it still isn&#39;t necessarily the case that consumption of ________ causes ______.<br/>\n<br/>\nPeople&#39;s tastes change all the time. Sometimes overnight, especially kids. Some kids DO suddenly stop or start having a diverse palate; it&#39;s usually temporary, and it&#39;s not necessarily a symptom of an illness.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If, however, the assumption is free choice, and an<br/>\n&gt; observation of &quot;If my child consumes gluten, they begin to restrict their<br/>\n&gt; own choices, even away from things they normally love, what&#39;s up with<br/>\n&gt; that?&quot;, and then the parent and the child are figuring it out, it&#39;s<br/>\n&gt; maintaining a good unschooling environment. <br/>\n<br/>\n </span></blockquote>I think if a child complains of physical pain or discomfort or exhibits signs therein that appear to be food-related, yes, obviously as a responsible caretaker, it&#39;s up to the parent to help the child figure it out. Otherwise, kids&#39; tastes and preferences change *all the time*, sometimes overnight, and it&#39;s not helpful to an unschooling environment to assume changing tastes and preferences are pathological. <br/>\n<br/>\nMy kid loves ice cream. He eats it almost every day. If he suddenly stopped tomorrow, I wouldn&#39;t wonder &quot;OMG what is up with that?!&quot; and try to link it to, say, the carrots he&#39;s been eating a lot of lately. That&#39;s just not logical to me. I simply wouldn&#39;t serve him any more ice cream until he asked for it again. Which might be never. Which is okay. <br/>\n<br/>\nI don&#39;t know. I think it&#39;s easy to overanalyze and overcomplicate these things. It&#39;s not even necessarily coming from a place of coercion and control, just an overfocus, which can be its own kind of burden and pressure on a child. <br/>\n<br/>\nAndrea in Miami</div>","specialLinks":[]},{"userId":217568290,"authorName":"Laureen","from":"Laureen &lt;splashing@...&gt;","profile":"elementalgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting \tchildren eat too much candy","postDate":"1257922470","msgId":48550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2NDM4ODRjMDkxMTEwMjI1NG8yNWRjNDIzYWk4NTZjYTE4ZDEzMGEwY2U4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhkYW11dStvbHQzQGVHcm91cHMuY29tPg==","referencesHeader":"PGM2NDM4ODRjMDkxMTA5MTAxMXMzZWI5MjcwOHBiNDA3MTc3ZDY4ZDRiMGQxQG1haWwuZ21haWwuY29tPgkgPGhkYW11dStvbHQzQGVHcm91cHMuY29tPg=="},"prevInTopic":48549,"nextInTopic":48551,"prevInTime":48549,"nextInTime":48551,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"Heya! ... sounds like is not the same as is . ... That sthem, on that list. This is a different list, and if you d read the thread, you d see that it s a","messageBody":"<div id=\"ygrps-yiv-143781051\">Heya!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Nov 9, 2009 at 7:33 PM, flhomeschooling &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:andreavlarosa@...\">andreavlarosa@...</a>&gt;wrote:<br/>\n<br/>\n&gt; &gt; &gt; I&#39;ve never heard &quot;being picky&quot; as a symptom of food sensitivity.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; It&#39;s pretty common, IME. An allergist I know described it as<br/>\n&gt; &gt; self-protective, sort of in the same way that extreme nausea limits most<br/>\n&gt; &gt; women&#39;s food choices in early gestation.<br/>\n&gt;<br/>\n&gt; This sounds like the gluten-free, casein-free folks on all the<br/>\n&gt; homeschooling-autistic-kids lists I used to belong to.<br/>\n<br/>\n<br/>\n&quot;sounds like&quot; is not the same as &quot;is&quot;.<br/>\n<br/>\n<br/>\n&gt; People would say &quot;I haven&#39;t had my kids tested, but [insert vague anecdote<br/>\n&gt; that justifies a severely controlled and restricted diet here].&quot;<br/>\n<br/>\n<br/>\nThat&#39;sthem, on that list. This is a different list, and if you&#39;d read the<br/>\nthread, you&#39;d see that it&#39;s a different situation.<br/>\n<br/>\n<br/>\n&gt; I think food sensitivities have become a safe outlet for a lot of people&#39;s<br/>\n&gt; food control issues. There is not one scientific study that supports the<br/>\n&gt; idea that children&#39;s naturally selective appetites are an indicator of any<br/>\n&gt; kind of illness. Not one.<br/>\n&gt;<br/>\n<br/>\nI honestly don&#39;t think that scientific studies are any kind of gold standard<br/>\nwhere kids are concerned. I think scientific studies often say a thing is<br/>\ntrue, without understanding of the variability that is represented by a<br/>\nspecific child. Which is part of why generalities don&#39;t work so well.<br/>\n<br/>\n<br/>\n&gt; True allergies to dairy, corn and gluten are an EXTREMELY limiting burden<br/>\n&gt; in today&#39;s world where almost every food product has wheat, milk or corn<br/>\n&gt; syrup.<br/>\n<br/>\n<br/>\n So if your kids like food products, then they&#39;d better be OK with those<br/>\nthings. But if your kids know that those things hurt them, then I guess you<br/>\nhad better stick to food, rather than food product.<br/>\n<br/>\nIf you think these things make your child physically sick, to the point<br/>\n&gt; where it *destroys their stomach lining* which has a direct link to<br/>\n&gt; developing stomach cancer, there are definitive tests that can conclusively<br/>\n&gt; prove that such an allergy exist. Most insurances cover these tests. You owe<br/>\n&gt; it to your child, IMHO, to have these tests done before taking away 98% of<br/>\n&gt; what&#39;s edible and yummy to a child due to some esoteric guess about a<br/>\n&gt; sensitivity.<br/>\n&gt;<br/>\n<br/>\nAllergy tests test only IgE, and there&#39;s a range of other allergies and<br/>\nsensitivities that aren&#39;t covered there. Celiac testing involves bulk<br/>\nconsumption of gluten, and I don&#39;t do that, because the link between<br/>\nconsumption and damage was pretty obvious without creating more, measurable,<br/>\ndamage.<br/>\n<br/>\n&gt;<br/>\n&gt; This doesn&#39;t mean that your kids don&#39;t have all these allergies, they<br/>\n&gt; might, but I urge you to please be very very careful when informally<br/>\n&gt; diagnosing a child with such a burdensome limitation, especially when a<br/>\n&gt; formal diagnosis is so easily obtainable.<br/>\n&gt;<br/>\n<br/>\nI don&#39;t happen to like fish. It smells like low tide to me, even when it&#39;s<br/>\nfresh. I have never found a type of fish, or a style of preparation, that I<br/>\nlike. I think it&#39;s gross. Avoiding fish isn&#39;t burdensome to me. I don&#39;t<br/>\nhappen to like hangovers. And since avoiding bulk alcohol consumption helps<br/>\nme avoid hangovers, that isn&#39;t burdensome either. If a person makes a<br/>\nconnection between cause and effect *for their body*, then I don&#39;t see that<br/>\nas a burden.<br/>\n<br/>\nNow... If I, as a parent, say &quot;I see this thing and I am therefore<br/>\nforbidding it, restricting it, and you will have no access to this thing<br/>\never&quot;, it&#39;d probably be about as useful as, say, prohibition of alcohol has<br/>\nbeen for adults, throughout history. I&#39;m pretty sure most folks on this list<br/>\nare clear on the idea that prohibition and restriction don&#39;t make for good<br/>\nunschooling.<br/>\n<br/>\n<br/>\n<br/>\n&gt; &quot;Picky&quot; is IMHO a judgmental term with negative connotations. Most people<br/>\n&gt; use it to mean &quot;won&#39;t eat what I think they should eat, in the quantities I<br/>\n&gt; prefer.&quot; It&#39;s not a symptom of an illness.<br/>\n&gt;<br/>\n&gt; If a child normally likes a wide range of stuff, and that changes as a<br/>\nresult of consumption of one thing, that&#39;s a symptom. Whether it&#39;s relevant<br/>\n*to you* is your choice.<br/>\n<br/>\nI get that this is a powerful, emotionally-laden topic. I think, though,<br/>\nthat approaching the same observation from two different perspectives<br/>\ncreates very different results. If the assumption is control and coercion,<br/>\nthen an observation of &quot;if my child consumes gluten (or whatever), they get<br/>\npicky&quot; results in more coercion and control, and is a move away from a good<br/>\nunschooling environment. If, however, the assumption is free choice, and an<br/>\nobservation of &quot;If my child consumes gluten, they begin to restrict their<br/>\nown choices, even away from things they normally love, what&#39;s up with<br/>\nthat?&quot;, and then the parent and the child are figuring it out, it&#39;s<br/>\nmaintaining a good unschooling environment. It&#39;s helping a child explore how<br/>\ntheir food choices affect their body and their body&#39;s reaction to things.<br/>\nIt&#39;s the same lesson whether the substance in question is gluten, caffeine,<br/>\nchocolate, aspirin, or whatever. If you consume a thing, it affects you. Not<br/>\nbeing curious about those reactions, or requiring official sanction of those<br/>\nobservations in order to confirm them, seems like overreaction in the other<br/>\ndirection.<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n~~L!<br/>\n<br/>\ns/v Excellent Adventure<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theexcellentadventure.com/\">http://www.theexcellentadventure.com/</a><br/>\n<br/>\nWe are so programmed by other people’s programming which is programming by<br/>\nother people’s programming that we are on autopilot and we ourselves can’t<br/>\nsee through our own stuff. ~~ Nwenna Kai<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414609447,"authorName":"flhomeschooling","from":"&quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt;","profile":"flhomeschooling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257921277","msgId":48551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkZGx0dCtpb2o4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRlYzRkODA2MDkxMTEwMTQxOXAyYmE3ZTc4ZXk5ZWI2NGM2ZGE0MTU1ODE4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48550,"nextInTopic":48552,"prevInTime":48550,"nextInTime":48552,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"My son is 12 and moderately autistic. In autism discussion and activism circles, there are endless PURELY anecdotal restrictive diets touted, such as the","messageBody":"<div id=\"ygrps-yiv-246383741\">My son is 12 and moderately autistic. In autism discussion and activism circles, there are endless PURELY anecdotal restrictive diets touted, such as the popular gluten-free, casein-free diet, which are intended to make a child less autistic, less hyper, less OCD, etc. Please understand, there are autism treatment centers that will not even see your child for an evaluation if you aren&#39;t completely willing to control your child&#39;s food indefinitely up front.<br/>\n<br/>\nThese diets are touted as a panacea for many &quot;behavioral problems.&quot; I put that in quotes because through unschooling, I&#39;m not only not the least bit bothered by my kid&#39;s inattention (to boring stuff) but I find constant cause to celebrate his &quot;hyperactivity&quot; (I have renamed this &quot;spiritedness&quot; and &quot;passion for life&quot;). I&#39;m also constantly engaging him and sharing cool stuff with him, and he models that right back, which has impacted his autism extensively.<br/>\n<br/>\nThe claims made by GFCF diet proponents are based on relentless anecdotal fear-mongering about intolerances, some of which even they admit they have no way to diagnose or scientifically support. This is a fact. Google &quot;GFCF diet&quot; and you will possibly be amazed at the extreme controlling and fear mongering going on by thousands of families &quot;for the child&#39;s own good&quot;. <br/>\n<br/>\nOn autism discussion lists, I saw parents - HUNDREDS of parents - say that they merely theorized, without diagnosis or even physical symptoms, that eating wheat and milk made their children:<br/>\n<br/>\n- more argumentative<br/>\n- less obedient/more defiant<br/>\n- less tolerant of sitting at a desk doing schoolwork at home<br/>\n- more desiring of physical activity<br/>\n- less inclined to pay attention/ be engaged with an adult<br/>\n- more focused on preferred tasks/more unwilling to stop the preferred activity<br/>\n<br/>\nand other &quot;behavior problems&quot; that through an unschooling lens are actually not problems with the child at all. <br/>\n<br/>\nThis isn&#39;t a grassroots old wives&#39; tale. I saw DOCTORS on these lists tell parents who had not gotten any kind of medical tests done on their child for any kind of food sensitivity recommend that they eliminate *everything* from the diet except meats and a few &quot;safe&quot; (but still suspect!) vegetables and slowly add things back in to see what made their child &quot;more hyper&quot; and &quot;have more behavior problems&quot;. <br/>\n<br/>\nI am not talking about disintegrating anuses and blood pooping. I saw parents hand-wring that their child had shown a sudden increased interest in a &quot;safe food&quot;, and did this mean that the child was &quot;addicted&quot; to this food and needed it taken way? <br/>\n<br/>\nI saw parents and doctors say, without exception, yes, take the food away. If Johnny is autistic and suddenly starts to loooove broccoli it&#39;s because he&#39;s &quot;addicted&quot; and &quot;intolerant&quot; to broccoli and it &quot;acts like an opiate in their brains&quot; (there is no medical test for this either) and the increased interest means the food should be taken away from Johnny even if broccoli is one of only a dozen things he&#39;s allowed to eat.<br/>\n<br/>\nThis is common. This is also an example of parents attempting to control their children&#39;s behavior through food under the guise of a fabricated intolerance. <br/>\n<br/>\nThis has nothing to do with your baby pooping blood. That&#39;s a medical necessity requiring attention and diagnosis, which you sought. Which is wonderful, and what you were supposed to do. You&#39;re talking apples, I&#39;m talking oranges.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I can&#39;t tell you how often this attitude pops up when people find out my<br/>\n&gt; kids have INTOLERANCES to gluten and dairy. They are not allergic. <br/>\n<br/>\n </span></blockquote>Intolerances and allergies are different scientifically, but logistically they both require dietary restriction to some degree and tend to get lumped together in food restriction discourse. I don&#39;t know how helpful it is to parse them on this list.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Your<br/>\n&gt; &quot;humble&quot; opinion is much more judgmental <br/>\n<br/>\n </span></blockquote>I am sincerely sorry you felt judged.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; People who assume that<br/>\n&gt; parents lie about food allergies and intolerances cause terrible harm.<br/>\n<br/>\n </span></blockquote>I assume that parents believe themselves when they talk about why their kid can&#39;t eat xyz foods. But I also assume parents are sometimes wrong since I have been a wrong parent. *g* I also assume that human beings have the capacity to convince themselves of a great many things, some of which aren&#39;t true, out of convenience or even a real desire to do the right thing. <br/>\n<br/>\nExample of a conversation I had with a homeschooling mom whose little girl was on the GFCF diet IRL:<br/>\n<br/>\nHer: Annika is dairy intolerant so we cut out all wheat and dairy products from her diet.<br/>\nMe: She&#39;s lactose intolerant, you mean?<br/>\nHer: Yes, she was diagnosed by an allergist.<br/>\nMe: Oh. And she&#39;s allergic to wheat, too? What a bum rap, poor kid!<br/>\nHer: Well, no... she&#39;s very hyper, and was diagnosed with lactose intolerance, so it&#39;s not a huge leap of logic to think she&#39;s probably intolerant to a lot of other things. So we went on the GFCF diet.<br/>\nMe: [inwardly: uh, yes it is a giant leap of logic? What does hyper have to do with anything??!] Why not just give her Lactaid so she can eat dairy sometimes? <br/>\nHer: [long pause] She&#39;s just used to it now. I do think it makes her less hyper. She doesn&#39;t ask for pizza or anything anymore. She eats whatever I tell her to!<br/>\n<br/>\nThis is an example of how a true intolerance was used by a controlling parent to control the child. This mother was enabled by the &quot;dietary restrictions = cure your child of her personality!&quot; cult that exists. It does exist. It doesn&#39;t mean you belong to it. But it is real and it is widespread.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Here is my vague anecdote: When I drank milk, my 2 month old breastfeeding<br/>\n&gt; babies pooped blood. Their pediatrician diagnosed a casein intolerance.<br/>\n<br/>\n </span></blockquote>This isn&#39;t a vague anecdote. This is a tangible medical reality that lead to a legitimate diagnosis. My post was specifically about intolerances and allergies the parent was only guessing at, presuming, and in some cases (see above mom), making up entirely. I actually said this 3 times explicitly in the email.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The observations of a woman who spends 24 hours a day with her<br/>\n&gt; children is NOT esoteric, it is good parenting.<br/>\n<br/>\n </span></blockquote>I&#39;m sorry, I don&#39;t think that&#39;s necessarily true in all cases. The conclusions we as parents form, based on our observations, are heavily influenced by our own baggage and biases. <br/>\n<br/>\nIf you &quot;observe&quot;, for example, that eating more wheat changes your child&#39;s behavior in some way, that&#39;s probably an accurate observation. It may or may not be a marker of a true intolerance or allergy.<br/>\n<br/>\nIf you (general you) observe that eating more wheat makes your child &quot;more defiant&quot; and &quot;less obedient&quot; and &quot;much more irritable&quot; and &quot;way  more hyper&quot; - those are not accurate, but loaded and judgmental and unkind observations. That is your baggage towards kids. And not good parenting. Not unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The only time my children&#39;s diet was severely controlled and restricted was<br/>\n&gt; about a year ago,<br/>\n<br/>\n </span></blockquote>If you don&#39;t do this kind of controlling, why assume what I said was about you? I&#39;m not being sarcastic - I truly don&#39;t understand how you got from point A to point B there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also to say that 98% of all yummy foods must have wheat and dairy in them is<br/>\n&gt; beyond ridiculous<br/>\n<br/>\n </span></blockquote>In my experience, LOTS of kids&#39; preferred foods have corn, wheat and/or dairy in them. Obviously 98% wasn&#39;t a real statistic. In my experience with a lot of different kids, their preferred foods overwhelmingly had at least one of these 3 ingredients. To take those all away from a child is to severely restrict a child&#39;s diet. My point was this should only be done out of medical necessity.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It<br/>\n&gt; just goes to show how severely limited YOUR diet is!<br/>\n<br/>\n </span></blockquote>Our diet is 100% comprised of things that make me and my kid completely happy to eat. We try new things here and there (lately we&#39;ve been on a &quot;bring weird stuff from the produce aisle home, look it up on Wikipedia, and EAT IT!&quot; kick for giggles) and we try to buy organic/whole grain/ etc., but at the end of the day, we both eat whatever we like. It might be limited to other people, but frankly, we just don&#39;t care.<br/>\n<br/>\nMy kid is still autistic. But I think if I&#39;d listened to the diet-restriction gurus in autism discussion and activism circles, who widely claim (again, with no scientific basis) that 80-90% of kids on the spectrum have &quot;food intolerances&quot; that require restrictions, he&#39;d be... still autistic. But also a lot less sunny and happy and confident than he is now. And neurotic about food. We like it better this way.<br/>\n<br/>\nI am very wary of people who try to solve life&#39;s messes by controlling food. Especially other people&#39;s food. I don&#39;t think people should do it unless there are sound medical reasons to do so, as I said. It sounds like you had sound medical reasons to do so. I sincerely hope the breathing exercises have helped you feel better. :)<br/>\n<br/>\nAndrea in Miami</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257920561","msgId":48549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzNjUwMC40ODEzNi5xbUB3ZWIxMTA0MDkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEU3Q0QyQTU5LTlDNDYtNDYwMS1CNTA5LTI2MDQ5RjVDNjg5Q0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhkYW11dStvbHQzQGVHcm91cHMuY29tPiA8RTdDRDJBNTktOUM0Ni00NjAxLUI1MDktMjYwNDlGNUM2ODlDQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":48548,"nextInTopic":48550,"prevInTime":48548,"nextInTime":48550,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"***Where unschooling comes in is that if parents haven t been trying to schedule and force and control food, then there should be no problem with a child not","messageBody":"<div id=\"ygrps-yiv-542666535\">***Where unschooling comes in is that if parents haven&#39;t been trying to <br/>\nschedule and force and control food, then there should be no problem <br/>\nwith a child not wanting to eat, or wanting to eat more, or sooner, or <br/>\nless, or avoiding ANY kinds of food.***<br/>\n<br/>\nThis bears repeating!  Allergy or no allergy.  When all food is seen as a choice, each person can choose whether or not to put it on a shopping list, and then whether or not to eat it.  When I look at my own childhood, and the childhood that my kid&#39;s get to have, it&#39;s night and day.  Each of my kids knows what they want to eat, and chooses what to eat or not, based on many factors.  <br/>\n<br/>\nI didn&#39;t get to do that.  My parents told me what and when to eat.  They were wrong about that. Part of my health issues now are because of that and the reactionary way in which I behaved towards food because of it.  <br/>\n<br/>\nI love that Margaux can eat a bowl of ice cream, which she&#39;s doing right now, and tomorrow choose not to because it&#39;s too much dairy.  I could never have done that as a child.  I didn&#39;t even know what ice cream tasted like, except that everyone else thought it was delicious.  When I moved out of my parents house I ate lots of ice cream even though it made me sick, I did that with everything that had been forbidden, until my body shut down and I ended up in the hospital.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191977698,"authorName":"Christine","from":"&quot;Christine&quot; &lt;honeybee@...&gt;","profile":"christine.altman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Dire Consequence (TM) of letting  children eat too much candy","postDate":"1257918732","msgId":48554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkZGplYytibWo5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUzNTYwMC4xMzgyNS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":48553,"nextInTopic":48555,"prevInTime":48553,"nextInTime":48555,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... No, it wouldn t have helped the situation we were in where I thought the diet was free of a known irritant, but it wasn t.  I m not sure, but I think the","messageBody":"<div id=\"ygrps-yiv-272079337\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; All of which would have showed up on a food allergy panel like the one that I took.   <br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>No, it wouldn&#39;t have helped the situation we were in where I thought the diet was free of a known irritant, but it wasn&#39;t.  I&#39;m not sure, but I think the kind of test you&#39;re talking about is the one where you soak four or five 3/8&quot; diameter circles on thick blotter paper with blood. That&#39;s the kind I took, I don&#39;t think my kids would have wanted to do that.<br/>\n<br/>\nFor someone brought up on wheat and cow&#39;s milk, anything different seems like a loss. My kids haven&#39;t developed a taste for those foods, their palate is different and they don&#39;t act as if they are/feel deprived.I&#39;ve worked really hard to develop recipes that are just as good, if not better than the traditional stuff. The proof of success is when the other kids at the party go for my stuff first! <br/>\n<br/>\nOnce we went to picnic that turned out to be a b-day party, and I hadn&#39;t brought an alternative cake for my kids. The b-day cake was so beautiful and they, like all the other children were enamoured with it. I wasn&#39;t sure whether I should tell them it was wheat or not. I knew that the disappointment of that would make them cry and feel deprived and ashamed of being different. I chose not to say anything. They did really enjoy that cake, and they suffered later. I still don&#39;t know how I feel about it--if I made the right decision. Either action caused my children some harm. <br/>\n<br/>\nIt&#39;s easier now because if they want to know what&#39;s in something, they ask. Otherwise, I&#39;m not involved.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting  children eat too much candy","postDate":"1257914014","msgId":48548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzNTYwMC4xMzgyNS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRlYzRkODA2MDkxMTEwMTQxOXAyYmE3ZTc4ZXk5ZWI2NGM2ZGE0MTU1ODE4QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGM2NDM4ODRjMDkxMTA5MTAxMXMzZWI5MjcwOHBiNDA3MTc3ZDY4ZDRiMGQxQG1haWwuZ21haWwuY29tPiAgPGhkYW11dStvbHQzQGVHcm91cHMuY29tPiA8NGVjNGQ4MDYwOTExMTAxNDE5cDJiYTdlNzhleTllYjY0YzZkYTQxNTU4MThAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":48547,"nextInTopic":48549,"prevInTime":48547,"nextInTime":48549,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"***I can t tell you how often this attitude pops up when people find out my kids have INTOLERANCES to gluten and dairy. They are not allergic.*** Whether or","messageBody":"<div id=\"ygrps-yiv-1682110668\">***I can&#39;t tell you how often this attitude pops up when people find out my<br/>\nkids have INTOLERANCES to gluten and dairy. They are not allergic.***<br/>\n<br/>\nWhether or not they are &quot;allergic&quot; or not doesn&#39;t change the fact that they have a reaction to a food.  I&#39;m not officialy allergic to carrots or cantaloupe, but I can&#39;t eat either one of those things without my mouth and face breaking out in a rash.<br/>\n<br/>\n*** People who assume that<br/>\nparents lie about food allergies and intolerances cause terrible harm.***<br/>\n<br/>\nLots of parents turn their children&#39;s food intolerances into bigger deals than they actually are.  I&#39;ve heard and seen lots of parents restrict and limit their children from eating things for &quot;their own good&quot;.  It may or may not be true that the child has issues with the food.  My sister did huge elimination diets for her kids for about 2 yrs to try to solve the mystery of why they were always sick.  When she finally did do a food allergy panel test, it turned out that they were all allergic to garlic, something she never would have guessed.  One child couldn&#39;t eat peanuts, it was a very obvious reaction with an ER visit, one child, who hated eggs and never wanted to eat them was allergic to them and another child had already found out for herself that soy made her ears itch.  She could have saved herself and her kids 2 yrs of food trauma and an ER visit if she&#39;d done the test in the first place.<br/>\n<br/>\nThe point is, that parents get really weird about food and allergies.  If food is a question, I really do think it&#39;s way more peaceful to do an allergy test to know for sure.  Just to be clear, the food allergy test that I took, did a scale of tolerance for each individual thing that I was allergic to.  Intolerance and allergies are all measured by the antibodies present in the blood when those foods are in the system.  It also measured immediate reaction typical of allergies and delayed reactions typical of intolerances, which are also considered allergies, but of a different nature.  Even then, unless it&#39;s life threatening or the child really wants help, information is the best way to help a child really understand his or her own body.  Part of that information will be trial and error on the part of the individual.<br/>\n<br/>\n<br/>\n***The only time my children&#39;s diet was severely controlled and restricted was<br/>\nabout a year ago, when I was ripping my hair out, along with our<br/>\npediatrician, trying to figure out why my girls&#39; anuses were disintegrating.<br/>\nWe eliminated just about every protein source from their diet, plus citrus,<br/>\ntomatoes, you name it. It was HELL. Well, guess what, it turns out that a<br/>\nwell-meaning and trusted family member, who thought I might be the same type<br/>\nof parent as you characterized above (if they even exist) was feeding my<br/>\nchildren wheat based foods on the sly.***<br/>\n<br/>\nAll of which would have showed up on a food allergy panel like the one that I took.   <br/>\n<br/>\n<br/>\n***Also to say that 98% of all yummy foods must have wheat and dairy in them is<br/>\nbeyond ridiculous--yes, many processed foods contain these ingredients, but<br/>\nthey can&#39;t even come close to filling earth&#39;s cornucopia of yumminess.*** <br/>\n<br/>\nAs far as I know, there is no equivalent to cinnamon rolls that is gluten free.  I would LOVE to eat pizza and birthday cake.  There are substitutes to these things but they are NOT the same.  I can convince myself that rice bread is just as good and regular bread, and I do ok with this, but I know that my kids would have a much harder time with this.  I&#39;m thrilled that Margaux likes the vegan cheese that we buy and that she&#39;s willing to eat it instead of regular cheese, which she admittedly likes better.  She isn&#39;t forced to eat vegan cheese, she chooses to eat it when she feels like she&#39;s had too much dairy.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257911495","msgId":48547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU3Q0QyQTU5LTlDNDYtNDYwMS1CNTA5LTI2MDQ5RjVDNjg5Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhkYW11dStvbHQzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhkYW11dStvbHQzQGVHcm91cHMuY29tPg=="},"prevInTopic":48546,"nextInTopic":48548,"prevInTime":48546,"nextInTime":48548,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"-=- Picky is IMHO a judgmental term with negative connotations. Most people use it to mean won t eat what I think they should eat, in the quantities I","messageBody":"<div id=\"ygrps-yiv-1993701535\">-=-&quot;Picky&quot; is IMHO a judgmental term with negative connotations. Most  <br/>\npeople use it to mean &quot;won&#39;t eat what I think they should eat, in the  <br/>\nquantities I prefer.&quot; It&#39;s not a symptom of an illness. -=-<br/>\n<br/>\nThat was my point earlier.  And &quot;picky&quot; doesn&#39;t mean the same as  <br/>\n&quot;squeamish&quot; or being food-avoidant.   Picky means what it has meant  <br/>\nfor a long time.  It&#39;s not regional, it&#39;s not special.  It means, very  <br/>\noften &quot;won&#39;t eat what I think they should eat, in the quantities I  <br/>\nprefer,&quot; or it can mean doesn&#39;t like as many different foods as the  <br/>\nothers in the family/group/age-range like.<br/>\n<br/>\nIt&#39;s definitely not a medical term.<br/>\n<br/>\nI do understand the descriptions of people being unbalanced in their  <br/>\ndigestive systems and avoiding food until they&#39;re feeling better.  I&#39;m  <br/>\nsure everyone has experienced that, after any sort of upset or food  <br/>\npoisoning (even low-level) or gastric disturbance.<br/>\n<br/>\nWhere unschooling comes in is that if parents haven&#39;t been trying to  <br/>\nschedule and force and control food, then there should be no problem  <br/>\nwith a child not wanting to eat, or wanting to eat more, or sooner, or  <br/>\nless, or avoiding ANY kinds of food.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting  children eat too much candy","postDate":"1257911126","msgId":48546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTdGOUQ3LTJGMjMtNDI4MC05QjkyLTA4RjlBQjM2RjU4NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRlYzRkODA2MDkxMTEwMTQxOXAyYmE3ZTc4ZXk5ZWI2NGM2ZGE0MTU1ODE4QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGM2NDM4ODRjMDkxMTA5MTAxMXMzZWI5MjcwOHBiNDA3MTc3ZDY4ZDRiMGQxQG1haWwuZ21haWwuY29tPiA8aGRhbXV1K29sdDNAZUdyb3Vwcy5jb20+IDw0ZWM0ZDgwNjA5MTExMDE0MTlwMmJhN2U3OGV5OWViNjRjNmRhNDE1NTgxOEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48545,"nextInTopic":48547,"prevInTime":48545,"nextInTime":48547,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"First things first (though the post before had it backwards): -=-OK, now I have to do my breathing exercises and bring peace back into my soul...-=- Writing to","messageBody":"<div id=\"ygrps-yiv-304902811\">First things first (though the post before had it backwards):<br/>\n<br/>\n-=-OK, now I have to do my breathing exercises and bring peace back  <br/>\ninto my soul...-=-<br/>\n<br/>\nWriting to this list in anger isn&#39;t good for the list and it isn&#39;t  <br/>\ngood for the person who posts.<br/>\nMore importantly, it&#39;s not good for the mother and child, nor for  <br/>\ntheir relationship.<br/>\n<br/>\n<br/>\n-=-I can&#39;t tell you how often this attitude pops up when people find  <br/>\nout my<br/>\nkids have INTOLERANCES to gluten and dairy. They are not allergic. Your<br/>\n&quot;humble&quot; opinion is much more judgmental than my observation of a  <br/>\nnarrowed<br/>\nvariety in their diet upon eating dairy or  gluten. People who assume  <br/>\nthat<br/>\nparents lie about food allergies and intolerances cause terrible harm.- <br/>\n=-<br/>\n<br/>\nMANY parents lie about food allergies and intolerances.  They lie to  <br/>\ntheir children, they lie to friends, they lie to themselves.<br/>\n<br/>\nI could name some people, but I won&#39;t.<br/>\n<br/>\nMeanwhile, back to the topic of this list, if a parents chooses for  <br/>\nany reason on earth not to give her children choices of some sort  <br/>\n(which is NOT the same as suggesting that every child have access to  <br/>\nevery food ever created or imagined, so don&#39;t even go there), then  <br/>\nunschooling will not thrive in that family.<br/>\n<br/>\n-=-it turns out that a well-meaning and trusted family member, who  <br/>\nthought I might be the same type of parent as you characterized above  <br/>\n(if they even exist) ...-=-<br/>\n<br/>\nThey do exist.  They have done more damage to discussions such as  <br/>\nthese, and to sympathy for the claims of excitable mothers who post  <br/>\nemotionally than anything else.<br/>\n<br/>\nKeep to unschooling on this list.  Don&#39;t be yelling at people and  <br/>\ninsulting them.   Stating that their are people who exaggerate is not  <br/>\nabout one single poster.  Using all caps and saying &quot;ridiculous&quot; and  <br/>\n&quot;just goes to show&quot; *is* about a single poster.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":191977698,"authorName":"Christine Altman","from":"Christine Altman &lt;honeybee@...&gt;","profile":"christine.altman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting \tchildren eat too much candy","postDate":"1257891589","msgId":48545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRlYzRkODA2MDkxMTEwMTQxOXAyYmE3ZTc4ZXk5ZWI2NGM2ZGE0MTU1ODE4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhkYW11dStvbHQzQGVHcm91cHMuY29tPg==","referencesHeader":"PGM2NDM4ODRjMDkxMTA5MTAxMXMzZWI5MjcwOHBiNDA3MTc3ZDY4ZDRiMGQxQG1haWwuZ21haWwuY29tPgkgPGhkYW11dStvbHQzQGVHcm91cHMuY29tPg=="},"prevInTopic":48544,"nextInTopic":48546,"prevInTime":48544,"nextInTime":48546,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... I can t tell you how often this attitude pops up when people find out my kids have INTOLERANCES to gluten and dairy. They are not allergic. Your humble","messageBody":"<div id=\"ygrps-yiv-483639597\"><blockquote><span title=\"ireply\">&gt; This sounds like the gluten-free, casein-free folks on all the<br/>\n&gt; homeschooling-autistic-kids lists I used to belong to. People would say &quot;I<br/>\n&gt; haven&#39;t had my kids tested, but [insert vague anecdote that justifies a<br/>\n&gt; severely controlled and restricted diet here].&quot; I think food sensitivities<br/>\n&gt; have become a safe outlet for a lot of people&#39;s food control issues. There<br/>\n&gt; is not one scientific study that supports the idea that children&#39;s naturally<br/>\n&gt; selective appetites are an indicator of any kind of illness. Not one.<br/>\n&gt;<br/>\n<br/>\n<br/>\n&gt; True allergies to dairy, corn and gluten are an EXTREMELY limiting burden<br/>\n&gt; in today&#39;s world where almost every food product has wheat, milk or corn<br/>\n&gt; syrup. If you think these things make your child physically sick, to the<br/>\n&gt; point where it *destroys their stomach lining* which has a direct link to<br/>\n&gt; developing stomach cancer, there are definitive tests that can conclusively<br/>\n&gt; prove that such an allergy exist. Most insurances cover these tests. You owe<br/>\n&gt; it to your child, IMHO, to have these tests done before taking away 98% of<br/>\n&gt; what&#39;s edible and yummy to a child due to some esoteric guess about a<br/>\n&gt; sensitivity.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I can&#39;t tell you how often this attitude pops up when people find out my<br/>\nkids have INTOLERANCES to gluten and dairy. They are not allergic. Your<br/>\n&quot;humble&quot; opinion is much more judgmental than my observation of a narrowed<br/>\nvariety in their diet upon eating dairy or  gluten. People who assume that<br/>\nparents lie about food allergies and intolerances cause terrible harm.<br/>\n<br/>\nHere is my vague anecdote: When I drank milk, my 2 month old breastfeeding<br/>\nbabies pooped blood. Their pediatrician diagnosed a casein intolerance.<br/>\nTheir diet wasn&#39;t limited by this issue--mine was! When wheat was introduced<br/>\nat about 14 months, I noticed an extreme personality shift and a severe<br/>\ndiaper rash. Doc agreed--An invasive biopsy of the intestines was<br/>\nunnecessary. The observations of a woman who spends 24 hours a day with her<br/>\nchildren is NOT esoteric, it is good parenting.<br/>\n<br/>\nThe only time my children&#39;s diet was severely controlled and restricted was<br/>\nabout a year ago, when I was ripping my hair out, along with our<br/>\npediatrician, trying to figure out why my girls&#39; anuses were disintegrating.<br/>\nWe eliminated just about every protein source from their diet, plus citrus,<br/>\ntomatoes, you name it. It was HELL. Well, guess what, it turns out that a<br/>\nwell-meaning and trusted family member, who thought I might be the same type<br/>\nof parent as you characterized above (if they even exist) was feeding my<br/>\nchildren wheat based foods on the sly. I got her to stop and the problem<br/>\nwent away--Oh, I&#39;m sorry, is that a vague anecdote?<br/>\n<br/>\nAlso to say that 98% of all yummy foods must have wheat and dairy in them is<br/>\nbeyond ridiculous--yes, many processed foods contain these ingredients, but<br/>\nthey can&#39;t even come close to filling earth&#39;s cornucopia of yumminess. It<br/>\njust goes to show how severely limited YOUR diet is! My kids adore food and<br/>\nexperience plenty of yummy, including cheese (their is no casein in goat or<br/>\nsheep cheese), ice cream (from cashew cream or coconut milk), cookies, cake,<br/>\ncrackers, as well as the amazing wealth of fruits, vegetables, nuts and<br/>\ngrains.<br/>\n<br/>\nOK, now I have to do my breathing exercises and bring peace back into my<br/>\nsoul...<br/>\n-C<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  MARKETPLACE<br/>\n&gt;<br/>\n&gt; Parenting Zone: Your community resource for family and home&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=14kc8hp9e/M=493064.12016295.13793596.10835568/D=groups/S=1705542111:MKP1/Y=YAHOO/EXP=1257878028/L=/B=9bDqM0PDhF4-/J=1257870828938151/K=gL6KGWiAZHLjFek0wqqgpw/A=5898841/R=0/SIG=11kkq36go/*http://advision.webevents.yahoo.com/parentingzone/\">http://us.ard.yahoo.com/SIG=14kc8hp9e/M=493064.12016295.13793596.10835568/D=groups/S=1705542111:MKP1/Y=YAHOO/EXP=1257878028/L=/B=9bDqM0PDhF4-/J=1257870828938151/K=gL6KGWiAZHLjFek0wqqgpw/A=5898841/R=0/SIG=11kkq36go/*http://advision.webevents.yahoo.com/parentingzone/</a>&gt;<br/>\n&gt;   [image: Yahoo! Groups]&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/;_ylc=X3oDMTJkaDJwZTFzBF9TAzk3MzU5NzE0BGdycElkAzQ0MTAyNTAEZ3Jwc3BJZAMxNzA1NTQyMTExBHNlYwNmdHIEc2xrA2dmcARzdGltZQMxMjU3ODcwODI4\">http://groups.yahoo.com/;_ylc=X3oDMTJkaDJwZTFzBF9TAzk3MzU5NzE0BGdycElkAzQ0MTAyNTAEZ3Jwc3BJZAMxNzA1NTQyMTExBHNlYwNmdHIEc2xrA2dmcARzdGltZQMxMjU3ODcwODI4</a>&gt;<br/>\n&gt; Switch to: Text-Only&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-traditional@yahoogroups.com\">AlwaysLearning-traditional@yahoogroups.com</a>?subject=Change+Delivery+Format:+Traditional&gt;,<br/>\n&gt; Daily Digest&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-digest@yahoogroups.com\">AlwaysLearning-digest@yahoogroups.com</a>?subject=Email+Delivery:+Digest&gt;�<br/>\n&gt; Unsubscribe&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;� Terms<br/>\n&gt; of Use &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;<br/>\n&gt;    .<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257889943","msgId":48544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkY25hbithYmk4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhkYW11dStvbHQzQGVHcm91cHMuY29tPg=="},"prevInTopic":48541,"nextInTopic":48545,"prevInTime":48543,"nextInTime":48545,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... when my now 6 year old son was a baby he ate very little food.  prefering to nurse.  As he got older he quit nursing (on his own) and I ended up giving him","messageBody":"<div id=\"ygrps-yiv-876431262\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; &gt; I&#39;ve never heard &quot;being picky&quot; as a symptom of food sensitivity.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; &gt; It&#39;s pretty common, IME. An allergist I know described it as<br/>\n&gt; &gt; self-protective, sort of in the same way that extreme nausea limits most<br/>\n&gt; &gt; women&#39;s food choices in early gestation.<br/>\n&gt; <br/>\n </span></blockquote>when my now 6 year old son was a baby he ate very little food.  prefering to nurse.  As he got older he quit nursing (on his own) and I ended up giving him formula. He still wouldnt eat.  By the time he was 18 months-2 years old he had very few solid foods he would eat. Refusing most things, most of the time.  He was &quot;picky&quot;.  One day he swelled up all over after his brother, who had been drinking milk, kissed him.  We soon tested him and he tested positive to allergies for egg, milk, soy, peanut, and banana.  He has slowly over the past years expanded his palate but I figured if he somehow knew he should not eat those things as a baby and toddler, then his body must know something I dont. I told his dr. about this one time and he just kind of stared at me.  Anyway, at 6 he is still allergic to peanuts and milk.  He tries somethings with milk in them periodically but prefers not to eat them typically.   At halloween he got a large bag of candy trick or treating and independently asked at each house for candy with no peanuts.  At the end of the evening he had only mistakenly one piece in his bag.  He prefers not to eat milk choc as it makes him feel funny.  He has never expressed any desire to try something with peanuts.</div>","specialLinks":[]},{"userId":78881874,"authorName":"emiLy Q.","from":"&quot;emiLy Q.&quot; &lt;emilyjo@...&gt;","profile":"hanlone","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257871252","msgId":48555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM3MUYwMUM0LjY1MkM0JWVtaWx5am9AZW1pbHlqby5jb20+","inReplyToHeader":"PGhkYW11dStvbHQzQGVHcm91cHMuY29tPg=="},"prevInTopic":48554,"nextInTopic":48556,"prevInTime":48554,"nextInTime":48556,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... I know my sensitivities would not show up on allergy tests, but that doesn t mean I don t feel the effects of eating those foods. The limitation of not","messageBody":"<div id=\"ygrps-yiv-769588884\"><blockquote><span title=\"ireply\">&gt; This doesn&#39;t mean that your kids don&#39;t have all these allergies, they might,<br/>\n&gt; but I urge you to please be very very careful when informally diagnosing a<br/>\n&gt; child with such a burdensome limitation, especially when a formal diagnosis is<br/>\n&gt; so easily obtainable.<br/>\n<br/>\n </span></blockquote>I know my sensitivities would not show up on allergy tests, but that doesn&#39;t<br/>\nmean I don&#39;t feel the effects of eating those foods.<br/>\n<br/>\nThe limitation of not eating dairy, for us, is highly preferable to a<br/>\ndiagnosis of anything.  What will a diagnosis do?  How would that help?<br/>\nWould it stop us from getting constipated, or gassy?<br/>\n<br/>\nWhat we&#39;ve been talking about is how we have these sensitivities and how we<br/>\nexplore and discover our *own* comfort level with eating those foods, and<br/>\nall foods really.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Picky&quot; is IMHO a judgmental term with negative connotations. Most people use<br/>\n&gt; it to mean &quot;won&#39;t eat what I think they should eat, in the quantities I<br/>\n&gt; prefer.&quot; It&#39;s not a symptom of an illness.<br/>\n<br/>\n </span></blockquote>I don&#39;t call the sensitivity an illness.  It&#39;s not something that I will<br/>\nrecover from - it&#39;s just how I am.<br/>\n<br/>\nWe have a choice (choices, really, all day every day every time we choose<br/>\nfood to eat or buy) between eating something that makes us feel bad, or<br/>\neating other things instead.  We choose to mostly eat other things and eat<br/>\nit only when we really really want to, and are OK with feeling bad.  Or we<br/>\nhope that maybe just maybe we won&#39;t feel bad that time...<br/>\n<br/>\n-emiLy, mom to Delia (6) & Henry (2.5)<br/>\nI love EC!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.WhatisEC.com\">http://www.WhatisEC.com</a></div>","specialLinks":[]},{"userId":414609447,"authorName":"flhomeschooling","from":"&quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt;","profile":"flhomeschooling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257824030","msgId":48541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkYW11dStvbHQzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM2NDM4ODRjMDkxMTA5MTAxMXMzZWI5MjcwOHBiNDA3MTc3ZDY4ZDRiMGQxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48540,"nextInTopic":48544,"prevInTime":48540,"nextInTime":48542,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... This sounds like the gluten-free, casein-free folks on all the homeschooling-autistic-kids lists I used to belong to. People would say I haven t had my","messageBody":"<div id=\"ygrps-yiv-2054471170\"><blockquote><span title=\"ireply\">&gt; &gt; I&#39;ve never heard &quot;being picky&quot; as a symptom of food sensitivity.<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; It&#39;s pretty common, IME. An allergist I know described it as<br/>\n&gt; self-protective, sort of in the same way that extreme nausea limits most<br/>\n&gt; women&#39;s food choices in early gestation.<br/>\n<br/>\n </span></blockquote>This sounds like the gluten-free, casein-free folks on all the homeschooling-autistic-kids lists I used to belong to. People would say &quot;I haven&#39;t had my kids tested, but [insert vague anecdote that justifies a severely controlled and restricted diet here].&quot; I think food sensitivities have become a safe outlet for a lot of people&#39;s food control issues. There is not one scientific study that supports the idea that children&#39;s naturally selective appetites are an indicator of any kind of illness. Not one. <br/>\n<br/>\nTrue allergies to dairy, corn and gluten are an EXTREMELY limiting burden in today&#39;s world where almost every food product has wheat, milk or corn syrup. If you think these things make your child physically sick, to the point where it *destroys their stomach lining* which has a direct link to developing stomach cancer, there are definitive tests that can conclusively prove that such an allergy exist. Most insurances cover these tests. You owe it to your child, IMHO, to have these tests done before taking away 98% of what&#39;s edible and yummy to a child due to some esoteric guess about a sensitivity.<br/>\n<br/>\nThis doesn&#39;t mean that your kids don&#39;t have all these allergies, they might, but I urge you to please be very very careful when informally diagnosing a child with such a burdensome limitation, especially when a formal diagnosis is so easily obtainable.<br/>\n<br/>\n&quot;Picky&quot; is IMHO a judgmental term with negative connotations. Most people use it to mean &quot;won&#39;t eat what I think they should eat, in the quantities I prefer.&quot; It&#39;s not a symptom of an illness. <br/>\n<br/>\nJust my $0.02.<br/>\n<br/>\nAndrea in Miami</div>","specialLinks":[]},{"userId":191977698,"authorName":"Christine","from":"&quot;Christine&quot; &lt;honeybee@...&gt;","profile":"christine.altman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Dire Consequence (TM) of letting children  eat too much candy","postDate":"1257821611","msgId":48538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkYWtqYis1MWMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2MjAwMS41NDIxOC5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":48534,"nextInTopic":48540,"prevInTime":48537,"nextInTime":48539,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"My kids have intolerance to gluten and dairy, and I ve definitely noticed that the desire for variety narrows if they decide to eat those foods. They become","messageBody":"<div id=\"ygrps-yiv-574617698\">My kids have intolerance to gluten and dairy, and I&#39;ve definitely noticed that the desire for variety narrows if they decide to eat those foods. They become grumpy, irritable, and I think that being picky is part of that.<br/>\n<br/>\nI&#39;ve had a love affair with vegetables my whole life and I think it was the time that my dad spent with me in his garden. My summers were spent wandering the rows picking the most delectable bits and eating them raw on the grass, in the sun. I&#39;ve tried to provide the means for similar experience for my children, so far so good. Last summer, I thought a deer was getting into my bed of onions, but it was my two year old who thought the green tips tasted yummy.</div>","specialLinks":[]},{"userId":78881874,"authorName":"emiLy Q.","from":"&quot;emiLy Q.&quot; &lt;emilyjo@...&gt;","profile":"hanlone","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children  eat too much candy","postDate":"1257802051","msgId":48540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM3MURGMzczLjY1MjQ1JWVtaWx5am9AZW1pbHlqby5jb20+","inReplyToHeader":"PDQ2MjAwMS41NDIxOC5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":48538,"nextInTopic":48541,"prevInTime":48539,"nextInTime":48541,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... We are dairy free too, and are dealing with the effects of enjoying the Halloween candy.  Hershey s dark chocolate syrup does not have dairy and is really","messageBody":"<div id=\"ygrps-yiv-1643117153\"><blockquote><span title=\"ireply\">&gt; Yes, every person should be picky!  Margaux just lost her first tooth.  With<br/>\n&gt; her tooth money she wanted to get candy.  She loves chocolate candy more than<br/>\n&gt; just about anything in the whole world, but she chose to get different, non<br/>\n&gt; chocolate candy because almost all chocolate has dairy and she said that she&#39;s<br/>\n&gt; eaten too much dairy lately and she doesn&#39;t want to have a tummy ache or<br/>\n&gt; headache and feel yucky.  She&#39;s not a big fan of dark chocolate, it&#39;s too<br/>\n&gt; bitter.  Almost all of her Halloween candy was milk chocolate which she<br/>\n&gt; enjoyed immensely, but she&#39;s done with it for now.<br/>\n<br/>\n </span></blockquote>We are dairy free too, and are dealing with the effects of enjoying the<br/>\nHalloween candy.  Hershey&#39;s dark chocolate syrup does not have dairy and is<br/>\nreally really really delicious!!!!!!!!!  I don&#39;t even really like chocolate,<br/>\nbut I love that syrup.<br/>\n<br/>\n-emiLy, mom to Delia (6) & Henry (2.5)<br/>\nI love EC!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.WhatisEC.com\">http://www.WhatisEC.com</a></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children  eat too much candy","postDate":"1257801533","msgId":48534,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2MjAwMS41NDIxOC5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEM5MTRDRTFELTUyQ0ItNEFCQS1CMzQ3LTMwMEM0MzU5NTY2NEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPiA8NDYzNzY0Ljk4NDQ1LnFtQHdlYjU3MjAxLm1haWwucmUzLnlhaG9vLmNvbT4gPGM2NDM4ODRjMDkxMTA5MDc1MGo1YjcyZTg4ZHdiOTVjMDdlODU2ZDQ4YTQ1QG1haWwuZ21haWwuY29tPiA8QzkxNENFMUQtNTJDQi00QUJBLUIzNDctMzAwQzQzNTk1NjY0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":48530,"nextInTopic":48538,"prevInTime":48533,"nextInTime":48535,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"-=-The more gluten he gets in his diet, the pickier he gets. Rowan is sensitive to dairy and corn, and it has the same effect; he gets picky.-=- ***I ve never","messageBody":"<div id=\"ygrps-yiv-1954954436\">-=-The more<br/>\ngluten he gets in his diet, the pickier he gets. Rowan is sensitive to <br/>\ndairy<br/>\nand corn, and it has the same effect; he gets picky.-=-<br/>\n<br/>\n***I&#39;ve never heard &quot;being picky&quot; as a symptom of food sensitivity.<br/>\nI thought all kids were picky.<br/>\nEvery human should be picky and not eat indiscriminately.***<br/>\n<br/>\nIf I had to explain that given my own experience with intolerance, I&#39;d say that if one eats foods that they really are intolerant to, it destroys the intestinal lining, and that would make someone more sensitive to other things.  This is just my own experience.  Gluten is really terrible for me and even a tiny amount of it will cause such a huge upset in my GI tract, that sometimes potatoes are all I can eat.  Potatoes are my fix all food.  Anything beyond my own experience is theory.<br/>\n<br/>\nYes, every person should be picky!  Margaux just lost her first tooth.  With her tooth money she wanted to get candy.  She loves chocolate candy more than just about anything in the whole world, but she chose to get different, non chocolate candy because almost all chocolate has dairy and she said that she&#39;s eaten too much dairy lately and she doesn&#39;t want to have a tummy ache or headache and feel yucky.  She&#39;s not a big fan of dark chocolate, it&#39;s too bitter.  Almost all of her Halloween candy was milk chocolate which she enjoyed immensely, but she&#39;s done with it for now.<br/>\n<br/>\nI don&#39;t forbid her from eating dairy, so she eats what she feels tolerable, and then stops.  When she stops, she naturally expands her diet to other things.  This will be true for all food, even food that nobody has an intolerance to.  A requested item from the grocery store will be eaten and filled up on, then nobody wants it anymore for a while. <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128961575,"authorName":"Vicki Dennis","from":"Vicki Dennis &lt;vicki@...&gt;","profile":"vickitexan2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children \teat too much candy","postDate":"1257790483","msgId":48530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5Y2ExYmJhMDkxMTA5MTAxNG43OTQxZDIwZG84YjEzMzk0Mzc2ODVmOWIwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEM5MTRDRTFELTUyQ0ItNEFCQS1CMzQ3LTMwMEM0MzU5NTY2NEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPgkgPDQ2Mzc2NC45ODQ0NS5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+CSA8YzY0Mzg4NGMwOTExMDkwNzUwajViNzJlODhkd2I5NWMwN2U4NTZkNDhhNDVAbWFpbC5nbWFpbC5jb20+CSA8QzkxNENFMUQtNTJDQi00QUJBLUIzNDctMzAwQzQzNTk1NjY0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":48529,"nextInTopic":48534,"prevInTime":48529,"nextInTime":48531,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"I understood picky  to mean uninterested in most food rather than discriminate.   Could be a regional/cultural thing. If I have eaten enough egg to trigger","messageBody":"<div id=\"ygrps-yiv-854648993\">I understood &quot;picky&quot;  to mean &quot;uninterested in most food&quot; rather than<br/>\ndiscriminate.   Could be a regional/cultural thing.<br/>\n<br/>\nIf I have eaten enough egg to trigger a reaction (e.g. crepes instead of<br/>\npancakes and not buffered by other food), then I am queasy for hours.<br/>\nNothing &quot;looks or sounds good&quot;.<br/>\n<br/>\nvicki<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Nov 9, 2009 at 11:58 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-The more<br/>\n&gt;<br/>\n&gt; gluten he gets in his diet, the pickier he gets. Rowan is sensitive to<br/>\n&gt; dairy<br/>\n&gt; and corn, and it has the same effect; he gets picky.-=-<br/>\n&gt;<br/>\n&gt; I&#39;ve never heard &quot;being picky&quot; as a symptom of food sensitivity.<br/>\n&gt; I thought all kids were picky.<br/>\n&gt; Every human should be picky and not eat indiscriminately.<br/>\n&gt;<br/>\n&gt; Sanrda<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":217568290,"authorName":"Laureen","from":"Laureen &lt;splashing@...&gt;","profile":"elementalgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children \teat too much candy","postDate":"1257790289","msgId":48529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2NDM4ODRjMDkxMTA5MTAxMXMzZWI5MjcwOHBiNDA3MTc3ZDY4ZDRiMGQxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEM5MTRDRTFELTUyQ0ItNEFCQS1CMzQ3LTMwMEM0MzU5NTY2NEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPgkgPDQ2Mzc2NC45ODQ0NS5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+CSA8YzY0Mzg4NGMwOTExMDkwNzUwajViNzJlODhkd2I5NWMwN2U4NTZkNDhhNDVAbWFpbC5nbWFpbC5jb20+CSA8QzkxNENFMUQtNTJDQi00QUJBLUIzNDctMzAwQzQzNTk1NjY0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":48528,"nextInTopic":48530,"prevInTime":48528,"nextInTime":48530,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"Heya ... It s pretty common, IME. An allergist I know described it as self-protective, sort of in the same way that extreme nausea limits most women s food","messageBody":"<div id=\"ygrps-yiv-226078029\">Heya<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Nov 9, 2009 at 9:58 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; -=-The more<br/>\n&gt; gluten he gets in his diet, the pickier he gets. Rowan is sensitive to<br/>\n&gt; dairy<br/>\n&gt; and corn, and it has the same effect; he gets picky.-=-<br/>\n&gt;<br/>\n&gt; I&#39;ve never heard &quot;being picky&quot; as a symptom of food sensitivity.<br/>\n&gt;<br/>\n<br/>\nIt&#39;s pretty common, IME. An allergist I know described it as<br/>\nself-protective, sort of in the same way that extreme nausea limits most<br/>\nwomen&#39;s food choices in early gestation.<br/>\n<br/>\n<br/>\n&gt; I thought all kids were picky.<br/>\n&gt; Every human should be picky and not eat indiscriminately.<br/>\n<br/>\n<br/>\nThere&#39;s a difference between discerning, and picky. I think discerning is<br/>\nmaking a choice based on multiple good outcomes (this thing I want to eat is<br/>\nthe best of many good options) and picky is making a choice based on lesser<br/>\nof evils (I hate everything right now, but I&#39;m hungry and I can choke this<br/>\nparticular thing down). For us, the difference is not in the things offered,<br/>\nit&#39;s in the attitude, which changes markedly in the presence of substances<br/>\nthey&#39;re sensitive to.<br/>\n<br/>\n-- <br/>\n~~L!<br/>\n<br/>\ns/v Excellent Adventure<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theexcellentadventure.com/\">http://www.theexcellentadventure.com/</a><br/>\n<br/>\nWe are so programmed by other people’s programming which is programming by<br/>\nother people’s programming that we are on autopilot and we ourselves can’t<br/>\nsee through our own stuff. ~~ Nwenna Kai<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children  eat too much candy","postDate":"1257789501","msgId":48528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5MTRDRTFELTUyQ0ItNEFCQS1CMzQ3LTMwMEM0MzU5NTY2NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGM2NDM4ODRjMDkxMTA5MDc1MGo1YjcyZTg4ZHdiOTVjMDdlODU2ZDQ4YTQ1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPiA8NDYzNzY0Ljk4NDQ1LnFtQHdlYjU3MjAxLm1haWwucmUzLnlhaG9vLmNvbT4gPGM2NDM4ODRjMDkxMTA5MDc1MGo1YjcyZTg4ZHdiOTVjMDdlODU2ZDQ4YTQ1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48527,"nextInTopic":48529,"prevInTime":48527,"nextInTime":48529,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"-=-The more gluten he gets in his diet, the pickier he gets. Rowan is sensitive to dairy and corn, and it has the same effect; he gets picky.-=- I ve never","messageBody":"<div id=\"ygrps-yiv-1612446456\">-=-The more<br/>\ngluten he gets in his diet, the pickier he gets. Rowan is sensitive to  <br/>\ndairy<br/>\nand corn, and it has the same effect; he gets picky.-=-<br/>\n<br/>\nI&#39;ve never heard &quot;being picky&quot; as a symptom of food sensitivity.<br/>\nI thought all kids were picky.<br/>\nEvery human should be picky and not eat indiscriminately.<br/>\n<br/>\nSanrda<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257789259","msgId":48527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0MDRCRkU3LTkwNjctNDk2Ny04OTVDLUVGQTVGNzc5OEFERkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDcwMjUyLjQ0MDM5LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPiA8NDYzNzY0Ljk4NDQ1LnFtQHdlYjU3MjAxLm1haWwucmUzLnlhaG9vLmNvbT4gPDcwMjUyLjQ0MDM5LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":48526,"nextInTopic":48528,"prevInTime":48526,"nextInTime":48528,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"-=-. Leann Birch at Penn State has done research into preschool aged children and eating and found that eating in the absence of hunger (it has an acronym:","messageBody":"<div id=\"ygrps-yiv-516353125\">-=-. Leann Birch at Penn State has done research into preschool aged  <br/>\nchildren and eating and found that eating in the absence of hunger (it  <br/>\nhas an acronym: EAH) increases in households with maternal restriction  <br/>\nof diet. -=-<br/>\n<br/>\nOh!  I&#39;ve wondered why some of the most overweight kids are from  <br/>\nfamilies where there&#39;s not much food in the house.  I guess that would  <br/>\nstart to explain that.   Without abundance, choices aren&#39;t real.  If a  <br/>\nchild is worried that this box of saltines might be the last food for  <br/>\na while, he might eat lots of saltines.  I don&#39;t think my kids have  <br/>\never eaten any, though we&#39;ve usually had some (or some kind of  <br/>\ncrackers).<br/>\n<br/>\n-=Simon and Linnaea will ask for greens and will push away candy. We  <br/>\nhave a jar of candy that we filled up this summer with tootsie rolls  <br/>\nbrought over from the U.S. (thank you Sandra). There are still tootsie  <br/>\nrolls in there. -=-<br/>\n<br/>\nI told you Tootsie Rolls were gross. &lt;bwg&gt;<br/>\n<br/>\nWe have M&Ms in a glass jar on the counter all the time.  I refill it  <br/>\nwhen it&#39;s low.   I don&#39;t refill it very often.<br/>\n<br/>\nSome of the discussions on unschooling lists surprise me, about food.   <br/>\nOne person wrote that ice cream was always on the menu for breakfast.   <br/>\nSome others have talked about ice cream for breakfast.  My kids have  <br/>\nnever had ice cream for breakfast.  It&#39;s not that that would be bad,  <br/>\nit&#39;s just that it&#39;s odd for someone to wake up after hours of sleep  <br/>\nand want something really cold.  It can happen, in the summer, but  <br/>\nit&#39;s not generally as easily digested as something warm or room  <br/>\ntemperature.   I&#39;ve never told my kids that.  It&#39;s just that given (as  <br/>\nusual) the option of eating anything in the house (which almost always  <br/>\nincludes ice cream), they have never (in all their 18 to 23 years)  <br/>\nasked for ice cream, nor gone and gotten any on their own.<br/>\n<br/>\nLast week there was a discussion that seemed to end up saying that a  <br/>\ndiet of nothing but sweets was just as good as a diet of nothing but  <br/>\nmother-approved health foods.   For the purposes of helping people  <br/>\nunderstand unschooling, I think both are equally bad, but I didn&#39;t  <br/>\nhave the energy to pursue it.<br/>\n<br/>\nWhen a variety of foods are presented in varied and interesting ways  <br/>\nover the course of months and years, it is my experience that children  <br/>\nwill learn to listen to their bodies (to feel their bodies and have a  <br/>\nkind of self-awareness that&#39;s rare) and choose foods not just by what  <br/>\nseems like it would be fun to eat, but at some point by what they are  <br/>\ncraving in some subtle way.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257784348","msgId":48526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBRjg0NDFDLjgwODAwQG1hYy5jb20+","inReplyToHeader":"PDQ2Mzc2NC45ODQ0NS5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPiA8NDYzNzY0Ljk4NDQ1LnFtQHdlYjU3MjAxLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":48524,"nextInTopic":48527,"prevInTime":48525,"nextInTime":48527,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... They refuse to try vegetables and eat the same few foods over and over and have done so for years. They re really little, still. I m always surprised","messageBody":"<div id=\"ygrps-yiv-1238315379\">On 11/8/2009 8:51 PM, Michele K wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>They refuse to try vegetables and eat the same few foods over and over and have done so for years.&gt;&gt;&gt;They&#39;re really little, still.<br/>\n<br/>\n<br/>\nI&#39;m always surprised when someone says their kids don&#39;t eat ANY <br/>\nvegetables - they are all so different and there are so many different <br/>\nways to eat them. Just seems odd that they don&#39;t find any that they like.<br/>\n<br/>\nMany times, parents have their own baggage about food and they pass that <br/>\non to their kids through their body language and tone of voice and <br/>\nfacial expressions. Is it possible that you aren&#39;t continuing to happily <br/>\noffer lots of wide variety of appealing foods, including vegetables in <br/>\npotentially tasty forms? Is it possible that your kids are picking up on <br/>\nyour anxiety about them not eating vegetables? Is it possible that they <br/>\nexpressed not liking vegetables and you took it as too set in stone - <br/>\nnot realizing it was about vegetables being offered then and that they <br/>\ncould very possibly like certain vegetables in different forms and at <br/>\ndifferent times.<br/>\n<br/>\nTwo kids who both &quot;refuse&quot; to try vegetables? Strikes me that they feel <br/>\npressure to do it and they&#39;re resisting? Otherwise, how could that kind <br/>\nof statement even be made?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Recently my oldest has expressed difficulty stopping eating candy or ice cream even though she wants to, asks me to take it away from her.  I&#39;m thinking my allowing them to completely choose what they eat has not been a good idea.<br/>\n </span></blockquote>Sounds like she&#39;s getting in touch with what she wants to eat or not - <br/>\nwith how she feels when she eats a lot of candy. That&#39;s a GOOD thing, <br/>\nnot a bad sign at all. Support her in trusting that awareness of her own <br/>\nbody. Sounds like your reaction is to assume she&#39;s out of control or <br/>\nsomething - but recognizing how it feels to overeat is something kids <br/>\ndon&#39;t get to find out at all if their food intake is externally controlled.<br/>\n<br/>\nI would suggest getting way way more casual about food. Kid says, &quot;Oh, <br/>\ntake this candy away, I can&#39;t stop eating,&quot; and you&#39;re sounding panicky. <br/>\nInstead, just sympathize and say, &quot;Yeah, I konw what you mean. I was <br/>\njust about to have some baby carrots with ranch dressing and you can <br/>\nshare those with me if you want.&quot; But - don&#39;t even do that if you can&#39;t <br/>\ndo it without any sense of wishing she&#39;d take you up on it - if you <br/>\ncan&#39;t just offer without any emotional attachment, don&#39;t offer - just <br/>\nmake some stuff available and don&#39;t even be IN the room if you can&#39;t be <br/>\ncalm and completely unemotional about it.<br/>\n<br/>\nI&#39;ve known a LOT of kids, over the years, who ate things at my house <br/>\nthat their parents claimed they would never eat - eggs, veggies, brown <br/>\nrice, tomatoes, etc.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":217568290,"authorName":"Laureen","from":"Laureen &lt;splashing@...&gt;","profile":"elementalgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children \teat too much candy","postDate":"1257781846","msgId":48524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2NDM4ODRjMDkxMTA5MDc1MGo1YjcyZTg4ZHdiOTVjMDdlODU2ZDQ4YTQ1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ2Mzc2NC45ODQ0NS5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPgkgPDQ2Mzc2NC45ODQ0NS5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":48519,"nextInTopic":48526,"prevInTime":48523,"nextInTime":48525,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"Heya Michele! ... Rowan s seven, Kestrel s four. I also have a daughter, Aurora, who is 16 months. ... Rowan has gone through a phase over the last two years","messageBody":"<div id=\"ygrps-yiv-404645316\">Heya Michele!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Nov 8, 2009 at 8:51 PM, Michele K &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mom2rci@...\">mom2rci@...</a>&gt; wrote:<br/>\n<br/>\n&gt; How old are they?<br/>\n<br/>\n<br/>\nRowan&#39;s seven, Kestrel&#39;s four. I also have a daughter, Aurora, who is 16<br/>\nmonths.<br/>\n<br/>\n<br/>\n&gt;  How have they eaten over the years?<br/>\n<br/>\n<br/>\nRowan has gone through a phase over the last two years of surviving mostly<br/>\non air. Seriously, I have no idea how he could sustain the level of physical<br/>\nand mental activity he does, and eat so little. Recently, like in the last<br/>\nsix months, he&#39;s cleaning everyone&#39;s plates and asking for more. My mother<br/>\nin law assures me that his father did precisely the same things, at about<br/>\nthe same ages. During the air stage, he mostly wanted simple carbs;<br/>\npotatoes, pasta, rice. Sometimes a little bit of chicken or a hot dog.<br/>\nFoodbars, like Clif and Lara bars, were always popular, while their raw<br/>\ningredients, like dates and dried fruit, not so popular.<br/>\n<br/>\nKestrel is physically very different from Rowan... he&#39;s built solid and<br/>\nstocky, not nearly so athletic, but food is his love and his joy. He asked<br/>\nme to put pickled garlic on his Christmas list this year. Grocery shopping<br/>\nmakes him seriously happy; farmers markets, deliriously so. He wants to talk<br/>\nabout food, help prepare food, think about food. He wakes up wanting to know<br/>\nwhat we&#39;re having for dinner. It&#39;s not that he&#39;s hungry, so much as<br/>\nintrigued and wanting the anticipation.<br/>\n<br/>\n<br/>\n&gt; It&#39;s hard to imagine my girls (8 and 6) saying that.  They refuse to try<br/>\n&gt; vegetables and eat the same few foods over and over and have done so for<br/>\n&gt; years.  Obviously we can be healthy without vegetables, so have I been lying<br/>\n&gt; when I tell my kids they ought to eat them?<br/>\n&gt;<br/>\n<br/>\nFWIW, Kestrel has a gluten sensitivity. I haven&#39;t had him tested for celiac,<br/>\nbut if he eats gluten, he has some miserable physical symptoms. The more<br/>\ngluten he gets in his diet, the pickier he gets. Rowan is sensitive to dairy<br/>\nand corn, and it has the same effect; he gets picky.  It&#39;s almost like their<br/>\nbodies are trying to shut down and protect themselves. Having said that,<br/>\nsometimes they choose to go for it anyway. They understand the consequences<br/>\nto their systems, and they make that choice sometimes. Here&#39;s something I<br/>\nwrote about Rowan&#39;s choices, three years ago:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://theexcellentadventure.com/elementalmom/2006/10/02/self-limiting-the-saga-of-the-flower-cake/\">http://theexcellentadventure.com/elementalmom/2006/10/02/self-limiting-the-saga-of-the-flower-cake/</a><br/>\n<br/>\n&gt;<br/>\n&gt; Recently my oldest has expressed difficulty stopping eating candy or ice<br/>\n&gt; cream even though she wants to, asks me to take it away from her.  I&#39;m<br/>\n&gt; thinking my allowing them to completely choose what they eat has not been a<br/>\n&gt; good idea.<br/>\n&gt;<br/>\n<br/>\n Kids have an evolutionary need to read parents. Their survival depends on<br/>\nthese crazy adults who sometimes aren&#39;t nearly as clear on their thinking as<br/>\nthey should be. And often I find that I&#39;m thinking one thing, but my kids<br/>\nare, correctly, reading something else. If I think one thing on the surface,<br/>\nbut there&#39;s something else under there, they know, and they react to the<br/>\ndeep thing more than the surface thing.<br/>\n<br/>\nI&#39;m guessing (and this is just a guess, from way over here) that you&#39;re<br/>\nprobably approving of them pushing away the candy or ice cream as<br/>\naffirmation of &quot;good&quot; choices on some level, and they&#39;re reacting to your<br/>\napproval more than their desire for a food.<br/>\n<br/>\n-- <br/>\n~~L!<br/>\n<br/>\ns/v Excellent Adventure<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theexcellentadventure.com/\">http://www.theexcellentadventure.com/</a><br/>\n<br/>\nWe are so programmed by other people’s programming which is programming by<br/>\nother people’s programming that we are on autopilot and we ourselves can’t<br/>\nsee through our own stuff. ~~ Nwenna Kai<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257762262","msgId":48519,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDRjZGQzgyLTFFQTItNDkyMy1BMkFELTk2QkM0NjRCQzA5QkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ2Mzc2NC45ODQ0NS5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPiA8NDYzNzY0Ljk4NDQ1LnFtQHdlYjU3MjAxLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":48518,"nextInTopic":48524,"prevInTime":48518,"nextInTime":48520,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"... Kathryn did too. She started out with a very broad palate but at 4 it started narrowing until it was a huge challenge to find something for her to eat. She","messageBody":"<div id=\"ygrps-yiv-1154219872\">On Nov 8, 2009, at 11:51 PM, Michele K wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s hard to imagine my girls (8 and 6) saying that. They refuse to  <br/>\n&gt; try vegetables and eat the same few foods over and over and have  <br/>\n&gt; done so for years.<br/>\n<br/>\n </span></blockquote>Kathryn did too. She started out with a very broad palate but at 4 it  <br/>\nstarted narrowing until it was a huge challenge to find something for  <br/>\nher to eat. She did get round starting about 9. Then when puberty hit  <br/>\nat 12ish, 3 things happened: she started growing taller, she started  <br/>\nbeing more active and her palate expanded. By 14 she was tall and  <br/>\nthin and eating a variety of things.<br/>\n<br/>\nImagine what it would be like if the world of food beyond a few  <br/>\nthings had the appeal of liver and kidney and tripe. It&#39;s not that  <br/>\nkids are being stubborn about food**. It&#39;s that in many kids, their  <br/>\nbody chemistry must change, and then food changes for them. Would a  <br/>\nhusband begging, nagging, making airplane noises entice you to eat  <br/>\nmore organ meats?<br/>\n<br/>\n(** Though parents can create a power struggle and food is one thing  <br/>\nkids can, to some extent, control. There have been  horror stories  <br/>\nfrom parents here who were made to sit at the table until all their  <br/>\ndinner was gone or who swore they&#39;d throw up if forced to eat  <br/>\nsomething and then did.)<br/>\n<br/>\nI&#39;d suggest monkey platters:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/monkeyplatters/\">http://sandradodd.com/monkeyplatters/</a><br/>\n<br/>\nDon&#39;t expect them to be miracles, but they can make variety more  <br/>\nappealing than it is when presented as something &quot;good for you.&quot;<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257759312","msgId":48518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwMjUyLjQ0MDM5LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDQ2Mzc2NC45ODQ0NS5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPiA8NDYzNzY0Ljk4NDQ1LnFtQHdlYjU3MjAxLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":48517,"nextInTopic":48519,"prevInTime":48517,"nextInTime":48519,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"Having difficulty stopping doesn t necessarily mean a problem with eating, it may mean that she comes to those foods more hungry or that there is something","messageBody":"<div id=\"ygrps-yiv-2135438938\">Having difficulty stopping doesn&#39;t necessarily mean a problem with eating, it may mean that she comes to those foods more hungry or that there is something particular about those foods that she is needing. If you&#39;ve been telling them what to eat and how to eat for years they may not honestly trust their own hunger. Girls, apparently, are particularly sensitive to food controls and will overeat more easily when they&#39;ve lived in a household of limitations or instructions on how and when to eat. Leann Birch at Penn State has done research into preschool aged children and eating and found that eating in the absence of hunger (it has an acronym: EAH) increases in households with maternal restriction of diet. Interestingly the outcome of dietary restraint is weight gain pretty much across the board according to the research that you can skim through (it&#39;s only abstracts) here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fred.psu.edu/ds/retrieve/fred/investigator/llb15/completepub\">http://www.fred.psu.edu/ds/retrieve/fred/investigator/llb15/completepub</a><br/>\n<br/>\nSimon and Linnaea will ask for greens and will push away candy. We have a jar of candy that we filled up this summer with tootsie rolls brought over from the U.S. (thank you Sandra). There are still tootsie rolls in there. We&#39;ve even had kids for whom candy is a very sought after good and the jar, without being refilled, would probably be about a third of the way full. I&#39;ve put candy in there to try and keep it varied and interesting, but it just doesn&#39;t go down that fast. Simon is 12 and Linnaea is 9 and they&#39;ve had different palates over the years. Simon likes much the same thing from day to day. It used to be things like cheese quesadillas but now is more likely to be tuna sandwiches or bacon butties. We had brussel sprouts with dinner the other night and they both asked for seconds. Unfortunately there weren&#39;t seconds to be had, I&#39;ll have to get another stalk today. <br/>\n<br/>\nI&#39;m often amazed at how precise their hunger is. Simon wanted gingerbread cookies the other day. I don&#39;t know that I&#39;ve ever made them, and I think it was very rare for me to buy them. But I made a batch and it was exactly what he wanted. Because they&#39;ve been trusted with their own appetites they can pinpoint with great accuracy what they want to eat. And they are fairly willing to trust that David and I aren&#39;t going to try and get them to eat something they wouldn&#39;t like. So they are willing to taste things that I would have been resistant to try. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Michele K &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mom2rci@...\">mom2rci@...</a>&gt;<br/>\n<br/>\nHow old are they?  How have they eaten over the years?  It&#39;s hard to imagine my girls (8 and 6) saying that.  They refuse to try vegetables and eat the same few foods over and over and have done so for years.  Obviously we can be healthy without vegetables, so have I been lying when I tell my kids they ought to eat them?<br/>\n<br/>\nRecently my oldest has expressed difficulty stopping eating candy or ice cream even though she wants to, asks me to take it away from her.  I&#39;m thinking my allowing them to completely choose what they eat has not been a good idea.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257758032","msgId":48517,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxQTg4MEU2NEE0MDQ1MDVBQzNGMEMyQzVEOTcwRUE2QFJvYnluUEM+","inReplyToHeader":"PDQ2Mzc2NC45ODQ0NS5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPiA8NDYzNzY0Ljk4NDQ1LnFtQHdlYjU3MjAxLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":48515,"nextInTopic":48518,"prevInTime":48516,"nextInTime":48518,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"I wonder if this expressed desire yet inability to stop eating ice cream is the direct result of you saying over the years that they ought to be eating","messageBody":"<div id=\"ygrps-yiv-2057957044\">I wonder if this expressed desire yet inability to stop eating ice cream is <br/>\nthe direct result of you saying over the years that they &quot;ought to&quot; be <br/>\neating something else.<br/>\n<br/>\nFrom an emotional standpoint, it&#39;s not just &quot;allowing them to completely <br/>\nchoose what they eat&quot;.<br/>\n<br/>\nIt&#39;s also refraining from expressing negative judgments about what they are <br/>\nchoosing to eat.<br/>\n<br/>\nIf it were Jayn, I&#39;d ask her why she wants to stop eating ice cream or <br/>\ncandy. It sure would be an unusual thing for her to say. Yet she does stop. <br/>\nShe does say no to offered ice cream.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":276701487,"authorName":"Michele K","from":"Michele K &lt;mom2rci@...&gt;","profile":"mom2rci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257742292","msgId":48515,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2Mzc2NC45ODQ0NS5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48508,"nextInTopic":48517,"prevInTime":48514,"nextInTime":48516,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"How old are they?  How have they eaten over the years?  It s hard to imagine my girls (8 and 6) saying that.  They refuse to try vegetables and eat the same","messageBody":"<div id=\"ygrps-yiv-1235456362\">How old are they?  How have they eaten over the years?  It&#39;s hard to imagine my girls (8 and 6) saying that.  They refuse to try vegetables and eat the same few foods over and over and have done so for years.  Obviously we can be healthy without vegetables, so have I been lying when I tell my kids they ought to eat them?<br/>\n<br/>\nRecently my oldest has expressed difficulty stopping eating candy or ice cream even though she wants to, asks me to take it away from her.  I&#39;m thinking my allowing them to completely choose what they eat has not been a good idea.<br/>\n<br/>\n Michele, mom of Rhiannon 8, Caroline 6 next Saturday, and Ian 3 last Friday<br/>\nSnapshots of My Journey<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Laureen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:splashing@...\">splashing@...</a>&gt;<br/>\n<br/>\n<br/>\n&quot;Mama,&quot; Rowan says, &quot;I feel like I need some more greens. Could you put a<br/>\nbunch of lettuce and some sprouts on my burrito, please?&quot; and Kestrel says<br/>\n&quot;Me too, Mama.&quot;<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217568290,"authorName":"Laureen","from":"Laureen &lt;splashing@...&gt;","profile":"elementalgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"The Dire Consequence (TM) of letting children eat too much candy","postDate":"1257725745","msgId":48508,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2NDM4ODRjMDkxMTA4MTYxNXQyOGI5ZTM5Y3M2OTU5ZDJhNmFiNGI0NjQxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":48515,"prevInTime":48507,"nextInTime":48509,"topicId":48508,"numMessagesInTopic":0,"msgSnippet":"Heya! So, this year, we didn t trick or treat, like we usually don t. We live in a marina, and there s a huge party, and everyone brings stuff; cakes, cookies,","messageBody":"<div id=\"ygrps-yiv-212159539\">Heya!<br/>\n<br/>\nSo, this year, we didn&#39;t trick or treat, like we usually don&#39;t. We live in a<br/>\nmarina, and there&#39;s a huge party, and everyone brings stuff; cakes, cookies,<br/>\ncaramel apples, candies, whatever. And we know everyone, so it&#39;s all fair<br/>\ngame. We let the boys choose what they wanted, naturally, and quite a few<br/>\npeople (including the uber-controlling hyper-Christian school-at-homers that<br/>\nalso live in the marina) told us that the results would be ghastly. It<br/>\nescalated nicely; they went from risking hyperactivity and brain damage to<br/>\nrebellion, heart disease, and obesity. Classical logical fallacy, but no one<br/>\nelse got the joke.<br/>\n<br/>\nWe also had our own faves at home. The Ghirardelli squares with yummy<br/>\nfilling, two cans of homemade dulce de leche, to dip apple slices in, a bag<br/>\nof candy corn. All of it got demolished in the course of three or four days.<br/>\nAnd of course, anyone who came over also mentioned the direness of it all.<br/>\nCause you know, if you let them...<br/>\n<br/>\nLast night, we had burritos for dinner. I served them up, and sent my boys<br/>\noff to eat while I made additional burritos for hubby and I. I was surprised<br/>\nto see both boys still standing in the companionway, holding their plates.<br/>\n<br/>\n&quot;Mama,&quot; Rowan says, &quot;I feel like I need some more greens. Could you put a<br/>\nbunch of lettuce and some sprouts on my burrito, please?&quot; and Kestrel says<br/>\n&quot;Me too, Mama.&quot;<br/>\n<br/>\nI wonder what people would say if we replied to the Listing of Dire<br/>\nConsequence with &quot;oh yeah! And if I give them the candy, I&#39;d better stock up<br/>\non butterhead!&quot;<br/>\n<br/>\n-- <br/>\n~~L!<br/>\n<br/>\ns/v Excellent Adventure<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theexcellentadventure.com/\">http://www.theexcellentadventure.com/</a><br/>\n<br/>\nWe are so programmed by other people’s programming which is programming by<br/>\nother people’s programming that we are on autopilot and we ourselves can’t<br/>\nsee through our own stuff. ~~ Nwenna Kai<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47907,"nextTopicId":48599}}