{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":54,"messages":[{"userId":65539919,"authorName":"regina hogan","from":"regina hogan &lt;red2mickey@...&gt;","profile":"red2mickey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062040152","msgId":79294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODI4MDMwOTEyLjU0NTE5LnFtYWlsQHdlYjEyNzAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79292,"nextInTopic":79295,"prevInTime":79293,"nextInTime":79295,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"well our day was much as always differant ,,lol,,my oldest son brought a friend home with him last night so i was woken at 9 oclock and ask if i could run them","messageBody":"<div id=\"ygrps-yiv-439496499\">well our day was much as always differant ,,lol,,my oldest son brought a friend home with him last night so i was woken at 9&#39;oclock and ask if i could run them to his house for the day so i managed to pull myself out of bed due the fact i like to sleep late and mostly so due the kids ,,we night peoples,,i got home from taking them and by this time the others were getting up ,,mid-kid ask mom what you doing today i said i have no clue,,well i sat on the porch for a while  the played and watched tv,,then they went out side to play ball so i decided my floors needed to be striped and rewaxed so off i went clearing the room of all funiture and other obstcules in my way,,i began half way thru stripping they came in,,boy  how it looked fun to them i do not know but they said &quot;cool can we help?&quot;that was a dream to have help for me,,lol,,i only have 1 mop so only one could work at a time,,well youngest ask could i got to the local store and buy every one their own mop and scrubber ,,sure <br/>\n and i did ,,end the end i got to set back and watch as they had fun (to them) and at same time my floor got redone,lol,,once that was over we were setting on the porch again talking about mars and it started to rain so they played in the rain,,i cooked  my lunch ,watched tv,they came inside when thunder started ate their food,outside again they went jumped in the pool,splashed out all the water ,well about 8 inches worth making water tarnadoes,,lol,,husband came home,,got ill at our water bill lately and refilled the pool while kids and i watched millionior on tv,,oh yes and we laughed at dh for getting ill over water,he  got over it and noses it will happen again tomorrow probly,,lol,well i just can not remember what we did the rest of the day but right now its 10:00 pm i am on pc,dh is asleep,boys are all in one of the bedrooms i think drawing since they came got my pencil jar a minute ago,i will be on pc til i can not see and go to bed,,they will stay up until they either fall<br/>\n out or go to theor beds,,that is after the raid the frig,,lol,,they like doing that around midnight ,but so do i,,lol,,any way thats a day for us but not a normal one because they are all differant,,advice i can give you is to stop worrying and relax they will be fine,,and yes they do learn all by their little bitty self,lol,,heck mine show me things all the time and i have no clue as to how the got their info to do things but they manage and the learn not just memorize things,,,,its neat just relax,and enjoy you kids,you be ok<br/>\n <br/>\np.s. by the way they had water and sudds all over the walls and them selves when doing the floor but we managed to get it off the ceiling and walls,,lol<br/>\n<br/>\n&quot;<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nregina hogan,=mother to<br/>\n<br/>\nrobert age14,timothy age13,justin age 12,matthew age 10 ashley age 17,,,,,homeschooled since august 2002!!!!!!!!!!!       <br/>\n<br/>\nproud and happy wife to floyd of 9 years,now grandmother to kandace age 4 weeks born june 14    <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free, easy-to-use web site design software<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What are you doing this morning?","postDate":"1062038751","msgId":79292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJpanFjdis0ZWIyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79283,"nextInTopic":79294,"prevInTime":79291,"nextInTime":79293,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"Hi Cay From someone who has homeschooled for seven years and only in Jan/Feb began exploring the concept of Natural Learning. Right now, my husband and 9 year","messageBody":"<div id=\"ygrps-yiv-1648310788\">Hi Cay<br/>\n<br/>\nFrom someone who has homeschooled for seven years and only in Jan/Feb <br/>\nbegan exploring the concept of Natural Learning.<br/>\n<br/>\nRight now, my husband and 9 year old girl just got back from the <br/>\npool. She&#39;s reheating some dinner for an after pool snack. Earlier <br/>\ntoday, we read through some DK books on large cats (and the small <br/>\ncats) and talked about the differences, and compared the facts that <br/>\nwe got from THESE books, to some facts we had from books over the <br/>\nsummer, specifically: Is the Puma a large cat or a small cat? One <br/>\nbook says &quot;small&quot; but these books we have now say &quot;large.&quot; We&#39;re <br/>\ngoing to look into that one further.<br/>\n<br/>\nMy 10 year old boy is flying paper airplanes around the house, <br/>\nwaiting his turn at the computer, since he wants to conquer all the <br/>\nlevels on a game we just got: Beetle Junior. He&#39;s thinking he doesn&#39;t <br/>\nreally like this game all that much, because it doesn&#39;t have that <br/>\nmany levels, and you pretty much do the same things on each level. <br/>\nHe &quot;rescued&quot; my youngest girl&#39;s &quot;snack&quot; by turning the heat off under <br/>\nit!<br/>\n<br/>\nMy 15 year old girl is taking drama at the high school again this <br/>\nyear, but her &quot;studies&quot; right now are about pirates...Pirates of the <br/>\nCaribbean having turned her on to that subject. She spent an hour or <br/>\nso chatting on a Tolkien forum, answering emails, and listening to <br/>\nsome Celtic CD&#39;s that she got at the UT Shakespeare Festival last <br/>\nweek with my mom. (Next year, MY turn!!! :) She&#39;s in her room at the <br/>\nmoment, probably writing. She&#39;s keeping her journal in a hobbit <br/>\nnotebook, and writing as if she were a hobbit explaining her life to <br/>\nthe journal.<br/>\n<br/>\nEarlier today, we drove up the nearby canyon and went for a nice <br/>\nwalk. The temp was low 80&#39;s and a nice breeze: lovely walking <br/>\nweather. We found lots of bushes with dark red/blue/purple berries on <br/>\nthem and tasted to see if they were choke cherries.<br/>\n<br/>\nBTW, can anyone tell me if choke cherries have five pits?<br/>\n<br/>\nWe made sure and spit everything out, but they didn&#39;t have a bitter <br/>\ntaste, so we think they are not poisonous. Probably choke cherries, <br/>\nactually.<br/>\n<br/>\nBut I do have something &quot;scheduled,&quot; once the pool closes. I want to <br/>\nread Watership Down aloud to the family. Doesn&#39;t that sound like a <br/>\ngood read-aloud? We&#39;re going to get a chapter under our belts before <br/>\ndeciding whether to read the whole thing or not. They&#39;re <br/>\nthinking &quot;not&quot; at this point, but they&#39;ve agreed to a fair sample <br/>\nbefore really saying no thanks.<br/>\n<br/>\nwell, there you go. <br/>\n<br/>\nWow. I never thought we did that much today!<br/>\n<br/>\nblessings, heidiC</div>","specialLinks":[]},{"userId":1658973,"authorName":"Barb Eaton","from":"Barb Eaton &lt;homemama@...&gt;","profile":"homesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062028082","msgId":79283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCNzJCQjcxLjFCRTM1JWhvbWVtYW1hQGluZmluZXQuY29tPg==","inReplyToHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79274,"nextInTopic":79292,"prevInTime":79282,"nextInTime":79284,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"Well....I m playing catch up from our trip to the conference. My 13yo and I had a fabulous time. Thanks go out to Kelly, Ben, all the speakers and so many","messageBody":"<div id=\"ygrps-yiv-1488336903\">Well....I&#39;m playing catch up from our trip to the conference. My 13yo<br/>\nand I had a fabulous time. Thanks go out to Kelly, Ben, all the speakers and<br/>\nso many wonderful attendees. Way Kewl!<br/>\n<br/>\n    Laundry and grocery stores have taken up most of my day until now. My<br/>\nyoungest and I did clean out the rabbit cage. I got to read a little of my<br/>\nnew HEM last night. Life Learning came too. ;-)<br/>\n<br/>\n    As I type my youngest(9yob) is watching Totally Spies. Then Justuce<br/>\nLeague. (It takes meforever to compose one of these. LOL!) We just finished<br/>\na conversation obout heaven and hell. From what I have been able to see<br/>\ntoday he has played army men, fixed and eaten his breakfast and lunch,<br/>\nplayed and watch his older brother play Kingdom Hearts, watched TV, and<br/>\nplayed in his room for a while. Oh yes he took a shower to get ready to go<br/>\nto a friends house tomorrow.After dinner we have plans to play a game of<br/>\nLIFE.He also showed me a magic trick.<br/>\n<br/>\n    My oldest ds (18yo next week) has been working on his computer getting a<br/>\ndriver, working on stuff for his computer group, working on RedHat, IMing,<br/>\nIRC, and various other stuff. He did play Kingdom Heart and later he goes to<br/>\nhis weekly computer group.<br/>\n<br/>\n    Aimee can I contact you off list? I&#39;d like to talk to your dh about how<br/>\nhe got into computer admin without a degree. That is Michaels focus. He<br/>\nstarts college classes in a few weeks.<br/>\n<br/>\n    My other ds (13yo) spent the night at a friends last night. He&#39;s been<br/>\nout the majority of the day socializing with friends that will start school<br/>\nsoon. Also with his hs friends in the neighborhood. Riding bikes,<br/>\nskateboards, swimming and all that stuff. He&#39;ll be home for dinner then out<br/>\nagain. It&#39;s been a slow day. I&#39;ll be glad when I get caught up and the kids<br/>\nin the hood are back to school. It will be nice to have my kids around a<br/>\nlittle more. ;-) I&#39;m sure they have done other things today too.<br/>\n<br/>\n    Advice? Well relax, read, read, read. Write, explore your town, state,<br/>\nand countryside. Find *your* passion and live a full life. That will be the<br/>\nexample you want and will enjoy the wonders of your family in doing so. I&#39;m<br/>\nsure others have said it too. Listen to your kids, your heart, and your<br/>\nfamily will soar. :-)<br/>\n<br/>\nHappy Unschooling<br/>\n<br/>\nBarb E<br/>\n&quot;The function of the child is to live his own life - not the life that his<br/>\nanxious parents think he should live, nor the life according to the purpose<br/>\nof the educator who thinks he knows what is best. All of this interference<br/>\nand guidance on the part of adults only produces a generation of robots.&quot;<br/>\nA S Neill<br/>\n<br/>\n<br/>\n<br/>\n<br/>\non 8/27/03 10:18 AM, Cay A. Gibson at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caygibson@...\">caygibson@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Any advice would be most helpful...if I could just get a *peek*<br/>\n&gt; inside your *unschools* today.  What are your dc doing right this<br/>\n&gt; moment as you read my message?  What are your plans to do with them<br/>\n&gt; for when you get off the computer?<br/>\n&gt; <br/>\n&gt; Thank you!<br/>\n&gt; Cay </span></blockquote></div>","specialLinks":[]},{"userId":154862465,"authorName":"Shyrley","from":"Shyrley &lt;shyrley@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Conference","postDate":"1062024215","msgId":79274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNEQzNDE3LjUwNDAyMDlAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDAwOTMwMWMzNmNjYSRlZjJiOTNmMCQ2NDAwYThjMEBsaXZpbmdyb29tMT4=","referencesHeader":"PDAwOTMwMWMzNmNjYSRlZjJiOTNmMCQ2NDAwYThjMEBsaXZpbmdyb29tMT4="},"prevInTopic":79271,"nextInTopic":79283,"prevInTime":79273,"nextInTime":79275,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"Hi all, I m back from the conference and recovered enough to type! I had a wonderful time and met so many great people. Heather loved it too after her initial","messageBody":"<div id=\"ygrps-yiv-481716587\">Hi all,<br/>\n<br/>\nI&#39;m back from the conference and recovered enough to type!<br/>\nI had a wonderful time and met so many great people. Heather loved it <br/>\ntoo after her initial shyness - she at first thought the kids would be <br/>\nlike HS kids she&#39;s met here, that they would be nasty to her and make <br/>\nfun of her accent :-(<br/>\nA few thanks are in order for some people who went out of their way for <br/>\nme....<br/>\nKelly for organising the conference and for spending the day attempting <br/>\nto call her doctor to get me a migraine drug.<br/>\nBrenda for taking me to the ER to get a migraine drug and waiting with <br/>\nme there 2 hours while I was throwing up :-(<br/>\nRue for the gift she made for an unhappy little girl :-)<br/>\nMarji for making the drive down into a fun experience and for singing <br/>\nthat Star Wars song every time Heather and Liam asked for it (we know it <br/>\nby heart now!)<br/>\n<br/>\nAnd all the other wonderful women for making me feel welcome, Elissa, <br/>\nRen, Sandra, Pam S (I want her to be my sister), Joyce and her wonderful <br/>\ndaughter.<br/>\nAnd Heather says not to forget little Jayne who followed her around all <br/>\nweekend. She now wants this baby to be exactly the same :-)<br/>\n<br/>\nShyrley<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062018836","msgId":79271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNzAwMWMzNmNlMSQxMDFiYmFjMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79270,"nextInTopic":79274,"prevInTime":79270,"nextInTime":79272,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... Mine is off building mountain bike trails with a friend.  When he gets back, he ll probably be off doing something with his girlfriend.  Academics? Well,","messageBody":"<div id=\"ygrps-yiv-418371088\"><blockquote><span title=\"ireply\">&gt; Any advice would be most helpful...if I could just get a *peek*<br/>\n&gt; inside your *unschools* today.  What are your dc doing right this<br/>\n&gt; moment as you read my message?  What are your plans to do with them<br/>\n&gt; for when you get off the computer?<br/>\n<br/>\n </span></blockquote>Mine is off building mountain bike trails with a friend.  When he gets back,<br/>\nhe&#39;ll probably be off doing something with his girlfriend.  Academics?<br/>\nWell, last night he was reading the driving regs, in preparation for taking<br/>\nhis learners test in October.  He says (like last year) that he wants to do<br/>\nmore &quot;stuff&quot;, but like last year, he isn&#39;t more specific than that.  I think<br/>\nhe feels he&#39;s lacking in many academic areas and should fix that.  But I<br/>\ndon&#39;t think he wants to yet.  He admits that he didn&#39;t really want to last<br/>\nyear, which is why he didn&#39;t.  We&#39;ll see what he actually does.  The only<br/>\nthing I&#39;d like to see him doing more of in that area is thinking about what<br/>\nhe might want to do in the future, and seeing what requirements he might<br/>\nneed to fulfill.  He says he&#39;s planning to do that, so I&#39;ll just keep a<br/>\nlookout for career fairs and other resources of that nature.  By the way,<br/>\nhe&#39;s nearly 16.<br/>\nTia<br/>\n<br/>\n&quot;They that can give up essential liberty to obtain a little temporary safety<br/>\ndeserve neither liberty nor safety.&quot;  Ben Franklin<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: Vet story, was What are you doing this morning?","postDate":"1062016144","msgId":79267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDUwMWMzNmNkOSRkZWQ5NmNjMCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDEyZS4zMDk0MjMxOS4yYzdlNjU5OUBhb2wuY29tPg=="},"prevInTopic":79266,"nextInTopic":79269,"prevInTime":79266,"nextInTime":79268,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"Nancy, This story about your daughter s vet experiences needs to put into one of the Unschooling is fabulous type folders that some people are hosting!! How","messageBody":"<div id=\"ygrps-yiv-61964030\">Nancy,<br/>\n<br/>\nThis story about your daughter&#39;s vet experiences needs to put into one<br/>\nof the &quot;Unschooling is fabulous&quot; type folders that some people are<br/>\nhosting!! How delightful - another convert (ie the vet) - hope he has<br/>\nsome children of his own one day.<br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Moly has her life goal all planed out. She wants to go to K-State, she<br/>\neven knows what she needs to do to get into the vet school after her<br/>\nfour years of college are over. But I also know that Moly is only 9, she<br/>\nmay change it at any time. When we go to Manhattan to visit friends who<br/>\nown a pet store there, she asks to go to the college. She has toured the<br/>\nvet school and asked questions. <br/>\nShe takes our dog to the vet, follows the vet around asking questions.<br/>\nHe <br/>\nlets her look in the microscope at stool samples and gets his collection<br/>\nof hearts filled with worms, still born puppies and kittens, a fetal<br/>\ndeer fawn and other oddities out for her to examine. <br/>\n<br/>\nShe got to watch Maggie&#39;s spay last year. He recruited her one day to<br/>\nhelp <br/>\nwith bull dog puppies. He was doing a c-section and needed another pair<br/>\nof hands to help him, his assistant and the owner. She was ecstatic! I<br/>\ndid not ruin it for her by quizzing her and throwing a bunch of books at<br/>\nher to read. Our vet is always amazed at what she knows and he always<br/>\ncomments that we must really work hard on this and asks when does she<br/>\nfind time to do her animal things with all her other studies. In the<br/>\npast I have shrugged my shoulders and said nothing. But when she told<br/>\nthe vet that one of the bull dog puppies was &quot;mushy&quot; and she thought it<br/>\nmight have water on its brain and he examined it and told her she was<br/>\nright. He again made the comment that she must be neglecting other<br/>\nthings to learn about animals. I finally took the time to explain that<br/>\nMoly chooses to learn about animals, that she doesn&#39;t neglect anything<br/>\nbecause there isn&#39;t anything to neglect. He thought about that for a<br/>\nminute and said he wished someone had thought that way when he was a<br/>\nkid.&gt;&gt; <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-Discussion] Unschooling Mindset","postDate":"1062015642","msgId":79266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzNmNkOCRiNTBmMjQzMCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PGJpaXM2aStkbWpvQGVHcm91cHMuY29tPg=="},"prevInTopic":79260,"nextInTopic":79267,"prevInTime":79265,"nextInTime":79267,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1817248638\">&lt;&lt;Havn&#39;t there been schools who have stopped having recess time<br/>\naltogether?&gt;&gt;<br/>\n<br/>\nOne of the things that I have had to do, vigorously and often, is<br/>\nconsciously choose not to go down the path of discussing the practices<br/>\nof schools - good or bad. It is so easy, especially when in the position<br/>\nof having to defend one own&#39;s lifestyle to the unconvinced, to get<br/>\nsucked into an ever widening quagmire of school bashing. I walk away<br/>\nfrom ALL conversations about schools, for my own peace of mind. It is<br/>\nkind of a &quot;cold turkey&quot; approach to removing all the schoolish lingo and<br/>\nthinking from my mental vocabulary. I&#39;ve just HAD to do it to be free to<br/>\ngrow.<br/>\n<br/>\n&lt;&lt;I do believe in playtime.&gt;&gt;<br/>\n<br/>\nI do *not* believe in playtime. I believe in living a full life, with my<br/>\ndaughter engaging in activities that have some interest for her. If you<br/>\ndo not have playtime, then all activities can be viewed as having merit.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Following CM&#39;s method, we do our &quot;schooling&quot; during the morning hours<br/>\nand end at lunchtime.  The dc have all afternoon and night for &quot;play&quot;<br/>\nand learning on their own.&gt;&gt;<br/>\n<br/>\nJayn does some of her most intense and enriched reading, drawing,<br/>\nquestioning, and imaginary play at night. She often spends her morning<br/>\non quiet tv watching and reflection, and then usually wants to go for a<br/>\nswim.   <br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;I&#39;m trying to adjust to the whole unschooling mindset.  I&#39;m here with<br/>\na new thinking and I&#39;m looking to &quot;educate&quot; myself.  :-)&gt;&gt;<br/>\n<br/>\nWelcome to the wonderful journey. I urge you to follow Sandra&#39;s earlier<br/>\nsuggestions about the reading. It is like peeling an onion - just when<br/>\none thinks &quot;I&#39;ve got it&quot;, along comes another challenge to one&#39;s<br/>\nassumptions.<br/>\n<br/>\n&lt;&lt;What I&#39;m seeing is that it is the excited, enthuiastic hsers who <br/>\nraise excited, enthusiastic children.&gt;&gt;<br/>\n<br/>\nCome to the next Live and Learn conference - be blown away.<br/>\n<br/>\n <br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Unschooling Mindset","postDate":"1062015351","msgId":79260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCNzI4OUI3LjFEOTI5JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGJpaXE0ZStvYWNtQGVHcm91cHMuY29tPg=="},"prevInTopic":79259,"nextInTopic":79266,"prevInTime":79259,"nextInTime":79261,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... Wrong track. Some unschooling parents may do something more structured but that s because their kids ask for it. The vision you have of learning/education","messageBody":"<div id=\"ygrps-yiv-1250999849\">on 8/27/03 1:35 PM, Cay A. Gibson at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caygibson@...\">caygibson@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is that part of the concept behind unschooling?  Are am I way<br/>\n&gt; off track?  Does anyone do any &quot;planned&quot; study...such as FIAR or<br/>\n&gt; otherwise?<br/>\n<br/>\n </span></blockquote>Wrong track. Some unschooling parents may do something more structured but<br/>\nthat&#39;s because their kids ask for it.<br/>\n<br/>\nThe vision you have of learning/education (as most people do!) is of getting<br/>\nthe child from where she is to where she&#39;s supposed to go.<br/>\n<br/>\nBut for unschoolers there&#39;s no predefined end point. It&#39;s more like the<br/>\nnurturing of a tree, giving it the water and room and sunlight it needs to<br/>\ngrow into what it will become.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do believe in playtime.  Following CM&#39;s method, we do<br/>\n&gt; our &quot;schooling&quot; during the morning hours and end at lunchtime.  The<br/>\n&gt; dc have all afternoon and night for &quot;play&quot; and learning on their<br/>\n&gt; own.   So I&#39;m not questioning the playtime.<br/>\n<br/>\n </span></blockquote>Ah, but you are seeing it as a separate activity from life. It&#39;s like<br/>\ntextbooks to someone who is thinking in school terms.<br/>\n<br/>\nPlay to unschoolers is doing what they enjoy. When my daughter writes,<br/>\nthat&#39;s play to her. Play is how she spends her days. Learning happens as a<br/>\nside effect.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062015005","msgId":79259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNEQxMDFELjgwNzA0MDNAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PEJCNzIzQ0E0LjFEOEU3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0PiA8MDAxNzAxYzM2Y2I2JDk0NDZhMDEwJGJhZWFmZWE5QFNFWU1PVVJCVVRUUz4="},"prevInTopic":79256,"nextInTopic":79260,"prevInTime":79258,"nextInTime":79260,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... needs and are there to help them get what they want.  Anyone","messageBody":"<div id=\"ygrps-yiv-1191297211\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;We&#39;re not glued to our kids ;-) so much as we are aware of their <br/>\n </span></blockquote>needs and are there to help them get what they want.&gt;&gt;&gt;<br/>\n<br/>\n&lt;&lt;&lt;Joyce, I like the way you worded this.  It really does explain what I <br/>\ndo very well.&gt;&gt;&gt;<br/>\n<br/>\nAnyone have suggestions, other than &quot;direct interogation&quot;, for being <br/>\nmore aware of our kids needs?  My son is kind of quiet and hard to &quot;draw <br/>\nout&quot;.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: What are you doing this morning?","postDate":"1062014387","msgId":79269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODI3LjEyNTk0Ny4zMzIuMS5mcmVlZm9ybUBqdW5vLmNvbT4="},"prevInTopic":79267,"nextInTopic":79270,"prevInTime":79268,"nextInTime":79270,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"On Wed, 27 Aug 2003 17:35:10 -0000 Cay A. Gibson ... Unschooling is about everyone doing what they enjoy, so you d be free to do FIAR... but your kids might","messageBody":"<div id=\"ygrps-yiv-301856868\">On Wed, 27 Aug 2003 17:35:10 -0000 &quot;Cay A. Gibson&quot;<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caygibson@...\">caygibson@...</a>&gt; writes:<br/>\n<blockquote><span title=\"ireply\"> &gt;And, since I love literature and books, I enjoy FIAR  immensely.  <br/>\n<br/>\n </span></blockquote>Unschooling is about everyone doing what they enjoy, so you&#39;d be free to<br/>\ndo FIAR... but your kids might not want to join you, or they might want<br/>\nto just sit in on the stories but not do the other activities, or they<br/>\nmight want to skip the Monday and Tuesday activities and then modify the<br/>\nWednesday one, or whatever.<br/>\n<br/>\nWhat my daughter likes is theatre, so most days we have the structure of<br/>\na rehearsal at some point. She decides what to audition for and then<br/>\nafter casting she&#39;ll generally get a rehearsal schedule, and most<br/>\nevenings she&#39;ll ask me what&#39;s planned for the next day. She asks me to<br/>\nrun lines with her sometimes, and I do. She&#39;s never failed to be off-book<br/>\nby the deadline. Today she has rehearsal from 4:30 to 6:30, and I offered<br/>\nto take her shopping before that for an &quot;audition outfit&quot; - when I was a<br/>\nkid we always got a new outfit for the first day of school, and  since<br/>\nmost of her clothes are from thrift stores or hand-me-downs, we thought<br/>\ngetting a brand-new outfit would be a good thing. We also need to get a<br/>\nbirthday present for my grandma and one for a friend of hers - she&#39;s been<br/>\nchosing beads and making personalized necklaces for most of her friends&#39;<br/>\nbirthdays lately, so we&#39;ll probably do that.<br/>\n<br/>\nSometime late last night or early this morning she planned her next<br/>\nbirthday party, including writing a guest list and coming up with a list<br/>\nof places to possibly have the party. She has a group of friends from the<br/>\nbay area, where we used to live, and she wants to invite them, too, so<br/>\nshe was thinking of places in between Davis and Alameda. She&#39;ll be eleven<br/>\nin January, so this is really planning ahead...<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; But I <br/>\n&gt; really do want to have peace of mind on these *unschool* days that <br/>\n&gt; we pull while we&#39;re *unschooling* this year.  My lifestyle requires <br/>\n&gt; it this year.<br/>\n<br/>\n </span></blockquote>I don&#39;t think of unschooling as something you can do on some days but not<br/>\non others. Unschooling permeates our lives, and the basis of unschooling<br/>\nis my daughter&#39;s freedom to chose her own paths for learning. She started<br/>\nwriting a novel the other day, after writing very little for 5 years. It<br/>\nwas cool - I think I posted about it other places, but maybe not here. <br/>\n<br/>\nI do think having &quot;peace of mind&quot; with unschooling is important - but I<br/>\nthink you have to recognize it as your issue, and not put it on your<br/>\nkids. If you give the mssage that you&#39;re not feeling comfortable about<br/>\nunschooling because they&#39;re not learning certain things, or learning in<br/>\ncertain ways, then you&#39;re actively sabotaging the process and it won&#39;t<br/>\nwork. You&#39;re the one who needs to work on changing your beliefs about<br/>\nlearning and schooling...<br/>\n<br/>\nDar<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: What are you doing this morning?","postDate":"1062013849","msgId":79256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZS4zMDk0MjMxOS4yYzdlNjU5OUBhb2wuY29tPg=="},"prevInTopic":79253,"nextInTopic":79259,"prevInTime":79255,"nextInTime":79257,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/27/03 12:40:22 PM Central Daylight Time, caygibson@xspedius.net writes: I just wanted to make mention that *boxed* curriculum hsers think ","messageBody":"<div id=\"ygrps-yiv-511162579\">In a message dated 8/27/03 12:40:22 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caygibson@...\">caygibson@...</a> writes:<br/>\nI just wanted to make mention that *boxed* curriculum hsers think <br/>\nthat FIAR is unschooling in some ways.  They can&#39;t see a complete <br/>\nlearning style coming out of using FIAR.  It&#39;s more of an extra. <br/>\nThere are days we&#39;ve done only FIAR because I didn&#39;t want to do <br/>\nanything else.  And, since I love literature and books, I enjoy FIAR <br/>\nimmensely.  <br/>\n<br/>\nI guess what&#39;s considered work for someone may be considered fun for <br/>\nanother.  <br/>\n<br/>\nHuh?  Is that part of the concept behind unschooling?  Are am I way <br/>\noff track?  Does anyone do any &quot;planned&quot; study...such as FIAR or <br/>\notherwise?  I know I sound like a novie hsers...and I am a novice <br/>\n*unschooler*.  Maybe I&#39;m asking all the wrong questions.  But I <br/>\nreally do want to have peace of mind on these *unschool* days that <br/>\nwe pull while we&#39;re *unschooling* this year.  My lifestyle requires <br/>\nit this year.<br/>\nI have noticed that school-at-home hsers think FIAR is unschooling too. The <br/>\nproblem with that is answered in your first statement above. &quot;I don&#39;t want to <br/>\ndo anything else, And, since I love literature and books, I enjoy FIAR <br/>\nimmensely.&quot; You said &quot;I&quot; not &quot;the kids...&quot; What would your kids like to be doing? <br/>\nWould they enjoy reading comics or gaming magazines or watching TV, or climbing <br/>\ntrees, or hiking through the woods, as opposed to reading through a list of <br/>\nbooks designed to guide them through subjects? Because that is what FIAR is. You <br/>\nread a book and then do activities or units of study based on the book. You do <br/>\nFIAR because YOU enjoy it. As unschoolers, my kids read a book because they <br/>\nwant to and they may or may not play or do something because of what they read. <br/>\nAnd I don&#39;t structure activities based on what they are reading. They read for <br/>\nenjoyment, or to learn about something they want to know about. Like Moly <br/>\nthis morning wanted to know about Columbus landing in America. She was coloring, <br/>\nstopped, looked up her answer, and went back to coloring. I did not question <br/>\nher on her knowledge, I didn&#39;t force her to look anything up, or design an <br/>\nassignment based on her question. She found out what she wanted to know and left <br/>\nit at that. <br/>\n<br/>\nThen you said you want peace of mind on these &quot;unschool&quot; days you &quot;pull while <br/>\nyou are unschooling this year.&quot; Unschooling isn&#39;t something you &quot;do&quot; on a <br/>\ncertain day or for a year. Unschooling isn&#39;t a plan of sort, it is just life. You <br/>\nhave to separate the word you know as school from your vocabulary if you want <br/>\nto unschool. You have to stop putting unschooling in quotes, as if it is just <br/>\nanother description of the kind of school-at-home you do. Many of us describe <br/>\nunschooling as child led learning. BUT that doesn&#39;t mean we take an interest <br/>\nof our child and turn it into a unit study. That would be eclectic schooling. <br/>\n<br/>\nYour peace of mind comes from trusting that children will learn what they <br/>\nneed to know, when they need to know it. It comes from knowing that a momentary <br/>\ninterest in when Columbus came to America is all she needs to know at that <br/>\nparticular time. Now Moly knows, she will remember it, I won&#39;t have to test her on <br/>\nit. You also have to know when an interest is momentary and when it is long <br/>\nterm. Moly want&#39;s to be a vet. She has wanted this since forever. I do as much <br/>\nas possible to provide things she can use toward this goal. Her interest in <br/>\nColumbus was here and gone. But I am sure she will remember it always, unlike <br/>\nme, who learned it at a set time in school, spent days on the subject, probably <br/>\ndid some sort of report on it, had a test and promptly forgot. So before you <br/>\ndo anything you can ask yourself, is this momentary or lasting? Many times I <br/>\nhave disappointed myself and ruined a child&#39;s interest in something because I <br/>\nwent overboard. <br/>\n<br/>\nMoly has her life goal all planed out. She wants to go to K-State, she even <br/>\nknows what she needs to do to get into the vet school after her four years of <br/>\ncollege are over. But I also know that Moly is only 9, she may change it at any <br/>\ntime. When we go to Manhattan to visit friends who own a pet store there, she <br/>\nasks to go to the college. She has toured the vet school and asked questions. <br/>\nShe takes our dog to the vet, follows the vet around asking questions. He <br/>\nlets her look in the microscope at stool samples and gets his collection of <br/>\nhearts filled with worms, still born puppies and kittens, a fetal deer fawn and <br/>\nother oddities out for her to examine. <br/>\n<br/>\nShe got to watch Maggie&#39;s spay last year. He recruited her one day to help <br/>\nwith bull dog puppies. He was doing a c-section and needed another pair of hands <br/>\nto help him, his assistant and the owner. She was ecstatic! I did not ruin it <br/>\nfor her by quizzing her and throwing a bunch of books at her to read. Our vet <br/>\nis always amazed at what she knows and he always comments that we must really <br/>\nwork hard on this and asks when does she find time to do her animal things <br/>\nwith all her other studies. In the past I have shrugged my shoulders and said <br/>\nnothing. But when she told the vet that one of the bull dog puppies was &quot;mushy&quot; <br/>\nand she thought it might have water on its brain and he examined it and told <br/>\nher she was right. He again made the comment that she must be neglecting other <br/>\nthings to learn about animals. I finally took the time to explain that Moly <br/>\nchooses to learn about animals, that she doesn&#39;t neglect anything because there <br/>\nisn&#39;t anything to neglect. He thought about that for a minute and said he <br/>\nwished someone had thought that way when he was a kid. <br/>\n<br/>\nTo get unschooling, you have to get life. You read because you enjoy it. You <br/>\nlearn about something because you want to. Let that be your guide with your <br/>\nchildren too. Give them that same freedom and curtsey. <br/>\n<br/>\n~Nancy<br/>\n<br/>\nEveryone has talent. What is rare is the courage to follow the talent to the <br/>\ndark place where it leads. <br/>\nErica Jong <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":45073,"authorName":"amycats2@aol.com","from":"amycats2@...","profile":"amycats2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062011854","msgId":79253,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlLjNkMmMxYjY5LjJjN2U1ZGNlQGFvbC5jb20+"},"prevInTopic":79248,"nextInTopic":79256,"prevInTime":79252,"nextInTime":79254,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... We had a Not-Back-to-School picnic at a local metropark. There were about 20 families attending so maybe 70-ish people total. It was so cool to see all the","messageBody":"<div id=\"ygrps-yiv-1451176554\"><blockquote><span title=\"ireply\">&gt; What are your plans to do with them<br/>\n&gt; &gt;for when you get off the computer?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>We had a Not-Back-to-School picnic at a local metropark. There were about 20 <br/>\nfamilies attending so maybe 70-ish people total. It was so cool to see all the <br/>\nmoms connecting and all the kids running around together. <br/>\nAmy Kagey<br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;\">http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;</a>&gt;my Usborne Books website!&lt;/A&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152271008,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"jonkream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-Discussion] motivational self-study","postDate":"1062009734","msgId":79270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOTMwMWMzNmNjYSRlZjJiOTNmMCQ2NDAwYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PGJpaXJpMysydmRmQGVHcm91cHMuY29tPg=="},"prevInTopic":79269,"nextInTopic":79271,"prevInTime":79269,"nextInTime":79271,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... for learning, a love and excitment of new learning adventures.  Who aren t scared of answering questions put to them. **These are two totally different","messageBody":"<div id=\"ygrps-yiv-1937044928\"><blockquote><span title=\"ireply\">&gt;&gt;I guess it&#39;s seeing some children who have a wholesome enthuasiasm<br/>\n </span></blockquote>for learning, a love and excitment of new learning adventures.  Who<br/>\naren&#39;t scared of answering questions put to them.<br/>\n<br/>\n**These are two totally different things, though.  I love to learn new<br/>\nthings, but I don&#39;t like to be put on the spot.   I think that a fear of<br/>\nanswering questions can come from a fear of giving the &#39;wrong&#39; answer.  The<br/>\nunschooled kids I&#39;ve met (and I met bunches this weekend!) don&#39;t have that<br/>\nfear.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I dread when we&#39;re<br/>\n </span></blockquote>in a situation around other hsers or public school children and my<br/>\ndc clam up.<br/>\n<br/>\n**Why?  Does it upset them?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But he does this mostly<br/>\n </span></blockquote>at home...not around his friends.<br/>\n<br/>\n**I mean this in the nicest way, but, so what?  Let him decide where and<br/>\nwith whom he&#39;s comfortable sharing parts of himself.  Does it really matter<br/>\nif his friends know that he can speak Latin?  Is it anyone&#39;s business what<br/>\nhe knows or doesn&#39;t know?    What we know isn&#39;t who we *are*.   ~Rue<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":70316959,"authorName":"AimeeL73@cs.com","from":"AimeeL73@...","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062008302","msgId":79248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyYy4zMGIxNzg4NC4yYzdlNGZlZUBjcy5jb20+"},"prevInTopic":79247,"nextInTopic":79253,"prevInTime":79247,"nextInTime":79249,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... Alex has the video camera out again, and I m about to film him reading the weather, he has it all printed out from the net.  He s doing the local news, I ","messageBody":"<div id=\"ygrps-yiv-1019353868\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caygibson@...\">caygibson@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; What are your dc doing right this <br/>\n&gt; moment as you read my message?  What are your plans to do with them <br/>\n&gt; for when you get off the computer?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Alex has the video camera out again, and I&#39;m about to film him reading the <br/>\nweather, he has it all printed out from the net.  He&#39;s doing the local news, I <br/>\nsuppose. :-)  <br/>\n<br/>\n~Aimee <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":72925035,"authorName":"Cay A. Gibson","from":"&quot;Cay A. Gibson&quot; &lt;caygibson@...&gt;","profile":"gibsevengang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling Mindset","postDate":"1062007825","msgId":79247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJpaXM2aStkbWpvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGI5LjM1OGYzM2YxLjJjN2U0OWNkQGFvbC5jb20+"},"prevInTopic":79245,"nextInTopic":79248,"prevInTime":79246,"nextInTime":79248,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... playing is ... when they are ... Nancy, yes, your post was helpful...as well as everyone else s.  I ahve lots to think about tonight.  And I do understand","messageBody":"<div id=\"ygrps-yiv-490332541\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a>, Dnowens@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I am concerned that you are making statements <br/>\n&gt; about &quot;just playing&quot; and &quot;otherwise they&#39;re off playing&quot; as if <br/>\n </span></blockquote>playing is <br/>\n<blockquote><span title=\"ireply\"> &gt; frivolous and something to be discouraged. My kids learn the most <br/>\n </span></blockquote>when they are <br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;just&quot; playing. &gt;&gt;<br/>\n<br/>\n </span></blockquote>Nancy,<br/>\nyes, your post was helpful...as well as everyone else&#39;s.  I ahve <br/>\nlots to think about tonight.  And I do understand that play is <br/>\nhighly under-rated in today&#39;s highly competitive world.  Havn&#39;t <br/>\nthere been schools who have stopped having recess time altogether?<br/>\n<br/>\nI do believe in playtime.  Following CM&#39;s method, we do <br/>\nour &quot;schooling&quot; during the morning hours and end at lunchtime.  The <br/>\ndc have all afternoon and night for &quot;play&quot; and learning on their <br/>\nown.   So I&#39;m not questioning the playtime.  I&#39;m trying to adjust to <br/>\nthe whole unschooling mindset.  I&#39;m here with a new thinking and I&#39;m <br/>\nlooking to &quot;educate&quot; myself.  :-)<br/>\n<br/>\nIf I come across asking the wrong type question or sounding like <br/>\na &quot;structured&quot; person, you will all have to excuse me.  I have lived <br/>\nin &quot;structure&quot; all my life.  But, with the birth of each baby, my <br/>\nlife has become a little more unstructured.  I want to use this <br/>\nunstructured lifestyle to our advantage. <br/>\n<br/>\nWhat I&#39;m seeing is that it is the excited, enthuiastic hsers who <br/>\nraise excited, enthusiastic children.  <br/>\n<br/>\nBlessings,<br/>\nCay<br/>\nmom to Corey 15.11, Kayleigh 13.3, Garrett 10.5, Chelsea 5.10, and <br/>\nAnnie 20 months<br/>\n<br/>\nAuthor of &quot;Literature Alive!&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"http://literaturealive.tripod.com\">http://literaturealive.tripod.com</a><br/>\nTake the boredom out of reading and make literature come Alive! <br/>\nwithin your home!</div>","specialLinks":[]},{"userId":72925035,"authorName":"Cay A. Gibson","from":"&quot;Cay A. Gibson&quot; &lt;caygibson@...&gt;","profile":"gibsevengang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"motivational self-study","postDate":"1062007171","msgId":79245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJpaXJpMysydmRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNWQwMWMzNmNiNyQ1NWVmNThiMCQ2NDAwYThjMEBsaXZpbmdyb29tMT4="},"prevInTopic":79244,"nextInTopic":79247,"prevInTime":79244,"nextInTime":79246,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... the ... ~Rue   Thanks for the question, Rue. Honestly I haven t stopped to wonder what I admired about it. I guess it s seeing some children who have a","messageBody":"<div id=\"ygrps-yiv-1021388384\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a>, &quot;Jon and Rue Kream&quot; <br/>\n&lt;skreams@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi Cay -<br/>\n&gt; <br/>\n&gt; &gt;&gt;I admire hs families whose dc do self-study on their own during <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; day.<br/>\n&gt; <br/>\n&gt; **What do you admire about it?<br/>\n </span></blockquote>~Rue  &gt;&gt;<br/>\n<br/>\n<br/>\nThanks for the question, Rue.<br/>\nHonestly I haven&#39;t stopped to wonder what I admired about it.<br/>\n<br/>\nI guess it&#39;s seeing some children who have a wholesome enthuasiasm <br/>\nfor learning, a love and excitment of new learning adventures.  Who <br/>\naren&#39;t scared of answering questions put to them.<br/>\n<br/>\nI&#39;m not saying me dc aren&#39;t like this...they are about some <br/>\nthings...the things they&#39;re interested in.  But I dread when we&#39;re <br/>\nin a situation around other hsers or public school children and my <br/>\ndc clam up.  I feel like they&#39;re hiding their talent and knowledge <br/>\nunder a bushel basket.  Not that I want them to come off like &quot;no-it-<br/>\nalls&quot; but.... Example, my middle ds mumbles terribly.<br/>\n<br/>\nYet we&#39;re taking a Latin class this year that meets once a week.  <br/>\nHe&#39;s repeating the Latin like it&#39;s old shoe.  I&#39;m still trying to <br/>\nremember how to say, &quot;My name is...&quot;  :-)  But he does this mostly <br/>\nat home...not around his friends.<br/>\n<br/>\nIt&#39;s funny...my oldest ds was talking to me the other day and <br/>\nthe &quot;stuff&quot; he was telling me.  And it was brilliant stuff (for lack <br/>\nof a better word...information?) What struck me the most about all <br/>\nthe things he was telling me is that we never &quot;studied&quot; any of that <br/>\nstuff (info?).  I don&#39;t ever remember this as &quot;subject&quot; matter.  I <br/>\neven asked him how he knew all that &quot;stuff&quot;.  He said he just knew <br/>\nit...had picked it up here and there or read about it.  That was <br/>\njust the other day...the day I started thinking that maybe <br/>\nunschooling wasn&#39;t such a bad idea.<br/>\n<br/>\nAlso, he went to the Grand Canyon this summer with my parents.  My <br/>\ndad, a highly intellectual person, came back very impressed with <br/>\nthis young grandson.  My son is a worry-wart and at times seems <br/>\nunsure of himself.  He has been accused of being unfocused.  But my <br/>\nparents were nothing short of impressed.  My father was amazed at <br/>\nthe things Corey knew and said he handles himself well and is very <br/>\nsharp-witted and quick with information.<br/>\n<br/>\nAnd who is more observant of a child than the parents?  The <br/>\ngrandparents.  They look with critical eyes at the parents and <br/>\nwatchful eyes upon the child.  My parents were basically <br/>\nsaying, &quot;You&#39;ve done a great job with this young man&#39;s training.&quot;<br/>\n<br/>\nI was speechless...and amazed at God&#39;s humility and compassion.<br/>\n<br/>\nAgain...maybe there is a lot to say about the unschooling <br/>\nlifestyle...which I&#39;m sure you will all let me know.  &lt;G&gt;<br/>\nBlessings,<br/>\nCay<br/>\nmom to Corey 15.11, Kayleigh 13.3, Garrett 10.5, Chelsea 5.10, and <br/>\nAnnie 20 months<br/>\n<br/>\nAuthor of &quot;Literature Alive!&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"http://literaturealive.tripod.com\">http://literaturealive.tripod.com</a><br/>\nTake the boredom out of reading and make literature come Alive! <br/>\nwithin your home!</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062006733","msgId":79244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5LjM1OGYzM2YxLjJjN2U0OWNkQGFvbC5jb20+"},"prevInTopic":79242,"nextInTopic":79245,"prevInTime":79243,"nextInTime":79245,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/27/03 09:22:18 AM Central Daylight Time, caygibson@xspedius.net writes: Yet (even after six years of hsing) I still think of the","messageBody":"<div id=\"ygrps-yiv-95983524\">In a message dated 8/27/03 09:22:18 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caygibson@...\">caygibson@...</a> writes:<br/>\nYet (even after six years of hsing) I still <br/>\nthink of the structured/disciplined learning that is happneing in a <br/>\nschool room today and I worry that my dc are just *playing* in the <br/>\nliving room.  <br/>\n<br/>\nI admire hs families whose dc do self-study on their own during the <br/>\nday.  My dc tend to wait for me to place something in front of <br/>\nthem...otherwise they&#39;re off *playing*.<br/>\n<br/>\nAny advice would be most helpful...if I could just get a *peek* <br/>\ninside your *unschools* today.  What are your dc doing right this <br/>\nmoment as you read my message?  What are your plans to do with them <br/>\nfor when you get off the computer?<br/>\nFirst, I think it is great that all five of your kids are playing together! <br/>\nThat is what mine are doing too. I am concerned that you are making statements <br/>\nabout &quot;just playing&quot; and &quot;otherwise they&#39;re off playing&quot; as if playing is <br/>\nfrivolous and something to be discouraged. My kids learn the most when they are <br/>\n&quot;just&quot; playing. <br/>\n<br/>\nThis morning my dh rolled out of bed, did his morning thing and then crawled <br/>\nback into bed with me. I heard something in my sleep that sounded like; &quot;I&#39;ve <br/>\ngot a few minutes, just wanted to cuddle...&quot; I went back to sleep and woke up <br/>\nwhen he kissed me good-bye. (I think he was late! &lt;g&gt;) The kids came <br/>\ndownstairs about 10 minutes later, Moly took our dog out and came back in and crawled <br/>\ninto bed with Jack and I. Maggie (the dog) got excited and jumped in bed too. <br/>\nAfter about 5 minutes of cuddle time Jack got up and fixed himself some cereal. <br/>\nMoly and I played &quot;Where&#39;s the puppy&quot; with Maggie for a few minutes then Moly <br/>\nwent and got some treats to show me she taught Maggie the down command. (She <br/>\nlearned it from Animal Planet when she was &quot;just&quot; watching TV &lt;g&gt;) Then she <br/>\nand I got up and fixed coffee. <br/>\n<br/>\nI spent time on the phone with a friend to make arraignments to help her pack <br/>\nfor a move and with my MIL who wanted to make plans for Christmas. The kids <br/>\nate breakfast and watched the last part of LOTR that they had missed last night <br/>\nwhen they fell asleep. Yep! The fell asleep on their own, no one told them to <br/>\ngo to bed. Moly got up when she was tired and went upstairs on her own. After <br/>\nthe movie was over, Darin woke Jack up enough to tell him he was still on the <br/>\nfloor and did he want to sleep there or go upstairs. Jack went upstairs. <br/>\n<br/>\nThey have played on the computer with some games they got from the library. <br/>\nMoly was coloring in a new American Girl coloring book (Kaya) she bought <br/>\nyesterday afternoon. She has been mowing yards this summer, and she had a lemonade <br/>\nstand during the fiesta and has earned quite a bit of money! She wanted to get <br/>\nthe coloring book at Barnes and Noble last week, but didn&#39;t have the $14 or so <br/>\non her. I had told her I would buy it for her, but she wanted to get it <br/>\nherself. Yesterday we were at Sam&#39;s Club and she found it for half what it is <br/>\nselling for at Barnes so she bought it. She asked, while coloring, where Columbus <br/>\nlanded when he first came to America. I told her I wasn&#39;t too sure, but I <br/>\nthought it was somewhere in the Bahamas. So she looked it up. I was right. Then her <br/>\nlittle brother asked if she wanted to play marbles with him so she put her <br/>\nthings up and they got all of his marbles out. Jack wanted to draw a circle on <br/>\nthe floor with chalk. I suggested a string tied to make a circle. They thought <br/>\nthat was a great idea. I did too. &lt;g&gt; <br/>\n<br/>\nDarin got home to eat and give me the car, the kids had tons of things to <br/>\nshow him. Right now they are building with Moly&#39;s new Ello set of fairies. Darin <br/>\nasked me if I was going to bring in my plants off the front porch today. I <br/>\nsaid yes. Then he asked the kids if they would please clean the porch off so he <br/>\ncan sand it this weekend. Moly asked if he wanted it done right now or just <br/>\nsometime, he said whenever. No yelling or demanding, no time limit, just a nice <br/>\nrequest and I am sure the kids will do it for him. Jack wants to help sand. <br/>\nDarin said he will look for small eye goggles, Jack said he can use his swim <br/>\nmask. Yes he can, great idea! <br/>\n<br/>\nMoly went and got the sand paper pads for the sander and is now trying to <br/>\nfigure out how many pads they will need for the porch. Jack suggested measuring <br/>\nthe porch so they have abandoned the Ello set and Daddy and are off in search <br/>\nof a measuring tape. Darin wants to go back to work soon, so I will leave the <br/>\nkids to their &quot;math&quot; and take him back. Darin is still &quot;playing&quot; with the Ello. <br/>\nThis afternoon we will go swimming and I will take them to a friends house to <br/>\nplay so I can go help my other friend pack for her move. <br/>\n<br/>\nSome days we &quot;do&quot; more than others. Mostly we just live and go with what ever <br/>\npresents itself at the moment. Hope this helps.<br/>\n<br/>\n~Nancy<br/>\nHe felt that his whole life was some kind of dream and he sometimes wondered <br/>\nwhose it was and whether they were enjoying it.<br/>\nDouglas Adams <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":72925035,"authorName":"Cay A. Gibson","from":"&quot;Cay A. Gibson&quot; &lt;caygibson@...&gt;","profile":"gibsevengang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What are you doing this morning?","postDate":"1062005710","msgId":79242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJpaXE0ZStvYWNtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJpaWl2MitobjJmQGVHcm91cHMuY29tPg=="},"prevInTopic":79241,"nextInTopic":79244,"prevInTime":79241,"nextInTime":79243,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"...  wrote: I blew her away talking about how we DON T do ... I am SO enjoying everyone s answers...trying to keep up with the replies.  :-) ","messageBody":"<div id=\"ygrps-yiv-1042110826\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a>, &quot;Teresa&quot; <br/>\n&lt;TeresaBnNC@a...&gt; wrote:<br/>\n  I blew her away talking about how we DON&quot;T do <br/>\n<blockquote><span title=\"ireply\"> &gt; school. LOL.. they do FIAR. <br/>\n<br/>\n<br/>\n </span></blockquote>I am SO enjoying everyone&#39;s answers...trying to keep up with the <br/>\nreplies.  :-)<br/>\n<br/>\nthis remark by Teresa really perked my ears up...or caused my <br/>\neyebrow to raise ...being the case of email. ;-)  The reason is <br/>\nbecause I use FIAR and love it.  I know Teresa doesn&#39;t mean anything <br/>\nagainst FIAR when she shared this...and I&#39;m not taking it that way.  <br/>\n<br/>\nI just wanted to make mention that *boxed* curriculum hsers think <br/>\nthat FIAR is unschooling in some ways.  They can&#39;t see a complete <br/>\nlearning style coming out of using FIAR.  It&#39;s more of an extra. <br/>\nThere are days we&#39;ve done only FIAR because I didn&#39;t want to do <br/>\nanything else.  And, since I love literature and books, I enjoy FIAR <br/>\nimmensely.  <br/>\n<br/>\nI guess what&#39;s considered work for someone may be considered fun for <br/>\nanother.  <br/>\n<br/>\nHuh?  Is that part of the concept behind unschooling?  Are am I way <br/>\noff track?  Does anyone do any &quot;planned&quot; study...such as FIAR or <br/>\notherwise?  I know I sound like a novie hsers...and I am a novice <br/>\n*unschooler*.  Maybe I&#39;m asking all the wrong questions.  But I <br/>\nreally do want to have peace of mind on these *unschool* days that <br/>\nwe pull while we&#39;re *unschooling* this year.  My lifestyle requires <br/>\nit this year.<br/>\n<br/>\nBlessings,<br/>\nCay<br/>\nMom to Corey 15.11, Kayleigh 13.3, Garrett 10.5, Chelsea 5.10, and <br/>\nAnnie 20 months<br/>\n<br/>\nAuthor of &quot;Literature Alive!&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"http://literaturealive.tripod.com\">http://literaturealive.tripod.com</a><br/>\nTake the boredom out of reading and make literature come Alive! <br/>\nwithin your home!</div>","specialLinks":[]},{"userId":112382817,"authorName":"zanhawk","from":"&quot;zanhawk&quot; &lt;zanhawk@...&gt;","profile":"indy32mom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062003263","msgId":79239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjMwMWMzNmNiYiRkZThhMGZlMCQxMWZlYThjMEBzcGVlZGRlYW1vbj4=","referencesHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79237,"nextInTopic":79241,"prevInTime":79238,"nextInTime":79240,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"We slept in this morning (that happens alot as we always stay up past midnight) It was storming this AM when dh got up for work  It was great sleeping weather.","messageBody":"<div id=\"ygrps-yiv-777433298\">We slept in this morning (that happens alot as we always stay up past<br/>\nmidnight)<br/>\nIt was storming this AM when dh got up for work  It was great sleeping<br/>\nweather.  Shortly after dh left (poor guy, we wish he could stay home and<br/>\nplay everyday) Max (9yo) got up and played Gauntlet on the gamecube.  He<br/>\nthen went to the family room and watched some morning cartoons. Then I got<br/>\nup.  Sam (12yo girl) woke up shortly after me. They had breakfast (cereal).<br/>\nRight now Sam is helping out by doing the dishes. Max is doing a combination<br/>\nof picking up toys and such from the family room floor while doing some<br/>\nkarate type moves and making fighting noises LOL<br/>\nI am wriiting (of course) and petting the dog, wondering if I really have to<br/>\ngoto the grocery store today (I hate shopping). DH will be home for lunch in<br/>\nabout 2 hours.  We usually eat lunch while DH and I dicuss current events<br/>\n(politics, news articles, etc) The kids almost always get in on the<br/>\ndiscussion.<br/>\nMax is planning a game that he wants to play with his best friend this<br/>\nafternoon after PS gets out. He is telling me about the props they will use<br/>\nand what characters they have decided to play.  Sam and I will probably play<br/>\nwith the sewing machine again. She has shown a great interest in learning to<br/>\nsew recently.  So we dug out the machine last week, bought some remnants to<br/>\npractice on, and some patterns. A local homeschooler is offering classes for<br/>\nsewing, and Sam really wants to do it.  I&#39;ve got to call today and find out<br/>\nwhen the classes start. After that we may watch a movie, read, play games or<br/>\nwhatever suits us. Sam has been going thru some tough times recently with<br/>\nher best friend (she is in public school, we&#39;ll call her &quot;B&quot;) B&#39;s Mom has<br/>\nbeen trying to talk Sam into going to PS all summer.  She said that B is<br/>\ntaking all honors courses and will not have time for friends &quot;except at<br/>\nschool&quot;  ARGH! So instead of seeing B everyday, now she is lucky to see her<br/>\nonce a week and she just lives down the block. So Sam has been spending more<br/>\ntime with me and/or a homeschooled boy (first big crush LOL) that lives down<br/>\nthe street.  I am sure around 3pm today kids will begin to show up on our<br/>\ndoorstep asking if the kids can play. This evening someone will probably<br/>\nhelp me with dinner. One of my friends will probably stop by.  When DH gets<br/>\nhome we will talk about stuff over dinner.  He will more than likely play a<br/>\ngame at the kids request.<br/>\n<br/>\nThe possibilities are endless.  Some days we are out all day long. Our plans<br/>\ncould change at any moment, we fly by the seat of our pants around here and<br/>\nwe love it!<br/>\n<br/>\nJamie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Cay A. Gibson&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caygibson@...\">caygibson@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a>&gt;<br/>\nSent: Wednesday, August 27, 2003 9:18 AM<br/>\nSubject: [Unschooling-Discussion] What are you doing this morning? </span></blockquote></div>","specialLinks":[]},{"userId":129185313,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;mimi36@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[Unschooling-Discussion] Re: What are you doing this morning?","postDate":"1062001674","msgId":79235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWMwMWMzNmNiOCQyYjE1M2JlMCRjOTQyMjZkMEBuZXQ+"},"prevInTopic":79234,"nextInTopic":79237,"prevInTime":79234,"nextInTime":79236,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"Hello Cay, I, too, have been lurking and reading. Have learned much and am sure will learn more. I have 3 dd ages 16, 14, and 11. Everyday is different for us","messageBody":"<div id=\"ygrps-yiv-1463622071\">Hello Cay,<br/>\n<br/>\nI, too, have been lurking and reading. Have learned much and am sure will learn more. I have 3 dd ages 16, 14, and 11. Everyday is different for us for the most part. We plan some activities around things we are interested in. Especially if something special is going on in the area. We usually find out about events in the local paper or a local parents magazine. I am always on the look out for anything that we may want to do, either at home or away from home. And not everyone needs to participate. I am fortunate that the girls are interested in a number of the same things, but if not they are capable (ready) to stay home if they do not want to come along. <br/>\n<br/>\nThat said, right now all 3 girls are watching  The Lord of the Rings: The Two Towers. Our entire family LOVES this series and have anxiously awaited the release on dvd. I picked it up yesterday but since it is a long movie and the OC was on last night they waited until today to watch it. I will be making popcorn soon. Earlier this a.m. my 16 you spent time on the computer(2hrs). She has a wide variety of interests and surfs the net for just about everything. She  loves fantasy and I found a free e-course about the Lord of the Rings for her to participate in. My 14 year old volunteers at a local horse ranch and also takes lessons there. So that is her passion and I try to encourage that as much as possible. In September she will partcipate in a pony show to raise money for The Minnesota Animal Hooved Rescue. I also will be there again this year to work the concession stand. She is a little more shy and quite than my other 2 so having me close by puts her more at ease and she will more likely want to participate. My 11 year old loves science and art. So I always make sure she has a wide variety of art supplies (right now there are great sales going on) and science books/ magazines around for her. Also web sites can be found for just about any interests. We live on a hobby farm, so everyone helps out (spoils, plays) with the animals. Right now they include 3 dogs, 3 cats, 3 rabbits, 9 hens, 2 Bantam roosters, 4 ducks and 1 African goose. We hope to expand soon with dairy goats. And eventually sheep. Before we add any animal the girls and I do research about different breeds and their needs.We also have a large bird feeding station and are always watching the daily activity.<br/>\n<br/>\nSorry this is longer than I had planned, but I still could add more. I guess we are busier than I thought. And I didn&#39;t even add some of their planned activites. No wonder I am so tired some days! :) But I wouldn&#39;t want it anyother way! <br/>\n<br/>\nMelissa in Minnesota<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152271008,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"jonkream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062001315","msgId":79241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWQwMWMzNmNiNyQ1NWVmNThiMCQ2NDAwYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79239,"nextInTopic":79242,"prevInTime":79240,"nextInTime":79242,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"Hi Cay - ... day. **What do you admire about it? The kids and I do some things on our own, some things together, and some things alone while physically","messageBody":"<div id=\"ygrps-yiv-538472438\">Hi Cay -<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I admire hs families whose dc do self-study on their own during the<br/>\n </span></blockquote>day.<br/>\n<br/>\n**What do you admire about it?<br/>\n<br/>\nThe kids and I do some things on our own, some things together, and some<br/>\nthings alone while physically together throughout the day.  Right now Rowan<br/>\nis watching Scooby Doo and occasionally drawing, Dagny is 1/2 watching and<br/>\nwriting something, and I am 1/2 listening and writing to you :0). A while<br/>\nago Rowan was trying to figure out how to set her watch and playing with the<br/>\ndogs, Dagny was checking out the message boards and playing with some<br/>\nmagnets and common pins, and I was unpacking and doing laundry from our trip<br/>\nto the conference so we can go camping in two days. We&#39;re all pretty tired,<br/>\nso I expect we&#39;ll maybe watch a movie or go lay on the hammock for a while.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My dc tend to wait for me to place something in front of<br/>\n </span></blockquote>them...otherwise they&#39;re off *playing*.<br/>\n<br/>\n**Off playing is good!  I guess you could call some of the things my kids do<br/>\n&#39;self-study&#39;, but if you asked them they&#39;d say they were playing.  It&#39;s not<br/>\n*just* play.  It&#39;s PLAY!!!  Children do it because they know what they need.<br/>\nWe&#39;re taught not to value play, and to think it&#39;s something people should<br/>\noutgrow a desire for, but it is valuable, and I hope to be playing all my<br/>\nlife.  What&#39;s more important than joy and imagining and thinking and<br/>\ndreaming and learning and hoping and creativity?  Play is all of those<br/>\nthings and more.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Any advice would be most helpful...if I could just get a *peek*<br/>\n </span></blockquote>inside your *unschools* today.  What are your dc doing right this<br/>\nmoment as you read my message?  What are your plans to do with them<br/>\nfor when you get off the computer?<br/>\n<br/>\n**I&#39;d imagine that what my kids do on a daily basis isn&#39;t so different from<br/>\nwhat your kids want to do.  What&#39;s different is how what they&#39;re doing is<br/>\nviewed.  In our house fun is important, play is valuable, and learning is<br/>\neverywhere.   We&#39;re not much interested in &quot;disciplined learning&quot;, since the<br/>\nundisciplined kind is much more fun :0).  ~Rue<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154033277,"authorName":"Crystal","from":"&quot;Crystal&quot; &lt;crystal.pina@...&gt;","profile":"crystalinma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1062000991","msgId":79234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTcwMWMzNmNiNiQ5NDQ2YTAxMCRiYWVhZmVhOUBTRVlNT1VSQlVUVFM+","referencesHeader":"PEJCNzIzQ0E0LjFEOEU3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":79233,"nextInTopic":79235,"prevInTime":79233,"nextInTime":79235,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... aware of their needs and are there to help them get what they want. Joyce, I like the way you worded this.  It really does explain what I do very well. ","messageBody":"<div id=\"ygrps-yiv-611506849\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;We&#39;re not glued to our kids ;-) so much as we are<br/>\n </span></blockquote>aware of their needs and are there to help them get what they want.&gt;&gt;&gt;<br/>\n<br/>\nJoyce, I like the way you worded this.  It really does explain what I do<br/>\nvery well.<br/>\n<br/>\nCrystal</div>","specialLinks":[]},{"userId":36624936,"authorName":"Jenny E.","from":"&quot;Jenny E.&quot; &lt;mom2jrjedis@...&gt;","profile":"mom2jrjedis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1061999792","msgId":79232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWMzNmNiMyRjOTU5NjI5MCQwN2U0MWI0MkBFbGxpb3R0RmFtaWx5Pg==","referencesHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79231,"nextInTopic":79233,"prevInTime":79231,"nextInTime":79233,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... Right now it is 8:50am.  I just got up and started some coffee.  Hubby and boys  (7and just about 5) are still in bed.  Hubby will probably get up in about","messageBody":"<div id=\"ygrps-yiv-1992550321\"><blockquote><span title=\"ireply\">&gt; What are your dc doing right this<br/>\n&gt; moment as you read my message?  What are your plans to do with them<br/>\n&gt; for when you get off the computer?<br/>\n<br/>\n </span></blockquote>Right now it is 8:50am.  I just got up and started some coffee.  Hubby and<br/>\nboys  (7and just about 5) are still in bed.  Hubby will probably get up in<br/>\nabout 30 minutes to start getting ready for work.  The boys may get up any<br/>\ntime or they may sleep until 10:30 when they need to get up so we can take<br/>\nHubby to work.  After taking him to work, the boys and I will get ready for<br/>\nlibrary day with our homeschool group.  Some of the group may decide to go<br/>\nfor ice cream today.  Not sure if we will go to ice cream or not.  After<br/>\nthat we need to head to Babies R Us to find a baby shower gift.  Then it&#39;s<br/>\nhome to whatever the day brings us.<br/>\n<br/>\nThe day will depend on what they boys want to do.  There are no plans.  We<br/>\nmay get some cool book at the library that has a project or experiment in<br/>\nit, maybe they will just want to read their books without me...maybe with<br/>\nme.  They may want to watch a movie or play video games or fantasy<br/>\nplay....there is no telling right now.<br/>\n<br/>\nNamaste,<br/>\nJen  :o)<br/>\nMom to Beck (7) and Dane (4...almost 5!)<br/>\nLearning the natural way every day!</div>","specialLinks":[]},{"userId":154033277,"authorName":"Crystal","from":"&quot;Crystal&quot; &lt;crystal.pina@...&gt;","profile":"crystalinma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1061998650","msgId":79231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWMzNmNiMSQyMTA2NTQ2MCRiYWVhZmVhOUBTRVlNT1VSQlVUVFM+","referencesHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79229,"nextInTopic":79232,"prevInTime":79230,"nextInTime":79232,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... Our day so far has been pretty boring.  Erica got up around 8:30.  She went on the computer.  She was coordinating all her Yahoo IDs with their passwords","messageBody":"<div id=\"ygrps-yiv-543179600\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;if I could just get a *peek* inside your *unschools* today.&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Our day so far has been pretty boring.  Erica got up around 8:30.  She went<br/>\non the computer.  She was coordinating all her Yahoo IDs with their<br/>\npasswords and writing them down in her notebook when I got up because she&#39;s<br/>\ngot so many that she&#39;s starting to forget which screen name goes with which<br/>\npassword.  Sean and I were still sleeping.<br/>\n<br/>\nAround 9:30 my grandson called and woke me up.  He&#39;s only 19 months but he<br/>\nwas pulling a chair toward the phone so my daughter said to him, &quot;who are<br/>\nyou calling&quot;.  He said &quot;grammy&quot;, so she called me and I talked to him.<br/>\nAfter Erica finished what she was doing I asked her for a turn at the<br/>\ncomputer.  This was about 10.  She made macaroni salad for lunch.  It came<br/>\nout pretty good.  She could have cooked the macaroni a minute longer, but it<br/>\ntasted good.  About 11 Sean got up and brought his laundry down to the<br/>\nbasement to wash it.<br/>\n<br/>\nRight now, they are both sitting on the couch watching music videos, eating<br/>\ntheir macaroni and arguing.  Something about large numbers, I&#39;m not really<br/>\nlistening.  Erica just had me stop writing this to find a poll on BET.com<br/>\nthat she wanted to vote in.<br/>\n<br/>\nLater we have to go to WalMart to pick up Sean&#39;s glasses.  He lost one of<br/>\nthe lenses so I had to leave them while they ordered the correct lens.  They<br/>\nwere done on Saturday but I was at the conference.  Poor kid had to go a<br/>\nweek without them.  I got some of Jim Weiss&#39; tapes so we&#39;re going to listen<br/>\nto one of them in the car on the way to WalMart.  My husband will probably<br/>\npick up my grandson on his way home from work to spend a couple of days with<br/>\nus.  We keep him until he asks to go home, usually 3 days is all he can take<br/>\nof us.<br/>\n<br/>\nYou should have asked this last night when we were discussing quantum<br/>\nphysics and whether or not time travel could be possible.  At least then we<br/>\nwouldn&#39;t look so boring!<br/>\n<br/>\nCrystal</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1061998499","msgId":79229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMC4yNDUwZDM3Yi4yYzdlMjlhM0Bhb2wuY29tPg=="},"prevInTopic":79227,"nextInTopic":79231,"prevInTime":79228,"nextInTime":79230,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"-=-I worry that my dc are just *playing* in the living room. -=- Try to separate (forever) just from playing. -=-I admire hs families whose dc do","messageBody":"<div id=\"ygrps-yiv-488840007\">-=-I worry that my dc are just *playing* in the <br/>\nliving room. -=- <br/>\n<br/>\nTry to separate (forever) &quot;just&quot; from &quot;playing.&quot;<br/>\n<br/>\n-=-I admire hs families whose dc do self-study on their own during the <br/>\nday.  My dc tend to wait for me to place something in front of <br/>\nthem...otherwise they&#39;re off *playing*.-=-<br/>\n<br/>\n&quot;During the day&quot; is a problem, if you want to get to unschooling.  Learning <br/>\nhappens ALL the time.  <br/>\n<br/>\nIf your children tend to wait for you to place something in front of them, <br/>\nthat&#39;s what you taught them by using structure.   Place this in front of them:  <br/>\nThe whole world and the freedom to be in it.<br/>\n<br/>\nThe self-study that needs to happen is all yours at this point.  When you <br/>\nlearn to see the value of play and to know where and how natural learning <br/>\nhappens, then unschooling can start to take off.<br/>\n<br/>\nDeschooling:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n(and go to some of the links at the bottom)<br/>\n<br/>\nTypical days:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<br/>\nLate-Night Learning:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/latenightlearning\">http://sandradodd.com/latenightlearning</a><br/>\n<br/>\nThis morning two of my kids are in New Mexico (probably asleep) and Marty, <br/>\nthe mid-kid, is with me at Kelly&#39;s house in South Carolina.  He&#39;s eating a pop <br/>\ntart and watching Scooby Doo at the Addam&#39;s Family (pretty cool episode).  <br/>\nKelly and Duncan are at the dentist.  Then we&#39;re going to pack our stuff into the <br/>\ncar and go to:<br/>\nfire engine museum<br/>\nalong with their family to get Cameron a skateboard<br/>\nan ice cream shop<br/>\nthe air port.<br/>\n<br/>\nI&#39;m sure Holly&#39;s asleep; it&#39;s 9:30 there, and she and I were up instant <br/>\nmessaging until 1:00 her time.  She&#39;s 11, and was thrilled to find me online.  I&#39;ve <br/>\nbeen gone since last Thursday.  We had had one phone conversation.<br/>\n<br/>\nKirby works at 5:00 (I think) at a gaming shop, so he&#39;ll probably sleep until <br/>\nnoon.  He&#39;ll be at work when I get home, probably.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":158112576,"authorName":"Teresa","from":"&quot;Teresa&quot; &lt;TeresaBnNC@...&gt;","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What are you doing this morning?","postDate":"1061998370","msgId":79237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJpaWl2MitobjJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFjMy5lMzA5YWFjLjJjN2UyNDE0QGFvbC5jb20+"},"prevInTopic":79235,"nextInTopic":79239,"prevInTime":79236,"nextInTime":79238,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... them ... This morning, Anna came in and woke me up around 9:45 am.  She wanted to go to the preschool, where my sister works as the Director,to volunteer.","messageBody":"<div id=\"ygrps-yiv-1934895888\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a>, LOWRIEK@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; In a message dated 27/08/2003 07:22:31 Pacific Daylight Time, <br/>\n&gt; caygibson@x... writes:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; Any advice would be most helpful...if I could just get a *peek* <br/>\n&gt; &gt; inside your *unschools* today.  What are your dc doing right this <br/>\n&gt; &gt; moment as you read my message?  What are your plans to do with <br/>\n </span></blockquote>them <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; for when you get off the computer?<br/>\n&gt; &gt; <br/>\n <br/>\n<br/>\n </span></blockquote>This morning, Anna came in and woke me up around 9:45 am.  She wanted <br/>\nto go to the preschool, where my sister works as the Director,to <br/>\nvolunteer.  She has been anxiously waiting all summer while public <br/>\nschool was out ( and preschool, that follows the ps schedule)to begin <br/>\nvolunteering when school started back.  Preschool started last week, <br/>\nbut it was very chaotic with new 2 yr olds beginning for the first <br/>\ntime, so she waited til this week when things calmed down a bit.  SO, <br/>\nI took her to preschool and my sister was getting ready to take her <br/>\nout to the playground to meet some of the kids when I left.  <br/>\n<br/>\nI got back home and Ethan and JP were up and playing N64.   I noticed <br/>\nthat Landon ( who goes to public high school, he is a Sr) was still <br/>\nin bed.  I guess he is not going to school today.  I began checking <br/>\nmy email, reading, replying to some..  Ethan came in and asked me to <br/>\nfind some cheats for Lego Racers.  I did that and printed them off <br/>\nfor him.  I hear them in thier bedroom bumping around and talking, <br/>\nbut I do not know what they are doing. <br/>\n<br/>\nEvery day just goes by and we do whatever comes up.  Some of the <br/>\nhighlights of this week have been:<br/>\n<br/>\n  On Monday we visted an former ( and most favorite) teacher of Anna <br/>\nand Ethan.   She had a baby 6wks ago.  That was a wonderful visit.  <br/>\nShe was totally into the unschooling and very supportive.   Ethan and <br/>\nJP played on her game cube while Anna, Jen, and I cooed over the baby <br/>\nand just chatted.  We stopped at Wal-mart on the way home and JP got <br/>\nsome marked down dragon thingy and Ethan got a new pack of Yu-gi-oh <br/>\ncards.  I saw another homeschooling mom at Wal-mart, her son takes <br/>\nkarate with JP.  I blew her away talking about how we DON&quot;T do <br/>\nschool. LOL.. they do FIAR. <br/>\n<br/>\nOn Tuesday, I had to run errands to the bank and credit union.  Anna <br/>\nwent with me, Ethan and JP stayed home and played N64.  ( that was <br/>\nfor about an hour)  I took Anna to piano, JP went with me, Ethan <br/>\nstayed home.  I came back from piano, dropped JP off..  I thought <br/>\nthey would want to go to the park day, but Ethan and JP wanted to <br/>\nfinish playing Lego Racers.   I took Anna to the orthodontist.  She <br/>\ngets her braces off next week!.   When we got back from the ortho, we <br/>\nwatched Analyze That. OH, we had watched Swim Fan that morning before <br/>\nI ran the errands.   Then, I took the rented DVDs back and Anna and I <br/>\nwent to the grocery store.  The boys stayed home. They cleaned thier <br/>\nroom last night. JP had dumped all of the legos and imaginext toys <br/>\nout.   <br/>\n<br/>\nWe are going to the laundrette today ( our washing machine is <br/>\nbroken)  Tomorrow we are going to a new park day at a new location.  <br/>\nThen, we are leaving to go camping in Tennesse for Labor Day.   If we <br/>\ndon&#39;t leave tomorrow evening, we will leave early Friday morning..  <br/>\nWe are staying til Monday.  We will probably hike, bike, hang out, <br/>\nride horses, just general camping stuff.. I get to try out my new <br/>\ndutch oven!!  YAYYYY.. My sister and her family and my first cousin <br/>\nand her family are also camping with us.  It will be LOTS of fun.  <br/>\n<br/>\nTeresa</div>","specialLinks":[]},{"userId":77817828,"authorName":"LOWRIEK@aol.com","from":"LOWRIEK@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1061997076","msgId":79227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMy5lMzA5YWFjLjJjN2UyNDE0QGFvbC5jb20+"},"prevInTopic":79225,"nextInTopic":79229,"prevInTime":79226,"nextInTime":79228,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"In a message dated 27/08/2003 07:22:31 Pacific Daylight Time, ... Good morning Cay. Today we are going to just hang out and see where that leads. Riht now ds","messageBody":"<div id=\"ygrps-yiv-463994860\">In a message dated 27/08/2003 07:22:31 Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caygibson@...\">caygibson@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Any advice would be most helpful...if I could just get a *peek* <br/>\n&gt; inside your *unschools* today.  What are your dc doing right this <br/>\n&gt; moment as you read my message?  What are your plans to do with them <br/>\n&gt; for when you get off the computer?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Good morning Cay.<br/>\nToday we are going to &quot;just hang out&quot; and see where that leads. Riht now ds <br/>\nalmost 8yrs is watching Star Wars ep. 2, dd 2yrs is sleeping with her dad. The <br/>\nhorses are fed, so are dogs and chickens. I will think of something for <br/>\nbreakfast soon, supper is made, and my broken arm really hurts today, so I will take <br/>\nit easy for the most part. <br/>\nDs will probably try to find a friend to play with, or go play computer. We <br/>\nmay read,go for a walk,play cards. Dd will putter around and sing and be nude, <br/>\nfor most of the day.I am caring for a friends 2 younger kids while older one <br/>\ngoes to riding lesson and then we may have tea. <br/>\nWe can&#39;t go anywhere cause I can&#39;t drive right now, but it is fun to stay <br/>\nhome. Dh goes to work at 2pm, we might make cookis or paint, or   we might watch <br/>\nmore tv, depends on the children&#39;s preference. I may clean ds room, as he is <br/>\nhaving trouble moving in there, but I asked first, and he said yes.<br/>\nthen supper, maybe a walk(my legs aren&#39;t broken!) perhaps a board game when <br/>\ndd goes to sleep, maybe read some more.<br/>\nSounds pretty up in the air, loose etc., but we really like it that way, <br/>\nspontaneity works well for us, as does this fabulous unschooling way of life. We <br/>\ncan breath.<br/>\nNancy in BC<br/>\nkids here aren&#39;t back to school yet, by the way. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1061995620","msgId":79233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCNzIzQ0E0LjFEOEU3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79232,"nextInTopic":79234,"prevInTime":79232,"nextInTime":79234,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"... My daughter is writing a story on the computer. Though she just returned to it from a little (5 minute) video game break. Not sure what was up with that ","messageBody":"<div id=\"ygrps-yiv-160760171\">on 8/27/03 10:18 AM, Cay A. Gibson at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caygibson@...\">caygibson@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What are your dc doing right this<br/>\n&gt; moment as you read my message?<br/>\n<br/>\n </span></blockquote>My daughter is writing a story on the computer. Though she just returned to<br/>\nit from a little (5 minute) video game break. Not sure what was up with that<br/>\nbut she felt she needed it so she had the freedom to take it. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What are your plans to do with them<br/>\n&gt; for when you get off the computer?<br/>\n<br/>\n </span></blockquote>Watch the anime shows we recorded last night while I walk on the treadmill.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Any advice would be most helpful...if I could just get a *peek*<br/>\n&gt; inside your *unschools* today.<br/>\n<br/>\n </span></blockquote>The &quot;secret&quot; isn&#39;t in what unschooled kids do (or what other parents imagine<br/>\nwe somehow &quot;get&quot; them to do) but in the freedom they have to do what they<br/>\nfeel they need to do. Right now it looks like my daughter is doing something<br/>\nacademic all on her own. And that&#39;s sort of what many people picture an<br/>\nideal unschooling home will look like. But in reality her writing is no<br/>\ndifferent to her than playing video games or watching TV. It&#39;s something she<br/>\nenjoys so that&#39;s what she does.<br/>\n<br/>\nUnschooling days are like summer days when you were a kid. You were free to<br/>\ndo whatever you wanted. (I hope anyway!) Unschooling parents are probably<br/>\nmore involved than most &quot;regular&quot; parents, who just send their kids off to<br/>\nfind something to do. We&#39;re not glued to out kids ;-) so much as we are<br/>\naware of their needs and are there to help them get what they want.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":137838629,"authorName":"Lillian Haas","from":"&quot;Lillian Haas&quot; &lt;lhaas@...&gt;","profile":"homleighacademy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] What are you doing this morning?","postDate":"1061995120","msgId":79225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNjYwMWMzNmNhOCRlYTlhOTI5MCQ2NTAxYThjMEBMaXZpYT4=","referencesHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":79222,"nextInTopic":79227,"prevInTime":79224,"nextInTime":79226,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"Hi, Cay. What your children are doing is unschooling -- they re doing what interests them right now. It may not be academic, but just playing is just as ","messageBody":"<div id=\"ygrps-yiv-1158391947\">Hi, Cay.<br/>\n<br/>\nWhat your children are doing is unschooling -- they&#39;re doing what interests<br/>\nthem right now. It may not be &quot;academic,&quot; but &quot;just playing&quot; is just as<br/>\nvaluable.<br/>\n<br/>\nI have two sons, 11 and 6. The 11-year-old isn&#39;t here at the moment, because<br/>\nhe spent the night at a friend&#39;s house, but if he were here he&#39;d be playing<br/>\non the computer or reading or playing Legos with his brother. He&#39;s working<br/>\nhis way through a Latin book at the moment, so usually he&#39;ll find 10 or 15<br/>\nminutes a day to do a couple of sentences in that, and he&#39;s just passed his<br/>\naudition to move up into the advanced band, so he&#39;s going to have to find<br/>\ntime to practice -- but if it&#39;s important enough to him, he will.<br/>\n<br/>\nThe younger one is upstairs playing on the computer, enjoying the fact that<br/>\nhis brother&#39;s absence gives him dominion over the sacred machine.<br/>\n<br/>\nNeither of them does &quot;self-study&quot; in the way I think you mean it (except for<br/>\nthe older one&#39;s Latin): deciding they just have to open a textbook and plow<br/>\nthrough it. They learn from everywhere -- from the books they read all the<br/>\ntime, from the discussions we have with them, from the places we take them<br/>\nand the TV shows they watch and the things they hear on the radio and the<br/>\npeople they talk to. And they know an astounding variety of things.<br/>\n<br/>\nThe biggest difference between unschoolers and homeschoolers is that<br/>\nunschoolers have (for the most part!) let go of the belief that there are<br/>\ncertain things that children have to learn at certain times. your<br/>\n16-year-old may be thinking about college, and he will have to figure out<br/>\nwhat he needs to cover to get there in a two years, but for the others, it<br/>\nmight be a good idea to let them decompress for a while, to begin to believe<br/>\nthat you won&#39;t tell them what they have to learn.<br/>\n<br/>\nI&#39;m sorry I can&#39;t give you a better idea of what a day looks like around<br/>\nhere, but they&#39;re all different. It&#39;s scary to let go of expectations, but<br/>\nit can be very rewarding.<br/>\n<br/>\nLillian</div>","specialLinks":[]},{"userId":72925035,"authorName":"Cay A. Gibson","from":"&quot;Cay A. Gibson&quot; &lt;caygibson@...&gt;","profile":"gibsevengang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What are you doing this morning?","postDate":"1061993925","msgId":79222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJpaWVrNSs5bGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":79225,"prevInTime":79221,"nextInTime":79223,"topicId":79222,"numMessagesInTopic":0,"msgSnippet":"Hello.  My name is Cay Gibson and I ve been lurking for the past couple of weeks. I have always been an eclectic hsing mom...using literature-based planning","messageBody":"<div id=\"ygrps-yiv-643424729\">Hello.  My name is Cay Gibson and I&#39;ve been lurking for the past <br/>\ncouple of weeks.<br/>\n<br/>\nI have always been an eclectic hsing mom...using literature-based <br/>\nplanning with an assortment of workbooks, and a Charlotte Mason <br/>\nflavor.  I have 5 dc ages &quot;soon-to-be&quot; 16 ds, 13 dd, 10 ds, &quot;soon-to-<br/>\nbe&quot; 6 dd, and 20 month dd.  I&#39;ve been married for 17 years to my <br/>\nhigh school sweetheart, Mark.<br/>\n<br/>\nI came to this list this school year to get a feel for what <br/>\nunschoolers *actually* do during the day.  Checking into the posts <br/>\neach day, I still find myself clueless over the *daily doings* of <br/>\nunschoolers.  I understand the concept and, due to personal reasons, <br/>\nI&#39;m really anxious to adopt an unschooling way of thinking.  I feel <br/>\n(again...due to personal reasons) that I need the unschooling <br/>\nlifestyle this year.  <br/>\n<br/>\nWe&#39;ve had a full two days.  Today I&#39;m tired and the dc are in the <br/>\nliving room playing.  I don&#39;t have a clue what they&#39;re playing but <br/>\nthey&#39;re quiet and that&#39;s what matters to me today.  Thunder has <br/>\npunctuated the whole morning and today promises to be a day of rain <br/>\nand winds.  We&#39;ve been gone for two days.  I&#39;m looking forward to <br/>\nstaying home today.  Yet (even after six years of hsing) I still <br/>\nthink of the structured/disciplined learning that is happneing in a <br/>\nschool room today and I worry that my dc are just *playing* in the <br/>\nliving room.  <br/>\n<br/>\nI admire hs families whose dc do self-study on their own during the <br/>\nday.  My dc tend to wait for me to place something in front of <br/>\nthem...otherwise they&#39;re off *playing*.<br/>\n<br/>\nAny advice would be most helpful...if I could just get a *peek* <br/>\ninside your *unschools* today.  What are your dc doing right this <br/>\nmoment as you read my message?  What are your plans to do with them <br/>\nfor when you get off the computer?<br/>\n<br/>\nThank you!<br/>\nCay<br/>\nAuthor of Literature Alive! <a rel=\"nofollow\" target=\"_blank\" href=\"http://literaturealive.tripod.com\">http://literaturealive.tripod.com</a><br/>\nTake the boredom out of reading and make literature come Alive! in <br/>\nyour home!</div>","specialLinks":[]}],"prevTopicId":79425,"nextTopicId":79406}}