{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":0,"authorName":"Joel Hawthorne","from":"Joel Hawthorne &lt;jhawthorne@...&gt;","replyTo":"LIST","senderId":"ZABtQXq-98aKDvkqb_MENHQw2xVNX2L5bEWZwzMhIey0DuaBOS8vjQsPzhnIueEcf9CdeD3DVOOjfUzTW3TWK6KgYB74_2MNTiDB","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Dobson, GFI, and followup thoughts","postDate":"939329096","msgId":3632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNDUuMzYzMi45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":3626,"nextInTopic":0,"prevInTime":3631,"nextInTime":3633,"topicId":3602,"numMessagesInTopic":0,"msgSnippet":"Thank you Carolyn for your careful analysis, kind language and highly developed use of your God-(Goddess)given powers of logic. ... -- best wishes Joel All","messageBody":"<div id=\"ygrps-yiv-1874525581\">Thank you Carolyn for your careful analysis, kind language and highly<br/>\ndeveloped use of your God-(Goddess)given powers of logic.<br/>\n<br/>\nCarolyn Talarr wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;      Hi Faith,<br/>\n&gt;<br/>\n&gt;      Well, well...I wrote this reply to you yesterday but sat on<br/>\n&gt;      it because I thought that people on the list might be good<br/>\n&gt;      and sick of this topic, but I see that it&#39;s still alive and<br/>\n&gt;      kicking...SO....&lt;snip&gt;.........I write again because hope<br/>\n&gt;      springs eternal and I&#39;d love to know that maybe *just once*<br/>\n&gt;      when you think you have no other recourse than to hit one of<br/>\n&gt;      your precious children, you stop, breathe, and realize that<br/>\n&gt;      there are still and always better more positive ways to<br/>\n&gt;      guide your child with love because of my and other people&#39;s<br/>\n&gt;      persistence in writing you back (and of course, because my<br/>\n&gt;      daughter&#39;s middle name is Hope).<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;      I hope that you visit the websites and collect all sorts of<br/>\n&gt;      information from other conservative Christian writers on<br/>\n&gt;      childrearing, too.  And Faith, I do hope that as Lisa wrote,<br/>\n&gt;      you choose kindness as an action at all times, not violence,<br/>\n&gt;      however momentary you might *think* it is to those tiny<br/>\n&gt;      souls who get as many messages from what you do as from what<br/>\n&gt;      you say.<br/>\n&gt;<br/>\n&gt;      Best,<br/>\n&gt;<br/>\n&gt;      Carolyn<br/>\n&gt;<br/>\n </span></blockquote>--<br/>\nbest wishes<br/>\nJoel<br/>\n<br/>\nAll children behave as well as they are treated. The Natural Child<br/>\nProject   <a rel=\"nofollow\" target=\"_blank\" href=\"http://naturalchild.com/home/\">http://naturalchild.com/home/</a><br/>\n<br/>\nWork together to reinvent justice using methods that are fair; which<br/>\nconserve, restore and even create harmony, equity and good will in<br/>\nsociety i.e. restorative justice.<br/>\nWe are the prisoners of the prisoners we have taken - J. Clegg<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cerj.org\">http://www.cerj.org</a></div>","specialLinks":[]},{"userId":0,"authorName":"Carolyn Talarr","from":"&quot;Carolyn Talarr&quot; &lt;talarr@...","replyTo":"LIST","senderId":"hlnwCQr0WkEIef6jixGcfev2WmuzaOJwxvv2KUfd1I94Tbp0rWmPOMy_CCFBgCbb9eBHT0UY_NHLSQPQ9XbaNRtOhYmjR16BFlC0mXnzmw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Dobson, GFI, and followup thoughts","postDate":"939298841","msgId":3626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNDUuMzYyNi45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":3606,"nextInTopic":3632,"prevInTime":3625,"nextInTime":3627,"topicId":3602,"numMessagesInTopic":0,"msgSnippet":"Hi Faith, Well, well...I wrote this reply to you yesterday but sat on it because I thought that people on the list might be good and sick of this topic, but I","messageBody":"<div id=\"ygrps-yiv-221166393\">Hi Faith,<br/>\n    Well, well...I wrote this reply to you yesterday but sat on it because I thought that people on the list might be good and sick of this topic, but I see that it&#39;s still alive and kicking...SO...<br/>\n    I&#39;m glad that we can continue this discussion and be &quot;tough on our ideas&quot; while being &quot;soft on people&quot;.   By now you may have checked out what Dobson has to say about Ezzo, and maybe other Christian commentators opinions on GFI as well.  There&#39;s one more site I&#39;d like to offer: an article entitled &quot;The Faulty Theology of the Ezzos&quot; by a prominent Christian breastfeeding expert, Mary P. Walker.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.compleatmother.com/ezzo_theology.htm\">http://www.compleatmother.com/ezzo_theology.htm</a><br/>\n    There&#39;s another one, too, more general:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.christianparent.com\">http://www.christianparent.com</a> <br/>\n    <br/>\n    Several people have made such beautiful, informative heartrending posts on this topic, I just want to try to address a few points you made in your answers to *my* questions particularly...From here on in it seems on my screen that my writing is in the same font as yours, though.  I&#39;ll try to set them apart somehow.<br/>\n    Faith wrote: I have heard from a lot of people on this sight and other homeschooling sites that there is no one way to un/home school.  Each family does it&#39;s own thing and nothing is &quot;right&quot; or &quot;wrong&quot;. <br/>\n    I write:  Absolutely.  I don&#39;t believe that I made an assertion of a right or wrong way to un/homeschool.  I will assert that there are different approaches, however, with different underlying political and philosophical dynamics.  There is theory behind every action in the world, and by theory I mean underlying assumptions of what&#39;s &quot;right&quot; that determine our choices, conscious or unconscious.  Education choice is one of those actions.  Even if one dismisses the idea and says one has &quot;no theory&quot;, that can mean defaulting to practices associated with the hegemonic, most prevalent theory without questioning whether they send deeper messages that one agrees with.  It can also not mean that, of course: it can mean that the theory guiding one&#39;s choices has been unconscious and unarticulated.  <br/>\n    If you look at the dynamics of power, ownership of knowledge, etc. implicit in your education work with your kids, e.g. taking your lead based on what *they* want to learn (that&#39;s called &quot;learner-centered&quot; education, in the jargon--sounds ominously like &quot;child-centered&quot;! :)), maybe you *do* have some theory going that you&#39;re working from but aren&#39;t totally aware of...it&#39;s really hard sometimes to make something like education that seems so familiar &quot;strange&quot; enough to be able to see it with fresh eyes and look at the dynamics driving how we do it.  Or parenting, for that matter. <br/>\n    Faith wrote: I believe that you are assuming that either people are submissive parents or authoritarian parents.  <br/>\n<br/>\n    I write: Well, no.  Submissive?  ICK!  Did I say that? :) You brought up the Ezzos&#39; own dichotomy of child-centered vs. parent-centered and I was trying to work with that dichotomy.  The Ezzos are quite into dichotomy, actually.  (See the GFI home page for a huge binary opposition chart comparing their way and any other way...put extremely slanted and illogically, IMO--I could totally take apart the holes in their logic).  And see below about why I inferred &quot;authoritarian&quot;...<br/>\n<br/>\n    Faith wrote: There is a happy medium between the two.  And there is a whole chapter in the GKGW book about how they do not agree with either.  I am not, nor do I agree with, authoritarian parenting. <br/>\n<br/>\n    I write: I&#39;m sorry, Faith, but I have to say that a duck can call itself whatever it wants, but if it walks like a duck and talks like a duck...Any parenting approach that includes &quot;first time obedience&quot; and hitting your children de facto counts as authoritarian, IMO.  Those are words that are part of the authoritarian lexicon, plain and simple.  There may be other aspects of such a parenting approach that aren&#39;t primarily authoritarian, but willingness to engage in corporal punishment and insistence on &quot;first time obedience&quot; rather than respectful dialogue and gentle guidance (I love the Natural Child Project and the Gentle Parenting sites re these issues too) identify that approach as deep down, when the chips are down and a crisis has to be handled, *rooted in authoritarianism*.  If you hit your children even occasionally and insist on obedience to your authority, why are you so concerned that your approach not be called authoritarian?  <br/>\n<br/>\n    And I still seriously don&#39;t see how &quot;first time obedience&quot; and corporal punishment can connect with the very different power dynamics of unschooling, even across a broad spectrum of formulations of the concept.  I think as you uncover the more egalitarian, respectful dynamics driving your education practice so far with your children, you&#39;ll see what I mean.  And your education practice sounds like it&#39;s what comes naturally to you, vs. what&#39;s been sanctioned and taught by a powerful institution.  You certainly didn&#39;t come to learner-centered education by duplicating what schools do! :)  Learner-centered unschooling and the respectful, supportive, nonviolent and yes, Christian parenting associated with it may be where your instincts, your &quot;better angels&quot;, are telling you to go.<br/>\n<br/>\n    Faith wrote: It is to  strict.  I have the vision of &quot;The Sound of Music&quot; before Maria arrives.  Whistles and straight lines, or else.  <br/>\n<br/>\n    I write: (one of my and Annie&#39;s total favorite musicals) And yet the Captain totally loved his children; he just expected &quot;first time obedience&quot;...(small point.  I just wanted to talk about the show!)<br/>\n<br/>\n    Faith wrote: That isn&#39;t what conservative Christian parenting is about. We lovingly guide our kids, and nurture the beautiful personality that God has placed in our hands.  <br/>\n<br/>\n    I write: There are many ways to accomplish this *same end* without feeling justified in hitting that beautiful personality when things get to a certain point.  Attachment parenting, which is not at all &quot;submissive&quot; (creepy word) but rather, imo, peace-promoting and conflict-resolution-promoting and has a quite lot to say about discipline (e.g. Dr. William Sears&#39; &quot;The Discipline Book&quot; and all his and his wife&#39;s books on Christian parenting) would have very similar things to say about their goals and process.  <br/>\n<br/>\n    Hitting teaches children (among other things) that their parents think that physical violence is an acceptable way of dealing with conflict.  Can you agree with that statement? Do you want your children to think that if all else fails they have the right to become violent, or that someone has the right to violate them?<br/>\n<br/>\n    Faith wrote: We let our kids become who God wants them to be not beat and brainwash them into being who we want them to be.<br/>\n<br/>\n    I write: At the GFI site and in the books (did I mention I&#39;ve read both Babywise books available to the general public?) the word used is &quot;train&quot;, not &quot;let&quot;.  &quot;Train&quot; appears frequently; I don&#39;t see &quot;let&quot; in any of their writings.  If GFI were more about letting, then they might &quot;let&quot; infants explore the strange new thing called food that was being entered into their bodies like any normal curious human being, rather than making them &quot;politely&quot; keep their hands at their sides and quash their curiosity about one of the most fascinating things about human life (food, sustenance) and teach them that they do not have control over their bodies.  This is indeed brainwashing, Faith.  This is one small example of the kind of thing I&#39;m talking about when I talk about analyzing the deeper dynamics and messages that the GFI &quot;training&quot; sends children.<br/>\n<br/>\n     Which brings up the whole spanking issue.  Those of you who don&#39;t spank, won&#39;t.  And those of you who do, will.  Period.  <br/>\n<br/>\n    I write: I very strongly disagree with the logic of this statement and with the statement itself, too.  There&#39;s no such thing as an eternal condition of &quot;being a spanking parent&quot;.  Spanking is an action that can stop at any time when you realize that there are more effective ways to discipline your child and model for them the dynamics you want them to learn to live regarding respect for other people and other people&#39;s bodies.<br/>\n<br/>\n    In other words, it&#39;s possible to change your practice, just as you did with breastfeeding as you got better information on it.  Some people would say &quot;there are mothers who breastfeed and those who don&#39;t.  Period.&quot;  You have the gift of time to reflect on your actions and decide to choose a different path, rather than say &quot;period&quot;, I&#39;m a &quot;spanking parent&quot; forever.<br/>\n<br/>\n    Faith wrote: When I took GKGW they did not train us to not leave incriminating marks, so I have no idea what that is all about.  <br/>\n<br/>\n    I write:  Maybe you&#39;ll get to it in the next class in the series :(, but there *are* passages in their materials that address how to hit children and what implements to hit them with so as not to break skin, damage organs, or make bruises.  <br/>\n<br/>\n    At the GFI site, all talk of discipline stops with the phrase &quot;hold them accountable&quot;.  I&#39;m sure that this accountability-holding is discussed in more detail in the classes...<br/>\n<br/>\n    There is a troubling larger implication of this elision in their site.  Over the years, because of public scrutiny, the amount and kind of information that the Ezzos release to the public has changed drastically.  At the GFI site there are *no* public forums that aren&#39;t censored.  Every single word there has been screened.  At every parenting site I&#39;ve been to parents are allowed to have uncensored bulletin boards, even if there are expert advice sections as well.  Not here.  What does that say to you?<br/>\n<br/>\n    Faith wrote: And it&#39;s not like before I took this class I didn&#39;t spank, and because of this class,  now I do.  I have always spanked, and I was spanked as a kid (and I turned out fine.)  I think that this is one of those issues that will never be won on either side, so there is no point in debating it!!!     <br/>\n<br/>\n    I write: A thought re the classic argument, &quot;I was spanked and I turned out fine&quot;:  Mark Twain wrote, &quot;The less there is to justify a tradition the harder it is to get rid of it&quot;.  Cultural reproduction has incredible inertial weight, but it is possible to improve upon what had been done to us. <br/>\n<br/>\n    I write again because hope springs eternal and I&#39;d love to know that maybe *just once* when you think you have no other recourse than to hit one of your precious children, you stop, breathe, and realize that there are still and always better more positive ways to guide your child with love because of my and other people&#39;s persistence in writing you back (and of course, because my daughter&#39;s middle name is Hope). <br/>\n    <br/>\n<br/>\n    I hope that you visit the websites and collect all sorts of information from other conservative Christian writers on childrearing, too.  And Faith, I do hope that as Lisa wrote, you choose kindness as an action at all times, not violence, however momentary you might *think* it is to those tiny souls who get as many messages from what you do as from what you say.  <br/>\n<br/>\n    Best,<br/>\n<br/>\n    Carolyn</div>","specialLinks":[]},{"userId":0,"authorName":"faith buckley","from":"faith buckley &lt;faithb@...","replyTo":"LIST","senderId":"cTiiFH8oIlh1up6iFA4ewlxyVrP6T1z89Pq8SJdBhupWQ25bY48yfs9BgPRXejMd09tbB4t3UbdINM82hr26F2hb9gK93w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Dobson, GFI, and followup thoughts","postDate":"939193471","msgId":3606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNDIuMzYwNi45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":3602,"nextInTopic":3626,"prevInTime":3605,"nextInTime":3607,"topicId":3602,"numMessagesInTopic":0,"msgSnippet":"Carolyn, First, I would like to thank you for the Dobson info, I will be looking that up. Second, I would like to answer your question about unschooling.  I am","messageBody":"<div id=\"ygrps-yiv-1998742376\">Carolyn,<br/>\nFirst, I would like to thank you for the Dobson info, I will be looking that up.<br/>\n<br/>\nSecond, I would like to answer your question about unschooling.  I am totally<br/>\nnew to this whole homeschooling thing.  My oldest is 7 and has never stepped<br/>\nfoot into a ps.  For the past two years I have had help from K-8 Homestudy here<br/>\nin town but this year I decided to do it on my own and to tell you the truth, I<br/>\nam clueless!  I have only had a computer since the end of July and that is when<br/>\nI went searching for homeschooling related sites.  I found this one and here I<br/>\nam. I really don&#39;t have a philosophy on schooling because I am so new to it<br/>\nall.  I have just been taking in different methods and incorporating them in.<br/>\nI am very flexible and I let our kids decide what they want to learn about.  In<br/>\nfact, at the beginning of the school year I asked my son what he wanted to learn<br/>\nabout and went from there.  I have heard from a lot of people on this sight and<br/>\nother homeschooling sites that there is no one way to un/home school.  Each<br/>\nfamily does it&#39;s own thing and nothing is &quot;right&quot; or &quot;wrong&quot;.<br/>\n<br/>\nI believe that you are assuming that either people are submissive parents or<br/>\nauthoritarian parents.  There is a happy medium between the two.  And there is a<br/>\nwhole chapter in the GKGW book about how they do not agree with either.  I am<br/>\nnot, nor do I agree with, authoritarian parenting.  It is to  strict.  I have<br/>\nthe vision of &quot;The Sound of Music&quot; before Maria arrives.  Whistles and straight<br/>\nlines, or else.  That isn&#39;t what conservative Christian parenting is about. We<br/>\nlovingly guide our kids, and nurture the beautiful personality that God has<br/>\nplaced in our hands.  We let our kids become who God wants them to be not beat<br/>\nand brainwash them into being who we want them to be.  Which brings up the whole<br/>\nspanking issue.  Those of you who don&#39;t spank, won&#39;t.  And those of you who do,<br/>\nwill.  Period.  When I took GKGW they did not train us to not leave<br/>\nincriminating marks, so I have no idea what that is all about.  And it&#39;s not<br/>\nlike before I took this class I didn&#39;t spank, and because of this class,  now I<br/>\ndo.  I have always spanked, and I was spanked as a kid (and I turned out fine.)<br/>\nI think that this is one of those issues that will never be won on either side,<br/>\nso there is no point in debating it!!!<br/>\nAlso:<br/>\nCarolyn Talarr wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One study (I didn&#39;t keep the cite, but I could maybe find it for you) found<br/>\n&gt; that teens who commit violence in schools predominantly come from homes that<br/>\n&gt; are deliberately strict and authoritarian, vs. the prevalent conservative<br/>\n&gt; propaganda that says that &quot;permissive&quot; households end up producing those<br/>\n&gt; violent out-of-control teens like the ones who make the news.<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t doubt it!  Authoritarian parenting is way to strict and, in my<br/>\nopinion, very wrong.<br/>\nI hope I answered your questions enough.  I really don&#39;t like to debate<br/>\nanything.  I just believe what I believe, and I will listen to another side, but<br/>\nI don&#39;t like to go back and forth and argue.  Thank you for being so kind in the<br/>\nway you have requested info.  I know that a lot of you don&#39;t agree with things<br/>\nsaid but you have still been very kind instead of chewing me up and spitting me<br/>\nout.  I appreciate that, sincerely. :-)<br/>\nLiving for Him,<br/>\nFaith</div>","specialLinks":[]},{"userId":0,"authorName":"Carolyn Talarr","from":"&quot;Carolyn Talarr&quot; &lt;talarr@...","replyTo":"LIST","senderId":"0NVnwcGgTgOdfmfBqjREJFvLt7LzUYe9SbHPSXipAyTvbjFCu175L32lqLk-bK7QSpXnerLNhO6sFo9WiIs3vUvNupLBEO2tskQVhnXsvg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Dobson, GFI, and followup thoughts","postDate":"939169073","msgId":3602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNDIuMzYwMi45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":3606,"prevInTime":3601,"nextInTime":3603,"topicId":3602,"numMessagesInTopic":0,"msgSnippet":"Hi Faith, Sorry it s taken so long for me to get back to you.  A busy day with Annie... The site I could get my hands on the fastest that has a primary source","messageBody":"<div id=\"ygrps-yiv-295782962\">Hi Faith,<br/>\n<br/>\nSorry it&#39;s taken so long for me to get back to you.  A busy day with<br/>\nAnnie...<br/>\n<br/>\nThe site I could get my hands on the fastest that has a primary source piece<br/>\nfrom FOTF headquarters about their stand on Ezzo is<br/>\nwww.mailing-list.net/redrhino/Ezzo/FOTF.txt and from there you can take<br/>\nFOTF.txt off and replace it with Files.html to get to a host of other<br/>\nsecular and religious expert-types weighing in on Ezzo.<br/>\n<br/>\nI understand that in a radio broadcast recently Dobson responded to a caller<br/>\nasking about his position on GFI and it was not at all complimentary.  But I<br/>\ncouldn&#39;t find any mention of it at the FOTF website.<br/>\n<br/>\nHope any of this helps--<br/>\nCarolyn<br/>\n<br/>\nP.S. FWIW, respectfully, this issue appears as totally on topic to me, now,<br/>\nbecause--well, I know I&#39;m new on this list, but I just don&#39;t understand how<br/>\n*un*schooling (vs., say, conservative Christian-based homeschooling) , with<br/>\nits roots in non-authoritarian learner-centered, participatory pedagogy that<br/>\nrespects<br/>\nwhere the child wants to take her/his education and considers the child a<br/>\npartner in learning, can fit with the implicit authoritarianism and negative<br/>\nassumptions toward kids&#39; natural impulses that are at the root of GFI.<br/>\nThat&#39;s a long sentence, but I hope my question is clear.  How do you<br/>\nreconcile the two?  What is your formulation of *un*schooling?<br/>\n<br/>\nFinally, I feel the need to add re the difference you seem to see between<br/>\nbeating and spanking--I just disagree with you.  Both are corporal<br/>\npunishment; there are more similarities than differences.  I believe that in<br/>\nthe GFI courses in churches, people are coached on how to hit their children<br/>\nso they don&#39;t leave any incriminating marks...And there&#39;s a lot of research,<br/>\na *lot*, that has found that kids who suffer corporal punishment at the<br/>\nhands of their parents (yes, spanking counts) end up *more* antisocial on<br/>\nany number of scales, rather than less.  Many of these studies have made the<br/>\nnews in the past year.  I&#39;m sure you could find them if you did a search.<br/>\n<br/>\nOne study (I didn&#39;t keep the cite, but I could maybe find it for you) found<br/>\nthat teens who commit violence in schools predominantly come from homes that<br/>\nare deliberately strict and authoritarian, vs. the prevalent conservative<br/>\npropaganda that says that &quot;permissive&quot; households end up producing those<br/>\nviolent out-of-control teens like the ones who make the news.<br/>\n<br/>\nI&#39;ll understand if you don&#39;t want to respond to my question re unschooling.<br/>\nBut as we say on another list, &quot;tough on ideas, soft on people&quot;--and I&#39;m<br/>\nreally genuinely curious and trying to find out your ideas on this matter.<br/>\n<br/>\nWhew--That was a long P.S.!<br/>\nSincerely,<br/>\nCarolyn</div>","specialLinks":[]}],"prevTopicId":3605,"nextTopicId":3630}}