{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"T0j01PO317wsWfo3ziwHfGjKh5145EEHX1bdRTrbQbPm8aQu8oGt9m37cLXf1OJREmBKnj8LBjr-sadgvRN-7I0r-Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Speaking of Vaccines/vaccinations","postDate":"969891316","msgId":13385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwOTI1MTQ0MS5lOFBFZkY4MjI5NzNAc20wMTAxLnByb21lZGlhLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13384,"nextInTime":13386,"topicId":13385,"numMessagesInTopic":0,"msgSnippet":"This is not for those who have a sensitive stomach.  This is a report on a book that will be coming out in October and will be discussed at the Anthropological","messageBody":"<div id=\"ygrps-yiv-204402109\">This is not for those who have a sensitive stomach.  This is a report on a<br/>\nbook that will be coming out in October and will be discussed at the<br/>\nAnthropological Associations meeting.  It deals with another one of the<br/>\nmeasles vaccines.  This vaccine was one of the first to be tested but it<br/>\nwas considered more harmful than useful.  So, as scientists will, they<br/>\ndecided to find some guinea pigs and use it anyway.<br/>\n<br/>\nLynda<br/>\n<br/>\nGeneticist accused of letting thousands die in rainforest<br/>\n<br/>\nPaul Brown, Environment correspondent<br/>\n<br/>\nSaturday September 23, 2000<br/>\n<br/>\nThousands of South American indians were infected with measles, killing<br/>\nhundreds, in order for US scientists to study the effects on primitive<br/>\nsocieties of natural selection, according to a book out next month.<br/>\n<br/>\nThe astonishing story of genetic research on humans, which took 10 years to<br/>\nuncover, is likely to shake the world of anthropology to its core,<br/>\naccording to Professor Terry Turner of Cornell University, who has read the<br/>\nproofs.<br/>\n<br/>\n&#39;&#39;In its scale, ramifications, and sheer criminality and corruption it is<br/>\nunparalleled in the history of anthropology,&#39;&#39; Prof Turner says in a<br/>\nwarning letter to Louise Lamphere, the president of the American<br/>\nAnthropology Association (AAA).<br/>\n<br/>\nThe book accuses James Neel, the geneticist who headed a long-term project<br/>\nto study the Yanomami people of Venezuela in the mid-60s, of using a<br/>\nvirulent measles vaccine to spark off an epidemic which killed hundreds and<br/>\nprobably thousands.<br/>\n<br/>\nOnce the epidemic was under way, according to the book, the research team<br/>\n&#39;&#39;refused to provide any medical assistance to the sick and dying Yanomami,<br/>\non explicit order from Neel. He insisted to his colleagues that they were<br/>\nonly there to observe and record the epidemic, and that they must stick <br/>\nstrictly to their roles as scientists, not provide medical help&#39;&#39;.<br/>\n<br/>\nThe book, Darkness in El Dorado by the investigative journalist Patrick<br/>\nTierney, is due to be published on October 1. Prof Turner, whose letter was<br/>\nco-signed by fellow anthropologist Leslie Sponsel of the University<br/>\nof Hawaii, was trying to warn the AAA of the impending scandal so the<br/>\nprofession could defend itself.<br/>\n<br/>\nAlthough Neel died last February, many of his associates, some of them<br/>\nauthors of classic anthropology texts, are still alive.<br/>\n<br/>\nThe accusations will be the main focus of the AAA&#39;s AGM in November, when<br/>\nthe surviving scientists have been invited to defend their work. None have<br/>\ncommented publicly, but they are asking colleagues to come to their<br/>\ndefence.<br/>\n<br/>\nOne of the most controversial aspects of the research which allegedly<br/>\nculminated in the epidemic is that it was funded by the US atomic energy<br/>\ncommission, which was anxious to discover what might happen to <br/>\ncommunities when large numbers were wiped out by nuclear war.<br/>\n<br/>\nWhile there is no &#39;&#39;smoking gun&#39;&#39; in the form of texts or recorded speeches<br/>\nby Neel explaining his conduct, Prof Turner believes the only explanation<br/>\nis that he was trying to test controversial eugenic theories like the <br/>\nNazi scientist Josef Mengele.<br/>\n<br/>\nHe quotes another anthropologist who read the manuscript as saying: &#39;&#39;Mr.<br/>\nTierney&#39;s analysis is a case study of the dangers in science of the<br/>\nuncontrolled ego, of lack of respect for life, and of greed and <br/>\nself-indulgence. It is a further extraordinary revelation of malicious and<br/>\nperverted work conducted under the aegis of the atomic energy commission.&#39;&#39;<br/>\n<br/>\nProf Turner says Neel and his group used a virulent vaccine called Edmonson<br/>\nB on the Yanomani, which was known to produce symptoms virtually<br/>\nindistinguishable from cases of measles.<br/>\n<br/>\n&#39;&#39;Medical experts, when informed that Neel and his group used the vaccine<br/>\nin question on the Yanomami, typically refuse to believe it at first, then<br/>\nsay that it is incredible that they could have done it, and are at a loss <br/>\nto explain why they would have chosen such an inappropriate and dangerous<br/>\nvaccine,&#39;&#39; he writes.<br/>\n<br/>\n&#39;&#39;There is no record that Neel sought any medical advice before applying<br/>\nthe vaccine. He never informed the appropriate organs of the Venezuelan<br/>\ngovernment that his group was planning to carry out a vaccination campaign,<br/>\nas he was legally required to do.<br/>\n<br/>\nFatalities<br/>\n<br/>\n&#39;&#39;Neither he nor any other member of the expedition has ever explained why<br/>\nthat vaccine was used, despite the evidence that it actually caused or, at<br/>\na minimum, greatly exacerbated the fatal epidemic.&#39;&#39;<br/>\n<br/>\nProf Turner says that Neel held the view that &#39;&#39;natural&#39;&#39; human society, as<br/>\nseen before the advent of large-scale agriculture, consists of small,<br/>\ngenetically isolated groups in which dominant genes - specifically a <br/>\ngene he believed existed for &#39;&#39;leadership&#39;&#39; or &#39;&#39;innate ability&#39;&#39; - have a<br/>\nselective advantage.<br/>\n<br/>\nIn such an environment, male carriers of this gene would gain access to a<br/>\ndisproportionate number of females, reproducing their genes more frequently<br/>\nthan less &#39;&#39;innately able&#39;&#39; males. The result would supposedly be a<br/>\ncontinual upgrading of the human genetic stock.<br/>\n<br/>\nHe says Neel believed that in modern societies &#39;&#39;superior leadership genes<br/>\nwould be swamped by mass genetic mediocrity&#39;&#39;.<br/>\n<br/>\n&#39;&#39;The political implication of this fascistic eugenics is clearly that<br/>\nsociety should be reorganised into small breeding isolates in which<br/>\ngenetically superior males could emerge into dominance, eliminating<br/>\nor subordinating the male losers in the competition for leadership and<br/>\nwomen, and amassing harems of brood females.&#39;&#39; Prof Turner adds.<br/>\n<br/>\nIn the memo he says: &#39;&#39;One of Tierney&#39;s more startling revelations is that<br/>\nthe whole Yanomami project was an outgrowth and continuation of the atomic<br/>\nenergy commission&#39;s secret programme of experiments on human subjects.<br/>\n<br/>\n&#39;&#39;Neel, the originator of the project, was part of the medical and genetic<br/>\nresearch team attached to the atomic energy commission since the days of<br/>\nthe Manhattan Project.&#39;&#39;<br/>\n<br/>\nJames Neel was well-known for his research into the effects of radiation on<br/>\nhuman subjects and personally headed the team that investigated the effects<br/>\nof the Hiroshima and Nagasaki bombs on survivors and their children.<br/>\n<br/>\nAccording to Prof Turner, the same group also secretly carried out<br/>\nexperiments on human subjects in the US. These included injecting people<br/>\nwith radioactive plutonium without their knowledge or permission.<br/>\nNightmarish<br/>\n<br/>\n&#39;&#39;This nightmarish story - a real anthropological heart of darkness beyond<br/>\nthe imagining of even a Joseph Conrad (though not, perhaps, a Josef<br/>\nMengele) - will be seen (rightly in our view) by the public, as well as<br/>\nmost anthropologists, as putting the whole discipline on trial,&#39;&#39; he says.<br/>\n<br/>\n&#39;&#39;This book should... cause the field to understand how the corrupt and<br/>\ndepraved protagonists could have spread their poison for so long while they<br/>\nwere accorded great respect throughout the western world... This <br/>\nshould never be allowed to happen again.&#39;&#39;<br/>\n<br/>\nYesterday Professor Turner told the Guardian it was unfortunate that the<br/>\nconfidential memo had been leaked, but it had accomplished its original<br/>\npurpose in getting a full response from the AAA.<br/>\n<br/>\nA public forum would be held at its AGM in November to discuss the book its<br/>\nrevelations and courses of action.  In a statement yesterday the<br/>\nassociation said &#39;&#39;The AAA is extremely concerned about these allegations.<br/>\nIf proven true they would constitute a serious violation of Yanomami human<br/>\nrights and our code of ethics. Until there is a full and impartial review<br/>\nand discussion of the issues raised in the book, it would be unfair to<br/>\nexpress a judgment about the specific allegations against individuals that<br/>\nare contained in it.<br/>\n<br/>\n&#39;&#39;The association is anticipating conducting an open forum during our<br/>\nannual meeting to provide an opportunity for our members to review and<br/>\ndiscuss the issues and allegations raised in the book.&#39;&#39;<br/>\n<br/>\nGuardian Unlimited © Guardian Newspapers Limited 2000<br/>\n<br/>\nArticles are shared with subscribers who express prior interest in Blazing<br/>\nStar news, information and feedback for charitable research and educational<br/>\npurposes pursuant to:<br/>\n<br/>\nTitle 17 USC §107<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.law.cornell.edu/uscode/17/107.shtml\">http://www.law.cornell.edu/uscode/17/107.shtml</a></div>","specialLinks":[]}],"prevTopicId":13384,"nextTopicId":13276}}