{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":207138431,"authorName":"kish95@aol.com","from":"kish95@...","profile":"kirstenfredericks","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Saying YES to our kids","postDate":"1117502691","msgId":106287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYS4zZDFlMmZmYi4yZmNkMTZlM0Bhb2wuY29tPg=="},"prevInTopic":106285,"nextInTopic":0,"prevInTime":106286,"nextInTime":106288,"topicId":106241,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/30/2005 9:06:31 PM Eastern Standard Time, rubyprincesstsg@aol.com writes: Unschooling isn t life or death in the same sense, but days","messageBody":"<div id=\"ygrps-yiv-887858035\">In a message dated 5/30/2005 9:06:31 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rubyprincesstsg@...\">rubyprincesstsg@...</a> writes:<br/>\nUnschooling isn&#39;t life or death in the same sense, but days matter, hours  <br/>\nmatter, children remember.<br/>\n*********<br/>\n<br/>\nI don&#39;t know who wrote this because it wasn&#39;t signed, but Wow- what a <br/>\nbeautiful, powerful story.  I&#39;d love to shorten the last sentence into something for <br/>\na T-shirt, or bumper sticker.  &quot;Days matter, hours matter, children remember.&quot; <br/>\n I&#39;d put it next to my other favorite family saying, &quot;School schmool!!&quot;<br/>\n<br/>\n<br/>\nKirsten (4/73)- mom to 3 sons: Skyler (5/96), Aric (5/97), and Sawyer (3/99), <br/>\nwife to Carl (5/72)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Saying YES to our kids","postDate":"1117481037","msgId":106285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxMC4xZDA3NWNkLjJmY2NjMjRkQGFvbC5jb20+"},"prevInTopic":106247,"nextInTopic":106287,"prevInTime":106284,"nextInTime":106286,"topicId":106241,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/29/2005 3:49:09 P.M. Eastern Daylight Time, SandraDodd@aol.com writes: He had  spent years being ashamed and  sad. My bio father just","messageBody":"<div id=\"ygrps-yiv-1459056679\">In a message dated 5/29/2005 3:49:09 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nHe had  spent years <br/>\nbeing ashamed and  sad.   <br/>\n<br/>\n<br/>\n<br/>\nMy bio father just died, on May 15.  I met him (again) the year I  turned 30. <br/>\n I had no idea about him.  I had often dreamed as child (in  a very abusive <br/>\nhome) that there was this man who was always on his way to &quot;save&quot;  me from this <br/>\ntorment.  I thought all little girls had those dreams.  <br/>\n <br/>\nMy father knew all about me, everything.  My mom and her new husband  (from <br/>\nwhen I was 3) told my dad for years that I knew all about him and hated  him, <br/>\nthey also told him I was adopted because he hadn&#39;t tried hard enough to  find <br/>\nme when they married and moved away.  He believed them.<br/>\n <br/>\nHe lived with guilt for many many years.  His life was very much  filled with <br/>\nthe thoughts of the promise he whispered into a little girls ears so  many <br/>\nyears ago.<br/>\n <br/>\nI had no spoken with in over five years.  His choice.  We never  really <br/>\ndeveloped much of a relationship other than some kind of unspoken,  unwavering <br/>\nemotional bond.  That was enough.  The guilt I saw in his  eyes was painful.  He <br/>\nonly had words for me about sorry and wishes and  could haves and should haves. <br/>\n Despite my repeated insistence that all of  that was in the past and the <br/>\nblame was neither his or mine to have.<br/>\n <br/>\nHe got a diagnoses, he was dying.  Cancer, stage four.  Best case  scenario, <br/>\n1-3 years, worst case scenario, 6 months, most likely somewhere in  between.<br/>\n <br/>\nHe&#39;s in MI, I&#39;m in VA.  Don&#39;t come he said.  He said other words  that said <br/>\n&quot;come please&quot;.  So I went, the very next flight.  I thought  we had at least <br/>\nweeks, possibly months to mend what someone else stole from us  so for so many <br/>\nyears.  <br/>\n <br/>\nFor the first two days I was there, if he spoke to me, he looked out the  <br/>\nwindow.  My DH, he could look easily in the eye for conversation, but not  me.  I <br/>\ndreaded this whole, I&#39;m so unworthy and so full of guilt thing we&#39;d  been <br/>\ndancing around for years.<br/>\n <br/>\nHe rapidly declined in health.  Day one to day five, I could barely  believe <br/>\nhe was sick at all, except for the surgical scar he carried and the  doctors <br/>\nown words, and my own eyes looking at the pathology reports.<br/>\n <br/>\nThis time this man was going to say YES to me, he would say what was in his  <br/>\nheart and I would not be easily swayed by diverted eyes or his guilt filled  <br/>\nconversations.<br/>\n <br/>\nI lovingly cared for him.  I talked to doctors and interpreted for  him.  I <br/>\nmade sure things were done on schedule (he hates and so do I to not  know in <br/>\nadvance tests are to be done and procedures scheduled) as on schedule as  things <br/>\ncan be in a hospital.  He resisted.  I continued, I wasn&#39;t  hateful or mean, <br/>\nbut I was firm in that this man would have no doubt that I  loved him, in <br/>\nspite of how horrible he felt he had been as a father to me.<br/>\n <br/>\nDay three we talked eye to eye. Finally, he just said he was so damn mad  <br/>\nabout all of this and had been his whole life.  He wanted to know why I  wasn&#39;t <br/>\nmad and why I didn&#39;t hate him.  Why?  Why be mad, life is what  it is, we <br/>\nchange it or we don&#39;t.  Make it what we want it to be TODAY and  stop worrying and <br/>\nfeeling guilty about what we did or didn&#39;t do yesterday or  last week or last <br/>\nyear or ten years ago.<br/>\n <br/>\nTODAY you can make your child&#39;s life better, but worrying about what it  will <br/>\nbe tomorrow or what it was last week won&#39;t help it at all.  Sometimes  it <br/>\nhelps to be stubborn and to know exactly where you want to go.  I wanted  my dad <br/>\nto feel the love I have for him and to know beyond a doubt that he should  not <br/>\nand could not carry that guilt with him, that it wasn&#39;t his to carry.  <br/>\n <br/>\nJust like as parents we cannot be bogged down because we sent our child to  <br/>\nschool for one day or ten thousand days.  We need to be determined that  TODAY <br/>\ncounts, it&#39;s important and we CAN make it matter.  We have to drop  the guilt <br/>\nand find the joy in just BEING with that child.  Life happens,  learning <br/>\nhappens, joy happens, children do grow up, parents do die, sometimes  much sooner <br/>\nthan anyone thinks.<br/>\n <br/>\nMy day was barely 61.  Within eight days he went from a guilt ridden  man <br/>\nwith no joy in his life to a man who died peacefully and knowing he was  loved <br/>\nand forgiven by himself.<br/>\n <br/>\nLet it go, forget about what happened yesterday or last year,  TODAY  can be <br/>\nmore joyful.<br/>\n <br/>\nI had only a few days of pure joy with my dad, but you can bet I won&#39;t ever  <br/>\nforget them and those days are worth more to me than a thousand days filled <br/>\nwith  guilt and not moving forward.<br/>\n <br/>\nUnschooling isn&#39;t life or death in the same sense, but days matter, hours  <br/>\nmatter, children remember.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Saying YES to our kids","postDate":"1117395937","msgId":106247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmYy4yOTRkMjkyLjJmY2I3NWUxQGFvbC5jb20+"},"prevInTopic":106244,"nextInTopic":106285,"prevInTime":106246,"nextInTime":106248,"topicId":106241,"numMessagesInTopic":0,"msgSnippet":"The risk assessment point is good. I remember one day vividly when Kirby was one.  Probably  16  or 17 months old, and walking well.   We were at an  SCA","messageBody":"<div id=\"ygrps-yiv-1289455573\">The risk assessment point is good.<br/>\n <br/>\nI remember one day vividly when Kirby was one.  Probably  16  or 17 months <br/>\nold, and walking well.   We were at an  SCA tournament near Colorado Springs, <br/>\nand he was little enough to be  picking other people&#39;s stuff up without asking <br/>\n(he wasn&#39;t big enough to ask or  know &quot;other people&#39;s stuff&quot;).   He walked up <br/>\nholding a steel and  leather gauntlet.  I asked him where he got it, but asked <br/>\nhim nicely in the  same kind of interested way I would&#39;ve if it was a cool <br/>\nrock or a flower rather  than stolen armor. &lt;g&gt;  He very happily led me to the <br/>\nplace.  I  apologized to the guy (who hadn&#39;t yet noticed it missing) and asked <br/>\nif maybe he  had anything that wasn&#39;t his.  There was something there, a roll <br/>\nof duct  tape or something.  So I thanked him and picked that up and went to <br/>\nthe  next interesting pile of stuff and asked if it was theirs.  It was.   Did <br/>\nthey have something that wasn&#39;t theirs?  They did.<br/>\n <br/>\nSo Kirby had cross-pollinated a whole row of stuff in wandering among  people <br/>\nwho knew who he was and knew and his dad and I were within  eyesight.<br/>\n <br/>\nNobody told him he was a bad boy.  Everyone got their stuff  back.  He got to <br/>\nlook at and touch some cool things, and that was  fine.<br/>\n <br/>\nAt one point that afternoon he fell down and cried.  He had tripped on  a <br/>\nstring that was set up six or eight eight inches off the ground betwen stakes  <br/>\n(sagging between stakes)  to show people how close was too close to put  tents <br/>\nand piles of armor.  The adults were walking over it easily and had  seen those <br/>\nlittle barriers before.  Kirby tripped and fell.  After I  made sure he was <br/>\nokay and dusted him off, I took him back over and showed him  the string and <br/>\nhelped him practice stepping over it, and pointed out how the  string went all <br/>\nthe way around those places, and where the other people were  walking where <br/>\nthere wasn&#39;t string.  &quot;That&#39;s all,&quot; I remember telling  him.  It was only a <br/>\nstring.  Not danger, not malice, not his failure  to walk.   A guy from Santa Fe I <br/>\nknew, thirtiesh, nice guy, was  watching us and listening.  He came over and <br/>\nsaid with tears in his eyes  that I was a really good mom and he wouldn&#39;t have <br/>\nthought to explain to someone  that age what had happened.  Then he told me <br/>\nsomething he had never told me  or any of us in that group as far as I know.  He <br/>\nhad a daughter, somewhere,  14 years old.  He had gotten his girlfriend <br/>\npregnant when they were sixteen  or so, and the girl didn&#39;t want him to stick <br/>\naround and be the father.  So  he said he always watched parents and thought about <br/>\nwhat he would do, how he  might have been, as a father.  He had spent years <br/>\nbeing ashamed and  sad.  <br/>\n <br/>\nYears passed.  He married and has children (I haven&#39;t met them,  they&#39;re in <br/>\nanother state).  I feel good about that, and he&#39;s probably a  better dad than <br/>\nhe would&#39;ve been if he hadn&#39;t hung around with us for a few  years.  <br/>\n <br/>\nAnd because of his story about having a daughter he didn&#39;t know and had  <br/>\nnever parented, I was able to calmly and truthfully tell my boys that one reason  <br/>\nthey need to be extremely careful about unintended pregancy is that if they <br/>\nget  a girl pregnant, it&#39;s not their call whether she has the baby or not, and <br/>\nit&#39;s  not their call whether they get to be the daddies or not.  They WOULD be <br/>\na  father, and regardless of their desires or intentions, they might end up <br/>\nbeing  absent or bad fathers, because the baby was the mother&#39;s baby to decide  <br/>\nabout.<br/>\n <br/>\nIt&#39;s another risk assessment situation.  Yes, teenagers sometimes have  sex, <br/>\nbut do it safely.<br/>\nYes, there are places more dangerous to walk than others, so do it  safely.  <br/>\nYes, you have something that doesn&#39;t belong to you, yes it&#39;s okay  to pick <br/>\nthings up, and yes, let&#39;s go take it back.  <br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Saying YES to our kids","postDate":"1117334722","msgId":106244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDFhNC4zOGRiMDJkOS4yZmNhMWIxOUBhb2wuY29tPg=="},"prevInTopic":106243,"nextInTopic":106247,"prevInTime":106243,"nextInTime":106245,"topicId":106241,"numMessagesInTopic":0,"msgSnippet":" Something that","messageBody":"<div id=\"ygrps-yiv-1508798703\">&lt;&lt;&lt;&lt;If anyone has stories to contribute to my quilt if &quot;YES&quot; words, send &#39;em<br/>\non! (Or just write them here and I&#39;ll life some good bits.)&gt;&gt;&gt;&gt;<br/>\n<br/>\nSomething that comes up a lot on A/U list is the concept of safety, or the<br/>\nidea of saying &quot;no&quot; when something is unsafe. I wrote this fairly recently. <br/>\n<br/>\n&lt;&lt;&lt;&lt;One of the processes that I have noticed in our life, and also in the<br/>\npostings of others, is that the definition of &quot;safe&quot; has definitely moved<br/>\ntowards the liberal. I find I have to re-examine every time what is safe.<br/>\nThere are times when people visiting our home get agitated because Jayn is<br/>\nclimbing on furniture in way that makes them concerned. I have to reassure<br/>\nthem that she is very balanced and confident. (Jayn&#39;s maternal grandfather<br/>\nwas a tightrope walker in a circus - I think she is showing signs of<br/>\ninheriting his abilities - skipping a generation) <br/>\n<br/>\nThere are ways that I change my response to &quot;unsafe&quot; mental alarm bells,<br/>\nrather than making the default position &quot;Jayn must stop or change her<br/>\nactivities&quot;:<br/>\n<br/>\nI reorder the environment, putting pillows, moving breakables etc.<br/>\n<br/>\nI re-examine the environment and action, rather than acting on a knee jerk<br/>\nreaction. The example that comes to mind is &quot;running around the pool&quot;. Our<br/>\npool surround is very old concrete, so pitted that it just does not become<br/>\nslippery. In addition experience reminds me that Jayn is cautious and has<br/>\nnever fallen while running in the wet. When we visit another pool, I do a<br/>\ncheck to test the slipperiness of the area, and share my findings with Jayn.<br/>\n<br/>\nI ask myself what I would be depriving Jayn of by making an arbitrary (or<br/>\nmy-comfort-based) decision on her behalf. It becomes risk assessment. How<br/>\nmuch would she realistically be hurt by falling onto her butt, versus the<br/>\nemotional hurt and stress on our relationship by me not trusting her or<br/>\ndiminishing her self-confidence.<br/>\n<br/>\nI show Jayn the safe way of accomplishing the action - like holding a plug<br/>\nby the plastic and not touching the metal prongs.&gt;&gt;&gt;&gt;<br/>\n<br/>\nI seems to me it is about saying &quot;yes&quot; through my actions, as well as my<br/>\nwords.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.322 / Virus Database: 267.2.0 - Release Date: 5/27/2005</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Saying YES to our kids","postDate":"1117319542","msgId":106243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ3YXJobSs2aDg5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFhNC4zOGRiMDJkOS4yZmNhMWIxOUBhb2wuY29tPg=="},"prevInTopic":106241,"nextInTopic":106244,"prevInTime":106242,"nextInTime":106244,"topicId":106241,"numMessagesInTopic":0,"msgSnippet":"... I loved this page! Pam s comments about the fact that there are kids who seem spoiled by parents who always say yes made me think. Don t you figure that","messageBody":"<div id=\"ygrps-yiv-533799516\"><blockquote><span title=\"ireply\">&gt; The woman in France said &quot;The trick is never to tell the children  no.&quot;<br/>\n&gt;  <br/>\n&gt; _<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/yes_\">http://sandradodd.com/yes_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/yes)\">http://sandradodd.com/yes)</a> <br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>I loved this page! Pam&#39;s comments about the fact that there are kids<br/>\nwho seem spoiled by parents who always say yes made me think. <br/>\n<br/>\nDon&#39;t you figure that the difference between this kind of yes (the<br/>\nmindful parenting kind) and the yes that is offered by parents of<br/>\nspoiled (hate that word) children is that the first one is offered<br/>\nfreely. It is a part of a view of children that parents are partners<br/>\nin creating a fulfilling, safe, rewarding life with and for their kids. <br/>\n<br/>\nThe other kind of yes is often capitulation to a demanding child - a<br/>\nchild who is not feeling heard or attended to, whose  behavior is<br/>\nincreasingly disruptive and so the parent says &quot;yes&quot; to stop the<br/>\ndisruptive behavior, not to add joy to the child&#39;s life.<br/>\n<br/>\nThat child is perceived as spoiled when in reality, the &quot;spoiled&quot;<br/>\nchild may actually be needy and attention deprived. <br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Saying YES to our kids","postDate":"1117307161","msgId":106241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhNC4zOGRiMDJkOS4yZmNhMWIxOUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":106243,"prevInTime":106240,"nextInTime":106242,"topicId":106241,"numMessagesInTopic":0,"msgSnippet":"I found a quote in Time magazine just now.  A woman in France (no  relation to Holly s being in France, but as connections go, I just made another  one )...","messageBody":"<div id=\"ygrps-yiv-87468511\">I found a quote in Time magazine just now.  A woman in France (no  relation <br/>\nto Holly&#39;s being in France, but as connections go, I just made another  one <br/>\n&lt;g&gt;)... A WOMAN IN FRANCE who&#39;s directing a program of education about  obesity <br/>\nfor children France was quoted in Newsweek, and what she said inspired  me to <br/>\ngo and polish up my &quot;YES&quot; pages a bit.  The first page links to the  <br/>\nJoyce-on-&quot;Yes&quot; page, and a few other writers are on there too.<br/>\n <br/>\nIf anyone has stories to contribute to my quilt if &quot;YES&quot; words, send &#39;em  on! <br/>\n(Or just write them here and I&#39;ll life some good bits.)<br/>\n <br/>\nThe woman in France said &quot;The trick is never to tell the children  no.&quot;<br/>\n <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/yes_\">http://sandradodd.com/yes_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/yes)\">http://sandradodd.com/yes)</a> <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":106280,"nextTopicId":106304}}