{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":20,"messages":[{"userId":458624268,"authorName":"Dola Dasgupta","from":"Dola Dasgupta &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Religion","postDate":"1375630022","msgId":71884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRTA1UktQWWY4RDdVeUJ5OGVvOGRyUzFLeVdrUl9ZME1vZHo5TV9QQmNRSFRHYlpFZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71882,"nextInTopic":0,"prevInTime":71883,"nextInTime":71885,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"We are Indians and I was born into a practicing Hindu family. Hindus do not eat beef because of religious reasons. As a child I lived in Dubai with my parents.","messageBody":"<div id=\"ygrps-yiv-2042266509\">We are Indians and I was born into a practicing Hindu family. Hindus do not<br/>\neat beef because of religious reasons. As a child I lived in Dubai with my<br/>\nparents. My sister and I explored different kinds of meat there. Especially<br/>\nbeef burgers. My parents did not stop us from exploring. However they did<br/>\nnot eat themselves. When I asked my mother she would say..&quot;I am just not<br/>\nused to eating beef. But you guys can eat if you want to.&quot; She did not cook<br/>\nbeef at home. When I married, my husband&#39;s family was also Hindu but they<br/>\nate all sorts of meat. I started to cook beef, pork and all else! When my<br/>\nsister and I got together at mum&#39;s place I cooked beef in her kitchen and<br/>\nshe did not mind it or object. She continued to not eat.<br/>\n<br/>\nWhen it comes to unschooling and food and other religious practices, I<br/>\npersonally feel for me unschooling has been about allowing my children to<br/>\nfind out for themselves what religion means to them. And they do this by<br/>\nasking me and others. We do this in our family through conversations and<br/>\nsharing our deepest values. I myself have been practicing only meditation<br/>\nas a daily practice. I do not pray as a Hindu anymore. For me the Hindu<br/>\nsigns and symbols and gods and goddesses have taken deeper meaning about<br/>\nnature, Universe or life forces and compassion and empathy.<br/>\n<br/>\nReligion for me has been for a long time now about personal choices and<br/>\ndeeper values that move me as a human being with relation to the world. I<br/>\nencourage my children to perceive the world according to their inherent<br/>\nperceptions or consciousness.<br/>\n<br/>\nIn our family, a lot of emphasis is on the individual consciousness and<br/>\nwhat that consciousness brings to the child in terms of food choices and<br/>\nother choices they make for themselves naturally and organically. I see<br/>\nmyself as an observer and partner in those choices and facilitating them. I<br/>\ntry not to polarize choices that my children make. By polarization I<br/>\nmean...calling a food choice or other choices right or wrong, bad or good,<br/>\nhealthy or unhealthy. Instead we try to talk about them and see from what<br/>\nspace the choice is stemming from. There are many choices that are<br/>\nimitations from the surroundings and environment that we as a family live<br/>\nin..and then there are choices that are naturally emerging from a deeper<br/>\nauthentic place within...I do feel it is important to live through choices<br/>\nto learn what stays and what doesn&#39;t stay with the child&#39;s true nature, for<br/>\nthe parent and the child.<br/>\n<br/>\nIn Advaita the philosophy of Non-duality which is the absence of Polarity<br/>\nthere is a saying called ..&quot;Neti neti neti&quot;...which means negating through<br/>\nliving choices...it means in English..&quot;Not this not this not this&quot; And<br/>\nequally there is another word which is said in the same breath that means<br/>\n&quot;this too that too&quot;<br/>\n<br/>\nDola<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":454093105,"authorName":"lalow","from":"&quot;lalow&quot; &lt;lalougor@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Religion","postDate":"1375628853","msgId":71882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0bHFubCtlZ3J1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0a2VmNitiaTBwQGVHcm91cHMuY29tPg=="},"prevInTopic":71877,"nextInTopic":71884,"prevInTime":71881,"nextInTime":71883,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"I want more peace and sweetness and communication - so it s important to me to be sweet, to look for peaceful options, and to open myself up to understand what","messageBody":"<div id=\"ygrps-yiv-1703786906\">I want more peace and sweetness and communication - so it&#39;s important to me to be sweet, to look for peaceful options, and to open myself up to understand what my kid is telling me... especially as she&#39;s not much of a talker!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>That especially as she&#39;s not much of a talker&quot; really hits home with me.  My middle son (10 years old) is so hard to read.  He talks but when and where he feels comfortable.  And it&#39;s often not when and where I want him to.  For example, at a restaurant he suddenly becomes sullen and uncommunicative,  he insists he wants to leave and begins to get upset.  Typically, I&#39;m patient, I know him well enough to know its a smell, the noise, confusion about the menu, so we go through each thing like a guessing game.  With very little communication from him, we usually muddle through it, often leaving early.  Then some days later her will tell me what it was.<br/>\n<br/>\nOur kids are all vegetarians,  they have all eaten meat, and it is my guess they will again at some point, especially my youngest who just loves all food.  I have my reasons but they are mine, each person has to figure out theirs.  I don&#39;t cook it though, I think I&#39;d get sick.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Religion","postDate":"1375583526","msgId":71877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0a2VmNitiaTBwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMTMwODAzMTAwMTA1LkdKMjk3MTVAdGhlLmVhcnRoLmxpPg=="},"prevInTopic":71876,"nextInTopic":71882,"prevInTime":71876,"nextInTime":71878,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"... When Morgan was younger I worried about what approach to take - with food as well as other things. What actually happened was that she saw something and","messageBody":"<div id=\"ygrps-yiv-1520240734\">Brynna Rafferty-Brown wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; ---- I would be really interested to know what approach vegetarian families<br/>\n&gt; &gt; have taken to the issue of their children trying meat... <br/>\n<br/>\n </span></blockquote>When Morgan was younger I worried about what &quot;approach&quot; to take - with food as well as other things. What actually happened was that she saw something and wanted to try it and I wanted to help her explore the world. So she had some McD&#39;s chicken nuggets and liked them. For awhile it was the only meat she would eat - while at the same time not liking to eat cookies shaped like animals! I bought her some at McD&#39;s, some in the freezer section of the grocery, made some from scratch, and made some veggie nuggets out of chick peas. She liked McD&#39;s best of the lot. Eventually, she decided she didn&#39;t want to eat chicken nuggets even though she liked them.<br/>\n<br/>\nOne of the things that helped me most as an unschooling parent was stepping back from ideas like &quot;what approach should I take?&quot; and &quot;how am I going to expose my kid to this?&quot; and instead look at my kid and think about what she wants, what interests her, what she seems to be trying to discover - and be curious about and amazed by that. Thinking about approaches and exposure was a way of seeing life with my kid as a series of lessons with hoped-for outcomes and right answers, which left me disconnected from my real kid, her interests and desires, and our relationship. It has helped instead to think about what kind of person I want to be, and what I value - what do I want to see More of in the world? And then make choices that take me in those directions. I want more peace and sweetness and communication - so it&#39;s important to me to be sweet, to look for peaceful options, and to open myself up to understand what my kid is telling me... especially as she&#39;s not much of a talker!<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":363518215,"authorName":"Claire","from":"&quot;Claire&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Religion","postDate":"1375572046","msgId":71876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0azM4ZStsMmIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0am1wNCtxaGdkQGVHcm91cHMuY29tPg=="},"prevInTopic":71875,"nextInTopic":71877,"prevInTime":71875,"nextInTime":71877,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"I ve been a vegetarian for 20 years, but my partner and kids are omnivores. I buy and cook the best organic meat I can, while also cooking lots of meals","messageBody":"<div id=\"ygrps-yiv-28092563\">I&#39;ve been a vegetarian for 20 years, but my partner and kids are omnivores. I buy and cook the best organic meat I can, while also cooking lots of meals without meat. I give my kids the foods they like. <br/>\n<br/>\nFor me, being a vegetarian is a profound philosophical choice that I arrived at through my own inclination, reading and experiences. It doesn&#39;t make sense for me to impose this choice on others because they are not me. In the same way, adhering to a religious faith is/should be a profoundly personal decision. Until children are old enough to make up their own minds, I don&#39;t think they should be considered to &#39;be&#39; a particular faith. Children of religious parents grow up within the traditions/practices of their parents&#39; beliefs, and the more those practices make sense, and the more that scope is provided for experimentation outside those practices, then the more likely it is that the children will genuinely respect their parents&#39; choices, whether they choose to adopt the same religious creed or not.<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":213806000,"authorName":"clarissa","from":"&quot;clarissa&quot; &lt;clarissa.harwell@...&gt;","profile":"soulstar78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Religion","postDate":"1375559268","msgId":71875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0am1wNCtxaGdkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBQjgxNzhWT1JkaDByRXJ1Yz1lNUNTZ0tPQzNYWkc0dnpUQz1oYnFqWV9SZVNYN0tvQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71874,"nextInTopic":71876,"prevInTime":71874,"nextInTime":71876,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"My husband and I are vegetarian and our 7 and 5 year old children had never tried meat until very recently when our 7 year old decided to try chicken. My","messageBody":"<div id=\"ygrps-yiv-1046179834\">My husband and I are vegetarian and our 7 and 5 year old children had never tried meat until very recently when our 7 year old decided to try chicken. My husband and I do not have the exact same reasoning behind our vegetarianism and our kids have heard many different reasons that some people choose not to eat meat. We&#39;ve discussed it casually over the years but never flat out said &quot;You cannot eat meat.&quot;<br/>\n<br/>\nI&#39;ve got to be frank that it took me a bit to process it when my daughter chose to try meat but I&#39;m so glad that I am making the effort to live my values while supporting her in hers! My husband and I were not with her when she tried chicken for the first time. She and her brother were out with my dad and I got a phone call - my dad said our daughter asked him to call us to check in with us about it and make sure it was ok with us. We found this very thoughtful and sweet. At first I was concerned that she felt she had to ask permission to eat something but, after talking with her about it and getting a feel for the situation, it seems it was more that she was considering how we might feel about it. I am pretty sure she would have been willing to forgo trying it if we had asked her to. <br/>\n<br/>\nIt was amazing to hear her thought process and excitement behind going from vegetarian to omnivore. Several days after her first trying it, she cried and said she wondered if it makes her a bad person for eating meat because she loves animals. She definitely feels some internal conflict between liking the taste/feeling proud of herself for trying something new while loving animals and not wanting them to be killed. <br/>\n<br/>\nI struggled within myself with the notion that she tried meat. I quickly realized that I liked the IDEA of my children being vegetarians...more that I was comfortable admitting. Fortunately, something I read here once popped into my head. I&#39;m sure I&#39;m wording it wrong but the sentiment was this: Your relationship with your kid needs to be more important than your IDEA of your kid. <br/>\n<br/>\nI am putting that into practice and enjoying the journey of watching my daughter  wrestle with her ideas and feelings about this; and supporting her along the way.<br/>\n<br/>\nI realize I didn&#39;t really offer any advice to your specific questions but I wanted to share our recent experience around the topic of vegetarianism.<br/>\n<br/>\n- Clarissa<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Brynna Rafferty-Brown &lt;braff16@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; This thread interests me a lot! My husband and I are both<br/>\n&gt; semi-practising Muslims... our daughter is only 18 months old, but<br/>\n&gt; working out how religious practice might fit in an unschooling context<br/>\n&gt; is something I&#39;ve been thinking about quite a bit lately. Mainly<br/>\n&gt; because we recently came back from a family holiday (the rest of my<br/>\n&gt; family aren&#39;t Muslim) where my family drank alcohol and ate bacon on<br/>\n&gt; occasion... When our daughter showed an interest in either one they<br/>\n&gt; would be very sweet and say things like &#39;No, this one&#39;s not for you&#39;<br/>\n&gt; or &#39;No, you don&#39;t want this. You&#39;ll never want to try this one!&#39;. I<br/>\n&gt; appreciated them trying to take account of our own practices, but<br/>\n&gt; wasn&#39;t comfortable with their choice of words at all!<br/>\n&gt; <br/>\n&gt; We haven&#39;t yet worked out what we&#39;ll do if she wants to try pork or<br/>\n&gt; alcohol at a later stage, or what we&#39;ll say to my family if it comes<br/>\n&gt; up again, but the thoughts I&#39;ve had so far are...<br/>\n&gt; <br/>\n&gt; In terms of praying and things we&#39;d like her to actively do, we just<br/>\n&gt; let her see what we&#39;re doing and include her if she wants to (e.g. she<br/>\n&gt; likes one of us to hold her while we pray and enjoys getting to pass<br/>\n&gt; our folded prayer mats and other bits and pieces to someone to put<br/>\n&gt; away when we&#39;re done). We&#39;re very happy with the idea of letting her<br/>\n&gt; start praying if and when she decides it&#39;s something she wants to do.<br/>\n&gt; <br/>\n&gt; In terms of pork and alcohol, we still have a bit more talking to do,<br/>\n&gt; but two of the points Joyce made are definitely part of the plan so<br/>\n&gt; far. Firstly, I plan to really think through why those things and<br/>\n&gt; others are important to me (and my husband) so we can come up with a<br/>\n&gt; clear explanation when she asks, something beyond simply &#39;Because<br/>\n&gt; we&#39;re Muslim&#39;. And I also like to keep in mind the story of an adult<br/>\n&gt; friend of mine in Indonesia who happily told me one day that he had in<br/>\n&gt; fact tasted pork when he was younger. He wouldn&#39;t eat it now as he&#39;s<br/>\n&gt; an adult, but until he reached puberty (adulthood religiously<br/>\n&gt; speaking) it wasn&#39;t a &#39;sin&#39; for him to try some. The story is unusual<br/>\n&gt; (I don&#39;t know if his parents knew about it) but it does actually<br/>\n&gt; completely fit with religious teachings.<br/>\n&gt; <br/>\n&gt; The other religious practice questions we&#39;ll have eventually (much<br/>\n&gt; further down the track!) will be things like dating and sex before<br/>\n&gt; marriage... At this point in time I imagine we&#39;ll just approach those<br/>\n&gt; things the same way any other family would approach practices or<br/>\n&gt; principles that they value... by being as honest as we can with our<br/>\n&gt; daughter about why those things are important to us.<br/>\n&gt; <br/>\n&gt; One of the main things I feel like we still need to work out is<br/>\n&gt; whether or not we&#39;re both comfortable with the idea of letting her try<br/>\n&gt; things like pork (or alcohol!) before she reaches puberty. e.g. what<br/>\n&gt; if she wants to try some bacon when she&#39;s three or four? I think I&#39;m<br/>\n&gt; okay with the idea of her trying it, but I have no idea what I&#39;d do if<br/>\n&gt; she decided she liked it!<br/>\n&gt; <br/>\n&gt; I would be really interested to know what approach vegetarian families<br/>\n&gt; have taken to the issue of their children trying meat... I know it&#39;s<br/>\n&gt; not exactly the same as a religious practice, but for families where<br/>\n&gt; their choice to be vegetarian is based on strong ethical objections to<br/>\n&gt; killing other living beings I imagine there might be some<br/>\n&gt; similarities?<br/>\n&gt; <br/>\n&gt; -- <br/>\n&gt; Lombok Kids    www.iced.org.au/lombok-kids<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":130276955,"authorName":"Juliet Kemp","from":"Juliet Kemp &lt;juliet@...&gt;","profile":"julietkemp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Religion","postDate":"1375524065","msgId":71874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMTMwODAzMTAwMTA1LkdKMjk3MTVAdGhlLmVhcnRoLmxpPg==","inReplyToHeader":"PENBQjgxNzhWT1JkaDByRXJ1Yz1lNUNTZ0tPQzNYWkc0dnpUQz1oYnFqWV9SZVNYN0tvQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQjgxNzhWT1JkaDByRXJ1Yz1lNUNTZ0tPQzNYWkc0dnpUQz1oYnFqWV9SZVNYN0tvQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71870,"nextInTopic":71875,"prevInTime":71872,"nextInTime":71875,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"... I m vegan and the other adults in the household are somewhere between vegetarian in practice and rarely eats meat . As a household we agreed not to","messageBody":"<div id=\"ygrps-yiv-285077769\">On Fri, Aug 02, 2013 at 09:45:08PM +1000, Brynna Rafferty-Brown wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; ---- I would be really interested to know what approach vegetarian families<br/>\n&gt; have taken to the issue of their children trying meat... I know it&#39;s<br/>\n&gt; not exactly the same as a religious practice, but for families where<br/>\n&gt; their choice to be vegetarian is based on strong ethical objections to<br/>\n&gt; killing other living beings I imagine there might be some<br/>\n&gt; similarities? ----<br/>\n<br/>\n </span></blockquote>I&#39;m vegan and the other adults in the household are somewhere between<br/>\n&quot;vegetarian in practice&quot; and &quot;rarely eats meat&quot;. As a household we<br/>\nagreed not to have/cook meat in the house. Currently Leon (17 months)<br/>\neats what we do, so mostly vegan, some eggs, very little dairy as he&#39;s<br/>\ngrowing out of some variety of intolerance.<br/>\n<br/>\nMy current approach is that I would prefer him not to eat meat until<br/>\nhe&#39;s old enough to understand what he&#39;s eating. At that point if he asks<br/>\nI will explain why I don&#39;t eat it (moral/ethical reasons), and if he<br/>\nwants to try it, will talk to a nearby close friend who is very<br/>\ninto cooking, eats good quality free range meat, and is a &quot;whole of the<br/>\nanimal&quot; eater. (Not that I would want or expect her to talk about all<br/>\nthat stuff with him unless he was interested, but I&#39;d be more<br/>\ncomfortable with him trying ethically-farmed meat at least initially.)<br/>\n<br/>\nHaving said that, if what he really wants to try is a McDonald&#39;s<br/>\nhamburger, then I think I would prioritise supporting that / our<br/>\nrelationship over my ethical concerns about fast food meat. Though again<br/>\nwould be honest about why I choose not to eat there.  <br/>\n<br/>\nIf he decides that he wants to eat meat more often, then we&#39;d have to<br/>\nwork out how to support that and what would work best for everyone.  I<br/>\nconfess that I hope he will prefer to stay at least mostly veggie as I<br/>\ndo like having a meat-free kitchen! <br/>\n<br/>\nIn the meantime, if he eats a ham sandwich at a party or whatever... I<br/>\nwon&#39;t be thrilled but I&#39;m not going to freak out about it either. I have<br/>\nasked our families not to offer meat, and if they ever make a big deal<br/>\nabout not offering (unlikely) I will ask them not to do that either  :)<br/>\n<br/>\n<br/>\nJuliet</div>","specialLinks":[]},{"userId":433681199,"authorName":"Yvonne Laborda","from":"Yvonne Laborda &lt;yvonnelaborda@...&gt;","profile":"labordayvonne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Religion","postDate":"1375483362","msgId":71870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQVB3cW9tUFhMdVd1SDV5Njdnd0sxbWdVV0JjRlAxUEZrZ2taPVJobl9WamlZQlBUQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBQjgxNzhWT1JkaDByRXJ1Yz1lNUNTZ0tPQzNYWkc0dnpUQz1oYnFqWV9SZVNYN0tvQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQjgxNzhWT1JkaDByRXJ1Yz1lNUNTZ0tPQzNYWkc0dnpUQz1oYnFqWV9SZVNYN0tvQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71860,"nextInTopic":71874,"prevInTime":71869,"nextInTime":71871,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"We are vegetarian and our children haven t had any interest in meat so far. I explain them why I choose and prefer not to eat meat. They simply wouldn t eat","messageBody":"<div id=\"ygrps-yiv-430217381\">We are vegetarian and our children haven&#39;t had any interest in meat so far.<br/>\nI explain them why I choose and prefer not to eat meat. They simply<br/>\nwouldn&#39;t eat any as for them eating a piece of dead animal isn&#39;t a choice<br/>\nnow. It puts them off. They really feel sorry for all those animals being<br/>\nkilled. If they want to eat o try meat when they grow up they will. My<br/>\nparents weren&#39;t vegetarians.<br/>\n<br/>\n<br/>\n2013/8/2 Brynna Rafferty-Brown &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:braff16@...\">braff16@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This thread interests me a lot! My husband and I are both<br/>\n&gt; semi-practising Muslims... our daughter is only 18 months old, but<br/>\n&gt; working out how religious practice might fit in an unschooling context<br/>\n&gt; is something I&#39;ve been thinking about quite a bit lately. Mainly<br/>\n&gt; because we recently came back from a family holiday (the rest of my<br/>\n&gt; family aren&#39;t Muslim) where my family drank alcohol and ate bacon on<br/>\n&gt; occasion... When our daughter showed an interest in either one they<br/>\n&gt; would be very sweet and say things like &#39;No, this one&#39;s not for you&#39;<br/>\n&gt; or &#39;No, you don&#39;t want this. You&#39;ll never want to try this one!&#39;. I<br/>\n&gt; appreciated them trying to take account of our own practices, but<br/>\n&gt; wasn&#39;t comfortable with their choice of words at all!<br/>\n&gt;<br/>\n&gt; We haven&#39;t yet worked out what we&#39;ll do if she wants to try pork or<br/>\n&gt; alcohol at a later stage, or what we&#39;ll say to my family if it comes<br/>\n&gt; up again, but the thoughts I&#39;ve had so far are...<br/>\n&gt;<br/>\n&gt; In terms of praying and things we&#39;d like her to actively do, we just<br/>\n&gt; let her see what we&#39;re doing and include her if she wants to (e.g. she<br/>\n&gt; likes one of us to hold her while we pray and enjoys getting to pass<br/>\n&gt; our folded prayer mats and other bits and pieces to someone to put<br/>\n&gt; away when we&#39;re done). We&#39;re very happy with the idea of letting her<br/>\n&gt; start praying if and when she decides it&#39;s something she wants to do.<br/>\n&gt;<br/>\n&gt; In terms of pork and alcohol, we still have a bit more talking to do,<br/>\n&gt; but two of the points Joyce made are definitely part of the plan so<br/>\n&gt; far. Firstly, I plan to really think through why those things and<br/>\n&gt; others are important to me (and my husband) so we can come up with a<br/>\n&gt; clear explanation when she asks, something beyond simply &#39;Because<br/>\n&gt; we&#39;re Muslim&#39;. And I also like to keep in mind the story of an adult<br/>\n&gt; friend of mine in Indonesia who happily told me one day that he had in<br/>\n&gt; fact tasted pork when he was younger. He wouldn&#39;t eat it now as he&#39;s<br/>\n&gt; an adult, but until he reached puberty (adulthood religiously<br/>\n&gt; speaking) it wasn&#39;t a &#39;sin&#39; for him to try some. The story is unusual<br/>\n&gt; (I don&#39;t know if his parents knew about it) but it does actually<br/>\n&gt; completely fit with religious teachings.<br/>\n&gt;<br/>\n&gt; The other religious practice questions we&#39;ll have eventually (much<br/>\n&gt; further down the track!) will be things like dating and sex before<br/>\n&gt; marriage... At this point in time I imagine we&#39;ll just approach those<br/>\n&gt; things the same way any other family would approach practices or<br/>\n&gt; principles that they value... by being as honest as we can with our<br/>\n&gt; daughter about why those things are important to us.<br/>\n&gt;<br/>\n&gt; One of the main things I feel like we still need to work out is<br/>\n&gt; whether or not we&#39;re both comfortable with the idea of letting her try<br/>\n&gt; things like pork (or alcohol!) before she reaches puberty. e.g. what<br/>\n&gt; if she wants to try some bacon when she&#39;s three or four? I think I&#39;m<br/>\n&gt; okay with the idea of her trying it, but I have no idea what I&#39;d do if<br/>\n&gt; she decided she liked it!<br/>\n&gt;<br/>\n&gt; I would be really interested to know what approach vegetarian families<br/>\n&gt; have taken to the issue of their children trying meat... I know it&#39;s<br/>\n&gt; not exactly the same as a religious practice, but for families where<br/>\n&gt; their choice to be vegetarian is based on strong ethical objections to<br/>\n&gt; killing other living beings I imagine there might be some<br/>\n&gt; similarities?<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Lombok Kids www.iced.org.au/lombok-kids<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nYvonne Laborda.<br/>\nwww.welivelearning.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":283841567,"authorName":"Brynna Rafferty-Brown","from":"Brynna Rafferty-Brown &lt;braff16@...&gt;","profile":"brynraff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Religion","postDate":"1375443908","msgId":71860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQjgxNzhWT1JkaDByRXJ1Yz1lNUNTZ0tPQzNYWkc0dnpUQz1oYnFqWV9SZVNYN0tvQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71844,"nextInTopic":71870,"prevInTime":71859,"nextInTime":71861,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"This thread interests me a lot! My husband and I are both semi-practising Muslims... our daughter is only 18 months old, but working out how religious practice","messageBody":"<div id=\"ygrps-yiv-908829102\">This thread interests me a lot! My husband and I are both<br/>\nsemi-practising Muslims... our daughter is only 18 months old, but<br/>\nworking out how religious practice might fit in an unschooling context<br/>\nis something I&#39;ve been thinking about quite a bit lately. Mainly<br/>\nbecause we recently came back from a family holiday (the rest of my<br/>\nfamily aren&#39;t Muslim) where my family drank alcohol and ate bacon on<br/>\noccasion... When our daughter showed an interest in either one they<br/>\nwould be very sweet and say things like &#39;No, this one&#39;s not for you&#39;<br/>\nor &#39;No, you don&#39;t want this. You&#39;ll never want to try this one!&#39;. I<br/>\nappreciated them trying to take account of our own practices, but<br/>\nwasn&#39;t comfortable with their choice of words at all!<br/>\n<br/>\nWe haven&#39;t yet worked out what we&#39;ll do if she wants to try pork or<br/>\nalcohol at a later stage, or what we&#39;ll say to my family if it comes<br/>\nup again, but the thoughts I&#39;ve had so far are...<br/>\n<br/>\nIn terms of praying and things we&#39;d like her to actively do, we just<br/>\nlet her see what we&#39;re doing and include her if she wants to (e.g. she<br/>\nlikes one of us to hold her while we pray and enjoys getting to pass<br/>\nour folded prayer mats and other bits and pieces to someone to put<br/>\naway when we&#39;re done). We&#39;re very happy with the idea of letting her<br/>\nstart praying if and when she decides it&#39;s something she wants to do.<br/>\n<br/>\nIn terms of pork and alcohol, we still have a bit more talking to do,<br/>\nbut two of the points Joyce made are definitely part of the plan so<br/>\nfar. Firstly, I plan to really think through why those things and<br/>\nothers are important to me (and my husband) so we can come up with a<br/>\nclear explanation when she asks, something beyond simply &#39;Because<br/>\nwe&#39;re Muslim&#39;. And I also like to keep in mind the story of an adult<br/>\nfriend of mine in Indonesia who happily told me one day that he had in<br/>\nfact tasted pork when he was younger. He wouldn&#39;t eat it now as he&#39;s<br/>\nan adult, but until he reached puberty (adulthood religiously<br/>\nspeaking) it wasn&#39;t a &#39;sin&#39; for him to try some. The story is unusual<br/>\n(I don&#39;t know if his parents knew about it) but it does actually<br/>\ncompletely fit with religious teachings.<br/>\n<br/>\nThe other religious practice questions we&#39;ll have eventually (much<br/>\nfurther down the track!) will be things like dating and sex before<br/>\nmarriage... At this point in time I imagine we&#39;ll just approach those<br/>\nthings the same way any other family would approach practices or<br/>\nprinciples that they value... by being as honest as we can with our<br/>\ndaughter about why those things are important to us.<br/>\n<br/>\nOne of the main things I feel like we still need to work out is<br/>\nwhether or not we&#39;re both comfortable with the idea of letting her try<br/>\nthings like pork (or alcohol!) before she reaches puberty. e.g. what<br/>\nif she wants to try some bacon when she&#39;s three or four? I think I&#39;m<br/>\nokay with the idea of her trying it, but I have no idea what I&#39;d do if<br/>\nshe decided she liked it!<br/>\n<br/>\nI would be really interested to know what approach vegetarian families<br/>\nhave taken to the issue of their children trying meat... I know it&#39;s<br/>\nnot exactly the same as a religious practice, but for families where<br/>\ntheir choice to be vegetarian is based on strong ethical objections to<br/>\nkilling other living beings I imagine there might be some<br/>\nsimilarities?<br/>\n<br/>\n-- <br/>\nLombok Kids    www.iced.org.au/lombok-kids</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Religion","postDate":"1375372886","msgId":71844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFREYyMkUzLUIwQ0YtNEY0Ny1BNTFCLUMzMDBCRjg1QkRBRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEE0MEFDQTM0LUU5M0UtNDIzNi1CNEU1LTA5REEzMjUzOTYyREBsZW50aW5lZmFtaWx5LmNvbT4=","referencesHeader":"PEE0MEFDQTM0LUU5M0UtNDIzNi1CNEU1LTA5REEzMjUzOTYyREBsZW50aW5lZmFtaWx5LmNvbT4="},"prevInTopic":71843,"nextInTopic":71860,"prevInTime":71843,"nextInTime":71845,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"... I think better than a we explanation -- which means you ve made some executive decision for her -- talk about what it spiritually means to you and why","messageBody":"<div id=\"ygrps-yiv-1470126398\">On Aug 1, 2013, at 10:57 AM, Sheryl Lentine wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For instance, if you are a practicing Jew and your child wanted to eat pork,<br/>\n&gt; would you buy her pork? Or explain &quot;we don&#39;t do this in our family and this is why . . . &quot;. <br/>\n<br/>\n </span></blockquote>I think better than a &quot;we&quot; explanation -- which means you&#39;ve made some executive decision for her -- talk about what it spiritually means to you and why you and your husband have decided to follow the rules you do. Don&#39;t try to persuade her to believe the &quot;right&quot; way. Share what&#39;s special about it for you.<br/>\n<br/>\nNot following the rules doesn&#39;t &quot;count&quot; until they&#39;re 13, right? So, depending on how strict your interpretation, you may not want to bring pork into your home, but you can let her know you&#39;ll support her in exploring it.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Religion","postDate":"1375372660","msgId":71843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRGQ0MwRUU5LTk3RUMtNDIzQy05RDRFLUM0N0UzOTc1REYyNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEE0MEFDQTM0LUU5M0UtNDIzNi1CNEU1LTA5REEzMjUzOTYyREBsZW50aW5lZmFtaWx5LmNvbT4=","referencesHeader":"PEE0MEFDQTM0LUU5M0UtNDIzNi1CNEU1LTA5REEzMjUzOTYyREBsZW50aW5lZmFtaWx5LmNvbT4="},"prevInTopic":71842,"nextInTopic":71844,"prevInTime":71842,"nextInTime":71844,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"I have a few things saved from over the years that might have little bits that would at least give you ideas. http://sandradodd.com/religion Some religions","messageBody":"<div id=\"ygrps-yiv-1577619254\">I have a few things saved from over the years that might have little bits that would at least give you ideas. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/religion\">http://sandradodd.com/religion</a><br/>\n<br/>\n&quot;Some religions are conducive to unschooling and others, not so much. There&#39;s no reason to sort through them, because each parent who looks at unschooling is looking through her own eyes, with her own knowledge and base beliefs. It doesn&#39;t work for everyone.&quot; is from this page:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/misconceptions\">http://sandradodd.com/misconceptions</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/christian/\">http://sandradodd.com/christian/</a> has some discussion applicable to other religions, too, and some links.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":327852347,"authorName":"Miles Tress","from":"Miles Tress &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Religion","postDate":"1375372085","msgId":71842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMxNWs3VTFMcjJIQWFPXzc1a2duRXBaN2cxZ191ajdoSndZcXBhNVZMSzdlUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEE0MEFDQTM0LUU5M0UtNDIzNi1CNEU1LTA5REEzMjUzOTYyREBsZW50aW5lZmFtaWx5LmNvbT4=","referencesHeader":"PEE0MEFDQTM0LUU5M0UtNDIzNi1CNEU1LTA5REEzMjUzOTYyREBsZW50aW5lZmFtaWx5LmNvbT4="},"prevInTopic":71840,"nextInTopic":71843,"prevInTime":71841,"nextInTime":71843,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"Hi Sheryl, We are churchgoers and our faith tradition is important to us in our everyday life.  The way I meld this with unschooling is that I have tried to","messageBody":"<div id=\"ygrps-yiv-1423388326\">Hi Sheryl,<br/>\nWe are churchgoers and our faith tradition is important to us in our<br/>\neveryday life.  The way I meld this with unschooling is that I have tried<br/>\nto encourage an atmosphere where my daughter is comfortable in asking about<br/>\nanything and questioning anything, even subjects or words that<br/>\ntraditionally wouldn&#39;t be allowed or discussed in churchgoing families.<br/>\nTress, unschooling Lillie (almost 11)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Aug 1, 2013 at 10:57 AM, Sheryl Lentine &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheryl@...\">sheryl@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; For those of you with religious families, how do you meld that with<br/>\n&gt; unschooling? For instance, if you are a practicing Jew and your child<br/>\n&gt; wanted to eat pork, would you buy her pork? Or explain &quot;we don&#39;t do this in<br/>\n&gt; our family and this is why . . . &quot;.<br/>\n&gt;<br/>\n&gt; In a secular household where nothing is considered sacred, it allows for a<br/>\n&gt; freedom that may not always be present in a household where some things are<br/>\n&gt; seen as &quot;sin&quot;.<br/>\n&gt;<br/>\n&gt; I&#39;m not talking about morality. For instance, I doubt any of us would<br/>\n&gt; allow a child to hit or abuse their siblings. That is not a religious<br/>\n&gt; issue, but a moral one. I&#39;m talking more about religious particulars.<br/>\n&gt;<br/>\n&gt; Sheryl<br/>\n&gt;<br/>\n&gt; Sent from my iPhone<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":409467702,"authorName":"Sheryl Lentine","from":"Sheryl Lentine &lt;sheryl@...&gt;","profile":"sheryl_lentine","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Religion","postDate":"1375369034","msgId":71840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0MEFDQTM0LUU5M0UtNDIzNi1CNEU1LTA5REEzMjUzOTYyREBsZW50aW5lZmFtaWx5LmNvbT4="},"prevInTopic":6907,"nextInTopic":71842,"prevInTime":71839,"nextInTime":71841,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"For those of you with religious families, how do you meld that with unschooling?  For instance, if you are a practicing Jew and your child wanted to eat pork,","messageBody":"<div id=\"ygrps-yiv-1332495982\">For those of you with religious families, how do you meld that with unschooling?  For instance, if you are a practicing Jew and your child wanted to eat pork, would you buy her pork? Or explain &quot;we don&#39;t do this in our family and this is why . . . &quot;. <br/>\n<br/>\nIn a secular household where nothing is considered sacred, it allows for a freedom that may not always be present in a household where some things are seen as &quot;sin&quot;.  <br/>\n<br/>\nI&#39;m not talking about morality.  For instance, I doubt any of us would allow a child to hit or abuse their siblings.  That is not a religious issue, but a moral one.  I&#39;m talking more about religious particulars.  <br/>\n<br/>\nSheryl<br/>\n<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":86585859,"authorName":"moonmeghan","from":"&quot;moonmeghan&quot; &lt;moonmeghan@...&gt;","profile":"moonmeghan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Religion","postDate":"1021252033","msgId":6907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFibjNrMSs3OXYyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4OS43Y2I3MDNiLjJhMGZkMTkwQGNzLmNvbT4="},"prevInTopic":6900,"nextInTopic":71840,"prevInTime":6906,"nextInTime":6908,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-459250555\">&lt;&lt;&lt;&lt; Well just  come down here Susan (or maybe you&#39;re already <br/>\nin the South?) and <br/>\n<blockquote><span title=\"ireply\"> &gt; you can get yelled at from street corners.<br/>\n&gt; The interesections nearest our house seem to be their favorite <br/>\n </span></blockquote>hell and <br/>\n<blockquote><span title=\"ireply\"> &gt; damnation yelling grounds!<br/>\n&gt; A Dad had his little boy out there yesterday, waving his Bible <br/>\n </span></blockquote>while the Dad <br/>\n<blockquote><span title=\"ireply\"> &gt; took pictures. I guess they have to document their way to <br/>\n </span></blockquote>heaven? Sheesh.<br/>\n<blockquote><span title=\"ireply\"> &gt; The poor kid.<br/>\n&gt; Ren&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Here in Paradise, CA there are 36 churches in a town with a <br/>\npopulation of 26,000.  They are all Christian, most of them <br/>\nfundamentalist (The Baha&#39;i Faith is here as well, but I have no <br/>\nidea what that is.  Hmm, I think I&#39;ll do a search on it).  Saying that, <br/>\nI&#39;ve found quite a few &#39;alternative thinkers&#39; up here.  There seems <br/>\nto be more diversity moving in.  They don&#39;t seem to sermonize <br/>\naround here though.  Apparently, they believe that you can only <br/>\nbe in God&#39;s favour by associating with fellow Christians (how <br/>\nthey are supposed to &#39;save&#39; anyone if they aren&#39;t willing to <br/>\nassociate with them is beyond me).<br/>\n<br/>\nMeghan<br/>\nThe happy heathen who has no interest whatsoever in being <br/>\n&#39;saved&#39;, thank you very much!</div>","specialLinks":[]},{"userId":69247285,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","profile":"bearspawprint","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Religion","postDate":"1021229332","msgId":6900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNTEyMTg0ODUyLjc2OTg5LnFtYWlsQHdlYjE0MzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDE4OS43Y2I3MDNiLjJhMGZkMTkwQGNzLmNvbT4="},"prevInTopic":6890,"nextInTopic":6907,"prevInTime":6899,"nextInTime":6901,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"... Once, eons ago, camping in the Yukon, Jehova s Wiitness found us!! A boy and his father came to the camp about dawn with religious flyers and asking for ","messageBody":"<div id=\"ygrps-yiv-1908005832\"><blockquote><span title=\"ireply\">&gt; A Dad had his little boy out there yesterday, waving<br/>\n&gt; his Bible while the Dad <br/>\n&gt; took pictures. I guess they have to document their<br/>\n&gt; way to heaven? Sheesh.<br/>\n&gt; The poor kid.<br/>\n<br/>\n<br/>\n </span></blockquote>Once, eons ago, camping in the Yukon, Jehova&#39;s<br/>\nWiitness&#39; found us!! A boy and his father came to the<br/>\ncamp about dawn with religious flyers and asking for<br/>\nmoney (they both had on white shirts and ties).  After<br/>\nthey left, some drunks found us and offered to take us<br/>\n(my companion and me) to breakfast!! Hmmmmm, is there<br/>\na message here?<br/>\n<br/>\nSharon of the Swamp<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nLAUNCH - Your Yahoo! Music Experience<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://launch.yahoo.com\">http://launch.yahoo.com</a></div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Religion","postDate":"1021212732","msgId":6890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NS5kMjIxZmQxLjJhMGZkMjNjQGNzLmNvbT4="},"prevInTopic":6889,"nextInTopic":6900,"prevInTime":6889,"nextInTime":6891,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/11/02 11:45:55 PM Central Daylight Time, AlwaysLearning@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-997632897\">In a message dated 5/11/02 11:45:55 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; It&#39;s actually easier to live in an Islamic country than it was to live in<br/>\n TN where everyone pushed fundamentalist christianity on you. At least here<br/>\n the gov schools aren&#39;t breaking laws when they have enforced prayers unlike<br/>\n the TN schools -- no offense to anyone who is christian so sorry ahead of<br/>\n time. &gt;&gt;<br/>\n<br/>\nNo offense taken!! I agree completely.....I used to get really riled up over <br/>\nthose people waving their Bibles and shouting. Now I just sigh and roll my <br/>\neyes. It&#39;s become part of the scenery here (FL).<br/>\nWhat country are you in? That must be quite the learning experience!!<br/>\nRen</div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Religion","postDate":"1021212560","msgId":6889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4OS43Y2I3MDNiLjJhMGZkMTkwQGNzLmNvbT4="},"prevInTopic":6885,"nextInTopic":6890,"prevInTime":6888,"nextInTime":6890,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/11/02 11:45:55 PM Central Daylight Time, AlwaysLearning@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-1443480782\">In a message dated 5/11/02 11:45:55 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; I swear--no offense to any religious people--that Christianity is out to <br/>\n get me &gt;&gt;<br/>\n<br/>\nWell just  come down here Susan (or maybe you&#39;re already in the South?) and <br/>\nyou can get yelled at from street corners.<br/>\nThe interesections nearest our house seem to be their favorite hell and <br/>\ndamnation yelling grounds!<br/>\nA Dad had his little boy out there yesterday, waving his Bible while the Dad <br/>\ntook pictures. I guess they have to document their way to heaven? Sheesh.<br/>\nThe poor kid.<br/>\nRen</div>","specialLinks":[]},{"userId":29913543,"authorName":"Kate Green","from":"Kate Green &lt;karegree@...&gt;","profile":"greenuae","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Religion","postDate":"1021178376","msgId":6885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMuMC42LjMyLjIwMDIwNTEyMDgzOTM2LjAwN2Y0OTUwQGVtaXJhdGVzLm5ldC5hZT4=","inReplyToHeader":"PDYyQTc1MkQ4LTY1NTgtMTFENi04MUQ5LTAwNTBFNDg1N0U0NkBhdHRiaS5jb20+","referencesHeader":"PDEwMjEwNjA5MjUuMjY4OS4xOTI1Mi5tN0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":6884,"nextInTopic":6889,"prevInTime":6884,"nextInTime":6886,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"... Aren t those weird when you are the only one who can hear them! During my 4th pregnancy the midwife was coming to the house for checkups and every time she","messageBody":"<div id=\"ygrps-yiv-891140447\"><blockquote><span title=\"ireply\">&gt; For a long time our bedroom phone broadcast a religious <br/>\n&gt; station in the background. Whenever I was having a conversation, I could <br/>\n&gt;&quot;&quot;&quot;&quot;--and the person to whom I was <br/>\n&gt; speaking could hear nothing! <br/>\n<br/>\n </span></blockquote>Aren&#39;t those weird when you are the only one who can hear them! <br/>\nDuring my 4th pregnancy the midwife was coming to the house for checkups<br/>\nand every time she tried to use the doppler to hear the baby&#39;s heart we got<br/>\na country music station playing! It was very strange hearing that coming<br/>\nout of your stomach!<br/>\n<br/>\nWe live surrounded by religion here. At first the blasting of the call to<br/>\nprayer around the whole city would wake us up but now we barely notice it.<br/>\nSometimes when you are walking you can have 3 mosques within sight of each<br/>\nother all with prayers blasting out of loudspeakers. It&#39;s weird at first<br/>\nbut funny how fast you adapt. <br/>\n<br/>\nIt&#39;s actually easier to live in an Islamic country than it was to live in<br/>\nTN where everyone pushed fundamentalist christianity on you. At least here<br/>\nthe gov schools aren&#39;t breaking laws when they have enforced prayers unlike<br/>\nthe TN schools -- no offense to anyone who is christian so sorry ahead of<br/>\ntime.<br/>\n<br/>\nKate<br/>\n<br/>\nOne other example, among many: our house is <br/>\n<blockquote><span title=\"qreply\"> &gt; being worked on (remember the toilet overflowing upstairs?) and one of <br/>\n&gt; the subcontractors was playing a Christian radio station so loudly the <br/>\n&gt; other day that I had to ask him to turn it down. I was going to joke <br/>\n&gt; about it to his boss and then I found out he, the boss, is also a <br/>\n&gt; born-again Christian!<br/>\n&gt; <br/>\n&gt; Susan, a former Methodist<br/>\n&gt; <br/>\n&gt;   <br/>\n&gt;      Yahoo! Groups Sponsor   ADVERTISEMENT<br/>\n&gt;        <br/>\n&gt;  To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt; <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Religion","postDate":"1021174577","msgId":6884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRlLmI1NzIwOTAuMmEwZjNkMzFAYW9sLmNvbT4="},"prevInTopic":6883,"nextInTopic":6885,"prevInTime":6883,"nextInTime":6885,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/11/2002 11:29:18 PM Eastern Daylight Time, ... I was going to suggest schizophrenia! Kelly [Non-text portions of this message have been","messageBody":"<div id=\"ygrps-yiv-1374571795\">In a message dated 5/11/2002 11:29:18 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:strandbe@...\">strandbe@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; Whenever I was having a conversation, I could <br/>\n&gt; hear &quot;the LORD sayeth&quot; and &quot;JEsus spoke&quot;--and the person to whom I was <br/>\n&gt; speaking could hear nothing<br/>\n<br/>\n </span></blockquote>I was going to suggest schizophrenia!<br/>\n<br/>\nKelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Religion","postDate":"1021174424","msgId":6883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdmLjI1ZjMxMjc4LjJhMGYzYzk4QGFvbC5jb20+"},"prevInTopic":6882,"nextInTopic":6884,"prevInTime":6882,"nextInTime":6884,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/11/02 9:29:36 PM, strandbe@attbi.com writes:  YES! I ve been","messageBody":"<div id=\"ygrps-yiv-1032048948\">In a message dated 5/11/02 9:29:36 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:strandbe@...\">strandbe@...</a> writes:<br/>\n<br/>\n&lt;&lt; our house is <br/>\nbeing worked on (remember the toilet overflowing upstairs?) &gt;&gt;<br/>\n<br/>\nYES!<br/>\n<br/>\nI&#39;ve been hoping you&#39;d give us an update, and tell us whether Erik&#39;s back <br/>\nfrom Australia too.   <br/>\n<br/>\nYou&#39;re having the most fascinating yet horribly expensive season... AND how&#39;s <br/>\nthe Rebecca-play progress?  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":106363166,"authorName":"Susan Bundlie","from":"Susan Bundlie &lt;strandbe@...&gt;","profile":"strandbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Religion","postDate":"1021174133","msgId":6882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyQTc1MkQ4LTY1NTgtMTFENi04MUQ5LTAwNTBFNDg1N0U0NkBhdHRiaS5jb20+","inReplyToHeader":"PDEwMjEwNjA5MjUuMjY4OS4xOTI1Mi5tN0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":6883,"prevInTime":6881,"nextInTime":6883,"topicId":6882,"numMessagesInTopic":0,"msgSnippet":" I swear--no offense to any religious people--that Christianity is out to get me. A friend of mine teases","messageBody":"<div id=\"ygrps-yiv-281221796\">&lt;&lt;OH NO.... I got on religion again.<br/>\nSorry.<br/>\n<br/>\nSandra&gt;&gt;<br/>\n<br/>\nI swear--no offense to any religious people--that Christianity is out to <br/>\nget me. A friend of mine teases me about it all the time--wherever I go, <br/>\nthere it is! For a long time our bedroom phone broadcast a religious <br/>\nstation in the background. Whenever I was having a conversation, I could <br/>\nhear &quot;the LORD sayeth&quot; and &quot;JEsus spoke&quot;--and the person to whom I was <br/>\nspeaking could hear nothing! One other example, among many: our house is <br/>\nbeing worked on (remember the toilet overflowing upstairs?) and one of <br/>\nthe subcontractors was playing a Christian radio station so loudly the <br/>\nother day that I had to ask him to turn it down. I was going to joke <br/>\nabout it to his boss and then I found out he, the boss, is also a <br/>\nborn-again Christian!<br/>\n<br/>\nSusan, a former Methodist</div>","specialLinks":[]}],"prevTopicId":71879,"nextTopicId":71792}}