{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":120206043,"authorName":"patti.schmidt2@verizon.net","from":"&lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re: TCS the modern view","postDate":"1034036263","msgId":45694,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMDA4MDAxNzQzLldEVU4yNjYxMi5vdXQwMDQudmVyaXpvbi5uZXRAWzEyNy4wLjAuMV0+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":45693,"nextInTime":45695,"topicId":45694,"numMessagesInTopic":0,"msgSnippet":"***One of the easiest things for parents to do is to do what their parents did, or what their neighbors are doing, without really thinking much.  There are ","messageBody":"<div id=\"ygrps-yiv-1767123953\">***One of the easiest things for parents to do is to do what their parents did, <br/>\nor what their neighbors are doing, without really thinking much.  There are <br/>\nmagazines to reinforce that.  They can just dress their kids like mannequins <br/>\nat Mervyn&#39;s and send them to the nearest school and buy them the recommended <br/>\nChristmas gifts and slide right on through to the graduations and weddings.***<br/>\n<br/>\nSandra, you summed that up so well.<br/>\nI have a friend (a good friend, met at La Leche League) who, after nursing her babies a good long time somehow fell right back into step with the rest of mainstream America after they were weaned.  Her kids have perfect clothes, perfect toys in a perfect playroom, and spend their days in school and at the requisite after school activities.  One time she was telling me how much her son hated little league practice and I asked her why she signed him up if he didn&#39;t want to do it.  She actually looked confused and a little panicked before she admitted that it hadn&#39;t occured to her to ask him if he wanted to do it- she just signed him up when he became of age.  Little League is as much an automatic part of childhood as school is, apparently.<br/>\n <br/>\nMy middle son (age 7) is playing soccer for the first time this year.  When I mention to anyone that it&#39;s his first year they don&#39;t know what to make of it... the other kids have been playing since they were 4!  When I say &quot;well, he never wanted to play before now&quot; I actually get silence and blank looks.  It&#39;s threatening to many people to see other people (including children) think critically and make up their own minds rather than just doing the next thing layed out for them.<br/>\n<br/>\nPatti</div>","specialLinks":[]}],"prevTopicId":45413,"nextTopicId":45569}}