{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":60467660,"authorName":"louisam1@juno.com","from":"louisam1@...","profile":"louisam1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] parental pressure? (I don&#39;t know the original subject line, sorry)","postDate":"1019600686","msgId":6403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNDI0LjA4MjE1Mi4tMjYyNjUxLjEubG91aXNhbTFAanVuby5jb20+"},"prevInTopic":6376,"nextInTopic":0,"prevInTime":6402,"nextInTime":6404,"topicId":6376,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1926894715\">&lt;&lt;The best preparation for law school is the ability to read critically,<br/>\nand to <br/>\nsee different aspects.  One of my boys&#39; best skills which would transfer <br/>\ndirectly to law is their amazing ability to read and understand the rules<br/>\nof <br/>\ncomplex games.  The booklets for some of their CCGs (collectible card<br/>\ngames, <br/>\nlike Legend of Five Rings, Seventh Sea, etc) run 60 pages and are as <br/>\ncomplicated as any contract!  And we have friends who have gone through<br/>\nlaw <br/>\nschool while visiting here monthly or more, and the kids have always<br/>\nheard <br/>\nstories from them.&gt;&gt;<br/>\n<br/>\nSpeaking from personal experience, my biggest obstacles in learning have<br/>\nbeen the blocks created by being forced to attempt them in ps.  Lanora<br/>\n(11) encounters college reading material and has no fear, it&#39;s a lark for<br/>\nher.  She&#39;s free of the baggage created by having stuff she wasn&#39;t ready<br/>\nfor stuffed down her throat and it all flows into the stream she&#39;s<br/>\nalready in.  Consequently she is able to grasp scientific and<br/>\nmathematical ideas that still make my muscles tense.<br/>\n<br/>\nKris<br/>\n<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"parental pressure? (I don&#39;t know the original subject line, sorry)","postDate":"1019496854","msgId":6376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3OS43MWJhYmVlLjI5ZjVhMzk2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":6403,"prevInTime":6375,"nextInTime":6377,"topicId":6376,"numMessagesInTopic":0,"msgSnippet":"I m just going to ask questions to expand topics, and share personal stories--it s not criticism of writers or families at all! In a message dated 4/22/02","messageBody":"<div id=\"ygrps-yiv-621771531\">I&#39;m just going to ask questions to expand topics, and share personal <br/>\nstories--it&#39;s not criticism of writers or families at all!<br/>\n<br/>\nIn a message dated 4/22/02 11:01:46 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lovehome@...\">lovehome@...</a> writes:<br/>\n<br/>\n&lt;&lt;  We changed instructors at times and added or subtracted from their <br/>\ncommitment levels as well, but they would not be able to play now for their <br/>\nown enjoyment or for performance if I hadn&#39;t pushed a little. &gt;&gt;<br/>\n<br/>\nWas it something they really wanted?<br/>\n<br/>\nThere are degrees of everything.  If they just vaguely said they were tired <br/>\nof it, I&#39;d press my kids a LITTLE, to remind them of the good days (moments, <br/>\nwhatever) of whatever they were wanting to drop out of.  But if there were <br/>\ntears and SERIOUS requests to quit, I wouldn&#39;t force them.<br/>\n<br/>\nMusic has traditionally been a part of public school.  I&#39;m sorry that&#39;s on <br/>\nthe wane, but it is.  In the early 20th century,  music reading and sight <br/>\nsinging were common classroom activities in the early grades.  <br/>\n<br/>\nBut looking back at those who learned music just because they were young and <br/>\nothers thought they should learn it, how many never touched the instrument <br/>\nagain after they were out of school?  <br/>\n<br/>\nAnd of those who learned an instrument on their own, out of personal <br/>\nenthusiasm, are professional musicians, or regularly-playing amateurs?  <br/>\n<br/>\n&lt;&lt;Assuming that your kids will suddenly discover and teach themselves all <br/>\nthey need to know at 16 to be successful in college is risky IMO. Big dreams <br/>\nrequire some planning. Being highly skilled demands discipline. &gt;&gt;<br/>\n<br/>\nWhat is &quot;all they need to know&quot;?  There were things I didn&#39;t know when I went <br/>\nto college, but I graduated in four straight years without a break.  I didn&#39;t <br/>\nknow, for example, what &quot;three credit hours&quot; meant.  Not a clue.  I had no <br/>\nidea what &quot;anthropology&quot; was.  I had never heard of some of the things there. <br/>\n I had never seen a Shakespeare play, I had only seen the 1968 Romeo and <br/>\nJuliet which had come out a few years before.  When I took a Shakespeare <br/>\nclass, I was LOST, totally.<br/>\n<br/>\nI got good grades in high school, took extra classes, graduated early, but I <br/>\ndidn&#39;t know all I needed to know.<br/>\n<br/>\nThere are a hundred things or more my children know now that I didn&#39;t know <br/>\nwhen I went to college at 17.  And none of them are 16 yet. <br/>\n<br/>\nThere are some things my kids don&#39;t know that I did know when I was their age.<br/>\n<br/>\n<br/>\n&lt;&lt;Success in college or having any job requires the ability to schedule your <br/>\ntime and being able to show up to do work even when you don&#39;t feel like it.&gt;&gt;<br/>\n<br/>\nHow do people learn to schedule time and show up and work?<br/>\nI don&#39;t think it&#39;s by having their moms wake them up every day just for <br/>\npractice.<br/>\n<br/>\nI don&#39;t think it comes from dads saying &quot;You have to get up at 7:00 on <br/>\nSaturday and help me in the garden because someday you&#39;ll have a job and...&quot;  <br/>\n They didn&#39;t apply for that job!<br/>\n<br/>\nWhen Kirby wanted to watch and record all the Pokemon TV shows when he was <br/>\nten or so, he set his own alarm, got the tapes in, and marked them.  He still <br/>\nhas all those tapes at 15.  I didn&#39;t tell him to do that.  <br/>\n<br/>\nWhen he was offered a job at 14, he already knew well how to use an alarm <br/>\nclock.  I still help him out, but way more often than not when I come to make <br/>\nsure he&#39;s awake, he&#39;s already up and getting in the shower.<br/>\n<br/>\nIf a person wants to take a class, he or she will set an alarm and get there. <br/>\n The more they want to take it, the more likely they&#39;ll arrange their lives <br/>\naround it.<br/>\n<br/>\n&lt;&lt;The computer gamer of today may want to be the engineer of tomorrow. He <br/>\nwill need to know long division. &gt;&gt;<br/>\n<br/>\nIf he can divide in his head, learning the format of a long division problem <br/>\nschool-style won&#39;t take but a few moments to get.<br/>\n<br/>\n&lt;&lt;Some of our kids will be the veterinarians of tomorrow. They will love <br/>\nmaking sick animals well--they will need lots of science courses. The&gt;&gt;<br/>\n<br/>\nThey will need to know lots of science.  That doesn&#39;t have to come from <br/>\ncourses.  If they&#39;re already confident and conversant about real-world <br/>\nscientific knowledge, success in a college course doesn&#39;t have the <br/>\npre-requisite of prior success in a lower-level course.<br/>\n<br/>\n&lt;&lt;Some of our kids, I&#39;m convinced,  won&#39;t need college or any advanced <br/>\nplanning and can make a great life living in the moment always. Some will <br/>\nwant law school or to be ballerinas.&gt;&gt;<br/>\n<br/>\nThe best preparation for law school is the ability to read critically, and to <br/>\nsee different aspects.  One of my boys&#39; best skills which would transfer <br/>\ndirectly to law is their amazing ability to read and understand the rules of <br/>\ncomplex games.  The booklets for some of their CCGs (collectible card games, <br/>\nlike Legend of Five Rings, Seventh Sea, etc) run 60 pages and are as <br/>\ncomplicated as any contract!  And we have friends who have gone through law <br/>\nschool while visiting here monthly or more, and the kids have always heard <br/>\nstories from them.<br/>\n<br/>\nIn college, some kids take political science as a preparation for law, but <br/>\nEnglish majors and history majors probably come better prepared in general <br/>\nfor what Law requires.  And the preparation to understand English and history <br/>\nis right up unschoolers&#39; boulevards!  (Unschoolers so rarely experience <br/>\nalleys in their lives...)<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":6397,"nextTopicId":6404}}