{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] therapy groups for kids and teens","postDate":"1340696738","msgId":67957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1OUYzRjU3LTFDQ0UtNDY1RC04MkUwLUQ2OEFGREY3QjI2Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpzYW5jdStra3NhQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzYW5jdStra3NhQGVHcm91cHMuY29tPg=="},"prevInTopic":67955,"nextInTopic":0,"prevInTime":67956,"nextInTime":67958,"topicId":67955,"numMessagesInTopic":0,"msgSnippet":"-=- The fact that they are reacting to their environment says everything that needs to be said. It is up to the parents to change that environment whether","messageBody":"<div id=\"ygrps-yiv-1428601208\">-=- The fact that<br/>\nthey are reacting to their environment says everything that needs to be<br/>\nsaid. It is up to the parents to change that environment whether their<br/>\nkids are in school or out. It isn&#39;t up to the kids to change their<br/>\nreactions to their environment, unless of course you want kids to put up<br/>\nand shut up in life.-=-<br/>\n<br/>\nBut there are environmental realities, and parents can help kids be happy with what they have to work with.<br/>\n<br/>\nIf parents become their children&#39;s partners, changing the environment and helping the kids have a realistic and peaceful perspective is part of creating a happy situation.<br/>\n<br/>\nThis, though, is spot on:  <br/>\n<br/>\n-=-If a parent can really see what the problem is and recognize that it is<br/>\ngenerally their own perception that even makes it a problem to begin<br/>\nwith, they will be one step closer to making better parenting choices.-=-<br/>\n<br/>\nUnschooling is about creating an environment in which natural learning can flourish.  (I said that once in Arizona and Roxana Sorooshian wrote it down  and showed it to me, and I&#39;ve used it ever since. :-)<br/>\n<br/>\nA parent can&#39;t expect to get the kinds of relationships those of us with older kids have without changing the environment (physical and emotional) in which they live when they&#39;re younger, and throughout.<br/>\n<br/>\nI have seen some unschoolers not do a great job, but it&#39;s from being illogical or inattentive, of from there being a lot of negativity in the situation and the kids picking that up.<br/>\n<br/>\nNegativity is crippling to curiosity, wonder and joy.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"therapy groups for kids and teens","postDate":"1340661982","msgId":67955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzYW5jdStra3NhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67957,"prevInTime":67954,"nextInTime":67956,"topicId":67955,"numMessagesInTopic":0,"msgSnippet":"This is a hot topic for me personally.  I ve done hours and hours of research on this in the past. The conclusion I came to was that parents could avoid ALL of","messageBody":"<div id=\"ygrps-yiv-1692564180\">This is a hot topic for me personally.  I&#39;ve done hours and hours of<br/>\nresearch on this in the past.<br/>\nThe conclusion I came to was that parents could avoid ALL of it if they<br/>\ntook even a moment and did some critical thinking and analysis of their<br/>\nown personal dynamic they have with their kids.<br/>\nIt is incredibly common to find problems with kids and teens.  It&#39;s also<br/>\nincredibly disheartening when I see it and hear it and read about it. <br/>\nIf a parent can really see what the problem is and recognize that it is<br/>\ngenerally their own perception that even makes it a problem to begin<br/>\nwith, they will be one step closer to making better parenting choices.<br/>\nKids react to their environment.  Sometimes their reactions aren&#39;t<br/>\ngreat, sometimes they are terrible and have terrible consequences, like<br/>\nrunning away from home, or over using drugs or alcohol.  The fact that<br/>\nthey are reacting to their environment says everything that needs to be<br/>\nsaid.  It is up to the parents to change that environment whether their<br/>\nkids are in school or out.  It isn&#39;t up to the kids to change their<br/>\nreactions to their environment, unless of course you want kids to put up<br/>\nand shut up in life.<br/>\nI don&#39;t know many parents who want their kids to mindlessly follow<br/>\norders.  Most parents, even the ones who expect this of their own kids<br/>\nin regards to their own rules, admittedly don&#39;t want that for their<br/>\nkids.  They simply don&#39;t see themselves as training their kids to do<br/>\njust exactly that.  If you&#39;ve intentionally or unintentionally created<br/>\nan environment that makes your kids miserable, do you really want them<br/>\nto simply adjust with that and accept it?<br/>\nI know I don&#39;t want that for my kids.  I don&#39;t want my kids to EVER be<br/>\nin a situation that makes them miserable and uncomfortable and not see a<br/>\nway out.  Parents are the most influential part of a kids life.  If<br/>\nparents enforce this of their kids, the kids will accept it as normal. <br/>\nIf parents allow kids to have hundreds of choices and work really hard<br/>\nat creating a life for their children in which kids can safely express<br/>\ntheir likes and dislikes and truly have a choice, they won&#39;t be nearly<br/>\nas accepting of things that make them terribly unhappy.<br/>\nHow does any of this relate to video games?<br/>\nHere&#39;s an excerpt from that health group:<br/>\n****************************************Top 5 Signs You Need Help With<br/>\nGaming or Internet Addiction<br/>\nDo you or someone you know spend too much time playing video or computer<br/>\ngames or going online? Here are some ways to tell if you need to ask for<br/>\nhelp:<br/>\n<br/>\n    1. You feel really happy when you&#39;re online or when you&#39;re playing<br/>\ngames, but as soon as you have to stop, you get angry or upset.<br/>\n    2. You think about going online or playing when you are supposed to<br/>\nbe focusing on other things, like doing school work or having dinner<br/>\nwith your family.<br/>\n    3. You spend more time with your keyboard or controller than<br/>\nphysically hanging out with your friends.<br/>\n    4. Your friends or parents ask what you spend all your time doing,<br/>\nand you lie about it or laugh it off, but inside you know they may have<br/>\na point.<br/>\n    5. You get up in the middle of the night to check your e-mail or your<br/>\nMySpace comments because you&#39;re having a hard time sleeping.<br/>\n*************************************<br/>\nI don&#39;t know how other people feel, but if I&#39;m happily playing a game or<br/>\nhappily online doing something I see as important and awesome, &quot;yes&quot;, I<br/>\ndo feel upset if I&#39;m pulled away from that.  Since I have kids, I do get<br/>\npulled away and I&#39;ve learned how to do that happily and I&#39;ve learned how<br/>\nto make my time online not interfere with their time needed of me.<br/>\nSometimes I think about being online or playing when I&#39;m supposed to be<br/>\ndoing other things, but you know what, it&#39;s normal to think about doing<br/>\nother things if you are engaged in something you don&#39;t necessarily want<br/>\nto do.  I can see how school work would fall into that category.<br/>\nSpending more time with keyboards and controllers over friends.  Well,<br/>\nthis is incredibly outdated!  One can truly have both at the same time.<br/>\nIf someone were constantly measuring my time and then judging whether or<br/>\nnot my activities were worthy ones, I&#39;d likely hide my activities too. <br/>\nThat&#39;s a normal human reaction to being measured and judged by others<br/>\nwhen what they are measuring and judging is something the one doing that<br/>\nmeasuring and judging has decided is negative and unworthy.<br/>\nAlso, yes, if I&#39;m having a hard time sleeping, then I will definitely do<br/>\nsomething other than just lie there!<br/>\nThe &quot;signs&quot; of addiction are only signs of addiction in that someone has<br/>\ndeemed the activity negative and unworthy.  Would someone say these<br/>\nthings of another if it applied to sports or music or art or science?<br/>\nI want my kids to know without any doubts, that I will support their<br/>\npassions.  It took me a while to really understand my older daughter&#39;s<br/>\nlove of horror and gory things, but when I could find a way to at the<br/>\nvery least revel in her joy of it, everything in our life was just that<br/>\nmuch better.<br/>\nOne time Schuyler gave a talk on TV at an unschooling conference.  A mom<br/>\nstood up at the end, during the question and answer part, and said flat<br/>\nout that she could NEVER support her son watching horror movies because<br/>\nshe didn&#39;t like them.  I thought how sad that was, how much that mom was<br/>\ngoing to miss out of something really fascinating because she didn&#39;t<br/>\nwant to support her kid in something he loved simply because she didn&#39;t.<br/>\nOne of the very best things about unschooling is how it has opened up my<br/>\nworld, how many things I have learned because of my kids, things I would<br/>\nnever have learned about otherwise.  As unschooling parents we can shut<br/>\na kids world just a tiny bit or we can open it up.  We can fear<br/>\naddiction and millions of other things, or we can let that go and really<br/>\nsee the beauty in what our kids love.<br/>\nMy oldest daughter is 18 and I&#39;ve seen many different styles of<br/>\nparenting.  Without a doubt, the ones who supported their kids, are the<br/>\nones who still have decent relationships with their kids.  The ones who<br/>\ndidn&#39;t, the outcomes have been horrendous, lots of damaged kids growing<br/>\nstraight into adulthood with wounded souls, unable to eliminate their<br/>\nbaggage and it had everything to do with how their parents didn&#39;t honor<br/>\nthose kids.  I know I&#39;ve shared this before, but I&#39;ll say it again. <br/>\nThis is from my dad.... In any given moment you can either bless or<br/>\ncurse your children but you can&#39;t do both at the same time.<br/>\nGiving your kids the ability to enjoy their passions, whatever they may<br/>\nbe, is a blessing.  Denying them is a little curse.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":67926,"nextTopicId":68003}}