{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":66835036,"authorName":"rjhill241@aol.com","from":"rjhill241@...","profile":"rjhill241","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] lurker comes forward","postDate":"1047944391","msgId":12985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI3LjJmYmQ1N2M2LjJiYTdiNmM3QGFvbC5jb20+"},"prevInTopic":12968,"nextInTopic":0,"prevInTime":12984,"nextInTime":12986,"topicId":12968,"numMessagesInTopic":0,"msgSnippet":"Well I guess I should introduce myself too, especially since I ve already posted several times. LOL I m Rhonda Hill, wife to Phillip, mother to Kass & Kree,","messageBody":"<div id=\"ygrps-yiv-339129356\">Well I guess I should introduce myself too, especially since I&#39;ve already <br/>\nposted several times. LOL <br/>\n<br/>\nI&#39;m Rhonda Hill, wife to Phillip, mother to Kass & Kree, our 11 yo twin <br/>\ndaughters. We&#39;ve unschooled since the minute I took them out of public <br/>\nschool. That was about 3 years ago. I never knew such a thing existed until <br/>\nshortly before I took them out, all I knew was that &quot;school&quot; didn&#39;t work for <br/>\nus. I was feeling as though everything was a battle and red tape. I had <br/>\nalways heard of homeschooling as a conservative, religious based decision. I <br/>\nfigured I&#39;d lie if I had to and say it was based on my religious beliefs, <br/>\nfiguring that since it is a constitutional right, that it would be a good <br/>\nbase from which to stand. No matter how far from the truth. Wow, was I <br/>\nshocked when I joined several local groups. Some were religious based, others <br/>\ndiversified, but more importantly I found I was not alone. <br/>\n<br/>\nNow a member of 2 groups,  one more diverse than another, I have many <br/>\nunschooling friends. They lurk here too. But they have to introduce <br/>\nthemselves.LOL <br/>\n<br/>\nAnyway, we have no typical day. Everyday is different and we find joy in all <br/>\nof them. There&#39;s even joy in the bickering. My hubby usually reminds them <br/>\nthat if they were in school they wouldn&#39;t be with each other so maybe they&#39;d <br/>\nget along better??? They quickly admit their pettiness and that it would <br/>\ndefinately suck to go back. He is a complete believer in unschooling and is <br/>\ncurrently sitting behind me trying to mess me up because I&#39;m not paying <br/>\nattention to him right now. He&#39;s my biggest kid of course. Jealous of the <br/>\ncomputer and books. <br/>\n<br/>\nI&#39;d also like to say that he&#39;s a Marine &  National Guardsman, however he was <br/>\ninactivated a couples of years ago when I got ill. To all of you with loved <br/>\nones serving, our thoughts and hopes are with you. The twins plan on going <br/>\ninto the Corps, a thought that can make a mother both honored and sad <br/>\nsimultaneously. They are young still and could change their minds tomorrow, <br/>\nbut then again isn&#39;t that what all this is about? We would not change our <br/>\nlifestyle for any other. We are free in our home, if not in the world.<br/>\n<br/>\nProbably way more info than any of you wanted to know. But those here who <br/>\nknow me personally can testify I tend to have diarhea of the mouth, the <br/>\nkeyboard and other orfaces. LOL<br/>\n<br/>\nThis group is wonderful, thank you to everyone on it.<br/>\n<br/>\nRhonda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":86892525,"authorName":"Maggie Lesoing","from":"Maggie Lesoing &lt;maggiel@...&gt;","profile":"mlesoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"lurker comes forward","postDate":"1047925948","msgId":12968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENFNjU5QzEwLTU4QTYtMTFENy05ODE5LTAwMDM5M0IxQTUzQ0BvbHlwZW4uY29tPg=="},"prevInTopic":0,"nextInTopic":12985,"prevInTime":12967,"nextInTime":12969,"topicId":12968,"numMessagesInTopic":0,"msgSnippet":"Hi all, I am new to this list but not new to unschooling.  I have lurked for a week or so but the conversation this morning prompted me to begin chatting with","messageBody":"<div id=\"ygrps-yiv-662546550\">Hi all,<br/>\n<br/>\nI am new to this list but not new to unschooling.  I have lurked for a <br/>\nweek or so but the conversation this morning prompted me to begin <br/>\nchatting with you all.<br/>\n<br/>\nMy introduction was made sort of informally, so I thought I&#39;d try <br/>\nagain.  I am Maggie Lesoing, married, with 2 unschooled boys, Ethan, age <br/>\n5 (6 in June!) and Cyrus, age 9.  Someone today said they had unschooled <br/>\nsince birth, and I think that is true for us, as well.<br/>\n<br/>\nI love unschooling with all my heart.  It truly &#39;fits.&#39; The only <br/>\nso-called problem I ever have (apart from my husband&#39;s occasional low <br/>\nconfidence levels -- lol!) is that we are TOGETHER all day, every day, <br/>\nand all night, as well.  We have time apart when the boys go play at a <br/>\nneighbor&#39;s house or something, but basically it&#39;s us together constantly.<br/>\n<br/>\nAmid all this togetherness, which I mostly love dearly, there are times <br/>\nwhen my mind craves being physically alone, or when I crave quiet, or <br/>\nwhen I can&#39;t stand one more minute of fighting!  (The boys have gotten <br/>\ninto a nasty routine of fighting together quite a bit!)<br/>\n<br/>\nHow do you all handle this?  Is it an issue for anyone else?  Parenting <br/>\nis very much in the forefront of my mind most of the time, like how to <br/>\nhandle some tougher situations, like fighting, etc.  My philosophy is <br/>\nin-line with the Parenting with Dignity people, (they even have a web <br/>\nsite for anyone interested --    <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentingwithdignity.com/PWD/menu/index.htm)\">http://www.parentingwithdignity.com/PWD/menu/index.htm)</a>  but even with <br/>\nthat philosophy my patience and creativity is frequently challenged.<br/>\n<br/>\nJust hoping for support and suggestions from others.  There are other <br/>\nhomeschoolers in our tiny little town but I am the only unschooler as <br/>\nfar as I know, and most of not all of the other hs&#39;ers do curriculums or <br/>\nschool at home.  It can begin to feel that I am afloat in a vast ocean <br/>\nwith one tiny life boat.<br/>\n<br/>\nThanks in advance.  You are all wonderful, of course!<br/>\n<br/>\nMaggie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":12859,"nextTopicId":12858}}