{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":65837075,"authorName":"Shannon","from":"&quot;Shannon&quot; &lt;davenshan@...&gt;","profile":"shan_who","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] responsibility, chores etc...","postDate":"1062538225","msgId":79757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhFRUVKSFBHQ0tQRkdQTUVMTk9ESUVMTkRMQUEuZGF2ZW5zaGFuQG1pbmRzcHJpbmcuY29tPg==","inReplyToHeader":"PDIwMDMwOTAyLjA3MzUyNi40MzkzLjI1MDAwMEB3ZWJtYWlsMjAubnljLnVudGQuY29tPg=="},"prevInTopic":79723,"nextInTopic":0,"prevInTime":79756,"nextInTime":79758,"topicId":79723,"numMessagesInTopic":0,"msgSnippet":"... From: Ren Unfortunately, I did not always operate this way and am still having to undo some of the damage I inflicted. Trevor has some anger due to my","messageBody":"<div id=\"ygrps-yiv-959697445\">-----Original Message-----<br/>\nFrom: Ren<br/>\nUnfortunately, I did not always operate this way and am still having to undo<br/>\nsome of the damage I inflicted. Trevor has some anger due to my former<br/>\nparenting practices (or at least I blame myself!). Lately, when he gets mad<br/>\nat a sibling for taking something of his, he reacts with anger. I&#39;m sure<br/>\npart of the problem is not having a door he can shut on his room...something<br/>\nwe need to deal with, BUT I tell him I&#39;d rather replace ten of the item he&#39;s<br/>\npissed about than have him get angry at his little sister or brother.<br/>\nI tell him that things can be replaced, but I can&#39;t fix their hurt feelings<br/>\nvery easily. This reminder seems to be helping him react more calmly.<br/>\nThe psyche of a person seems to be the disposable thing in traditional<br/>\nparenting practices. Money should never, ever become more important than<br/>\npeace and joy.<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\n<br/>\nRen,<br/>\nI&#39;m going through the same things at my house.  I&#39;ve done a lot of damage to<br/>\nConnor with my mainstream parenting before coming to this list.  I didn&#39;t<br/>\neven realize I was doing him harm until I looked at what I was doing/saying<br/>\nto him from another pov.  It is so hard to change my (and dh) habits and it<br/>\nis slow going.  Just last night dh and I had a conversation about Connor not<br/>\neating over his plate.  He&#39;s 6yo.  This has been an issue for dh for a few<br/>\nyears now and he&#39;s sucked me into it.  Well, he asked for my advice last<br/>\nnight.  So I told him I didn&#39;t think it was a big deal.  The floor is<br/>\nlaminate/faux wood, he is after all, only 6yo and I&#39;m sure the nagging has<br/>\nGOT to be driving Connor nuts.  Lol   Oh, and dh wanted Connor to clean up<br/>\nthe mess he made all by himself.  So that was another thing I said was that<br/>\nif the mess was that important to him, he could ask Connor to help clean it<br/>\nup.  I told him that messes are overwhelming to clean up all by a 6yo&#39;s<br/>\nself.  SO, we are making progress.  But it is ssslllooowww going.  I was so<br/>\nproud of myself for being able to tell dh what I really thought and that dh<br/>\nlistened and took my advice.<br/>\n<br/>\nOh and another thing.  Dave (dh) is in the planning stages of building a<br/>\nskate ramp for Connor.  Connor is so into skating and biking on ramps.  He<br/>\nis just so excited for it.  Well, the other night, Dave tells Connor that he<br/>\nexpects him to be out there every night to help build it because HE thinks<br/>\nit would be good for him to learn to use a tape measure, yada yada yada.  So<br/>\nlast night I also told Dave that he is making this ramp all about himself<br/>\nrather than doing it for Connor.  He didn&#39;t understand what I meant.  So I<br/>\ntold him that HE wants this and HE wants that.  So he finally GOT it and has<br/>\nchanged his tune about the whole thing.  He&#39;s still going to build it.  But<br/>\nwon&#39;t expect Connor to be out there if he doesn&#39;t want to.<br/>\n<br/>\nShannon Buckley<br/>\nMom to Connor 3-15-97, Carsten born at home 4-27-99/5-19-00 and Quinn born<br/>\nat home 8-08-02<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"responsibility, chores etc...","postDate":"1062512793","msgId":79723,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwOTAyLjA3MzUyNi40MzkzLjI1MDAwMEB3ZWJtYWlsMjAubnljLnVudGQuY29tPg=="},"prevInTopic":0,"nextInTopic":79757,"prevInTime":79722,"nextInTime":79724,"topicId":79723,"numMessagesInTopic":0,"msgSnippet":"When I operate out of integrity and clarity as to the appropriate decision, not focusing on the money aspect, I am always more content with the outcome, even","messageBody":"<div id=\"ygrps-yiv-1396783520\">&quot;When I operate out of integrity and clarity as to<br/>\nthe appropriate decision, not focusing on the money aspect, I am always<br/>\nmore content with the outcome, even if it means losing money. Money is just<br/>\nthat - only money. My relationships with my children, and their happiness<br/>\nare way more important to me.&quot;<br/>\n<br/>\nI really enjoyed your whole post Lee...especially the beautiful real life examples of this integrity and kindness.<br/>\n<br/>\nUnfortunately, I did not always operate this way and am still having to undo some of the damage I inflicted. Trevor has some anger due to my former parenting practices (or at least I blame myself!). Lately, when he gets mad at a sibling for taking something of his, he reacts with anger. I&#39;m sure part of the problem is not having a door he can shut on his room...something we need to deal with, BUT I tell him I&#39;d rather replace ten of the item he&#39;s pissed about than have him get angry at his little sister or brother.<br/>\nI tell him that things can be replaced, but I can&#39;t fix their hurt feelings very easily. This reminder seems to be helping him react more calmly. <br/>\nThe psyche of a person seems to be the disposable thing in traditional parenting practices. Money should never, ever become more important than peace and joy.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":23378,"nextTopicId":79728}}