{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sticking up for kids","postDate":"1323389573","msgId":64192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0ODEyRkMzLUZDQzMtNDk0OC04NDQ3LTVBODNEOTk4MTcxMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpicmhzZit1ZzRqQGVHcm91cHMuY29tPg==","referencesHeader":"PGpicmhzZit1ZzRqQGVHcm91cHMuY29tPg=="},"prevInTopic":64190,"nextInTopic":0,"prevInTime":64191,"nextInTime":64193,"topicId":64180,"numMessagesInTopic":0,"msgSnippet":"-=-Your statement did make me realize something about why I m still thinking about this almost 2 weeks later (not a lot, just now and then). I think I feel","messageBody":"<div id=\"ygrps-yiv-1447045645\">-=-Your statement did make me realize something about why I&#39;m still thinking about this almost 2 weeks later (not a lot, just now and then). I think I feel like since it is family and he is my nephew I have more responsibility or obligation to try and help him. -=-<br/>\n<br/>\nFew of us would appreciate our siblings/in-laws and their spouses to feel that since our kids are family and their nephews that they have more responsibility and obligation to try to rescue them from unschooling situations.<br/>\n<br/>\nCasual mainstream &quot;toughen them up&quot; actions and messages have a long history.  That keeps them from seeming wrong and dangerous, while what we&#39;re doing seems wrong and dangerous to millions, maybe billions of people. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: sticking up for kids","postDate":"1323387599","msgId":64190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpicmhzZit1ZzRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU4NUJEQ0Y4LUNGMEYtNDMzMC1BMDJFLTgzN0U5QjZERjgxMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64189,"nextInTopic":64192,"prevInTime":64189,"nextInTime":64191,"topicId":64180,"numMessagesInTopic":0,"msgSnippet":"-=- Rather than review and share and focus on sorrow in someone else s life, though, please focus on the joy in yours.   Seriously, there are enough sad","messageBody":"<div id=\"ygrps-yiv-404443202\">-=- Rather than review and share and focus on sorrow in someone else&#39;s life, though, please focus on the joy in yours.   Seriously, there are enough sad stories to depress us all, so don&#39;t start to catalog them.-=-<br/>\n<br/>\nYes, lately I am feeling so high on life! I really wouldn&#39;t change hardly a thing in my life right now and give thanks each day for the wonderful people in my life. <br/>\n<br/>\nYou&#39;re statement did make me realize something about why I&#39;m still thinking about this almost 2 weeks later (not a lot, just now and then). I think I feel like since it is family and he is my nephew I have more responsibility or obligation to try and help him. <br/>\n<br/>\nOf ccourse what I realized is that there are millions of children (maybe billions?) in similar or much worse situations and it would be ridiculous to expect that I can help them all. That and I am not a regular persence in this family&#39;s life. I really did what was suggested - being kind to him etc, so I will continue when I can.<br/>\n<br/>\nOne of my biggest realizations in the past few years is that we can&#39;t control or change others - it must come from them. Otherwise words are really futile. Thanks for the reminder...<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sticking up for kids","postDate":"1323380777","msgId":64189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjMzODA3NzcuNjA3MzUuWWFob29NYWlsTmVvQHdlYjEyMjUwNy5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDU4NUJEQ0Y4LUNGMEYtNDMzMC1BMDJFLTgzN0U5QjZERjgxMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpicXRpdStoc29sQGVHcm91cHMuY29tPiA8NTg1QkRDRjgtQ0YwRi00MzMwLUEwMkUtODM3RTlCNkRGODExQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":64188,"nextInTopic":64190,"prevInTime":64188,"nextInTime":64190,"topicId":64180,"numMessagesInTopic":0,"msgSnippet":"***Mentioning, as he gets older, that some adults play too rough, or that you wish his dad would be nicer to him sometimes (without making a big deal, just a","messageBody":"<div id=\"ygrps-yiv-1429281951\">***Mentioning, as he gets older, that some adults play too rough, or that you wish his dad would be nicer to him sometimes (without making a big deal, just a mention in passing) would be enough for him to know he could consider it something that wasn&#39;t universal.***<br/>\n<br/>\n<br/>\nThat can be a big deal!  We know a teen that has told me, that before he met us he really didn&#39;t know that parents could be different from what he experienced.  It was a mind opening, mind blowing kind of life changing thing for him.  I have no doubts that if and when he ever has kids, he&#39;ll be a way better parent than his own parents simply by having known our family.<br/>\n<br/>\nI can&#39;t change another parent, even by being kind or hinting at something different, or flat out telling them, unless of course that parent is wanting to change and do something different.  What I can do, is be kind to the kid and that kindness can overflow into that parent/child relationship sometimes, and if not, that kid will have a better chance at being a better parent simply by knowing that there is another way.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sticking up for kids","postDate":"1323373098","msgId":64188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4NUJEQ0Y4LUNGMEYtNDMzMC1BMDJFLTgzN0U5QjZERjgxMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpicXRpdStoc29sQGVHcm91cHMuY29tPg==","referencesHeader":"PGpicXRpdStoc29sQGVHcm91cHMuY29tPg=="},"prevInTopic":64185,"nextInTopic":64189,"prevInTime":64187,"nextInTime":64189,"topicId":64180,"numMessagesInTopic":0,"msgSnippet":"-=-I was trying to make best of a couple hours with all 5 kids and just me and BIL. But afterwards I wondered if I could handle differently/better...-=- Maybe","messageBody":"<div id=\"ygrps-yiv-847701737\">-=-I was trying to make best of a couple hours with all 5 kids and just me and BIL. But afterwards I wondered if I could handle differently/better...-=-<br/>\n<br/>\nMaybe if you&#39;re always nice to him and smile and touch him sweetly, he&#39;ll know he could talk to you if he needed to.  Mentioning, as he gets older, that some adults play too rough, or that you wish his dad would be nicer to him sometimes (without making a big deal, just a mention in passing) would be enough for him to know he could consider it something that wasn&#39;t universal.<br/>\n<br/>\nRather than review and share and focus on sorrow in someone else&#39;s life, though, please focus on the joy in yours.   Seriously, there are enough sad stories to depress us all, so don&#39;t start to catalog them.<br/>\n<br/>\nIn the moment something&#39;s happening, even if another adult says &quot;that didn&#39;t hurt you,&quot; you could say &quot;Yeah, my dad used to say that whether I was hurt or not&quot; to the kid, or the adult, but lightly, so they think about it without being all defensive.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: sticking up for kids","postDate":"1323366814","msgId":64185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpicXRpdStoc29sQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhQZTREczVvN19YQURVUV9vWnlOV1VubW9FbkJtZXlHemlULUxtRF9KV191Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":64184,"nextInTopic":64188,"prevInTime":64184,"nextInTime":64186,"topicId":64180,"numMessagesInTopic":0,"msgSnippet":"Our relationship is good but we only have seen each other a handful of times the past few years. He is 6 1/2 years old. His mom is my husband s sister. Our","messageBody":"<div id=\"ygrps-yiv-1773701193\">Our relationship is good but we only have seen each other a handful of times the past few years.<br/>\n<br/>\nHe is 6 1/2 years old.<br/>\n<br/>\nHis mom is my husband&#39;s sister. Our relationship is pretty superficial. She and my husband are NOT close and never have been. After they had a blow-up last Christmas, *I* had a good talk with both my SIL and BIL, but my husband has no desire to work at it with them. She told me she wants to be closer to Mike (my husband) now, but she hasn&#39;t followed through by pushing it with him - they are busy, career people with 3 young kids. Mike did not make an effort to return her call last year and then she gave up I think.<br/>\n<br/>\nAll things I recognize are outside of my control.<br/>\n<br/>\nWe live in DC and they are in Minneapolis, so my contact with him is pretty limited. Also I really don&#39;t know what their lives are like day to day, so my feelings are based on a very short time spent with them. We skype with the kids about once a month. <br/>\n<br/>\nWhen we are together with the whole family, my husband and I are really the ones who spend the most time with all the kids (ours and their cousins) so I know they really like being around us. I guess as they get older and it is appropriate we can just try to be in contact with them - via skype, letters, cards and visits as much as possible... <br/>\n<br/>\nWith the one incident that happened, I was the only other adult around because the others all went out to breakfast. BIL and I were getting all 5 kids ready to go to park (my idea, I wanted to get kids outside!) My nephew was not getting ready fast enough (I think? hard to remember what little thing it was to trigger it) and I didn&#39;t see it but I heard nephew cry... While BIL was out of room I did rub his back and ask if he was ok - he said yes, so I gave him a little hug and kiss. Then when BIL came back he told him again that it hurt and BIL insisted that it didn&#39;t, he was fine, etc.<br/>\n<br/>\nI was trying to make best of a couple hours with all 5 kids and just me and BIL. But afterwards I wondered if I could handle differently/better...<br/>\n<br/>\nSusan<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; How is your relationship with your nephew? You didn&#39;t say how old he is?<br/>\n&gt; I&#39;m not sure what to do or say about his father, but can you make a lot<br/>\n&gt; more effort to be a regular presence for your nephew so he feels like he<br/>\n&gt; does have someone to turn to if things get really bad (thinking things<br/>\n&gt; could escalate if he gets older and starts resisting his father hurting<br/>\n&gt; him).<br/>\n&gt; <br/>\n&gt; Also - does he have a mother? What is her reaction? Maybe she&#39;s upset by it<br/>\n&gt; and doesn&#39;t know what to do and could be supported in intervening.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sticking up for kids","postDate":"1323364477","msgId":64184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQZTREczVvN19YQURVUV9vWnlOV1VubW9FbkJtZXlHemlULUxtRF9KV191Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpicWs4cytpN2dxQGVHcm91cHMuY29tPg==","referencesHeader":"PGpicWs4cytpN2dxQGVHcm91cHMuY29tPg=="},"prevInTopic":64180,"nextInTopic":64185,"prevInTime":64183,"nextInTime":64185,"topicId":64180,"numMessagesInTopic":0,"msgSnippet":"How is your relationship with your nephew? You didn t say how old he is? I m not sure what to do or say about his father, but can you make a lot more effort to","messageBody":"<div id=\"ygrps-yiv-10728454\">How is your relationship with your nephew? You didn&#39;t say how old he is?<br/>\nI&#39;m not sure what to do or say about his father, but can you make a lot<br/>\nmore effort to be a regular presence for your nephew so he feels like he<br/>\ndoes have someone to turn to if things get really bad (thinking things<br/>\ncould escalate if he gets older and starts resisting his father hurting<br/>\nhim).<br/>\n<br/>\nAlso - does he have a mother? What is her reaction? Maybe she&#39;s upset by it<br/>\nand doesn&#39;t know what to do and could be supported in intervening.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Dec 8, 2011 at 7:14 AM, DaBreeze21 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susanmay15@...\">susanmay15@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I am noticing on facebook lately so many sad &quot;updates&quot; from my &quot;friends&quot;.<br/>\n&gt; About &quot;good moms yelling&quot;, kids being &quot;brats&quot; and feeling entitled to<br/>\n&gt; things, and letting kids cry in bed alone long enough that when finally<br/>\n&gt; checked on the child doesn&#39;t remember why the&#39;re crying (one comment on<br/>\n&gt; this status was how &quot;cute&quot; that was - ummm, not really - you left them so<br/>\n&gt; long they don&#39;t remember! 10 minutes is a long time when you&#39;re little).<br/>\n&gt;<br/>\n&gt; My thoughts about this go in a few directions. 1) I&#39;m so thankful to this<br/>\n&gt; list and the people on it who have made me stop and think about examples<br/>\n&gt; like these. My first reaction is actually still much like others that<br/>\n&gt; comment - how cute, or I understand the sentiment. Thankfully, I quickly<br/>\n&gt; move past the initial response to thinking of the child - and I love the<br/>\n&gt; idea of, would I post this about my best friend or spouse? How sad that it<br/>\n&gt; is normal to be so publicly negative about your kids - about things they<br/>\n&gt; probably need help, guidance and love with.<br/>\n&gt;<br/>\n&gt; My second thought is 2)What do I do with this new perspective? What is the<br/>\n&gt; best way to be respectful but also stick up for kids? All of the people<br/>\n&gt; posting these things I know to be really good people - they are loving<br/>\n&gt; mothers. I am not trying to judge them, it just seems that the cultural<br/>\n&gt; norm for how we treat our kids is wrong - so wrong that loving, good people<br/>\n&gt; don&#39;t even notice!<br/>\n&gt;<br/>\n&gt; I have a new blog that some of my friends on facebook are enjoying here:<br/>\n&gt; www.togetherwalking.weebly.com One thing I can do is continue to post my<br/>\n&gt; &quot;out there&quot; ideas about being kind and respectful and listening to our kids<br/>\n&gt; there. I&#39;m not sure if it is my place to do more - I&#39;m not sure if I&#39;m<br/>\n&gt; ready to be so &quot;in your face&quot; as to comment on these status updates -<br/>\n&gt; although they are putting it out there so maybe it is ok to? One mom I<br/>\n&gt; wrote a private message offering an alternative perspective - that felt<br/>\n&gt; more respectful. I just really think that most people aren&#39;t ready to hear<br/>\n&gt; what I would have to say. I guess I am still most comfortable living my<br/>\n&gt; truth in my everyday life with my kids and being an example through my<br/>\n&gt; actions and words. Just trying to figure out if I can do more...<br/>\n&gt;<br/>\n&gt; Closer to home - at our family Thanksgiving gathering I witnessed some<br/>\n&gt; disturbing interactions between my brother-in-law (BIL) and his son (my<br/>\n&gt; nephew). I have witnessed (either by seeing or hearing my nephew&#39;s cries)<br/>\n&gt; my BIL physically hurt my nephew at least 3 times now in the last year<br/>\n&gt; (only 2 visits, each one about 4 days)- one time in &quot;fun&quot; (a hard snowball<br/>\n&gt; to the face) and a couple times in frustration - and my nephew cries and<br/>\n&gt; *tells* him what he did hurt, and BIL&#39;s response is to tell him it doesn&#39;t<br/>\n&gt; hurt - that the kid is &quot;fine&quot;.<br/>\n&gt;<br/>\n&gt; Gosh, even putting that in writing makes me feel kind of sick. No one in<br/>\n&gt; our family has called BIL on this behavior. It is definitely bullying if<br/>\n&gt; not abusive. My husband thinks he is trying to &quot;toughen&quot; his son up. I&#39;m<br/>\n&gt; not claiming to be perfect - I have squeezed my children or moved them<br/>\n&gt; roughly in frustration before - but I have always apologized and let them<br/>\n&gt; know that it was *not* ok to do that.<br/>\n&gt;<br/>\n&gt; I&#39;m wondering what I should do if anything. We only see them once or twice<br/>\n&gt; per year. My nephew seems unhappy even depressed to me, but I&#39;m not sure if<br/>\n&gt; I&#39;m reading to much into it. His dad works long hours and travels a lot. I<br/>\n&gt; know my mother and father-in-law are worried about the 3 kids in this<br/>\n&gt; family - my father-in-law spoke to me very openly about it.<br/>\n&gt;<br/>\n&gt; Our holiday was actually very wonderful overall - last Christmas we ended<br/>\n&gt; with a blowup between my husband and his sister which led to us sending an<br/>\n&gt; email which led to a lot more hurt feelings and many things were not<br/>\n&gt; resolved between family members. I hate to repeat that, but I&#39;m feeling<br/>\n&gt; pretty bad that no one stuck up for my nephew on a couple of occasions -<br/>\n&gt; he&#39;s only 6.<br/>\n&gt;<br/>\n&gt; I&#39;ve thought about hand-writing a personal letter from me to my<br/>\n&gt; brother-in-law and being as kind and compassionate as I can while also<br/>\n&gt; giving my perspective. I&#39;m just not sure yet if it&#39;s the &quot;right&quot; thing to<br/>\n&gt; do. Any thoughts are appreciated on this and on sticking up for kids<br/>\n&gt; generally...<br/>\n&gt;<br/>\n&gt; Thanks!<br/>\n&gt;<br/>\n&gt; Susan May<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"sticking up for kids","postDate":"1323357276","msgId":64180,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpicWs4cytpN2dxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":64184,"prevInTime":64179,"nextInTime":64181,"topicId":64180,"numMessagesInTopic":0,"msgSnippet":"I am noticing on facebook lately so many sad updates from my friends . About good moms yelling , kids being brats and feeling entitled to things, and","messageBody":"<div id=\"ygrps-yiv-799403964\">I am noticing on facebook lately so many sad &quot;updates&quot; from my &quot;friends&quot;. About &quot;good moms yelling&quot;, kids being &quot;brats&quot; and feeling entitled to things, and letting kids cry in bed alone long enough that when finally checked on the child doesn&#39;t remember why the&#39;re crying (one comment on this status was how &quot;cute&quot; that was - ummm, not really - you left them so long they don&#39;t remember! 10 minutes is a long time when you&#39;re little).<br/>\n<br/>\nMy thoughts about this go in a few directions. 1) I&#39;m so thankful to this list and the people on it who have made me stop and think about examples like these. My first reaction is actually still much like others that comment - how cute, or I understand the sentiment. Thankfully, I quickly move past the initial response to thinking of the child - and I love the idea of, would I post this about my best friend or spouse? How sad that it is normal to be so publicly negative about your kids - about things they probably need help, guidance and love with. <br/>\n<br/>\nMy second thought is 2)What do I do with this new perspective? What is the best way to be respectful but also stick up for kids? All of the people posting these things I know to be really good people - they are loving mothers. I am not trying to judge them, it just seems that the cultural norm for how we treat our kids is wrong - so wrong that loving, good people don&#39;t even notice!<br/>\n<br/>\nI have a new blog that some of my friends on facebook are enjoying here: www.togetherwalking.weebly.com One thing I can do is continue to post my &quot;out there&quot; ideas about being kind and respectful and listening to our kids there. I&#39;m not sure if it is my place to do more - I&#39;m not sure if I&#39;m ready to be so &quot;in your face&quot; as to comment on these status updates - although they are putting it out there so maybe it is ok to? One mom I wrote a private message offering an alternative perspective - that felt more respectful. I just really think that most people aren&#39;t ready to hear what I would have to say. I guess I am still most comfortable living my truth in my everyday life with my kids and being an example through my actions and words. Just trying to figure out if I can do more...<br/>\n<br/>\nCloser to home - at our family Thanksgiving gathering I witnessed some disturbing interactions between my brother-in-law (BIL) and his son (my nephew). I have witnessed (either by seeing or hearing my nephew&#39;s cries) my BIL physically hurt my nephew at least 3 times now in the last year (only 2 visits, each one about 4 days)- one time in &quot;fun&quot; (a hard snowball to the face) and a couple times in frustration - and my nephew cries and *tells* him what he did hurt, and BIL&#39;s response is to tell him it doesn&#39;t hurt - that the kid is &quot;fine&quot;.<br/>\n<br/>\nGosh, even putting that in writing makes me feel kind of sick. No one in our family has called BIL on this behavior. It is definitely bullying if not abusive. My husband thinks he is trying to &quot;toughen&quot; his son up. I&#39;m not claiming to be perfect - I have squeezed my children or moved them roughly in frustration before - but I have always apologized and let them know that it was *not* ok to do that.<br/>\n<br/>\nI&#39;m wondering what I should do if anything. We only see them once or twice per year. My nephew seems unhappy even depressed to me, but I&#39;m not sure if I&#39;m reading to much into it. His dad works long hours and travels a lot. I know my mother and father-in-law are worried about the 3 kids in this family - my father-in-law spoke to me very openly about it.<br/>\n<br/>\nOur holiday was actually very wonderful overall - last Christmas we ended with a blowup between my husband and his sister which led to us sending an email which led to a lot more hurt feelings and many things were not resolved between family members. I hate to repeat that, but I&#39;m feeling pretty bad that no one stuck up for my nephew on a couple of occasions - he&#39;s only 6. <br/>\n<br/>\nI&#39;ve thought about hand-writing a personal letter from me to my brother-in-law and being as kind and compassionate as I can while also giving my perspective. I&#39;m just not sure yet if it&#39;s the &quot;right&quot; thing to do. Any thoughts are appreciated on this and on sticking up for kids generally...<br/>\n<br/>\nThanks!<br/>\n<br/>\nSusan May</div>","specialLinks":[]}],"prevTopicId":64165,"nextTopicId":64095}}