{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: One&#39;s best theories (was- unlimited tv and computer time)","postDate":"1077737246","msgId":91427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlLjIzODRiYjBhLjJkNmU1MTFlQGFvbC5jb20+"},"prevInTopic":91391,"nextInTopic":0,"prevInTime":91426,"nextInTime":91428,"topicId":90924,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/25/04 11:32:57 AM, abzb@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-131268112\">In a message dated 2/25/04 11:32:57 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abzb@...\">abzb@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I think too often we get some idealized  notion  of how we&#39;re<br/>\nsupposed to be.  I&#39;m a big believer in bringing it all to the table, warts<br/>\nand all.  &gt;&gt;<br/>\n<br/>\nIf we know something is still bothering us that our parents did, though, <br/>\nisn&#39;t it worth avoiding doing the same to our kids?<br/>\n<br/>\nThere are a lot of ways to express disapproval, and if we express it too <br/>\noften the kids can start to ignore it.  I think saving it until it&#39;s really <br/>\nimportant works well, with them finding their own balance and preference other times.<br/>\n<br/>\n-=-We must be pretty respectful though since ds<br/>\nAsher from very early on said please and thank you and excuse me and we<br/>\nNEVER asked him to say those things.  I hate to hear adults say, &quot;Now what<br/>\ndo you say?&quot; in that sing songy voice.-=-<br/>\n<br/>\nYeah.   My kids are usually pretty good about those things, so it was <br/>\nnoticeable the other night when I went in Kirby&#39;s room where he was online and Marty <br/>\nwas playing a video game.  I said &quot;Any dirty dishes in here?&quot;<br/>\n<br/>\nEach of them handed me something.   I said &quot;Thank you,&quot; and turned to walk <br/>\nout.<br/>\n<br/>\nMaybe each of them thought the other would say something.  I said &quot;And now <br/>\nYOU guys say &#39;thank you&#39;!&quot; and they both said &quot;Thank you!&quot; <br/>\n<br/>\nIt was very rhythmic and kinda cute, none of it was hateful.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":105977377,"authorName":"Alison Broadbent","from":"Alison Broadbent &lt;abzb@...&gt;","profile":"tttrrrsz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: One&#39;s best theories (was- unlimited tv and computer time)","postDate":"1077651261","msgId":91391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDNjBFNzNELjVDMDIlYWJ6YkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":90968,"nextInTopic":91427,"prevInTime":91390,"nextInTime":91392,"topicId":90924,"numMessagesInTopic":0,"msgSnippet":"It s taken me a while to get to this.  Sorry.  Thanks to al who wrote. ... Hi Susan, I really know that feeling of realizing there s too much history to feel ","messageBody":"<div id=\"ygrps-yiv-1990150811\">It&#39;s taken me a while to get to this.  Sorry.  Thanks to al who wrote.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: Wife2Vegman &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wifetovegman2002@...\">wifetovegman2002@...</a>&gt;<br/>\n<br/>\n&gt; Sub &gt; If I try to &quot;share my best theories&quot; my older kids<br/>\n&gt; immediately hear that their choice is &quot;wrong&quot; or &quot;less<br/>\n&gt; than&quot; my preference, and they immediately say, &quot;I&#39;m<br/>\n&gt; sorry mommy, I&#39;ll put the candy back&quot; or whatever.<br/>\n&gt; <br/>\n&gt; So since we are still healing from all the past junk,<br/>\n&gt; I have to be very careful in how I share my opinions.<br/>\n<br/>\n </span></blockquote>Hi Susan,<br/>\n<br/>\nI really know that feeling of realizing there&#39;s too much history to feel<br/>\nconfident in doing anything that even resembled the past.  I also know that<br/>\nbefore I&#39;ve healed sufficiently from something and I go to the opposite end<br/>\nof what I had been doing it&#39;s really just the opposite side of the same<br/>\ncoin. <br/>\n<br/>\nI remember when I was dating.  I had been hurt by what I thought was being<br/>\ntoo open so decided to make a shift.  I became a tough minded and<br/>\nindependent woman of the world.  The trouble was, I was still the same<br/>\ninside and I was either using my vulnerabilities to manipulate situations or<br/>\nusing my toughness to shield myself.  When I was able to just say to myself,<br/>\n&#39;you know I&#39;m really rather needy&quot; which was until then one of the worst<br/>\nthings I thought one could possible be and something to run from at all<br/>\ncosts, I could w, not one month went<br/>\nby and I met my dh.  I remember the feeling of being so much more<br/>\ncomfortable w/ who I was not having to try to be something i wasn&#39;t. That<br/>\nwas a wakeup call to me to make that happen as much as possible in other<br/>\nareas of my life.<br/>\n<br/>\nWhat you&#39;ve mentioned makes me wonder whether there&#39;s a place you can find<br/>\nto be able to communicate some of your concerns including your own and their<br/>\nreactivity.  That way you could all find a place to be where you are.  That<br/>\nsounds way too vague.  Sorry.  For example, instead of saying, &#39;do you think<br/>\nit&#39;s a good idea to....&#39; .you might say something like, &quot;it&#39;s hard for me to<br/>\nsay these things without worrying that you&#39;ll think and I&#39;ll think I&#39;m being<br/>\nmy old controlling self.  But I was thinking that eating candy as much as<br/>\nyou do (or whatever)  might be making your moods go up and down.  What do<br/>\nyou think?&quot;  That way you&#39;re expressing where you are at the moment and i<br/>\nthink may make space for everyone to wrangle and unravel from the past as<br/>\nwell.  I think too often we get some idealized  notion  of how we&#39;re<br/>\nsupposed to be.  I&#39;m a big believer in bringing it all to the table, warts<br/>\nand all.  Or should I say beauty marks and all.<br/>\nMessage: 4<br/>\n<br/>\n   From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\nSubject: Re: One&#39;s best theories (was- unlimited tv and computer time)<br/>\n<br/>\n<br/>\nIn a message dated 2/12/04 7:08:29 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abzb@...\">abzb@...</a> writes:<br/>\n<br/>\n&lt;&lt; I&#39;ve been thinking about the difference between this and what, in TCS<br/>\n(Taking Children Seriously, tcs.com), they call one&#39;s best theories.  &gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;our unschooling lives, and what TCS is doing.   Unless they&#39;ve changed their<br/>\n&gt;stance on telling real stories about real children, it just strikes me as<br/>\n&gt;irritating theoretical political possibility, and I don&#39;t much like to hear<br/>\n </span></blockquote>about it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Our focus here is practical and direct.  How can we help children learn as<br/>\n&gt;freely and as naturally as possible?<br/>\n<br/>\n&gt;Why can&#39;t they just say &quot;communicate honestly with your children&quot;?<br/>\n<br/>\n&gt;Let&#39;s not mix their stuff with our stuff, if possible.<br/>\n<br/>\n </span></blockquote>Well I didn&#39;t intend to discuss their philosophy (OK but I will say I think<br/>\nit&#39;s way too pedantic w/ all their theoretical BS -delete delete, snore<br/>\nsnore) except that they&#39;re similar in wanting to follow one&#39;s child&#39;s<br/>\ninterests and support them.  Their idea of one&#39;s best theories was easily<br/>\nexpressed so i went there instead of trying to clarify it in my own words.<br/>\n(Probably not a good idea)<br/>\n<br/>\n-=-&quot;I want<br/>\ncandy&quot; when he wakes up many mornings and throughout the day. -=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If you beat him to it by waking him up and saying &quot;I made pancakes!&quot; he might<br/>\n&gt;still say &quot;I want candy&quot; and you could say, &quot;Okay, let&#39;s get some when we go<br/>\n&gt;to the store&quot; or &quot;okay, after pancakes!&quot;<br/>\n<br/>\n&gt;If you say &quot;what of all things in the world do you want?&quot; that&#39;s not the same<br/>\n&gt;as offering lots of cool things, letting him turn them down (if he can, after<br/>\n&gt;he sees and smells them!) or not.<br/>\n<br/>\n </span></blockquote>Yes. Sometimes this works and sometimes it doesn&#39;t.<br/>\n<br/>\n&lt;&lt;What I do is share my best theories about these thing.  It&#39;s not that I<br/>\nscrew up my face and say dismissive things like, &#39;WHAT, another candy??&#39;<br/>\nOr a big sigh w/ the rolling of eyes. But I do share my thoughts about what<br/>\nI believe eating that much candy might do to his body and what I perceive as<br/>\nhis reactions some hours down the line.  &gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Does it help you to have candy you don&#39;t mind so much? PayDay bars?  Granola<br/>\n&gt;bars?  Coconut squares?  Peanut-butter balls?<br/>\n<br/>\n&gt;Would it help to have really interesting food you DO think is good already<br/>\n&gt;ready to go?<br/>\n<br/>\n </span></blockquote>I&#39;m always looking for these things to have in the pantry or making things<br/>\nw/ or without him that I think he&#39;ll like.<br/>\n<br/>\n&lt;&lt;The same thing with watching things on tv.  Sometimes something&#39;s on and I<br/>\nsee the stars of the movies (kids) being callous and mean to other kids in<br/>\nthe name of cool.  I  mention that I don&#39;t like how they are with each<br/>\nother.  I don&#39;t say this movie sucks, how can you watch this drek but share<br/>\nmy perspective about it. &gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;That can be done without discussing the movie as a movie.<br/>\n&gt;You could say &quot;A friend of mine did that one time, and I still feel bad about<br/>\n&gt;it,&quot; or whatever&#39;s true and that you think is important for them to know.<br/>\n<br/>\n </span></blockquote>Yes that&#39;s a good point.<br/>\n<br/>\n<br/>\n&lt;&lt;Another one:  My dh is a musician.  My son loves rock and roll.  My dh<br/>\ncan&#39;t<br/>\neven listen to it.  It is jarring to his sensibilities. &gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;This is a courtesy issue.  If your son is not willing to keep it down when<br/>\n&gt;his dad&#39;s home, or if the dad is trying to demand total r&r blockade in his<br/>\n&gt;home, that&#39;s about living together compassionately, not about music.<br/>\n<br/>\n </span></blockquote>We&#39;ve got this one pretty well worked out.  In the car ds has a walkman and<br/>\nat home it&#39;s not much of an issue since ds mostly likes to listen to rock<br/>\nand roll in the car. i guess he&#39;s a travellin&#39; man.<br/>\n<br/>\n<br/>\n<br/>\nessage: 8<br/>\n   Date: Thu, 12 Feb 2004 09:54:15 -0600<br/>\n   From: &quot;J. Stauffer&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a>&gt;<br/>\nSubject: Re: One&#39;s best theories (was- unlimited tv and computer time)<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt; I  mention that I don&#39;t like how they are with each<br/>\n<blockquote><span title=\"ireply\"> &gt; other.  I don&#39;t say this movie sucks, how can you watch this drek but<br/>\n </span></blockquote>share<br/>\n<blockquote><span title=\"ireply\"> &gt; my perspective about it. &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n&gt;&gt;My question would be do you do this with your dh?  Or just your kids?  If<br/>\n&gt;&gt;just with your kids, then you are judging the kids and their choices.  It<br/>\n&gt;&gt;becomes about tv&#39;s effects on your kids rather than about the character&#39;s<br/>\n&gt;actions per se.<br/>\n<br/>\n&gt;&gt;Dh watches stuff that I see little redeeming value in, some real low-brow<br/>\n&gt;&gt;stuff.  I may teasingly turn my nose up at it and go do something else.  I<br/>\n&gt;&gt;do the same thing with the kids.  It is truly about the content of the<br/>\n&gt;&gt;show....not about the effect it might have on the kids, but the effect it<br/>\n&gt;&gt;has on me.<br/>\n<br/>\n&gt;&gt;Just a thought.<br/>\n<br/>\n&gt;&gt;Julie S.<br/>\n<br/>\n </span></blockquote>Well I have to confess that the converse is probably more true; that I&#39;m<br/>\nprobably more respectful towards my ds.  Embarrassing but true.  I know it&#39;s<br/>\nnot the best thing and I&#39;m working on that.  Not so much respectful but I<br/>\ncan get so annoyed at my dh.  We must be pretty respectful though since ds<br/>\nAsher from very early on said please and thank you and excuse me and we<br/>\nNEVER asked him to say those things.  I hate to hear adults say, &quot;Now what<br/>\ndo you say?&quot; in that sing songy voice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I think giving information, an opinion, or alternatives is fine as<br/>\n&gt;long as you aren&#39;t overly invested in the outcome, and really ok with<br/>\n&gt;your child not following your advice or agreeing with you. And also<br/>\n&gt;it helps to offer to give your opinion before giving the opinion<br/>\n&gt;itself. I sometimes ask my son &quot;do you want to know what i think of<br/>\n&gt;xyz?&quot; or &quot;do you want to see a different way of doing that?&quot;<br/>\n&gt;Sometimes the answer is yes, sometimes no, and i respect that.<br/>\n<br/>\n </span></blockquote>Katherine<br/>\n<br/>\nYes that&#39;s a tough one.  I act as though that were true as in getting what<br/>\nhe really wants but in the case of food it&#39;s a tough one.  We have made some<br/>\ncandy stuff but it doesn&#39;t cut it for him.  We continue to look for things.<br/>\nI&#39;ll try the banana thing maybe dipped in caramel.  He doesn&#39;t like<br/>\nchocolate.<br/>\n<br/>\nThanks all.<br/>\n<br/>\nAlison</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: One&#39;s best theories (was- unlimited tv and computer time)","postDate":"1076611880","msgId":90965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMwZ2h2OCtra2IyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJDNEY4MzI0LjU5OTYlYWJ6YkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":90951,"nextInTopic":90968,"prevInTime":90964,"nextInTime":90966,"topicId":90924,"numMessagesInTopic":0,"msgSnippet":"... thoughts along ... part of ... ideas on ... Hi Alison, welcome to the list! I m new here as well... I don t have a problem sharing my opinion with my son","messageBody":"<div id=\"ygrps-yiv-559189324\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Alison Broadbent <br/>\n&lt;abzb@e...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d love to hear what people have to say about sharing one&#39;s <br/>\n </span></blockquote>thoughts along<br/>\n<blockquote><span title=\"ireply\"> &gt; the way about these sorts of things.  Maybe this is just a natural <br/>\n </span></blockquote>part of<br/>\n<blockquote><span title=\"ireply\"> &gt; one&#39;s life and we hear more on this list about not imposing one&#39;s <br/>\n </span></blockquote>ideas on<br/>\n<blockquote><span title=\"ireply\"> &gt; kids bc that&#39;s what so many of us have to get out of.<br/>\n&gt; <br/>\n&gt; And btw, I&#39;m new on this list.  Hi.<br/>\n&gt; <br/>\n&gt; Alison<br/>\n<br/>\n </span></blockquote>Hi Alison, welcome to the list! I&#39;m new here as well...<br/>\n<br/>\nI don&#39;t have a problem sharing my opinion with my son about <br/>\n&quot;whatever&quot;, as long as i know its not a knee-jerk reaction on my <br/>\npart. For example, your son and his candy for breakfast issue...are <br/>\nyou concerned because he is ONLY eating candy, and nothing else that <br/>\nis nutritious? Or are you concerned because he is eating candy for <br/>\nbreakfast and that &quot;just doesnt seem healthy&quot; to you? I think there <br/>\nis a difference there. On any given issue, there is usually so many <br/>\npossible alternatives/resolutions...would making chocolate chip <br/>\npancakes, or putting candy sprinkles on his yogurt, satisfy his candy <br/>\ncraving? Would he be interested in learning to make his own candy? <br/>\n<br/>\nI just saw Rachel Ray (a cook)on the food network make something that <br/>\nmost kids would looooove: Frozen bananas(stuck on popsicle sticks), <br/>\ndipped in chocolate, then dipped on a variety of toppings of choice <br/>\n(crushed nuts, chocolate sprinkles, shredded coconut, m and m&#39;s , <br/>\nwhatever you want!)then refrozen for a time. They looked really <br/>\nyummy. <br/>\n<br/>\nIf my son is making a decision, and i have information that would <br/>\nhelp him make a more informed decision, i won&#39;t withhold that info, <br/>\nof course! My son is growing out his (beautiful red)hair, because he <br/>\nwants to have a mohawk this summer. He has wanted this for awhile <br/>\nnow, so i know its not passing phase. When/if the time comes that he <br/>\nreally does want to get the mohawk, i will talk with him about how <br/>\npeople in this area might react to such a haircut and let him know <br/>\nthat part of having a nontypical hairstyle means putting up with alot <br/>\nof comments and negative feedback from strangers. Thats just reality. <br/>\nBut in giving him this opinion, it has *nothing* to do with my own <br/>\npersonal feelings...we have plenty of friends who have mohawks, <br/>\npiercings, etc, and i myself have lots of visible, large tattoos(as <br/>\ndoes Seamus&#39; father, who is an anti-racist skinhead.) <br/>\n<br/>\nI think giving information, an opinion, or alternatives is fine as <br/>\nlong as you aren&#39;t overly invested in the outcome, and really ok with <br/>\nyour child not following your advice or agreeing with you. And also <br/>\nit helps to offer to give your opinion before giving the opinion <br/>\nitself. I sometimes ask my son &quot;do you want to know what i think of <br/>\nxyz?&quot; or &quot;do you want to see a different way of doing that?&quot; <br/>\nSometimes the answer is yes, sometimes no, and i respect that.<br/>\n<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] One&#39;s best theories (was- unlimited tv and computer time)","postDate":"1076607673","msgId":90951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NC4yZDk5OTE1MS4yZDVkMTRiOUBhb2wuY29tPg=="},"prevInTopic":90933,"nextInTopic":90965,"prevInTime":90950,"nextInTime":90952,"topicId":90924,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/12/04 7:08:29 AM, abzb@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1224580039\">In a message dated 2/12/04 7:08:29 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abzb@...\">abzb@...</a> writes:<br/>\n<br/>\n&lt;&lt; I&#39;ve been thinking about the difference between this and what, in TCS<br/>\n(Taking Children Seriously, tcs.com), they call one&#39;s best theories.  &gt;&gt;<br/>\n<br/>\nI try to maintain a clear separation between what we&#39;re doing when sharing <br/>\nour unschooling lives, and what TCS is doing.   Unless they&#39;ve changed their <br/>\nstance on telling real stories about real children, it just strikes me as <br/>\nirritating theoretical political possibility, and I don&#39;t much like to hear about it.<br/>\n<br/>\nOur focus here is practical and direct.  How can we help children learn as <br/>\nfreely and as naturally as possible?  <br/>\n<br/>\n&lt;&lt;They would agree and I agree that<br/>\nhelping our kids get what they want is a good thing but they would also add<br/>\nthat it&#39;s important to share one&#39;s best theories about something.&gt;&gt;<br/>\n<br/>\nWhy can&#39;t they just say &quot;communicate honestly with your children&quot;?<br/>\n<br/>\nLet&#39;s not mix their stuff with our stuff, if possible.  <br/>\n<br/>\n-=-&quot;I want<br/>\ncandy&quot; when he wakes up many mornings and throughout the day. -=-<br/>\n<br/>\nIf you beat him to it by waking him up and saying &quot;I made pancakes!&quot; he might <br/>\nstill say &quot;I want candy&quot; and you could say, &quot;Okay, let&#39;s get some when we go <br/>\nto the store&quot; or &quot;okay, after pancakes!&quot;<br/>\n<br/>\nIf you say &quot;what of all things in the world do you want?&quot; that&#39;s not the same <br/>\nas offering lots of cool things, letting him turn them down (if he can, after <br/>\nhe sees and smells them!) or not.<br/>\n<br/>\n&lt;&lt;What I do is share my best theories about these thing.  It&#39;s not that I<br/>\nscrew up my face and say dismissive things like, &#39;WHAT, another candy??&#39;<br/>\nOr a big sigh w/ the rolling of eyes. But I do share my thoughts about what<br/>\nI believe eating that much candy might do to his body and what I perceive as<br/>\nhis reactions some hours down the line.  &gt;&gt;<br/>\n<br/>\nDoes it help you to have candy you don&#39;t mind so much? PayDay bars?  Granola <br/>\nbars?  Coconut squares?  Peanut-butter balls?   <br/>\n<br/>\nWould it help to have really interesting food you DO think is good already <br/>\nready to go?<br/>\n<br/>\nHolly&#39;s just waking up.  I&#39;m going to make her a scrambled egg sandwich.  If <br/>\nshe doesn&#39;t want it, I&#39;ll eat it.  If I say &quot;Would you rather have scrambled <br/>\neggs or cereal?&quot; it might matter it&#39;s warm scrambled eggs she can smell, or <br/>\ntheoretical future scrambled eggs.  <br/>\n<br/>\n&lt;&lt;The same thing with watching things on tv.  Sometimes something&#39;s on and I<br/>\nsee the stars of the movies (kids) being callous and mean to other kids in<br/>\nthe name of cool.  I  mention that I don&#39;t like how they are with each<br/>\nother.  I don&#39;t say this movie sucks, how can you watch this drek but share<br/>\nmy perspective about it. &gt;&gt;<br/>\n<br/>\nThat can be done without discussing the movie as a movie.<br/>\nYou could say &quot;A friend of mine did that one time, and I still feel bad about <br/>\nit,&quot; or whatever&#39;s true and that you think is important for them to know.<br/>\n<br/>\nJust yesterday I uttered the words &quot;Kids at school are like that&quot; to Marty <br/>\nwhen he came back from driver&#39;s ed frustrated with the irritating behavior of <br/>\nanother kid who was sarcastic after a joke Marty made, and then picked on him <br/>\nfor the next hour and a half.  I told him he was pretty lucky not to have <br/>\nexperienced that behavior before he was 15, that most kids get it from kindergarten <br/>\non.<br/>\n<br/>\n&lt;&lt;I hear so<br/>\nmany talk about being hands off when it comes to children choosing programs<br/>\nand never mentioning one&#39;s own thoughts about the shows.&gt;&gt;<br/>\n<br/>\nIf people can&#39;t tell the difference between polite, equal conversation and <br/>\nmanipulating shame, I think &quot;hands off&quot; is better than &quot;whatever.&quot;   But those <br/>\naren&#39;t the only two choices.  Maybe they can learn how to communicate honestly <br/>\nwithout trying to sway kids toward their own possibly-unreasonable prejudices.<br/>\n<br/>\n&lt;&lt;Another one:  My dh is a musician.  My son loves rock and roll.  My dh can&#39;t<br/>\neven listen to it.  It is jarring to his sensibilities. &gt;&gt;<br/>\n<br/>\nThis is a courtesy issue.  If your son is not willing to keep it down when <br/>\nhis dad&#39;s home, or if the dad is trying to demand total r&r blockade in his <br/>\nhome, that&#39;s about living together compassionately, not about music.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] One&#39;s best theories (was- unlimited tv and computer time)","postDate":"1076601255","msgId":90933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTIwMWMzZjE4MCQ3NzlkMjBjMCQwNzg1ZWU0MEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PEJDNEY4MzI0LjU5OTYlYWJ6YkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":90929,"nextInTopic":90951,"prevInTime":90932,"nextInTime":90934,"topicId":90924,"numMessagesInTopic":0,"msgSnippet":"... share ... My question would be do you do this with your dh?  Or just your kids?  If just with your kids, then you are judging the kids and their choices.","messageBody":"<div id=\"ygrps-yiv-1739324570\">&lt;&lt;&lt;&lt;&lt;&lt;&lt; I  mention that I don&#39;t like how they are with each<br/>\n<blockquote><span title=\"ireply\"> &gt; other.  I don&#39;t say this movie sucks, how can you watch this drek but<br/>\n </span></blockquote>share<br/>\n<blockquote><span title=\"ireply\"> &gt; my perspective about it. &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>My question would be do you do this with your dh?  Or just your kids?  If<br/>\njust with your kids, then you are judging the kids and their choices.  It<br/>\nbecomes about tv&#39;s effects on your kids rather than about the character&#39;s<br/>\nactions per se.<br/>\n<br/>\nDh watches stuff that I see little redeeming value in, some real low-brow<br/>\nstuff.  I may teasingly turn my nose up at it and go do something else.  I<br/>\ndo the same thing with the kids.  It is truly about the content of the<br/>\nshow....not about the effect it might have on the kids, but the effect it<br/>\nhas on me.<br/>\n<br/>\nJust a thought.<br/>\n<br/>\nJulie S.</div>","specialLinks":[]},{"userId":128695025,"authorName":"Wife2Vegman","from":"Wife2Vegman &lt;wifetovegman2002@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] One&#39;s best theories (was- unlimited tv and computer time)","postDate":"1076598916","msgId":90929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjEyMTUxNTE2LjIwNTYxLnFtYWlsQHdlYjQxNDE1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEJDNEY4MzI0LjU5OTYlYWJ6YkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":90924,"nextInTopic":90933,"prevInTime":90928,"nextInTime":90930,"topicId":90924,"numMessagesInTopic":0,"msgSnippet":"... Alison, I can t do this yet, don t know if I will ever be able to. See, we school-at-homered (DOH!) for so long, and raised our kids according to the","messageBody":"<div id=\"ygrps-yiv-1242772112\">--- Alison Broadbent &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abzb@...\">abzb@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I&#39;d love to hear what people have to say about<br/>\n&gt; sharing one&#39;s thoughts along<br/>\n&gt; the way about these sorts of things.  Maybe this is<br/>\n&gt; just a natural part of<br/>\n&gt; one&#39;s life and we hear more on this list about not<br/>\n&gt; imposing one&#39;s ideas on<br/>\n&gt; kids bc that&#39;s what so many of us have to get out<br/>\n&gt; of.<br/>\n<br/>\n<br/>\n </span></blockquote>Alison,<br/>\n<br/>\nI can&#39;t do this yet, don&#39;t know if I will ever be able<br/>\nto.<br/>\n<br/>\nSee, we school-at-homered (DOH!) for so long, and<br/>\nraised our kids according to the accepted Conservative<br/>\nChristian model for many years, and the damage is<br/>\ndone.<br/>\n<br/>\nIf I try to &quot;share my best theories&quot; my older kids<br/>\nimmediately hear that their choice is &quot;wrong&quot; or &quot;less<br/>\nthan&quot; my preference, and they immediately say, &quot;I&#39;m<br/>\nsorry mommy, I&#39;ll put the candy back&quot; or whatever.<br/>\n<br/>\nSo since we are still healing from all the past junk,<br/>\nI have to be very careful in how I share my opinions. <br/>\nI can&#39;t even stop them and say, &quot;do you think it is a<br/>\ngood idea to...&quot; because they immediately know that if<br/>\nI am asking, then I must think it is NOT a good idea.<br/>\n<br/>\nSo my best response to almost everything they choose<br/>\nto do is, &quot;GREAT!&quot; with a smile and a hug.<br/>\n<br/>\nThe only time I exercise that power to offer my<br/>\nopinion is when my 12yo might choose to watch<br/>\nsomething that is too scarey for him, because he has<br/>\nasked me to warn him.  I only warn him once, though,<br/>\nand never say, &quot;Thou shalt not watch&quot;.<br/>\n<br/>\n<br/>\n<br/>\n=====<br/>\n--Susan in VA<br/>\nWifetoVegman<br/>\n<br/>\nWhat is most important and valuable about the home as a base for children&#39;s growth into the world is not that it is a better school than the schools, but that it isn&#39;t a school at all.  John Holt<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://theeclectichomeschooler.homestead.com/TheEclecticHomeshooler.html\">http://theeclectichomeschooler.homestead.com/TheEclecticHomeshooler.html</a><br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Finance: Get your refund fast by filing online.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://taxes.yahoo.com/filing.html\">http://taxes.yahoo.com/filing.html</a></div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] One&#39;s best theories (was- unlimited tv and computer time)","postDate":"1076539146","msgId":90968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMkFBRjBBLjMwOTA2MDhAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDIwMDQwMjEyMTUxNTE2LjIwNTYxLnFtYWlsQHdlYjQxNDE1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":90965,"nextInTopic":91391,"prevInTime":90967,"nextInTime":90969,"topicId":90924,"numMessagesInTopic":0,"msgSnippet":"** So my best response to almost everything they choose to do is, GREAT! with a smile and a hug.** I don t so much say GREAT as I say SURE .   I can say","messageBody":"<div id=\"ygrps-yiv-2068568645\">** So my best response to almost everything they choose<br/>\nto do is, &quot;GREAT!&quot; with a smile and a hug.**<br/>\n<br/>\nI don&#39;t so much say &quot;GREAT&quot; as I say &quot;SURE&quot;.   I can say &quot;SURE&quot; in a <br/>\nwarm and positive way, but it refrains from saying whether a particular <br/>\nopinion is great or lousy.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":105977377,"authorName":"Alison Broadbent","from":"Alison Broadbent &lt;abzb@...&gt;","profile":"tttrrrsz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"One&#39;s best theories (was- unlimited tv and computer time)","postDate":"1076511525","msgId":90924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDNEY4MzI0LjU5OTYlYWJ6YkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":90929,"prevInTime":90923,"nextInTime":90925,"topicId":90924,"numMessagesInTopic":0,"msgSnippet":"From: SandraDodd@aol.com ... I ve been thinking about the difference between this and what, in TCS (Taking Children Seriously, tcs.com), they call one s best","messageBody":"<div id=\"ygrps-yiv-1856530712\">From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; As long as mothers have the list of good things and the list of bad things,<br/>\n&gt; of educational things and &quot;fluff,&quot; of good and bad food, good and bad sleep<br/>\n&gt; schedules, good and bad music, books, art, it will affect children aversely in<br/>\n&gt; two ways I&#39;m thinking of right off:   it keeps them from going through the<br/>\n&gt; mental process of figuring out how THEY will decide what they like or need or<br/>\n&gt; can <br/>\n&gt; learn from; and it endangers the relationship between parent and child,<br/>\n&gt; because <br/>\n&gt; the parent is being judgmental of the child, and the child can lose respect<br/>\n&gt; for the parent&#39;s intellect, fairness, integrity, thoughtfulness and of her<br/>\n&gt; positive regard for her own child.<br/>\n<br/>\n&gt; That&#39;s a lot to risk just to tell a child that the magazine he likes sucks.<br/>\n<br/>\n </span></blockquote>I&#39;ve been thinking about the difference between this and what, in TCS<br/>\n(Taking Children Seriously, tcs.com), they call one&#39;s best theories.  One of<br/>\ntheir premises is that we&#39;re all fallible and that we&#39;re working on our best<br/>\ntheories that we&#39;ve got at the time.  They would agree and I agree that<br/>\nhelping our kids get what they want is a good thing but they would also add<br/>\nthat it&#39;s important to share one&#39;s best theories about something.<br/>\n<br/>\nI was someone, who a year ago, on the unschooling,com listserv went through<br/>\na lot of consternation about tv.  After listening and arguing w/ Sandra and<br/>\nothers, I was able to get out of my indoctrination about it and really could<br/>\nsee how my son (about 3 at the time) did not watch tv as a zombie but as<br/>\npart of life going on about him.  He was active in his watching, talking<br/>\ndoing other things simultaneously, discussing.  The food thing was more<br/>\ndifficult bc no matter how much I made sure he was getting what he wanted to<br/>\neat, it was and continues to be so much sugar, with the words, &quot;I want<br/>\ncandy&quot; when he wakes up many mornings and throughout the day.  I offer many<br/>\nthings along the way that I think he might like (things we might make, etc)<br/>\nbut nothing compares to store bought candy.  I&#39;ve gone months without saying<br/>\nanything about it but now decided to share what I do think about it.<br/>\n<br/>\nWhat I do is share my best theories about these thing.  It&#39;s not that I<br/>\nscrew up my face and say dismissive things like, &#39;WHAT, another candy??&#39;<br/>\nOr a big sigh w/ the rolling of eyes. But I do share my thoughts about what<br/>\nI believe eating that much candy might do to his body and what I perceive as<br/>\nhis reactions some hours down the line.  Not every day or even every few<br/>\ndays but every once in a while.  If he disagrees, I accept that he thinks<br/>\nthat and support him in getting what he wants and still like to keep the<br/>\ndiscussion open.<br/>\n<br/>\nThe same thing with watching things on tv.  Sometimes something&#39;s on and I<br/>\nsee the stars of the movies (kids) being callous and mean to other kids in<br/>\nthe name of cool.  I  mention that I don&#39;t like how they are with each<br/>\nother.  I don&#39;t say this movie sucks, how can you watch this drek but share<br/>\nmy perspective about it.  I think this opens up conversations. I hear so<br/>\nmany talk about being hands off when it comes to children choosing programs<br/>\nand never mentioning one&#39;s own thoughts about the shows.<br/>\n<br/>\nAnother one:  My dh is a musician.  My son loves rock and roll.  My dh can&#39;t<br/>\neven listen to it.  It is jarring to his sensibilities.  At first he would<br/>\nsay things like this is really bad music but I&#39;ve got him to shift and talk<br/>\nabout what it is that is hard for him to hear and what he really likes in<br/>\nmusic.  <br/>\n<br/>\nI&#39;d love to hear what people have to say about sharing one&#39;s thoughts along<br/>\nthe way about these sorts of things.  Maybe this is just a natural part of<br/>\none&#39;s life and we hear more on this list about not imposing one&#39;s ideas on<br/>\nkids bc that&#39;s what so many of us have to get out of.<br/>\n<br/>\nAnd btw, I&#39;m new on this list.  Hi.<br/>\n<br/>\nAlison</div>","specialLinks":[]}],"prevTopicId":91316,"nextTopicId":91389}}