{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":53685616,"authorName":"Bronwen","from":"&quot;Bronwen&quot; &lt;felesina@...&gt;","profile":"bronwen67","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling and choices","postDate":"1070855920","msgId":85828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZmYwMWMzYmQzZiRhMzMyYTM2MCQ5Nzg2NTE0MkBmZWxlc2luYT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":85827,"nextInTime":85829,"topicId":85828,"numMessagesInTopic":0,"msgSnippet":"A premiss that some people seem to associate with unschooling is the idea that we are to provide all the possible choices imaginable to our children and then","messageBody":"<div id=\"ygrps-yiv-206040161\">A premiss that some people seem to associate with unschooling is the idea<br/>\nthat we are to provide all the possible choices imaginable to our children<br/>\nand then let them choose what they want. This is not, in my opinion, what<br/>\nunschooling entails.<br/>\n<br/>\nI think that many people are confused about this because of some of the<br/>\nquestions mainly about &quot;limits&quot;, the thread about appropriate movies, the<br/>\nthread about showing children all religions so they can &quot;choose&quot;, etc.....<br/>\n<br/>\nOr the recent &quot;gun&quot; thread,  To which Sandra responds with this:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It&#39;s not pro-gun, it&#39;s anti-controlling.<br/>\n<br/>\n&gt;Toy guns or video games, like television, food, bedtime, reading, clothes,<br/>\n&gt;etc., all involve issues of learning, experimentation, thought, sharing,<br/>\n&gt;individual preference, and the same arguments against requiring or<br/>\n </span></blockquote>restricting or<br/>\n<blockquote><span title=\"ireply\"> &gt;mom-chosen limits apply to guns as to so many other things<br/>\n<br/>\n </span></blockquote>What this reflect IS a premiss of unschooling.  Unschooling means trusting<br/>\nyour child above any &quot;ideas&quot; (like hating guns) you have in regards to a<br/>\nlife which isn&#39;t yours- your child&#39;s.  What we are saying is that IF our<br/>\nchild chooses something, we trust it.  &quot;Anti-controlling&quot;, &quot;non- coersive&quot;-<br/>\nthose are other ways to define &quot;trust&quot;- because if we trust a child, that he<br/>\nis going to try his best to make benificial decisions, there is no need to<br/>\n&quot;limit&quot; something or &quot;control&quot; him.<br/>\n<br/>\nWe are NOT saying it is our job to give the child every thing we can think<br/>\nof even if we disagree with it.<br/>\n<br/>\nThat is like saying, &quot;here you go- these are all the movies you can choose<br/>\nfrom, I will describe them- cartoon, anime, documentary, porno, horror...&quot;,<br/>\nor &quot;there are alot of ways people behave in the world, today I will show you<br/>\nhonesty, love and generosity, and tomorrow I will show you deceit, hate, and<br/>\ngreed- you choose!&quot;<br/>\n<br/>\nPart of our parenting job- probably the most important one- is just living<br/>\nour life well (this is said all the time on the list- about being<br/>\ninteresting, kind people ourselves).  In our culture, this entails a bunch<br/>\nof choices- what to eat, where to get information, who to be with. etc.<br/>\nBeing unschoolers doesn&#39;t mean we have to offer our kids things we wouldn&#39;t<br/>\nchoose for ourselves.<br/>\n<br/>\nUm, so, for example...you and your husband are vegetarian, for many reasons.<br/>\nYou have children- you continue to be vegetarian, so your children are<br/>\nvegetarian.  Trusting, or &quot;no limits&quot; doesn&#39;t mean offering your kids meat.<br/>\nIt also doesn&#39;t mean you don&#39;t explain your ideas to your kids about being<br/>\nvegetarian and give them information about vegetarians.<br/>\n<br/>\nWhat it DOES mean, though, is if your kids are offered meat and wish to<br/>\nexcept it, you don&#39;t &quot;limit&quot; them, or forcebly make a decision for them.  It<br/>\nmeans reconsidering our &quot;ideas&quot; if they go against something our child does-<br/>\nnot necessarily changing them, but sometimes (many times) it does mean<br/>\nlooking at life differently and changing ourselves.<br/>\n<br/>\nThis is a scary thing for people sometimes- giving our kids information and<br/>\nthen holding back our imprinted desire to &quot;make&quot; them do what we want.  But<br/>\nit is what trust really looks like.<br/>\n<br/>\nWhen you trust your kids like this, a corollary is that they trust *you*.<br/>\nYou become more powerful than you ever could be by force-- what you say and<br/>\ndo is very valued by your kids--because they know you care more for them<br/>\nthan anyone else in the world and you would only tell them what you honestly<br/>\nthink. In other words, your kids will likely choose to become vegetarians.<br/>\nBut if they don&#39;t- you and your kids know that they will be accepted and<br/>\nloved nonetheless, you might even help them prepare meat- or do more<br/>\nresearch on veg. and you could even change your mind about it.<br/>\n<br/>\nlike this:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;His mom believed him when he told her he didn&#39;t smoke it, and she listened<br/>\n </span></blockquote>when he said that since he got in trouble for it anyway, next time he was<br/>\ngoing<br/>\nto try it.  She said, &quot;I trust you.  I know you want to experiment.  If you<br/>\nthink it&#39;s becoming a problem, talk to me so I can help you.&quot;  And she left<br/>\nit<br/>\nat that.<br/>\n<br/>\nI think having my mind blown up and out by what my kids think and do is one<br/>\nof the greatest things about being a parent :-)<br/>\n<br/>\nBronwen</div>","specialLinks":[]}],"prevTopicId":85744,"nextTopicId":85800}}