{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Small, small world","postDate":"1105559984","msgId":102536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkuM2I1NTAxNmQuMmYxNmRiYjBAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":102535,"nextInTime":102537,"topicId":102536,"numMessagesInTopic":0,"msgSnippet":"When we visited with Pam Sorooshian s family in southern California in  early December, Holly saw Cyrus Sorooshian at Knott s Berry Farm, and she ran  into Dan","messageBody":"<div id=\"ygrps-yiv-1839564312\">When we visited with Pam Sorooshian&#39;s family in southern California in  early <br/>\nDecember, Holly saw Cyrus Sorooshian at Knott&#39;s Berry Farm, and she ran  into <br/>\nDan and Jocelyn Vilter at Disneyland.   Cyrus was at Knott&#39;s  Berry Farm with <br/>\na team from work, for a Christmas team-building outing.   Keith and Holly <br/>\nwere going separately, and anyway.  That&#39;s coincidence  enough, but they actually <br/>\nran into each other.  Dan and Jocelyn went to  Disneyland for a choral <br/>\nconcert.  All my kids and most of Pams had ditched  out of the gaming convention <br/>\nhalf of them had been attending, and went to  Disneyland on a rainy day. <br/>\nDisneyland&#39;s a big place, but they ran into each  other.<br/>\n <br/>\nLast time our whole family went to Disneyland, we ran into a mom and two  <br/>\nkids, homeschoolers, from a town near us.  They&#39;re in the SCA.  We  know them <br/>\npretty well.  We found them in the back of one of the Main Street  shops before <br/>\npark opened.  That&#39;s coincidence enough, for two families from  New Mexico.  <br/>\nBut we ran into one or the other of the kids four more  times.  They said they <br/>\nwere going home, and not coming back the next  day.  The next day they were <br/>\nback, though; we know, because we saw them  again, in Toon Town.<br/>\n <br/>\nSo Holly has the impression that when she goes places she&#39;ll meet people  she <br/>\nknows.  And it could be true.  My sister was sitting outside the  Air and <br/>\nSpace Museum in Washington, and saw a little girl who looked just like  her <br/>\nfriend Elaine Valdez&#39;s daughter.  Then she saw her friend Elaine.   From New <br/>\nMexico.  Neither family knew the other was travelling to DC.   She and Elaine were <br/>\nbest friends in elementary school and have kept in light  contact.  We grew up <br/>\nabout six houses apart.<br/>\n <br/>\nMonday, Kirby started classes for the first time.  In his first class  was <br/>\nhis friend Liam (of the Carol Rice article about late reading, <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/carol_\">http://sandradodd.com/r/carol_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/carol)\">http://sandradodd.com/r/carol)</a>  ).   That&#39;s less spectacular a <br/>\ncoincidence than the out-of-state experiences, but  still a cool coincidence. <br/>\n Liam&#39;s not Kirby&#39;s age.  There are other  campuses of TVI.<br/>\n <br/>\nIt&#39;s interesting that while my kids live in a really big, real world, for  <br/>\nthem it has been a small, friendly world too.<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":102401,"nextTopicId":102490}}