{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":0,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"avnhighsky","replyTo":"LIST","senderId":"_MIQsqmPSX8CV5-guUaI27d-aScIPbVukd92sUj2Y0b-0QteEh2mX-Y4t2G-5kpNIwQVV6UKVX0Y8LZTCMxQYuzHKFStpyKiuGs","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Digest Number 1584","postDate":"1006185304","msgId":28011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4MUU5NTg3LjIzNDElZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDl0OXVmYitkODkzQGVHcm91cHMuY29tPg=="},"prevInTopic":27983,"nextInTopic":0,"prevInTime":28010,"nextInTime":28012,"topicId":27721,"numMessagesInTopic":0,"msgSnippet":"... But no one can define it for *you* unless you accept their definition. :-) ... And I ve done similar (though I would say encourage would describe it ","messageBody":"<div id=\"ygrps-yiv-859267279\">on 11/18/01 10:31 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:chrisoco@...\">chrisoco@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:chrisoco@...\">chrisoco@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just want to voice an opinion that says please don&#39;t<br/>\n&gt; narrowly define unschooling for me.<br/>\n<br/>\n </span></blockquote>But no one can define it for *you* unless you accept their definition. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve pushed them into activities that exposed them to ideas<br/>\n&gt; they thought they wouldn&#39;t like because I knew/felt there was value<br/>\n&gt; (and most of the time I was right).<br/>\n<br/>\n </span></blockquote>And I&#39;ve done similar (though I would say encourage would describe it<br/>\nbetter, like suggesting how about trying it for 10 or 15 minutes and if you<br/>\ndon&#39;t like it we&#39;ll do something else -- which she is free to turn down).<br/>\n<br/>\nBut just because children sometimes (or even usually) end up liking it<br/>\ndoesn&#39;t make it right to force them to do something they don&#39;t want to. I<br/>\nthink a good litmus test of behavior is would we behave this way towards a<br/>\nfriend? Would we want our husbands to treat us and think about us that way?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For me, I know that experience<br/>\n&gt; plays a big part in life. For me, my experience is SOMETIMES more<br/>\n&gt; important, more vital than the opinions of my children. But I share<br/>\n&gt; it with them rather than lay down the law. This has been a life long<br/>\n&gt; effort of building a relationship and trust where my word means<br/>\n&gt; something to them.<br/>\n<br/>\n </span></blockquote>Perhaps the way we parent would look the same. Perhaps I&#39;d even look like a<br/>\ncontrol freak next to you ;-) Control is in my nature and I have to<br/>\nconstantly be aware to avoid acting in the way that comes most naturally to<br/>\nme. (Discussing it at great length helps me be more aware. :-)<br/>\n<br/>\nI think the difference, though, is the point of view. I see my daughter&#39;s<br/>\nopinion and autonomy as the most important and, if I override her, it&#39;s an<br/>\nabberation. The way you&#39;ve stated it implies giving your children permission<br/>\nto do as they see fit with you exercising your perogative to step in when<br/>\nyou see fit.<br/>\n<br/>\n(Which is an observation and not intended as an argument that my way is<br/>\nbetter. Not that I couldn&#39;t argue it if someone wanted to discuss it! ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; BUt <br/>\n&gt; if push came to shove, I am the parent and the authority in the<br/>\n&gt; household.<br/>\n<br/>\n </span></blockquote>Which is your choice. If you choose it because it&#39;s easiest and most<br/>\nefficient for you it&#39;s hard to argue. But many of us can effectively argue<br/>\nthat it isn&#39;t *necessary* in order for kids to become adults that other<br/>\npeople will like being around.<br/>\n<br/>\nI *think* a few people can pull it off. They can be authoritarian and their<br/>\nchildren can still feel they&#39;re respected. But I also think there are far<br/>\nmore people who only think they are respecting their children. (And I&#39;m not<br/>\naccusing you. Only you can know.) And I also think there are far more people<br/>\nwho don&#39;t care whether they&#39;re respecting their children or not, but see a<br/>\ngood parent&#39;s job as molding kids into the people they are supposed to be,<br/>\nbeing aware that children will naturally resist.<br/>\n<br/>\nI think one of the problems is that control comes naturally to most people.<br/>\nIt&#39;s part of society. It&#39;s how most of us were raised. If it&#39;s working for<br/>\nyou, I think it&#39;s *not* the control that&#39;s working but the respect. There<br/>\nare *plenty* of examples of authoritarian parenting that turn out sneaky and<br/>\nwild kids. So it can&#39;t be the control that&#39;s the determining factor in how<br/>\nkids turn out.  Describing how you control your kids will only reinforce<br/>\npeople&#39;s belief that it is the control that&#39;s the deciding factor and<br/>\ncentral issue. But, I strongly believe, it&#39;s the respect that is the most<br/>\nimportant factor and central issue and that doesn&#39;t get discussed enough.<br/>\nIt&#39;s always treated as an optional side dish. Or something that&#39;s so obvious<br/>\nit needn&#39;t be discussed.<br/>\n<br/>\nPerhaps put it this way: if you had this natural flair for making textbooks<br/>\nexciting and your kids ran to listen to textbooks from 9-11 every morning,<br/>\nwould it be helpful to new unschoolers to describe your use of textbooks for<br/>\n2 hours in the morning as unschooling? It&#39;s not the part that looks like<br/>\nstandard schooling that needs described to help people break out of their<br/>\nschool think. It&#39;s the parts most people don&#39;t understand like parents being<br/>\nenthusiastic themselves about learning.<br/>\n<br/>\nI think this list, and the message boards even more so, can provide people<br/>\nwith the opportunity to challenge their thinking. If someone doesn&#39;t want<br/>\nthe challenge, they can pass it by. If someone feels they&#39;ve already<br/>\nchalleged themselves enough and come to conclusions that are more in line<br/>\nwith standard thinking, they can pass it by. But I do think having that<br/>\nopportunity available to challenge standard thinking for people who are<br/>\ntrying out unschooling *is* important. It&#39;s a lot easier for people who<br/>\ndon&#39;t agree with the challenge to ignore it than it is for people who don&#39;t<br/>\nrealize standard thinking can be questioned to seek it out.<br/>\n<br/>\nThere are lots of places to share authoritarian parenting advice. There are<br/>\nlots of places where parents can just go share what they do with each other<br/>\nand everyone will cyber-nod and say &quot;That&#39;s nice, this is how I do it,&quot;<br/>\nwhere no one will ask anyone to consider why they made the choices they did<br/>\nnor challenge them to defend them.<br/>\n<br/>\nOf course, one of the problems is that some people separate unschooling and<br/>\nparenting and others see it all as just life. For those who unschool<br/>\nlearning and whose parenting is by conscious choice more controlling, I can<br/>\nsee how they would feel they were seen as &quot;less than&quot;. It&#39;s easy for someone<br/>\nto see their unusual use of textbooks as confusing to new unschoolers so<br/>\nthey&#39;d probably not mention it much. But if someone sees parental authority<br/>\nin life issues as much a part of unschooling as someone who doesn&#39;t, it&#39;s<br/>\nnatural to feel attacked.<br/>\n<br/>\nSome who come to this list don&#39;t want to talk about unschooling parenting<br/>\n(for want of a better phrase). They only want to talk about how to unschool<br/>\nlearning better. They want parenting to be whatever you feel comfortable<br/>\nwith and a respectful exchange of parenting ideas. (And some would like<br/>\nunschooling to be whatever you feel comfortable with too, but that won&#39;t fly<br/>\nfor long ;-)<br/>\n<br/>\nSo, is the answer for those of us who feel the challege is important to keep<br/>\nquiet? Is the answer for those who see the challenge as a personal attack on<br/>\ntheir own ability to think for themselves to keep quiet? Personally I know I<br/>\nneeded the challenge when I first started reading about homeschooling so<br/>\nI&#39;ll need to keep challenging in order to provide that opportunity to others<br/>\nlike me. :-) I figure if someone doesn&#39;t doesn&#39;t care to question what they<br/>\ndo or feels they&#39;ve questioned themselves sufficiently they can skip it. But<br/>\nif they enter in, they won&#39;t escape questioning ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I hope this doesn&#39;t feel attacking, Joyce.<br/>\n<br/>\n </span></blockquote>Not at all :-) I think the problem is that some people see a challange as an<br/>\nattack. I often see attacks as a challenge ;-) Of course if the attack is<br/>\njust an attack and they&#39;ve no interest in discussing then it&#39;s just boring!<br/>\n(None of which is intended personally to anyone, just general observations<br/>\nof good discussions and bad.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not wanting to oppose<br/>\n&gt; your views but you reminded me of some previous situations in the<br/>\n&gt; unschooling community that I wanted to address.<br/>\n<br/>\n </span></blockquote>And I suspect it will keep happening everywhere in unschooling since there<br/>\nwill always be people who &quot;unschool&quot; parenting and some who don&#39;t. I just<br/>\nthink it&#39;s valuable for the discussion to be available for those who get<br/>\nintrigued by the questioning of what they always assumed was a given.<br/>\n<br/>\nJoyce <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"chrisoco@aol.com","from":"chrisoco@...","profile":"chrisoco_2","replyTo":"LIST","senderId":"rDoTcxw8tZtCyc08j3TV2ul5I0RuI6yOjO8ZtV2qZCW9fgYm0HyZSCOuoSaFDpsQsw5knxaAiw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Digest Number 1584","postDate":"1006140715","msgId":27983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDl0OXVmYitkODkzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI4MUJEMjZCLjIyOTAlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+"},"prevInTopic":27848,"nextInTopic":28011,"prevInTime":27982,"nextInTime":27984,"topicId":27721,"numMessagesInTopic":0,"msgSnippet":"... Joyce, I firmly respect your opinion here BUT..... I ve considered myself an unschooler for 11 years now, ever since I first read John Holt and decided my","messageBody":"<div id=\"ygrps-yiv-1338150224\">--- In Unschooling-dotcom@y..., Fetteroll &lt;fetteroll@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The biggest problem in discussing the idea of control in general<br/>\n&gt; is that most people begin with the socially implanted idea that<br/>\n&gt; control is the norm. It&#39;s what children need. So someone<br/>\n&gt; suggesting &quot;I have come to the conclusion that control works for<br/>\n&gt; my kids,&quot; is really a reinforment of the social norm.<br/>\n&gt; <br/>\n&gt; The idea many are working towards is to throw away that idea and<br/>\n&gt; begin with a new base of operations, a new norm: the idea that<br/>\n&gt; control isn&#39;t necessary, that children will self-regulate when<br/>\n&gt; given the freedom to do so.<br/>\n<br/>\n </span></blockquote>Joyce,<br/>\n<br/>\nI firmly respect your opinion here BUT.....<br/>\n<br/>\nI&#39;ve considered myself an unschooler for 11 years now, ever since I <br/>\nfirst read John Holt and decided my oldest was not ever attending <br/>\ntraditional school. <br/>\n<br/>\nOver the years, I have had this idea forced on me on nearly every <br/>\nunschooling list I&#39;ve been on. I&#39;ve been called a control freak <br/>\nbecause I expect my children to make their beds and brush their <br/>\nteeth. My parenting has been attacked and I&#39;ve been told I certainly <br/>\nmust not bea &quot;real unschooler&quot;. Now I&#39;m not saying that you are doing <br/>\nthis, Joyce. I believe I understand the message of your post - With <br/>\nideas about how to force and control children so readily available, <br/>\nit is important to put other messages out there (am I hearing you <br/>\ncorrectly?). I just want to voice an opinion that says please don&#39;t <br/>\nnarrowly define unschooling for me. For me, I know that experience <br/>\nplays a big part in life. For me, my experience is SOMETIMES more <br/>\nimportant, more vital than the opinions of my children. But I share <br/>\nit with them rather than lay down the law. This has been a life long <br/>\neffort of building a relationship and trust where my word means <br/>\nsomething to them. I do know more than they do in many areas but my <br/>\ntrust in them bleeds through and affects both of our decisions. BUt <br/>\nif push came to shove, I am the parent and the authority in the <br/>\nhousehold. I&#39;ve been known to force or manipulate to get kids off a <br/>\nplateu or to move them beyond a comfort level they&#39;ve stayed at a bit <br/>\ntoo long. I&#39;ve pushed them into activities that exposed them to ideas <br/>\nthey thought they wouldn&#39;t like because I knew/felt there was value <br/>\n(and most of the time I was right). I consider these nudges to be <br/>\nparenting responsibilities. I&#39;ve helped my kids get over fears and <br/>\nopened their eyes to differences of opinion.  <br/>\n<br/>\nFor some, I know I don&#39;t live up to the title &quot;unschooler&quot;. But for <br/>\nme, it is a term still evolving and not one I&#39;m always comfortable <br/>\nwith. Life-learner feels so much better. And if these nudges and <br/>\nauthority keep me from the select group, so be it. <br/>\n<br/>\nI hope this doesn&#39;t feel attacking, Joyce. I&#39;m not wanting to oppose <br/>\nyour views but you reminded me of some previous situations in the <br/>\nunschooling community that I wanted to address.<br/>\n<br/>\nin peace,<br/>\n<br/>\nChris O&#39;Connor</div>","specialLinks":[]},{"userId":0,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"avnhighsky","replyTo":"LIST","senderId":"CRzKvIwtVO3IakmmulhgOjzFqufczK08ATOhgP3iuKDe8ECSGcilL4uTtY6hCJbN3cIsFje55-dLu95M8uB91-PrOAl-7kZZje0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 1584","postDate":"1006004283","msgId":27848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4MUJEMjZCLjIyOTAlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDIwMDExMTE0LjE1MjkyNy4tNzQ4MDg5LjIucnVtcGxldGVhc2VybW9tQGp1bm8uY29tPg=="},"prevInTopic":27728,"nextInTopic":27983,"prevInTime":27847,"nextInTime":27849,"topicId":27721,"numMessagesInTopic":0,"msgSnippet":"... The biggest problem in discussing the idea of control in general is that most people begin with the socially implanted idea that control is the norm. It s","messageBody":"<div id=\"ygrps-yiv-659777808\">on 11/14/01 3:29 PM, Bridget E Coffman at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rumpleteasermom@...\">rumpleteasermom@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;This is what works for me.  If what you are doing is not working<br/>\n&gt; you might want to think about it but if you found something that works<br/>\n&gt; for you, I&#39;d love to hear about it even if I won&#39;t be able to use it.&quot;<br/>\n<br/>\n </span></blockquote>The biggest problem in discussing the idea of control in general is that<br/>\nmost people begin with the socially implanted idea that control is the norm.<br/>\nIt&#39;s what children need. So someone suggesting &quot;I have come to the<br/>\nconclusion that control works for my kids,&quot; is really a reinforment of the<br/>\nsocial norm.<br/>\n<br/>\nThe idea many are working towards is to throw away that idea and begin with<br/>\na new base of operations, a new norm: the idea that control isn&#39;t necessary,<br/>\nthat children will self-regulate when given the freedom to do so.<br/>\n<br/>\nIt&#39;s from that point that we can begin modifying for our specific family&#39;s<br/>\nneeds.<br/>\n<br/>\nGetting to that point, though, isn&#39;t just a matter of replacing one thought<br/>\nwith another. The idea that adults know what is better for children than<br/>\nchildren do is deeply ingrained in us. The children-must-be-controlled<br/>\nmessages of society that we&#39;ve been immersed in from the time *we* were<br/>\ninfants make it very easy to look at a child indulging in video games or<br/>\njunk food for a couple of months, to see the changes in his personality and<br/>\ncome to the conclusion that he can&#39;t regulate himself and, therefore, must<br/>\nbe regulated from the outside.<br/>\n<br/>\nIf you&#39;ve begun from the perspective of no control is necessary, it isn&#39;t<br/>\nhelpful to suggest to someone whose norm is control who is searching for<br/>\nreinforcement that in such-and-such a particular instance control is<br/>\nnecessary that yes, sometimes control is neceessary.<br/>\n<br/>\nThe idea that has been suggested, that parents know what&#39;s best for their<br/>\nkids, doesn&#39;t fly. If that were so, then the only people needing<br/>\npsychiatrists would be those who have chemical imbalances or didn&#39;t have<br/>\nparents.<br/>\n<br/>\nAnother problem is that we, as a society, don&#39;t respect kids. It&#39;s portrayed<br/>\nas perfectly normal that kids will occasionally protest against what we feel<br/>\nis best for them. So we can easily be feel that &quot;something that works&quot; can<br/>\nbe something that makes the child miserable (until, presumably, they&#39;re old<br/>\nenough to &quot;see the light&quot;) but protects the child from something we feel<br/>\nmight happen or might become permanent.<br/>\n<br/>\nI think it&#39;s helpful to begin from the norm of respecting our children. To<br/>\ntreat them in terms of helping them grow as we would a close friend. We too<br/>\noften see it perfectly normal to treat our chldren in the name of &quot;love&quot; in<br/>\nways that would have our friends avoiding us like the plague.<br/>\n<br/>\nIf you&#39;ve begun from the perspective that respect is a given and concluded<br/>\nthat a special needs child needs someone to step in to help him learn to<br/>\nrespect himself, then it isn&#39;t as helpful to the mother of what is more<br/>\nlikely an average child to have the idea of disrespect as a normal tool<br/>\nreinforced. She&#39;s already got that every where she turns.<br/>\n<br/>\nJoyce <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Joseph Fuerst","from":"&quot;Joseph Fuerst&quot; &lt;fuerst@...&gt;","replyTo":"LIST","senderId":"h8eRu4r_jwoMqzg2FdtHNew2F1gR7Ixzc2k97tvfmmUuSEHiqKCfsITgdE0B9WwVLWDIa-EcoYLPLfxGcxg0gLks_aMVW2b-","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 1584","postDate":"1005777215","msgId":27728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzYwMWMxNmQ1YyQ2NjQ0ZmFhMCRlYTg5ODUwYUBwYXZpbGlvbj4=","referencesHeader":"PDEwMDU3NjY3NTUuMTU2NDguNjA0NDIubThAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":27721,"nextInTopic":27848,"prevInTime":27727,"nextInTime":27729,"topicId":27721,"numMessagesInTopic":0,"msgSnippet":"Sandra:  I do believe I grasp what you re talking about in giving children choices in their food selection.  This has worked splendidly in our household in","messageBody":"<div id=\"ygrps-yiv-1331379157\">Sandra:  I do believe I grasp what you&#39;re talking about in giving children<br/>\nchoices in their food selection.  This has worked splendidly in our<br/>\nhousehold in general.  BUT my daughters condition required her NOT to eat<br/>\nsome foods...regardless of thier level of healthiness and whether or not<br/>\nthey were available.  She could choose a healthy diet and still jeapordize<br/>\nher well-being.....even her life.  She does not even have the option to<br/>\nexperiment with how things make her body function and feel.  People coping<br/>\nwith a child&#39;s nut allergies have even a tougher road to hoe than our<br/>\ndaughter.  Especially during the toddler/pre-school years.<br/>\n<br/>\nOverall,  I agree and understand the principle.  And &quot;follow your tasebuds&quot;<br/>\nwas not the best choice of words. I&#39;m trying to unschool myself in this<br/>\narea,  as a matter of fact. Using the book Outsmarting Your Female Fat Cell,<br/>\nwhich basically promotes being in touch with your body&#39;y food cravings and<br/>\ndesires....and when they are satisfied,  even I gravitate toward a balanced<br/>\nhealthy diet over the long haul.<br/>\n<br/>\nFor those who have trouble understanding the concept....Penelope Leach<br/>\noffers a good discussion in Your Baby And Child.<br/>\n<br/>\nSusan<br/>\n<br/>\n&lt;&lt;  Should she simply follow her taste buds,<br/>\nshe could still get into trouble..... &gt;&gt;<br/>\n<br/>\n<br/>\nWhen kids are allowed free choice, they don&#39;t go by taste buds.<br/>\n<br/>\nIt&#39;s seeming impossible for some people to begin to grasp what we&#39;re talking<br/>\nabout.  Kids who have free choice eat protein, vegetables, fruit.  Not ONLY<br/>\nthose, but they eat all kinds of food, by choice.  And when it has been<br/>\nchoice (because they become hungry for all kinds of foods--the body balances<br/>\nitself), they have no aversions to any foods they&#39;ve been forced to eat.</div>","specialLinks":[]},{"userId":0,"authorName":"Bridget E Coffman","from":"Bridget E Coffman &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","senderId":"r9oqNbsuezQ2bI97_SKkxTTqW3TI1akDjEC-chkwpvePiVzqippvo4bHtH2bERT57wSBG7k3Qq_NKDzY3zw4UbhQ1QsAeUEZQTfTLi_j1bHWn1w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 1584","postDate":"1005769759","msgId":27721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTE0LjE1MjkyNy4tNzQ4MDg5LjIucnVtcGxldGVhc2VybW9tQGp1bm8uY29tPg=="},"prevInTopic":0,"nextInTopic":27728,"prevInTime":27720,"nextInTime":27722,"topicId":27721,"numMessagesInTopic":0,"msgSnippet":"No Sandra, here s the difference: I say, This is what works for me.  If what you are doing is not working you might want to think about it but if you found","messageBody":"<div id=\"ygrps-yiv-1898092924\">No Sandra, here&#39;s the difference:<br/>\n<br/>\nI say, &quot;This is what works for me.  If what you are doing is not working<br/>\nyou might want to think about it but if you found something that works<br/>\nfor you, I&#39;d love to hear about it even if I won&#39;t be able to use it.&quot;<br/>\n<br/>\nWhile you seem to being saying, &quot;Your problems would all go away if you<br/>\nwould just do what I do.&quot;  You never acknowledge that other people may<br/>\nhave different needs than you, that other children may have problems<br/>\nyour&#39;s don&#39;t.  That anyone else could possible have found a way of doing<br/>\nthings that works as well as yours.  <br/>\n<br/>\nI have no discord in my household and very happy kids.  They have free<br/>\nreign over their food intake (with the exception of allergens - which may<br/>\nor may not be restricted depending on the point of development.)  But,<br/>\nbecause I had to step in and limit certain foods at certain times, and<br/>\nbecause I have had to step in and take control of the TV with my OCD son,<br/>\nyou assume that my family if chock full of badness.<br/>\n<br/>\nI certainly hope you respect the individuality of your children more than<br/>\nyou respect the individuality of those on this list with you.  I never<br/>\nsaid you were nuts.  I never even said you way can&#39;t work.  I&#39;m sure it<br/>\ndoes work for some.  And I&#39;m equally certain that you are doing a<br/>\ndisservice to those for whom it can&#39;t work for one reason or another by<br/>\nsuggesting that they just aren&#39;t doing it right.<br/>\n<br/>\nBridget<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\n&gt; Subject: Re: Re: Why the sea...<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &lt;&lt; I see that same self-rightiousness rearing it&#39;s head in the<br/>\n&gt; &gt; &quot;let them watch whatever they want&quot; camp. &gt;&gt;<br/>\n&gt; <br/>\n&gt; But here&#39;s the difference:<br/>\n&gt; Those who are complaining of discord, frustration, unhappy kids, <br/>\n </span></blockquote>allergies <br/>\n<blockquote><span title=\"ireply\"> &gt; are those who are defending limits.<br/>\n&gt; <br/>\n&gt; Thos saying &quot;we don&#39;t have those problems&quot; are suggesting removing  the<br/>\n<br/>\n&gt; limits, and have success stories to go with their decisions.<br/>\n&gt; <br/>\n&gt; In the course of offering suggestions of things which have worked  well<br/>\n </span></blockquote>for <br/>\n<blockquote><span title=\"ireply\"> &gt; us, we&#39;re being insulted by those totally unwilling to consider  doing<br/>\n </span></blockquote>that, <br/>\n<blockquote><span title=\"ireply\"> &gt; sure that we&#39;re nuts.<br/>\n&gt; <br/>\n&gt; It&#39;s exactly like structured families and school-using families&#39; <br/>\n </span></blockquote>analysis of <br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling.  It will never work, how will they learn to read, how <br/>\n </span></blockquote>will they <br/>\n<blockquote><span title=\"ireply\"> &gt; learn math, they&#39;ll never get a job, they won&#39;t write unless you  <br/>\n&gt; make them,  etc.<br/>\n&gt; <br/>\n&gt; The food thing works like unschooling works, and for many of the  same <br/>\n&gt; reasons.  Humans are organisms with the inborn need and ability to <br/>\n </span></blockquote>grow and <br/>\n<blockquote><span title=\"ireply\"> &gt; learn.   Controls often backfire.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br/>\n     In three words I can sum up everything I&#39;ve learned about life: it<br/>\ngoes on.<br/>\n                                                     - Robert Frost</div>","specialLinks":[]}],"prevTopicId":28005,"nextTopicId":27969}}