{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:Phylisophical question about unschooling","postDate":"1134341222","msgId":23511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFNzA1QjlDLUExNUItNEFBRi05OTFCLTI2REUzNzA4MzAxM0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRuaTViZitlNmt1QGVHcm91cHMuY29tPg==","referencesHeader":"PGRuaTViZitlNmt1QGVHcm91cHMuY29tPg=="},"prevInTopic":23510,"nextInTopic":0,"prevInTime":23510,"nextInTime":23512,"topicId":23505,"numMessagesInTopic":0,"msgSnippet":"... ========================================== I don t think education is a bad thing. Information and choices are good things, and if anyone s life situation","messageBody":"<div id=\"ygrps-yiv-2016337434\">On Dec 11, 2005, at 2:22 PM, Barbara Mullins wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s like<br/>\n&gt; the whole world is brainwashed into thinking that EDUCATION is the<br/>\n&gt; answer to everything, right next to shopping (which of course is due<br/>\n&gt; to our capitialistic brainwashing as well I belive.)<br/>\n<br/>\n </span></blockquote>==========================================<br/>\n<br/>\nI don&#39;t think education is a bad thing.<br/>\nInformation and choices are good things, and if anyone&#39;s life  <br/>\nsituation is such that he has no access to information or learning or  <br/>\nchoices, then sometimes education (as in schooling) is a FANTASTIC  <br/>\nthing for him.<br/>\n<br/>\nSome people are from many generations of university educated people.   <br/>\nSome are from illiterate peasant/farmer backgrounds, or a combination  <br/>\nof the two.<br/>\n<br/>\nIf one class has information and choices and another has none, that  <br/>\nchasm can be bridged by making information more available.<br/>\n<br/>\nThe thing with unschooling in western cultures (and ALL the families  <br/>\nhere have computers, or computer access) is that information is all  <br/>\naround us and learning only needs permission and encouragement and  <br/>\naccess and swirl.<br/>\n<br/>\nEducation isn&#39;t the answer to everything, but ignorance and poverty  <br/>\naren&#39;t the answer to anything.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":99936689,"authorName":"Barbara Mullins","from":"&quot;Barbara Mullins&quot; &lt;mozafamily@...&gt;","profile":"mozafamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Phylisophical question about unschooling","postDate":"1134336175","msgId":23510,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRuaTViZitlNmt1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDUxMjExMDczNzUyLjMwMjcxLnFtYWlsQHdlYjMzMzA5Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":23505,"nextInTopic":23511,"prevInTime":23509,"nextInTime":23511,"topicId":23505,"numMessagesInTopic":0,"msgSnippet":"... getting what you ... way below the poverty line. Ironically, my income is so low because I choose to unschool my son instead of work full time and send him","messageBody":"<div id=\"ygrps-yiv-1821252640\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Paluszek Nicole <br/>\n&lt;npaluszek@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;     ***So limited resources doesn&#39;t have to mean <br/>\n&gt; whole-wide-world limiting, just different means and ways of <br/>\n </span></blockquote>getting what you <br/>\n<blockquote><span title=\"ireply\"> &gt; want. <br/>\n&gt;   ~Nancy ***<br/>\n&gt;    <br/>\n&gt;   I agree. I&#39;m a single working unschooling mom, with an income <br/>\n </span></blockquote>way below the poverty line. Ironically, my income is so low because <br/>\nI choose to unschool my son instead of work full time and send him <br/>\nto school. I never consider us poor though ( just sometimes broke , <br/>\nhehehe!) or too painfully limited in resources. Libraries are a <br/>\nmainstay of course, but there are so many other free or cheap <br/>\nresources as well. <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>    Hello Nicole - I wanted to thank you for your post. I have a 7yo <br/>\nand  I know just as with most peoples lives our unschooling <br/>\nlifestyle kindof goes on a rollarcoaster, really high and terrific <br/>\nat points and sinking and lousy at others. I am not a single mom but <br/>\nam lucking enough to have a very supportive DH but because I don&#39;t <br/>\nwork full time and have debt from college, house, car etc. that <br/>\nthings are very tight at times for us as well. Not having enough $ <br/>\nto buy the latest game/ toy that comes along when you read about <br/>\nmany unschooling families that can sometimes paints a picture that <br/>\nyou have to be well off to be an unschooler but I don&#39;t agree, <br/>\nthat&#39;s why I so thourally enjoyed your post to see that others are <br/>\nsuccessful without a large $ flow is so wonderful to hear! <br/>\n    I also agree with you about the 3rd world people thing, it is a <br/>\nhorrible situation and I don&#39;t know how to fix it but I don&#39;t see <br/>\nhow putting those kids in schools is working towards making them <br/>\nanything but obendient. Those commercials always state that they are <br/>\nworking for food & water, decent shelter & an education. It&#39;s like <br/>\nthe whole world is brainwashed into thinking that EDUCATION is the <br/>\nanswer to everything, right next to shopping (which of course is due <br/>\nto our capitialistic brainwashing as well I belive.) <br/>\n    Anyhow on another note we went to a Christmas party last evening <br/>\nand my son who unfortuantely hadn&#39;t had any playmates for probably a <br/>\nmonth becuase of broken vechiles & icy roads was such so polite and <br/>\nfriendly! I didn&#39;t have to explain even once why it wasn&#39;t okey to <br/>\ndo something (rather than just saying no) He played with many of the <br/>\nother kids and I talked with the other guests the whole evening, him <br/>\nwaving or coming to talk with me every so often or so. I think he&#39;s <br/>\nreally starting to take other people&#39;s feelings into consideration <br/>\nwhich was something that we were struggling with a few months ago. <br/>\nAnyhow it was a nice evening. Barbara</div>","specialLinks":[]},{"userId":152225273,"authorName":"Paluszek Nicole","from":"Paluszek Nicole &lt;npaluszek@...&gt;","profile":"globetrottingunschooler","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Phylisophical question about unschooling","postDate":"1134286672","msgId":23505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjExMDczNzUyLjMwMjcxLnFtYWlsQHdlYjMzMzA5Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":23510,"prevInTime":23504,"nextInTime":23506,"topicId":23505,"numMessagesInTopic":0,"msgSnippet":"***So limited resources doesn t have to mean whole-wide-world limiting, just different means and ways of getting what you want. ~Nancy *** I agree. I m a","messageBody":"<div id=\"ygrps-yiv-288651328\">***So limited resources doesn&#39;t have to mean <br/>\nwhole-wide-world limiting, just different means and ways of getting what you <br/>\nwant. <br/>\n  ~Nancy ***<br/>\n   <br/>\n  I agree. I&#39;m a single working unschooling mom, with an income way below the poverty line. Ironically, my income is so low because I choose to unschool my son instead of work full time and send him to school. I never consider us poor though ( just sometimes broke , hehehe!) or too painfully limited in resources. Libraries are a mainstay of course, but there are so many other free or cheap resources as well. <br/>\n   <br/>\n  &quot;The world is my oyster&quot; has been my motto for a long time. Together we have hiked and camped in magnificent wilderness, sailed to gems of little islands, prospected for crystals in stream beds, planted trees for conservation projects, learned the basics of taking care of horses and riding them, harvested delicious fruits from trees and vines, and fish and shellfish from the sea, fixed cars, assisted an entomologist in his fieldwork, built a house on the back of a truck, witnessed the creation of a sand mandala by Buddhist monks, taken care of ourselves so well the word &quot;doctor&quot; is fading from our memories, found many a treasure in dumpsters, met and talked with people from many different countries and many different walks of life, etc. etc. Cost: zilch!<br/>\n   <br/>\n  Yes, I consider myself a &quot;fortunate one&quot; to have found Unschooling. And I gladly spread the word of all the good things it is doing for us, so that more people might become so fortunate. Unfair? Come on!<br/>\n   <br/>\n  Though I am a very brainy person myself (I can do rocket science if I need to), I don&#39;t believe this is a prerequisite for Unschooling either. Being open-minded and especially TRUSTING yourself and your child(ren) are way, WAY more important.<br/>\n   <br/>\n  As for third-world countries, IMO they only became third-world countries and impoverished and dumbed down through Western interference and exploitation. So-called &quot;education&quot; has destroyed many previously prosperous traditional village communities by brainwashing the young folks that they would only be counted in this world if they left their village and got an office job in the city. In the meantime, their rice paddies, maintained at very high productivity for more than a thousand years, fell into disrepair, causing hunger where there had been no hunger before. Bangladesh never had disastrous floods before the British built their railways there. But I digress. Sorry.<br/>\n   <br/>\n  I was really trying to say that, had I lived in such a country, I would be doing pretty much the same thing as I am now, except it wouldn&#39;t be CALLED Unschooling. In other words, my &quot;finding Unschooling&quot; may have only happened because of and as a reaction to the existence of schools, but the PRACTICE of Unschooling for us has become &quot;learning as though no such thing as schools ever existed&quot;. This also seems to me the picture that arises from the work of John Taylor Gatto, from his insights into how schools came into being in the first place, and how children and adults used to learn before that.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\t\t<br/>\n---------------------------------<br/>\nYahoo! Shopping<br/>\n Find Great Deals on Holiday Gifts at Yahoo! Shopping <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":23460,"nextTopicId":23516}}