{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Music page","postDate":"1138640445","msgId":24235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzNTgxOEUyLTU1RTctNDc5RS1CNEYwLUM2REVEMkZEREU4REBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwM2EwMWM2MjVhZiRmNDgzZjEzMCQwMjAxYThjMEBPZmZpY2U+","referencesHeader":"PEE4OUYyOThGLTNCOTUtNDhERi04QzBCLUIxM0RGQkE0ODY4MUBTYW5kcmFEb2RkLmNvbT4gPDAwM2EwMWM2MjVhZiRmNDgzZjEzMCQwMjAxYThjMEBPZmZpY2U+"},"prevInTopic":24233,"nextInTopic":0,"prevInTime":24234,"nextInTime":24236,"topicId":24233,"numMessagesInTopic":0,"msgSnippet":"Very cool about the piano.  Holly was taking fiddle lessons for a while, and I would learn the lesson too, practicing after we got home, so I could help her.","messageBody":"<div id=\"ygrps-yiv-1180443212\">Very cool about the piano.  Holly was taking fiddle lessons for a  <br/>\nwhile, and I would learn the lesson too, practicing after we got  <br/>\nhome, so I could help her.  She would do a lot of &quot;not like that&quot;  <br/>\nabout the way I was holding it. &lt;g&gt;  But we were able to do some  <br/>\nduets.  She lost interest, which is fine.   We bought a violin from  <br/>\nour old neighbor, so it&#39;s there if the interest arises again for her  <br/>\nor me or whoever.<br/>\n<br/>\n-=-My little one watches &quot;Baby Einsteins&quot; in the morning and he loves  <br/>\nthe music on that show.  (He would whack me up-side the head if he  <br/>\nknew I was telling anyone he watches &#39;baby shows&#39;.  :)  )-=-<br/>\n<br/>\nTry to do what you can to neutralize that emotion.<br/>\nDividing music and shows and all into &quot;baby&quot; stuff and not is  <br/>\nproblematical for unschooling.<br/>\nIf the parents express their enjoyment and appreciation of things  <br/>\nthat were designed for kids, and if they let their kids listen to  <br/>\nwhat they want to without too much direction and channeling and  <br/>\n&quot;approval&quot; or disapproval, it will be easier for them to really  <br/>\ndecide whether they like something (music, art, poetry, movies,  <br/>\nwhatever) on its own merits rather than liking what they&#39;re supposed  <br/>\nto like, or desireing to prove they&#39;re &quot;grown&quot; by watching things  <br/>\nthat are &quot;not baby things.&quot;<br/>\n<br/>\nI&#39;m probably not describing this as well as I could, but my kids are  <br/>\nfine with all kinds of music and don&#39;t sort it by &quot;age,&quot; though they  <br/>\nare really careful about keeping the &quot;too mature&quot; or offensive stuff  <br/>\noff when they have very young, squeamish or religious-limitations  <br/>\nfriends over.  This week, Holly&#39;s two current music requests and  <br/>\nfocusses are the new Stephen Lynch CD (which I downloaded through  <br/>\niTunes) and Follow that Bird, a Sesame Street movie from years back.<br/>\n<br/>\nI think that&#39;s partly because my husband and I have not been self  <br/>\nconscious about enjoying all different kinds of music, and we could  <br/>\nget into whatever they were liking when they were little, and sing  <br/>\nthem cartoon themesongs from when we were little.  We learned Ninja  <br/>\nTurtle songs and My Little Pony, and there&#39;s a great song in the  <br/>\nnewish Barbie &quot;The Princess and the Pauper.&quot;  We were introduced to  <br/>\nit by Emma Sosebee in Las Vegas, when we stopped to stay with her  <br/>\nfamily on the way to California last fall.  She &quot;performed it&quot; for us  <br/>\nrepeatedly (singing along with the DVD and doing her spinning dance),  <br/>\nand Kirby started singing it several times on that long road trip.   <br/>\nWhen we got home we ordered a copy so we could get the words better.   <br/>\n&quot;I&#39;m just like you, you&#39;re just like me, We take  <br/>\nresponsibility&quot; (Emma&#39;s clearest line of all; she&#39;s three, I think.)<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":108691200,"authorName":"The Robbins&#39; Nest","from":"&quot;The Robbins&#39; Nest&quot; &lt;snibbor@...&gt;","profile":"robbins_gang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Music page","postDate":"1138634107","msgId":24233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2EwMWM2MjVhZiRmNDgzZjEzMCQwMjAxYThjMEBPZmZpY2U+","referencesHeader":"PEE4OUYyOThGLTNCOTUtNDhERi04QzBCLUIxM0RGQkE0ODY4MUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":24235,"prevInTime":24232,"nextInTime":24234,"topicId":24233,"numMessagesInTopic":0,"msgSnippet":"I just saw this and thought I would post about how interest in music has grown recently at our home. I bought a piano (95y/o upright and oh so beautiful) for","messageBody":"<div id=\"ygrps-yiv-1468066614\">I just saw this and thought I would post about how interest in music has grown recently at our home.<br/>\n<br/>\nI bought a piano (95y/o upright and oh so beautiful) for my anniversary when my son was 2.  I have always wanted to learn piano but had never owned one.  I thought having one &#39;right there&#39; would be all the incentive I needed to take lessons.  Not.  It sure looks pretty and I have all of my family photos arranged just perfect on top.  I still haven&#39;t learned more than 4 or 5 pages in the beginner book.  Life just keeps rolling on.  <br/>\n<br/>\nA couple of months ago, Alex (ds12) who has been offered lessons many times throughout his life but would always decline, decided out of nowhere he wanted to take piano.  Cool.  I was wondering what made him decide this and he said that he had borrowed my Beck &quot;Odelay&quot; cd and now wants to learn keyboard.  He&#39;s been taking lessons for a month now and absolutely loves it.  He is zipping through the beginner books and starting to compose his own music.  Last week he asked me if I knew anyone who teaches violin.  ??  Wow!  My little one watches &quot;Baby Einsteins&quot; in the morning and he loves the music on that show.  (He would whack me up-side the head if he knew I was telling anyone he watches &#39;baby shows&#39;.  :)  )  This boy has spent the last 4 years playing video and computer games practically non-stop (he is now a big 80&#39;s music fan after playing a lot of Grand Theft Auto) and the music bug has bitten him.  His interests are growing in other areas too.  We are helping to plan our homeschool group yearbook (he is wanting to get involved in the layout and design) and starting a newspaper for which he will be working on gaming articles.  <br/>\n<br/>\nMy daughter, Mady (10), is also taking voice lessons from the same instructor and just loves it too.  Now our home is filled with the tinkling sounds of my old piano that has sat here all these years just waiting to be played.  Maybe I&#39;ll find the time to get Alex to give me some pointers....<br/>\n<br/>\nKim<br/>\nMomma to Alex (ds12), Mady (dd10), and Dani (dd18mos.)<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Sandra Dodd <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Sunday, January 29, 2006 10:39 AM<br/>\n  Subject: [AlwaysLearning] Music page, help requested<br/>\n<br/>\n<br/>\n  I&#39;ve been working on my as-yet-small page on music, and would like  <br/>\n  other links or ideas to consider.  I&#39;m hoping for it to be simple,  <br/>\n  fun and not intimidating for non-musicians, and to connect music to  <br/>\n  other things.  I dont want it to try to be everything to anyone,  <br/>\n  because anyone wanting to search out music resource online can pretty  <br/>\n  easily do so.<br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/music\">http://sandradodd.com/music</a><br/>\n<br/>\n  Maybe accounts of how unschoolers have &quot;done music&quot; or stories of how  <br/>\n  music has unexpectedly led to other things (or arisen out of other  <br/>\n  interests) would be cool.  And if anyone knows of other religious- <br/>\n  MIDI sites, that would be good too.  Not other Christian or Jewish  <br/>\n  sites, but music of other religious cultures.<br/>\n<br/>\n  Thanks!<br/>\n<br/>\n  Sandra<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    a..  Visit your group &quot;AlwaysLearning&quot; on the web.<br/>\n      <br/>\n    b..  To unsubscribe from this group, send an email to:<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c..  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":24219,"nextTopicId":24210}}