{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"SandraDodd@xxx.xxx","from":"SandraDodd@...","replyTo":"LIST","senderId":"zEHE-PSJfXRtHmh-w1ieB-FO1bPmqp9MLuNJVxDkwrDbdaz8dUogMJUyhs-Pc0c860wGV8kWCov-","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: public school experiences","postDate":"928680870","msgId":632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41OC42MzIuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":623,"nextInTopic":0,"prevInTime":631,"nextInTime":633,"topicId":623,"numMessagesInTopic":0,"msgSnippet":" I did. It was better than home.  There were books at school, and adults who had been ","messageBody":"<div id=\"ygrps-yiv-285127844\">&lt;&lt;Is there anyone who DID have a positive experience in public school? &gt;&gt;<br/>\n<br/>\nI did.<br/>\nIt was better than home.  There were books at school, and adults who had been <br/>\nplaces and done things.  There were other kids I couldn&#39;t have met in my <br/>\nneighborhood.<br/>\n<br/>\nBut in retrospect, because I was successful in school, and somewhat <br/>\ncompetitive, I was having some of my positive experiences at the expense of <br/>\nothers.  I did well, which caused others not to be able to be top or best.  <br/>\n<br/>\nMost of my friends could have been having better times at home.  (They had <br/>\nbooks and educated parents and art supplies and music at their houses which I <br/>\ndidn&#39;t have in such abundance.)<br/>\n<br/>\n&lt;&lt;DH claims he had a wonderful time in public schools (well, he grew up in <br/>\nan extremely dysfunctional family, so I guess it was just nice for him <br/>\nto get away), and he&#39;s REALLY smart and a hard worker - always does what <br/>\nhe&#39;s told, and somehow knows how to lead, too, so I guess that helped <br/>\nhim.  But when I press him, it wasn&#39;t school he enjoyed - it was the <br/>\nafter-school activities. &gt;&gt;<br/>\n<br/>\nI&#39;m with him.  School had marching band, and clubs, and my bus came 40 <br/>\nminutes after school was out so I got to hang out with the kids, and the <br/>\nteachers, and in the library, and the public library was only three blocks <br/>\naway and I had time to go there.  In school they had choirs (so did they at <br/>\nchurch, but wimpy expectations at church), and an ART ROOM!!!<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"下川　誉志彦","from":"=?ISO-2022-JP?B?GyRCMjxAbiEhTUA7VkknGyhC?=  &lt;RXP10715@...","replyTo":"LIST","senderId":"XOWW6JBLuRqdeC_XTytuAFYc7mES4lPhASwrAsE8lty_VBOLXSTx9GMakOhIjSjPObtbSvWFuc5n6zMM5M7W8RLzJjNNkb4K_6bCR-T9J91NgH7L6bvplGwF4wcat_3ncEx_9Y-KDIzA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"public school experiences","postDate":"928661188","msgId":623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41OC42MjMuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":632,"prevInTime":622,"nextInTime":624,"topicId":623,"numMessagesInTopic":0,"msgSnippet":"Is there anyone who DID have a positive experience in public school?  My kindergarten report card says something like, Very intelligent and enthusiastic.  A","messageBody":"<div id=\"ygrps-yiv-1472510498\">Is there anyone who DID have a positive experience in public school?  My <br/>\nkindergarten report card says something like, &quot;Very intelligent and <br/>\nenthusiastic.  A pleasure to have in class.&quot;  My first grade report card <br/>\nsays, &quot;Needs to learn to deal with frustration without tears.&quot;  As time <br/>\nwent on, it got worse.  My fourth grade teacher wrote something like, <br/>\n&quot;underachiever.  Needs to put in more effort.&quot;  I was begging to be <br/>\nhomeschooled from the second I heard of it (in 6th grade), but my mother <br/>\nand father both (mostly my father - he has all these degrees, and thinks <br/>\nlearning can only take place in front of a textbook when taught by a <br/>\n&quot;qualified&quot; specialist, ie teacher) are more anti-homeschooling than any <br/>\nother &quot;anti&quot; group I&#39;ve ever known.  That&#39;s why it completely surprised <br/>\nme when my mother said she MIGHT homeschool my sisters, maybe, if the <br/>\nschools in the area they&#39;re moving to are REALLY bad.  And then, only IF <br/>\nshe can find a suitable, complete yet inexpensive curriculum, and a <br/>\nlarge homeschool group with children my sisters&#39; exact same ages.  In <br/>\nany case, when I left home for college, I was so afraid of everybody, <br/>\nbecause I&#39;d been bullied from first grade to twelfth.  I also thought I <br/>\nwasn&#39;t smart enough and that I&#39;d get kicked out.  All throughout my <br/>\nschool years, we would go over the wrong answers on our tests as a class <br/>\n(not a single person in my classes would make it through that without <br/>\nsome teasing), and work through those problems in class.  I would <br/>\nusually get 100% on the tests (I almost flunked out of school though, <br/>\njust because I wouldn&#39;t do my homework), so I&#39;d pull out a book or <br/>\nsomething, and every time, I got detention for not paying attention.  (I <br/>\nwould also get detention for not doing my homework.)  <br/>\n<br/>\nDH claims he had a wonderful time in public schools (well, he grew up in <br/>\nan extremely dysfunctional family, so I guess it was just nice for him <br/>\nto get away), and he&#39;s REALLY smart and a hard worker - always does what <br/>\nhe&#39;s told, and somehow knows how to lead, too, so I guess that helped <br/>\nhim.  But when I press him, it wasn&#39;t school he enjoyed - it was the <br/>\nafter-school activities.  Still, he doesn&#39;t want to deprive our <br/>\nchildren, so...  But I have a couple more years to convince him.  It&#39;s <br/>\nhappening little by little.  I squeeze every bit of education out of an <br/>\nactivity, and translate it for him - ds has almost learned his fractions <br/>\njust by helping me measure when I cook (though I never measured before I <br/>\nstarted unschooling him), he knows that orange juice is better for you <br/>\nthan orange soda and why (health and nutrition), he also knows the names <br/>\nof every train and bulldozer/powershovel/crane/type machine in Japan <br/>\n(including major serial numbers and what they mean), and the mechanics <br/>\nand electronics of how they operate.  Though if I showed him a textbook <br/>\nworkbook with all the math he knows (yes, my two year old knows some <br/>\nbasic algebra), he wouldn&#39;t know what to do with it.  He knows that two <br/>\nfourths of a cup are the same as one half.  He knows that if he has six <br/>\ncookies, then Daddy gets two, he gets two, and Mama gets two - without <br/>\neven having to count it out.  Before I started unschooling him - before <br/>\nI even thought about homeschooling (sorry to say, I grew up with my <br/>\nparents attitudes about homeschooling) - I taught him all his numbers <br/>\nand letters - uppercase and lowercase and what they sound like, so he <br/>\nknows that.  The next step was to teach him to read, but fortunately I <br/>\nlearned about unschooling first, so I won&#39;t &quot;teach&quot; him to read until <br/>\nhe&#39;s ready, and he&#39;s not.  My mother is really impressed with him so <br/>\nfar.  I couldn&#39;t recognise my letters or numbers until I was four, and <br/>\nshe really had to work with me.  When I told her that he also knew his <br/>\nfractions (though he can&#39;t recognise them on paper) and some basic <br/>\nalgebra, she told me I was pushing him too hard and he would be burnt <br/>\nout before he was even old enough to go to pre-school, but I only help <br/>\nhim where he asks for it, and then translate what he knows into <br/>\neduspeak.  DH says I shouldn&#39;t lie like that - that if he can&#39;t do it on <br/>\npaper and from textbook examples, then he really can&#39;t do it at all.  So <br/>\nI&#39;m working on other ways of convincing DH.  Like, &quot;Here - you want to <br/>\nimprove your English, right?  Read this...&quot;  hehe<br/>\n<br/>\nLove, MElanie in Japan</div>","specialLinks":[]}],"prevTopicId":248,"nextTopicId":641}}