{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Linda Wyatt","from":"Linda Wyatt &lt;hilinda@...","replyTo":"LIST","senderId":"Bs-jo85LhVzAW6jsnMhK2q32VittacyQHRZeey-xbTcn7tHIi-oAIhDwW1Qf36Hq8Jxs2xzpFcYM630OKObW_zQ4FyRnFxdlcCc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling math (was:Re:Unschooling or Eclectic?)","postDate":"936563761","msgId":2574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xODcuMjU3NC45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2573,"nextInTime":2575,"topicId":2574,"numMessagesInTopic":0,"msgSnippet":"Ah, my most favorite thing. :-) ... Unschooling doesn t teach a child anything.  They learn, which is different. But do unschoolers learn the mathematic","messageBody":"<div id=\"ygrps-yiv-232533191\">Ah, my most favorite thing. :-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; OK, let me try again.  Does unschooling teach a child to recognize the<br/>\n&gt; mathematic symbols used in textbooks?<br/>\n<br/>\n </span></blockquote>Unschooling doesn&#39;t &quot;teach&quot; a child anything.  They learn, which is different.<br/>\n<br/>\nBut do unschoolers learn the mathematic symbols used in textbooks?  Sure,<br/>\nif they have a reason to do so.  If they want to be able to communicate<br/>\nmath concepts, then yes, they&#39;ll need to learn standard notation, just like<br/>\nif they want to write to someone and have it understandable, they need to<br/>\nlearn how to write in the language they speak.  Same thing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From the unschoolers I&#39;ve known math<br/>\n&gt; is mostly mental math - which is great - yet I don&#39;t see where they<br/>\n&gt; experience the math sentence and different layouts of mathematic problems<br/>\n&gt; on paper.  I would think this could potentially cause a problem at some<br/>\n&gt; point would it not?<br/>\n<br/>\n </span></blockquote>I think this is an interesting thing to think about.<br/>\n<br/>\nIn some ways, you may be right.  I think unschoolers do a lot more mental<br/>\nmath than school kids do.  They *start* with mental math, and may or may<br/>\nnot do it on paper until much later, instead of starting with written math,<br/>\nand *not understanding it* until later.<br/>\n<br/>\n<br/>\nBut again, I think it&#39;s like learning any language-  it is more natural to<br/>\nlearn to speak before learning to write.<br/>\n<br/>\nI don&#39;t think it&#39;s a problem.  They learn to write it down when they need<br/>\nit that way.  They also see written math quite a lot, at least my kids do.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; OK so what is Real Math?<br/>\n<br/>\n </span></blockquote>Math is a language.  It is what we use to describe things and their<br/>\nrelationships to each other very precisely.<br/>\n<br/>\nMath is far more than numbers.  It is shapes, patterns, connections,<br/>\nchanges, movement, color, music, art, logic...<br/>\n<br/>\nEverything can be translated into or expressed in mathematical concepts-<br/>\nlook at artificial intelligence.<br/>\n<br/>\nArithmetic is the manipulation of numbers.  It&#39;s a basic part of much math,<br/>\nbut nowhere near the entire thing.  It&#39;s just the part that schools seem to<br/>\nfocus on, at least until you get to graduate level.<br/>\n<br/>\nAlgebra is the art of taking the information you know, and using it to<br/>\nfigure out the information you don&#39;t know.<br/>\n<br/>\nGeometry is boring... no, wait. &lt;g&gt;  Geometry has to do with shapes and<br/>\nsizes, angles and connections.  Things.  Objects.<br/>\n<br/>\nTrigonometry is very cool, once you figure out what it really is used for.<br/>\nWaves.  Frequencies.  Vectors.  Very compact ways of expressing things that<br/>\nchange.<br/>\n<br/>\nAnd calculus, that beautiful thing... how incredibly cool that you can<br/>\nfigure out so much about things that are only dreamt of, by understanding<br/>\nthe theories of how they must be.<br/>\n<br/>\nfractals... infinite series... infinity itself, what a concept<br/>\n<br/>\nand on and on.  All things of fascination, of beauty.  Of TRUTH, in its raw<br/>\nform.  Where else but in math are things proven facts, irrefutable, perfect<br/>\nforever?<br/>\n<br/>\n:::sigh:::<br/>\n<br/>\nI&#39;m rambling, getting emotional.  I have friends who laugh at me because I<br/>\nhave to put math books down after a while, I get too excited to keep<br/>\nreading.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So you are saying that ages 13-14 is where math should begin?<br/>\n<br/>\n </span></blockquote>Math begins before you are born.  Is, was, and always will be. :-)<br/>\n<br/>\nUnderstanding math begins at birth.<br/>\n<br/>\nA babies first mathematic concept:  am I, or am I not, the same being as my<br/>\nmother?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thus  entering into the algebras, trigs, geometry, etc.?<br/>\n<br/>\n </span></blockquote>These also begin very young, they are concepts, much to think about and<br/>\nexplore with long before any sort of &quot;formal&quot; education begins.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Then where is the<br/>\n&gt; child&#39;s base?  Math like any other subject must have a foundation.<br/>\n<br/>\n </span></blockquote>And it does.  Life.  Life itself is the base of math, or is it the other<br/>\nway around?<br/>\n<br/>\nWhere is a child&#39;s foundation in language?<br/>\n<br/>\nHuman brains are designed to use and understand math and language.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  When  did they learn multiplication (note I didn&#39;t say memorize the entire<br/>\n&gt; multiplication table) and division, fractions, decimals, etc.<br/>\n<br/>\n </span></blockquote>All along.  Time is a big math concept motivator, as is money.  Body parts-<br/>\ntwo of some ten of some, why?  Why are bodies mostly (but not totally)<br/>\nsymmetrical?  Why do some things fit together, others don&#39;t?  Why do some<br/>\nstacks of things balance, others don&#39;t?  Why is it that if you want to<br/>\nbuild a lego thing that is twice as tall and twice as wide and twice as<br/>\nlong as the one you have, it takes 8 times as many blocks?  Why is it that<br/>\ntwo glasses can be different heights, but hold the same amount?  Why isn&#39;t<br/>\na taller one always &quot;bigger&quot;?<br/>\n<br/>\nNotation starts when they realize that making a dot for each thing, or<br/>\nusing an object to represent a thing, gets a bit tedious after a while,<br/>\nsurely there must be an easier way?<br/>\n<br/>\nConcepts are learned as we need them, as we wonder about them, as we come<br/>\nacross them.<br/>\n<br/>\nWhat amazes me is the number of people who think there is no math in their<br/>\nlives.<br/>\n<br/>\nAs far as more advanced written math- they&#39;ll either need to learn it, and<br/>\nembrace it, or they won&#39;t need to learn it. If they don&#39;t need it, they<br/>\ndon&#39;t need it.<br/>\n<br/>\nHow much of the school math that you &quot;learned&quot; do you still use, really?<br/>\nOnly those who have a need or an interest retain it.  Most people will not<br/>\nneed anything beyond basic algebra, some don&#39;t need even that.<br/>\n<br/>\n<br/>\n<br/>\nLinda</div>","specialLinks":[]}],"prevTopicId":2566,"nextTopicId":2579}}