{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":47,"messages":[{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: A request","postDate":"1037637710","msgId":50063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERDkxODRFLjJENjFBOEZDQGVhcnRobGluay5uZXQ+","referencesHeader":"PGFyOTk2OStqZmRvQGVHcm91cHMuY29tPiA8MDQwMTAxYzI4ZWJhJDZlY2JiM2EwJDA5MDBhOGMwQHdlc3Q+"},"prevInTopic":50054,"nextInTopic":50086,"prevInTime":50062,"nextInTime":50064,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"**I think people are gradually moving towards computers and the internet, but I don t feel like it s our place to push them. (being an unschooler and all ","messageBody":"<div id=\"ygrps-yiv-2118742274\">**I think people are gradually moving towards computers and the<br/>\ninternet, but I don&#39;t feel like it&#39;s our place to push them. (being an<br/>\nunschooler and all<br/>\n&lt;g&gt;)**<br/>\n<br/>\nMy thought was that someone with toddlers might find it difficult to<br/>\nread mail at the library unless they can get to the library in the evening.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: A request","postDate":"1037631175","msgId":50054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OS4yZDViNDlkLjJiMGE1OGM3QGFvbC5jb20+"},"prevInTopic":50049,"nextInTopic":50063,"prevInTime":50053,"nextInTime":50055,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/18/02 6:56:17 AM, tessimal@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1014124079\">In a message dated 11/18/02 6:56:17 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tessimal@...\">tessimal@...</a> writes:<br/>\n<br/>\n&lt;&lt; I am a very good editor.  That is part of my job history.  But the <br/>\nwhole thing in the group had more to do with power and control <br/>\nissues, the usual group dynamic crap, than with editing skills.  &gt;&gt;<br/>\n<br/>\nInformation and money--the biggest things groups ever fight about.<br/>\n<br/>\nOne compromise solution is to have copies of the lists of members and <br/>\nupcoming events, but only hand them out in person at meetings.  Single <br/>\nsheets.  Only print a few at a time, date them, and if someone wants to take <br/>\nextras to give to other friends, fine.  But don&#39;t promise to mail anything, <br/>\nbecause it&#39;s expensive and something to fight about.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":48651385,"authorName":"tessimal","from":"&quot;tessimal&quot; &lt;tessimal@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A request","postDate":"1037627782","msgId":50049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFyYXJpNituMnB1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA0MDEwMWMyOGViYSQ2ZWNiYjNhMCQwOTAwYThjMEB3ZXN0Pg=="},"prevInTopic":50044,"nextInTopic":50054,"prevInTime":50048,"nextInTime":50050,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"... Works for us though.  Dues are $15/year to cover the mailing costs, etc.  Anyone who can t afford that just has to say so and we subsidize them. Once I","messageBody":"<div id=\"ygrps-yiv-381123904\"><blockquote><span title=\"qreply\">--- In Unschooling-dotcom@y..., Tia Leschke &lt;leschke@s...&gt; wrote:<br/>\n&lt;&gt;Works for us though.  Dues are $15/year to cover the mailing costs, <br/>\netc.  Anyone who can&#39;t afford that just has to say so and we <br/>\nsubsidize them.&lt;&gt;<br/>\n<br/>\nOnce I took on the newsletter and quickly calculated that we were not <br/>\ntaking in enough from members to even cover the cost of printing, let <br/>\nalone mailing, dues had to go up.  Our treasurer then admitted that <br/>\nwe were in the red and dues went to $35/year.  I think that&#39;s very <br/>\nhigh.  Yes, the group also had the policy that anyone who could not <br/>\nafford membership could ask to be subsidized, though that fact was <br/>\nrarely communicated to members.  As soon as I took on the job I got <br/>\nbids for printing and changed formatting to cut newsletter expenses <br/>\nsignificantly, almost in half.  I also suggested other ways to cut <br/>\nprinting costs even more, but the group never followed through on <br/>\nthose suggestions.  Then came the battle to get the dues lowered <br/>\nagain, so that the group wasn&#39;t just accruing money in the bank <br/>\nwithout ever having consulted members about why the group was doing <br/>\nthis, for what purpose all the extra money was intended.  That took <br/>\nalmost two years to straighten out.  Dues are now down to $24 and <br/>\nthat covers the monthly hard-copy newsletter with some to spare.<br/>\n<br/>\nWhat I saw was that money and treasury and anything to do with money <br/>\nwas very divisive.  Back to power and control issues.  Though many <br/>\nfolks never recognized that as the source of division.  Instead they <br/>\nsaw only the people who brought up the subject of money as divisive <br/>\nforces.  So in the new group I eliminated the need for any kind of <br/>\ndues.  That is why there is no hard copy newsletter.  Besides, when I <br/>\nanalyzed all the information that was in the newsletter, even though <br/>\nwe organized and participated in many, many activities, I found that <br/>\nabout 3/4 of the newsletter was not information that I needed to keep <br/>\non hand.  So, with the listserv format folks only print out what they <br/>\nare specifically interested in.  And the archives are always there <br/>\nfor quick reference, going all the way back to the beginning.  I love <br/>\nthat feature!<br/>\n<br/>\n&lt;&gt;I think people are gradually moving towards computers and the <br/>\ninternet, but I don&#39;t feel like it&#39;s our place to push them. (being <br/>\nan unschooler and all &lt;g&gt;)&lt;&gt;<br/>\n<br/>\nI guess we just have a different perspective.  I took my first <br/>\nfortran course in 1963 when the computer was the whole building. <br/>\nAlmost forty years later I figure folks are way past &quot;gradually <br/>\nmoving towards computers.&quot;  I may be Quaker, but I am not Amish.  <br/>\nSince many ways to access computers and the internet exist in today&#39;s <br/>\nworld I don&#39;t feel that it is pushing anyone.  From free access in <br/>\nlibraries and community centers, to web TV, to friends helping <br/>\nfriends there are many ways to learn about computers today.  It is <br/>\nsimply giving folks the opportunity to participate in the real <br/>\nworld.  Few jobs today do not require the ability to use computers <br/>\nand access the internet.  My 15-year-old daughter works in a gift <br/>\nshop and she has to use computers and the internet in her job daily.  <br/>\nChoosing not to use computers and the internet is a valid choice, but <br/>\nas restrictive as any other kind of exclusionary choice, like <br/>\nreligion or educational philosophy, or a pre-packaged curriculum.  <br/>\n<br/>\n&lt;&gt;No wonder you hated it.  I *do* edit what comes in.  I took the job <br/>\nbecause I want to get into freelance editing, so I&#39;m learning on <br/>\nthe &quot;job&quot;.&lt;&gt;<br/>\n<br/>\nI am a very good editor.  That is part of my job history.  But the <br/>\nwhole thing in the group had more to do with power and control <br/>\nissues, the usual group dynamic crap, than with editing skills.  In <br/>\nthe listserv format everyone gets to edit their own submissions!  <br/>\nGreat home education, as far as I&#39;m concerned.  Either folks learn to <br/>\nspell check and grammar check, or they accept the consequences of <br/>\nputting what they write out there in whatever form they choose to <br/>\npresent it.  I have no objections to that.<br/>\n<br/>\nSpelling is, after all, one of those things that brings the issue of <br/>\nclass consciousness into our lives.  Back when our Constitution was <br/>\nbeing written many folks spelled many words differently.  And no one <br/>\ngot too upset about it as long as they could understand what was <br/>\nbeing written.  But then education and class consciousness drifted in <br/>\nand those who spelled one way were considered the best and brightest, <br/>\nand those who spelled another way were considered &quot;uneducated.&quot;  It <br/>\nis a construct that has remained with us, for better or worse, though <br/>\nI don&#39;t think most people understand its class basis.<br/>\n <br/>\n&lt;&gt;I&#39;m glad you were able to get a group going that meets your (and <br/>\nother people&#39;s) needs.  I know there has been a lot of what you <br/>\ndescribe going on with the local Christian group, but I don&#39;t have to <br/>\ndeal with it.  Phew!&lt;&gt;<br/>\n<br/>\nYup.  Life is much nicer when so much energy isn&#39;t tied up bickering <br/>\nabout things that don&#39;t even bleep on our radar screens anymore.<br/>\n<br/>\nNorma </span></blockquote></div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A request","postDate":"1037595411","msgId":50044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFyOXJ1aitudXRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGFyOTk2OStqZmRvQGVHcm91cHMuY29tPg=="},"prevInTopic":50042,"nextInTopic":50049,"prevInTime":50043,"nextInTime":50045,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"... We have several without internet access here too.  Even a lot of those in our area who do have internet access don t get on very regularly.  I do the","messageBody":"<div id=\"ygrps-yiv-1572741879\"><blockquote><span title=\"ireply\">&gt; &lt;&gt;The Victoria Homelearners Network works much the same way except <br/>\n&gt; that we do have a print newsletter.  (The new editor is moi.)  Not <br/>\n&gt; everyone in our area has internet access.&lt;&gt;<br/>\n<br/>\n </span></blockquote>We have several without internet access here too.  Even a lot of <br/>\nthose in our area who do have internet access don&#39;t get on very <br/>\nregularly.  I do the newsletter for our group too and sent an email <br/>\nnewsletter to everyone in the group who had an email address.  I <br/>\nasked people to reply to me if they got the newsletter in their email <br/>\nand if they prefer it that way.  Most people did not reply and now <br/>\nget the newsletter by snail mail.  I talked to some of them, who said <br/>\nthat even though they have an email address they only get on the <br/>\ncomputer to check email once every two weeks.  Often I send email to <br/>\nhomeschoolers in our group and don&#39;t get a reply.  I&#39;ll ask them if <br/>\nthey got the email I sent them a week ago and they&#39;ll say, &quot;I don&#39;t <br/>\nknow, I&#39;ll have to ask my husband.&quot;  or &quot;It&#39;s been about a week since <br/>\nI&#39;ve been on, I&#39;ll let you know when I do.&quot;  Of course I&#39;m the only <br/>\nunschooler in our group.  There are 2 pretty relaxed homeschoolers <br/>\nand the rest are pretty strict school at homers.  <br/>\n<br/>\nInstead of worrying <br/>\n<blockquote><span title=\"ireply\"> &gt; about who has computer access and who doesn&#39;t we offer to help <br/>\n </span></blockquote>anyone <br/>\n<blockquote><span title=\"ireply\"> &gt; who wants to join by meeting them at their local library branch <br/>\n </span></blockquote>where <br/>\n<blockquote><span title=\"ireply\"> &gt; they can have free internet access, set up their own free e-mail <br/>\n&gt; account, and get on the list. <br/>\n<br/>\n<br/>\n </span></blockquote>Our local libraries do not allow people to email or post to message <br/>\nboards from their library computers. I asked why once and was told <br/>\nthat if someone sends out a bomb threat, the library might get into <br/>\ntrouble.   I was just talking to my librarian, who said that she was <br/>\ngoing to try to get a grant to get the library system computerized, <br/>\nso that we could have a online card catalog instead of the old <br/>\nfashioned card catalog, but the library board doesn&#39;t want the <br/>\ngrant.  No one who works at the library (except the head librarian <br/>\nwho was recently hired) knows how to use a computer.  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: A request","postDate":"1037580198","msgId":50042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0MDEwMWMyOGViYSQ2ZWNiYjNhMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PGFyOTk2OStqZmRvQGVHcm91cHMuY29tPg=="},"prevInTopic":50024,"nextInTopic":50044,"prevInTime":50041,"nextInTime":50043,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"... Works for us though.  Dues are $15/year to cover the mailing costs, etc. Anyone who can t afford that just has to say so and we subsidize them. ... I think","messageBody":"<div id=\"ygrps-yiv-1219590638\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; So, when I started the new group I was determined to steer very clear<br/>\n&gt; of that hard-copy expense (it was costing close to $2.00 per copy per<br/>\n&gt; month) and all its accompanying contentiousness.  Instead of worrying<br/>\n&gt; about who has computer access and who doesn&#39;t we offer to help anyone<br/>\n&gt; who wants to join by meeting them at their local library branch where<br/>\n&gt; they can have free internet access, set up their own free e-mail<br/>\n&gt; account, and get on the list.  And individual members have often<br/>\n&gt; volunteered to meet with someone in their own home to help them learn<br/>\n&gt; basic internet skills so they can join and access the list.  Some<br/>\n&gt; members have even donated their old computer systems to new members<br/>\n&gt; who don&#39;t have them.<br/>\n<br/>\n </span></blockquote>Works for us though.  Dues are $15/year to cover the mailing costs, etc.<br/>\nAnyone who can&#39;t afford that just has to say so and we subsidize them.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I mean isn&#39;t unschooling all about learning?  Are we not all learning<br/>\n&gt; new things all the time?  Doesn&#39;t our learning how to access and use<br/>\n&gt; the internet set a good example for our children who might be<br/>\n&gt; intimidated about learning something new?  Of course, most of the<br/>\n&gt; time they could easily teach us what we need to know about computers<br/>\n&gt; and the internet in a minute, right?<br/>\n<br/>\n </span></blockquote>I think people are gradually moving towards computers and the internet, but<br/>\nI don&#39;t feel like it&#39;s our place to push them. (being an unschooler and all<br/>\n&lt;g&gt;)<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; We have no executives in CATCH.  In the other group we didn&#39;t have<br/>\n&gt; newsletter meetings.  All the meetings had to do with organizational<br/>\n&gt; hocus pocus.  All newsletter info was emailed to the publisher.  I<br/>\n&gt; was not allowed to change or edit anything that was sent in by the<br/>\n&gt; members.  Nor was I allowed to do much of anything that came close to<br/>\n&gt; real publishing.  Basically I was a desktop publishing tech; I<br/>\n&gt; copied, cut, and pasted, that&#39;s all.  That had been established by my<br/>\n&gt; predecessor.  Much easier to do desktop publishing with email<br/>\n&gt; newsletter submissions!  And a few rare members would mail something,<br/>\n&gt; once in a while, though I needed to get it earlier to have time to<br/>\n&gt; type it in, a nuisance in my opinion, especially when the newsletter<br/>\n&gt; was getting up to 32 full pages.<br/>\n<br/>\n </span></blockquote>No wonder you hated it.  I *do* edit what comes in.  I took the job because<br/>\nI want to get into freelance editing, so I&#39;m learning on the &quot;job&quot;.  We have<br/>\nan unschooled teen doing the layout now.  He&#39;s great at it.  I guess he&#39;s<br/>\ndoing the job you were, only we also have an editor.  His interest is really<br/>\nin how it all looks, and he generally doesn&#39;t even read the articles, etc.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>I&#39;m glad you were able to get a group going that meets your (and other<br/>\npeople&#39;s) needs.  I know there has been a lot of what you describe going on<br/>\nwith the local Christian group, but I don&#39;t have to deal with it.  Phew!<br/>\nTia</div>","specialLinks":[]},{"userId":48651385,"authorName":"tessimal","from":"&quot;tessimal&quot; &lt;tessimal@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A request","postDate":"1037576201","msgId":50024,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFyOTk2OStqZmRvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxYzEwMWMyOGU3MyQ5NDA3ODgyMCQwOTAwYThjMEB3ZXN0Pg=="},"prevInTopic":50001,"nextInTopic":50042,"prevInTime":50023,"nextInTime":50025,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"... The Victoria Homelearners Network works much the same way except that we do have a print newsletter.  (The new editor is moi.)  Not everyone in our area","messageBody":"<div id=\"ygrps-yiv-1384676219\">Tia:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In Unschooling-dotcom@y..., Tia Leschke &lt;leschke@s...&gt; wrote:<br/>\n&lt;&gt;The Victoria Homelearners Network works much the same way except <br/>\nthat we do have a print newsletter.  (The new editor is moi.)  Not <br/>\neveryone in our area has internet access.&lt;&gt;<br/>\n<br/>\nWell, the other group, the one where I encountered such hostility and <br/>\nexclusion, had a newsletter, too.  And I was the publisher, for a <br/>\nwhile, but I soon learned that a small but very vocal group of &quot;old <br/>\ntime&quot; members had all kinds of rules about what I should do and how I <br/>\nshould do it, even though I was an unpaid volunteer.  Didn&#39;t matter, <br/>\nthese members took it upon themselves to tell me how to do <br/>\neverything; what I could and could not do, what I could and could not <br/>\nchange, what they did and did not like, etc.  The publisher was the <br/>\nperson on whom all the back room political drudge got dumped.  <br/>\nRidiculous!!!!  No volunteer job is worth what I had to put up with.  <br/>\nI mean I only had years and years (too many to mention!) of <br/>\njournalism and newsletter publishing experience, but the desktop <br/>\npublishing was new to me, so I learned on the job, basically on my <br/>\nown, with a little telephone or email assistance from the previous <br/>\npublisher and a lot of help from my then pre-teen daughter.  We <br/>\nactually partnered on the publishing of the newsletter.  That was the <br/>\nfun part!<br/>\n<br/>\nSo, when I started the new group I was determined to steer very clear <br/>\nof that hard-copy expense (it was costing close to $2.00 per copy per <br/>\nmonth) and all its accompanying contentiousness.  Instead of worrying <br/>\nabout who has computer access and who doesn&#39;t we offer to help anyone <br/>\nwho wants to join by meeting them at their local library branch where <br/>\nthey can have free internet access, set up their own free e-mail <br/>\naccount, and get on the list.  And individual members have often <br/>\nvolunteered to meet with someone in their own home to help them learn <br/>\nbasic internet skills so they can join and access the list.  Some <br/>\nmembers have even donated their old computer systems to new members <br/>\nwho don&#39;t have them.  <br/>\n<br/>\nI mean isn&#39;t unschooling all about learning?  Are we not all learning <br/>\nnew things all the time?  Doesn&#39;t our learning how to access and use <br/>\nthe internet set a good example for our children who might be <br/>\nintimidated about learning something new?  Of course, most of the <br/>\ntime they could easily teach us what we need to know about computers <br/>\nand the internet in a minute, right?<br/>\n<br/>\n&lt;&gt;We have no executive or regular meetings other than the newsletter <br/>\nmeetings.&lt;&gt;<br/>\n<br/>\nWe have no executives in CATCH.  In the other group we didn&#39;t have <br/>\nnewsletter meetings.  All the meetings had to do with organizational <br/>\nhocus pocus.  All newsletter info was emailed to the publisher.  I <br/>\nwas not allowed to change or edit anything that was sent in by the <br/>\nmembers.  Nor was I allowed to do much of anything that came close to <br/>\nreal publishing.  Basically I was a desktop publishing tech; I <br/>\ncopied, cut, and pasted, that&#39;s all.  That had been established by my <br/>\npredecessor.  Much easier to do desktop publishing with email <br/>\nnewsletter submissions!  And a few rare members would mail something, <br/>\nonce in a while, though I needed to get it earlier to have time to <br/>\ntype it in, a nuisance in my opinion, especially when the newsletter <br/>\nwas getting up to 32 full pages.<br/>\n  <br/>\n&lt;&gt;People can and do organize regular support group meetings, and <br/>\nthere are tons of activities organized.&lt;&gt;<br/>\n<br/>\nSame here.  CATCH members organize whatever suits their fancy.  We <br/>\nhave had speakers, and topic groups, and play groups, and <br/>\nevent/activity organizing groups.  But it&#39;s basically up to the folks <br/>\nwho want to have something happen.  We don&#39;t do things just because <br/>\nit was done before, or done a certain way before.  And folks have to <br/>\norganize the financing on their own, too.  Good lessons in <br/>\norganization and management skills, fundraising, for all involved.<br/>\n<br/>\n&lt;&gt;My son doesn&#39;t take part mostly, but my granddaughter is close to <br/>\nneeding a daytimer for all the activities she takes part in through <br/>\nthe group.  She&#39;s taking ballet, drama, first aid, renaissance <br/>\ndancing and probably a bunch of other stuff I can&#39;t remember right <br/>\nnow.&lt;&gt;<br/>\n<br/>\nMy daughter&#39;s schedule used to be a lot like your granddaughter&#39;s, <br/>\nbut now that she&#39;s 15 it is a little different.  Still hectic at <br/>\ntimes, but a different kind of hectic, with a job and an active <br/>\nsocial life thrown in for good measure.  Sounds like your group is <br/>\ndoing a great job.  Keep up the good work!<br/>\n<br/>\nNorma<br/>\nCATCH/Cincinnati Area Teaching Children at Home<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/SosinkyHS\">http://groups.yahoo.com/group/SosinkyHS</a> </span></blockquote></div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: A request","postDate":"1037562145","msgId":50001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYzEwMWMyOGU3MyQ5NDA3ODgyMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PGFyNWs5ZSs2MTY1QGVHcm91cHMuY29tPg=="},"prevInTopic":49972,"nextInTopic":50024,"prevInTime":50000,"nextInTime":50002,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"And we have our ... The Victoria Homelearners Network works much the same way except that we do have a print newsletter.  (The new editor is moi.)  Not","messageBody":"<div id=\"ygrps-yiv-975766969\">And we have our<br/>\n<blockquote><span title=\"ireply\"> &gt; 24/365 around the clock newsletter on yahoo!groups.  Much better than<br/>\n&gt; the old hard copy version that many other groups publish with<br/>\n&gt; deadlines that always miss something important, and the regulation of<br/>\n&gt; which often causes plenty of uproar, not to mention the high cost to<br/>\n&gt; members.  This new kind of totally inclusive home education support<br/>\n&gt; group can work and I hope that others will try it.  If you do please<br/>\n&gt; let me know how it works in your community.  This one has been going<br/>\n&gt; about 2-1/2 years now.<br/>\n<br/>\n </span></blockquote>The Victoria Homelearners Network works much the same way except that we do<br/>\nhave a print newsletter.  (The new editor is moi.)  Not everyone in our area<br/>\nhas internet access.  We do have a &quot;hotline&quot; for stuff that doesn&#39;t make the<br/>\nbi-monthly newsletter, and some folks have opted to get the newsletter in<br/>\npdf form by email.<br/>\n<br/>\nWe have no executive or regular meetings other than the newsletter meetings.<br/>\nPeople can and do organize regular support group meetings, and there are<br/>\ntons of activities organized.  My son doesn&#39;t take part mostly, but my<br/>\ngranddaughter is close to needing a daytimer for all the activities she<br/>\ntakes part in through the group.  She&#39;s taking ballet, drama, first aid,<br/>\nrenaissance dancing and probably a bunch of other stuff I can&#39;t remember<br/>\nright now.<br/>\nTia</div>","specialLinks":[]},{"userId":65172662,"authorName":"The White&#39;s","from":"&quot;The White&#39;s&quot; &lt;jwwjr@...&gt;","profile":"whitehouseacademy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A request","postDate":"1037548667","msgId":49972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzIwMWMyOGU1MiQxM2I4NDBlMCQyZWYyMGJkMEBiYjN0aDAxPg=="},"prevInTopic":49970,"nextInTopic":50001,"prevInTime":49971,"nextInTime":49973,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"Shellie, Almost exact same thing happened to us a couple of years ago.  We also were relatively new to the area and because we didn t attend church etc the","messageBody":"<div id=\"ygrps-yiv-2036052964\">Shellie,<br/>\nAlmost exact same thing happened to us a couple of years ago.  We also were relatively new to the area and because we didn&#39;t attend church etc the kids at the homeschool group were really all the kids we knew.  <br/>\n<br/>\nThose of us who quit the original group, or in my opinion were forced to leave, created our own group.  Yes, it&#39;s smaller.  But we&#39;re all also very close.  <br/>\n<br/>\nAre there others from your old, now exclusionist group, who have left?  Or folks your were especially close to in the old group who may not have left yet, but may?  Give them a call.<br/>\n<br/>\nGood luck,<br/>\nCindy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":45755436,"authorName":"susan marie","from":"susan marie &lt;scribblers2@...&gt;","profile":"scribblers2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037547397","msgId":49970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDNUM4NTY4LUZBNDItMTFENi1BREU4LTAwMzA2NUZCODJCOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDE2Ni4xNzI0ZjNkNC4yYjA2YzM0OEBjcy5jb20+"},"prevInTopic":49962,"nextInTopic":49972,"prevInTime":49969,"nextInTime":49971,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"I m the editor and past-pres of an inclusive group, but I think I m up-to-date both at NHEN and with Atlearn. I m checking on all of our contact links this","messageBody":"<div id=\"ygrps-yiv-623966268\">I&#39;m the editor and past-pres of an inclusive group, but I think I&#39;m <br/>\nup-to-date both at NHEN and with Atlearn. I&#39;m checking on all of our <br/>\ncontact links this week (I hope) so I&#39;ll check.<br/>\n<br/>\nWe&#39;re on the Delmarva peninsula,<br/>\nemail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:eshsa@...\">eshsa@...</a><br/>\nwebpage: (this is new. our old site decided to charge, and I haven&#39;t <br/>\nfinished putting up the new pages yet)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~eshsa/index.html\">http://home.earthlink.net/~eshsa/index.html</a><br/>\n<br/>\nhth,<br/>\nsusan<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Friday, November 15, 2002, at 04:38  PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> wrote:<br/>\n<br/>\n&gt; I already posted this at another list, so hopefully this isn&#39;t too <br/>\n&gt; repetative.<br/>\n&gt;<br/>\n&gt; I am trying to help Kent with the Atlearn map which will be a map of<br/>\n&gt; inclusive/alternative support groups over the whole world.,<br/>\n&gt; Currently, I need to help get contacts in every state, but apparently <br/>\n&gt; many of<br/>\n&gt; the groups at NHEN are no longer.<br/>\n&gt; If you are part of, or know of, an inclusive group in your state, PLEASE<br/>\n&gt; email me. I&#39;d deeply appreciate it.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n&gt; Unschooling support at pensacolaunschoolers.com<br/>\n&gt; And remember,<br/>\n&gt; &quot;A life lived in fear is a life half lived&quot;<br/>\n&gt;<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt; If you have questions, concerns or problems with this list, please <br/>\n&gt; email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the <br/>\n&gt; list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, click on the following link or address <br/>\n&gt; an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\npeace,<br/>\nSusan<br/>\n<br/>\n&quot;Peace is not merely a distant goal that we seek, but a means by which <br/>\nwe arrive at that goal.&quot;<br/>\n-- Martin Luther King, Jr.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":96795689,"authorName":"tuckervill@aol.com","from":"tuckervill@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037539096","msgId":49962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRkLjI3ODdkMWNjLjJiMDhmMTE4QGFvbC5jb20+"},"prevInTopic":49949,"nextInTopic":49970,"prevInTime":49961,"nextInTime":49963,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/2002 9:04:57 PM Central Standard Time, ... Sorry for taking all the credit.  I should have said helped start . I have Front Page now.","messageBody":"<div id=\"ygrps-yiv-183833053\">In a message dated 11/16/2002 9:04:57 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jwoolfolk@...\">jwoolfolk@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;&gt;&gt;&gt;<br/>\n&gt; This is the group I started in Little Rock about 5 years ago.  The website <br/>\n&gt; is <br/>\n&gt; mundane, but is serves its purpose.<br/>\n&gt; <br/>\n&gt; Tuck<br/>\n&gt; &lt;&lt;&lt;&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; HA<br/>\n&gt; That&#39;s an understatement.<br/>\n&gt; ;-)<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Sorry for taking all the credit.  I should have said &quot;helped start&quot;.  <br/>\n<br/>\nI have Front Page now.  I could really do it up for you, if you want.<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126289614,"authorName":"jwoolfolk","from":"&quot;jwoolfolk&quot; &lt;jwoolfolk@...&gt;","profile":"jwoolfolk@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037502434","msgId":49949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOWMwMWMyOGRlNiQ2ZmU1N2I2MCQzZWU2ODg0MkBzMDAyMzk0MDE5Mj4=","referencesHeader":"PDExNy4xYWQyMDgxMi4yYjA4NGVkNkBhb2wuY29tPg=="},"prevInTopic":49938,"nextInTopic":49962,"prevInTime":49948,"nextInTime":49950,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"... This is the group I started in Little Rock about 5 years ago.  The website is mundane, but is serves its purpose. Tuck ","messageBody":"<div id=\"ygrps-yiv-1023680944\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;<br/>\n </span></blockquote>This is the group I started in Little Rock about 5 years ago.  The website is <br/>\nmundane, but is serves its purpose.<br/>\n<br/>\nTuck<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nHA<br/>\nThat&#39;s an understatement.<br/>\n;-)<br/>\n<br/>\nJulie W in AR<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96795689,"authorName":"tuckervill@aol.com","from":"tuckervill@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037497558","msgId":49938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNy4xYWQyMDgxMi4yYjA4NGVkNkBhb2wuY29tPg=="},"prevInTopic":49937,"nextInTopic":49949,"prevInTime":49937,"nextInTime":49939,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/2002 7:41:23 PM Central Standard Time, ... ","messageBody":"<div id=\"ygrps-yiv-603169637\">In a message dated 11/16/2002 7:41:23 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill@...\">tuckervill@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes, and then email me the contact info.!!!  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/live-and-learn.geo/&quot;\">http://www.geocities.com/live-and-learn.geo/&quot;</a>&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/live-and-learn.geo/&lt;/A\">http://www.geocities.com/live-and-learn.geo/&lt;/A</a>&gt;<br/>\n<br/>\nThis is the group I started in Little Rock about 5 years ago.  The website is <br/>\nmundane, but is serves its purpose.<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96795689,"authorName":"tuckervill@aol.com","from":"tuckervill@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037497131","msgId":49937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4LjI4NmU3Mjg2LjJiMDg0ZDJiQGFvbC5jb20+"},"prevInTopic":49931,"nextInTopic":49938,"prevInTime":49936,"nextInTime":49938,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/2002 6:09:07 PM Central Standard Time, ... ","messageBody":"<div id=\"ygrps-yiv-1641936610\">In a message dated 11/16/2002 6:09:07 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes, and then email me the contact info.!!!  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/unschoolersofmemphis/&quot;\">http://www.geocities.com/unschoolersofmemphis/&quot;</a>&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/unschoolersofmemphis/&lt;/A\">http://www.geocities.com/unschoolersofmemphis/&lt;/A</a>&gt;<br/>\n<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A request","postDate":"1037491705","msgId":49931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZjLjI1Y2YxY2U1LjJiMDgzN2Y5QGNzLmNvbT4="},"prevInTopic":49927,"nextInTopic":49937,"prevInTime":49930,"nextInTime":49932,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/02 8:24:56 AM Central Standard Time, Unschooling-dotcom@yahoogroups.com writes:  Yes, and then email me the","messageBody":"<div id=\"ygrps-yiv-1618817262\">In a message dated 11/16/02 8:24:56 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; Start you own group!  &gt;&gt;<br/>\n<br/>\nYes, and then email me the contact info.!!!  Starting your own group can be <br/>\nvery rewarding.<br/>\n<br/>\nRen<br/>\nUnschooling support at pensacolaunschoolers.com<br/>\nAnd remember,<br/>\n&quot;A life lived in fear is a life half lived&quot;</div>","specialLinks":[]},{"userId":122926724,"authorName":"Rachel Ann","from":"Rachel Ann &lt;hindar@...&gt;","profile":"salixj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: A request","postDate":"1037489265","msgId":49927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMTgwMWMyOGRjNyRjNGE4N2Q2MCQwZTg5NTI0M0BBbm9saWNrRmFtaWx5Pg==","referencesHeader":"PGFyNWs5ZSs2MTY1QGVHcm91cHMuY29tPg=="},"prevInTopic":49891,"nextInTopic":49931,"prevInTime":49926,"nextInTime":49928,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"Now see, This makes me wish I were living in Cin city again...my home town! Grew up most of my life on Paddock Rd in bond hill... be well, Rachel Ann ... From:","messageBody":"<div id=\"ygrps-yiv-352691151\">Now see,<br/>\n<br/>\nThis makes me wish I were living in Cin city again...my home town!  <br/>\nGrew up most of my life on Paddock Rd in bond hill...<br/>\n<br/>\nbe well,<br/>\nRachel Ann<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: tessimal <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Saturday, November 16, 2002 9:21 AM<br/>\n  Subject: [Unschooling-dotcom] Re: A request<br/>\n<br/>\n<br/>\n  --- In Unschooling-dotcom@y..., Chelsnmikey@a... wrote:<br/>\n  &lt;&gt;We used to belong to a group here in Las Vegas, NV. Their name is <br/>\n  R.O.C.K, they claimed they were inclusive. But, they weren&#39;t.&lt;&gt; <br/>\n<br/>\n  Shellie:<br/>\n<br/>\n  We had a similar experience when we moved about 5 years ago.  We <br/>\n  hooked up with a group that touted itself as totally inclusive.  <br/>\n  Turned out that their version of &quot;inclusion&quot; was precipitated by lots <br/>\n  of unwritten rules and lots of group precedents that no one but a <br/>\n  few &quot;old timers&quot; knew about, that could be pulled out at will to <br/>\n  manipulate anyone and any situation they chose to manipulate.  And <br/>\n  there were all kinds of secret meetings, in back rooms and vans in  <br/>\n  parking lots, meetings on nights when no one could or, as it <br/>\n  eventually turned out, no one wanted to attend, at which the same <br/>\n  kinds of exclusionary power-wielding decisions were made.  <br/>\n<br/>\n  So, I started a new group, a non-directed community-based home <br/>\n  education support group.  This group has no dues, no heirarchy, no <br/>\n  regular meetings, no exclusions at all.  The only rule is &quot;no <br/>\n  spamming.&quot;  Folks sign themselves up by joining the yahoo group, <br/>\n  which has open membership.  Everyone is equally free to post info <br/>\n  about events and activities, resources, play groups, meetings on <br/>\n  topics, and anything else they think applies.  <br/>\n<br/>\n  In our case religion and race were among the excluding factors, and <br/>\n  then, ultimately, the fact that I wouldn&#39;t just leave quietly and <br/>\n  take what they were dishing out under the veil of &quot;inclusion.&quot;  I <br/>\n  became that terrible person who just would not shut up and go away, <br/>\n  as many had before me, instead holding their feet to the fire of <br/>\n  their &quot;inclusive&quot; claim.  But the exlcusion continued, peaking in <br/>\n  some members of this group holding a teen homeschool prom and, after <br/>\n  heated secret discussion (meaning I wasn&#39;t in on in any of this) I <br/>\n  was informed that my daughter would not be allowed to attend their <br/>\n  prom.  Errr, umm, by the way, who said she was interested in the <br/>\n  first place?  She already had dates for three other formal dances and <br/>\n  definitely was not interested, but this group was so determined to <br/>\n  keep her away from their kids and their prom that they held meetings, <br/>\n  made up lies, and ultimately had one mother meet with me, under a <br/>\n  false pretense, then later email me to tell me that &quot;they&quot; had <br/>\n  decided that my daughter would not be allowed to attend this prom.  <br/>\n<br/>\n  Why?  No one had to give an answer to that.  But we know it wasn&#39;t <br/>\n  because my daughter was some terrible misbehaving delinquent teen.  <br/>\n  She is a lovely, dedicated, hard-working young woman, a competitive <br/>\n  figure skater who skates 2-4 hours daily, involved in lots of other <br/>\n  great volunteer activities, as well as working at a part-time job.  <br/>\n  The only &quot;crime&quot; she may have committed was being born into a bi-<br/>\n  racial low-income family.  Surely it couldn&#39;t be that, could it?  <br/>\n<br/>\n  Oh, and she was born to a mother who doesn&#39;t take it lying down, <br/>\n  doesn&#39;t just roll over and play dead when folks start wielding power <br/>\n  abusively.  So most likely their reasons for excluding my daughter <br/>\n  were either that she is bi-racial (in case folks don&#39;t know, racism <br/>\n  is illegal, and not nice!), or because her mother is a strong <br/>\n  individual who doesn&#39;t just back down and go away when folks are <br/>\n  behaving badly, violating their own rules, making up new ones to fit <br/>\n  every situation they don&#39;t like, engaging in libel and slander, and <br/>\n  so on.<br/>\n<br/>\n  Okay, so now it&#39;s a long story, I know.  But the end result has been <br/>\n  a wonderful new kind of group, that anyone can join whenever they <br/>\n  please, and leave whenever they please, too.  All approaches to <br/>\n  learning are welcomed, all religions or no religion accepted, all <br/>\n  kinds of activities and events are promoted, and all kinds of topics <br/>\n  discussed on the e-list.  We just finished up a week or so on gun <br/>\n  control after a group of us went to see Michael Moore&#39;s &quot;Bowling For <br/>\n  Columbine,&quot; and no one flamed or slammed or dissed anyone, though <br/>\n  opinions ran the gamut, to be sure.  I learned a lot.  What a great <br/>\n  group!  We are now about 200 strong and I believe this group will <br/>\n  continue to grow and proper long after I am gone.  <br/>\n<br/>\n  So, start your own.  I started this one all by myself, as an outcast, <br/>\n  and slowly but surely, more and more families have joined, and are <br/>\n  still joining, every single day.  A new kind of group, with no one in <br/>\n  charge, no rules to waste hours and hours meeting to create or to <br/>\n  break, no purpose but to find and share interesting stuff with each <br/>\n  other that we feel might be of interest to other home educators.   <br/>\n<br/>\n  And there are some group perks, too.  Since I am a certified teacher <br/>\n  I offer a free group &quot;portfolio assessment&quot; day to all group members <br/>\n  who join before Jan 1st of any year, and who remain members through <br/>\n  the assessment date.  And lots of others find or organize and promote <br/>\n  lots of wonderful activities and events and resources for our <br/>\n  children and families.  All great group perks!  And we have our <br/>\n  24/365 around the clock newsletter on yahoo!groups.  Much better than <br/>\n  the old hard copy version that many other groups publish with <br/>\n  deadlines that always miss something important, and the regulation of <br/>\n  which often causes plenty of uproar, not to mention the high cost to <br/>\n  members.  This new kind of totally inclusive home education support <br/>\n  group can work and I hope that others will try it.  If you do please <br/>\n  let me know how it works in your community.  This one has been going <br/>\n  about 2-1/2 years now.<br/>\n<br/>\n  Say &quot;yes&quot; to total inclusion, and &quot;no&quot; to all forms of exclusion!  By <br/>\n  the way, many who join our group also belong to other little groups, <br/>\n  some of which are religion specific, or locality specific, or <br/>\n  educational philosophy specific.  No matter, all are welcome!<br/>\n<br/>\n  Norma<br/>\n  CATCH/Cincinnati Area Teaching Children at Home<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/SosinkyHS\">http://groups.yahoo.com/group/SosinkyHS</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":48651385,"authorName":"tessimal","from":"&quot;tessimal&quot; &lt;tessimal@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A request","postDate":"1037456494","msgId":49891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFyNWs5ZSs2MTY1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU0LjI1ZTZhYTIuMmIwNzYxZmFAYW9sLmNvbT4="},"prevInTopic":49887,"nextInTopic":49927,"prevInTime":49890,"nextInTime":49892,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"... We used to belong to a group here in Las Vegas, NV. Their name is R.O.C.K, they claimed they were inclusive. But, they weren t. Shellie: We had a","messageBody":"<div id=\"ygrps-yiv-1849652637\"><blockquote><span title=\"qreply\">--- In Unschooling-dotcom@y..., Chelsnmikey@a... wrote:<br/>\n&lt;&gt;We used to belong to a group here in Las Vegas, NV. Their name is <br/>\nR.O.C.K, they claimed they were inclusive. But, they weren&#39;t.&lt;&gt; <br/>\n<br/>\nShellie:<br/>\n<br/>\nWe had a similar experience when we moved about 5 years ago.  We <br/>\nhooked up with a group that touted itself as totally inclusive.  <br/>\nTurned out that their version of &quot;inclusion&quot; was precipitated by lots <br/>\nof unwritten rules and lots of group precedents that no one but a <br/>\nfew &quot;old timers&quot; knew about, that could be pulled out at will to <br/>\nmanipulate anyone and any situation they chose to manipulate.  And <br/>\nthere were all kinds of secret meetings, in back rooms and vans in  <br/>\nparking lots, meetings on nights when no one could or, as it <br/>\neventually turned out, no one wanted to attend, at which the same <br/>\nkinds of exclusionary power-wielding decisions were made.  <br/>\n<br/>\nSo, I started a new group, a non-directed community-based home <br/>\neducation support group.  This group has no dues, no heirarchy, no <br/>\nregular meetings, no exclusions at all.  The only rule is &quot;no <br/>\nspamming.&quot;  Folks sign themselves up by joining the yahoo group, <br/>\nwhich has open membership.  Everyone is equally free to post info <br/>\nabout events and activities, resources, play groups, meetings on <br/>\ntopics, and anything else they think applies.  <br/>\n<br/>\nIn our case religion and race were among the excluding factors, and <br/>\nthen, ultimately, the fact that I wouldn&#39;t just leave quietly and <br/>\ntake what they were dishing out under the veil of &quot;inclusion.&quot;  I <br/>\nbecame that terrible person who just would not shut up and go away, <br/>\nas many had before me, instead holding their feet to the fire of <br/>\ntheir &quot;inclusive&quot; claim.  But the exlcusion continued, peaking in <br/>\nsome members of this group holding a teen homeschool prom and, after <br/>\nheated secret discussion (meaning I wasn&#39;t in on in any of this) I <br/>\nwas informed that my daughter would not be allowed to attend their <br/>\nprom.  Errr, umm, by the way, who said she was interested in the <br/>\nfirst place?  She already had dates for three other formal dances and <br/>\ndefinitely was not interested, but this group was so determined to <br/>\nkeep her away from their kids and their prom that they held meetings, <br/>\nmade up lies, and ultimately had one mother meet with me, under a <br/>\nfalse pretense, then later email me to tell me that &quot;they&quot; had <br/>\ndecided that my daughter would not be allowed to attend this prom.  <br/>\n<br/>\nWhy?  No one had to give an answer to that.  But we know it wasn&#39;t <br/>\nbecause my daughter was some terrible misbehaving delinquent teen.  <br/>\nShe is a lovely, dedicated, hard-working young woman, a competitive <br/>\nfigure skater who skates 2-4 hours daily, involved in lots of other <br/>\ngreat volunteer activities, as well as working at a part-time job.  <br/>\nThe only &quot;crime&quot; she may have committed was being born into a bi-<br/>\nracial low-income family.  Surely it couldn&#39;t be that, could it?  <br/>\n<br/>\nOh, and she was born to a mother who doesn&#39;t take it lying down, <br/>\ndoesn&#39;t just roll over and play dead when folks start wielding power <br/>\nabusively.  So most likely their reasons for excluding my daughter <br/>\nwere either that she is bi-racial (in case folks don&#39;t know, racism <br/>\nis illegal, and not nice!), or because her mother is a strong <br/>\nindividual who doesn&#39;t just back down and go away when folks are <br/>\nbehaving badly, violating their own rules, making up new ones to fit <br/>\nevery situation they don&#39;t like, engaging in libel and slander, and <br/>\nso on.<br/>\n<br/>\nOkay, so now it&#39;s a long story, I know.  But the end result has been <br/>\na wonderful new kind of group, that anyone can join whenever they <br/>\nplease, and leave whenever they please, too.  All approaches to <br/>\nlearning are welcomed, all religions or no religion accepted, all <br/>\nkinds of activities and events are promoted, and all kinds of topics <br/>\ndiscussed on the e-list.  We just finished up a week or so on gun <br/>\ncontrol after a group of us went to see Michael Moore&#39;s &quot;Bowling For <br/>\nColumbine,&quot; and no one flamed or slammed or dissed anyone, though <br/>\nopinions ran the gamut, to be sure.  I learned a lot.  What a great <br/>\ngroup!  We are now about 200 strong and I believe this group will <br/>\ncontinue to grow and proper long after I am gone.  <br/>\n<br/>\nSo, start your own.  I started this one all by myself, as an outcast, <br/>\nand slowly but surely, more and more families have joined, and are <br/>\nstill joining, every single day.  A new kind of group, with no one in <br/>\ncharge, no rules to waste hours and hours meeting to create or to <br/>\nbreak, no purpose but to find and share interesting stuff with each <br/>\nother that we feel might be of interest to other home educators.   <br/>\n<br/>\nAnd there are some group perks, too.  Since I am a certified teacher <br/>\nI offer a free group &quot;portfolio assessment&quot; day to all group members <br/>\nwho join before Jan 1st of any year, and who remain members through <br/>\nthe assessment date.  And lots of others find or organize and promote <br/>\nlots of wonderful activities and events and resources for our <br/>\nchildren and families.  All great group perks!  And we have our <br/>\n24/365 around the clock newsletter on yahoo!groups.  Much better than <br/>\nthe old hard copy version that many other groups publish with <br/>\ndeadlines that always miss something important, and the regulation of <br/>\nwhich often causes plenty of uproar, not to mention the high cost to <br/>\nmembers.  This new kind of totally inclusive home education support <br/>\ngroup can work and I hope that others will try it.  If you do please <br/>\nlet me know how it works in your community.  This one has been going <br/>\nabout 2-1/2 years now.<br/>\n<br/>\nSay &quot;yes&quot; to total inclusion, and &quot;no&quot; to all forms of exclusion!  By <br/>\nthe way, many who join our group also belong to other little groups, <br/>\nsome of which are religion specific, or locality specific, or <br/>\neducational philosophy specific.  No matter, all are welcome!<br/>\n<br/>\nNorma<br/>\nCATCH/Cincinnati Area Teaching Children at Home<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/SosinkyHS\">http://groups.yahoo.com/group/SosinkyHS</a> </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037453277","msgId":49887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhhLjIxM2ZjMjZkLjJiMDdhMWRkQGFvbC5jb20+"},"prevInTopic":49885,"nextInTopic":49891,"prevInTime":49886,"nextInTime":49888,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/02 1:56:27 AM, Chelsnmikey@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-627963338\">In a message dated 11/16/02 1:56:27 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Chelsnmikey@...\">Chelsnmikey@...</a> writes:<br/>\n<br/>\n&lt;&lt; So we <br/>\nquit the group. I felt bad for my kids, because other than those children, <br/>\nmine knew of no one else that homeschooled, unschooled or anything of the <br/>\nsort.  &gt;&gt;<br/>\n<br/>\nBut having been in the group, didn&#39;t you pick up names and phone numbers?  <br/>\nCan&#39;t you have doings at your house or at a park so that you stay in contact <br/>\nwith those families you want to stay in with?  And surely you would pick up <br/>\nothers along the way.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037448140","msgId":49885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MS4yY2VmNjJiLjJiMDc4ZGNjQGFvbC5jb20+"},"prevInTopic":49882,"nextInTopic":49887,"prevInTime":49884,"nextInTime":49886,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/2002 3:55:58 AM Eastern Standard Time, ... Shellie, Start you own group! There will be several others like you who feel short-changed!","messageBody":"<div id=\"ygrps-yiv-1879665557\">In a message dated 11/16/2002 3:55:58 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Chelsnmikey@...\">Chelsnmikey@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; I felt bad for my kids, because other than those children, <br/>\n&gt; mine knew of no one else that homeschooled, unschooled or anything of the <br/>\n&gt; sort. So now we are in search of a group that truely doesn&#39;t care about the <br/>\n&gt; <br/>\n&gt; reasons why we homeschool, just that we do.<br/>\n<br/>\n </span></blockquote>Shellie,<br/>\n<br/>\nStart you own group! There will be several others like you who feel <br/>\nshort-changed! Make it a free online group (msn, yahoo, whatever). Only <br/>\nunschoolers or only secular or totally, really inclusive. You can make it <br/>\nyour own with your own rules (or lack of! &lt;g&gt;). You&#39;d be surprised how many <br/>\nwill come out of the woodwork--I&#39;m sure there are many others in the area <br/>\nwith the same feelings.<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78739370,"authorName":"Chelsnmikey@aol.com","from":"Chelsnmikey@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037436922","msgId":49882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0LjI1ZTZhYTIuMmIwNzYxZmFAYW9sLmNvbT4="},"prevInTopic":49868,"nextInTopic":49885,"prevInTime":49881,"nextInTime":49883,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"We used to belong to a group here in Las Vegas, NV. Their name is R.O.C.K, they claimed they were inclusive. But, they weren t. When I told them that we ","messageBody":"<div id=\"ygrps-yiv-343632863\">We used to belong to a group here in Las Vegas, NV. Their name is R.O.C.K, <br/>\nthey claimed they were inclusive. But, they weren&#39;t. When I told them that we <br/>\nweren&#39;t religious, and weren&#39;t homeschooling for those reasons, they said, <br/>\n&quot;that is fine, we would love to have you and your children join our group.&quot; <br/>\nWell, things ended up being pretty hard for us, and them. To make a long <br/>\nstory short, last month the moderator of the group was asked to leave for <br/>\nprivate reasons. Another moderator was picked. This group was supposed to <br/>\nmake decisions as a group, however this was done on a night where there <br/>\nweren&#39;t more than four families together. They changed many of the &quot;rules&quot; in <br/>\nthe &quot;middle of the game&quot;. Then they decided that if you weren&#39;t religious and <br/>\ncouldn&#39;t make each and every one of the events/activities, you shouldn&#39;t be <br/>\nallowed to be part of the group. Forget about the e-loop, which for many of <br/>\nus moms was a tremendous help, they also decided that it was no longer <br/>\nallowed to be involved in the e-loop if you weren&#39;t an &quot;active member&quot;. So we <br/>\nquit the group. I felt bad for my kids, because other than those children, <br/>\nmine knew of no one else that homeschooled, unschooled or anything of the <br/>\nsort. So now we are in search of a group that truely doesn&#39;t care about the <br/>\nreasons why we homeschool, just that we do.<br/>\n  Ok, sorry I lied. That wasn&#39;t a short story after all was it?? LOL!<br/>\n      Shellie</div>","specialLinks":[]},{"userId":24323633,"authorName":"Laura Gates-Lupton","from":"Laura Gates-Lupton &lt;laura_gates@...&gt;","profile":"Laura_Gates","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037412920","msgId":49868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMTE2MDIxNTIwLjQ0NzYzLnFtYWlsQHdlYjEyMTA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDE2Ni4xNzI0ZjNkNC4yYjA2YzM0OEBjcy5jb20+"},"prevInTopic":49865,"nextInTopic":49882,"prevInTime":49867,"nextInTime":49869,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"By inclusive is it correct to  assume that you mean groups that welcome members regardless of homeschooling approach, religious or political affiliation?  If","messageBody":"<div id=\"ygrps-yiv-1285163416\">By inclusive is it correct to  assume that you mean groups that welcome members regardless of homeschooling approach, religious or political affiliation?  If so, I belong to one in Rhode Island.<br/>\nLaura<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> wrote:I already posted this at another list, so hopefully this isn&#39;t too repetative.<br/>\n<br/>\nI am trying to help Kent with the Atlearn map which will be a map of <br/>\ninclusive/alternative support groups over the whole world.,<br/>\nCurrently, I need to help get contacts in every state, but apparently many of <br/>\nthe groups at NHEN are no longer.<br/>\nIf you are part of, or know of, an inclusive group in your state, PLEASE <br/>\nemail me. I&#39;d deeply appreciate it.<br/>\n<br/>\nRen<br/>\nUnschooling support at pensacolaunschoolers.com<br/>\nAnd remember,<br/>\n&quot;A life lived in fear is a life half lived&quot;<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\nvar lrec_target=&quot;_top&quot;;var lrec_URL = new Array();lrec_URL[1] = &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=233351.2658116.4039490.1925585/D=egroupweb/S=1705081972:HM/A=1261186/R=0/id=flashurl/*https://www.gotomypc.com/tr/yh/grp/300_08F/g22lp?Target=mm/g22lp.tmpl&quot;;var\">http://rd.yahoo.com/M=233351.2658116.4039490.1925585/D=egroupweb/S=1705081972:HM/A=1261186/R=0/id=flashurl/*https://www.gotomypc.com/tr/yh/grp/300_08F/g22lp?Target=mm/g22lp.tmpl&quot;;var</a> link=&quot;javascript:LRECopenWindow(1)&quot;;var lrec_flashfile = &#39;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.a1.yimg.com/us.yimg.com/a/1-/flash/expert_city/093002_weather300x250_08f.swf?clickTAG=&#39;+link+&#39;&#39;;var\">http://us.a1.yimg.com/us.yimg.com/a/1-/flash/expert_city/093002_weather300x250_08f.swf?clickTAG=&#39;+link+&#39;&#39;;var</a> lrec_altURL = &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=233351.2658116.4039490.1925585/D=egroupweb/S=1705081972:HM/A=1261186/R=1/id=altimgurl/*https://www.gotomypc.com/tr/yh/grp/300_08F/g22lp?Target=mm/g22lp.tmpl&quot;;var\">http://rd.yahoo.com/M=233351.2658116.4039490.1925585/D=egroupweb/S=1705081972:HM/A=1261186/R=1/id=altimgurl/*https://www.gotomypc.com/tr/yh/grp/300_08F/g22lp?Target=mm/g22lp.tmpl&quot;;var</a> lrec_altimg = &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.a1.yimg.com/us.yimg.com/a/1-/flash/expert_city/093002_weather300x250_map.gif&quot;;var\">http://us.a1.yimg.com/us.yimg.com/a/1-/flash/expert_city/093002_weather300x250_map.gif&quot;;var</a> lrec_width = 300;var lrec_height = 250;<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\nTo unsubscribe from this group, click on the following link or address an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Web Hosting - Let the expert host your site<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037404125","msgId":49865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY2M3Y5bkRxVVY0cVVseXVueHQwMDAwYjRjNkBob3RtYWlsLmNvbT4="},"prevInTopic":49864,"nextInTopic":49868,"prevInTime":49864,"nextInTime":49866,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"Ren, The group I belong to here in S. FL is totally inclusive. Mary B _________________________________________________________________ The new MSN 8: smart","messageBody":"<div id=\"ygrps-yiv-755436827\">Ren,<br/>\n<br/>\nThe group I belong to here in S. FL is totally inclusive.<br/>\n<br/>\nMary B<br/>\n<br/>\n_________________________________________________________________<br/>\nThe new MSN 8: smart spam protection and 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a></div>","specialLinks":[]},{"userId":88778760,"authorName":"Debi Watson","from":"Debi Watson &lt;debiwatson@...&gt;","profile":"sheplusthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"1037400007","msgId":49864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzcwMWMyOGNmNyRmMjgxZDE4MCQxYWE0NTYxOEBlZC5zaGF3Y2FibGUubmV0Pg==","referencesHeader":"PDE2Ni4xNzI0ZjNkNC4yYjA2YzM0OEBjcy5jb20+"},"prevInTopic":49863,"nextInTopic":49865,"prevInTime":49863,"nextInTime":49865,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"I know we aren t formally a State YET (snicker) but is he looking for contacts in Canada as well?   Debi ... of","messageBody":"<div id=\"ygrps-yiv-1343273345\">I know we aren&#39;t formally a State YET (snicker) but is he looking for<br/>\ncontacts in Canada as well?   Debi<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am trying to help Kent with the Atlearn map which will be a map of<br/>\n&gt; inclusive/alternative support groups over the whole world.,<br/>\n&gt; Currently, I need to help get contacts in every state, but apparently many<br/>\n </span></blockquote>of<br/>\n<blockquote><span title=\"qreply\"> &gt; the groups at NHEN are no longer.<br/>\n&gt; If you are part of, or know of, an inclusive group in your state, PLEASE<br/>\n&gt; email me. I&#39;d deeply appreciate it.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A request","postDate":"1037396296","msgId":49863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Ni4xNzI0ZjNkNC4yYjA2YzM0OEBjcy5jb20+"},"prevInTopic":20648,"nextInTopic":49864,"prevInTime":49862,"nextInTime":49864,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"I already posted this at another list, so hopefully this isn t too repetative. I am trying to help Kent with the Atlearn map which will be a map of ","messageBody":"<div id=\"ygrps-yiv-1225747765\">I already posted this at another list, so hopefully this isn&#39;t too repetative.<br/>\n<br/>\nI am trying to help Kent with the Atlearn map which will be a map of <br/>\ninclusive/alternative support groups over the whole world.,<br/>\nCurrently, I need to help get contacts in every state, but apparently many of <br/>\nthe groups at NHEN are no longer.<br/>\nIf you are part of, or know of, an inclusive group in your state, PLEASE <br/>\nemail me. I&#39;d deeply appreciate it.<br/>\n<br/>\nRen<br/>\nUnschooling support at pensacolaunschoolers.com<br/>\nAnd remember,<br/>\n&quot;A life lived in fear is a life half lived&quot;</div>","specialLinks":[]},{"userId":0,"authorName":"DiamondAir","from":"&quot;DiamondAir&quot; &lt;diamondair@...&gt;","replyTo":"LIST","senderId":"8wVKZa7dZSRSemX8t1KPkhvLq0BOhNkx5b3_Z33vZDf9hYvWH9IMYMbM0UjxbC1wK06GxoWJ9oI2zwrE0J97hE4hA6o67mFKG0DJYESn","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A request","postDate":"989128174","msgId":20648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTYwMWMwZDVmMCQ1NGQzYWUwMCRmOGRjMGUzZkA4MzhmMzAxPg==","referencesHeader":"PDk4OTEyNDkzMC4xNjg2My4xMDQ1NC5sOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":20638,"nextInTopic":49863,"prevInTime":20647,"nextInTime":20649,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"From: Judie C. Rall  ... Me too, and I m glad she didn t take it that way either. I definitely didn t mean that. ... Not if you get the","messageBody":"<div id=\"ygrps-yiv-875641700\">From: &quot;Judie C. Rall&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:adonai@...\">adonai@...</a>&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;Personally, I love Valerie&#39;s posts and hope she doesn&#39;t stop.<br/>\n<br/>\n </span></blockquote>Me too, and I&#39;m glad she didn&#39;t take it that way either. I definitely didn&#39;t<br/>\nmean that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It is very easy to delete those posts you don&#39;t<br/>\n&gt;want to read by looking at the subject line, so that you don&#39;t have<br/>\n&gt;to read them all and can keep up with those subjects you are<br/>\n&gt;interested in.<br/>\n<br/>\n<br/>\n </span></blockquote>Not if you get the list in digest form. I&#39;m on far too many lists to get<br/>\nthem as individual messages. In the digest, you have to scroll through them<br/>\nall to see what each one is, and scroll through all the included text as<br/>\nwell. That&#39;s all I was saying.<br/>\n<br/>\n Blue Skies!<br/>\n   -Robin-<br/>\nMom to Mackenzie (8/28/96) who has a best friend named &quot;Eiznekcam&quot;<br/>\nand Asa (10/5/99) the girl who climbs everything!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>   Flying Clevenger Family</div>","specialLinks":[]},{"userId":0,"authorName":"tonitoni@zfree.co.nz","from":"tonitoni@...","replyTo":"LIST","senderId":"jqnI40kzIDbqu3Zjx5ZPwAi0RG1xkV_LlygzHzAKBS3YDDMxTndQwpy2MFNHtYHPGpYXYqveTh-t_1s","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A request","postDate":"989120066","msgId":20638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkMmdvMis1cGdrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlkMXI5NCtnNGo1QGVHcm91cHMuY29tPg=="},"prevInTopic":20624,"nextInTopic":20648,"prevInTime":20637,"nextInTime":20639,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"... room ... Oh no!! please dont desert us.  I come here every day to look for your posts.   You are giving me so much more confidence in what we are doing.","messageBody":"<div id=\"ygrps-yiv-266205463\"><blockquote><span title=\"ireply\">&gt; I&#39;m also responding to a lot of personal email. Those are really <br/>\n&gt; tugging at my heart and maybe I&#39;ll give you guys some breathing <br/>\n </span></blockquote>room <br/>\n<blockquote><span title=\"ireply\"> &gt; and concentrate on them more. :-)<br/>\n&gt; <br/>\n&gt; love, Valerie<br/>\n<br/>\n </span></blockquote>Oh no!! please dont desert us.  I come here every day to look for <br/>\nyour posts.   You are giving me so much more confidence in what we <br/>\nare doing.  If you desert the boards, you have to email me every day <br/>\nprivetly.   Sorry!!<br/>\n<br/>\nmarianne</div>","specialLinks":[]},{"userId":0,"authorName":"lite2yu@aol.com","from":"lite2yu@...","replyTo":"LIST","senderId":"j95im6bGVbSOxty4PW1PEVFADV2E-_WtkQJCBweoO6n3tf9wUL3TLo7_NElyLHVLRP-8z7IR","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"989107497","msgId":20619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2LmViNTQ5NTcuMjgyNWVmMjlAYW9sLmNvbT4="},"prevInTopic":20617,"nextInTopic":20624,"prevInTime":20618,"nextInTime":20620,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"At the risk of just saying I agree with you here and being redundant, I would like to add that I believe this is a good point and would welcome that as well.","messageBody":"<div id=\"ygrps-yiv-1034400328\">At the risk of just saying I agree with you here and being redundant, I would <br/>\nlike to add that I believe this is a good point and would welcome that as <br/>\nwell. This morning I deleted at least 50 emails from this list because I just <br/>\ncannot keep up with it all and most of the posts were seeming to be <br/>\nredundant. (and I mean no disrespect to anyone)<br/>\n<br/>\nlovemary<br/>\nIf you wanna make the world a better place, take a look at yourself, and then <br/>\nmake a change.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"LASaliger@aol.com","from":"LASaliger@...","replyTo":"LIST","senderId":"7ktTMV66SHAEPu8r_0KsY22AnKdyzMflaCWizBWqgU7saYBUEmfMBCbtOcbLRBw6XUFe349djM0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: A request","postDate":"989103576","msgId":20617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNkLmI0MjlkMzguMjgyNWRmZDhAYW9sLmNvbT4="},"prevInTopic":20612,"nextInTopic":20619,"prevInTime":20616,"nextInTime":20618,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/5/01 2:29:12 PM Pacific Daylight Time, valfitz@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-641228003\">In a message dated 5/5/01 2:29:12 PM Pacific Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:valfitz@...\">valfitz@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt;  maybe I&#39;ll give you guys some breathing room <br/>\n and concentrate on them more. :-)<br/>\n <br/>\n love, Valerie &gt;&gt;<br/>\n<br/>\n     Valerie, just please don&#39;t go to the other extreme!  I am enjoying your <br/>\nposts!  Your story about how Laurie grew up and what she is doing now is very <br/>\nencouraging and needed.  I have even told a few people I know about this <br/>\nrecently and it definitely catches people&#39;s attention.  My sister, who just <br/>\nhad twin babies in Jan., is unsure about what she will do in the future as <br/>\nfar as homeschooling or not.  When I told her about your book, she said she <br/>\ndefinitely wants to read it when it comes out!  Anyway, just wanted to let <br/>\nyou know that your posts are great.  <br/>\n<br/>\n       Lucy</div>","specialLinks":[]},{"userId":0,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valfitz@...&gt;","replyTo":"LIST","senderId":"SwwiBSsfNuFYPBuEUQPMlQO5quANjyWMgXhYuC_B2I_ouA8uuC0YxjsjvfcBanWuBloKTy71jVQQUEbTG-BYz37SdTI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A request","postDate":"989098084","msgId":20612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkMXI5NCtnNGo1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTUwMWMwZDU3NCRjZjdhNWY0MCQ0ZGQzMGUzZkA4MzhmMzAxPg=="},"prevInTopic":20582,"nextInTopic":20617,"prevInTime":20611,"nextInTime":20613,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"Robin, Thank you for wishing me well on the book... I was aware that I was posting a lot, but struggling with whether or not I should ignore something directed","messageBody":"<div id=\"ygrps-yiv-681720317\">Robin, Thank you for wishing me well on the book... <br/>\n<br/>\nI was aware that I was posting a lot, but struggling with whether or <br/>\nnot I should ignore something directed at me or not. I appreciate you <br/>\npointing this out to me and I am not offended. A club I was in before <br/>\nwas a bit smaller and every little post was wanted. I&#39;ll clip from <br/>\nnow on. The last thing I want is for voices to go silent. I didn&#39;t <br/>\nmiss those voices, because I didn&#39;t read back past where I joined. I <br/>\napologize to anyone that has been overwhelmed by my posting. Frankly, <br/>\nI was trying to figure out how to word a post saying I couldn&#39;t post <br/>\nso much anymore. The book is needing the finishing touches and my <br/>\ntime is limited. <br/>\n<br/>\nI&#39;m also responding to a lot of personal email. Those are really <br/>\ntugging at my heart and maybe I&#39;ll give you guys some breathing room <br/>\nand concentrate on them more. :-)<br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]},{"userId":0,"authorName":"Judie C. Rall","from":"&quot;Judie C. Rall&quot; &lt;adonai@...&gt;","replyTo":"LIST","senderId":"NLLC7LpA2892n2c2-hLsEPzeHvbiIQYyIm6VL65A5zPlSITTIKHS_CzVwW737Ye_z7p6siWPWcmB2_0sAtAbaLSs2reiZbCP-135","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] A request","postDate":"989091993","msgId":20624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTA2MDA0MS5mNDYwZklKMDg5NThAbWFpbC5zaXJpbmV0Lm5ldD4=","inReplyToHeader":"PDAwMTUwMWMwZDU3NCRjZjdhNWY0MCQ0ZGQzMGUzZkA4MzhmMzAxPg=="},"prevInTopic":20619,"nextInTopic":20638,"prevInTime":20623,"nextInTime":20625,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"... down. Personally, I love Valerie s posts and hope she doesn t stop. Having a lot of posts has not kept me from posting, but has encouraged me.  Personally,","messageBody":"<div id=\"ygrps-yiv-1674511389\"><blockquote><span title=\"ireply\">&gt; All that being said, this is a list of many, many people including some<br/>\n&gt; neophyte unschoolers, and many experienced voices as well. I value it highly<br/>\n&gt; because there is usually an abundance of varying opinions to be found.<br/>\n&gt; People on the list contribute to subjects that they find they have info and<br/>\n&gt; expertise on, and with hundreds of people on the list, that means we get a<br/>\n&gt; wide variety of voices to hear and topics of discussion. When any one person<br/>\n&gt; posts so many posts, then other voices start to go silent. People can no<br/>\n&gt; longer keep up with the number of posts and discussions die <br/>\n </span></blockquote>down. <br/>\n<br/>\nPersonally, I love Valerie&#39;s posts and hope she doesn&#39;t stop.  <br/>\nHaving a lot of posts has not kept me from posting, but has <br/>\nencouraged me.  Personally, the thing I need most is the <br/>\nreassurance that when your kids grow up, they will not have been <br/>\ndamaged by unschooling, and that is what I am getting from <br/>\nValerie&#39;s posts.  It is very easy to delete those posts you don&#39;t <br/>\nwant to read by looking at the subject line, so that you don&#39;t have <br/>\nto read them all and can keep up with those subjects you are <br/>\ninterested in.  <br/>\n<br/>\nJust my two cents also.<br/>\n<br/>\nJudie</div>","specialLinks":[]},{"userId":0,"authorName":"DiamondAir","from":"&quot;DiamondAir&quot; &lt;diamondair@...&gt;","replyTo":"LIST","senderId":"wk6E1iZm7ttxstk9w4v29bmI0L6hQQ9_dPUyYX-G5QK0oQDvNjz0wO_XCDmkFEC3MxdcpVkBqqoKdCxC_oknPYakzb9_725WzuYHgtuT","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A request","postDate":"989075121","msgId":20582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTUwMWMwZDU3NCRjZjdhNWY0MCQ0ZGQzMGUzZkA4MzhmMzAxPg==","referencesHeader":"PDk4OTA0MjM5Ny4xNTQxLjY3NTIwLmw2QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":20612,"prevInTime":20581,"nextInTime":20583,"topicId":20582,"numMessagesInTopic":0,"msgSnippet":"OK, I don t know how to say this and have it come across right. First of all, welcome to the list Valerie, I ve found some of your posts really insightful and","messageBody":"<div id=\"ygrps-yiv-784541036\">OK, I don&#39;t know how to say this and have it come across right. First of<br/>\nall, welcome to the list Valerie, I&#39;ve found some of your posts really<br/>\ninsightful and it is always very interesting for me (especially as the mom<br/>\nof only young kids) to hear from moms who have seen the Unschooling  journey<br/>\nfrom start to end. I wish you well with your book and hope it comes to be!<br/>\nYou and Laurie obviously have an interesting story to tell.<br/>\n<br/>\nAll that being said, this is a list of many, many people including some<br/>\nneophyte unschoolers, and many experienced voices as well. I value it highly<br/>\nbecause there is usually an abundance of varying opinions to be found.<br/>\nPeople on the list contribute to subjects that they find they have info and<br/>\nexpertise on, and with hundreds of people on the list, that means we get a<br/>\nwide variety of voices to hear and topics of discussion. When any one person<br/>\nposts so many posts, then other voices start to go silent. People can no<br/>\nlonger keep up with the number of posts and discussions die down. It&#39;s good<br/>\nnetiquette not to respond to every single post as if it is a personal email.<br/>\nLately, 20 or more out of 25 posts in several digests were from one person.<br/>\nAnd each post had  a long stream of the previous posts in that thread (it&#39;s<br/>\nalso good netiquette to clip only the relevant bits of information out of a<br/>\npost you&#39;re responding to). If all the people who post on this list did<br/>\nthis, we would have literally hundreds of thousands of posts a day the list<br/>\nwould become unusable. Now I&#39;m not the list owner or anything, I&#39;m just<br/>\nsaying this as my own personal observation. I hope I&#39;m not offending anyone<br/>\nor stepping on anyone&#39;s toes. so this is my own personal request:  I&#39;d ask<br/>\npeople to think before they post  if what they are saying adds to the list<br/>\nas a whole. Personal replies like ((((Hugs)))) or &quot;That&#39;s great!&quot;  can go to<br/>\nindividual email, not to the list. I&#39;d ask people to clip extraneous stuff<br/>\nfrom posts that they are replying to - for those of us on the digest we<br/>\nsometimes get an entire digest full of forwarded and replied-to text and<br/>\nvery little substance. I&#39;d ask people to think before they post and ask<br/>\nthemselves if they are posting so much that hardly anyone else is able to<br/>\nget a word in edgewise. I miss many of the voices who have not been speaking<br/>\nmuch in the last few days and I hope to see more of a balance on the list<br/>\nagain with many different opinions weighing in. That&#39;s my request, just my<br/>\nown 2 cents.<br/>\n<br/>\nThanks!<br/>\n<br/>\n Blue Skies!<br/>\n   -Robin-<br/>\nMom to Mackenzie (8/28/96) who has a best friend named &quot;Eiznekcam&quot;<br/>\nand Asa (10/5/99) the girl who climbs everything!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>   Flying Clevenger Family</div>","specialLinks":[]}],"prevTopicId":50773,"nextTopicId":50755}}