{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":50,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Boredom","postDate":"1306580794","msgId":61301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NUVERDYwLUU5N0QtNDUyRS1BNzU0LTgwQzI3OUQyQTJFMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlyb2xrMStnNm1mQGVHcm91cHMuY29tPg==","referencesHeader":"PGlyb2xrMStnNm1mQGVHcm91cHMuY29tPg=="},"prevInTopic":61296,"nextInTopic":61303,"prevInTime":61300,"nextInTime":61302,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"-=-I used to watch something called HR Puffinstuff. My memories of it were that it was fairly entertaining and I enjoyed watching it. I went to Youtube","messageBody":"<div id=\"ygrps-yiv-468414906\">-=-I used to watch something called &quot;HR Puffinstuff.&quot; My memories of it were that it was fairly entertaining and I enjoyed watching it. I went to Youtube recently wondering what the reality was, and watched a clip of it. Er, television shows have gotten exponentially better and more appealing, but that doesn&#39;t change my memory. The memory is there of having enjoyed it. My expectations have changed and I wouldn&#39;t make it through 5 minutes today. I think technology feels scary to some people.-=-<br/>\n<br/>\nI remember watching Taxi, a half-hour sitcom in the 1970&#39;s, and WKRP in Cincinnati, and LOVING the humor and the characters.<br/>\nI bought some DVDs of those to show Holly, and they really weren&#39;t very good compared to things she has discovered on her own.  Perhaps part of the joy was that I watched it myself and decided I liked it, rather than it being something my parents &quot;assigned&quot; or recommended.<br/>\n<br/>\nThey were kind of cutting-edge culturally, and the humor was about things that were new in those days, and very old now.  Not old enough to be of special interest.   <br/>\n<br/>\nHolly DID really like The Mary Tyler Moore Show, more than I did when it was new.<br/>\n<br/>\n-=-My expectations have changed and I wouldn&#39;t make it through 5 minutes today. I think technology feels scary to some people. I have noticed that the majority of unschoolers seem to be very excited and happy about new technology. There are new things to learn and try all the time. I am definitely in that camp. My family loves the latest gadgets and what they can do. I would not like returning to simpler times at all. I am sure we would find something to do if we were forced to adapt to no new gadgets, but given the choice, we would likely pick the new more interesting gadget and wonder what we could do with it.<br/>\n-=-<br/>\n<br/>\nIn the medieval studies group I was in, sometimes there would be objections or disagreements to someone using a shortcut or something that was &quot;post period&quot; (not available before 1600).   The argument for using something (like duct tape, or elastic, or a microwave) is the humorously-stated &quot;If they&#39;d&#39;ve had it, they&#39;d&#39;ve used it.&quot;   That&#39;s true!   &quot;They&quot; are us, and as soon as they had more modern weapons, clothing, communications, dishes, imports, they DID use them!<br/>\n<br/>\nWhen families want to live like Little House on the Prairie or something, it seems like a horrible game of make-believe in which not all participants have agreed to play.   &quot;Let&#39;s pretend we don&#39;t live in 2011!&quot;    But they do.  And they should!  And life will be happier if the parents can figure out how to look forward to 2012, and 2021.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Boredom","postDate":"1306523278","msgId":61295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyb3NxZStlZWZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybXVmcCs1ZTJyQGVHcm91cHMuY29tPg=="},"prevInTopic":61292,"nextInTopic":61296,"prevInTime":61294,"nextInTime":61296,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"... ********************* I think this is exactly where many parents get confused, equating boredom with daydreaming or contemplation or even something like","messageBody":"<div id=\"ygrps-yiv-2008314635\">&quot;Rosalie&quot; &lt;rosalie_bvtn@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; UNHAPPILY bored may be an important difference. I am speaking of not being afraid of natural in-activity, staring out the window, things of that nature.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nI think this is exactly where many parents get confused, equating boredom with daydreaming or contemplation or even something like &quot;zoning out&quot;. Any of those can be pleasant occupations but they aren&#39;t &quot;boredom&quot; which has connotations of dull inactivity coupled with the desire to do something else. <br/>\n<br/>\nThe trouble is, you can&#39;t make another person contemplate or dream or even &quot;zone out&quot; but you can bore them and some people respond to boredom by looking for something else to do. When children are bored and then find something adults approve to do, adults may pat themselves on the back and say &quot;see, it works&quot; - but it only &quot;works&quot; now and then. More often kids who are bored do things adults find frustrating - they fall back on default strategies like picking fights with siblings, or doing things they &quot;aren&#39;t supposed to do&quot;, or they watch tv or play video games, or they eat. Not that tv and games are bad! but they shouldn&#39;t just be defaults. If kids are watching tv because home is boring, parents are falling down on the job. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I mean is that our society appears to be lopsided in its valuation of doing, and undervalues non-doing.  A more listening balance, would be valuing each equally.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nA better way to phrase that would be in terms of choices. When my daughter chooses to contemplate the flow of water in the creek for an hour, that&#39;s no less marvelous than when she choose to jump on the trampoline for an hour, or build a dam across that same creek, or play a video game. Parents often think they need to take choices away from children so that the only choices left are good ones - but its not true, human beings are endlessly able to come up with less-than-perfect choices, and children who aren&#39;t supported by their parents are often set up to do that.  <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Boredom","postDate":"1306522474","msgId":61296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGluRFlfOWpncUxZVnEtRm1IeXlyTHFycXZEa2pRQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ4MzM5Q0FDLTIxMjgtNEQwRC1BQkUzLTMxMzQ0NUQwQzEyOUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGlybXVmcCs1ZTJyQGVHcm91cHMuY29tPgk8NDgzMzlDQUMtMjEyOC00RDBELUFCRTMtMzEzNDQ1RDBDMTI5QHZlcml6b24ubmV0Pg=="},"prevInTopic":61295,"nextInTopic":61301,"prevInTime":61295,"nextInTime":61297,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"... Contemplation is the space between brush and canvas right before the brush makes it s mark. Boredom is being stuck, which could lessen the likelihood of","messageBody":"<div id=\"ygrps-yiv-1931947488\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; &gt; I am speaking of not being afraid of natural in-activity, staring<br/>\n&gt; &gt; out the window, things of that nature.<br/>\n&gt;<br/>\n&gt; That&#39;s not bored. That&#39;s contemplation.<br/>\n&gt; .<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Contemplation is the space between brush and canvas right before the brush<br/>\nmakes it&#39;s mark. Boredom is being stuck, which could lessen the likelihood<br/>\nof the painting ever coming to life.<br/>\n<br/>\nAll of this has really made me think.  There was something in the statement,<br/>\n&quot;be more boring than the boredom&quot; that hung me up...made me wonder if I<br/>\ninterfere too much in my son&#39;s learning.  But, what I realized through this<br/>\nconversation is that being bored and pausing in reflection between ideas or<br/>\ninterests are different places to be.<br/>\n<br/>\nI looked up boredom and found:<br/>\n<br/>\na dull, tiresome, or uncongenial person.<br/>\n<br/>\nwhich I would never wish on anyone, especially my son or myself.  Boredom is<br/>\nan uncomfortable place to find oneself.  Boredom needs an encouraging<br/>\nfriend.  To leave someone in this place seems cruel to me.  Transition or<br/>\ncontemplation, on the other hand, is where connections can be made.  Here<br/>\nthere seems to be more room for the parent or friend to stand back a bit,<br/>\ngive room and observe.  Although, sharing reflective, quiet times with<br/>\nsomeone you love can be very rewarding as well.<br/>\n<br/>\nI guess what I need to continue to strive for is knowing my son well enough<br/>\nto hear what he is needing from me and for himself, and respond accordingly<br/>\nand generously.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1123183,"authorName":"undermom","from":"&quot;undermom&quot; &lt;DACunefare@...&gt;","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Boredom","postDate":"1306518018","msgId":61292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyb25tMithcTlqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyb25hYithaHE4QGVHcm91cHMuY29tPg=="},"prevInTopic":61291,"nextInTopic":61295,"prevInTime":61291,"nextInTime":61293,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"I don t think I was clear enough here, sorry. What I meant to say is that such parents really need reassurance that not signing their kids up for everything","messageBody":"<div id=\"ygrps-yiv-1475698936\">I don&#39;t think I was clear enough here, sorry. What I meant to say is that such parents really need reassurance that not signing their kids up for everything under the sun won&#39;t ruin them and probably is a very good thing. That&#39;s what Simplicity Parenting is really selling, reassurance that it&#39;s okay for kids to just play and dream and think. <br/>\n<br/>\nDeborah<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;undermom&quot; &lt;DACunefare@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; The Simplicity Parenting movement makes a lot of sense for parents stuck in the current push push push parenting model, where kids are under high pressure in school to Succeed, and their every waking moment outside of school is expected to be filled with Productive Activities that will someday pad out a college application.<br/>\n&gt; <br/>\n&gt; None of which has much of anything to do with successful unschooling.<br/>\n&gt; <br/>\n&gt; Deborah in IL<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":1123183,"authorName":"undermom","from":"&quot;undermom&quot; &lt;DACunefare@...&gt;","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Boredom","postDate":"1306517643","msgId":61291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyb25hYithaHE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyb2xrMStnNm1mQGVHcm91cHMuY29tPg=="},"prevInTopic":61289,"nextInTopic":61292,"prevInTime":61290,"nextInTime":61292,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"The Simplicity Parenting movement makes a lot of sense for parents stuck in the current push push push parenting model, where kids are under high pressure in","messageBody":"<div id=\"ygrps-yiv-1977628259\">The Simplicity Parenting movement makes a lot of sense for parents stuck in the current push push push parenting model, where kids are under high pressure in school to Succeed, and their every waking moment outside of school is expected to be filled with Productive Activities that will someday pad out a college application.<br/>\n<br/>\nNone of which has much of anything to do with successful unschooling.<br/>\n<br/>\nDeborah in IL</div>","specialLinks":[]},{"userId":82912732,"authorName":"Cindy","from":"&quot;Cindy&quot; &lt;cindyjsowers@...&gt;","profile":"cindyjsowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Boredom","postDate":"1306515905","msgId":61289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyb2xrMStnNm1mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkyRUI3MkEwLUU3RUQtNEI5QS1BQTBGLTNDOTAzNTFCNDdFQkB2ZXJpem9uLm5ldD4="},"prevInTopic":61286,"nextInTopic":61291,"prevInTime":61288,"nextInTime":61290,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"... with toys that come with their own stories, looks like parroting someone else s creativity. I think that there are people who pine for what they tend to","messageBody":"<div id=\"ygrps-yiv-822376753\">&lt;jfetteroll@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think the supposed advantage of simplicity for parents is that they can more easily see kids being creative. Playing a video game, playing  <br/>\n </span></blockquote>with toys that come with their own stories, looks like parroting  <br/>\nsomeone else&#39;s creativity.<br/>\n<br/>\nI think that there are people who pine for what they tend to remember as the &quot;good old days,&quot; when things were supposedly simpler. Nostalgic memories are often more appealing than the reality of the times.  I was recently recalling cartoons or Saturday shows I used to watch as a child.  I used to watch something called &quot;HR Puffinstuff.&quot; My memories of it were that it was fairly entertaining and I enjoyed watching it.  I went to Youtube recently wondering what the reality was, and watched a clip of it.  Er, television shows have gotten exponentially better and more appealing, but that doesn&#39;t change my memory.  The memory is there of having enjoyed it.  My expectations have changed and I wouldn&#39;t make it through 5 minutes today.  I think technology feels scary to some people.  I have noticed that the majority of unschoolers seem to be very excited and happy about new technology.  There are new things to learn and try all the time.  I am definitely in that camp.  My family loves the latest gadgets and what they can do.  I would not like returning to simpler times at all.  I am sure we would find something to do if we were forced to adapt to no new gadgets, but given the choice, we would likely pick the new more interesting gadget and wonder what we could do with it.</div>","specialLinks":[]},{"userId":426422274,"authorName":"christinebgilbert","from":"&quot;christinebgilbert&quot; &lt;christine.gilbert@...&gt;","profile":"christinebgilbert","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Boredom","postDate":"1306495621","msgId":61286,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybzFxNStiOWRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybG8yNCtza2RoQGVHcm91cHMuY29tPg=="},"prevInTopic":61284,"nextInTopic":61289,"prevInTime":61285,"nextInTime":61287,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"I grew up in a boring house.  We lived in the middle of the woods, with no kids around, no playground and my sister and I would say, We re bored! and be","messageBody":"<div id=\"ygrps-yiv-1200252962\">I grew up in a boring house.  We lived in the middle of the woods, with no kids around, no playground and my sister and I would say, &quot;We&#39;re bored!&quot; and be ushered outside for the rest of the day.  It didn&#39;t feel good.  We weren&#39;t happy.  It was a bit lonely, actually.  <br/>\n<br/>\nYou know there&#39;s a form of torture called &quot;White Torture&quot; -- Iran uses it, and it involves removing any stimulus.  I&#39;m not saying that this workshop is torture, but I do think humans are wired to interact with their world, not to sit in boredom.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;semajrak&quot; &lt;semajrak@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Recently I was talking with a friend of mine who had gone to a simplicity childhood workshop.  A couple things that were brought up were simplifying the house (getting rid of much of the stuff), lessoning screen time, and letting the child experience boredom (be more boring than the boredom, was recommended).  <br/>\n&gt; <br/>\n&gt; Our house is full of stuff - fun and interesting stuff, in my opinion.  We spend a good amount of time together playing video games, and watching videos (along with other things, of course).  And, when my son is bored we explore together.  I try to be more fun, not more boring.<br/>\n&gt; <br/>\n&gt; I feel pretty confident in our choices, but I think my friend is concerned about stuff, screen time and too much interaction being disruptive to a child&#39;s free development.  Has anyone heard of Simplicity Parenting?  I think of unschooling as more, not less, but can there be too much?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Boredom","postDate":"1306494136","msgId":61284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyRUI3MkEwLUU3RUQtNEI5QS1BQTBGLTNDOTAzNTFCNDdFQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlybG8yNCtza2RoQGVHcm91cHMuY29tPg==","referencesHeader":"PGlybG8yNCtza2RoQGVHcm91cHMuY29tPg=="},"prevInTopic":61283,"nextInTopic":61286,"prevInTime":61283,"nextInTime":61285,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"... I think the supposed advantage of simplicity for parents is that they can more easily see kids being creative. Playing a video game, playing with toys that","messageBody":"<div id=\"ygrps-yiv-656057456\">On May 26, 2011, at 10:28 AM, semajrak wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but I think my friend is concerned about stuff, screen time and too  <br/>\n&gt; much interaction being disruptive to a child&#39;s free development. Has  <br/>\n&gt; anyone heard of Simplicity Parenting?<br/>\n<br/>\n<br/>\n </span></blockquote>I think the supposed advantage of simplicity for parents is that they  <br/>\ncan more easily see kids being creative. Playing a video game, playing  <br/>\nwith toys that come with their own stories, looks like parroting  <br/>\nsomeone else&#39;s creativity.<br/>\n<br/>\nSo it&#39;s about appearances not about connecting with kids to really  <br/>\nunderstand what&#39;s going on inside.<br/>\n<br/>\nIf all a kid has is rocks and sticks, they&#39;ll turn those rocks and  <br/>\nsticks into a wide variety of things. If a kid has a Pokemon, it&#39;s  <br/>\nusually going to be a Pokemon.  To see the rich story telling the  <br/>\nchild doing, it takes more attention and more understanding of what  <br/>\nthe child is interested in.<br/>\n<br/>\nEinstein and Ferrari and e.e. cummings and Steve Jobs didn&#39;t build  <br/>\nfrom sticks and stones. They built off of what others had created  <br/>\nbefore. Kids shouldn&#39;t have to be made to reinvent story telling  <br/>\nbecause their parents aren&#39;t engaged enough to understand what&#39;s  <br/>\nhappening with the Barbies and the Pokemon.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Boredom","postDate":"1306493447","msgId":61283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4MzM5Q0FDLTIxMjgtNEQwRC1BQkUzLTMxMzQ0NUQwQzEyOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlybXVmcCs1ZTJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlybXVmcCs1ZTJyQGVHcm91cHMuY29tPg=="},"prevInTopic":61282,"nextInTopic":61284,"prevInTime":61282,"nextInTime":61284,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"... That s not bored. That s contemplation. Bored is a kid saying I m bored. There s nothing to do. (Or thinking or feeling it.) When you re bored, even","messageBody":"<div id=\"ygrps-yiv-1159267705\">On May 26, 2011, at 9:24 PM, Rosalie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am speaking of not being afraid of natural in-activity, staring  <br/>\n&gt; out the window, things of that nature.<br/>\n<br/>\n </span></blockquote>That&#39;s not bored. That&#39;s contemplation.<br/>\n<br/>\nBored is a kid saying &quot;I&#39;m bored. There&#39;s nothing to do.&quot; (Or thinking  <br/>\nor feeling it.) When you&#39;re bored, even staring out the window isn&#39;t  <br/>\ninteresting ;-)<br/>\n<br/>\nBored is &quot;feeling weary because one is unoccupied or lacks interest in  <br/>\none&#39;s current activity.&quot; I don&#39;t see a way to be happily bored!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A more listening balance, would be valuing each equally.<br/>\n<br/>\n<br/>\n </span></blockquote>What does listening have to do with valuing and balance? For me the  <br/>\nphrase is adding a muddy layer over more direct terms like value and  <br/>\nappreciate and understand.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would think unschooling could work very well without much striving<br/>\n<br/>\n<br/>\n </span></blockquote>It can to those it comes naturally to. But those who do it naturally  <br/>\ndon&#39;t generally need a list to help them figure it out! :-) This list  <br/>\nis targeted at those who have baggage they want to get rid of.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To clarify, I put learning in quotations because, reflection or non- <br/>\n&gt; activity is not really learning, nor should it be probably. Yet it  <br/>\n&gt; is important, also. If pushed, a person could make a case that it is  <br/>\n&gt; learning by terming it (in the realm of) &quot;critical thinking&quot; or of  <br/>\n&gt; that sort, to placate some authority.<br/>\n<br/>\n </span></blockquote>I would very definitely say it&#39;s learning. Activity isn&#39;t necessary  <br/>\nfor learning. In fact inactivity or being away doing something  <br/>\nentirely different is an essential part of learning. It&#39;s when the  <br/>\nbrain quietly makes connections between ideas.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Boredom","postDate":"1306479177","msgId":61282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwRjUxRjZDLTU2MUItNDVBMC04QTZGLTQ4QjdDMkZDNUIyM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlybXVmcCs1ZTJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlybXVmcCs1ZTJyQGVHcm91cHMuY29tPg=="},"prevInTopic":61279,"nextInTopic":61283,"prevInTime":61281,"nextInTime":61283,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"-=-I guess we would need to define or refine what is meant by boredom by the simplicity parenting folks. -=- Once the question is brought to this list, it s","messageBody":"<div id=\"ygrps-yiv-322718484\">-=-I guess we would need to define or refine what is meant by &quot;boredom&quot; by the simplicity parenting folks. -=-<br/>\n<br/>\nOnce the question is brought to this list, it&#39;s not about what the people somewhere else meant anymore, though.  We&#39;re discussing how an idea works within the principles of unschooling.<br/>\n<br/>\nAs to definitions, let&#39;s use plain English and not redefine things.<br/>\n<br/>\n-=-UNHAPPILY bored may be an important difference-=-<br/>\n<br/>\nBut there is no happy boredom.   Inactivity is not necessarily boredom, and boredom isn&#39;t always inactivity.  Sometimes a bored person will become destructive or whiny or disruptive.<br/>\n<br/>\n-=-Certainly, UNHAPPILY STIMULATED would not be helping a child have a grounded, self-reflecting life either. -=-<br/>\n<br/>\nNo, and I don&#39;t think anyone should be (or is recommending) pressing activities on a child who is wanting some peace and quiet.<br/>\n<br/>\n---------------<br/>\nA:   -=-The times of reflection, introspection and down-time nourish people as much as the active time. I guess it could be said that &quot;learning&quot; is happening during both. To strive to be active or strive to be bored...-=-<br/>\n<br/>\nB:  **How about striving to live in such a way that unschooling will work well? This discussion list isn&#39;t concerned with anything else. Just unschooling, natural learning, living peacefully.**<br/>\n<br/>\nA:  -=- I would think unschooling could work very well without much striving unless one needs to push against something/prove something, like the government wanting to see results. By not striving, I don&#39;t mean doing nothing, but not TRYING to do something. Setting good contexts and listening to interests all don&#39;t take striving.-=-<br/>\n<br/>\nStriving was your word, not mine.<br/>\nI have seen unschooling fail when mothers think there&#39;s nothing to it.   <br/>\nI have seen people fail to understand unschooling because they had been advised not to try to do anything to create a rich, peaceful environment, but just to trust, or to visualize, or to wait.<br/>\n<br/>\n** I&#39;m uncomfortable with &quot;non-listening&quot; or &quot;a more listening balance.&quot; <br/>\nIf we&#39;re defending everything, we&#39;re not defending anything at all.**<br/>\n<br/>\nI should be clear here... I am not defending everything, or anything really. Just offering a perspective. <br/>\n<br/>\nPlease don&#39;t offer any perspectives you don&#39;t care enough about to defend.  :-)<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":431113179,"authorName":"Rosalie","from":"&quot;Rosalie&quot; &lt;rosalie_bvtn@...&gt;","profile":"rosalie_bvtn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Boredom","postDate":"1306459449","msgId":61279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybXVmcCs1ZTJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDczQUQ3OEVCLTRGMTUtNEIzQS1CQUIxLTE0NEEwRDM3MDhBRkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61275,"nextInTopic":61282,"prevInTime":61278,"nextInTime":61280,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"-=-Boredom and activity are two sides of the same coin… one is not inherently right or another wrong. Trying to make one or the other happen, though, would","messageBody":"<div id=\"ygrps-yiv-79522616\">-=-Boredom and activity are two sides of the same coin one is not inherently right or another wrong. Trying to make one or the other happen, though, would become not-listening. Inherently both are as necessary and interdependent just as being asleep and being awake. Or birth and death. Or summer and winter.-=-<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;** I disagree.   Boredom is not the opposite of activity.**<br/>\n<br/>\n </span></blockquote>Disagreement has the potential to make life richer!  I guess we would need to define or refine what is meant by &quot;boredom&quot; by the simplicity parenting folks.   <br/>\n<br/>\n** If someone is unhappily bored and someone on his team, someone who should be helping him, is unconcerned and unsympathetic, or unable to help make his life more sparkly and stimulating, that is [in unschooling terms] wrong.    Joy and activity are NOT dependent on, nor are they balanced by, boredom.**<br/>\n<br/>\nUNHAPPILY bored may be an important difference. I am speaking of not being afraid of natural in-activity, staring out the window, things of that nature.  Certainly, UNHAPPILY STIMULATED would not be helping a child have a grounded, self-reflecting life either.  <br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Our society seems to value activity and doing more than non-doing though. Trusting that both will happen in their own times would create a more listening balance. -=-<br/>\n<br/>\n </span></blockquote>** What do you mean by &quot;a more listening balance&quot;?**<br/>\n<br/>\nWhat I mean is that our society appears to be lopsided in its valuation of doing, and undervalues non-doing.  A more listening balance, would be valuing each equally.    <br/>\n<br/>\n <br/>\n -=- The times of reflection, introspection and down-time nourish people as much as the active time. I guess it could be said that &quot;learning&quot; is happening during both. To strive to be active or strive to be bored, can create unbalance and non-listening. Honoring both, in their own time, is honoring the whole person. -=-<br/>\n<br/>\n** I&#39;m uncomfortable with &quot;non-listening&quot; or &quot;a more listening balance.&quot;  <br/>\n <br/>\nIf we&#39;re defending everything, we&#39;re not defending anything at all.**<br/>\n<br/>\nI should be clear here...  I am not defending everything, or anything really.  Just offering a perspective.  <br/>\n<br/>\n -=-The times of reflection, introspection and down-time nourish people as much as the active time. I guess it could be said that &quot;learning&quot; is happening during both. To strive to be active or strive to be bored...-=-<br/>\n <br/>\n**How about striving to live in such a way that unschooling will work well?  This discussion list isn&#39;t concerned with anything else.  Just unschooling, natural learning, living peacefully.**<br/>\n <br/>\nI would think unschooling could work very well without much striving unless one needs to push against something/prove something, like the government wanting to see results.  By not striving, I don&#39;t mean doing nothing, but not TRYING to do something.  Setting good contexts and listening to interests all don&#39;t take striving.<br/>\n<br/>\n**No one should strive to be bored.  Learning (real learning, not so-called &quot;learning&quot; with quotation marks) is happening when it&#39;s happening.  Boredom isn&#39;t a good state for learning.  Quiet, thoughtfulness isn&#39;t at all the same as boredom.**<br/>\n<br/>\nTo clarify, I put learning in quotations because, reflection or non-activity is not really learning, nor should it be probably.  Yet it is important, also.  If pushed, a person could make a case that it is learning by terming it (in the realm of) &quot;critical thinking&quot; or of that sort, to placate some authority.<br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-Boredom and activity are two sides of the same coin one is not inherently right or another wrong. Trying to make one or the other happen, though, would become not-listening. Inherently both are as necessary and interdependent just as being asleep and being awake. Or birth and death. Or summer and winter.-=-<br/>\n&gt; <br/>\n&gt; I disagree.   Boredom is not the opposite of activity.<br/>\n&gt; <br/>\n&gt; If someone is unhappily bored and someone on his team, someone who should be helping him, is unconcerned and unsympathetic, or unable to help make his life more sparkly and stimulating, that is [in unschooling terms] wrong.    Joy and activity are NOT dependent on, nor are they balanced by, boredom.<br/>\n&gt; <br/>\n&gt; -=-Our society seems to value activity and doing more than non-doing though. Trusting that both will happen in their own times would create a more listening balance. -=-<br/>\n&gt; <br/>\n&gt; What do you mean by &quot;a more listening balance&quot;?  <br/>\n&gt; <br/>\n&gt; -=- The times of reflection, introspection and down-time nourish people as much as the active time. I guess it could be said that &quot;learning&quot; is happening during both. To strive to be active or strive to be bored, can create unbalance and non-listening. Honoring both, in their own time, is honoring the whole person. -=-<br/>\n&gt; <br/>\n&gt; I&#39;m uncomfortable with &quot;non-listening&quot; or &quot;a more listening balance.&quot;  <br/>\n&gt; <br/>\n&gt; If we&#39;re defending everything, we&#39;re not defending anything at all.<br/>\n&gt; <br/>\n&gt; -=-The times of reflection, introspection and down-time nourish people as much as the active time. I guess it could be said that &quot;learning&quot; is happening during both. To strive to be active or strive to be bored...-=-<br/>\n&gt; <br/>\n&gt; How about striving to live in such a way that unschooling will work well?  This discussion list isn&#39;t concerned with anything else.  Just unschooling, natural learning, living peacefully.<br/>\n&gt; <br/>\n&gt; No one should strive to be bored.  Learning (real learning, not so-called &quot;learning&quot; with quotation marks) is happening when it&#39;s happening.  Boredom isn&#39;t a good state for learning.  Quiet, thoughtfulness isn&#39;t at all the same as boredom.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Boredom","postDate":"1306444887","msgId":61275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczQUQ3OEVCLTRGMTUtNEIzQS1CQUIxLTE0NEEwRDM3MDhBRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlybWVwbitlaWRuQGVHcm91cHMuY29tPg==","referencesHeader":"PGlybWVwbitlaWRuQGVHcm91cHMuY29tPg=="},"prevInTopic":61274,"nextInTopic":61279,"prevInTime":61274,"nextInTime":61276,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"-=-Boredom and activity are two sides of the same coin… one is not inherently right or another wrong. Trying to make one or the other happen, though, would","messageBody":"<div id=\"ygrps-yiv-966649970\">-=-Boredom and activity are two sides of the same coin� one is not inherently right or another wrong. Trying to make one or the other happen, though, would become not-listening. Inherently both are as necessary and interdependent just as being asleep and being awake. Or birth and death. Or summer and winter.-=-<br/>\n<br/>\nI disagree.   Boredom is not the opposite of activity.<br/>\n<br/>\nIf someone is unhappily bored and someone on his team, someone who should be helping him, is unconcerned and unsympathetic, or unable to help make his life more sparkly and stimulating, that is [in unschooling terms] wrong.    Joy and activity are NOT dependent on, nor are they balanced by, boredom.<br/>\n<br/>\n-=-Our society seems to value activity and doing more than non-doing though. Trusting that both will happen in their own times would create a more listening balance. -=-<br/>\n<br/>\nWhat do you mean by &quot;a more listening balance&quot;?  <br/>\n<br/>\n-=- The times of reflection, introspection and down-time nourish people as much as the active time. I guess it could be said that &quot;learning&quot; is happening during both. To strive to be active or strive to be bored, can create unbalance and non-listening. Honoring both, in their own time, is honoring the whole person. -=-<br/>\n<br/>\nI&#39;m uncomfortable with &quot;non-listening&quot; or &quot;a more listening balance.&quot;  <br/>\n<br/>\nIf we&#39;re defending everything, we&#39;re not defending anything at all.<br/>\n<br/>\n-=-The times of reflection, introspection and down-time nourish people as much as the active time. I guess it could be said that &quot;learning&quot; is happening during both. To strive to be active or strive to be bored...-=-<br/>\n<br/>\nHow about striving to live in such a way that unschooling will work well?  This discussion list isn&#39;t concerned with anything else.  Just unschooling, natural learning, living peacefully.<br/>\n<br/>\nNo one should strive to be bored.  Learning (real learning, not so-called &quot;learning&quot; with quotation marks) is happening when it&#39;s happening.  Boredom isn&#39;t a good state for learning.  Quiet, thoughtfulness isn&#39;t at all the same as boredom.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":431113179,"authorName":"Rosalie","from":"&quot;Rosalie&quot; &lt;rosalie_bvtn@...&gt;","profile":"rosalie_bvtn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Boredom","postDate":"1306443382","msgId":61274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybWVwbitlaWRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybG8yNCtza2RoQGVHcm91cHMuY29tPg=="},"prevInTopic":61273,"nextInTopic":61275,"prevInTime":61273,"nextInTime":61275,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"Boredom and activity are two sides of the same coin…  one is not inherently right or another wrong.  Trying to make one or the other happen, though, would","messageBody":"<div id=\"ygrps-yiv-589047353\">Boredom and activity are two sides of the same coin  one is not inherently right or another wrong.  Trying to make one or the other happen, though, would become not-listening.   Inherently both are as necessary and interdependent just as being asleep and being awake.  Or birth and death.  Or summer and winter.<br/>\n<br/>\nOur society seems to value activity and doing more than non-doing though. Trusting that both will happen in their own times would create a more listening balance.  Like, for example, many people feel more active during the full moon time.  Knowing these waves will come and go takes a lot of trust and knowing that the tendencies are greater than the individual to &quot;make it happen&quot;.<br/>\n<br/>\nWhere it can get tricky (for me at least) is when I start to listen to what others are doing (what schooled kids know or what other kids are doing) :  ie. comparison<br/>\nOr listening to what society values:  doing, results, lots and lots of activity.<br/>\n<br/>\nIn actuality both are necessary and natural.  The times of reflection, introspection and down-time nourish people as much as the active time.  I guess it could be said that &quot;learning&quot; is happening during both.  To strive to be active or strive to be bored, can create unbalance and non-listening.  Honoring both, in their own time, is honoring the whole person.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;semajrak&quot; &lt;semajrak@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Recently I was talking with a friend of mine who had gone to a simplicity childhood workshop.  A couple things that were brought up were simplifying the house (getting rid of much of the stuff), lessoning screen time, and letting the child experience boredom (be more boring than the boredom, was recommended).  <br/>\n&gt; <br/>\n&gt; Our house is full of stuff - fun and interesting stuff, in my opinion.  We spend a good amount of time together playing video games, and watching videos (along with other things, of course).  And, when my son is bored we explore together.  I try to be more fun, not more boring.<br/>\n&gt; <br/>\n&gt; I feel pretty confident in our choices, but I think my friend is concerned about stuff, screen time and too much interaction being disruptive to a child&#39;s free development.  Has anyone heard of Simplicity Parenting?  I think of unschooling as more, not less, but can there be too much?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Boredom","postDate":"1306438064","msgId":61272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybTlqZyttZnRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybG8yNCtza2RoQGVHcm91cHMuY29tPg=="},"prevInTopic":61271,"nextInTopic":61273,"prevInTime":61271,"nextInTime":61273,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"... ************* What s the claim? What do they say will happen if you do? Its good to look at all of that with the skepticism you would bring to looking at","messageBody":"<div id=\"ygrps-yiv-1441728318\">&quot;semajrak&quot; &lt;semajrak@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Recently I was talking with a friend of mine who had gone to a simplicity childhood workshop.  A couple things that were brought up were simplifying the house (getting rid of much of the stuff), lessoning screen time, and letting the child experience boredom (be more boring than the boredom, was recommended). <br/>\n </span></blockquote>*************<br/>\n<br/>\nWhat&#39;s the claim? What do they say will happen if you do? Its good to look at all of that with the skepticism you would bring to looking at an advertisement - what are they &quot;selling&quot;, what&#39;s the fine print, and how do they substantiate their claims? <br/>\n<br/>\nMy experience with the those kinds of theories is that they purport to magically turn children more creative and thoughtful. The underlying idea is that limits engender creativity. The trouble with that theory is that its based more in popular mythology and urban legend than in an understanding of the human mind. <br/>\n<br/>\nI wrote an article on the subject of limits and creativity awhile back and I&#39;ll link it rather than paraphrasing:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://enjoylifeunschooling.com/2011/01/origami-lesson/\">http://enjoylifeunschooling.com/2011/01/origami-lesson/</a><br/>\n<br/>\nOne of the myths of boredom is that if you make a child bored long enough, he or she will suddenly get more creative, just to alleviate the boredom. It sounds like it should work... but boredom can lead as easily to apathy as to activity. Creative work needs to be inspired, not dulled into being. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Boredom","postDate":"1306437240","msgId":61271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybThwbysybHJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybG8yNCtza2RoQGVHcm91cHMuY29tPg=="},"prevInTopic":61269,"nextInTopic":61272,"prevInTime":61270,"nextInTime":61272,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"... It kind of reminds me of the Living Simple magazines and such--pay money to get more stuff that tells you how to spend less money and get rid of stuff ;-/ ","messageBody":"<div id=\"ygrps-yiv-1437312051\">----Has anyone heard of Simplicity Parenting?-----<br/>\n<br/>\nIt kind of reminds me of the Living Simple magazines and such--pay money to get more stuff that tells you how to spend less money and get rid of stuff ;-/<br/>\n<br/>\nI&#39;m thinking out loud here, but I wonder if there isn&#39;t a huge difference between boredom as experienced by schooled youth and that experienced my unschoolers? I&#39;m guessing that unschooling creates a space where children are more (naturally?) able to follow their interests and engage in something that makes them happy/entertained and their parents are more committed/skilled at assisting in the process. I can see this being significantly more difficult for schooled youth because they don&#39;t get to learn how to do that (follow their passions) in the first place, and even if they do know how, they often lack the time needed for such pursuits. <br/>\n<br/>\nSometimes I&#39;ll ask Noor, &quot;Are you bored? Wanna shake things up a bit and go.......&quot;  Sometimes she&#39;ll jump at the chance and other times she&#39;ll say, &quot;no thanks.&quot; I do think that quiet, restful, contemplative times are beneficial--is that what boredom looks like? Maybe.<br/>\n<br/>\n---- (be more boring than the boredom, was recommended).-----<br/>\n<br/>\nI&#39;m not really sure I know what that means.  Being boring and and feeling bored are completely different things, no?  Reminds me of that yucky mom-ism, &quot;Only boring people get bored&quot;<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Boredom","postDate":"1306435268","msgId":61273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzNjE2NUZCLTkzNzUtNEMyQS1BRUEyLTA0QkQwODAwMjBFOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlybG8yNCtza2RoQGVHcm91cHMuY29tPg==","referencesHeader":"PGlybG8yNCtza2RoQGVHcm91cHMuY29tPg=="},"prevInTopic":61272,"nextInTopic":61274,"prevInTime":61272,"nextInTime":61274,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"-=-Recently I was talking with a friend of mine who had gone to a simplicity childhood workshop. A couple things that were brought up were simplifying the","messageBody":"<div id=\"ygrps-yiv-181448685\">-=-Recently I was talking with a friend of mine who had gone to a simplicity childhood workshop. A couple things that were brought up were simplifying the house (getting rid of much of the stuff), lessoning screen time, and letting the child experience boredom (be more boring than the boredom, was recommended). -=-<br/>\n<br/>\nSchools traditionally paint over windows, or tape paper there, or kids&#39; art, so that kids can&#39;t look out the windows, so that the teacher&#39;s droning on is more interesting than trees or people or cars or birds outside.<br/>\n<br/>\nThis might seem picky to you, but I&#39;m going to say that &quot;lessoning screen time&quot; isn&#39;t about lessons.  It&#39;s about making less of.  Limiting.  Creating lack.  Paucity.  <br/>\n<br/>\nLessen (not lesson).<br/>\nI never wanted to lessen my child&#39;s world.<br/>\n<br/>\n-=-Our house is full of stuff - fun and interesting stuff, in my opinion. We spend a good amount of time together playing video games, and watching videos (along with other things, of course). And, when my son is bored we explore together. I try to be more fun, not more boring.-=-<br/>\n<br/>\nI&#39;m with you, absolutely.  I think boredom is sad and should be avoided.  <br/>\n<br/>\n-=-I feel pretty confident in our choices, but I think my friend is concerned about stuff, screen time and too much interaction being disruptive to a child&#39;s free development. Has anyone heard of Simplicity Parenting? I think of unschooling as more, not less, but can there be too much?-=-<br/>\n<br/>\nYou might ask her if she knows what &quot;simple&quot; means, in intellectual terms.  I really wouldn&#39;t want my child to be simple.  <br/>\n<br/>\n-=- I think my friend is concerned about stuff, screen time and too much interaction being disruptive to a child&#39;s free development. -=-<br/>\n<br/>\nMaybe she thinks it&#39;s up to her to decide how much stuff, screen time or interaction is exactly right for her child&#39;s &quot;free development.&quot;<br/>\n<br/>\n-=-can there be too much?-=-<br/>\n<br/>\nSure.<br/>\n<br/>\nToo much noise, or too much parental yammering, or too much stuff.  And if the kid says &quot;too much!&quot; I think a parents should absolutely try to find ways to make things quieter, less overwhelming.    If the child is in on decisions about what to do and what to acquire and play with, and what movie to watch, and when to turn it off, all the problems above are eliminated.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"semajrak","from":"&quot;semajrak&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Boredom","postDate":"1306420100","msgId":61269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybG8yNCtza2RoQGVHcm91cHMuY29tPg=="},"prevInTopic":60815,"nextInTopic":61271,"prevInTime":61268,"nextInTime":61270,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"Recently I was talking with a friend of mine who had gone to a simplicity childhood workshop.  A couple things that were brought up were simplifying the house","messageBody":"<div id=\"ygrps-yiv-486499313\">Recently I was talking with a friend of mine who had gone to a simplicity childhood workshop.  A couple things that were brought up were simplifying the house (getting rid of much of the stuff), lessoning screen time, and letting the child experience boredom (be more boring than the boredom, was recommended).  <br/>\n<br/>\nOur house is full of stuff - fun and interesting stuff, in my opinion.  We spend a good amount of time together playing video games, and watching videos (along with other things, of course).  And, when my son is bored we explore together.  I try to be more fun, not more boring.<br/>\n<br/>\nI feel pretty confident in our choices, but I think my friend is concerned about stuff, screen time and too much interaction being disruptive to a child&#39;s free development.  Has anyone heard of Simplicity Parenting?  I think of unschooling as more, not less, but can there be too much?</div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Boredom","postDate":"1303772933","msgId":60815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlwNHV1NSt2dmlzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNCMEFCQ0RELThCQkMtNDdGMS1BMzBBLTYyOEI0QzMxMkI3MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60810,"nextInTopic":61269,"prevInTime":60814,"nextInTime":60816,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"There s a fun group on flickr called Kids Craft Weekly: http://www.flickr.com/groups/kidscraftweekly/pool/with/5652089995/ The ideas come from this newsletter:","messageBody":"<div id=\"ygrps-yiv-1678090384\">There&#39;s a fun group on flickr called Kids Craft Weekly:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.flickr.com/groups/kidscraftweekly/pool/with/5652089995/\">http://www.flickr.com/groups/kidscraftweekly/pool/with/5652089995/</a><br/>\n<br/>\nThe ideas come from this newsletter:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kidscraftweekly.com/newsletters.html\">http://www.kidscraftweekly.com/newsletters.html</a><br/>\n<br/>\n<br/>\n<br/>\nAndrea Q<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/youngchildren\">http://sandradodd.com/youngchildren</a><br/>\n&gt; <br/>\n&gt; That one (thanks Dina)<br/>\n&gt; <br/>\n&gt; and also:<br/>\n&gt; Deb Lewis&#39;s List of Things to do in the Winter<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/deblist\">http://sandradodd.com/strew/deblist</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Boredom","postDate":"1303739045","msgId":60810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCMEFCQ0RELThCQkMtNDdGMS1BMzBBLTYyOEI0QzMxMkI3MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlwMzNtMSt1b2oyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlwMzNtMSt1b2oyQGVHcm91cHMuY29tPg=="},"prevInTopic":60808,"nextInTopic":60815,"prevInTime":60809,"nextInTime":60811,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"http://sandradodd.com/youngchildren That one (thanks Dina) and also: Deb Lewis s List of Things to do in the Winter http://sandradodd.com/strew/deblist ","messageBody":"<div id=\"ygrps-yiv-770486304\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/youngchildren\">http://sandradodd.com/youngchildren</a><br/>\n<br/>\nThat one (thanks Dina)<br/>\n<br/>\nand also:<br/>\nDeb Lewis&#39;s List of Things to do in the Winter<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/deblist\">http://sandradodd.com/strew/deblist</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":311341422,"authorName":"dapsign","from":"&quot;dapsign&quot; &lt;dapsign@...&gt;","profile":"dapsign","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Boredom","postDate":"1303712257","msgId":60808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlwMzNtMSt1b2oyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBTkxrVGlreT1mTnF4NlowMVgrLTEta2YtN1dzUjk2K3FnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":60807,"nextInTopic":60810,"prevInTime":60807,"nextInTime":60809,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"http://sandradodd.com/youngchildren Under Some of the Good Parts Dina","messageBody":"<div id=\"ygrps-yiv-615376926\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/youngchildren\">http://sandradodd.com/youngchildren</a><br/>\n<br/>\nUnder &quot;Some of the Good Parts&quot;<br/>\n<br/>\nDina<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Kirstin Eventyr &lt;kiventyr@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Many moons ago someone posted a link on this list to a HUGE list of<br/>\n&gt; things to do with kids who were bored or maybe it was a list of things<br/>\n&gt; to do on a rainy day. I have searched both Sandra&#39;s site and<br/>\n&gt; joyfullyrejoycing and couldn&#39;t find it. Can any of you point me in the<br/>\n&gt; right direction?<br/>\n&gt; <br/>\n&gt; My daughters are getting a little stir crazy with the slow onset of<br/>\n&gt; spring and I need to bring some freshness into our lives. Any ideas?<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Kirstin<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":440537707,"authorName":"Kirstin Eventyr","from":"Kirstin Eventyr &lt;kiventyr@...&gt;","profile":"kirventyr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Boredom","postDate":"1303709122","msgId":60807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGlreT1mTnF4NlowMVgrLTEta2YtN1dzUjk2K3FnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":47214,"nextInTopic":60808,"prevInTime":60806,"nextInTime":60808,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"Many moons ago someone posted a link on this list to a HUGE list of things to do with kids who were bored or maybe it was a list of things to do on a rainy","messageBody":"<div id=\"ygrps-yiv-1575828587\">Many moons ago someone posted a link on this list to a HUGE list of<br/>\nthings to do with kids who were bored or maybe it was a list of things<br/>\nto do on a rainy day. I have searched both Sandra&#39;s site and<br/>\njoyfullyrejoycing and couldn&#39;t find it. Can any of you point me in the<br/>\nright direction?<br/>\n<br/>\nMy daughters are getting a little stir crazy with the slow onset of<br/>\nspring and I need to bring some freshness into our lives. Any ideas?<br/>\n<br/>\nThanks,<br/>\nKirstin</div>","specialLinks":[]},{"userId":401668605,"authorName":"pamela kaplan","from":"&quot;pamela kaplan&quot; &lt;pamelalucinda@...&gt;","profile":"pamelalucinda","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Boredom","postDate":"1252693173","msgId":47214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTExNS1EUzFEQjE0MEZCMUE4Q0RDNTdFNjhBREEzRTcwQHBoeC5nYmw+","inReplyToHeader":"PEUwMDRCRTMxMzgwRDRCMTJCNzU4NTNEMUQ0Njc2NjRDQFRpbmFQQz4=","referencesHeader":"PEUwMDRCRTMxMzgwRDRCMTJCNzU4NTNEMUQ0Njc2NjRDQFRpbmFQQz4="},"prevInTopic":47211,"nextInTopic":60807,"prevInTime":47213,"nextInTime":47215,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"Bored is a codeword for lonely. It is possible to be around people all day long, and still be lonely. If you hear I m lonely every time your child says","messageBody":"<div id=\"ygrps-yiv-977548903\">&quot;Bored is a codeword for lonely.&quot;<br/>\n&quot;It is possible to be around people all day long, and still be lonely.&quot;<br/>\n&quot;If you hear &quot;I&#39;m lonely&quot; every time your child says &quot;I&#39;m bored&quot; you&#39;ll<br/>\nbetter understand how to react. You will know that if she finally goes off<br/>\nto do something on her own, the problem is not solved. A lonely child who<br/>\nis no longer bothering her mom is still a lonely child.&quot;<br/>\n<br/>\nThank you for posting this.  I&#39;ve been baffled & irritated by Eli&#39;s (4 yrs<br/>\nold) recent complaints of boredom, and this explains it. <br/>\n<br/>\nThe other day we went to my doctor&#39;s appt and when that was done I offered<br/>\nlots of fun ideas about what we could do next - playground, children&#39;s<br/>\nmuseum, science center, beach, meeting up with friends-  and Eli said, &quot;No,<br/>\nI just want to go home and play my games.&quot;  I was disappointed and Izador (2<br/>\nyrs) was disappointed, but out-in-the-world-adventures are no fun when Eli<br/>\ndoesn&#39;t really want to be there, so home we went.  Once home he immediately<br/>\ncollapsed on the couch,  &quot;I&#39;m bored. I&#39;m so bored.  Mommy, I&#39;m soooooooo<br/>\nbored.&quot;    I felt super irritated and I&#39;m sure this came across, even though<br/>\nI didn&#39;t voice my thoughts out loud (&quot;you wouldn&#39;t be bored if you&#39;d agreed<br/>\nto one of my super-exciting ideas, and now we&#39;re all stuck at home, and<br/>\nwe&#39;re all bored, and now you want me to come up with something exciting to<br/>\ndo?  GRRR.&quot;) .  <br/>\n<br/>\nIf I&#39;d simply heard his complaint as &quot;I&#39;m lonely&quot; I would have reacted much<br/>\nmore helpfully.  He wanted connection.  He wanted to be at home, he wanted<br/>\nto recharge, he wanted to connect with me.  And I totally blew it. <br/>\n<br/>\nNext time.  I promise.<br/>\n<br/>\nThank you,<br/>\nPam <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":346626599,"authorName":"Tina Boster","from":"&quot;Tina Boster&quot; &lt;tinaboster@...&gt;","profile":"guideforthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Boredom","postDate":"1252683968","msgId":47211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwMDRCRTMxMzgwRDRCMTJCNzU4NTNEMUQ0Njc2NjRDQFRpbmFQQz4="},"prevInTopic":47204,"nextInTopic":47214,"prevInTime":47210,"nextInTime":47212,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"=======How do you all handle if your child tells you that she/he is bored? ======= Bored is a codeword for lonely. I want to reiterate what others have","messageBody":"<div id=\"ygrps-yiv-1389098048\">=======How do you all handle if your child tells you that she/he is bored?<br/>\n=======<br/>\n<br/>\n <br/>\n<br/>\nBored is a codeword for lonely.<br/>\n<br/>\n <br/>\n<br/>\nI want to reiterate what others have previously posted.  Don&#39;t make<br/>\nsuggestions.  Invite her to do things with you.  Respond at the first signs<br/>\nof boredom/loneliness.  It is possible to be around people all day long, and<br/>\nstill be lonely.<br/>\n<br/>\n <br/>\n<br/>\nWe have a similar dynamic in our house:  Two older children who are close in<br/>\nage and a much younger child.  The boys have each other, but my daughter<br/>\njust has me.  I do my best, but I can be a sucky playmate at times.  It<br/>\nseems I have forgotten how to play with full imagination and absolute<br/>\nabandonment of reality.  I play games (both video and board) with her.  I do<br/>\nart projects with her.  I read to her.  I leave the boys at home and go with<br/>\njust her - for a walk, to the park, shopping, out to eat - anything as long<br/>\nas it is just me and her.<br/>\n<br/>\n <br/>\n<br/>\nHowever, the absolute best thing I can do for her - the thing that makes her<br/>\nthe happiest - is invite her friends over.  The more, the merrier.  It is<br/>\nnot unusual to have 3-4 extra kids at my house.  Those days are absolute<br/>\nbliss for my girl.<br/>\n<br/>\n <br/>\n<br/>\nIf you hear &quot;I&#39;m lonely&quot; every time your child says &quot;I&#39;m bored&quot; you&#39;ll<br/>\nbetter understand how to react.  You will know that if she finally goes off<br/>\nto do something on her own, the problem is not solved.  A lonely child who<br/>\nis no longer bothering her mom is still a lonely child.<br/>\n<br/>\n <br/>\n<br/>\nTina<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Boredom","postDate":"1252603828","msgId":47204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhCNEJCMkMwQ0Q3NTQ2ODRCMkI0NzlGRDZERjVBMzREQGJpZ3N1cnByaXNlPg=="},"prevInTopic":34640,"nextInTopic":47211,"prevInTime":47203,"nextInTime":47205,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"***Rather than suggesting things for her to do, YOU could do things that she might want to join in on for a moment or longer, or just watch.*** Put her on your","messageBody":"<div id=\"ygrps-yiv-499381042\">***Rather than suggesting things for her to do, YOU could do things that<br/>\nshe might want to join in on for a moment or longer, or just watch.***<br/>\n<br/>\nPut her on your lap and snuggle and visit awhile.  Talk about something interesting you read in the newspaper, tell her you&#39;re going to make her favorite thing for dinner, talk about anything at all except why she shouldn&#39;t be bored. &lt;g&gt;     Pull out a game she really likes and sit and play with her.   Go for a walk around the neighborhood together.<br/>\nInvite her to make cupcakes.<br/>\n<br/>\nShe&#39;s not so much interested in you telling her what to do or why she shouldn&#39;t be bored.   She wants you to help her feel better.  Spend time with her talking and doing and that will help.    <br/>\n   <br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Boredom","postDate":"1210008051","msgId":34640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBRTE2QTVDLUY2NDgtNEYyMS05QzYyLUNEMTIxMjdEM0RDMUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGZ2bTBoYStuMDd2QGVHcm91cHMuY29tPg==","referencesHeader":"PGZ2bTBoYStuMDd2QGVHcm91cHMuY29tPg=="},"prevInTopic":34638,"nextInTopic":47204,"prevInTime":34639,"nextInTime":34641,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"-=-Upon reading this thread, I thought the words sounded familiar -- then I realized they were mine. I d posted under a different topic about my son being","messageBody":"<div id=\"ygrps-yiv-1559721953\">-=-Upon reading this thread, I thought the words sounded familiar --  <br/>\nthen I<br/>\nrealized they were mine. I&#39;d posted under a different topic about my<br/>\nson being bored and asked for suggestions to &quot;combat&quot; it. -=-<br/>\n<br/>\n<br/>\n<br/>\nThat&#39;s going to happen a lot here, Julie.  We&#39;re discussing the ideas  <br/>\nthemselves separate from the particular authors or situations, very  <br/>\noften.<br/>\n<br/>\nAlso, most people aren&#39;t careful with words.  They throw them around  <br/>\nwithout regard to the huge clues they&#39;re missing about their own  <br/>\nthoughts or moods.   Try not to be defensive if people pick a phrase  <br/>\nup and turn it over.  Eventually you can learn to do it for yourself,  <br/>\nbefore the phrases even come out, and that level of thought is  <br/>\nsomething very valuable.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333814265,"authorName":"Julie","from":"&quot;Julie&quot; &lt;pyrgirl66@...&gt;","profile":"pyrgirl66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Boredom","postDate":"1209959786","msgId":34638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2bTBoYStuMDd2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJEM0FBOTNDLTkyOTItNDE0MC1BOTVCLUY1OTYxRTgyNjc0REBjb3gubmV0Pg=="},"prevInTopic":34614,"nextInTopic":34640,"prevInTime":34637,"nextInTime":34639,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"Upon reading this thread, I thought the words sounded familiar -- then I realized they were mine.  I d posted under a different topic about my son being bored","messageBody":"<div id=\"ygrps-yiv-424730900\">Upon reading this thread, I thought the words sounded familiar -- then I<br/>\nrealized they were mine.  I&#39;d posted under a different topic about my<br/>\nson being bored and asked for suggestions to &quot;combat&quot; it.  I suppose<br/>\nthat was a poorly chosen word to describe it.   Thanks to all of you who<br/>\nreplied in this new thread.  I appreciate your helpfulness.<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; On Wed, Apr 30, 2008 at 1:42 PM, Sandra Dodd Sandra@...<br/>\n&gt; &gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;&gt; -=-However, I don&#39;t know how to combat boredom for him - dealing<br/>\n&gt; &gt;&gt; with<br/>\n&gt; &gt;&gt; that right now. -=-<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; You don&#39;t need to &quot;combat&quot; boredom. It&#39;s not an enemy.<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; You don&#39;t need to do it for him.<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; Change the way you see it, and it might totally disappear.<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; Sandra<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt;<br/>\n </span></blockquote>--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Nancy Wooton &lt;nancywooton@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My always-unschooled son and his fellow homeschooled band mates wrote<br/>\n&gt; and recorded a song called &quot;I&#39;m Bored.&quot; It&#39;s pretty funny &lt;g&gt;<br/>\n&gt;<br/>\n&gt; Nancy<br/>\n&gt;<br/>\n&gt; On Apr 30, 2008, at 4:24 PM, Clarissa Fetrow wrote:<br/>\n&gt;<br/>\n&gt; &gt; I remember when I was a child, boredom was often prelude to<br/>\n&gt; &gt; creativity.<br/>\n&gt; &gt; Clarissa<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284219281,"authorName":"Meghan Anderson-Coates","from":"Meghan Anderson-Coates &lt;meghanandco@...&gt;","profile":"meghanandco","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Boredom","postDate":"1209695134","msgId":34614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1MzMxMS42NjgwMS5xbUB3ZWI1ODYxNS5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":34595,"nextInTopic":34638,"prevInTime":34613,"nextInTime":34615,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"*********** My always-unschooled son and his fellow homeschooled band mates wrote and recorded a song called I m Bored. It s pretty funny  Nancy ","messageBody":"<div id=\"ygrps-yiv-111677582\">***********<br/>\n  My always-unschooled son and his fellow homeschooled band mates wrote <br/>\nand recorded a song called &quot;I&#39;m Bored.&quot; It&#39;s pretty funny &lt;g&gt;<br/>\n<br/>\nNancy<br/>\n<br/>\n  ************<br/>\n   <br/>\n  Hey Nancy,<br/>\n  Did they put it anywhere on the internet (youtube, myspace, etc)? Tamzin would love to hear it (well, so would I).<br/>\n   <br/>\n<br/>\n<br/>\nMeghan<br/>\n   <br/>\n  &quot;How to begin to educate a child. First rule: leave him alone. Second rule: leave him alone. Third rule: leave him alone. That is the whole beginning.&quot;  <br/>\n  ~ DH Lawrence<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Boredom","postDate":"1209599980","msgId":34595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJEM0FBOTNDLTkyOTItNDE0MC1BOTVCLUY1OTYxRTgyNjc0REBjb3gubmV0Pg==","inReplyToHeader":"PGMxMzQ4ODI4MDgwNDMwMTYyNHg2NjMzMTNhY3g2MWY2OTk0N2RhMDkzMWQzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDQ3MDdGMTFDLUEwQUUtNDRGMS04MkVDLUI4MDIzODAzQkRDOUBzYW5kcmFkb2RkLmNvbT4gPGMxMzQ4ODI4MDgwNDMwMTYyNHg2NjMzMTNhY3g2MWY2OTk0N2RhMDkzMWQzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":34594,"nextInTopic":34614,"prevInTime":34594,"nextInTime":34596,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"My always-unschooled son and his fellow homeschooled band mates wrote and recorded a song called I m Bored.  It s pretty funny  Nancy","messageBody":"<div id=\"ygrps-yiv-1196442863\">My always-unschooled son and his fellow homeschooled band mates wrote  <br/>\nand recorded a song called &quot;I&#39;m Bored.&quot;  It&#39;s pretty funny &lt;g&gt;<br/>\n<br/>\nNancy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 30, 2008, at 4:24 PM, Clarissa Fetrow wrote:<br/>\n<br/>\n&gt; I remember when I was a child, boredom was often prelude to  <br/>\n&gt; creativity.<br/>\n&gt; Clarissa<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Wed, Apr 30, 2008 at 1:42 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;  <br/>\n&gt; wrote:<br/>\n&gt;<br/>\n&gt;&gt;  -=-However, I don&#39;t know how to combat boredom for him - dealing  <br/>\n&gt;&gt; with<br/>\n&gt;&gt; that right now. -=-<br/>\n&gt;&gt;<br/>\n&gt;&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n&gt;&gt;<br/>\n&gt;&gt; You don&#39;t need to &quot;combat&quot; boredom. It&#39;s not an enemy.<br/>\n&gt;&gt;<br/>\n&gt;&gt; You don&#39;t need to do it for him.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Change the way you see it, and it might totally disappear.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Sandra<br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;&gt; </span></blockquote></div>","specialLinks":[]},{"userId":340838541,"authorName":"Clarissa Fetrow","from":"&quot;Clarissa Fetrow&quot; &lt;clarissafetrow@...&gt;","profile":"cla1024","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Boredom","postDate":"1209597893","msgId":34594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxMzQ4ODI4MDgwNDMwMTYyNHg2NjMzMTNhY3g2MWY2OTk0N2RhMDkzMWQzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ3MDdGMTFDLUEwQUUtNDRGMS04MkVDLUI4MDIzODAzQkRDOUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ3MDdGMTFDLUEwQUUtNDRGMS04MkVDLUI4MDIzODAzQkRDOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":34585,"nextInTopic":34595,"prevInTime":34593,"nextInTime":34595,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"I remember when I was a child, boredom was often prelude to creativity. Clarissa ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-850148539\">I remember when I was a child, boredom was often prelude to creativity.<br/>\nClarissa<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Apr 30, 2008 at 1:42 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   -=-However, I don&#39;t know how to combat boredom for him - dealing with<br/>\n&gt; that right now. -=-<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n&gt;<br/>\n&gt; You don&#39;t need to &quot;combat&quot; boredom. It&#39;s not an enemy.<br/>\n&gt;<br/>\n&gt; You don&#39;t need to do it for him.<br/>\n&gt;<br/>\n&gt; Change the way you see it, and it might totally disappear.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Boredom","postDate":"1209588149","msgId":34585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MDdGMTFDLUEwQUUtNDRGMS04MkVDLUI4MDIzODAzQkRDOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":34594,"prevInTime":34584,"nextInTime":34586,"topicId":34585,"numMessagesInTopic":0,"msgSnippet":"-=-However, I don t know how to combat boredom for him - dealing with that right now. -=- http://sandradodd.com/BoredNoMore You don t need to combat boredom.","messageBody":"<div id=\"ygrps-yiv-1301997134\">-=-However, I don&#39;t know how to combat boredom for him - dealing with  <br/>\nthat right now. -=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n<br/>\n<br/>\n<br/>\nYou don&#39;t need to &quot;combat&quot; boredom.  It&#39;s not an enemy.<br/>\n<br/>\nYou don&#39;t need to do it for him.<br/>\n<br/>\nChange the way you see it, and it might totally disappear.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":61276,"nextTopicId":61344}}