{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"Home Education Magazine","from":"Home Education Magazine &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM News & Commentary - August 5, 2003","postDate":"1060287957","msgId":78117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkxZWJiNTg2NjRiNWM2OEBbMTIuMjEuMjA5LjEwN10+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":78116,"nextInTime":78118,"topicId":78117,"numMessagesInTopic":0,"msgSnippet":"Homeschooling News & Commentary from Home Education Magazine A weekly report on what s happening in the world of homeschooling Compiled and edited by Ann","messageBody":"<div id=\"ygrps-yiv-1161092879\">Homeschooling News & Commentary from Home Education Magazine<br/>\nA weekly report on what&#39;s happening in the world of homeschooling<br/>\nCompiled and edited by Ann Lahrson Fisher - August 5, 2003<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/whts_nw.html\">http://www.home-ed-magazine.com/whts_nw.html</a><br/>\n<br/>\nIn this issue:<br/>\n<br/>\nThe Camel&#39;s Nose Enters the Homeschooling Tent<br/>\nHomeschooling Bill Introduced in the Senate<br/>\nIdaho - Will Homeschooling Be Regulated?<br/>\nCharter Home-Schooling<br/>\nIn the News<br/>\n$50,000 Homeschooling - update<br/>\nBack to Homeschool<br/>\n<br/>\n+++++++++++++++++++++++++++++++++++++<br/>\nThe Camel&#39;s Nose Enters the Homeschooling Tent<br/>\n+++++++++++++++++++++++++++++++++++++<br/>\n<br/>\nAnn: This week I want to share my thoughts about Section 6 of the <br/>\nproposed homeschooling omnibus bill, HR 2732, which has been <br/>\nmisleadingly dubbed a non-discrimination bill. Several portions of <br/>\nthe bill are better described as special interest amendments, <br/>\nincluding the Coverdell amendment, the focus of this Commentary.<br/>\n<br/>\nWhat it is: The Coverdell Educational Savings Plan offers tax <br/>\nadvantages to families in high tax brackets. The proposed amendment <br/>\nexpands the applicability of the Coverdell to &quot;students privately <br/>\neducated at home under state law.&quot; Under this plan, funds must be <br/>\nused for &quot;qualified elementary and secondary expenses.&quot;<br/>\n<br/>\nI have two major objections to this amendment. First, this amendment <br/>\nhelps a minority of homeschoolers, further entrenching the public <br/>\nview that homeschoolers are indeed a special interest group. If <br/>\nhomeschoolers are seen as a special interest group marching to <br/>\nCongress, the deregulation moves in heavily regulated states are <br/>\nundermined. One sound argument for deregulation, that homeschoolers <br/>\nask for no special privileges and no tax dollars and thus should be <br/>\nleft alone, is lost if this amendment passes.<br/>\n<br/>\nThe risks of perpetuating homeschooling as a special interest group <br/>\npale, though, when compared to my second major objection, that of <br/>\ninviting the federal camel&#39;s nose into our homeschooling tent. This <br/>\namendment is a generous invitation for federal meddling in issues <br/>\nthat are best handled on the state or individual levels. That <br/>\ninvitation will not be turned down.<br/>\n<br/>\nThe invitation is straightforward: the definition of &quot;qualified <br/>\nelementary and secondary expenses&quot; will need clarification. The IRS <br/>\ndefinition (under the Coverdell Plan as it now stands) is consistent <br/>\nwith traditional public and private schooling: tuition, fees, books, <br/>\nsupplies, equipment, special needs, room and board, even computers <br/>\nand software that is predominately educational in nature. <br/>\nHomeschoolers&#39; expenses, however, vary widely from those of their <br/>\nschooled counterparts. Homeschoolers using the Coverdell will not <br/>\nwant to be restricted to the limitations of these school-type <br/>\nexpenses. Therefore, if this amendment passes, the IRS will seek a <br/>\ndefinition of qualified expenses for homeschooling.<br/>\n<br/>\nYou may wonder how the IRS might go about the task of defining <br/>\nhomeschooling expenses. It is a simple matter, really, for one <br/>\nfederal agency to ask another agency for information. The Department <br/>\nof Education would probably commission a study of homeschooling. Or <br/>\npossibly, since homeschooling takes place in the home, the Department <br/>\nof Health and Human Services will jump on board with a commissioned <br/>\nstudy to define the type of home and family life that produces <br/>\nsuccessful homeschooled students.<br/>\n<br/>\nWho might carry out such a study? A state university, perhaps the U. <br/>\nof Washington or the U. of Michigan, might take on the task. If a <br/>\nstudy of homeschooling were contracted out to private agencies, an <br/>\nestablished homeschooling organization - perhaps one in Pennsylvania, <br/>\nVirginia, or Oregon - could win the project. Maybe even a charter <br/>\nschool curriculum provider such as K12 would put in a bid.<br/>\n<br/>\nStop and think about that. An institutional study of homeschooling, <br/>\nmandated by the IRS and put up for bid by DOE or DHHS, would take the <br/>\nfirst steps to define legitimate homeschooling practice.<br/>\n<br/>\nWould information gleaned from such a study be used strictly for its <br/>\nintended original purpose? Don&#39;t believe it. Any such study would be <br/>\navailable to the public, to be used widely for purposes I can only <br/>\nimagine. Other studies would surely follow, and the definition of <br/>\nhomeschooling would become narrower and narrower.<br/>\n<br/>\nWe must also expect mission creep, the idea that many an agency or <br/>\nidea starts out small, with good and helpful intentions, and over <br/>\ntime, grows into a bureaucratic nightmare. Hmm, mission creep <br/>\nexamples that pop into mind include public schools, standardized <br/>\ntesting, income tax, the DOE, the DHHS, and Social Security - there <br/>\nare many more. Mission creep is inevitable when government involves <br/>\nitself in private affairs. Just as the camel&#39;s nose is followed by <br/>\nthe entire camel, agency expansion follows the poking of the federal <br/>\nnose into private matters.<br/>\n<br/>\nDo we really want to invite the feds into the homeschooling tent? The <br/>\nCoverdell amendment is a gold-embossed invitation.<br/>\n<br/>\nTo sum up: The Coverdell amendment, if passed, offers tax benefits to <br/>\na minority of homeschoolers, opening the door for federal agencies to <br/>\ntake further interest in homeschooling. Once that door is open, our <br/>\nhistorical understanding of how government agencies expand tells us <br/>\nthat the door will swing wider and it will not close. That the <br/>\nCoverdell amendment also casts homeschooling as a special interest <br/>\ngroup exacerbates the problem.<br/>\n<br/>\nI urge you to read this bill and think through the possible <br/>\nramifications for yourself. The bill is short, eight pages, and can <br/>\nbe found at <a rel=\"nofollow\" target=\"_blank\" href=\"http://frwebgate.access.gpo.gov\">http://frwebgate.access.gpo.gov</a> If you want to discuss HR <br/>\n2732 online or read what others are thinking, there are a number of <br/>\nonline discussions going on, including the Yahoo group <br/>\nAHA-PoliticalAction (To subscribe, send a message to <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AHA-PoliticalAction-subscribe@yahoogroups.com\">AHA-PoliticalAction-subscribe@yahoogroups.com</a> ) and the NHEN Forum at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nhen.org/forum\">http://www.nhen.org/forum</a><br/>\n<br/>\nWhen you call or E-mail your Representative:<br/>\nIf your Representative has co-sponsored HR 2732, ask him/her to <br/>\nwithdraw support. If you have already written or called in favor of <br/>\nthe bill, tell your Representative that you&#39;ve changed your mind and <br/>\nwhy. You might point out the following:<br/>\nA. Homeschooling is private education and we do not want special <br/>\nconsideration nor do we want special interest group status.<br/>\nB. Helping a few homeschoolers take advantage of the Coverdell <br/>\nAmendment compromises private status and is not in the best interest <br/>\nof all homeschoolers.<br/>\nC. Other issues in this bill are better handled at the state level, <br/>\non the individual level, or by working to improve the law for all <br/>\ncitizens.<br/>\n<br/>\nAnd now for the news...<br/>\nTo read the rest of this NewsComm issue, click here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/whts_nw.html\">http://www.home-ed-magazine.com/whts_nw.html</a><br/>\n<br/>\nHEM News & Commentary is a weekly report on what&#39;s happening in the <br/>\nworld of homeschooling. Gleanings from the news media, accolades and <br/>\npans, hot discussions, legal and legislative successes and problems - <br/>\nall are fair game, and gathered in one column for your convenience.<br/>\n<br/>\nAnd just in case you don&#39;t have the time to read every word in print, <br/>\nwe will summarize and discuss key news and trends that we think are <br/>\nthe most provocative or that may have the greatest impact on the <br/>\nfuture of homeschooling.<br/>\n<br/>\nThis service is available free. Archives can be accessed at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/nc/newscommentary.html\">http://www.home-ed-magazine.com/nc/newscommentary.html</a><br/>\n<br/>\nThe weekly updates will additionally be announced on HEM&#39;s discussion <br/>\nlists. You&#39;ll find a print version - the highlights of these reports <br/>\n- in a column by the same name in Home Education Magazine.<br/>\n<br/>\nYour opinions and feedback are always welcome. Contact me.<br/>\nAnn Lahrson-Fisher<br/>\nHEM News & Commentary<br/>\nmailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newscomm@...\">newscomm@...</a></div>","specialLinks":[]}],"prevTopicId":78111,"nextTopicId":78120}}