{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What To Do When THEY Ask To &quot;Stop Unschooling&quot;?","postDate":"1368487379","msgId":71486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttcnNraitsaTdiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUxOTEyMUY4LjkwNjA1MDZAbGl2aW5nam95ZnVsbHkuY2E+"},"prevInTopic":71485,"nextInTopic":0,"prevInTime":71485,"nextInTime":71487,"topicId":71470,"numMessagesInTopic":0,"msgSnippet":"... Given that she s been schooled/homeschooled before, she may be sort of panicking, thinking She s now suddenly in charge of Learning What She Needs To Know.","messageBody":"<div id=\"ygrps-yiv-1749309511\">Pam Laricchia &lt;pam@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Structure doesn&#39;t &quot;have to&quot; mean curriculum. Talk about what she&#39;d like to do with her days. From a bigger perspective than in the moment. Maybe she&#39;s<br/>\n&gt; looking for some higher-level goals. Would she like to read every day? Get some physical movement? Write in a journal? Do some daily online<br/>\n&gt; reading/research on a particular interest she has?<br/>\n<br/>\n </span></blockquote>Given that she&#39;s been schooled/homeschooled before, she may be sort of panicking, thinking She&#39;s now suddenly in charge of Learning What She Needs To Know. Some kids feel that way when parents transition to unschooling - like they&#39;ve been left to flounder. So talking to your daughter about what she wants to do, helping her think and plan, could also help reassure her that she&#39;s not being left to her own devices.<br/>\n<br/>\nIt might also help for you to talk about how you make your own goals, as an adult - how do you decide what&#39;s important to you? How do you figure out how to pursue your goals? That could help her have some ideas for how she wants to spend her time and it could also let her see that adults aren&#39;t &quot;finished&quot; - this process of deciding what to do, what&#39;s important, what you want to learn is lifelong, not something you graduate from. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What To Do When THEY Ask To &quot;Stop Unschooling&quot;?","postDate":"1368483810","msgId":71485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBDQzQyQjU1LUIzRTItNDE0Ri04QjIyLTVFMTlEOTRBQkNBNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGttcmpiaitqZXA4QGVHcm91cHMuY29tPg==","referencesHeader":"PGttcmpiaitqZXA4QGVHcm91cHMuY29tPg=="},"prevInTopic":71482,"nextInTopic":71486,"prevInTime":71484,"nextInTime":71486,"topicId":71470,"numMessagesInTopic":0,"msgSnippet":"This is very sweet, sukaynalabboun -=-BUT, after trying and reading and allowing things to unfold (meaning giving deschooling a chance as Sandra suggested),","messageBody":"<div id=\"ygrps-yiv-1758788298\">This is very sweet, sukaynalabboun <br/>\n<br/>\n-=-BUT, after trying and reading and allowing things to &#39;unfold&#39; (meaning giving deschooling a chance as Sandra suggested), we all began to see the richness of our lives and all the learning that was going on.<br/>\n<br/>\n-=-I am posting to encourage you to give what Sandra is saying here a try- for a bit longer- as unschooling has really become something beautiful in our home, and had we gone back to a curriculum or schedule, we would have made the process of getting *here* much longer or even impossible. We are all loving our lives and adventures; there is so much more peace and sheer joy in our lives- and the kids are now super confident and not voicing those concerns. I owe so much to the list members for all the advice and suggestions they have offered. -=-<br/>\n<br/>\nIt&#39;s particularly nice to see right now, as someone earlier today hated SO MUCH that I was asking her to stop posting and to follow the links, and that she should read a little, try a little, wait a while and watch, and to read Pam Laricchia&#39;s intro....  she said later that I was an asshat and a bitch.   <br/>\n<br/>\nI don&#39;t think she will get to peace and sheer joy very soon.   I didn&#39;t know, while I was working on putting this on my facebook page (a re-post, kind of, of something from Saturday when people were so busy)...<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.blogspot.com/2013/05/a-dogwood-tree-for-lori-odhner.html\">http://sandradodd.blogspot.com/2013/05/a-dogwood-tree-for-lori-odhner.html</a><br/>\n...that someone who doesn&#39;t even know me would be assuring people who don&#39;t know me that I&#39;m all kinds of terrible.   And the top of her page said &quot;I am Grateful for this life,&quot; but she didn&#39;t seem very happy with her kids, or unschooling, or where she lives.  Lots of people were trying to help but (as happens) she focused an enormous beam of negativity on me, deleted the whole topic, and left.<br/>\n<br/>\nI&#39;m not going to stop helping people yet, but it&#39;s another frustration.<br/>\n<br/>\nI&#39;m always glad when people CAN take these ideas so many unschoolers have collected and make their children&#39;s lives better with them.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":522719163,"authorName":"sukaynalabboun","from":"&quot;sukaynalabboun&quot; &lt;sukaynalabboun@...&gt;","profile":"sukaynalabboun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What To Do When THEY Ask To &quot;Stop Unschooling&quot;?","postDate":"1368477875","msgId":71482,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttcmpiaitqZXA4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBFRDIxMTE0LTE5NkMtNEI2OS04Mzk3LTA0RTM5RTZBQUNBMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71476,"nextInTopic":71485,"prevInTime":71481,"nextInTime":71483,"topicId":71470,"numMessagesInTopic":0,"msgSnippet":"We have been unschooling for a little over a year and a half now. My eldest daughter (now 15) went through alot of worrying about learning on a schedule,","messageBody":"<div id=\"ygrps-yiv-774526140\">We have been unschooling for a little over a year and a half now. My eldest daughter (now 15) went through alot of worrying about learning on a schedule, keeping up, the future, college admissions, etc when we first started out. It was hard!! It raised my own doubts! BUT, after trying and reading and allowing things to &#39;unfold&#39; (meaning giving deschooling a chance as Sandra suggested), we all began to see the richness of our lives and all the learning that was going on.<br/>\n<br/>\n I am posting to encourage you to give what Sandra is saying here a try- for a bit longer- as unschooling has really become something beautiful in our home, and had we gone back to a curriculum or schedule, we would have made the process of getting *here* much longer or even impossible.  We are all loving our lives and adventures; there is so much more peace and sheer joy in our lives- and the kids are now super confident and not voicing those concerns. I owe so much to the list members for all the advice and suggestions they have offered.<br/>\n<br/>\nMaybe you could try some of the suggestions already listed (more strewing, trying out the things you couldn&#39;t do if they were in school out in the real world). That helped alot at first- opening up the world for them and helping them to choose what interested them during deschooling- which helped *them* to see how much we *could* be doing.<br/>\n<br/>\n Again, as Sandra said, until you deschool a bit longer, you are still viewing what you are or aren&#39;t doing through that filter.</div>","specialLinks":[]},{"userId":231154952,"authorName":"Pam Laricchia","from":"Pam Laricchia &lt;pam@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What To Do When THEY Ask To &quot;Stop Unschooling&quot;?","postDate":"1368465912","msgId":71476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxOTEyMUY4LjkwNjA1MDZAbGl2aW5nam95ZnVsbHkuY2E+","inReplyToHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPg==","referencesHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPg=="},"prevInTopic":71475,"nextInTopic":71482,"prevInTime":71475,"nextInTime":71477,"topicId":71470,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2133950067\">&lt;&lt; Her reason sounded very thought out and mature: &quot;My brain doesn&#39;t work right when I have too many choices. I can&#39;t make a decision! I really want<br/>\nto try a schedule and doing work. I think that will help my brain relax.&quot; &gt;&gt;<br/>\n<br/>\nInstead of hoping this is a passing phase, I&#39;d be more tempting to see it as a deschooling in action. She&#39;s getting to know herself, how she ticks.<br/>\nShe has a hypothesis about the environment in which she feels comfortable and now you can help her test it. Chat with her as she figures out ways to<br/>\nset up her days so her brain can relax. Talk through things ahead of time so that in the moment she doesn&#39;t feel overwhelmed with too many choices.<br/>\n<br/>\nStructure doesn&#39;t &quot;have to&quot; mean curriculum. Talk about what she&#39;d like to do with her days. From a bigger perspective than in the moment. Maybe she&#39;s<br/>\nlooking for some higher-level goals. Would she like to read every day? Get some physical movement? Write in a journal? Do some daily online<br/>\nreading/research on a particular interest she has? You can be her note-taker as she talks through what she&#39;d like a typical day to look like. Ask if<br/>\nshe&#39;d like you to make a table out of it, if she&#39;d like to make it into a kind of to do list where she ticks stuff off each day. The key is not to<br/>\nhave any of your own expectations, but to just help her explore. Chat with her about how her days went, how she felt (more relaxed? did she change the<br/>\nplan up on the fly? did she find herself pushing against her own control?). Help her tweak the plan based on her own feedback. Maybe it&#39;ll drop by the<br/>\nwayside altogether eventually, but she&#39;ll be learning so much about herself along the way.<br/>\n<br/>\nAlongside that, as Joyce suggested, maybe make more plans to help her days feel more purposeful. Plans that involve her, and her brother if he&#39;s<br/>\ninterested. The plans don&#39;t necessarily even need to involve going out places, but they might help her feel more accomplished. Especially if the<br/>\nthings she puts on her &quot;to do&quot; list look more schooly, bring other activities into her life where she encounters lots of learning that doesn&#39;t look<br/>\nlike school. It&#39;ll help her explore her ideas about learning.<br/>\n<br/>\nPam L<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What To Do When THEY Ask To &quot;Stop Unschooling&quot;?","postDate":"1368465175","msgId":71475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBFRDIxMTE0LTE5NkMtNEI2OS04Mzk3LTA0RTM5RTZBQUNBMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPg==","referencesHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPg=="},"prevInTopic":71473,"nextInTopic":71476,"prevInTime":71474,"nextInTime":71476,"topicId":71470,"numMessagesInTopic":0,"msgSnippet":"-=-Her reason sounded very thought out and mature: My brain doesn t work right when I have too many choices. I can t make a decision! I really want to try a","messageBody":"<div id=\"ygrps-yiv-270412234\">-=-Her reason sounded very thought out and mature: &quot;My brain doesn&#39;t work right when I have too many choices. I can&#39;t make a decision! I really want to try a schedule and doing work. I think that will help my brain relax.&quot;-=-<br/>\n<br/>\nI woud say &quot;let&#39;s wait until September, when school would have started again&quot; (or January if you&#39;re in Australia, or whenever, wherever).   Because if she was in school until January, and she went to school for five years or more, this isn&#39;t enough time for deschooling.  And if in your house you have montessori materials and you call that &quot;work,&quot; that will not help them deschool.  You still have &quot;a school&quot; on the shelf.   I would pack that up quietly and put some interesting things on that shelf.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections\">http://sandradodd.com/connections</a><br/>\nRead a little, try a little, wait a while, and watch.<br/>\n<br/>\nIf you &quot;do school&quot; even a little, your deschooling starts over.  <br/>\n<br/>\nAnd your daughter will get it before you do.  Expect your own thoughts to turn toward school for a year and a half or two, even after she&#39;s comfortable with unschooling.<br/>\n<br/>\n-=-As far as I know, she hasn&#39;t had any interactions with anyone that may have tried to sway her in this way. -=-<br/>\n<br/>\nAll her life up to this moment has swayed her that way.<br/>\n<br/>\n-=-She&#39;s even taken to looking at curriculum sets online.<br/>\nI am not sure where to go with this...-=-<br/>\n<br/>\nTell her to look at the prices. :-)<br/>\nOffer her half of that to forget the whole thing, maybe.  It would be better for all of you.<br/>\n<br/>\n-=-Do I go with it, find curriculum, and give her the &quot;structured&quot; day she&#39;s asking for? -=-<br/>\n<br/>\nOnly if you aren&#39;t too attached to the idea of unschooling.<br/>\n<br/>\n-=-Or do I keep doing what we&#39;re doing and hope this is a passing phase?-=-<br/>\n<br/>\nThose extremes are not the only two choices.<br/>\n<br/>\nIt might be a passing phase, if you can pay more attention to her doing things that are not schoolish.  <br/>\nIt will be a passing phase if you really look into what will help with deschooling, and be more aware of how many months you should work on that.  Not just wait for that, but consciously move toward natural learning.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What To Do When THEY Ask To &quot;Stop Unschooling&quot;?","postDate":"1368462343","msgId":71473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTE3My1EUzE2OEQ1N0JBOTJFMTIxNjJCQTcwOUFDNEEwMEBwaHguZ2JsPg==","inReplyToHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPg==","referencesHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPg=="},"prevInTopic":71472,"nextInTopic":71475,"prevInTime":71472,"nextInTime":71474,"topicId":71470,"numMessagesInTopic":0,"msgSnippet":"-=-My daughter came up to me yesterday and said something that shocked and surprised me. Mama, she said, I think we should stop unschooling and do some","messageBody":"<div id=\"ygrps-yiv-813495104\">-=-My daughter came up to me yesterday and said something that shocked and surprised me. &quot;Mama,&quot; she said, &quot;I think we should stop unschooling and do some &#39;real&#39; school&quot;. -=-<br/>\n<br/>\nWe have been unschooling this year and my daughter (10) goes through this periodically, too.  When she says she wants to &quot;do school&quot; I ask her what part of school she is missing or interested in doing.  Sometimes she is missing science so we do some experiments together.  Sometimes I print out worksheets that I find online & she enjoys doing those for about a day.  I think what she really means is that she is wanting me to come up with some interesting ideas and do them with her.  It seems to be a desire for attention, input, guidance, reassurance.  We will do something a little more schoolish for a day or so & then she&#39;s off & running with her own agenda again.  Sometimes my kids get insecure that they&#39;re not learning as much as their schooled peers so I point out to them all the wonderful stuff they&#39;ve been learning.  My son was worried that he&#39;s not learning multiplication so we talked about the idea for awhile - I.e. If you said you only wanted 4 chicken nuggets but they tasted so good that you decided you wanted 4 more and those were so good you went back for another 4, how many nuggets would you have eaten?  4 nuggets 3 times = 12 nuggets.   That made the concept understandable.  He continued to express interest in learning more so I printed out some multiplication worksheets & a times table chart.  We talked about the chart because he was interested & I told him he could do the worksheets if he wanted, which he did.  I told him he could use the chart or a calculator if he wanted.  He really enjoyed doing those worksheets for about a day & a half.  Eventually I recycled the unfinished sheets as he lost interest.<br/>\n<br/>\nAlso, in her imagination my daughter is remembering all the best, familiar stuff and forgetting about the things she hated about school.  We&#39;ve gone back to her school a couple of times and both times she left remembering exactly why she withdrew from school in the first place.  Try to find out what she is missing about school & give her that - without committing a lot of time or money to new curriculums.  Likely she will tire of the structure shortly but will feel reassured that she can get her needs met at home.<br/>\n-Cass<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: supermomblues&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:supermom2jakeandemmy@...\">supermom2jakeandemmy@...</a>&gt; <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; <br/>\n  Sent: Monday, May 13, 2013 8:36 AM<br/>\n  Subject: [AlwaysLearning] What To Do When THEY Ask To &quot;Stop Unschooling&quot;?<br/>\n<br/>\n<br/>\n    <br/>\n  My daughter is nine. We have only been homeschooling since January, so we really haven&#39;t &quot;jumped in&quot; to anything. We have been primarily unschooling because that&#39;s just what we fell into. I have a shelf with Montessori materials that they(her brother and she) are free to use when they choose to, but I don&#39;t &quot;make&quot; them do any of it. They spend most days on the computer, reading, doing puzzles, and doing &quot;works&quot; off the shelf, as they chose. <br/>\n<br/>\n<br/>\n  Now, I have to stress this, because I know it&#39;s going to come up in question - my parents, my husband&#39;s parents, and my husband are all 100% supportive of what we&#39;ve been doing in our home. As far as I know, she hasn&#39;t had any interactions with anyone that may have tried to sway her in this way. <br/>\n<br/>\n  Her reason sounded very thought out and mature: &quot;My brain doesn&#39;t work right when I have too many choices. I can&#39;t make a decision! I really want to try a schedule and doing work. I think that will help my brain relax.&quot;<br/>\n<br/>\n  I asked her if she liked doing work on the computer, going to the library, going on nature walks - some of the things we do often. <br/>\n<br/>\n  &quot;Yes, but I also think I need to do other stuff too. I think I need more . . . Mama, I don&#39;t know what the word is (this is where I offered the word &#39;structure&#39;) - yeah! Structure!&quot;<br/>\n<br/>\n  I asked her if someone had been talking to her about it, and she said that &quot;no, I just thought of it myself.&quot; <br/>\n<br/>\n  She&#39;s even taken to looking at curriculum sets online.<br/>\n<br/>\n  I am not sure where to go with this...<br/>\n  Do I go with it, find curriculum, and give her the &quot;structured&quot; day she&#39;s asking for? Or do I keep doing what we&#39;re doing and hope this is a passing phase? Any thoughts and advice would be greatly appreciated.<br/>\n<br/>\n  Thanks<br/>\n  *Jen*<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What To Do When THEY Ask To &quot;Stop Unschooling&quot;?","postDate":"1368459299","msgId":71472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3OEIwODg0LTIyQkYtNEJEMC1CMkI3LUI4MEMyMjk3QkE4NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDY5OUUxOUU4LTBFNjQtNDg5NC04MTBELTBBMDc5RDU0MkE2RUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPiA8Njk5RTE5RTgtMEU2NC00ODk0LTgxMEQtMEEwNzlENTQyQTZFQHZlcml6b24ubmV0Pg=="},"prevInTopic":71471,"nextInTopic":71473,"prevInTime":71471,"nextInTime":71473,"topicId":71470,"numMessagesInTopic":0,"msgSnippet":"-=-Connect with them :-) Do things together. Fly kites. Have conversations. Visit a new ice cream shop. A new play ground. How does it compare to the one","messageBody":"<div id=\"ygrps-yiv-2114949376\">-=-Connect with them :-) Do things together. Fly kites. Have conversations. Visit a new ice cream shop. A new play ground. How does it compare to the one they&#39;re used to? What to do they like better, like not as much? -=-<br/>\n<br/>\nIn a similar way, sometimes when a family has had meals that kids &quot;had to finish&quot; so they could get dessert, and rules about tasting everything, the parents can jump too far too fast, and tell the kids the&#39;ll feed them what they want to eat. After a while, though, if they&#39;re still just asking the kids &quot;What do you want to eat?&quot; they&#39;ll start getting &quot;nothing,&quot; or &quot;I don&#39;t know.&quot; <br/>\n<br/>\nProbably at least once a day (sometimes more) there should be something cooked that smells really good.  Much of eating is smell.  Maybe they&#39;ll want that food, or maybe it will make them hungry for something else.  <br/>\n<br/>\nSo back to the curriculum/enrichment/focus idea.  There are ideas available!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<br/>\nHere&#39;s a good way to get to know a kid better when things have become awkward or strained:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n(It works in close relationships, too.)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What To Do When THEY Ask To &quot;Stop Unschooling&quot;?","postDate":"1368458239","msgId":71471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5OUUxOUU4LTBFNjQtNDg5NC04MTBELTBBMDc5RDU0MkE2RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPg==","referencesHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPg=="},"prevInTopic":71470,"nextInTopic":71472,"prevInTime":71470,"nextInTime":71472,"topicId":71470,"numMessagesInTopic":0,"msgSnippet":"... Why would you not help her explore an avenue she thinks might help a problem? Whatever she tries, she ll learn more about herself, about her problem, about","messageBody":"<div id=\"ygrps-yiv-959220881\">On May 13, 2013, at 10:36 AM, supermomblues wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Or do I keep doing what we&#39;re doing and hope this is a passing phase? <br/>\n<br/>\n </span></blockquote>Why would you not help her explore an avenue she thinks might help a problem? Whatever she tries, she&#39;ll learn more about herself, about her problem, about the world.<br/>\n<br/>\nI wouldn&#39;t go whole hog on the curriculum! That could get expensive. The descriptions can sound way more intriguing than the actual curriculum.<br/>\n<br/>\nAsk her questions about what sounds interesting in the curriculum or whatever she&#39;s looking at. Get to know her better :-)<br/>\n<br/>\nBut ALSO, and more importantly, plan more activities to do together. Schedule your week. Ask what places they&#39;d like to go to. Add in things you think they&#39;d like. Find an unschooling/homeschooling park gathering.<br/>\n<br/>\nFrom your description it sounds like you&#39;ve stepped back to let them do whatever they want. Which can be a good avenue when deschooling if a child felt controlled and pressured to learn. But it sounds like they&#39;re ready for stuff. Since they&#39;ve had little exposure to the world, they can&#39;t ask to see a Shakespeare play or a tractor pull if they don&#39;t know such exists ;-) It&#39;s up to you to show them cool stuff. It&#39;s up to you to help them explore what intrigues them.<br/>\n<br/>\nConnect with them :-) Do things together. Fly kites. Have conversations. Visit a new ice cream shop. A new play ground. How does it compare to the one they&#39;re used to? What to do they like better, like not as much? <br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":547671143,"authorName":"supermomblues","from":"&quot;supermomblues&quot; &lt;supermom2jakeandemmy@...&gt;","profile":"supermomblues","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What To Do When THEY Ask To &quot;Stop Unschooling&quot;?","postDate":"1368455796","msgId":71470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttcXRwaytybW11QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":71471,"prevInTime":71469,"nextInTime":71471,"topicId":71470,"numMessagesInTopic":0,"msgSnippet":"My daughter is nine. We have only been homeschooling since January, so we really haven t jumped in to anything. We have been primarily unschooling because","messageBody":"<div id=\"ygrps-yiv-1172944308\">My daughter is nine. We have only been homeschooling since January, so we really haven&#39;t &quot;jumped in&quot; to anything. We have been primarily unschooling because that&#39;s just what we fell into. I have a shelf with Montessori materials that they(her brother and she) are free to use when they choose to, but I don&#39;t &quot;make&quot; them do any of it. They spend most days on the computer, reading, doing puzzles, and doing &quot;works&quot; off the shelf, as they chose. <br/>\n<br/>\nMy daughter came up to me yesterday and said something that shocked and surprised me. &quot;Mama,&quot; she said, &quot;I think we should stop unschooling and do some &#39;real&#39; school&quot;.<br/>\n<br/>\nNow, I have to stress this, because I know it&#39;s going to come up in question - my parents, my husband&#39;s parents, and my husband are all 100% supportive of what we&#39;ve been doing in our home. As far as I know, she hasn&#39;t had any interactions with anyone that may have tried to sway her in this way. <br/>\n<br/>\nHer reason sounded very thought out and mature: &quot;My brain doesn&#39;t work right when I have too many choices. I can&#39;t make a decision! I really want to try a schedule and doing work. I think that will help my brain relax.&quot;<br/>\n<br/>\nI asked her if she liked doing work on the computer, going to the library, going on nature walks - some of the things we do often. <br/>\n<br/>\n&quot;Yes, but I also think I need to do other stuff too. I think I need more . . . Mama, I don&#39;t know what the word is (this is where I offered the word &#39;structure&#39;) - yeah! Structure!&quot;<br/>\n<br/>\nI asked her if someone had been talking to her about it, and she said that &quot;no, I just thought of it myself.&quot; <br/>\n<br/>\nShe&#39;s even taken to looking at curriculum sets online.<br/>\n<br/>\nI am not sure where to go with this...<br/>\nDo I go with it, find curriculum, and give her the &quot;structured&quot; day she&#39;s asking for? Or do I keep doing what we&#39;re doing and hope this is a passing phase? Any thoughts and advice would be greatly appreciated.<br/>\n<br/>\nThanks<br/>\n*Jen*</div>","specialLinks":[]}],"prevTopicId":71455,"nextTopicId":71494}}