{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":31,"messages":[{"userId":89402294,"authorName":"milgrom family","from":"&quot;milgrom family&quot; &lt;milgrom8660@...&gt;","profile":"milgrom8660","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"my lovely daughter","postDate":"1057328837","msgId":76135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGQwMWMzNDIzOCQ1ZjNkZTcwMCRjYzBkNjcxOEBDUjQ2ODU0N0E+"},"prevInTopic":76068,"nextInTopic":76172,"prevInTime":76134,"nextInTime":76136,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"Kate, I don t have experience with evaluations but I do have experience with a child who prefers only mommy. When my youngest was born he preferred me to","messageBody":"<div id=\"ygrps-yiv-1126144285\">Kate,<br/>\n<br/>\nI don&#39;t have experience with evaluations but I do have experience with a child who prefers only mommy.<br/>\n<br/>\nWhen my youngest was born he preferred me to anyone.  He would only be comforted by me and cried if I had to leave the house.  One time at 3years old I was going out and he headed upstairs to his room crying.  I asked where he was going and he just said I&#39;ll stay in my room til you get home.  My husband is a very sensitive caring guy.  All this hurt his feelings terribly.  I think he compensated by spending more time with our older son.  The younger responded by distancing himself even more from his dad.  Once I heard the younger one say to his brother &quot;That&#39;s my mommy YOU have a Daddy&quot;.  <br/>\nThe point is I think that my husband&#39;s hurt response helped create the distance between them.  Your husband thinks (or has been convinced by others) that there is something wrong with your daughter for preferring you.  That message is easily picked up by your daughter even though he may never mention it in her presence.  <br/>\nOr maybe your husband wants to know there is something wrong with your daughter so that means there is nothing wrong with him.  If he could accept the fact that there doesn&#39;t have to be anything wrong with either him or her for her to prefer you it might be easier on him.  <br/>\nWriting this has got me thinking about that time in our lives and I remember we were under a lot of stress.  Both Irwin and I were working - him building his business and I building my practise and both of us fighting a lot.  Since I had nursed Jordan for 13 months and spent more time with him ( I worked from home) of course he clung to me rather than to his father.  He clung because the stress and fighting made him insecure and to me rather than his father as I was the one meeting most of his needs.  <br/>\nYou mentioned that you and your husband are in counselling.  If there has been a lot of stress prior to your getting counselling perhaps your daughter has picked up on that and her clinginess is simply a survival strategy.  <br/>\nI know that when  the stress levels in our house went down, the clinging eventually stopped. <br/>\n<br/>\nI hope this will help in some way. <br/>\n<br/>\nStella<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057261695","msgId":76068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjOC5jMzU5OTU1LjJjMzVlMjdmQGFvbC5jb20+"},"prevInTopic":76042,"nextInTopic":76135,"prevInTime":76067,"nextInTime":76069,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"... When I had my first, my sister s kids were 4 and 8.  They were 5 and 9 when my second came.  In that time period, her youngest was no longer allowed on her","messageBody":"<div id=\"ygrps-yiv-964284751\"><blockquote><span title=\"ireply\">&gt; Mil kept telling her that she was too big to be on my lap and to<br/>\n&gt; get off.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>When I had my first, my sister&#39;s kids were 4 and 8.  They were 5 and 9 when <br/>\nmy second came.  In that time period, her youngest was no longer allowed on her <br/>\nlap.  He became unbelievable jealous, because I had two kids on my lap.  Who <br/>\nknew there was an age limit?  Now that my son is almost 5, I can&#39;t wait for <br/>\nthese discussions to happen in my family too.  <br/>\n<br/>\nI remember when they were 6 and 18 months I finally had it with my father <br/>\ntelling me I was spoiling the oldest by carrying him at the same time as the <br/>\nyoungest.  So I gave my daughter to my father and let him hold her screaming for a <br/>\nfew minutes until he relented and passed her back.  <br/>\n<br/>\nI just don&#39;t get it.  But I&#39;m beyond the point of needing or seeking their <br/>\napproval and have told them that.  It stopped some of their nagging, but not <br/>\nall.  <br/>\n<br/>\nI feel for you, but agree with the other responses, follow your instincts.  <br/>\nYou&#39;ve had a professional enough evaluation here, tell your mil that the <br/>\njudgement is that she is wrong and you are right!<br/>\n<br/>\nElizabeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"starsuncloud@netzero.net","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"my lovely daughter","postDate":"1057241778","msgId":76042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwNzAzLjEwMTY1MC4xNTI3Mi44MzA1NEB3ZWJtYWlsMDUubnljLnVudGQuY29tPg=="},"prevInTopic":76039,"nextInTopic":76068,"prevInTime":76041,"nextInTime":76043,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"Long story, I know, but I wanted to let you know that I commiserate and I am convinced that Unschooling-type parenting is the ONLY solution for spirited or","messageBody":"<div id=\"ygrps-yiv-1265248688\">&quot;Long story, I know, but I wanted to let you know that I commiserate and I am<br/>\nconvinced that Unschooling-type parenting is the ONLY solution for<br/>\n&quot;spirited&quot; or &quot;high needs&quot; children.  Really, these children<br/>\n NEED us MORE.&quot;<br/>\n<br/>\nI agree.<br/>\nWhile I feel that pretty much all children have special genius about them, I do think your dd was very verbal at such a young age! It&#39;s always interesting to me since Jalen is still using single words and lots of tones to let us know what he wants...he&#39;s 2.5.<br/>\n<br/>\nAnd I do think the unschooling lifestyle is the ONLY way to avoid squashing their little spirits.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057240332","msgId":76039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCMkEwMTMzLjI5RjklYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNTcyMDM2MjMuMTE2MjkuNDQ1NzcubTVAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":76020,"nextInTopic":76042,"prevInTime":76038,"nextInTime":76040,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"... Daddy, Daddy, Daddy happened here about 6 months before my husband deployed. It sucks. brenda happy today, though, because her husband called last night!","messageBody":"<div id=\"ygrps-yiv-581155095\">7/3/03 05:40:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ben used to get upset that Cameron only wanted ME. He said, &quot;It&#39;s always,<br/>\n&gt; &#39;Mommy, Mommy, Mommy&#39;. When will it ever be &#39;Daddy, Daddy, Daddy&#39;?<br/>\n<br/>\n </span></blockquote>Daddy, Daddy, Daddy happened here about 6 months before my husband deployed.<br/>\nIt sucks.  <br/>\n<br/>\nbrenda<br/>\nhappy today, though, because her husband called last night!  :)</div>","specialLinks":[]},{"userId":7527178,"authorName":"CelticFrau@aol.com","from":"CelticFrau@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: my lovely daughter","postDate":"1057206774","msgId":76020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMi5jMGQyMDE2LjJjMzUwYmY2QGFvbC5jb20+"},"prevInTopic":76016,"nextInTopic":76039,"prevInTime":76019,"nextInTime":76022,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/2003 11:57:42 PM Eastern Standard Time, ... To me, this is all the proof you need to know  that anything she says should be flushed down","messageBody":"<div id=\"ygrps-yiv-1233728224\">In a message dated 7/2/2003 11:57:42 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamondair@...\">diamondair@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; how we were too lenient with her (my mother thinks this<br/>\n&gt; &gt;also) and needed to punish this sort of behavior, about how she&#39;s <br/>\n&gt; raised<br/>\n&gt; &gt;7 kids and knows what she is talking about (btw, of those 7, all <br/>\n&gt; except<br/>\n&gt; &gt;my husband have been divorced at least twice, 2 of them have been <br/>\n&gt; in and<br/>\n&gt; &gt;out of jail, at least 2 of them are alcoholics/drug abusers,  and 1<br/>\n&gt; &gt;doesn&#39;t even speak to her.  Maybe it&#39;s just a coincidence, but my<br/>\n&gt; &gt;husband says they were never told they were loved or hugged and <br/>\n&gt; punished<br/>\n&gt; &gt;harshly and often.).<br/>\n&gt; <br/>\n </span></blockquote>To me, this is all the proof you need to know  that anything she says should <br/>\nbe flushed down the toilet.  I learned long ago to seek out people who <br/>\nsuccessfully raised kind, caring (not necessarily rich or successful) children into <br/>\nkind, caring adults.  Those type of people are worth their weight in gold...I <br/>\nthink I&#39;d avoid your MIL as much as possible.  If she asks why she doesn&#39;t get <br/>\nto see you or the kids anymore, tell her your feelings truthfully.  <br/>\n<br/>\nI remember when I was still quite a religious person, I heard someone <br/>\nelaborate on women as &quot;keepers of the home.&quot;  But instead of the same old <br/>\n&quot;submissive&quot; example this person described the keeper more as a gatekeeper or warrior :o) <br/>\n....keeping things and people out of the family that will harm the well-being <br/>\nof the children and family, even if that meant disagreeing with your husband. <br/>\n I liked that picture.  :o) <br/>\n<br/>\nI had a child (1st) who clung to me like flypaper.  I was a new Mom (19) and <br/>\nso unsure of myself, but everything in me told me to cling right back to her.  <br/>\nI can only remember once or twice that she wasn&#39;t with me in her first 2 <br/>\nyears of life, and that was because hubby wanted me to get away for an hour or two <br/>\nto see how she&#39;d do....she cried terribly, and he was always glad when I came <br/>\nback up the driveway.  When I got pregnant with #2, she always accompanied me <br/>\nto my OB visits and would stand next to the doctor while he examined me.  He <br/>\nsaid once, &quot;I think your daughter wants to become an Obstetrician when she <br/>\ngrows up&quot; as she stood looking at everything he was doing while my legs were up <br/>\nin stirrups...LOL...<br/>\n<br/>\nShe&#39;ll be fine.  Other than mentioning it to the counselor you&#39;re already <br/>\nseeing, I&#39;d stay away from taking her for an &quot;evaluation&quot;...I doubt you&#39;ll agree <br/>\nwith their advice anyhow.<br/>\n<br/>\nNancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8226888,"authorName":"the_clevengers","from":"&quot;the_clevengers&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my lovely daughter","postDate":"1057204534","msgId":76016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJlMDlmbStrbW5mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA0YWYwMWMzNDExNiQyYTA3NjcwMCQwNTAwMDAwYUBtYWJiLm5ldD4="},"prevInTopic":76015,"nextInTopic":76020,"prevInTime":76015,"nextInTime":76017,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"... wants ... Wow, that sounds a lot like my oldest, now almost 7. The good news is that with time, and with respectful parenting things have continued to get","messageBody":"<div id=\"ygrps-yiv-1276996984\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a>, Jeff & Kate Kerr <br/>\n&lt;windystreet@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; We are having a problem I don&#39;t know how to deal with.  My youngest,<br/>\n&gt; Storey is 5 1/2, is a handful.  I don&#39;t mean that in a disrespectful<br/>\n&gt; way, I mean she is curious about everything, into everything, and <br/>\n </span></blockquote>wants<br/>\n<blockquote><span title=\"ireply\"> &gt; what she wants right now.  <br/>\n <br/>\n </span></blockquote>Wow, that sounds a lot like my oldest, now almost 7. The good news is <br/>\nthat with time, and with respectful parenting things have continued <br/>\nto get easier for him and even the grandparents are coming around. <br/>\nNow they are more likely to say that they agree with the way we&#39;re <br/>\ndoing things (amazing).<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Here&#39;s why:  Storey has only ever wanted me to comfort her.  When <br/>\n </span></blockquote>she<br/>\n<blockquote><span title=\"ireply\"> &gt; was a baby only I was allowed to hold her.  She would scream if <br/>\n </span></blockquote>anyone<br/>\n<blockquote><span title=\"ireply\"> &gt; else did.  She would wake up if she was set down to sleep (even <br/>\n </span></blockquote>though<br/>\n<blockquote><span title=\"ireply\"> &gt; she was sleeping right next to me, I needed to have my arms around<br/>\n&gt; her).  She nursed and would never take a bottle of breast milk (my<br/>\n&gt; husband still has a hard time with this - our oldest allowed him to<br/>\n&gt; bottle feed occasionally).  I spent many years being &quot;touched out&quot;<br/>\n&gt; because of the amount of time that Storey needed from me.<br/>\n <br/>\n <br/>\n </span></blockquote>Yep, yep, yep. Nodding my head here. I knew something was &quot;different&quot; <br/>\nabout my son when I took him to a mommy-and-me class. All the other <br/>\ninfants were in their baby carriers or in their mom&#39;s lap, but mine <br/>\nwould scream unless he was in the sling and I was walking. Every time <br/>\nI stopped moving, he&#39;d scream. He didn&#39;t just accept attachment <br/>\nparenting, he *demanded* it (smart kid :-). <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; My mother-in-law says that Storey is spoiled and rude because Storey<br/>\n&gt; doesn&#39;t like to be around her (whereas our son is perfect and easy -<br/>\n </span></blockquote> she<br/>\n<blockquote><span title=\"ireply\"> &gt; actually says that in front of the kids).  I say that mil has made <br/>\n </span></blockquote>it<br/>\n<blockquote><span title=\"ireply\"> &gt; very clear to Storey that she doesn&#39;t like her.  Storey responds to <br/>\n </span></blockquote>mil<br/>\n<blockquote><span title=\"ireply\"> &gt; by not wanting to be near her, not answering her when spoken to.<br/>\n <br/>\n </span></blockquote>LOL, nodding my head again. One thing I&#39;ve pointed out to my <br/>\nrelatives is that by giving our kids the option to decide for <br/>\nthemselves their own comfort levels around others, we are really <br/>\ngiving them the future ability to follow their own intuition in more <br/>\ndangerous circumstances. A child who isn&#39;t forced against their <br/>\nintuition to give a grandparent a kiss might be much more likely in <br/>\nthe future to stand up for the rights of their own body when tempted <br/>\nwith sex, drugs, or something else they don&#39;t feel comfortable with. <br/>\nMost likely, it&#39;s kids who have had the &quot;respect for all adults&quot; <br/>\ndrummed into them who are at the biggest risk of being abused as well.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Mil was pissed and spent the next 1/2 hour talking to my husband in<br/>\n&gt; private about how Storey needed professional help to learn how to <br/>\n </span></blockquote>behave<br/>\n<blockquote><span title=\"ireply\"> &gt; properly and how we were too lenient with her (my mother thinks this<br/>\n&gt; also) and needed to punish this sort of behavior, about how she&#39;s <br/>\n </span></blockquote>raised<br/>\n<blockquote><span title=\"ireply\"> &gt; 7 kids and knows what she is talking about (btw, of those 7, all <br/>\n </span></blockquote>except<br/>\n<blockquote><span title=\"ireply\"> &gt; my husband have been divorced at least twice, 2 of them have been <br/>\n </span></blockquote>in and<br/>\n<blockquote><span title=\"ireply\"> &gt; out of jail, at least 2 of them are alcoholics/drug abusers,  and 1<br/>\n&gt; doesn&#39;t even speak to her.  Maybe it&#39;s just a coincidence, but my<br/>\n&gt; husband says they were never told they were loved or hugged and <br/>\n </span></blockquote>punished<br/>\n<blockquote><span title=\"ireply\"> &gt; harshly and often.).<br/>\n <br/>\n <br/>\n </span></blockquote>That unfortunately sounds familiar too. But that&#39;s the answer, right <br/>\nthere in that paragraph. What she believes in *doesn&#39;t work*. It just <br/>\ndoesn&#39;t. You can&#39;t raise kids to be respectful people by <br/>\ndisrespecting them. It sounds to me like she&#39;s threatened by the fact <br/>\nthat you&#39;re parenting differently and that probably deep in her <br/>\nheart, she knows that &quot;her way&quot; didn&#39;t work out all that well in the <br/>\nend. Some people are able to look the facts in the eye and realize <br/>\nthat there might be a better way. Some people just can&#39;t deal with <br/>\nthe cognitive dissonance and revert to lying to themselves and <br/>\npushing their own methods more than ever. People will continue to <br/>\nbelieve that their methods &quot;worked&quot; even as they bail out their kids <br/>\nfrom jail. I had a woman in a campground once expound on her theories <br/>\nof parenting to me (which basically boiled down to &quot;smack &#39;em around <br/>\nif they don&#39;t behave&quot;) and then she told me that her daughter had run <br/>\naway, was on drugs, and was pregnant. So why would she be giving me <br/>\nadvice? Who knows. People are strange that way. It gets harder, of <br/>\ncourse, when we&#39;re related to them. We have to work harder to turn a <br/>\ndeaf ear :-)<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; So, to sum up a very long story, what do you think about the idea of<br/>\n&gt; professional evaluations?  Do they do any good?  <br/>\n <br/>\n </span></blockquote>I&#39;d say that the answer to that is not always clear. It depends on <br/>\nwhat you want to get out of the evaluation, how good of an evaluator <br/>\nyou get, how supportive they are of homeschooling, what kinds of <br/>\nsupport or recommendations they can give you, etc. We had our son <br/>\nevaluated for SID (sensory integration dysfunction) and went through <br/>\nOT (occupational therapy) with him, in addition to doing a lot of <br/>\nstuff with him at home. I think the evaluation was helpful, it <br/>\ndefinitely showed us areas that he was really struggling with, and <br/>\nour therapist gave us a lot of things we could do to help him out in <br/>\nthose areas. For him, the SID was interfering with every aspect of <br/>\nhis life, and making things very difficult for him (and for us). So <br/>\nit made a lot of sense to get help in figuring out how to help him <br/>\nwork through it and make things easier for him. Some of this was <br/>\nstuff we were already doing, but some of it I wouldn&#39;t have known to <br/>\ndo without the therapist pointing it out. She was really great, and <br/>\nvery supportive of homeschooling. As more and more &quot;special needs&quot; <br/>\nkids are homeschooling, I think a lot of the therapists out there <br/>\nhave become quite supportive of it.<br/>\n <br/>\nIf there are specific things that you/she are concerned about or want <br/>\nto improve, then it might make sense to get an evaluation and therapy <br/>\n(esp. if you can get a recommendation for a good therapist). If not, <br/>\nthen it probably doesn&#39;t make sense. I guess it depends on where on <br/>\nthe spectrum of &quot;special&quot; she falls. There&#39;s special that just means <br/>\na different way of being in the world, and then there&#39;s special that <br/>\ninterferes with the child&#39;s natural ability to grow. If she falls in <br/>\nthe former, then I doubt that an evaluation would help. If she falls <br/>\ninto the latter, then it might. For our son, many of his behaviors <br/>\nwere things that we could specifically address with sensory therapy. <br/>\nIt helped him a lot just to be able to be out and in the world (where <br/>\nlights are bright, music is playing on the stereo in stores, people <br/>\nare jostling in lines, etc.) without the meltdowns.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I say we should just<br/>\n&gt; raise her the way we have been, she&#39;s gotten easier to be around so <br/>\n </span></blockquote>we<br/>\n<blockquote><span title=\"ireply\"> &gt; seem to be doing something right.  <br/>\n <br/>\n </span></blockquote>If that&#39;s the case, and if there&#39;s no big hurdles in her way, I don&#39;t <br/>\nsee why not.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; But maybe my husband has a point?<br/>\n <br/>\n </span></blockquote>Maybe. One thing that helped me was a book called &quot;The Out-Of-Sync <br/>\nChild&quot;. It opened my eyes to the ways in which my son&#39;s brain/body <br/>\nwere developing, and the things that were going on that were <br/>\nhindering him. It had a lot of checklists that gave me an idea of <br/>\nwhich areas were just slightly different, and which areas he had <br/>\nsevere issues in. It also made me realize that just the attachment <br/>\nparenting and being with him were not going to be enough. I had to <br/>\nlearn new ways of helping him, but nothing that I learned went <br/>\nagainst my basic child-respecting philosophy (and our occupational <br/>\ntherapist did not either).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My husband and I are in marriage counseling right now and I was <br/>\n </span></blockquote>thinking<br/>\n<blockquote><span title=\"ireply\"> &gt; of asking the counselor about this.<br/>\n <br/>\n </span></blockquote>I&#39;m not sure if that&#39;s a good idea (thinking in terms of asking the <br/>\ncounselor about whether or not an evaluation is a good idea). Most <br/>\nmarriage counselors aren&#39;t all that knowledgeable about this kind of <br/>\nthing. I guess it would depend heavily on how much you trust this <br/>\ncounselor&#39;s general judgement. I&#39;m guessing it would definitely be <br/>\nworthwhile to discuss how you want to approach dealing with inlaws, <br/>\nespecially in the areas where their parenting suggestions run counter <br/>\nto your own.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Kate<br/>\n&gt; who is a little confused right now<br/>\n <br/>\n </span></blockquote>I sympathize! There&#39;s no easy answer sometimes, and every person&#39;s <br/>\njourney will be different. I&#39;ve found that following our own hearts <br/>\nabout what was right for our son lead us in the right direction. <br/>\nThere was a time when we just took it day by day and parented by <br/>\ninstinct, there was a time when we used therapy for him and <br/>\nprofessionals who understand SID to help us out, and since then there <br/>\nhave been 2 years with no therapy but with some extra attention paid <br/>\nin our own minds to his needs and to helping him get through things <br/>\nthat are easier for most kids but difficult for him. Remember that <br/>\nwhatever decision you make today doesn&#39;t have to be binding forever. <br/>\nYou can always re-evaluate in a day, a month, a year if circumstances <br/>\nchange. One phrase that often works with well-meaning relatives who <br/>\ngive advice is &quot;Thanks, I&#39;ll think about that&quot; (even if that means <br/>\nI&#39;ll think to myself how stupid it was :-)<br/>\n <br/>\nBlue Skies!<br/>\n   -Robin-</div>","specialLinks":[]},{"userId":4324016,"authorName":"Kelly Lenhart","from":"&quot;Kelly Lenhart&quot; &lt;mina@...&gt;","profile":"mommamina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057204193","msgId":76015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0YWYwMWMzNDExNiQyYTA3NjcwMCQwNTAwMDAwYUBtYWJiLm5ldD4=","referencesHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+"},"prevInTopic":76008,"nextInTopic":76016,"prevInTime":76014,"nextInTime":76016,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"I think your MIL should keep her mouth shut, that your daughter was having a perfectly normal reaction to being treated like a second class citizen and your","messageBody":"<div id=\"ygrps-yiv-2098648591\">I think your MIL should keep her mouth shut, that your daughter was having a<br/>\nperfectly normal reaction to being treated like a second class citizen and<br/>\nyour husband needs to stop running to momma for advice on being a parent.<br/>\n<br/>\nOh, was I supposed to answer that politely?  Sorry.  But I&#39;d have ripped MIL<br/>\na new one, long ago.<br/>\n<br/>\nKelly</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057195556","msgId":76008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjNy5jMTYyNWQxLjJjMzRlMDI0QGFvbC5jb20+"},"prevInTopic":75998,"nextInTopic":76015,"prevInTime":76007,"nextInTime":76009,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/2003 4:18:56 PM Eastern Daylight Time, ... Ben used to get upset that Cameron only wanted ME. He said, It s always, Mommy, Mommy,","messageBody":"<div id=\"ygrps-yiv-1154634800\">In a message dated 7/2/2003 4:18:56 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I spent years feeling like I was doing something totally different than<br/>\n&gt; anyone else in this house! &lt;BG&gt; Seemed like no one could comb hair, tie<br/>\n&gt; shoes, put on socks, you name it, like I could. Joe would try and the kids<br/>\n&gt; would freak and it was just easier and way more peaceful for me to just do<br/>\n&gt; it. Joseph and Sierra are now 8 and 7 and Daddy is very good at all those<br/>\n&gt; jobs he could never do before. &lt;BG&gt; They got out of it. Alyssa doesn&#39;t do<br/>\n&gt; that with her dad but once in awhile. Joseph and Sierra were notorious for<br/>\n&gt; &quot;I want Mommy to do it.&quot; For them it passed. If I would have forced &quot;no<br/>\n&gt; daddy will&quot;, I do believe it would have been worse. You&#39;re doing fine.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Ben used to get upset that Cameron only wanted ME. He said, &quot;It&#39;s always, <br/>\n&#39;Mommy, Mommy, Mommy&#39;. When will it ever be &#39;Daddy, Daddy, Daddy&#39;? Why does he <br/>\nnever want me?&quot; I told him that I was going to take ALL the time Cameron would <br/>\ngive me. That, when Cameron got to be about 8 or so, he would start wanting <br/>\nBen&#39;s attention more (sports and such---&quot;boy-stuff&quot;). I figured I&#39;d lose him by <br/>\nthe teen years for sure and that I might &quot;get him back&quot; in his twenties. <br/>\n<br/>\nI was right. Cam&#39;s still a bit of a &quot;Mama&#39;s boy&quot; (in a nice way)---we&#39;re VERY <br/>\nclose, but he and Ben have a bond that they didn&#39;t have when he was <br/>\nlittle---sports and music and &quot;boy stuff&quot;.<br/>\n<br/>\nI&#39;m a &quot;Daddy&#39;s girl&quot;. I&#39;m guessing I wanted my mother when I was really <br/>\nlittle, but for as long as I can remember, I&#39;ve &quot;belonged&quot; to my dad.<br/>\n<br/>\nBen&#39;s not worried about Duncan because he&#39;s seen what has happened with <br/>\nCameron---he KNOWS he&#39;ll get plenty of &quot;Dad time&quot; with Dunc---and soon!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":100122184,"authorName":"Lisa M. Cottrell Bentley","from":"&quot;Lisa M. Cottrell Bentley&quot; &lt;cottrellbentley@...&gt;","profile":"cottrellbentley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: my lovely daughter","postDate":"1057187869","msgId":75998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNDkwMWMzNDBmMCQyN2FhYTc5MCQ2NzA3YThjMEBQcmVzYXJpbz4=","referencesHeader":"PGJkdjJuNCtjbDJwQGVHcm91cHMuY29tPg=="},"prevInTopic":75996,"nextInTopic":76008,"prevInTime":75997,"nextInTime":75999,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"... Your daughter sounds very similar in temperment to my oldest daughter, Zoë. She is now 6.75 years old and she is getting more and more less challenging to","messageBody":"<div id=\"ygrps-yiv-1530642180\"><blockquote><span title=\"ireply\">&gt; As far as Storey&#39;s behaviour, it&#39;s only gotten better over time.  She<br/>\n&gt; is much less difficult to be with now, compared with even a year ago.<br/>\n<br/>\n </span></blockquote>Your daughter sounds very similar in temperment to my oldest daughter, Zoë.<br/>\nShe is now 6.75 years old and she is getting more and more less challenging<br/>\nto deal with.  Zoë, like Storey, has been this way SINCE BIRTH.  If she had<br/>\nbeen an &quot;easy&quot; baby, we never would have learned the joys of the family bed,<br/>\nor extended breastfeeding, or unschooling.  She and her personality are what<br/>\nopened up my world to the possibility of homeschooling.  She has taught me<br/>\nmore than anyone else has.  Whenever she has a bad day, I look back to how<br/>\nit was a year ago.  Now there are at least a day here and there that she<br/>\ndoesn&#39;t have some sort of a breakdown.<br/>\n<br/>\nI hesitate to post this publically.  I actually posted a question similar to<br/>\nyours about a year ago to this list.  Dealing with a child that seems<br/>\nillogical and irrational at times is very challenging.  She is literal<br/>\nminded and a true genius (IMO, we&#39;ve never had her tested and we won&#39;t<br/>\never), with the personality that goes with it.  She questions everything and<br/>\neverything has to be &quot;just right always&quot; and &quot;perfect according to her<br/>\nstandards&quot; or she&#39;ll throw a major fit that affects everyone within hearing<br/>\ndistance.  I&#39;m sounding like I hate her, which I don&#39;t.  Yesterday was a<br/>\nparticularly difficult day for her and I wasn&#39;t feeling very sympathetic<br/>\n(she was in the wrong every single time- seriously).  However, these days<br/>\nwith multiple meltdowns only happen a couple of times a month now, versus<br/>\nEVERY SINGLE day for her entire life under age of 4-4.5 or so, so it does<br/>\nget better and I can see that.  She still complains about things that<br/>\nhappened to her when she was 2 (she has a great memory).  For example, one<br/>\nday when she was 2, I picked out a blue dress for her to wear (we were in a<br/>\nhurry).  Well, she wanted the green dress.  So, I immediately put the blue<br/>\ndress away and got the green dress, only to have her say, &quot;You didn&#39;t fix<br/>\nthe problem, I wanted the green dress first and you have forever ruined it<br/>\nbecause you got the blue dress first and it will always be that you got the<br/>\nblue dress first.&quot;  (She was very verbal from a very early age.)  That was<br/>\nwhen she became in charge of forever more picking out her own clothing.<br/>\n<br/>\nI&#39;m convinced that if we had sent Zoë to school that she would either be on<br/>\ndrugs for ADD (or something) or she would be punished every single day.  I<br/>\nam also convinced that she wouldn&#39;t have the sparkle and excitement for life<br/>\nand learning new things that she has if she had been forced to attend<br/>\nschool.  I can say without hesitation that she is the smartest and most<br/>\nalive 6.75 girl that I have ever met, and I&#39;ve met a lot of girls her age.<br/>\nI can say this for every stage of her life thus far.  DH and I have gotten<br/>\nreally good at heading off some of her breakdowns, but people like my mother<br/>\nhave a way of making them worse and making them last for days and days and<br/>\ndays.  We didn&#39;t speak to DH&#39;s parents for several years because they<br/>\nthought that we were/are parenting so horribly (they ignore it now and we<br/>\nonly see them about once a year or so).  I&#39;ll never forget the day that they<br/>\nscreamed, &quot;SHE&#39;S NOT NORMAL!&quot; when Zoë refused to immediately go to them<br/>\nafter she hadn&#39;t seen them for 3 or 4 months (they thought that they could<br/>\n&quot;fix&quot; her if and they demanded to take her away from us for a week- we<br/>\nrefused).  Be forewarned that if you confront anyone on their issues with<br/>\nyour daughter, they might possibly not be in your life ever again (or for at<br/>\nleast a really long time- not that this is a bad thing necessarily).<br/>\n<br/>\nZoë just had her first play date away from home without DH or I there also,<br/>\nlast week.  She is 6.75 years old.  I realized that this is a much older age<br/>\nthan most kids, but we waited until she was ready.  We&#39;ve spent a lot of<br/>\ntime with this family and they&#39;ve seen Zoe during some of her lesser<br/>\nbreakdowns.  They have a new baby, and were only comfortable hosting with<br/>\nboth of the parents home.  Anyway, after discussing it a lot by all parties,<br/>\nwe (Zoe included) decided on a 3 hour time limit.  It went fantastic.  So<br/>\nwell, in fact, that everyone wants to do it again.  It was hard for DH and<br/>\nI.  We were a good 10-15 minutes away from her and we were nervous the<br/>\nentire time that she would have a breakdown and no one would be able to<br/>\nhandle it and she would get so out of control that they&#39;d never want<br/>\nanything to do with her again.  I think that she sensed this and was more<br/>\naware of herself and her emotions than she usually is with us.  We are<br/>\nactually planning a sleep over now, but since she isn&#39;t quite ready for<br/>\nthis, our whole family is going to sleep over at their house.  Everyone&#39;s<br/>\nneeds will be met this way.<br/>\n<br/>\nLong story, I know, but I wanted to let you know that I commiserate and I am<br/>\nconvinced that Unschooling-type parenting is the ONLY solution for<br/>\n&quot;spirited&quot; or &quot;high needs&quot; children.  Really, these children NEED us MORE.<br/>\nWe have the responsibility to give them that more.  Good luck dealing with<br/>\nyour husband.  If I was fighting my husband on this issue, I don&#39;t know if I<br/>\ncould handle it.  I feel for you.<br/>\n<br/>\n-Lisa in AZ</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057185668","msgId":75996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMS4xNzQ1ODJiZC4yYzM0Yjk4NEBhb2wuY29tPg=="},"prevInTopic":75995,"nextInTopic":75998,"prevInTime":75995,"nextInTime":75997,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/03 4:17:28 PM Eastern Daylight Time, ... I was thinking the exact same thing.  It seems like there are many things going on in that","messageBody":"<div id=\"ygrps-yiv-1892953434\">In a message dated 7/2/03 4:17:28 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nellebelle@...\">nellebelle@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; .  I thought what irony it is that our society usually teaches children to <br/>\n&gt; do whatever it takes to please adults, especially relatives (who are in the <br/>\n&gt; category of those most likely to sexually abuse children!).  I&#39;m not <br/>\n&gt; suggesting that your mil has any of those intents, just that if we expect children to <br/>\n&gt; say no when they are uncomfortable, we need to allow the children to be the <br/>\n&gt; judge of when they are uncomfortable!<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I was thinking the exact same thing.  It seems like there are many things <br/>\ngoing on in that original post.  The husbands relationship with his mother,  your <br/>\nrelationship with the MIL.  But in just focusing on your daughter, I know I <br/>\nhave never pushed my boys into doing something they were not comfortable with.  <br/>\nGiving great grandma a hug.  Saying Hi to anyone.  Shaking hands with anyone. <br/>\n Answering anyone who had a question.  If they were not comfortable I did not <br/>\npush and now my oldest is such a good judge of people.  He is not introverted <br/>\nand clingy, like some people told me he would be.  People always said he was <br/>\nold enough for this or that but I listened to him.  He let me know when he was <br/>\nready to venture away from me.  I want my boys to know what that gut instinct <br/>\nis and what it feels like and that it is OK to follow that instinct.<br/>\n<br/>\nAnyway too long.<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: my lovely daughter","postDate":"1057184889","msgId":75995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYi5jNTc2NjUwLjJjMzRiNjc5QGFvbC5jb20+"},"prevInTopic":75986,"nextInTopic":75996,"prevInTime":75994,"nextInTime":75996,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/03 1:20:01 PM Eastern Daylight Time, ... I do the same thing.  When we visit my grandmother my youngest (6 yo) does not like to go as","messageBody":"<div id=\"ygrps-yiv-1406475447\">In a message dated 7/2/03 1:20:01 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When there&#39;s tension at their house, I take a kid for a walk<br/>\n<br/>\n </span></blockquote>I do the same thing.  When we visit my grandmother my youngest (6 yo) does <br/>\nnot like to go as there is nothing to play with, nothing to do, and she is not <br/>\nkid friendly.  She doesn&#39;t say anything terrible but has no idea how to talk to <br/>\nchildren.  But I see her only every couple of years.  So Jackson will usually <br/>\ntake him and/or Dallen for a walk in the field or to look at all the <br/>\nfascinating things outside.  Gets them out of a place where they don&#39;t want to be.  I <br/>\nknow I hate it when I have to sit somewhere and I really don&#39;t want to be <br/>\nthere.  I do the same when we visit Jackson&#39;s dad.  The boys really hate that <br/>\nvisit. <br/>\n<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057179431","msgId":75986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZWQwMWMzNDBkYyQ4MjMxZjI0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+IDwwMDRmMDFjMzQwZDYkNDQxYzczMDAkNjQwMWE4YzBAb2VtY29tcHV0ZXI+"},"prevInTopic":75984,"nextInTopic":75995,"prevInTime":75985,"nextInTime":75987,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"From: nellebelle  ","messageBody":"<div id=\"ygrps-yiv-142900260\">From: &quot;nellebelle&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nellebelle@...\">nellebelle@...</a>&gt;<br/>\n<br/>\n&lt;&lt;Sometimes I might try to soften a situation like that by making a joke<br/>\nabout it or reminding others that children grow so quickly and before you<br/>\nknow it she won&#39;t want to sit on your lap and doesn&#39;t she (your mil) miss<br/>\nthose days when her little children wanted to cuddle with her?&gt;&gt;<br/>\n<br/>\n<br/>\nI just had to write this. I just put my last post on hold because Tara came<br/>\nout and pulled my chair away from the desk to sit on my lap and cuddle with<br/>\nme. She sat here with me for about 25 minutes and then she was gone. She&#39;s<br/>\n17.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057177623","msgId":75984,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNzgwMWMzNDBkOCQ4NWI1YmVhMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+IDwwMGE5MDFjMzQwZDYkYWYyMTlhZTAkNjEwMWE4YzBAbGF1bmNobW9kZW0uY29tPg=="},"prevInTopic":75983,"nextInTopic":75986,"prevInTime":75983,"nextInTime":75985,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"... My 2 1/2 year old grandson, after a period of, I want Mummy do it, went through a similar period of, I want Daddy do it.  Now he s happy with either. ","messageBody":"<div id=\"ygrps-yiv-1292406219\"><blockquote><span title=\"ireply\">&gt; I spent years feeling like I was doing something totally different than<br/>\n&gt; anyone else in this house! &lt;BG&gt; Seemed like no one could comb hair, tie<br/>\n&gt; shoes, put on socks, you name it, like I could. Joe would try and the kids<br/>\n&gt; would freak and it was just easier and way more peaceful for me to just do<br/>\n&gt; it. Joseph and Sierra are now 8 and 7 and Daddy is very good at all those<br/>\n&gt; jobs he could never do before. &lt;BG&gt; They got out of it. Alyssa doesn&#39;t do<br/>\n&gt; that with her dad but once in awhile. Joseph and Sierra were notorious for<br/>\n&gt; &quot;I want Mommy to do it.&quot; For them it passed. If I would have forced &quot;no<br/>\n&gt; daddy will&quot;, I do believe it would have been worse. You&#39;re doing fine.<br/>\n<br/>\n </span></blockquote>My 2 1/2 year old grandson, after a period of, &quot;I want Mummy do it,&quot; went<br/>\nthrough a similar period of, &quot;I want Daddy do it.&quot;  Now he&#39;s happy with<br/>\neither.<br/>\n<br/>\n&quot;They that can give up essential liberty to obtain a little temporary safety<br/>\ndeserve neither liberty nor safety.&quot;  Ben Franklin<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a></div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057177332","msgId":75983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZDUwMWMzNDBkNyQ5Zjc2OTE4MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDIwMDMwNzAyLjE1NTIxOS44MDcwLjIwOTUyNkB3ZWJtYWlsMDkubnljLnVudGQuY29tPg=="},"prevInTopic":75981,"nextInTopic":75984,"prevInTime":75982,"nextInTime":75984,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"From:  ","messageBody":"<div id=\"ygrps-yiv-349534112\">From: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\n<br/>\n&lt;&lt;Sierra is six, and still doesn&#39;t take to people readily. She doesn&#39;t like<br/>\ntalking to anyone that isn&#39;t very familiar, but she talks my ear off! :)<br/>\nEveryone has their own time table, your dd is just fine!!&gt;&gt;<br/>\n<br/>\n<br/>\nOkay except for saying Sierra is 7, I could have written that word for word.<br/>\nMust be the name!<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057176929","msgId":75981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTkwMWMzNDBkNiRhZjIxOWFlMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+"},"prevInTopic":75980,"nextInTopic":75983,"prevInTime":75980,"nextInTime":75982,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"From: Jeff & Kate Kerr  I m not really answering what you asked but commenting on the post. If that s not what you want, just toss","messageBody":"<div id=\"ygrps-yiv-1330748219\">From: &quot;Jeff & Kate Kerr&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:windystreet@...\">windystreet@...</a>&gt;<br/>\n<br/>\nI&#39;m not really answering what you asked but commenting on the post. If<br/>\nthat&#39;s not what you want, just toss this. I won&#39;t be offended. &lt;BG&gt;<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;Since we&#39;ve stopped doing that both of my kids behavior is<br/>\nmore pleasant and they don&#39;t misbehave as they used to).  My husband<br/>\nthinks we need to go back to the punishing.&gt;&gt;<br/>\n<br/>\nMy first thought was why??? Does you husband not see the difference? Maybe<br/>\npointing out specifics would help. To him only. Like remember when Storey<br/>\nwould...... and now she doesn&#39;t do that? Maybe he&#39;s just not seeing it.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;I spent many years being &quot;touched out&quot;<br/>\nbecause of the amount of time that Storey needed from me.&gt;&gt;<br/>\n<br/>\nI spent years feeling like I was doing something totally different than<br/>\nanyone else in this house! &lt;BG&gt; Seemed like no one could comb hair, tie<br/>\nshoes, put on socks, you name it, like I could. Joe would try and the kids<br/>\nwould freak and it was just easier and way more peaceful for me to just do<br/>\nit. Joseph and Sierra are now 8 and 7 and Daddy is very good at all those<br/>\njobs he could never do before. &lt;BG&gt; They got out of it. Alyssa doesn&#39;t do<br/>\nthat with her dad but once in awhile. Joseph and Sierra were notorious for<br/>\n&quot;I want Mommy to do it.&quot; For them it passed. If I would have forced &quot;no<br/>\ndaddy will&quot;, I do believe it would have been worse. You&#39;re doing fine.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;We spent the afternoon at my in-laws this Sunday and Storey sat on my<br/>\nlap.  Mil kept telling her that she was too big to be on my lap and to<br/>\nget off.  I kept repeating that she was fine and to let her be.  Finally<br/>\nI&#39;d had enough and asked Storey to sit next to me, but that meant that<br/>\nshe would be sitting next to her grandmother and Storey did not want to<br/>\ndo that.&gt;&gt;<br/>\n<br/>\nI&#39;m just wondering what you had enough of? Was it Storey on your lap or you<br/>\nMIL? If it was MIL, why make Storey get off? If it were me, I would have<br/>\ngotten up and moved me and my kid away from MIL. Knowing me, I may have just<br/>\npacked up the whole family and left. I&#39;ve done that before. My kids need to<br/>\nknow, that no matter who in the family is being a pita, I will protect my<br/>\nkids. My mom has a tendency to pester Joseph and not the girls. I&#39;ve had<br/>\nwords with her about it. It wasn&#39;t nice. But things are better because she<br/>\nknows I won&#39;t stand for it. He&#39;s better because he knows I won&#39;t stand for<br/>\nit. My in laws would say awful things in front of my kids. It was their<br/>\nhouse, but my kids. I won&#39;t tell them what to do, but I won&#39;t stay there if<br/>\nmy kids aren&#39;t safe.<br/>\n<br/>\nI see the issue, from what you wrote as your MIL. I don&#39;t suppose you can<br/>\nforce a professional on her can you?? I&#39;m pretty up front when it comes to<br/>\nmy kids. I avoid conflict a lot, but not when it has to do with them. I<br/>\nwould let my MIL know (and I have) that they are not her kids and I will not<br/>\nstand by while she hurts them in anyway. So you either keep your mouth<br/>\nclosed and see them or don&#39;t see them. But that&#39;s just me.<br/>\n<br/>\nI don&#39;t see where you daughter needs professional help. It may help to bring<br/>\nit out in your own counseling. Depends on the therapist. It may not help and<br/>\nthey may suggest school or some such silly thing. You can probably figure<br/>\nout where they may stand.<br/>\n<br/>\nAgain I see the only one that needs handling is MIL. You seem to be doing<br/>\nfine with your daughter. Good luck with the family.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057176603","msgId":75980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGYwMWMzNDBkNiQ0NDFjNzMwMCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+"},"prevInTopic":75979,"nextInTopic":75981,"prevInTime":75979,"nextInTime":75981,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"... the way.  Since we ve stopped doing that both of my kids behavior is more pleasant and they don t misbehave as they used to).  My husband thinks we need to","messageBody":"<div id=\"ygrps-yiv-568104697\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;We have never spanked, but we used to give time outs (they don&#39;t work by<br/>\n </span></blockquote>the way.  Since we&#39;ve stopped doing that both of my kids behavior is<br/>\nmore pleasant and they don&#39;t misbehave as they used to).  My husband<br/>\nthinks we need to go back to the punishing.&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIf their behavior is more pleasant, why does he think you need to go back to punishing?  (You don&#39;t have to answer here, just something to think about or ask him why.)<br/>\n<br/>\nAs for your dd wanting to sit with you rather than Grandma, I happened to glance at Dear Abby this am.  Someone wrote in about child sexual abuse, and Abby wrote back that children need to be taught to say no to things that make them uncomfortable.  I thought what irony it is that our society usually teaches children to do whatever it takes to please adults, especially relatives (who are in the category of those most likely to sexually abuse children!).  I&#39;m not suggesting that your mil has any of those intents, just that if we expect children to say no when they are uncomfortable, we need to allow the children to be the judge of when they are uncomfortable!<br/>\n<br/>\nSometimes I might try to soften a situation like that by making a joke about it or reminding others that children grow so quickly and before you know it she won&#39;t want to sit on your lap and doesn&#39;t she (your mil) miss those days when her little children wanted to cuddle with her?<br/>\n<br/>\nIt really helped my mom to understand some of my parenting decisions when I compared a parent making a child eat their vegetables (the child may eat the vegetables to please the parent, but learns that we do things we don&#39;t want to do in order to make those we love happy) to a teenage friend urging a child to try drugs (the child may try the drugs to please the friend because they have learned that is more important to please others than to trust their own wants/needs.)<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"starsuncloud@netzero.net","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"my lovely daughter","postDate":"1057175531","msgId":75979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwNzAyLjE1NTIxOS44MDcwLjIwOTUyNkB3ZWJtYWlsMDkubnljLnVudGQuY29tPg=="},"prevInTopic":75978,"nextInTopic":75980,"prevInTime":75978,"nextInTime":75980,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"My husband and I are in marriage counseling right now and I was thinking of asking the counselor about this. Yeah, I might mention the fact that your mil","messageBody":"<div id=\"ygrps-yiv-1270422341\">&quot;My husband and I are in marriage counseling right now and I was thinking<br/>\nof asking the counselor about this.&quot;<br/>\n<br/>\nYeah, I might mention the fact that your mil seems to have some enormous influence over your dh, to the detriment of your relationship!<br/>\nI don&#39;t think I&#39;d want any &quot;professional&quot; advice about the dd, you already feel comfortable meeting her needs. The problem is the dynamics between you and dh...he should be backing you up with mil, especially in light of her own miserable parenting choices.<br/>\nSome children are very needy, it will change.<br/>\nMy 2.5 y.o. is pretty much only happy with me. If I am at work, then Dad is just fine, but when I&#39;m here, I am the only one he wants.<br/>\nHe sleeps right next to me, he nurses frequently and I don&#39;t see how changing any of that is going to make him a better person in any way.<br/>\n<br/>\nSierra is six, and still doesn&#39;t take to people readily. She doesn&#39;t like talking to anyone that isn&#39;t very familiar, but she talks my ear off! :) Everyone has their own time table, your dd is just fine!!<br/>\n<br/>\nI would however, try to strengthen the family dynamics so everyone can tell the mil to butt out when she gets rude again.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":64419796,"authorName":"Nichole","from":"&quot;Nichole&quot; &lt;ms_fausey@...&gt;","profile":"ms_fausey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057174907","msgId":75978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNzIwMWMzNDBkMSRmOTk0M2M5MCQyNjAyYThjMEBGYXVzZXlEb2VzSVQ+","referencesHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+"},"prevInTopic":75971,"nextInTopic":75979,"prevInTime":75977,"nextInTime":75979,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"Dear Kate, Let me ask you a few questions. If your daughter were to be evaluated  by a professional psychologist/counselor, would you change your","messageBody":"<div id=\"ygrps-yiv-141883864\">Dear Kate,<br/>\n<br/>\nLet me ask you a few questions.<br/>\n<br/>\nIf your daughter were to be evaluated &lt;shudder!&gt; by a professional psychologist/counselor, would you change your behavior, say, if she said your daughter were ADHD or some other childhood disordered.  Would you put her on Ritalin or some other drug?  Would you put her in Time Out?  Would you treat her differently?  Would you give her less love than she desires? Would you have in your mind that your child is somehow defective or disordered?<br/>\n<br/>\nI&#39;m so sorry that your husband and MIL are not giving you the support and your child the support that you both need.  I bet the entire situation would be so much better if they were both treating her with respect and loving kindness instead of demanding that she behave differently.  <br/>\n<br/>\nAll these people, even your mother, are seeing your lovely daughter through a different filter, one that is normally used by public schools, and society at large.  They want her to be NORMAL, so it&#39;s easier for them.  <br/>\n<br/>\nI have a degree in counseling, but I am by no means a professional counselor.  I recommend against professional evaluation of your lovely 5 1/2 year old daughter.  Labels stick.  I encourage you to continue to love and support your daughter the way you have been doing.  Continue to show her your unconditional love.  It sounds like you are the only source of it in her life.<br/>\n<br/>\nThis situation must cause you profound sadness, that your husband wants to punish your daughter for wanting you to love her up.  I was in a situation like this one briefly and it made me sick.  Yep, I&#39;m married now for the third time, but I&#39;d rather be married 3 times than be with someone who has totally different ideas about love and family than I do.  My daughter&#39;s safety and security is A#1 in my book and everyone in my life knows that.<br/>\n<br/>\nI&#39;ll keep you in my thoughts, Kate.<br/>\n<br/>\nNichole<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Jeff & Kate Kerr <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a> <br/>\n  Sent: Wednesday, July 02, 2003 9:57 AM<br/>\n  Subject: [Unschooling-Discussion] my lovely daughter<br/>\n<br/>\n<br/>\n  We are having a problem I don&#39;t know how to deal with.  My youngest,<br/>\n  Storey is 5 1/2, is a handful.  I don&#39;t mean that in a disrespectful<br/>\n  way, I mean she is curious about everything, into everything, and wants<br/>\n  what she wants right now.  She is bright and funny and a good mother to<br/>\n  her guinea pig.  She considers herself an artist (I consider her one<br/>\n  also, she&#39;s got a talent for it) and seems to have the temperament of a<br/>\n  true artist (dedicated, true to her vision, etc...).<br/>\n<br/>\n  We have never spanked, but we used to give time outs (they don&#39;t work by<br/>\n  the way.  Since we&#39;ve stopped doing that both of my kids behavior is<br/>\n  more pleasant and they don&#39;t misbehave as they used to).  My husband<br/>\n  thinks we need to go back to the punishing.<br/>\n<br/>\n  Here&#39;s why:  Storey has only ever wanted me to comfort her.  When she<br/>\n  was a baby only I was allowed to hold her.  She would scream if anyone<br/>\n  else did.  She would wake up if she was set down to sleep (even though<br/>\n  she was sleeping right next to me, I needed to have my arms around<br/>\n  her).  She nursed and would never take a bottle of breast milk (my<br/>\n  husband still has a hard time with this - our oldest allowed him to<br/>\n  bottle feed occasionally).  I spent many years being &quot;touched out&quot;<br/>\n  because of the amount of time that Storey needed from me.<br/>\n<br/>\n  My mother-in-law says that Storey is spoiled and rude because Storey<br/>\n  doesn&#39;t like to be around her (whereas our son is perfect and easy - she<br/>\n  actually says that in front of the kids).  I say that mil has made it<br/>\n  very clear to Storey that she doesn&#39;t like her.  Storey responds to mil<br/>\n  by not wanting to be near her, not answering her when spoken to.<br/>\n<br/>\n  We spent the afternoon at my in-laws this Sunday and Storey sat on my<br/>\n  lap.  Mil kept telling her that she was too big to be on my lap and to<br/>\n  get off.  I kept repeating that she was fine and to let her be.  Finally<br/>\n  I&#39;d had enough and asked Storey to sit next to me, but that meant that<br/>\n  she would be sitting next to her grandmother and Storey did not want to<br/>\n  do that.<br/>\n<br/>\n  Storey had a melt down and was crying saying she didn&#39;t want to be<br/>\n  there, didn&#39;t want to come in the first place and could we please go<br/>\n  home.  Instead of punishing her for what mil thinks was manipulative<br/>\n  behavior, I held her and talked calmly with her explaining that daddy<br/>\n  and Robin were having a good time, we had just gotten there and were<br/>\n  there to have lunch with the grandparents and that we would be leaving<br/>\n  soon, but not right now.  (By the time we were ready to go Storey and<br/>\n  Robin were making pots - my in-laws are potters - and neither of them<br/>\n  wanted to go.)<br/>\n<br/>\n  Mil was pissed and spent the next 1/2 hour talking to my husband in<br/>\n  private about how Storey needed professional help to learn how to behave<br/>\n  properly and how we were too lenient with her (my mother thinks this<br/>\n  also) and needed to punish this sort of behavior, about how she&#39;s raised<br/>\n  7 kids and knows what she is talking about (btw, of those 7, all except<br/>\n  my husband have been divorced at least twice, 2 of them have been in and<br/>\n  out of jail, at least 2 of them are alcoholics/drug abusers,  and 1<br/>\n  doesn&#39;t even speak to her.  Maybe it&#39;s just a coincidence, but my<br/>\n  husband says they were never told they were loved or hugged and punished<br/>\n  harshly and often.).<br/>\n<br/>\n  So now my husband is saying that maybe we should have her professionally<br/>\n  evaluated, maybe there really is something wrong with her.  We ended up<br/>\n  in a long heated discussion over this.  I disagree with him.  Yes Storey<br/>\n  is needy, but she&#39;s 5, not 30.  Yes Storey is a handful, but it&#39;s ok<br/>\n  because she is my daughter and I want to help her and be with her.<br/>\n<br/>\n  So, to sum up a very long story, what do you think about the idea of<br/>\n  professional evaluations?  Do they do any good?  I say we should just<br/>\n  raise her the way we have been, she&#39;s gotten easier to be around so we<br/>\n  seem to be doing something right.  But maybe my husband has a point?<br/>\n  I&#39;m really confused.  (Maybe I&#39;m just looking for people to agree with<br/>\n  me?  To help me back up what I think is the right way?)<br/>\n<br/>\n  My husband and I are in marriage counseling right now and I was thinking<br/>\n  of asking the counselor about this.<br/>\n<br/>\n  Sorry for the length, thanks for letting me get this off my chest.<br/>\n<br/>\n  Kate<br/>\n  who is a little confused right now<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion-unsubscribe@yahoogroups.com\">Unschooling-Discussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057170843","msgId":75971,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNS4yMjIzN2I0OC4yYzM0N2Y5YkBhb2wuY29tPg=="},"prevInTopic":75968,"nextInTopic":75978,"prevInTime":75970,"nextInTime":75972,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/2003 12:00:29 PM Eastern Daylight Time, ... Maybe MIL thinks Storey made it clear she didn t like her or anyone else much by clinging","messageBody":"<div id=\"ygrps-yiv-2120307912\">In a message dated 7/2/2003 12:00:29 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:windystreet@...\">windystreet@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My mother-in-law says that Storey is spoiled and rude because Storey<br/>\n&gt; doesn&#39;t like to be around her (whereas our son is perfect and easy - she<br/>\n&gt; actually says that in front of the kids).  I say that mil has made it<br/>\n&gt; very clear to Storey that she doesn&#39;t like her.  Storey responds to mil<br/>\n&gt; by not wanting to be near her, not answering her when spoken to.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Maybe MIL thinks Storey made it clear she didn&#39;t like her or anyone else much <br/>\nby clinging only to you, her mother all the time.  It would make it difficult <br/>\nto develop a relationship with a child that only wants to be with her mother.<br/>\n<br/>\nMy son was like this.  He NEVER wanted to be with anyone but me.  His dad did <br/>\nfeel left out.  With the other babies he could at least bathe and dress them <br/>\nand play with them and do things but not this one.  He wanted only ME.  Made <br/>\nit difficult for anyone to make a bond or have any type of relationship with <br/>\nthe child.<br/>\n<br/>\nI really couldn&#39;t blame it on the adults and there was no blame for my son <br/>\neither.  It was just how he was.  It was frustrating to others that wanted him <br/>\nto play/do things with them and get to know him on a different level other than <br/>\nthe clingy child that only wanted his mother.<br/>\n<br/>\nI think at five I would point out that it is rude not to answer Grandma when <br/>\nshe is speaking to you, if it&#39;s just because she feels she doesn&#39;t want to.  <br/>\nIt goes back to manners/rank/respect and while I don&#39;t want to revisit that <br/>\nthread, I would at least ask my child at five to acknowledge that Grandmother is <br/>\nspeaking to them.  If they don&#39;t want to engage in conversation well they can <br/>\nsay I don&#39;t feel like talking right now.  But at least don&#39;t ignore someone <br/>\nwho is making an effort to speak to you.<br/>\n<br/>\nMaybe they are just trying to coax your daughter to come join them and give <br/>\nyou a break by saying she&#39;s too big for your lap.  I&#39;d say it&#39;s the wrong way <br/>\nto go about it, but they probably have good intentions by wanting her to engage <br/>\nwith them.  Otherwise they&#39;d just ignore her.<br/>\n<br/>\nI don&#39;t know about having her evaluated but I&#39;d try to encourage her to get <br/>\nto know her family and others.<br/>\n<br/>\nMy son was hospitalized for a fairly serious illness.  I never once left him <br/>\nday and night, I changed in his room, I ate in his room.  When he was mostly <br/>\nbetter and we were hoping he&#39;d go home soon, the doctor asked to meet with me <br/>\nand it seemed serious.  I said before I send him home, you have to do a few <br/>\nthings.  One was to go have lunch AWAY from the hospital and be gone at least an <br/>\nhour.  Another was to allow others to have a part of his life, help my son to <br/>\nsee that others are valuable and trustworthy and he can rely on them.  He said <br/>\nif something should ever happen to me, how desperate would my child be?  That <br/>\nmade me think.  At first I was very angry that he would tell me I had to do <br/>\nthese things before my child could come home.  Then I thought about what he <br/>\nsaid.<br/>\n<br/>\nWhat IF something God forbid happened to me.  How lost would my son be?  I <br/>\nworked hard on getting him to be comfortable with others.  I realized that I had <br/>\nnever really encouraged it, just thinking it was his personality and he would <br/>\nbe fine and one day would be like the other children.<br/>\n<br/>\nAnyway, there are lots of in betweens and you have to trust your instincts <br/>\nfor sure, but I wanted you to know that other children are like that and are <br/>\nfine.  My son is now almost 19, he&#39;s still a &quot;momma&#39;s&quot; boy and depends on me a <br/>\nlot more than the other children but is perfectly capable of being on his own as <br/>\nwell.<br/>\n<br/>\nHe was just in Myrtle Beach for eight days without any adult and did just <br/>\nfine.  He still prefers to have me make his lunch and sometimes fold his laundry, <br/>\nbut he&#39;s more than capable of taking excellent care of himself and has lots <br/>\nof friends.<br/>\n<br/>\nSo I&#39;m sure your daughter will do just fine.<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057169749","msgId":75968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4ZC4xYzg5NDFkNy4yYzM0N2I1NUBhb2wuY29tPg=="},"prevInTopic":75967,"nextInTopic":75971,"prevInTime":75967,"nextInTime":75969,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/2003 1:33:21 PM Eastern Standard Time, SandraDodd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1553862636\">In a message dated 7/2/2003 1:33:21 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;Keith&#39;s mom finally said something nice about our homeschooling and <br/>\nparenting, recently, by letter.  The kids are 16, 14 and 11.  That&#39;s how long <br/>\nI had to <br/>\nwait, and endure the negative comments and the snorts.  Even the compliments <br/>\nare insults&gt;&gt;&gt;<br/>\nMy mom invited Dustin for the weekend two weeks ago.<br/>\nWhen she saw me on Sunday she said &quot;Laura Dustin was wonderful, He has really <br/>\ncome a long way, he is so polite&quot; He is 11 she has had him 3 times in 11 <br/>\nyears. She in the past caused arguments over comments he made and more recently <br/>\n2yrs ago told me he should go back to school and I should get a job! <br/>\n<br/>\nOr coarse my younger sister now 20 has herd my Mom speak bad things of Dustin <br/>\nover the years and hates him. We are currently in a family rift because she <br/>\nsays he is a chronic liar because he told me something she said that upset him. <br/>\n(She asked my Mom the weekend she had him why she took him for the weekend <br/>\ncuz she hardly knows him! She was very angry that Mom had him.) Hmmm<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nLaura, the very sensitive black sheep (lack of better words) of the family<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057167115","msgId":75967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOTEwMWMzNDBjNCRmYTlhNzRlMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDAwMjIwMWMzNDBiYyQ1YzhiYzkwMCQ2NDAwYThjMEBsaXZpbmdyb29tMT4="},"prevInTopic":75961,"nextInTopic":75968,"prevInTime":75966,"nextInTime":75968,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"... it s ... to ... And how is your daughter going to learn manners from a grandma that doesn t have any? Tia They that can give up essential liberty to","messageBody":"<div id=\"ygrps-yiv-897661120\"><blockquote><span title=\"ireply\">&gt; &gt; Mil kept telling her that she was too big to be on my lap and to<br/>\n&gt; get off.<br/>\n&gt;<br/>\n&gt; **If anyone needs professional help to learn how to &#39;behave properly&#39;,<br/>\n </span></blockquote>it&#39;s<br/>\n<blockquote><span title=\"ireply\"> &gt; your mother in law.  Have you tried telling her privately that she needs<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; stop interfering in your mothering?<br/>\n<br/>\n </span></blockquote>And how is your daughter going to learn manners from a grandma that doesn&#39;t<br/>\nhave any?<br/>\nTia<br/>\n<br/>\n&quot;They that can give up essential liberty to obtain a little temporary safety<br/>\ndeserve neither liberty nor safety.&quot;  Ben Franklin<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057167114","msgId":75961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1LjM1ZDg2OTliLjJjMzQ3MTBhQGFvbC5jb20+"},"prevInTopic":75960,"nextInTopic":75967,"prevInTime":75960,"nextInTime":75962,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/03 11:18:20 AM, tmthomas@shaw.ca writes: ","messageBody":"<div id=\"ygrps-yiv-1376956845\">In a message dated 7/2/03 11:18:20 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tmthomas@...\">tmthomas@...</a> writes:<br/>\n<br/>\n&lt;&lt; Now that our dd is 15, our respective mil&#39;s are realizing that this IS the <br/>\nright way - tho they could not do it themselves now and could NOT buy the <br/>\nconcept when she was 5.  My mom is so uptight and Maureen&#39;s mom is too rash/used <br/>\nto hitting.<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>Keith&#39;s mom finally said something nice about our homeschooling and <br/>\nparenting, recently, by letter.  The kids are 16, 14 and 11.  That&#39;s how long I had to <br/>\nwait, and endure the negative comments and the snorts.  Even the compliments <br/>\nare insults.  Holly could quote this better, but at Thanksgiving Holly ate all <br/>\nkinds of food, and her grandmother said something like &quot;You ate well, Holly, <br/>\nmuch better than we expected.&quot;<br/>\n<br/>\n&quot;Eating well.&quot;  Sheesh.<br/>\nAnd in a house where people are constantly criticised for eating at the wrong <br/>\ntime, or for eating too much.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: my lovely daughter","postDate":"1057166662","msgId":75960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNTMwMWMzNDBiZiQ1YjFjMDUwMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PGJkdjJuNCtjbDJwQGVHcm91cHMuY29tPg=="},"prevInTopic":75959,"nextInTopic":75961,"prevInTime":75959,"nextInTime":75961,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"... What would your dh and mil have to say about the above paragraphs? Tia They that can give up essential liberty to obtain a little temporary safety deserve","messageBody":"<div id=\"ygrps-yiv-1705843975\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; As far as Storey&#39;s behaviour, it&#39;s only gotten better over time.  She<br/>\n&gt; is much less difficult to be with now, compared with even a year ago.<br/>\n&gt; So I don&#39;t think that her &quot;rude and disrespectful&quot; (mil&#39;s quote)<br/>\n&gt; behaviour is related to our marriage.  Storey has never (even as a<br/>\n&gt; baby) put up with people who don&#39;t like her, she has a great bullshit<br/>\n&gt; meter and refuses to be with or talk to people who she feels are<br/>\n&gt; condescending toward her or her brother.<br/>\n&gt;<br/>\n&gt; I really feel that my mil is just demanding something (respect?) from<br/>\n&gt; some one who feels that she doesn&#39;t deserve it.  I mean, why would<br/>\n&gt; Storey want to be kind to her grandmother when her grandmother has<br/>\n&gt; never hugged her or said any kind word to her?  The kind words are<br/>\n&gt; reserved for our son.<br/>\n<br/>\n </span></blockquote>What would your dh and mil have to say about the above paragraphs?<br/>\nTia<br/>\n<br/>\n&quot;They that can give up essential liberty to obtain a little temporary safety<br/>\ndeserve neither liberty nor safety.&quot;  Ben Franklin<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: my lovely daughter","postDate":"1057166218","msgId":75957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4NS4xZDZkMmYxOC4yYzM0NmQ4YUBhb2wuY29tPg=="},"prevInTopic":75956,"nextInTopic":75959,"prevInTime":75956,"nextInTime":75958,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/03 10:54:51 AM, windystreet@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1000547447\">In a message dated 7/2/03 10:54:51 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:windystreet@...\">windystreet@...</a> writes:<br/>\n<br/>\n&lt;&lt; I really feel that my mil is just demanding something (respect?) from <br/>\n<br/>\nsome one who feels that she doesn&#39;t deserve it.  I mean, why would <br/>\n<br/>\nStorey want to be kind to her grandmother when her grandmother has <br/>\n<br/>\nnever hugged her or said any kind word to her?  The kind words are <br/>\n<br/>\nreserved for our son.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>My mother in law is difficult.  Not as bad as yours sounds, but not too fun <br/>\nfor too long.<br/>\n<br/>\nWhen there&#39;s tension at their house, I take a kid for a walk, either in the <br/>\nback yard (they have turtles, and grapes, and pecans) or down the alley (a <br/>\nditch, lots of interesting alley-stuff), or out the front, into the neighbornood.  <br/>\nEvery house and tree is different, and it&#39;s a good tension breaking set of <br/>\nbehaviors.  We haven&#39;t LEFT, yet we have.  There&#39;s exercise, fresh air, and the <br/>\ngrandmother has a breather too.  She&#39;s not used to a house full of people <br/>\nanymore.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":93802122,"authorName":"tmthomas@shaw.ca","from":"tmthomas@...","profile":"wisdom0007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057166127","msgId":75956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0YWVlOTI3NDEuOTI3NDE5NGFlZUBzaGF3LmNhPg=="},"prevInTopic":75952,"nextInTopic":75957,"prevInTime":75955,"nextInTime":75957,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"-=-We are having a problem I don t know how to deal with.  My youngest, Storey is 5 1/2, is a handful. We have a dd who is of similar temperament - she s even","messageBody":"<div id=\"ygrps-yiv-203040385\">-=-We are having a problem I don&#39;t know how to deal with.  My youngest,<br/>\nStorey is 5 1/2, is a handful.  <br/>\n<br/>\nWe have a dd who is of similar temperament - she&#39;s even illustrated a cover for a homeschooling book, so there are great outcomes when you are blessed with such a child! - but this is NOT an &quot;easy&quot; child.  Good for you for taking this senstive approach! (And good for my wife, Maureen for leading me to this point of view because I was NOT in agreement at first) The irony is I&#39;m like this myself and wasn&#39;t able to understand it.  I think it had been beaten out of me with Dad&#39;s belt and A LOT of &quot;those&quot; looks that threaten more violence if not complying with their wishes.<br/>\n<br/>\n-=-We have never spanked<br/>\n<br/>\nWe did in the early days to no good results, esp. with the &quot;difficult&quot; child - IMHO it destroys people & it does NOT build them or &quot;character.&quot;  I think you know this, but I hate the JUDGEMENTS out there. &gt;:O(<br/>\n<br/>\nNow that our dd is 15, our respective mil&#39;s are realizing that this IS the right way - tho they could not do it themselves now and could NOT buy the concept when she was 5.  My mom is so uptight and Maureen&#39;s mom is too rash/used to hitting.<br/>\n<br/>\n<br/>\n-=-When she was a baby only I was allowed to hold her.  <br/>\n<br/>\nMaybe try the &quot;Highly Sensitive Child&quot; book so often recommended here!  Might helps you and maybe your husband undestand her.<br/>\n<br/>\n<br/>\n<br/>\n-=-Mil was pissed and spent the next 1/2 hour talking to my husband in<br/>\nprivate about how Storey needed professional help to learn how to behave<br/>\nproperly and how we were too lenient with her (my mother thinks this<br/>\nalso) and needed to punish this sort of behavior, about how she&#39;s raised<br/>\n7 kids and knows what she is talking about <br/>\n<br/>\nMaybe take a look at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bullyonline.org\">http://www.bullyonline.org</a> generally and maybe <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bullyonline.org/familybully/index.htm\">http://www.bullyonline.org/familybully/index.htm</a> for help with mil.  Great site!  Helped me see where the lines of help/hurt are a lot more clearly.  <br/>\n<br/>\n<br/>\n-=-(btw, of those 7, all except<br/>\nmy husband have been divorced at least twice, 2 of them have been in and<br/>\nout of jail, at least 2 of them are alcoholics/drug abusers,  and 1<br/>\ndoesn&#39;t even speak to her.  Maybe it&#39;s just a coincidence, but my<br/>\nhusband says they were never told they were loved or hugged and punished<br/>\nharshly and often.)<br/>\n<br/>\nI see a crisis in parenting in this world - very sad to me  :O(<br/>\n<br/>\n<br/>\n-=-So now my husband is saying that maybe we should have her professionally<br/>\nevaluated<br/>\n<br/>\nWell, it&#39;s my belief that this will help if you feel there is a need.  If not, it will likely do damage.  No one wants to be under the microscope for acting naturally, of course.  Our dd has been assessed for CAPD and has some counselling but only as a teen.  It&#39;s a hard choice because intervention by &quot;authorities&quot; can hurt as much as help, IMHO. It&#39;s like back surgery - might work - might be worse.  :O)<br/>\n<br/>\nAnyway, my humble thots are those brilliant, interesting, wonderful type people,<br/>\n<br/>\nTim T<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152271008,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"jonkream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-Discussion] my lovely daughter","postDate":"1057165623","msgId":75959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjIwMWMzNDBiYyQ1YzhiYzkwMCQ2NDAwYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+"},"prevInTopic":75957,"nextInTopic":75960,"prevInTime":75958,"nextInTime":75960,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"... get off. **If anyone needs professional help to learn how to behave properly , it s your mother in law.  Have you tried telling her privately that she","messageBody":"<div id=\"ygrps-yiv-1725315730\"><blockquote><span title=\"ireply\">&gt; Mil kept telling her that she was too big to be on my lap and to<br/>\n </span></blockquote>get off.<br/>\n<br/>\n**If anyone needs professional help to learn how to &#39;behave properly&#39;, it&#39;s<br/>\nyour mother in law.  Have you tried telling her privately that she needs to<br/>\nstop interfering in your mothering?<br/>\n<br/>\nYour daughter needs what she needs - whatever her age.  You&#39;re absolutely<br/>\ndoing the right thing by giving her what she needs from you.  ~Rue<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":87403280,"authorName":"saffronwoman","from":"&quot;saffronwoman&quot; &lt;windystreet@...&gt;","profile":"saffronwoman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my lovely daughter","postDate":"1057164836","msgId":75952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJkdjJuNCtjbDJwQGVHcm91cHMuY29tPg=="},"prevInTopic":75951,"nextInTopic":75956,"prevInTime":75951,"nextInTime":75953,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"***You mentioned being in marriage counseling - could Storey be picking up on the vibes between you and your husband and reacting in the only reasonable way","messageBody":"<div id=\"ygrps-yiv-1254986877\">***You mentioned being in marriage counseling -<br/>\ncould Storey be picking <br/>\nup on the vibes between you and your husband<br/>\nand reacting in the only <br/>\nreasonable way she knows?<br/>\nHelen****<br/>\n<br/>\nWell, both of our kids have certainly seen some tension around the <br/>\nhouse in the past few months.  Maybe it&#39;s been happening longer than my <br/>\nhusband and I realize.  But the counseling is really helping and we all <br/>\nsee the changes for the better in our family.<br/>\n<br/>\nAs far as Storey&#39;s behaviour, it&#39;s only gotten better over time.  She <br/>\nis much less difficult to be with now, compared with even a year ago.  <br/>\nSo I don&#39;t think that her &quot;rude and disrespectful&quot; (mil&#39;s quote) <br/>\nbehaviour is related to our marriage.  Storey has never (even as a <br/>\nbaby) put up with people who don&#39;t like her, she has a great bullshit <br/>\nmeter and refuses to be with or talk to people who she feels are <br/>\ncondescending toward her or her brother.  <br/>\n<br/>\nI really feel that my mil is just demanding something (respect?) from <br/>\nsome one who feels that she doesn&#39;t deserve it.  I mean, why would <br/>\nStorey want to be kind to her grandmother when her grandmother has <br/>\nnever hugged her or said any kind word to her?  The kind words are <br/>\nreserved for our son.<br/>\n<br/>\nKate<br/>\nfeeling a little better now that I&#39;ve been able to get this stuff off <br/>\nmy chest.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057164709","msgId":75951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4LjNhOGEwZTk3LjJjMzQ2N2E1QGFvbC5jb20+"},"prevInTopic":75950,"nextInTopic":75952,"prevInTime":75950,"nextInTime":75952,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/03 10:00:35 AM, windystreet@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1303148699\">In a message dated 7/2/03 10:00:35 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:windystreet@...\">windystreet@...</a> writes:<br/>\n<br/>\n&lt;&lt; So, to sum up a very long story, what do you think about the idea of<br/>\nprofessional evaluations?  Do they do any good?  I say we should just<br/>\nraise her the way we have been, she&#39;s gotten easier to be around so we<br/>\nseem to be doing something right.  &gt;&gt;<br/>\n<br/>\nYou could easily give someone $100 to tell you you should put her in school.<br/>\n<br/>\nYou KNOW that&#39;s not the answer, but what other answers could possibly be <br/>\nexpected to come from a professional who became &quot;professional&quot; by 18 or 20 years <br/>\nin school?<br/>\n<br/>\nDo you think drugs or daycare would help?<br/>\n<br/>\nFirst brainstorm with your husband what &quot;professional help&quot; he thinks would <br/>\nhelp.  Play therapy?  (Are there serious home problems?  I doubt it--you said <br/>\nthis was from birth, and play therapy isn&#39;t going to get to a genetic <br/>\nlevel--they&#39;re looking for trauma or odd relationships or behaviors on the part of <br/>\nother family members in her life which she would act out with dolls or puppets.)<br/>\n<br/>\nMaybe a compromise would be discuss it with your husband, get some books to <br/>\nread together, and say if she&#39;s still having such problems at eight, or nine, <br/>\nyou&#39;ll consider having someone else talk to her.<br/>\n<br/>\n&lt;&lt;My husband and I are in marriage counseling right now and I was thinking<br/>\nof asking the counselor about this.&gt;&gt;<br/>\n<br/>\nI&#39;d mention it.<br/>\n<br/>\nTwo friends of mine are in counselling and the counsellor has a GREAT plan.  <br/>\nOne of their major problems is the relationship between the dad and the middle <br/>\nchild, older of two boys.    That child is most like the mom (hmmmm) and the <br/>\ndad is MEAN to him.  So instead of first working on the marriage and later, <br/>\nmaybe, move on to the child, the counsellor uses 20 minutes of each session to <br/>\ndiscuss how it&#39;s going with that child, and how the dad&#39;s changing his approach <br/>\nand how the mom feels about it.<br/>\n<br/>\nLots of the marriage stuff shows in that.<br/>\nAnd if that&#39;s changed, the husband will see changes in the relationship with <br/>\nhis wife, because part of his focus is that he doesn&#39;t WANT the boy to be so <br/>\nmuch like his mom.  <br/>\n<br/>\nIt&#39;s kinda flashingly (embarrassingly) obvious from the outside, but close up <br/>\nthe dad can&#39;t see any of it.<br/>\n<br/>\nSo 1/3 is that, 1/3 is personal relations, and I think the other 1/3 might be <br/>\nfinances.  (I forget.)<br/>\n<br/>\nThat might apply not one bit, but then it might, a touch.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1294635,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] my lovely daughter","postDate":"1057163971","msgId":75950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkxOGJiMjhiOTI1NTU1YUBbMTIuMjEuMjA5LjEwMV0+","inReplyToHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+","referencesHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+"},"prevInTopic":75947,"nextInTopic":75951,"prevInTime":75949,"nextInTime":75951,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"Wow, Kate. From reading your post - and my *only* perspective comes from that so please keep this in that context - I don t think the problem is with your","messageBody":"<div id=\"ygrps-yiv-185108821\">Wow, Kate. From reading your post - and my *only* perspective comes <br/>\nfrom that so please keep this in that context - I don&#39;t think the <br/>\nproblem is with your lovely daughter (what a wonderful image!), but <br/>\nwith others who don&#39;t want to take the time or make the effort you&#39;ve <br/>\nmade to understand what&#39;s happening - and why. It seems to me that <br/>\nyou&#39;ve got a good handle on the situation, so my advice would be to <br/>\nkeep doing just what you&#39;re doing and try to keep the MiL from <br/>\nnegatively affecting your daughter any more than she already has.<br/>\n<br/>\nYou mentioned being in marriage counseling - could Storey be picking <br/>\nup on the vibes between you and your husband and reacting in the only <br/>\nreasonable way she knows? As far as professional evaluations, I&#39;ve <br/>\nnever had - or wanted - any experience with those, so I can&#39;t advise <br/>\nin that department. But my instincts have always been to listen to my <br/>\nkids when I wasn&#39;t sure how to proceed. Even when they were small and <br/>\nseemingly inexperienced they knew an awful lot about what was going <br/>\non, and why, and what could or should be done to make things right.<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":87403280,"authorName":"Jeff & Kate Kerr","from":"Jeff & Kate Kerr &lt;windystreet@...&gt;","profile":"saffronwoman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"my lovely daughter","postDate":"1057161474","msgId":75947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGMDMwMEZGLjczOUIwODk2QGVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":75950,"prevInTime":75946,"nextInTime":75948,"topicId":75947,"numMessagesInTopic":0,"msgSnippet":"We are having a problem I don t know how to deal with.  My youngest, Storey is 5 1/2, is a handful.  I don t mean that in a disrespectful way, I mean she is","messageBody":"<div id=\"ygrps-yiv-369695186\">We are having a problem I don&#39;t know how to deal with.  My youngest,<br/>\nStorey is 5 1/2, is a handful.  I don&#39;t mean that in a disrespectful<br/>\nway, I mean she is curious about everything, into everything, and wants<br/>\nwhat she wants right now.  She is bright and funny and a good mother to<br/>\nher guinea pig.  She considers herself an artist (I consider her one<br/>\nalso, she&#39;s got a talent for it) and seems to have the temperament of a<br/>\ntrue artist (dedicated, true to her vision, etc...).<br/>\n<br/>\nWe have never spanked, but we used to give time outs (they don&#39;t work by<br/>\nthe way.  Since we&#39;ve stopped doing that both of my kids behavior is<br/>\nmore pleasant and they don&#39;t misbehave as they used to).  My husband<br/>\nthinks we need to go back to the punishing.<br/>\n<br/>\nHere&#39;s why:  Storey has only ever wanted me to comfort her.  When she<br/>\nwas a baby only I was allowed to hold her.  She would scream if anyone<br/>\nelse did.  She would wake up if she was set down to sleep (even though<br/>\nshe was sleeping right next to me, I needed to have my arms around<br/>\nher).  She nursed and would never take a bottle of breast milk (my<br/>\nhusband still has a hard time with this - our oldest allowed him to<br/>\nbottle feed occasionally).  I spent many years being &quot;touched out&quot;<br/>\nbecause of the amount of time that Storey needed from me.<br/>\n<br/>\nMy mother-in-law says that Storey is spoiled and rude because Storey<br/>\ndoesn&#39;t like to be around her (whereas our son is perfect and easy - she<br/>\nactually says that in front of the kids).  I say that mil has made it<br/>\nvery clear to Storey that she doesn&#39;t like her.  Storey responds to mil<br/>\nby not wanting to be near her, not answering her when spoken to.<br/>\n<br/>\nWe spent the afternoon at my in-laws this Sunday and Storey sat on my<br/>\nlap.  Mil kept telling her that she was too big to be on my lap and to<br/>\nget off.  I kept repeating that she was fine and to let her be.  Finally<br/>\nI&#39;d had enough and asked Storey to sit next to me, but that meant that<br/>\nshe would be sitting next to her grandmother and Storey did not want to<br/>\ndo that.<br/>\n<br/>\nStorey had a melt down and was crying saying she didn&#39;t want to be<br/>\nthere, didn&#39;t want to come in the first place and could we please go<br/>\nhome.  Instead of punishing her for what mil thinks was manipulative<br/>\nbehavior, I held her and talked calmly with her explaining that daddy<br/>\nand Robin were having a good time, we had just gotten there and were<br/>\nthere to have lunch with the grandparents and that we would be leaving<br/>\nsoon, but not right now.  (By the time we were ready to go Storey and<br/>\nRobin were making pots - my in-laws are potters - and neither of them<br/>\nwanted to go.)<br/>\n<br/>\nMil was pissed and spent the next 1/2 hour talking to my husband in<br/>\nprivate about how Storey needed professional help to learn how to behave<br/>\nproperly and how we were too lenient with her (my mother thinks this<br/>\nalso) and needed to punish this sort of behavior, about how she&#39;s raised<br/>\n7 kids and knows what she is talking about (btw, of those 7, all except<br/>\nmy husband have been divorced at least twice, 2 of them have been in and<br/>\nout of jail, at least 2 of them are alcoholics/drug abusers,  and 1<br/>\ndoesn&#39;t even speak to her.  Maybe it&#39;s just a coincidence, but my<br/>\nhusband says they were never told they were loved or hugged and punished<br/>\nharshly and often.).<br/>\n<br/>\nSo now my husband is saying that maybe we should have her professionally<br/>\nevaluated, maybe there really is something wrong with her.  We ended up<br/>\nin a long heated discussion over this.  I disagree with him.  Yes Storey<br/>\nis needy, but she&#39;s 5, not 30.  Yes Storey is a handful, but it&#39;s ok<br/>\nbecause she is my daughter and I want to help her and be with her.<br/>\n<br/>\nSo, to sum up a very long story, what do you think about the idea of<br/>\nprofessional evaluations?  Do they do any good?  I say we should just<br/>\nraise her the way we have been, she&#39;s gotten easier to be around so we<br/>\nseem to be doing something right.  But maybe my husband has a point?<br/>\nI&#39;m really confused.  (Maybe I&#39;m just looking for people to agree with<br/>\nme?  To help me back up what I think is the right way?)<br/>\n<br/>\nMy husband and I are in marriage counseling right now and I was thinking<br/>\nof asking the counselor about this.<br/>\n<br/>\nSorry for the length, thanks for letting me get this off my chest.<br/>\n<br/>\nKate<br/>\nwho is a little confused right now</div>","specialLinks":[]}],"prevTopicId":75672,"nextTopicId":76174}}