{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] trusting...","postDate":"1079593019","msgId":19077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczQkQxQTM0LTc4QTktMTFEOC1BQ0M3LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDQzLjI5MjBiYzVkLjJkODg4MWViQGFvbC5jb20+","referencesHeader":"PDQzLjI5MjBiYzVkLjJkODg4MWViQGFvbC5jb20+"},"prevInTopic":19064,"nextInTopic":0,"prevInTime":19076,"nextInTime":19078,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":"... I actually revel in that feeling now. I love it when something crops up and the kids aren t interested and I can say to myself, Oh well - another time,","messageBody":"<div id=\"ygrps-yiv-294386711\">On Mar 16, 2004, at 8:14 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Another level of that understanding comes when you&#39;re willing for not <br/>\n&gt; much to<br/>\n&gt; be available, and then things crop up.  Or you see a crop of <br/>\n&gt; opportunities,<br/>\n&gt; and your child&#39;s not too interested, and you really don&#39;t mind.<br/>\n<br/>\n </span></blockquote>I actually revel in that feeling now. I love it when something crops up <br/>\nand the kids aren&#39;t interested and I can say to myself, &quot;Oh well - <br/>\nanother time, another place.&quot;<br/>\n<br/>\nIt is calming. Meditative. Peaceful. Makes me feel like my head is <br/>\nscrewed on right! &lt;G&gt;<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] trusting...","postDate":"1079453675","msgId":19064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzLjI5MjBiYzVkLjJkODg4MWViQGFvbC5jb20+"},"prevInTopic":19059,"nextInTopic":19077,"prevInTime":19063,"nextInTime":19065,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/15/04 9:15:44 PM, barb@netcetera.com writes: ","messageBody":"<div id=\"ygrps-yiv-1396081707\">In a message dated 3/15/04 9:15:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a> writes:<br/>\n<br/>\n&lt;&lt; One of the magical things that has happened has been a homeschool play<br/>\ngroup starting in a nearby town.  It currently has 5 families, and 4 of<br/>\nthem are unschoolers - can you believe!!  &gt;&gt;<br/>\n<br/>\nYou lucked out!!<br/>\n<br/>\n&lt;&lt; My notion didn&#39;t trust in life to present the options and the solutions <br/>\nwhen<br/>\nwe were ready.  I didn&#39;t really want to follow my own notion (hence the<br/>\npaperwork sitting on the shelf), but it took my mind awhile to catch up.&gt;&gt;<br/>\n<br/>\nA friend of mine put her kids in school and told them not to tell me.  They <br/>\naccidently mentioned it to Holly and the mom kind of panicked.  <br/>\n<br/>\nShe was intellectually prepared to understand unschooling, but she just <br/>\ndidn&#39;t let her breath out, y&#39;know?  She would do it if it worked before she ran out <br/>\nof oxygen (or something), and she chickened out and put them in the Family <br/>\nSchool here, which is a half-day program, but Holly said last night they&#39;re in <br/>\nfrom 8:00 to 4:30 so I think they might be in a whole different deal.  4:30!?  <br/>\n(She had a baby a week and a half ago, so if that was her real reason I <br/>\nunderstand better.  Their house is always immaculately clean and very sparse.)<br/>\n<br/>\n&lt;&lt;I don&#39;t know if I&#39;m expressing this very well, but all of a sudden I got a<br/>\nnew depth of the trust thing.  Whatever we might be needing in the future<br/>\nwill be taken care of... the options and solutions will be available.  If<br/>\nwe trust the process, then we will see what is available. &gt;&gt;<br/>\n<br/>\nThis is so sweet!<br/>\n<br/>\nAnother level of that understanding comes when you&#39;re willing for not much to <br/>\nbe available, and then things crop up.  Or you see a crop of opportunities, <br/>\nand your child&#39;s not too interested, and you really don&#39;t mind.<br/>\n<br/>\n-=-Oh, something else I thought recently.  I had no idea this list wasn&#39;t for<br/>\nnewbies - so I thank you all for being here and willing to listen to me and<br/>\nto share your perspectives.-=-<br/>\n<br/>\nI wasn&#39;t the one who said it wasn&#39;t for newbie, and it&#39;s my list, but I <br/>\nunderstood the intent of the statement.  This is more for people who really <br/>\nunderstand unschooling or who are willing to try.   Though newcomers are welcome, it <br/>\nwasn&#39;t set up to cater to people who had never heard of John Holt or were <br/>\ngoing to say &quot;What do you mean, &#39;unschooling&#39;?&quot;<br/>\n<br/>\nI really liked reading what you wrote and have stashed it for future use.  <br/>\nThings in the archives of groups like this are there for a long time but <br/>\nsometimes they&#39;re hard to search out.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":157270430,"authorName":"Barbara Chase","from":"Barbara Chase &lt;barb@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"trusting...","postDate":"1079410480","msgId":19059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjAxMDIwOGJjN2MyMzA3YTg3NkBbMjA0LjE4OS4xMS40MV0+","inReplyToHeader":"PDNGREI3REY1LkI3ODdEN0E1QHJyY25ldC5vcmc+","referencesHeader":"PDIwMDMxMjA1MDY0NjA0LjExNzgwLnFtYWlsQHdlYjQwNzEwLm1haWwueWFob28uY29tPiA8cDA2MDEwMjJiYmJmZTg1Mzk0MWY5QFsyMDQuMTg5LjExLjQxXT4gPDNGREI3REY1LkI3ODdEN0E1QHJyY25ldC5vcmc+"},"prevInTopic":17544,"nextInTopic":19064,"prevInTime":19058,"nextInTime":19060,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":"Awhile ago I posted about my notion of joining our local school as homeschoolers rather than doing the R4.  I ve been meaning to post about this again, and","messageBody":"<div id=\"ygrps-yiv-1960871969\">Awhile ago I posted about my notion of joining our local school as<br/>\nhomeschoolers rather than doing the R4.  I&#39;ve been meaning to post about<br/>\nthis again, and with the Jane&#39;s recent post (thanks, it was really great)<br/>\nabout letting go and trust I know it&#39;s time that I share again...<br/>\n<br/>\nWell, I got the paperwork and it sat on a shelf for a few weeks.  Then I<br/>\nactually filled it out (I can&#39;t believe how many pieces of paper they<br/>\nwant!!), and that sat on the shelf again for weeks.  In fact, it&#39;s still<br/>\nthere.  We sort of got busy with life again!  I haven&#39;t had time to meet up<br/>\nwith my friend, and certainly haven&#39;t even thought about the paperwork.<br/>\n<br/>\nIn the meantime, I&#39;ve been trusting more and more in life and it&#39;s journey.<br/>\nIt&#39;s not a thought anymore, something that I remind myself of; rather it<br/>\nseems to be something that I&#39;m noticing after the fact.  This is really<br/>\nnice, not only for me but for my whole family!<br/>\n<br/>\nOne of the magical things that has happened has been a homeschool play<br/>\ngroup starting in a nearby town.  It currently has 5 families, and 4 of<br/>\nthem are unschoolers - can you believe!!  We live pretty rurally, so I was<br/>\njust amazed.  Needless to say I am in heaven having other real life people<br/>\nto share experiences with, and my dd is warming up to the group too.<br/>\n<br/>\nSo anyway, one day I realized that I hadn&#39;t hooked up with my friend at the<br/>\nschool.  I sent her an email letting her know my schedule was pretty hectic<br/>\nfor the next month or so, and she let me know that we only need to meet<br/>\nonce a month and that she&#39;s very flexible.  Well, then it clicked... I was<br/>\nvery appreciative of her flexibility, liked her approach to find a way<br/>\naround the system, etc... but I really didn&#39;t want to &quot;have&quot; to even do<br/>\nthat one meeting.  It&#39;s no surprise that I haven&#39;t turned in the paperwork;<br/>\nI don&#39;t want to &quot;have&quot; to.<br/>\n<br/>\nThen as I was talking with my new friends, we were talking with one Mom in<br/>\nthe group whose dd wants to go to a local homeschooling &quot;school&quot; so she can<br/>\nplay with other kids, but that it was mostly the Mom&#39;s idea because she<br/>\nwanted them to have the option to be able to take some of the neat classes<br/>\nthey had, and all of a sudden I heard my own notion...  I had wanted my dd<br/>\nto be part of the school, but as a homeschooler, so that she could take<br/>\nadvantage of some of the stuff they have going on -- just in case.  My<br/>\nnotion didn&#39;t trust in life to present the options and the solutions when<br/>\nwe were ready.  I didn&#39;t really want to follow my own notion (hence the<br/>\npaperwork sitting on the shelf), but it took my mind awhile to catch up.  I<br/>\ndon&#39;t know if I&#39;m expressing this very well, but all of a sudden I got a<br/>\nnew depth of the trust thing.  Whatever we might be needing in the future<br/>\nwill be taken care of... the options and solutions will be available.  If<br/>\nwe trust the process, then we will see what is available.  If we don&#39;t have<br/>\nthe trust, then we will not see -- we will be thinking to the future.<br/>\n<br/>\nIt&#39;s really each and every moment that we need to do this.  When we have<br/>\nsomething come up in one moment, it doesn&#39;t mean that it will be there in<br/>\nthe next moment.  New stuff happens, and the issues change.  Today isn&#39;t<br/>\nanything like yesterday - not really.  This sounds so trite... but I think<br/>\nYKWIM.<br/>\n<br/>\nI also see this playing out with the recent reading thread.  It&#39;s not that<br/>\nwe just need to trust that our kids will learn to read, or trust that they<br/>\nwill do it when they are ready.  We also need to bring it into the moment,<br/>\nand then not hold on to it for the future.  For example, I&#39;ve noticed with<br/>\nmy dd that sometimes she asks me to help her learn to read, and she even<br/>\nmay express frustration that it hasn&#39;t happened yet.  So, we make up games<br/>\n(index cards, word games, she&#39;s even asked me to buy a workbook.)  And she<br/>\nhas fun doing it in the moment that she&#39;s asked for it.  But then I try not<br/>\nto hold on to her request as being something that she now wants me to do<br/>\nforever.  When I let go of it (the request and any assumptions that I may<br/>\nhave had around it), then things work so well!  She usually wants to do<br/>\nreading games once a month or so.  The rest of the time she is very happy<br/>\nnot being a reader.  It took me awhile to see this, but it was so easy to<br/>\nsee when I let go of yesterday&#39;s request.<br/>\n<br/>\nOh, something else I thought recently.  I had no idea this list wasn&#39;t for<br/>\nnewbies - so I thank you all for being here and willing to listen to me and<br/>\nto share your perspectives.<br/>\n<br/>\n<br/>\nciao<br/>\n--bc--<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] needing more of a challenge","postDate":"1071491420","msgId":17544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MC4yM2MyMjQ0Zi4yZDBmMDM1Y0Bhb2wuY29tPg=="},"prevInTopic":17543,"nextInTopic":19059,"prevInTime":17543,"nextInTime":17545,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1963547709\">&lt;&lt;My kids have each other for company but I&#39;d probably seek out another<br/>\nhomeschooled child for company otherwise.  It&#39;s fun to have friends<br/>\nover and lots of my kids&#39; favorite activities need a second person&gt;&gt;<br/>\n<br/>\nI found that the same old activities, with the addition of another child, <br/>\nwere often quite different.  My kids have learned a lot from their friends, and <br/>\noften the same old game takes a whole new aspect with a new kid involved, or a <br/>\ntoy they have has always been played with the same two or three ways, and <br/>\nanother kid has a new idea.<br/>\n<br/>\nI liked the list of ideas.  It mentioned learning to darn.   I darned one of <br/>\nHolly&#39;s favorite socks.  Usually they have four matching pairs of something <br/>\nand if one gets a hole I use it for a disposable cleaning rag and we move on.  <br/>\nBut she had a pair of patterned socks and really liked them.  So I darned a <br/>\nhole.  She was amazed.  Just a couple of days ago she came in with the sock over <br/>\nher hand and said &quot;This is So COOL!  This is so pretty.&quot;   <br/>\n<br/>\nCheap thrills. &lt;g&gt;   Darning is so rarely done anymore.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":97178025,"authorName":"Alicia Bayer","from":"Alicia Bayer &lt;abayer@...&gt;","profile":"alicia_bayer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] needing more of a challenge","postDate":"1071355054","msgId":17541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGREI5NEFELjMxOTAyRDA1QHJyY25ldC5vcmc+","referencesHeader":"PDIwMDMxMjA1MDY0NjA0LjExNzgwLnFtYWlsQHdlYjQwNzEwLm1haWwueWFob28uY29tPiA8cDA2MDEwMjJiYmJmZTg1Mzk0MWY5QFsyMDQuMTg5LjExLjQxXT4="},"prevInTopic":17532,"nextInTopic":17543,"prevInTime":17540,"nextInTime":17542,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":"Barb, our daughters are pretty close in age.  Victoria turned 5 in May, so she s just a little older than your daughter.  Would your daughter like a pen pal?","messageBody":"<div id=\"ygrps-yiv-1614952396\">Barb, our daughters are pretty close in age.  Victoria turned 5 in<br/>\nMay, so she&#39;s just a little older than your daughter.  Would your<br/>\ndaughter like a pen pal?  I think Victoria would really get a kick out<br/>\nof it and we could send an art care package of some fun craft stuff<br/>\nthat we have extras of.  Write me offlist if you&#39;re interested.<br/>\n<br/>\n--<br/>\n     Alicia<br/>\n<br/>\nA Magical Childhood<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.magicalchildhood.com\">http://www.magicalchildhood.com</a><br/>\n<br/>\n&quot;The best way to make children good is to make them happy.&quot;<br/>\n- Oscar Wilde</div>","specialLinks":[]},{"userId":97178025,"authorName":"Alicia Bayer","from":"Alicia Bayer &lt;abayer@...&gt;","profile":"alicia_bayer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] needing more of a challenge","postDate":"1071349237","msgId":17543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGREI3REY1LkI3ODdEN0E1QHJyY25ldC5vcmc+","referencesHeader":"PDIwMDMxMjA1MDY0NjA0LjExNzgwLnFtYWlsQHdlYjQwNzEwLm1haWwueWFob28uY29tPiA8cDA2MDEwMjJiYmJmZTg1Mzk0MWY5QFsyMDQuMTg5LjExLjQxXT4="},"prevInTopic":17541,"nextInTopic":17544,"prevInTime":17542,"nextInTime":17544,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":"Hi.  I m new to the list and haven t posted an intro yet either.  :) I m Alicia, mama to Victoria (5), Annalee (3) and Jack (7 months). Here s some stuff that","messageBody":"<div id=\"ygrps-yiv-107340729\">Hi.  I&#39;m new to the list and haven&#39;t posted an intro yet either.  :)<br/>\nI&#39;m Alicia, mama to Victoria (5), Annalee (3) and Jack (7 months).<br/>\n<br/>\nHere&#39;s some stuff that my 5 year old loves to do:<br/>\n<br/>\nReading, with lots of trips to the library to pick out more books (she<br/>\nlikes to both read and be read to)<br/>\n<br/>\nart-- I believe in making quality art materials available to children<br/>\nbecause you can&#39;t produce satisfying art with cheap junk.  :)  I&#39;m<br/>\nfrugal in most stuff but I think it&#39;s worth the extra in this case.<br/>\nSome materials that we have are-- oil pastels, crayons, markers,<br/>\nwatercolor paints in tubes and in trays, bleeding tissue paper (stains<br/>\nthe paper when you wet it, really cool projects if you cut it and<br/>\npaint water onto a white sheet and then lay the tissue paper on),<br/>\ncharcoal pencils, construction paper, art paper (copy paper doesn&#39;t<br/>\nhold paint well), stamps and ink pads and watercolor crayons and<br/>\npencils.  These last ones are especially fun.  You draw with them and<br/>\nthen paint with water to blend the colors.<br/>\n<br/>\ncrafts-- We have lots of beads and strings for necklaces, ribbons and<br/>\nbuttons for embellishing socks, etc.<br/>\n<br/>\nShe is learning to sew/darn and really enjoys that.<br/>\n<br/>\nShe loves blocks, especially colored ones to make elaborate patterns<br/>\nwith.  www.hearthsong.com has great block sets that are really<br/>\ncreative and fun.  She also plays with Cuisenaire rods, which can be<br/>\nused to explain all sorts of math subjects (fractions, addition,<br/>\nalgebra....).  We have these old colored, wooden shape blocks that she<br/>\nadores and I&#39;ve been looking for 3 years for more.<br/>\n<br/>\nShe likes watching PBS shows like ZOOM and then recreating the<br/>\nexperiments, recipes and crafts.<br/>\n<br/>\nWe do kitchen experiments like putting bread in a bag and watching the<br/>\nmold, getting out snow and salt and dirt and seeing the effects it<br/>\nwould have on icy roads, putting celery in colored water, etc.<br/>\n<br/>\nWe go places a LOT.  We don&#39;t necessarily go to &quot;educational&quot; places<br/>\nbut it&#39;s all cool and interesting anyway.  When I was at the Mayo<br/>\nClinic for a bunch of tests, I brought my kids into the nuerologist&#39;s<br/>\nappointment and asked him to bring up the EEG scans of my brain so my<br/>\ngirls could see.  How often do you get to see your mom&#39;s brain?  LOL<br/>\nWhen we picked the cat up from the vet I asked if we could tour the<br/>\nback.  When we get tires we go all over looking at how they use the<br/>\nmachines....  We also stop at rest stops and read all the signs and<br/>\nstuff.  :)<br/>\n<br/>\nBoth of my girls love spending time on the computer.  They have a<br/>\nvariety of games and art programs on it and they really enjoy it.<br/>\n<br/>\nMy husband prints out coloring pages and worksheets from the net on<br/>\nwhatever subject they&#39;re interested in or he just surprises them.  I<br/>\nthink last week they colored these elaborate Native American turtle<br/>\ndesigns, did llama coloring pages, answered a 20 questions page<br/>\ndesigned for something completely different, did pages in about 6<br/>\nworkbooks they have (we get them for a dollar at the dollar store and<br/>\nthey love them) and colored and cut out masks from another site.<br/>\n<br/>\nBoth of my girls love Brainquest cards.  They&#39;re spendy ($8-10) but<br/>\nthey like quizzing themselves or being quizzed, especially when<br/>\nwaiting in waiting rooms and stuff like that.<br/>\n<br/>\nBoth girls like card games, concentration and similar games.<br/>\n<br/>\nVictoria loves marble runs that you build, and a marble maze we got at<br/>\na thrift store for a dollar.<br/>\n<br/>\nBoth of my kids love cooking and cook often.  Young kids can make<br/>\nbread (kneading and forming it into fun shapes is especially<br/>\nrewarding), cookies, supper.....<br/>\n<br/>\nCraft projects like weaving, knitting or woodworking could be fun.<br/>\n<br/>\nMy girls like helping me with mundane stuff like sorting socks,<br/>\nfolding clothes, using the dustbuster and lint roller, sweeping up<br/>\nwith the mini whisk, dusting, spraying and wiping surfaces, etc.  They<br/>\nhate cleaning but love using most cleaning gadgets.  &lt;G&gt;<br/>\n<br/>\nWe make sure the kids get lots of physical and sensory activities.<br/>\nIt&#39;s cold here so the basement is our rec area a lot of days.  They<br/>\nhave hippity hops to ride on, a trampoline, a sit n spin and so on.<br/>\nBefore we got the trampoline we let them jump on the couch and bed<br/>\nbecause their physical need for the exercise and sensory input was<br/>\ngreater than our need for good springs.  &lt;G&gt;  It really helps regulate<br/>\ntheir moods to get lots of movement too.<br/>\n<br/>\nOh, and we play music, dance, sing, make up songs, exercise and do<br/>\ngames like Simon Says.  Dulcimers or lap harps are easy enough for<br/>\npreschoolers to learn to play, and sound beautiful.  We also have<br/>\nflutes, maracas, tambourines, keyboards, ukeleles, small guitars and<br/>\ninstruments from other countries.<br/>\n<br/>\nWe do stuff like treasure hunts, where I&#39;ll make up a list of 20<br/>\nthings to find in the house (something that starts with a B, something<br/>\norange, something that was once alive.....).  For my pre-reader, we<br/>\ncut out magazine pictures and then glued them onto pages and she had<br/>\nto find those (bed, letter R, this brand of cereal....).<br/>\n<br/>\nI agree with whoever said to look for open-ended toys.  Legos, blocks,<br/>\nplastic animals, lite brite.... the same toys get used again and again<br/>\nhere.  My daughters will also create their own stuff to do with<br/>\nstring, tape, scissors and old boxes and paper towel tubes and stuff.<br/>\n<br/>\nNature journals are fun, too.<br/>\n<br/>\nMy kids have each other for company but I&#39;d probably seek out another<br/>\nhomeschooled child for company otherwise.  It&#39;s fun to have friends<br/>\nover and lots of my kids&#39; favorite activities need a second person so<br/>\nI can see how it would be harder not to get bored by yourself.<br/>\n<br/>\nHope something in there helps.  :)<br/>\n--<br/>\n     Alicia<br/>\n<br/>\nA Magical Childhood<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.magicalchildhood.com\">http://www.magicalchildhood.com</a><br/>\n<br/>\n&quot;The best way to make children good is to make them happy.&quot;<br/>\n- Oscar Wilde</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] needing more of a challenge","postDate":"1071241024","msgId":17532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWMzYzBjMCQzNTBmNjEwMCQ3NDgwZWU0MEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDIwMDMxMjA1MDY0NjA0LjExNzgwLnFtYWlsQHdlYjQwNzEwLm1haWwueWFob28uY29tPiA8cDA2MDEwMjJiYmJmZTg1Mzk0MWY5QFsyMDQuMTg5LjExLjQxXT4="},"prevInTopic":17529,"nextInTopic":17541,"prevInTime":17531,"nextInTime":17533,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":" From your post, I gather she is an only child.  Do Y all do park days with other kids?  Even my 13 year old loves these and wishes we could","messageBody":"<div id=\"ygrps-yiv-1653360735\">&lt;&lt;Any thoughts?&gt;&gt;<br/>\n<br/>\nFrom your post, I gather she is an only child.  Do Y&#39;all do park days with<br/>\nother kids?  Even my 13 year old loves these and wishes we could go more<br/>\nthan once a week.<br/>\n<br/>\nMy kids rarely play with toys and I thought long and hard about it.  I<br/>\nfinally realized that most of the toys on the market today are fairly<br/>\none-dimensional.  Not a lot to them, so specialized that you can tell the<br/>\nmakers are trying to lead you into only playing with the toy in a certain<br/>\nway.  Something someone else (I think Sandra) posted on in the past that I<br/>\nthought was great was to just set some things out on the table that usually<br/>\naren&#39;t played with together, like Barbies and Playdoh, or dominoes and cars,<br/>\nthat kind of thing and see what happens.<br/>\n<br/>\nSomething that my kids love and that sparks lots of stuff around here is my<br/>\nalways trying to &quot;make it ourselves&quot;, like marshmallows, shampoo, soap,<br/>\ncheese, coasters  that kind of stuff.  The kids see things in a different<br/>\nlight when they see how they are made.<br/>\n<br/>\nJulie S.<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Barbara Chase&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Thursday, December 11, 2003 2:55 PM<br/>\nSubject: [AlwaysLearning] needing more of a challenge<br/>\n<br/>\n<br/>\n&gt; Hi.  I&#39;ve been on this list for awhile, I think I even posted an Intro,<br/>\nbut<br/>\n&gt; this is my first quest...  for background, my daughter will be 5 in a<br/>\n&gt; month.  We do classes, like gymnastics and we&#39;ve found a great art class,<br/>\n&gt; but otherwise we don&#39;t do school.  We do make games out of learning stuff<br/>\n&gt; all the time, but I usually get the ideas from my daughter and then I<br/>\n&gt; follow her lead.<br/>\n&gt;<br/>\n&gt; Anyway, our current situation is this... she complains about being bored.<br/>\n&gt; I know this is nothing new to kids, but she explains it more as having<br/>\n&gt; outgrown all of her toys; she does tend to do the same play day-in and<br/>\n&gt; day-out.  It seems as though she is really looking for more of a<br/>\nchallenge,<br/>\n&gt; but I need some ideas here... the &quot;usual&quot; challenge (or change anyway)<br/>\nthat<br/>\n&gt; is offered to kids is to go into school.<br/>\n&gt;<br/>\n&gt; When she was younger I would have said that she is ready to make a huge<br/>\n&gt; leap forward with some development.  I&#39;m sure this is going on now, I just<br/>\n&gt; don&#39;t have as much of an idea about what the development would be and how<br/>\n&gt; to support it as compared to when she was a toddler.<br/>\n&gt;<br/>\n&gt; Any thoughts?   Thanks<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Namaste<br/>\n&gt; --bc--<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":157270430,"authorName":"Barbara Chase","from":"Barbara Chase &lt;barb@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"needing more of a challenge","postDate":"1071176141","msgId":17529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjAxMDIyYmJiZmU4NTM5NDFmOUBbMjA0LjE4OS4xMS40MV0+","inReplyToHeader":"PDIwMDMxMjA1MDY0NjA0LjExNzgwLnFtYWlsQHdlYjQwNzEwLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDMxMjA1MDY0NjA0LjExNzgwLnFtYWlsQHdlYjQwNzEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":17501,"nextInTopic":17532,"prevInTime":17528,"nextInTime":17530,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":"Hi.  I ve been on this list for awhile, I think I even posted an Intro, but this is my first quest...  for background, my daughter will be 5 in a month.  We do","messageBody":"<div id=\"ygrps-yiv-1435978376\">Hi.  I&#39;ve been on this list for awhile, I think I even posted an Intro, but<br/>\nthis is my first quest...  for background, my daughter will be 5 in a<br/>\nmonth.  We do classes, like gymnastics and we&#39;ve found a great art class,<br/>\nbut otherwise we don&#39;t do school.  We do make games out of learning stuff<br/>\nall the time, but I usually get the ideas from my daughter and then I<br/>\nfollow her lead.<br/>\n<br/>\nAnyway, our current situation is this... she complains about being bored.<br/>\nI know this is nothing new to kids, but she explains it more as having<br/>\noutgrown all of her toys; she does tend to do the same play day-in and<br/>\nday-out.  It seems as though she is really looking for more of a challenge,<br/>\nbut I need some ideas here... the &quot;usual&quot; challenge (or change anyway) that<br/>\nis offered to kids is to go into school.<br/>\n<br/>\nWhen she was younger I would have said that she is ready to make a huge<br/>\nleap forward with some development.  I&#39;m sure this is going on now, I just<br/>\ndon&#39;t have as much of an idea about what the development would be and how<br/>\nto support it as compared to when she was a toddler.<br/>\n<br/>\nAny thoughts?   Thanks<br/>\n<br/>\n<br/>\nNamaste<br/>\n--bc--</div>","specialLinks":[]},{"userId":157599941,"authorName":"Carrie Wright","from":"&quot;Carrie Wright&quot; &lt;cjwblw@...&gt;","profile":"cjwblw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] anyone read this book?","postDate":"1070639624","msgId":17501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzAwMWMzYmI0NyRmNzZhYTc2MCQxNWFjZTY0MUBsYXB0b3A+","referencesHeader":"PDIwMDMxMjA1MDY0NjA0LjExNzgwLnFtYWlsQHdlYjQwNzEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":17495,"nextInTopic":17529,"prevInTime":17500,"nextInTime":17502,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":"I m working on reading it, so far only two pages into it or so.  I m keeping it in my van and reading it when I have to wait for something or someone, which","messageBody":"<div id=\"ygrps-yiv-1338448205\">I&#39;m working on reading it, so far only two pages into it or so.  I&#39;m keeping<br/>\nit in my van and reading it when I have to wait for something or someone,<br/>\nwhich right now is very little as I&#39;m about three weeks from my due date and<br/>\nhave made life easier by delagating all errands to DH and not signing kids<br/>\nup for stuff until after the first of the year.  So I may have to pull it<br/>\nout of the van and just read it. :)  After I finish Return of the King, I&#39;ve<br/>\nnever read The Lord of the Rings series before but the movies have inspired<br/>\nme and I&#39;m glad.<br/>\n<br/>\nFrom what I&#39;ve read it seems to be advocating less pressure and activities<br/>\nand more free/down time for kids.<br/>\n<br/>\nCarrie<br/>\nHSing Mom to Than, Collin, Lee, Jayden, due Dec. 25th<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;heather mclean&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather_200115@...\">heather_200115@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Friday, December 05, 2003 12:46 AM<br/>\nSubject: [AlwaysLearning] anyone read this book?<br/>\n<br/>\n<br/>\n&gt; Has anyone read this book &quot;Einstein Never Used Flash<br/>\n&gt; Cards&quot; by Roberta Michnick Golinkoff and Kathy<br/>\n&gt; Hirsh-Pasek?  There is an interesting advertisement<br/>\n&gt; for it in my mil&#39;s Prevention magazine.<br/>\n&gt;<br/>\n&gt; Oh, here it is...<br/>\n&gt;<br/>\n&gt; Playing = Learning.<br/>\n&gt;<br/>\n&gt; Einstein Never Used FlashCards: How our children<br/>\n&gt; REALLY learn - and why they need to play more and<br/>\n&gt; memorize less.  Internationally acclaimed<br/>\n&gt; developmental child psychologists offer a compelling<br/>\n&gt; indictment of accelerated learning and provide a<br/>\n&gt; roadmap to intellectual growth through creative play.<br/>\n&gt;<br/>\n&gt; There was another article in the same magazine that I<br/>\n&gt; liked.  &quot;Playing Hooky: when breaking the rules is a<br/>\n&gt; good idea.&quot;  Maybe I mostly like the title of the<br/>\n&gt; article.  He (author & father) did get PERMISSION from<br/>\n&gt; his kid&#39;s teacher before he let his son skip school so<br/>\n&gt; they could spend the day together.<br/>\n&gt;<br/>\n&gt; heather m<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; __________________________________<br/>\n&gt; Do you Yahoo!?<br/>\n&gt; Free Pop-Up Blocker - Get it now<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://companion.yahoo.com/\">http://companion.yahoo.com/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":60629766,"authorName":"heather mclean","from":"heather mclean &lt;heather_200115@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"anyone read this book?","postDate":"1070606764","msgId":17495,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMjA1MDY0NjA0LjExNzgwLnFtYWlsQHdlYjQwNzEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":17501,"prevInTime":17494,"nextInTime":17496,"topicId":17495,"numMessagesInTopic":0,"msgSnippet":"Has anyone read this book Einstein Never Used Flash Cards by Roberta Michnick Golinkoff and Kathy Hirsh-Pasek?  There is an interesting advertisement for it","messageBody":"<div id=\"ygrps-yiv-688084342\">Has anyone read this book &quot;Einstein Never Used Flash<br/>\nCards&quot; by Roberta Michnick Golinkoff and Kathy<br/>\nHirsh-Pasek?  There is an interesting advertisement<br/>\nfor it in my mil&#39;s Prevention magazine.  <br/>\n<br/>\nOh, here it is...<br/>\n<br/>\nPlaying = Learning.<br/>\n<br/>\nEinstein Never Used FlashCards: How our children<br/>\nREALLY learn - and why they need to play more and<br/>\nmemorize less.  Internationally acclaimed<br/>\ndevelopmental child psychologists offer a compelling<br/>\nindictment of accelerated learning and provide a<br/>\nroadmap to intellectual growth through creative play.<br/>\n<br/>\nThere was another article in the same magazine that I<br/>\nliked.  &quot;Playing Hooky: when breaking the rules is a<br/>\ngood idea.&quot;  Maybe I mostly like the title of the<br/>\narticle.  He (author & father) did get PERMISSION from<br/>\nhis kid&#39;s teacher before he let his son skip school so<br/>\nthey could spend the day together.<br/>\n<br/>\nheather m<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nFree Pop-Up Blocker - Get it now<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://companion.yahoo.com/\">http://companion.yahoo.com/</a></div>","specialLinks":[]}],"prevTopicId":19073,"nextTopicId":19080}}