{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help with overbearing MIL","postDate":"1332424005","msgId":66318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMzQwMjUyLTdENUMtNDAwMy05NkMzLUZDMUEwOTQxNDNFQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDg4ZTUwMWNkMDgyMiRmY2FkYTBjMCRmNjA4ZTI0MCRAWmVyYmVAZnJvbnRpZXIuY29tPg==","referencesHeader":"PDg4ZTUwMWNkMDgyMiRmY2FkYTBjMCRmNjA4ZTI0MCRAWmVyYmVAZnJvbnRpZXIuY29tPg=="},"prevInTopic":66316,"nextInTopic":0,"prevInTime":66317,"nextInTime":66319,"topicId":66316,"numMessagesInTopic":0,"msgSnippet":"... You have an agenda to fix her. And, just as agendas with kids and spouses, they don t work. Pressure to move in a particular direction often causes people","messageBody":"<div id=\"ygrps-yiv-2010951642\">On Mar 22, 2012, at 7:57 AM, Kim Zerbe wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there a tactful way to talk to her I believe we are all learning all the<br/>\n&gt; time and I don&#39;t appreciate her giving him worksheets?<br/>\n<br/>\n </span></blockquote>You have an agenda to fix her. And, just as agendas with kids and spouses, they don&#39;t work. Pressure to move in a particular direction often causes people to push back and resist.<br/>\n<br/>\nHow well is her agenda to get you to understand how important schoolish ways are working?<br/>\n<br/>\nYou can share what you do with her but let go of expectations of it changing her at all.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She<br/>\n&gt; mentioned a web site that has lessons you can click and watch and how some<br/>\n&gt; schools are using it to teach so there&#39;s another teacher in the classroom<br/>\n&gt; and I just zoned out. <br/>\n<br/>\n<br/>\n </span></blockquote>If she were just sharing the website because she thought it was cool, if you knew she had no desire to change you, you&#39;d be less likely to zone out. You might even be open to looking at the site to understand more about her even if the site didn&#39;t do anything for you.<br/>\n<br/>\nThat&#39;s how unschooling works :-) And that&#39;s why teaching can get kids to tune out and turn off.<br/>\n<br/>\nYou&#39;ve written a lot about *your* reaction to her. What about your son? He&#39;s the one spending all day with her. Does he want her to come? Or would he prefer someone else?<br/>\n<br/>\nIf the daycare friend hadn&#39;t been available when your mother-in-law couldn&#39;t come, what would you have done?<br/>\n<br/>\nShe is who she is. You&#39;re asking her to do you a big favor. If you don&#39;t like the way she volunteers her time, ask someone else. Or pay her or someone else to follow your directions. That&#39;s why employees are paid so they&#39;ll do the job the company wants not whatever they want.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":464711822,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"help with overbearing MIL","postDate":"1332417461","msgId":66316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4ZTUwMWNkMDgyMiRmY2FkYTBjMCRmNjA4ZTI0MCRAWmVyYmVAZnJvbnRpZXIuY29tPg=="},"prevInTopic":0,"nextInTopic":66318,"prevInTime":66315,"nextInTime":66317,"topicId":66316,"numMessagesInTopic":0,"msgSnippet":"I run a business that requires my full attention for 1 week every 6 months (plus of course other time that I work around things with help from hubby and","messageBody":"<div id=\"ygrps-yiv-178310909\">I run a business that requires my full attention for 1 week every 6 months<br/>\n(plus of course other time that I work around things with help from hubby<br/>\nand friends). But for the 1 main week of my sale I have my Mother-in-law<br/>\ncome to town and watch my 7yo son exclusively. She does a great job except<br/>\nshe feels Damon needs more structure and has taken it upon herself to<br/>\n&quot;teach&quot; him things she thinks he is supposed to know (according to her<br/>\nfriend who teaches 2nd grade). She printed math worksheets from a web site<br/>\nand &quot;instructed&quot; him on grammar, punctuation, sentence structure, and<br/>\ntelling time. She wants to grade him and rank him (he scored 80% on a math<br/>\nsheet). She has him sitting and practicing writing. She made a &quot;school bag&quot;<br/>\nto put things in and gives me daily reports of what she made him do and it<br/>\njust breaks my heart! I don&#39;t want this!!! But I don&#39;t really have other<br/>\noptions for someone to watch him. She&#39;s a good grandma, I know she loves us<br/>\nall and wants what&#39;s best for my son but we don&#39;t agree on what that<br/>\nentails.<br/>\n<br/>\n <br/>\n<br/>\nI gave her passes and asked her to take him to the Children&#39;s Museum, ice<br/>\nskating lessons, an indoor play place, the library and a park, but that<br/>\nwasn&#39;t enough of an agenda for her. He likes to stay home on alternating<br/>\ndays (if we&#39;re out and about one day, we lay low at home the next day) but<br/>\nshe prefers to stay busy busy busy every single day. In the past she has<br/>\nworn him out physically and mentally. I could tell when I got home each<br/>\nnight that he was burned out (she&#39;d be punishing him for his &quot;bad behavior&quot;<br/>\nafter pushing him all day) and I would snuggle with him and read to him (he<br/>\nstill sleeps in our family bed) to calm him down. She talks all the time and<br/>\nhe (like us) has learned to tune her out. I believe my husband, my son, and<br/>\nI are all introverts who enjoy quiet time at home which helps us recharge<br/>\nwhile grandma is an extrovert who draws her energy from being around other<br/>\npeople. We get drained while she gets recharged! We&#39;ve taken vacations with<br/>\nher where we need to rest at the end just from being around her so long!<br/>\n<br/>\n <br/>\n<br/>\nIs there a tactful way to talk to her I believe we are all learning all the<br/>\ntime and I don&#39;t appreciate her giving him worksheets? (I&#39;m livid inside but<br/>\ndon&#39;t let it show. I want to burn the worksheets and not allow her to watch<br/>\nhim alone anymore, but I know my anger is on the surface. I&#39;m exhausted, we<br/>\njust finished our big sale and she leaves tomorrow.) Or perhaps I should<br/>\nmellow out and let it be? She means well. It&#39;s only one week every 6 months.<br/>\nHow much damage can a handful of worksheets and &quot;instruction time&quot; do? She<br/>\nmentioned a web site that has lessons you can click and watch and how some<br/>\nschools are using it to teach so there&#39;s another teacher in the classroom<br/>\nand I just zoned out. (It might even be cool, not sure why I am so resistant<br/>\nof any suggestions from her!)<br/>\n<br/>\n <br/>\n<br/>\nMy head is spinning because I cannot seem to see the other options I know<br/>\nmust be out there! Last spring grandma hurt her shoulder and could not watch<br/>\nhim, so I had a friend watch him who runs a day care in her house and has a<br/>\nson the same age. We&#39;ve used her before but last year he was 6 and the other<br/>\nkids his age were in school so he was there with all the &quot;babies&quot; and didn&#39;t<br/>\nhave a good time until his friend came home from school and they played wii<br/>\nuntil we picked him up. That&#39;s the other thing, I had to pick him up because<br/>\nher service ended at 6pm but we were still working until 9 or 10pm so my<br/>\nhusband or I had to leave and go get him. Once she kept him later and took<br/>\nhim to karate class, but I don&#39;t like to intrude on her family time so I<br/>\ndidn&#39;t ask for that a lot.<br/>\n<br/>\n <br/>\n<br/>\nI&#39;m usually ok talking with my MIL about our version of homeschooling, but I<br/>\nam so worn out right now my brain is not sharp. I&#39;m so close to being<br/>\nargumentative, luckily I know enough to just back off and keep quiet. Today<br/>\nI tried to talk to her about how well Damon reads and she wanted to know at<br/>\nwhat grade level he&#39;s reading. I said that didn&#39;t matter to me, I tried to<br/>\nexplain what I&#39;ve observed about how he can sound out new words so fast<br/>\n(because he has a huge vocabulary to draw upon, since he knows a lot of<br/>\nwords he can guess based on the context what word it might be and is usually<br/>\nright and just reads on). She wasn&#39;t listening. Apparently knowing his grade<br/>\nlevel matters more to her than understanding him and how he reads! She<br/>\ncouldn&#39;t just be excited for him that he is reading so well, she wanted to<br/>\nrank him but I don&#39;t get why. So she can say he&#39;s at 5th grade for reading<br/>\nbut only 1st grade for math? Would she have him stop reading to work on math<br/>\nuntil he tests at 2nd grade level for that? He gets multiplication but she&#39;s<br/>\nupset that he doesn&#39;t get subtraction. He understands fractions but that&#39;s<br/>\nnot supposed to happen until 4th grade! She really thinks I&#39;m messing him<br/>\nup!<br/>\n<br/>\n <br/>\n<br/>\nI know I invited this when I asked her to watch him for a week, but am<br/>\nregretting it now. I need outside ideas! Please be gentle as I am mentally<br/>\ndrained and not thinking clearly at the moment. J I appreciate your thoughts<br/>\nor sharing experiences and how you dealt with something similar.<br/>\n<br/>\n <br/>\n<br/>\nKim Zerbe<br/>\n<br/>\nDamon (7.5)<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":66289,"nextTopicId":66349}}