{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2256","postDate":"1029595597","msgId":41336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNDc3LTNENUU2MUNELTE4MUBzdG9yZWZ1bGwtMjM3Ny5wdWJsaWMubGF3c29uLndlYnR2Lm5ldD4=","inReplyToHeader":"VW5zY2hvb2xpbmctZG90Y29tQHlhaG9vZ3JvdXBzLmNvbSdzIG1lc3NhZ2Ugb2YgMTcgQXVnIDIwMDIJMTI6NTM6MjQgLTAwMDA="},"prevInTopic":41335,"nextInTopic":0,"prevInTime":41335,"nextInTime":41337,"topicId":41333,"numMessagesInTopic":0,"msgSnippet":"What about vouchers for homeschooling? If we are able to use them to choose a public school and the government lets us home unschool why can t we get our","messageBody":"<div id=\"ygrps-yiv-625928365\">What about vouchers for homeschooling? If we are able to use them to<br/>\nchoose a public school and the government &quot;lets us&quot; home unschool why<br/>\ncan&#39;t we get our money and use it at home? Michele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2256","postDate":"1029595213","msgId":41335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNDcwLTNENUU2MDRELTI0ODJAc3RvcmVmdWxsLTIzNzcucHVibGljLmxhd3Nvbi53ZWJ0di5uZXQ+","inReplyToHeader":"VW5zY2hvb2xpbmctZG90Y29tQHlhaG9vZ3JvdXBzLmNvbSdzIG1lc3NhZ2Ugb2YgMTcgQXVnIDIwMDIJMTI6NTM6MjQgLTAwMDA="},"prevInTopic":41333,"nextInTopic":41336,"prevInTime":41334,"nextInTime":41336,"topicId":41333,"numMessagesInTopic":0,"msgSnippet":"Here in Vermont we have Perkins Pier down near Lake Champlain. It was named after a man - Mr. Perkins :) - who was then president of UVM. His son was involved","messageBody":"<div id=\"ygrps-yiv-1012624840\">Here in Vermont we have Perkins Pier down near Lake Champlain. It was<br/>\nnamed after a man - Mr. Perkins :) - who was then president of UVM. His<br/>\nson was involved in making sure there were no more Abenaki. This Mr.<br/>\nPerkins began tricking them into thinking they were getting an injection<br/>\nfor health reasons. While they were out cold he castrated, etc. them so<br/>\nthey could not produce any more &quot;subhuman&quot; - his words NOT mine -<br/>\npeople. He became famous for this and went all over the world lecturing.<br/>\nOne day he was speaking and guess who was in the audience? A young Adolf<br/>\nHitler. Hmmm... Our esteemed Gov. Dean says the Abenaki don&#39;t exist.<br/>\nThey are not entitled to any thing &quot;special.&quot; Abenaki children cannot<br/>\nreceive government monies set aside for college tuition because &quot;they<br/>\ndon&#39;t exist.&quot; I guess I have been talking to &quot;dead people&quot; because they<br/>\nseem real enough to me:) Michele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2256","postDate":"1029594647","msgId":41333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNDcyLTNENUU1RTE3LTE1MDhAc3RvcmVmdWxsLTIzNzcucHVibGljLmxhd3Nvbi53ZWJ0di5uZXQ+","inReplyToHeader":"VW5zY2hvb2xpbmctZG90Y29tQHlhaG9vZ3JvdXBzLmNvbSdzIG1lc3NhZ2Ugb2YgMTcgQXVnIDIwMDIJMTI6NTM6MjQgLTAwMDA="},"prevInTopic":0,"nextInTopic":41335,"prevInTime":41332,"nextInTime":41334,"topicId":41333,"numMessagesInTopic":0,"msgSnippet":"My 19 year old son works at a liquor/convenience store. He has learned a lot while there. He runs the cash register, opens and closes the store, etc. He also","messageBody":"<div id=\"ygrps-yiv-1226346534\">My 19 year old son works at a liquor/convenience store. He has learned a<br/>\nlot while there. He runs the cash register, opens and closes the store,<br/>\netc. He also learned just how many people in out town of 10,000 are<br/>\nalcoholics and how they are are to manipulate their lives in order to<br/>\nstay that way. He learned how to help a young girl who had just been<br/>\nattacked when she ran to him for help and about a woman in desperation<br/>\nwho came in and bought a bottle of vodka and drank it in the parking lot<br/>\nalong with downing a bottle of pills. She left a suicide note on the<br/>\nwindow so people saw it eventually - it is a very busy store - and got<br/>\nher help. For what ever &quot;higher educational&quot; reason he chose to work<br/>\nthere he is leaving. I am hoping he follows his heart for his next step<br/>\nin what ever he chooses. Actually he said that he has decided to write a<br/>\nbook about aliens:) I&#39;m all for it. One of our other convenience/liquor<br/>\nstores in town sold beer to a man who was so drunk he could barely stand<br/>\nup and he was slurring his speech. Of coarse I happened to be next in<br/>\nline. Not for alcohol:) I was remembering a young persons boyfriend who<br/>\nhad died in a car accident (drug related) two weeks earlier and that it<br/>\ntook hours to get the people out of the car. We could see the blaze of<br/>\nshining lights - flashing on and off - from across the river. I called<br/>\nliquor control when I got home. <br/>\nTwo days ago my family and I were out for a nice day. There were 8 of<br/>\nus. &quot;Nice&quot; being relative. Anyway, a few were having difficulties and as<br/>\nusual we discuss these issues. My 11 year old son was really ranting and<br/>\nno one could stand it. We were walking a path in a wooded area that is<br/>\nquite stunning. Three of us broke off from the pack and sat on a large<br/>\nrock. My daughter who was in my group was having a difficult time so we<br/>\nwere going over things. The other group were ignoring my 11 year old so<br/>\nhe decided to retrace his steps to find me. He was alone, in other<br/>\nwords. He found me and I was busy. The other part of our group quickly<br/>\ncaught up with us and we asked for another minute to end our<br/>\nconversation. They and my 11 year old son went to the van. We caught up<br/>\nwith them and went on our way. Meanwhile - I am sure you&#39;ve all heard<br/>\nabout the mass of child abductions lately. My daughter remembered seeing<br/>\na guy at the place where we had walked. He had parked his vehicle and<br/>\nwas pulling out the carpeting and scrubbing it. There is no water - it<br/>\nis not a facility to clean your car. He had just abducted and raped a 15<br/>\nyear old boy - who got away. He is from Massachusetts. They caught the<br/>\nguy and arrested him. Someone was watching out for us - especially my 11<br/>\nyear old son. My daughter reported what she saw. Another few lessons<br/>\nlearned. Did you hear Jeb Bush hired a guy - Mr. Renier - to straighten<br/>\nout the Florida foster care system? Mr. Renier believes children should<br/>\nbe hit until they bruise and you see welts. Women should stay home (good<br/>\nfor home schooling anyway). No one should get a divorce. Etc. More<br/>\nlessons learned. I have never hit my kids and neither has my husband. I<br/>\ntold him 30 years ago if he ever did we would get a divorce (that was<br/>\nbefore we were married). I guess he likes me because we are still<br/>\nmarried and he never did hit our kids:) All our kids are the ministering<br/>\nsensitive kind who are there for others. We are learning to care for<br/>\nourselves as well. People frequently wonder what we have done to<br/>\n&quot;produce&quot; such great people - not perfect-yet, great. We talk. Every one<br/>\nmatters. We don&#39;t demean - sometimes - not often. I don&#39;t know what<br/>\neveryone else is doing so I don&#39;t have a ruler to measure the<br/>\ndifference. I have always believed life is a learning process that never<br/>\nends here or here after. Just keep putting one foot ahead of the other<br/>\none and you will get where you are going. Thanks for listening. Michele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":41334,"nextTopicId":41315}}