{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Introduction, kind of long","postDate":"1111946804","msgId":104969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMS40NmRiODhkNy4yZjc4NTAzNEBhb2wuY29tPg=="},"prevInTopic":104961,"nextInTopic":0,"prevInTime":104968,"nextInTime":104970,"topicId":104961,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/26/2005 10:19:28 PM Mountain Standard Time, gwendolin00@hotmail.com writes: I ve  only really been unschooling for a couple months because","messageBody":"<div id=\"ygrps-yiv-683490918\">In a message dated 3/26/2005 10:19:28 PM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gwendolin00@...\">gwendolin00@...</a> writes:<br/>\n<br/>\nI&#39;ve  only really been unschooling for a couple months because I<br/>\nsabotoged the  first few months of deschooling with occasional<br/>\n(frequent?) parent panic  attacks, afternoons of insisting he do<br/>\nsomething &quot;educational&quot;, and getting  frustrated and doing<br/>\nthings like<br/>\ntaking away his Play  Station.<br/>\n<br/>\n<br/>\n<br/>\n-------------------------------------------<br/>\n <br/>\nThe formula I&#39;ve always heard is it takes one month per year of school  <br/>\nstarting after the mom stops saying &quot;do some work&quot; (or whatever, fill your own  <br/>\npanic-message in there &lt;g&gt;) for deschooling to settle out so that the  child will <br/>\nbe curious and open to things he might&#39;ve rejected or avoided  before.<br/>\n <br/>\n-=-The first few times, I was guilty of the automatic<br/>\n&quot;mm-hm&quot; response,  I couldn&#39;t tell you what it was he was<br/>\ntrying to<br/>\nexplain to me.=-<br/>\n <br/>\nThat happens with everyone sometimes.  Husbands to wives and vice  versa, <br/>\nkids not hearing parents...<br/>\n <br/>\nCould you photograph some of his good K&#39;nex sculptures?  I regret not  having <br/>\nphotographed Kirby &quot;Turtle sculptures,&quot; when he had arranged his Ninja  <br/>\nTurtle figured in elaborate scenarios.  Marty did Lego things I wish I&#39;d  <br/>\nphotographed.  We have a few photos of Holly&#39;s My Little Pony parties and  weddings.<br/>\n <br/>\nSandra<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":81754574,"authorName":"Gwen McCrea","from":"&quot;Gwen McCrea&quot; &lt;gwendolin00@...&gt;","profile":"bailalibre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Introduction, kind of long","postDate":"1111899760","msgId":104961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyNWVwZytjZjloQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":104969,"prevInTime":104960,"nextInTime":104962,"topicId":104961,"numMessagesInTopic":0,"msgSnippet":"Hello! I have been reading on this site for a couple months (off and on, as we just returned from a long trip with limited internet access). We have two sons,","messageBody":"<div id=\"ygrps-yiv-336802645\">Hello! I have been reading on this site for a couple months (off<br/>\nand on, as we just returned from a long trip with limited internet<br/>\naccess). We have two sons, Gabriel (8 years) and Raphael (8 months).<br/>\nWe live in Minnesota, though we try to spend at least a month, if not<br/>\nmore, each year in Bolivia, where my husband is from.<br/>\n<br/>\nWhen Gabriel was younger, I always thought I would homeschool<br/>\n(didn&#39;t know about unschooling at the time). But then I started<br/>\ngraduate school when he was four, became too preoccupied with what *I*<br/>\nwas doing, and slipped into the typical M.O.he went to a<br/>\nMontessori preschool, and went through second grade at public school.<br/>\nMy husband and I have always had serious philosophical and practical<br/>\ncritiques of schools in general, though, and at the end of last school<br/>\nyear decided to keep Gabriel home this year. This was after having<br/>\nstruggled with his first grade teacher and school  administrators, who<br/>\nfreaked out when he did things like climb a door inside the building<br/>\n(oh horror!) and struggling with his second grade teachers to try to<br/>\nget them to lay off the boring, repetitive, and required homework. <br/>\n<br/>\nReading John Holt was one of the things that clinched the decision to<br/>\nhomeschool, unschooling is a much better fit for our parenting style<br/>\n(or at least, our parenting ideals, we&#39;re works in<br/>\nprogress). Still,<br/>\nI&#39;ve only really been unschooling for a couple months because I<br/>\nsabotoged the first few months of deschooling with occasional<br/>\n(frequent?) parent panic attacks, afternoons of insisting he do<br/>\nsomething &quot;educational&quot;, and getting frustrated and doing<br/>\nthings like<br/>\ntaking away his Play Station.<br/>\n<br/>\nI know that I have many shortcomings that sometimes make this<br/>\nunschooling journey difficult. Right this minute, I&#39;m being<br/>\nforced to admit oneimpatiencebecause as I&#39;m writing<br/>\nthis Gabriel<br/>\nkeeps walking in and telling me in great detail about past and future<br/>\nK&#39;nex models. The first few times, I was guilty of the automatic<br/>\n&quot;mm-hm&quot; response, I couldn&#39;t tell you what it was he was<br/>\ntrying to<br/>\nexplain to me. I realized that I was so wrapped up in what I was doing<br/>\nthat I resented the interruptionand its not like I&#39;m doing<br/>\nsomething that can&#39;t wait a couple minutes while I hear about the<br/>\nnext<br/>\ncool invention. Luckily, he is more patient than I am, and he gave me<br/>\nseveral more chances to be interested in what he was doing (I am so<br/>\nimpressed by his inventiveness and understanding of   engineering,<br/>\nbalance, simple machines, design, as he creates K&#39;nex and<br/>\nBionicles!).<br/>\nThe other largish obstacles for me are balancing the needs of an<br/>\n8-year-old and an infant, and trying to de-stress and de-school myself<br/>\nwhile simultaneously finishing a PhD degree (a Sisyphean task if ever<br/>\nthere were oneI am leaning toward a clean break and a guilt-free<br/>\ndesertion of the university, but don&#39;t know if I am brave enough<br/>\nto do<br/>\nso). <br/>\n<br/>\nI&#39;m so glad to have found this forum/community! I&#39;m looking<br/>\nforward to<br/>\nfuture discussions!<br/>\n<br/>\nI&#39;d like to share this piece from Kahlil Gibran, as well, which I<br/>\nfirst heard as a song from Sweet Honey in the Rock. While I don&#39;t<br/>\npersonally go for the divine archer bending me to his will, the<br/>\nmessage of deep respect for children has always resonated with me.<br/>\n<br/>\nYour children are not your children. <br/>\nThey are the sons and daughters of Life&#39;s longing for itself. <br/>\nThey come through you but not from you, <br/>\nAnd though they are with you, yet they belong not to you. <br/>\nYou may give them your love but not your thoughts. <br/>\nFor they have their own thoughts. <br/>\nYou may house their bodies but not their souls, <br/>\nFor their souls dwell in the house of tomorrow, which you cannot<br/>\nvisit, not even in your dreams. <br/>\nYou may strive to be like them, but seek not to make them like you. <br/>\nFor life goes not backward nor tarries with yesterday. <br/>\nYou are the bows from which your children as living arrows are sent<br/>\nforth. <br/>\nThe archer sees the mark upon the path of the infinite, and He bends<br/>\nyou with His might that His arrows may go swift and far. <br/>\nLet your bending in the archer&#39;s hand be for gladness; <br/>\nFor even as he loves the arrow that flies, so He loves also the bow<br/>\nthat is stable. <br/>\n<br/>\nPeace,<br/>\nGwen</div>","specialLinks":[]}],"prevTopicId":104965,"nextTopicId":104973}}