{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":39,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: is this what ADHD looks like?!","postDate":"1234558434","msgId":42022,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduNG1sMys1aDFnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4="},"prevInTopic":42021,"nextInTopic":42023,"prevInTime":42021,"nextInTime":42023,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... even for myself. I ll choose chips if they are there so I avoid them being there and then I make a better food choice. We have always had a fruit bowl","messageBody":"<div id=\"ygrps-yiv-856834314\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I believe you can limit the choices that are available. I find that<br/>\n </span></blockquote>even for myself. I&#39;ll choose chips if they are there so I avoid them<br/>\nbeing there and then I make a better food choice. We have always had a<br/>\nfruit bowl accessible 24/7, my teens take nuts and fruit to karate as a<br/>\ngood filler. I would aim to make available foods that are enjoyable but<br/>\nalso nutritional rather than empty calories like chips. &gt;&gt;&gt;<br/>\n<br/>\nChoices are always limited by what is immediately available, it doesn&#39;t<br/>\nneed to be arbitrary.  If the parent chooses to eat a better choice than<br/>\nchips, it doesn&#39;t mean that the child needs to make the same choice. <br/>\nThe thing about choices, is that you can&#39;t control access and still call<br/>\nit free choice.<br/>\n<br/>\nSomething that I&#39;ve learned over the years is that without real choices,<br/>\nkids don&#39;t really learn how to make good ones.   Sometimes it looks that<br/>\nway simply because some kids like to please their parents and make the<br/>\n&quot;right&quot; choice, but eventually they will make their own choices and come<br/>\nto their own conclusions about what foods they want to eat.  I see a<br/>\nhuge value of starting this when they are young and really know how to<br/>\nlisten to their bodies.  Food conditioning over many years can prevent<br/>\nus from listening to our bodies and makes it something that you have to<br/>\nrelearn how to do.  If that conditioning never happens, a kid will never<br/>\nstop listening to their body.<br/>\n<br/>\nI would also like to say that chips are not empty calories.  Chips are<br/>\nnot all the same.  I ate chips for dinner last night because it was<br/>\nexactly what I wanted.  My husband made a nice dinner for himself and<br/>\none of our kids and offered to make enough for everyone, but I wanted<br/>\nchips and said &quot;no thanks&quot; and our other daughter made her own food.</div>","specialLinks":[]},{"userId":130027733,"authorName":"Bea","from":"&quot;Bea&quot; &lt;bmantovani@...&gt;","profile":"bmantovani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: is this what ADHD looks like?!","postDate":"1234556380","msgId":42021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduNGtrcys1NWlwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwZjkwMWM5OGUxMyRhYTAyMjU4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":42020,"nextInTopic":42022,"prevInTime":42020,"nextInTime":42022,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... talking about ... Can you order food for him, to be delivered to his office? Also, for dinner, can you order out more often?  Can you buy more ready made","messageBody":"<div id=\"ygrps-yiv-286108580\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  <br/>\n&gt; This is why I feel particularly bad when we don&#39;t meet him for lunch,<br/>\n&gt; because I know he won&#39;t eat on his own. Yes, I realize we are<br/>\n </span></blockquote>talking about<br/>\n<blockquote><span title=\"ireply\"> &gt; a grown man (who just turned 40), but I am trying to take care of him as<br/>\n&gt; well as my son. Any advice on that might be helpful too!<br/>\n<br/>\n </span></blockquote>Can you order food for him, to be delivered to his office?  <br/>\n<br/>\nAlso, for dinner, can you order out more often?  Can you buy more<br/>\nready made dishes that you just need to heat up?  (There are very<br/>\nhealthy and tasty choices available these days.)<br/>\n<br/>\n<br/>\nBea</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234554345","msgId":42020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjkwMWM5OGUxMyRhYTAyMjU4MCQ2NDBhYTlhOUBHb256bz4=","inReplyToHeader":"PDQ5OTUxOEQ4LjgwMDA3MDFAbWFjLmNvbT4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4gPDQ5OTUxOEQ4LjgwMDA3MDFAbWFjLmNvbT4="},"prevInTopic":42019,"nextInTopic":42021,"prevInTime":42019,"nextInTime":42021,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"Thanks Pam. I m sure I do ask a lot of him that he isn t particularly interested in doing. I like to think I keep the options open, but for some things it s","messageBody":"<div id=\"ygrps-yiv-475846067\">Thanks Pam. I&#39;m sure I do ask a lot of him that he isn&#39;t particularly<br/>\ninterested in doing. I like to think I keep the options open, but for some<br/>\nthings it&#39;s not so much an option as we are doing this and the options are<br/>\nmore how we do it, when, for how long, what we do there, etc. If we are<br/>\nsomewhere that I notice he is having a hard time or says he wants to leave,<br/>\nI offer other places we can go on the way home (play places, Target, Game<br/>\nStop, zoo, a park, get a smoothie) and if he knows we are doing that next,<br/>\nhe&#39;s happy but then wants to get going on that next thing. Very often he<br/>\njust wants to go home again.<br/>\n <br/>\nSome things he asks for, like when the class book came I asked if he wanted<br/>\nto sign up for (and these are casual 4-week classes with a teacher he knows<br/>\nand likes and is really good with kids!) baseball, basketball, soccer,<br/>\nkarate, gymnastics, or swimming. He chose baseball and gymnastics. He&#39;s been<br/>\ngood at the classes until today, he just freaked out and said he didn&#39;t want<br/>\nto go. I determined in the end that he was very much into The Incredibles<br/>\nand did not want to stop watching that. I didn&#39;t realize the intensity in<br/>\nthe moment. And I had given him warnings like when we started the movie I<br/>\nsaid it might not be over by the time we need to leave for baseball and he<br/>\nwanted to start it anyway.<br/>\n <br/>\nI guess I see where I was trying to get him to do what I wanted or thought<br/>\nhe should want to do, baseball. I didn&#39;t want to hear that he didn&#39;t want to<br/>\ngo! I just got off the phone with my friend Zoe whose son is in that class<br/>\ntoo and her son wasn&#39;t going but she didn&#39;t care (he and his brother were<br/>\nsick), but she was really good about her attitude! It didn&#39;t even bother her<br/>\nthat she paid for the class and he didn&#39;t want to go, but for some reason I<br/>\nwas thinking my kid is not like that. He loves baseball! Well, he probably<br/>\nonly loves it when it happens at a convenient time and not when he is in the<br/>\nmiddle of a movie. <br/>\n <br/>\nGeoff (DH) and I have had a going out to lunch routine as long as we&#39;ve<br/>\nlived here. He lives close and works late, so otherwise I don&#39;t get to see<br/>\nhim much. We scaled back once I had a baby, as it was much harder to get out<br/>\nof the house at a certain time! He came home for lunches, but it took too<br/>\nlong. Then we started going out more as Damon got older. Now we most often<br/>\nlet Damon pick, that way he is invested in it, and we&#39;ve been out enough<br/>\nthat he knows what he likes and we are OK with eating at Wendy&#39;s if that&#39;s<br/>\nhis choice. Last week he chose sushi and on a different day wanted to eat at<br/>\nCostco! So we did! (This was really cute, he called his dad on the phone and<br/>\ninvited him to lunch. Dad asked where he wanted to go and he said Costco. &quot;I<br/>\nwant to get a hot dog, 2 churros, and a smoothie.&quot; I head laughing on the<br/>\nother end and then &quot;tell your mom we&#39;ll meet at Costco in 20 minutes&quot; and we<br/>\nhad a good time.)<br/>\n <br/>\nOn the days when I say it&#39;s time to go to lunch with daddy and he starts out<br/>\nby saying I HATE DADDY, I have a clue we are not leaving the house! I call<br/>\nGeoff and tell him he&#39;d better go on his own. There is a cafe in his<br/>\nbuilding, but it closes at 1:30 and he often forgets to get down there. Then<br/>\nleaving the building is more of a chore, so he just keeps working. It would<br/>\nbe better if I had actual food in the house on those days, because while<br/>\nDamon is fine on a cup of yogurt and some chips, I need more than that and<br/>\ndon&#39;t often have anything suitable. <br/>\n <br/>\nI am NOT a cook, hate grocery shopping, and eating is not high on the list<br/>\nof things my brain thinks about. I get immersed into projects and forget to<br/>\neat. Then I wonder why I&#39;m all shaky and faint. Well, I don&#39;t really wonder<br/>\nanymore, I know, but I do wonder how it gets that advanced when I know my<br/>\nbody needs to eat. I&#39;ve always wanted to change some part of that, but we<br/>\nall know how hard it is to change! So part of my stress is that there is<br/>\nnothing I want to eat in the house. I have food for the kid (we often eat<br/>\ncorn dogs or chicken nuggets together). This is amazing to me really, I<br/>\nfeared I would be the worst mother on earth, always forgetting to feed my<br/>\nchild! But it hasn&#39;t been too hard. He knows when he is hungry and how to<br/>\nget a snack or he asks for help. I do try to put out a bowl of something or<br/>\na platter of several things and that works for him too. (Stuff in the fridge<br/>\nis healthier than what he can reach in the cabinets!) Although I often wish<br/>\nI had more options to put out, my downfall of hating to shop. Feeding him<br/>\nalso reminds me to eat, so I don&#39;t get that desperate feeling much anymore. <br/>\n <br/>\nSo I&#39;m not sure why it was wrong to call my husband a bear when he doesn&#39;t<br/>\neat lunch! When he gets home, he&#39;ll announce that he ate nothing more than a<br/>\nbanana all day, then growl and say he is ravenously hungry and start<br/>\nforaging for food. If I&#39;m on the ball, I like to have some crackers and<br/>\ncheese he can nibble on before dinner is ready, but he&#39;ll find something on<br/>\nhis own. Like I said, I don&#39;t cook, so I don&#39;t often have dinner ready, but<br/>\nif I know when he&#39;s coming home I&#39;ll at least have things picked out and<br/>\nstart prepping. Occasionally I&#39;ll actually have a dinner ready to eat! But I<br/>\ndon&#39;t often know what time he&#39;s coming home so that makes it really tough.<br/>\nWhen I can&#39;t get a hold of him, I may have to fix dinner and we&#39;ve eaten by<br/>\nthe time he gets home. Our routine of 19yrs is that he does the cooking, but<br/>\nI do a lot of the prep work (and so much else, like he doesn&#39;t do dishes).<br/>\nI&#39;d love to be better in the kitchen, it&#39;s just not my thing, I&#39;m not at all<br/>\ncomfortable in there!  <br/>\n <br/>\nThis is why I feel particularly bad when we don&#39;t meet him for lunch,<br/>\nbecause I know he won&#39;t eat on his own. Yes, I realize we are talking about<br/>\na grown man (who just turned 40), but I am trying to take care of him as<br/>\nwell as my son. Any advice on that might be helpful too!<br/>\n <br/>\nI always feel like my posts are too long! It&#39;s funny to be asked for more<br/>\ninformation!<br/>\n <br/>\nI may have posted about this before, but these days Damon seems very happy<br/>\nwatching movies and playing wii. He&#39;ll watch one movie after another while<br/>\nhe jumps around the living room, off the couches, does karate moves in the<br/>\nair, and runs laps around the house. Occasionally he&#39;ll sit calmly and watch<br/>\nintently, but that is the odd occurance. He&#39;s usually jumping around or<br/>\nrunning. Sometimes I sit and watch with him, other times I have work to do.<br/>\nSometimes I play wii with him, other times he tells me not to.<br/>\n <br/>\nMy Outlook crashed on me twice last night and this is the 3rd rewrite (it<br/>\nsaved part of it in Drafts each time) so I hope I covered everything!<br/>\n <br/>\nKim Z<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: is this what ADHD looks like?!","postDate":"1234553756","msgId":42019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5RkVBNkNCLUY2N0UtNDlGRS04NzdGLUVCRjIzNzQ3RUE2NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGduNGFwYiticTRoQGVHcm91cHMuY29tPg==","referencesHeader":"PGduNGFwYiticTRoQGVHcm91cHMuY29tPg=="},"prevInTopic":42018,"nextInTopic":42020,"prevInTime":42018,"nextInTime":42020,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"Linda wrote: -=-Maybe it s a blessing in disguise -- you might not have realized the extent to which your behavior is affecting him if his outward reaction was","messageBody":"<div id=\"ygrps-yiv-58628935\">Linda wrote:<br/>\n-=-Maybe it&#39;s a blessing in disguise -- you<br/>\nmight not have realized the extent to which your behavior is affecting<br/>\nhim if his outward reaction was milder. -=-<br/>\n<br/>\nThis is worth re-reading twice, for everyone involved.<br/>\n<br/>\nSome kids suffer silently, or create inner barriers to their mother&#39;s  <br/>\nvoice and advice.<br/>\n<br/>\nIf a child silently learns to ignore the mom or to figure out how to  <br/>\noutflank her to reach a goal, she might waste years of advice-giving  <br/>\nto someone who long ago learned to disregard her every word, while  <br/>\nfeigning that he&#39;s paying attention.   If she says to use birth  <br/>\ncontrol, he will feel like a loser if he does, and a winner if he  <br/>\ndoesn&#39;t.  If she says drugs are dangerous, he might look at her  <br/>\nappropriately and say &quot;okay, I&#39;ll be careful&quot; while thinking &quot;bitch.&quot;<br/>\n<br/>\nI have a 17 year old girl who listens to me.  I have a 20 year old boy  <br/>\nwho listens to me.  I have a 22 year old who listens to me more now  <br/>\nthat he lives elsewhere than he did when he was living here.<br/>\n<br/>\nThey listen to me because when they were two, and four, and eight, and  <br/>\nfourteen, I listened to them.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: is this what ADHD looks like?!","postDate":"1234552191","msgId":42018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5MjFCMDlGLTUxMDItNDI0MS04QUIyLUIyQkVENjk1NkIwQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGduNGFwYiticTRoQGVHcm91cHMuY29tPg==","referencesHeader":"PGduNGFwYiticTRoQGVHcm91cHMuY29tPg=="},"prevInTopic":42017,"nextInTopic":42019,"prevInTime":42017,"nextInTime":42019,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"-=I have a four-year-old too, and while she has a great vocabulary, it s difficult for her to elucidate the *why* of her behavior. -=- Even adults don t always","messageBody":"<div id=\"ygrps-yiv-1001145626\">-=I have a<br/>\nfour-year-old too, and while she has a great vocabulary, it&#39;s<br/>\ndifficult for her to elucidate the *why* of her behavior. -=-<br/>\n<br/>\nEven adults don&#39;t always know clearly exactly why they don&#39;t want to  <br/>\ndo something.<br/>\n<br/>\nPeople should be allowed to practice paying attention to their own  <br/>\nfeelings, even when there aren&#39;t clear explanations.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234552030","msgId":42017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExQjIyRDI1LUU3MjUtNDQ4MC1CMTY2LUJBRkRGRDBCMTFCNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEyNDE3Ny40MTkxMC5xbUB3ZWI1MzkwOS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDEyNDE3Ny40MTkxMC5xbUB3ZWI1MzkwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":42016,"nextInTopic":42018,"prevInTime":42016,"nextInTime":42018,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"-=-****Some kids are not just very verbal about what is in their heads.  Both my boys can talk up a storm, but if you ask whether their shoes fit right, they","messageBody":"<div id=\"ygrps-yiv-998851645\">-=-****Some kids are not just very verbal about what is in their  <br/>\nheads.  Both my boys can talk up a storm, but if you ask whether their  <br/>\nshoes fit right, they cannot always answer.<br/>\n****-=-<br/>\n<br/>\nEven adults aren&#39;t always clear on what &quot;fit right&quot; means, with shoes.  <br/>\n&lt;g&gt;  This comes to mind because both Holly and her boyfriend are in  <br/>\nthe selling-of-shoes business lately, in two different stores at the  <br/>\nsame mall.<br/>\n<br/>\n-=-**Did you warn him before he put the movie in that there would not  <br/>\nbe time to finish?  Maybe help him find a shorter movie.  Set a timer  <br/>\nfor how long till you had to leave.  Ask him to turn off the movie  <br/>\nwhen there was still a bit a wiggle room to get to basketball?<br/>\n*******-=-<br/>\n<br/>\nQuite a bit of expectation for a four year old who might be closer to  <br/>\nthree.<br/>\n<br/>\nInstead of asking a little child to find a good stopping place,  <br/>\nparents can find a good stopping place and a gentle way/excuse to  <br/>\npause the movie, and something soothing and comforting to do/say/ <br/>\nprovide right then.<br/>\n<br/>\nIf a child is playing a video game, I ask if it&#39;s a good pausing  <br/>\nplace.  It might not be.  When they get to a good pausing place, then  <br/>\nI ask if the game can  be saved.  Maybe it can&#39;t.  Can the remote and  <br/>\nthe system be &#39;stabilized&#39; so no one else will come in and mess the  <br/>\ngame up?  Maybe.<br/>\n<br/>\nPutting all those kinds of responsibilities on the child is too much.   <br/>\nParents (their partners) should help!<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: is this what ADHD looks like?!","postDate":"1234551500","msgId":42016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1RDUxQTU1LTA1MDktNEI3Ri1CQjQ3LUZERDM3MjEzOUYzQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFCNzA0MENDNUE5NzRCMDRCMjE0RTY5MTMyRUQwMkEyQExZTEFMQVAyPg==","referencesHeader":"PGduNGFwYiticTRoQGVHcm91cHMuY29tPiA8QUI3MDQwQ0M1QTk3NEIwNEIyMTRFNjkxMzJFRDAyQTJATFlMQUxBUDI+"},"prevInTopic":42015,"nextInTopic":42017,"prevInTime":42015,"nextInTime":42017,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"-=-and i think it s really important to recognize this temperament trait as well and work *with* it in the child/with the child, rather than just look to","messageBody":"<div id=\"ygrps-yiv-1337001138\">-=-and i think it&#39;s really important to recognize this temperament  <br/>\ntrait as well and work *with* it in the child/with the child, rather  <br/>\nthan just look to oneself and figure out what to apologize for/what  <br/>\none has done &quot;wrong.-=-<br/>\n<br/>\nIt still involves the mom changing her response.<br/>\n<br/>\nToo many parents in the world are now and have always assumed they  <br/>\nwere right and good because they were adults and children were bad and  <br/>\nwrong because they were children (and children with something wrong  <br/>\nwith them, on top of the general &#39;wrongness&quot; attributed to children).<br/>\n<br/>\nIt leads to strained relationships and then to hatred, if left to run  <br/>\nits natural course.   You could probably name a dozen people without  <br/>\nbreathing who hate their parents, or who have lied and sneaked and  <br/>\nmove thousands of miles away to get away from their parents.  That  <br/>\nrelationship began at birth, and there are MANY places along the way  <br/>\nthe parents could have changed their attitudes and behaviors to make a  <br/>\nbig difference, but few to no places the child could have figured out  <br/>\nwhat was going on and avoided the influence of the parents.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: is this what ADHD looks like?!","postDate":"1234550534","msgId":42015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFCNzA0MENDNUE5NzRCMDRCMjE0RTY5MTMyRUQwMkEyQExZTEFMQVAyPg==","inReplyToHeader":"PGduNGFwYiticTRoQGVHcm91cHMuY29tPg==","referencesHeader":"PGduNGFwYiticTRoQGVHcm91cHMuY29tPg=="},"prevInTopic":42014,"nextInTopic":42016,"prevInTime":42014,"nextInTime":42016,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"If I d had to deal with that sort of situation when I was four-year-old (including being physically restrained,) I m sure I would have been kicking and hitting","messageBody":"<div id=\"ygrps-yiv-1716203173\">If I&#39;d had to deal with that sort of situation when<br/>\nI was four-year-old (including being physically restrained,) I&#39;m sure<br/>\nI would have been kicking and hitting as well. I just think it&#39;s a<br/>\nvery normal human reaction to respond in a violent way when you pass a<br/>\ncertain threshold of frustration, especially when you feel like you&gt;&gt;&gt;&gt;<br/>\n<br/>\nwhile i totally agree with everything said above about how this child might be feeling, and how to better respond/interact, i just felt the need to also say that if a 4 year old is hitting and kicking, that is not necesarily ONLY for psychological reasons/because of the way the parent is or isn&#39;t handling things.  there really are 4 year olds who have never been restrained, whose &quot;no&quot; is respected, etc. who react with intense physicality and emotion to seemingly small situations, and i think it&#39;s really important to recognize this temperament trait as well and work *with* it in the child/with the child, rather than just look to oneself and figure out what to apologize for/what one has done &quot;wrong.<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234549270","msgId":42014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwMjEzMTAyMWsyZjZmN2QxNG5jYTYwZDNiOGZlMzIxNzkxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDlEOUI2NzlCLTQwMDMtNEQ2MS1CRDNGLUJFRDdEMTYwMTM1NkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4gPDQ5OTUxOEQ4LjgwMDA3MDFAbWFjLmNvbT4JIDw5M0U1NEE4MTRFRTU0RURCOEJENzRERTBFMjhFRjNCMEBMWUxBTEFQMj4JIDw5RDlCNjc5Qi00MDAzLTRENjEtQkQzRi1CRUQ3RDE2MDEzNTZAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":42013,"nextInTopic":42015,"prevInTime":42013,"nextInTime":42015,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... While you re on line, take a listen to Sandra s Peaceful, oops, Parenting Peacefully  recording (at the ","messageBody":"<div id=\"ygrps-yiv-1839715623\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; It is at the heart of unschooling and of being a mindful parent for<br/>\n&gt; the parent to need and desire to give the child what the child needs.<br/>\n&gt; Being a child&#39;s partner means helping him meet his needs.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>While you&#39;re on line, take a listen to Sandra&#39;s Peaceful, oops, Parenting<br/>\nPeacefully &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/parentingpeacefully\">http://www.sandradodd.com/parentingpeacefully</a>&gt; recording (at the<br/>\nbottom of the page -- for free!).  Hers is an important voice to carry in<br/>\nyour head at this point... reminding you to take a deep breath, waiting for<br/>\nthat second & better option before acting... and VERY importantly a reminder<br/>\nthat it is not fair to come to your son with your emotions so loaded down<br/>\nthat he is your &quot;last straw&quot; in any situation -- it&#39;s important to have<br/>\nother, healthy sources for the unloading of your baggage, so you may<br/>\nexperience your relationship with him in freedom.<br/>\nI used a lot of Rescue Remedy, as I struggled finding peace as a single<br/>\nparent with young children,  *for me* -- to give me a chance to step back,<br/>\nget quiet and recentered, and return to my child as the parent he deserves.<br/>\nI&#39;m lucky there was only a short gap between being as desperate as you seem<br/>\nand finding unschooling; there is peace for you both available without<br/>\nseeking what is wrong... first seek what is *right* and work from there :)<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; .<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":137349367,"authorName":"cathyandgarth","from":"&quot;cathyandgarth&quot; &lt;familialewis@...&gt;","profile":"cathyandgarth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: is this what ADHD looks like?!","postDate":"1234547146","msgId":42013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduNGJrYStqa3RoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":42012,"nextInTopic":42014,"prevInTime":42012,"nextInTime":42014,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... Do you let him hate things?  Or do you try to talk him away from this emotion?  If you try to talk him out of hating things he may feel like you aren t","messageBody":"<div id=\"ygrps-yiv-493931466\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; His new thing is that he hates whatever it is I<br/>\n&gt; want to do or whatever interferes with what he wants to do. <br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>Do you let him &quot;hate&quot; things?  Or do you try to talk him away from <br/>\nthis emotion?  If you try to talk him out of hating things he may <br/>\nfeel like you aren&#39;t respecting the feelings that he is having at the <br/>\nmoment.  Maybe as adults we can distinguish between hate, dislike, <br/>\nfrustration, discontent, unhappiness ... but I think that most 4 year <br/>\nolds just go with that nice easy emotionally strong word, it really <br/>\nemcompasses a slew of emotions for them.  My 4 year old says <br/>\nhe &quot;hates&quot; everything as well (at some time or another) -- &quot;bored&quot; is <br/>\nhis other favorite catch-all right now as well.  He will spend a day <br/>\nplaying with my mom, and when I pick him up he announces, &quot;I hate <br/>\nElbo!  I&#39;m so bored!&quot;  What he means is &quot;I missed you, Mom.  I&#39;m <br/>\nready to go home.&quot;  But I don&#39;t correct him, I never tell him, &quot;Oh <br/>\nyou don&#39;t really hate Elbo.  You had a fun day, you did X, Y, Z.&quot; <br/>\n<br/>\nI know you got loads of great advice on the other bits of your <br/>\nsituation.  But I suggest letting go of your response to the word <br/>\nhate.  If you are thinking to yourself &quot;I hate it when he uses that <br/>\nword&quot; then he will pick up on the discrepancy in what you allow <br/>\nyourself to feel and what you think is okay for him to express.<br/>\n<br/>\nI am sure that I could be more articulate but I have two boys waiting <br/>\npatiently for me to get poptropica.com started up for them (highly <br/>\nrecommend this game -- so fun!).  <br/>\n<br/>\nJust learn to love his growing ability to express himself, soon the <br/>\nword hate will just be one of many different words he will use, but <br/>\nfor now it is just the word of choice -- and it really is JUST a <br/>\nWORD, kwim?<br/>\n<br/>\nCathy<br/>\n<br/>\nPS  All my kids have gone through phases of using the word hate ... <br/>\nluckliy my oldest taught me well that it is just word and that it is <br/>\nonly my reactions that turn it into a power word.</div>","specialLinks":[]},{"userId":157311507,"authorName":"eaglefalconlark","from":"&quot;eaglefalconlark&quot; &lt;eaglefalconlark@...&gt;","profile":"eaglefalconlark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: is this what ADHD looks like?!","postDate":"1234546283","msgId":42012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduNGFwYiticTRoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":42011,"nextInTopic":42013,"prevInTime":42011,"nextInTime":42013,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"I really seriously doubt it has anything to do with a neurological disorder, it seems pretty straight-forward interpersonal dynamics to me. I can understand,","messageBody":"<div id=\"ygrps-yiv-612409201\">I really seriously doubt it has anything to do with a neurological<br/>\ndisorder, it seems pretty straight-forward interpersonal dynamics to me. <br/>\n<br/>\nI can understand, when you feel *you&#39;re* being reasonable, why you&#39;d<br/>\nassume that the problem is organic-based, not environmental. But<br/>\nimagine someone talking to you the way you talk to your son,<br/>\nconsistently over a long period of time, with your own efforts at<br/>\nbeing understood going unheard. I&#39;m usually a very calm person, I&#39;ve<br/>\neven had people comment on it. My husband and I have had maybe three<br/>\nquickly resolved disagreements in 12 years together. But I was in a<br/>\nrelationship once where the level of frustration at not feeling heard<br/>\nor understood became so high that we would regularly get into<br/>\nSCREAMING matches. If I&#39;d had to deal with that sort of situation when<br/>\nI was four-year-old (including being physically restrained,) I&#39;m sure<br/>\nI would have been kicking and hitting as well. I just think it&#39;s a<br/>\nvery normal human reaction to respond in a violent way when you pass a<br/>\ncertain threshold of frustration, especially when you feel like you<br/>\ncan&#39;t leave the situation (you&#39;re dependent or co-dependent.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I tried to remain calm and said &quot;Look, you don&#39;t have to go to<br/>\n </span></blockquote>baseball if you really don&#39;t want to go, but this is not the way to<br/>\nact. Just tell me you don&#39;t want to go!&quot; So he yelled &quot;I HATE BASEBALL<br/>\nAND I HATE YOU!!!&quot; [...] but it would have been the last class (for<br/>\n4yr olds, it&#39;s mainly a skill building class at the rec center, not a<br/>\nteam or anything) and I really wanted him to go. So I kept asking why<br/>\nhe didn&#39;t want to go.&lt;&lt;&lt;<br/>\n<br/>\nSo, if this is a usual pattern for you, at some point he figured out<br/>\nthat you were not going to ever just accept his &#39;no&#39;, but would keep<br/>\ntrying to get him to do what you want. &quot;Just tell me you don&#39;t want to<br/>\ngo&quot; -- the implication of that &quot;just&quot; is that all he has to do to get<br/>\nyou to take him seriously is say &#39;no&#39;, but clearly that&#39;s not true,<br/>\nand he knows that. And what would be the point of continuing to calmly<br/>\nsay &#39;no&#39; and continue to feel unheard and disrespected, when you will<br/>\nleave him alone pretty quickly if he has a fit? <br/>\n<br/>\nThe solution seems pretty simple to me: unless it is an emergency<br/>\nsituation, respect his &#39;no&#39;. Apologize for not doing so in the past<br/>\nand tell him you understand how frustrating that must have been for<br/>\nhim. Assume that he has good reasons for his &#39;no&#39;, and don&#39;t try to<br/>\ndrag out them out of him (which, I bet, he will perceive as a set-up<br/>\nfor judgment.) At four-years-old it&#39;s probably not easy for him to<br/>\nexplain to you why he&#39;s feeling the way he is anyway. I have a<br/>\nfour-year-old too, and while she has a great vocabulary, it&#39;s<br/>\ndifficult for her to elucidate the *why* of her behavior. But that&#39;s<br/>\ndevelopmentally normal for that age. <br/>\n<br/>\nI&#39;m sure you&#39;re right that the intensity of the reaction could have a<br/>\nlot to do with blood sugar, but his feelings and his strategy for<br/>\ndealing with the situation are psychological, and would still be there<br/>\neven if his diet was perfect. Maybe it&#39;s a blessing in disguise -- you<br/>\nmight not have realized the extent to which your behavior is affecting<br/>\nhim if his outward reaction was milder. <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: is this what ADHD looks like?!","postDate":"1234546225","msgId":42011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduNGFuaCtlODdoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdFMjFCOTI1LUIzRTEtNDE2My1BQjQ3LTk3NEQ1RERCQjM3OEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":42010,"nextInTopic":42012,"prevInTime":42010,"nextInTime":42012,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... I do too--my son s yesterday request:  mandarin oranges.","messageBody":"<div id=\"ygrps-yiv-1782259943\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-I always ask before I go to the grocery store to see if they want  <br/>\n&gt; anything, <br/>\n<br/>\n&gt; I always ask too.<br/>\n&gt; <br/>\n&gt; Yesterday Holly wanted spinach pasta.<br/>\n<br/>\n<br/>\n </span></blockquote>I do too--my son&#39;s yesterday request:  mandarin oranges.</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234546157","msgId":42010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNDE3Ny40MTkxMC5xbUB3ZWI1MzkwOS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":42009,"nextInTopic":42011,"prevInTime":42009,"nextInTime":42011,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... I ve been having some hard times with my son. Lately he has taken to screaming at the top of his lungs, which is annoying to say the least, but I also","messageBody":"<div id=\"ygrps-yiv-1044130552\"><blockquote><span title=\"qreply\">--- On Thu, 2/12/09, Kim Zerbe &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kim.zerbe@...\">kim.zerbe@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n            I&#39;ve been having some hard times with my son. Lately he has taken to<br/>\n<br/>\nscreaming at the top of his lungs, which is annoying to say the least, but I<br/>\n<br/>\nalso don&#39;t know what to do about it. I&#39;m trying to find a reason he might be<br/>\n<br/>\ndoing this and can&#39;t seem to. He seems mad at me but won&#39;t say why. But<br/>\n<br/>\nwait, there&#39;s more.*****Some kids are not just very verbal about what is in their heads.  Both my boys can talk up a storm, but if you ask whether their shoes fit right, they cannot always answer.  <br/>\n****<br/>\n<br/>\n <br/>\n<br/>\nToday when I told him it was time to get ready for baseball, he started<br/>\n<br/>\nthrowing toys and screaming. When I tried to hold him and ask him what was<br/>\n<br/>\nwrong, he hit me and tried to bang his head into mine (I wouldn&#39;t let him,<br/>\n<br/>\nbut as I tried to hold his arms all I could do was flip my neck back and he<br/>\n<br/>\nbanged into my chest). I tried to hold him sideways in my lap and he just<br/>\n<br/>\nbucked all over the place and shook his head like he was having a seizure,<br/>\n<br/>\nyelling nonsense at the same time. I tried to remain calm and said &quot;Look,<br/>\n<br/>\nyou don&#39;t have to go to baseball if you really don&#39;t want to go, but this is<br/>\n<br/>\nnot the way to act. Just tell me you don&#39;t want to go!&quot; So he yelled &quot;I HATE<br/>\n<br/>\nBASEBALL AND I HATE YOU!!!&quot; His new thing is that he hates whatever it is I<br/>\n<br/>\nwant to do or whatever interferes with what he wants to do. ***Try to back off in the moment and ask smaller questions later.  Instead of why did you not want to go, ask &quot;did the coach yell too much&quot;, and then maybe later ask about a kid he did not like, and maybe the next day ask ask if the does not like the sound of the whistle.  Or whatever it was that you can think might have bothered him.  Remember he may not answer.  Sometimes you will never know what was wrong.  Sometimes you hit the right question and you learn a little more about you child.  Be observant because he may not be able to talk about it later.  When you sense he is annoyed, back off.<br/>\n******I think he just wanted to watch The<br/>\n<br/>\nIncredibles, even though I said we could pause it and finish watching after<br/>\n<br/>\nbaseball. The baseball class was only happening now and the movie would be<br/>\n<br/>\nhere when we got back. That only made things worse so I unpaused the movie<br/>\n<br/>\nand walked away.*****Did you warn him before he put the movie in that there would not be time to finish?  Maybe help him find a shorter movie.  Set a timer for how long till you had to leave.  Ask him to turn off the movie when there was still a bit a wiggle room to get to basketball?<br/>\n*******<br/>\n<br/>\nIt feels like I&#39;m doing something wrong. I&#39;m really getting tired of the<br/>\n<br/>\nphysical abuse with him. I try talking to him and he just screams, bucks,<br/>\n<br/>\nand hits. I end up leaving the room and sometimes crying because I don&#39;t<br/>\n<br/>\nlike it ,but also don&#39;t know what I am doing wrong. <br/>\n***You&#39;ve gotten lots of good ideas for food, but have you considered other physical needs.  Eli needed glasses at 5.  He was much calmer and much less aggressive once he got them.  I really had no real signs he needed them, but he was a different child after he got them.   The testing in the dr office is not at all accurate.  <br/>\n*****On these days I am<br/>\n<br/>\nfairly certain that he would test positve for ADHD or some other thing if we<br/>\n<br/>\nsubmitted him for testing, but what would that get us? (I&#39;m not going to!<br/>\n<br/>\nJust venting a little here! Hoping someone can understand.)****There is nothing stopping you from reading about ADHD without any diagnosis at all.  Eli has many characteristics of ADHD or Aspergers.  I have found some of the suggestions in books helpful and others not.  I think the best book I think is <br/>\nThe Highly Sensitive Child: Helping Our Children Thrive When the World Overwhelms Them (Paperback)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nby Elaine Aron<br/>\n<br/>\n Really, just hang in there.  Some days are better than others.  Try not too have too many scheduled activities and even less that you have to be absolutely on time for.  Build as much flexiblity into your life as possible.<br/>\nHTH,<br/>\nAmandaEli 7, Samuel 6<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      <br/>\n<br/>\n    <br/>\n    <br/>\n\t<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234541103","msgId":42009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdFMjFCOTI1LUIzRTEtNDE2My1BQjQ3LTk3NEQ1RERCQjM3OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDYzOTQ4NS45MTU0OS5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDYzOTQ4NS45MTU0OS5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":42008,"nextInTopic":42010,"prevInTime":42008,"nextInTime":42010,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"-=-I always ask before I go to the grocery store to see if they want anything, or if they have any meals they specifically want, lately they haven t asked for","messageBody":"<div id=\"ygrps-yiv-65079115\">-=-I always ask before I go to the grocery store to see if they want  <br/>\nanything, or if they have any meals they specifically want, lately  <br/>\nthey haven&#39;t asked for much on my grocery runs. Yesterday, however,  <br/>\nSimon wanted profiteroles, so we got some. Linnaea wanted custard,  <br/>\nthat&#39;s in the cupboard. I&#39;ll go get her some now. -=-<br/>\n<br/>\nI always ask too.<br/>\n<br/>\nYesterday Holly wanted spinach pasta.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Food limits (was:  is this what ADHD looks like?!","postDate":"1234540523","msgId":42008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3ODU2QzQxLUU4RjEtNDQ2NC1BOTY5LUUxNThBNjI4OUY5QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNhOTNmZmYxMDkwMjEzMDQyNHgyZTlmYmVjZW1hZjE0YzM5ZGEwYWRmOTlmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4gPDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4gPDNhOTNmZmYxMDkwMjEzMDQyNHgyZTlmYmVjZW1hZjE0YzM5ZGEwYWRmOTlmQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":42006,"nextInTopic":42009,"prevInTime":42007,"nextInTime":42009,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"-=-Limiting someone other than myself is still not something I would consider. I would want to offer things that have been directly asked for or are an obvious","messageBody":"<div id=\"ygrps-yiv-1892187235\">-=-Limiting someone other than myself is still not something I would<br/>\nconsider. I would want to offer things that have been directly asked<br/>\nfor or are an obvious favorite. -=-<br/>\n<br/>\nThis morning I got a chain letter about recipes.  I&#39;m supposed to send  <br/>\na recipe to the top person on the chain.   She&#39;s in England.  Many of  <br/>\nmy recipes won&#39;t work there (or might, but not easily or inexpensively).<br/>\n<br/>\nSo I&#39;m thinking about availability and limits this morning.<br/>\n<br/>\nYou don&#39;t have to &quot;consider&quot; limiting your child to be effectively  <br/>\nlimiting him.  It&#39;s natural.  If Holly wanted a papaya right now, or a  <br/>\nmango, the best I could do would be to get sliced dried, or maybe  <br/>\ncanned-in-syrup.   MAYBE at the international grocery store, Ta Lin,  <br/>\nthey might have some two-week or month-old papayas.   Parts of the  <br/>\nyear, we can get mangos.<br/>\n<br/>\nSometimes I want grapes, but I decide against it because it&#39;s way off  <br/>\nseason and they&#39;re very expensive and came from Chile or somewhere way  <br/>\naway.<br/>\n<br/>\nLimiting what&#39;s already in the house or what grows in the yard,  <br/>\nthough, that&#39;s a whole &#39;nother thing.<br/>\n<br/>\nBut how do things get into the house?  Trips to the store aren&#39;t the  <br/>\nsame as bringing the whole store home.  People DO make choices.  I  <br/>\nhaven&#39;t bought marshmallows nor anything with marshmallows in it, for  <br/>\na couple of years.  I could.  I could buy marshmallows every single  <br/>\nday.  I don&#39;t.<br/>\n<br/>\nThere are realities and preferences and quirks and geographical  <br/>\nrealities and budgetary considerations.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234536451","msgId":42006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzMDM0ODgwLUUwN0MtNEZERC05QURBLTI4MDgwMjgyNjk3RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4gPDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4="},"prevInTopic":42005,"nextInTopic":42008,"prevInTime":42005,"nextInTime":42007,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"-=- Karate operates as an all age activity so you get adults and teens who have a passion, children who are developing a passion and some children whose","messageBody":"<div id=\"ygrps-yiv-770008409\">-=-<br/>\nKarate operates as an &quot;all age&quot; activity so you get adults and teens  <br/>\nwho have a passion, children who are developing a passion and some  <br/>\nchildren whose parents think karate is a good idea. It is patently  <br/>\nobvious when a child has not chosen for him or her self. -=-<br/>\n<br/>\nKirby started karate at 10 or 11.   When he was older, and teaching  <br/>\nthe young children&#39;s beginner classes, he said the greatest disruption  <br/>\nto the classes and the saddest thing was when these very young  <br/>\nchildren were there pretty much against their will.<br/>\n<br/>\nHolly went to the dojo for six months or so when she was young, eight  <br/>\nor so maybe?  Younger maybe.  But she didn&#39;t like it because the other  <br/>\nkids wouldn&#39;t be serious and pay attention.  She would&#39;ve been happy  <br/>\nin a group of others who really wanted to do it.<br/>\n<br/>\nI tried to explain to them that karate seems like playing, like  <br/>\nrecess, and that those kids are messed up by school, and have learned  <br/>\nonly to do the bare minimum to get by, and that goofing around feels  <br/>\nlike a win to them.   But it bothered Holly so much that as soon as  <br/>\nshe got her first belt she quit.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234536155","msgId":42005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlEOUI2NzlCLTQwMDMtNEQ2MS1CRDNGLUJFRDdEMTYwMTM1NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDkzRTU0QTgxNEVFNTRFREI4QkQ3NERFMEUyOEVGM0IwQExZTEFMQVAyPg==","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4gPDQ5OTUxOEQ4LjgwMDA3MDFAbWFjLmNvbT4gPDkzRTU0QTgxNEVFNTRFREI4QkQ3NERFMEUyOEVGM0IwQExZTEFMQVAyPg=="},"prevInTopic":42004,"nextInTopic":42006,"prevInTime":42004,"nextInTime":42006,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"-=-i think it can be really hard to separate *our* needs and desires from what our kids are really showing us they need. but it s SO important.-=- It is at the","messageBody":"<div id=\"ygrps-yiv-888670104\">-=-i think it can be really hard to separate *our* needs and desires  <br/>\nfrom what our kids are really showing us they need. but it&#39;s SO  <br/>\nimportant.-=-<br/>\n<br/>\nIt is at the heart of unschooling and of being a mindful parent for  <br/>\nthe parent to need and desire to give the child what the child needs.<br/>\nBeing a child&#39;s partner means helping him meet his needs.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234535814","msgId":42004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFRjcxQTY0LTBBOUEtNEVFRC05RDEzLUQxRDhBN0M5NTc4OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ5OTUxOEQ4LjgwMDA3MDFAbWFjLmNvbT4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4gPDQ5OTUxOEQ4LjgwMDA3MDFAbWFjLmNvbT4="},"prevInTopic":42003,"nextInTopic":42005,"prevInTime":42003,"nextInTime":42005,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"P.S. moved to the top:  This seems like a lot of reading and learning.  While/if you re looking into principles of child development and need, be with your","messageBody":"<div id=\"ygrps-yiv-1105601171\">P.S. moved to the top:  This seems like a lot of reading and  <br/>\nlearning.  While/if you&#39;re looking into principles of child  <br/>\ndevelopment and need, be with your child in child-like ways.  Be where  <br/>\nhe is emotionally, and physically.   Play with him.  Provide for  <br/>\nhim.   Take him and find new things to see and consider all his  <br/>\nsenses:  new things to smell, taste, touch, see, hear.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAnd here&#39;s my original post, but it could take hours to really look at  <br/>\nthese, and days to consider them, so immediate attention to your son  <br/>\nis more important.<br/>\n<br/>\n-=-Reading your whole post, Kim, this is jumping to conclusions, but I  <br/>\nhave<br/>\na gut feeling that your expectations of him are too high.-=-<br/>\n<br/>\nOne thought that came to me when I read it was &quot;Piaget.&quot;  I didn&#39;t  <br/>\npursue that thought, but Pam&#39;s comment has revived it.<br/>\n<br/>\nIt&#39;s worth looking at Piaget&#39;s stages of development.  And maybe at  <br/>\nattachment parenting pages.   They&#39;re pretty easily googled, but  <br/>\nhere&#39;s something I saved:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/attachment\">http://sandradodd.com/attachment</a><br/>\n<br/>\nHere&#39;s an easy summary of Piaget&#39;s stages of development:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://honolulu.hawaii.edu/intranet/committees/FacDevCom/guidebk/teachtip/piaget.htm\">http://honolulu.hawaii.edu/intranet/committees/FacDevCom/guidebk/teachtip/piaget.htm</a><br/>\n<br/>\n<br/>\nEvery unschooling parent, every parent of any kind, could use knowing  <br/>\nabout these stages of development and about Maslow&#39;s Hierarchy of Needs.<br/>\nHere&#39;s an explanation that might help with younger children:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sfhelp.org/02/needlevels.htm\">http://sfhelp.org/02/needlevels.htm</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234534874","msgId":42003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzOTQ4NS45MTU0OS5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":42002,"nextInTopic":42004,"prevInTime":42002,"nextInTime":42004,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"To add to Pam s words, we have a drawer filled with chips. In the UK chips typically come in single serving bags and we have maybe 20 or 30 bags or chips in a","messageBody":"<div id=\"ygrps-yiv-634676137\">To add to Pam&#39;s words, we have a drawer filled with chips. In the UK chips typically come in single serving bags and we have maybe 20 or 30 bags or chips in a drawer. They are almost entirely eaten by visitors and rarely eaten by any of us. I just made a couple of batches of homemade potato chips and made sweet potato chips for the first time. I&#39;d tried making them a number of times before but never got the potatoes thin enough. The other day I read an article about cheap food for a recession and this chef said that deep fried potato peelings were really good, so I tried it. They are really good. And if you peel a whole potato and deep fry it, you get a bunch of chips that are amazing. I even tried saving peelings in the fridge in a bowl of salty water, and they were fine the second day. The sweet potato chips were really good, as well. I make homemade tortilla chips as well. Blue corn masa harina seems to make a nicer chip then yellow. <br/>\n<br/>\nI just cut up pears and put them in front of Simon and Linnaea. They are eating them. If they didn&#39;t I&#39;d put them in the compost. They both really like Japanese spicy rice crackers with peanuts. We order them on-line about once a month and they disappear quickly at first and then more steadily as the novelty wears off. Linnaea really enjoys soda. I got her an old fashioned soda water bottle where you fizz up tap water with CO2 canisters. I just got more canisters and new syrups so we&#39;ve had cinnamon sodas and apple sodas and cherry sodas and coconut sodas, and cherry and cinnamon (not so good) and apple and cinnamon (which I quite liked) as well as having Roy Rogers and Shirley Temples by mixing the cherry syrup with coke or sprite. Peanut butter toast or crackers is well liked. Nachos with beans, baked beans on toast, rice cakes with cream cheese or peanut butter, hummus with bell peppers and bread sticks, toasted nori sheets, nori rolls, bean burritos,<br/>\n breakfast burritos, pancakes with lemon and sugar in lieu of syrup, pancakes with syrup, galia melon, coconut pieces from a coconut that you bang open with a hammer, kiwi, cucumber, homemade french fries, store bought American curly fries, scones with butter and honey only when fresh from the oven, challah with butter, bagels with avocado, English muffins (I can&#39;t think what they are called here, not English though), diner style cherry pie with digestive biscuit (closest thing to graham crackers available) crust and whipped cream on top, matzo with butter and vegemite. And it goes on. It is all about what is in the fridge and the cupboard and that I&#39;m in the mood to make. But it doesn&#39;t look like a child who is gorging on chips and candy and soda pop because, somehow, a diet with no limits is presumed to end with an obese, crumby child. <br/>\n<br/>\nIt is like all the rest of unschooling, it is seeing what your child likes and strewing things around that interest. If your child seems to thrive on starches, come up with things that are linked to starches, and put other things out that may be unrelated but you think they might enjoy. It is also time, it is thinking about them being hungry and giving them food. It is getting food at the store that you can put together into appealing platters. It is looking at recipes or ideas for things and preparing those. Food is a wonderfully strewable thing. Both Simon and Linnaea have a very diverse range of experience when it comes to food.  I always ask before I go to the grocery store to see if they want anything, or if they have any meals they specifically want, lately they haven&#39;t asked for much on my grocery runs. Yesterday, however, Simon wanted profiteroles, so we got some. Linnaea wanted custard, that&#39;s in the cupboard. I&#39;ll go get her some now. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Friday, 13 February, 2009 11:43:02 AM<br/>\nSubject: Re: [AlwaysLearning] is this what ADHD looks like?!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 2/13/2009 12:51 AM, Ward wrote:<br/>\n&gt; I agree that you should let your son eat when he is hungry but (and this may be unpopular here) I believe you can limit the choices that are available.  I find that even for myself.  I&#39;ll choose chips if they are there so I avoid them being there and then I make a better food choice.  We have always had a fruit bowl accessible 24/7, my teens take nuts and fruit to<br/>\n&gt; karate as a good filler.  I would aim to make available foods that are enjoyable but also nutritional rather than empty calories like chips.  You may also need to help your son understand hunger signals.  My youngest daughter often &quot;lost it&quot; when she was young (ages 3 to 6) if she needed food but it took her a long time to realise that it was hunger that made her angry.  You can help him with this by offering healthy filling snacks regularly through the day.<br/>\n&gt;    <br/>\n<br/>\nI fill our kitchen with healthy foods. But I don&#39;t turn down requests <br/>\nfor chips or anything else. The main thing I noticed is that my kids <br/>\nalways ate very very healthy foods if they were available. Fruit that is <br/>\nin the refrigerator, in the fruit drawer, and needs washing is NOT seen <br/>\nas &quot;available.&quot; So I washed it and put it out and often sliced it up and <br/>\nserved it with little chunks of cheese or on toothpicks or sprinkled <br/>\nwith cinnamon. I like to put out apple or pear slices with little <br/>\npudding cups to use as dip. Banana slices with cinnamon were good too. <br/>\nAnd I&#39;d make peanut butter balls and freeze them - but put out a handful <br/>\non a plate to make them convenient. My kids really liked frozen peas and <br/>\nfrozen grapes and frozen corn, right out of the freezer, but they <br/>\nwouldn&#39;t get it themselves, so I&#39;d put some out for them. I also buy <br/>\nreally good bread and put a little peanut butter or almond butter on it. <br/>\nThese days, my kids like the Western Alternative Bagels or English <br/>\nmuffins with a little light cream cheese. I buy the multi-grain pasta <br/>\nand my kids always liked that cooked with just some grated Parmesan <br/>\ncheese on it. They also liked sliced cucumber spears with salt. They <br/>\nliked pretzels with apple chunks. They liked carrots with Ranch dressing <br/>\ndip or with plain yogurt mixed with dill as a dip. They like the low-fat <br/>\nTriscuits or that style cracker with grated cheese sprinkled on top and <br/>\nmelted in the microwave. They loved tofu cut into chunks and coated with <br/>\ncorn flakes and baked in the oven. They like hummus a lot - usually on <br/>\npita bread and with cucumbers. They like potatoes - mashed or baked. I <br/>\nused to buy those prewashed and wrapped in plastic potatoes and sweet <br/>\npotatoes because they were very convenient. They like the butternut <br/>\nsquash that we can get at Trader Joes and some other places in a packet <br/>\nthat goes right into the microwave. They like popcorn a lot. They like <br/>\ncereal with fruit. They really like almonds and pecans. Hard-boiled eggs <br/>\nor deviled eggs are great, too.<br/>\n<br/>\nSo - that gives you some idea of the kinds of things that I mean when I <br/>\nsaid put food out.<br/>\n<br/>\nI think sometimes people think when we say &quot;no restrictions&quot; that our <br/>\nkids eat nothing but bags of chips and boxes of cookies all day long. <br/>\nFar from it. We had a big party here on January 31st and we still have <br/>\nseveral big bags of chips on the kitchen counter. I think everybody had <br/>\nas much of them as they&#39;re interested in having and the big bags have <br/>\nbeen unopened for the past week. I bought a big bag of M&M&#39;s today and <br/>\nhad a handful of them - they sat out for hours, right in front of <br/>\neveryone, and nobody else touched them.<br/>\n<br/>\nThe deal is that kids who have had restricted food choices will gorge <br/>\nthemselves when the restrictions are lifted, but those who have always <br/>\nhad primarily unrestricted food choices (restricted only by what we can <br/>\nafford and sometimes having to wait until the next shopping trip) don&#39;t <br/>\nseem to have any urge to over-indulge on less healthy foods.<br/>\n<br/>\nWe recently spent some time visiting the Dodds in Albuquerque and the <br/>\nwhole time we were there there was a bunch of kinds of candy and nuts <br/>\nand cookies sitting out on the counter. Most of it was still sitting <br/>\nthere when we left and I&#39;m sure I, myself, ate more of it than everyone <br/>\nelse put together. &quot;I&quot; have to resist eating sweets, but Sandra&#39;s kids <br/>\nand my kids don&#39;t have to resist it - they eat what appeals to them and <br/>\nsweets aren&#39;t more appealing than other food.<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234527877","msgId":42002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDkwMjEzMDQyNHgyZTlmYmVjZW1hZjE0YzM5ZGEwYWRmOTlmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4JIDw0MTU1NEI5Njg3REI0MTFBODVDNjNBRjhGRDc3Rjc2Q0BXYXJkd2luZG93cGM+"},"prevInTopic":42001,"nextInTopic":42003,"prevInTime":42001,"nextInTime":42003,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... Limiting someone other than myself is still not something I would consider.  I would want to offer things that have been directly asked for or are an","messageBody":"<div id=\"ygrps-yiv-75865504\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; I agree that you should let your son eat when he is hungry but (and this may be unpopular here) I believe you can limit the choices that are available.  I find that even for myself.  I&#39;ll choose chips if they are there so I avoid them being there and then I make a better food choice. &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Limiting someone other than myself is still not something I would<br/>\nconsider.  I would want to offer things that have been directly asked<br/>\nfor or are an obvious favorite.  Such a favorite that it seems to be<br/>\n*all* a kid wants to eat!  How does it help with unschooling and<br/>\ndevelopment of hunger awareness to deny a child what they obviously<br/>\nwant?  I would think it would create a feeling of being deprived,<br/>\nwhich could easily be avoided just by offering chips ..... along with<br/>\nother food choices.<br/>\n<br/>\nSome ideas about how to do that: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/monkeyplatter\">http://sandradodd.com/eating/monkeyplatter</a><br/>\n<br/>\nIn fact, we went all out and offered many different kinds of chips<br/>\nwhen Karl was so much into chip eating.  His favorites have changed<br/>\nand he has better knowledge of chips and how he feels after eating<br/>\nthem.  It&#39;s interesting what he says about them now ....  that they<br/>\ndon&#39;t always make his tummy feel great.  He still loves chips but<br/>\ntends toward the less greasy varieties most of the time.  And at 4,<br/>\nKarl ate so many chips *all* the time that it was beginning to worry<br/>\nme sometimes.  But it has worked out fine over time.  He eats lots of<br/>\ndifferent foods now and continues to expand on the different things<br/>\nhe&#39;s willing to eat.<br/>\n<br/>\nIt&#39;s the age.  Probably the majority of kids go through several food<br/>\nphobias in an attempt to control what&#39;s safe for them to eat.  Don&#39;t<br/>\nspend time telling kids that some food is good for them and some is<br/>\nbad--they&#39;re already skeptics!  What we want is to make the whole<br/>\nfeeling about food to be fun.<br/>\n<br/>\nThat it *is* good for them to eat all kinds of things will become more<br/>\nand more obvious to them without us having to say a lot about it.<br/>\nPeople naturally like some things better than other things and their<br/>\npreferences will change over time at least somewhat ---if they have<br/>\nthe choice to form their own decisions about what they eat in the<br/>\nfirst place.  Just offer more and different things in small cute<br/>\ncontainers and have fun with it.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234525382","msgId":42001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5OTU1Q0M2LjYwMDA5MDdAbWFjLmNvbT4=","inReplyToHeader":"PDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4gPDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4="},"prevInTopic":42000,"nextInTopic":42002,"prevInTime":42000,"nextInTime":42002,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... I fill our kitchen with healthy foods. But I don t turn down requests for chips or anything else. The main thing I noticed is that my kids always ate very","messageBody":"<div id=\"ygrps-yiv-958301031\">On 2/13/2009 12:51 AM, Ward wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I agree that you should let your son eat when he is hungry but (and this may be unpopular here) I believe you can limit the choices that are available.  I find that even for myself.  I&#39;ll choose chips if they are there so I avoid them being there and then I make a better food choice.  We have always had a fruit bowl accessible 24/7, my teens take nuts and fruit to<br/>\n&gt; karate as a good filler.  I would aim to make available foods that are enjoyable but also nutritional rather than empty calories like chips.  You may also need to help your son understand hunger signals.  My youngest daughter often &quot;lost it&quot; when she was young (ages 3 to 6) if she needed food but it took her a long time to realise that it was hunger that made her angry.  You can help him with this by offering healthy filling snacks regularly through the day.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>I fill our kitchen with healthy foods. But I don&#39;t turn down requests <br/>\nfor chips or anything else. The main thing I noticed is that my kids <br/>\nalways ate very very healthy foods if they were available. Fruit that is <br/>\nin the refrigerator, in the fruit drawer, and needs washing is NOT seen <br/>\nas &quot;available.&quot; So I washed it and put it out and often sliced it up and <br/>\nserved it with little chunks of cheese or on toothpicks or sprinkled <br/>\nwith cinnamon. I like to put out apple or pear slices with little <br/>\npudding cups to use as dip. Banana slices with cinnamon were good too. <br/>\nAnd I&#39;d make peanut butter balls and freeze them - but put out a handful <br/>\non a plate to make them convenient. My kids really liked frozen peas and <br/>\nfrozen grapes and frozen corn, right out of the freezer, but they <br/>\nwouldn&#39;t get it themselves, so I&#39;d put some out for them. I also buy <br/>\nreally good bread and put a little peanut butter or almond butter on it. <br/>\nThese days, my kids like the Western Alternative Bagels or English <br/>\nmuffins with a little light cream cheese. I buy the multi-grain pasta <br/>\nand my kids always liked that cooked with just some grated Parmesan <br/>\ncheese on it. They also liked sliced cucumber spears with salt. They <br/>\nliked pretzels with apple chunks. They liked carrots with Ranch dressing <br/>\ndip or with plain yogurt mixed with dill as a dip. They like the low-fat <br/>\nTriscuits or that style cracker with grated cheese sprinkled on top and <br/>\nmelted in the microwave. They loved tofu cut into chunks and coated with <br/>\ncorn flakes and baked in the oven. They like hummus a lot - usually on <br/>\npita bread and with cucumbers. They like potatoes - mashed or baked. I <br/>\nused to buy those prewashed and wrapped in plastic potatoes and sweet <br/>\npotatoes because they were very convenient. They like the butternut <br/>\nsquash that we can get at Trader Joes and some other places in a packet <br/>\nthat goes right into the microwave. They like popcorn a lot. They like <br/>\ncereal with fruit. They really like almonds and pecans. Hard-boiled eggs <br/>\nor deviled eggs are great, too.<br/>\n<br/>\nSo - that gives you some idea of the kinds of things that I mean when I <br/>\nsaid put food out.<br/>\n<br/>\nI think sometimes people think when we say &quot;no restrictions&quot; that our <br/>\nkids eat nothing but bags of chips and boxes of cookies all day long. <br/>\nFar from it. We had a big party here on January 31st and we still have <br/>\nseveral big bags of chips on the kitchen counter. I think everybody had <br/>\nas much of them as they&#39;re interested in having and the big bags have <br/>\nbeen unopened for the past week. I bought a big bag of M&M&#39;s today and <br/>\nhad a handful of them - they sat out for hours, right in front of <br/>\neveryone, and nobody else touched them.<br/>\n<br/>\nThe deal is that kids who have had restricted food choices will gorge <br/>\nthemselves when the restrictions are lifted, but those who have always <br/>\nhad primarily unrestricted food choices (restricted only by what we can <br/>\nafford and sometimes having to wait until the next shopping trip) don&#39;t <br/>\nseem to have any urge to over-indulge on less healthy foods.<br/>\n<br/>\nWe recently spent some time visiting the Dodds in Albuquerque and the <br/>\nwhole time we were there there was a bunch of kinds of candy and nuts <br/>\nand cookies sitting out on the counter. Most of it was still sitting <br/>\nthere when we left and I&#39;m sure I, myself, ate more of it than everyone <br/>\nelse put together. &quot;I&quot; have to resist eating sweets, but Sandra&#39;s kids <br/>\nand my kids don&#39;t have to resist it - they eat what appeals to them and <br/>\nsweets aren&#39;t more appealing than other food.</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234520229","msgId":42000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzQ0E5OUUwQ0Y2OTQ0RjQ5MDZFRkMzRkZCNDI4NEFGQFJvYnluUEM+","inReplyToHeader":"PDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4gPDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4="},"prevInTopic":41999,"nextInTopic":42001,"prevInTime":41999,"nextInTime":42001,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"Jayn is 9 and becomes very agitated, hostile and violent when she is hungry at home. She seems to be able to hold herself in and exercise restraint when she is","messageBody":"<div id=\"ygrps-yiv-1519927629\">Jayn is 9 and becomes very agitated, hostile and violent when she is hungry <br/>\nat home. She seems to be able to hold herself in and exercise restraint when <br/>\nshe is around others, but I think her ability to make good choices is <br/>\ncompromised when she is particularly hungry. She sometimes gets hungry <br/>\nstartlingly quickly compared to when she last ate, and sometimes (although <br/>\nmore rarely as time goes on) it catches me by surprise. When I start to <br/>\nsense hostility in her tone of voice, I tend to start getting some food out.<br/>\n<br/>\nAt normal times when she announces that she is hungry (as compared to asking <br/>\nfor something particular), we have a kind of verbal dance around her being <br/>\nhungry and me offering what is available. If I ask her what she has a <br/>\nhankering for, it is only rarely that she can tell me and she often <br/>\nexpresses impatience or frustration at being asked, so instead I list what <br/>\nwe have and then she will either latch happily on to an meal (I think she <br/>\npictures it before deciding) or know that she certainly does not want that <br/>\nthing. If she is unable to decide, especially if I am hungry too, I will go <br/>\nahead and make something that I know she likes &quot;for myself&quot;. Usually she <br/>\nwill then want it for herself when it is fragrant and appetizing right in <br/>\nfront of her. Or it spurs her to make a different decision.<br/>\n<br/>\nBut those other times when she is teetering on this edge of crazy angry, it <br/>\nis futile and excessively time consuming to do this. The best thing I can do <br/>\nis just start cooking or putting together foods that I know she usually <br/>\nlikes.<br/>\n<br/>\nHowever the really best thing is anticipate her hunger if I can. My worry is <br/>\nthat too many of our conversations recently have revolved around food and <br/>\nmaking sure that Jayn has eaten recently, especially when it is just the two <br/>\nof us. It may be time to return to an old strategy I used to employ <br/>\nsometimes late at night, of preparing the park/outing food bag full of a <br/>\nvariety of stuff and setting it out near her. This doesn&#39;t always help if <br/>\nshe is hankering for hot foods, (maybe I need a soup thermos!) but it <br/>\nsometimes keeps things more appealing than out on a plate in the air. Also <br/>\nthere is a certain element of fun in pulling things in little containers or <br/>\nbaggies out of the bag.<br/>\n<br/>\nAnother thing that helps Jayn get happy again very quickly are fruit and <br/>\nyogurt smoothies. They are fast to make and usually very filling. I <br/>\ngenerally add an egg to enhance the whipped texture.<br/>\n<br/>\nKim, you mentioned food or snacks being available for your son in the low <br/>\ncupboard. That is great to have, but don&#39;t rely on him fetching his own <br/>\nsnacks or have the expectation that he will remember to go to cupboard when <br/>\nhe is in the middle of some other engaging activity. It has only been in the <br/>\nlast 2 years that Jayn has started getting her own snacks, and the last <br/>\ncouple of months that she has been going directly to the fridge to get out <br/>\nher own drink instead of asking me for one. OTOH she likes to cook and will <br/>\nhappily prepare scrambled eggs or grilled cheese sandwiches for other people <br/>\nin her life. Just like she used to offer to carry my plate to the kitchen, <br/>\nbut never want to take her own.<br/>\n<br/>\nAs for going places, it can seem to a child that parents pretend to offer <br/>\nthe choice to go, but then in their next words or actions take the choice <br/>\nback, even when the parental intention is honest. What I have done with Jayn <br/>\nis say, &quot;If you want to go to whatever, we should leave in 10 minutes&quot; or in <br/>\nthe case of someone as young as Kim&#39;s son, &quot;after the next scene when thus <br/>\nand such happens&quot; or &quot;when you have done that much more&quot; - tieing the timing <br/>\nto a known current activity. I will speak again just before the &quot;point of no <br/>\nreturn&quot; for punctuality and offer to make a call at that time, if that is <br/>\nJayn&#39;s decision. Usually she will jump up to go; sometimes she really <br/>\ndoesn&#39;t want to go and that is good to know too.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":10649172,"authorName":"Ward","from":"&quot;Ward&quot; &lt;xtr581602@...&gt;","profile":"snoozem404","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234515060","msgId":41999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNTU0Qjk2ODdEQjQxMUE4NUM2M0FGOEZENzdGNzZDQFdhcmR3aW5kb3dwYz4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":41997,"nextInTopic":42000,"prevInTime":41998,"nextInTime":42000,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"Hi Kim, My children are now all in their teens and sometimes I feel I expect too much of them but I would urge you to think that your 4yo is still only a baby","messageBody":"<div id=\"ygrps-yiv-496738477\">Hi Kim,<br/>\n<br/>\nMy children are now all in their teens and sometimes I feel I expect too much of them but I would urge you to think that your 4yo is still only a baby really.  He does not need to be going to baseball or any other organised classes at all.  <br/>\n<br/>\nI have two teens who are really into karate.  They have chosen the sport for  themselves and are committed to it with a passion.  Neither of them began the sport until they were 11 or 12 and it was their choice. They have made rapid progress in their sport and I think this is because they chose it.  They tried lots of other things but we never forced them to stick with them if interest waned.<br/>\n<br/>\nKarate operates as an &quot;all age&quot; activity so you get adults and teens who have a passion, children who are developing a passion and some children whose parents think karate is a good idea.  It is patently obvious when a child has not chosen for him or her self.  Not only does the child not enjoy training but those children annoy those who truly love their chosen sport.<br/>\n<br/>\nI agree with giving children an opportunity to experience things but for young children the commitment of going to a weekly session of anything (or several anythings) can just be too tiring and overwhelming.<br/>\n<br/>\nIf I had my time over again with 4 yos we would hang out at home or in casual settings even more than we did.  Four year olds don&#39;t need organised sports.<br/>\n<br/>\nI agree that you should let your son eat when he is hungry but (and this may be unpopular here) I believe you can limit the choices that are available.  I find that even for myself.  I&#39;ll choose chips if they are there so I avoid them being there and then I make a better food choice.  We have always had a fruit bowl accessible 24/7, my teens take nuts and fruit to<br/>\nkarate as a good filler.  I would aim to make available foods that are enjoyable but also nutritional rather than empty calories like chips.  You may also need to help your son understand hunger signals.  My youngest daughter often &quot;lost it&quot; when she was young (ages 3 to 6) if she needed food but it took her a long time to realise that it was hunger that made her angry.  You can help him with this by offering healthy filling snacks regularly through the day.<br/>\n<br/>\nHope this helps.<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234508910","msgId":41997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzRTU0QTgxNEVFNTRFREI4QkQ3NERFMEUyOEVGM0IwQExZTEFMQVAyPg==","inReplyToHeader":"PDQ5OTUxOEQ4LjgwMDA3MDFAbWFjLmNvbT4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4gPDQ5OTUxOEQ4LjgwMDA3MDFAbWFjLmNvbT4="},"prevInTopic":41996,"nextInTopic":41999,"prevInTime":41996,"nextInTime":41998,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"i agree with ALL of what pam wrote, and have found it to be exactly what was needed for my son, after a start that sounds similar to yours. i think it can be","messageBody":"<div id=\"ygrps-yiv-598899741\">i agree with ALL of what pam wrote, and have found it to be exactly what was needed for my son, after a start that sounds similar to yours. <br/>\n<br/>\ni think it can be really hard to separate *our* needs and desires from what our kids are really showing us they need.  but it&#39;s SO important.<br/>\n<br/>\nwarmly, Lyla<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234507992","msgId":41996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5OTUxOEQ4LjgwMDA3MDFAbWFjLmNvbT4=","inReplyToHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":41995,"nextInTopic":41997,"prevInTime":41995,"nextInTime":41997,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... I think you try too often to get him to do what you wish he would want to do. Reading your whole post, Kim, this is jumping to conclusions, but I have a","messageBody":"<div id=\"ygrps-yiv-320613954\">On 2/12/2009 7:16 PM, Kim Zerbe wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Today when I told him it was time to get ready for baseball, he started<br/>\n&gt; throwing toys and screaming. When I tried to hold him and ask him what was<br/>\n&gt;    <br/>\n </span></blockquote>I think you try too often to get him to do what you wish he would want <br/>\nto do.<br/>\n<br/>\nReading your whole post, Kim, this is jumping to conclusions, but I have <br/>\na gut feeling that your expectations of him are too high. Four years old <br/>\nis so very young - his nervous system is still developing and you might <br/>\nbe stressing it too much. You&#39;re expecting a lot of him - lots and lots <br/>\nof us found that our kids couldn&#39;t handle going to ANY kind of &quot;class&quot; <br/>\nat that age. Baseball class could be very stressful for him and he might <br/>\nbe very very torn because you so obviously want him to do it. Even going <br/>\nout to lunch with his dad might be stressful - restaurants are NOT <br/>\nparticularly kid-happy places. Not relaxing for him.<br/>\n<br/>\nAlso - do you realize you described your husband as becoming a &quot;bear&quot; <br/>\nwhen he doesn&#39;t eat lunch?<br/>\n<br/>\nMy suggestions for undoing the damage:<br/>\n<br/>\n1. Do not try to talk him into doing or going to anything at all.  ONLY <br/>\ngo out and do things if he is happily asking to do them. For now, I <br/>\nwouldn&#39;t even offer anything (just temporarily - maybe for 6 months). He <br/>\nknows enough about what&#39;s out there - he knows going to lunch with his <br/>\ndad is a possibility. He can ask if that&#39;s something he wants to do.<br/>\n<br/>\n2. Don&#39;t try to feed him - put food where he can get it, but don&#39;t tell <br/>\nhim it is time to eat it. Be sure there is ALWAYS food available, <br/>\nthough. Offer a variety - you don&#39;t have to offer everything all the <br/>\ntime, but change it out every hour or two. If he says he hates it, just <br/>\nbe calm and say, &quot;Well, it is there if you feel like it.&quot; pay attention <br/>\nto what he does eat, and put out more of that and less of what he turns <br/>\ndown.<br/>\n<br/>\nCould you tell us more about what he likes to do? What is he doing when <br/>\nhe seems calm and happy?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: is this what ADHD looks like?!","postDate":"1234500123","msgId":41995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDMzMwNjRCLURDOEMtNDBBMC1CNUU2LTlCNDMxRDc2RjRFQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGduMnNoaytkMTFjQGVHcm91cHMuY29tPg==","referencesHeader":"PGduMnNoaytkMTFjQGVHcm91cHMuY29tPg=="},"prevInTopic":41994,"nextInTopic":41996,"prevInTime":41994,"nextInTime":41996,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"-=-Being tested -- to learn how best to help him through difficult times -- does not have to be a negative thing.-=- Telling him that his feelings are so wrong","messageBody":"<div id=\"ygrps-yiv-1330422870\">-=-Being tested -- to learn how best to help him through difficult<br/>\ntimes -- does not have to be a negative thing.-=-<br/>\n<br/>\nTelling him that his feelings are so wrong that he needs to go to a  <br/>\ndoctor and be stuck with a needle is pretty extreme for a four-year- <br/>\nold.  Or that he needs drugs to be normal.  Or that there&#39;s possibly  <br/>\nsomething wrong with him.<br/>\n<br/>\nIf the mom tries other strategies and learns ways to make his life  <br/>\nmore pleasant, that will be good for both of them, even if there does  <br/>\nturn out to be something organic/physical causing difficulties.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337776985,"authorName":"c.marie119","from":"&quot;c.marie119&quot; &lt;c.marie119@...&gt;","profile":"c.marie119","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: is this what ADHD looks like?!","postDate":"1234498932","msgId":41994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduMnNoaytkMTFjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":41993,"nextInTopic":41995,"prevInTime":41993,"nextInTime":41995,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"Some ideas: Maybe it is a sort of seizure that happens?  Or reaction to something? Some people honestly do not know why they do certain things, at times; the","messageBody":"<div id=\"ygrps-yiv-1260776117\">Some ideas:<br/>\n<br/>\nMaybe it is a sort of seizure that happens?  Or reaction to something?<br/>\n<br/>\nSome people honestly do not know why they do certain things, at <br/>\ntimes; the actions may be as involuntary as sneezing or <br/>\nuncontrollable giggling, and they don&#39;t know why they&#39;re doing it or <br/>\nhow to stop, and it&#39;s as bewildering to them as it is to anybody else.<br/>\n<br/>\nFor others, it is possible to identify what might have led to what, <br/>\nand therefore what to do differently in future times, etc.<br/>\n<br/>\nBeing tested -- to learn how best to help him through difficult <br/>\ntimes -- does not have to be a negative thing.  It&#39;s an exploration <br/>\nof options, wherein the child can be an active and informed <br/>\nparticipant (rather than, say, a sort of specimen &quot;submitted&quot; for <br/>\nexamination) throughout the whole thing.  It might prove fruitful; it <br/>\nmight prove nothing more than an interesting exercise.<br/>\n<br/>\nWhatever any &quot;experts&quot; determine after whatever exams they do, you <br/>\ndon&#39;t have believe any of it or follow any of their recommendations!  <br/>\nBut if something strikes a chord or sounds true, it might be worth <br/>\ninvestigating further.  You&#39;re just seeking information, which you <br/>\ncan then evaluate for yourself; you&#39;re not throwing all your <br/>\nprinciples to the wind, or anything.<br/>\n<br/>\nGather all the info you can -- from your child himself, of course, <br/>\nand also from anywhere else you can think of.  Don&#39;t close off access <br/>\nto an idea just because it might come from somebody with &quot;Dr.&quot; in <br/>\nfront of their name.  (By the same token, of course, don&#39;t believe <br/>\neverything somebody tells you just bc they have &quot;Dr.&quot; in front of <br/>\ntheir name!  But I think probably everybody here is already on board <br/>\nwith that idea.)<br/>\n<br/>\nBest wishes to you and your child!<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;ve been having some hard times with my son. Lately he has taken to<br/>\n&gt; screaming at the top of his lungs, which is annoying to say the <br/>\n </span></blockquote>least, but I<br/>\n<blockquote><span title=\"ireply\"> &gt; also don&#39;t know what to do about it. I&#39;m trying to find a reason he <br/>\n </span></blockquote>might be<br/>\n<blockquote><span title=\"ireply\"> &gt; doing this and can&#39;t seem to. He seems mad at me but won&#39;t say why. <br/>\n </span></blockquote>But<br/>\n<blockquote><span title=\"ireply\"> &gt; wait, there&#39;s more.<br/>\n&gt;  <br/>\n&gt; Today when I told him it was time to get ready for baseball, he <br/>\n </span></blockquote>started<br/>\n<blockquote><span title=\"ireply\"> &gt; throwing toys and screaming. When I tried to hold him and ask him <br/>\n </span></blockquote>what was<br/>\n<blockquote><span title=\"ireply\"> &gt; wrong, he hit me and tried to bang his head into mine (I wouldn&#39;t <br/>\n </span></blockquote>let him,<br/>\n<blockquote><span title=\"ireply\"> &gt; but as I tried to hold his arms all I could do was flip my neck <br/>\n </span></blockquote>back and he<br/>\n<blockquote><span title=\"ireply\"> &gt; banged into my chest). I tried to hold him sideways in my lap and <br/>\n </span></blockquote>he just<br/>\n<blockquote><span title=\"ireply\"> &gt; bucked all over the place and shook his head like he was having a <br/>\n </span></blockquote>seizure,<br/>\n<blockquote><span title=\"ireply\"> &gt; yelling nonsense at the same time. I tried to remain calm and <br/>\n </span></blockquote>said &quot;Look,<br/>\n<blockquote><span title=\"ireply\"> &gt; you don&#39;t have to go to baseball if you really don&#39;t want to go, <br/>\n </span></blockquote>but this is<br/>\n<blockquote><span title=\"ireply\"> &gt; not the way to act. Just tell me you don&#39;t want to go!&quot; So he <br/>\n </span></blockquote>yelled &quot;I HATE<br/>\n<blockquote><span title=\"ireply\"> &gt; BASEBALL AND I HATE YOU!!!&quot; His new thing is that he hates whatever <br/>\n </span></blockquote>it is I<br/>\n<blockquote><span title=\"ireply\"> &gt; want to do or whatever interferes with what he wants to do. <br/>\n&gt;  <br/>\n&gt; I could not get him to calm down and I couldn&#39;t stay calm myself <br/>\n </span></blockquote>with the<br/>\n<blockquote><span title=\"ireply\"> &gt; way he was treating me. He wouldn&#39;t stop screaming long enough to <br/>\n </span></blockquote>listen to<br/>\n<blockquote><span title=\"ireply\"> &gt; me. I said it was OK to miss baseball, but it would have been the <br/>\n </span></blockquote>last class<br/>\n<blockquote><span title=\"ireply\"> &gt; (for 4yr olds, it&#39;s mainly a skill building class at the rec <br/>\n </span></blockquote>center, not a<br/>\n<blockquote><span title=\"ireply\"> &gt; team or anything) and I really wanted him to go. So I kept asking <br/>\n </span></blockquote>why he<br/>\n<blockquote><span title=\"ireply\"> &gt; didn&#39;t want to go. Probably didn&#39;t help. I think he just wanted to <br/>\n </span></blockquote>watch The<br/>\n<blockquote><span title=\"ireply\"> &gt; Incredibles, even though I said we could pause it and finish <br/>\n </span></blockquote>watching after<br/>\n<blockquote><span title=\"ireply\"> &gt; baseball. The baseball class was only happening now and the movie <br/>\n </span></blockquote>would be<br/>\n<blockquote><span title=\"ireply\"> &gt; here when we got back. That only made things worse so I unpaused <br/>\n </span></blockquote>the movie<br/>\n<blockquote><span title=\"ireply\"> &gt; and walked away.<br/>\n&gt;  <br/>\n&gt; It feels like I&#39;m doing something wrong. I&#39;m really getting tired <br/>\n </span></blockquote>of the<br/>\n<blockquote><span title=\"ireply\"> &gt; physical abuse with him. I try talking to him and he just screams, <br/>\n </span></blockquote>bucks,<br/>\n<blockquote><span title=\"ireply\"> &gt; and hits. I end up leaving the room and sometimes crying because I <br/>\n </span></blockquote>don&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; like it ,but also don&#39;t know what I am doing wrong. On these days I <br/>\n </span></blockquote>am<br/>\n<blockquote><span title=\"ireply\"> &gt; fairly certain that he would test positve for ADHD or some other <br/>\n </span></blockquote>thing if we<br/>\n<blockquote><span title=\"ireply\"> &gt; submitted him for testing, but what would that get us? (I&#39;m not <br/>\n </span></blockquote>going to!<br/>\n<blockquote><span title=\"ireply\"> &gt; Just venting a little here! Hoping someone can understand.)<br/>\n&gt;  <br/>\n&gt; The closest thing I can guess is that he is not eating or drinking <br/>\n </span></blockquote>enough.<br/>\n<blockquote><span title=\"ireply\"> &gt; He refuses most of what I offer. When he asks for something, I get <br/>\n </span></blockquote>it for<br/>\n<blockquote><span title=\"ireply\"> &gt; him right away, and he has access to snacks in cabinets at his <br/>\n </span></blockquote>level. But<br/>\n<blockquote><span title=\"ireply\"> &gt; then some days he ends up snacking on chips all day and won&#39;t eat <br/>\n </span></blockquote>dinner. He<br/>\n<blockquote><span title=\"ireply\"> &gt; yells how he HATES DINNER. The last couple of times we went out to <br/>\n </span></blockquote>dinner he<br/>\n<blockquote><span title=\"ireply\"> &gt; threw a fit either on the way in or at the table. I&#39;m talking <br/>\n </span></blockquote>violent<br/>\n<blockquote><span title=\"ireply\"> &gt; actions, hitting, kicking, running away, screaming and laying down <br/>\n </span></blockquote>on the<br/>\n<blockquote><span title=\"ireply\"> &gt; sidewalk before we even got inside. DH doesn&#39;t handle this well, <br/>\n </span></blockquote>but really<br/>\n<blockquote><span title=\"ireply\"> &gt; stuck in there the other night when this happened and I said he&#39;s <br/>\n </span></blockquote>got to be<br/>\n<blockquote><span title=\"ireply\"> &gt; super hungry, I haven&#39;t seen him eat in hours, you know how I get <br/>\n </span></blockquote>crazy too<br/>\n<blockquote><span title=\"ireply\"> &gt; when I don&#39;t eat. We used to eat out for lunches 3-4 times a week <br/>\n </span></blockquote>so we can<br/>\n<blockquote><span title=\"ireply\"> &gt; see his dad, but lately he&#39;s been so combative and says he HATES <br/>\n </span></blockquote>LUNCH and I<br/>\n<blockquote><span title=\"ireply\"> &gt; hate fighting with him to get in the car so we don&#39;t leave the <br/>\n </span></blockquote>house. DH is<br/>\n<blockquote><span title=\"ireply\"> &gt; missing us but doesn&#39;t want to be around this behavior either, so <br/>\n </span></blockquote>he kind of<br/>\n<blockquote><span title=\"ireply\"> &gt; understands. (But if we don&#39;t all eat together, DH often skips <br/>\n </span></blockquote>lunch, so<br/>\n<blockquote><span title=\"ireply\"> &gt; then he&#39;s a bear when he gets home! But that is a different story! <br/>\n </span></blockquote>He needs<br/>\n<blockquote><span title=\"ireply\"> &gt; to take care of himself.)<br/>\n&gt;  <br/>\n&gt; I know we are going through some kind of disconnect, but I can&#39;t <br/>\n </span></blockquote>tell why,<br/>\n<blockquote><span title=\"ireply\"> &gt; what caused this, or how to deal with it! We&#39;ve gone on some really <br/>\n </span></blockquote>fun<br/>\n<blockquote><span title=\"ireply\"> &gt; outings lately, with and without friends, and he&#39;s been fine. He&#39;s <br/>\n </span></blockquote>gentle<br/>\n<blockquote><span title=\"ireply\"> &gt; around my friend&#39;s baby, plays well with other kids, talks to <br/>\n </span></blockquote>grownups to<br/>\n<blockquote><span title=\"ireply\"> &gt; tell them what he needs. Then I get THIS. I&#39;m taking a break from <br/>\n </span></blockquote>him right<br/>\n<blockquote><span title=\"ireply\"> &gt; now, he&#39;s watching another movie, so I thought I&#39;d come here and <br/>\n </span></blockquote>seek out<br/>\n<blockquote><span title=\"qreply\"> &gt; some professional help. :)<br/>\n&gt;  <br/>\n&gt; Thanks,<br/>\n&gt; Kim Zerbe<br/>\n&gt; in Oregon<br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234498457","msgId":41993,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQjkyREZBLTc5RjItNDZBMi04NTcyLTkwQTMxN0YzOTc0MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":41992,"nextInTopic":41994,"prevInTime":41992,"nextInTime":41994,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"-=- He seems mad at me but won t say why.-=- He might not know why himself.  But he s communicating, and probably feels like he was trying to communicate in","messageBody":"<div id=\"ygrps-yiv-2126830371\">-=- He seems mad at me but won&#39;t say why.-=-<br/>\n<br/>\nHe might not know why himself.  But he&#39;s communicating, and probably  <br/>\nfeels like he was trying to communicate in other ways before but was  <br/>\nbeing ignored.<br/>\n<br/>\nHe hates baseball.  Once he screams that he doesn&#39;t want to go, why  <br/>\ntalk to him about it?  It&#39;s baseball.  He&#39;s four.  It&#39;s not important.<br/>\n<br/>\n-=-&quot;Look,<br/>\nyou don&#39;t have to go to baseball if you really don&#39;t want to go, but  <br/>\nthis is<br/>\nnot the way to act. Just tell me you don&#39;t want to go!&quot; -=-<br/>\n<br/>\nHe was telling you with all his might, and you were asking him to make  <br/>\na speech, or a confession or something.<br/>\n<br/>\n-=-I said it was OK to miss baseball, but it would have been the last  <br/>\nclass<br/>\n(for 4yr olds, it&#39;s mainly a skill building class at the rec center,  <br/>\nnot a<br/>\nteam or anything) and I really wanted him to go. -=-<br/>\n<br/>\nApparently it wasn&#39;t okay with you.  When parents contradict  <br/>\nthemselves all in one little space, it does make kids angry.<br/>\n<br/>\nIt&#39;s really common for parents to assume that they (the parents) know  <br/>\nwhat they&#39;re thinking, but sometimes when it&#39;s written down it&#39;s clear  <br/>\nto others that there was some very basic confusion.  It can&#39;t be okay  <br/>\nfor him to miss it AND for you to really want him to go so much that  <br/>\nyou keep on and on and on.<br/>\n<br/>\n-=- I try talking to him and he just screams, bucks, and hits-=-<br/>\n<br/>\nIs he an only child?  Are there others in the home?<br/>\nIs he newly four, or nearly five?<br/>\n<br/>\n-=-On these days I am<br/>\nfairly certain that he would test positve for ADHD or some other thing  <br/>\nif we<br/>\nsubmitted him for testing, but what would that get us? -=-<br/>\n<br/>\nIt might help make you feel there&#39;s something wrong with him, and  <br/>\nnothing really wrong with the way you&#39;re treating him.  I think that  <br/>\nwould be a bad way to go.<br/>\n<br/>\nWhen two of my kids aren&#39;t getting along, I sometimes say to the older  <br/>\none &quot;Yes, but you&#39;re older and could be setting a better example.&quot;   <br/>\nThe largest range here is two years and ten months.<br/>\n<br/>\nWith a four year old and a mom, I figure the age difference is at  <br/>\nleast twenty years.<br/>\n<br/>\nSimple answer is It doesn&#39;t sound like ADHD to me.  It sounds like he  <br/>\nneeds more things to see and do and needs  more joy and to be  <br/>\nentertained more and talked to less, maybe.  But I only see a peek.   <br/>\nTell us more.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] is this what ADHD looks like?!","postDate":"1234496988","msgId":41992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwNUQ5NDJDRUVGRjQ2QzA4ODMyRTM2NjhCNEVGM0M3QExZTEFMQVAyPg==","inReplyToHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4=","referencesHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":41991,"nextInTopic":41993,"prevInTime":41991,"nextInTime":41993,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"... what caused this, or how to deal with it! We ve gone on some really fun outings lately, with and without friends, and he s been fine. He s gentle around my","messageBody":"<div id=\"ygrps-yiv-518748640\"><blockquote><span title=\"ireply\">&gt;&gt;I know we are going through some kind of disconnect, but I can&#39;t tell why,<br/>\n </span></blockquote>what caused this, or how to deal with it! We&#39;ve gone on some really fun<br/>\noutings lately, with and without friends, and he&#39;s been fine. He&#39;s gentle<br/>\naround my friend&#39;s baby, plays well with other kids, talks to grownups to<br/>\ntell them what he needs. Then I get THIS. I&#39;m taking a break from him right<br/>\nnow, he&#39;s watching another movie, so I thought I&#39;d come here and seek out<br/>\nsome professional help. :)<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>kim, are the eruptions only around transitions/changes? like going to baseball/eating/going out?<br/>\n<br/>\ni know you can get &quot;local&quot; help anytime, but thought i&#39;d chime in anyhow!  :)<br/>\n<br/>\nthe answer to that question would really help me come up with some ideas....he sounds a lot like my son at that age, so i really empathize.<br/>\n<br/>\nwarmly, Lyla<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"is this what ADHD looks like?!","postDate":"1234495002","msgId":41991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1MDgwMWM5OGQ4OSQ3ZjJlODE4MCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":0,"nextInTopic":41992,"prevInTime":41990,"nextInTime":41992,"topicId":41991,"numMessagesInTopic":0,"msgSnippet":"I ve been having some hard times with my son. Lately he has taken to screaming at the top of his lungs, which is annoying to say the least, but I also don t","messageBody":"<div id=\"ygrps-yiv-1621323941\">I&#39;ve been having some hard times with my son. Lately he has taken to<br/>\nscreaming at the top of his lungs, which is annoying to say the least, but I<br/>\nalso don&#39;t know what to do about it. I&#39;m trying to find a reason he might be<br/>\ndoing this and can&#39;t seem to. He seems mad at me but won&#39;t say why. But<br/>\nwait, there&#39;s more.<br/>\n <br/>\nToday when I told him it was time to get ready for baseball, he started<br/>\nthrowing toys and screaming. When I tried to hold him and ask him what was<br/>\nwrong, he hit me and tried to bang his head into mine (I wouldn&#39;t let him,<br/>\nbut as I tried to hold his arms all I could do was flip my neck back and he<br/>\nbanged into my chest). I tried to hold him sideways in my lap and he just<br/>\nbucked all over the place and shook his head like he was having a seizure,<br/>\nyelling nonsense at the same time. I tried to remain calm and said &quot;Look,<br/>\nyou don&#39;t have to go to baseball if you really don&#39;t want to go, but this is<br/>\nnot the way to act. Just tell me you don&#39;t want to go!&quot; So he yelled &quot;I HATE<br/>\nBASEBALL AND I HATE YOU!!!&quot; His new thing is that he hates whatever it is I<br/>\nwant to do or whatever interferes with what he wants to do. <br/>\n <br/>\nI could not get him to calm down and I couldn&#39;t stay calm myself with the<br/>\nway he was treating me. He wouldn&#39;t stop screaming long enough to listen to<br/>\nme. I said it was OK to miss baseball, but it would have been the last class<br/>\n(for 4yr olds, it&#39;s mainly a skill building class at the rec center, not a<br/>\nteam or anything) and I really wanted him to go. So I kept asking why he<br/>\ndidn&#39;t want to go. Probably didn&#39;t help. I think he just wanted to watch The<br/>\nIncredibles, even though I said we could pause it and finish watching after<br/>\nbaseball. The baseball class was only happening now and the movie would be<br/>\nhere when we got back. That only made things worse so I unpaused the movie<br/>\nand walked away.<br/>\n <br/>\nIt feels like I&#39;m doing something wrong. I&#39;m really getting tired of the<br/>\nphysical abuse with him. I try talking to him and he just screams, bucks,<br/>\nand hits. I end up leaving the room and sometimes crying because I don&#39;t<br/>\nlike it ,but also don&#39;t know what I am doing wrong. On these days I am<br/>\nfairly certain that he would test positve for ADHD or some other thing if we<br/>\nsubmitted him for testing, but what would that get us? (I&#39;m not going to!<br/>\nJust venting a little here! Hoping someone can understand.)<br/>\n <br/>\nThe closest thing I can guess is that he is not eating or drinking enough.<br/>\nHe refuses most of what I offer. When he asks for something, I get it for<br/>\nhim right away, and he has access to snacks in cabinets at his level. But<br/>\nthen some days he ends up snacking on chips all day and won&#39;t eat dinner. He<br/>\nyells how he HATES DINNER. The last couple of times we went out to dinner he<br/>\nthrew a fit either on the way in or at the table. I&#39;m talking violent<br/>\nactions, hitting, kicking, running away, screaming and laying down on the<br/>\nsidewalk before we even got inside. DH doesn&#39;t handle this well, but really<br/>\nstuck in there the other night when this happened and I said he&#39;s got to be<br/>\nsuper hungry, I haven&#39;t seen him eat in hours, you know how I get crazy too<br/>\nwhen I don&#39;t eat. We used to eat out for lunches 3-4 times a week so we can<br/>\nsee his dad, but lately he&#39;s been so combative and says he HATES LUNCH and I<br/>\nhate fighting with him to get in the car so we don&#39;t leave the house. DH is<br/>\nmissing us but doesn&#39;t want to be around this behavior either, so he kind of<br/>\nunderstands. (But if we don&#39;t all eat together, DH often skips lunch, so<br/>\nthen he&#39;s a bear when he gets home! But that is a different story! He needs<br/>\nto take care of himself.)<br/>\n <br/>\nI know we are going through some kind of disconnect, but I can&#39;t tell why,<br/>\nwhat caused this, or how to deal with it! We&#39;ve gone on some really fun<br/>\noutings lately, with and without friends, and he&#39;s been fine. He&#39;s gentle<br/>\naround my friend&#39;s baby, plays well with other kids, talks to grownups to<br/>\ntell them what he needs. Then I get THIS. I&#39;m taking a break from him right<br/>\nnow, he&#39;s watching another movie, so I thought I&#39;d come here and seek out<br/>\nsome professional help. :)<br/>\n <br/>\nThanks,<br/>\nKim Zerbe<br/>\nin Oregon<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42045,"nextTopicId":42052}}