{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":85994576,"authorName":"Kolleen","from":"Kolleen &lt;Kolleen@...&gt;","profile":"kaydeecross","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] recipes - Cindy","postDate":"1010034266","msgId":30668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTAzMDUwNC5nMDM1NFJKbTAyMzIxOUBueWNzbXRwMW91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":30667,"nextInTime":30669,"topicId":30668,"numMessagesInTopic":0,"msgSnippet":"... Hi Cindy, If you want I can dig up recipes BUT I have found it much easier to just cook on the fly. One great cook told me to *smell* the spices and see if","messageBody":"<div id=\"ygrps-yiv-1645767054\"><blockquote><span title=\"ireply\">&gt;One thing I would like to replace is noodle mixes - I know it wouldn&#39;t<br/>\n&gt;be hard to come up with a recipe for noodles with a tomato parmesan<br/>\n&gt;sauce or pasta shells in a creamy garlic sauce.  Does anyone have<br/>\n&gt;any pointers on good recipes?  I hate buying the pre-packaged mixes<br/>\n&gt;but my DH gets them since they are so quick and easy to make.  I<br/>\n&gt;really don&#39;t think they&#39;d be that much harder from scratch but can&#39;t<br/>\n&gt;figure out how to start!<br/>\n&gt;Cindy Ferguson<br/>\n<br/>\n<br/>\n </span></blockquote>Hi Cindy,<br/>\nIf you want I can dig up recipes BUT I have found it much easier to just <br/>\ncook on the fly. One great cook told me to *smell* the spices and see if <br/>\nthey would mix with what I&#39;m cooking.<br/>\n<br/>\nI&#39;m really bad at following recipes unless I&#39;m baking.<br/>\n<br/>\nSoooooo, the basics are all you need.<br/>\n<br/>\nWhite sauce for creamy things: heat a small amount of butter, mix a small <br/>\namount of flour (maybe a teaspoon each) and then add some milk and stir <br/>\nuntil it thickens. Once you have this, you can make anything *creamy*.<br/>\n<br/>\n~Add parmesan and romano for alfredo sauce.<br/>\n~Add cheddar or american cheese for mac & cheese sauce (you can cassarole <br/>\nthis after by pouring in with pasta, and sprinkling a bit of breadcrumbs <br/>\non top.<br/>\n~Add some baked (or boiled if in a hurry) garlic and parsley flakes for <br/>\nanother flavour<br/>\n<br/>\nUse it to make creamy soups with roasted garlic, potatos (you can make it <br/>\nnot so creamy with some chicken broth)<br/>\n<br/>\nTomato based sauces. You can either make up a bunch of marinara sauce (if <br/>\nyou want my quick and easy one, just ask, I share!) and freeze it in <br/>\nsmaller containers for on the fly stuff.. OR you can use some Muir Glen <br/>\nketchup for recipes OR you can get a tube of some really good tomato <br/>\npaste... anything to add that tomato taste.<br/>\n<br/>\nI keep chicken broth available to me for just about everything I cook. <br/>\nIts amazing how easy one can whip up meals by using that instead of water.<br/>\n<br/>\nFor example, cook your pasta. You may want to cook a bunch and keep it <br/>\nrefidgerated for quick dinners. Heat a deep frying pan, add some Muir <br/>\nGlen ketchup, some chicken broth and any veggies you got in the freezer. <br/>\nA touch of salt/pepper, some basil (I ALWAYS keep a freezer full of basil <br/>\nwhen its available in the summer for all winter long) and voila, you got <br/>\na great dinner.. put parmesan cheese on the table to each to add <br/>\nindividually.<br/>\n<br/>\nBeing half Italian, parmesan cheese is important to my cooking. So I <br/>\nalways buy GOOD cheese and either grate it on the fly (its cheaper than <br/>\npre-grated) or I buy it grated when the budget allows. You&#39;ll see your <br/>\nsauces and soups make a big change this way.<br/>\n<br/>\nFrancaise sauce is easy with small amount of butter, chicken broth and <br/>\nsome lemon (either juice from a bottle or fresh).. sometimes I add fresh <br/>\nsage for a nice flavour. I cook it seperate from the chicken (just egg <br/>\nand flour and sautee with very little olive oil)<br/>\n<br/>\nStir fry (you can even use a frying pan for this one)<br/>\nHigh heat, olive oil AFTER pan has heated, chicken slices to brown each <br/>\nside, throw in some garlic and a dash of tamari. REAL quick and easy.<br/>\n<br/>\nYou can toss in some steamed veggies after its just about cooked so they <br/>\nsoak up the juice.<br/>\n<br/>\nI guess what I&#39;m driving at is a few simple things in the kitchen and you <br/>\ncan mix and match as you need and then you&#39;ll be cooking on the fly.<br/>\n<br/>\nstaples:<br/>\nextra virgin olive oil<br/>\ngarlic<br/>\nchicken broth<br/>\ntamari (a type of soy sauce)<br/>\nbasil<br/>\nparsley flakes<br/>\nsalt/pepper<br/>\ntomato (whatever form is easiest for you)<br/>\nginger<br/>\nbreadcrumbs<br/>\nparesan cheese<br/>\nlemon juice<br/>\nthyme (great for throwing on potatoes, spray with olive oil and bake)<br/>\nsage<br/>\nbutter<br/>\nmilk<br/>\n<br/>\nAnd thats about it. I&#39;ll *rarely* grab anything else.. I just keep mixing <br/>\nup combos of the above.<br/>\n<br/>\nFor veggies, we use a lot of green chard, swiss chard, spinich etc. You <br/>\nget more bang in vitamins for the bite when using the dark green veggies. <br/>\nAnd well, I&#39;m a firm beleiver in having greens each day.<br/>\n<br/>\nLet us know how you do!<br/>\n<br/>\nregards,<br/>\nkolleen</div>","specialLinks":[]}],"prevTopicId":30667,"nextTopicId":30672}}