{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":8037645,"authorName":"elaine greenwood-hyde","from":"&quot;elaine greenwood-hyde&quot; &lt;elainegh8@...&gt;","profile":"elainegh8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unjobbing","postDate":"1040122300","msgId":51983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyMDBtcFhjZjFVREpXaXB1TDAwMDAwNjFlYkBob3RtYWlsLmNvbT4="},"prevInTopic":21389,"nextInTopic":0,"prevInTime":51982,"nextInTime":51984,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"Hi, this is probably a bit more radical than the unjobbing book but I m not sure as I haven t read it. Anyway here s a site I like. :) http://www.whywork.org/ ","messageBody":"<div id=\"ygrps-yiv-950239376\">Hi,<br/>\n    this is probably a bit more radical than the unjobbing book but I&#39;m not <br/>\nsure as I haven&#39;t read it. Anyway here&#39;s a site I like. :)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.whywork.org/\">http://www.whywork.org/</a><br/>\n<br/>\n<br/>\n                            Elaine (UK)<br/>\n<br/>\nBtw I&#39;m your girl for any frugal/voluntary simplicity/sustainable <br/>\ncities/self sufficiency links you could want :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nAdd photos to your messages with MSN 8. Get 2 months FREE*. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/featuredemail\">http://join.msn.com/?page=features/featuredemail</a></div>","specialLinks":[]},{"userId":0,"authorName":"tpeterson@worldnet.att.net","from":"tpeterson@...","replyTo":"LIST","senderId":"oGrH6NnBZoS-7hPtkm3oR-uMlk6vfpijc9r70mPzNWyjKWFd-4tp2hzTT_kwhsQ0ew-tNzXo7UuAVPuJZLCTba8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Unjobbing","postDate":"990206896","msgId":21389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDllM20zZys3MjhiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDEwNTE1MTY0MDUyLjk2OTM4LnFtYWlsQHdlYjEwMjAxLm1haWwueWFob28uY29tPg=="},"prevInTopic":21293,"nextInTopic":51983,"prevInTime":21388,"nextInTime":21390,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"... You are quite right. I apologize for the generalization, I was caught up in the heat of the memory which was a terrible time for us.  Now that you mention","messageBody":"<div id=\"ygrps-yiv-1475244146\">--- In Unschooling-dotcom@y..., &quot;Eileen M.&quot; &lt;ravensegg@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Although I am sure you are accurate in your assessment<br/>\n&gt; of the particular people you were dealing with, it is<br/>\n&gt; probably less than fair to categorize *all* teachers<br/>\n&gt; that work in the private schools as desiring and being<br/>\n&gt; unable to teach in ps system... <br/>\n<br/>\n </span></blockquote>You are quite right. I apologize for the generalization, I was caught <br/>\nup in the heat of the memory which was a terrible time for us.  Now <br/>\nthat you mention it, there were two or three teachers who were more <br/>\ndedicated, but we dealt with so many who weren&#39;t that the experience <br/>\nwas overwhelming!  I felt especially guilty that I entrusted my <br/>\nchildren every day to these people, ignorantly thinking that they had <br/>\nthe child&#39;s best interest at heart.  We are now at the other end of <br/>\nthe pendulum swing and entrust our daughter to very few and now that <br/>\nshe&#39;s almost nine, I know that I must give her a little more space, <br/>\nbut I also know I&#39;ll be lurking in the background, ready to <br/>\nintervene...<br/>\n<br/>\n<br/>\nTerese<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; __________________________________________________<br/>\n&gt; Do You Yahoo!?<br/>\n&gt; Yahoo! Auctions - buy the things you want at great prices<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a> </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Kim","from":"&quot;Kim&quot; &lt;sinclai@...&gt;","replyTo":"LIST","senderId":"_2rIJBsZd8Lhz7Mf19iyFK2Cr94Lrjzp6Np9oJSipjpXKFSNfNNcC_sgNp-SPyjPHhVK89sTRKnYcbU5tvVym1gvORk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Unjobbing","postDate":"989958083","msgId":21293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTUwMWMwZGQ3YyRiN2E5OGZjMCQ5MTIxYjNkMUB1c2VyPg=="},"prevInTopic":21289,"nextInTopic":21389,"prevInTime":21292,"nextInTime":21294,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"Hi Annete, We also take a handful of multiple vitamins every night.  I don t think we could get enough of the vitamins in the foods we eat otherwise.  We are","messageBody":"<div id=\"ygrps-yiv-1530991027\">Hi Annete,<br/>\nWe also take a handful of multiple vitamins every night.  I don&#39;t think we could get enough of the vitamins in the foods we eat otherwise.  We are also overweight, so we can&#39;t eat too much, at least enough to get all the vitamins we need.  We have looked into the raw-foods thing as well, but we don&#39;t have the discipline to eat just raw foods!  I guess that&#39;s why we&#39;re overweight!  I originally came across a raw-foods healing book when my mother had breast cancer.  I don&#39;t recall the name of the book now, but it was written by a nurse who had cancer and after a regimen of 99% raw-foods, juicing, mushrooms, tea and coffee enemas she went into remission and stayed that way for many years.  She still eats an 80% raw foods diet.  My DH&#39;s psychiatric MD (the one that prescribes medicine) was also into alternative medicines as well as the traditional meds like Prozac.  He wanted him to take a regimen of carbohydrate pills that was formulated to be broken down slowly and keep the level of seratonin  up.  The idea was that certain carbohydrates make seratonin and if you kept the levels up, the patient would not get depressed.  Well, it was too expensive and our insurance would not cover it.  Sam-e is expensive too, but I know it works so it&#39;s worth it!  A turkey sandwich on whole wheat bread is supposed to be a good seratonin booster.  Probably the same as the pills the doctor wanted to prescribe.  He also wants my DH to take flax-oil daily.<br/>\n<br/>\nI think that my husband really doubts our unschooling ways when he is depressed or nearing a depressive episode.  Otherwise, I think he pretty much trusts me.  It&#39;s like you said, we have a mutual respect for each other.<br/>\nKim<br/>\n<br/>\n<br/>\nFrom: &quot;Annette Yunker&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amyunker@...\">amyunker@...</a>&gt;<br/>\nSubject: Re: Re:Unjobbing<br/>\n<br/>\nKim,<br/>\n<br/>\nI have battled borderline depression and unhappiness in recent months.  I&#39;m  glad to hear your spouse is able to get off the Prozac and take the Sam-e.  I have been reading alot about raw-food healing and have come across the recommendation to eat melon (any melon, variety is better anyway) for breakfast for at least 5-6 weeks.  The melons are chock full of different B vitamins.  Of course, this works best with someone following basic food combining principles (fruit on empty stomach in a.m.).  Another thing I do is take a blended orange juice (a couple of oranges) with a bit of water and a couple of tablespoons of flax oil or canola or olive oil.  The sugar of the oranges provides energy, but the oils allow the sugar to be released more slowly over time.  Bach flower remedies are great too because you can pick the specific &quot;mood&quot; or thought  to address, and they are very effective.  <br/>\n<br/>\nI am enjoying my journey in the unschooling life with my children, but I do see my husband and I headed in different directions as he is retired military now government contractor.  The thinking process and lifestyle he relies upon in his world (evaluation, proof, &quot;discipline&quot;, early morning riser, etc) is worlds away from where I am.  <br/>\n<br/>\nI wonder if it is common for one spouse to be skeptical - I wonder how many of you are blessed with a spouse who shares your unschooling vision?  I believe in my heart that it is possible for both parents with differein visions to peacefully co-exist as long as mutual respect for the differing beliefs and styles exist.  I would be interested in hearing from both experiences and neophytes in this regard<br/>\n<br/>\nAnnette<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Eileen M.","from":"&quot;Eileen M.&quot; &lt;ravensegg@...&gt;","replyTo":"LIST","senderId":"Xb5itqeq0d6co1lrCLGjoKANfzXVYA8EEh-GOtPV5jG8VkzFfyY94cJdNtBwKcdzBjyQnTfbWnyY3sr1lDixh0RFbC8m7KFp","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re:Unjobbing","postDate":"989944852","msgId":21289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTE1MTY0MDUyLjk2OTM4LnFtYWlsQHdlYjEwMjAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDlkcjliYStndGltQGVHcm91cHMuY29tPg=="},"prevInTopic":21284,"nextInTopic":21293,"prevInTime":21288,"nextInTime":21290,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"Although I am sure you are accurate in your assessment of the particular people you were dealing with, it is probably less than fair to categorize *all*","messageBody":"<div id=\"ygrps-yiv-807258881\">Although I am sure you are accurate in your assessment<br/>\nof the particular people you were dealing with, it is<br/>\nprobably less than fair to categorize *all* teachers<br/>\nthat work in the private schools as desiring and being<br/>\nunable to teach in ps system... I know several<br/>\nexcellent and inspired teachers who work in private<br/>\nschools *because they care*.  The ps system,<br/>\ngenerally, treats teachers as it treats students... it<br/>\ndiscourages individuality, creativity, and emotional<br/>\ninvestment.  Many teachers find that they are able to<br/>\nbetter express their own unique style and gifts as<br/>\nteachers in a private school setting, where they are<br/>\noften less bogged down by beurocratic paperwork and<br/>\nreporting schedules, and less hemmed in by mandated<br/>\nteaching styles or &#39;standards&#39;.  One (very busy!)<br/>\nfriend taught in a private school (and tutored local<br/>\nps kids gratis) for a decade before moving on to work<br/>\nas a professor for Harvard... he was a Rhodes Scholar,<br/>\na professional economic consultant to the governments<br/>\nof several countries, and had a PhD from Princeton...<br/>\nhardly an uninspired or ignorant teacher!<br/>\n<br/>\nI don&#39;t doubt that hs is the best choice for your<br/>\nchildren, or for mine.  Certainly there are plenty of<br/>\nuninspired and just downright toxic teachers out<br/>\nthere.  But there are a lot of teachers out there who<br/>\nstruggle every day against the odds and their own<br/>\nadministrations to provide the best they can for their<br/>\nstudents; it&#39;s an uphill battle, and a heroic one, and<br/>\nteachers (for the most part) deserve our respect and<br/>\nsympathy.  It&#39;s a job most of us wouldn&#39;t want for<br/>\ntwice the pay...<br/>\n<br/>\n<br/>\n--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tpeterson@...\">tpeterson@...</a> wrote:<br/>\n The principal, also<br/>\n<blockquote><span title=\"ireply\"> &gt; the 7th and 8th <br/>\n&gt; grade teacher, didn&#39;t even use proper grammer and<br/>\n&gt; was caught <br/>\n&gt; threatening a student in the men&#39;s room for<br/>\n&gt; misbehaving. When he was <br/>\n&gt; failing in the expensive private high school, we had<br/>\n&gt; endless meetings <br/>\n&gt; with his teachers who all seemed uninspired.  After<br/>\n&gt; all, if they <br/>\n&gt; could, they would have been working in the ps system<br/>\n&gt; which paid <br/>\n&gt; better.  <br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Auctions - buy the things you want at great prices<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a></div>","specialLinks":[]},{"userId":0,"authorName":"tpeterson@worldnet.att.net","from":"tpeterson@...","replyTo":"LIST","senderId":"o2buZ16k0Sqt-C1CO0PIgf8aGfo3i5_zIjxrXtK8unIaCwU7V60Mo4ymx3td6fPfuTb3_JwsZDP_ORwdUfetss0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Unjobbing","postDate":"989931690","msgId":21284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkcjliYStndGltQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDEwNTE0LjIwMjYzNC4tNDA0OTU5LjExLm1lZ2F0ZXNAanVuby5jb20+"},"prevInTopic":21273,"nextInTopic":21289,"prevInTime":21283,"nextInTime":21285,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"... wonder ... unschooling ... My husband and I went the traditional way with my two sons from a previous marriage, mostly because we don t know there were","messageBody":"<div id=\"ygrps-yiv-729029513\">--- In Unschooling-dotcom@y..., megates@j... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; &lt;snip&gt; I wonder if it is common for one spouse to be skeptical - I <br/>\n </span></blockquote>wonder<br/>\n<blockquote><span title=\"ireply\"> &gt; how many of you are blessed with a spouse who shares your <br/>\n </span></blockquote>unschooling<br/>\n<blockquote><span title=\"ireply\"> &gt; vision? <br/>\n<br/>\n </span></blockquote>My husband and I went the traditional way with my two sons from a <br/>\nprevious marriage, mostly because we don&#39;t know there were other <br/>\noptions.  When #2 son had problems at the private catholic school we <br/>\nwere sending him to, we switched to a private lutheran school.  Then <br/>\nmy husband got on that school board and found out that no one there <br/>\nactually knew what they were doing or how to really run a school for <br/>\nthe benefit of the children.  The principal, also the 7th and 8th <br/>\ngrade teacher, didn&#39;t even use proper grammer and was caught <br/>\nthreatening a student in the men&#39;s room for misbehaving. When he was <br/>\nfailing in the expensive private high school, we had endless meetings <br/>\nwith his teachers who all seemed uninspired.  After all, if they <br/>\ncould, they would have been working in the ps system which paid <br/>\nbetter.  Eventually he was asked not to return and after one month in <br/>\nps where his gpa went from .something to 3.8, even though he skipped <br/>\nmost of the time, we let him unschool.  I got him a job with one of my <br/>\nclients and he bought his first car and had to figure out how to get <br/>\nit registered and licensed and insured.  By the time we were pregnant <br/>\nwith our daughter, we knew we weren&#39;t trusting anybody else with her - <br/>\nno daycare, no school and we &quot;started&quot; the moment she was born.  Every <br/>\nmoment of life is a learning experience as far as we are concerned.  <br/>\nWe are both determined and dedicated and our sons, his mother and my <br/>\nfather are on board so we have a dedicated teaching &quot;staff&quot;, each <br/>\noffering our daughter the depth of their personal expertise.  When one <br/>\nof us wavers or has doubts (which happens after an outside attack <br/>\nsometimes) the others rally to bring back the confidence.  It&#39;s great!</div>","specialLinks":[]},{"userId":0,"authorName":"megates@juno.com","from":"megates@...","replyTo":"LIST","senderId":"jdYn4WmveUBk5UQDgVIpvupIYjB9mOm4QcOEtE_pmTu9lQkKtCbE1KRYo6YVYGd_PDTQ80_9vg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re:Unjobbing","postDate":"989897050","msgId":21273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTE0LjIwMjYzNC4tNDA0OTU5LjExLm1lZ2F0ZXNAanVuby5jb20+"},"prevInTopic":21264,"nextInTopic":21284,"prevInTime":21272,"nextInTime":21274,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"Mine is skeptical of unschooling.  He thinks they need more structure.  I tell him he is welcome to provide structure anytime.  :-)  But he is so busy with his","messageBody":"<div id=\"ygrps-yiv-776447991\">Mine is skeptical of unschooling.  He thinks they need more structure.  I<br/>\ntell him he is welcome to provide structure anytime.  :-)  But he is so<br/>\nbusy with his business that the daily details are left to me anyway. <br/>\nIronically, he has &quot;unschooled&quot; himself into his current occupation<br/>\n(which is definitely an Un-job!) and even did his best to legitimately<br/>\nget out of many classes when he was in high school.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n&lt;snip&gt; I wonder if it is common for one spouse to be skeptical - I wonder<br/>\nhow many of you are blessed with a spouse who shares your unschooling<br/>\nvision?  I believe in my heart that it is possible for both parents with<br/>\ndifferein visions to peacefully co-exist as long as mutual respect for<br/>\nthe differing beliefs and styles exist.  I would be interested in hearing<br/>\nfrom both experiences and neophytes in this regard &lt;snip&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Annette Yunker","from":"&quot;Annette Yunker&quot; &lt;amyunker@...&gt;","replyTo":"LIST","senderId":"uEvXf7lkKyBG_BpL3sbthw6nNkwAgrFUNPBZq-461kpyUWFsj0t5InYGDZ9DlvJXRLX7-ymfbAAGZobBx57T7XFYCXXyO3Jdaci7pg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re:Unjobbing","postDate":"989869872","msgId":21264,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWMwZGNhZiQzYjMwOTEwMCRmMDVkMmM0MkA3aGp0ODAxPg==","referencesHeader":"PDAwYzkwMWMwZGNhNiRhMTMxMDRjMCRmZTIxYjNkMUB1c2VyPg=="},"prevInTopic":21262,"nextInTopic":21273,"prevInTime":21263,"nextInTime":21265,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"he now he takes Sam-e) It takes all he has just to get out the door in the morning.  What an awful way to live.  I don t think he should quit work and live","messageBody":"<div id=\"ygrps-yiv-1270872544\">he now he takes Sam-e) It takes all he has just to get out the door in the morning.  What an awful way to live.  I don&#39;t think he should quit work and live like hermits in the wilderness, but perhaps if he did what he wanted to, like start his own business again.....  Like his psychiatrist told him, &quot;Do what you love and the money will follow&quot;<br/>\n<br/>\nKim<br/>\n<br/>\nKim,<br/>\n<br/>\nI have battled borderline depression and unhappiness in recent months.  I&#39;m  glad to hear your spouse is able to get off the Prozac and take the Sam-e.  I have been reading alot about raw-food healing and have come across the recommendation to eat melon (any melon, variety is better anyway) for breakfast for at least 5-6 weeks.  The melons are chock full of different B vitamins.  Of course, this works best with someone following basic food combining principles (fruit on empty stomach in a.m.).  Another thing I do is take a blended orange juice (a couple of oranges) with a bit of water and a couple of tablespoons of flax oil or canola or olive oil.  The sugar of the oranges provides energy, but the oils allow the sugar to be released more slowly over time.  Bach flower remedies are great too because you can pick the specific &quot;mood&quot; or thought  to address, and they are very effective.  <br/>\n<br/>\nI am enjoying my journey in the unschooling life with my children, but I do see my husband and I headed in different directions as he is retired military now government contractor.  The thinking process and lifestyle he relies upon in his world (evaluation, proof, &quot;discipline&quot;, early morning riser, etc) is worlds away from where I am.  <br/>\n<br/>\nI wonder if it is common for one spouse to be skeptical - I wonder how many of you are blessed with a spouse who shares your unschooling vision?  I believe in my heart that it is possible for both parents with differein visions to peacefully co-exist as long as mutual respect for the differing beliefs and styles exist.  I would be interested in hearing from both experiences and neophytes in this regard<br/>\n<br/>\nAnnette<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Kim","from":"&quot;Kim&quot; &lt;sinclai@...&gt;","replyTo":"LIST","senderId":"S-HJ0F5JlqNvEEOfmF8Rih2xq_K56HG6bJkCBxsh_WO4cgYjuic5JWDYwUcD6WAqDkKA8n-C8Tll5tpBw-D3fvp4i68","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Unjobbing","postDate":"989866174","msgId":21262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzkwMWMwZGNhNiRhMTMxMDRjMCRmZTIxYjNkMUB1c2VyPg=="},"prevInTopic":21249,"nextInTopic":21264,"prevInTime":21261,"nextInTime":21263,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"I was just going through an older issue (Sept/Oct. 98) of Growing without Schooling magazine last week when I came across an article called, Adults: Liberate","messageBody":"<div id=\"ygrps-yiv-1212978677\">I was just going through an older issue (Sept/Oct. &#39;98) of Growing without Schooling magazine last week when I came across an article called, &#39;Adults: Liberate Yourselves&#39; by Michael Fogler on Un-Jobbing which really helped to open my eyes about the whole unschooling thing (kind of like an epiphany!)  Here we are trying to unschool our kids when we as adults (well my DH anyway) is doing something he really hates, but feels he has to!  Working for the (gulp) government!  He goes through bouts of depression and has been on Prozac in the past (he is finally off of the Prozac and he now he takes Sam-e) It takes all he has just to get out the door in the morning.  What an awful way to live.  I don&#39;t think he should quit work and live like hermits in the wilderness, but perhaps if he did what he wanted to, like start his own business again.....  Like his psychiatrist told him, &quot;Do what you love and the money will follow&quot;<br/>\nKim<br/>\n<br/>\n<br/>\n   From: &quot;ambersand&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ambersand@...\">ambersand@...</a>&gt;<br/>\nSubject: Re:Unjobbing<br/>\n<br/>\nRead it.  It is available (or was) from Holt&#39;s Bookstore @ www.holtgws.com.  You can also order it at any bookstore. <br/>\n- Kandi<br/>\n--------------------------------------------------------------<br/>\nHi,<br/>\nHas anyone read Unjobbing by Michael Fogler?<br/>\nMy dh is really unhappy in his job, and I&#39;d like to get it ro read, and maybe he will read it too.<br/>\nI was just looking for thoughts on this book if you have read it. Unfortunately our library doesn&#39;t carry it...  I&#39;ll keep looking though.<br/>\n<br/>\nAnn<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Samantha Stopple","from":"Samantha Stopple &lt;sammimag@...&gt;","replyTo":"LIST","senderId":"Hmglp8iN1R_nGVtgQSZZfX1uOXzU2zDeQnUNXfgNez4fPo_Ck78aWBg5qvRmmwWiHdSacmbhPSb9EgtUBKa2PsY9Rj33qEZxI0kPhQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:[Unschooling-dotcom] Unjobbing","postDate":"989808113","msgId":21249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTE0MDI0MTUzLjE4ODgwLnFtYWlsQHdlYjMzMDYubWFpbC55YWhvby5jb20+","inReplyToHeader":"PGlkLjEzMDUyMDAxMjA0NzA1LjAwMDAwQEZQRT4="},"prevInTopic":21247,"nextInTopic":21262,"prevInTime":21248,"nextInTime":21250,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"... You could also suggest Wishcraft by Barbara Sher(sp?) It has several exercises that might help him find what his true passions are. Samantha ","messageBody":"<div id=\"ygrps-yiv-1589023499\"><blockquote><span title=\"ireply\">&gt; Hi,<br/>\n&gt; Has anyone read Unjobbing by Michael Fogler?<br/>\n&gt; My dh is really unhappy in his job, and I&#39;d like to<br/>\n&gt; get it ro read, and maybe he will read it too.<br/>\n&gt; I was just looking for thoughts on this book if you<br/>\n&gt; have read it. Unfortunately our library doesn&#39;t<br/>\n&gt; carry it...  I&#39;ll keep looking though.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>You could also suggest Wishcraft by Barbara Sher(sp?)<br/>\nIt has several exercises that might help him find what<br/>\nhis true passions are.<br/>\n<br/>\nSamantha<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Auctions - buy the things you want at great prices<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a></div>","specialLinks":[]},{"userId":0,"authorName":"ambersand","from":"&quot;ambersand&quot; &lt;ambersand@...&gt;","replyTo":"LIST","senderId":"ax-uIlCj14iDY1n87XSRxrf_KyVJHOUB0w_NxQbPezVX-oIs8a4FAyMN9Y9wRpObF_iXI-pubVFz1aSSa6a78igpK8abkcCVfNzeagUN0P4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:[Unschooling-dotcom] Unjobbing","postDate":"989801225","msgId":21247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkLjEzMDUyMDAxMjA0NzA1LjAwMDAwQEZQRT4="},"prevInTopic":21114,"nextInTopic":21249,"prevInTime":21246,"nextInTime":21248,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"Read it.  It is available (or was) from Holt s Bookstore @ www.holtgws.com.  You can also order it at any bookstore. - Kandi ... Hi, Has anyone read Unjobbing","messageBody":"<div id=\"ygrps-yiv-1673078820\">Read it.  It is available (or was) from Holt&#39;s Bookstore @ www.holtgws.com.  You can also order it at any bookstore. <br/>\n- Kandi<br/>\n--------------------------------------------------------------<br/>\nHi,<br/>\nHas anyone read Unjobbing by Michael Fogler?<br/>\nMy dh is really unhappy in his job, and I&#39;d like to get it ro read, and maybe he will read it too.<br/>\nI was just looking for thoughts on this book if you have read it. Unfortunately our library doesn&#39;t carry it...  I&#39;ll keep looking though.<br/>\n<br/>\nAnn<br/>\n<br/>\n<br/>\n<br/>\nMessage boards, timely articles, a free newsletter and more! Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nTo unsubscribe, set preferences, or read archives:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n<br/>\nAnother great list sponsored by Home Education Magazine! <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a> <br/>\n<br/>\n <br/>\n<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a></div>","specialLinks":[]},{"userId":0,"authorName":"A","from":"A &lt;mumsienc@...&gt;","replyTo":"LIST","senderId":"cb2O9YNUgPZ9GD9kD80tWs7ujQd9kZdGwLuaPKPVXQ_v8R5Y5CtwZjFwNYb1M0BdRX0U_fQeSINfi70ly22wlA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unjobbing","postDate":"989553219","msgId":21114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBRkI2MjQzLjNFRUZFOUZCQGFsbHRlbC5uZXQ+"},"prevInTopic":0,"nextInTopic":21247,"prevInTime":21113,"nextInTime":21115,"topicId":21114,"numMessagesInTopic":0,"msgSnippet":"Hi, Has anyone read Unjobbing by Michael Fogler? My dh is really unhappy in his job, and I d like to get it ro read, and maybe he will read it too. I was just","messageBody":"<div id=\"ygrps-yiv-976018613\">Hi,<br/>\nHas anyone read Unjobbing by Michael Fogler?<br/>\nMy dh is really unhappy in his job, and I&#39;d like to get it ro read, and<br/>\nmaybe he will read it too.<br/>\nI was just looking for thoughts on this book if you have read it.<br/>\nUnfortunately our library doesn&#39;t carry it...  I&#39;ll keep looking though.<br/>\n<br/>\nAnn</div>","specialLinks":[]}],"prevTopicId":51875,"nextTopicId":51984}}