{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"getting REAL support","postDate":"1040083795","msgId":51929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4xLjUuMC4yMDAyMTIxNjE1NTQzNC4wMGFhY2UxMEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDEwNDAwNjc4MzEuMjE2MC4yOTM1My5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":51928,"nextInTime":51930,"topicId":51929,"numMessagesInTopic":0,"msgSnippet":"... for you and people here say that it is not the best way. ","messageBody":"<div id=\"ygrps-yiv-1186526435\"><blockquote><span title=\"ireply\">&gt;&gt;I can see where you can feel jumped on, you offer something that works <br/>\n </span></blockquote>for you and<br/>\npeople here say that it is not the best way.<br/>\n&lt;&lt;<br/>\n<br/>\nANd - really - people seldom ever say even THAT.  I mean - I think what we <br/>\nusually hear here are what people think are &quot;even better&quot; ways - and can&#39;t <br/>\nwe ALL do better?<br/>\n<br/>\nFair warning is given in the description of this list. All of us subject <br/>\nour ideas to probing and analysis and critique when we post them here. That <br/>\nis why we do it. We learn and grow from that process. Sometimes I become <br/>\nmore clear in my own head about why I&#39;ve made a decision I&#39;ve made - not <br/>\nchanging my mind. Sometimes I resist changing my mind - I don&#39;t want to <br/>\nthink that I have more work to do - that I still haven&#39;t gotten it &quot;right.&quot; <br/>\nTruth is - none of us has it absolutely perfectly &quot;right&quot; - but many of us <br/>\nhave a lot of varied experience with long-term unschooling and we have a <br/>\nlot of insight to offer. Some of us have spent years really loooking very <br/>\nvery HARD at unschooling families - talking about it, tearing it apart, <br/>\nanalyzing it, trying out various hypotheses and rejecting many of them. <br/>\nPeople who are new to the ideas can have some of the benefit of all that <br/>\ntime we spent - but they have to drop their defensiveness and be willing to <br/>\nhear what might feel like criticism. The attitude that helped me handle it <br/>\nwas that this is JUST email - nobody here can make me do anything - it <br/>\ndoesn&#39;t hurt me to listen and consider ideas, even those that are critical <br/>\nor feel like attacks. Being open to the possibility that what people say <br/>\nmight be true EVEN (or especially) when it feels like an attack can let you <br/>\nopen up to ideas that you might otherwise not give due consideration to - <br/>\nit doesn&#39;t hurt to consider them. Be brave.<br/>\n<br/>\nSome people just want to be supported in what they&#39;ve already decided is <br/>\nbest. And that can be nice and can be important if they&#39;re having a hard <br/>\ntime sticking to those choices in the face of criticism or other <br/>\ndifficulties. There is a place for support and you can get a lot of it here.<br/>\n<br/>\nIf someone came here and said, &quot;I&#39;ve decided that I&#39;m not going to impose a <br/>\nformal curriculum on my child anymore,&quot; they&#39;d get pure and simple support <br/>\nfor that.<br/>\n<br/>\nThen, if they went on and said, &quot;But I&#39;m JUSTgoing to have them do a math <br/>\ncurriculum, nothing else,&quot; then they&#39;d get a lot of response about how it <br/>\nwould be even BETTER to not even do that and how unnecessary it is and what <br/>\nthe alternatives are and the possible harm of continuing on that path, etc. <br/>\nTHAT is support for taking the unschooling principles a step further.<br/>\n<br/>\nIt doesn&#39;t diminish the support for dropping the full curriculum to say <br/>\nthat we think someone can go farther and be even happier with their decision.<br/>\n<br/>\nIt isn&#39;t support to hold back and not say anything when you have a good <br/>\nidea for someone.<br/>\n<br/>\nRemember, lots of times when people don&#39;t like what they&#39;re hearing - they <br/>\nblame the messenger - on email lists they blame &quot;tone&quot; etc. Try to rise <br/>\nabove that and read ONLY the content and you&#39;ll feel more supported by the <br/>\nincredible amount of time and energy and love of children that pours <br/>\nthrough this list.<br/>\n<br/>\n--pam<br/>\n<br/>\n<br/>\n<br/>\nPam Sorooshian<br/>\nNational Home Education Network<br/>\nwww.NHEN.org<br/>\nChanging the Way the World Sees Homeschooling<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":51928,"nextTopicId":51894}}