{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Being careful with things","postDate":"1240330983","msgId":44187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdza3J0NytuYjhnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzanUxNyt0aTd0QGVHcm91cHMuY29tPg=="},"prevInTopic":44185,"nextInTopic":0,"prevInTime":44186,"nextInTime":44188,"topicId":44182,"numMessagesInTopic":0,"msgSnippet":"... We have had this issue in our house as well at times.  I usually put DVD s in.  Or atleast help and oversee how they are holding them etc.  Some things are","messageBody":"<div id=\"ygrps-yiv-779132411\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Here it is : my kids (8, 6 and 3 yo) don&#39;t take care of their/ours things the way I&#39;d like them to. This means that we have to buy some DVD again, because they can&#39;t be read anymore, that some of our books are used in no time, that they let their clothes on the floor, etc.<br/>\n&gt; <br/>\n&gt; I know they&#39;re young, and I realize that I have probably learned to take good care of things (though I don&#39;t remember when nor how). I wish to add that I&#39;m far from a Bree Vandekemp - I understand perfectly well that life with kids is messy and that&#39;s fine with me. I don&#39;t like when things become old too fast because they&#39;re not taken good care of.<br/>\n&gt; <br/>\n </span></blockquote>We have had this issue in our house as well at times.  I usually put DVD&#39;s in.  Or atleast help and oversee how they are holding them etc.  Some things are more available to the kids (without asking for help) than others.  For example, our wii is up where my oldest son and the adults and the house can reach it but the younger children need help.  We have rock band and keep the intrements put away when not being used so they dont get messed up.  Any books I dont want ruined are put on a high shelf.  The kids are welcome to look at them but since I am asked to help get them down, I am more aware of when they are being looked at so can be more helpful.  If I see clothes on the floor, I pick them up.  <br/>\nOne thing we have done with CD&#39;s is burn a copy and keep the origional safe in a closet.  With DVD&#39;s and video games, we put the most used ones in a big CD case so it is easier to put them away and noone has to look for the origional case.  It is more likely they will be put away that way and not be left sitting on top of the t.v.<br/>\nI put an old tape player with garage sale tapes in the little kids room.  They love it and have free reign of it and if it breaks it isnt that big of a deal.  They also have access to  video player t.v. in there that is older and lot of vhs tapes they can trade out whenever they want.  If they want a DVD they just come ask.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Being careful with things","postDate":"1240328294","msgId":44185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdza3A5Nit2OXJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzanUxNyt0aTd0QGVHcm91cHMuY29tPg=="},"prevInTopic":44184,"nextInTopic":44187,"prevInTime":44184,"nextInTime":44186,"topicId":44182,"numMessagesInTopic":0,"msgSnippet":"... that way. Because we don t have the money to afford it, because I think that it is disrespectful for the people who built these things, and for those who","messageBody":"<div id=\"ygrps-yiv-1877889482\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; My problem is the following : I really hate to see things treated<br/>\n </span></blockquote>that way. Because we don&#39;t have the money to afford it, because I think<br/>\nthat it is disrespectful for the people who built these things, and for<br/>\nthose who bought them and gave them to my kids, because it&#39;s waste and I<br/>\nthink it&#39;s a shame to throw things away just because we haven&#39;t been<br/>\ncareful ... &gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Actually, I can&#39;t understand why they don&#39;t understand that. I don&#39;t<br/>\n </span></blockquote>see how I could make visible to them the importance of being careful. I<br/>\ndon&#39;t want to get mad at them, because it is so useless (and because, in<br/>\nthe end, people&#39;s feelings are more important than things, aren&#39;t they<br/>\n?). On the other hand, it IS important for me - so how can I do that<br/>\n?&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nOver the years, I&#39;ve been the keeper of things at our house.  I fix<br/>\ntoys, put stuff away, fold clothing, wash things, mend things, all of<br/>\nit.  My kids are used to that.  They know how to put discs away because<br/>\nI&#39;ve always done it.  They don&#39;t stay sitting out usually.<br/>\n<br/>\nOver the years, we have lost discs and other things have broken.  It&#39;s a<br/>\nfact of life!  My husband and I, for a long time couldn&#39;t keep a french<br/>\npress in our house, one of us would always break it within a year of<br/>\nownership.  It was a little joke of ours.  One time someone gave my<br/>\nhusband a gift card to a coffee shop, in exchange for work that he did. <br/>\nWe bought a beautiful french press that is NOT glass.<br/>\n<br/>\nMargaux breaks half of her polly pockets through no fault of hers, it&#39;s<br/>\na side effect of cheap plastic toys.  Chamille has rolled over discs<br/>\nwith her office chair at least twice and broken at least one that wasn&#39;t<br/>\nreplacable.<br/>\n<br/>\nLast week one of Chamille&#39;s friends broke a window in our van.  It was<br/>\ncompletely accidental.  It wouldn&#39;t have done any good to be mad at him<br/>\nfor it.  Some things are casualties of childhood.  Some kids are harder<br/>\non things than others.  I was always gentle when I was a kid, but my<br/>\nsister wasn&#39;t.<br/>\n<br/>\nEveryTHING is replacable to an extent.  You can&#39;t replace the way you&#39;ve<br/>\ninjured another person though.  You can apologize, but you can&#39;t take<br/>\naway the damage that was done by being mean to a child.  Children behave<br/>\nlike children, some of them mature faster than others, some will never<br/>\nreally care about material possessions, or clean houses, or clutter, and<br/>\nsome of them will.  I&#39;ve known adults that go through cars, like they do<br/>\nunderwear!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Being careful with things","postDate":"1240327651","msgId":44184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBQzFFN0I5LUZGRkYtNDRCRi04QjVDLUY4QjBDMzUxMjhEMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdzanUxNyt0aTd0QGVHcm91cHMuY29tPg==","referencesHeader":"PGdzanUxNyt0aTd0QGVHcm91cHMuY29tPg=="},"prevInTopic":44182,"nextInTopic":44185,"prevInTime":44183,"nextInTime":44185,"topicId":44182,"numMessagesInTopic":0,"msgSnippet":"-=-[I have sent the same message to the Unschooling Basics list, I apologize to those who subscribe to both lists.]-=- I let this through because the questions","messageBody":"<div id=\"ygrps-yiv-1087316310\">-=-[I have sent the same message to the Unschooling Basics list, I  <br/>\napologize to those who subscribe to both lists.]-=-<br/>\n<br/>\nI let this through because the questions are interesting.  Please, to  <br/>\neveryone reading, though, don&#39;t cross-post.  If you have a question,  <br/>\npick a list and ask it.<br/>\n<br/>\n-=-I have a problem that isn&#39;t directly linked to unschooling - but I  <br/>\nreally would like to read what you&#39;re thinking about it, because I&#39;m  <br/>\nstucked and don&#39;t know what to do.-=-<br/>\n<br/>\nIt&#39;s about learning and about the relationship between parent and  <br/>\nchild, so that&#39;s going to be an unschooling matter.<br/>\n<br/>\n-=-I know they&#39;re young, and I realize that I have probably learned to  <br/>\ntake good care of things (though I don&#39;t remember when nor how).-=-<br/>\n<br/>\nProbably not from people talking to you. &lt;g&gt;<br/>\n<br/>\n-=-I don&#39;t like when things become old too fast because they&#39;re not  <br/>\ntaken good care of.-=-<br/>\n-=-I really hate to see things treated that way. -=-<br/>\n<br/>\nIf you look at the purpose of the existence of the things (clothing  <br/>\nand DVDs) that might help.<br/>\nClothing doesn&#39;t exist so that children can learn to hang it up.<br/>\nDVDs don&#39;t exist for the purpose of kids learning how to take care of  <br/>\nthem.<br/>\n<br/>\n-=-Actually, I can&#39;t understand why they don&#39;t understand that. I  <br/>\ndon&#39;t see how I could make visible to them the importance of being  <br/>\ncareful-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Jean_Piaget\">http://en.wikipedia.org/wiki/Jean_Piaget</a><br/>\nIt should be simple for you to find this in French.  He&#39;s one of your  <br/>\nguys. &lt;g&gt;<br/>\n<br/>\nYou can&#39;t cause a young child to understand what he&#39;s not yet capable  <br/>\nof understanding.  What you can do is pick up their clothes and take  <br/>\ncare of them yourself, and YOU put the DVDs in and take them out until  <br/>\nthe kids are capable of taking care of them.   If a kid is about to  <br/>\ntreat a $15 (I don&#39;t have a euro key) item badly, yell STOP.   Don&#39;t  <br/>\nyell that the kid is awful or stupid.  Say STOP doing what you&#39;re doing.<br/>\n<br/>\nThese might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a>  (though it&#39;s called &quot;rules,&quot; it&#39;s about  <br/>\nprinciples)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a>  (take care of things yourself until  <br/>\nthey&#39;re able to take care of things for real reasons they understand)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html\">http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":323764344,"authorName":"seccotine_ch","from":"&quot;seccotine_ch&quot; &lt;seccotine@...&gt;","profile":"seccotine_ch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Being careful with things","postDate":"1240300391","msgId":44182,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzanUxNyt0aTd0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44184,"prevInTime":44181,"nextInTime":44183,"topicId":44182,"numMessagesInTopic":0,"msgSnippet":"[I have sent the same message to the Unschooling Basics list, I apologize to those who subscribe to both lists.] Hello everybody I have a problem that isn t","messageBody":"<div id=\"ygrps-yiv-415508965\">[I have sent the same message to the Unschooling Basics list, I apologize to those who subscribe to both lists.]<br/>\n<br/>\nHello everybody<br/>\n<br/>\nI have a problem that isn&#39;t directly linked to unschooling - but I really would like to read what you&#39;re thinking about it, because I&#39;m stucked and don&#39;t know what to do.<br/>\n<br/>\nHere it is : my kids (8, 6 and 3 yo) don&#39;t take care of their/ours things the way I&#39;d like them to. This means that we have to buy some DVD again, because they can&#39;t be read anymore, that some of our books are used in no time, that they let their clothes on the floor, etc.<br/>\n<br/>\nI know they&#39;re young, and I realize that I have probably learned to take good care of things (though I don&#39;t remember when nor how). I wish to add that I&#39;m far from a Bree Vandekemp - I understand perfectly well that life with kids is messy and that&#39;s fine with me. I don&#39;t like when things become old too fast because they&#39;re not taken good care of.<br/>\n<br/>\nMy problem is the following : I really hate to see things treated that way. Because we don&#39;t have the money to afford it, because I think that it is disrespectful for the people who built these things, and for those who bought them and gave them to my kids, because it&#39;s waste and I think it&#39;s a shame to throw things away just because we haven&#39;t been careful ... So, when I see a DVD with big scratches, all this come in my mind and it is very difficult for me to stay calm and explain to my kids why I think that being careful is important.<br/>\n<br/>\nActually, I can&#39;t understand why they don&#39;t understand that. I don&#39;t see how I could make visible to them the importance of being careful. I don&#39;t want to get mad at them, because it is so useless (and because, in the end, people&#39;s feelings are more important than things, aren&#39;t they ?). On the other hand, it IS important for me - so how can I do that ?<br/>\n<br/>\nI hope you understand what I&#39;m trying to explain. I know I tell you that everytime that I post here, but my English is a bit rudimentary (at least when I have to write, reading is fine), and it&#39;s always frustrating when you try to explain your situation ...<br/>\n<br/>\nI&#39;m really looking forward to reading your answers<br/>\n<br/>\nMany thanks in advance<br/>\n<br/>\nHelen in Geneva (Switzerland), mom of Sylvain (8), Cyrielle (6) and Circé (3)</div>","specialLinks":[]}],"prevTopicId":44088,"nextTopicId":43442}}