{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":40256956,"authorName":"jmcseals SEALS","from":"&quot;jmcseals SEALS&quot; &lt;jmcseals@...&gt;","profile":"sevenhavei","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] really good story","postDate":"1053133757","msgId":69455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtRjQwSzROMVA5ejlnWTAwMDAyZDYxNEBob3RtYWlsLmNvbT4="},"prevInTopic":69452,"nextInTopic":0,"prevInTime":69454,"nextInTime":69456,"topicId":69452,"numMessagesInTopic":0,"msgSnippet":"What a great article!  Thanks for sharing!  This really caught my eye: **Her husband was tired of coming home to half-naked ladies and begged her to look for a","messageBody":"<div id=\"ygrps-yiv-106593396\">What a great article!  Thanks for sharing!  This really caught my eye:<br/>\n<br/>\n**Her husband was tired of coming home to half-naked ladies and begged her <br/>\nto look for a<br/>\nstore front.***<br/>\n<br/>\nROFLMBFBO!!!  I had to read that a thousand times to make sure I was&#39;t going <br/>\nblind!  My husband would QUIT work if a slew of half naked women were in MY <br/>\nhouse everday! LOL!!<br/>\n<br/>\nJennifer, calling hubby about starting a new business! &lt;wink, wink&gt;<br/>\n<br/>\n_________________________________________________________________<br/>\nProtect your PC - get McAfee.com VirusScan Online  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clinic.mcafee.com/clinic/ibuy/campaign.asp?cid=3963\">http://clinic.mcafee.com/clinic/ibuy/campaign.asp?cid=3963</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"really good story","postDate":"1053133224","msgId":69452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjAwMWMzMWMwZiRiMzY2MDI4MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":0,"nextInTopic":69455,"prevInTime":69451,"nextInTime":69453,"topicId":69452,"numMessagesInTopic":0,"msgSnippet":"IN THE STATES One-Stop Shopping Draws Breastfeeding Moms By Vanessa Geneva Ahern - WeNews correspondent NEW YORK (WOMENSENEWS)--It is Tuesday afternoon and new","messageBody":"<div id=\"ygrps-yiv-1473217380\">IN THE STATES<br/>\nOne-Stop Shopping Draws Breastfeeding Moms<br/>\n<br/>\nBy Vanessa Geneva Ahern - WeNews correspondent<br/>\n<br/>\nNEW YORK (WOMENSENEWS)--It is Tuesday afternoon and new <br/>\nmother Kate<br/>\nYadan is in a sour mood. What&#39;s wrong?<br/>\n<br/>\n&quot;Two a.m. emergency C-section Friday night,&quot; Yadan harrumphs,<br/>\nreferring to her Caesarian-section operation four days earlier. She<br/>\nwalks around Manhattan&#39;s only breastfeeding boutique in aggravated<br/>\nslow motion with a hospital bracelet still on her wrist. &quot;Why am I<br/>\nhere? Because my breasts are so engorged and my husband didn&#39;t <br/>\nwant to<br/>\nsee me in any more pain.&quot;<br/>\n<br/>\nAt the Upper Breast Side, Yadan is in a place where personalized<br/>\npostpartum pampering is part of the transaction. A breast pump can<br/>\nlook like a scary piece of equipment to first-time users. An earlier<br/>\ncustomer was close to tears at the sight of milk coming out of her.<br/>\n<br/>\n&quot;I know what that feels like. You don&#39;t think it&#39;s going to work. And<br/>\nif it does work, you think it&#39;s going to hurt you,&quot; says the store&#39;s<br/>\nspirited owner Felina Rakowski-Gallagher. &quot;My goal immediately after<br/>\nopening the store was getting moms passed that first pumping time.&quot;<br/>\n<br/>\nSince opening her boutique in January 2000, she has become a<br/>\nconfidante and cheerleader to nursing and expectant mothers all over<br/>\nthe tri-state--New York, New Jersey, Connecticut--area.<br/>\nRakowski-Gallagher, a former New York City police officer,<br/>\ncommandeered the store from her dining room table in the early <br/>\nmonths.<br/>\n<br/>\n&quot;It was by appointment only and women had to walk up a flight of<br/>\nstairs with a stroller and deal with two cats and a young child.<br/>\nStill, the women kept coming and coming,&quot; says Rakowski-Gallagher.<br/>\n<br/>\n&#39;Mothers&#39; Grapevine&#39; Spread the Word<br/>\n<br/>\nThanks to the &quot;mothers&#39; grapevine,&quot; word kept spreading and soon the<br/>\nbusiness started to cramp her living quarters. Her husband was tired<br/>\nof coming home to half-naked ladies and begged her to look for a <br/>\nstore<br/>\nfront. Finally, in February of last year, she was able to secure a<br/>\nsuite in the lobby of her building on West 71st Street. Once she was<br/>\nable to conduct business without scheduled appointments, her <br/>\nbusiness<br/>\nincreased substantially.<br/>\n<br/>\nThe weak economy hasn&#39;t hampered nursing bra sales. Rakowski-<br/>\nGallagher<br/>\nand her staff, which includes her mother Ruth Rakowski, and<br/>\noccasionally her 4-year-old door greeter daughter Samantha, are<br/>\nconstantly answering phones and welcoming walk-in customers. The <br/>\nstore<br/>\nsells seven brands of nursing bras in every conceivable size, from a<br/>\n34L to 50K. Although Rakowski-Gallagher guards her business figures,<br/>\nshe did say that she sees &quot;a minimum of 100 pairs of breasts&quot; in her<br/>\nstore per week.<br/>\n<br/>\nThe store isn&#39;t exactly part of big retail trend, but according to La<br/>\nLeche League, there are a few others like it in California, New Mexico<br/>\nand Illinois. Some women also are going to online breastfeeding shops<br/>\nblissfulbabes, One Hot Mamma, and Mothers&#39; Best.<br/>\n<br/>\nEvery two weeks, Rakowski-Gallagher&#39;s own nursing mentor, Beverly<br/>\nSolow, offers &quot;latching-on&quot; classes for new moms with nursing<br/>\ndifficulties. The shop also features a comfy couch for weary new and<br/>\nexpectant moms to sink into, a baby scale so mothers can weigh their<br/>\nbabies before and after a feeding, a try-before-you-buy policy on<br/>\nbreast pumps for purchase and rental, starter kits, baby slings and<br/>\nnursing swimwear.<br/>\n<br/>\n&quot;What have women done before they had a breastfeeding boutique to <br/>\ngo<br/>\nto? They went to a pharmacy or a big franchise store and had nobody <br/>\nto<br/>\ntalk to,&quot; says Rakowski-Gallagher. She is grateful for organizations<br/>\nsuch as La Leche League based in Schaumburg, Ill., that have long<br/>\nprovided support for nursing moms through a monthly meeting format <br/>\nand<br/>\nliterature. Rakowski-Gallagher&#39;s shop, however, offers an entire new<br/>\nlevel of convenience to moms.<br/>\n<br/>\n&quot;Two generations ago, a woman&#39;s extended family would come to the<br/>\nhouse after a child was born. In New York City today, it is often just<br/>\na woman, her partner and her new child in her home after the birth,&quot;<br/>\nsays Rakowski-Gallagher. &quot;La Leche League refers women to my store<br/>\nconstantly because they know I have pumps and I can teach women <br/>\nhow to<br/>\nuse them. I also have a list of all their nursing support groups.&quot;<br/>\n<br/>\n&quot;There has been an absolute explosion in the number of breastfeeding<br/>\nproducts on the market. At the same time, the quality has improved<br/>\ndramatically. Nursing mothers no longer have to contend with poor<br/>\nquality, poorly fitting, uncomfortable nursing clothing or breast<br/>\npumps that bear a closer resemblance to the family vacuum cleaner <br/>\nthan<br/>\nanything you&#39;d find in a hospital setting. It&#39;s a great time to be a<br/>\nnursing mom,&quot; says Ann Douglas, author of &quot;The Mother of All Baby<br/>\nBooks.&quot;<br/>\n<br/>\nOwner Had Her Own Nursing Struggle<br/>\n<br/>\nAfter giving birth to her daughter in 1998, Rakowski-Gallagher<br/>\nstruggled with cracked and sore nipples and a low milk supply. When<br/>\nher daughter was 3 weeks old, she called her girlfriend Dawn, who had<br/>\nsuccessfully nursed three children, for help.<br/>\n<br/>\n&quot;I told her that I was ready to give up,&quot; says Rakowski-Gallagher.<br/>\nDawn brought in a Medela Lactina Select, a hospital grade breast <br/>\npump,<br/>\nin from Long Island and showed her how to use it. Later that day, she<br/>\nattended a new mother&#39;s support group at a local synagogue led by<br/>\nArlene Eisenberg, the late author of &quot;What to Expect When You&#39;re<br/>\nExpecting.&quot;<br/>\n<br/>\nAt the support group, a woman referred her to lactation consultant<br/>\nBeverly Solow. &quot;I called up Beverly, who came to my home the next<br/>\nday,&quot; recalled Rakowski-Gallagher. &quot;Before we got off the phone she<br/>\nsaid &#39;just pump on your worst side every few hours until I get<br/>\nthere.&#39;&quot; The pumping relieved a lot of the pain and increased her milk<br/>\nsupply. Her baby started falling asleep satisfied at her breast.<br/>\n<br/>\nThe relieved mom continued attending a nursing support group where <br/>\none<br/>\nday she overheard a transplanted Salt Lake City mom brag about her<br/>\nhometown&#39;s breastfeeding boutique called The Lactation Station. It <br/>\nwas<br/>\nan epiphany for Rakowski-Gallagher. In short order she was on a flight<br/>\nto Scottsdale, Ariz., with 7-month-old Samantha to attend an annual<br/>\nconference for lactation consultants sponsored by the International<br/>\nBoard of Lactation Consultant Examiners, a nonprofit corporation that<br/>\nhas developed a voluntary certification program for lactation<br/>\nconsultants. There she met the owners of The Lactation Station and<br/>\ninvited herself to hang around their shop for a week. After absorbing<br/>\nwhat she could of the business, she knew she wanted to replicate<br/>\nsomething like it in New York.<br/>\n<br/>\nVital Accessories for Working Moms<br/>\n<br/>\nThe buzzer rings and welcomes in a tall freckle-faced woman wearing <br/>\na<br/>\nblack business suit. She is back at work at Morgan Stanley, the New<br/>\nYork financial services company, after a few months of maternity<br/>\nleave. Scanning the walls that are covered with hard-to-find nursing<br/>\naccessories, the new mom bursts out, &quot;I wish I had known about you<br/>\nearlier!&quot;<br/>\n<br/>\n&quot;I can&#39;t buy that kind of publicity!&quot; says Rakowski-Gallagher with an<br/>\ninfectious laugh. The customer is looking for The Easy Expression<br/>\nBustier, one of the boutique&#39;s best-selling items. It resembles a<br/>\nsturdy white tube top with two holes in the front for suction cups and<br/>\nis popular among working mothers because it minimizes the amount of<br/>\ndisrobing required to pump. The customer&#39;s office at Morgan Stanley<br/>\nhas two lactation rooms equipped with a hospital-grade breast pump <br/>\nfor<br/>\nworking moms.<br/>\n<br/>\nCorporate policy on lactation rooms is an issue that<br/>\nRakowski-Gallagher is passionate about. She urges nursing mothers to<br/>\ndemand a lactation room, &quot;so that you don&#39;t have to pump on a toilet<br/>\nstall.&quot; She was heartened by a law firm that recently ordered a pump<br/>\nfor their employees.<br/>\n<br/>\nShe wishes more companies would make life easier for nursing moms <br/>\nwho<br/>\nreturn to work. &quot;There should be enough support from your family,<br/>\nfriends and from your businesses, that you should continue<br/>\nbreastfeeding for as long as you and your baby want,&quot; says<br/>\nRakowski-Gallagher.<br/>\n<br/>\nVanessa Geneva Ahern is a writer who lives in New York City. You <br/>\ncan<br/>\nvisit her online at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.girlgumption.com\">http://www.girlgumption.com</a><br/>\n<br/>\nFor more information:<br/>\n<br/>\nThe Upper Breast Side: -<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.upperbreastside.com.futuresite.register.com/\">http://www.upperbreastside.com.futuresite.register.com/</a><br/>\n<br/>\nThe Lactation Station: - <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lactationstation.com/\">http://www.lactationstation.com/</a><br/>\n<br/>\ntit 4 tat: - <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.tit4tat.net/\">http://www.tit4tat.net/</a><br/>\n <br/>\nAnnette Filecci<br/>\nFiluss, Inc.<br/>\nPh: 305.567.9304<br/>\nFx: 305.648.1897<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":69438,"nextTopicId":69461}}