{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: changes","postDate":"1217271408","msgId":36884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2bDRwZytlZGNpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc2a2xtOSt2M212QGVHcm91cHMuY29tPg=="},"prevInTopic":36882,"nextInTopic":0,"prevInTime":36883,"nextInTime":36885,"topicId":36872,"numMessagesInTopic":0,"msgSnippet":"... I ... home ... to ... When my oldest was 11, I liked to know where she was physically.  If she had been invited to go swimming at someone s house that I","messageBody":"<div id=\"ygrps-yiv-1438612261\"><blockquote><span title=\"ireply\">&gt; Then last night dd was making plans for today. She asked if she could<br/>\n&gt; go swimming at they boys house or in friends neighborhood pool. I said<br/>\n&gt; yes (cause we always try to say yes) BUT (I know friend does not have<br/>\n&gt; any parental supervision at home and I don&#39;t know these boys at all so<br/>\n </span></blockquote>I<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t know if there&#39;s supervision). The BUTS, I would like to meet the<br/>\n&gt; boys (just say hi, not like an interview) and make sure there is<br/>\n&gt; supervision there. If you go to friends house wait until her mom&#39;s<br/>\n </span></blockquote>home<br/>\n<blockquote><span title=\"ireply\"> &gt; from work this afternoon. OR they can come over here, I&#39;ll take them<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; a public pool and hang out.<br/>\n<br/>\n<br/>\n </span></blockquote>When my oldest was 11, I liked to know where she was physically.  If she<br/>\nhad been invited to go swimming at someone&#39;s house that I didn&#39;t know, I<br/>\nwould&#39;ve walked her over there and introduced myself and found out for<br/>\nsure if she&#39;d been invited and perhaps left a phone number with the<br/>\nparents of the that house in case of emergency.<br/>\n<br/>\nThat&#39;s not out of the realm of reasonability.  If you had an emergency<br/>\nat your house with another persons kid, you&#39;d like to know how to get in<br/>\ncontact with the parents.  If you&#39;d had an emergency while your daughter<br/>\nwas elsewhere and had to leave the house, it would be good to be able to<br/>\ncontact her to let her know that nobody is home and that she&#39;d need to<br/>\nstay there or come with you.<br/>\n<br/>\nThe friend&#39;s neighborhood pool might be a more neutral place where you<br/>\ncould go to check up on them and bring them cold drinks and snacks. <br/>\nPools sometimes have rules about age requirements for being there<br/>\nwithout an adult.<br/>\n<br/>\nIf the friend is doing this as an arrangement to hang out with these<br/>\nboys without supervision, it puts your dd in an awkward position wether<br/>\nshe realizes it or not.  Have you talked to the parents of the friend<br/>\nabout what limits they have in place?  If the friend is defying their<br/>\nrules and your dd is going along with it, that could jeopardize their<br/>\nfriendship.  These are all things that your dd should be made aware of,<br/>\nwether she likes that info or not.  I can totally understand how that<br/>\nwould be really frustrating for her too!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: changes","postDate":"1217268889","msgId":36882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM2OUFDNjBGLUE2QUEtNDg5NS1CQzQzLUMyOUE1OTcxMDRDREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGc2a3JsZiszYmVoQGVHcm91cHMuY29tPg==","referencesHeader":"PGc2a3JsZiszYmVoQGVHcm91cHMuY29tPg=="},"prevInTopic":36879,"nextInTopic":36884,"prevInTime":36881,"nextInTime":36883,"topicId":36872,"numMessagesInTopic":0,"msgSnippet":"-=-BTW, the plans today...we decided I would pick the friend up and bring her over here and they could go back and swim when her mom got home. The friend","messageBody":"<div id=\"ygrps-yiv-1018668066\">-=-BTW, the plans today...we decided I would pick the friend up and  <br/>\nbring<br/>\nher over here and they could go back and swim when her mom got home.<br/>\nThe friend called back and got a big old NO from her mom. So, I said<br/>\nto Lydia (with a smile)&quot;all that grief and she can&#39;t do it!!&quot; I saw<br/>\nLydia try to hide her smile. But I have to say I think I won some<br/>\npoints today! -=-<br/>\n<br/>\n<br/>\n<br/>\nPerfect!<br/>\n<br/>\nIt might be a good idea to talk to the mom if you get a chance to  <br/>\nmake sure the friend isn&#39;t using Lydia as a reason/excuse to want to  <br/>\ndo more, like &quot;Well her parents said yes, and she&#39;s only 11.&quot;<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":199360242,"authorName":"graberamy","from":"&quot;graberamy&quot; &lt;graber@...&gt;","profile":"graberamy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: changes","postDate":"1217262063","msgId":36879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2a3JsZiszYmVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJFRDNFMTFGLTEzQTAtNEFENC04OEJGLTdGNEY2MUVGNkQxNkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":36873,"nextInTopic":36882,"prevInTime":36878,"nextInTime":36880,"topicId":36872,"numMessagesInTopic":0,"msgSnippet":"... Good tip, I will have this conversation with her. maybe you could ask her if it s good to ... I m not sure here.  Normally we could joke around like this.","messageBody":"<div id=\"ygrps-yiv-403024646\"><blockquote><span title=\"ireply\">&gt; Maybe without telling her everything you&#39;re thinking,  maybe say  <br/>\n&gt; that&#39;s one of the things about school that worries you--it creates  <br/>\n&gt; distance between parents and children, and she&#39;ll meet lots of kids  <br/>\n&gt; who are sneaky and needy.&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Good tip, I will have this conversation with her.<br/>\n<br/>\nmaybe you could ask her if it&#39;s good to  <br/>\n<blockquote><span title=\"ireply\"> &gt; get wet and mostly naked with strangers.  (Depends on her sense of  <br/>\n&gt; humor and propriety, whether that would be a thought-provoking  <br/>\n&gt; question or just irritating.&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m not sure here.  Normally we could joke around like this.  Last<br/>\nnight I said something to the effect of &quot;I have no idea what these<br/>\nboys are interested in.&quot;  I realize now I shouldn&#39;t have said anything<br/>\nlike this because this really upset her.  She really isn&#39;t thinking of<br/>\nthem like that and I don&#39;t think she wants to think that these boys<br/>\nthink of her like that.  Her and this 13yo friend are really at<br/>\ndifferent places.<br/>\n<br/>\nBTW, the plans today...we decided I would pick the friend up and bring<br/>\nher over here and they could go back and swim when her mom got home. <br/>\nThe friend called back and got a big old NO from her mom.  So, I said<br/>\nto Lydia (with a smile)&quot;all that grief and she can&#39;t do it!!&quot;  I saw<br/>\nLydia try to hide her smile.  But I have to say I think I won some<br/>\npoints today!  <br/>\n<br/>\nIt&#39;s been a learning experience for me to say the least.  And she&#39;s<br/>\nbeing raised very differently than I was and maybe I&#39;m putting my own<br/>\nhangups onto her.  If I could just turn the emotions off occasionally!  <br/>\n<br/>\nThank you for the tips, I will think about talking to her and her<br/>\nparents and see if an opportunity comes up naturally.<br/>\n<br/>\namy g<br/>\niowa<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] changes","postDate":"1217257750","msgId":36873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJFRDNFMTFGLTEzQTAtNEFENC04OEJGLTdGNEY2MUVGNkQxNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGc2a2xtOSt2M212QGVHcm91cHMuY29tPg==","referencesHeader":"PGc2a2xtOSt2M212QGVHcm91cHMuY29tPg=="},"prevInTopic":36872,"nextInTopic":36879,"prevInTime":36872,"nextInTime":36874,"topicId":36872,"numMessagesInTopic":0,"msgSnippet":"Maybe without telling her everything you re thinking,  maybe say that s one of the things about school that worries you--it creates distance between parents","messageBody":"<div id=\"ygrps-yiv-1071280219\">Maybe without telling her everything you&#39;re thinking,  maybe say  <br/>\nthat&#39;s one of the things about school that worries you--it creates  <br/>\ndistance between parents and children, and she&#39;ll meet lots of kids  <br/>\nwho are sneaky and needy.<br/>\n<br/>\nIt&#39;s possible these boys are nicer than the girl you&#39;re worried  <br/>\nabout.  I would&#39;ve never thought such a thing possible when I was  <br/>\nyoung in a family of all girls and boys were the dangerous &quot;others,&quot;  <br/>\nbut now that I have two boys who are very gentlemanly, and I see some  <br/>\nof Holly&#39;s younger female friends who are emotionally needy and not  <br/>\nvery nice or honest (and have seen in years past a couple of girls  <br/>\nthe boys knew that I did NOT trust), it&#39;s not always the boys who  <br/>\ncreate the pressures.<br/>\n<br/>\nIt would&#39;ve been good if those boys had come over for pizza.<br/>\n<br/>\nIf it were me, in this situation, I might ask if the other girl&#39;s  <br/>\nparents know the boys.  Who are these boys and where do they live?   <br/>\nIf your daughter has no idea, maybe you could ask her if it&#39;s good to  <br/>\nget wet and mostly naked with strangers.  (Depends on her sense of  <br/>\nhumor and propriety, whether that would be a thought-provoking  <br/>\nquestion or just irritating.  For Holly, it would be sobering.)<br/>\n<br/>\nIs your daughter aware that &quot;double dates&quot; have traditions?  God  <br/>\nknows, terminology changes.  It&#39;s hard to translate and keep straight  <br/>\nall the terms of the past with the present, and that&#39;s probably  <br/>\nregional and ever-changing too.  &quot;Hooking up&quot; and &quot;going out&quot; and  <br/>\n&quot;hanging out&quot; don&#39;t mean the same to Holly&#39;s friends as they did (or  <br/>\ndo, on the surface) to  mine, and the old terms have to be translated  <br/>\nto these kids sometimes.<br/>\n<br/>\nHave you tried talking directly to the other girl, maybe without your  <br/>\ndaughter in the room?  Maybe you could get a feel for what her  <br/>\nintentions are and do some direct intimidation.  If she&#39;s not afraid  <br/>\nof her own parents, maybe she could still be wary of your reaction,  <br/>\nif you could alpha-female her off to the side.<br/>\n<br/>\nOr if that&#39;s not appropriate or isn&#39;t going to work, maybe offer to  <br/>\nbe a person she can talk to if these boys aren&#39;t as nice as she  <br/>\nexpects they&#39;ll be or something.  Somehow create a relationship with  <br/>\nthe girl without your own daughter as triangulation.  That would keep  <br/>\nyour daughter from being the only hinge in the structure.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":199360242,"authorName":"graberamy","from":"&quot;graberamy&quot; &lt;graber@...&gt;","profile":"graberamy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"changes","postDate":"1217255945","msgId":36872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2a2xtOSt2M212QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":36873,"prevInTime":36871,"nextInTime":36873,"topicId":36872,"numMessagesInTopic":0,"msgSnippet":"This summer has been a whirlwind of changes for my family.  Mainly because dd (11) has decided to give school a try.  She has been going back and forth on this","messageBody":"<div id=\"ygrps-yiv-1500234978\">This summer has been a whirlwind of changes for my family.  Mainly<br/>\nbecause dd (11) has decided to give school a try.  She has been going<br/>\nback and forth on this subject for a few years now and has finally<br/>\ndecided that she is going to do it.   I&#39;ve felt happy, sad, proud,<br/>\nrejected, confused and have questioned all I&#39;ve done and wonder if I<br/>\ncould have been more fun, more involved, less involved, etc.  I know<br/>\nthese decisions aren&#39;t about me so I keep them to myself and just be<br/>\nsupportive.<br/>\n<br/>\nMy son (9) joined a lego league through a Montessori school and was so<br/>\nimpressed with the kids he thought he wanted to try school part time too<br/>\n(probably influenced by dd and his bff who is going to go to school this<br/>\nyear).  I feel this same emotions as I listed above only I&#39;m a bit more<br/>\napprehensive with him because he&#39;s still not reading (which I&#39;m ok with<br/>\nbut I&#39;m not sure how this will affect his school experience and how this<br/>\nwill make him feel about himself).  I&#39;m going to set it up so he&#39;s there<br/>\nduring the &quot;specials&quot; (the fun stuff).<br/>\n<br/>\nBut I&#39;m dealing with those changes and hoping that they decide to come<br/>\nhome.  I&#39;ll be ok if they like it and decide to stay and they are happy<br/>\ntoo.  I need to stop taking it personally.   I appreciate that they<br/>\ndon&#39;t take peoples words for things and like to find things out on their<br/>\nown (meaning my word, about school).<br/>\n<br/>\nOn top of all that dd, has been pulling away from me and it&#39;s just<br/>\nreally confusing me (again, is this normal, am I doing something wrong,<br/>\nis it a phase??)!  She has a close friend (new in the last year) who is<br/>\n13.  This past weekend dd and friend were off bike riding with a couple<br/>\nboys, 12 and 13.  I know friend is a little boy crazy (and really likes<br/>\none of these boys) and dd has never really felt that way (boy crazy) but<br/>\nshe did tell me this summer that she would like a boy friend (no one in<br/>\nmind at that time).  I called dd when they were out riding and told her<br/>\nI ordered a couple pizza&#39;s and for all of them to come over and eat when<br/>\nthey were hungry.  The girls showed up the boys didn&#39;t (well ds and his<br/>\nbuddies did... [:)] ).<br/>\n<br/>\nMaybe I should explain that friends dad live on our street and I really<br/>\nlike him and his wife (young couple, I think friend was born when he was<br/>\nstill a teenager).  She lives with her mom part of the time a few miles<br/>\naway and I don&#39;t know her mom (met her once) but know she&#39;s alone there<br/>\nduring the day, a lot.<br/>\n<br/>\nThen last night dd was making plans for today.  She asked if she could<br/>\ngo swimming at they boys house or in friends neighborhood pool.  I said<br/>\nyes (cause we always try to say yes) BUT (I know friend does not have<br/>\nany parental supervision at home and I don&#39;t know these boys at all so I<br/>\ndon&#39;t know if there&#39;s supervision).   The BUTS, I would like to meet the<br/>\nboys (just say hi, not like an interview) and make sure there is<br/>\nsupervision there.  If you go to friends house wait until her mom&#39;s home<br/>\nfrom work this afternoon.  OR they can come over here, I&#39;ll take them to<br/>\na public pool and hang out.<br/>\n<br/>\nThis made dd very upset.  Said we never let her do anything (this isn&#39;t<br/>\ntrue but I know she feels this way now), and that other parents don&#39;t<br/>\nact this way.     I&#39;ve seen this 13yo be manipulative and try to get<br/>\nLydia to do things (tells her what to say to me) that are sneaky.  I<br/>\nalso overheard friend trying to create a &quot;double date&quot; so I feel like<br/>\nLydia is just being used to get closer to this boy.  I don&#39;t think Lydia<br/>\nlikes this other boy this way and I don&#39;t want Lydia to feel used by<br/>\nthis friend, so I don&#39;t want to say that to her.  Lydia has never been<br/>\nsneaky and tells me most everything but I&#39;ve noticed that change this <br/>\nsummer too (just not telling me everything like she used to).  And I<br/>\ndon&#39;t want the above scenario to cause her to be sneaky or stop telling<br/>\nme things.  Lydia is a trustworthy kid who always let&#39;s me know where<br/>\nshe is, and what she is doing.  And to be honest I think I give her more<br/>\nfreedom than most 11 yo&#39;s that I know.<br/>\n<br/>\nI almost always try to yes to her.  And I feel like we tried to say yes<br/>\nto the above scenario but it&#39;s not making her happy.   But the yes she<br/>\nwants is way out of my comfort zone.<br/>\n<br/>\nI should say that I&#39;ve also noticed Lydia being more snarky and<br/>\nirritated by me this summer too.  To be honest I think she sees other<br/>\nfriends talk to their parents like this and thinks that is normal. <br/>\nShe&#39;s also been irritated with hubby (dad) and her brother.  I just<br/>\ndon&#39;t know what&#39;s going on and am worried that it may get worse when she<br/>\ngets to school.<br/>\n<br/>\nSo, I thought I&#39;d ask here.  I&#39;m feeling like my emotions are clouding<br/>\nmy judgment.  And I&#39;m not even pmsing yet... [:D] !!  What am I doing<br/>\nwrong????????<br/>\n<br/>\namy g<br/>\niowa<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":36765,"nextTopicId":36863}}