{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: college, was HSLDA - Was -Unschooling Vs Home...","postDate":"1101319846","msgId":101380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGYwMWM0ZDI1MCRlZDdkYWU3MCQ2NTAxYThjMEBob21lPg==","referencesHeader":"PDlhLjFhNWI3YjgzLjJlZDYxZGZkQGFvbC5jb20+"},"prevInTopic":101378,"nextInTopic":0,"prevInTime":101379,"nextInTime":101381,"topicId":101378,"numMessagesInTopic":0,"msgSnippet":"... My oldest especially (she went away to a four year school) learned lots of things that she just wasn t exposed to in our home, our community, our State","messageBody":"<div id=\"ygrps-yiv-1127971237\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;The two of my four that have been to college really learned more about life and themselves than about any future occupation.<br/>\n<br/>\n </span></blockquote>My oldest especially (she went away to a four year school) learned lots of <br/>\nthings that she just wasn&#39;t exposed to in our home, our community, our State even.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nSure, a person will learn more about themselves (if they are paying any attention) during two or four years of doing anything.  That doesn&#39;t change the reason why they are there in the first place.<br/>\n<br/>\nDid your children go to college primarily for that purpose?  To learn more about themselves and the world outside their childhood home?  I don&#39;t need to know the answer, but it is something to think about.<br/>\n<br/>\nIf the goal IS to learn more about life and one&#39;s self, is going to college really the best way to do so, especially considering the cost?<br/>\n<br/>\nWhen I went back to college, it cost about $8,000 per year - and that was doing it on a slim budget and working the entire time.  If someone had handed me $32,000 and said, &quot;Learn more about life and yourself&quot;, I doubt I would have spent the money on college.<br/>\n<br/>\nI went back to school because of an interest in a particular field and the desire to earn the credentials to work in that field.  Of course I learned more about life and myself along the way.  But that was not my reason for attending.<br/>\n<br/>\nIn between high school and college, I went to Alaska *for one summer* and stayed for nine years.  During that time, I also learned an incredible amount about life, the world outside of my childhood community, and myself.  I worked at several different jobs and learned about types of work I like and don&#39;t like.  For the first time in fourteen years, I felt I was doing what I wanted to do, rather than what others thought I should be doing.  Unschoolers have a fantastic head start on that one!<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: college, was HSLDA - Was -Unschooling Vs Home...","postDate":"1101317117","msgId":101378,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlhLjFhNWI3YjgzLjJlZDYxZGZkQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":101380,"prevInTime":101377,"nextInTime":101379,"topicId":101378,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/24/2004 11:54:03 AM Eastern Standard Time, nellebelle@charter.net writes: Maybe, if you are wealthy enough to afford hanging out at","messageBody":"<div id=\"ygrps-yiv-1660395215\">In a message dated 11/24/2004 11:54:03 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nellebelle@...\">nellebelle@...</a> writes:<br/>\nMaybe, if you are wealthy enough to afford hanging out at college for years.  <br/>\nThere are certainly other ways to figure out what you like or don&#39;t. <br/>\n<br/>\nIn today&#39;s society, college is primarily a job training facility.  People <br/>\nspeak of college as *expanding your horizons*, but most people are there in order <br/>\nto get better qualified to be hired.<br/>\n<br/>\n<br/>\nThe two of my four that have been to college really learned more about life <br/>\nand themselves than about any future occupation.<br/>\n<br/>\nMy oldest especially (she went away to a four year school) learned lots of <br/>\nthings that she just wasn&#39;t exposed to in our home, our community, our State <br/>\neven.<br/>\n<br/>\nShe &quot;used&quot; her education for two years teaching school.  Now she does <br/>\nsomething different but all that she learned and experienced in college has helped <br/>\nshape the person she is today.<br/>\n<br/>\nWe aren&#39;t rich by most standards but even with the cost of a private college <br/>\neducation for one child and the amount paid to a community college (which <br/>\nhelped that child decide he didn&#39;t NEED college at all), I think it&#39;s money well <br/>\nspent on my children for them to get more information about what they want <br/>\ntheir place in this world to be.<br/>\n<br/>\nOne child didn&#39;t want college at all and he&#39;s learned some lessons on his own <br/>\nand maybe even sooner than the others but they might have been a bit harsher <br/>\nsince he was in the real world and supporting himself much sooner.<br/>\n<br/>\nLots and lots of young people are in college for the &quot;experience&quot; not <br/>\nnecessarily for the job opportunities.  Chances are greater, among the twenty <br/>\nsomethings that I personally know that went to college, that they are earning money <br/>\nin something besides the field their degree is in.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":101336,"nextTopicId":94862}}