{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":166215589,"authorName":"Mattamandab@aol.com","from":"Mattamandab@...","profile":"amandabokus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"violent toys/ &quot;learning toys&quot;","postDate":"1081991456","msgId":92612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhOS4yMmJiMzk3Ni4yZGFmM2IyMEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":92611,"nextInTime":92613,"topicId":92612,"numMessagesInTopic":0,"msgSnippet":"Kristi, I ve found that my 4 yr old boy who I don t buy guns and what not for, makes them himself anyway.  Lately it s been wrapping paper cardboard tubes that","messageBody":"<div id=\"ygrps-yiv-1975762368\">Kristi,<br/>\n<br/>\nI&#39;ve found that my 4 yr old boy who I don&#39;t buy guns and what not for, makes <br/>\nthem himself anyway.  Lately it&#39;s been wrapping paper cardboard tubes that <br/>\nseem to make great guns and cannons when he&#39;s fighting the British (he loves the <br/>\nPBS show Liberty&#39;s Kids).  We were at the Dollar Store last week and in the <br/>\ntoy aisle there are tons of guns, he was jumping up and down yelling &quot;they have <br/>\nguns, look at all the play guns!&quot;.  So I did get a few odd looks, but I don&#39;t <br/>\nthink he&#39;s ever seen &quot;real&quot; toy guns before.<br/>\n<br/>\nAs for the educational toys like puzzles and stuff, I have a weakness for <br/>\nbuying these.  The electronic ones like Leap Pad don&#39;t get any use (the inlaws <br/>\nbought that one), but we did take it along on a 6 hour car trip & he used it <br/>\nthen).  He uses the computer occassionally for a few games he has, and he likes <br/>\nsome fun kids websites about volcanos and castles.<br/>\n<br/>\nThe blocks, wooden puzzles, etc, do get a lot of use.  I try to rotate what <br/>\nwe have out and build or play with him which increases the use the items get.  <br/>\nWe&#39;ve had the Mega Blocks put away for awhile and now that they&#39;re back out, <br/>\nthey&#39;ve been getting a lot of use.  We also LOVE the large cardboard blocks <br/>\nthat many nursery schools have (they look like bricks).  We have 3 laundry <br/>\nbaskets full of them and you can build huge things out of them.  <br/>\n<br/>\nWe also have Legos, bristle blocks, wooden blocks, lacing cards, alphabet <br/>\ngames, board games, matching games, tons of ABC & animal magnets, write on wipe <br/>\noff boards, etc.  It gets used if it&#39;s out in the open and looks like fun.  We <br/>\nmight do Lincoln Logs for Christmas this year, hmmml, I loved those as a kid.<br/>\n<br/>\nCheck out Sandra&#39;s &quot;strewing&quot; page or look in the archives under strewing, <br/>\nwhich in short I&#39;d say is leaving interesting things out where your children can <br/>\nhappen upon them if interested in checking them out.<br/>\n<br/>\nWe frequent garage sales, the Salvation Army, and discount stores like <br/>\nMarshall&#39;s or TJ Maxx which often have great &quot;educational&quot; toys (aren&#39;t they all)  <br/>\nfor pennies on the dollar.  There I usually let them pick out something that <br/>\nlooks good to them.  My son loves the Salvation Army & is crushed that our <br/>\nfavorite one just went out of business.<br/>\n<br/>\nGood luck.<br/>\nAmanda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":92584,"nextTopicId":92617}}