{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":143181466,"authorName":"melissa4123","from":"&quot;melissa4123&quot; &lt;melissa4123@...&gt;","profile":"melissa4123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Learning the same lessons over again","postDate":"1074917115","msgId":89807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1c3F0citkZ2k5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJ1c2pqNCtqOWlyQGVHcm91cHMuY29tPg=="},"prevInTopic":89806,"nextInTopic":0,"prevInTime":89806,"nextInTime":89808,"topicId":89779,"numMessagesInTopic":0,"msgSnippet":"...  wrote: ","messageBody":"<div id=\"ygrps-yiv-411307193\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;lifelearners6&quot; <br/>\n&lt;lifelearners6@y...&gt; wrote:<br/>\n<br/>\n&lt;&lt;Yesterday, my DS -16 gave me a hug and said to DH, &quot;Have you <br/>\nnoticed that Mom functions best when she gets lots of hugs?&quot;  What a <br/>\nsmart kid!  &lt;g&gt;  <br/>\n<br/>\n--Lynn&gt;&gt;<br/>\n<br/>\nTo quote Dr. Phil.....&quot;if mama ain&#39;t happy, ain&#39;t nobody happy.&quot;  My <br/>\nDH wishes that he would tell us something that we don&#39;t already <br/>\nknow!  &lt;g&gt;<br/>\n<br/>\nMelissa</div>","specialLinks":[]},{"userId":121674785,"authorName":"lifelearners6","from":"&quot;lifelearners6&quot; &lt;lifelearners6@...&gt;","profile":"lifelearners6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Learning the same lessons over again","postDate":"1074909604","msgId":89806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1c2pqNCtqOWlyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJ1cmVnZCtzMXZkQGVHcm91cHMuY29tPg=="},"prevInTopic":89789,"nextInTopic":89807,"prevInTime":89805,"nextInTime":89807,"topicId":89779,"numMessagesInTopic":0,"msgSnippet":"... experience to back up my hopes that began a year ago. ... What an encouraging post.  I find that as I am learning to take my children seriously and treat","messageBody":"<div id=\"ygrps-yiv-136935343\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Julie Bogart&quot; <br/>\n&lt;julie@b...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Today, a year later, I thought I&#39;d go on record with some <br/>\n </span></blockquote>experience to back up my hopes that began a year ago.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; 1. Unschooling has changed how I see my kids. . . . <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>What an encouraging post.  I find that as I am learning to take my <br/>\nchildren seriously and treat them with respect, I sure notice it when <br/>\nsomeone else doesn&#39;t.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I have one 9 yr. old son who really hates to write with a pencil. He <br/>\n </span></blockquote>types online some but his handwriting has really suffered from not <br/>\nwriting all year.<br/>\n<br/>\nAbout your son who hates to write with a pencil.  I have a left-<br/>\nhander, too (mixed dominance, actually) and at age 9, he hated <br/>\nwriting.  He needed reassurance that his writing would eventually <br/>\nlook better and that it was okay that it looked rough.  Now at 16,his <br/>\nwriting is much improved.  But it&#39;s one of my right-handed DDs who <br/>\nhates writing with a pencil.  She prefers a fountain pen.  Smoooooth <br/>\nflowing -- there&#39;s nothing like it.  Just a thought.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But the nice thing is, we have figured out how to live together in a <br/>\n </span></blockquote>loving, nurturing way.<br/>\n<br/>\nYesterday, my DS -16 gave me a hug and said to DH, &quot;Have you noticed <br/>\nthat Mom functions best when she gets lots of hugs?&quot;  What a smart <br/>\nkid!  &lt;g&gt;  <br/>\n<br/>\n--Lynn</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning the same lessons over again","postDate":"1074881531","msgId":89789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkLjNhOGRkYTkuMmQ0MmJkZmJAYW9sLmNvbT4="},"prevInTopic":89786,"nextInTopic":89806,"prevInTime":89788,"nextInTime":89790,"topicId":89779,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/23/2004 10:32:00 AM Eastern Standard Time, julie@bravewriter.com writes: He shared that he finds it hard being left-handed on right handed","messageBody":"<div id=\"ygrps-yiv-678560869\">In a message dated 1/23/2004 10:32:00 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a> writes:<br/>\nHe shared that he finds it hard being left-handed on right handed paper, that <br/>\nhe finds holding the pencil awkward and that his arm starts hurting when he <br/>\nwrites.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI have two lefties in my home.  Same complaints.  There are SOME left-handed <br/>\nnotebooks at specialty stores but hard to come by.  One of my daughters <br/>\n&quot;fixed&quot; this for herself and turns notebooks, spirals, etc., upside down so the <br/>\nspine of the notebook is on the opposite side, to the right instead of to the <br/>\nleft.  Works great for them.  You might show your son this trick and see if it <br/>\nhelps him any.<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning the same lessons over again","postDate":"1074877876","msgId":89786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3My4yNDgxN2QwNS4yZDQyYWZiNEBhb2wuY29tPg=="},"prevInTopic":89779,"nextInTopic":89789,"prevInTime":89785,"nextInTime":89787,"topicId":89779,"numMessagesInTopic":0,"msgSnippet":"Julie, thanks for sharing that.  I like longterm and before-and-after accounts like that. As to your lefthanded son, can you get him a legal pad with a","messageBody":"<div id=\"ygrps-yiv-1470557510\">Julie, thanks for sharing that.  I like longterm and before-and-after <br/>\naccounts like that.<br/>\n<br/>\nAs to your lefthanded son, can you get him a legal pad with a top-opening <br/>\nholder, maybe, or just a cool clipboard, so it&#39;s not left or right handed?<br/>\n<br/>\nMy husband is a lefty and just uses spiral notebooks back-to-front (spiral on <br/>\nthe side where he&#39;s not writing).<br/>\n<br/>\nThere might be left-handed writing websites now talking about various <br/>\ndifferent ways to hold a pencil.   I&#39;ve been told there are five different kinds of <br/>\nlefthandedness (by another left-handed &quot;Keith&quot; I know, Keith Hunter), and Keith <br/>\nDodd says there are three good ways to write.  He turns his paper and does <br/>\nhook-hand, but others to differently, and Keith Hunter says it&#39;s because of the <br/>\nway their brains and bodies are organized.<br/>\n<br/>\nI&#39;m right-handed, so I&#39;m passing this on second hand.<br/>\n<br/>\nMarty is a lefty, and doesn&#39;t write much.  He types well.  When he had to <br/>\ntake notes by hand for the junior police academy he went to, he re-wrote the <br/>\nnotes (again by hand) when he got home.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learning the same lessons over again","postDate":"1074871629","msgId":89779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1cmVnZCtzMXZkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":89786,"prevInTime":89778,"nextInTime":89780,"topicId":89779,"numMessagesInTopic":0,"msgSnippet":"It s been some time since I could participate here. I started grad school this past fall and cut back on online time. But I feel the need to come to say thank","messageBody":"<div id=\"ygrps-yiv-1865733940\">It&#39;s been some time since I could participate here. I started grad school this past fall <br/>\nand cut back on online time.<br/>\n<br/>\nBut I feel the need to come to say thank you to this list and all that you contributed to <br/>\nme last year. Exactly one year ago, we gave up &quot;school at home&quot; and began the <br/>\nunschooloing adventure. I&#39;ve aired many of my concerns as they grew, my <br/>\nhappinesses when things went wonderfully well and my frustrations.<br/>\n<br/>\nToday, a year later, I thought I&#39;d go on record with some experience to back up my <br/>\nhopes that began a year ago.<br/>\n<br/>\n1. Unschooling has changed how I see my kids. <br/>\nI discovered that though I had had pretty good relationships with all five, I often didn&#39;t <br/>\ntake them seriously at the level of their immediate experiences. I would hear a <br/>\ncomplaint about &quot;getting math done&quot; as immaturity that needed me to help them out <br/>\nof it and onto better work habits. Since last year when we took all controls off of <br/>\neducation, I hear what my kids are *actually saying* to me. I have one 9 yr. old son <br/>\nwho really hates to write with a pencil. He types online some but his handwriting has <br/>\nreally suffered from not writing all year.<br/>\n<br/>\nWe talked recently about writing (he wants to keep a life bird list for all the birds he <br/>\nenjoys but hates the physical writing part and can&#39;t use a computer for that task in the <br/>\nfield). He shared that he finds it hard being left-handed on right handed paper, that <br/>\nhe finds holding the pencil awkward and that his arm starts hurting when he writes.<br/>\n<br/>\nBut he does want to learn to write.<br/>\n<br/>\nSo we&#39;ve worked out a way for him to practice slowly (one word a day) and when he <br/>\nsees a bird that needs jotting down and he can&#39;t get it done, I write it for him. We tend <br/>\nto switch off who does the writing.<br/>\n<br/>\n18 mos. ago I would have worried about him and felt I must make him write. Now I <br/>\nhear his concerns, his ambitions and want to work *with him* to solve the problem. <br/>\nIt&#39;s so much nicer!<br/>\n<br/>\n2. I&#39;m much more able to stop what I&#39;m doing to spend time on the floor playing with <br/>\nmy kids. This year I&#39;ve played X Box games, cards, Monopoly, Yugi-Oh cards, and <br/>\nmath games. If someone wants to sit by the window for two hours watching birds, I <br/>\nhappily do it too. If someone wants tea time, we hop up, make the muffins, boil the <br/>\nwater and have tea. We spend time making fires in the hearth and crafts at the table. <br/>\nThere&#39;s just been a shift in the value I put on all that *real* stuff that used to be the <br/>\n&quot;extra* of life at home.<br/>\n<br/>\n3. We&#39;re reading aloud more than ever. I let them pick the books instead of my <br/>\nchoosing them. I do make recommendations, but they have the final say. My 7 yr. old <br/>\ndaughter has purchased those American Girls of Many Lands Dolls (two she&#39;s bought <br/>\nwith her own money!) and we&#39;re reading those books which has led to more <br/>\ndiscussion of other cultures and the globe (which has led to studying maps and how <br/>\nto make them) than any plan I could have come up with.<br/>\n<br/>\n4. We watch a lot of TV. A lot. <br/>\nI have definitely worried about that off and on all year. I&#39;ve still not interefered, but I <br/>\nkept thinking it would get less. It really hasn&#39;t. But I watch with them much of the <br/>\ntime. We have the sit com (on Disney) down to a science. And I&#39;ve been stunned by <br/>\nhow much learning has gone on about family dynamics, how to structure a sit-com, <br/>\nwhat an archetypal character is in performance (even found ourselves comparing <br/>\n&quot;That&#39;s so Raven&quot; to Shakespeare a few times!).<br/>\n<br/>\n5. I let go of needing to control my teens&#39; social lives. <br/>\nThat&#39;s been the hardest one for me. But the result is a much happier home life with <br/>\nthem. They are more eqager for me to know their friends, they&#39;ve shown amazing <br/>\nresponsiblity as far as letting me know where they are and when and they have not <br/>\nonce broken our trust or hid anything from us. (My teens are 14 and 16, one boy, one <br/>\ngirl).<br/>\n<br/>\nNot all has been rosy. I got too busy with business and grad school in the fall and <br/>\nfound that some of the spark and creativity of the spring got lost in a rut. But the nice <br/>\nthing is, we have figured out how to live together in a loving, nurturing way. It&#39;s not <br/>\nhard to reclaim that sense of creativity because everyone is a part of making the life in <br/>\nthe home. It&#39;s not just up to me.<br/>\n<br/>\nBtw, I do have one child who asked for a &quot;school schedule&quot; so he could have &quot;days off&quot; <br/>\nlike his other homeschooled friends. The funniest thing to watch is how he whips <br/>\nthrough the small amount of stuff he wanted to work on only to spend most of his <br/>\ndays the way he did all year--pursuing his interests. :)<br/>\n<br/>\nThanks for all your support and help!<br/>\n<br/>\nJulie Bogart</div>","specialLinks":[]}],"prevTopicId":89805,"nextTopicId":89758}}