{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Brown","from":"Brown &lt;mjcmbrwn@...&gt;","replyTo":"LIST","senderId":"7EJKt1WIqvZvI83jH8_BREGoOZ-wUEM85rvGY3yNzpufO5U8AQrm3g9gQIjPCRtN_-hSTMlpvaYGieGz1ya2xU9E","spamInfo":{"isSpam":false,"reason":"0"},"subject":"from unschool grad","postDate":"955870635","msgId":8167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4Rjk2REE5Ljk1NkU3NjVBQGlodWcuY28ubno+","referencesHeader":"PDAwYTYwMWJmYTc2MyQyNGJlMTBhMCQ3NzcwM2ZkMUBkZWZhdWx0Pg=="},"prevInTopic":8165,"nextInTopic":0,"prevInTime":8166,"nextInTime":8168,"topicId":8165,"numMessagesInTopic":0,"msgSnippet":"Hi there, ... So, as a matter of interest, were you interested in these things back then? I know that some of the things I was interested in at that age","messageBody":"<div id=\"ygrps-yiv-1738547688\">Hi there,<br/>\n<br/>\nHafidha wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I only feel like I have a lot of catching up to do as an adult<br/>\n&gt; because there are a lot of things I have an interest in that I wish I<br/>\n&gt; already knew (e.g. Latin & piano) - and that I could have learned back<br/>\n&gt; then if I&#39;d known how to be diligent.<br/>\n<br/>\n </span></blockquote>So, as a matter of interest, were you interested in these things back then?<br/>\nI know that some of the things I was interested in at that age myself, I<br/>\nhave absolutely no interest in now, and the things I am interested in now,<br/>\nheld no attraction for me then.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My main suggestion to parents (and I don&#39;t intend this to<br/>\n&gt; be AT ALL accusatory)  is to really fight the urge to be lazy.<br/>\n<br/>\n </span></blockquote>What do you mean by lazy? If things are important enough to us, we will do<br/>\nthem. If they aren&#39;t important enough to do them willingly, then are they<br/>\nreally worth doing?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Make<br/>\n&gt; sure your kids are really learning and engaged in life - taking<br/>\n&gt; lessons, volunteering, getting outdoors, and developing skills;<br/>\n&gt; whether they&#39;re playing an instrument, re-enacting history, sewing,<br/>\n&gt; gardening, working on computers, fixing cars, or flying planes, they<br/>\n&gt; should be experiencing things and trying things out. We don&#39;t always<br/>\n&gt; have these opportunities as adults. (We should, but we don&#39;t.)<br/>\n<br/>\n </span></blockquote>No matter how many things we offer our kids, even if we have an endless<br/>\nmoney supply and endless time and energy available, there will still be<br/>\nthings they don&#39;t get to experience. I think that for many children today<br/>\n(adults too), who are incredibly busy, what they are really missing out on<br/>\nis time to reflect, time to dream, time to simply &#39;be&#39;. I&#39;m not trying to be<br/>\ncritical, because I too have seen kids who have very narrow lives and who<br/>\ndon&#39;t get to experience a wide enough - IMO - variety in their lives, but I<br/>\ndo think it is important not to swing the other way and burden our kids with<br/>\nso much &#39;opportunity&#39; that they never get to discover the world within<br/>\nthemselves.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling is only an advantage, I believe, when kids are MORE<br/>\n&gt; involved in life than they would be if they were in school. And when<br/>\n&gt; they are more in touch with themselves. I was VERY in touch with<br/>\n&gt; myself as an unschooling teen, but I wasn&#39;t immersed in life; that was<br/>\n&gt; a very serious inbalance, and seven years later it&#39;s something I&#39;m<br/>\n&gt; still trying to right.<br/>\n<br/>\n </span></blockquote>So I&#39;d agree with you here, but finding that balance is hard, and it is easy<br/>\nto react and swing the pendulum too far the other way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  There are so many things<br/>\n&gt; I want to do, that if one thing doesn&#39;t work out it just points me in<br/>\n&gt; another direction I was interested in anyway.<br/>\n<br/>\n </span></blockquote>Cool! Go for it :-)<br/>\n<br/>\nCarol</div>","specialLinks":[]},{"userId":0,"authorName":"Hafidha","from":"&quot;Hafidha&quot; &lt;hafidha@...&gt;","replyTo":"LIST","senderId":"4ZgcWuUF7-jqj-Y3AsbwK04VhpZgRWuII50EIu2ffSTqXkby9kumtp4TNO7xSGxM4OeCWbWZW5XqeD-T-N5cBVup","spamInfo":{"isSpam":false,"reason":"0"},"subject":"from unschool grad","postDate":"955862273","msgId":8165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTYwMWJmYTc2MyQyNGJlMTBhMCQ3NzcwM2ZkMUBkZWZhdWx0Pg=="},"prevInTopic":0,"nextInTopic":8167,"prevInTime":8164,"nextInTime":8166,"topicId":8165,"numMessagesInTopic":0,"msgSnippet":"Hello Jackie, Sonia, and Linda (and whoever else asked about being a former unschooler) Sorry for the delay in getting back to you about this. I wanted to ","messageBody":"<div id=\"ygrps-yiv-584840064\">Hello Jackie, Sonia, and Linda (and whoever else asked about being a<br/>\nformer unschooler)<br/>\n<br/>\nSorry for the delay in getting back to you about this. I wanted to<br/>\nrespond, but didn&#39;t quite know where to begin. I&#39;ll try now, but<br/>\nplease excuse me if this sounds scattered; it&#39;s late and it&#39;s been a<br/>\nlong day. This is kind of long (I&#39;m HORRIBLY longwinded).<br/>\n<br/>\nI didn&#39;t have the ideal home/unschooling experience. I was homeschool<br/>\nfrom the ages of 12 to 16. At times it was extremely dull and weeks<br/>\nwould go by when I don&#39;t think I did anything at all. My interaction<br/>\nwith other people (of any age) was pretty limited. I think sometimes<br/>\nmy parents didn&#39;t know what to do with me and my brothers. They are<br/>\nnot very structured or disciplined themselves, so they were not so<br/>\ngood about teaching us how to be. There was not much emphasis on<br/>\ndeveloping serious hobbies or interests or even our talents. Still,<br/>\nthey did the best they knew how, and I have no hard feelings towards<br/>\nthem. I only feel like I have a lot of catching up to do as an adult<br/>\nbecause there are a lot of things I have an interest in that I wish I<br/>\nalready knew (e.g. Latin & piano) - and that I could have learned back<br/>\nthen if I&#39;d known how to be diligent. Since the age of 16, I&#39;ve been<br/>\neither in college or working. I am trying to unschool myself now as an<br/>\nadult, and the hardest thing for me is just knowing how to *finish*<br/>\nthings. It&#39;s not easy to learn these skills when you&#39;re 20-something<br/>\n... and I&#39;m something of a dilettante by nature; *my* unschooling<br/>\nexperience probably reinforced that.<br/>\n<br/>\nDespite all that, I support other people&#39;s efforts to home/unschool, I<br/>\nbelieve in the philosophy and if I had children I would more than<br/>\nlikely unschool them.  I enjoy learning and would love to be able to<br/>\nspend time with my kid(s) everyday exploring the world and learning<br/>\nwith them. My main suggestion to parents (and I don&#39;t intend this to<br/>\nbe AT ALL accusatory)  is to really fight the urge to be lazy.  Make<br/>\nsure your kids are really learning and engaged in life - taking<br/>\nlessons, volunteering, getting outdoors, and developing skills;<br/>\nwhether they&#39;re playing an instrument, re-enacting history, sewing,<br/>\ngardening, working on computers, fixing cars, or flying planes, they<br/>\nshould be experiencing things and trying things out. We don&#39;t always<br/>\nhave these opportunities as adults. (We should, but we don&#39;t.)<br/>\n<br/>\nThe book Grace Llewellyn edited (I believe it&#39;s called &quot;Real Lives&quot;)<br/>\nthat featured essays by a dozen or so unschooling teens was excellent.<br/>\nUnschooling is only an advantage, I believe, when kids are MORE<br/>\ninvolved in life than they would be if they were in school. And when<br/>\nthey are more in touch with themselves. I was VERY in touch with<br/>\nmyself as an unschooling teen, but I wasn&#39;t immersed in life; that was<br/>\na very serious inbalance, and seven years later it&#39;s something I&#39;m<br/>\nstill trying to right.<br/>\n<br/>\nI think my parents keeping me out of school prevented me from being<br/>\noverly concerned with what other people think about me because when I<br/>\nfirst left school I was very, very easily hurt by others. I had low<br/>\nself esteem.  I got along with everyone, but was also easily<br/>\nintimidated and fearful of being disliked. To some degree it&#39;s part of<br/>\nmy personality to want to get along and avoid confrontation, but I<br/>\nthink my parents saw that school wasn&#39;t helping me in this regard;  I<br/>\ndo believe I&#39;m a much stronger-willed and independent person now than<br/>\nI would have been had I stayed in junior high.<br/>\n<br/>\nPerhaps the best thing about my parents&#39; decision to unschool is that<br/>\nit exposed me to various subcultures ... different way of looking at<br/>\nthings. I was alerted to alternative movements and ideas at a young<br/>\nage, and learned to view everything (especially mainstream lifestyle)<br/>\nwith some skepticism, to not believe everything I was told, and to<br/>\nquestion convention. I can say with a fair amount of certainty that<br/>\nhad I gone the normal schooling route I&#39;d be in the rat race with so<br/>\nmany other people, just trying to keep up with the Joneses, trying to<br/>\nappear impressive and accomplished, and not asking myself &quot;Why am I<br/>\ndoing this? Who am I doing this for?&quot;  There&#39;s a large part of me that<br/>\ncan be really uptight and conservative, so unschooling was a fantastic<br/>\ncounterbalance to that.<br/>\n<br/>\nIf I could go back 10 years and do things differently, I would have a<br/>\nmore active and fulfilling unschooling experience;  I wouldn&#39;t choose<br/>\nschool.  So that&#39;s that. I hope this answered your questions. Oh, and<br/>\nI&#39;m a pretty &#39;normal&#39; adult. I work for a utility company, make decent<br/>\nmoney, keep my own apartment, and have some friends. Still, I really<br/>\ndon&#39;t like this office work and plan to next year move to Spain to<br/>\nstudy Spanish for a year, and then who knows? There are so many things<br/>\nI want to do, that if one thing doesn&#39;t work out it just points me in<br/>\nanother direction I was interested in anyway.<br/>\n<br/>\nGnight,<br/>\nHafidha<br/>\n<br/>\nPortland, OR<br/>\n<br/>\n**********************************************************************<br/>\n*********************<br/>\n&quot;The trouble with modern education is you never know how ignorant<br/>\npeople are. With anyone over fifty you can be fairly confident what&#39;s<br/>\nbeen taught and what&#39;s been left out. But these young people have such<br/>\nan intelligent, knowledgeable surface, and then the crust suddenly<br/>\nbreaks and you look down into depths of confusion you didn&#39;t know<br/>\nexisted.&quot;<br/>\n~from Brideshead Revisited, Evelyn Waugh</div>","specialLinks":[]}],"prevTopicId":8163,"nextTopicId":8170}}