{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":346626599,"authorName":"Tina Boster","from":"&quot;Tina Boster&quot; &lt;tinaboster@...&gt;","profile":"guideforthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Much Ado about (Learning) Nothing....","postDate":"1246895854","msgId":46304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE1RTRBQTg2MDYzQzRBNzE5MEVFOUI2OUU5QzM1NzIyQFRpbmFQQz4="},"prevInTopic":46298,"nextInTopic":0,"prevInTime":46303,"nextInTime":46305,"topicId":46284,"numMessagesInTopic":0,"msgSnippet":"==== Did music and history need a teacher to teach them?   ==== Many years back I told someone that I taught math.  He replied with:  Oh, really.  What","messageBody":"<div id=\"ygrps-yiv-1206896095\">==== Did music and history need a teacher to teach them? &lt;bwg&gt;  ====<br/>\n<br/>\n <br/>\n<br/>\nMany years back I told someone that I taught math.  He replied with:  &quot;Oh,<br/>\nreally.  What do you teach math to do?&quot;  I got the point really quickly.<br/>\nThese days, I realize I don&#39;t actually teach anybody or anything (I<br/>\nattempted to train my dog, but that&#39;s a different story).  These days I<br/>\nprepare the environment and facilitate the learning process.<br/>\n<br/>\n <br/>\n<br/>\nTina<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Much Ado about (Learning) Nothing....","postDate":"1246822458","msgId":46298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNTEwMDNBLjMwNjAyMDdAbWFjLmNvbT4=","inReplyToHeader":"PGgycGRjYSs0dHFpQGVHcm91cHMuY29tPg==","referencesHeader":"PGgycGRjYSs0dHFpQGVHcm91cHMuY29tPg=="},"prevInTopic":46288,"nextInTopic":46304,"prevInTime":46297,"nextInTime":46299,"topicId":46284,"numMessagesInTopic":0,"msgSnippet":"... Not bad at ALL, Shannon - not bad at all. I enjoyed reading the whole thing. One thing I d say is to freely admit that our kids are missing out on some","messageBody":"<div id=\"ygrps-yiv-392199266\">On 7/4/2009 10:23 PM, Shannon D. Burton wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I now open the floor to more experienced or differing perspectives.  where did I go wrong?  Get it right?<br/>\n&gt;<br/>\n&gt; I really want to know, because someone put misleading comments about unschooling on my page, and as I am beginning to &quot;own&quot; our unschooling publicly, I want there to be a good, accurate, and thorough &quot;correction&quot; of the misassumptions.<br/>\n&gt;<br/>\n&gt; As I said in my replies, &quot;Thanks for playing!&quot;  =)<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Not bad at ALL, Shannon - not bad at all. I enjoyed reading the whole <br/>\nthing. One thing I&#39;d say is to freely admit that our kids are missing <br/>\nout on some things by not being enrolled in school. WE feel that what <br/>\nthey gain is far more valuable - we like the trade-off a lot, but it <br/>\ntakes the defensive steam out of some people&#39;s sails if you just admit <br/>\nthat right up front. &quot;There are things that happen in schools that are <br/>\ncool and our kids miss out on those things.&quot;<br/>\n<br/>\nAlso - my personal advice would be not to comment directly on the <br/>\nhostility that you sensed in one of the replies. Just be aware of it, <br/>\nbut respond to the words. If they are hostile enough that you no longer <br/>\nwant to engage with them - say that and cut them off. Otherwise, if <br/>\nyou&#39;re talking to a friend and want to continue to communicate, try not <br/>\nto put them on the defensive - give them a way out, the next post might <br/>\nhave been a lot less hostile, but you kind of backed the person into a <br/>\ncorner.<br/>\n<br/>\nBut, really, excellent responses.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Much Ado about (Learning) Nothing....","postDate":"1246799007","msgId":46288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGNzYzRUVCLUQ3Q0MtNDVBMS1BM0E0LUQ4NkIwMjhDOTQ5N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGgycGRjYSs0dHFpQGVHcm91cHMuY29tPg==","referencesHeader":"PGgycGRjYSs0dHFpQGVHcm91cHMuY29tPg=="},"prevInTopic":46284,"nextInTopic":46298,"prevInTime":46287,"nextInTime":46289,"topicId":46284,"numMessagesInTopic":0,"msgSnippet":"This is great!: -=-The idea of a Learn ... Read MoreNothing Day seems to have been made to teach that learning is an ongoing process.-=- While the discovery","messageBody":"<div id=\"ygrps-yiv-496525226\">This is great!:<br/>\n<br/>\n-=-The idea of a &quot;Learn ... Read MoreNothing Day&quot; seems to have been  <br/>\nmade to teach that learning is an ongoing process.-=-<br/>\n<br/>\nWhile the discovery that learning is inevitable causes laughter and  <br/>\npartying among unschoolers, the idea that unschoolers would try to  <br/>\nlearn nothing seems like beating one&#39;s head against the wall to an  <br/>\noutsider.<br/>\n<br/>\nA friend of mine wrote me a somber note last year about how it was a  <br/>\nwaste of a day not to learn when one had the opportunity to learn, or  <br/>\nsome such.  It&#39;s a good thing it was through e-mail and not in person,  <br/>\nbecause the, &quot;yeah, DUH!&quot; leapt out of me, but not into a return e-mail.<br/>\n<br/>\nOne thing you wrote is incorrect:<br/>\n<br/>\n-=-Teaching is passive, something done to someone. -=-<br/>\n<br/>\nI know the grammatical term &quot;passive&quot; is confusing, because &quot;to pass&quot;  <br/>\nis active (verbally speaking).<br/>\n<br/>\nBeing taught is passive.<br/>\n<br/>\nTeaching is an active verb.  Well, &quot;teaching&quot; is a gerund (&quot;the name  <br/>\nof an action&quot; is the way I see it, but the way I was &quot;taught&quot; was &quot;a  <br/>\nverb acting as a noun&quot; which is way more confusing).<br/>\n<br/>\n&quot;To teach&quot; is active, because it has an object.  Unless one is  <br/>\nspeaking of the teaching profession, and then I could say &quot;I taught.&quot;   <br/>\nAnd it means I used to be paid to teach professionally.  But to use  <br/>\nthe verb in its basic sense, it needs an object.   Now that I&#39;m  <br/>\nwriting it, I see how far its basic sense has been lost.<br/>\n<br/>\nIt should be<br/>\n<br/>\nI teach people<br/>\n<br/>\nyou teach people<br/>\n<br/>\nhe, she it teaches people<br/>\n<br/>\nwe teach people<br/>\n<br/>\nyou (pl) teach people<br/>\n<br/>\nthey teach people<br/>\n<br/>\n<br/>\n<br/>\nBecause of over a century of school-speak (in American English,  <br/>\nanyway), now there are these nonsense phrases:<br/>\n<br/>\nI teach English<br/>\n<br/>\nyou teach math<br/>\n<br/>\nhe, she, it teaches history<br/>\n<br/>\nwe teach science<br/>\n<br/>\nyou teach art<br/>\n<br/>\nthey teach music<br/>\n<br/>\nDid music and history need a teacher to teach them?  &lt;bwg&gt;<br/>\n<br/>\nI big-wide-grin, but don&#39;t put that question on your facebook, because  <br/>\nhostile schoolers will defend the need of math and English to be  <br/>\ntaught.  Many to most of them not only haven&#39;t thought about the ideas  <br/>\nof &quot;teaching&quot; and &quot;learning,&quot; but they haven&#39;t really thought about  <br/>\nwhat  history is in the real world, or English.  They think those live  <br/>\nin texbooks in school.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195268684,"authorName":"Shannon D. Burton","from":"&quot;Shannon D. Burton&quot; &lt;memismommy@...&gt;","profile":"memismommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Much Ado about (Learning) Nothing....","postDate":"1246771402","msgId":46284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgycGRjYSs0dHFpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46288,"prevInTime":46283,"nextInTime":46285,"topicId":46284,"numMessagesInTopic":0,"msgSnippet":"With thanks to Roxana and Pam for putting that wonderful title in my head and sharing the best scholarship essay I ve ever read! What follows is a recent","messageBody":"<div id=\"ygrps-yiv-1188691565\">With thanks to Roxana and Pam for putting that wonderful title in my head and sharing the best scholarship essay I&#39;ve ever read!<br/>\n<br/>\nWhat follows is a recent Facebook status update I posted, and the responses it engendered.  I&#39;m not going to comment, beyond what I posted there, other than to say that I tried to be clear, and know I failed in at least two places.<br/>\n<br/>\n GB (male friend) at 3:49am June 28<br/>\nAside from a sensory deprivation tank, you could watch a Beavis and Butthead cartoon marathon. Ren and Stimpy might also accomplish the same thing (or lack thereof). BTW don&#39;t really do those last two to your kids, would probably scar them for life!<br/>\n<br/>\nMS (female friend) at 7:00am June 28<br/>\ndo something that they are so familiar with that nothing new comes up. A movie they have seen before, lots of time at McD&#39;s playplace, a long drive in the car on a familiar route with a favorite cd...<br/>\n<br/>\nShannon Burton at 6:24pm June 28<br/>\nG - hmmmnnn ...I think they&#39;d&#39; be likely to learn what it might be like to live without one or more of their senses. and to listen to their thoughts, or realize that they&#39;re thinking, or how time can stretch without a reference point or how lonely or settled they might feel if completely alone, or what terror, hopelessness, peace and silence felt like.....or......<br/>\n<br/>\nGlad there&#39;s so much to learn there...no budget for the tank, anyway! =)<br/>\n<br/>\n<br/>\nShannon Burton at 6:28pm June 28<br/>\nBeavis and Butthead could at least teach them that some people have a very odd sense of humor...Eden has a cat named Stimpy with a deformed tail we&#39;ve talked about...<br/>\n<br/>\nWe haven&#39;t watched these, but Jim, Miah, and I like Family Guy. It&#39;s like theatre of the absurd in cartoon form....and sparks all kinds of discussions here....<br/>\n<br/>\nShannon Burton at 6:36pm June 28<br/>\nM - LOL! Lise has been watching the same Little Toot cartoon for a week and a half straight (30+ times, easy....).<br/>\n<br/>\nYesterday, out of the blue, she asked, &quot;mommy, what do trains use for gas?&quot; Later, it was whether dolphins could stand on their tales, and echolocation, and what a harbor is (she was surprised to know she&#39;s been to a harbor so often!), and whether typhoons are real and if there will be one here, and Jim and I seeing dolphins when we lived on Florida Bay,and the Magic Tree House research guide on dolphins and sharks....I think there was more, but my head is spinning....<br/>\n<br/>\n<br/>\n Shannon Burton at 6:45pm June 28<br/>\nThe playplace....new friends, kinesthetic and spatial skills, budget, nutrition, interpersonal skills, and that famous &quot;socialization&quot; they&#39;re reputedly lacking....lol!<br/>\n<br/>\nThe route...Lise memorizes all our regular routes with street names and landmarks....traffic, weather, conversation, sights seen along the way, signs...<br/>\n<br/>\nMusic CD...identifying artists and instruments, singing along, tempo, rhythm, mood, poetry, building vocabulary...<br/>\n<br/>\nWanna try again? Anyone else? Learn Nothing Day is July 24. =)<br/>\n<br/>\n MS at 12:05am June 29<br/>\nI know all the possibilities... learning nothing is just about impossible so thats why you need to shoot for what they already know<br/>\n<br/>\n Shannon Burton at 4:00pm June 29<br/>\nI don&#39;t think there is a &quot;just about impossible&quot;....I think it *is* an impossibility, to not learn. (and, really, that is the point of the experiment. It effectively silences any doubts that learning can happen out of schoolish situations, if one really dedicates oneself to the concept of learning nothing for an entire waking day...)<br/>\n<br/>\nBut thanks for playing, anyway.....I was hoping you would, because I knew you&#39;d take it seriously, and i know the atmosphere for learning you create...plus, we can&#39;t debate on a daily basis anymore, and I needed to do some mental gymnastics....lol!<br/>\n<br/>\nHappy Monday!<br/>\n<br/>\n<br/>\n EM (female friend since early childhood) at 11:23am July 3<br/>\nLearn nothing? You could send them to public school maybe? ;-) (just joking of course)<br/>\n<br/>\n<br/>\n Shannon Burton at 2:30pm July 3<br/>\nGood thing it&#39;s a joke....they would definitely learn in public school (or any school, really), if there were one open on July 24, which is Learn Nothing Day.<br/>\n<br/>\nThey would learn that you just can&#39;t walk away from school when you want, or go to the bathroom , or get a drink, or take off your shoes and socks to scratch your feet, or get up and do an experiment in the corner.<br/>\n<br/>\nthey&#39;d learn what it felt like to be separated from your family, to get up early even if they went to bed late, that one book (maybe, quite possibly, a boring text) was the ONLY one allowed for reading, and that Harry Potter, or book on Greek was forbidden....... Read More<br/>\n<br/>\nThat life is separated into subjects, things that need to be learned, and other things that are not important, no matter their personal interest.<br/>\n<br/>\nThat they are less people and more objects for pouring facts into, for being ordered around and punished if they don&#39;t comply....<br/>\n<br/>\n<br/>\n Shannon Burton at 2:36pm July 3<br/>\nthat children can and do form dangerous mobs sometimes, and that the adults can&#39;t or won&#39;t always protect them from this....<br/>\n<br/>\nThat speaking freely is not acceptable, that history is a boring series of dates and events rather than fascinating or mundane lives of everyday people, multifaceted and often erroneous, that computer games are not a blissful joy of discovery but a dangerous influence, that the score on a piece of paper measures their worth more than the content of their character, that reputation means far more than a personal sense of self-worth, that dogs and cats are not there to be played with, and no one will bring you a snack if you are hungry at an inconvenient time, that the clock rules their lives....<br/>\n<br/>\nI fear that&#39;s just the tip of THAT iceberg! wanna try again?! =)<br/>\n<br/>\nEden Mabee<br/>\n Eden Mabee at 3:56pm July 3<br/>\nI did read the thread here and the article, Dee. And we all know the sort of things one can learn in school. We did all go there. Hence the joke.<br/>\n<br/>\n*sighs*<br/>\n<br/>\nWhile you may not like those lessons, they do eventually have their place in many people&#39;s lives. And not all schools operate that way. Not the issue of course... The idea of a &quot;Learn ... Read MoreNothing Day&quot; seems to have been made to teach that learning is an ongoing process. Therefore, it seems silly to partake of such an event, since you are learning about not learning.<br/>\n<br/>\n Shannon Burton at 10:37pm July 3<br/>\nYou do seem to be taking this personally. You may not intend it, but you are coming across as though I personally attacked you and your choices.<br/>\n<br/>\nAs I did with G&#39;s post, and M&#39;s, I played devil&#39;s advocate on the premise. remember, I asked for help. I thought your offering, as theirs, was mine to do with as I pleased, and offered with a lifetime of friendship for the sake of my family&#39;s experiment.<br/>\n<br/>\nWas I wrong?... <br/>\n<br/>\nTo me, your last post seems a bit rude to put on my wall.<br/>\n<br/>\nIf my feelings about the benefits of school outweighed my trepidation of the potential for damage I see there, I wouldn&#39;t be unschooling. You know my beliefs. You also know I like a good debate.<br/>\n<br/>\nPerhaps, if you don&#39;t want to get a reply that&#39;s not in line with your beliefs, these would be good posts of mine for you to avoid (after all, you weren&#39;t tagged. You could have left well enough alone. As Chekov says in TWOK, &quot;You *know* vhat she&#39;ll say....&quot; =))<br/>\n<br/>\n<br/>\n EM at 10:55pm July 3<br/>\nI simply tried to point out that the concept of a No Learning day, given the philosophy of Unschooling (ie. that learning always is happening, whether we as parents guide it or not) was a bit like trying to break a wall by hitting it repeatedly with one&#39;s skull. Maybe not impossible, but not bloody likely... It doesn&#39;t seem very logical or ... Read Moresensible either.<br/>\n<br/>\nAs for my tone... It&#39;s tired. Just simply tired. I will say this, and use it as you will, I found your devil&#39;s advocate&#39;s view exceedingly vitriolic. While public school can be all you&#39;ve said, it isn&#39;t all bad either. It&#39;s like life, both good and bad. It&#39;s also neutral. Being used to a schedule can be annoying, but it&#39;s nice to know when to flip a steak so it won&#39;t burn. It&#39;s nice to know when one need&#39;s to check a patient&#39;s IV bags, or start preparing the ingredients so that the cake one wishes to make for a party will be done in time.<br/>\n<br/>\nIs it wrong to say that there are good things about those lessons too?<br/>\n<br/>\nShannon Burton<br/>\n Shannon Burton at 11:48pm July 3<br/>\nah....now I see. You have somehow misinterpreted the philosophy of unschooling.<br/>\n<br/>\nThe first premise is to deschool oneself (if one went to school of any sort, those conditioned thoughts need to be examined before unschooling can take hold.). The first things recommended by all those who have already raised their unschooling children is to excise words such as &quot;teach&quot; from one&#39;s vocabulary.<br/>\n<br/>\nTeaching is passive, something done to someone. A pouring in of ideas, facts, skills. Usually, based on a criteria of importance designed by someone other than the student. <br/>\n<br/>\nLearning is innate and organic. We are learning, even in the womb. We will learn, involuntarily, until we die. No avoiding it, unless the brain is simply shut down. Even dreams are the learning that occurs while we sleep.<br/>\n<br/>\nYou will never hear Sandra Dodd say that the point of *anything* is to teach something. Never, ever, ever (and did I say never?).<br/>\n<br/>\nShannon Burton<br/>\n Shannon Burton at 12:10am July 4<br/>\nNor is learning unguided. No. It is the entire family living and learning together, richly, joyfully, peacefully, and where everyone, even children, is treated with respect. Learning and passions are shared and honored. Parents facilitate their children&#39;s growth by modeling, by embracing life joyously themselves, filling their lives with beauty... Read More and possibility, and by allowing freedom of choice.<br/>\n<br/>\nAs for the lessons I picked (and I did say, tip of the iceberg), I based them on what *my* children, who have never been to school, would likely notice if they were compelled to go to school. They weren&#39;t vitriolic that I can see....it seems that you saw them as criticism of your choices...and they were not. It was a contrast of the freedom they have now, and what school might mean *to them* and that freedom.<br/>\n<br/>\nMost of these lessons sprang from an actual conversation Jeremiah and I had recently, where I explained some of the limitations of a school reality he doesn&#39;t understand....<br/>\n<br/>\n<br/>\n Shannon Burton at 12:28am July 4<br/>\nThe experiment isn&#39;t beating one&#39;s head against the wall, nor to show that learning is &#39;an ongoing process&#39;. &#39;An ongoing process&#39; is a very schooly term. Learning is incessant.<br/>\n<br/>\nIt is half a way to play....to let your mind go, brainstorm, consider as many angles as possible, or impossible. Sort of like writing fictional stories with abilities that don&#39;t exist in human nature. I willingly engage in the writing, so why *not* the experiment?<br/>\n<br/>\nTo me, it&#39;s just plain fun....Jeremiah&#39;s suggestion was to have &quot;Learn Extra Day!&quot; <br/>\n<br/>\nAs for school....I can see it as neutral for some. But not for *any* child who doesn&#39;t have the choice, each school day, to stay home. Because, if you don&#39;t have that choice, and you didn&#39;t want to go, you are being forced. Force isn&#39;t neutral. I personally do not like the feeling of being forced. Neither do either of my children.<br/>\n<br/>\nJeremiah can use the microwave, toaster oven, and his EasyBake oven (daddy&#39;s boy!) as long as I stay within earshot of him...<br/>\n<br/>\nShannon Burton at 12:48am July 4<br/>\nI showed him the toaster oven, verified he understood all safety precautions and the reasons for them. Same with the microwave. The EasyBake he figured himself by reading the instructions and experimenting.<br/>\n<br/>\nAs for schedules....Jeremiah is at his absolute best overnight. School would not be an annoying structure to him. It would completely interfere with his normal circadian rhythm, and he would be too exhausted to learn. That would certainly not be a neutral experience for him.<br/>\n<br/>\nAnd we would spend most of our waking hours apart, or dealing with school residuals, like homework, administration, toeing the line of the schedule, without choice. Jim would seldom see the kids, since their days off would not align. We are a family that thrives on independent but frequently intersecting orbits. We all treasure that (Jim and I did long before the children, too). School would interfere hugely with our orbits.<br/>\n<br/>\nI never intended to suggest that unschooling is for all families.<br/>\n<br/>\n<br/>\nI now open the floor to more experienced or differing perspectives.  where did I go wrong?  Get it right?<br/>\n<br/>\nI really want to know, because someone put misleading comments about unschooling on my page, and as I am beginning to &quot;own&quot; our unschooling publicly, I want there to be a good, accurate, and thorough &quot;correction&quot; of the misassumptions.<br/>\n<br/>\nAs I said in my replies, &quot;Thanks for playing!&quot;  =)<br/>\nPeace!<br/>\nShan</div>","specialLinks":[]}],"prevTopicId":46292,"nextTopicId":46305}}