{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":58541700,"authorName":"Betty Holder","from":"&quot;Betty Holder&quot; &lt;ninnyridge03@...&gt;","profile":"ninnyridge03","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Thanks for the help!!","postDate":"1022090475","msgId":37253,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDIwMWMyMDFiYSRhZmRmN2Y4MCRkOTlhZDU0M0BqMXUxdTI+"},"prevInTopic":0,"nextInTopic":37266,"prevInTime":37252,"nextInTime":37254,"topicId":37253,"numMessagesInTopic":0,"msgSnippet":"OK, I just wanted to say that I have been so inspired and rejuvenated by the responses and info that I get from this list.  Thanks to each of you.  Even the","messageBody":"<div id=\"ygrps-yiv-343357998\">OK, I just wanted to say that I have been so inspired and rejuvenated by the responses and info that I get from this list.  Thanks to each of you.  Even the sarcasm and defensiveness of some of the posts.  I learn from that.  OH, I learned a great deal from that!!!!  Thanks.<br/>\nI just wanted to comment on one comment that was made from another post.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;The sins and alleged damage TV will do should all apply to computers, too, as to physical cathode-ray-tube &quot;dangers.&quot;    Yet moms sit right next to computers and justify forbidding kids to sit six feet from televisions.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Now as some of you may remember I was the one who spouted off about and against TV a few days ago. &lt;g&gt;  I have been able to open my mind and see where I was coming from.  It was from a very negative situation with TV fom years ago.  My 14.5 yob loves certain things on TV and I have (since reading the comments on the list) ceased to restrict or forbid him access to it.  Which has resulted in his watching LESS.  Yesterday he turned OFF the TV when a program he usually watches came on to go do something else.  All on his own!  I&#39;m impressed with my ability to change horses in mid stream (as my grandfather used to say) &lt;BWG&gt;<br/>\nOn another topic:<br/>\nA few days ago someone mentioned whether or not to discuss unschooling with the kids.  I had never done that.  We just kinda drifted into unschooling from the stress of curriculum oriented homeschooling, because that approach was SOOO stressful for all of us, without ever talking about it.<br/>\nYesterday Josh and I were coming from town, (on our trips to town we always get a pizza and go to the park and eat it and watch the birds, squirrels, etc., and laugh about what he might be doing right then if he were in PS or if we were still doing the books and schedule thing.&lt;g&gt;)<br/>\nAnyway, I explained to him exactky how unschooling works and he got so excited about it.  I ask &quot;Do you think you will learn all you need to do whatever you want to do with your life if you choose what and when you learn?&quot;  He said, &quot;Of course I will, Mom!!!!!  Oh, Man this is cool!!  I love this!  I never knew you were willing to let me choose everything!!&quot;  He has talked non-stop about building and 8 cylinder engine from a junk yard.  (His thing is engines, classic cars and auto body repair and rebuilding).  He&#39;s almost obsessed with it.  So I guess our next venture will be to find just the right junk yard and just the right engine to build.  <br/>\nWe talked a lot about PS and how it was when he was a student there.  He was always so very unhappy going to school.  I was not strong enough, to go against what everyone else said was best for him, and NOT send him to school.  I will always regret that.<br/>\nHe has learned SOOOO much, from being free to learn,  that he would not have had an opportunity to explore if the state were choosing what he is to learn. <br/>\nHe also said, &quot;Mom, you know the thing public school doesn&#39;t teach is how to LIVE!  They just teach you all this stuff that you never use again but nothing about the things you will need.&quot;<br/>\nHe also has a friend that has changed so drastically since he has been in middle school.  His language, his attitude, his behavior all have taken a nosedive.  Josh said ,&quot;What he needs is to get away from those people and spend some quality time with somebody who doesn&#39;t think like that.&quot;<br/>\nAnd you know, I just thank God that Josh is not subject to this influence.  I like to think that my son would not give in and be swayed by peer pressure, but I&#39;m not so naive as to believe that.  Peer pressure carries a LOT of weight with kids.  That&#39;s another thing to be grateful for home/unschooling.<br/>\nWell, again I just want to say Thanks, to all of you for the great help you are to me and our US ventures. <br/>\n<br/>\nBetty<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Thanks for the help!!","postDate":"1022085016","msgId":37266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJiLjI3N2QwMjdiLjJhMWQyMTk4QGFvbC5jb20+"},"prevInTopic":37253,"nextInTopic":0,"prevInTime":37265,"nextInTime":37267,"topicId":37253,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/22/2002 8:02:46 AM Pacific Daylight Time, ... WOWIE - I m impressed too. It is so HARD sometimes to let go of old ways of seeing things","messageBody":"<div id=\"ygrps-yiv-1167491381\">In a message dated 5/22/2002 8:02:46 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ninnyridge03@...\">ninnyridge03@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m impressed with my ability to change horses in mid stream (as my <br/>\n&gt; grandfather used to say) &lt;BWG&gt;<br/>\n<br/>\n </span></blockquote>WOWIE - I&#39;m impressed too. It is so HARD sometimes to let go of old ways of <br/>\nseeing things and give something new a real try. Sometimes we&#39;re afraid that <br/>\nif we let go of that ONE thing, that our whole lives will come tumbling down. <br/>\n<br/>\n<br/>\nSandra used to remind us that it is perfectly safe to think dangerous <br/>\nthoughts. She suggested that if we were afraid, we could duct tape ourselves <br/>\nto a chair and ask a trusted friend to stand guard and we could just sit <br/>\nthere and purposely think all the thoughts that we were used to pushing away. <br/>\nShe promised we&#39;d come out of it still sitting there, in that chair, <br/>\nperfectly safe and that we could go on as if we&#39;d never thought those <br/>\nthoughts at all, if that&#39;s what we still wanted to do.<br/>\n<br/>\nIt is a funny image - but it SO radically freed me up to try out almost <br/>\nanything, in my own head. And as I did more and more of THAT, it made me able <br/>\nto try out lots of things I would not have been able or willing to try, <br/>\notherwise. And then THAT actual experience gave me confidence and trust that <br/>\nlet me try out other new ideas.<br/>\n<br/>\n--pamS<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":37265,"nextTopicId":37267}}