{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":61,"messages":[{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274376185","msgId":54339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M3I1cCtyajJnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2N0RDOUIwLTU2NUYtNERDOC1BMUVCLUMxMkNFNDIyQjFGMUBzdXBlbm4uY29tPg=="},"prevInTopic":54338,"nextInTopic":54340,"prevInTime":54338,"nextInTime":54340,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"== When she made comments suggesting that I do things differently with Eric (he was my only kid at the time), similar to your therapist telling you to put your","messageBody":"<div id=\"ygrps-yiv-1576352096\">== When she made comments suggesting that I do things differently with Eric (he was my only kid at the time), similar to your therapist telling you to put your kids to bed earlier, I just let it go. I didn&#39;t say, &quot;I don&#39;t do things that way,&quot; or lay out my reasons for not putting Eric in time-out or whatever. I just moved on.==<br/>\n<br/>\nThis is a find approach if you are the only one getting counseling. However, it won&#39;t work for a couple if both partners aren&#39;t on the same page. If I just let it roll off because it&#39;s not an option for me but my spouse takes it to heart, there will be even more problems at home within the marriage.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274375850","msgId":54338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M3FyYStqMzA1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU1NjJGRTY1LUFBMkQtNDExNC04RTU5LTAzRDVCOTBBQ0ZBOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":54336,"nextInTopic":54339,"prevInTime":54337,"nextInTime":54339,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"== Even with a bedtime, you wouldn t be able to turn the kids off like robots.  Parents would still be exhausted, and kids still wake up.== I know this from my","messageBody":"<div id=\"ygrps-yiv-1611448922\">== Even with a bedtime, you wouldn&#39;t be able to turn the kids off like robots.  Parents would still be exhausted, and kids still wake up.==<br/>\n<br/>\nI know this from my own experience and from listening to friends complain about bedtime. With my oldest, I worked and he went to school so we needed to be in bed by a certain time to make sure we got enough sleep for the next day. Also, as a single parent I thought I needed/deserved some quiet, alone time at night after my son was in bed. It rarely worked out that way even when I read to him or sat or laid down with him until he fell asleep. He almost invariably would be up at least once to go to the bathroom or need a drink of water or something. Sometimes he just didn&#39;t want to go to sleep and it became a huge power struggle and we were both miserable. I rarely got my extended period of quiet, alone time.<br/>\n<br/>\n==I don&#39;t think it&#39;s seen as a peripheral issue to counsellors.  The traditional schedule is kids in bed by 7:00, parents have two hours together.  If parents come and say &quot;we need more time together&quot; the counsellor will start with those assumed hours.==<br/>\n<br/>\nYep, that has been my experience. I&#39;ve never gone specifically for marriage counseling but my husband comes to counseling with me as often as he can. One of my husband&#39;s most important complaints is that we don&#39;t get that couples time with 3 kids. Bedtimes and date nights and the like always come up with the counselors. That&#39;s when I firmly say that&#39;s not an option for me because of whatever circumstances there may be at the time. If the counselor continues to push the issue, I just tell her (I tend to seek only female medical professionals) that I don&#39;t think things are working out and I&#39;m going to look for someone else.<br/>\n<br/>\nI should probably add that my husband understands that as the kids get older we do get more and more time for just the two of us if we are creative. The last time my husband was home we both were up in the morning before the kids and then for a little while when they were occupied with watching Saturday morning cartoons. My husband and I sat at the kitchen table and talked for about an hour. My husband commented that he would start making more of an effort to be available for such times, which previously he hadn&#39;t been because he&#39;d get up and get involved in something. So this is not an issue that is threatening our marriage. It&#39;s just something we want to improve upon.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274375566","msgId":54336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFRjZBQjMxLTNBQkQtNDEwMC05QkYzLThCMUY4ODVGMzY4NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0M3EwdStuZmoxQGVHcm91cHMuY29tPg==","referencesHeader":"PGh0M3EwdStuZmoxQGVHcm91cHMuY29tPg=="},"prevInTopic":54335,"nextInTopic":54338,"prevInTime":54335,"nextInTime":54337,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=- **I was at a loss of what to say, and got upset, told her I felt patronized, which in turn got her upset, and I feel it did not end well, that it ended","messageBody":"<div id=\"ygrps-yiv-660366933\">-=-&gt;**I was at a loss of what to say, and got upset, told her I felt  <br/>\npatronized,<br/>\nwhich in turn got her upset, and I feel it did not end well, that it  <br/>\nended with<br/>\nher being judgmental of me, and with me feeling defensive.**<br/>\n<br/>\n-=-If the therapist &quot;got upset&quot; and was &quot;judgmental&quot;, then it&#39;s time  <br/>\nto find someone who won&#39;t do these things when a client feels  <br/>\ndefensive or doesn&#39;t agree with the therapist&#39;s suggestions  <br/>\n(regardless of what we call it). -=-<br/>\n<br/>\n<br/>\nOr it&#39;s potentially even more useful to suggest that the original  <br/>\nposter could see the whole thing a different way.<br/>\n<br/>\nPerhaps the therapist wasn&#39;t so upset and judgmental as the client was  <br/>\nat a loss, and upset, and became confrontational.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274375006","msgId":54334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M3EwdStuZmoxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA0MEJEQkIxLTk5REQtNDVBRi1COEM1LTRENTIwQzE4QUNCRkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":54332,"nextInTopic":54335,"prevInTime":54333,"nextInTime":54335,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"... No, she won t. ... Probably not. ... which in turn got her upset, and I feel it did not end well, that it ended with her being judgmental of me, and with","messageBody":"<div id=\"ygrps-yiv-2064937426\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The therapist and her approach and her reactions are real.  She won&#39;t  <br/>\n&gt; change due to support or lack thereof on this list.  <br/>\n<br/>\n </span></blockquote>No, she won&#39;t. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She might not  <br/>\n&gt; change from a direct request from a client.<br/>\n<br/>\n </span></blockquote>Probably not.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We&#39;re not talking theoreticals here.  Someone has a pressing need.<br/>\n<br/>\n </span></blockquote>Exactly. This was the need stated:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;**I was at a loss of what to say, and got upset, told her I felt patronized,<br/>\n </span></blockquote>which in turn got her upset, and I feel it did not end well, that it ended with<br/>\nher being judgmental of me, and with me feeling defensive.**<br/>\n<br/>\nIf the therapist &quot;got upset&quot; and was &quot;judgmental&quot;, then it&#39;s time to find someone who won&#39;t do these things when a client feels defensive or doesn&#39;t agree with the therapist&#39;s suggestions (regardless of what we call it). <br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":125182846,"authorName":"alexandriapalonia","from":"&quot;alexandriapalonia&quot; &lt;alexandriapalonia@...&gt;","profile":"alexandriapalonia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274374423","msgId":54335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M3BlbityZzhrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":54334,"nextInTopic":54336,"prevInTime":54334,"nextInTime":54336,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"Assuming that your husband works fulltime outside the home, if your children aren t in bed at 8pm, when would you otherwise find time to communicate? In my own","messageBody":"<div id=\"ygrps-yiv-1881889671\">Assuming that your husband works fulltime outside the home, if your children aren&#39;t in bed at 8pm, when would you otherwise find time to communicate?<br/>\n<br/>\nIn my own life, my husband is generally out of the house and at work by 6 or 7am, and is often not home until 7pm.  This doesn&#39;t give us a lot of time together, and still less time together without our daughter.  If we needed more &quot;time to communicate [presumably without the children] ,&quot; we would need to carve out some time between 7pm and 5 or 6am . . . which, in our case, would probably be in the evening, since getting up any earlier would be physically hard on my husband.<br/>\n<br/>\nIf you were willing to get a babysitter, and to go out somewhere (or have the children go out with the sitter) to have &quot;time to communicate,&quot; the bedtime wouldn&#39;t be an issue, because you&#39;d be creating time alone for the communication.  This is a far more expensive solution, since one imagines you&#39;d need the babysitter every night for an extended period of time, which I imagine is why the counselor didn&#39;t suggest it (because it&#39;s likely cost-prohibitive, and she&#39;s interested in you having a longterm communication solution).  You could, as I think of it, get an evening nanny.  A live-in evening nanny would solve the physical end (providing care for the children while allowing the parents the freedom and flexibility to take whatever time in the evening, any evening, to work on their relationship without interruption).  <br/>\n<br/>\nBut I agree with Sandra -- it&#39;s better for children to have an artificially-imposed bedtime and two (hopefully happily) married parents than it is to stick to your no-bedtime-because-we-don&#39;t-have-to-get-up guns and a broken family.  <br/>\n<br/>\nAndrea<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Today, when the issue of my husband and I not having enough time to communicate came up, the counselor looked at me and said, very animatedly, that my children &quot;*need* to be in bed by X-o&#39;clock.&quot;  She knows that our children are being homeschooled, but does not know the specifics, and my hasty attempt at explaining to her that &quot;we do not have to wake up at six&#39;o&#39;clock, so we do not have to go to bed at eight&#39;o&#39;clock&quot; was received with &quot;so what?  they still need to be in bed at X-o&#39;clock.  it&#39;s about setting limits, and about you and your husband having time for each other.&quot;  <br/>\n&gt; Cristina<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274373152","msgId":54332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1RThEQjBDLTdGQ0QtNDA0OC1CM0FBLUUxNEY5MDI3NURGMUBzdXBlbm4uY29tPg==","inReplyToHeader":"PEZCOUI5NzczLTU4MzMtNEVGRC05NDIzLTYzMkM0MkEyNDRCNEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGh0M2pmMittY3FvQGVHcm91cHMuY29tPiA8RkI5Qjk3NzMtNTgzMy00RUZELTk0MjMtNjMyQzQyQTI0NEI0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":54331,"nextInTopic":54334,"prevInTime":54331,"nextInTime":54333,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"... Sometimes the best available solution _right_now_ is not the best solution forever, or the most ideal solution. That s often my response when people ask me","messageBody":"<div id=\"ygrps-yiv-1407479656\">On May 20, 2010, at 11:27 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The goal is to keep the marriage together.  If having the kids up so  <br/>\n&gt; much the parents don&#39;t get time alone is harming the marriage (IF  <br/>\n&gt; that&#39;s part of what&#39;s harming the marriage; we don&#39;t even need to  <br/>\n&gt; know, but can assume it might be), then that IS showing positive  <br/>\n&gt; regard, to suggest that something might help.<br/>\n<br/>\n </span></blockquote>Sometimes the best available solution _right_now_ is not the best solution forever, or the most ideal solution. That&#39;s often my response when people ask me if I don&#39;t feel like, I dunno, a cultural appropriator or culture-killer for adopting a black baby into a white family: Sure, it would be great if there had a been a stable black family available to take her. If such a family had been available, I am 100% sure the birthmother would have picked them instead of us. We were the best _available_ family. Maybe it&#39;s ideal for all black children to be placed with black families, but that is just not possible. We&#39;re the compromise; we&#39;re the just-good-enough solution. Much better than Yehva&#39;s other options, which were staying with a drug-addicted mother, or being raised in poverty by a relative like the birthmother&#39;s other kids, or being removed from her birthmother to foster care.<br/>\n<br/>\nIt might be possible that _right_now_ in the life of a family, getting the kids to bed earlier is the best available solution to the problem of parents needing time together. It might be helpful, and certainly in line with unschooling principles, to explore other options like having a babysitter and a date night, or the parents getting up a little earlier for a private breakfast together, or (something that has been a lifeline for me and David) IM-ing a lot during the day. But maybe the solution that comes closest to meeting everyone&#39;s needs is moving toward an earlier bedtime. Or maybe it&#39;s a triage situation: the marriage has to be saved before anything else can happen, akin to stopping the arterial bleeding and only then attending to the little cuts and bruises. Or maybe there&#39;s a husband or wife who needs to feel loved and valued before he/she can feel generous about giving more time and consideration to the kids...<br/>\n<br/>\nI almost replied to my own post about my experience with my therapist to say: On the other hand, it might be worth giving a couple of minute&#39;s thought to whether there is a kernel of truth in what the therapist is saying. Maybe not the blanket Kids Need to Be in Bed by Eight statement, but that getting kids to bed earlier should maybe not be dismissed out of hand. The word &quot;arbitrary&quot; hasn&#39;t come up here lately that I&#39;ve noticed, but it&#39;s useful to remember: unschooling doesn&#39;t necessarily mean No Limits, No Set Bedtime Ever, but something more like &quot;No Arbitrary Limits.&quot; Maybe there&#39;s a loving way to transition the kids to an earlier bedtime or an earlier &quot;in bed with something special but quiet to do&quot; time. <br/>\n<br/>\nWhen I was so sick for 18 months, I started seriously considering whether the kids would be better off in school. I&#39;m very committed to unschooling but had I not begun to improve a few months ago, school, with activities and resources, might have become a better choice than continuing to be at home with a sick, exhausted, discouraged mom.<br/>\n<br/>\nSu, mom to Eric, 8; Carl, 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274372540","msgId":54329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0MEJEQkIxLTk5REQtNDVBRi1COEM1LTRENTIwQzE4QUNCRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0M2x0dStuYmltQGVHcm91cHMuY29tPg==","referencesHeader":"PGh0M2x0dStuYmltQGVHcm91cHMuY29tPg=="},"prevInTopic":54328,"nextInTopic":54330,"prevInTime":54328,"nextInTime":54330,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=-Your arguments here almost sound like you are supporting the therapist and her approach and reactions, but I don t think that s your intention. Correct me","messageBody":"<div id=\"ygrps-yiv-2019409880\">-=-Your arguments here almost sound like you are supporting the  <br/>\ntherapist and her approach and reactions, but I don&#39;t think that&#39;s  <br/>\nyour intention. Correct me if I&#39;m wrong.-=-<br/>\n<br/>\nThis question is harsh.  I kept thinking about it after I responded.<br/>\n<br/>\nThe therapist and her approach and her reactions are real.  She won&#39;t  <br/>\nchange due to support or lack thereof on this list.  She might not  <br/>\nchange from a direct request from a client.<br/>\n<br/>\nWe&#39;re not talking theoreticals here.  Someone has a pressing need.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274372227","msgId":54331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3QkI5NjQ1LTZCMjktNEQ5OS1CNUIxLTI1NjM4M0I0RjVCOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0M2x0dStuYmltQGVHcm91cHMuY29tPg==","referencesHeader":"PGh0M2x0dStuYmltQGVHcm91cHMuY29tPg=="},"prevInTopic":54330,"nextInTopic":54332,"prevInTime":54330,"nextInTime":54332,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=-Your arguments here almost sound like you are supporting the therapist and her approach and reactions, but I don t think that s your intention. Correct me","messageBody":"<div id=\"ygrps-yiv-1043735255\">-=-Your arguments here almost sound like you are supporting the  <br/>\ntherapist and her approach and reactions, but I don&#39;t think that&#39;s  <br/>\nyour intention. Correct me if I&#39;m wrong.-=-<br/>\n<br/>\nI&#39;m trying to keep the discussion on the middle of the table where it  <br/>\ncan be looked at clearly.   It&#39;s easy to turn something into a protest  <br/>\nor pep rally and lose all sense of balance.<br/>\n<br/>\nExtreme advice based on ideal assumptions probably won&#39;t help keep the  <br/>\nmarriage together and help unschooling to thrive.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274372129","msgId":54328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyMkRCMUY1LTQxOUItNDBFQi04MzBFLTQxNkE1NEExOTBCN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0M2x0dStuYmltQGVHcm91cHMuY29tPg==","referencesHeader":"PGh0M2x0dStuYmltQGVHcm91cHMuY29tPg=="},"prevInTopic":54327,"nextInTopic":54329,"prevInTime":54327,"nextInTime":54329,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=-I suspect it is possible to say the hard things kindly, though, while showing positive regard for the poster.-=- Every member of the group is welcome to","messageBody":"<div id=\"ygrps-yiv-171942960\">-=-I suspect it is possible to say the hard things kindly, though,  <br/>\nwhile showing positive regard for the poster.-=-<br/>\n<br/>\nEvery member of the group is welcome to demonstrate that.<br/>\nNothing about the group guarantees that.<br/>\nThe purpose of the group stands.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274372072","msgId":54330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4OEM5NENBLUI3MDktNEUxMS05Njc3LUY3RjYwRERBRTI3NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0M2x0dStuYmltQGVHcm91cHMuY29tPg==","referencesHeader":"PGh0M2x0dStuYmltQGVHcm91cHMuY29tPg=="},"prevInTopic":54329,"nextInTopic":54331,"prevInTime":54329,"nextInTime":54331,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=-I know that you believe that it is because without a cohesive family unit, it will take unschooling out of the picture altogether (although I do know","messageBody":"<div id=\"ygrps-yiv-2110889047\">-=-I know that you believe that it is because without a cohesive  <br/>\nfamily unit, it will take unschooling out of the picture altogether  <br/>\n(although I do know several single parents who have found ways to have  <br/>\ntheir children learn at home or unschool, so it&#39;s not impossible). -=-<br/>\n<br/>\nSingle parents, yes.<br/>\nDivorced parents?<br/>\n<br/>\nThese several single parents you know... if any of them are divorced  <br/>\nand the divorce had anything to do with unschooling, are they still  <br/>\nunschooling?  Do you know any whose divorce had nothing to do with  <br/>\nunschooling at all, but still the unschooling was undone?<br/>\n<br/>\nI know one of the latter.  The dad was the most pro-homeschool of the  <br/>\ntwo.  He was the stay-at-home parent.  When they divorced, he had  <br/>\nnothing to use against the ex wife, so he went for the unschooling.   <br/>\nIt shocked everyone who knew them.  It made no sense.  But divorcing  <br/>\npeople, like wounded animals, put the claws and teeth out irrationally.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274371855","msgId":54327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3RUJFN0FGLTU0RDctNEUxOS1CNkM0LThGNTQ1NkMxQUIyRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0M2xncys0aWhhQGVHcm91cHMuY29tPg==","referencesHeader":"PGh0M2xncys0aWhhQGVHcm91cHMuY29tPg=="},"prevInTopic":54326,"nextInTopic":54328,"prevInTime":54326,"nextInTime":54328,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=From my experience, I think there are two things you can do. You can explain to this counselor that this is the way you do things and that you haven t come","messageBody":"<div id=\"ygrps-yiv-466360582\">-=From my experience, I think there are two things you can do. You can  <br/>\nexplain to this counselor that this is the way you do things and that  <br/>\nyou haven&#39;t come to her for parenting advice. Loan her some of the  <br/>\nbooks you&#39;ve read on this. Tell her that you expect her to respect you  <br/>\non this issue because there is no wiggle room.-=-<br/>\n<br/>\nIf I were the counsellor and a husband and wife were not agreeing  <br/>\nabout their child-rearing practices and the mother loaned me books and  <br/>\nsaid she expected me to respect that because there was no wiggle room,  <br/>\nI would point at THAT as a marriage problem.<br/>\n<br/>\nThere MUST be &quot;wiggle room.&quot;  Unless and until the parents together  <br/>\ndeclare &quot;no wiggle room,&quot; unschooling is NOT a done deal.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274370814","msgId":54326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M2x0dStuYmltQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZCOUI5NzczLTU4MzMtNEVGRC05NDIzLTYzMkM0MkEyNDRCNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":54325,"nextInTopic":54327,"prevInTime":54325,"nextInTime":54327,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"... A skilled therapist can do it. Surely it s possible to see two opposing view points at the same time and not take sides, yet help each party feel equally","messageBody":"<div id=\"ygrps-yiv-1580522765\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The client is a couple. If they don&#39;t agree, then how can positive  <br/>\n&gt; regard for both be foremost?<br/>\n<br/>\n </span></blockquote>A skilled therapist can do it. Surely it&#39;s possible to see two opposing view points at the same time and not take sides, yet help each party feel equally supported? Surely we do this with our kids all the time when they have a conflict or disagreement with each other?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The goal is to keep the marriage together.<br/>\n<br/>\n </span></blockquote>That&#39;s not always the goal of family counselling. It&#39;s not always in the best interests of all parties to keep the marriage together. I know that you believe that it is because without a cohesive family unit, it will take unschooling out of the picture altogether (although I do know several single parents who have found ways to have their children learn at home or unschool, so it&#39;s not impossible). <br/>\n<br/>\nThe client is not the marriage. The clients are the people who are working through their relationship. And they both deserve to be respected.<br/>\n<br/>\nYour arguments here almost sound like you are supporting the therapist and her approach and reactions, but I don&#39;t think that&#39;s your intention. Correct me if I&#39;m wrong.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But for unschooling to work, the parents need to be in agreement about  <br/>\n&gt; unschooling first.<br/>\n&gt; If unschooling is adversely affecting a marriage, the pro-unschooling  <br/>\n&gt; parent should back down some, or even all the way, rather than stand  <br/>\n&gt; by unschooling with the other partner as &quot;the enemy.&quot;<br/>\n<br/>\n </span></blockquote>Cristina never said that there was a disagreement about unschooling or parenting in the marriage (I missed it if she did). And we certainly don&#39;t need those details, but we are assuming quite a lot when we discuss this situation further without this information.<br/>\n<br/>\nThe situation, as I saw it, was that the therapist was imposing her p.o.v. about proper parenting practices (oooo, alliteration!) on the marital relationship, causing her client discomfort. <br/>\n<br/>\nIf there is a disagreement about parenting practices, then it certainly is something for the couple to sort out and yes, it may mean making some changes and compromises if both parties want the relationship to work. But it&#39;s not an all or nothing situation, surely.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sometimes people join this list and are cranky that they aren&#39;t shown  <br/>\n&gt; unconditional positive regard, as individuals, or for their  <br/>\n&gt; recommended or reported behavior.   The &quot;client&quot; of this list is  <br/>\n&gt; unschooling.  We&#39;re trying to support unschooling.  And in a case in  <br/>\n&gt; which a parent on this list is wanting us to approve or support  <br/>\n&gt; behavior that&#39;s making a child unhappy, we&#39;re likely to side with the  <br/>\n&gt; child.<br/>\n<br/>\n </span></blockquote>This list is quite different than a therapeutic relationship between a client and a counsellor. I&#39;m not sure the comparison carries well.<br/>\n<br/>\nBut I do agree that this list is not about supporting individual posters and is more about supporting the ideas and actions of unschooling.<br/>\n<br/>\nI suspect it is possible to say the hard things kindly, though, while showing positive regard for the poster.<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274370396","msgId":54325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M2xncys0aWhhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":54323,"nextInTopic":54326,"prevInTime":54324,"nextInTime":54326,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"I have been to many counselors over the years and have not yet come across one who understands or truly supports unschooling. That being said, I have found","messageBody":"<div id=\"ygrps-yiv-327961616\">I have been to many counselors over the years and have not yet come across one who understands or truly supports unschooling. That being said, I have found counselors who respect that this is the way I choose to care for my children. I have to be very firm that I&#39;m not interested in changing the way I do things with my children. Once they meet my children, they are very impressed. I usually get comments about how pleasant and intelligent and engaged my children are compared to other children that they see in their work.<br/>\n<br/>\nFrom my experience, I think there are two things you can do. You can explain to this counselor that this is the way you do things and that you haven&#39;t come to her for parenting advice. Loan her some of the books you&#39;ve read on this. Tell her that you expect her to respect you on this issue because there is no wiggle room.<br/>\n<br/>\nThe other thing you can do is try to find another counselor who&#39;s at least more understanding and respectful of your choices in this. I have found that licensed clinical social workers are a lot better at that then therapists, counselors, psychologists and psychiatrists.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage Counseling and Unschooling","postDate":"1274369686","msgId":54323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDRDQxRkVDLTEyODctNDcxNS1COEVCLTBFMTUwQzEwQTRBOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEU2N0RDOUIwLTU2NUYtNERDOC1BMUVCLUMxMkNFNDIyQjFGMUBzdXBlbm4uY29tPg==","referencesHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPiA8RTY3REM5QjAtNTY1Ri00REM4LUExRUItQzEyQ0U0MjJCMUYxQHN1cGVubi5jb20+"},"prevInTopic":54322,"nextInTopic":54325,"prevInTime":54322,"nextInTime":54324,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=-In your situation, I might have just replied, That may be harder than it sounds...I d like to talk about some other ideas, too, or, hmmm...OK. What else","messageBody":"<div id=\"ygrps-yiv-417199550\">-=-In your situation, I might have just replied, &quot;That may be harder  <br/>\nthan it sounds...I&#39;d like to talk about some other ideas, too,&quot; or,  <br/>\n&quot;hmmm...OK. What else could we also try?&quot; or let a moment of silence  <br/>\njust sit there and then started talking about whatever I needed to  <br/>\ntalk about. -=-<br/>\n<br/>\nIt depends what issue had been stated just before that advice.<br/>\n<br/>\nIf someone went in and said &quot;I have a gambling problem, and it&#39;s about  <br/>\nto cost my my marriage,&quot; and the counsellor said &quot;You need to destroy  <br/>\nyour casino cards, throw the mailing away when they arrive, and don&#39;t  <br/>\neven go to the casino&#39;s at all,&quot; if the person said &quot;hmmmm... OK.   <br/>\nWhat else could I also try?&quot;   that would seem to be a waste of money.<br/>\n<br/>\nI&#39;m not saying putting kids to bed is the only thing to try.  I&#39;m  <br/>\nsaying going to a mainstream marriage therapist is not likely to net a  <br/>\nperson an attachment parenting advisor.<br/>\n<br/>\nA friend of mine once asked me during a gathering (party or something,  <br/>\nbut several people in the room) to tell me why my chocolate chip  <br/>\ncookies were better than hers, and to tell me how I make them.<br/>\n<br/>\nI said, &quot;First, I use real butter...&quot; and I was cut off by her  <br/>\nlaughing and saying, &quot;Well I&#39;m not going to do that.  Then what?&quot;<br/>\n<br/>\nThen nothing.  She was using margarine and her cookies weren&#39;t  <br/>\nworking.  &quot;Then what&quot; was going to be to refrigerate the dough, but I  <br/>\ndidn&#39;t bother to finish, because she rejected the basis of the recipe.<br/>\n<br/>\nIf she had been paying by the hour, should I have slowly gone on  <br/>\nthrough the other steps, not believing it was going to help?  Some  <br/>\ncounsellors will; some won&#39;t.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274369276","msgId":54322,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCOUI5NzczLTU4MzMtNEVGRC05NDIzLTYzMkM0MkEyNDRCNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0M2pmMittY3FvQGVHcm91cHMuY29tPg==","referencesHeader":"PGh0M2pmMittY3FvQGVHcm91cHMuY29tPg=="},"prevInTopic":54320,"nextInTopic":54323,"prevInTime":54321,"nextInTime":54323,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=- Some specialize in recovery from substance ... Unconditional positive regard for the client, not the behaviour.-=- The client is a couple. If they don t","messageBody":"<div id=\"ygrps-yiv-556760425\">-=-&gt; Some specialize in recovery from substance<br/>\n<blockquote><span title=\"ireply\">  &gt; abuse (directly or indirectly) and are unlikely to show any<br/>\n &gt; unconditional positive regard for drug or alcohol use.<br/>\n<br/>\n </span></blockquote>Unconditional positive regard for the client, not the behaviour.-=-<br/>\n<br/>\nThe client is a couple. If they don&#39;t agree, then how can positive  <br/>\nregard for both be foremost?<br/>\nThe goal is to keep the marriage together.  If having the kids up so  <br/>\nmuch the parents don&#39;t get time alone is harming the marriage (IF  <br/>\nthat&#39;s part of what&#39;s harming the marriage; we don&#39;t even need to  <br/>\nknow, but can assume it might be), then that IS showing positive  <br/>\nregard, to suggest that something might help.<br/>\n<br/>\nSometimes people join this list and are cranky that they aren&#39;t shown  <br/>\nunconditional positive regard, as individuals, or for their  <br/>\nrecommended or reported behavior.   The &quot;client&quot; of this list is  <br/>\nunschooling.  We&#39;re trying to support unschooling.  And in a case in  <br/>\nwhich a parent on this list is wanting us to approve or support  <br/>\nbehavior that&#39;s making a child unhappy, we&#39;re likely to side with the  <br/>\nchild.<br/>\n<br/>\nBut for unschooling to work, the parents need to be in agreement about  <br/>\nunschooling first.<br/>\nIf unschooling is adversely affecting a marriage, the pro-unschooling  <br/>\nparent should back down some, or even all the way, rather than stand  <br/>\nby unschooling with the other partner as &quot;the enemy.&quot;<br/>\n<br/>\nIf I go out right now and buy myself a yacht, and then tell my husband  <br/>\n&quot;we own a yacht,&quot; or we own a contract to make payments on a yacht, he  <br/>\nwould surely object.  I might find myself without a yacht and without  <br/>\na husband.<br/>\n<br/>\nUnschooling can do that too.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274368290","msgId":54320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M2pmMittY3FvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYxMTZBNTNDLTA4NTMtNEU5Mi04ODE5LTRCNkZDREE4ODgxMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":54319,"nextInTopic":54322,"prevInTime":54319,"nextInTime":54321,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"You re right, Sandra. There are many approaches to the helping relationship. In the University grad level counselling program I know about, unconditional","messageBody":"<div id=\"ygrps-yiv-1415617577\">You&#39;re right, Sandra. There are many approaches to the helping relationship.<br/>\n<br/>\nIn the University grad level counselling program I know about, unconditional positive regard is considered to be the foundation of a healthy therapeutic relationship (and the roots of empathy), regardless of the counsellor&#39;s overall theoretical orientation (although most counsellors/psychotherapists I know use an eclectic approach). I&#39;m speaking from my personal experience.<br/>\n<br/>\nPsychiatry (where a lot of psychodynamic theory still lives) is a whole different kettle of fish.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Some specialize in recovery from substance  <br/>\n&gt; abuse (directly or indirectly) and are unlikely to show any  <br/>\n&gt; unconditional positive regard for drug or alcohol use.<br/>\n<br/>\n </span></blockquote>Unconditional positive regard for the client, not the behaviour.<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage Counseling and Unschooling","postDate":"1274367830","msgId":54319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2N0RDOUIwLTU2NUYtNERDOC1BMUVCLUMxMkNFNDIyQjFGMUBzdXBlbm4uY29tPg==","inReplyToHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg==","referencesHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":54318,"nextInTopic":54320,"prevInTime":54318,"nextInTime":54320,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"... A few years ago, I was seeing a therapist who was really helping me. I don t know why I was originally referred to her, because she specialized in","messageBody":"<div id=\"ygrps-yiv-1904534427\"><blockquote><span title=\"ireply\">&gt; My husband and I have been having difficulties in our marriage, so about five weeks ago we started seeing a counselor.  Today, when the issue of my husband and I not having enough time to communicate came up, the counselor looked at me and said, very animatedly, that my children &quot;*need* to be in bed by X-o&#39;clock.&quot; <br/>\n<br/>\n<br/>\n </span></blockquote>A few years ago, I was seeing a therapist who was really helping me. I don&#39;t know why I was originally referred to her, because she specialized in children, but she was great for me. She often worked with kids in our local public schools, and this colored her perspective in interesting ways--she really sees the problems that kids have in school, and on at least two occasions told me that I should under no circumstances let my kids attend the schools in our district, which are widely considered the best in the area, because of the very toxic student culture. At the same time, she had this huge blind spot of assuming that adapting to school was the kid&#39;s responsibility, and definitely had that &quot;school is like the weather--you can&#39;t avoid it&quot; mentality. She once told me that gifted kids are not going to get their needs met in school and they &quot;just have to learn to deal with boredom.&quot;<br/>\n<br/>\nWhen she made comments suggesting that I do things differently with Eric (he was my only kid at the time), similar to your therapist telling you to put your kids to bed earlier, I just let it go. I didn&#39;t say, &quot;I don&#39;t do things that way,&quot; or lay out my reasons for not putting Eric in time-out or whatever. I just moved on. She was helping me so much in other ways that I was not going to walk out over her expectation that I&#39;d be an &quot;authoritarian&quot; parent, setting limits for my kid in conventional ways, even when she was suggesting that as a solution to problems I was having.<br/>\n<br/>\nSo, for me, it was a matter of asking myself whether she was helping me enough that I could cope with the occasional comment or suggestion I wasn&#39;t comfortable with. She definitely was. If parenting issues had been more central to what I was dealing with, and we were having to discuss them all the time, that might have changed.<br/>\n<br/>\nYou have a more complicated situation because there are three of you in the room and you and your husband are not 100% in agreement. But for me with my therapist, it was helpful to remember that I did not have to defend every choice to her, and I didn&#39;t have to take every suggestion.<br/>\n<br/>\nIn your situation, I might have just replied, &quot;That may be harder than it sounds...I&#39;d like to talk about some other ideas, too,&quot; or, &quot;hmmm...OK. What else could we also try?&quot; or let a moment of silence just sit there and then started talking about whatever I needed to talk about.  It is possible to be helped very much by a therapist you don&#39;t agree with 100%, and I usually just let comments like that pass by without engaging them. If it were happening a lot, it might change the equation.<br/>\n<br/>\nYou said you weren&#39;t used to defending your parenting; one thing I&#39;ve gotten better at over the years is realizing I don&#39;t have to. Not everyone has to understand and approve of what we do. Recently, a mother of five kids told me, &quot;You need to crack down on Yehva, or she&#39;ll be completely out of control by the time she&#39;s six!&quot;<br/>\n<br/>\nI just said, &quot;We just don&#39;t think about kids that way at our house.&quot;<br/>\n<br/>\nShe repeated how important it was for me to &quot;discipline&quot; Yehva. I was upset and felt attacked, sure, but all I said was, &quot;Well, time will tell.&quot; I am always happy to answer questions asked in good faith, but I no longer feel the need to have everyone around me think I&#39;m doing the right thing.<br/>\n<br/>\nSu, mom to Eric, 8; Carl, 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274367190","msgId":54318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMTZBNTNDLTA4NTMtNEU5Mi04ODE5LTRCNkZDREE4ODgxMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0M2ducys2a29mQGVHcm91cHMuY29tPg==","referencesHeader":"PGh0M2ducys2a29mQGVHcm91cHMuY29tPg=="},"prevInTopic":54317,"nextInTopic":54319,"prevInTime":54317,"nextInTime":54319,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=-What happened to Unconditional Positive Regard (a la Carl Rogers) which is the foundation of any therapeutic relationship worth its salt?-=- This assumption","messageBody":"<div id=\"ygrps-yiv-757942266\">-=-What happened to Unconditional Positive Regard (a la Carl Rogers)  <br/>\nwhich is the foundation of any therapeutic relationship worth its  <br/>\nsalt?-=-<br/>\n<br/>\nThis assumption about how therapy will be seems more skewed than the  <br/>\ntherapist&#39;s assumption that a non-typical lifestyle is causing some of  <br/>\nthe marital problems.<br/>\n<br/>\nTherapy comes from different starting places, and not all are Carl  <br/>\nRogers.  Some involve the Bible.  Some involve a social-work point of  <br/>\nview.  There are still some Freudians around who want you to talk for  <br/>\nyears without feedback.  Some specialize in recovery from substance  <br/>\nabuse (directly or indirectly) and are unlikely to show any  <br/>\nunconditional positive regard for drug or alcohol use.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274366418","msgId":54317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M2hraSt0cHZoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrbVFaMTF0Yl90U0pDWmc3WERMVE9tYm9pSDJlNnRzSl9lUTJROEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":54316,"nextInTopic":54318,"prevInTime":54316,"nextInTime":54318,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"... The role of the therapist is to be a container for the client, not the other way around. If Cristina approaches her therapist like this (as it s a level","messageBody":"<div id=\"ygrps-yiv-393673330\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Vidyut Kale &lt;wide.aware@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Don&#39;t accuse, get defensive, angry, etc. Just accept that as a<br/>\n&gt; person, she feels strongly about her own beliefs and her involvement with<br/>\n&gt; your case makes it feel intimate and urgent that she do something if she<br/>\n&gt; feels that things are going on a track with potential for trouble. Its nice<br/>\n&gt; she&#39;s so involved and cares, but she could help more by helping the two of<br/>\n&gt; you learn to dialogue around issues.... blah,,, blah. <br/>\n<br/>\n </span></blockquote>The role of the therapist is to be a &quot;container&quot; for the client, not the other way around. If Cristina approaches her therapist like this (as it&#39;s a level of &quot;care-taking&quot;), it is a shift in roles and will muddy the client/counsellor relationship.<br/>\n<br/>\nIn technical terms, there may be some &quot;counter-transference&quot; going on for the therapist, so the whole &quot;unschooling&quot; factor is a non-issue in this situation. If the therapist can&#39;t take care of the counter-transference herself, it&#39;s not a healthy situation for the family to be in and will simply be a waste of money and time and emotional energy. If the therapist is aware of what happened for her, Cristina should be getting an apology call. If not, then I still say find someone who will support all the relationships in the family. <br/>\n<br/>\nMy husband and I have talked about people we know who leave their kids for extended holidays, etc. and we just don&#39;t get it. Sure, having younger children can put a stressor on the relationship, but so can finances, outside relationships, division of labour in the home, etc. But our family is our family and our marriage is about us, sure, but it&#39;s about us in the context of our family. Putting two of those family members to bed at a set time is not going to all of a sudden change the dynamics in our family. <br/>\n<br/>\nI&#39;m always surprised when I hear professionals go for &quot;simple&quot; solutions like this (as if they work). I know I shouldn&#39;t be surprised but I am.<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274365500","msgId":54316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M2ducys2a29mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":54315,"nextInTopic":54317,"prevInTime":54315,"nextInTime":54317,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"... In all seriousness, I believe you need a different marriage counsellor. Your children s bedtimes are not on the table. You marriage is. Also, I don t","messageBody":"<div id=\"ygrps-yiv-60528704\">Cristina wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;**&quot;so what?  they still need to be in bed at X-o&#39;clock.  it&#39;s about setting limits, and about you and your husband having time for each other.&quot;  She was adamant about this, and seemed judgmental about my parenting. **<br/>\n<br/>\n </span></blockquote>In all seriousness, I believe you need a different marriage counsellor.<br/>\n<br/>\nYour children&#39;s bedtimes are not on the table. You marriage is. Also, I don&#39;t believe that it&#39;s as simple as bundling the children off to bed and that will fix the marriage.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;**I was at a loss of what to say, and got upset, told her I felt patronized, which in turn got her upset, and I feel it did not end well, that it ended with her being judgmental of me, and with me feeling defensive.**<br/>\n<br/>\n </span></blockquote>Absolutely, you need to find a different therapist who supports &quot;attachment&quot; parenting, if  not unschooling. <br/>\n<br/>\nIf your husband isn&#39;t comfortable with the way the two of you are raising your kids, then a conversation about that is something a therapist can help mediate. But it&#39;s absolutely not her place to impose her values and judgements on your family life.<br/>\n<br/>\nWhat happened to Unconditional Positive Regard (a la Carl Rogers) which is the foundation of any therapeutic relationship worth its salt?<br/>\n<br/>\n- Rebecca (who hasn&#39;t read the other replies yet, in case I&#39;m saying what&#39;s already been said)</div>","specialLinks":[]},{"userId":235949630,"authorName":"jen","from":"&quot;jen&quot; &lt;jpsdahl@...&gt;","profile":"jpsdahl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274363442","msgId":54315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M2VuaStvb2ZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":54310,"nextInTopic":54316,"prevInTime":54314,"nextInTime":54316,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"Cristina, Maybe this counselor will realize that she has allowed her stuff to get in the way of the therapeutic relationship and she may back down. If she","messageBody":"<div id=\"ygrps-yiv-657910264\">Cristina,<br/>\n<br/>\nMaybe this counselor will realize that she has allowed her &quot;stuff&quot; to get in the way of the therapeutic relationship and she may back down. If she validates your experience of feeling patronized and can approach your parenting and homeschooling style with curiosity rather than with an authoritarian attitude than you might be able to work with her. If not I would not hesitate to move onto someone else. <br/>\n <br/>\nNot every counselor is a good fit for every couple. If you have options in your area I would encourage you to look into them. Finding a counselor that will support your family values could make all the difference in the effectiveness you and your husband will experience. It can take some searching to find the right fit. You and your husband could create a list of interview questions for any potential counselor that can help you decide if they are a good fit for your family. Shop around a little and do not be afraid to know something about the person you are going to be working with. <br/>\n<br/>\nI am currently finishing my Masters degree in Marriage and Family Therapy. I fully expect my future clients to interview me and to feel confident that we can work together within their value system. I would never want a client of mine to feel judged by me or patronized. If a client ever said that to me I would immediately back off and consider why I was coming off that way. I know it might be hard to think about starting over with someone new but it may be very worth while if you can find someone who can honor your families values. <br/>\n<br/>\nBest wishes to you and your family. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;nowanestof4&quot; &lt;dorina773@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello,<br/>\n&gt; <br/>\n&gt; We have been unschooling our 5yo daughter and soon-to-be 3yo son for one year now.  <br/>\n&gt; <br/>\n&gt; My husband and I have been having difficulties in our marriage, so about five weeks ago we started seeing a counselor.  Today, when the issue of my husband and I not having enough time to communicate came up, the counselor looked at me and said, very animatedly, that my children &quot;*need* to be in bed by X-o&#39;clock.&quot;  She knows that our children are being homeschooled, but does not know the specifics, and my hasty attempt at explaining to her that &quot;we do not have to wake up at six&#39;o&#39;clock, so we do not have to go to bed at eight&#39;o&#39;clock&quot; was received with &quot;so what?  they still need to be in bed at X-o&#39;clock.  it&#39;s about setting limits, and about you and your husband having time for each other.&quot;  She was adamant about this, and seemed judgmental about my parenting.  This completely threw me off, as I am not used to having to defend my parenting style, and hastily told her that it is the result of a lot of research, thinking, and soul-searching (not those exact words though).  I was at a loss of what to say, and got upset, told her I felt patronized, which in turn got her upset, and I feel it did not end well, that it ended with her being judgmental of me, and with me feeling defensive.<br/>\n&gt; <br/>\n&gt; I realize that my husband and I need to explain to her that this is how we have decided to raise our children, and that it should be respected, but I feel she is someone who thinks that there is one right way to do it, the one she approves of.  There is also the issue of my husband not being in agreement with some aspects of unschooling, and I fear that someone like her will support and further that.<br/>\n&gt; <br/>\n&gt; I would like to know if any of you have had experience with this kind of situation, and what your thoughts are.  If you need more specifics, in order to better understand the situation, I will try my best to provide them.  <br/>\n&gt; <br/>\n&gt; Thank you very much for your time,<br/>\n&gt; <br/>\n&gt; Cristina<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Marriage Counseling and Unschooling","postDate":"1274360896","msgId":54310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1NjJGRTY1LUFBMkQtNDExNC04RTU5LTAzRDVCOTBBQ0ZBOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0M2FraithNXR0QGVHcm91cHMuY29tPg==","referencesHeader":"PGh0M2FraithNXR0QGVHcm91cHMuY29tPg=="},"prevInTopic":54306,"nextInTopic":54315,"prevInTime":54309,"nextInTime":54311,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=- When we are all driving in the car is often a good time for a chat.-=- If the kids are asleep or otherwise occupied, that s fine, but my husband used to","messageBody":"<div id=\"ygrps-yiv-89722293\">-=- When we are all driving in the car is often a good time for a  <br/>\nchat.-=-<br/>\n<br/>\nIf the kids are asleep or otherwise occupied, that&#39;s fine, but my  <br/>\nhusband used to get in the car with my kids and maybe a friend or two  <br/>\nof theirs, and start talking to me about the details of committee  <br/>\npolitics where he works, or about car repairs in the distant future.   <br/>\nThat&#39;s not the best use of a car full of kids.  On a long trip maybe,  <br/>\npart of the time, but I remember LONG car trips with my parents where  <br/>\nthey talked and we were told to be quiet and it was none of our  <br/>\nbusiness.    I don&#39;t think that&#39;s happening, but it my &quot;what about the  <br/>\nkids?&quot; flag did spring up.<br/>\n<br/>\nANYone with young children is going to have issues.  &quot;I can totally  <br/>\nrelate to this as I also have a 5 year old and almost 3 year old. We  <br/>\nalso have never had set bedtimes, so my partner and I do not have a  <br/>\ngreat deal of time to ourselves. He rings me from work every day at  <br/>\nlunchtime, just so we can catch up on how each other&#39;s day is going.&quot;<br/>\n<br/>\nEven with a bedtime, you wouldn&#39;t be able to turn the kids off like  <br/>\nrobots.  Parents would still be exhausted, and kids still wake up.<br/>\n<br/>\n-=-My view on your counselor is that she should be helping you and  <br/>\nyour husband get to the heart of what is troubling your marriage, not  <br/>\nemphasising peripheral things like kids&#39; bedtimes.-=-<br/>\n<br/>\nI don&#39;t think it&#39;s seen as a peripheral issue to counsellors.  The  <br/>\ntraditional schedule is kids in bed by 7:00, parents have two hours  <br/>\ntogether.  If parents come and say &quot;we need more time together&quot; the  <br/>\ncounsellor will start with those assumed hours.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage Counseling and Unschooling","postDate":"1274360145","msgId":54306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4MTg1RkM1LTYyNEQtNDg2Ny1BRTU2LTY5RDY2M0RGNEVBMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlscGRkRXptX1lMTHZpakx1NXdkY0VJSWxCaWUtTjJqMGpjcTZvUEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPiA8QUFOTGtUaWttUVoxMXRiX3RTSkNaZzdYRExUT21ib2lIMmU2dHNKX2VRMlE4QG1haWwuZ21haWwuY29tPiA8QUFOTGtUaWxwZGRFem1fWUxMdmlqTHU1d2RjRUlJbEJpZS1OMmowamNxNm9QQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":54305,"nextInTopic":54310,"prevInTime":54305,"nextInTime":54307,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=-A useful way of establishing the boundaries may be to say something like The sleep timing is a part of a parenting and education system we follow with out","messageBody":"<div id=\"ygrps-yiv-2076095317\">-=-A useful way of establishing the boundaries may be to say something  <br/>\nlike<br/>\n&quot;The sleep timing is a part of a parenting and education system we  <br/>\nfollow<br/>\nwith out son. I&#39;m sure you&#39;ll find it interesting, since your work deals<br/>\nwith so much psychology. If you like, after the session, I can tell you<br/>\nabout it over a cup of coffee.&quot; Point being, you and your beliefs  <br/>\nmatter,<br/>\nbut don&#39;t bill us for it. Or, in other words, your problem with it is  <br/>\nnot a<br/>\npart of the dynamic between me and my husband and don&#39;t complicate  <br/>\nthings.-=-<br/>\n<br/>\nVidyut, this advice seems more likely to cause strife than peace, in  <br/>\nthe family that&#39;s asking and in others reading here.  Please think  <br/>\nmore broadly before you respond.  Sometimes it seems you&#39;re writing as  <br/>\nthough the counsellor were you, the mom were you, and the dad were  <br/>\nyou.  Sorry to be so blunt, but your advice is always quick and  <br/>\nstrong, but sometimes unstable in everyday situations.   If you were  <br/>\ngetting along really well with your own relatives, that would be a  <br/>\nbetter place from which to speak.<br/>\n<br/>\nAbout this you&#39;re wrong:  &quot; your problem with it is not a<br/>\npart of the dynamic between me and my husband and don&#39;t complicate  <br/>\nthings.&quot;<br/>\n<br/>\nHer problem with it is shared by just about 100% of the professionals  <br/>\nthey might see, and about that percentage of families around them.  So  <br/>\nthat IS part of the dynamic, if the husband isn&#39;t in favor of all of  <br/>\nunschooling as the mother sees it.<br/>\n<br/>\n-=-&quot;The sleep timing is a part of a parenting and education system we  <br/>\nfollow<br/>\nwith [our] son.&quot;-=-<br/>\n<br/>\nThen the counsellor can easily say that that parenting and education  <br/>\nsystem (being used with children who aren&#39;t school-age) is causing  <br/>\nproblems in the marriage.<br/>\n<br/>\nWhen marriages fall, unschooling almost always goes away.   This list  <br/>\nis for helping people understand unschooling in order to do it.   <br/>\nEncouraging any reckless behavior that can remove the ability to  <br/>\nunschool is a bad idea.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage Counseling and Unschooling","postDate":"1274359723","msgId":54305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNjA4MDMxLThENkMtNERBQi1BRkYyLTY0MEZEMjVFMzE1RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrbVFaMTF0Yl90U0pDWmc3WERMVE9tYm9pSDJlNnRzSl9lUTJROEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPiA8QUFOTGtUaWttUVoxMXRiX3RTSkNaZzdYRExUT21ib2lIMmU2dHNKX2VRMlE4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":54304,"nextInTopic":54306,"prevInTime":54304,"nextInTime":54306,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=- Basically, she s not evil, and nice that she cares, but you are paying the bill to get your work done, not hers.=- That sounds nice in theory, but going to","messageBody":"<div id=\"ygrps-yiv-43174292\">-=- Basically, she&#39;s not evil, and nice that she cares, but you are  <br/>\npaying the bill to get your work<br/>\ndone, not hers.=-<br/>\n<br/>\nThat sounds nice in theory, but going to a professional means  <br/>\naccepting, to some extent, the professional advice you&#39;re paying for.<br/>\n<br/>\nYou&#39;re paying the bill for that person&#39;s advice.  Even if she were  <br/>\nadvertised as a mediator rather than counsellor, she could still  <br/>\nmediate in her own preferred way.<br/>\n<br/>\n-=-It<br/>\nworks out better in the long run to work through it than change  <br/>\ncounsellors<br/>\nand begin from the beginning with a new person all over again.  <br/>\nOtherwise,<br/>\nyou simply end up paying for people to become acquainted with your  <br/>\ncase and<br/>\nleaving while you make a career out of explaining your life to them.  <br/>\nInsist<br/>\nthat professional boundaries be maintained, and use the service she  <br/>\noffers<br/>\nas intended.-=-<br/>\n<br/>\n&quot;It works out better&quot; is too strong a statement to make.  If a  <br/>\ncounsellor has no concept whatsoever of any alternative lifestyle,  <br/>\nthere&#39;s no sense trying to teach her.   And &quot;as intended&quot; at the end  <br/>\nof the passage above is a problem.  What the wife &quot;intends&quot; isn&#39;t even  <br/>\nwhat the husband intends, necessarily.<br/>\n<br/>\nIf they&#39;ve decided to go for help, one of them might be wanting  <br/>\nsomeone to slowly help untangle all issues, and the other might be  <br/>\nwanting to hire a tiebreaker.<br/>\n<br/>\n-=-You are not required to act on her wishes...-=-<br/>\n<br/>\nUnless the agreement in advance was that she was being used as a  <br/>\ntiebreaker.  Not that it&#39;s a good idea, but if the family is using  <br/>\nmoney that&#39;s putting more strain on the marriage, to ignore the  <br/>\ncounsellor would not improve the relationship.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage Counseling and Unschooling","postDate":"1274359358","msgId":54303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0NTNDRUQ2LUJCMkItNDRDOC1CMzIxLTZDNTVCODBBRDk1RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg==","referencesHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":54302,"nextInTopic":54304,"prevInTime":54302,"nextInTime":54304,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"-=-I realize that my husband and I need to explain to her that this is how we have decided to raise our children, and that it should be respected, but I feel","messageBody":"<div id=\"ygrps-yiv-79109699\">-=-I realize that my husband and I need to explain to her that this is  <br/>\nhow we have decided to raise our children, and that it should be  <br/>\nrespected, but I feel she is someone who thinks that there is one  <br/>\nright way to do it, the one she approves of. There is also the issue  <br/>\nof my husband not being in agreement with some aspects of unschooling,  <br/>\nand I fear that someone like her will support and further that.-=-<br/>\n<br/>\nI&#39;m going to start there, and not at your beginning.<br/>\n<br/>\nUnless your husband agrees with all aspects of unschooling, then that  <br/>\nis NOT how you (plural; you used &quot;we&quot;) have decided to raise your  <br/>\nchildren.<br/>\n<br/>\nIf you are making decisions your husband doesn&#39;t agree with, that will  <br/>\nharm the marriage.<br/>\n<br/>\nIt would be better to have a strong marriage with your children in  <br/>\nschool than to risk separation or divorce.<br/>\n<br/>\n-=-She was adamant about this, and seemed judgmental about my  <br/>\nparenting. This completely threw me off, as I am not used to having to  <br/>\ndefend my parenting style-=-<br/>\n<br/>\nI&#39;m surprised it threw you off.  I&#39;m surprised you didn&#39;t know before  <br/>\nyou went there that the result would be that.<br/>\n<br/>\nIf you&#39;re not used to having to defend your parenting style, it&#39;s  <br/>\nprobably because your children are so young.<br/>\n<br/>\n-=-There is also the issue of my husband not being in agreement with  <br/>\nsome aspects of unschooling, and I fear that someone like her will  <br/>\nsupport and further that.-=-<br/>\n<br/>\nIf your husband wants to unschool, the best thing to do is to get to  <br/>\nconferences quickly so he can hear speakers, meet older unschooled  <br/>\nkids, unschooling dads, and see families interacting.<br/>\n<br/>\nIf your husband does NOT want to unschool, the best thing to do is  <br/>\nback off of that until he might someday change his mind.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<br/>\nPam Sorooshian knows a consellor in California who might be able to  <br/>\nhelp, but it&#39;s not like every town has unschooling-friendly  <br/>\nprofessionals.   Not even every country!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":363518215,"authorName":"Claire","from":"&quot;Claire&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Marriage Counseling and Unschooling","postDate":"1274359251","msgId":54304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0M2FraithNXR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlscGRkRXptX1lMTHZpakx1NXdkY0VJSWxCaWUtTjJqMGpjcTZvUEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":54303,"nextInTopic":54305,"prevInTime":54303,"nextInTime":54305,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"... I can totally relate to this as I also have a 5 year old and almost 3 year old. We also have never had set bedtimes, so my partner and I do not have a","messageBody":"<div id=\"ygrps-yiv-466441258\">Cristina wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Today, when the issue of my husband and I not having enough time to &gt;&gt;communicate came up,... <br/>\n<br/>\n<br/>\n </span></blockquote>I can totally relate to this as I also have a 5 year old and almost 3 year old. We also have never had set bedtimes, so my partner and I do not have a great deal of time to ourselves. He rings me from work every day at lunchtime, just so we can catch up on how each other&#39;s day is going. I sometimes email him during the day with a cute story about what the kids are doing. I keep a diary recording snippets of what we do each day, and he enjoys reading this when he gets home from work. When we are all driving in the car is often a good time for a chat.<br/>\n<br/>\nBut with young kids, and living an unschooling lifestyle, communication between the parents is often going to be a bit piecemeal. That doesn&#39;t mean it can&#39;t be satisfactory communication, it depends on your expectations.<br/>\n<br/>\nThere are times when I feel like there is a gulf between my partner and I because we are both so busy in our separate spheres - I feel alone and under-appreciated. The best way for me to overcome these feelings is to reach out to him and try to re-connect, even if it is a quick cuddle on the couch or sharing a funny story.  Sex is a great way to re-connect too, but often there&#39;s not much time for that either!<br/>\n<br/>\nMy view on your counselor is that she should be helping you and your husband get to the heart of what is troubling your marriage, not emphasising peripheral things like kids&#39; bedtimes. What is really the issue here? (You don&#39;t have to answer here of course!) If your husband does have concerns about aspects of unschooling, take his concerns seriously, research a solid answer and present it to him as part of your ongoing dialogue about your unschooling life.<br/>\n<br/>\nI am completely convinced by all the good advice from the list that maintaining a good relationship with your partner is vital to unschooling. This thought has helped me many times to focus on all the good things about my partner, and to reach out to him with love and respect.<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":132859234,"authorName":"Paula Sjogerman","from":"Paula Sjogerman &lt;sjogy@...&gt;","profile":"psjogy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage Counseling and Unschooling","postDate":"1274359181","msgId":54302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBBOTBDRjJBLUVEMUQtNEJBQy1CMkFDLTYxOEFGNEI1NUVBMUBzYmNnbG9iYWwubmV0Pg==","inReplyToHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg==","referencesHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":54299,"nextInTopic":54303,"prevInTime":54301,"nextInTime":54303,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"... Find another counselor. You will never be comfortable with this one. Paula","messageBody":"<div id=\"ygrps-yiv-49754320\">On May 20, 2010, at 4:50 AM, nowanestof4 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would like to know if any of you have had experience with this kind of situation, and what your thoughts are. <br/>\n<br/>\n<br/>\n </span></blockquote>Find another counselor. You will never be comfortable with this one.<br/>\n<br/>\nPaula</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Marriage Counseling and Unschooling","postDate":"1274354624","msgId":54299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlscGRkRXptX1lMTHZpakx1NXdkY0VJSWxCaWUtTjJqMGpjcTZvUEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrbVFaMTF0Yl90U0pDWmc3WERMVE9tYm9pSDJlNnRzSl9lUTJROEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPgkgPEFBTkxrVGlrbVFaMTF0Yl90U0pDWmc3WERMVE9tYm9pSDJlNnRzSl9lUTJROEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":54298,"nextInTopic":54302,"prevInTime":54298,"nextInTime":54300,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"A useful way of establishing the boundaries may be to say something like The sleep timing is a part of a parenting and education system we follow with out","messageBody":"<div id=\"ygrps-yiv-1975254335\">A useful way of establishing the boundaries may be to say something like<br/>\n&quot;The sleep timing is a part of a parenting and education system we follow<br/>\nwith out son. I&#39;m sure you&#39;ll find it interesting, since your work deals<br/>\nwith so much psychology. If you like, after the session, I can tell you<br/>\nabout it over a cup of coffee.&quot; Point being, you and your beliefs matter,<br/>\nbut don&#39;t bill us for it. Or, in other words, your problem with it is not a<br/>\npart of the dynamic between me and my husband and don&#39;t complicate things.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Marriage Counseling and Unschooling","postDate":"1274354305","msgId":54298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrbVFaMTF0Yl90U0pDWmc3WERMVE9tYm9pSDJlNnRzSl9lUTJROEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg==","referencesHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":54297,"nextInTopic":54299,"prevInTime":54297,"nextInTime":54299,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"Hi Christina, Its wonderful that you are getting help for your marriage. The role of counsellors as change agents is often misunderstood. It is not her job to","messageBody":"<div id=\"ygrps-yiv-358775922\">Hi Christina,<br/>\n<br/>\nIts wonderful that you are getting help for your marriage.<br/>\n<br/>\nThe role of counsellors as change agents is often misunderstood. It is not<br/>\nher job to tell you what to do. It is to help the two of you find options.<br/>\nShe may make suggestions that she thinks are really important to try, but<br/>\nthey have no power beyond what you give them. This might help with the<br/>\ndefensiveness.<br/>\n<br/>\nI think it might be useful to see where your husband is on the issue of<br/>\nsleep times and speak directly with him in her presence and ask her<br/>\nassistance in facilitating the communication rather than specific action<br/>\nsuggestions. Most counsellors should be open to that, since it is what the<br/>\npassion for the work is all about anyway. You could even bluntly ask for her<br/>\nassistance in controlling her own emotions, since there are already two<br/>\nopinions feeling strongly on the subject, and her joining the fray will help<br/>\nno one. Don&#39;t accuse, get defensive, angry, etc. Just accept that as a<br/>\nperson, she feels strongly about her own beliefs and her involvement with<br/>\nyour case makes it feel intimate and urgent that she do something if she<br/>\nfeels that things are going on a track with potential for trouble. Its nice<br/>\nshe&#39;s so involved and cares, but she could help more by helping the two of<br/>\nyou learn to dialogue around issues.... blah,,, blah. Basically, she&#39;s not<br/>\nevil, and nice that she cares, but you are paying the bill to get your work<br/>\ndone, not hers.<br/>\n<br/>\nFor what its worth, relationships of any intimacy - whether with a<br/>\ncounsellor or husband will go through issues where there is disagreement. It<br/>\nworks out better in the long run to work through it than change counsellors<br/>\nand begin from the beginning with a new person all over again. Otherwise,<br/>\nyou simply end up paying for people to become acquainted with your case and<br/>\nleaving while you make a career out of explaining your life to them. Insist<br/>\nthat professional boundaries be maintained, and use the service she offers<br/>\nas intended. You are not required to act on her wishes or to provide her<br/>\ncoaching on different ways of life. Her business is the dynamics between the<br/>\ntwo of you, not specifics of decisions made - be it your child&#39;s sleep<br/>\ntimings or if you eat food with preservatives.<br/>\n<br/>\nhope this helps.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":348200559,"authorName":"nowanestof4","from":"&quot;nowanestof4&quot; &lt;dorina773@...&gt;","profile":"nowanestof4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Marriage Counseling and Unschooling","postDate":"1274349052","msgId":54297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh0MzBscytxdGF1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":54298,"prevInTime":54296,"nextInTime":54298,"topicId":54297,"numMessagesInTopic":0,"msgSnippet":"Hello, We have been unschooling our 5yo daughter and soon-to-be 3yo son for one year now. My husband and I have been having difficulties in our marriage, so","messageBody":"<div id=\"ygrps-yiv-672836054\">Hello,<br/>\n<br/>\nWe have been unschooling our 5yo daughter and soon-to-be 3yo son for one year now.  <br/>\n<br/>\nMy husband and I have been having difficulties in our marriage, so about five weeks ago we started seeing a counselor.  Today, when the issue of my husband and I not having enough time to communicate came up, the counselor looked at me and said, very animatedly, that my children &quot;*need* to be in bed by X-o&#39;clock.&quot;  She knows that our children are being homeschooled, but does not know the specifics, and my hasty attempt at explaining to her that &quot;we do not have to wake up at six&#39;o&#39;clock, so we do not have to go to bed at eight&#39;o&#39;clock&quot; was received with &quot;so what?  they still need to be in bed at X-o&#39;clock.  it&#39;s about setting limits, and about you and your husband having time for each other.&quot;  She was adamant about this, and seemed judgmental about my parenting.  This completely threw me off, as I am not used to having to defend my parenting style, and hastily told her that it is the result of a lot of research, thinking, and soul-searching (not those exact words though).  I was at a loss of what to say, and got upset, told her I felt patronized, which in turn got her upset, and I feel it did not end well, that it ended with her being judgmental of me, and with me feeling defensive.<br/>\n<br/>\nI realize that my husband and I need to explain to her that this is how we have decided to raise our children, and that it should be respected, but I feel she is someone who thinks that there is one right way to do it, the one she approves of.  There is also the issue of my husband not being in agreement with some aspects of unschooling, and I fear that someone like her will support and further that.<br/>\n<br/>\nI would like to know if any of you have had experience with this kind of situation, and what your thoughts are.  If you need more specifics, in order to better understand the situation, I will try my best to provide them.  <br/>\n<br/>\nThank you very much for your time,<br/>\n<br/>\nCristina</div>","specialLinks":[]}],"prevTopicId":54398,"nextTopicId":54403}}