{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":199737775,"authorName":"bookwood01","from":"&quot;bookwood01&quot; &lt;bookwood01@...&gt;","profile":"bookwood01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Taking things personally and dangerous thinking","postDate":"1108851317","msgId":103725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2OGRwbCtxM2VuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":103724,"nextInTime":103726,"topicId":103725,"numMessagesInTopic":0,"msgSnippet":"Hi... well, I wound up having more time on my hands then I planned on for the computer today. I have to tell you guys, if you do have your children take that","messageBody":"<div id=\"ygrps-yiv-2017702570\">Hi... well, I wound up having more time on my hands then I planned <br/>\non for the computer today. I have to tell you guys, if you do have <br/>\nyour children take that video game design course through The <br/>\nLearning Community Group... it takes forever to load the lessons if <br/>\nyou&#39;re dial up! My son is outside with his buddy waiting for the <br/>\nlesson to load! It takes a whole hour. So... if you have DSL, it <br/>\nwill run a lot faster until they change their program. Poor kid gets <br/>\nso frustrated with it.<br/>\n<br/>\nTo address taking things personally... Sorry if it sounds that way. <br/>\nI tend to write that way and I don&#39;t mean to cause any distress by <br/>\nit. I write from my vantage point and sometimes I have difficulty <br/>\nwriting to a group in a more general tone. Sorry about that. I have <br/>\nto work on getting out the kinks. But honestly, I wasn&#39;t taking <br/>\nthings personally, just passionately. Do you know what I mean? Sorry <br/>\nif it came out otherwise.<br/>\n<br/>\nAlso, I have trouble writing in between the paragraphs of the post. <br/>\nSomeone from the list contacted me saying it was difficult reading <br/>\nmy posts because the markings were not clear in which were mine and <br/>\nthat of others, I believe that is what she meant. I&#39;m going to try <br/>\nto write between paragraphs, I hope it works. Cross your fingers. <br/>\n<br/>\n<br/>\nGlad things went well for you, Susan - or at least that you didn&#39;t <br/>\nhave<br/>\nto stay overnight.<br/>\n<br/>\n***Thanks. Lots of pokes and prods. I hate that... but at least I&#39;m <br/>\nhome.<br/>\n<br/>\n<br/>\nI want to suggest to you that you take another deep breath (I&#39;m sure<br/>\nyou&#39;ve taken a few already &lt;g&gt;) and be really careful to not take<br/>\nanything said here in a personal way. You&#39;re NOT debating about <br/>\nwhether<br/>\nYOU are doing the right thing - nobody knows you, your life, your<br/>\npersonality, your family, your style, etc. The debates are all about<br/>\nideas - the &quot;idea&quot; of restricting television, the idea of an adult <br/>\nand<br/>\na child making a joint decision to limit something, the idea of &quot;not<br/>\nteaching,&quot; and so on.<br/>\n<br/>\nThe end of a discussion here can easily be - &quot;Well, this was a good<br/>\ndiscussion and I think I have a better understanding of what others<br/>\nthink about this.&quot; Or it could be, &quot;This has helped me gain a deeper<br/>\nunderstanding of my own reasons for my decision.&quot;<br/>\n<br/>\nThe end result of a discussion here does not need to be: &quot;Ah, you&#39;re<br/>\nright and I&#39;m going to change my ways.&quot;<br/>\n<br/>\n*** Yes, I do realize this. I think that the debates are very <br/>\ncathartic. They do help me see things from different angles and to <br/>\nreally think about what other folks have said. I think they are <br/>\nthought provoking and electric. And yes, I do have gained <br/>\nunderstanding in what other folks think about this topic. <br/>\n<br/>\n<br/>\n<br/>\nThe goal is analytical - it is to dig down deep into the ideas we <br/>\nhold<br/>\nand think about the basis of those ideas.<br/>\n<br/>\nIt truly isn&#39;t really to persuade you to change your mind as much as <br/>\nit<br/>\nis to provide a forum where you can, if you desire, stretch and open<br/>\nand try on thinking things in ways you haven&#39;t done.<br/>\n<br/>\nSandra used to have a talk she gave in which she told people they<br/>\nshould spend some time thinking dangerous thoughts. Think about <br/>\nthings<br/>\nin ways you don&#39;t usually. Let yourself be willing to think <br/>\nanything -<br/>\ndon&#39;t push any thought away, follow it, no matter what. She used to <br/>\nsay<br/>\nif it was too scary, that you could duct tape yourself to a chair and<br/>\nget somebody to act as a spotter - I really liked that image. But,<br/>\nreally, just thinking dangerous thoughts isn&#39;t dangerous - you can<br/>\nthink them and go on with life as is - you don&#39;t have to act on them.<br/>\n<br/>\n<br/>\n***I agree. Sometimes it is very frightening and I think that&#39;s why <br/>\nI like this group so much... because it pushes that in me. It does <br/>\ncause some uncomfortableness that is needed for change. It&#39;s the <br/>\nbeginning of growth. I was in a class that taught this through a <br/>\nchurch I was in a few years back. They would bring up &quot;hot topics&quot; <br/>\nand everyone would get into these discussions. Man, did the heat <br/>\nrise in this class. It was amazing. You would think everyone was <br/>\njust each other&#39;s enemies because we&#39;d all get so far into it it <br/>\nseemed as if everyone was ticked off at each other. When it was <br/>\ndone, we would talk, go out for a bite to eat, laugh and go home. A <br/>\nlot of times, we never knew what the other person had learned or <br/>\nthought about the group in the end... but one thing was for certain, <br/>\nwe all grew a little.<br/>\n<br/>\n<br/>\nThis is a list for pushing ourselves to think dangerous thoughts - <br/>\nand<br/>\nit can be uncomfortable and scary and the WORST is when somebody <br/>\nreally<br/>\ndoesn&#39;t want to, but they find themselves here being pushed to do it.<br/>\n<br/>\nBack then, I sat down with the purpose of just thinking dangerous<br/>\nthoughts for a while. I mean, I actually took time and sat in a chair<br/>\njust to sort of make myself think. For me, thinking dangerous <br/>\nthoughts<br/>\nworked like this: I&#39;d think, &quot;Well, what if it is true that tv is<br/>\naddicting and if I don&#39;t control them they&#39;ll be addicted and they&#39;ll<br/>\nbe couch potatoes and they&#39;ll all get fat and lazy and will be<br/>\ndepressed with no friends and never find a spouse and not get married<br/>\nand I&#39;ll have no grandchildren.&quot;<br/>\n<br/>\nOr - &quot;Well, what if tv is addicting and I control it and they don&#39;t<br/>\nlearn to control it themselves and then when they grow up and have<br/>\ntheir own place they get a tv and they just sit and watch all the <br/>\ntime<br/>\nand don&#39;t study for their college classes and can&#39;t graduate and<br/>\nthey&#39;re stuck in lousy jobs that they hate and they&#39;re miserable and<br/>\nthey blame me.&quot;<br/>\n<br/>\nThese are the kinds of trains of thought that I let myself think - <br/>\nkind<br/>\nof had to make myself think - because I naturally tended to think in<br/>\nmind-ruts - my mind just would go where it had always gone before - <br/>\nso<br/>\nI had to make myself take different turns and see where those went.<br/>\n<br/>\nSo - here on this list - we&#39;re doing it together - in writing - with<br/>\n1600+ strangers watching. Gosh, does this make anybody nervous? It is<br/>\nsort of the amazing power of the internet that we can exchange ideas <br/>\nin<br/>\nsuch a public way and yet keep our privacy at the same time. Cool for<br/>\nsome. Too freaky for others.<br/>\n<br/>\n<br/>\n***And how do you balance that? The public/private? Too little <br/>\ninformation doesn&#39;t let people know what is going on behind your <br/>\nthinking... too much information may be deemed to personal or too <br/>\ndangerous in revealing who you are. How do you balance that? How do <br/>\nyou take those steps to secure yourself and yet enter into contact <br/>\nwith others that contains meaningful conversation? <br/>\n<br/>\nThat is something I&#39;d be interested in learning... how do you all <br/>\nbalance that out?<br/>\n<br/>\nPeace and Good Will ;-) <br/>\n<br/>\nSusan (The lady who don&#39;t know when to quit!) LOL<br/>\n-pam</div>","specialLinks":[]}],"prevTopicId":103722,"nextTopicId":103747}}