{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fighting kids again","postDate":"1019913199","msgId":6422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE3LjFmYWQzMGRlLjI5ZmJmZGVmQGNzLmNvbT4="},"prevInTopic":6421,"nextInTopic":0,"prevInTime":6421,"nextInTime":6423,"topicId":6418,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/27/02 12:59:15 AM Central Daylight Time, AlwaysLearning@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-568721707\">In a message dated 4/27/02 12:59:15 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; I would TELL mine to stop.  I have sometimes had to tell one of my kids <br/>\nthat <br/>\n it is my job as a mom to see that ALL my kids are safe from meanness, <br/>\n especially in their own home, from ANYONE, and that means them too. &gt;&gt;<br/>\n<br/>\nI have said this also.....but not always in the tone I should.<br/>\nMy two older boys love to play legos and having a four yo sister with them <br/>\njust isn&#39;t much fun. She definitely doesn&#39;t play the same way they <br/>\nlike....but she adores her older brothers and legos.<br/>\nSo I&#39;ve asked them to give me a &quot;heads up&quot; when they want to be left alone so <br/>\nI have time to adjust my activities to do something cool with her.<br/>\nThey still don&#39;t always let me know and often she is left out. It&#39;s very <br/>\nfrustrating.<br/>\nBut as we dialogue about how it would feel to be the only one left out and <br/>\nhow to adjust to accomodate everyone, it keeps getting better.<br/>\nI really love your thoughts on taking the child that got left out, to do <br/>\nsomething really neat away from the house Sandra.<br/>\nThis would really work well here I think, because the boys love getting out, <br/>\nso they&#39;d probably see very quick that it&#39;s beneficial to us all to include <br/>\nher, and they&#39;re old enough for me to leave alone long enough to go do <br/>\nsomething with her.<br/>\nThanks for some more useful thoughts on the sibling rivalry issues!!<br/>\nRen</div>","specialLinks":[]},{"userId":69247285,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","profile":"bearspawprint","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Fighting kids again","postDate":"1019859603","msgId":6421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNDI2MjIyMDAzLjI2Mzc4LnFtYWlsQHdlYjE0MzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDZlLjFiYWExMzZhLjI5ZmFiNjNhQGFvbC5jb20+"},"prevInTopic":6420,"nextInTopic":6422,"prevInTime":6420,"nextInTime":6422,"topicId":6418,"numMessagesInTopic":0,"msgSnippet":"... My oldest, David, has November 2 for his birthday. His Aunt Arlene, is also November 2. My DH s birthday is November 1, his father s is November 1. All","messageBody":"<div id=\"ygrps-yiv-1171382942\"><blockquote><span title=\"ireply\">&gt; he&#39;ll say, kinda to the <br/>\n&gt; sky, &quot;On November 2, when I&#39;m 21, I think I&#39;ll be in<br/>\n&gt; Europe&quot; or something.<br/>\n&gt; <br/>\n </span></blockquote>My oldest, David, has November 2 for his birthday. His<br/>\nAunt Arlene, is also November 2. My DH&#39;s birthday is<br/>\nNovember 1, his father&#39;s is November 1. <br/>\n<br/>\nAll Hallows and All Saints.<br/>\n<br/>\nSharon of the Swamp<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Games - play chess, backgammon, pool and more<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://games.yahoo.com/\">http://games.yahoo.com/</a></div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Fighting kids again","postDate":"1019846834","msgId":6420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNDI2LjExNDg0OS4tMzY2MjE5LjEuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":6419,"nextInTopic":6421,"prevInTime":6419,"nextInTime":6421,"topicId":6418,"numMessagesInTopic":0,"msgSnippet":"On Fri, 26 Apr 2002 05:21:56 -0700 Mary Hickman  ... I remember 7 as being a pretty literal year for a lot of kids. That was the year","messageBody":"<div id=\"ygrps-yiv-588343223\">On Fri, 26 Apr 2002 05:21:56 -0700 &quot;Mary Hickman&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mfhick@...\">mfhick@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt; I ask 7 and 17 year old why he can not be it and  they <br/>\n&gt; continue to say you have to spell. Haven&#39;t I taught my daughter, 7,  to<br/>\n<br/>\n&gt; pretend and have fun. It does not matter what the rules are, a 5 <br/>\n&gt; year old  can and should be it next in a cooperative situation. <br/>\n<br/>\n </span></blockquote>I remember 7 as being a pretty literal year for a lot of kids. That was<br/>\nthe year that &quot;following the rules&quot; in games became important, that was<br/>\nthe year it was really hard for my daughter to handle a 5 year old<br/>\n&quot;goalie&quot; picking up a ball while outside the goal box, and that was the<br/>\nonly year they actually made goal boxes. I&#39;m assuming that, if one<br/>\nfollowed the rules of the game, &quot;it needed to spell, and 5 yr old<br/>\ncouldn&#39;t. You can say that rules don&#39;t matter, but maybe to her they<br/>\ndo... I think to a lot of 7 yr olds they do. Maybe that game isn&#39;t a good<br/>\none for playing in a group that includes 5 yr old.<br/>\n<br/>\nI&#39;m assuming 17 yr old was supposed to be supervising kids while you ran<br/>\nthe meeting? I would be much more concerned about 17 yr old&#39;s lack of<br/>\nskills in dealing with the situation. There are a lot of other options -<br/>\nplaying a round of another game where 5 yr old could really be &quot;it&quot;,<br/>\nplaying with the 5 and 17 yr olds on a team as &quot;it&quot;, and probably more,<br/>\ndepending on the rules of the game... most 17 yr olds I know would be<br/>\nable to think of some.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m floored, <br/>\n&gt; feeling <br/>\n&gt; like I handled myself poorly. I do not feel either my daughter or <br/>\n&gt; our friend <br/>\n&gt; understood how cold they were by simply insisting a certain level of <br/>\n&gt; mastery <br/>\n&gt; to be considered it.<br/>\n<br/>\n </span></blockquote>I always relate to the older kid more easily, because I am one... it&#39;s<br/>\nhard sometimes to have to slow down and include someone whose skills<br/>\naren&#39;t where yours are. It&#39;s hard when it feels one-sided, when you&#39;re<br/>\nalways adapting for him and he never has to slow down and wait for you. I<br/>\nthink often we expect a lot from older kids, and somehow the older one<br/>\nalways seems so much older and bigger and wiser, and then the younger kid<br/>\ngets there and suddenly 7 seems so little...<br/>\n<br/>\nI can see both kids&#39; POVs. It&#39;s hard to get left out because you&#39;re<br/>\nlittler and can&#39;t do something yet, it&#39;s hard to have to adapt and change<br/>\nwhat you really want to do because someone else can&#39;t keep up. I guess I<br/>\nwould try to keep *both* kids&#39; needs in mind. It sounds like you have a<br/>\ngood handle on what your son is needing and not getting, but it&#39;s harder<br/>\nfor you to hear what your daughter is needing and not getting. Maybe it<br/>\nwould help to differentiate activities at the beginning - our homeschool<br/>\ngroup had a &quot;you can&#39;t say you can&#39;t play&quot; rule, so Cacie was used to<br/>\nadapting games there for all different levels of skill - it was<br/>\nfrustrating sometimes, but it worked out. OTOH, there were times that<br/>\nwere clearly big-kid times, like the group&#39;s Writer&#39;s Workshop, and kids<br/>\nwho weren&#39;t reading and writing had a brief time to share their dictated<br/>\npieces but were otherwise not included.... and that was okay. <br/>\n<br/>\nI would think that playing together when you&#39;re trying to lead a meeting<br/>\nwould be an &quot;everyone&#39;s included&quot; time, and maybe making that clear from <br/>\nthe get-go would help. As far as clubs - some &quot;clubs&quot; Cacie did at 7 were<br/>\ninclusive, and included little brothers (the weird things for sale one<br/>\nwas inclusive, ASAIK it was mostly about making signs to sell things like<br/>\n&quot;wee-wees&quot;), but some didn&#39;t. The club where they talked breathily about<br/>\nsaving the environment and the lovely fields of wildflowers was private,<br/>\nbecause I think they were exploring some deeper ideas and wanted to have<br/>\nlong, drawn-out conversations, and didn&#39;t want the little guys bouncing<br/>\naround asking if they could all play Speed Racer now. Actually, chosing<br/>\nto have a meeting while 5 yr old had another activity going on sounds<br/>\npretty thoughtful, rather than chosing to have meeting while he was<br/>\naround but not including him...<br/>\n<br/>\nI guess it sounds to me like your daughter is really trying to<br/>\nindividuate, to get some space of her own. Perhaps part of correcting him<br/>\nand putting him down is a desire to make it clear that she is growing up,<br/>\nthat she is different than the way she was (and he is) at 5. Maybe some<br/>\nspecial activities for her would help, things that only she can do, so<br/>\nthat she feels more secure about where she is... I think that would help<br/>\nher to be able to see her brother as less of a threat, and then be kinder<br/>\nto him. I liked baking cookies for my brother in my Easy Bake Oven when I<br/>\nwas 7 and he was 5... he couldn&#39;t bake them himself, that was something<br/>\nonly I was able to do, so I baked and fed him, and we were both happy. I<br/>\nwas also the only kid allowed to use my dad&#39;s record player, because I<br/>\nhad much better fine-motor skills... so if my mom was busy, I could offer<br/>\nto play records for him, and we would dance... he was happy because I was<br/>\nincluding him and it was fun, and I was happy because I had a more<br/>\n&quot;adult&quot; role in the whole process. I guess it would have been a problem<br/>\nif I had been mean about it (&quot;I can touch the record player and you<br/>\ncan&#39;t&quot;) but I never was, somehow, and I imagine that if I had, my mom<br/>\nwould have decided to come and hang out with us for a while and put on<br/>\nrecords for him, which wouldn&#39;t have given me what I wanted / needed. <br/>\n<br/>\nThat&#39;s really what it&#39;s about, I think. What is everyone needing that he<br/>\nisn&#39;t getting?<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Fighting kids again","postDate":"1019829306","msgId":6419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZlLjFiYWExMzZhLjI5ZmFiNjNhQGFvbC5jb20+"},"prevInTopic":6418,"nextInTopic":6420,"prevInTime":6418,"nextInTime":6420,"topicId":6418,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/26/02 6:24:41 AM, mfhick@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-707409572\">In a message dated 4/26/02 6:24:41 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mfhick@...\">mfhick@...</a> writes:<br/>\n<br/>\n&lt;&lt; Now my question, how can I politely show how cold the girls were without <br/>\ntearing them down. &gt;&gt;<br/>\n<br/>\nSome mom-messages which have sunk in here (but we did start early): <br/>\n<br/>\n<br/>\nYou need to find a way to do something that can include everybody.<br/>\n<br/>\n&lt;&lt;I want to yell at my daughter for being so cruel. She <br/>\nis cold almost all the time to her brother. I want to force her to sit in <br/>\nher room and not play outside with her friends.&gt;&gt;<br/>\n<br/>\nThe things you want to do are things she seems to have been doing.  Is it <br/>\npossible that you&#39;ve yelled and forced before, and she&#39;s just passing it on?<br/>\n<br/>\n&lt;&lt; She corrects <br/>\nhim constantly, even though I have repeatedly asked her to stop. &gt;&gt;<br/>\n<br/>\nI would TELL mine to stop.  I have sometimes had to tell one of my kids that <br/>\nit is my job as a mom to see that ALL my kids are safe from meanness, <br/>\nespecially in their own home, from ANYONE, and that means them too.  I&#39;ve <br/>\nsaid if we had company treating one of them that way that I would ask them to <br/>\nleave.  I can&#39;t ask my own kids to leave, but I can tell them that that <br/>\nbehavior is NOT allowed in my house toward any of my children by ANYone.<br/>\n<br/>\nI&#39;ve told them in a more humorous but just as effective fashion &quot;If you want <br/>\nto be mean to Kirby, you grow up, rent an apartment and invite him over.  If <br/>\nhe comes over, you be mean to him there.  He might not come back.  He might <br/>\nleave.  But don&#39;t do it in MY house.&quot;<br/>\n<br/>\nWhen Holly wants to hit Marty, we tell her &quot;Wait until you&#39;re 18.&quot;  The <br/>\nrunning joke is that Marty is NOT coming to her 18th birthday party!    <br/>\nSometimes when he does something that frustrates her he&#39;ll say, kinda to the <br/>\nsky, &quot;On November 2, when I&#39;m 21, I think I&#39;ll be in Europe&quot; or something.<br/>\n<br/>\nIt&#39;s humor, but there&#39;s  a serious reality behind telling them &quot;When it&#39;s <br/>\nYOUR house you can decide to be mean IF they&#39;ll come and visit.  But not <br/>\nhere, not now.&quot;<br/>\n<br/>\nWhen Kirby and Marty were younger and Kirby would be mean and exclude Marty, <br/>\nI would do something extra cool with  or for Marty, which Kirby could not get <br/>\nin on even if he wanted to.  I would just plainly say, &quot;Marty didn&#39;t get to <br/>\nplay with you guys, so I&#39;m taking him to lunch,&quot; or whatever.  Kirby <br/>\nunderstood, and didn&#39;t really get mad, and Marty felt compensated.  And there <br/>\nwere times when Kirby was nice.  Sometimes because I bribed him to be nice, <br/>\nbut having BEEN nice and had it work out, it was easier for him the next <br/>\ntime.  And Marty DID sometimes bug him on purpose (still does sometimes).  <br/>\nBut as they get older, there are more and more times when Kirby&#39;s totally <br/>\nwilling to have Marty in on whatever the older guys are doing.  It was <br/>\ngradual, and not something I could force or enforce.  But the message that I <br/>\ndidn&#39;t want any of my kids to be made unhappy in their own home was constant.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\nIt&#39;s not playing unless everybody&#39;s playing.</div>","specialLinks":[]},{"userId":11828597,"authorName":"Mary Hickman","from":"&quot;Mary Hickman&quot; &lt;mfhick@...&gt;","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fighting kids again","postDate":"1019823716","msgId":6418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxNDR0TWN4NHZ2c0dPa2V2V1cwMDAwMDVkZkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":6419,"prevInTime":6417,"nextInTime":6419,"topicId":6418,"numMessagesInTopic":0,"msgSnippet":"Hello friends, My 5 and 7 year old are at it again. The 7 year old is so cold to her brother. I m so sad to watch this. Example 1: 7 year old has a blast with","messageBody":"<div id=\"ygrps-yiv-1340342052\">Hello friends,<br/>\n<br/>\nMy 5 and 7 year old are at it again. The 7 year old is so cold to her <br/>\nbrother. I&#39;m so sad to watch this. Example 1:<br/>\n<br/>\n7 year old has a blast with court friends while brother is at baseball <br/>\npractice. 7 year old now is planning to have club meetings when ever brother <br/>\nis at practice, so &quot;Riley isn&#39;t here&quot;. Other court friends really like <br/>\nRiley. Sister, however is planning a life without including him. Not a <br/>\nbiggy, but bothersome, premeditated.<br/>\n<br/>\nExample 2: 17 year old, 7 year old and 5 year old playing a game. 17 year <br/>\nold it first, 7 year old it next, big fight because 5 year old asks to be <br/>\nit, but 7 and 17 year old tell him he can&#39;t because you have to be able to <br/>\nspell to be it. 5 year old rage fit through the house. I am having a 4-H <br/>\nmeeting going on. I ask 7 and 17 year old why he can not be it and they <br/>\ncontinue to say you have to spell. Haven&#39;t I taught my daughter, 7, to <br/>\npretend and have fun. It does not matter what the rules are, a 5 year old <br/>\ncan and should be it next in a cooperative situation. I&#39;m floored, feeling <br/>\nlike I handled myself poorly. I do not feel either my daughter or our friend <br/>\nunderstood how cold they were by simply insisting a certain level of mastery <br/>\nto be considered it.<br/>\n<br/>\nNow my question, how can I politely show how cold the girls were without <br/>\ntearing them down. I keep having these situations where 1 kid is really <br/>\nhurting another and I feel totally unable to help them see the problem <br/>\nwithout hurting them. I want to yell at my daughter for being so cruel. She <br/>\nis cold almost all the time to her brother. I want to force her to sit in <br/>\nher room and not play outside with her friends. I&#39;m holding back, yet inside <br/>\nit really hurts to watch her. She is absolutely wonderful with her baby <br/>\nsister. So any ideas. I have read Siblings without Rivelry, any other <br/>\nresources or wisdom.<br/>\n<br/>\nThese family dynamics are what shakes my confidence about homeschooling. How <br/>\ncan I keep two people together most of the day everyday who treat eachother <br/>\nhorribly? My 7 year old tends to need the most attention. She also likes to <br/>\nbe the one making plans. It is her way or else much of the time. I&#39;m lossing <br/>\nsleep about the attitude towards her brother. Yuck. Also I&#39;m running low on <br/>\nAshley energy since she tends to put her brother down so much. She corrects <br/>\nhim constantly, even though I have repeatedly asked her to stop. She seems <br/>\nto get enjoyment by putting him below her. I keep looking into the family <br/>\ndynamics wondering am I modelling this? is Tim, my hubby? Why is she so cold <br/>\nto him? I&#39;m thinking of building a TeePee, maybe a big group project will <br/>\nhelp us out of this harsh place.<br/>\n<br/>\nMary<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>","specialLinks":[]}],"prevTopicId":6409,"nextTopicId":6375}}