{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":0,"authorName":"Bonknit@xxx.xxx","from":"Bonknit@...","replyTo":"LIST","senderId":"Pm_o9m2RvVhv5yfX57N4LrLNkLniMdF_2c8s72yZCVXgszDsqCB-6WrxyiAq4fI-Pn1CUXWu","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need support!!!","postDate":"943507167","msgId":4835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTMuNDgzNS45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":4834,"nextInTopic":0,"prevInTime":4834,"nextInTime":4836,"topicId":4816,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/24/99 4:51:01 PM Eastern Standard Time, tmartin@realtime.net writes: ","messageBody":"<div id=\"ygrps-yiv-94800849\">In a message dated 11/24/99 4:51:01 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tmartin@...\">tmartin@...</a> writes:<br/>\n<br/>\n&lt;&lt; i would like to say without a doubt you experienced full blown<br/>\n discrimination from many angles and if i were you i would bone up on the<br/>\n state laws regarding homeschooling because she may not let it drop, &gt;&gt;<br/>\n<br/>\n<br/>\n    What this all boils down to is that there is still very much the <br/>\nimplication that there is but one proper way to educate children and ours is <br/>\nnot it. That unless one chooses to use methods that can be studied and <br/>\napproved of by some outside party ones methods are unsound. Even if the <br/>\nsuccess of the student disproves the theory that education only takes place <br/>\nusing approved of curricula. Scary.<br/>\n<br/>\nLaura</div>","specialLinks":[]},{"userId":0,"authorName":"Jastypes@xxx.xxx","from":"Jastypes@...","replyTo":"LIST","senderId":"tPGnrMaIa-fyOd4wEgM7PDLDxGtUzV1ky36a6FyaQ0Vy3IAKJOHiertlc6cPnhFY0vD34YFnHw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need support!!!","postDate":"943500864","msgId":4834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTMuNDgzNC45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":4830,"nextInTopic":4835,"prevInTime":4833,"nextInTime":4835,"topicId":4816,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/24/1999 3:50:30 PM Eastern Standard Time, kellylyn@televar.com writes: ","messageBody":"<div id=\"ygrps-yiv-1603104538\">In a message dated 11/24/1999 3:50:30 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kellylyn@...\">kellylyn@...</a> writes:<br/>\n<br/>\n&lt;&lt; hanks to all who read this whole thing, and thanks in advance to all<br/>\n who respond.  This has really upset me and I feel so alone right now.<br/>\n <br/>\n Kelly<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>Well, Kelly, you&#39;re not alone.  :-)  My son, Adam&#39;s, psychologist had pretty <br/>\nmuch the same attitude.  Fortunately for me, Adam had been in ps until 6th <br/>\ngrade and hospitalized in 5th grade, and it was obvious that the ps school <br/>\nstress was very detrimental to his mental health.  Also, since he&#39;s been <br/>\nhomeschooled, he has not required any medication.  Of course, that didn&#39;t <br/>\nstop her from inquiring.  She finally dropped the ps idea, and began <br/>\nsuggesting various social activities.  Well, we finally did get Adam into a <br/>\nwonderful church youth group where he feels accepted and has even made <br/>\nfriends.<br/>\n<br/>\nIt&#39;s kind of funny, but when you are connected to so many home schoolers, you <br/>\nforget that the world at large doesn&#39;t understand or approve.<br/>\n<br/>\nLove,<br/>\nJill</div>","specialLinks":[]},{"userId":0,"authorName":"Susan and Theodore","from":"&quot;Susan and Theodore&quot; &lt;Stuff@...","replyTo":"LIST","senderId":"gIs2-xqQegDcNGpitT3zm1f9tyrCsMhEzS6hmPHSjFe2N-nlJvAIMEYL-6wK2fZSSbftCKRO_LkIu2hcs1lm0b198fFb2xmBx4yFIfy6ZIJo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need support!!!","postDate":"943496481","msgId":4830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTMuNDgzMC45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":4823,"nextInTopic":4834,"prevInTime":4829,"nextInTime":4831,"topicId":4816,"numMessagesInTopic":0,"msgSnippet":"Look there it is down there I thought that I saw another Susan..... I will be hmmm let me think Susie no no Suzan nope hmmm I will be Some other Susan that","messageBody":"<div id=\"ygrps-yiv-357987107\">Look there it is down there I thought that I saw &quot;another&quot; Susan.....<br/>\nI will be hmmm let me think<br/>\nSusie no no<br/>\nSuzan<br/>\nnope<br/>\nhmmm<br/>\nI will be Some other Susan<br/>\nthat is a good one huh?<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Thad Martin <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a> <br/>\n  Sent: Wednesday, November 24, 1999 10:53 AM<br/>\n  Subject: Re: [Unschooling-dotcom] need support!!!<br/>\n<br/>\n<br/>\n  hi, <br/>\n  i would like to say without a doubt you experienced full blown discrimination from many angles and if i were you i would bone up on the state laws regarding homeschooling because she may not let it drop,  despite the fact that you were the one to initiate the visit.   i don&#39;t mean to promote fear or sound paranoid but with all the fear that&#39;s flying around the country it may not be a bad idea to be fully prepared for a visit from some sort of official because in some states a dr must report situation which they feel are abusive and if she&#39;s so anti homeschooling she may interpret your son&#39;s moodiness as signs of something else.  i&#39;m not versed on the laws of washington and here in texas we have it &#39;easy&#39; but it&#39;s better to be prepared than getting caught off guard.  if you don&#39;t know the laws or where to find them i would be happy to locate and email them to you.  i&#39;m so sorry that you got the exact opposite of help.  good luck to you. <br/>\n<br/>\n  as far as your son goes there&#39;s been a book which has been talked about a lot on tv (i think on oprah and other shows) i think it&#39;s entitled real boys  personally i have not read it but from what i understand to get boys talking you need to do it in the context of doing something i.e. drawing, fishing, playing basketball etc.  maybe finding a hobby or an activity he really enjoys might help him find some way to express himself so both you and he can get a better understanding of his nature.   you may want to check out the site heartmath.org  it&#39;s kind of interesting.  just a thought.  i&#39;ve had no experience with hereditary mental illness but if you can get him talking it may lead both of you to a better place. <br/>\n<br/>\n  -susan <br/>\n  austin,tx <br/>\n  thad (husband) <br/>\n  rene&#39; (4) <br/>\n<br/>\n  Kelly Thielen wrote: <br/>\n<br/>\n    From: Kelly Thielen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kellylyn@...\">kellylyn@...</a>&gt; <br/>\n    Hello, <br/>\n    I am on digest mode of this list, and have not been active on the list <br/>\n    either, for some time, due to time constraints.  I am writing now to ask <br/>\n    for some much needed understanding and support(help?). <br/>\n<br/>\n    Something happened yesterday, that made me realize my need for support, <br/>\n    which will require a bit of background information, so here it is: <br/>\n<br/>\n    I live in WA state, and I have been homeschooling my 2 children(ages 8 & <br/>\n    6) for 2+years now.  Unschooling is an informed lifestyle choice I have <br/>\n    made for my family.  I am a very capable single mother, on a limited <br/>\n    income(disability).  My children&#39;s father is not, and never has been <br/>\n    involved in their lives.  They do have male role models, and their <br/>\n    absent biological father is not a problem or an issue in my life or my <br/>\n    children&#39;s at this time. <br/>\n<br/>\n    I also have Bipolar disorder(otherwise known as manic depression), a <br/>\n    very serious, potentially life threatening(a shocking 15-20% of <br/>\n    untreated bipolar sufferers commit suicide), incurable, but highly <br/>\n    treatable(medication called mood stabilizers, are a must for this <br/>\n    illness) neurobiological disorder of the brain, which affects mood, <br/>\n    behavior, and thoughts.  It is also highly genetic and happens to run in <br/>\n    both sides of my family(and possibly my children&#39;s paternal line as <br/>\n    well).  I had childhood onset type(even more highly genetic) of bipolar <br/>\n    disorder, as did my maternal grandfather and a maternal uncle.  My <br/>\n    extended family, on both sides, is riddled with &quot;mental <br/>\n    illness&quot;(paternal grandmother & grandfather, my own brother & my <br/>\n    father).  As a result of all of this, I have educated myself about <br/>\n    neurobioligical brain disorders(otherwise called &quot;mental illnesses&quot;), <br/>\n    their symptoms, treatment, etc., and continue to do so. <br/>\n<br/>\n    My son(age 8.5 yrs.), who is very intelligent, smart, and wonderful & <br/>\n    sweet, has been showing signs of A.D.H.D. since birth, basicly, nothing <br/>\n    for which I am too concerned about other than the fact that ADD is often <br/>\n    seen in children prior to onset of bipolar symptoms(a precursor sign). <br/>\n    Last year, I noticed some changes in my sons mood and behavior, which <br/>\n    had me concerned(he seemed depressed for about 2 weeks).  Knowing what I <br/>\n    know about Bipolar disorder and that it runs in my family, I chose to <br/>\n    speak to his doctor about my concerns at that time(last spring), who was <br/>\n    hesitant to refer me to a specialist, nonetheless I insisted upon a <br/>\n    referral.  I could not get him in at that time, since the doctor in the <br/>\n    next town refused to see him, and we did not have a psychiatrist in our <br/>\n    town then. <br/>\n<br/>\n    We now have one (her specialty is even child psychiatry), she works at <br/>\n    our community mental health facility, who is also my own psychiatrist, <br/>\n    and my prescribing physician.  My sons doctor recently referred him to <br/>\n    her, and yesterday was his appointment. <br/>\n<br/>\n    I went to this appointment, expecting to address my sons&#39; mood symptoms <br/>\n    and my concerns about his inheriting the family propensity for this <br/>\n    illness, particularly childhood onset bipolar disorder, and what I can <br/>\n    and can&#39;t do about that.  Like what can I do to help my son deal with <br/>\n    his emotions, what signs should I look for, when to seek treatment if <br/>\n    and when...., NOT to get him on medication(I am not even considering <br/>\n    that as an option at this time), for ADD or anything else.  I have been <br/>\n    told, and have read again and again, in my research on this topic, that <br/>\n    it is best to have a child seen as soon at the first sign of symptoms. <br/>\n    I have suspected for sometime with my son(he is so much like I was in <br/>\n    everyway-and so different from my daughter).  I just wanted some <br/>\n    professional advice/opinion, a professional to hear my concerns,etc., <br/>\n<br/>\n    I just can&#39;t believe what I actually got instead and I am infuriated by <br/>\n    it.  I am also very confused, because she is my own doctor(my new pdoc), <br/>\n    and I don&#39;t want my feelings concerning this to interfere with my <br/>\n    developing relationship with her in that arena(because I need her to <br/>\n    treat me, she is the only pdoc nearby), right now, but perhaps that is <br/>\n    being unrealistic. <br/>\n<br/>\n    Anyway, my son&#39;s appt. was for an hour, and she spent the first part of <br/>\n    that time talking to him, while I was in the room, most of it talking to <br/>\n    me privately while he played in the waiting room, and about 3 minutes <br/>\n    speaking to him privately.  When asked about school, he told her he was <br/>\n    homeschooling.  He is kind of shy of strangers, so he was not real <br/>\n    forthcoming with her, and kept saying &quot;i don&#39;t know&quot; a lot.  During the <br/>\n    time she spent alone with me talking about my son, she asked me why I <br/>\n    was homeschooling my kids.  I told her it is a lifestyle choice I have <br/>\n    made, and something I thought about doing since Skyler was a baby. <br/>\n    (It&#39;s not like something happened to make me decide this or that it was <br/>\n    a sudden decision, you know?.)  She kept asking me questions like what <br/>\n    grade is he in(I said &quot;he would be in 3rd grade&quot;)?, if I knew what grade <br/>\n    level he was at(I said &quot;not really&quot; and was oviously not too concerned <br/>\n    about it)?, and if we use a curriculum(&quot;no, we do not&quot;)?, and what about <br/>\n    testing, etc.?   I was really caught off guard by this line of <br/>\n    questioning, I mean I took my son to her because of my concerns about <br/>\n    him having symptoms of a mood disorder!!!???  How in the hell does this <br/>\n    have to do with curriculum and testing and grade level?  I am just so <br/>\n    angry about this, and I feel I was discriminated against, although I am <br/>\n    not sure why.  She obviously doens&#39;t understand about homeschooling, <br/>\n    unschooling, or my decision to do so, and I certainly can&#39;t explain that <br/>\n    to her in a nutshell in less than an hour!  But, I also felt <br/>\n    discriminated against because of my having bipolar disorder and because <br/>\n    I am a single parent.  She also asked lots of questions about his <br/>\n    father, etc.,  She asked Skyler to list all the members of his family, <br/>\n    who lives in his house, etc, and then she said &quot;what about your Dad?&quot; <br/>\n    and he said &quot;I don&#39;t have a Dad.&quot;  She seemed very concerned about this, <br/>\n    but the fact is that he doesn&#39;t have a Dad, and it doens&#39;t bother him or <br/>\n    me(but it did bother her, it seems she didn&#39;t like his answer).  I have <br/>\n    told him about his biological father as he has asked, but he is just not <br/>\n    very concerned with that.  I&#39;m sure he will ask more questions as he <br/>\n    matures.  Once again, other than her asking for genetic purposes, I see <br/>\n    no point for her concern on this matter. <br/>\n<br/>\n    If you have followed me this far, please keep reading, because this is <br/>\n    the important part of my story.  Now, get this: by middle of our <br/>\n    converstation and her questioning, she &quot;professionally recommends&quot; to <br/>\n    me, that I enroll my son in p.s., if not full-time, then part-time, <br/>\n    because she says even though kids may not want to go to school all day, <br/>\n    for some kids, it is actually good for them(even if they don&#39;t want to), <br/>\n    because they get to be around other kids and develop relationships with <br/>\n    other adults,etc., AND because she can&#39;t really diagnose him as ADD(i <br/>\n    wasn&#39;t asking her to) if he&#39;s not in school, since the way that she <br/>\n    usually does that is to send forms/diagnostic tests, etc., for the <br/>\n    schools/teachers.  I was so shocked I could barely respond!  She could <br/>\n    see I was not pleased with what she had to say, and I just told her <br/>\n    plain and simple, that I was not even considering putting my children in <br/>\n    ps at this time, that this was not an issue at all with me.  She asked <br/>\n    if I ever planned to, and I told her if my kids ever decided they really <br/>\n    wanted to go to school, then they would go(they definately do not want <br/>\n    to now, I know this, and they know they can if they want).  I also made <br/>\n    it clear to her my ONLY reason for concern about &quot;testing&quot; is because it <br/>\n    is required by law, but not until 4th grade(am I right?).  She was <br/>\n    trying to tell me testing/grade level, etc., was important so he could <br/>\n    &quot;graduate&quot; from h.s.(???) and go to college.  My God, who is this woman, <br/>\n    and what does any of this have to do with why I took him there?  I feel <br/>\n    like I am in the twilight zone here or something, haha!  After her <br/>\n    continual questioning and focusing on this &quot;issue&quot;, I told her my son <br/>\n    reads way beyond his grade level(he can read anything he wants to read, <br/>\n    and does all the time). <br/>\n<br/>\n    So, I left there with her unappreciated and unasked for advice on <br/>\n    school, and that is it, basicly.  What a joke! <br/>\n    Finally, she spoke to d.s. privately for a couple of minutes, and when <br/>\n    we left I asked him what she said, he told me that she asked him if he <br/>\n    thought he would like to go back to school or something to that <br/>\n    affect!!!! <br/>\n<br/>\n    What, if anything, should I do about this?  Is this sort of thing to be <br/>\n    expected from a psychiatrist?  I am just so shocked.  Maybe I am living <br/>\n    in a bubble and this is common discrimination.  Do the rest of you deal <br/>\n    with this sort of nonsense?  If so, how do you deal with it? <br/>\n<br/>\n    Thanks to all who read this whole thing, and thanks in advance to all <br/>\n    who respond.  This has really upset me and I feel so alone right now. <br/>\n<br/>\n    Kelly <br/>\n<br/>\n<br/>\n    Message boards, timely articles, a free newsletter and more! <br/>\n    Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"LASaliger@xxx.xxx","from":"LASaliger@...","replyTo":"LIST","senderId":"Yg2KFIV03eCOhyFneckctVL-cubbk-91CH3Xi7JeHlfDNgn_3057J3QFZR2kzBNPrDrMMPwicE8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need support!!!","postDate":"943483142","msgId":4823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTMuNDgyMy45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":4820,"nextInTopic":4830,"prevInTime":4822,"nextInTime":4824,"topicId":4816,"numMessagesInTopic":0,"msgSnippet":"Hi Kelly, I can certainly understand why this bothered you so much!  It really makes me mad when psychiatrists or psychologists step out of bounds to try to ","messageBody":"<div id=\"ygrps-yiv-1556631625\">Hi Kelly,<br/>\n   I can certainly understand why this bothered you so much!  It really makes <br/>\nme mad when psychiatrists or psychologists step out of bounds to try to <br/>\nimpose their personal beliefs on patients and then imply that their opinions <br/>\non these issues are more valid because they are in the mental health field.<br/>\n   I agree with Susan that she may not let it drop if she feels strongly <br/>\nabout it.  I hope that&#39;s not the case.  What you could do is make some copies <br/>\nof articles related to home/unschooling and take them in to her along with a <br/>\nlist of books by people like John Holt and Gatto.  You could try to make the <br/>\npoint that although she may not personally agree with homeschooling, there <br/>\nare definitely other well-thought out opinions on the matter and that her <br/>\npersonal opinions on this matter should not be any more valid than yours, <br/>\njust as you would not have her choose your religion or lack of religion just <br/>\nbecause she is a psychiatrist.  Homeschooling is a legal and valid choice, <br/>\nwhether she agrees with it or not.  She is not the voice of authority over <br/>\nevery issue in your life or in this country just because of her psychiatric <br/>\ntraining.<br/>\n    I agree also that she was too focused on the Dad issue.  She doesn&#39;t <br/>\nsound like a very good doctor for you or your son.  Is there any way you <br/>\ncould find another one?  I don&#39;t see how your feelings about this can NOT <br/>\naffect your own dealings with her and your therapy, unless she really comes <br/>\naround to a much more respectful approach.<br/>\n    Best wishes to you and good for you for all that you&#39;re doing for your <br/>\nkids and yourself!  I was a single mom with my oldest and I know it&#39;s not <br/>\neasy.  Take care...<br/>\n<br/>\n     Lucy in Calif.</div>","specialLinks":[]},{"userId":0,"authorName":"Kelly Thielen","from":"Kelly Thielen &lt;kellylyn@...","replyTo":"LIST","senderId":"oEosbzcIdb8XHllTFRD-jt73gdbJ3jfD1akTIVaLlglYUo00QdsA120Gx47gTu6ZoFPCCL1WKeS7cx-4b4fyfhAu3ASjSuGxr6F8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"need support!!!","postDate":"943478449","msgId":4816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTIuNDgxNi45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":4817,"prevInTime":4815,"nextInTime":4817,"topicId":4816,"numMessagesInTopic":0,"msgSnippet":"Hello, I am on digest mode of this list, and have not been active on the list either, for some time, due to time constraints.  I am writing now to ask for some","messageBody":"<div id=\"ygrps-yiv-1066076720\">Hello,<br/>\nI am on digest mode of this list, and have not been active on the list<br/>\neither, for some time, due to time constraints.  I am writing now to ask<br/>\nfor some much needed understanding and support(help?).<br/>\n<br/>\nSomething happened yesterday, that made me realize my need for support,<br/>\nwhich will require a bit of background information, so here it is:<br/>\n<br/>\nI live in WA state, and I have been homeschooling my 2 children(ages 8 &<br/>\n6) for 2+years now.  Unschooling is an informed lifestyle choice I have<br/>\nmade for my family.  I am a very capable single mother, on a limited<br/>\nincome(disability).  My children&#39;s father is not, and never has been<br/>\ninvolved in their lives.  They do have male role models, and their<br/>\nabsent biological father is not a problem or an issue in my life or my<br/>\nchildren&#39;s at this time.<br/>\n<br/>\nI also have Bipolar disorder(otherwise known as manic depression), a<br/>\nvery serious, potentially life threatening(a shocking 15-20% of<br/>\nuntreated bipolar sufferers commit suicide), incurable, but highly<br/>\ntreatable(medication called mood stabilizers, are a must for this<br/>\nillness) neurobiological disorder of the brain, which affects mood,<br/>\nbehavior, and thoughts.  It is also highly genetic and happens to run in<br/>\nboth sides of my family(and possibly my children&#39;s paternal line as<br/>\nwell).  I had childhood onset type(even more highly genetic) of bipolar<br/>\ndisorder, as did my maternal grandfather and a maternal uncle.  My<br/>\nextended family, on both sides, is riddled with &quot;mental<br/>\nillness&quot;(paternal grandmother & grandfather, my own brother & my<br/>\nfather).  As a result of all of this, I have educated myself about<br/>\nneurobioligical brain disorders(otherwise called &quot;mental illnesses&quot;),<br/>\ntheir symptoms, treatment, etc., and continue to do so.<br/>\n<br/>\nMy son(age 8.5 yrs.), who is very intelligent, smart, and wonderful &<br/>\nsweet, has been showing signs of A.D.H.D. since birth, basicly, nothing<br/>\nfor which I am too concerned about other than the fact that ADD is often<br/>\nseen in children prior to onset of bipolar symptoms(a precursor sign). <br/>\nLast year, I noticed some changes in my sons mood and behavior, which<br/>\nhad me concerned(he seemed depressed for about 2 weeks).  Knowing what I<br/>\nknow about Bipolar disorder and that it runs in my family, I chose to<br/>\nspeak to his doctor about my concerns at that time(last spring), who was<br/>\nhesitant to refer me to a specialist, nonetheless I insisted upon a<br/>\nreferral.  I could not get him in at that time, since the doctor in the<br/>\nnext town refused to see him, and we did not have a psychiatrist in our<br/>\ntown then.<br/>\n<br/>\nWe now have one (her specialty is even child psychiatry), she works at<br/>\nour community mental health facility, who is also my own psychiatrist,<br/>\nand my prescribing physician.  My sons doctor recently referred him to<br/>\nher, and yesterday was his appointment.<br/>\n<br/>\nI went to this appointment, expecting to address my sons&#39; mood symptoms<br/>\nand my concerns about his inheriting the family propensity for this<br/>\nillness, particularly childhood onset bipolar disorder, and what I can<br/>\nand can&#39;t do about that.  Like what can I do to help my son deal with<br/>\nhis emotions, what signs should I look for, when to seek treatment if<br/>\nand when...., NOT to get him on medication(I am not even considering<br/>\nthat as an option at this time), for ADD or anything else.  I have been<br/>\ntold, and have read again and again, in my research on this topic, that<br/>\nit is best to have a child seen as soon at the first sign of symptoms. <br/>\nI have suspected for sometime with my son(he is so much like I was in<br/>\neveryway-and so different from my daughter).  I just wanted some<br/>\nprofessional advice/opinion, a professional to hear my concerns,etc., <br/>\n<br/>\nI just can&#39;t believe what I actually got instead and I am infuriated by<br/>\nit.  I am also very confused, because she is my own doctor(my new pdoc),<br/>\nand I don&#39;t want my feelings concerning this to interfere with my<br/>\ndeveloping relationship with her in that arena(because I need her to<br/>\ntreat me, she is the only pdoc nearby), right now, but perhaps that is<br/>\nbeing unrealistic.<br/>\n<br/>\nAnyway, my son&#39;s appt. was for an hour, and she spent the first part of<br/>\nthat time talking to him, while I was in the room, most of it talking to<br/>\nme privately while he played in the waiting room, and about 3 minutes<br/>\nspeaking to him privately.  When asked about school, he told her he was<br/>\nhomeschooling.  He is kind of shy of strangers, so he was not real<br/>\nforthcoming with her, and kept saying &quot;i don&#39;t know&quot; a lot.  During the<br/>\ntime she spent alone with me talking about my son, she asked me why I<br/>\nwas homeschooling my kids.  I told her it is a lifestyle choice I have<br/>\nmade, and something I thought about doing since Skyler was a baby. <br/>\n(It&#39;s not like something happened to make me decide this or that it was<br/>\na sudden decision, you know?.)  She kept asking me questions like what<br/>\ngrade is he in(I said &quot;he would be in 3rd grade&quot;)?, if I knew what grade<br/>\nlevel he was at(I said &quot;not really&quot; and was oviously not too concerned<br/>\nabout it)?, and if we use a curriculum(&quot;no, we do not&quot;)?, and what about<br/>\ntesting, etc.?   I was really caught off guard by this line of<br/>\nquestioning, I mean I took my son to her because of my concerns about<br/>\nhim having symptoms of a mood disorder!!!???  How in the hell does this<br/>\nhave to do with curriculum and testing and grade level?  I am just so<br/>\nangry about this, and I feel I was discriminated against, although I am<br/>\nnot sure why.  She obviously doens&#39;t understand about homeschooling,<br/>\nunschooling, or my decision to do so, and I certainly can&#39;t explain that<br/>\nto her in a nutshell in less than an hour!  But, I also felt<br/>\ndiscriminated against because of my having bipolar disorder and because<br/>\nI am a single parent.  She also asked lots of questions about his<br/>\nfather, etc.,  She asked Skyler to list all the members of his family,<br/>\nwho lives in his house, etc, and then she said &quot;what about your Dad?&quot;<br/>\nand he said &quot;I don&#39;t have a Dad.&quot;  She seemed very concerned about this,<br/>\nbut the fact is that he doesn&#39;t have a Dad, and it doens&#39;t bother him or<br/>\nme(but it did bother her, it seems she didn&#39;t like his answer).  I have<br/>\ntold him about his biological father as he has asked, but he is just not<br/>\nvery concerned with that.  I&#39;m sure he will ask more questions as he<br/>\nmatures.  Once again, other than her asking for genetic purposes, I see<br/>\nno point for her concern on this matter.    <br/>\n<br/>\nIf you have followed me this far, please keep reading, because this is<br/>\nthe important part of my story.  Now, get this: by middle of our<br/>\nconverstation and her questioning, she &quot;professionally recommends&quot; to<br/>\nme, that I enroll my son in p.s., if not full-time, then part-time,<br/>\nbecause she says even though kids may not want to go to school all day,<br/>\nfor some kids, it is actually good for them(even if they don&#39;t want to),<br/>\nbecause they get to be around other kids and develop relationships with<br/>\nother adults,etc., AND because she can&#39;t really diagnose him as ADD(i<br/>\nwasn&#39;t asking her to) if he&#39;s not in school, since the way that she<br/>\nusually does that is to send forms/diagnostic tests, etc., for the<br/>\nschools/teachers.  I was so shocked I could barely respond!  She could<br/>\nsee I was not pleased with what she had to say, and I just told her<br/>\nplain and simple, that I was not even considering putting my children in<br/>\nps at this time, that this was not an issue at all with me.  She asked<br/>\nif I ever planned to, and I told her if my kids ever decided they really<br/>\nwanted to go to school, then they would go(they definately do not want<br/>\nto now, I know this, and they know they can if they want).  I also made<br/>\nit clear to her my ONLY reason for concern about &quot;testing&quot; is because it<br/>\nis required by law, but not until 4th grade(am I right?).  She was<br/>\ntrying to tell me testing/grade level, etc., was important so he could<br/>\n&quot;graduate&quot; from h.s.(???) and go to college.  My God, who is this woman,<br/>\nand what does any of this have to do with why I took him there?  I feel<br/>\nlike I am in the twilight zone here or something, haha!  After her<br/>\ncontinual questioning and focusing on this &quot;issue&quot;, I told her my son<br/>\nreads way beyond his grade level(he can read anything he wants to read,<br/>\nand does all the time).  <br/>\n<br/>\nSo, I left there with her unappreciated and unasked for advice on<br/>\nschool, and that is it, basicly.  What a joke!  <br/>\nFinally, she spoke to d.s. privately for a couple of minutes, and when<br/>\nwe left I asked him what she said, he told me that she asked him if he<br/>\nthought he would like to go back to school or something to that<br/>\naffect!!!!  <br/>\n<br/>\nWhat, if anything, should I do about this?  Is this sort of thing to be<br/>\nexpected from a psychiatrist?  I am just so shocked.  Maybe I am living<br/>\nin a bubble and this is common discrimination.  Do the rest of you deal<br/>\nwith this sort of nonsense?  If so, how do you deal with it?<br/>\n<br/>\nThanks to all who read this whole thing, and thanks in advance to all<br/>\nwho respond.  This has really upset me and I feel so alone right now.<br/>\n<br/>\nKelly</div>","specialLinks":[]},{"userId":0,"authorName":"Bonknit@xxx.xxx","from":"Bonknit@...","replyTo":"LIST","senderId":"uogrQmTqJKWulHOkr24Ew_X_f3v3gzcKbwFIaYH2TDVRw6tzGe1JUpuKYfXZNoUsMSmqGaXV","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need support!!!","postDate":"943477937","msgId":4818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTIuNDgxOC45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":4817,"nextInTopic":4820,"prevInTime":4817,"nextInTime":4819,"topicId":4816,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/24/99 3:50:38 PM Eastern Standard Time, kellylyn@televar.com writes: ","messageBody":"<div id=\"ygrps-yiv-446190447\">In a message dated 11/24/99 3:50:38 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kellylyn@...\">kellylyn@...</a> writes:<br/>\n<br/>\n&lt;&lt; Thanks to all who read this whole thing, and thanks in advance to all<br/>\n who respond.  This has really upset me and I feel so alone right now.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>I do not have time to write much now, got to cook for tomorrow,BUT, No I <br/>\nwould not go back to her. I&#39;m sorry but I would not go back for myself or <br/>\nson. Yes, I have run into this and it scared me to death at the time thinking <br/>\nthe therapist could do something to prevent me from hsing. I had only talked <br/>\nto her once but that was all I needed. I was told the same thing that a <br/>\nteacher also needed to fill out forms etc. Keep looking, hopefully you can <br/>\nfind someone in the hs community to refer you to someone of the same mind.<br/>\n<br/>\nLaura</div>","specialLinks":[]},{"userId":0,"authorName":"Emhenry@xxx.xxx","from":"Emhenry@...","replyTo":"LIST","senderId":"6gUqGC8U0NdrvlEfVka6qwdwc_u9CmTFAsdglSUUEChNLLGalADx84hXNEotE1-jK6RZAnj3","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need support!!!","postDate":"943476780","msgId":4817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTIuNDgxNy45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":4816,"nextInTopic":4818,"prevInTime":4816,"nextInTime":4818,"topicId":4816,"numMessagesInTopic":0,"msgSnippet":"please switch doctors :))","messageBody":"<div id=\"ygrps-yiv-170417208\">please switch doctors :))</div>","specialLinks":[]},{"userId":0,"authorName":"Thad Martin","from":"Thad Martin &lt;tmartin@...&gt;","replyTo":"LIST","senderId":"-V392Nx6kPDMEBmD3i6_d8h02LPNY9TPigQeQoRUaZIbl2vqZm3LO2--Q2Ng7QSYl8Yn3ZfOCS0AwpB1WlhqhNxN_TQ01TGMZw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need support!!!","postDate":"943458792","msgId":4820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTMuNDgyMC45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":4818,"nextInTopic":4823,"prevInTime":4819,"nextInTime":4821,"topicId":4816,"numMessagesInTopic":0,"msgSnippet":"hi, i would like to say without a doubt you experienced full blown discrimination from many angles and if i were you i would bone up on the state laws","messageBody":"<div id=\"ygrps-yiv-45109760\">hi,<br/>\n<br/>\ni would like to say without a doubt you experienced full blown<br/>\ndiscrimination from many angles and if i were you i would bone up on the<br/>\nstate laws regarding homeschooling because she may not let it drop,<br/>\ndespite the fact that you were the one to initiate the visit.   i don&#39;t<br/>\nmean to promote fear or sound paranoid but with all the fear that&#39;s flying<br/>\naround the country it may not be a bad idea to be fully prepared for a<br/>\nvisit from some sort of official because in some states a dr must report<br/>\nsituation which they feel are abusive and if she&#39;s so anti homeschooling<br/>\nshe may interpret your son&#39;s moodiness as signs of something else.  i&#39;m not<br/>\nversed on the laws of washington and here in texas we have it &#39;easy&#39; but<br/>\nit&#39;s better to be prepared than getting caught off guard.  if you don&#39;t<br/>\nknow the laws or where to find them i would be happy to locate and email<br/>\nthem to you.  i&#39;m so sorry that you got the exact opposite of help.  good<br/>\nluck to you.<br/>\n<br/>\nas far as your son goes there&#39;s been a book which has been talked about a<br/>\nlot on tv (i think on oprah and other shows) i think it&#39;s entitled real<br/>\nboys  personally i have not read it but from what i understand to get boys<br/>\ntalking you need to do it in the context of doing something i.e. drawing,<br/>\nfishing, playing basketball etc.  maybe finding a hobby or an activity he<br/>\nreally enjoys might help him find some way to express himself so both you<br/>\nand he can get a better understanding of his nature.   you may want to<br/>\ncheck out the site heartmath.org  it&#39;s kind of interesting.  just a<br/>\nthought.  i&#39;ve had no experience with hereditary mental illness but if you<br/>\ncan get him talking it may lead both of you to a better place.<br/>\n<br/>\n-susan<br/>\naustin,tx<br/>\nthad (husband)<br/>\nrene&#39; (4)<br/>\n<br/>\nKelly Thielen wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; From: Kelly Thielen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kellylyn@...\">kellylyn@...</a>&gt;<br/>\n&gt;<br/>\n&gt; Hello,<br/>\n&gt; I am on digest mode of this list, and have not been active on the list<br/>\n&gt; either, for some time, due to time constraints.  I am writing now to ask<br/>\n&gt; for some much needed understanding and support(help?).<br/>\n&gt;<br/>\n&gt; Something happened yesterday, that made me realize my need for support,<br/>\n&gt; which will require a bit of background information, so here it is:<br/>\n&gt;<br/>\n&gt; I live in WA state, and I have been homeschooling my 2 children(ages 8 &<br/>\n&gt; 6) for 2+years now.  Unschooling is an informed lifestyle choice I have<br/>\n&gt; made for my family.  I am a very capable single mother, on a limited<br/>\n&gt; income(disability).  My children&#39;s father is not, and never has been<br/>\n&gt; involved in their lives.  They do have male role models, and their<br/>\n&gt; absent biological father is not a problem or an issue in my life or my<br/>\n&gt; children&#39;s at this time.<br/>\n&gt;<br/>\n&gt; I also have Bipolar disorder(otherwise known as manic depression), a<br/>\n&gt; very serious, potentially life threatening(a shocking 15-20% of<br/>\n&gt; untreated bipolar sufferers commit suicide), incurable, but highly<br/>\n&gt; treatable(medication called mood stabilizers, are a must for this<br/>\n&gt; illness) neurobiological disorder of the brain, which affects mood,<br/>\n&gt; behavior, and thoughts.  It is also highly genetic and happens to run in<br/>\n&gt; both sides of my family(and possibly my children&#39;s paternal line as<br/>\n&gt; well).  I had childhood onset type(even more highly genetic) of bipolar<br/>\n&gt; disorder, as did my maternal grandfather and a maternal uncle.  My<br/>\n&gt; extended family, on both sides, is riddled with &quot;mental<br/>\n&gt; illness&quot;(paternal grandmother & grandfather, my own brother & my<br/>\n&gt; father).  As a result of all of this, I have educated myself about<br/>\n&gt; neurobioligical brain disorders(otherwise called &quot;mental illnesses&quot;),<br/>\n&gt; their symptoms, treatment, etc., and continue to do so.<br/>\n&gt;<br/>\n&gt; My son(age 8.5 yrs.), who is very intelligent, smart, and wonderful &<br/>\n&gt; sweet, has been showing signs of A.D.H.D. since birth, basicly, nothing<br/>\n&gt; for which I am too concerned about other than the fact that ADD is often<br/>\n&gt; seen in children prior to onset of bipolar symptoms(a precursor sign).<br/>\n&gt; Last year, I noticed some changes in my sons mood and behavior, which<br/>\n&gt; had me concerned(he seemed depressed for about 2 weeks).  Knowing what I<br/>\n&gt; know about Bipolar disorder and that it runs in my family, I chose to<br/>\n&gt; speak to his doctor about my concerns at that time(last spring), who was<br/>\n&gt; hesitant to refer me to a specialist, nonetheless I insisted upon a<br/>\n&gt; referral.  I could not get him in at that time, since the doctor in the<br/>\n&gt; next town refused to see him, and we did not have a psychiatrist in our<br/>\n&gt; town then.<br/>\n&gt;<br/>\n&gt; We now have one (her specialty is even child psychiatry), she works at<br/>\n&gt; our community mental health facility, who is also my own psychiatrist,<br/>\n&gt; and my prescribing physician.  My sons doctor recently referred him to<br/>\n&gt; her, and yesterday was his appointment.<br/>\n&gt;<br/>\n&gt; I went to this appointment, expecting to address my sons&#39; mood symptoms<br/>\n&gt; and my concerns about his inheriting the family propensity for this<br/>\n&gt; illness, particularly childhood onset bipolar disorder, and what I can<br/>\n&gt; and can&#39;t do about that.  Like what can I do to help my son deal with<br/>\n&gt; his emotions, what signs should I look for, when to seek treatment if<br/>\n&gt; and when...., NOT to get him on medication(I am not even considering<br/>\n&gt; that as an option at this time), for ADD or anything else.  I have been<br/>\n&gt; told, and have read again and again, in my research on this topic, that<br/>\n&gt; it is best to have a child seen as soon at the first sign of symptoms.<br/>\n&gt; I have suspected for sometime with my son(he is so much like I was in<br/>\n&gt; everyway-and so different from my daughter).  I just wanted some<br/>\n&gt; professional advice/opinion, a professional to hear my concerns,etc.,<br/>\n&gt;<br/>\n&gt; I just can&#39;t believe what I actually got instead and I am infuriated by<br/>\n&gt; it.  I am also very confused, because she is my own doctor(my new pdoc),<br/>\n&gt; and I don&#39;t want my feelings concerning this to interfere with my<br/>\n&gt; developing relationship with her in that arena(because I need her to<br/>\n&gt; treat me, she is the only pdoc nearby), right now, but perhaps that is<br/>\n&gt; being unrealistic.<br/>\n&gt;<br/>\n&gt; Anyway, my son&#39;s appt. was for an hour, and she spent the first part of<br/>\n&gt; that time talking to him, while I was in the room, most of it talking to<br/>\n&gt; me privately while he played in the waiting room, and about 3 minutes<br/>\n&gt; speaking to him privately.  When asked about school, he told her he was<br/>\n&gt; homeschooling.  He is kind of shy of strangers, so he was not real<br/>\n&gt; forthcoming with her, and kept saying &quot;i don&#39;t know&quot; a lot.  During the<br/>\n&gt; time she spent alone with me talking about my son, she asked me why I<br/>\n&gt; was homeschooling my kids.  I told her it is a lifestyle choice I have<br/>\n&gt; made, and something I thought about doing since Skyler was a baby.<br/>\n&gt; (It&#39;s not like something happened to make me decide this or that it was<br/>\n&gt; a sudden decision, you know?.)  She kept asking me questions like what<br/>\n&gt; grade is he in(I said &quot;he would be in 3rd grade&quot;)?, if I knew what grade<br/>\n&gt; level he was at(I said &quot;not really&quot; and was oviously not too concerned<br/>\n&gt; about it)?, and if we use a curriculum(&quot;no, we do not&quot;)?, and what about<br/>\n&gt; testing, etc.?   I was really caught off guard by this line of<br/>\n&gt; questioning, I mean I took my son to her because of my concerns about<br/>\n&gt; him having symptoms of a mood disorder!!!???  How in the hell does this<br/>\n&gt; have to do with curriculum and testing and grade level?  I am just so<br/>\n&gt; angry about this, and I feel I was discriminated against, although I am<br/>\n&gt; not sure why.  She obviously doens&#39;t understand about homeschooling,<br/>\n&gt; unschooling, or my decision to do so, and I certainly can&#39;t explain that<br/>\n&gt; to her in a nutshell in less than an hour!  But, I also felt<br/>\n&gt; discriminated against because of my having bipolar disorder and because<br/>\n&gt; I am a single parent.  She also asked lots of questions about his<br/>\n&gt; father, etc.,  She asked Skyler to list all the members of his family,<br/>\n&gt; who lives in his house, etc, and then she said &quot;what about your Dad?&quot;<br/>\n&gt; and he said &quot;I don&#39;t have a Dad.&quot;  She seemed very concerned about this,<br/>\n&gt; but the fact is that he doesn&#39;t have a Dad, and it doens&#39;t bother him or<br/>\n&gt; me(but it did bother her, it seems she didn&#39;t like his answer).  I have<br/>\n&gt; told him about his biological father as he has asked, but he is just not<br/>\n&gt; very concerned with that.  I&#39;m sure he will ask more questions as he<br/>\n&gt; matures.  Once again, other than her asking for genetic purposes, I see<br/>\n&gt; no point for her concern on this matter.<br/>\n&gt;<br/>\n&gt; If you have followed me this far, please keep reading, because this is<br/>\n&gt; the important part of my story.  Now, get this: by middle of our<br/>\n&gt; converstation and her questioning, she &quot;professionally recommends&quot; to<br/>\n&gt; me, that I enroll my son in p.s., if not full-time, then part-time,<br/>\n&gt; because she says even though kids may not want to go to school all day,<br/>\n&gt; for some kids, it is actually good for them(even if they don&#39;t want to),<br/>\n&gt; because they get to be around other kids and develop relationships with<br/>\n&gt; other adults,etc., AND because she can&#39;t really diagnose him as ADD(i<br/>\n&gt; wasn&#39;t asking her to) if he&#39;s not in school, since the way that she<br/>\n&gt; usually does that is to send forms/diagnostic tests, etc., for the<br/>\n&gt; schools/teachers.  I was so shocked I could barely respond!  She could<br/>\n&gt; see I was not pleased with what she had to say, and I just told her<br/>\n&gt; plain and simple, that I was not even considering putting my children in<br/>\n&gt; ps at this time, that this was not an issue at all with me.  She asked<br/>\n&gt; if I ever planned to, and I told her if my kids ever decided they really<br/>\n&gt; wanted to go to school, then they would go(they definately do not want<br/>\n&gt; to now, I know this, and they know they can if they want).  I also made<br/>\n&gt; it clear to her my ONLY reason for concern about &quot;testing&quot; is because it<br/>\n&gt; is required by law, but not until 4th grade(am I right?).  She was<br/>\n&gt; trying to tell me testing/grade level, etc., was important so he could<br/>\n&gt; &quot;graduate&quot; from h.s.(???) and go to college.  My God, who is this woman,<br/>\n&gt; and what does any of this have to do with why I took him there?  I feel<br/>\n&gt; like I am in the twilight zone here or something, haha!  After her<br/>\n&gt; continual questioning and focusing on this &quot;issue&quot;, I told her my son<br/>\n&gt; reads way beyond his grade level(he can read anything he wants to read,<br/>\n&gt; and does all the time).<br/>\n&gt;<br/>\n&gt; So, I left there with her unappreciated and unasked for advice on<br/>\n&gt; school, and that is it, basicly.  What a joke!<br/>\n&gt; Finally, she spoke to d.s. privately for a couple of minutes, and when<br/>\n&gt; we left I asked him what she said, he told me that she asked him if he<br/>\n&gt; thought he would like to go back to school or something to that<br/>\n&gt; affect!!!!<br/>\n&gt;<br/>\n&gt; What, if anything, should I do about this?  Is this sort of thing to be<br/>\n&gt; expected from a psychiatrist?  I am just so shocked.  Maybe I am living<br/>\n&gt; in a bubble and this is common discrimination.  Do the rest of you deal<br/>\n&gt; with this sort of nonsense?  If so, how do you deal with it?<br/>\n&gt;<br/>\n&gt; Thanks to all who read this whole thing, and thanks in advance to all<br/>\n&gt; who respond.  This has really upset me and I feel so alone right now.<br/>\n&gt;<br/>\n&gt; Kelly<br/>\n&gt;<br/>\n&gt; &gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":4815,"nextTopicId":4839}}