{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":44,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288693347","msgId":57974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQzE5RjZBLUZFQkEtNDAwRS04N0I5LUQ3QTY2MTYwM0FEOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU4MDM4OC44MTQ2OS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDU4MDM4OC44MTQ2OS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":57973,"nextInTopic":57975,"prevInTime":57973,"nextInTime":57975,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=- The circumstance is what it is- fact or fault, fine or flawed-=- The circumstance is not what it is. The circumstances are an opportunity for you to make","messageBody":"<div id=\"ygrps-yiv-176950029\">-=- The circumstance is what it is- fact or fault, fine or flawed-=-<br/>\n<br/>\nThe circumstance is not what it is.<br/>\nThe circumstances are an opportunity for you to make choices and  <br/>\nchange the peace, the mood, the joy of any and every moment (or to  <br/>\nchoose *not* to do so).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288691121","msgId":57973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4MDM4OC44MTQ2OS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":57972,"nextInTopic":57974,"prevInTime":57972,"nextInTime":57974,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... Yes, it s just looking for a way to justify your fears. There is no evidence that television damages vision.","messageBody":"<div id=\"ygrps-yiv-477011707\"><blockquote><span title=\"ireply\">&gt;&gt;I guess again it returns to how traumatic or &#39;unhealthy&#39; we view TV. On a <br/>\n&gt;&gt;different page, feel that looking at the screen for extended periods of time <br/>\n&gt;&gt;isn&#39;t good for the eyes! I can&#39;t control my son&#39;s health, but I&#39;d like to <br/>\n&gt;&gt;influence his health positively. Does that look like controling? &lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes, it&#39;s just looking for a way to justify your fears. There is no evidence <br/>\nthat television damages <br/>\nvision. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scientificamerican.com/article.cfm?id=earth-talk-tv-eyesight.\">http://www.scientificamerican.com/article.cfm?id=earth-talk-tv-eyesight.</a> <br/>\nQuick and easy information to allay your fears. Folks often put a barrier <br/>\nbetween themselves and their decisions that are limiting. You&#39;ve decided that <br/>\nsomething isn&#39;t healthy and part of your job is to  keep your child healthy so <br/>\nthat gives you the freedom to limit it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;This also relates to my original post, which included limiting chocolate, and to <br/>\n&gt;&gt;how we view food (what is healthy/ a healthy amount) and I know the importance <br/>\n&gt;&gt;lies in decision making skills more than in my &#39;influencing health&#39;. In looking <br/>\n&gt;&gt;at principles vs. rules, the principle for me is health so instead of &#39;no more <br/>\n&gt;&gt;TV&#39; or &#39;no more chocolate&#39; I ask things like, do your eyes feel ok? and I <br/>\n&gt;&gt;explain that looking at the screen for too long can hurt his eyes. Or with food <br/>\n&gt;&gt;I ask, &#39;does your tummy feel ok?&#39;. This seems to bring him back &#39;into his body,&#39; <br/>\n&gt;&gt;which for me is a healthy place to be. Does this look like a correct application <br/>\n&gt;&gt;of principles vs rules?&lt;&lt;<br/>\n<br/>\n </span></blockquote>You are making decisions about health that are about your own experience and not <br/>\ntailored to someone else&#39;s. You&#39;ve decided that the principle is health and you <br/>\nare  applying it to things that may have nothing to do with health. Or at least <br/>\nare unlikely to damage health in a particularly significant way. When Simon was <br/>\n14 months we went strawberry picking with his grandparents and Simon ate <br/>\nstrawberry after strawberry after strawberry. He was loving it. His grandfather <br/>\nwas absolutely certain that we&#39;d be paying for his binge later with lots and <br/>\nlots of unpleasant diapers. Turned out it was Kenneth who was unwell and not <br/>\nSimon. Turned out it was Kenneth&#39;s sensitivity to fruit and not Simon&#39;s. Maybe <br/>\nchocolate isn&#39;t something you can eat in any kind of quantity but someone else <br/>\nwill do just fine. <br/>\n<br/>\nYou are using principles as ways of getting your son to not do what you want him <br/>\nnot to do. Rather than saying __to yourself!__ my principle is health and <br/>\nexamining what you see to be unhealthy aspects of something, you are telling <br/>\nyour son &quot;oh, your eyes might hurt if you watch too much  television&quot;. Rather <br/>\nthan turning on a light or cuddling up together a bit further away from the <br/>\ntelevision or doing something alongside watching television like playing with <br/>\nlego or drawing or building with blocks, you are doing everything you can to <br/>\nstep between your son and what he wants to do. Same with chocolate. If the <br/>\nprinciple is health, look at chocolate and see if it&#39;s unhealthy. I think <br/>\nchocolate is a pretty healthy food. Wikipedia has a nice entry on chocolate, <br/>\nincluding a few paragraphs on health: <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Chocolate\">http://en.wikipedia.org/wiki/Chocolate</a> We <br/>\ndid lots of chocolate fondues. Totally messy, be prepared. You don&#39;t need a <br/>\nfondue pot, but that&#39;s kind of fun. Melted chocolate and strawberries and pears <br/>\nand apples and bananas and angel food cake or pound cake and anything else that <br/>\nyou want to dip in there. Long skewers for holding and dipping and forks for <br/>\nretrieving the ones that fall in  the bowl. It&#39;s fantastic! And you can try <br/>\ndifferent dippable foods and see what else goes well with chocolate. Cheese or <br/>\noranges or bread sticks or bacon or whatever else you want to try. <br/>\n<br/>\nPrinciples aren&#39;t rules, but you are using them as such. Principles are a tool <br/>\nfor examining why you are making a decision. If your kneejerk response is to <br/>\nlimit something, or to say no, principles give you a place to go to see if it <br/>\nworks. So you get worried about television, you look for a principle to see if <br/>\nit works. You place it in a health concern. And respond not by limiting, but by <br/>\ntrying to increase the engagement in other things. So, you don&#39;t go to your son <br/>\nand say, you&#39;ve watched so much television your eyes must hurt. You instead mix <br/>\nit up, you play a game a little further away from the television with him, you <br/>\nsee if he&#39;d like to go to the park or play in the garden or race around the <br/>\nhouse. Or you spend some time researching your kneejerk response. Is television <br/>\ntruly a health concern? Are the findings that put television in a negative light <br/>\napplicable to a child who isn&#39;t in school, who has engaged parents, who isn&#39;t <br/>\nsitting alone watching television without folks around to talk to? <br/>\n<br/>\nI can tell you that stress is a long term health risk. If television is in any <br/>\nway helping him to deal with a stressful situation, I would totally applaud <br/>\nthat. If you are worried about his health figure out ways not to fight with his <br/>\ndad and to make your lives happier and more peaceful all the way around. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;The fear of the children being<br/>\n&gt;&gt;&gt; &#39;influenced&#39; by violence, separation, death, love scene, etc etc is what<br/>\n&gt;&gt;&gt; keeps one in this huge TV phobia. Letting go of these fears will help you in<br/>\n&gt;&gt;&gt; accepting TV watching more easily.<br/>\n&gt;I guess to me it&#39;s a question of, without the TV would my 3 year old be exposed <br/>\n&gt;to all that he has been exposed to through the TV, and does he need that <br/>\n&gt;exposure. It&#39;s not so much a problem, but what about the &gt;desensitized frog that <br/>\n&gt;doesn&#39;t leap out of the boiling water because after being exposed to such heat, <br/>\n&gt;he doesn&#39;t realize it&#39;s boiling? The circumstance is what it is- fact or fault, <br/>\n&gt;fine or flawed- I just want to be the best parent I &gt;can be to my son&lt;&lt;<br/>\n<br/>\n </span></blockquote>The frog is a lie. The only way to keep a frog in water that is slowly heating <br/>\nup is to not let it be able to get out, or to remove it&#39;s brain according to the <br/>\noriginal study. If you aren&#39;t trapping your son or taking away his choices and <br/>\nhis options, he&#39;ll get out of the water long before it&#39;s boiled him to death. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288672398","msgId":57972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltKzhmQUNpUXMtMUYxNThtSHpRZkY3ZnBiM0NqZDZhNW4yYXd5Y0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlhbmgyZitycHI3QGVHcm91cHMuY29tPg==","referencesHeader":"PEFBTkxrVGk9S2Rab3gtYV89XzlOcTJ2M1plNjdNTTVkOGRCZl91THpyR1FDOUBtYWlsLmdtYWlsLmNvbT4JPGlhbmgyZitycHI3QGVHcm91cHMuY29tPg=="},"prevInTopic":57971,"nextInTopic":57973,"prevInTime":57971,"nextInTime":57973,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"I feel you must just let all that has been written to you to seep in for a few weeks. Then try it all out honestly. Then watch for transformation in you and","messageBody":"<div id=\"ygrps-yiv-2094618654\">I feel you must just let all that has been written to you to seep in for a<br/>\nfew weeks. Then try it all out honestly. Then watch for transformation in<br/>\nyou and your child. Then let that transformation seep in too.<br/>\n<br/>\nLet it take as long as possible. Come back and then share your new<br/>\nexperiences.<br/>\n<br/>\nMy advice is &#39;let go, let go, let go, let go.....&#39;<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Nov 2, 2010 at 4:34 AM, ceepee12 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crperlow@...\">crperlow@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; I am asking these questions because you made it sound like some traumatic<br/>\n&gt; &gt; experience that you would rather not have your child go through<br/>\n&gt; alone......<br/>\n&gt; &gt; And if he asks you to stay with him then it might just that he wants to<br/>\n&gt; &gt; share his excitement at having understood the focal point of the story.<br/>\n&gt;<br/>\n&gt; I do feel like I still want there with him through traumas at this age (3).<br/>\n&gt; Though I guess how traumatic TV is depends on how real it feels to the<br/>\n&gt; individual...<br/>\n&gt; I think you are right about him wanting me to share in the excitement, or<br/>\n&gt; at least wanting to have me around to help him understand the focal points.<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Sometimes the fear is in the parent and not in the child and that keeps<br/>\n&gt; one<br/>\n&gt; &gt; perpetually in a thinking and control mode.<br/>\n&gt;<br/>\n&gt; I guess again it returns to how traumatic or &#39;unhealthy&#39; we view TV. On a<br/>\n&gt; different page, feel that looking at the screen for extended periods of time<br/>\n&gt; isn&#39;t good for the eyes! I can&#39;t control my son&#39;s health, but I&#39;d like to<br/>\n&gt; influence his health positively. Does that look like controling?<br/>\n&gt; This also relates to my original post, which included limiting chocolate,<br/>\n&gt; and to how we view food (what is healthy/ a healthy amount) and I know the<br/>\n&gt; importance lies in decision making skills more than in my &#39;influencing<br/>\n&gt; health&#39;. In looking at principles vs. rules, the principle for me is health<br/>\n&gt; so instead of &#39;no more TV&#39; or &#39;no more chocolate&#39; I ask things like, do your<br/>\n&gt; eyes feel ok? and I explain that looking at the screen for too long can hurt<br/>\n&gt; his eyes. Or with food I ask, &#39;does your tummy feel ok?&#39;. This seems to<br/>\n&gt; bring him back &#39;into his body,&#39; which for me is a healthy place to be. Does<br/>\n&gt; this look like a correct application of principles vs rules?<br/>\n&gt; Maybe because the introduction to the TV in such magnitude was so out of my<br/>\n&gt; control, since I was gone for it, I have been trying to exert too much<br/>\n&gt; influence to make up for it.<br/>\n&gt;<br/>\n&gt; The fear of the children being<br/>\n&gt; &gt; &#39;influenced&#39; by violence, separation, death, love scene, etc etc is what<br/>\n&gt; &gt; keeps one in this huge TV phobia. Letting go of these fears will help you<br/>\n&gt; in<br/>\n&gt; &gt; accepting TV watching more easily.<br/>\n&gt; I guess to me it&#39;s a question of, without the TV would my 3 year old be<br/>\n&gt; exposed to all that he has been exposed to through the TV, and does he need<br/>\n&gt; that exposure. It&#39;s not so much a problem, but what about the desensitized<br/>\n&gt; frog that doesn&#39;t leap out of the boiling water because after being exposed<br/>\n&gt; to such heat, he doesn&#39;t realize it&#39;s boiling? The circumstance is what it<br/>\n&gt; is- fact or fault, fine or flawed- I just want to be the best parent I can<br/>\n&gt; be to my son.<br/>\n&gt;<br/>\n&gt; &gt; Just be patient and watch and observe. All will work out.<br/>\n&gt; I believe, and you seem like a relaxed and realistic parent. A warm Thank<br/>\n&gt; you for the input and advice!<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; On Sat, Oct 30, 2010 at 9:16 PM, ceepee12 &lt;crperlow@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Thank you everyone for the responses.<br/>\n&gt; &gt; &gt; Katherine and Meredith, your personal stories felt heartfelt and<br/>\n&gt; helpful<br/>\n&gt; &gt; &gt; and meant a lot to me. Thank you for sharing.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; It is my husband that got my son into watching TV (and watching while<br/>\n&gt; &gt; &gt; eating, which is a really hard one for me, but I am accepting it more<br/>\n&gt; now),<br/>\n&gt; &gt; &gt; and while that thought comes up for me once in a while, I agree and<br/>\n&gt; live by<br/>\n&gt; &gt; &gt; the fact that it is not helpful in any way to blame. (I was removed,<br/>\n&gt; &gt; &gt; unplanned, from my son for 4 weeks when this original TV immersion<br/>\n&gt; &gt; &gt; happened.)<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Reading the unschooling perspectives on TV was very helpful.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Instead of fighting more with my husband, to include the issue of TV, I<br/>\n&gt; &gt; &gt; don&#39;t, and am looking for support and guidance here instead on how to<br/>\n&gt; come<br/>\n&gt; &gt; &gt; to terms with the fact that our son watches TV a lot.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Just putting the computer off in the morning means that he doesn&#39;t walk<br/>\n&gt; by<br/>\n&gt; &gt; &gt; and get reminded to watch it every time, which seems to help...when he<br/>\n&gt; comes<br/>\n&gt; &gt; &gt; up with idea anyway I put it on or go upstairs with him to the tivo TV.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; As for watching &#39;troubling&#39; things together and getting through it, it<br/>\n&gt; &gt; &gt; feels like that point has been really misunderstood. We watch<br/>\n&gt; children&#39;s<br/>\n&gt; &gt; &gt; movies, and all cartoons (Dora, Diego, Little Bear, Miffy), though it<br/>\n&gt; does<br/>\n&gt; &gt; &gt; seem like some of the movies he watches are geared toward olders (like<br/>\n&gt; BEE<br/>\n&gt; &gt; &gt; movie, Ants, Homeward Bound-not a cartoon)<br/>\n&gt; &gt; &gt; Shows that were introduced a year ago that he has been watching and now<br/>\n&gt; he<br/>\n&gt; &gt; &gt; can voice his feelings about it and we can talk about it, I feel like<br/>\n&gt; that<br/>\n&gt; &gt; &gt; is me helping him get through it. When the music is really dramatic and<br/>\n&gt; he<br/>\n&gt; &gt; &gt; starts to get anxious I say, that feeling is suspense and remind him<br/>\n&gt; that it<br/>\n&gt; &gt; &gt; is building up to something happening- usually a positive outcome. I<br/>\n&gt; have<br/>\n&gt; &gt; &gt; stopped asking to skip the part because he doesn&#39;t want that. Like I<br/>\n&gt; &gt; &gt; mentioned before he usually asks to go right to the part that<br/>\n&gt; &#39;troubles&#39; him<br/>\n&gt; &gt; &gt; (the part where nemo gets captured in finding nemo for example) and we<br/>\n&gt; watch<br/>\n&gt; &gt; &gt; it together and just me being there and present helps him through it.<br/>\n&gt; Is<br/>\n&gt; &gt; &gt; this wrong?<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; My decision (because it was mine more than it was my husband&#39;s) for our<br/>\n&gt; &gt; &gt; family to move in with my parents came from meditation and a lot of<br/>\n&gt; thought<br/>\n&gt; &gt; &gt; on my part, and with the agreement and support of my husband. We also<br/>\n&gt; left<br/>\n&gt; &gt; &gt; for 3 months last winter to visit my husband&#39;s native country and his<br/>\n&gt; &gt; &gt; family, who are there.<br/>\n&gt; &gt; &gt; I guess our quarreling is our collective way of saying we are tired of<br/>\n&gt; the<br/>\n&gt; &gt; &gt; constant influence and pressure that comes with the living with<br/>\n&gt; extended<br/>\n&gt; &gt; &gt; family, which is why we are working toward going back to our home.<br/>\n&gt; &gt; &gt; Maybe our son&#39;s way of feeling home right now is to watch his<br/>\n&gt; *favorite*<br/>\n&gt; &gt; &gt; shows. Thank you Sandra for helping me get to this realization.<br/>\n&gt; &gt; &gt; Peace,<br/>\n&gt; &gt; &gt; C<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":240002389,"authorName":"Andrea Catalano","from":"Andrea Catalano &lt;fennel1001@...&gt;","profile":"ajcm1207","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling *babies*","postDate":"1288665726","msgId":57971,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1MDU1Ny4xNzAzNC5xbUB3ZWI1NTAwNy5tYWlsLnJlNC55YWhvby5jb20+"},"prevInTopic":57970,"nextInTopic":57972,"prevInTime":57970,"nextInTime":57972,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... My kids do this, too. I think it is an effort to understand something that has complex emotions, humor and/or various film elements coming together (music","messageBody":"<div id=\"ygrps-yiv-1199221392\">&lt;&lt;&lt;Like I<br/>\n<blockquote><span title=\"ireply\"> &gt; mentioned before he usually asks to go right to the part that &#39;troubles&#39; him<br/>\n&gt; (the part where nemo gets captured in finding nemo for example) and we watch<br/>\n&gt; it together and just me being there and present helps him through it. Is<br/>\n&gt; this wrong?&gt;&gt;&gt;<br/>\n </span></blockquote>My kids do this, too. I think it is an effort to understand something that has complex emotions, humor and/or various film elements coming together (music getting darker or tempo changing, lighting changing, a climax in the story line, timing, etc). My kids (particularly my son who is now 4 but has been doing this for a couple of years) will ask me to replay scenes over and over. He&#39;s pretty expressive so he will often explain what he noticed afterward, as in &quot;All the trucks arrived just before the landslide&quot; or &quot;Right before the stegosaurus was caught the music got loud and scary.&quot; To me, it&#39;s pretty cool that he picks up on this stuff. My rewinding for him gives him the chance to see, think about, and understand something that he&#39;s interested in.<br/>\n<br/>\nAndrea<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288663103","msgId":57970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEQjc1ODg4LTlEMzUtNEEwQi1CNUM2LTQ5QUVDRDE5NkZENUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhbmgyZitycHI3QGVHcm91cHMuY29tPg==","referencesHeader":"PGlhbmgyZitycHI3QGVHcm91cHMuY29tPg=="},"prevInTopic":57969,"nextInTopic":57971,"prevInTime":57969,"nextInTime":57971,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=-I do feel like I still want there with him through traumas at this age (3). Though I guess how traumatic TV is depends on how real it feels to the","messageBody":"<div id=\"ygrps-yiv-763135438\">-=-I do feel like I still want there with him through traumas at this  <br/>\nage (3). Though I guess how traumatic TV is depends on how real it  <br/>\nfeels to the individual...-=-<br/>\n<br/>\n<br/>\nAnd to the individual *child*--not to the child&#39;s mother who is  <br/>\nsearching for reasons to limit him.<br/>\n<br/>\nI think you&#39;re misusing the word &quot;trauma.&quot;  &quot;Trauma&quot; is not &quot;can we  <br/>\nchange the channel?&quot;  Trauma is not vague discomfort, or having a  <br/>\nquestion about death.<br/>\n<br/>\nWe don&#39;t need to discuss what trauma *IS* here--anyone can look it up.<br/>\nWhat I need to say, as owner of the list, is that misusing words and  <br/>\nexaggerating to make a point that goes against what experienced  <br/>\nunschoolers are saying is not a good use of the list, nor of anyone&#39;s  <br/>\ntime to write or to read.<br/>\n<br/>\nWriting isn&#39;t learning.  Defending a position isn&#39;t progress.  &quot;Yeah  <br/>\nbut&quot; isn&#39;t thinking.<br/>\nYou should read a little, try a little, wait a while, and watch.<br/>\n<br/>\n-=-I guess again it returns to how traumatic or &#39;unhealthy&#39; we view TV- <br/>\n=-<br/>\nIt doesn&#39;t &quot;return&quot; there.  That&#39;s your justification for control.<br/>\n<br/>\n-=-On a different page, feel that looking at the screen for extended  <br/>\nperiods of time isn&#39;t good for the eyes! -=-<br/>\nThat&#39;s the very same page--justification for control.<br/>\n<br/>\n-=-I can&#39;t control my son&#39;s health, but I&#39;d like to influence his  <br/>\nhealth positively. Does that look like controling? -=-<br/>\n<br/>\nYou cannot &quot;influence his health positively&quot; by persuading him that  <br/>\nyour fears are more important than his desires and perceptions.<br/>\nThat would influence his mental health and his development in a very  <br/>\ndecidedly negative way, and in the very way unschooling specializes in  <br/>\navoiding.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2010/10/growth.html\">http://justaddlightandstir.blogspot.com/2010/10/growth.html</a><br/>\n<br/>\nIt doesn&#39;t just LOOK like controlling.  It IS controlling.  But you  <br/>\nknow that, or you wouldn&#39;t have asked.<br/>\n<br/>\nRead a little, try a little, wait a while, watch.<br/>\nYou won&#39;t learn about unschooling by arguing with us.  You will learn  <br/>\nabout it (IF you do), by giving your son choices and watching what he  <br/>\ndoes with them.<br/>\n<br/>\nIf you say &quot;How do you feel?&quot; or &quot;Are your eyes hurting?&quot; you&#39;re  <br/>\nplanting the idea that he should be feeling bad, or that his eyes  <br/>\nshould be hurting.  That is manipulative, and it&#39;s trying to use your  <br/>\nson to prove your point.  If his eyes hurt, you win.  If his food  <br/>\nchoices make him feel bad, you win and he loses.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a><br/>\n<br/>\nIn a recent discussion I said two things that could apply here too.   <br/>\n&quot;Children don&#39;t exist to make parents feel good,&quot; and &quot;If you&#39;re  <br/>\nhaving to control yourself, you haven&#39;t relaxed and you&#39;re not really  <br/>\naccepting his choice.&quot;<br/>\n<br/>\nLet him watch television, and instead of controlling him, try to  <br/>\ncontrol your own worries and concerns and hopes that you will be right  <br/>\nand he will be wrong.  Be his partner in learning, and in happiness,  <br/>\nand in joy.  Find ways to see what he is seeing through new, childlike  <br/>\neyes, not from your &quot;things are so bad&quot; negative eyes.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wonder\">http://sandradodd.com/wonder</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\n<br/>\nDon&#39;t write back to the list for a couple of days. Read the links here  <br/>\nand don&#39;t write about it.  Read them and let the ideas sink in.   <br/>\nMeanwhile, watch your child thoughtfully, and softly, and quietly.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":436709932,"authorName":"ceepee12","from":"&quot;ceepee12&quot; &lt;crperlow@...&gt;","profile":"ceepee12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling *babies*","postDate":"1288652687","msgId":57969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhbmgyZitycHI3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9S2Rab3gtYV89XzlOcTJ2M1plNjdNTTVkOGRCZl91THpyR1FDOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57965,"nextInTopic":57970,"prevInTime":57968,"nextInTime":57970,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... I do feel like I still want there with him through traumas at this age (3). Though I guess how traumatic TV is depends on how real it feels to the","messageBody":"<div id=\"ygrps-yiv-1583042505\"><blockquote><span title=\"ireply\">&gt; I am asking these questions because you made it sound like some traumatic<br/>\n&gt; experience that you would rather not have your child go through alone...... <br/>\n&gt; And if he asks you to stay with him then it might just that he wants to<br/>\n&gt; share his excitement at having understood the focal point of the story.<br/>\n<br/>\n </span></blockquote>I do feel like I still want there with him through traumas at this age (3). Though I guess how traumatic TV is depends on how real it feels to the individual...<br/>\nI think you are right about him wanting me to share in the excitement, or at least wanting to have me around to help him understand the focal points.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Sometimes the fear is in the parent and not in the child and that keeps one<br/>\n&gt; perpetually in a thinking and control mode. <br/>\n<br/>\n </span></blockquote>I guess again it returns to how traumatic or &#39;unhealthy&#39; we view TV. On a different page, feel that looking at the screen for extended periods of time isn&#39;t good for the eyes! I can&#39;t control my son&#39;s health, but I&#39;d like to influence his health positively. Does that look like controling? <br/>\nThis also relates to my original post, which included limiting chocolate, and to how we view food (what is healthy/ a healthy amount) and I know the importance lies in decision making skills more than in my &#39;influencing health&#39;. In looking at principles vs. rules, the principle for me is health so instead of &#39;no more TV&#39; or &#39;no more chocolate&#39; I ask things like, do your eyes feel ok? and I explain that looking at the screen for too long can hurt his eyes. Or with food I ask, &#39;does your tummy feel ok?&#39;. This seems to bring him back &#39;into his body,&#39; which for me is a healthy place to be. Does this look like a correct application of principles vs rules?<br/>\nMaybe because the introduction to the TV in such magnitude was so out of my control, since I was gone for it, I have been trying to exert too much influence to make up for it. <br/>\n<br/>\nThe fear of the children being<br/>\n<blockquote><span title=\"ireply\"> &gt; &#39;influenced&#39; by violence, separation, death, love scene, etc etc is what<br/>\n&gt; keeps one in this huge TV phobia. Letting go of these fears will help you in<br/>\n&gt; accepting TV watching more easily.<br/>\n </span></blockquote>I guess to me it&#39;s a question of, without the TV would my 3 year old be exposed to all that he has been exposed to through the TV, and does he need that exposure. It&#39;s not so much a problem, but what about the desensitized frog that doesn&#39;t leap out of the boiling water because after being exposed to such heat, he doesn&#39;t realize it&#39;s boiling? The circumstance is what it is- fact or fault, fine or flawed- I just want to be the best parent I can be to my son.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Just be patient and watch and observe. All will work out.<br/>\n </span></blockquote>I believe, and you seem like a relaxed and realistic parent. A warm Thank you for the input and advice!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; On Sat, Oct 30, 2010 at 9:16 PM, ceepee12 &lt;crperlow@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Thank you everyone for the responses.<br/>\n&gt; &gt; Katherine and Meredith, your personal stories felt heartfelt and helpful<br/>\n&gt; &gt; and meant a lot to me. Thank you for sharing.<br/>\n&gt; &gt;<br/>\n&gt; &gt; It is my husband that got my son into watching TV (and watching while<br/>\n&gt; &gt; eating, which is a really hard one for me, but I am accepting it more now),<br/>\n&gt; &gt; and while that thought comes up for me once in a while, I agree and live by<br/>\n&gt; &gt; the fact that it is not helpful in any way to blame. (I was removed,<br/>\n&gt; &gt; unplanned, from my son for 4 weeks when this original TV immersion<br/>\n&gt; &gt; happened.)<br/>\n&gt; &gt;<br/>\n&gt; &gt; Reading the unschooling perspectives on TV was very helpful.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Instead of fighting more with my husband, to include the issue of TV, I<br/>\n&gt; &gt; don&#39;t, and am looking for support and guidance here instead on how to come<br/>\n&gt; &gt; to terms with the fact that our son watches TV a lot.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Just putting the computer off in the morning means that he doesn&#39;t walk by<br/>\n&gt; &gt; and get reminded to watch it every time, which seems to help...when he comes<br/>\n&gt; &gt; up with idea anyway I put it on or go upstairs with him to the tivo TV.<br/>\n&gt; &gt;<br/>\n&gt; &gt; As for watching &#39;troubling&#39; things together and getting through it, it<br/>\n&gt; &gt; feels like that point has been really misunderstood. We watch children&#39;s<br/>\n&gt; &gt; movies, and all cartoons (Dora, Diego, Little Bear, Miffy), though it does<br/>\n&gt; &gt; seem like some of the movies he watches are geared toward olders (like BEE<br/>\n&gt; &gt; movie, Ants, Homeward Bound-not a cartoon)<br/>\n&gt; &gt; Shows that were introduced a year ago that he has been watching and now he<br/>\n&gt; &gt; can voice his feelings about it and we can talk about it, I feel like that<br/>\n&gt; &gt; is me helping him get through it. When the music is really dramatic and he<br/>\n&gt; &gt; starts to get anxious I say, that feeling is suspense and remind him that it<br/>\n&gt; &gt; is building up to something happening- usually a positive outcome. I have<br/>\n&gt; &gt; stopped asking to skip the part because he doesn&#39;t want that. Like I<br/>\n&gt; &gt; mentioned before he usually asks to go right to the part that &#39;troubles&#39; him<br/>\n&gt; &gt; (the part where nemo gets captured in finding nemo for example) and we watch<br/>\n&gt; &gt; it together and just me being there and present helps him through it. Is<br/>\n&gt; &gt; this wrong?<br/>\n&gt; &gt;<br/>\n&gt; &gt; My decision (because it was mine more than it was my husband&#39;s) for our<br/>\n&gt; &gt; family to move in with my parents came from meditation and a lot of thought<br/>\n&gt; &gt; on my part, and with the agreement and support of my husband. We also left<br/>\n&gt; &gt; for 3 months last winter to visit my husband&#39;s native country and his<br/>\n&gt; &gt; family, who are there.<br/>\n&gt; &gt; I guess our quarreling is our collective way of saying we are tired of the<br/>\n&gt; &gt; constant influence and pressure that comes with the living with extended<br/>\n&gt; &gt; family, which is why we are working toward going back to our home.<br/>\n&gt; &gt; Maybe our son&#39;s way of feeling home right now is to watch his *favorite*<br/>\n&gt; &gt; shows. Thank you Sandra for helping me get to this realization.<br/>\n&gt; &gt; Peace,<br/>\n&gt; &gt; C<br/>\n&gt; &gt;<br/>\n&gt; &gt;  <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288527724","msgId":57965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9S2Rab3gtYV89XzlOcTJ2M1plNjdNTTVkOGRCZl91THpyR1FDOUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlhaGVrdStmOTdhQGVHcm91cHMuY29tPg==","referencesHeader":"PEFBTkxrVGlrQnA0aXZqTV83dWdMQz02U1NQV0QzSGlPRTc0b3ZjbmFhZXhyK0BtYWlsLmdtYWlsLmNvbT4JPGlhaGVrdStmOTdhQGVHcm91cHMuY29tPg=="},"prevInTopic":57964,"nextInTopic":57969,"prevInTime":57964,"nextInTime":57966,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"************ Like I mentioned before he usually asks to go right to the part that troubles him (the part where nemo gets captured in finding nemo for ","messageBody":"<div id=\"ygrps-yiv-931671545\">************ Like I mentioned before he usually asks to go right to the part<br/>\nthat &#39;troubles&#39; him (the part where nemo gets captured in finding nemo for<br/>\nexample) and we watch it together and just me being there and present helps<br/>\nhim through it. Is this wrong?  ************<br/>\n<br/>\nDoes he ask you to watch these parts with him? Or is it something &#39;you&#39; feel<br/>\nhe needs to have &quot;guidance&quot; in watching?<br/>\n<br/>\nThe obvious reason why he likes watching the &#39;troubled part&#39; as you call it,<br/>\nis because that part is generally the crux of any story or film. Does he get<br/>\ndisturbed or scared? Or are you assuming he does and so needs help in going<br/>\n&#39;through&#39; it.?<br/>\n<br/>\nI am asking these questions because you made it sound like some traumatic<br/>\nexperience that you would rather not have your child go through alone......<br/>\n<br/>\nAnd if he asks you to stay with him then it might just that he wants to<br/>\nshare his excitement at having understood the focal point of the story.<br/>\n<br/>\nMy son calls me over and over again to watch only the scene where Titanic<br/>\nhits the ice berg and where it breaks into two parts before finally going<br/>\ndown!!!<br/>\n<br/>\nAnd in Ice Age 3 just before the squirrels are about to kiss he asks me to<br/>\nleave and he blushes. So I respect both his choices......He is just a little<br/>\nabove 4.<br/>\n<br/>\nMy daughter on the other hand gets sick every time she watches Titanic. Yet<br/>\nshe wants to watch...She is 9.<br/>\n<br/>\nSometimes the fear is in the parent and not in the child and that keeps one<br/>\nperpetually in a thinking and control mode. The fear of the children being<br/>\n&#39;influenced&#39; by violence, separation, death, love scene, etc etc is what<br/>\nkeeps one in this huge TV phobia. Letting go of these fears will help you in<br/>\naccepting TV watching more easily.<br/>\n<br/>\nJust be patient and watch and observe. All will work out.<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Oct 30, 2010 at 9:16 PM, ceepee12 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crperlow@...\">crperlow@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thank you everyone for the responses.<br/>\n&gt; Katherine and Meredith, your personal stories felt heartfelt and helpful<br/>\n&gt; and meant a lot to me. Thank you for sharing.<br/>\n&gt;<br/>\n&gt; It is my husband that got my son into watching TV (and watching while<br/>\n&gt; eating, which is a really hard one for me, but I am accepting it more now),<br/>\n&gt; and while that thought comes up for me once in a while, I agree and live by<br/>\n&gt; the fact that it is not helpful in any way to blame. (I was removed,<br/>\n&gt; unplanned, from my son for 4 weeks when this original TV immersion<br/>\n&gt; happened.)<br/>\n&gt;<br/>\n&gt; Reading the unschooling perspectives on TV was very helpful.<br/>\n&gt;<br/>\n&gt; Instead of fighting more with my husband, to include the issue of TV, I<br/>\n&gt; don&#39;t, and am looking for support and guidance here instead on how to come<br/>\n&gt; to terms with the fact that our son watches TV a lot.<br/>\n&gt;<br/>\n&gt; Just putting the computer off in the morning means that he doesn&#39;t walk by<br/>\n&gt; and get reminded to watch it every time, which seems to help...when he comes<br/>\n&gt; up with idea anyway I put it on or go upstairs with him to the tivo TV.<br/>\n&gt;<br/>\n&gt; As for watching &#39;troubling&#39; things together and getting through it, it<br/>\n&gt; feels like that point has been really misunderstood. We watch children&#39;s<br/>\n&gt; movies, and all cartoons (Dora, Diego, Little Bear, Miffy), though it does<br/>\n&gt; seem like some of the movies he watches are geared toward olders (like BEE<br/>\n&gt; movie, Ants, Homeward Bound-not a cartoon)<br/>\n&gt; Shows that were introduced a year ago that he has been watching and now he<br/>\n&gt; can voice his feelings about it and we can talk about it, I feel like that<br/>\n&gt; is me helping him get through it. When the music is really dramatic and he<br/>\n&gt; starts to get anxious I say, that feeling is suspense and remind him that it<br/>\n&gt; is building up to something happening- usually a positive outcome. I have<br/>\n&gt; stopped asking to skip the part because he doesn&#39;t want that. Like I<br/>\n&gt; mentioned before he usually asks to go right to the part that &#39;troubles&#39; him<br/>\n&gt; (the part where nemo gets captured in finding nemo for example) and we watch<br/>\n&gt; it together and just me being there and present helps him through it. Is<br/>\n&gt; this wrong?<br/>\n&gt;<br/>\n&gt; My decision (because it was mine more than it was my husband&#39;s) for our<br/>\n&gt; family to move in with my parents came from meditation and a lot of thought<br/>\n&gt; on my part, and with the agreement and support of my husband. We also left<br/>\n&gt; for 3 months last winter to visit my husband&#39;s native country and his<br/>\n&gt; family, who are there.<br/>\n&gt; I guess our quarreling is our collective way of saying we are tired of the<br/>\n&gt; constant influence and pressure that comes with the living with extended<br/>\n&gt; family, which is why we are working toward going back to our home.<br/>\n&gt; Maybe our son&#39;s way of feeling home right now is to watch his *favorite*<br/>\n&gt; shows. Thank you Sandra for helping me get to this realization.<br/>\n&gt; Peace,<br/>\n&gt; C<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288519124","msgId":57964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2OEFGNjVFLUYyMEYtNEQwOS04RDY1LTdCNzUxODc2NjIyRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhaGVrdStmOTdhQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhaGVrdStmOTdhQGVHcm91cHMuY29tPg=="},"prevInTopic":57963,"nextInTopic":57965,"prevInTime":57963,"nextInTime":57965,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=-It is my husband that got my son into watching TV (and watching while eating, which is a really hard one for me, but I am accepting it more now), and while","messageBody":"<div id=\"ygrps-yiv-1658990234\">-=-It is my husband that got my son into watching TV (and watching  <br/>\nwhile eating, which is a really hard one for me, but I am accepting it  <br/>\nmore now), and while that thought comes up for me once in a while, I  <br/>\nagree and live by the fact that it is not helpful in any way to blame.  <br/>\n(I was removed, unplanned, from my son for 4 weeks when this original  <br/>\nTV immersion happened.) -=-<br/>\n<br/>\nBut this paragraph is all about whose fault it is, and that it&#39;s your  <br/>\nhusband who &quot;got your son into watching TV&quot; (and worse:  watching  <br/>\nwhile he was eating).  And you were away for four weeks, or it would  <br/>\nnot have happened, so it is doubly not your fault.<br/>\n<br/>\nNo one is making you post.  You can read your posts before you send  <br/>\nthem.  But if you write things that reveal beliefs and opinions you  <br/>\nare denying you have, I intend to continue to point that out.<br/>\n<br/>\n-=-Just putting the computer off in the morning means that he doesn&#39;t  <br/>\nwalk by and get reminded to watch it every time, which seems to  <br/>\nhelp...-=-<br/>\n<br/>\nHelp with what?  Help with his learning?  His happiness?  Or &quot;helps&quot;  <br/>\nwith your desire for him not to watch TV?<br/>\n<br/>\n-=-...when he comes up with idea anyway I put it on or go upstairs  <br/>\nwith him to the tivo TV. -=-<br/>\n<br/>\n-=-As for watching &#39;troubling&#39; things together and getting through it,  <br/>\nit feels like that point has been really misunderstood. -=-<br/>\n<br/>\nDon&#39;t write what you can&#39;t defend.  Be as clear and as careful in your  <br/>\nwriting as you can be so that you&#39;re saying what you really believe.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":436709932,"authorName":"ceepee12","from":"&quot;ceepee12&quot; &lt;crperlow@...&gt;","profile":"ceepee12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling *babies*","postDate":"1288453598","msgId":57963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaGVrdStmOTdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrQnA0aXZqTV83dWdMQz02U1NQV0QzSGlPRTc0b3ZjbmFhZXhyK0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57962,"nextInTopic":57964,"prevInTime":57962,"nextInTime":57964,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"Thank you everyone for the responses. Katherine and Meredith, your personal stories felt heartfelt and helpful and meant a lot to me. Thank you for sharing. It","messageBody":"<div id=\"ygrps-yiv-1726680674\">Thank you everyone for the responses.<br/>\nKatherine and Meredith, your personal stories felt heartfelt and helpful and meant a lot to me. Thank you for sharing.<br/>\n<br/>\nIt is my husband that got my son into watching TV (and watching while eating, which is a really hard one for me, but I am accepting it more now), and while that thought comes up for me once in a while, I agree and live by the fact that it is not helpful in any way to blame. (I was removed, unplanned, from my son for 4 weeks when this original TV immersion happened.) <br/>\n<br/>\nReading the unschooling perspectives on TV was very helpful.  <br/>\n<br/>\nInstead of fighting more with my husband, to include the issue of TV, I don&#39;t, and am looking for support and guidance here instead on how to come to terms with the fact that our son watches TV a lot.<br/>\n<br/>\nJust putting the computer off in the morning means that he doesn&#39;t walk by and get reminded to watch it every time, which seems to help...when he comes up with idea anyway I put it on or go upstairs with him to the tivo TV. <br/>\n<br/>\nAs for watching &#39;troubling&#39; things together and getting through it, it feels like that point has been really misunderstood. We watch children&#39;s movies, and all cartoons (Dora, Diego, Little Bear, Miffy), though it does seem like some of the movies he watches are geared toward olders (like BEE movie, Ants, Homeward Bound-not a cartoon) <br/>\nShows that were introduced a year ago that he has been watching and now he can voice his feelings about it and we can talk about it, I feel like that is me helping him get through it. When the music is really dramatic and he starts to get anxious I say, that feeling is suspense and remind him that it is building up to something happening- usually a positive outcome. I have stopped asking to skip the part because he doesn&#39;t want that. Like I mentioned before he usually asks to go right to the part that &#39;troubles&#39; him (the part where nemo gets captured in finding nemo for example) and we watch it together and just me being there and present helps him through it. Is this wrong? <br/>\n<br/>\nMy decision (because it was mine more than it was my husband&#39;s) for our family to move in with my parents came from meditation and a lot of thought on my part, and with the agreement and support of my husband. We also left for 3 months last winter to visit my husband&#39;s native country and his family, who are there. <br/>\nI guess our quarreling is our collective way of saying we are tired of the constant influence and pressure that comes with the living with extended family, which is why we are working toward going back to our home. <br/>\nMaybe our son&#39;s way of feeling home right now is to watch his *favorite* shows. Thank you Sandra for helping me get to this realization. <br/>\nPeace,<br/>\nC</div>","specialLinks":[]},{"userId":258687292,"authorName":"Josh Moll","from":"Josh Moll &lt;josje_wosje@...&gt;","profile":"josje_wosje","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288452521","msgId":57962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNTYyMS43NTE1MC5xbUB3ZWI1MjYwOC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGlhaGM5YyttZzhyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhaGM5YyttZzhyQGVHcm91cHMuY29tPg=="},"prevInTopic":57961,"nextInTopic":57963,"prevInTime":57961,"nextInTime":57963,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"I love the care my husband and son show when they tell me to get out of the television room because I would have nightmares if I would stay and watch. It s ","messageBody":"<div id=\"ygrps-yiv-502614108\">I love the care my husband and son show when they tell me to get out of the <br/>\ntelevision room because I would have nightmares if I would stay and watch. It&#39;s <br/>\ngood to see them together and it&#39;s good not to get scared. I go and have a <br/>\nlovely telephone conversation with a friend or sister...<br/>\nJosh<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thuisschool.wordpress.com/\">http://thuisschool.wordpress.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;From: riasplace3 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:riasplace3@...\">riasplace3@...</a>&gt;<br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n&gt;Sent: Sat, October 30, 2010 5:06:20 PM<br/>\n&gt;Subject: [AlwaysLearning] Re: unschooling *babies*<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;&gt;&gt;&gt; One day 18 years or so ago I walked into the living room and Kirby and <br/>\n&gt;&gt; Marty were standing, watching the end of West Side Story.   That was a <br/>\n&gt;&gt; big mistake on my part--I had gone into the kitchen and forgotten that <br/>\n&gt;&gt; this movie was only to be played up to Officer Krupke, and then turned <br/>\n&gt;&gt; off.<br/>\n&gt;&gt; <br/>\n&gt;&gt; Maria was on the ground holding a gun.   Holy crap!!!<br/>\n&gt;&gt; <br/>\n&gt;&gt;&gt; I knew that was in there, later in the tape, but the kids didn&#39;t.<br/>\n&gt;<br/>\n&gt;When my oldest daughter wanted to watch Gone With the Wind, I  suggested she <br/>\n&gt;turn it off after Bonnie&#39;s birth.  She did, but wanted to watch it again later, <br/>\n&gt;and watched it a little farther, then asked what happened that I didn&#39;t want her <br/>\n&gt;to see.  I explained that it got darker, and Bonnie died, and in the end Melanie <br/>\n&gt;dies, too.  She chose to turn it off again.<br/>\n&gt;<br/>\n&gt;The other day they were watching something with my husband, and when they came <br/>\n&gt;up to bed, she told me, &quot;You wouldn&#39;t want to watch it.  There&#39;s blood and <br/>\n&gt;pain.&quot; <br/>\n&gt;<br/>\n&gt;<br/>\n&gt;I LOVE that being helpful in such instances is reciprocated, because I really <br/>\n&gt;*don&#39;t* want to watch shows with blood and pain. :)<br/>\n&gt;<br/>\n&gt;Ria<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":216914372,"authorName":"riasplace3","from":"&quot;riasplace3&quot; &lt;riasplace3@...&gt;","profile":"riasplace3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling *babies*","postDate":"1288451180","msgId":57961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaGM5YyttZzhyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZERkEyNzVCLTI3RUUtNEIyNC04MTU4LTZFREU2MjM1MDhBREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":57960,"nextInTopic":57962,"prevInTime":57960,"nextInTime":57962,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... When my oldest daughter wanted to watch Gone With the Wind, I  suggested she turn it off after Bonnie s birth.  She did, but wanted to watch it again","messageBody":"<div id=\"ygrps-yiv-1735803849\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; One day 18 years or so ago I walked into the living room and Kirby and  <br/>\n&gt; Marty were standing, watching the end of West Side Story.   That was a  <br/>\n&gt; big mistake on my part--I had gone into the kitchen and forgotten that  <br/>\n&gt; this movie was only to be played up to Officer Krupke, and then turned  <br/>\n&gt; off.<br/>\n&gt; <br/>\n&gt; Maria was on the ground holding a gun.   Holy crap!!!<br/>\n&gt; <br/>\n&gt;&gt; I knew that was in there, later in the tape, but the kids didn&#39;t.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>When my oldest daughter wanted to watch Gone With the Wind, I  suggested she turn it off after Bonnie&#39;s birth.  She did, but wanted to watch it again later, and watched it a little farther, then asked what happened that I didn&#39;t want her to see.  I explained that it got darker, and Bonnie died, and in the end Melanie dies, too.  She chose to turn it off again.<br/>\n<br/>\nThe other day they were watching something with my husband, and when they came up to bed, she told me, &quot;You wouldn&#39;t want to watch it.  There&#39;s blood and pain.&quot;  <br/>\n<br/>\nI LOVE that being helpful in such instances is reciprocated, because I really *don&#39;t* want to watch shows with blood and pain. :)<br/>\n<br/>\nRia</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288417376","msgId":57960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrQnA0aXZqTV83dWdMQz02U1NQV0QzSGlPRTc0b3ZjbmFhZXhyK0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEZCREI2OTQwLUVGMkYtNDkzMC1BMEYwLUNBMTI1NkQ5OUZFOEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGlhZDFwaCtkMG1oQGVHcm91cHMuY29tPgk8RkJEQjY5NDAtRUYyRi00OTMwLUEwRjAtQ0ExMjU2RDk5RkU4QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":57959,"nextInTopic":57961,"prevInTime":57959,"nextInTime":57961,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... Going further, everyone in your family can have years worth of making little decisions as well as building confidence for both individual and family. This","messageBody":"<div id=\"ygrps-yiv-1974251965\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Let him practice making little decisions about whether to keep watching TV or not, and in a dozen years he will have a dozen years worth of practice making decisions.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Going further, everyone in your family can have years worth of making<br/>\nlittle decisions as well as building confidence for both individual<br/>\nand family.<br/>\n<br/>\nThis includes you, making decisions about small momentary things and<br/>\nin my opinion here&#39;s a great talk to listen to for that:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.archive.org/details/RenAllenAndSandraDodd\">http://www.archive.org/details/RenAllenAndSandraDodd</a> and also here&#39;s<br/>\nan important consideration on the road to decision making in parenting<br/>\nand living in general:<br/>\n<br/>\n&quot;... focus on making a &quot;better&quot; choice each time you can. I think that<br/>\nwas the most helpful advice I got as a parent of younger kids - it was<br/>\nsurprisingly practical and encouraging to simply consider at least two<br/>\nchoices and pick the better one. The next time, try to think of the<br/>\none you did choose and then one other - pick the better one. If you<br/>\nmake a choice you&#39;re unhappy with, after the fact, think then about<br/>\nwhat would have been a better choice - have that one &quot;on hand&quot; for<br/>\nnext time.<br/>\n<br/>\nfrom <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/betterchoice\">http://sandradodd.com/betterchoice</a><br/>\n<br/>\nThe same opportunity can include your husband, who might gradually<br/>\nchange perspective but at his pace rather than yours.<br/>\n<br/>\nAnd last but hardly least, your child can have the same chance to make<br/>\ndecisions the same as you and his dad do.<br/>\n<br/>\n*******<br/>\n<br/>\nToday Karl and I were walking in the field by our house. The dark was<br/>\ngathering. It was dusk. He wore sandals and had stopped because his<br/>\ntoe had gotten jabbed on something. He said he would wait for me there<br/>\nwhile I get a band-aid for him. I didn&#39;t want to do that because it<br/>\nwas by the road as far from the house as we could get. I don&#39;t trust<br/>\npeople who might drive by or stop or bother him or who knows what. So<br/>\nI told him no I didn&#39;t want to do that because I don&#39;t like where he&#39;d<br/>\nbe in the dark all the time waiting for me. I suggested some ideas ...<br/>\nwalk on the road instead of in the field, wait a few minutes, walk<br/>\nback the way we came instead of going the whole way around the block.<br/>\nHe decided to walk back on the road and as we walked his toe quit<br/>\nhurting. When we arrived home, he put on a band-aid to protect his toe<br/>\nfor a while.<br/>\n<br/>\nThat&#39;s an example of decision making. By now, Karl is 7 and he&#39;s got a<br/>\nlot of his own decision making going on as a matter of course. I say<br/>\nno sometimes. And I consider what he wants, what his goals might be<br/>\nthat I don&#39;t know about yet or that he has told me about, and show him<br/>\nways to think about possibilities by doing it myself too.<br/>\n<br/>\nAny tv/video/internet viewing that Karl does goes through the same<br/>\nprocess and has for a while. He amazes me because he knows what he<br/>\nwants to see next, what he wants to follow up on, when he wants to<br/>\nstretch his legs (hence our walks), eat, take a break, pull out the<br/>\nLegos or some other thing to do with or without the tv/video/internet.<br/>\nWhen he was a toddler is when we began all that. Here&#39;s some great<br/>\nwritings on tv etc.: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a> which is a smrgsbord<br/>\nto choose from, especially helpful if you&#39;re not quite sure what&#39;s<br/>\nbothering you about your child viewing tv or don&#39;t want to come right<br/>\nout and ask. Others have probably asked about the same thing and then<br/>\nsome!<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling *babies*","postDate":"1288406176","msgId":57959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZzBiMCsxMDA5aEBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PEVBMTdBNkRGLTNDM0EtNDY2OC1CODA3LTZCQUZCQkVEN0E5QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":57958,"nextInTopic":57960,"prevInTime":57958,"nextInTime":57960,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"===Your child needs a peaceful, secure environment.  He needs for his parents to be dependable, mature, warm, and loving.=== My favorite thing Sandra s posted","messageBody":"<div id=\"ygrps-yiv-1314656865\">===Your child needs a peaceful, secure environment.  He needs for his parents to be dependable, mature, warm, and loving.===<br/>\n<br/>\nMy favorite thing Sandra&#39;s posted so far on her Just Add Light and Stir blog (<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/)\">http://justaddlightandstir.blogspot.com/)</a> is about being more peaceful. Part of what she said is this:<br/>\n<br/>\n&quot;If you want to live peacefully, make the more peaceful choice. Peace is all about choices. To have peace in your house, be more peaceful.&quot;<br/>\n<br/>\nWhen nerves are frayed because of living with parents/in-laws, there&#39;s a choice to say or do things that will feed the quarreling and bickering -or- there&#39;s a choice to say or do things that will emphasize &quot;us&quot; and seeing the light at the end of the tunnel and working towards that light together.<br/>\n<br/>\nWhen my son was little, I remember another mom saying: &quot;When they&#39;re the least lovable, that&#39;s when they need love the most&quot;, mostly referring to when kids are whiny or melting down I suppose -- instead of getting angry or frustrated with them, be compassionate and loving. But you know, that works just as well for us adults, too!<br/>\n<br/>\nIf I can see that my husband is tired and irritable, I have the ability to treat him lovingly and kindly and to do sweet things for him to let him know that he is, indeed, still loved when he&#39;s cranky. I can offer a hug and a kiss, or ask if I can snuggle up to him while he&#39;s watching tv. I can make the choice to act / react in ways that will help our home be more peaceful, which is a positive thing for our son, as well as for ourselves.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288401184","msgId":57958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBCNDFGQzQzLUI5RUYtNEUwNC05NzNBLTVCNjk2NUFENUQ0OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhZjN0MSsxb3B2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZjN0MSsxb3B2QGVHcm91cHMuY29tPg=="},"prevInTopic":57957,"nextInTopic":57959,"prevInTime":57957,"nextInTime":57959,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=-I am asking if watching TV is related to us fighting. Sandra s feedback was helpful. Though it is not that we are fighting while he watches TV, or that he","messageBody":"<div id=\"ygrps-yiv-1126731320\">-=-I am asking if watching TV is related to us fighting. Sandra&#39;s  <br/>\nfeedback was helpful. Though it is not that we are fighting while he  <br/>\nwatches TV, or that he goes to the TV when we fight necessarily. -=-<br/>\n<br/>\nHe might have a response hours after a fight.  Or you might think that  <br/>\nbecause you&#39;re not always fighting, he&#39;s not at all affected in the  <br/>\ntimes between.  That&#39;s not how it works.  If his life is stressful,  <br/>\nhis LIFE is stressful, not just the moments when he&#39;s hearing his  <br/>\nparents sound dangerous, or feeling them be tense and shut down,  <br/>\nrather than relaxed and receptive.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288401080","msgId":57957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlBREEzQUFFLUNFNzItNDUwOC04NzJELUNGNEZFOUIxNjI5MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhZjNtcytmMWVoQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZjNtcytmMWVoQGVHcm91cHMuY29tPg=="},"prevInTopic":57956,"nextInTopic":57958,"prevInTime":57956,"nextInTime":57958,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=-if your kids were practicing an unschooling lifestyle with you today would they watch the movie with you to help you get through the disturbance?... would","messageBody":"<div id=\"ygrps-yiv-1233716991\">-=-if your kids were practicing an unschooling lifestyle with you  <br/>\ntoday would they watch the movie with you to help you get through the  <br/>\ndisturbance?... would you still be disturbed? I&#39;m not sure if that is  <br/>\na relevant question since it is backward but I guess it has to do with  <br/>\nthe concept of shielding. -=-<br/>\n<br/>\nRather than asking very convoluted questions, perhaps you could read  <br/>\non Joyce&#39;s site or mine, when you wonder these things.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nWe&#39;ve collected and categorized tons of writing from many years of  <br/>\ndiscussions.<br/>\n<br/>\n&quot;if your kids were practicing an unschooling lifestyle with you today&quot;<br/>\n<br/>\n&quot;Practicing an unschooling lifestyle&quot; is too many words for being  <br/>\npartners.<br/>\n<br/>\nMy kids still advise me about movies and TV shows, if they think  <br/>\nsomething about the humor wouldn&#39;t be my style, or if it&#39;s more  <br/>\nviolent than I like.  That&#39;s not &quot;practicing an unschooling  <br/>\nlifestyle.&quot;  That&#39;s knowing me and liking me.<br/>\n<br/>\n<br/>\n  -=-would they watch the movie with you to help you get through the  <br/>\ndisturbance?... would you still be disturbed? I&#39;m not sure if that is  <br/>\na relevant question since it is backward but I guess it has to do with  <br/>\nthe concept of shielding. &quot;<br/>\n<br/>\nIf it was going to be disturbing to me, having someone there wouldn&#39;t  <br/>\nchange it.  It might be easier, but why voluntarily be disturbed?<br/>\n<br/>\nThe local news disturbs me.  So I don&#39;t watch it.<br/>\n<br/>\nIf I really wanted to watch a movie with someone who had already seen  <br/>\nit, and they warned me when to look away or go to the bathroom, I  <br/>\nwould accept that advice and look away.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288400517","msgId":57956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZERkEyNzVCLTI3RUUtNEIyNC04MTU4LTZFREU2MjM1MDhBREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhZjNtcytmMWVoQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZjNtcytmMWVoQGVHcm91cHMuY29tPg=="},"prevInTopic":57955,"nextInTopic":57957,"prevInTime":57955,"nextInTime":57957,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=-Another apology where it is due. I guess I equated a concept of unschooling with being part of the shield, so that if I am watching something with him,","messageBody":"<div id=\"ygrps-yiv-530170024\">-=-Another apology where it is due.<br/>\nI guess I equated a concept of unschooling with being part of the  <br/>\nshield, so that if I am watching something with him, which I usually  <br/>\nam, I am there to go through the things that make him confused/ <br/>\nunsettled, etc... -=-<br/>\n<br/>\nI don&#39;t understand what you meant by this:  &quot;I guess I equated a  <br/>\nconcept of unschooling with being part of the shield&quot;.<br/>\n<br/>\nIf part of a movie was really sad, I would not sit with a child and go  <br/>\nthrough it with him, I would avoid showing it to him.  Find something  <br/>\nlighter, more appropriate to his preferences, understanding and age.<br/>\n<br/>\nOne day 18 years or so ago I walked into the living room and Kirby and  <br/>\nMarty were standing, watching the end of West Side Story.   That was a  <br/>\nbig mistake on my part--I had gone into the kitchen and forgotten that  <br/>\nthis movie was only to be played up to Officer Krupke, and then turned  <br/>\noff.<br/>\n<br/>\nMaria was on the ground holding a gun.   Holy crap!!!<br/>\n<br/>\nI knew that was in there, later in the tape, but the kids didn&#39;t.<br/>\n<br/>\nOn the TV show Friends there&#39;s a bit about how one of the characters&#39;  <br/>\nmoms always turned Bambi off after the playing in the flowers part.   <br/>\nShe thought she had seen Bambi lots of times, but it was only the  <br/>\nhappy parts.<br/>\n<br/>\nThere was a Disney singalong I would skip part of, too.  Kirby, when  <br/>\nhe was two and three, was afraid of the Pirates of the Caribbean  <br/>\nride.  On video, it scared him.<br/>\n<br/>\nThere are WAY more things to watch now than there were in the 1980&#39;s,  <br/>\ntoo, so it&#39;s not hard to find lots of sweet, interesting things for  <br/>\nlittle kids.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288400231","msgId":57955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBM0E3OTY3LUM3MUYtNDZDMy1CNjA0LTg5QkIwMDhDMDg2REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhZjRmMys3dXFyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZjRmMys3dXFyQGVHcm91cHMuY29tPg=="},"prevInTopic":57954,"nextInTopic":57956,"prevInTime":57954,"nextInTime":57956,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=-I think it has taken mom a while to get used to the fact that we haven t implemented please and thank you as a rule. -=- Then do that.  If you were living","messageBody":"<div id=\"ygrps-yiv-1432203761\">-=-I think it has taken mom a while to get used to the fact that we  <br/>\nhaven&#39;t implemented please and thank you as a rule. -=-<br/>\n<br/>\nThen do that.  If you were living in my house and your chile wasn&#39;t  <br/>\nsaying please and thank you, I would ask him to myself.  I wouldn&#39;t  <br/>\n&quot;make it a rule.&quot;  I wouldn&#39;t withhold food to train him to do it, but  <br/>\nI would say &quot;I&#39;d feel better if you said please,&quot; and I would  <br/>\nCERTAINLY say please and thank you to him.<br/>\n<br/>\nUnschooling doesn&#39;t take children out of the real world.  It&#39;s about  <br/>\nhelping them live IN the real world, even when they&#39;re young.<br/>\n<br/>\n<br/>\n-=-She also might be the one asking about his favorites, or it might  <br/>\nbe dh (who happens to be more of a TV watcher than me. -=-<br/>\n<br/>\nWhat you seem to be saying is that whatever it is, it&#39;s not you.  It&#39;s  <br/>\nsomeone else&#39;s fault/doing/problem.<br/>\n<br/>\nI think you should just let him watch TV.  And meanwhile, work on your  <br/>\nown thoughts and reactions.   It WILL make a difference.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288400046","msgId":57954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBMTdBNkRGLTNDM0EtNDY2OC1CODA3LTZCQUZCQkVEN0E5QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhZjRmMys3dXFyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZjRmMys3dXFyQGVHcm91cHMuY29tPg=="},"prevInTopic":57953,"nextInTopic":57955,"prevInTime":57953,"nextInTime":57955,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=- That we are still living here is a large source of my and dh s quarrels at the moment (we have been here a year). -=- Your husband might be more willing to","messageBody":"<div id=\"ygrps-yiv-461128712\">-=- That we are still living here is a large source of my and dh&#39;s  <br/>\nquarrels at the moment (we have been here a year). -=-<br/>\n<br/>\nYour husband might be more willing to find a way to get you out of  <br/>\nthere if you STOP quarreling and start treating him wonderfully.  He&#39;s  <br/>\nin your family&#39;s territory, and so if you&#39;re mean to him he will feel  <br/>\nextremely outnumbered.   Your child needs a peaceful, secure  <br/>\nenvironment.  He needs for his parents to be dependable, mature, warm,  <br/>\nand loving.  That&#39;s WAY more important than TV or not TV.<br/>\n<br/>\nFirst things first:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spouses\">http://sandradodd.com/spouses</a><br/>\nThere&#39;s something very new there by Schuyler, too.  (Hey, Schuyler...  <br/>\nI put something new by you there yesterday.)<br/>\n<br/>\nThe &quot;source&quot; of your quarrels is your own attitude and actions.<br/>\n<br/>\nYour husband is alive and with you.  Your child is healthy. You have a  <br/>\nplace to live, with electricity.  Probably a soft place to sleep.<br/>\nAttempt to see the positive things in your life, FIRST for the sake of  <br/>\nyour child.  Then for the sake of being a better, clearer person.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling *babies*","postDate":"1288396781","msgId":57953,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZm41ZCtpZG51QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhZjRmMys3dXFyQGVHcm91cHMuY29tPg=="},"prevInTopic":57952,"nextInTopic":57954,"prevInTime":57952,"nextInTime":57954,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... ************* That s pretty important! If you haven t had tv before, he may be wanting to fill up on the exciting new thing. If there s a chance that the","messageBody":"<div id=\"ygrps-yiv-327212835\">&quot;ceepee12&quot; &lt;crperlow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Also worth a mention is that we are living with my parents right now. In our home we don&#39;t have a TV, but here there are about 5.<br/>\n </span></blockquote>*************<br/>\n<br/>\nThat&#39;s pretty important! If you haven&#39;t had tv before, he may be wanting to &quot;fill up&quot; on the exciting new thing. If there&#39;s a chance that the exciting new things will be gone soon, when you go &quot;home&quot; then all the more reason to fill up now. <br/>\n<br/>\nHe could be watching tv because there has been a lot of confusion and change in his life lately and tv is less stressful that what&#39;s been going on around him. As Sandra said, if that means he&#39;s seeing more happy faces and people having fun than he would otherwise, its a good thing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I guess I equated a concept of unschooling with being part of the shield<br/>\n </span></blockquote>**************<br/>\n<br/>\nShield isn&#39;t a great concept to try to apply to unschooling. Your son doesn&#39;t want to be hurt or upset, so its kind and thoughtful to help him avoid those things when you can the way you&#39;d tell a friend if there was an ingredient in a food she didn&#39;t like or a particular size of jeans tended to run small - useful information she can then use to make decisions about the world. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; if I am watching something with him, which I usually am, I am there to go<br/>\n </span></blockquote>through the things that make him confused/unsettled, etc...<br/>\n***************<br/>\n<br/>\nI&#39;m wondering what he wants to watch that&#39;s confusing and unsettling him - I&#39;m puzzled. Especially with a young child for whom talking about feelings etc is pretty abstract, its better to offer things like &quot;want to change the channel?&quot; or pause the movie, or cover your eyes or go to the kitchen for a snack. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;if your kids were practicing an unschooling lifestyle with you today would they<br/>\n </span></blockquote>watch the movie with you to help you get through the disturbance?... <br/>\n****************<br/>\n<br/>\nOkay, I&#39;m confused by this question but I&#39;m going to reply to what I Think is meant. Mo periodically wants to watch something that&#39;s going to have parts that upset her. I try to let her know in advance that there&#39;s going to be content she won&#39;t like and in the past she has come up with a whole bunch of strategies for dealing with that - she might cover her eyes or leave the room or if its a dvd watch the extras first, or watch the movie in another language. I&#39;ve never tried to help her &quot;get through&quot; the upsetting parts other than helping her work out strategies ahead of time and supporting her in the moment - so for instance if we&#39;re watching a movie as a family that none of us have seen before and Mo wants it turned off, we turn it off and look for an alternative (maybe Mo and I will go in another room while the guys watch the movie, for example). <br/>\n <br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":436709932,"authorName":"ceepee12","from":"&quot;ceepee12&quot; &lt;crperlow@...&gt;","profile":"ceepee12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling *babies*","postDate":"1288377635","msgId":57950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZjRmMys3dXFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZCREI2OTQwLUVGMkYtNDkzMC1BMEYwLUNBMTI1NkQ5OUZFOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":57948,"nextInTopic":57951,"prevInTime":57949,"nextInTime":57951,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... Also worth a mention is that we are living with my parents right now. In our home we don t have a TV, but here there are about 5. We are working on moving","messageBody":"<div id=\"ygrps-yiv-1065620144\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; If you&#39;re critical of his watching, and if you *will* let him watch  <br/>\n&gt; &quot;favorite shows,&quot; then he&#39;s learning language and cause and effect by  <br/>\n&gt; calling shows his favorite.  He probably learned it from you and your  <br/>\n&gt; reactions.  Have you ever asked &quot;Is this your favorite?&quot;  He probably  <br/>\n&gt; isn&#39;t clear on what &quot;favorite&quot; means except it&#39;s like &quot;please&quot; (a  <br/>\n&gt; supplication for you to consent to something he wants).<br/>\n<br/>\n<br/>\n </span></blockquote>Also worth a mention is that we are living with my parents right now. In our home we don&#39;t have a TV, but here there are about 5. We are working on moving back to where our home is. That we are still living here is a large source of my and dh&#39;s quarrels at the moment (we have been here a year). <br/>\nAnyway, my parents listen to and respect my unschooling ideas to a certain level, but they model a far different lifestyle than I do.<br/>\nI think it has taken mom a while to get used to the fact that we haven&#39;t implemented please and thank you as a rule. She also might be the one asking about his favorites, or it might be dh (who happens to be more of a TV watcher than me.</div>","specialLinks":[]},{"userId":436709932,"authorName":"ceepee12","from":"&quot;ceepee12&quot; &lt;crperlow@...&gt;","profile":"ceepee12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling *babies*","postDate":"1288377057","msgId":57951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZjN0MSsxb3B2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIyMTc2NS43MDgxNi5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":57950,"nextInTopic":57952,"prevInTime":57950,"nextInTime":57952,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... I am asking if watching TV is related to us fighting. Sandra s feedback was helpful. Though it is not that we are fighting while he watches TV, or that he","messageBody":"<div id=\"ygrps-yiv-959573056\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Are you asking if watching TV is in any way related toyou and yourhusband <br/>\n<br/>\n<br/>\n </span></blockquote>I am asking if watching TV is related to us fighting. Sandra&#39;s feedback was helpful. Though it is not that we are fighting while he watches TV, or that he goes to the TV when we fight necessarily.</div>","specialLinks":[]},{"userId":436709932,"authorName":"ceepee12","from":"&quot;ceepee12&quot; &lt;crperlow@...&gt;","profile":"ceepee12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling *babies*","postDate":"1288376860","msgId":57952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZjNtcytmMWVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgyRTU1OTM4LTNDQTAtNDFCMC05ODIwLTE3MUU2NTkyOEM0NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":57951,"nextInTopic":57953,"prevInTime":57951,"nextInTime":57953,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... Another apology where it is due. I guess I equated a concept of unschooling with being part of the shield, so that if I am watching something with him,","messageBody":"<div id=\"ygrps-yiv-928782075\"><blockquote><span title=\"ireply\">&gt; Sorry, that was unclear, I should have put it as *obviously too young  <br/>\n&gt; for it*, because I meant to sound skeptic of the too young for it  <br/>\n&gt; idea...does that make more sense now?...-=-<br/>\n&gt; <br/>\n&gt; It doesn&#39;t.  It still would have been interpretted as you thinking he  <br/>\n&gt; was to young. That in itself isn&#39;t a problem. I shielded my kids from  <br/>\n&gt; plenty of input when they were little, and they shield me from input  <br/>\n&gt; now, if they&#39;ve seen a movie they think might be disturbing to me.<br/>\n<br/>\n </span></blockquote>Another apology where it is due. <br/>\nI guess I equated a concept of unschooling with being part of the shield, so that if I am watching something with him, which I usually am, I am there to go through the things that make him confused/unsettled, etc... <br/>\nif your kids were practicing an unschooling lifestyle with you today would they watch the movie with you to help you get through the disturbance?... would you still be disturbed? I&#39;m not sure if that is a relevant question since it is backward but I guess it has to do with the concept of shielding. <br/>\nThanks!<br/>\nC</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288319829","msgId":57948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCREI2OTQwLUVGMkYtNDkzMC1BMEYwLUNBMTI1NkQ5OUZFOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhZDFwaCtkMG1oQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZDFwaCtkMG1oQGVHcm91cHMuY29tPg=="},"prevInTopic":57947,"nextInTopic":57950,"prevInTime":57947,"nextInTime":57949,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=- can I watch one of my favorite shows? is something dh and I always smile at because pretty much any show is his favorite show! : )- =- If you re critical","messageBody":"<div id=\"ygrps-yiv-114991693\">-=-&quot;can I watch one of my favorite shows?&quot; is something dh and I  <br/>\nalways smile at because pretty much any show is his favorite show! : )- <br/>\n=-<br/>\n<br/>\nIf you&#39;re critical of his watching, and if you *will* let him watch  <br/>\n&quot;favorite shows,&quot; then he&#39;s learning language and cause and effect by  <br/>\ncalling shows his favorite.  He probably learned it from you and your  <br/>\nreactions.  Have you ever asked &quot;Is this your favorite?&quot;  He probably  <br/>\nisn&#39;t clear on what &quot;favorite&quot; means except it&#39;s like &quot;please&quot; (a  <br/>\nsupplication for you to consent to something he wants).<br/>\n<br/>\n-=-I hope I am not masking my concern. My intention was not to write a  <br/>\nconcerned post, but I would like feedback on people on here&#39;s ideas  <br/>\nabout young children watching TV-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\nYears&#39; and years&#39; worth of feedback on unschoolers&#39; ideas on young  <br/>\nchildren watching TV.<br/>\n<br/>\n-=- One worry I have is that it is escapism~ dh and I have been  <br/>\nfighting a lot the past few months.-=-<br/>\n<br/>\nIf he has a place to hear voices and see faces that are not angry or  <br/>\nthreatening, that is a WONDERFUL escape.  Surely you don&#39;t wish him to  <br/>\nbe present and attentive if you and your husband are fighting.  Thank  <br/>\ngoodness he has a place to escape.   Escapism in such a situation is a  <br/>\nhuge gift and a benefit, isn&#39;t it?<br/>\n<br/>\nRather than think of a word as good or bad (&quot;escapism&quot; &quot;screentime&quot;  <br/>\n&quot;favorite&quot;) look behind the words to your child&#39;s feelings and his  <br/>\nneeds.  As an unschooler, look at what will help him learn (about  <br/>\nANYthing, anytime) and what is comfortable and soothing and fun  <br/>\n(especially if you&#39;re fighting with his dad).<br/>\n<br/>\n-=-Is the tv parallel coincidence or a reaction? Does it matter in an  <br/>\nunschooling perspective?-=-<br/>\n<br/>\nThese are the kinds of things you should be thinking, as you move  <br/>\ntoward unschooling.  Think about how it affects his wellbeing and  <br/>\nlearning.  If he wants to watch TV, does it matter whether it&#39;s  <br/>\ncoincidence, or reaction, or his foot hurts and he needs to sit, or  <br/>\nhe&#39;s fascinated by the different accents or the music or the  <br/>\ncommercials or the cartoons?  Let him practice making little decisions  <br/>\nabout whether to keep watching TV or not, and in a dozen years he will  <br/>\nhave a dozen years worth of practice making decisions.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288319418","msgId":57947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyRTU1OTM4LTNDQTAtNDFCMC05ODIwLTE3MUU2NTkyOEM0NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhZDFkaytobDRsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZDFkaytobDRsQGVHcm91cHMuY29tPg=="},"prevInTopic":57946,"nextInTopic":57948,"prevInTime":57946,"nextInTime":57948,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=- Sorry, that was unclear, I should have put it as *obviously too young for it*, because I meant to sound skeptic of the too young for it idea...does that","messageBody":"<div id=\"ygrps-yiv-1646828416\">-=-<br/>\nSorry, that was unclear, I should have put it as *obviously too young  <br/>\nfor it*, because I meant to sound skeptic of the too young for it  <br/>\nidea...does that make more sense now?...-=-<br/>\n<br/>\nIt doesn&#39;t.  It still would have been interpretted as you thinking he  <br/>\nwas to young. That in itself isn&#39;t a problem. I shielded my kids from  <br/>\nplenty of input when they were little, and they shield me from input  <br/>\nnow, if they&#39;ve seen a movie they think might be disturbing to me.<br/>\n<br/>\nSarcasm depends on facial expression and tone of voice, so unless  <br/>\npeople know each other already pretty well (in person or in writing),  <br/>\nsarcasm in writing won&#39;t work.<br/>\n<br/>\nIt&#39;s important for the purposes of this discussion list to be as clear  <br/>\nand direct as possible, in writing.  It saves the reading and thinking  <br/>\ntime of MANY, many people to be straightforward and plain in your  <br/>\nwriting here.<br/>\n<br/>\nPosts for this list need to fulfill at least one of these criteria:<br/>\n<br/>\nhelps lots of people understand unschooling<br/>\nasks a question that actually needs an answer<br/>\nrequests help seeing different aspects of a situation<br/>\nhelps people have more peaceful and joyful lives (helps lots of people  <br/>\non the list)<br/>\nALL posts should be<br/>\nhonest<br/>\nproofread<br/>\nsincere<br/>\nclear<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearningPOSTS\">http://sandradodd.com/lists/alwayslearningPOSTS</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288315211","msgId":57946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMTc2NS43MDgxNi5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGlhZDFwaCtkMG1oQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZDFwaCtkMG1oQGVHcm91cHMuY29tPg=="},"prevInTopic":57945,"nextInTopic":57947,"prevInTime":57945,"nextInTime":57947,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"One worry I have is that it is escapism~ dh and I have been fighting a lot the past few months. Is the tv parallel coincidence or a reaction? Does it matter in","messageBody":"<div id=\"ygrps-yiv-307526380\">One worry I have is that it is escapism~ dh and I have been fighting a lot the <br/>\npast few months. Is the tv parallel coincidence or a reaction? Does it matter in <br/>\nan unschooling perspective?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nAre you asking if watching TV is in any way related toyou and yourhusband <br/>\nfighting more?<br/>\nOrare you fighting becauseyour son likes to watch moreTV than you oryour <br/>\nhusband are comfortable with?<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":436709932,"authorName":"ceepee12","from":"&quot;ceepee12&quot; &lt;crperlow@...&gt;","profile":"ceepee12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling *babies*","postDate":"1288309361","msgId":57945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZDFwaCtkMG1oQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU4OTlDMTc4LTEwMUYtNDNCNy05QTI3LUNGMTNDOEY3RDg1RUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":57944,"nextInTopic":57946,"prevInTime":57944,"nextInTime":57946,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... GOOD point, thanks! ... can I watch one of my favorite shows? is something dh and I always smile at because pretty much any show is his favorite show! :","messageBody":"<div id=\"ygrps-yiv-1701759388\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; -=-=== he is learning a tremendous amount from watching his &#39;favorite  <br/>\n&gt; shows&#39; as he calls them, and that is why he asks to watch them===<br/>\n&gt; <br/>\n&gt; -=-Actually, he probably asks to watch them because he *enjoys* them!!- <br/>\n<br/>\n </span></blockquote>GOOD point, thanks!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And he probably calls them his favorite shows because they are his  <br/>\n&gt; favorites. :-)<br/>\n&gt; <br/>\n&gt; I didn&#39;t understand why the original poster wrote &quot;his &#39;favorite  <br/>\n&gt; shows&#39; as he calls them&quot; rather than &quot;his favorite shows.&quot;<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>&quot;can I watch one of my favorite shows?&quot; is something dh and I always smile at because pretty much any show is his favorite show! : )<br/>\n<br/>\nI hope I am not masking my concern. My intention was not to write a concerned post, but I would like feedback on people on here&#39;s ideas about young children watching TV. One worry I have is that it is escapism~ dh and I have been fighting a lot the past few months. Is the tv parallel coincidence or a reaction? Does it matter in an unschooling perspective?<br/>\nThanks!<br/>\nC</div>","specialLinks":[]},{"userId":436709932,"authorName":"ceepee12","from":"&quot;ceepee12&quot; &lt;crperlow@...&gt;","profile":"ceepee12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling *babies*","postDate":"1288308980","msgId":57944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZDFkaytobDRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhYXE3cys2ZHFlQGVHcm91cHMuY29tPg=="},"prevInTopic":57936,"nextInTopic":57945,"prevInTime":57943,"nextInTime":57945,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"... Sorry, that was unclear, I should have put it as *obviously too young for it*, because I meant to sound skeptic of the too young for it idea...does that","messageBody":"<div id=\"ygrps-yiv-1741098945\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; ===It also seems that if something is puzzling or troubling to him he asks to watch it again and again. My (learned) instinct is to try to shield him from this trouble, because he is *obviously* too young for it.===<br/>\n&gt; <br/>\n&gt; Could you clarify what &quot;trouble&quot; you&#39;re trying to shield him from in what he&#39;s watching? I also don&#39;t understand what you mean when you say he&#39;s &quot;obviously too young for it [this trouble]&quot; - I don&#39;t think age 1 or age 3 are at all too young to be troubled by something, but I&#39;m just unclear as to what that something is to which you&#39;re referring.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Glenda<br/>\n<br/>\n </span></blockquote>Sorry, that was unclear, I should have put it as *obviously too young for it*, because I meant to sound skeptic of the too young for it idea...does that make more sense now?...</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling *babies*","postDate":"1288244250","msgId":57936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4OTlDMTc4LTEwMUYtNDNCNy05QTI3LUNGMTNDOEY3RDg1RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlhYXE3cys2ZHFlQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhYXE3cys2ZHFlQGVHcm91cHMuY29tPg=="},"prevInTopic":57933,"nextInTopic":57944,"prevInTime":57935,"nextInTime":57937,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"-=-=== he is learning a tremendous amount from watching his favorite shows as he calls them, and that is why he asks to watch them=== -=-Actually, he","messageBody":"<div id=\"ygrps-yiv-1556839853\">-=-=== he is learning a tremendous amount from watching his &#39;favorite  <br/>\nshows&#39; as he calls them, and that is why he asks to watch them===<br/>\n<br/>\n-=-Actually, he probably asks to watch them because he *enjoys* them!!- <br/>\n=-<br/>\n<br/>\nAnd he probably calls them his favorite shows because they are his  <br/>\nfavorites. :-)<br/>\n<br/>\nI didn&#39;t understand why the original poster wrote &quot;his &#39;favorite  <br/>\nshows&#39; as he calls them&quot; rather than &quot;his favorite shows.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling *babies*","postDate":"1288236092","msgId":57933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhYXE3cys2ZHFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhN3Q4NSt0dXJlQGVHcm91cHMuY29tPg=="},"prevInTopic":57931,"nextInTopic":57936,"prevInTime":57932,"nextInTime":57934,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"=== he is learning a tremendous amount from watching his favorite shows as he calls them, and that is why he asks to watch them=== Actually, he probably asks","messageBody":"<div id=\"ygrps-yiv-783393781\">=== he is learning a tremendous amount from watching his &#39;favorite shows&#39; as he calls them, and that is why he asks to watch them===<br/>\n<br/>\nActually, he probably asks to watch them because he *enjoys* them!!<br/>\n<br/>\nThere are certain movies I watch repeatedly because I find them amusing - at no point am I thinking, &quot;I&#39;m learning a lot from this movie.&quot; <br/>\n<br/>\nThere doesn&#39;t have to be a &quot;learning experience&quot; in a tv show or movie in order for it to be enjoyable to whomever is viewing it. <br/>\n<br/>\nThat said, I know that shows geared towards younger kids tend to be blantantly educational in nature. But that aspect of it may not be at all why your son asks to watch his favorite shows over and over, and understanding that will be helpful as he gets older and chooses new favorite shows that don&#39;t scream &quot;educational&quot;.<br/>\n<br/>\n<br/>\n===It also seems that if something is puzzling or troubling to him he asks to watch it again and again. My (learned) instinct is to try to shield him from this trouble, because he is *obviously* too young for it.===<br/>\n<br/>\nCould you clarify what &quot;trouble&quot; you&#39;re trying to shield him from in what he&#39;s watching? I also don&#39;t understand what you mean when you say he&#39;s &quot;obviously too young for it [this trouble]&quot; - I don&#39;t think age 1 or age 3 are at all too young to be troubled by something, but I&#39;m just unclear as to what that something is to which you&#39;re referring.<br/>\n<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":436709932,"authorName":"ceepee12","from":"&quot;ceepee12&quot; &lt;crperlow@...&gt;","profile":"ceepee12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"unschooling *babies*","postDate":"1288140869","msgId":57931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhN3Q4NSt0dXJlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":57933,"prevInTime":57930,"nextInTime":57932,"topicId":57931,"numMessagesInTopic":0,"msgSnippet":"Hi, I have been reading about unschooling for 6 months, although I have known since before I gave birth that I would *homeschool* my children. Now the babes","messageBody":"<div id=\"ygrps-yiv-1776920160\">Hi, I have been reading about unschooling for 6 months, although I have known since before I gave birth that I would *homeschool* my children. Now the babes are 1 yr and 3 yrs old, both boys.<br/>\nI have been lurking on this forum for about a month and am looking for advice on the early stages of unschooling. <br/>\nI actually feel like I am doing some deschooling with 3yo at the moment because I had my *no*-based rules, like no more tv/chocolate, and that was pretty much it... So I have been really consciously trying to ease up with those no&#39;s. <br/>\nI guess my children are my own best guides on how to weave unschooling in with these earliest years of development. Obviously there can be no time that&#39;s *too early* to apply the unschooling foundations.<br/>\nSometimes from somewhere in the back of my mind (from how my own childhood was structured?) it kicks in that, I *need* to tell him when enough tv/chocolate is enough, to teach him, in fact I have until recently...<br/>\nI think the answer in an unschooling way to the TV is that he is learning a tremendous amount from watching his &#39;favorite shows&#39; as he calls them, and that is why he asks to watch them. It also seems that if something is puzzling or troubling to him he asks to watch it again and again. My (learned) instinct is to try to shield him from this trouble, because he is *obviously* too young for it.  <br/>\nThe protection instinct is so strong still at this age, it is always me reminding myself to trust the circumstances given to us and to trust ourselves to navigate them together. <br/>\nThanks to all for the support and sharing that goes on here!<br/>\nPeace,<br/>\nC</div>","specialLinks":[]}],"prevTopicId":57992,"nextTopicId":58022}}