{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":118406848,"authorName":"joylyn","from":"joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"schools","postDate":"1066702711","msgId":16878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOTQ5Nzc3LjQwNzA3MDBAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDAwMzMwMWMzOTczMyQ5Y2FiM2NhMCRhMGQ4YWNjZkBIQUw5MDAwPg==","referencesHeader":"PHAwNTIxMDYwNWJiYjY1NGRlMDEzOUBbMTkyLjE2OC4xMjMuMTAxXT4JPDUuMS4wLjE0LjIuMjAwMzEwMTkyMDIzMzcuMDE4MzJlYTBAaW5jb21pbmcudmVyaXpvbi5uZXQ+IDwwMDMzMDFjMzk3MzMkOWNhYjNjYTAkYTBkOGFjY2ZASEFMOTAwMD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":16877,"nextInTime":16879,"topicId":16878,"numMessagesInTopic":0,"msgSnippet":"Just a vent here. Today I was helping students out, walking around.  Behind one of my favorite students was a small gun.  It looked real.  But it was on a ","messageBody":"<div id=\"ygrps-yiv-1803076964\">Just a vent here.<br/>\n<br/>\nToday I was helping students out, walking around.  Behind one of my <br/>\nfavorite students was a small gun.  It looked real.  But it was on a <br/>\nkeychain and was, I think, too small to be real.  I picked it up and <br/>\nasked him about it.  Our school has a policy, kids get expelled with <br/>\neven fake or toy guns.  I had just reached this kid.  He has a high <br/>\nreading level, high school (this is 6th grade), but I can tell he&#39;s <br/>\nalways been a trouble maker... Finally in my class and in other classes <br/>\nhe&#39;s been doing well.  This started about two weeks ago when I told him <br/>\nhe had the highest reading score in both my classes (true) andthat he <br/>\nwas college material (also true) but that he needed to stop playing <br/>\nsilly games and get to work.  He did.  FOr the last two weeks he has <br/>\nturned all his homework in, gotten &quot;A&#39;s on his tests, etc.  And now <br/>\nthis, a gun.  He told me it was a cap gun, which is even worse than just <br/>\na toy gun.  It was likely he would be expelled.  This was not going to <br/>\nbe pretty.<br/>\n<br/>\nI called the guy in charge of this and he sent one of his people over, <br/>\nEarl, whom I really like. I  spoke with him in detail, explaining how <br/>\nthis kid really needed a chance.  He decided to let me handle it, after <br/>\nhe scared the hell out of this kid.  So the kid gets off with just a <br/>\nreally stern warning, he is so grateful to me, it&#39;s almost sad.  But <br/>\nreally  I think this will be the final kick in the seat thiskid needs.  <br/>\nI used to think anyone could homeschool.  I don&#39;t believe that anymore.  <br/>\nMost (not all,only most) of the parents of the kids I have cannot <br/>\nhomeschool. I think it&#39;s sad, but true.<br/>\n<br/>\nThe other day in staff meeting we were looking at some expert&#39;s 9 relms <br/>\nof education, with the last one being responsibility or something, where <br/>\nthe kid is responsible for their own education, for life long learning.  <br/>\nI somehow ended up &quot;defining&quot; that part of education and man was it <br/>\neasy.  Students not only can be but should be responsible for their own <br/>\neducation, for their own learning, and that they can assess themselves <br/>\nfor their level of understanding, and that the primary responsibility <br/>\nfor education should fall upon the students and not the teachers or <br/>\nparents, and that all goals should reach toward life long learning.  No <br/>\nbrainer for folks here, but I doubt anyone in the room got it, as they <br/>\nareso into the idea that kids have to be TAUGHT. <br/>\nok, vent over...<br/>\n<br/>\nI do love teaching, I love the kids and I think for some I am making a <br/>\ndifference, however slight.  There are these boys who have always gotten <br/>\naway with being cute and shuffling and not doing anything, and I&#39;m <br/>\npushing them to figure out how to play the system, becuase ultimately <br/>\nthat is their way out. <br/>\n<br/>\nThe other day I had a thought...I&#39;m not teaching these kids for them, <br/>\nI&#39;m teaching these kids for their children.  If I can instill a love of <br/>\nlearning and a desire to go to college and get out of the ghetto then <br/>\nmaybe these children will homeschool their own children.  maybe?<br/>\n<br/>\nJoylyn<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":16875,"nextTopicId":16874}}