{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"kickaboo@juno.com","from":"kickaboo@...","replyTo":"LIST","senderId":"pC_uaXiKLBYAMZp3iIE6amXERbBMRn6eaad2VNz_3Fvddyc-Ze5rI3iQpqz4pzLe62456OVGzts","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: dyslexia / self esteem","postDate":"950644484","msgId":6551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MjEuNjU1MS45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":6549,"nextInTopic":0,"prevInTime":6550,"nextInTime":6552,"topicId":6549,"numMessagesInTopic":0,"msgSnippet":"Carol, The boys have a long way to go and they have many obstacles to overcome and they will probably never be brain surgeons, but if they are happy and ","messageBody":"<div id=\"ygrps-yiv-1341723487\">Carol,<br/>\n<br/>\nThe boys have a long way to go and they have many obstacles to overcome<br/>\nand they will probably never be brain surgeons, but if they are happy and<br/>\ncontributing humans I will have done what I set out to do. Keith is 11<br/>\nand reads about on a 2nd or 3rd grade level, I try to avoid tests and<br/>\nother things that just set them up to fail, instead of worrying about<br/>\nwhat they cannot do we find things they can do and we build on it, then<br/>\nsoon they can do something they could not do. I think in the natural<br/>\norder of things we all develop differently and that includes reading and<br/>\nwriting, some of the most intelligent people I know can barely read and<br/>\nyou cannot read their handwriting, but they have so much to offer the<br/>\nworld. I hate labels and have left off some of the more insulting things<br/>\nthat have been said by teachers, but it was not good for the boys.<br/>\nIntelligence is not a factor, they have high IQ&#39;s, but if they did not it<br/>\nwould not change their value as human beings and of course because they<br/>\nare my kids I think they are pretty wonderful even when they are driving<br/>\nme wild. My sister in law told me the only thing I needed to be able to<br/>\nteach my kids was love and the rest would work out, she is mostly right,<br/>\nbut it is hard to not have anyone to talk to about it. My husband works<br/>\nterrible hours and travels with his job, we do go visit him alot, but it<br/>\nis not a good support system as he is almost always working, we get a<br/>\nsmall amount of his time and I hate to take his attention away from doing<br/>\nthings with the boys to talk about what they have been doing, does that<br/>\nmake sense at all? I do not want my kids to be normal, they are wonderful<br/>\nand unique and exceptional human beings, why would I want to settle for<br/>\nnormal. I am so glad I finally made this decision and so are they. We&#39;ve<br/>\nonly just gotten home from a trip to see both grandma&#39;s and the boys were<br/>\nso excited to tell their aunts and uncles about homeschooling and try to<br/>\ntalk them into doing it with their kids, so far only myself and the<br/>\nsister in law that encouraged me do, but I live in hope that it is<br/>\nspreading, all my children have made the commitment to homeschool their<br/>\nchildren, so at least in this branch of the tree it is flourishing.<br/>\nSharon<br/>\n________________________________________________________________<br/>\nYOU&#39;RE PAYING TOO MUCH FOR THE INTERNET!<br/>\nJuno now offers FREE Internet Access!<br/>\nTry it today - there&#39;s no risk!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/tagj.\">http://dl.www.juno.com/get/tagj.</a></div>","specialLinks":[]},{"userId":0,"authorName":"Brown","from":"Brown &lt;mjcmbrwn@...&gt;","replyTo":"LIST","senderId":"m82p0_Mwk4sTAk5RtVkvypI3CC9GFP1rZS5VCq9DAMLoZjFA8FohXBz4V2L4OKOTrHEWDE-2QaVxvIjDoK2hVBUd","spamInfo":{"isSpam":false,"reason":"0"},"subject":"dyslexia / self esteem","postDate":"950641876","msgId":6549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MjEuNjU0OS45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":6551,"prevInTime":6548,"nextInTime":6550,"topicId":6549,"numMessagesInTopic":0,"msgSnippet":"The problem with dyslexia / reading and ps is, IMO, just what you say - the attitudes that are presented and then absorbed by the kids. 2 of my 4 have reading","messageBody":"<div id=\"ygrps-yiv-2023904713\">The problem with dyslexia / reading and ps is, IMO, just what you say - the<br/>\nattitudes that are presented and then absorbed by the kids. 2 of my 4 have<br/>\nreading / writing problems that would probably have been diagnosd as dyslexia<br/>\nif I had ever let them near an &#39;expert&#39;. One learnt to read - when he was<br/>\nready - at 9 1/2, the other at 12. Neither will probably be much good at<br/>\nspelling. Greg has almost &#39;no qualifications&#39; but was able to exude<br/>\nconfidence and ability enough to get a job with a beekeeper at the age of 17<br/>\nand has held down that job for 15 months. He is now taking a break to come<br/>\nhome and help us build our house. If he&#39;d been at school, all attention would<br/>\nhave been focused on his &#39;failures&#39; with reading and writing. Instead we have<br/>\nbeen able to encourage him in his strengths. My 12yo has extraordinary powers<br/>\nof observation and intuition. Not sure where they will take him, but I am<br/>\nsure that these qualities would have been &#39;beaten&#39; out of him - watching<br/>\nbirds out of windows is not acceptable in the face of not being able to<br/>\nspell!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Erick, the<br/>\n&gt; 8 yo could not read, at all, barely recognized 1/2 of the alphabet and<br/>\n&gt; they passed him to 2nd grade, when I objected they told me that he would<br/>\n&gt; never be normal and they had to keep his self esteem up, he has no self<br/>\n&gt; esteem problems<br/>\n<br/>\n </span></blockquote>Soon would have - the more schools try to pretend, the worse it gets. To keep<br/>\nself esteem up, the kid needs honesty, not pretense. Yes, not being able to<br/>\nread and write well creates difficulties. How can we do something about it?<br/>\nWhat strengths can we encourage to compensate? It is so important that the<br/>\nkid sees himself as a worthwhile whole person who has strengths *and*<br/>\nweaknesses, and that he is valuable for who he is, and for who he may become,<br/>\nand that he isn&#39;t made helpless by suggestions - however they are put - that<br/>\nthere is an inevitability about the outcome of his life.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyway that was what made my final<br/>\n&gt; decision, I had been looking into it for 2 years, but to be honest did<br/>\n&gt; not know if I was patient enough to give them the education they deserve,<br/>\n&gt; now I wonder why it took me so long.<br/>\n<br/>\n </span></blockquote>Like school teachers are always so patient LOL<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I<br/>\n&gt; am so sorry I did not have the courage to do this for my other kids, they<br/>\n&gt; missed so much and so did I by trusting that the school knew best. I have<br/>\n&gt; I have 11 grandchildren and will homeschool or help with most of them, it<br/>\n&gt; has become a family commitment.<br/>\n<br/>\n </span></blockquote> I really admire someone who takes the decision to homeschool after so many<br/>\nyears of entrenchment in the system - Congratulations, that took a lot of<br/>\ncourage.<br/>\n<br/>\nCarol</div>","specialLinks":[]}],"prevTopicId":6522,"nextTopicId":6553}}