{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re:No Explanation Needed / Christians Again","postDate":"1050193195","msgId":64555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlOS42NmFmZDM0LjJiY2EwNzJiQGFvbC5jb20+"},"prevInTopic":64526,"nextInTopic":0,"prevInTime":64554,"nextInTime":64556,"topicId":64526,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/12/2003 4:23:47 PM Eastern Daylight Time, ... Yes, yes, yes, and yes. I came here knowing I knew next to nothing about unschooling in the","messageBody":"<div id=\"ygrps-yiv-2007556579\">In a message dated 4/12/2003 4:23:47 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HOMESCHOOL4GOOD@...\">HOMESCHOOL4GOOD@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Did you do this before joining this <br/>\n&gt; group? Did you go and read all the archives? Did you visit Sandra&#39;s site? <br/>\n&gt; Do <br/>\n&gt; you use google? Sure we may come here thinking we know it all and may be a <br/>\n&gt; bit defensive but the way you have handled all of this gives me a headache. <br/>\n&gt; <br/>\n&gt; For someone that has claimed to have gone through so much, why can&#39;t you <br/>\n&gt; just <br/>\n&gt; ask questions?  I<br/>\n<br/>\n </span></blockquote>Yes, yes, yes, and yes. I came here knowing I knew next to nothing about <br/>\nunschooling in the context most of the ladies do and I&#39;ve repeatedly said so, <br/>\nand said I&#39;m grateful for their experience, their thoughts and willingness to <br/>\nshare.  I do ask questions LOTS of questions.<br/>\n<br/>\nAnd like it has been said before I&#39;m glad YOU got it, no explanation needed, <br/>\nbut there are over a thousand people here.  It&#39;s not wrong to say you don&#39;t <br/>\nbelieve in whipping babies or buying a rod to beat your child and that you <br/>\ndon&#39;t want associated with them.  It&#39;s just NOT.<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138320127,"authorName":"HOMESCHOOL4GOOD@aol.com","from":"HOMESCHOOL4GOOD@...","profile":"homeschool4good","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:No Explanation Needed / Christians Again","postDate":"1050178976","msgId":64526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNy4yMWNlZTg0Ni4yYmM5Y2ZhMEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":64555,"prevInTime":64525,"nextInTime":64527,"topicId":64526,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/12/03 12:50:59 PM, Unschooling-dotcom@yahoogroups.com writes:  Newbie here! Don t need special wording to understand that I was not ","messageBody":"<div id=\"ygrps-yiv-1476543313\">In a message dated 4/12/03 12:50:59 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt; &gt; Newbie here! Don&#39;t need special wording to understand that I was not <br/>\nbeing <br/>\n<blockquote><span title=\"ireply\"> &gt; insulted for being Christian.<br/>\n<br/>\n </span></blockquote>I&#39;m glad you didn&#39;t feel insulted.  If was very apparent that it was <br/>\nclassifying an entire group of people &quot;Christians&quot; as exhibiting behaviours <br/>\nthat I would certainly not want associated with me at all.<br/>\n<br/>\nI&#39;ve found that on this list you need to be especially clear what you are <br/>\ntalking about or who you are referring to in order to make your point clear <br/>\nand get the answers you are looking for.  It does make a difference in how <br/>\nothers respond to you.<br/>\n<br/>\nEither way, I&#39;m VERY glad that others have decided to not lump me in with <br/>\nthat group of radical &quot;christian homeschoolers&quot; that I suspect would probably <br/>\nSTILL raise their children the very same way they do without a church or <br/>\n&quot;religion&quot; but find the church a comfortable excuse or the acceptance of <br/>\ntheir behaviours somehow reassuring.<br/>\n<br/>\nI&#39;m sure that Sandra would not be offended if I were to tell you all about <br/>\nthe two unschooling families that I am familiar with who now have children <br/>\nwho are 19 and 20 (and a handful of younger ones too) that can&#39;t read, can&#39;t <br/>\nwrite, can barely be verbal in any social situation.  They know nothing about <br/>\ngetting along in the world.  It&#39;s very sad really.  There are lots of things <br/>\nI could tell you about them, but there is no need because it wouldn&#39;t change <br/>\ntheir circumstances for them.<br/>\n<br/>\nBUT if I were to say things about these unschoolers as fact, I&#39;m sure that <br/>\nSandra would feel the need to point out that they are NOT unschoolers in her <br/>\nsense of the word.  You don&#39;t want others to misunderstand or think you <br/>\napprove or accept things like rods with names, whipping babies to change them <br/>\nand the like.<br/>\n<br/>\nLast time I&#39;m gonna try to explain why it is offensive to be grouped in with <br/>\nthese radicals.  If it didn&#39;t offend you, I&#39;m glad, it does bother me enough <br/>\nto make sure no one thinks I am a part of that.<br/>\n<br/>\nglena<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n </span></blockquote>First Glena, you don&#39;t need to explain anything to me! Second, If you looked <br/>\ninto this group and read and did your research you would KNOW without having <br/>\nto jump, that this group is NOT associated with these radicals. Why would <br/>\nsomeone or anyone here that does not associate with these radicals try to <br/>\ngroup one of us unschoolers in with them? Just don&#39;t get your point and I <br/>\nreally don&#39;t care to. I find in this group that you have to listen to what is <br/>\nbeing said and not to be so defensive. Newbies are supposed to sit back and <br/>\nlisten, read, research and the such. Did you do this before joining this <br/>\ngroup? Did you go and read all the archives? Did you visit Sandra&#39;s site? Do <br/>\nyou use google? Sure we may come here thinking we know it all and may be a <br/>\nbit defensive but the way you have handled all of this gives me a headache. <br/>\nFor someone that has claimed to have gone through so much, why can&#39;t you just <br/>\nask questions?  I was not offended because I know what I am and where I am. <br/>\nDo you? I didn&#39;t need this issue to be beaten to death to see that I was not <br/>\nbeing grouped. You don&#39;t have to keep on explaining why you became defensive <br/>\nbut I sure hope you learn from it and just ask, research and listen and stop <br/>\nbeing so defensive. Thanks but no thanks I don&#39;t need to hear about the 2 <br/>\nunschooling families you are familiar with, I&#39;m busy with more important <br/>\nthings like learning from this group and getting all I can from them so that <br/>\nI can be a better parent. You see I have a teenage boy who was in the public <br/>\nschool and because of them and because of us NOT LISTENING he was hurt. I now <br/>\nhave to live with his slight brain damage, hearing loss, vision loss and <br/>\nextreme anger towards children and adults not to mention all the guilt. My <br/>\nhusband and I have made great progress with him and I owe it all to this <br/>\nlist. If I thought they were anything than what they say they are, I sure <br/>\nwould not be here. <br/>\n~Kim</div>","specialLinks":[]}],"prevTopicId":64507,"nextTopicId":63803}}