{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1658973,"authorName":"Barb Eaton","from":"Barb Eaton &lt;homemama@...&gt;","profile":"homesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] housekeeping and parenting","postDate":"1046877750","msgId":60125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBOEI4MDY1LjE3MTg2JWhvbWVtYW1hQGluZmluZXQuY29tPg==","inReplyToHeader":"PDFkZS4zOTQ2YWRlLjJiOTY0OWFmQGFvbC5jb20+"},"prevInTopic":60035,"nextInTopic":0,"prevInTime":60124,"nextInTime":60126,"topicId":60035,"numMessagesInTopic":0,"msgSnippet":"Sandra, I want to thank you for always including the article with your posts. I can t always get to the links sent and it s so nice to be able to read it while","messageBody":"<div id=\"ygrps-yiv-109106414\">Sandra,<br/>\n    I want to thank you for always including the article with your posts. I<br/>\ncan&#39;t always get to the links sent and it&#39;s so nice to be able to read it<br/>\nwhile I&#39;m reading everything else.<br/>\n<br/>\nBarb E<br/>\n&quot;Children have more need of models than of critics.&quot;<br/>\n<br/>\n- Carolyn Coats, Author</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"housekeeping and parenting","postDate":"1046802351","msgId":60035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZS4zOTQ2YWRlLjJiOTY0OWFmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":60125,"prevInTime":60034,"nextInTime":60036,"topicId":60035,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/4/03 11:00:35 AM, ddzimlew@juno.com writes:  Deb wrote that.  FIRST the mom has to figure out how to be happy","messageBody":"<div id=\"ygrps-yiv-1533062025\">In a message dated 3/4/03 11:00:35 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<br/>\n&lt;&lt; Happy, happy, happy. &gt;&gt;<br/>\n<br/>\nDeb wrote that. &lt;g&gt;<br/>\n<br/>\nFIRST the mom has to figure out how to be happy now.<br/>\n<br/>\nNot happy when the house is clean.  Happy without the house being clean.<br/>\n<br/>\nThe mom has to find joy in being a mom.  Maybe she could end up living in a <br/>\ntent (with a dirt floor!) and would she still be happy?  Maybe she will break <br/>\nher leg and live on the couch for a month and a half.  It can happen.  Will <br/>\nshe still be a mom who&#39;s joyful to see her children?  Or will she have to be <br/>\nmiserable until she can wax her floor?<br/>\n<br/>\nI never birthed a linoleum floor, nor the wood one in Holly&#39;s room, nor the <br/>\ntile in Marty&#39;s room, nor the carpet in Kirby&#39;s.    But Holly, Marty and <br/>\nKirby are mine to keep safe and well and happy.   They need a happy mom more <br/>\nthan they need a floor they could eat off of.<br/>\n<br/>\nThis is pretty applicable.  If what&#39;s below is messy, it&#39;s at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/library/essays/essay06.shtml\">http://www.unschooling.com/library/essays/essay06.shtml</a><br/>\n<br/>\nREJECTING A PRE-PACKAGED LIFE<br/>\nby Sandra Dodd <br/>\n<br/>\n------------------------------------------------------------------------<br/>\nHow many things do you do because you&#39;re supposed to, because your relatives <br/>\nand neighbors expect it, because it&#39;s easy and you don&#39;t have to think about <br/>\nit? How many of those things are taking you and your kids in a positive and <br/>\nhealthy direction?<br/>\n<br/>\n&quot;Changing paradigms&quot; is an option! If you&#39;re operating on oneferently. It&#39;s <br/>\njust thinking. It won&#39;t hurt you.<br/>\nIs school the center of children&#39;s lives? Should it be?<br/>\n<br/>\nIs the only acceptable goal of adult life having the most expensive house and <br/>\nfurniture credit will buy?<br/>\nIt doesn&#39;t take much of a shift to consider house and education secondary <br/>\ninstead of primary. What might be primary then? Health? Joy? Togetherness and <br/>\nlove? <br/>\n<br/>\nPart of the pre-packaged life Americans are issued is the idea that happiness <br/>\ncomes after college, after home ownership, after the new car. The stick that <br/>\nholds that carrot will not bend. If happiness depends on performance and <br/>\nacquisition, how long will it last? How long is your car the newest on your <br/>\nstreet before unhappiness returns?<br/>\n<br/>\nHere&#39;s a little paradigm shift for you to practice on. Perhaps happiness <br/>\nshouldn&#39;t be the primary goal. Try joy. Try the idea that it might be <br/>\nenJOYable to cook, to set the table, to see your family, rather than the idea <br/>\nthat you&#39;ll be happy after dinner&#39;s done and cleaned up. My guess is that <br/>\nsuch happiness might last a couple of seconds before you look around and see <br/>\nsomething else between you and happiness. Joy, though, can be ongoing, and <br/>\ncan be felt before, during and after the meeting of goals. <br/>\n<br/>\nEnjoyment--that word itself is hardly used. Enjoyment is seen nearly as a sin <br/>\nfor some people. &quot;You&#39;re not here to have fun, you&#39;re here to work.&quot; Why <br/>\ncan&#39;t work bring joy? Any tiny moment can be enjoyed: the feel of warm <br/>\nrunning water when you wash your hands; light and shadow on the floor; <br/>\npictures in the clouds; the feel of an old book. If you see an old friend <br/>\nthat can bring pure, tingly joy for which there are no words.<br/>\n<br/>\nIf you practice noticing and experiencing joy, if you take a second out of <br/>\neach hour to find joy, your life improves with each remembrance of your new <br/>\nprimary goal. You don&#39;t need someone else to give you permission, or to <br/>\ndecide whether or not what you thought gave you joy was an acceptable source <br/>\nof enjoyment.<br/>\n<br/>\nCan learning be fun? If it&#39;s not fun, it won&#39;t stick. Can laundry be fun? If <br/>\nyou have to do laundry and you choose NOT to enjoy it, an hour or more of <br/>\nyour precious hours on earth have been wasted. Can looking at your child <br/>\nbring you joy even when he needs a bath and has lost a shoe and hasn&#39;t lived <br/>\nup to some expectation that only exists in your mind? If not, a paradigm <br/>\nshift could help you both.<br/>\n<br/>\nYour life is yours, and it is being lived even as you read this. Do not wait <br/>\nfor approval. Do not wait for instructions, or for a proctor to say &quot;Open <br/>\nyour lifebook now and write.&quot; Have all the joy you want, and help your <br/>\nchildren, neighbors and relatives find some too. Joy doesn&#39;t cost anything <br/>\nbut some reuseable thought and awareness. Tell your kids it&#39;s recyclable. <br/>\nThey&#39;ll love that!</div>","specialLinks":[]}],"prevTopicId":59909,"nextTopicId":60107}}