{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Other Yahoogroups for Unschoolers (larger than this, interesting, odd)","postDate":"1016177039","msgId":5533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE2czdpZitzcmw1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZiLjIyZTRkNzljLjI5YzBkNGQyQGFvbC5jb20+"},"prevInTopic":5498,"nextInTopic":0,"prevInTime":5532,"nextInTime":5534,"topicId":5498,"numMessagesInTopic":0,"msgSnippet":"... impossible place ... and are ... some new ... Not impossible.  We just have a whole lot of hoops to jump through. :)   There are also some wonderful ladies","messageBody":"<div id=\"ygrps-yiv-814907976\"><blockquote><span title=\"ireply\">&gt; ***THIS IS IMPORTANT, because Pennsylvania appears to be an <br/>\n </span></blockquote>impossible place <br/>\n<blockquote><span title=\"ireply\"> &gt; to unschool, but look how many people DO know how to pull it off <br/>\n </span></blockquote>and are <br/>\n<blockquote><span title=\"ireply\"> &gt; offering help!  So keep this one in mind when you&#39;re elsewhere and <br/>\n </span></blockquote>some new <br/>\n<blockquote><span title=\"ireply\"> &gt; Pennsylvania resident comes in scared and hopeless.***<br/>\n<br/>\n </span></blockquote>Not impossible.  We just have a whole lot of hoops to jump <br/>\nthrough. :)   There are also some wonderful ladies in PA fighting <br/>\nvery hard to get us a better law. <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Other Yahoogroups for Unschoolers (larger than this, interesting, odd)","postDate":"1016036050","msgId":5498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZiLjIyZTRkNzljLjI5YzBkNGQyQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":5533,"prevInTime":5497,"nextInTime":5499,"topicId":5498,"numMessagesInTopic":0,"msgSnippet":"I went to Yahoogroups to see if our group showed under an unschooling search.  210 groups did, so I thought I d go through and see which were larger than our","messageBody":"<div id=\"ygrps-yiv-1213273701\">I went to Yahoogroups to see if our group showed under an &quot;unschooling&quot; <br/>\nsearch.  210 groups did, so I thought I&#39;d go through and see which were <br/>\nlarger than our current 214.   I&#39;ve found some and will list them below.  <br/>\nMaybe some of you want more input and would like to join additional groups.  <br/>\nMaybe some of you are bored with this list and want a different style.  Maybe <br/>\nyou&#39;re just curious about what else is there.   I&#39;ll set my own comments <br/>\napart   ******this way******** and the first number there is the number of <br/>\nmembers listed.  These numbers are probably not exactly current, because our <br/>\nnumber was a couple of weeks old.    There were 210 groups listed, but many <br/>\nof them were definitely NOT unschooling lists, and showed up because they <br/>\nsaid so (using that term) or because they had a keywords list and unschooling <br/>\nwas one of their keywords (for no good reason at all).<br/>\n<br/>\nThere was another listed for unschoolers in Colorado:  counschooling   (not  <br/>\nmany members, but worth mentioning in addition to the csprings group <br/>\nmentioned in the previous post)<br/>\n<br/>\n<br/>\n<br/>\n395 RUL <br/>\nThis is the &quot;Radical Unschoolers List&quot;. It is for all families, regardless of <br/>\nreligious affiliation, choosing to unschool their children. Unschooling is <br/>\nchild-led learning, learning as a part of life. It allows the child to learn <br/>\nnaturally, without adult-imposed &quot;lessons&quot;, schedules, or timelines. This <br/>\nlist is to offer support, information, perspective, and enlightenment to <br/>\nanyone already unschooling or interested in unschooling. <br/>\n<br/>\n<br/>\n217 CCU-List <br/>\nCCU stands for Christ Centered Unschooling. Unschooling is a well researched <br/>\ntheory which departs from the accepted norms of education in our society. <br/>\nLearning should be as natural as any other life process, ie; breathing and <br/>\neating. The theory of unschooling depends on the human being&#39;s innate desire <br/>\nto learn and strives to allow the individual the freedom to explore their <br/>\ncurrent areas of interest. This list was formed as a place for Christians who <br/>\nare either unschooling, attempting to ... more  <br/>\n<br/>\n****I don&#39;t think unschooling is exactly &quot;well researched,&quot; although it&#39;s <br/>\nbased on various parts of well-researched learning theory rejected by public <br/>\nschools...****<br/>\n<br/>\n 299 members ***and the 123 is part of their forum name***<br/>\n123ahomeschoolforme <br/>\nHome School! Homeschoolers. Homeschooling! Unschoolers. This is a place for <br/>\nhome-schooled kids and parents. Here you can exchange ideas! support each <br/>\nother! give links for school stuff! just talk including, scripture, God, <br/>\nchurch, parents, kids, home cleaning, lessons and curriculum, on-line <br/>\ncourses, web sites, dogs and cats Please be considerate of others Please, no <br/>\nrude talk, bad language, or anything of the sort. This is an unmoderated list <br/>\nand the list owner does not have any legal ... more <br/>\n<br/>\n***THIS IS IMPORTANT, because Pennsylvania appears to be an impossible place <br/>\nto unschool, but look how many people DO know how to pull it off and are <br/>\noffering help!  So keep this one in mind when you&#39;re elsewhere and some new <br/>\nPennsylvania resident comes in scared and hopeless.***<br/>\n<br/>\n264 <br/>\nPA-Unschoolers <br/>\nAre you unschooling in Pennsylvania? Are you a relaxed or eclectic <br/>\nhomeschooler? Are you thinking about taking the leap of faith to unschool? <br/>\nCome chat with us! PA has one of the most restrictive homeschooling laws in <br/>\nthe country. When you join our group, you will automatically get a copy of <br/>\nthe law in your email. You can also access the Law by clicking on &quot;files&quot; on <br/>\nthe website at Yahoogroups. Get together with us to talk about the ways that <br/>\nunschoolers can meet the law&#39;s requirements. All are ... more<br/>\n<br/>\n    <br/>\n***This one&#39;s more like a newsletter and isn&#39;t a disussion group directly, <br/>\nbut it does have lots of members!<br/>\n370     FUNNews <br/>\nBrought to you by the Family Unschoolers Network. Members will receive our <br/>\nonline newsletter with articles, announcements, events listings, FUN Books <br/>\nspecial offers, and other items of interest about unschooling and <br/>\nhomeschooling. <br/>\n<br/>\n<br/>\n461     <br/>\nunschoolingcheap <br/>\nUnschooling ? Homeschooling in a more relaxed way? Want to discuss ways to do <br/>\nit cheaply? If your looking for a list that will help you find cheap and free <br/>\nhomeschool resources, but arnt interested in more worksheets, quiz makers,or <br/>\ntextbook swaps, then this is the list for you!!! I want this list to be for <br/>\neveryone who is interested, but we will be discussing resources that are not <br/>\nas schooly, fun things, books, movies, field trips, web sites etc.. This list <br/>\ndoes have a no ads policy, no spam, ... more<br/>\n<br/>\n<br/>\n****almost but not quite the biggest list there:****<br/>\n<br/>\n636 Unschooling-dotcom <br/>\nThis is a networking and discussion list for unschoolers, sponsored by Home <br/>\nEducation Magazine (HEM). For information about unschooling please see the <br/>\nUnschooling.com website http //www.unschooling.com <br/>\n<br/>\n**** and THE biggest list:*****<br/>\n1039    unschooling <br/>\nUnschooling is the art of using a child&#39;s natural curiosity to guide <br/>\nlearning. Join us and learn more about this. See more at Unschooling Support <br/>\nCenter http //www.homeschoolzone.com/unschooling/ <br/>\n<br/>\n****Not too many posts a month, 25 or so? But part of a HUGE website with <br/>\nsponsors and color and flash.****<br/>\n<br/>\n--------<br/>\n705<br/>\nSeedling <br/>\nSeedlings Nurturing our children in the freedom of Christ A monthly Christian <br/>\nhomeschooling ezine. Subscriber-made. Christian Unschooling at it&#39;s best!! <br/>\n*****   (not a discussion, really; couldn&#39;t tell from peeking how it <br/>\nworked)****<br/>\n<br/>\n<br/>\n****A big local group, but not all unschoolers:****<br/>\n241   dfw-hu <br/>\nThe DFW Homeschoolers & Unschoolers Loop is open to all, regardless of race, <br/>\ncreed, core belief system, basic motivation for home/unschooling, hair color, <br/>\nmarital status, sex, sexual preference, favorite color, etc., who share an <br/>\ninterest in home/unschooling children in the Dallas/Fort Worth Metroplex and <br/>\nthe surrounding area. It&#39;s purpose is to share homeschooling experiences, <br/>\nsuggestions and encouragement. This is not a list for &quot;sale&quot; ads of any type. <br/>\nTo subscribe, send an empty message to ... more<br/>\n<br/>\n<br/>\n<br/>\n****These are not big, but I thought they were interesting.  ****<br/>\n<br/>\n<br/>\n5thgradehomeschool <br/>\n15  members<br/>\nFor parents and children who are homeschooling in the 5th Grade. Discussions <br/>\nmay include any aspects of the home education experience, including <br/>\ncurriculum choices, teaching tips, creative lesson plans, alternative <br/>\nmethods, learning styles, and time management. Here you can exchange ideas! <br/>\nsupport each other! give links for school stuff! just talk including, <br/>\nscripture, God, church, parents, kids, home cleaning, lessons and curriculum, <br/>\non-line courses, and web sites. Please be considerate of others Please, no <br/>\nrude talk, bad language, or anything of the sort. This is an unmoderated list <br/>\nand the list owner does not have any legal responsibility to any postings. <br/>\nPlease-no SPAMMERS! No bad words and no teasing and no racism! Keywords- <br/>\nreading, student <br/>\ncontenthomeschool,Homeschool,homeschooling,Homeschooling,home school,home, <br/>\nhome schooling, homeschooling, homeschool education, educated, educator, <br/>\nunschooling, curriculum reviews, support group, 5th grade, fifth grade <br/>\n<br/>\n***I included that one because it was *SO* not unschooling, yet listed <br/>\nunschooling as a keyword.****<br/>\n<br/>\n<br/>\n***Some listings were TEENY small (three members) or  very localized<br/>\nlike<br/>\nNorth Texas Natural Learners  <br/>\n(Denton, Texas     &quot;Denton, home of happiness&quot;)  but at least it was for <br/>\nnatural learners. ***<br/>\n***There we were with an outdated headcount:****<br/>\n<br/>\n196     AlwaysLearning <br/>\nDiscussion for homeschooling fans of John Holt, whose books Learning All the <br/>\nTime, Never Too Late, and Teach your Own have made unschooling a sweet and <br/>\nviable option for thousands of families. This is a moderated group, with <br/>\ntrapdoors for the uncooperative. (Not moderated in the advance-approval way, <br/>\nbut in the be-nice-to-play way.) It&#39;s an idea group and is intended to lean <br/>\nmore toward pure unschooling than neutral, general homeschooling <br/>\ndiscussion--there are hundreds of general homeschooling ... more<br/>\n<br/>\n    ****and this one I though sounded really inviting and peaceful, but...****<br/>\n<br/>\n144     UnschoolersCircle <br/>\nThe Unschoolers&#39; Circle is an inclusive list for anyone interested in home <br/>\neducation with unschooling leanings. Sometimes called relaxed schooling or <br/>\nchild-led learning or interest-led learning, unschooling encompasses <br/>\neverything in your life, so our conversations range incredibly in subject <br/>\nmatter. You just have to check in to see what&#39;s being discussed. Like the <br/>\nRound Table of Arthurian legend, we are a circle of peers. Everyone&#39;s input <br/>\nis equally valuable - from the newest newbie to the ... more<br/>\n<br/>\n<br/>\n****.... there is no way a  newest newbie&#39;s input about how unschooling works <br/>\nwill be equally valuable to that of someone with experience.  I&#39;m always <br/>\nbaffled by people who say &quot;everyone&#39;s opinion is equal.&quot;  And that wasn&#39;t <br/>\ntrue in Camelot anyway.  Arthur was still the King and Lancelot was still IT <br/>\non a stick (despite being French).****<br/>\n<br/>\n****So we&#39;re in the top five or six of actual discussion groups, maybe <br/>\n(depends how some of those odd ones work), but in the top ten for sure of <br/>\nyahoogroup lists which purport to support unschooling.<br/>\n<br/>\nSometimes I think maybe we should all just blend into large existing groups <br/>\nand not divide the group further, but there&#39;s nothing keeping people from <br/>\njoining all of those, so it&#39;s not like splitting a vote or building a new <br/>\nbuilding, I suppose.****<br/>\n<br/>\nSandra, through musing and reporting for the moment</div>","specialLinks":[]}],"prevTopicId":5521,"nextTopicId":5539}}