{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Parent Advisories for Teen Entertainment","postDate":"1084307516","msgId":93869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJkLjNkNmJjOTI1LjJkZDI5MjNjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":93868,"nextInTime":93870,"topicId":93869,"numMessagesInTopic":0,"msgSnippet":"After the Mean Girls thread, I recalled that recently I was asked to write a parent s advisory for local dance parents, about an upcoming production of the","messageBody":"<div id=\"ygrps-yiv-733963240\">After the Mean Girls thread, I recalled that recently I was asked to <br/>\nwrite a parent&#39;s advisory for local dance parents, about an upcoming production <br/>\nof the Broadway smash musical &quot;Ragtime.&quot; We were considering whether to adopt <br/>\none performance as a fundraiser we&#39;d all bring our families to (with children <br/>\nof different ages.) So parents needed insight not only for their personal <br/>\ndecisions, but for the group decision as to whether the show lends itself to <br/>\nbeing a family fundraiser.<br/>\n<br/>\n      I too highlighted some bits and pieces, but imo in the opposite spirit <br/>\nof the Mean Girls advisory. FWIW, here it is:<br/>\n<br/>\n<br/>\n   Ragtime is one of my very favorite shows. Please keep in mind as you read <br/>\nthe following that I personally LOVE this show and can barely sit still and <br/>\nnot dance in my seat and sing all the parts. I plan to see the TALC production <br/>\nseveral times if possible.<br/>\n<br/>\n       When the Broadway touring company of Ragtime was here last year, (name <br/>\nof theatre mentor) consulted with me about whether Dear Daughter 14 could <br/>\nhandle it, and I decided to risk it. I am not sorry I did -- we talked about it <br/>\nfor days, bought the cast recording, and since then literally memorized it-- <br/>\nbut I&#39;d have to say she doesn&#39;t make a good barometer for what might appeal to <br/>\nthe average teen in literary, political, or cultural terms. (She&#39;s also read <br/>\nthe Doctorow novel that Ragtime was based on, which is even darker than the <br/>\nshow. She also worked on Jeckyl and Hyde, which had a few scenes almost too <br/>\ngraphic for me!)  Dear Son 8 knows the score and we&#39;ve been working for months to <br/>\nprepare him to understand the show, but I&#39;m not sure he&#39;s ready even now for the <br/>\nemotional impact of it onstage. <br/>\n<br/>\n       So I offer the following guide to help company parents consider <br/>\nwhether this show would suit their own children and families, trying not to give too <br/>\nmuch away and also not trying to discourage you at all, just to give you a <br/>\nheads-up. <br/>\n<br/>\nA Company Parent&#39;s No-Holes-Barred Advisory on Ragtime:<br/>\n<br/>\nThis is a powerful, uplifting and broadly relevant social drama from the <br/>\nearly 1900s about difficult political themes such as race, sex and class, <br/>\npunctuated by historical figures of the period from Henry Ford to Harry Houdini to <br/>\nBooker T. Washington. It takes historical and moral knowledge, life experience <br/>\nand a certain tolerance for ambiguity to appreciate. One sympathetic main <br/>\ncharacter dies a violent death and is mourned (this is essential to the storyline <br/>\nbut also in my opinion very upsetting, even to adults.) A baby is born out of <br/>\nwedlock and his desperate mother abandons him to die. Among the minor characters <br/>\nare racists who use the *n* word several times while thoroughly humiliating a <br/>\nblack couple, a European union organizer inciting workers to riot against <br/>\ntheir oppressors, a scantily clad vaudeville singer plying her looks and sex to <br/>\ninflame men to murderous passions, a young girl whose mother has died, and a <br/>\nwealthy young man with every advantage who basically becomes a suicide bomber.<br/>\n<br/>\n       <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":93862,"nextTopicId":16699}}