{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Getting it","postDate":"1358100273","msgId":70272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4NUZFNjlCLTJBOTAtNDk0Qi04NUI2LTE3NkMxRUM1NjY2RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtjdGUzYSsybjRyQGVHcm91cHMuY29tPg==","referencesHeader":"PGtjdGUzYSsybjRyQGVHcm91cHMuY29tPg=="},"prevInTopic":70269,"nextInTopic":0,"prevInTime":70271,"nextInTime":70273,"topicId":70269,"numMessagesInTopic":0,"msgSnippet":"-=-Having been able to experience the senior drama program at school would have given me ample exposure to so many different and highly esteemed academic","messageBody":"<div id=\"ygrps-yiv-340262194\">-=-Having been able to experience the senior drama program at school would have given me ample exposure to so many different and highly esteemed academic subjects as well! I imagine we would have used computers to write plays, create deep story lines, created sets and costumes using real world math and problem solving, explored historical periods, worked as a team, and bared my deepest hearts longing to act and play and explore. I think though mostly, I would have felt happy! And that&#39;s what is actually really important!-=-<br/>\n<br/>\nAnd my kids who did NOT have ten to thirteen years of school math learned all of that in a course or two at the community college.  Ten years worth of school math in two sessions a week for sixteen weeks or so.<br/>\n<br/>\nBut ten years of theatre or art or music could NEVER, not in any way, be shoved into one semester.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":544120498,"authorName":"blossomholly@ymail.com","from":"&quot;blossomholly@...&quot; &lt;blossomholly@...&gt;","profile":"blossomholly@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Getting it","postDate":"1358052266","msgId":70269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjdGUzYSsybjRyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70272,"prevInTime":70268,"nextInTime":70270,"topicId":70269,"numMessagesInTopic":0,"msgSnippet":"I had a superb getting it moment this morning. Traveling with my husband and children I was reflecting on my school days and honed in on grade 9 science. I","messageBody":"<div id=\"ygrps-yiv-31135000\">I had a superb &quot;getting it &quot;moment this morning. Traveling with my husband and children I was reflecting on my school days and honed in on grade 9 science.<br/>\n<br/>\n I do not remember the specific experiments we did in the lab, I do remember though the excitement I would feel when we would start a new topic. I would bring my sharpened colored pencils and pens to class and I would make a new  artistic topical cover page, the whole lesson while following along with the copy- the -notes-off-the-blackboard, I would create lettering and themed drawings.<br/>\n<br/>\n  I loved the crisp freshness of new pages and sharp pencils but was I learning science just because I was sitting in science class? Not a bit ! I wanted to draw!<br/>\n<br/>\n I spent science channelling artistic talent, it is so true that you can put a kid in school or class but there is no way of knowing what his happening in her mind. <br/>\n<br/>\nMy public school authority  told me that from grade 10, i would get one arts elective-- art, drama or music--I couldn&#39;t follow my passion for the dramatic arts and music as it wasn&#39;t highly regarded as academics was.  <br/>\n<br/>\nI desperately wanted to choose art and drama as they made life worthwhile and were so fulfilling--I  chose art. One subject in my years 10 to 12 timetable that didn&#39;t frustrate my creative drives AS much!<br/>\n<br/>\nI would literally belch at my high school timetable, drag my feet to school.  Fridays double math, double science, English then finally art...endurance to the max.  Long hot days of pain let loose for 40 minutes in the art room, but really only 20 mins after briefing , class behavior management and finding art supplies.<br/>\n<br/>\nThinking about that young girl that was so passionate about drama and the arts and what being allowed to explore those freely at school would have meant to me.. <br/>\n<br/>\nIt&#39;s  intense to tune into the discomfort that is still stored in my body from having to endure the torture of forced math, science, English curriculum. Tense and desperate, under achieving but so passionate for other classes that were out of my reach.<br/>\n<br/>\nHaving been able to experience the senior drama program at school would have given me ample exposure to so many different and highly esteemed academic subjects as well! I imagine we would have used computers to write plays, create deep story lines, created sets and costumes using real world math and problem solving, explored historical periods,  worked as a team, and bared my deepest hearts longing to act and play and explore. I think though mostly, I would have felt happy! And that&#39;s what is actually really important!<br/>\n<br/>\nI now watch my son, inquire, engage and live his passions daily. He questions, problem solves, he is relaxed, Happy  and he doesn&#39;t spend his precious time doing things that don&#39;t matter to him. <br/>\n<br/>\nI am so honored to live with a being who will never ( unless he choses) be told to endure the force feeding of information that isn&#39;t relevant to him now or yet or ever, live his life counting the hours and minutes until he can do something that he really wants to do or be denied access to his longings because it doesn&#39;t fit an education stream or timetable model, or is valued less because it is artistic or gaming derived. <br/>\n<br/>\nLife is here to live. <br/>\n<br/>\nHolly</div>","specialLinks":[]}],"prevTopicId":70080,"nextTopicId":70267}}