{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Daughter falling behind in public school.","postDate":"1051736494","msgId":66924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NS4xOWRjMjhmYi4yYmUxOTNhZUBjcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":66923,"nextInTime":66925,"topicId":66924,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/30/03 2:45:30 PM Central Daylight Time, Unschooling-dotcom@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-885829258\">In a message dated 4/30/03 2:45:30 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; I trust that life will teach her what she needs to know. I hate to see <br/>\n her love for learning disappear. So I&#39;m thinking some form of <br/>\n homeschooling or unschooling might be the answer, but I don&#39;t want her <br/>\n to feel isolated from the world and from friends. How do I find other <br/>\n families in my area who are doing this, too? &gt;&gt;<br/>\n<br/>\nIt&#39;s pretty hard to isolate oneself unless one tries!<br/>\nReal life gives all sorts of opportunities for social interaction, if that is <br/>\nwhat she wants.<br/>\n<br/>\nDo you believe that even if there isn&#39;t a single other homeschooling or <br/>\nunschooling family near you, that the damage she is suffering right now is <br/>\nsomehow justified?<br/>\nI can&#39;t see that it&#39;s the better option, even if you&#39;re alone in your quest.<br/>\nAs the only homeschoolers, you may feel like the odd one out, but at least <br/>\nyou will have the chance to honor and nurture your dd for who she IS. Let her <br/>\nhave the freedom to learn what she chooses and have the self confidence that <br/>\nvery few public schooled children ever possess.<br/>\n<br/>\nI highly doubt you are the only ones in your area, but even so, get her OUT <br/>\nof that system..please.<br/>\nYou can walk away now.<br/>\nLook into your childs eyes and ask yourself if anything is worth her feeling <br/>\nless than, compared to others and as though something were wrong with her for <br/>\njust being HERSELF. Look deep into those eyes. Look at the wisdom there. Look <br/>\nat the joy she has when doing something she loves. Is there anything worth <br/>\nstopping that shining spark of joy? Is there a good enough reason to <br/>\nextinguish that?<br/>\n<br/>\nHold her hand, feel where it leads you. That hand will fit into yours for <br/>\nsuch a short time...is there anything worth pushing it to do something it <br/>\ndoesn&#39;t enjoy doing?<br/>\nThe joy you feel as you grasp her hand and let her take you into her world, <br/>\nthere is nothing better in this life. Grasp that hand, relish the fact that <br/>\nyou can explore the world with that hand grasping yours, hold it gently and <br/>\nlet her show you the way to adventure, learning and a meaningful life.<br/>\n<br/>\nSee her smile when she is happy. Capture that moment and don&#39;t let anything <br/>\nmake you think that there is something more you could offer at that moment.<br/>\nKNOW deep in your soul that truth resonates when you think of trusting her. <br/>\nOUST those other voices that are trying to squish her into a box that she <br/>\ndoes not belong.<br/>\n<br/>\nYour love is stronger than those voices. Your trust is deeper than some <br/>\nmisguided information. Your relationship with her will prove the &quot;experts&quot; <br/>\nwrong.<br/>\nBut only if you take the leap.<br/>\nBelieve in natural learning...she&#39;s known how all along.  The only thing you <br/>\ncan do by continuing on the current course is face regrets one day when your <br/>\nchild&#39;s love of learning is all but gone. She will then spend many years <br/>\ntrying to re-gain it.<br/>\nOR, you could walk away now. Embrace a life of freedom and joy. A life of <br/>\nyour own making, not some institiution that couldn&#39;t possibly regard the <br/>\nindividual as more important than the mass.<br/>\nWalk into a meaningful life. One that embraces your dd for exactly who she is <br/>\nand what she loves TODAY. <br/>\n<br/>\nRen<br/>\n&quot;They dined on mince, and slices of quince, Which they ate with a runcible <br/>\nspoon;<br/>\nAnd hand in hand, on the edge of the sand, they danced by the light of the <br/>\nmoon.&quot;<br/>\n                                                --The Owl and the Pussycat      <br/>\n                                        Edward Lear</div>","specialLinks":[]}],"prevTopicId":66419,"nextTopicId":66925}}