{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":135098343,"authorName":"Peggy","from":"Peggy &lt;durrell@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I have a Dream by Martin Luther King, Jr.","postDate":"1043087528","msgId":55718,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMkM0MEE4LkVBMkQ2QTI4QGFpdGFjY2Vzcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":55717,"nextInTime":55719,"topicId":55718,"numMessagesInTopic":0,"msgSnippet":"This is just as timely now as when he wrote it. Peggy I have a Dream by Martin Luther King, Jr. Delivered on the steps at the Lincoln Memorial in Washington","messageBody":"<div id=\"ygrps-yiv-1021311847\">This is just as timely now as when he wrote it. Peggy<br/>\n<br/>\n<br/>\n<br/>\nI have a Dream<br/>\nby Martin Luther King, Jr.<br/>\nDelivered on the steps at the Lincoln Memorial in Washington D.C. on<br/>\nAugust<br/>\n28, 1963<br/>\n<br/>\nFive score years ago, a great American, in whose symbolic shadow we<br/>\nstand<br/>\nsigned the Emancipation Proclamation. This momentous decree came as<br/>\na great<br/>\nbeacon light of hope to millions of Negro slaves who had been seared<br/>\nin the<br/>\nflames of withering injustice. It came as a joyous daybreak to end<br/>\nthe long<br/>\nnight of captivity.<br/>\n<br/>\nBut one hundred years later, we must face the tragic fact that the<br/>\nNegro is<br/>\nstill not free. One hundred years later, the life of the Negro is<br/>\nstill<br/>\nsadly crippled by the manacles of segregation and the chains of<br/>\ndiscrimination. One hundred years later, the Negro lives on a lonely<br/>\nisland<br/>\nof poverty in the midst of a vast ocean of material prosperity. One<br/>\nhundred<br/>\nyears later, the Negro is still languishing in the corners of<br/>\nAmerican<br/>\nsociety and finds himself an exile in his own land. So we have come<br/>\nhere<br/>\ntoday to dramatize an appalling condition.<br/>\n<br/>\nIn a sense we have come to our nation&#39;s capital to cash a check.<br/>\nWhen the<br/>\narchitects of our republic wrote the magnificent words of the<br/>\nConstitution<br/>\nand the declaration of Independence, they were signing a promissory<br/>\nnote to<br/>\nwhich every American was to fall heir. This note was a promise that<br/>\nall men<br/>\nwould be guaranteed the inalienable rights of life, liberty, and the<br/>\npursuit<br/>\nof happiness.<br/>\n<br/>\nIt is obvious today that America has defaulted on this promissory<br/>\nnote<br/>\ninsofar as her citizens of color are concerned. Instead of honoring<br/>\nthis<br/>\nsacred obligation, America has given the Negro people a bad check<br/>\nwhich has<br/>\ncome back marked &quot;insufficient funds.&quot; But we refuse to believe that<br/>\nthe<br/>\nbank of justice is bankrupt. We refuse to believe that there are<br/>\ninsufficient funds in the great vaults of opportunity of this<br/>\nnation. So we<br/>\nhave come to cash this check -- a check that will give us upon<br/>\ndemand the<br/>\nriches of freedom and the security of justice. We have also come to<br/>\nthis<br/>\nhallowed spot to remind America of the fierce urgency of now. This<br/>\nis no<br/>\ntime to engage in the luxury of cooling off or to take the<br/>\ntranquilizing<br/>\ndrug of gradualism. Now is the time to rise from the dark and<br/>\ndesolate<br/>\nvalley of segregation to the sunlit path of racial justice. Now is<br/>\nthe time<br/>\nto open the doors of opportunity to all of God&#39;s children. Now is<br/>\nthe time<br/>\nto lift our nation from the quicksands of racial injustice to the<br/>\nsolid rock<br/>\nof brotherhood.<br/>\n<br/>\nIt would be fatal for the nation to overlook the urgency of the<br/>\nmoment and<br/>\nto underestimate the determination of the Negro. This sweltering<br/>\nsummer of<br/>\nthe Negro&#39;s legitimate discontent will not pass until there is an<br/>\ninvigorating autumn of freedom and equality. Nineteen sixty-three is<br/>\nnot an<br/>\nend, but a beginning. Those who hope that the Negro needed to blow<br/>\noff steam<br/>\nand will now be content will have a rude awakening if the nation<br/>\nreturns to<br/>\nbusiness as usual. There will be neither rest nor tranquility in<br/>\nAmerica<br/>\nuntil the Negro is granted his citizenship rights. The whirlwinds of<br/>\nrevolt<br/>\nwill continue to shake the foundations of our nation until the<br/>\nbright day of<br/>\njustice emerges.<br/>\n<br/>\nBut there is something that I must say to my people who stand on the<br/>\nwarm<br/>\nthreshold which leads into the palace of justice. In the process of<br/>\ngaining<br/>\nour rightful place we must not be guilty of wrongful deeds. Let us<br/>\nnot seek<br/>\nto satisfy our thirst for freedom by drinking from the cup of<br/>\nbitterness and<br/>\nhatred.<br/>\n<br/>\nWe must forever conduct our struggle on the high plane of dignity<br/>\nand<br/>\ndiscipline. We must not allow our creative protest to degenerate<br/>\ninto<br/>\nphysical violence. Again and again we must rise to the majestic<br/>\nheights of<br/>\nmeeting physical force with soul force. The marvelous new militancy<br/>\nwhich<br/>\nhas engulfed the Negro community must not lead us to distrust of all<br/>\nwhite<br/>\npeople, for many of our white brothers, as evidenced by their<br/>\npresence here<br/>\ntoday, have come to realize that their destiny is tied up with our<br/>\ndestiny<br/>\nand their freedom is inextricably bound to our freedom. We cannot<br/>\nwalk<br/>\nalone.<br/>\n<br/>\nAnd as we walk, we must make the pledge that we shall march ahead.<br/>\nWe cannot<br/>\nturn back. There are those who are asking the devotees of civil<br/>\nrights,<br/>\n&quot;When will you be satisfied?&quot; We can never be satisfied as long as<br/>\nour<br/>\nbodies, heavy with the fatigue of travel, cannot gain lodging in the<br/>\nmotels<br/>\nof the highways and the hotels of the cities. We cannot be satisfied<br/>\nas long<br/>\nas the Negro&#39;s basic mobility is from a smaller ghetto to a larger<br/>\none. We<br/>\ncan never be satisfied as long as a Negro in Mississippi cannot vote<br/>\nand a<br/>\nNegro in New York believes he has nothing for which to vote. No, no,<br/>\nwe are<br/>\nnot satisfied, and we will not be satisfied until justice rolls down<br/>\nlike<br/>\nwaters and righteousness like a mighty stream.<br/>\n<br/>\nI am not unmindful that some of you have come here out of great<br/>\ntrials and<br/>\ntribulations. Some of you have come fresh from narrow cells. Some of<br/>\nyou<br/>\nhave come from areas where your quest for freedom left you battered<br/>\nby the<br/>\nstorms of persecution and staggered by the winds of police<br/>\nbrutality. You<br/>\nhave been the veterans of creative suffering. Continue to work with<br/>\nthe<br/>\nfaith that unearned suffering is redemptive.<br/>\n<br/>\nGo back to Mississippi, go back to Alabama, go back to Georgia, go<br/>\nback to<br/>\nLouisiana, go back to the slums and ghettos of our northern cities,<br/>\nknowing<br/>\nthat somehow this situation can and will be changed. Let us not<br/>\nwallow in<br/>\nthe valley of despair.<br/>\n<br/>\nI say to you today, my friends, that in spite of the difficulties<br/>\nand<br/>\nfrustrations of the moment, I still have a dream. It is a dream<br/>\ndeeply<br/>\nrooted in the American dream.<br/>\n<br/>\nI have a dream that one day this nation will rise up and live out<br/>\nthe true<br/>\nmeaning of its creed: &quot;We hold these truths to be self-evident: that<br/>\nall men<br/>\nare created equal.&quot;<br/>\n<br/>\nI have a dream that one day on the red hills of Georgia the sons of<br/>\nformer<br/>\nslaves and the sons of former slaveowners will be able to sit down<br/>\ntogether<br/>\nat a table of brotherhood.<br/>\n<br/>\nI have a dream that one day even the state of Mississippi, a desert<br/>\nstate,<br/>\nsweltering with the heat of injustice and oppression, will be<br/>\ntransformed<br/>\ninto an oasis of freedom and justice.<br/>\n<br/>\nI have a dream that my four children will one day live in a nation<br/>\nwhere<br/>\nthey will not be judged by the color of their skin but by the<br/>\ncontent of<br/>\ntheir character.<br/>\n<br/>\nI have a dream today.<br/>\n<br/>\nI have a dream that one day the state of Alabama, whose governor&#39;s<br/>\nlips are<br/>\npresently dripping with the words of interposition and<br/>\nnullification, will<br/>\nbe transformed into a situation where little black boys and black<br/>\ngirls will<br/>\nbe able to join hands with little white boys and white girls and<br/>\nwalk<br/>\ntogether as sisters and brothers.<br/>\n<br/>\nI have a dream today.<br/>\n<br/>\nI have a dream that one day every valley shall be exalted, every<br/>\nhill and<br/>\nmountain shall be made low, the rough places will be made plain, and<br/>\nthe<br/>\ncrooked places will be made straight, and the glory of the Lord<br/>\nshall be<br/>\nrevealed, and all flesh shall see it together.<br/>\n<br/>\nThis is our hope. This is the faith with which I return to the<br/>\nSouth. With<br/>\nthis faith we will be able to hew out of the mountain of despair a<br/>\nstone of<br/>\nhope. With this faith we will be able to transform the jangling<br/>\ndiscords of<br/>\nour nation into a beautiful symphony of brotherhood. With this faith<br/>\nwe will<br/>\nbe able to work together, to pray together, to struggle together, to<br/>\ngo to<br/>\njail together, to stand up for freedom together, knowing that we<br/>\nwill be<br/>\nfree one day.<br/>\n<br/>\nThis will be the day when all of God&#39;s children will be able to sing<br/>\nwith a<br/>\nnew meaning, &quot;My country, &#39;tis of thee, sweet land of liberty, of<br/>\nthee I<br/>\nsing. Land where my fathers died, land of the pilgrim&#39;s pride, from<br/>\nevery<br/>\nmountainside, let freedom ring.&quot;<br/>\n<br/>\nAnd if America is to be a great nation this must become true. So let<br/>\nfreedom<br/>\nring from the prodigious hilltops of New Hampshire. Let freedom ring<br/>\nfrom<br/>\nthe mighty mountains of New York. Let freedom ring from the<br/>\nheightening<br/>\nAlleghenies of Pennsylvania!<br/>\n<br/>\nLet freedom ring from the snowcapped Rockies of Colorado!<br/>\n<br/>\nLet freedom ring from the curvaceous peaks of California!<br/>\n<br/>\nBut not only that; let freedom ring from Stone Mountain of Georgia!<br/>\n<br/>\nLet freedom ring from Lookout Mountain of Tennessee!<br/>\n<br/>\nLet freedom ring from every hill and every molehill of Mississippi.<br/>\nFrom<br/>\nevery mountainside, let freedom ring.<br/>\n<br/>\nWhen we let freedom ring, when we let it ring from every village and<br/>\nevery<br/>\nhamlet, from every state and every city, we will be able to speed up<br/>\nthat<br/>\nday when all of God&#39;s children, black men and white men, Jews and<br/>\nGentiles,<br/>\nProtestants and Catholics, will be able to join hands and sing in<br/>\nthe words<br/>\nof the old Negro spiritual, &quot;Free at last! free at last! thank God<br/>\nAlmighty,<br/>\nwe are free at last!&quot;</div>","specialLinks":[]}],"prevTopicId":55675,"nextTopicId":55630}}