{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Inquisitive daughter","postDate":"1273002976","msgId":53805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCRTA3QkUwLjkwNjAxMDBAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGhyb2F0NStmc2ZrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyb2F0NStmc2ZrQGVHcm91cHMuY29tPg=="},"prevInTopic":53801,"nextInTopic":0,"prevInTime":53804,"nextInTime":53806,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"... Maybe - since you re worrying about it. Maybe set up a secret signal with her and you can use it when you think she should stop. She needs your help in","messageBody":"<div id=\"ygrps-yiv-1989643957\">On 5/3/2010 10:21 PM, kimcroninmeltzer wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Am I allowing her to be nosy and rude.<br/>\n<br/>\n </span></blockquote>Maybe - since you&#39;re worrying about it. Maybe set up a secret signal <br/>\nwith her and you can use it when you think she should stop. She needs <br/>\nyour help in judging when questions are welcome and when they&#39;re not.<br/>\n<br/>\nCool that she&#39;s so curious - maybe she will be a journalist and produce <br/>\nsome decent stuff about unschooling!<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Good enough unschooling parent","postDate":"1272995407","msgId":53800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCRTA1RTRGLjkwOTA4MDJAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PEFERDRENjFCLTY2RDMtNDgwRC05OEI5LTEzNkRBRkM5RjZCN0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PGhybGJiYytycWptQGVHcm91cHMuY29tPiA8QURENEQ2MUItNjZEMy00ODBELTk4QjktMTM2REFGQzlGNkI3QGNvbWNhc3QubmV0Pg=="},"prevInTopic":53795,"nextInTopic":53801,"prevInTime":53799,"nextInTime":53801,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"... LOL --  what she did was TALK with her kids - sometimes only after blowing up and being super strict/mean, but eventually always was clearly trying to see","messageBody":"<div id=\"ygrps-yiv-2010132352\">On 5/3/2010 11:02 AM, Robin Bentley wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; She told me that &quot;Roseanne&quot; was a good role model for mothering and<br/>\n&gt; while I&#39;ve changed by opinion of that show from reading Pam S&#39;s take<br/>\n&gt; on it, I still think I&#39;d like to do things a bit differently.<br/>\n<br/>\n </span></blockquote>LOL --  what she did was TALK with her kids - sometimes only after <br/>\nblowing up and being super strict/mean, but eventually always was <br/>\nclearly trying to see from her kids&#39; point of view. Also, the show <br/>\nshowed realistic kids&#39; reactions when their parents were cracking down <br/>\non them. They didn&#39;t show the kids being shamed and punished and then <br/>\nmeekly coming out and saying something like, &quot;Okay, you were right and <br/>\nI&#39;m going to be good from now on.&quot; No - they showed how the initial <br/>\nproblem usually was blown up into a much bigger issue by the parents, <br/>\nwhen they didn&#39;t take time to work it through with the kid, but just <br/>\nimposed their authority. This was in contrast to the Cosby Show, which <br/>\nwas completely unrealistic in how the kids reacted to constantly being <br/>\nmade fun of and restricted and punished. Cosby Show was really an <br/>\nupdated &quot;Father Knows Best&quot; - and not as sweet.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Inquisitive daughter","postDate":"1272993327","msgId":53795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2OEM5MzQ2LTMyNkUtNDBCQS05Njc5LTMxREE4M0M0MTc1RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDlBMDJBMkYyLUQ5OEQtNEQ0MC04QTI4LUYzMzc1Nzk0RTNEQ0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhyb2F0NStmc2ZrQGVHcm91cHMuY29tPiA8OUEwMkEyRjItRDk4RC00RDQwLThBMjgtRjMzNzU3OTRFM0RDQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":53783,"nextInTopic":53800,"prevInTime":53794,"nextInTime":53796,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"... Ripley s Believe it or not. I devoured those. They re still published but with color pictures. http://www.ripleys.com/ Or if you just do an image search on","messageBody":"<div id=\"ygrps-yiv-1972742193\">On May 4, 2010, at 11:16 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When I was a kid I also had a fascination with freaks-of-nature, with<br/>\n&gt; people who were different<br/>\n<br/>\n<br/>\n </span></blockquote>Ripley&#39;s Believe it or not. I devoured those. They&#39;re still published  <br/>\nbut with color pictures.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ripleys.com/\">http://www.ripleys.com/</a><br/>\n<br/>\nOr if you just do an image search on &quot;Ripley&#39;s Believe it or not&quot; that  <br/>\nwill turn up lots of pictures.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211463909,"authorName":"KimWW","from":"&quot;KimWW&quot; &lt;weikaimeng@...&gt;","profile":"weikaimeng","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Inquisitive daughter","postDate":"1272992243","msgId":53801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhycGpsais0b29zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhyb2F0NStmc2ZrQGVHcm91cHMuY29tPg=="},"prevInTopic":53800,"nextInTopic":53805,"prevInTime":53800,"nextInTime":53802,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"Maybe you could watch and see if she picks up when someone is in a hurry, or busy, or uncomfortable.  It doens t hurt to explain the appropriateness of","messageBody":"<div id=\"ygrps-yiv-837488899\">Maybe you could watch and see if she picks up when someone is in a hurry, or busy, or uncomfortable.  It doens&#39;t hurt to explain the appropriateness of different questions in different situations.  Asking the docent everything she can think of about the museum is differnt ahn asking about his garden.  his job is the museum, ask away.  Asking about the scratch does seem out-of-bounds to me.  And then, if he is forth coming and friendly about his garden, continuing on that topic seems ok.  If he hedges about the scratch or garden, she might want to get back to questions about the museum.  <br/>\n<br/>\nBeing an unschooler doesn&#39;t mean you are allowed to be rude.  But wheat you are describing does not sound rude to me.  One thing I have noticed about unschoolers and many home schoolers is a greater ease in speaking with people they meet on the street.  She is still very young and could be just learning to pick up on things like someone else&#39;s discomfort about a speaking topic.  A lot of school kids have &quot;Sit down and shut up&quot; drilled into them in kindergarten (if not pre-school) and that is what adults have become used to.  A child who will actually speak to them politely with confidence is unusual.<br/>\n<br/>\nYou could ask her afterward, &quot;He looked a little nervous.  Why do you think that is?&quot; or you could add &quot;May I as you a personal question?&quot; to her repetoire.<br/>\n<br/>\nPersonally, if she isn&#39;t getting TOO personal, let her ask.  I don&#39;t think the docent&#39;s garden counts as an inappropriate topic of conversation.  Let her ask.  His reaction will help her learn where the boundaries are; that different people have different boundaries; how to tell that you are getting near a boundary; that roses have thorns, but little scratches heal; that people who work one job may have hobbies in other areas...you name it.  her questions could open a lot of doors that other people think are locked, but just need someone to turn the knob.<br/>\n<br/>\nKim Warthman<br/>\nSlan!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Inquisitive daughter","postDate":"1272986206","msgId":53783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlBMDJBMkYyLUQ5OEQtNEQ0MC04QTI4LUYzMzc1Nzk0RTNEQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhyb2F0NStmc2ZrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyb2F0NStmc2ZrQGVHcm91cHMuY29tPg=="},"prevInTopic":53778,"nextInTopic":53795,"prevInTime":53782,"nextInTime":53784,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"-=- Am I allowing her to be nosy and rude, or am I letting her engage in ways that she absolutely loves, a way that fills her cup for being so social and","messageBody":"<div id=\"ygrps-yiv-68715330\">-=- Am I allowing her to be nosy and rude, or am I letting her engage  <br/>\nin ways that she absolutely loves, a way that fills her cup for being  <br/>\nso social and outgoing. -=-<br/>\n<br/>\nIt depends.  Those aren&#39;t the only two choices.<br/>\n<br/>\n-=-She has learned a lot about the world and how it works by having us  <br/>\n( and others) explain our (their) lives to her and seems really  <br/>\nknowledgable about the world around her, in so many ways, but is it  <br/>\nokay for me to let her veer into the personal (why do you have an  <br/>\nearring there? When did you get it, did it hurt really bad, etc.  <br/>\netc. )-=-<br/>\n<br/>\nI think now that she&#39;s getting older, you might coach her about which  <br/>\npeople are inappropriate (those who don&#39;t smile back at first; those  <br/>\nwho are busy with a handful of dog leashes and a schedule), and which  <br/>\nquestions are appropriate (sometimes it&#39;s just too personal).<br/>\n<br/>\nMaybe you could find people and ask in advance if they have time and  <br/>\nmood to answer questions, when you&#39;re out and about.  Or invite people  <br/>\nover that you know have interesting stories, for the purpose of her  <br/>\nhaving an opportunity to &quot;interview&quot; them.  Some people have lots of  <br/>\ntalkative friends and some don&#39;t.  That last idea would have worked  <br/>\nwell for me with my kids and my friends.<br/>\n<br/>\nShe might enjoy biographies.  I did when I was a kid.  I started  <br/>\nreading biographies when I was nine, and haven&#39;t quit.  There are kid- <br/>\nversions with lots of photos, and there are videos and audio books.   <br/>\n(I just ordered the autobiography *An Actor and a Gentleman* by Lou  <br/>\nGossett, Jr. this morning.)<br/>\n<br/>\nWhen I was a kid I also had a fascination with freaks-of-nature, with  <br/>\npeople who were different, and with the sideshow lives some of them  <br/>\nlived (some still do display for money).  That might satisfy some of  <br/>\nher curiosity (or it might gross her out, so this is just a vague and  <br/>\nlight, not a particular and pressing recommendation).  If she IS  <br/>\ninterested, it would also be a way to discuss with her how rude it can  <br/>\nbe to ask certain kinds of questions, and how some people are self  <br/>\nconscious about flaws and scratches and scars and it wouldn&#39;t be nice  <br/>\nto ask a question they&#39;ve already heard 50 times.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":255246581,"authorName":"kimcroninmeltzer","from":"&quot;kimcroninmeltzer&quot; &lt;kimcronin.meltzer@...&gt;","profile":"kimcroninmeltzer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Inquisitive daughter","postDate":"1272950501","msgId":53778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyb2F0NStmc2ZrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFERDRENjFCLTY2RDMtNDgwRC05OEI5LTEzNkRBRkM5RjZCN0Bjb21jYXN0Lm5ldD4="},"prevInTopic":53757,"nextInTopic":53783,"prevInTime":53777,"nextInTime":53779,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"Hi there, My just turned six year old daughter is very inquisitve and extremely outgoing.  If she sees someone walking by the house with a dog, she ll ask if","messageBody":"<div id=\"ygrps-yiv-1558104035\">Hi there, <br/>\n<br/>\nMy just turned six year old daughter is very inquisitve and extremely outgoing.  If she sees someone walking by the house with a dog, she&#39;ll ask if she can pet the dog, and if they are amenable, she will have a nice pet and chat with the dog owner.  (This is just one example, of which there are many throughout the day,) if she sees something like their keys, or bag with treats, or anything that strikes her fancy, she will grill them about anything until she gets to the bottom of whatever the meat of the matter is.  If they have more than one key (say professional dog walker) she will need to know which kind of dog goes to each key, if all the dogs live in the same neighborhood, if the person needs to commute, if they have to drive the dog to a park, what kind of car the person has,  if the car has an area for the dog in the back, or if it has to sit on the seat, front or back, if the dog is allowed to go off the leash, if the dog gets along well with other dogs, how it feels exactly to live the life of the dog walker with this particular dog.  <br/>\n<br/>\nThis happens everywhere we go:  if we are at a museum, and she is talking to a docent about something that has sparked her curiousity at the museum then I feel that&#39;s fair when it&#39;s related to the subject at hand, but very often it veers into the personal:  <br/>\n<br/>\nDD: You have a scratch on your arm.<br/>\nDocent: Yes, I got it gardening.  I was pricked by roses. <br/>\nDD: Were you gardening before you came here?  <br/>\nDocent:  Blah blah<br/>\nDd: question about garden etc.<br/>\n<br/>\n I am often told  &quot;your daughter has a lot of questions!&quot;, or if I&#39;m standing there, and they cut off the tide quickly with a &quot;Because!&quot;, and as she runs off, they&#39;ll say something to me, &quot;she is like a journalist,&quot; or a little more lately,  &quot;I&#39;m from the old school where children don&#39;t get to ask so many questions.&quot;  <br/>\n<br/>\nLately I have been getting more comments (maybe because all of sudden she looks older), and sometimes I feel a little self-conscious.  Am I allowing her to be nosy and rude, or am I letting her engage in ways that she absolutely loves, a way that fills her cup for being so social and outgoing.  <br/>\nShe has learned a lot about the world and how it works by having us ( and others) explain our (their) lives to her and seems really knowledgable about the world around her, in so many ways, but is it okay for me to let her veer into the personal (why do you have an earring there?  When did you get it, did it hurt really bad, etc. etc. )<br/>\n<br/>\nCurious Mom, <br/>\nKim</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Good enough unschooling parent","postDate":"1272920052","msgId":53757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhybmQ1aytpb2hnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFERDRENjFCLTY2RDMtNDgwRC05OEI5LTEzNkRBRkM5RjZCN0Bjb21jYXN0Lm5ldD4="},"prevInTopic":53747,"nextInTopic":53778,"prevInTime":53756,"nextInTime":53758,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"... I m not sure your homeopath understood the spirit of Winnicott s good enough mother . Winnicott sees the key role of the good enough mother as","messageBody":"<div id=\"ygrps-yiv-238076478\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin Bentley &lt;robin.bentley@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;** I remember my homeopath telling me I should be content to be the good  <br/>\n&gt; enough mother of Winnicot&#39;s description, to not want to be better. She  <br/>\n&gt; thought I was stifling my daughter&#39;s development by not telling her  <br/>\n&gt; what to do, by not giving her chores, by not giving her more reason to  <br/>\n&gt; hate me and therefore become a separate person. I think that&#39;s what  <br/>\n&gt; she did with her kids. At least one of them isn&#39;t speaking to her  <br/>\n&gt; anymore.**<br/>\n<br/>\n </span></blockquote>I&#39;m not sure your homeopath understood the spirit of Winnicott&#39;s &quot;good enough mother&quot;.<br/>\n<br/>\n&quot;Winnicott sees the key role of the &#39;good enough&#39; mother as adaptation to the baby, thus giving it a sense of control, &#39;omnipotence&#39; and the comfort of being connected with the mother. This &#39;holding environment&#39; allows the infant to transition at its own rate to a more autonomous position.&quot; Of course, Winnicott was still going for eventual, albeit gentle, detachment between the child and the parent. A mother who is striving to be perfect may be so wrapped up in her own performance that she may miss her child&#39;s cues of autonomous behaviour and may therefore unknowingly limit her child&#39;s development as she fails to adapt her responses accordingly. Phew - that was a heavy (and a wee bit wordy) piece of paraphrasing.<br/>\n<br/>\nMore here (if you are interested in psychoanalytic theory): <a rel=\"nofollow\" target=\"_blank\" href=\"http://changingminds.org/disciplines/psychoanalysis/concepts/good-enough_mother.htm\">http://changingminds.org/disciplines/psychoanalysis/concepts/good-enough_mother.htm</a> <br/>\n<br/>\nAnd, to be honest, when talking about parenting practices, &quot;Good Enough Mother&quot; waves the same red flag for me that &quot;Quality Time&quot; does (could you tell?) as these terms get commandeered into supporting modern/busy parenting practices that are neither &quot;good enough&quot; nor &quot;quality&quot;... at least, not in terms of the supporting the relationship between a child and her parent.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; She told me that &quot;Roseanne&quot; was a good role model for mothering <br/>\n<br/>\n </span></blockquote>Bwa ha ha ha. Too funny! I do appreciate that many people like Roseanne as a character and it&#39;s not like she was the worst mother ever, but certainly not someone I want as my personal parenting role model. <br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Good enough unschooling parent","postDate":"1272911446","msgId":53747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZERTM3MTA5LTExQTctNDc0OC1BNzQyLTAxREY0N0REMTYwQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFERDRENjFCLTY2RDMtNDgwRC05OEI5LTEzNkRBRkM5RjZCN0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PGhybGJiYytycWptQGVHcm91cHMuY29tPiA8QURENEQ2MUItNjZEMy00ODBELTk4QjktMTM2REFGQzlGNkI3QGNvbWNhc3QubmV0Pg=="},"prevInTopic":53743,"nextInTopic":53757,"prevInTime":53746,"nextInTime":53748,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"-=She told me that Roseanne was a good role model for mothering and while I ve changed by opinion of that show from reading Pam S s take on it, I still think","messageBody":"<div id=\"ygrps-yiv-472958183\">-=She told me that &quot;Roseanne&quot; was a good role model for mothering and<br/>\nwhile I&#39;ve changed by opinion of that show from reading Pam S&#39;s take<br/>\non it, I still think I&#39;d like to do things a bit differently-=-<br/>\n<br/>\nI read what Pam thought, but I still despise that show.  If it weren&#39;t  <br/>\nfor their dad, they would all be miserable people (if that were a real  <br/>\nfamily, I mean... I&#39;m watching Galaxy Quest and I need to clarify that  <br/>\nI understand that Rosanne was not &#39;the historical record&#39;).<br/>\n<br/>\nHORRIBLE for any professional to advise that as a model of parenting.<br/>\n<br/>\nI&#39;ve just sent this to another list, so some of you will see it twice,  <br/>\nbut a friend whose son is Kirby&#39;s age and doesn&#39;t really speak to her  <br/>\nunless pressed to, and then it&#39;s briefly and guardedly, sent me this  <br/>\nas a Mother&#39;s Day ha ha.  I didn&#39;t laugh.  I&#39;m not going to tell her  <br/>\nso.  She knows her parenting was harmful.  She&#39;s divorced twice.   <br/>\nThough we&#39;re still friends, I avoid telling her stories about my kids,  <br/>\nbecause it seems like me rubbing salt in where she ought to, but  <br/>\ndoesn&#39;t really, have a wound.<br/>\n<br/>\n--------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;     Baby Bear goes downstairs and sits in his small chair at the  <br/>\n&gt; table, he looks into his small bowl. It is empty. &quot;Who&#39;s been eating  <br/>\n&gt; my porridge?!,&quot; he squeaks.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Papa Bear arrives at the big table and sits in his big chair. He  <br/>\n&gt; looks into his big bowl, and it is also empty. &quot;Who&#39;s been eating my  <br/>\n&gt; Porridge?!,&quot; he roars.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Momma Bear puts her head through the serving hatch from the kitchen  <br/>\n&gt; and yells, &quot;For God&#39;s sake, how many times do we have to go through  <br/>\n&gt; this?  It was Momma Bear who got up first! It was Momma Bear who  <br/>\n&gt; woke everyone in the house!  It was Momma Bear who made the coffee!   <br/>\n&gt; It was Momma Bear who unloaded the dishwasher from last night and  <br/>\n&gt; put everything away!  It was Momma Bear who went out in the cold  <br/>\n&gt; early morning air to fetch the newspaper!  It was Momma Bear who set  <br/>\n&gt; the table!  It was Momma Bear who put the cat out, cleaned the  <br/>\n&gt; litter box, and filled the cat&#39;s water and food dish!  And, now that  <br/>\n&gt; you&#39;ve decided to drag your sorry bear-butts downstairs, and grace  <br/>\n&gt; Momma Bear&#39;s kitchen with your grumpy presence!  Listen good, cause  <br/>\n&gt; I&#39;m only going to say this one more time . . . I HAVEN&#39;T MADE THE  <br/>\n&gt; DAMN PORRIDGE YET!&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Good enough unschooling parent","postDate":"1272909778","msgId":53743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFERDRENjFCLTY2RDMtNDgwRC05OEI5LTEzNkRBRkM5RjZCN0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGhybGJiYytycWptQGVHcm91cHMuY29tPg==","referencesHeader":"PGhybGJiYytycWptQGVHcm91cHMuY29tPg=="},"prevInTopic":53724,"nextInTopic":53747,"prevInTime":53742,"nextInTime":53744,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"... I remember my homeopath telling me I should be content to be the good enough mother of Winnicot s description, to not want to be better. She thought I was","messageBody":"<div id=\"ygrps-yiv-817211153\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I still don&#39;t think this was &quot;good enough&quot; parenting, but I too  <br/>\n&gt; wonder what that term really means. I think the term &quot;good enough&quot;  <br/>\n&gt; originally came about with respect to mothering... ah, I just looked  <br/>\n&gt; it up. It&#39;s a Winnicott term (he was a psychoanalyst and was a  <br/>\n&gt; colleague of John Bowlby, the man who first formulated Attachment  <br/>\n&gt; Theory). Here&#39;s his definition (as per Wikipedia):  &quot;A prime example  <br/>\n&gt; of this is his ideal of the &quot;good-enough mother,&quot; the *imperfectly  <br/>\n&gt; attentive mother* who does a better job than the &quot;perfect&quot; one who  <br/>\n&gt; risks stifling her child&#39;s development as a separate being.&quot;<br/>\n&gt;<br/>\n </span></blockquote>I remember my homeopath telling me I should be content to be the good  <br/>\nenough mother of Winnicot&#39;s description, to not want to be better. She  <br/>\nthought I was stifling my daughter&#39;s development by not telling her  <br/>\nwhat to do, by not giving her chores, by not giving her more reason to  <br/>\nhate me and therefore become a separate person. I think that&#39;s what  <br/>\nshe did with her kids. At least one of them isn&#39;t speaking to her  <br/>\nanymore.<br/>\n<br/>\nShe told me that &quot;Roseanne&quot; was a good role model for mothering and  <br/>\nwhile I&#39;ve changed by opinion of that show from reading Pam S&#39;s take  <br/>\non it, I still think I&#39;d like to do things a bit differently. For me  <br/>\nthat means examining what I do to see if I could do it better, keeping  <br/>\nmy relationship with my daughter at the forefront of my thoughts.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Good enough unschooling parent","postDate":"1272852652","msgId":53724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhybGJiYytycWptQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMyMzEyOEI1LUVFODQtNDBGMS04M0VELTkwMTFEMjUxMTcxMUB2ZXJpem9uLm5ldD4="},"prevInTopic":53721,"nextInTopic":53743,"prevInTime":53723,"nextInTime":53725,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"... The visual on this is amazing.  And not only are the parents trying to keep their kids heads above the water, they are often trying to keep from going","messageBody":"<div id=\"ygrps-yiv-499179307\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; *The way I picture conventional parenting is it&#39;s like being dropped  <br/>\n&gt; into a vast sea with a bunch of other parents who are all paddling in  <br/>\n&gt; what they assume is the right direction while they battle to keep  <br/>\n&gt; their kids&#39; heads above the water. I don&#39;t see them as uncaring for  <br/>\n&gt; not abandoning the mainstream even if it isn&#39;t perfect.*<br/>\n<br/>\n </span></blockquote>The visual on this is amazing.  And not only are the parents trying to keep their kids&#39; heads above the water, they are often trying to keep from going under themselves.<br/>\n<br/>\nA wise mentor (a practicum supervisor) once told me, when I was voicing criticism about the actions of the parents of a child I was supporting, that she still felt a great deal of compassion for those particular parents as they were doing the best they could with what they knew. Even though this was a family who struggled with great disadvantages, they loved and cared for their children. But they really didn&#39;t have many strategies to deal with their kids, and  while they were busy trying keep afloat in the midst of their own dramas (and addictions), they didn&#39;t have time or energy to seek out other options. But they did love their kids a great deal. <br/>\n<br/>\nI still don&#39;t think this was &quot;good enough&quot; parenting, but I too wonder what that term really means. I think the term &quot;good enough&quot; originally came about with respect to mothering... ah, I just looked it up. It&#39;s a Winnicott term (he was a psychoanalyst and was a colleague of John Bowlby, the man who first formulated Attachment Theory). Here&#39;s his definition (as per Wikipedia):  &quot;A prime example of this is his ideal of the &quot;good-enough mother,&quot; the *imperfectly attentive mother* who does a better job than the &quot;perfect&quot; one who risks stifling her child&#39;s development as a separate being.&quot;<br/>\n<br/>\nI don&#39;t think anyone will be the perfect unschooling parent on a constant basis (maybe some veterans, perhaps :) ) - for me, trying to achieve that would likely be counter-productive to my goals of being more relaxed, more accepting, more attentive, more joyful. I like the idea of it being a moment-by-moment journey rather than an &quot;on your mark, get set, go!&quot; race for perfection.<br/>\n<br/>\nThe &quot;moment-by-moment&quot; perspective does mean that we never actually &quot;arrive&quot;, that the destination is the journey itself rather achieve some sort of set goal (although I do think that we can certainly have personal goals for ourselves, such as being more open to things, being more engaged, etc.). For me, it also means that I am always reflecting on my parenting in a way that is supportive for both my child and myself (rather than wallowing in guilt when I do mess up) and that encourages me to continue to embrace the ideas and principles that most optimally facilitate my child&#39;s unique development.<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Good enough unschooling parent","postDate":"1272839606","msgId":53721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4QjA0MDM5LTRDQkYtNERCQy1BM0ZBLTYxMDc1NUQ2NDNCOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEMyMzEyOEI1LUVFODQtNDBGMS04M0VELTkwMTFEMjUxMTcxMUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGhyaGUzNStubGVnQGVHcm91cHMuY29tPiA8MENDNzAxREUtQjA2NS00MjJDLUI4RjgtRjU0OERGNjkxMzIwQHZlcml6b24ubmV0PiA8NkFGNTNBOEItRTMxQy00MTMxLUJCRjItQjJFMDUwNUIxOTNEQFNhbmRyYWRvZGQuY29tPiA8QzIzMTI4QjUtRUU4NC00MEYxLTgzRUQtOTAxMUQyNTExNzExQHZlcml6b24ubmV0Pg=="},"prevInTopic":53720,"nextInTopic":53724,"prevInTime":53720,"nextInTime":53722,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"-=-It could be the cultures I ve grown up in that are giving me a very different view. I ve spent most of my years in upperish middle class towns where it s","messageBody":"<div id=\"ygrps-yiv-501572509\">-=-It could be the cultures I&#39;ve grown up in that are giving me a very<br/>\ndifferent view. I&#39;ve spent most of my years in upperish middle class<br/>\ntowns where it&#39;s expected kids will go to college after high school.<br/>\nParent participation in school and their kids&#39; activities is high.-=-<br/>\n<br/>\nThat&#39;s probably the difference.<br/>\nNorthern New Mexico has much less pressure than the NE U.S. in those  <br/>\nthings.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Good enough unschooling parent","postDate":"1272838163","msgId":53720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyMzEyOEI1LUVFODQtNDBGMS04M0VELTkwMTFEMjUxMTcxMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDZBRjUzQThCLUUzMUMtNDEzMS1CQkYyLUIyRTA1MDVCMTkzREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhyaGUzNStubGVnQGVHcm91cHMuY29tPiA8MENDNzAxREUtQjA2NS00MjJDLUI4RjgtRjU0OERGNjkxMzIwQHZlcml6b24ubmV0PiA8NkFGNTNBOEItRTMxQy00MTMxLUJCRjItQjJFMDUwNUIxOTNEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":53708,"nextInTopic":53721,"prevInTime":53719,"nextInTime":53721,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"... While there are parents like that, the ones I know in my community give thought to their parenting. They want to do right. They want to do good but so much","messageBody":"<div id=\"ygrps-yiv-881307711\">On May 2, 2010, at 10:26 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If one feeds and clothes and controls kids with &quot;consistent rules,&quot;<br/>\n&gt; and sends them to school, then that&#39;s all they &quot;have to&quot; do.<br/>\n<br/>\n </span></blockquote>While there are parents like that, the ones I know in my community  <br/>\ngive thought to their parenting. They want to do right. They want to  <br/>\ndo good but so much conventional advice conflicts so they can&#39;t know  <br/>\nwhen they&#39;re getting warmer. There are no clear guidelines.<br/>\n<br/>\nI agree, conventional parenting is easier to do thoughtlessly. It can  <br/>\nbe done with one rule: &quot;Do what I say or else.&quot;<br/>\n<br/>\nThe parenting section (separate from the baby section) at Barnes and  <br/>\nNoble around here cover a good 12 feet of shelving. They aren&#39;t being  <br/>\nstocked for parents who are doing only what they have to. (Do B&Ns  <br/>\ncater to regional tastes? Would the number of feet devoted to  <br/>\nparenting books indicate how much parents wanted to do different than  <br/>\ntheir parents and neighbors?)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe I<br/>\n&gt; think this because of things I saw when I was a teacher. Some kids&#39;<br/>\n&gt; parents are just barely there.<br/>\n<br/>\n </span></blockquote>Maybe it was the area you were in. Maybe the effects of parents who  <br/>\nwere just barely there stood out more.<br/>\n<br/>\nMost of the stay at home conventional parents I know are a lot like  <br/>\nBeaver&#39;s mom except college educated. The big difference is they don&#39;t  <br/>\ncome up with the perfect solution by the end of the half hour ;-)<br/>\n<br/>\nThe way I picture conventional parenting is it&#39;s like being dropped  <br/>\ninto a vast sea with a bunch of other parents who are all paddling in  <br/>\nwhat they assume is the right direction while they battle to keep  <br/>\ntheir kids&#39; heads above the water. I don&#39;t see them as uncaring for  <br/>\nnot abandoning the mainstream even if it isn&#39;t perfect. From a  <br/>\nconventional parenting point of view, parents heading off in other  <br/>\ndirections don&#39;t necessarily have better directions. In fact the  <br/>\nunschoolers sound irresponsible like they don&#39;t even care if their  <br/>\nkids heads stay above water.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t think the happiness of children is much of a factor in how<br/>\n&gt; most parents judge their success.<br/>\n<br/>\n </span></blockquote>I don&#39;t think so either but I don&#39;t see it as a lack of caring in the  <br/>\nparents I know. Security -- including financial which (supposedly)  <br/>\ncomes from a good education -- is their primary concern. I do see a  <br/>\nlot effort being put into their kids happiness, but if education needs  <br/>\nto come first.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But the parents blame the kids, not themselves, for most of those<br/>\n&gt; things, with a simple &quot;If he had done what I told him to do, this<br/>\n&gt; wouldn&#39;t have happened.&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>Some, yes, but not the ones I&#39;ve known. The ones I know do question  <br/>\nwhether they&#39;ve done right. But they don&#39;t have the tools to figure  <br/>\nout what&#39;s &quot;right&quot;. Like most parents, they trade anecdotes and go by  <br/>\ntrial and error to see what works.<br/>\n<br/>\nIt could be the cultures I&#39;ve grown up in that are giving me a very  <br/>\ndifferent view. I&#39;ve spent most of my years in upperish middle class  <br/>\ntowns where it&#39;s expected kids will go to college after high school.  <br/>\nParent participation in school and their kids&#39; activities is high.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":156418579,"authorName":"dana_burdick","from":"&quot;dana_burdick&quot; &lt;DanaBurdick@...&gt;","profile":"dana_burdick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Good enough unschooling parent","postDate":"1272817298","msgId":53708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyazhxaStjYmFiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhyaGUzNStubGVnQGVHcm91cHMuY29tPg=="},"prevInTopic":53704,"nextInTopic":53720,"prevInTime":53707,"nextInTime":53709,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"A similar thing happened to me.  I had been practicing unschooling for a couple years, thought I was doing pretty well – kids were doing much better –","messageBody":"<div id=\"ygrps-yiv-1657797762\">A similar thing happened to me.  I had been practicing unschooling for a couple years, thought I was doing pretty well  kids were doing much better  family was much more peaceful and all that.  And then I read Rue Cream&#39;s book.  I was thrown by how much further I could go. I realized that I had to crank my efforts up a lot more.  I didn&#39;t feel that I had to be perfect; I just felt that my mission was clear and urgent.  I made notes in all the areas I felt I could do better and dated it.  Every so often I&#39;d run into those notes and read back over them.  Had I improved any?  I&#39;d reassess and soldier on.  I&#39;d just keep iterating over and over trying to be creative and make better choices.  Things were going well before, but they got even better.<br/>\n<br/>\nLater I read someone&#39;s post that had distilled unschooling down to four words: Trust, Help, Inspire and Connect.<br/>\n<br/>\nI printed those words out in large font and taped them up for myself.  Each week I would focus on one of the words.  I asked the kids one day which word they would like me to focus on the most.  They both said Connect.  So simple.  They even gave me examples of how I could connect with them better.  And, things got even better.<br/>\n<br/>\nIt seems that things are so good now that we couldn&#39;t possibly improve on anything.  I have to humbly admit that history would show that that&#39;s probably not the case.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What is the absolute minimal to<br/>\n </span></blockquote>unschooling ? When you&#39;re so tired that your legs ache and your eyes aren&#39;t<br/>\nparallel, or when you&#39;re awfully stressed out, what are the elements that still<br/>\nHAVE to be there ?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>Breathe. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I have the feeling<br/>\n </span></blockquote>that, when you&#39;re a &quot;mainstream&quot; parent (I know I caricature), there is a point<br/>\nwhere you feel you have done your best.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>This suggests that there is an end to your efforts as a parent.  If there is an end, when does that time come?  I still call my mom to get advice and I&#39;m gonna as long as she has her wits about her.  Why?  `cause I&#39;m her kid and I respect her opinion.  I think the question should be am I doing my best, right now?  And when the next moment comesam I doing the best in this new moment?  And so on. It never ends.<br/>\n<br/>\n-Dana</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Good enough unschooling parent","postDate":"1272810392","msgId":53704,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBRjUzQThCLUUzMUMtNDEzMS1CQkYyLUIyRTA1MDVCMTkzREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDBDQzcwMURFLUIwNjUtNDIyQy1COEY4LUY1NDhERjY5MTMyMEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGhyaGUzNStubGVnQGVHcm91cHMuY29tPiA8MENDNzAxREUtQjA2NS00MjJDLUI4RjgtRjU0OERGNjkxMzIwQHZlcml6b24ubmV0Pg=="},"prevInTopic":53702,"nextInTopic":53708,"prevInTime":53703,"nextInTime":53705,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"-=- ... -=-No, I don t think so. I think it s harder for mainstream parents -=- I agree with the original poster. If one feeds and clothes and controls kids","messageBody":"<div id=\"ygrps-yiv-262401629\">-=-<br/>\n<blockquote><span title=\"ireply\">  &gt; I have the feeling that, when you&#39;re a &quot;mainstream&quot; parent (I know I<br/>\n &gt; caricature), there is a point where you feel you have done your best<br/>\n<br/>\n </span></blockquote>-=-No, I don&#39;t think so. I think it&#39;s harder for mainstream parents -=-<br/>\n<br/>\nI agree with the original poster.<br/>\n<br/>\nIf one feeds and clothes and controls kids with &quot;consistent rules,&quot;  <br/>\nand sends them to school, then that&#39;s all they &quot;have to&quot; do.  Maybe I  <br/>\nthink this because of things I saw when I was a teacher.  Some kids&#39;  <br/>\nparents are just barely there.  In some cases they pay the rent and  <br/>\nbring in groceries, and not a lot more.  Even when one of the older  <br/>\ngirls is left to take care of younger siblings for MANY hours a week,  <br/>\nthat&#39;s not considered neglect if there&#39;s food and the door locks and  <br/>\nthe kids aren&#39;t being physically harmed.<br/>\n<br/>\n-=-What does good mean? Punishing them when<br/>\nthey do wrong? Making them happy?-=-<br/>\n<br/>\nI don&#39;t think the happiness of children is much of a factor in how  <br/>\nmost parents judge their success.   I think happiness is like dessert,  <br/>\nonly  to be had after ALL the housecleaning and homework and  yardwork  <br/>\nand being nice to irritating relatives and getting good grades.  Then  <br/>\nhappiness is an allowable option.  But being happy if any of those  <br/>\nother factors haven&#39;t been met can seem like thievery in some families  <br/>\n(and sin in others).<br/>\n<br/>\n-=-Parents might reassure each other they&#39;ve done their best -=-<br/>\n<br/>\nAnd they do.  Those conversations about how hard it is to be parents  <br/>\nand how kids never listen are designed to emphasize the us and them.   <br/>\nBut even if friends and neighbors are critical about a parent being  <br/>\ntoo absent or defensive, they decide the neighbors are busybodies and  <br/>\ntell them off and avoid them after that.  That I&#39;ve seen all over the  <br/>\nplace.<br/>\n<br/>\n-=-What&#39;s the<br/>\nmeasure of success? Kids bringing home good grades? Kids performing on<br/>\nsports teams? Kids going to college? Kids not being in jail? Kids not<br/>\nusing drugs? Kids not involved in pregnancies?-=-<br/>\n<br/>\nBut the parents blame the kids, not themselves, for most of those  <br/>\nthings, with a simple &quot;If he had done what I told him to do, this  <br/>\nwouldn&#39;t have happened.&quot;<br/>\n<br/>\nWhile I was writing this,  a bit came on on Sunday Morning (news show)  <br/>\nabout a grandmother raising two of the children of her son who&#39;s in  <br/>\nprison for life.  They asked what she was doing differently with these  <br/>\nkids.  She said &quot;Raised them in a better environment, sent them to  <br/>\nbetter schools,&quot; and I lose the quote then, but it was attending  <br/>\nthings they were involved in, spending time with them, paying  <br/>\nattention to them.<br/>\n<br/>\n<br/>\nA quote from the featured  interviewee.  Says his mom used to say  <br/>\n&quot;They have to think that you care before they care what you think.&quot;<br/>\n<br/>\nSandraa<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Good enough unschooling parent","postDate":"1272803800","msgId":53702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBDQzcwMURFLUIwNjUtNDIyQy1COEY4LUY1NDhERjY5MTMyMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhyaGUzNStubGVnQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyaGUzNStubGVnQGVHcm91cHMuY29tPg=="},"prevInTopic":53686,"nextInTopic":53704,"prevInTime":53701,"nextInTime":53703,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"... No, I don t think so. I think it s harder for mainstream parents because there isn t a clear goal and guidelines are often conflict. Their philosophy is to","messageBody":"<div id=\"ygrps-yiv-1002277943\">On May 1, 2010, at 10:33 AM, seccotine_ch wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have the feeling that, when you&#39;re a &quot;mainstream&quot; parent (I know I  <br/>\n&gt; caricature), there is a point where you feel you have done your best<br/>\n<br/>\n </span></blockquote>No, I don&#39;t think so. I think it&#39;s harder for mainstream parents  <br/>\nbecause there isn&#39;t a clear goal and guidelines are often conflict.  <br/>\nTheir philosophy is to be &quot;good&quot; parents but that&#39;s so vague that it&#39;s  <br/>\nuseless to turn to for help. What does good mean? Punishing them when  <br/>\nthey do wrong? Making them happy?<br/>\n<br/>\nParents might reassure each other they&#39;ve done their best but there&#39;s  <br/>\nno yardstick to help measure so they don&#39;t really know. What&#39;s the  <br/>\nmeasure of success? Kids bringing home good grades? Kids performing on  <br/>\nsports teams? Kids going to college? Kids not being in jail? Kids not  <br/>\nusing drugs? Kids not involved in pregnancies?<br/>\n<br/>\nRadical unschooling is much clearer. It&#39;s about building  <br/>\nrelationships. It&#39;s about facilitating kids interests. It&#39;s about  <br/>\npartnering with them to navigate the world.<br/>\n<br/>\nRather than seeing unschooling as some state of perfection to achieve,  <br/>\nit&#39;s better to see it as making better choices. Making choices that  <br/>\nmove you toward better relationships, help them explore, help them  <br/>\nlive kindly and respectfully and peacefully in the world. In that way  <br/>\nunschooling is much easier than conventional parenting. It&#39;s coming up  <br/>\nwith unique solutions rather than relying on traditional techniques  <br/>\nthat&#39;s the hard part at the beginning.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Good enough unschooling parent","postDate":"1272728063","msgId":53686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJFQjM4NkVGLUExQUMtNDAxMi1BMDg0LTE2M0Y3NzgyNkMwNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhyaGUzNStubGVnQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyaGUzNStubGVnQGVHcm91cHMuY29tPg=="},"prevInTopic":53683,"nextInTopic":53702,"prevInTime":53685,"nextInTime":53687,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"-=- I ve always liked RU s ideas (and the very convincing way Sandra has of putting them)-=- Thank you, but I want to say that I never use the abbreviation or","messageBody":"<div id=\"ygrps-yiv-549968436\">-=- I&#39;ve always liked RU&#39;s ideas (and the very convincing way Sandra  <br/>\nhas of putting them)-=-<br/>\n<br/>\nThank you, but I want to say that I never use the abbreviation or term  <br/>\n&quot;RU.&quot;  I think it&#39;s a problem.  For discussions on this list, please  <br/>\nuse &quot;unschooling.&quot;  If you want to talk about radical unschooling  <br/>\n(which isn&#39;t usually a term we need here), writing it out is  <br/>\nadvantageous for several reasons.  I&#39;ll never keep people from using  <br/>\n&quot;RU,&quot; but I can request that it be avoided on this list.<br/>\n<br/>\n-=-I have more time and energy now. I really would like to improve the  <br/>\nsituation, and to let them know that I am willing to change. &quot;Is it  <br/>\ntoo late ?&quot; is somehow a useless question, because, well, even if it  <br/>\nis, what else can I do but changing my ways and see what the outcome  <br/>\nwill be ?. What I would like to know, actually, is this : is there  <br/>\nsomething more I can do, besides changing (or progressing in the  <br/>\nunschooling way, because I was already aiming in this direction), to  <br/>\nrepair the harm that has already been done ?-=-<br/>\n<br/>\nIf every decision you make takes you nearer to the way you want to be  <br/>\nwith them, and away from the way that&#39;s making you feel insufficient,  <br/>\nthat&#39;s the best thing you can do.<br/>\n<br/>\nThe first quote/account on this page might be helpful:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/joy\">http://sandradodd.com/chores/joy</a><br/>\n<br/>\nAnd this<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/option\">http://sandradodd.com/option</a><br/>\nhas some good things including<br/>\n&quot;Unschooling didn&#39;t blossom until I stepped away from traditional  <br/>\nparenting.&quot;<br/>\nMercedes / mulwiler<br/>\non the UnschoolingDiscussion list<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":323764344,"authorName":"seccotine_ch","from":"&quot;seccotine_ch&quot; &lt;seccotine@...&gt;","profile":"seccotine_ch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Good enough unschooling parent","postDate":"1272724389","msgId":53683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyaGUzNStubGVnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":53686,"prevInTime":53682,"nextInTime":53684,"topicId":53683,"numMessagesInTopic":0,"msgSnippet":"Hi I have recently purchased the Big Book of Unschooling and I am currently reading it. This is great. I ve always liked RU s ideas (and the very convincing","messageBody":"<div id=\"ygrps-yiv-1968170865\">Hi<br/>\n<br/>\nI have recently purchased the Big Book of Unschooling and I am currently reading it. This is great. I&#39;ve always liked RU&#39;s ideas (and the very convincing way Sandra has of putting them), but, with my extra &quot;experience&quot; (we unschool since 2006), I understand some of them at a different level. So, on the whole, this reading makes me feel a lot better. <br/>\n<br/>\nThough  I realize that I still don&#39;t live a 100% unschooled life. I would love to, I love this philosophy. Reading Sandra reminds me that I could do better  and, suddenly, I wonder if I haven&#39;t done to much harm already.<br/>\n<br/>\nThese last years, I have finished a degree at college and had another baby. My kids have been left a lot by themselves  I was there, of course, but maybe not as attentive and kind as I could have been. My son plays a lot with his computer, and I don&#39;t mind, but I am not interested in his games, though I do try to. So I listen to him when he talks to me about his victories and difficulties, but maybe not as intensely as I could. We have spent lots and lots of day doing almost nothing together, because I was too tired, or busy doing other things (for college, or for money, mainly), or because they were playing and I didn&#39;t want to interrupt them. I have tried to control them, also, because I needed help tidying up the house, or because I was afraid about the school tests (they are mandatory in our state, if we want to pursue homeschooling). <br/>\n<br/>\nEtc.<br/>\n<br/>\nSo I have two questions.<br/>\n<br/>\nFirst one : how can I be a &quot;good enough&quot; unschooling parent ? I have the feeling that, when you&#39;re a &quot;mainstream&quot; parent (I know I caricature), there is a point where you feel you have done your best. Kids have clean sheets, clean teeth, you have served them a certain amount of vegetables and of good lessons, you didn&#39;t yelled at them nor spanked them, though you might have grounded them  But how is it for unschooling parents ? I mean, parents like me, who can see they&#39;re not doing the best even if they try  who sometimes don&#39;t have a clue what to propose to their kids, who sometimes don&#39;t want to answer another question, who sometimes yell instead of listening, doubt instead of trusting, try to control others instead of controlling themselves ? What is the absolute minimal to unschooling ? When you&#39;re so tired that your legs ache and your eyes aren&#39;t parallel, or when you&#39;re awfully stressed out, what are the elements that still HAVE to be there ? <br/>\n<br/>\nSecond one : I have more time and energy now. I really would like to improve the situation, and to let them know that I am willing to change. &quot;Is it too late ?&quot; is somehow a useless question, because, well, even if it is, what else can I do but changing my ways and see what the outcome will be ?. What I would like to know, actually, is this : is there something more I can do, besides changing (or progressing in the unschooling way, because I was already aiming in this direction), to repair the harm that has  already been done ?<br/>\n<br/>\nI am re-reading what I have written and I realize that these are kind of weird questions. They don&#39;t seem to fit the unschooling philosophy very well - as if I was trying to unschool while keeping a &quot;mainstream&quot; point of view. I feel that there is something awkard, though I can&#39;t put my finger on it - maybe you will and this will be tremendously helpful. <br/>\n<br/>\nI also guess that I&#39;m looking for a kind of survival kit, for these days when I&#39;m too exhausted to think clearly, like a set of questions I can refer to (you know, like when you check if your kid is hungry or tired). <br/>\n<br/>\nThank you.<br/>\n<br/>\nHelen, from Geneva (Switzerland), mom of Sylvain (9yo), Cyrielle (7yo), Circé (4 yo) and Valerian (10mo)</div>","specialLinks":[]}],"prevTopicId":53780,"nextTopicId":53622}}