{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":55326806,"authorName":"rumpleteasermom","from":"&quot;rumpleteasermom&quot; &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling methods","postDate":"1018966218","msgId":35105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE5aGJjYSt0dGI4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwM2YwMWMxZTQ5OCQzNzlkNDQ2MCQ3ODgxMWMwY0BzdWdhcmNyYWZ0ZXI+"},"prevInTopic":34897,"nextInTopic":0,"prevInTime":35104,"nextInTime":35106,"topicId":34855,"numMessagesInTopic":0,"msgSnippet":"... wrote: When you question a highly educated person it is ... that until ... come at a ... Yes, it did.  And when I talk about how fast Jenni reads, it is","messageBody":"<div id=\"ygrps-yiv-494037434\">--- In Unschooling-dotcom@y..., &quot;sharon childs&quot; &lt;sugarcrafter@u...&gt; <br/>\nwrote:<br/>\n When you question a highly educated <br/>\nperson it is<br/>\n<blockquote><span title=\"ireply\"> &gt; such a surprise when they say they didn&#39;t learn how to do this or <br/>\n </span></blockquote>that until<br/>\n<blockquote><span title=\"ireply\"> &gt; much later than &quot;average&quot;.  Like even speech.  To all things just <br/>\n </span></blockquote>come at a<br/>\n<blockquote><span title=\"ireply\"> &gt; different pace.<br/>\n&gt; <br/>\n&gt; Your letter has a lot of insight.  I appreciate it.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>Yes, it did.  And when I talk about how fast Jenni reads, it is just a <br/>\nfact. Jenni can whip through books faster than anyone I&#39;ve ever met.  <br/>\nRachel can point to a spot in the outfield and hit a ball to it 9 <br/>\ntimes out of 10 (on a decent pitch).  It doesn&#39;t mean either is better <br/>\nthan the other as a person, they just have differences.<br/>\n<br/>\nBridget</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling methods","postDate":"1018890973","msgId":34897,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNy5mZmZmMzI3LjI5ZWM2NGRkQGFvbC5jb20+"},"prevInTopic":34888,"nextInTopic":35105,"prevInTime":34896,"nextInTime":34898,"topicId":34855,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/15/2002 12:11:50 AM Pacific Daylight Time, ... Raundi -- this is so heartbreaking, isn t it? To think that there are kids STILL sitting in","messageBody":"<div id=\"ygrps-yiv-1328179507\">In a message dated 4/15/2002 12:11:50 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:deltatransport@...\">deltatransport@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that concentrating on other ways of learning is very effective (i.e. <br/>\n&gt; videos, TV, audio tapes, live presentations, etc.)  Then as maturity sets <br/>\n&gt; in one can learn to read for pleasure and then apply it to more challenging <br/>\n&gt; tasks .   I hope this helps a little Sharon.  I wish I had known that just <br/>\n&gt; because I was slow at reading didn&#39;t mean I was dumb.  I felt that way for <br/>\n&gt; many years.  I felt like such a fake.  I also felt that I was lazy for not <br/>\n&gt; wanting to read.  <br/>\n<br/>\n </span></blockquote>Raundi -- this is so heartbreaking, isn&#39;t it? To think that there are kids <br/>\nSTILL sitting in school, thinking they&#39;re dumb, because their specific <br/>\nabilities are not a good match for how school teaches. Just such a SHAME.<br/>\n<br/>\n--pamS<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":81074294,"authorName":"sharon childs","from":"&quot;sharon childs&quot; &lt;sugarcrafter@...&gt;","profile":"sugarcraftart","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling methods","postDate":"1018881826","msgId":34888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2YwMWMxZTQ5OCQzNzlkNDQ2MCQ3ODgxMWMwY0BzdWdhcmNyYWZ0ZXI+","referencesHeader":"PDAwMWYwMWMxZTQ0YiRjZjIwZDRjMCQxN2VkMDQ0NEBvYy5jb3gubmV0Pg=="},"prevInTopic":34855,"nextInTopic":34897,"prevInTime":34887,"nextInTime":34889,"topicId":34855,"numMessagesInTopic":0,"msgSnippet":"Raundi, Thank you for the lovely message and sharing your personal experience.  I guess maybe we are doing better than I thought we were.  It is not as though ","messageBody":"<div id=\"ygrps-yiv-1649124686\">Raundi,<br/>\nThank you for the lovely message and sharing your personal experience.  I<br/>\nguess maybe we are doing better than I thought we were.  It is not as though<br/>\nshe is not reading at all,  her reading is probably at about a second or<br/>\nthird grade level.  I do know what you mean though about feeling you weren&#39;t<br/>\nas smart as the ones who were faster.<br/>\n<br/>\nWhy do &quot;we&quot; put so much emphasis on speed?  Like the faster they learn the<br/>\nsmarter they are, and that doesn&#39;t even make much sense.  Just because a<br/>\nchild is potty trained at 18 months doesn&#39;t make him any more intelligent<br/>\nthan one trained at 3 1/2.  When you question a highly educated person it is<br/>\nsuch a surprise when they say they didn&#39;t learn how to do this or that until<br/>\nmuch later than &quot;average&quot;.  Like even speech.  To all things just come at a<br/>\ndifferent pace.<br/>\n<br/>\nYour letter has a lot of insight.  I appreciate it.<br/>\n<br/>\nSharon<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Delta Transport&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:deltatransport@...\">deltatransport@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooling-dotcom@yahoogroups.com\">unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Monday, April 15, 2002 12:04 AM<br/>\nSubject: [Unschooling-dotcom] unschooling methods<br/>\n<br/>\n<br/>\n&gt; I am new to this group, new to homeschooling, and new to unschooling.  We<br/>\nhave just started homeschooling last year and we have been unschoolers for<br/>\nmost of it.  (We did give a curriculum a try until we found out how much we<br/>\nwere missing out on while we were &quot;schooling&quot;)<br/>\n&gt;<br/>\n&gt; I was diagnosed with dislexia when I was in first grade.  My parents never<br/>\ntold me. I think they didn&#39;t understand it and they thought it might hold me<br/>\nback if I knew. In any case it was pretty mild.  I have to say that I never<br/>\nread anything for fun until I was in Junior high.  A friend gave me some<br/>\nteen romance novels and I went crazy over them.  I gave up reading for<br/>\npleasure when so much reading was required of me in school.  Actually I<br/>\nnever did any of the required reading either.  It was too tedious for me.  I<br/>\nlearned everything I needed to know from lectures, TV and talking to my<br/>\nfriends.  I actually got fairly decent grades.  I went to Junior college (my<br/>\ngrades got even better) and then transferred to a fairly psrestigious<br/>\nUniversity. There I maintained a 3.5gpa and still didn&#39;t do a lot of<br/>\nreading.  But I turned into a fairly decent writer.  I worked full time at a<br/>\nlaw office and as a waitress while in school.  I read for instructions when<br/>\nI had too.  But I would so much rather have someone tell me or show me what<br/>\nto do.  Now I am not suggesting that everyone should &quot;get through&quot; life like<br/>\nthat.  But I know that my dislexia and the pressure of school hindered my<br/>\nability to learn from the written word.  I think that concentrating on other<br/>\nways of learning is very effective (i.e. videos, TV, audio tapes, live<br/>\npresentations, etc.)  Then as maturity sets in one can learn to read for<br/>\npleasure and then apply it to more challenging tasks .   I hope this helps a<br/>\nlittle Sharon.  I wish I had known that just because I was slow at reading<br/>\ndidn&#39;t mean I was dumb.  I felt that way for many years.  I felt like such a<br/>\nfake.  I also felt that I was lazy for not wanting to read.  I know<br/>\ndifferently now.  I know that there are lots of ways to learn.  That is is<br/>\nnever to late to learn to read well (which I am getting better at everyday,<br/>\nI am now 35)  and It is never too late to fall in love with the written<br/>\nword.   I do love to read now.  I wish you all the best with your Grand<br/>\nDaughter.  How lucky she is to have you for a grandma!<br/>\n&gt;<br/>\n&gt; Raundi<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":95835678,"authorName":"Delta Transport","from":"&quot;Delta Transport&quot; &lt;deltatransport@...&gt;","profile":"yoichi64","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling methods","postDate":"1018854275","msgId":34855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWYwMWMxZTQ0YiRjZjIwZDRjMCQxN2VkMDQ0NEBvYy5jb3gubmV0Pg=="},"prevInTopic":0,"nextInTopic":34888,"prevInTime":34854,"nextInTime":34856,"topicId":34855,"numMessagesInTopic":0,"msgSnippet":"I am new to this group, new to homeschooling, and new to unschooling.  We have just started homeschooling last year and we have been unschoolers for most of","messageBody":"<div id=\"ygrps-yiv-17160948\">I am new to this group, new to homeschooling, and new to unschooling.  We have just started homeschooling last year and we have been unschoolers for most of it.  (We did give a curriculum a try until we found out how much we were missing out on while we were &quot;schooling&quot;)  <br/>\n<br/>\nI was diagnosed with dislexia when I was in first grade.  My parents never told me. I think they didn&#39;t understand it and they thought it might hold me back if I knew. In any case it was pretty mild.  I have to say that I never read anything for fun until I was in Junior high.  A friend gave me some teen romance novels and I went crazy over them.  I gave up reading for pleasure when so much reading was required of me in school.  Actually I never did any of the required reading either.  It was too tedious for me.  I learned everything I needed to know from lectures, TV and talking to my friends.  I actually got fairly decent grades.  I went to Junior college (my grades got even better) and then transferred to a fairly psrestigious University. There I maintained a 3.5gpa and still didn&#39;t do a lot of reading.  But I turned into a fairly decent writer.  I worked full time at a law office and as a waitress while in school.  I read for instructions when I had too.  But I would so much rather have someone tell me or show me what to do.  Now I am not suggesting that everyone should &quot;get through&quot; life like that.  But I know that my dislexia and the pressure of school hindered my ability to learn from the written word.  I think that concentrating on other ways of learning is very effective (i.e. videos, TV, audio tapes, live presentations, etc.)  Then as maturity sets in one can learn to read for pleasure and then apply it to more challenging tasks .   I hope this helps a little Sharon.  I wish I had known that just because I was slow at reading didn&#39;t mean I was dumb.  I felt that way for many years.  I felt like such a fake.  I also felt that I was lazy for not wanting to read.  I know differently now.  I know that there are lots of ways to learn.  That is is never to late to learn to read well (which I am getting better at everyday, I am now 35)  and It is never too late to fall in love with the written word.   I do love to read now.  I wish you all the best with your Grand Daughter.  How lucky she is to have you for a grandma!<br/>\n<br/>\nRaundi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":35060,"nextTopicId":35106}}