{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] rules vs principles","postDate":"1136219285","msgId":23716,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwQTAyQTdBLTcxNUUtNDZDQy04MTA3LTgxQjlGOUY3M0I2N0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRwYmpkcStrYXBuQGVHcm91cHMuY29tPg==","referencesHeader":"PGRwYmpkcStrYXBuQGVHcm91cHMuY29tPg=="},"prevInTopic":23715,"nextInTopic":0,"prevInTime":23715,"nextInTime":23717,"topicId":23715,"numMessagesInTopic":0,"msgSnippet":"... Jigsaw puzzles and toddlers don t mix, but there are some great floor puzzles for little kids!  And some good 16 or 20 piece puzzles, and tray puzzles. ","messageBody":"<div id=\"ygrps-yiv-314903167\">On Jan 2, 2006, at 9:12 AM, multimomma wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyway, pieces really do scatter! I really don&#39;t blame the kids  <br/>\n&gt; doing it, Sam is four, Dan is<br/>\n&gt; two, and they just want to help. However, both of them are VERY  <br/>\n&gt; active, with little impulse<br/>\n&gt; control and lots of energy LOL! I just didn&#39;t want to squelch and  <br/>\n&gt; didn&#39;t know what to say.<br/>\n&gt; SO it seems that we&#39;ve just put puzzles away and haven&#39;t gotten  <br/>\n&gt; them out.<br/>\n<br/>\n </span></blockquote>---------------<br/>\n<br/>\nJigsaw puzzles and toddlers don&#39;t mix, but there are some great floor  <br/>\npuzzles for little kids!  And some good 16 or 20 piece puzzles, and  <br/>\ntray puzzles.<br/>\n<br/>\nWhen my kids were babies we did no adult-type jigsaw puzzles.  I only  <br/>\nsewed for a few hours at night sometimes and then put all the pins  <br/>\nand needles and scissors and seam rippers up high.<br/>\n<br/>\nWe just made the house kid-safe and kid-friendly, and then we didn&#39;t  <br/>\nneed to have so many rules!<br/>\n<br/>\n<br/>\nThanks for the bit about self-regulation.  When most people say &quot;I  <br/>\nwant my kids to self-regulate&quot; I think they  mean &quot;I want my kids to  <br/>\nmake some rules and schedules up and then follow them.&quot;  Instead of  <br/>\ndrinking when they&#39;re thirsty, they might rather have kids who drink  <br/>\neight ounces (measured) of water five times a day (by the clock).   <br/>\nWhat you wrote was really helpful.<br/>\n<br/>\nSandra<br/>\n<br/>\nP.S.  Principals are the bosses of American public schools, and  <br/>\nsometimes the primary or singular something or someone.  Lead actors  <br/>\nin plays are principal actors.<br/>\n<br/>\nThose ideas and truths on which we base actions are principles with a  <br/>\n&quot;ple&quot; ending.<br/>\n<br/>\nI&#39;m not basing my actions on principals anymore.&lt;g&gt;  Just principles.</div>","specialLinks":[]},{"userId":205483142,"authorName":"multimomma","from":"&quot;multimomma&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"rules vs principals","postDate":"1136218362","msgId":23715,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwYmpkcStrYXBuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":23716,"prevInTime":23714,"nextInTime":23716,"topicId":23715,"numMessagesInTopic":0,"msgSnippet":"Thanks Sandra, for yet another great link. I m glad you post those whenever needed, because I tried to read your website and kept getting side tracked by","messageBody":"<div id=\"ygrps-yiv-1539393432\">Thanks Sandra, for yet another great link. I&#39;m glad you post those whenever needed, <br/>\nbecause I tried to read your website and kept getting side tracked by links. :-)<br/>\n<br/>\nAnd now I was just side tracked by someone interested in Hawaiin jewelry and Mississippi. <br/>\nDarn the luck, I forgot where I was going with this post....<br/>\n<br/>\nAnyway, pieces really do scatter! I really don&#39;t blame the kids doing it, Sam is four, Dan is <br/>\ntwo, and they just want to help. However, both of them are VERY active, with little impulse <br/>\ncontrol and lots of energy LOL! I just didn&#39;t want to squelch and didn&#39;t know what to say. <br/>\nSO it seems that we&#39;ve just put puzzles away and haven&#39;t gotten them out. <br/>\n<br/>\nAh...I was going to say something about self-regulation (I saw it in the link). Having a child <br/>\nwith a regulation disability, I thought if you were still interested I could share about self-<br/>\nregulation in medical cases. :-) Self-regulation refers to the body&#39;s ability to sense needs <br/>\nand, for the most part, address them automatically. So if you&#39;re getting dehydrated, you <br/>\nstart to crave water, if your blood sugar drops, you feel hungry, if your internal temp gets <br/>\ntoo high, you start to sweat. Consciously, self-regulation consists of the choices that we <br/>\nmake when we feel hunger, thirst, sleepiness, hot, cold, whatever. In regards to tv, <br/>\nreading, games, play, and learning that mentioned here, I would say that SR is just another <br/>\nway to address the brains needs. Need stimulation, you choose what to stim it with. <br/>\nStudies have shown that some people have a higher need for adrenaline, some people <br/>\nhave lesser, for example, which is how they explain people who have serious thrill issues <br/>\n(ha...we&#39;ve been watching a lot of Nemo lately)<br/>\n<br/>\nPart of Breanna&#39;s autism is a self-regulation dysfunction. Her brain kind of short circuits, <br/>\nand either she a) can&#39;t find what she needs for regulation or b) she gets stuck in a self-reg <br/>\nthat she no longer wants, but can&#39;t stop. I&#39;m sure those of you without exp in the autism <br/>\nworld have still seen those in TV or movies. One obvious example is the rocking, etc. It <br/>\nserves a purpose for a while, stimulating and regulating the brain, but begins to interfere <br/>\nwith walking, eating and sleeping. Sometimes the rocking happens because she needs <br/>\nsomething, but can&#39;t find a way to address that need. In her case, we&#39;ve spent a long time <br/>\nincreasing her toolbox, so to speak, so she has more ways to address her needs, and <br/>\ndecreasing her stress so she can practice alternative stimulations.<br/>\n<br/>\nAnyway, hth, and isn&#39;t out of place.<br/>\n<br/>\nAgain, thanks for the principal link. I need to internalize that.<br/>\n<br/>\nMelissa</div>","specialLinks":[]}],"prevTopicId":23714,"nextTopicId":23639}}