{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: kids &quot;learning how far they can go&quot;","postDate":"1264538659","msgId":50101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzMzU0Ny40OTQ0MC5xbUB3ZWIxMTA0MDcubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhqbmpoZCtlaWgzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqbmpoZCtlaWgzQGVHcm91cHMuY29tPg=="},"prevInTopic":50098,"nextInTopic":0,"prevInTime":50100,"nextInTime":50102,"topicId":50083,"numMessagesInTopic":0,"msgSnippet":"***I routinely whisper in my daughter s ear, because many things still don t occur to her that I see. She almost always comes over, if I can t get to her, to","messageBody":"<div id=\"ygrps-yiv-858217499\">***I routinely whisper in my daughter&#39;s ear, because many things still don&#39;t occur to her that I see. She almost always comes over, if I can&#39;t get to her, to hear what I have to say, because I help her with social cues. When things are pointed out, then she can act accordingly, and she&#39;s not embarrassed because no one else hears what I&#39;ve said.*** <br/>\n<br/>\nThis is exactly what I&#39;ve done with Margaux for years!  I call her over or go to her to whisper in her ear.  It&#39;s a little private connection and redirection as needed without calling attention to something that could potentially embarrass her.<br/>\n<br/>\nI never really needed to do that with Chamille, but she was pretty adapt at social interactions from a pretty early age and avoided situations where she was uncomfortable.  Margaux tends to throw herself in and can get in trouble sometimes when she&#39;s unsure how to navigate what she&#39;s jumped into.<br/>\n<br/>\nI whisper sometimes too, to give her an idea that will put her in a positive light where she can take credit for it.  Even if it&#39;s my idea, she still gets to choose whether to employ it or not!<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids &quot;learning how far they can go&quot;","postDate":"1264537965","msgId":50098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqbmpoZCtlaWgzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY2ODc4MC4xMDc4OS5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":50089,"nextInTopic":50101,"prevInTime":50097,"nextInTime":50099,"topicId":50083,"numMessagesInTopic":0,"msgSnippet":"I think you ve laid out the situation pretty well--it seems like a very common unschooling pitfall to me.  People are very familiar with the authoritarian","messageBody":"<div id=\"ygrps-yiv-871962754\">I think you&#39;ve laid out the situation pretty well--it seems like a very common unschooling pitfall to me.  People are very familiar with the authoritarian mindset--I&#39;m in charge, I know what&#39;s best, etc. etc.  <br/>\n<br/>\nThen some people hear &quot;no rules&quot; and some have kids that go a little crazy with the lifting of the bans, and the parents don&#39;t really know how to respond, because they no longer want to boss their kids around anymore.  Then you get the whole problem of &quot;but my kid wants to jump on your couch.&quot;<br/>\n<br/>\nBut there is a whole different way to be with your kids, where you replace the authoritarian with partnership.  Now the kids are engaged in the process of their own lives.  If a kid wants to jump on someone else&#39;s couch, the parent is there talking with them, coming up with solutions that are respectful to everyone.  Assuming that the homeowner doesn&#39;t want a kid jumping on their couch, they could wait &#39;till they get home, they could find a trampoline, they could buy or find through freecycle a mini-trampoline.  You get the picture.<br/>\n<br/>\nI have no idea, from your post, where you fall.  If other people are glaring at you for your children&#39;s freedom, then MAYBE their freedoms are infringing on other people--too loud, too fast for the environment, etc. and they may need a little more help from you to recognize when they aren&#39;t being respectful.  <br/>\n<br/>\nRules and threats can gently be replaced with conversation and suggestions.  I routinely whisper in my daughter&#39;s ear, because many things still don&#39;t occur to her that I see.  She almost always comes over, if I can&#39;t get to her, to hear what I have to say, because I help her with social cues.  When things are pointed out, then she can act accordingly, and she&#39;s not embarrassed because no one else hears what I&#39;ve said.  She wants to behave in ways that are fun for all and will usually adjusts with new information if given the chance.  She&#39;s a very upbeat person and this works for her, because she doesn&#39;t get bogged down with feeling guilty.  <br/>\n<br/>\nMy experience with my teen son is that he wants to know what I think because he values my advice.  I hope my daughter will feel the same.  I suspect that kids who don&#39;t have this relationship with their parents have been turned loose and ignored. This is not, imho, respectful parenting, it is either lazy or a misunderstanding.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] kids &quot;learning how far they can go&quot;","postDate":"1264531471","msgId":50088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNUJFRTZDLUMyNzgtNDBDMC05REUzLTRFQkMwOUJENjAzREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDY2ODc4MC4xMDc4OS5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDY2ODc4MC4xMDc4OS5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":50083,"nextInTopic":50089,"prevInTime":50087,"nextInTime":50089,"topicId":50083,"numMessagesInTopic":0,"msgSnippet":"-=-... unruly kids who parents just ignored them. -=- If you re not ignoring your kids, how could that apply to you? Did you ask them, maybe, about the factors","messageBody":"<div id=\"ygrps-yiv-1485207998\">-=-... unruly kids who parents just ignored them. -=-<br/>\n<br/>\nIf you&#39;re not ignoring your kids, how could that apply to you?<br/>\n<br/>\nDid you ask them, maybe, about the factors that led to those things?<br/>\n<br/>\n-=- What do you say to the idea that kids need limits imposed when  <br/>\nthey&#39;re young, so they&#39;ll -- I don&#39;t know exactly what she meant -- be  <br/>\nmore accepting of them when they&#39;re older or not take big risks as a  <br/>\nteen or what?-=-<br/>\n<br/>\nOf all the people in all my life who have been teen mothers, drug  <br/>\naddicts, thieves, it was sometimes the parents ignored them, and  <br/>\nsometimes the parents locked them in at home and hardly ever let them  <br/>\nout at all for any reason.   It&#39;s not just one or the other, but what  <br/>\nboth have in common is a lack of warm, honest, and open relationship  <br/>\nwith the parents.<br/>\n<br/>\n-=- So maybe the-mom-telling-the-story had it backward. Maybe by being  <br/>\nfree to make so many choices today, while they&#39;re young, my kids will  <br/>\nbe experienced at it by the time they are teens, so when the choices  <br/>\ncan have more serious consequences, they will not do anything terribly  <br/>\nstupid (which I define as endangering their lives or lives of others)  <br/>\nbecause they have had lots of prior experience thinking about choices  <br/>\nand seeing their consequences.-=-<br/>\n<br/>\nThat is exactly my experience, with my children.  When they were young  <br/>\nthey were entrusted with little decisions (which seemed big at the  <br/>\ntime, but were never life-or-death situations, nor thousands-of- <br/>\ndollars situations).  By the time they had jobs and money in any  <br/>\nquantity, they had already practiced with smaller amounts of  <br/>\nresponsibility and cash.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] kids &quot;learning how far they can go&quot;","postDate":"1264531068","msgId":50089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI2MTAzN3M1MTRmNjZhNmw0OWU2ODdhZGU4NWI2NTE4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDY2ODc4MC4xMDc4OS5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDY2ODc4MC4xMDc4OS5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":50088,"nextInTopic":50098,"prevInTime":50088,"nextInTime":50090,"topicId":50083,"numMessagesInTopic":0,"msgSnippet":"I m new as an unschooling parent, but I ve unschooled myself all my life in spite of parents sending me to school. My mother actually compared it with trying","messageBody":"<div id=\"ygrps-yiv-1261108531\">I&#39;m new as an unschooling parent, but I&#39;ve unschooled myself all my life in<br/>\nspite of parents sending me to school. My mother actually compared it with<br/>\ntrying to knit a beautiful sweater with me pulling the yarn unknit from the<br/>\nother end faster than they could knit. Always lived from an objective of<br/>\nfreedom and discovery. Passivity was a stranger to me. Don&#39;t know how it<br/>\nhappened, but I am the one &#39;radical everything&#39; in a family of conformists<br/>\nand proud to be conformists.<br/>\n<br/>\nI don&#39;t think any limits out of the many placed on me actually worked as<br/>\nintended. Their biggest contribution in my life was being the subject of<br/>\nendless debates. I always broke them when I saw fit anyway, choosing my own<br/>\nboundaries and standards of behaviour.<br/>\n<br/>\nI used to advise them that they would get better results trying to tell me<br/>\nwhat they were trying to achieve and I would co-operate if I thought it was<br/>\na good idea or make rules for really life and death stuff, and I wasn&#39;t dumb<br/>\nenough to dispute them. They thought this was rude. I have never in my life<br/>\nbelieved that my saying that was wrong or breaking rules at will. Not for a<br/>\nmoment. I saw them as being invasive of my freedom and I wasn&#39;t breaking any<br/>\nrules, because they weren&#39;t theirs to make anyway. Today, as I look at this<br/>\nson who just turned over from his belly to his back two days ago, I am very<br/>\naware that the time is not far when he is going to start crawling and<br/>\ndiscovering all kinds of stuff in a house that is badly crowded with no hope<br/>\nfor space to baby proof away things lower to the ground.<br/>\n<br/>\nWhile we will still take care of him the best we can, I am not so certain<br/>\nthat we will be able to keep him totally out of trouble. So I let it go. I<br/>\nwill do my best to see to it that I allow him his freedom. Given how my<br/>\nhouse is, I will not be able to allow him totally free rein over curiosity,<br/>\nso I let it go. I would like to, but I can live with being less allowing in<br/>\nthe face of safety. I may even yank him back if he tries to put a finger in<br/>\nan electric socket without any polite explanations beforehand. That is the<br/>\nmoment. I will do what I need to, and live the next. If I keep going back to<br/>\nwhat I can&#39;t change, I will make many more moments less than how I want<br/>\nthem.<br/>\n<br/>\nOther than safety, if he wants to go, I am more likely to be found running<br/>\nalong right with him, with my own curiosity on board, having the grand<br/>\nadventure of my life.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Jan 26, 2010 at 9:08 PM, Michele K &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mom2rci@...\">mom2rci@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hello! My kids have always unschooled though I struggle regularly with<br/>\n&gt; living by my unschooly beliefs surrounded by a mainstream world. I am the<br/>\n&gt; most unschooly person I know in real life, so groups like this and other<br/>\n&gt; reading material are my only supports. I don&#39;t manage to participate much<br/>\n&gt; online, but please know you (online groups and famous RU people online )<br/>\n&gt; have been a big help to me for years and I am not only very familiar with RU<br/>\n&gt; ideals, I&#39;ve been living them the best I can for many years.<br/>\n&gt;<br/>\n&gt; So, what brings me to post this (finally! because the event happened about<br/>\n&gt; 3 months ago!) is a parenting discussion between a couple of moms in a small<br/>\n&gt; group of 4 of us. I was taken aback at the time, and my thoughts have<br/>\n&gt; returned to the discussion many times. I was mostly listening as two of them<br/>\n&gt; discussed something that had occurred at their local homeschool park day<br/>\n&gt; with unruly kids who parents just ignored them. One of the moms went on to<br/>\n&gt; describe her friend who gave her daughter &quot;too much freedom&quot; as a child so<br/>\n&gt; that when she was a teenager she &quot;got into so much trouble.&quot; According to<br/>\n&gt; the mom telling the story, this girl&#39;s mother was so surprised that her<br/>\n&gt; daughter would do these things after having done so much for her, attachment<br/>\n&gt; parenting, or something like that. (Sorry, remember this discussion took<br/>\n&gt; place 3 months ago.) Then, the part that struck me: Mom-telling-story said<br/>\n&gt; that of course the girl acted like &quot;this&quot; as a teen because kids<br/>\n&gt; have to be given limits when they&#39;re young so they know &quot;how far they can<br/>\n&gt; go&quot; otherwise they will just keep going and going. Apparently doing &quot;worse&quot;<br/>\n&gt; things.<br/>\n&gt;<br/>\n&gt; It struck me because I have not been limiting to my kids, and sometimes I<br/>\n&gt; do wonder how they will &quot;turn out&quot; in the future because of this. What do<br/>\n&gt; you say to the idea that kids need limits imposed when they&#39;re young, so<br/>\n&gt; they&#39;ll -- I don&#39;t know exactly what she meant -- be more accepting of them<br/>\n&gt; when they&#39;re older or not take big risks as a teen or what?<br/>\n&gt;<br/>\n&gt; I know this is hard to understand without specific details, like what<br/>\n&gt; &quot;trouble&quot; the teen got into and exactly how did the mom interact with her. I<br/>\n&gt; know there are so many variables from parenting style, to environment, to<br/>\n&gt; personality. I also reminded myself that &quot;in trouble&quot; is defined differently<br/>\n&gt; by different people. Maybe whatever the girl did to &quot;act out&quot; as a teen was<br/>\n&gt; not a big deal. I think the mom-telling-the-story said something about drugs<br/>\n&gt; or alcohol, but I&#39;m not sure. I know that is considered so wrong by some<br/>\n&gt; while others think some experimentation is no big deal.<br/>\n&gt;<br/>\n&gt; I&#39;m thinking that I&#39;m being open and encouraging and accepting of my<br/>\n&gt; children. But by placing few limits on them (basically I just tell them I<br/>\n&gt; want them to be respectful of people and things), am I leaving them to<br/>\n&gt; flounder in a world of too many choices and they may struggle?<br/>\n&gt;<br/>\n&gt; Then I think about how often I struggle with too many choices,and now that<br/>\n&gt; I can &quot;do whatever I want&quot; I often make choices I sort of regret (&quot;sort of&quot;<br/>\n&gt; because I think it&#39;s more feeling self-conscious because I don&#39;t mind a bit<br/>\n&gt; of a messy house or because people glare at me if I let my kids run around<br/>\n&gt; joyfully). But I grew up schooled and authoritatively parented, very<br/>\n&gt; differently than my kids are living. So maybe the-mom-telling-the-story had<br/>\n&gt; it backward. Maybe by being free to make so many choices today, while<br/>\n&gt; they&#39;re young, my kids will be experienced at it by the time they are teens,<br/>\n&gt; so when the choices can have more serious consequences, they will not do<br/>\n&gt; anything terribly stupid (which I define as endangering their lives or lives<br/>\n&gt; of others) because they have had lots of prior experience thinking about<br/>\n&gt; choices and seeing their consequences. I don&#39;t want to just be hopeful<br/>\n&gt; though. I&#39;m trying to trust. But it really helps to hear from other<br/>\n&gt; unschooling families with older kids.<br/>\n&gt;<br/>\n&gt; Thank you for taking the time to read this, and thanks for your responses,<br/>\n&gt; which I assure you I will carefully read, even if I don&#39;t find time to<br/>\n&gt; formulate a response of my own. :)<br/>\n&gt;<br/>\n&gt; Michele, mom of Rhiannon 8, Caroline 6, and Ian 3<br/>\n&gt; Learning, Laughing, Snuggling, Scrapping<br/>\n&gt; My Digital Scrapbook Pages<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":276701487,"authorName":"Michele K","from":"Michele K &lt;mom2rci@...&gt;","profile":"mom2rci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"kids &quot;learning how far they can go&quot;","postDate":"1264520285","msgId":50083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2ODc4MC4xMDc4OS5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":50088,"prevInTime":50082,"nextInTime":50084,"topicId":50083,"numMessagesInTopic":0,"msgSnippet":"Hello!  My kids have always unschooled though I struggle regularly with living by my unschooly beliefs surrounded by a mainstream world.  I am the most","messageBody":"<div id=\"ygrps-yiv-1129212270\">Hello!  My kids have always unschooled though I struggle regularly with living by my unschooly beliefs surrounded by a mainstream world.  I am the most unschooly person I know in real life, so groups like this and other reading material are my only supports.   I don&#39;t manage to participate much online, but please know you (online groups and famous RU people online  ) have been a big help to me for years and I am not only very familiar with RU ideals, I&#39;ve been living them the best I can for many years.<br/>\n<br/>\nSo, what brings me to post this (finally! because the event happened about 3 months ago!) is a parenting discussion between a couple of moms in a small group of 4 of us.   I was taken aback at the time, and my thoughts have returned to the discussion many times.  I was mostly listening as two of them discussed something that had occurred at their local homeschool park day with unruly kids who parents just ignored them.  One of the moms went on to describe her friend who gave her daughter &quot;too much freedom&quot; as a child so that when she was a teenager she &quot;got into so much trouble.&quot;  According to the mom telling the story, this girl&#39;s mother was so surprised that her daughter would do these things after having done so much for her, attachment parenting, or something like that.  (Sorry, remember this discussion took place 3 months ago.)  Then, the part that struck me:  Mom-telling-story said that of course the girl acted like &quot;this&quot; as a teen because kids<br/>\n have to be given limits when they&#39;re young so they know &quot;how far they can go&quot; otherwise they will just keep going and going.  Apparently doing &quot;worse&quot; things.<br/>\n<br/>\nIt struck me because I have not been limiting to my kids, and sometimes I do wonder how they will &quot;turn out&quot; in the future because of this.  What do you say to the idea that kids need limits imposed when they&#39;re young, so they&#39;ll -- I don&#39;t know exactly what she meant -- be more accepting of them when they&#39;re older or not take big risks as a teen or what?<br/>\n<br/>\nI know this is hard to understand without specific details, like what &quot;trouble&quot; the teen got into and exactly how did the mom interact with her.  I know there are so many variables from parenting style, to environment, to personality.  I also reminded myself that &quot;in trouble&quot; is defined differently by different people.  Maybe whatever the girl did to &quot;act out&quot; as a teen was not a big deal.  I think the mom-telling-the-story said something about drugs or alcohol, but I&#39;m not sure.  I know that is considered so wrong by some while others think some experimentation is no big deal.<br/>\n<br/>\nI&#39;m thinking that I&#39;m being open and encouraging and accepting of my children.  But by placing few limits on them (basically I just tell them I want them to be respectful of people and things), am I leaving them to flounder in a world of too many choices and they may struggle?<br/>\n<br/>\nThen I think about how often I struggle with too many choices,and now that I can &quot;do whatever I want&quot; I often make choices I sort of regret (&quot;sort of&quot; because I think it&#39;s more feeling self-conscious because I don&#39;t mind a bit of a messy house or because people glare at me if I let my kids run around joyfully).  But I grew up schooled and authoritatively parented, very differently than my kids are living.  So maybe the-mom-telling-the-story had it backward.  Maybe by being free to make so many choices today, while they&#39;re young, my kids will be experienced at it by the time they are teens, so when the choices can have more serious consequences, they will not do anything terribly stupid (which I define as endangering their lives or lives of others) because they have had lots of prior experience thinking about choices and seeing their consequences.  I don&#39;t want to just be hopeful though.  I&#39;m trying to trust.  But it really helps to hear from other<br/>\n unschooling families with older kids.<br/>\n<br/>\nThank you for taking the time to read this, and thanks for your responses, which I assure you I will carefully read, even if I don&#39;t find time to formulate a response of my own.  :)<br/>\n<br/>\n Michele, mom of Rhiannon 8, Caroline 6, and Ian 3<br/>\nLearning, Laughing, Snuggling, Scrapping<br/>\nMy Digital Scrapbook Pages<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49825,"nextTopicId":50104}}