{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How I Got to Work From Home","postDate":"1035887766","msgId":48598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMjEwMjkwMjI4MTUuMDNiMTgzMDBAbWFpbC5nYWlhd29sZi5vcmc+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":48597,"nextInTime":48599,"topicId":48598,"numMessagesInTopic":0,"msgSnippet":"Here is a message that I sent to Kelli off list about getting into medical transcription.  If you are interested in hearing more or have questions about this,","messageBody":"<div id=\"ygrps-yiv-1998389143\">Here is a message that I sent to Kelli off list about getting into medical <br/>\ntranscription.  If you are interested in hearing more or have questions <br/>\nabout this, please let me know.  I&#39;d be more than happy to help.<br/>\n<br/>\n<br/>\n----------<br/>\n<br/>\nI&#39;ve been doing medical transcription now for five and a half years, five <br/>\nof them from home.  The story of how I got into it and all that is <br/>\nbelow.  The thing is that medical transcription is definitely skilled <br/>\nwork.  When a person is starting out, the pay is pretty low until they can <br/>\nget up to speed.  The overhead is low, though, and that&#39;s a good thing.<br/>\n<br/>\nThe other thing about medical transcription is that it is very demanding of <br/>\na person&#39;s attention.  It requires the full dedication of a person&#39;s eyes, <br/>\nears, hands, and brain.  And, as you know, so does being with a small <br/>\nchild.  Sometimes I can work while Liam and I are alone together, but many <br/>\ntimes I have to wait for him to fall asleep or be occupied in some other <br/>\nway.  He understands that I have to work, and he understands that if I <br/>\ndon&#39;t work here, I&#39;d have to work somewhere else, and that would put his <br/>\nbeing at home in jeopardy.  So, he&#39;s fairly cooperative about my <br/>\nworking.  My favorite, though, is when he wants me out of his hair for some <br/>\nreason (like he&#39;s going to do something he&#39;d rather I wasn&#39;t privy to), and <br/>\nhe&#39;ll say, &quot;Mom, shouldn&#39;t you be working?&quot;<br/>\n<br/>\nAnyway, I had answered the question about getting started at medical <br/>\ntranscription for several people in the past, and then got wise and stopped <br/>\nre-typing it each time.  So, below is that canned response.  But, please <br/>\nplease please feel free to ask me more specific questions about it, if <br/>\nyou&#39;d like!  No kidding!<br/>\n<br/>\nTake care,<br/>\n<br/>\nMarji<br/>\n<br/>\n-----------------------------------------------------------------<br/>\nHere&#39;s how I got started in medical transcription. Understanding that MT is <br/>\npretty skilled work requiring a thorough knowledge of anatomy, physiology, <br/>\npathology, pharmacology, and grammar, I started out by taking a course at <br/>\nhome when Liam (my son) was a tiny baby.  I think he was about 5 months old <br/>\nand still in arms when I took the course.  I did some research to find a <br/>\ngood course, and the one I went with was PCDI (Professional Career <br/>\nDevelopment Institute). Here&#39;s a link to their site:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pcdi-homestudy.com/courses/yy/\">http://www.pcdi-homestudy.com/courses/yy/</a><br/>\n<br/>\nOne of the reasons I went with this school was I was able to finance the <br/>\ncourse and pay a very reasonable amount per month interest-free.<br/>\n<br/>\nI completed the course in about four months, and I thought I&#39;d be able to <br/>\ncontact the local doctors and get work at home right away.  But, I had no <br/>\ntakers, even though I did very well in the course.  What I did not know <br/>\nwhen I completed the course (and I have since learned that to be true no <br/>\nmatter what kind of a course you take, whether at home or at a college) is <br/>\nthat a big part of an MT&#39;s education is done on the job through a <br/>\ncombination of mentoring and trial and error.  There is so much to know, <br/>\nand it&#39;s really vital to be in some kind of a situation where you have <br/>\nsomeone who can look over your shoulder, review your work, and answer all <br/>\nthe questions a person is going to have. This is true even for people who <br/>\nare already in the medical profession (like RNs who become medical <br/>\ntranscriptionists).<br/>\n<br/>\nI waited until Liam was about 2-1/2 years old and I felt I could leave him <br/>\nat night and then I lucked into a part-time job overnight at a local <br/>\nhospital. After about 7 months of working at the hospital, I really lucked <br/>\ninto getting a job working from home. About a year later I quit the <br/>\nhospital and now I work exclusively at home.<br/>\n<br/>\nThis is just my experience. There are companies that will hire folks with <br/>\nno experience. But, it takes a long time to make a decent income because <br/>\nmost companies pay on production. For example, I earn $0.11 per line (but <br/>\ncompanies usually start a person without experience at around $0.06 per <br/>\nline). I know that sounds pretty low, but I make between $17 and $35 per <br/>\nhour. When I started working at home, I think I was lucky if I was making <br/>\nabout $3 an hour, so there is quite a learning curve associated with this <br/>\nwork. That&#39;s because in the beginning you have to look everything up, and <br/>\nyou have to listen over and over again. Some doctors don&#39;t really try to <br/>\nmake it easy for us MTs and sometimes it&#39;s a real struggle.  Sometimes I <br/>\nget a doctor who is very clear, but that&#39;s not always the case.  That&#39;s one <br/>\nreason why I was very grateful to have the part-time job at the hospital <br/>\n(which paid me a flat hourly rate, though it was low) at the same time as I <br/>\nwas beginning to work at home so I could continue to earn while I was learning.<br/>\n<br/>\nHere is a link to a very informative web site called MT Desk:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mtdesk.com/\">http://www.mtdesk.com/</a><br/>\n<br/>\nMy suggestion would be to browse around the site. It&#39;ll give you an idea of <br/>\nwhat MTs do, what their struggles are, and how folks break in to it. In <br/>\nfact, I got my job at home through a website called MT Daily <br/>\nwww.mtdaily.com (which is now only available by subscription).  I had been <br/>\nusing that site frequently for networking and supporting other MTs.<br/>\n<br/>\nPlease let me know if you need any other information.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48582,"nextTopicId":48599}}