{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":306795543,"authorName":"Nicole August","from":"Nicole August &lt;nicole.august@...&gt;","profile":"salsburyway","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Organization and Storage","postDate":"1455041012","msgId":76732,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2QkEyOUY0LjUwNTA1MDVAZ21haWwuY29tPg==","inReplyToHeader":"PENBUGVoNFpWRjJvMTFBK0NyR1hLUk9QeE9EblU5ZXd0UndqPWZ6WEhSNVlxQjk2YnFBZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBUGVoNFpWRjJvMTFBK0NyR1hLUk9QeE9EblU5ZXd0UndqPWZ6WEhSNVlxQjk2YnFBZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":76726,"nextInTopic":0,"prevInTime":76731,"nextInTime":76733,"topicId":76719,"numMessagesInTopic":0,"msgSnippet":"... We bought a large piece of masonite board to put on our table for when someone wants to do a large puzzle or ongoing project. When we need the table to eat","messageBody":"<div id=\"ygrps-yiv-1011184500\"><blockquote><span title=\"ireply\">&gt;   I don&#39;t have a room dedicated to all of the materials or work. Our<br/>\n&gt; whole house is a place to play, learn, and live. It is difficult for me<br/>\n&gt; when every surface is covered with projects or experiments in varying<br/>\n&gt; degrees of completeness though. We usually have meals together which<br/>\n&gt; everyone enjoys and we share our thoughts and ideas. However the table<br/>\n&gt; is always covered in something and I begin to find no place to move<br/>\n&gt; anything.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>We bought a large piece of masonite board to put on our table for when <br/>\nsomeone wants to do a large puzzle or ongoing project. When we need the <br/>\ntable to eat I can just move the board with everything on it to the <br/>\nfloor and then put it back when we&#39;re done the meal.<br/>\n<br/>\n<br/>\n-Nicole</div>","specialLinks":[]},{"userId":143184446,"authorName":"Heather Stafford","from":"Heather Stafford &lt;tandycat@...&gt;","profile":"tandycat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Organization and Storage","postDate":"1455028111","msgId":76726,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4MzA4NTgyODAuMTE3MTE4My4xNDU1MDI4MTExMjY1LkphdmFNYWlsLnlhaG9vQG1haWwueWFob28uY29tPg==","referencesHeader":"PDE4MzA4NTgyODAuMTE3MTE4My4xNDU1MDI4MTExMjY1LkphdmFNYWlsLnlhaG9vLnJlZkBtYWlsLnlhaG9vLmNvbT4="},"prevInTopic":76722,"nextInTopic":76732,"prevInTime":76725,"nextInTime":76727,"topicId":76719,"numMessagesInTopic":0,"msgSnippet":"When our third child starting eating at the table with us, we found that our dining table was too small now, so we thrifted a new-to-us larger table and then","messageBody":"<div id=\"ygrps-yiv-1569972331\">When our third child starting eating at the table with us, we found that our dining table was too small now, so we thrifted a new-to-us larger table and then used the old dining table as a dedicated craft table.  We were fortunate not to have a space problem in our house, but I&#39;ve seen families that take over part of their living room to use it as a crafting space.  We had light-colored carpet throughout our house at the time, so we bought a large, old rug to set on top of the carpet to protect it.  We also bought an armoire that we use as an art cabinet.    We eventually bought a credenza (the cabinets that are long, but not very tall).  Our credenza has four large drawers in it.  We keep all sorts of crafting supplies inside of this piece of furniture, but our favorite are the paints.  The kids can pull out a drawer and see all the colors of paint we have without having to take each one out to get to the color behind it.  The top of the credenza is also a great place to store things I want to keep easily accessible for the kids.  I also found two flat trays (1ft x 1.5ft) and I keep all sorts of coloring supplies, tapes, scissors, etc.. inside of plastic or glass jars on these trays.  We also have a separate cabinet that we store our board games/puzzles in and a bookcase for the craft/science kits.  I bought plastic paper organizers for all of the different colors/types of paper we use.  Originally I stored the paper in these organizers in our dining room hutch.  I eventually found a glass-fronted cabinet to store it all in (it&#39;s a very cheap piece of furniture, but it&#39;s worked well for us over the years).<br/>\n<br/>\n<br/>\nThis ends up being a lot of furniture (I know because we&#39;ve moved several times in the last year or so!), but we&#39;ve managed to fit it all into some fairly small spaces.  One house we lived in had a breakfast nook in the kitchen and we set up our craft table there, with the craft cabinets in the living room nearby.  We&#39;ve lived in 4 houses (of varying sizes, but none of them very large) over the last two years.  Having a dedicated messy space has been a priority for us for a quite a while now, so we&#39;ve found creative ways to incorporate it into whatever space we have.  To the untrained eye our house may look cluttered (we certainly don&#39;t live a museum house!), but it&#39;s highly functional for our needs and interests.  And my kids friends (and parents) are always excited to play and craft in our space with us!<br/>\n<br/>\n<br/>\nAs to what to do with all the artwork?  We display all the most recent works of art (taped to the wall, or on a shelf).  I photograph everything and post it to our blog for family to see, and for our personal records.  When we run out of space, I remove the older pieces and recycle most of them. I keep a few representative pieces for each child of their best works in a storage bin, but most of it gets recycled or re-used.<br/>\n<br/>\n<br/>\nI hope this helps!  -Heather</div>","specialLinks":[]},{"userId":495438666,"authorName":"Sarah Thompson","from":"Sarah Thompson &lt;thompsonisland@...&gt;","profile":"wallacesmum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Organization and Storage","postDate":"1455021967","msgId":76722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHYrY1l5dk9fU01jQnFNd0tPcnhpX1pueERaMWQ3LXhTRXlBcHhvdlJadW9ZQjE1UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PERCNVBSMDdNQjE2MjQ4OTgzRkQ1MzQwRTM3QzI5QjgwMkI3RDYwQERCNVBSMDdNQjE2MjQuZXVycHJkMDcucHJvZC5vdXRsb29rLmNvbT4=","referencesHeader":"PENBUGVoNFpWRjJvMTFBK0NyR1hLUk9QeE9EblU5ZXd0UndqPWZ6WEhSNVlxQjk2YnFBZ0BtYWlsLmdtYWlsLmNvbT4JPERCNVBSMDdNQjE2MjQ4OTgzRkQ1MzQwRTM3QzI5QjgwMkI3RDYwQERCNVBSMDdNQjE2MjQuZXVycHJkMDcucHJvZC5vdXRsb29rLmNvbT4="},"prevInTopic":76721,"nextInTopic":76726,"prevInTime":76721,"nextInTime":76723,"topicId":76719,"numMessagesInTopic":0,"msgSnippet":"I hang stuff everywhere. I use art for wrapping paper. I have over-door storage racks. I have stacking shelving units that you can put baskets in. I have","messageBody":"<div id=\"ygrps-yiv-1222987750\"><p dir=\"ltr\">I hang stuff everywhere. I use art for wrapping paper. I have over-door storage racks. I have stacking shelving units that you can put baskets in. I have under-bed boxes. I have tarp sheds outside:)</p>\n<p dir=\"ltr\">Sarah</p></div>","specialLinks":[]},{"userId":403767111,"authorName":"Jo Isaac","from":"Jo Isaac &lt;joanneisaac@...&gt;","profile":"joanne.isaac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Organization and Storage","postDate":"1455021074","msgId":76721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCNVBSMDdNQjE2MjQ4OTgzRkQ1MzQwRTM3QzI5QjgwMkI3RDYwQERCNVBSMDdNQjE2MjQuZXVycHJkMDcucHJvZC5vdXRsb29rLmNvbT4=","inReplyToHeader":"PENBUGVoNFpWRjJvMTFBK0NyR1hLUk9QeE9EblU5ZXd0UndqPWZ6WEhSNVlxQjk2YnFBZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBUGVoNFpWRjJvMTFBK0NyR1hLUk9QeE9EblU5ZXd0UndqPWZ6WEhSNVlxQjk2YnFBZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":76720,"nextInTopic":76722,"prevInTime":76720,"nextInTime":76722,"topicId":76719,"numMessagesInTopic":0,"msgSnippet":"Storage - plastic bins with lids. Chests and baskets. They are cheap and easy to fine, and you can throw things in them in a second. It may not be possible to","messageBody":"<div id=\"ygrps-yiv-1314942100\"><html>\n<head>\n \n<style type=\"text/css\"><!--#ygrps-yiv-1314942100 P {margin-top:0;margin-bottom:0;}--></style>\n</head>\n \n<div id=\"ygrps-yiv-1314942100divtagdefaultwrapper\" style=\"font-size:12pt;color:#000000;background-color:#FFFFFF;font-family:Calibri, Arial, Helvetica, sans-serif;\">\n<p>Storage - plastic bins with lids. Chests and baskets. They are cheap and easy to fine, and you can throw things in them in a second.<br>\n<br>\nIt may not be possible to organize a house so that ALL resources are easy for children to get to all the time...my house is tiny, really...Board games are stacked in a cupboard, but I&#39;ll bring two or three different one&#39;s down into the lounge and put them on\n a shelf and rotate them. Kai knows where the science stuff is, and asks if he wants it. If you can find an area where you can rotate different things/resources, do that. If there is a table where they often do art activities, keep it tidy and organize pens/paper/pencils/paint\n there. But don&#39;t think you need everything out, all the time.<br>\n<br>\n</p>\n<div style=\"color:rgb(0, 0, 0);\">\n<div>\n<div id=\"ygrps-yiv-1314942100ygrp-mlmsg\" style=\"\">\n<div id=\"ygrps-yiv-1314942100ygrp-msg\" style=\"line-height:1.22em;\">\n<div id=\"ygrps-yiv-1314942100ygrp-text\" style=\"line-height:1.22em;font-family:Georgia;\">\n<div style=\"line-height:1.22em;\"><span style=\"line-height:1.22em;font-size:12pt;\">==My children create the most amazing things -&nbsp;sculptures, hovercrafts, doll houses, works of art, life size paintings of pteranodons, and many more. My struggle is what to\n do with all of these incredible things. They keep making more which I love, but&nbsp;I&#39;m beginning to feel overwhelmed. I&#39;m hoping someone might have some ideas. ==<br>\n</span><br>\n</div>\n<div style=\"line-height:1.22em;\">Google. There are heaps of ideas on what to do with kids art projects. You could have 3 frames in which you display the latest greatest art work for each child. You could use Evernote to photograph and catalog things without\n having to keep them all. Send some to family? Laminate and make some into place mats? Make a digital photobook of what they make and send it out at Christmas? Use paintings as gift cards and wrapping paper? For really amazing things, you can get them made\n into mugs and t-shirts and all sorts of stuff.<br>\n<br>\nCheers</div>\n<div style=\"line-height:1.22em;\">Jo</div>\n<div style=\"line-height:1.22em;\">\n<div style=\"line-height:1.22em;\"><br style=\"line-height:1.22em;\">\n</div>\n<div style=\"line-height:1.22em;\"><br style=\"line-height:1.22em;\">\n<br style=\"line-height:1.22em;\">\n</div>\n</div>\n<p style=\"line-height:1.22em;\"></p>\n</div>\n<div style=\"color:rgb(255, 255, 255);height:0px;line-height:1.22em;\"></div>\n</div>\n</div>\n</div>\n \n</div></div></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Organization and Storage","postDate":"1454995664","msgId":76720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0M0YxNDM3LUM4QzgtNDYzMy1BN0NCLTE0RDMxNDlFMTk4RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBUGVoNFpWRjJvMTFBK0NyR1hLUk9QeE9EblU5ZXd0UndqPWZ6WEhSNVlxQjk2YnFBZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBUGVoNFpWRjJvMTFBK0NyR1hLUk9QeE9EblU5ZXd0UndqPWZ6WEhSNVlxQjk2YnFBZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":76719,"nextInTopic":76721,"prevInTime":76719,"nextInTime":76721,"topicId":76719,"numMessagesInTopic":0,"msgSnippet":"-=-Another struggle I have is organizing materials for my children to have easy access. I want them to be able to paint, use a glue gun, build with Craft","messageBody":"<div id=\"ygrps-yiv-1668357293\">-=-Another struggle I have is organizing materials for my children to have easy access. I want them to be able to paint, use a glue gun, build with Craft sticks, play board games, experiment with the chemistry or electricity kit, play with Legos, use the microscope or use many other materials. I just have not figured out a way to organize materials so my children can easily get to them.-=-<br/>\n<br/>\nThe oldest is seven years old.  They’re too young to use most of those things without your direct help, so they don’t need to be easily accessible.<br/>\n<br/>\nDon’t struggle.  You used the term “struggle” twice.  Relax!<br/>\n<br/>\n-=- I am struggling with organization and storage…” and &quot;Another struggle I have is…”<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/battle\">http://sandradodd.com/battle</a><br/>\n<br/>\nHelp each child find materials to play with, work with, that you’re willing to pick up later.  Just do that each time it comes up.  It’s nothing to struggle about. :-)  It’s something to relax into.<br/>\n<br/>\n-=- It is difficult for me when every surface is covered with projects or experiments in varying degrees of completeness though. We usually have meals together which everyone enjoys and we share our thoughts and ideas. However the table is always covered in something and I begin to find no place to move anything. -=-<br/>\n<br/>\nCardboard flats—like what cans of soda or beer come in, if you buy a whole case.  If you don’t have those naturally, maybe ask at a store. <br/>\nI have bought some plastic dish pans in bulk.  I bought 50, and distributed them to some of my grown kids.  I’ve used them for clay, modeling wax, markers, here—projects and supplies.  They can be stacked and put aside—if something only has a bit of stuff in, then it stacks more efficiently.  If something is fragile, that goes on the top of the pile, or separate.  (Not really dish trays—they’re officially disposable hospital trays used for patient care, or storage of personal items— <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quikshipmedical.com/wash-basin-rectangular-7-quart-gold-h362-05\">http://www.quikshipmedical.com/wash-basin-rectangular-7-quart-gold-h362-05</a> and there are other suppliers)<br/>\n<br/>\nIt can help to photograph projects and keep the photos, instead of trying to keep every sculpture or model ever made.  Photos are preservation.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":548647636,"authorName":"Hope Pressler","from":"Hope Pressler &lt;hopepressler@...&gt;","profile":"hopep42zwl4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Organization and Storage","postDate":"1454982884","msgId":76719,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUGVoNFpWRjJvMTFBK0NyR1hLUk9QeE9EblU5ZXd0UndqPWZ6WEhSNVlxQjk2YnFBZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":76720,"prevInTime":76718,"nextInTime":76720,"topicId":76719,"numMessagesInTopic":0,"msgSnippet":"I began unschooling my children now ages 3, 5, and 7 about a year and half ago. It has been a very fun, exciting, and exhausting journey. I am struggling with","messageBody":"<div id=\"ygrps-yiv-1676338661\">I began unschooling my children now ages 3, 5, and 7 about a year and half ago. It has been a very fun, exciting, and exhausting journey.<div><br></div><div> I am struggling with organization and storage though. I am hoping someone with more experience can give me some ideas. </div><div><br></div><div>My children create the most amazing things - sculptures, hovercrafts, doll houses, works of art, life size paintings of pteranodons, and many more. My struggle is what to do with all of these incredible things. They keep making more which I love, but I&#39;m beginning to feel overwhelmed. I&#39;m hoping someone might have some ideas. </div><div><br></div>Another struggle I have is organizing materials for my children to have easy access. I want them to be able to paint, use a glue gun, build with Craft sticks, play board games, experiment with the chemistry or electricity kit, play with Legos, use the microscope or use many other materials. I just have not figured out a way to organize materials so my children can easily get to them.<div><br></div><div> I don&#39;t have a room dedicated to all of the materials or work. Our whole house is a place to play, learn, and live. It is difficult for me when every surface is covered with projects or experiments in varying degrees of completeness though. We usually have meals together which everyone enjoys and we share our thoughts and ideas. However the table is always covered in something and I begin to find no place to move anything. </div><div><br></div><div>I am hoping others who are on this journey will share their experiences in organizing materials, finished and unfinished creations, and also being able to have some space for dinners and not to have every space feel overstuffed. </div><div><br></div><div>Thank you for any suggestions. </div><div><br></div><div>Hope<br><div><br></div><div><br><br></div></div></div>","specialLinks":[]}],"prevTopicId":76650,"nextTopicId":76734}}