{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Intro  Long","postDate":"1031116998","msgId":9131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENzU5OEM3LjhCMjM3NzZCQGVhcnRobGluay5uZXQ+","referencesHeader":"PEI5OUFCOTgyLjEzOTMxJWpvY2VseW5AdmlsdGVyLnVzPg=="},"prevInTopic":9125,"nextInTopic":0,"prevInTime":9130,"nextInTime":9132,"topicId":9088,"numMessagesInTopic":0,"msgSnippet":"**Now THAT S a good sig line. ;-) Jocelyn ... But it s so tragic!  (Are tragedies your favorite form of drama?) Betsy  :-)","messageBody":"<div id=\"ygrps-yiv-15056326\">**Now THAT&#39;S a good sig line. ;-)<br/>\n<br/>\nJocelyn<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: Betsy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a>&gt;<br/>\n&gt; <br/>\n&gt; Apparently there are no books so great that school can&#39;t<br/>\n&gt; make them repulsive.**<br/>\n<br/>\n<br/>\n </span></blockquote>But it&#39;s so tragic!  (Are tragedies your favorite form of drama?)<br/>\n<br/>\nBetsy  :-)</div>","specialLinks":[]},{"userId":120767120,"authorName":"Jocelyn Vilter","from":"Jocelyn Vilter &lt;jocelyn@...&gt;","profile":"jocelynv2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Intro  Long","postDate":"1031105395","msgId":9125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5OUFCOTgyLjEzOTMxJWpvY2VseW5AdmlsdGVyLnVzPg==","inReplyToHeader":"PDNENzREQTI2LkUyNThGNjRAZWFydGhsaW5rLm5ldD4="},"prevInTopic":9114,"nextInTopic":9131,"prevInTime":9124,"nextInTime":9126,"topicId":9088,"numMessagesInTopic":0,"msgSnippet":"Now THAT S a good sig line. ;-) Jocelyn","messageBody":"<div id=\"ygrps-yiv-1553242839\">Now THAT&#39;S a good sig line. ;-)<br/>\n<br/>\nJocelyn<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; From: Betsy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a>&gt;<br/>\n&gt; <br/>\n&gt; Apparently there are no books so great that school can&#39;t<br/>\n&gt; make them repulsive. </span></blockquote></div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Intro  Long","postDate":"1031068197","msgId":9114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENzREQTI2LkUyNThGNjRAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PERBVjg5ckNLNWRzU0pVSzhjWWkwMDA1MTAwMUBob3RtYWlsLmNvbT4="},"prevInTopic":9088,"nextInTopic":9125,"prevInTime":9113,"nextInTime":9115,"topicId":9088,"numMessagesInTopic":0,"msgSnippet":"**I m a 43 yrold SAHM of four, ages 17 dd, 14 ds and twin 8 dds, a voracious reader... ** Hi, Cris -- I m also a 43 year old SAHM. And I m married 20 years to","messageBody":"<div id=\"ygrps-yiv-728308403\">**I&#39;m a 43 yrold SAHM of four, ages 17 dd, 14 ds and twin 8<br/>\ndds, a voracious reader... **<br/>\n<br/>\nHi, Cris --<br/>\n<br/>\nI&#39;m also a 43 year old SAHM. And I&#39;m married 20 years to my college<br/>\nsweetheart (er... my second college sweetheart).  I dawdled a long time<br/>\nbefore becoming a mom, so I only have 1/4 of the kids you have -- just<br/>\none ds, 8.<br/>\n<br/>\nMy dh, Rick, was born and briefly raised in RI, and so is doomed to<br/>\nhopelessly root for the Red Sox forever.  He taught middle school<br/>\nEnglish and Reading last year and the kids actually disliked My Side of<br/>\nthe Mountains.  Apparently there are no books so great that school can&#39;t<br/>\nmake them repulsive.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":120281009,"authorName":"cris trainor","from":"&quot;cris trainor&quot; &lt;muddpies@...&gt;","profile":"thinkspringblooms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro  Long","postDate":"1031001309","msgId":9088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBVjg5ckNLNWRzU0pVSzhjWWkwMDA1MTAwMUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":9114,"prevInTime":9087,"nextInTime":9089,"topicId":9088,"numMessagesInTopic":0,"msgSnippet":"I guess if I m going to publicly embarrass myself by coveting unworthy fathers (huge sarcasm, sheepish grin)  I ought to introduce myself. I m a 43 yrold SAHM","messageBody":"<div id=\"ygrps-yiv-726672942\">I guess if I&#39;m going to publicly embarrass myself by coveting unworthy fathers (huge sarcasm, sheepish grin)  I ought to introduce myself.<br/>\n<br/>\n<br/>\n                       I&#39;m a 43 yrold SAHM of four, ages 17 dd, 14 ds and twin 8 dds, a voracious reader, currently delving back into fiction, after mostly absorbing lots of non-fiction (about a hundred parenting volumes!!) for the past decade or so; favorite author:  Wendell Berry and whoever I&#39;m currently reading.  My primary passions are:  creating an harmonious home (a neverending project!); GARDENING, deep ecology, environmental awareness, sustainability;  sewing and quilting; cooking (sporadically); and lately surfing the net (we just got a computer in our house!).  I&#39;ve been married for 20 years in Nov 2002 to my high school sweetheart, a jack-of-all-arts (photography, collage, pastel drawing et al.) currently earning our livelihood as a woodworker (carpenter, cabinetmaker, remodeler), and part-time bookbinder, making hand-bound books and portfolios.   <br/>\n                          My oldest dd has been unschooling herself for her whole life, including being in and out of school since the 5th grade (which was her only successful time in school).   She&#39;s in a hurry to grow up;  we all went through some traumatic times over the past 4 years of her adolescence; she has calmed down quite a bit but is still very much struggling with figuring out who she is and decided last spring that it&#39;s time for her to be on her own (actually she decided that at about age 10! ) and moved out.                   Ds is very much in the world at the moment, in no hurry to grow up, enjoying whatever each age and stage offers.  He&#39;s been mostly unschooled with some &quot;schooling&quot; in the basics.  He&#39;s sociable, noisy, highly physical and sensual, a mainly auditory and kinetic learner; a quick wit and when I&#39;m not completely frustrated with his stubbornness, I&#39;m trying not to wet myself from laughing at his antics.   He only likes to read in very small doses and only the absolute &quot;perfect&quot; books, mainly adventures of teen boys, ( e.g. Hatchet, My Side of the Mountain, etc.)   He is currently OBSESSED with the online game Everquest; if anyone is familiar with it I would love to hear how wonderfully enriching is his time spent on this game (NOT?)!                         The twins are fraternal; I call them my salt-and-pepper shakers:  one brunette-brown eyes, one blond and blue, with diverse personalities to match their looks.  They&#39;ve been to public kindergarten and first grade, mostly because at the time I needed baby-sitting services while I worked on some major issues in my own being.  I&#39;m THRILLED to have them home again;  they are the natural self-educators that all 8 year -olds are:  insatiably curious,  inventive, creative, lively--each in their own way.  Dd2 is a READER!!!!!  She loves and appreciates books and stories. self-initiates reading for pleasure, keeps a pretty faithful daily diary (likes to write), is a natural speller, wants to know everything  (&quot;I want to play the guitar AND the cello AND the piano, Mom&quot;), loves to sing, and loves the natural world.  Dd3 is sensual like her brother, needs to touch everything, loves crafts, needs a hundred hugs a day, loves to dress up (the more sparkly the better!) and DANCE, invents &quot;creations&quot; on a daily basis usually to be used as props in a newly invented theatrical role-playing game, is always at the back on nature walks because she examines every little interesting thing and delights in sharing her exciting discoveries.         <br/>\n               We live with my Mom, she&#39;s the one who has made it possible for us all to live in the rural area we&#39;ve always wanted to.  Although she does not agree with many of our child-raising choices she is totally supportive of our decisions and only gives advice when asked for it (Bless her!).  She is extremely practical-minded which makes a perfect balance for the dreamers that DH and I are.   The children adore her, and she, them.  I truly feel blessed for having her as my mom, and their &quot;nana&quot;.  My dad is also a dreamer, a musician and a charismatic salesman. He lives fairly near and visits weekly to take the kids to do fun stuff, mostly outdoors, and encourage their musical education.<br/>\n               As for DH&#39;s parents, Grampa Vin spent his whole life in public education:  from teacher, to education professor (curriculum), to Superintendent of schools in a couple of communities,  with Grammie as a SAHM who raised three wonderful boys without ever learning to drive!!!   Needless to say, they have not been enthusiastic supporters of our homeschooling choice.  But they do keep their opinions to themselves (Bless them!);  the subject is simply a non-subject.  They never ask about the kids &quot;school&quot; stuff, and we never offer.  It&#39;s kinda sad cuz they could be great resources for my kids, but they&#39;re simply not interested in methods outside the &quot;norm.&quot;   We still love them, and they&#39;re crazy about the kids, but it&#39;s a pretty shallow relationship, albeit comfortable.                                                                            <br/>\n            <br/>\n             We live in RI where the homeschool law is kinda vague--each local town determines its own parameters for accountability--some are stringent, some are totally lax;  most fall in the middle and we homeschoolers try to rely heavily on the state laws and give the locals the minimum we can get away with.  I love New England, I love Rhode Island, I love our little Renaissance City of Providence (in spite of the massively corrupt government). The culture, the geography, the educational opportunities are amazingly diverse for such a small state.  <br/>\n<br/>\n           Last Fall a collection of five of us homeschooling moms kinda fell together through a series of serendipitous events ( or fate?) and through networking we now have a group of about 40 member families.  Most are eclectic, many seem to lean toward unschooling, I think I&#39;m the radical unschooler of the group;  it&#39;s WONDERFUL to have comrades IRL as well as cyberland; it was lonely for a while there--the library computer was my saving grace.  I will mostly lurk here, still.  but I&#39;ll submit my 2 cents when I can&#39;t resist.  You guys are kewl.   <br/>\n<br/>\n           Did I forget anything?  Did you really want to know all that? :)<br/>\n<br/>\n           Namaste,<br/>\n            Cris<br/>\n<br/>\n<br/>\n            <br/>\n                                   Get more from the Web.  FREE MSN Explorer download : <a rel=\"nofollow\" target=\"_blank\" href=\"http://explorer.msn.com\">http://explorer.msn.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":9123,"nextTopicId":9132}}