{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"the tale of Joey and other matters","postDate":"1108577201","msgId":103490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlNS4zNWQxNDk5MS4yZjQ0ZTViMUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":103489,"nextInTime":103491,"topicId":103490,"numMessagesInTopic":0,"msgSnippet":"My boys have a friend who used to be over here almost every night.  A few times I got really impatient with it and said Joey, go home.   But when he was 15,","messageBody":"<div id=\"ygrps-yiv-2072224213\">My boys have a friend who used to be over here almost every night.  A few <br/>\ntimes I got really impatient with it and said &quot;Joey, go home.&quot;   But when he was <br/>\n15, he quit going to school and said he was homeschooling too.  He lives about <br/>\nthree blocks away, but he was not at home enough for them to ever talk to <br/>\nhim.  He would go home MAYBE once or twice a week, for a few hours.  Once he <br/>\nwalked over there to get an apple because we didn&#39;t have any.  It was a disruption <br/>\nof my relationship with the boys for a while, because either I took Joey with <br/>\nus somewhere, or we didn&#39;t go.   <br/>\n<br/>\nTwo things bothered me most about the Joey era (which lasted about a year and <br/>\na half):<br/>\n<br/>\nI had never before that imagined WHY the state would require 180 days of <br/>\nattendance for homeschoolers.  &quot;How stupid!&quot; I had thought, but Joey was NOT at <br/>\nhis house 180 days that year.   He was at our house for way over 250 of them.  <br/>\nHe was sleeping on the floor in Kirby&#39;s room, usually. <br/>\n<br/>\nJoey said, when I asked, that he was doing a correspondence school.  &quot;Like <br/>\nAmerican School?&quot; I asked.  He looked a little confused, and muttered something <br/>\nin the very-vague affirmative.   I don&#39;t know when he would have had time to <br/>\ndo that, but he did start being at his house a day or two a week, so it&#39;s <br/>\npossible.  I don&#39;t think it was happening, though.  I think this: <br/>\n<br/>\nI think his mom planned, if she got in trouble, to point at me and say he was <br/>\nat our house and we were homeschoolers and he was doing whatever all MY boys <br/>\nwere doing.   <br/>\n<br/>\nJoey&#39;s mom died last year, of blood clots.  She had been prescribed Comoden <br/>\n(I think that&#39;s the blood clot medication, and I probably spelled it wrong) and <br/>\nspecial diet, but she apparently didn&#39;t keep up with that, and she died.  <br/>\nJoey&#39;s not here nearly as much anymore, but he&#39;s here a time or two a week, and <br/>\nthat&#39;s fine.  <br/>\n<br/>\nJoey&#39;s okay.  He&#39;s intelligent and honest and very shy and could&#39;ve used <br/>\nbraces and way more attention from his family.  Things like driver&#39;s ed are just <br/>\npassing him by.  I dont know what the situation is with his dad, who&#39;s a <br/>\nplumbing contractor (I think) and seems not to work much.  He has a dangerous older <br/>\nbrother who was in mental lock-up for a while for having tried to kill the <br/>\nyounger brother with a shovel.   Because of that and the obvious lack of concern <br/>\nfor where Joey was and for how long, I didn&#39;t run him off altogether.  I <br/>\ntalked to his mom twice.  She was grateful Joey had a better place to go.  I guess <br/>\nshe was unable or unwilling to just make her own home a better place.  That <br/>\nwas neglect.  She neglected her own health, too, and neglected to live until her <br/>\nchildren were grown.<br/>\n<br/>\nWhat we&#39;re doing can be passed on through ideas and inspirations and example, <br/>\nbut it&#39;s not transferable and it&#39;s not shared.  Learning happens inside each <br/>\nperson.  Parenting happens inside each family, in the relationship between <br/>\neach child and each parent.   There is optimal unschooling and there is <br/>\nhalf-assed unschooling, and there&#39;s neglect, and generally others neither know nor can <br/>\nprove one way or another what is what and who is how.  <br/>\n<br/>\nI&#39;m glad for the internet and e-mail and message boards.  We can share more <br/>\ninformation in a week nowadays than existed altogether on the planet about <br/>\nunschooling/open-classroom/alternative education/natural learning thirty years <br/>\nago.  We have a HUGE advantage.  But we&#39;re still doing something touchy and <br/>\nalternative and that&#39;s not as easy as it looks.<br/>\n<br/>\nI love these exchanges, but each unschooling mom eventually has to create <br/>\nherself an unschooling mom and have her OWN knowledge and her OWN certainty and <br/>\nconfidence.   <br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":65833,"nextTopicId":102469}}