{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":134300842,"authorName":"Brenda Rose","from":"&quot;Brenda Rose&quot; &lt;rosebl@...&gt;","profile":"homeanduva2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: GEDs (long)","postDate":"1109688590","msgId":104044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNWQwMWM1MWU2ZCRlYzRjNzc3MCQ2ODAxYThjMEBCcmVuZGE+","referencesHeader":"PDExMDk2ODUxOTAuNjE3LjU2NTk5Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":104043,"nextInTime":104045,"topicId":104044,"numMessagesInTopic":0,"msgSnippet":"... limited.  Some homeschooling curriculae are not fully accredited (some of the Christian ones, if I understand correctly).   A GED is WAY, way cheaper and ","messageBody":"<div id=\"ygrps-yiv-96717901\">Sandra wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;If you want &quot;a standard diploma&quot; via homeschool, your options are more<br/>\n </span></blockquote>limited.  Some homeschooling curriculae are not fully accredited (some of <br/>\nthe<br/>\nChristian ones, if I understand correctly).   A GED is WAY, way cheaper and <br/>\nIS<br/>\n&quot;accredited&quot; (recognized by the government as an equivalent of public <br/>\nschool).  In<br/>\nNew Mexico, if one gets a GED before adulthood, it&#39;s a high school diploma<br/>\nstraight up, issued by the state board of education.   Says so:  High School<br/>\nDiploma right on the diploma they send.<br/>\n<br/>\nPossibly other states have similar options.&lt;&lt;&lt;&lt;<br/>\n<br/>\nI&#39;m not sure if the GEDs in VA say high school diploma and my three children <br/>\nwho have one aren&#39;t home now.<br/>\nBut our experience with the GED was very positive.  When my two oldest <br/>\nchildren, David and Sarah, got their GEDs (in 1995 and 1997) the  law was <br/>\nthat to receive federal financial aid for college or higher ed a student <br/>\nmust have graduated from an accredited high school (public or some private <br/>\nschools) OR must have a GED.  Since we didn&#39;t consider either public or <br/>\nprivate school much of an option but wanted (needed) the financial aid they <br/>\nboth got their GEDs.  It was easy, cheap, and quick to do.  Both of them <br/>\nwere 16 yo when they &quot;graduated.&quot;  David went to community college and did <br/>\nwell enough to get scholarships when he transferred to a 4-year school.  He <br/>\nhas a BA in history and philosophy/religion and has been studying for the <br/>\nM.Div. at a TN seminary.  Sarah chose cosmetology school and because she <br/>\nqualified for financial aid, it was totally free.  She has been a licensed <br/>\ncosmetologist since 1998, graduating from that school at age 17.<br/>\nMy third child, Martha, did not &quot;have&quot; to get her GED to receive college <br/>\nfinancial aid, as the law was changed, but she chose to get it in 2000.  She <br/>\ndid not &quot;graduate&quot; early, but was only 17 because of her August birthday. <br/>\nShe also began by attending the local community college and also received <br/>\nscholarships when she transferred to a 4-year school.  She will graduate <br/>\nthis May with a BS in psychology, minors in theater and Bible.  She hopes to <br/>\ngo to Duke Divinity School next year (we&#39;ll know if she&#39;s accepted next <br/>\nweek).<br/>\n<br/>\nWhen my children or others asked if a GED would stigmatize them, or be <br/>\nsomehow less impressive than a &quot;real&quot; diploma, I told them that:<br/>\n1.  They &quot;proved&quot; they could read, write, and do math, which was more than <br/>\nmany graduates were doing at the time.<br/>\n2. The GED is normed on high school graduates, and passing rates are set so <br/>\nthat a student must do better than 50 or 60 % (I forget the exact figure) of <br/>\nthe high school graduates.   That&#39;s certainly not a bad thing and nothing to <br/>\nbe ashamed of.<br/>\n3.  All three of them received a high school diploma from us and our &quot;home <br/>\nschool,&quot; and they can choose to use that for jobs or schooling, display it, <br/>\nor keep it private - that&#39;s all up to them.  But it is recognized as a <br/>\nnon-accredited high school diploma.<br/>\n4. If they chose to go on, then no one would ever really look at their high <br/>\nschool years - If you have a college or trade school degree an employer <br/>\nisn&#39;t usually too concerned about high school.<br/>\n5.  If they didn&#39;t go on to any other schooling, a GED would allow them to <br/>\nfill in job aps with School - &quot;Homeschool&quot; and Graduated? &quot;Yes&quot; with no <br/>\nquestions.<br/>\nThey can use the name of the local high school if they want to, because that <br/>\nis on their GED. (None of them ever has, though!)<br/>\n<br/>\nThey&#39;ve never had any problems doing, studying, or learning what they wanted <br/>\nand the GED never hindered them.  It only helped.<br/>\n<br/>\nImportant Note:  A GED also can help students be legally out from under the <br/>\npublic school&#39;s domain (oversight - reporting, testing, etc.) sooner, <br/>\nbecause they are (in VA anyway) able to graduate at age 16 instead of 18. <br/>\nThen they&#39;re free to pursue their own lives without school hassles (for them <br/>\nor Mom).  Also, for VA community college, a GED means automatic admission, <br/>\nas opposed to some places where 16-17 yo homeschool students want to take <br/>\nclasses and may be refused.<br/>\n<br/>\nBrenda</div>","specialLinks":[]}],"prevTopicId":104020,"nextTopicId":104037}}