{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I just need some encouragement, reminders, ideas, inspiration","postDate":"1305625489","msgId":61232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMDRFQ0VFLUQ3NUYtNDQ0OS04MTJCLUJCOENCM0U5MjM4N0B5YWhvby5jb20+","inReplyToHeader":"PGlxbzgwbytwbzliQGVHcm91cHMuY29tPg==","referencesHeader":"PGlxbzgwbytwbzliQGVHcm91cHMuY29tPg=="},"prevInTopic":61228,"nextInTopic":0,"prevInTime":61231,"nextInTime":61233,"topicId":61203,"numMessagesInTopic":0,"msgSnippet":"... The context of expectation might change your feelings. If she worked in the entertainment industry (like I do), she d be valued for what she knows! Are you","messageBody":"<div id=\"ygrps-yiv-851340578\">On May 15, 2011, at 2:56 AM, &quot;m_aduhene&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:m_aduhene@...\">m_aduhene@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just panicked because I thought my dd&#39;s knowledge will be seen as empty knowledge.<br/>\n </span></blockquote>-----------------<br/>\n<br/>\nThe context of expectation might change your feelings.<br/>\n<br/>\nIf she worked in the entertainment industry (like I do), she&#39;d be valued for what she knows!<br/>\n<br/>\nAre you sure it&#39;s fashion and celebrity she is interested in?  Is it a particular celebrity?  Is it hair and make-up or the clothing?  Is it a particular show?  Is it the story/writing?  A character she likes?  Lucrative careers potentially await her that have little use for &quot;intellectual&quot; or Discovery Channel-type knowledge.<br/>\n<br/>\nI remember being a little older than your daughter (11-12) and my mother noticing I had a particular sense of style.  She bought me Vogue magazine whenever she thought about it and told me that I could become a fashion designer.  Meanwhile, I was enrolled in a math/science/computer magnet and winning the school oratory competition.  I was also placing nationally in math competitions but my interests were in the performing arts.  She never encouraged or supported my acting for fear that i&#39;d try to act for a living.  Ironically, it was editing film that I was interested in, and the performing arts were the closest I could get to my interest.  It took another 10-15 years for me to really uncover my passion for film editing!<br/>\n<br/>\nHow fortunate for you and your 10 year old that you get to explore her interests now!  Maybe she&#39;s a fashion designer or a stylist or a hair designer.  Maybe she&#39;s a make-up artist or a special effects prosthetics artist.  Maybe she&#39;s a Nickelodeon producer or executive in charge of development.  Maybe she&#39;s an entertainment reporter or publicist.  <br/>\n<br/>\nMaybe she&#39;s none of these and interested in becoming a teenager and wants to get some teenage looks for herself.  I remember shopping for a new &quot;look&quot; around 11-12 because I was &quot;growing up&quot;!  And, getting those outfits gave me confidence to go up to other kids I wanted to meet and introduce myself boldly...where I had been a shy girl prior to that.<br/>\n<br/>\nIf it turns out she is interested in the entertainment business, no one expects degrees (a degree can sometimes even work against you!) and a person can start on the bottom rung in an entry level position at any age that you can legally work!  Entertainment is an industry that weathers economic downturns well, too, as people seek stories, comfort and escape during good times and bad.  It&#39;s also an industry that values a current knowledge and passion for pop culture references and oftentimes older folks in the business appreciate the younger adults&#39; knowledge of the newer and younger stars that often were teen or child stars.  If her interests continue, she may find her Unschooling mom really helped her form a solid foundation for work in the entertainment industry.<br/>\n<br/>\nSome things to think about.<br/>\n<br/>\nCeci</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I just need some encouragement, reminders, ideas, inspiration","postDate":"1305612001","msgId":61228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxdDJ0MStiYWNqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlxbXM5bCtkcmhjQGVHcm91cHMuY29tPg=="},"prevInTopic":61220,"nextInTopic":61232,"prevInTime":61227,"nextInTime":61229,"topicId":61203,"numMessagesInTopic":0,"msgSnippet":"We found a friend for my daughter who is raised by her grandma who I have lots in common with and really like, but the grandma mentioned in passing that she","messageBody":"<div id=\"ygrps-yiv-1626895910\">We found a friend for my daughter who is raised by her grandma who I have lots in common with and really like, but the grandma mentioned in passing that she spanks (though I never would have guessed from the interactions I&#39;ve seen).  We went to another potential friend&#39;s house and they had up &quot;house rules&quot; like &quot;eat what you&#39;re given or nothing at all&quot; and &quot;obey mom and dad the first time.&quot; ====<br/>\n<br/>\nJust a few thoughts, although they may apply to the future rather than now.<br/>\n<br/>\nYou won&#39;t always be close to your kids&#39; friends&#39; parents. It&#39;s great when it works out that you find friends too, but it isn&#39;t always what happens. I was always expected to play with and like my mother&#39;s friends&#39; kids. It wasn&#39;t always comfortable for me.<br/>\n<br/>\nJayn finds even the strict rules at her friends&#39; homes worth it for the sake of visiting her friends. They also make our house look really awesome. I wouldn&#39;t leave her with spankers though.<br/>\n <br/>\nBe the cool mom with the cool house where other kids want to hang out - especially if you do the messy stuff like mud pies and gardening and arts & crafts.<br/>\n<br/>\nJayn always takes her own food bag to sleepovers or all day visits. <br/>\n<br/>\nAvailability can create a scheduling issue, but not all schooled neighborhood kids are awful.;)<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.blogspot.com</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I just need some encouragement, reminders, ideas, inspiration","postDate":"1305483440","msgId":61220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxcDViZyt1aThrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlxbXM5bCtkcmhjQGVHcm91cHMuY29tPg=="},"prevInTopic":61218,"nextInTopic":61228,"prevInTime":61219,"nextInTime":61221,"topicId":61203,"numMessagesInTopic":0,"msgSnippet":"... ***************** These are all good things! Younger children need time at home, time to nest more than they need to be out and about, in general. Enjoy","messageBody":"<div id=\"ygrps-yiv-1709889742\">&quot;Emily S&quot; &lt;saturnfire16@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;They&#39;ve been happy though.  We have a yard for the first time that they love.  They&#39;re playing great together (5 year old and almost 3 year old) and do that most of the day.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThese are all good things! Younger children need time at home, time to &quot;nest&quot; more than they need to be out and about, in general. Enjoy the fact that they have this wonderful yard and can play all day long - that&#39;s a marvelous gift. If you&#39;re really jonesing for the city, plan some day trips or overnights with friends there - but not very many right now. Let your kids love their new life. <br/>\n<br/>\nIn the longer run, two things to think about - first, you&#39;re going to need to learn some new skills, since you can&#39;t always fall back on &quot;lets go out and x&quot; the way maybe you could before. Start collecting ideas and things to strew for later - look at yard sales and library sales, thrift shops, pawn shops, look online, too. Don&#39;t break the bank, just pick up things in your price range that look interesting &quot;just in case&quot; so you have a good collection of offerings as the kids get older and their needs and interests start to change. <br/>\n<br/>\nThe other thing - is there a halfway place you can live? Somewhere closer to the city but still have a yard? That&#39;s tomorrow&#39;s problem, though, if the kids are happy where they are. It&#39;s worth doing some research, but take your time. It also doesn&#39;t preclude the first thing - stock up on stuff as you can. Even cities can get dull and uninspiring. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I feel like we are lacking that spark and inspiration and learning all the time that we had before.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIt&#39;s also important that you think about what &quot;learning&quot; means. Kids playing in the yard are learning - in fact, play is The Way kids do the vast majority of their learning. If you&#39;ve been scheduling this and that, being the spark and inspiration, you&#39;ve been getting in the way of natural learning. They&#39;re Still learning all the time, but now they&#39;re learning what they want to learn, exploring what&#39;s real and imediate and right in front of them - and they&#39;re Happy about it! That&#39;s pretty important. Take some time to watch and join in their fun - this is learning at its finest!<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I just need some encouragement, reminders, ideas, inspiration","postDate":"1305468434","msgId":61218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwNDdDM0Y1LTIyRUYtNERCOC05N0NFLUQxNTU4M0REQTZDN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlxbzgwbytwbzliQGVHcm91cHMuY29tPg==","referencesHeader":"PGlxbzgwbytwbzliQGVHcm91cHMuY29tPg=="},"prevInTopic":61215,"nextInTopic":61220,"prevInTime":61217,"nextInTime":61219,"topicId":61203,"numMessagesInTopic":0,"msgSnippet":"... Very typical for the tween (between little kid and teen) years. The tween shows appeal to tweens because they re tweens not because their brains have","messageBody":"<div id=\"ygrps-yiv-218351469\">On May 15, 2011, at 5:56 AM, m_aduhene wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We still chat, read books, watch tv and movies together but she  <br/>\n&gt; seems to watch a lot of tv (stuff like icarly, true jackson etc) and  <br/>\n&gt; is very into fashion and the celebrity world.<br/>\n<br/>\n </span></blockquote>Very typical for the tween (between little kid and teen) years. The  <br/>\ntween shows appeal to tweens because they&#39;re tweens not because their  <br/>\nbrains have atrophied ;-) The tween shows are like social dramas with  <br/>\ntraining wheels as the kids figure out how social interactions work.<br/>\n<br/>\nIf you feel disconnected, it&#39;s not because she&#39;s pulling away but  <br/>\nbecause you haven&#39;t kept up with her. Rather than wishing she&#39;d be  <br/>\ndifferent than she is, eg, more like the 10 yo boy, more like someone  <br/>\nwho liked museums and crafts, accompany her as she explores what  <br/>\nfascinates her right now.<br/>\n<br/>\nUnschooling is about helping who they are grow, not growing ideal  <br/>\nchildren. Unschooling doesn&#39;t turn a pomegranate seed into an oak  <br/>\ntree. It supports the pomegranate seed as it grows into a pomegranate  <br/>\ntree.<br/>\n<br/>\nIf she hasn&#39;t already, she&#39;ll start feeling that you have an image of  <br/>\nwho you think she should be and that she&#39;s drifting further from your  <br/>\nideal image of a daughter. It&#39;s the beginning of her feeling you don&#39;t  <br/>\nunderstand her. To stop the slide down that path, join her in  <br/>\nexploring celebrities and fashion.<br/>\n<br/>\nSandra has a whole page of ideas that were generated around fashion:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/design\">http://sandradodd.com/connections/design</a><br/>\n<br/>\nIt&#39;s the lens that fits how she&#39;s exploring the world right now.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I just need some encouragement, reminders, ideas, inspiration","postDate":"1305455812","msgId":61215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwRjkyRDlDLTBFNDMtNEQ5Ny1BMThFLTFDQjE5MDRGNjc5MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlxbzgwbytwbzliQGVHcm91cHMuY29tPg==","referencesHeader":"PGlxbzgwbytwbzliQGVHcm91cHMuY29tPg=="},"prevInTopic":61214,"nextInTopic":61218,"prevInTime":61214,"nextInTime":61216,"topicId":61203,"numMessagesInTopic":0,"msgSnippet":"-=-She is happy with how her life is and is a very happy and confident girl. Should this be my only goal though? Happy and confident? What about the gaps ?","messageBody":"<div id=\"ygrps-yiv-528642519\">-=-She is happy with how her life is and is a very happy<br/>\nand confident girl. Should this be my only goal though? Happy and confident? <br/>\nWhat about the &quot;gaps&quot;? How do I be with my 10 year old?<br/>\nI am a bit stuck.-=-<br/>\n<br/>\nHow happy and confident was the boy with the intellectual bent?  Maybe just as happy as your daughter.  Maybe not.<br/>\n<br/>\nThere is value in fashion and popular culture.   That other boy&#39;s knowledge was more schoolish.  Don&#39;t let &quot;more schoolish&quot; be your goal, though.  Even in school, some people don&#39;t have &quot;schoolish&quot; interests.  Only a small percentage of school kids are &quot;studious&quot; or &quot;gifted&quot; within that frame of thought.  <br/>\n<br/>\nGaps in knowledge?  Everyone has gaps, if the measurement is knowing everything.  Nobody knows everything.   But things that don&#39;t seem &quot;academic&quot; can still eventually lead to all other subjects.<br/>\n<br/>\nHere are some entryways to everything, in Elvis, Gilligan&#39;s Island and WWII:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dot/elvis\">http://sandradodd.com/dot/elvis</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/gilligan\">http://sandradodd.com/t/gilligan</a><br/>\n<br/>\nThere was a mom who wrote and said &quot;My kid doesn&#39;t care about anything in the world but WWII. He doesn&#39;t do anything but draw pictures of tanks and draw pictures of airplanes, and draw maps. He knows all about WWII. He doesn&#39;t know anything else. And so I, that was when AOL was new so that was years ago. And that was the first time anyone ever put one of those to me, like tell me how. You know &quot;Prove it. Put up or shut up.&quot; And I said, &quot;Ok.&quot; So I just started spinning a thing about WWII, you know about how much it tied in. If he knew how they got food to those people and how they were exchanging information, how .. you know... why were those guys there? what were their motivations for being there? he would have the same kinds of questions about every other thing. He would understand other wars and projects if he understood that. You know, you have to get food to people. They have to have a place to sleep. They have to have some clothes. They have to have some water. You know who thinks about that with the war? But he did. That kid did. That kid knew everything. He was just huge into the logistics about who was where and why and how. How can that not tie into everything, including music?   ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/video/sandra3\">http://sandradodd.com/video/sandra3</a> )<br/>\n<br/>\nAnd another mention of it is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227835915,"authorName":"m_aduhene","from":"&quot;m_aduhene&quot; &lt;m_aduhene@...&gt;","profile":"m_aduhene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I just need some encouragement, reminders, ideas, inspiration","postDate":"1305453400","msgId":61214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxbzgwbytwbzliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlxbXM5bCtkcmhjQGVHcm91cHMuY29tPg=="},"prevInTopic":61205,"nextInTopic":61215,"prevInTime":61213,"nextInTime":61215,"topicId":61203,"numMessagesInTopic":0,"msgSnippet":"Hi, My post links to this but we haven t moved.  I just feel stuck at the moment.  I am  happy with the way things are with younger two children 7 and (3","messageBody":"<div id=\"ygrps-yiv-2147162391\">Hi,<br/>\nMy post links to this but we haven&#39;t moved.  I just feel &quot;stuck&quot; at the moment.  I am  happy with the way things are with younger two children 7 and (3 days off) 5 year old.  I feel inside that talking and just doing and playing are fine for them.  However  with my 10 year old daughter I seem to have a block.  We still chat, read books, watch tv and movies together but she seems to watch a lot of tv (stuff like icarly, true jackson etc) and is very into fashion and the celebrity world.  My question has been triggered because we visited a friend yesterday and her son was challenging my husband to a quiz (he&#39;s 10) and his questions where very &quot;intellectual&quot; for a 10 year old.  I just panicked because I thought my dd&#39;s knowledge will be seen as empty knowledge.  She does NOT want to go to museums or watch tv programmes like discovery channel.  She has  no interest for now in instruments or art or any of the things that are seen as &quot;intellectual pursuits&quot;. She is happy with how her life is and is a very happy and confident girl.  Should this be my only goal though?   Happy and confident?  What about the &quot;gaps&quot;? How do I be with my 10 year old? <br/>\nI am a bit stuck.<br/>\nblessings<br/>\nmichelle</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] I just need some encouragement, reminders, ideas, inspiration","postDate":"1305412634","msgId":61205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4Mjk3OUY2LTQ4RkQtNENBNC05NDM4LThGMjcyQ0JDODA0RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlxbXM5bCtkcmhjQGVHcm91cHMuY29tPg==","referencesHeader":"PGlxbXM5bCtkcmhjQGVHcm91cHMuY29tPg=="},"prevInTopic":61203,"nextInTopic":61214,"prevInTime":61204,"nextInTime":61206,"topicId":61203,"numMessagesInTopic":0,"msgSnippet":"-=- it s left me being lazy and lacking inspiration in doing things with my kids. They ve been happy though. We have a yard for the first time that they love.","messageBody":"<div id=\"ygrps-yiv-591599665\">-=- it&#39;s left me being lazy and lacking inspiration in doing things with my kids. They&#39;ve been happy though. We have a yard for the first time that they love. They&#39;re playing great together (5 year old and almost 3 year old) and do that most of the day. But I feel like we are lacking that spark and inspiration and learning all the time that we had before. I need to get it back. Ideas?-=-<br/>\n<br/>\nLots. <br/>\nBut wait until they&#39;re bored first.  If they&#39;re playing happily in a new back yard, let that run its course.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/youngchildren\">http://sandradodd.com/youngchildren</a> has a ton of ideas<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"I just need some encouragement, reminders, ideas, inspiration","postDate":"1305408629","msgId":61203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxbXM5bCtkcmhjQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":61205,"prevInTime":61202,"nextInTime":61204,"topicId":61203,"numMessagesInTopic":0,"msgSnippet":"A few months ago we moved away from a city where we were part of a large unschooling group and had lots of attachment parenting friends.  There were lots of","messageBody":"<div id=\"ygrps-yiv-1889075228\">A few months ago we moved away from a city where we were part of a large unschooling group and had lots of attachment parenting friends.  There were lots of homeschoolers, cultural events, we could pretty much find something free or cheap to do any day of the week that we wanted to.  Lots of things to do, places to go, and like-minded friends to visit.  <br/>\n<br/>\nNow we are living in a small town 80 miles away from any city.  There are 2 homeschool groups here- one is a co-op with classes and a strict attendance policy, the other does field trips but charges more than we can afford.  We&#39;re broke, there&#39;s not much free or cheap (or even expensive!) to do here.  Most of the homeschoolers are doing charter school.  I&#39;ve met a few AP minded parents, but their kids are all younger than my oldest (she&#39;s 5).  We found a friend for my daughter who is raised by her grandma who I have lots in common with and really like, but the grandma mentioned in passing that she spanks (though I never would have guessed from the interactions I&#39;ve seen).  We went to another potential friend&#39;s house and they had up &quot;house rules&quot; like &quot;eat what you&#39;re given or nothing at all&quot; and &quot;obey mom and dad the first time.&quot;  <br/>\n<br/>\nAnyway, I&#39;m just sad that we left such a wonderful place and good friends, frustrated that there isn&#39;t more to do, and it&#39;s left me being lazy and lacking inspiration in doing things with my kids.  They&#39;ve been happy though.  We have a yard for the first time that they love.  They&#39;re playing great together (5 year old and almost 3 year old) and do that most of the day.  But I feel like we are lacking that spark and inspiration and learning all the time that we had before.  I need to get it back.  Ideas?<br/>\n<br/>\nEmily</div>","specialLinks":[]}],"prevTopicId":61111,"nextTopicId":61148}}