{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"lr-cOxggoRt73w6VDr4ZHPGO8aM3MC_ypXZoXfqGLp3BBafqaRO6_pQGk11BmewiR_1J0y75Uc0E","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: changing the course of the mainstream","postDate":"1004805582","msgId":27342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4LjEyMDBlY2E1LjI5MTU3N2NlQGFvbC5jb20+"},"prevInTopic":27330,"nextInTopic":0,"prevInTime":27341,"nextInTime":27343,"topicId":27252,"numMessagesInTopic":0,"msgSnippet":"(The following is long and only marginally about homeschooling, in a philosophical way.) ","messageBody":"<div id=\"ygrps-yiv-1453570686\">(The following is long and only marginally about homeschooling, in a <br/>\nphilosophical way.)<br/>\n<br/>\n&lt;&lt;  That birth was when I was really thankful for all the changes that have <br/>\nbeen pushed through by <br/>\nbirthing advocates.  &gt;&gt;<br/>\n<br/>\nWhen I was pregnant with Marty, I totally planned a home VBAC with backup <br/>\nplans, but I kept going to appointments with my HMO, letting them assume I <br/>\nwas coming in, stretching their limits, educating them as to why I was <br/>\nrefusing this or that, and what the legalities were, and making sure they had <br/>\nrefusal forms, giving them current research to read, and generally being a <br/>\npain.  When insurance-change time came where my husband works, I dropped that <br/>\nHMO in favor of the university hospital, which is the neo-natal-problem <br/>\nheadquarters for the whole state.  I figured if there were problems, I&#39;d be <br/>\nbetter off at UNMH than Lovelace.<br/>\n<br/>\nI had had a bad session with the head of pediatrics one day, and so I <br/>\ndramatically said I didn&#39;t think I could deal with them, and it was MY birth, <br/>\nnot theirs (etc., again, knowing I wasn&#39;t going there anyway--I was just <br/>\nthere as part of my dedication to helping other moms not be totally <br/>\nbuffaloed).  <br/>\n<br/>\nBefore the insurance switch had gone through, I got a call from one of the <br/>\nadministrator nurses at the HMO asking me whether I was dissatisfied.  I said <br/>\nI was, and I wouldn&#39;t be coming back.  She pressed for me to tell her which <br/>\ndoctor I was going to.  I was seeing the same midwife I&#39;d been seeing the <br/>\nwhole pregnancy, but I didn&#39;t tell her that.  I said I was taken care of and <br/>\nthey didn&#39;t need to worry.<br/>\n<br/>\nI don&#39;t know if they were afraid I would sue or what, but she said they would <br/>\nconsider paying the other doctor.  I asked skeptically why they would <br/>\nconsider doing that, since they had plenty of doctors and that wasn &#39;t how <br/>\nthe plan worked.  She was soothing, and I think she was willing to say <br/>\nanything to find out where I was going and what I was up to.<br/>\n<br/>\nI had seen the midwives at the university hospital already and told them my <br/>\nplan, that I would just come in in case of emergency, and I let them check me <br/>\nout (at about 7 months) so I&#39;d have a record on file there, to save some time <br/>\nin case.<br/>\n<br/>\nThey said that to qualify for a VBAC there, I would have to have been in <br/>\ntheir VBAC program since three or four months (I forget what now), and so if <br/>\nI came in it would be a cesarean.  I said fine, because if it doesn&#39;t need a <br/>\ncesarean, I&#39;m not coming in.<br/>\n<br/>\nAt that point I had gathered more information for the use of other moms in <br/>\ntown who were coming to the Ceasarean Prevention Movement.  (I&#39;m going to <br/>\ngive up now on spelling that consistently, since the rest of the world has <br/>\ngiven up, and that&#39;s not what this story&#39;s about.)<br/>\n<br/>\nTime came, labored for 35 hours or so, midwife, and EMT homebirthing mom,  <br/>\nand other friends took shifts.  It wasn&#39;t happening.   I went in.  Told them <br/>\nthe details, gave them the chart of the past two days.  We had tried to break <br/>\nthe water and it didn&#39;t break, but the labor was at the point where the <br/>\ncontractions were involuntary, there was just no progress for many hours.<br/>\n<br/>\nThey said &quot;OH!  We&#39;ll just break that water and the baby will slide right on <br/>\nout.&quot;<br/>\n<br/>\nI told them their policies prevented VBAC for me.  (Mostly I knew of a <br/>\nthen-24 hour policy on how long to labor after the water breaks and I didn&#39;t <br/>\nwant to labor for another 24 hours; Kirby had been a cesarean after I was at <br/>\n10cm, and it was happening again.)<br/>\nThey said they could waive that policy, no problem.<br/>\n<br/>\nSo...  Three more hours of labor (stirrup table, me saying &quot;cut me&quot;) and the <br/>\nstory gets really boring.<br/>\n<br/>\nBUT...  <br/>\nMy sister heard I&#39;d gone in and had the baby.  She called from our home town, <br/>\nbut she called my HMO, Lovelace.  This is 7:00 a.m. when Marty was 4 hours <br/>\nold.  She asked if I was there.  They said &quot;She&#39;s at UNMH.&quot;<br/>\n<br/>\nI had carefully told NOBODY at Lovelace, but they found out anyway.  I&#39;ve <br/>\nalways thought that fascinating. &lt;g&gt;<br/>\n<br/>\nSo it&#39;s the sad story of someone who never even had a homebirth OR a vaginal <br/>\nbirth, still managing to help other moms have them.  And there are <br/>\nmarginal-to-homeschooling situations in which the questions and insistence <br/>\nand complaints of those who are not purely natural unschoolers which will <br/>\nstill change the schools for the better.<br/>\n<br/>\nI don&#39;t think schools should be dismantled.  I think they should adapt and be <br/>\nmore open.  I believe unschoolers will eventually make much more difference <br/>\nin the practices and beliefs of educators than all the structured <br/>\nhomeschoolers put together.  Their structure-results, if good, will only <br/>\nserve to make schools want more money for lower student-teacher ratios <br/>\nwithout changing their methods.  <br/>\n<br/>\nWe can&#39;t change it all at once, but I&#39;d rather have a small, real effect <br/>\nwhich made someone else&#39;s life better than to stand and rant and have no <br/>\neffect except to have the establishment point at us and say &quot;See?  Nuts.  <br/>\nIgnore them.&quot;<br/>\n<br/>\nIt&#39;s not glorious or photographable to be a part of social erosion.  I&#39;m not <br/>\nusually a very patient person, and sanding wood or polishing metal gets old <br/>\nfast for me, but with social engineering I have more patience.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","senderId":"ztyPtKv86kRsFDEXdUMdlYVYzMLRJvYNiEJpFP7Gq4TyiiF4UxENpvp7tP9fWifOgVgfsJVSMAdVScM1MiKYK2X7NgoGwfHFWtI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: changing the course of the  mainstream","postDate":"1004765270","msgId":27330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAxMTEwMjIxMjE1Ni4wMWMwZjA0MEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PDNCRTJGQjhBLjIyRTlBNDk0QGVhcnRobGluay5uZXQ+","referencesHeader":"PDUxLjEzOGQ0MjZlLjI5MTM4NjcxQGFvbC5jb20+"},"prevInTopic":27306,"nextInTopic":27342,"prevInTime":27329,"nextInTime":27331,"topicId":27252,"numMessagesInTopic":0,"msgSnippet":"... Here too.  My daughter, who was born at home, has had her 2 at home.  Many of her friends have also.  Of course it helps that we can have a midwife paid","messageBody":"<div id=\"ygrps-yiv-148334953\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;Yes!  I think there is also the feeling that the &quot;expert&quot; (doctor or teacher)<br/>\n&gt;can give you a better outcome.<br/>\n&gt;<br/>\n&gt;The latest baby born in my local HS support group was a homebirth.  And <br/>\n&gt;the next<br/>\n&gt;one on the way is also planned for birth-at-home.  Around here, homebirth <br/>\n&gt;still<br/>\n&gt;seems to be growing.<br/>\n<br/>\n </span></blockquote>Here too.  My daughter, who was born at home, has had her 2 at home.  Many <br/>\nof her friends have also.  Of course it helps that we can have a midwife <br/>\npaid for by our medical plan.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I was afraid, myself, about birth and had a hospital birth for my only child.<br/>\n&gt;(Terrible!!!)<br/>\n<br/>\n </span></blockquote>My first was going to be a homebirth but came 2 months early.  My second <br/>\nwas born at home, but without anyone skilled in attendance.  My third was <br/>\nborn in hospital because we lived too far away.  My fourth was also a <br/>\nhospital baby because his dad would have been too fearful.  There were some <br/>\ncomplications at his daughter&#39;s birth (mostly doctor caused) and he <br/>\nwouldn&#39;t have been able to get over his fears.  That birth was when I was <br/>\nreally thankful for all the changes that have been pushed through by <br/>\nbirthing advocates.  I don&#39;t care why they happened.  I&#39;m just glad they <br/>\ndid.  We had a great birth and then went right home.  &lt;g&gt;<br/>\nTia<br/>\n<br/>\nTia Leschke   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island<br/>\n**************************************************************************<br/>\nIt is the answers which separate us, the questions which unite us. - Janice <br/>\nLevy</div>","specialLinks":[]},{"userId":0,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","senderId":"b5fjsZgmEzxCEi5fsdOA4Iraola4XpQGQBpi-Wy6Pj5G3zwBFKUyINkB4Kbp41TYuFityT580v3Myx5i7UfcvsDjneBb_qp520j9oAeefg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: changing the course of the mainstream","postDate":"1004731278","msgId":27306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCRTJGQjhBLjIyRTlBNDk0QGVhcnRobGluay5uZXQ+","referencesHeader":"PDUxLjEzOGQ0MjZlLjI5MTM4NjcxQGFvbC5jb20+"},"prevInTopic":27275,"nextInTopic":27330,"prevInTime":27304,"nextInTime":27307,"topicId":27252,"numMessagesInTopic":0,"msgSnippet":"... Yes!  I think there is also the feeling that the expert (doctor or teacher) can give you a better outcome. The latest baby born in my local HS support","messageBody":"<div id=\"ygrps-yiv-1593439725\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brendaclaspell@...\">brendaclaspell@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I agree totally with this! I have read most of the thread and that&#39;s my take<br/>\n&gt; as well. IMO the missing link in ps or structured hs and in hospital births<br/>\n&gt; is very similar. Not believing in the natural processes of life/of being a<br/>\n&gt; human.<br/>\n<br/>\n </span></blockquote>Yes!  I think there is also the feeling that the &quot;expert&quot; (doctor or teacher)<br/>\ncan give you a better outcome.<br/>\n<br/>\nThe latest baby born in my local HS support group was a homebirth.  And the next<br/>\none on the way is also planned for birth-at-home.  Around here, homebirth still<br/>\nseems to be growing.<br/>\n<br/>\nI was afraid, myself, about birth and had a hospital birth for my only child.<br/>\n(Terrible!!!)<br/>\n<br/>\nSo maybe I understand a bit why people are afraid to homeschool without an<br/>\ninstitution.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":0,"authorName":"brendaclaspell@aol.com","from":"brendaclaspell@...","profile":"brendaclaspell","replyTo":"LIST","senderId":"OSFALMZWPe8X0FQn_2FjkxI_0F2y71DbztRE1nzREn2QRtfNc-ZZbSiQWg9UZsF_j_YbTjZ862ImC75rlg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: changing the course of the mainstream","postDate":"1004678257","msgId":27275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxLjEzOGQ0MjZlLjI5MTM4NjcxQGFvbC5jb20+"},"prevInTopic":27271,"nextInTopic":27306,"prevInTime":27274,"nextInTime":27276,"topicId":27252,"numMessagesInTopic":0,"msgSnippet":"Hi All! Haven t posted in awhile, been pulled in too many directions. It s nice to really have some time to read and share here again. In a message dated","messageBody":"<div id=\"ygrps-yiv-992889740\">Hi All! Haven&#39;t posted in awhile, been pulled in too many directions. It&#39;s <br/>\nnice to really have some time to read and share here again.<br/>\n<br/>\nIn a message dated 11/1/01 11:03:51 PM US Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:chrisoco@...\">chrisoco@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; . In part, for me, because the struggle is part of the living <br/>\n&gt; and the learning. But it is also about social politics and changing <br/>\n&gt; the root, not the symptom.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I agree totally with this! I have read most of the thread and that&#39;s my take <br/>\nas well. IMO the missing link in ps or structured hs and in hospital births <br/>\nis very similar. Not believing in the natural processes of life/of being a <br/>\nhuman.  A lot of the peripherals of hospital births have improved <br/>\ndrastically, but at the core, they still manage the birth process...and <br/>\nusually do more harmful interventions that helpful. And I think the <br/>\nperipherals of ps/hs have improved, I&#39;ve not been in this long enough to even <br/>\nspeculate why, but at the root, the natural desire of children to learn is <br/>\ngiven little to no credit. It is managed, and again through <br/>\nunwanted/unsolicited/sometimes violently rebelled against intervention, often <br/>\ndamaged.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Zoos are certainly a far cry from what animal activists fought when <br/>\n&gt; animals were obviously abused...Today, most people are not offended by <br/>\n&gt; zoos, in fact, most feel that they serve a valuable place in our <br/>\n&gt; world. And the elephant in the zoo is fed well, cared for with the <br/>\n&gt; best medicine, and can expect a life longer than his wild <br/>\n&gt; conterparts... but is he free? <br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>I really liked that analogy. So many things are &#39;softer&#39;. So much so, they <br/>\nbarely warrant a strong reaction, or at least so it seems. But all too often <br/>\ntoday, I walk away from things feeling not quite right. It looks better, it&#39;s <br/>\nmeeting higher standards, but underneath the political correctness and pr, <br/>\nthere&#39;s still something not right.<br/>\n<br/>\nBrenda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"chrisoco@aol.com","from":"chrisoco@...","profile":"chrisoco_2","replyTo":"LIST","senderId":"45e-y8pHLfjeL9UjAt1ygRw0Hyvzv6SGnwD7GVrxvmnBt5xmoB7h6Z7jlVAkZuS-6SWsT6tjKA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: changing the course of the mainstream","postDate":"1004673712","msgId":27271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlydDVyZythdGo1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU2LjFkOTM2MTM3LjI5MTMxYjFjQGFvbC5jb20+"},"prevInTopic":27261,"nextInTopic":27275,"prevInTime":27270,"nextInTime":27272,"topicId":27252,"numMessagesInTopic":0,"msgSnippet":"... Heavens no! You make some excellent points, Sandra! Good to see you here too!! I m certainly not saying that the changes weren t welcome. And I agree, that","messageBody":"<div id=\"ygrps-yiv-662831220\">--- In Unschooling-dotcom@y..., SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &lt;&lt; As the hospitals and professionals took on &quot;home-like&quot; <br/>\n&gt; settings and twisted ideas into their own, fewer home birth<br/>\n&gt; advocates were willing to &quot;fight the fight&quot;. &gt;&gt;<br/>\n&gt;<br/>\n&gt; Surely you&#39;re not saying it would have been better for home births<br/>\n&gt; for hospitals to stay as stirrup-bound and drug-requiring as they<br/>\n&gt; wanted to be in 1959!!<br/>\n<br/>\n </span></blockquote>Heavens no! You make some excellent points, Sandra! Good to see you <br/>\nhere too!!<br/>\n<br/>\nI&#39;m certainly not saying that the changes weren&#39;t welcome. And I <br/>\nagree, that home birth and home education are not for everyone.. <br/>\nsimply a choice on the plate. But I don&#39;t think hospitals changed <br/>\nbecause of women who enjoyed their birthing experiences. I think the <br/>\nhome birth &quot;radicals&quot; &lt;g&gt; and the natural birth advocates threatened <br/>\nthe financial end to where changes were made to bring folks happily <br/>\nback to the institution. As the sides draw closer together, less <br/>\npassion is inflamed, less &#39;fighting spirit&#39;, if you will. I wonder <br/>\nabout the women who would have chosen home birth, and fully realized <br/>\nthe female power and beauty in birth had the institutional route been <br/>\nuglier and more offensive to their sensibilities. But with its &quot;not <br/>\nso bad&quot; ease of doing what everyone does, and nothing offensive to <br/>\nraise one&#39;s ire, the advocate list shrinks and contracts. I&#39;m not <br/>\nsaying that is a bad thing. Except perhaps for those on the fence.<br/>\n<br/>\nI think you can educate people about their choices all you want but <br/>\nvery few will really take the road less traveled unless the opposing <br/>\nchoice is just plain offensive. I don&#39;t think I really understood how <br/>\noffensive I felt schools (and schooling) were until long after I had <br/>\nbeen in the home ed community. Most folks just go with the flow, <br/>\nchoose the least troublesome route. Why struggle for money when the <br/>\nschools can give me some; why worry about an outline or a curriculum <br/>\nwhen the state can provide one; why go to the trouble of sifting <br/>\nthrough books and library shelves when someone else can tell me what <br/>\nto do. In part, for me, because the struggle is part of the living <br/>\nand the learning. But it is also about social politics and changing <br/>\nthe root, not the symptom.<br/>\n<br/>\nFor analysis purposes only &lt;not really wanting to start an animal <br/>\nrights discussion&gt;:<br/>\nZoos are certainly a far cry from what animal activists fought when <br/>\nanimals were obviously abused. During the 50&#39;s and 60&#39;s, many common <br/>\neveryday Janes and Joes felt sorry for animals in zoos and felt <br/>\nsomething should be done. Today, most people are not offended by <br/>\nzoos, in fact, most feel that they serve a valuable place in our <br/>\nworld. And the elephant in the zoo is fed well, cared for with the <br/>\nbest medicine, and can expect a life longer than his wild <br/>\nconterparts... but is he free? <br/>\n<br/>\nI&#39;m really not sure of all the answers here. I&#39;m still working on <br/>\nthis in my own head as well as thinking out loud here. I know there&#39;s <br/>\nsomething that doesn&#39;t feel right about the pull towards less freedom <br/>\nand I know there are fewer voices as the choices become less <br/>\noffensive. Beyond that, I&#39;m still listening and learning, not carving <br/>\nmy place in stone.<br/>\n<br/>\nin peace,<br/>\n<br/>\nChris O&#39;Connor</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"D7awjU7OzAngsGbRNh8FrwjHHMgyVlDlbJmwR2pUVU03BTwe_3rc7YL7n3eL19U08mQcuvGhpt80","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] changing the course of the mainstream","postDate":"1004661698","msgId":27261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0LjE1ODY5NTczLjI5MTM0NWMyQGFvbC5jb20+"},"prevInTopic":27256,"nextInTopic":27271,"prevInTime":27260,"nextInTime":27262,"topicId":27252,"numMessagesInTopic":0,"msgSnippet":" Not everywhere. But eventually there WILL probably","messageBody":"<div id=\"ygrps-yiv-588656135\">&lt;&lt; Every year<br/>\nthe school officials are trying to sneak more forms and requirements into<br/>\nhomeschooling.   &gt;&gt;<br/>\n<br/>\nNot everywhere.<br/>\n<br/>\nBut eventually there WILL probably be more &quot;requirements&quot; of homeschoolers.<br/>\n<br/>\nThat is the way of the bureaucratic world.<br/>\n<br/>\nI think the best way for us to stay a step ahead of the inevitable <br/>\nregulations is to document some of what unschoolers are doing--even if in the <br/>\nway of journals and testimonials--and by having grown unschoolers who will be <br/>\nable to say, &quot;Hey--it&#39;s NOT necessary to read by seven and memorize times <br/>\ntables by eight.&quot;<br/>\n<br/>\nWe can&#39;t dissolve the existence of bureaucracy.  Not and be able to sleep at <br/>\nnight without an armed guard in each house/compound/city state.  Not and be <br/>\nable to send a letter to a relative in another town.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n&quot;Everything counts.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDoddArticles\">http://expage.com/SandraDoddArticles</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDodd\">http://expage.com/SandraDodd</a></div>","specialLinks":[]},{"userId":0,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","senderId":"-LnjoHVObhsg68gP2CTsarHr58VjhCMetE3UyVueW5qSnRLmserPSEBHoQPGqPaI_-cHedIfX78","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] changing the course of the mainstream","postDate":"1004656904","msgId":27256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTAxLjE2MjE1MC4tOTU5MTE3LjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27255,"nextInTopic":27261,"prevInTime":27255,"nextInTime":27257,"topicId":27252,"numMessagesInTopic":0,"msgSnippet":"... I think everyone s glad things are better.  I m glad hospitals have changed, whatever there motivation.  I m glad if schools have changed, even in small","messageBody":"<div id=\"ygrps-yiv-1055823782\"><blockquote><span title=\"ireply\">&gt; Surely you&#39;re not saying it would have been better for home births <br/>\n&gt; for <br/>\n&gt; hospitals to stay as stirrup-bound and drug-requiring as they wanted <br/>\n&gt; to be in <br/>\n&gt; 1959!!<br/>\n <br/>\n </span></blockquote>I think everyone&#39;s glad things are better.  I&#39;m glad hospitals have<br/>\nchanged, whatever there motivation.  I&#39;m glad if schools have changed,<br/>\neven in small ways, if it&#39;s made things better for kids.  The danger I<br/>\nthink is in believing, being made to believe, that since things are so<br/>\nmuch better, everyone must be satisfied.  Midwives have faced increasing<br/>\nregulations, because hospitals don&#39;t want it to be easy for people to<br/>\nmake home birth choices.   Policy makers decide most of the people are<br/>\nhappy with the various hospital choices, and so why do women need to have<br/>\nthe choice to have their children at home?   <br/>\n<br/>\nI&#39;m glad parents who won&#39;t or can&#39;t homeschool are finding choices that<br/>\nwork for their kids.  I&#39;m just worried about what happens when  it is<br/>\ndecided these programs meet everyone&#39;s needs, and other options are taken<br/>\naway.  Am I the only one who thinks this can really happen?  Every year<br/>\nthe school officials are trying to sneak more forms and requirements into<br/>\nhomeschooling.  I&#39;m usually not a pessimistic person, but as I watch the<br/>\nhomeschoolers leave for ps programs,  I wonder how many will be left to<br/>\nstand in support of homeschooling freedoms when they are challenged<br/>\nfurther.<br/>\n<br/>\nNo one&#39;s snorting at anyone.  I don&#39;t see this group as just concerned<br/>\nfor themselves regarding anything.  I want things to be good for your<br/>\nkids as much as I want them to be good for mine.  After all, our kids<br/>\nwill share this world.  Because some of us have worries doesn&#39;t mean we<br/>\naren&#39;t concerned for the good of others around us.  It simply means we<br/>\nhave worries.  These are nice people here.  <br/>\n<br/>\n<br/>\nAnd I&#39;ll stop whining now.<br/>\nDeb L, who is not a snorter.</div>","specialLinks":[]},{"userId":0,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","senderId":"LFnXsaeT57oOo9MCrHinSSJhA980u2TgoCseMc4inkTPW35bB9AMFH9I-q0DwMmZyUYqKt5h4XpJeTwQUr2g5qY28armlExr6mQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] changing the course of the mainstream","postDate":"1004653280","msgId":27255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAxMTEwMTE0MTk1MC4wMWQ1ZTY2MEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PGU2LjFkOTM2MTM3LjI5MTMxYjFjQGFvbC5jb20+"},"prevInTopic":27252,"nextInTopic":27256,"prevInTime":27254,"nextInTime":27256,"topicId":27252,"numMessagesInTopic":0,"msgSnippet":"... Applause! I ve done hospital birth and homebirth, school and unschooling.  I want the option to do whichever one suits my family at the time, or anything","messageBody":"<div id=\"ygrps-yiv-1655131995\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;Not all families can unschool.  Not all moms can homebirth safely or<br/>\n&gt;confidently.  If the radicals can&#39;t help pull the middle ground further away<br/>\n&gt;from the extreme conservative side, why be radicals?   To be cool and<br/>\n&gt;different, or to change the course of the mainstream?<br/>\n<br/>\n </span></blockquote>Applause!<br/>\nI&#39;ve done hospital birth and homebirth, school and unschooling.  I want the <br/>\noption to do whichever one suits my family at the time, or anything in between.<br/>\nTia<br/>\n<br/>\nTia Leschke   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island<br/>\n**************************************************************************<br/>\nIt is the answers which separate us, the questions which unite us. - Janice <br/>\nLevy</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"rEfCG7Hdpy7TfRtiLuQsFoLj5XUYKKqFq96T1njkDMs34SD8VMx_D4B_ug46B9mmZ04tgd2C0xY5","spamInfo":{"isSpam":false,"reason":"0"},"subject":"changing the course of the mainstream","postDate":"1004650780","msgId":27252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2LjFkOTM2MTM3LjI5MTMxYjFjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":27255,"prevInTime":27251,"nextInTime":27253,"topicId":27252,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-986430377\">&lt;&lt; As the hospitals <br/>\nand professionals took on &quot;home-like&quot; settings and twisted ideas into <br/>\ntheir own, fewer home birth advocates were willing to &quot;fight the <br/>\nfight&quot;. &gt;&gt;<br/>\n<br/>\nSurely you&#39;re not saying it would have been better for home births for <br/>\nhospitals to stay as stirrup-bound and drug-requiring as they wanted to be in <br/>\n1959!!<br/>\n<br/>\nIf pitocin were mandatory, there might be more home births, but is that a <br/>\nreason to scoff at the demands of MANY birth activists for them to STOP IT <br/>\nwith their pitocin and stirrups and 48-hour-limits after water broke, etc?<br/>\n<br/>\nThey&#39;re being criticized here for responding to people&#39;s complaints!?<br/>\n<br/>\nAnd similarly, if school was criticized for same-age segregation and subject <br/>\nsegregation, but now alternative mixed-age, unit- or theme-based classrooms <br/>\nare being criticized, or alternatives that don&#39;t require the children to be <br/>\nseparated from their families all day every day are being snorted at, I <br/>\nquestion whether some of those here are really concerned for the good of <br/>\nothers around them.<br/>\n<br/>\nNot all families can unschool.  Not all moms can homebirth safely or <br/>\nconfidently.  If the radicals can&#39;t help pull the middle ground further away <br/>\nfrom the extreme conservative side, why be radicals?   To be cool and <br/>\ndifferent, or to change the course of the mainstream?<br/>\n<br/>\nSandra<br/>\n<br/>\n&quot;Everything counts.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDoddArticles\">http://expage.com/SandraDoddArticles</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDodd\">http://expage.com/SandraDodd</a></div>","specialLinks":[]}],"prevTopicId":27324,"nextTopicId":27354}}