{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Violent outbursts in a 9 year old boy","postDate":"1368121850","msgId":71449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttZ25scStna3VyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGttZ2hzOCs1NmtnQGVHcm91cHMuY29tPg=="},"prevInTopic":71447,"nextInTopic":0,"prevInTime":71448,"nextInTime":71450,"topicId":71430,"numMessagesInTopic":0,"msgSnippet":"... *********** I got stuck on the idea that in order for Ray to learn to handle group social situations he needed to be in them a lot. But what was happening","messageBody":"<div id=\"ygrps-yiv-492244364\">&quot;ehulani56&quot; &lt;robin.bentley@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I made an erroneous assumption that all kids needed lots of playmates.<br/>\n </span></blockquote>***********<br/>\n<br/>\nI got stuck on the idea that in order for Ray to learn to handle group social situations he needed to be in them a lot. But what was happening was he was getting so overwhelmed that what he was learning wasn&#39;t helpful - he learned he was out of control, a bad kid, a monster. Keeping him away from big, overwhelming situations and setting him up to succeed, rather than fail, did a lot to help him learn more skills and feel like he was in control - he wasn&#39;t stuck being the monster. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have taken to heart Sandra&#39;s saying: &quot;If your child is more important than the vision of your child, life becomes easier.&quot;  <br/>\n </span></blockquote>**************<br/>\n<br/>\nI wish I&#39;d had good advice like that from the start - poor Ray had to live through a long, slow learning process until I fumbled my way to that understanding. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"Lyla Wolfenstein &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Violent outbursts in a 9 year old boy","postDate":"1368117973","msgId":71447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBREZVMFNDRld6WnhUWE9STDdfRlNmaWhnUW9kdUN2cms0TTR0T1ByN2pCVm96Qis0Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGttZ2hzOCs1NmtnQGVHcm91cHMuY29tPg==","referencesHeader":"PDZGQTYwQTNCLTlCNjQtNDA4MS04RUM4LUI4QkVDREMzMDM2NkBTYW5kcmFkb2RkLmNvbT4JPGttZ2hzOCs1NmtnQGVHcm91cHMuY29tPg=="},"prevInTopic":71446,"nextInTopic":71449,"prevInTime":71446,"nextInTime":71448,"topicId":71430,"numMessagesInTopic":0,"msgSnippet":"i have a now 14 year old who was very much like that for years.  9 was one of the hardest years for him.  you ve gotten great advice and suggestions so far.  i","messageBody":"<div id=\"ygrps-yiv-574222545\">i have a now 14 year old who was very much like that for years.  9 was one<br/>\nof the hardest years for him.  you&#39;ve gotten great advice and suggestions<br/>\nso far.  i also wanted to add that you might want to read the book &quot;the<br/>\nexplosive child&quot; - it&#39;s not an unschooling book, but it&#39;s got really<br/>\nhelpful ideas about how to problem solve with kids who are quick to<br/>\nflare/react, and how to view their challenges as &quot;lagging skills and<br/>\nunsolved problems&quot; rather than behavior issues or being inherently<br/>\n&quot;violent&quot; etc.  the author, ross greene, describes an approach he calls<br/>\n&quot;collaborative problem solving&quot; that mirrors what i found helpful with my<br/>\nown &quot;explosive&quot; child.<br/>\n<br/>\nit&#39;s important to notice the early cues your child gives off, as to his<br/>\ntension rising/a temper flare being imminent.  sometimes it&#39;s subtle, and<br/>\nseems out of the blue, but it&#39;s really not, for the most part, in my<br/>\nexperience.<br/>\n<br/>\ni also agree with the notion of short play dates and &quot;going while the going<br/>\nis good&quot; - and pretty much everything else people suggested so far.   14-15<br/>\nseems to be a pretty magical age of transformation for especially intense,<br/>\nsensitive kids.     in my experience, the biggest issue from having<br/>\nexplosive tendencies as a younger child is that it can erode self esteem,<br/>\nwith each social failure/bad experience, and then THAT becomes the biggest<br/>\nissue as the explosivity fades away with maturation.  so, setting up for<br/>\nsuccess, staying tuned in and involved to help ensure positive experiences,<br/>\nand sometimes even a period of reclusiveness to prevent social failures<br/>\n(alone/just with family and content is better than with peers/socializing<br/>\nbut miserable).<br/>\n<br/>\nalso, i found paying attention to physical contributors was important - low<br/>\nblood sugar was a big one for my son.  frequent snacks, and ideally a high<br/>\nprotein meal, especially before a challenging social situation, made a big<br/>\ndifference<br/>\n<br/>\nlyla<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, May 9, 2013 at 9:11 AM, ehulani56 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; When my daughter was that age (and before and after), she was easily<br/>\n&gt; overwhelmed by noise, kid energy and just too much of everything. I had<br/>\n&gt; made the mistake of assuming being around a lot of kids (playgroups, park<br/>\n&gt; days, multi-age events, etc.) would be good for her. They weren&#39;t. She went<br/>\n&gt; from happy to meltdown in seconds, accompanied by lashing out at whoever<br/>\n&gt; was near her. I regret that I didn&#39;t see it earlier, that I wasn&#39;t more<br/>\n&gt; present to head off her upset. Because *I* wasn&#39;t a better partner to her,<br/>\n&gt; she got blamed for all sorts of difficulties between her and other kids.<br/>\n&gt;<br/>\n&gt; My daughter seems very sensitive to the energy and emotions of others.<br/>\n&gt; Sometimes, she&#39;s in tears with someone who&#39;s crying. Sometimes, she&#39;s<br/>\n&gt; indignant and trying to stand up for someone else. Other times, she just<br/>\n&gt; doesn&#39;t know how to deal what&#39;s swirling around her and she falls apart,<br/>\n&gt; loudly. In a group of people, this can be very challenging for everyone.<br/>\n&gt; She&#39;s also easily embarrassed, which can turn to anger as frequently as it<br/>\n&gt; turns to tears and the likelihood of that happening in a group of disparate<br/>\n&gt; kids is high. It was not ever a good idea for me to leave her on her own<br/>\n&gt; (even if I was close by, I could leave her on her own emotionally).<br/>\n&gt;<br/>\n&gt; When I finally realized that she was happier being one-on-one with a<br/>\n&gt; friend (who, as Dola&#39;s son said, &quot;gets her&quot;) and could cope better with her<br/>\n&gt; feelings in such a setting, I made that happen as often as possible. It<br/>\n&gt; wasn&#39;t perfect and still isn&#39;t; she is kind of a hair-trigger kid. BUT,<br/>\n&gt; since I could arrange the environment for her, it has given her space to<br/>\n&gt; mature more emotionally and better handle her big feelings without lashing<br/>\n&gt; out.<br/>\n&gt;<br/>\n&gt; I made an erroneous assumption that all kids needed lots of playmates. I<br/>\n&gt; also made the regrettable decision to spend time at these events with the<br/>\n&gt; moms, which made it harder for me to see her for who she really was,<br/>\n&gt; instead of the child I had expected (one that would play happily with<br/>\n&gt; friends without me). I have taken to heart Sandra&#39;s saying: &quot;If your child<br/>\n&gt; is more important than the vision of your child, life becomes easier.&quot;<br/>\n&gt;<br/>\n&gt; Robin B.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"ehulani56","from":"&quot;ehulani56&quot; &lt;robin.bentley@...&gt;","profile":"ehulani56","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Violent outbursts in a 9 year old boy","postDate":"1368115912","msgId":71446,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttZ2hzOCs1NmtnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZGQTYwQTNCLTlCNjQtNDA4MS04RUM4LUI4QkVDREMzMDM2NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71444,"nextInTopic":71447,"prevInTime":71445,"nextInTime":71447,"topicId":71430,"numMessagesInTopic":0,"msgSnippet":"When my daughter was that age (and before and after), she was easily overwhelmed by noise, kid energy and just too much of everything. I had made the mistake","messageBody":"<div id=\"ygrps-yiv-2025165270\">When my daughter was that age (and before and after), she was easily overwhelmed by noise, kid energy and just too much of everything. I had made the mistake of assuming being around a lot of kids (playgroups, park days, multi-age events, etc.) would be good for her. They weren&#39;t. She went from happy to meltdown in seconds, accompanied by lashing out at whoever was near her. I regret that I didn&#39;t see it earlier, that I wasn&#39;t more present to head off her upset. Because *I* wasn&#39;t a better partner to her, she got blamed for all sorts of difficulties between her and other kids.<br/>\n<br/>\nMy daughter seems very sensitive to the energy and emotions of others. Sometimes, she&#39;s in tears with someone who&#39;s crying. Sometimes, she&#39;s indignant and trying to stand up for someone else. Other times, she just doesn&#39;t know how to deal what&#39;s swirling around her and she falls apart, loudly. In a group of people, this can be very challenging for everyone. She&#39;s also easily embarrassed, which can turn to anger as frequently as it turns to tears and the likelihood of that happening in a group of disparate kids is high. It was not ever a good idea for me to leave her on her own (even if I was close by, I could leave her on her own emotionally).<br/>\n <br/>\nWhen I finally realized that she was happier being one-on-one with a friend (who, as Dola&#39;s son said, &quot;gets her&quot;) and could cope better with her feelings in such a setting, I made that happen as often as possible. It wasn&#39;t perfect and still isn&#39;t; she is kind of a hair-trigger kid. BUT, since I could arrange the environment for her, it has given her space to mature more emotionally and better handle her big feelings without lashing out.<br/>\n<br/>\nI made an erroneous assumption that all kids needed lots of playmates. I also made the regrettable decision to spend time at these events with the moms, which made it harder for me to see her for who she really was, instead of the child I had expected (one that would play happily with friends without me). I have taken to heart Sandra&#39;s saying: &quot;If your child is more important than the vision of your child, life becomes easier.&quot;  <br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":458624268,"authorName":"Dola Dasgupta","from":"Dola Dasgupta &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Violent outbursts in a 9 year old boy","postDate":"1368075378","msgId":71444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRTA1UktQdUIyR19lcUo5VDR6eGlnWHdMM1U1SllWMk5lYWt5TDhidGVka19xQVZOd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71441,"nextInTopic":71446,"prevInTime":71443,"nextInTime":71445,"topicId":71430,"numMessagesInTopic":0,"msgSnippet":"I like to add about my son. He is seven. His closest boy buddy is 10 years old, the son of my dear friend Hema Bhardawaj, also an unschooling mum. What I have","messageBody":"<div id=\"ygrps-yiv-625626815\">I like to add about my son. He is seven. His closest boy buddy is 10 years<br/>\nold, the son of my dear friend Hema Bhardawaj, also an unschooling mum.<br/>\n<br/>\nWhat I have observed with my son is that his greatest need is to have a<br/>\nfriend who can listen to his mind. By which I mean, his mind is very<br/>\nfertile. He is constantly observing, watching, assimilating information and<br/>\nfacts from various sources. His enthusiasm about what he is passionate<br/>\nabout is very high. And he needs friends who he can share all this with..I<br/>\nhave seen how when he himself has pushed himself to &#39;be the regular guy&#39; in<br/>\nthe block..He has come back dejected and angry. If I have pushed him so<br/>\nthat he could have more friends, he has felt the same way..and come back<br/>\nand told me..&quot;Why do you force me? See I lost my cool again?&quot;<br/>\n<br/>\nYounger kids who cannot match his enthusiasm about a subject with him, he<br/>\njust refuses to be with. Earlier I have made the mistake of seeing if kids<br/>\nhis age or younger than him who wanted to play with him could come over and<br/>\nhave play dates. But my son was visibly distressed as they could not simply<br/>\n&#39;get into his head and heart&#39;..And he could not do the same with them.<br/>\n<br/>\nHe tried often to see if he could gel with kids in the neighborhood and<br/>\nplay games that they played..like catch-catch, hide-n-seek, or cricket. He<br/>\nfound it very hard. As he could not keep running and being the &#39;den&#39;. He<br/>\ngot bored with the monotony of the games. When he tried to talk to the kids<br/>\nto recreate the games a bit. They refused and pushed him aside. He lost his<br/>\ncool and felt misunderstood.<br/>\n<br/>\nThen he refused to play with them. I honor that in him now.. I no longer<br/>\npush him to play with kids he doesn&#39;t want to. I have asked him if it is<br/>\nimportant for him to have many play mates..he said &quot;No I want buddies who<br/>\nget me.&quot;<br/>\n<br/>\nHe also has very less patience for younger kids who act &#39;babyish&#39;.<br/>\n<br/>\nHe likes the company of his sister&#39;s girlfriends. His sister is 11. He<br/>\naccompanies her to her friends&#39; places. But that is not what his sister<br/>\nwants always as she doesn&#39;t want that he tag along always!..I understand<br/>\nthat..so I talk to him. It is hard for me at times and for him.<br/>\n<br/>\nHe enjoys swimming with the girls in the neighbor hood..He loves water and<br/>\nenjoys being in the pool..even in the pool.I see he is happy mostly to play<br/>\nwith himself and water!<br/>\n<br/>\nDola<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":310848040,"authorName":"Ali Zeljo","from":"Ali Zeljo &lt;azeljo@...&gt;","profile":"azeljo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Violent outbursts in a 9 year old boy","postDate":"1368073578","msgId":71441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHpoTHF4a2MyZVpwWT1DVjgrUGo2OVRMZGFPKys5Nz1XbzNEMmZHbTVoU2ktYzRPQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDZGQTYwQTNCLTlCNjQtNDA4MS04RUM4LUI4QkVDREMzMDM2NkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDZGQTYwQTNCLTlCNjQtNDA4MS04RUM4LUI4QkVDREMzMDM2NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71437,"nextInTopic":71444,"prevInTime":71440,"nextInTime":71442,"topicId":71430,"numMessagesInTopic":0,"msgSnippet":"I know it can be super hard, but I have a violent son and I take it as my responsibility to always be there and interfere before it gets violent.  It means","messageBody":"<div id=\"ygrps-yiv-1745877289\">I know it can be super hard, but I have a violent son and I take it as my<br/>\nresponsibility to always be there and interfere before it gets violent.  It<br/>\nmeans giving up chatting time with the other moms usually, and it means<br/>\nengaging in the games typically when i&#39;m not always really feeling like it.<br/>\n but if i&#39;m there, i can help to diffuse frustration or i can remove my son<br/>\nbefore things get out of hand.<br/>\n<br/>\nali<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Violent outbursts in a 9 year old boy","postDate":"1368035562","msgId":71437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVFNTcxNDY0LUUwQzMtNDI1OC1CQTM2LTlBRTMyMEY2NjQ2NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGttZTJxMStxY3RpQGVHcm91cHMuY29tPg==","referencesHeader":"PGttZTJxMStxY3RpQGVHcm91cHMuY29tPg=="},"prevInTopic":71436,"nextInTopic":71441,"prevInTime":71436,"nextInTime":71438,"topicId":71430,"numMessagesInTopic":0,"msgSnippet":"Martial arts helped Kirby.  Karate, from when he was 10 or so. They taught him NOT to hit and hurt people.  They helped him learn that he was strong, and that","messageBody":"<div id=\"ygrps-yiv-1021958863\">Martial arts helped Kirby.  Karate, from when he was 10 or so. They taught him NOT to hit and hurt people.  They helped him learn that he was strong, and that he had a responsibility to use that strength only to defend others or himself.  <br/>\n<br/>\nWe found a very peaceful, philosophical karate school for him.  I know there are places that advertise &quot;street fighting&quot; and such less lofty ideas.  <br/>\n<br/>\nSome kids are more socially adept than others.   <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences\">http://sandradodd.com/intelligences</a> — what Howard Gardner has divided into interpersonal (reading other people and figuring out courtesies and etiquette) and intrapersonal (self-awareness, being able to read one&#39;s own signs, moods, emotions).<br/>\n<br/>\nJust in case this boy is lacking some of that or (more likely) if his physical abilities are bigger than his growing emotional maturity, it  might help to brief him on what&#39;s going to be happening and what&#39;s expected, and remind him of what you know about the other kid(s) who will be there.<br/>\n<br/>\nI used to do that when my kids were going to play.  I would brief them with whatever overall or current knowledge I had.  &quot;Please don&#39;t leave John-John out; his feelings were hurt last time.  Julie has been sick, so she might want to stay inside.&quot;  Stuff like that.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Violent outbursts in a 9 year old boy","postDate":"1368034945","msgId":71436,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttZTJxMStxY3RpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZGQTYwQTNCLTlCNjQtNDA4MS04RUM4LUI4QkVDREMzMDM2NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71430,"nextInTopic":71437,"prevInTime":71435,"nextInTime":71437,"topicId":71430,"numMessagesInTopic":0,"msgSnippet":"... If you re right there, why does he have to tell you? Are you trying to get him to talk through his thoughts or feelings? That could be counter-productive -","messageBody":"<div id=\"ygrps-yiv-2071610982\"><blockquote><span title=\"ireply\">&gt;&gt;He has a hard time telling me what happened in a fight situation. <br/>\n<br/>\n </span></blockquote>If you&#39;re right there, why does he have to tell you? Are you trying to get him to talk through his thoughts or feelings? That could be counter-productive - it was for Ray when he was younger. He couldn&#39;t explain what was going on inside him, and asking him to do so heightened the sense he had of being out of control. It helped more to stop asking, look for patterns and commonalities, and look for ways to diffuse situations while the emotions were all still smaller and more manageable. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If he plays with kids bigger and rougher and gets hurt he may loose control and maul them.<br/>\n </span></blockquote>*************<br/>\n<br/>\nAfter how long? One of the things that helped with Ray was not to leave him with friends for too long. It was kind of like he could wind Up much easier than he could wind down - so with a friend he&#39;d wind up tighter and tighter until he lost it. Having shorter play dates helped. Having friends Much older, who knew that they weren&#39;t just playing with him but also helping him keep his cool was good. For a long time Ray couldn&#39;t &quot;just play&quot; with anyone - he needed someone who could focus on him and his needs. Not a two-way friend situation in the usual sense. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It is worse if he has an altercation with someone smaller than he is. <br/>\n </span></blockquote>************<br/>\n<br/>\nBoth my kids went through stages where they absolutely couldn&#39;t play with younger kids. Ray, though, could take care of younger kids - he could do what older kids and adults did with him, and focus on the younger child&#39;s needs, but he couldn&#39;t Play with that child in that two-way friend sort of way. <br/>\n<br/>\nNowadays Ray can have normal, two-way friend sorts of relationships - somewhere in his teens he figured that out. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Violent outbursts in a 9 year old boy","postDate":"1368024733","msgId":71430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGQTYwQTNCLTlCNjQtNDA4MS04RUM4LUI4QkVDREMzMDM2NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":71436,"prevInTime":71429,"nextInTime":71431,"topicId":71430,"numMessagesInTopic":0,"msgSnippet":"This is being posted at the request of the mother.  If you do know who it is, please help us keep this anonymous.  Thank you. My nine year old son is having","messageBody":"<div id=\"ygrps-yiv-889988922\">This is being posted at the request of the mother.  If you do know who it is, please help us keep this anonymous.  Thank you.<br/>\n<br/>\nMy nine year old son is having violent outbursts with other kids. He seems to lose control of his anger. He has a hard time telling me what happened in a fight situation. In many ways he is super empathetic, like if a younger friend is not wanting to leave our house he may also cry along with him and attempt to defend him from his mother. This makes me wonder if he is just generally overwhelmed by his feelings rather than lacking the ability to tell what others are feeling. <br/>\n<br/>\nThis is not a new problem for us, but it is making it hard for him to have friends. If he plays with kids bigger and rougher and gets hurt he may loose control and maul them. It is worse if he has an altercation with someone smaller than he is. <br/>\n<br/>\nI am with him almost all of the time. I wonder if I am missing something obvious because I&#39;m so involved in it and because I feel so badly about my child being considered a threat to others.<br/>\n__________________________<br/>\n<br/>\nIF YOU QUOTE FROM THIS, please amend it so it won&#39;t show as a quote from me.  Take off the &quot;whoever wrote&quot; line, if you could, to keep things clearer in the archives.<br/>\n<br/>\nI think it&#39;s the kind of topic that can be discussed without quotes.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":71402,"nextTopicId":71445}}