{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":0,"authorName":"FreeSchool@aol.com","from":"FreeSchool@...","replyTo":"LIST","senderId":"_fFKn84JdnoAy03ff1YlxkGWH7XQhejgBK_N7YylELZX9ilD_3rI7mXVBVWidQwc2LvEt9BUUIK0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Fibro,Lupus,Chronic Fatigue,MS was Re: [Unschooling-dotcom]","postDate":"954568375","msgId":7615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LjI1YjE3ZjIuMjYxNmU4YjdAYW9sLmNvbT4="},"prevInTopic":7539,"nextInTopic":0,"prevInTime":7614,"nextInTime":7616,"topicId":7486,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/31/00 9:36:46 AM Central Standard Time, klement@interlynx.net writes: ","messageBody":"<div id=\"ygrps-yiv-558437225\">In a message dated 3/31/00 9:36:46 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:klement@...\">klement@...</a> writes:<br/>\n<br/>\n&lt;&lt;  will tell you this though ... the majority of auto immune disorder<br/>\n patients I&#39;ve had personal contact with have had to fight like hell to<br/>\n be treated decently and honestly.<br/>\n An informed patient has to tread carefully so as not to bruise doctors&#39;<br/>\n egos and get the treatment they deserve!!!!!! &gt;&gt;<br/>\n<br/>\nBuzz,<br/>\n    I agree, that is why I have given up for the time being!  The last time I <br/>\nwent to see a &quot;specialist&quot; that my family doctor referred me to, he gave me <br/>\nall of 10 minutes of his time.  He said to me&quot;Well, if I just looked at your <br/>\nhistory, I would say it was MS.<br/>\nHowever, the neurologist (the one that was a jerk!) said that you don&#39;t.  <br/>\nTherefore, I don&#39;t see any reason to have an MRI, because you don&#39;t have MS.  <br/>\nIt worries me that you have _______ with this, as this is usually indicative <br/>\nof MS.  But once again, I just don&#39;t think it is because the neurologist said <br/>\nthat you don&#39;t have it.  I think you should start looking in another <br/>\ndirection.  I can&#39;t help you.&quot;  That was the last straw for me.  Basically, <br/>\nhe took one persons word (who believe me was such a jerk, that I would never <br/>\nwant to mess with her again) and refused to even examine me.  It didn&#39;t <br/>\nmatter that family went with me and tried to tell him how I am really sick, <br/>\nhe just didn&#39;t want to take the time.  If only I could see someone without <br/>\ntaking the records from that one doctor, however, they won&#39;t ever see me <br/>\nunless I forward everything!  That one doctor is really hurting my case.  I <br/>\nneed to start off fresh, but it just won&#39;t happen.  I am so tired of beating <br/>\nmy head against a brick wall!  Well, sorry to go off like that, but this <br/>\nsubject is very touching to me.  Right now I am furious at doctors!<br/>\nTammy</div>","specialLinks":[]},{"userId":0,"authorName":"FreeSchool@aol.com","from":"FreeSchool@...","replyTo":"LIST","senderId":"2LKg86IRArzA3VEPmUhT_vNke4Z8L2F9Jt70Xgrn9pSjw932iFr7T2HgRuhySIPLy_FALAFF21bd","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Fibro,Lupus,Chronic Fatigue,MS was Re: [Unschooling-dotcom]","postDate":"954475170","msgId":7539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyLjJiYWI2NGYuMjYxNTdjYTJAYW9sLmNvbT4="},"prevInTopic":7490,"nextInTopic":7615,"prevInTime":7538,"nextInTime":7540,"topicId":7486,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/30/00 6:30:53 AM Central Standard Time, klement@interlynx.net writes: ","messageBody":"<div id=\"ygrps-yiv-2139197598\">In a message dated 3/30/00 6:30:53 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:klement@...\">klement@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\n The problem with most neurologists is that MS is not their<br/>\n specialty.Very few Neuros are up to date on MS.....there is no money to<br/>\n be made treating an MS patient.Drug companies put little effort into<br/>\n cure research because there is toooo much money to be made on treatment<br/>\n drugs.<br/>\n <br/>\n It&#39;s pretty much a health *maintenance* diseases like CFS or Arthritis.<br/>\n <br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I found this to be very curious.  When I first became ill in 1993, I was very <br/>\nweak and had trouble even washing off the kitchen table.  After weeks of <br/>\nfeeling this ill, I went to see my family doctor.  He thought that I had a <br/>\nbone spur in my shoulder so he sent me to a neurosurgeon.  The neurosurgeon <br/>\ndid and MRI and then told me that I had MS.  He pointed out &quot;plaques&quot; on the <br/>\nMRI and said that I would have to go see a neurologist, since his specialty <br/>\nwas surgery.  Well, it took weeks to get my appointment, and by the time I <br/>\ndid, I was feeling almost back to normal (except for the numbness and <br/>\ntingling in my arms).  The neurologist refused to take the neurosurgeons word <br/>\nfor it and said that I had diagnosed myself!  He said that he could see <br/>\nnothing wrong with me and that I was healthy as a horse.  He did say that my <br/>\nblood pressure was extremely, extremely low (which probably, according to <br/>\nhim, cause the dizziness, weakness and other symptoms) so he said I should go <br/>\nhome and start eating alot of salt!   Well, I have tried (since new symptoms <br/>\nhave come and gone in the last few years---vision, problems with my legs, <br/>\npain and many others that I would really rather not go into) to see other <br/>\nneurologists.  They always refuse to do any more MRIs or any other tests, and <br/>\ninstead hinted that all of this is in my head.  However, with all the pain I <br/>\nhad (and some other symptoms that cannot be faked), I knew this wasn&#39;t so.  <br/>\nFinally a reumatologist said that since my killer T-cells were extremely low <br/>\nand I had all the &quot;pain points&quot; that he thought I had CFIDS and Fibromyalgia. <br/>\n That has become my &quot;official&quot; diagnosis, even though a couple of my symptoms <br/>\ndon&#39;t match the criteria---and basically has my doctor very concerned.<br/>\nAnyway, I have tried everything on my own, change in diet, natural medicine <br/>\nand herbs, but nothing has helped.  Your info on the MRIs has been the first <br/>\nI heard.  I have been told that my first MRI was &quot;nonconclusive&quot; (they said <br/>\nthat they could see &quot;something&quot; but weren&#39;t convinced that is was plaques <br/>\nlike the neurosurgeon said) and that they could see no reason for another <br/>\nMRI, even though it has been a few years. They also said that since I didn&#39;t <br/>\nhave a conslusive MRI that I didn&#39;t have MS and there was no need to be <br/>\nretested.   Therefore, I grasped at the diagnosis of CFIDS and <br/>\nfibromyalgia----at least then I have a diagnosis!!-----and I have quit going <br/>\nto doctors for a diagnosis.  Now the only doctor that I see is my family <br/>\ndoctor---who I like very much-----and he treats me for the pain and other <br/>\nsymtoms.  I figure that if it is something like MS, I will have to wait until <br/>\nit is so obvious that it hits them over the head!  In the meantime, I will <br/>\njust try to help myself as much as possible!<br/>\nTammy</div>","specialLinks":[]},{"userId":0,"authorName":"HSMOTGO@aol.com","from":"HSMOTGO@...","replyTo":"LIST","senderId":"ehSwdjrgJsCDvO5XemDa40kecoge6uDpdsX97cZ2zYGqyRsKR4w35m3fRNgUXKToS1dpsyXX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Fibro,Lupus,Chronic Fatigue,MS was Re: [Unschooling-dotcom]","postDate":"954429857","msgId":7490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4LjI2NmZjNzkuMjYxNGNiYTFAYW9sLmNvbT4="},"prevInTopic":7486,"nextInTopic":7539,"prevInTime":7489,"nextInTime":7491,"topicId":7486,"numMessagesInTopic":0,"msgSnippet":"Buzz, No you didn t offend me.  I was just saying where the info that I gave came from.  : )  Should have put that smiley face there before so you would know I","messageBody":"<div id=\"ygrps-yiv-2005237044\">Buzz,<br/>\nNo you didn&#39;t offend me.  I was just saying where the info that I gave came <br/>\nfrom.  : )  Should have put that smiley face there before so you would know I <br/>\nwas replying in a : ( face! LOL.<br/>\nThanks for the info.  My sister has Chronic Fatigue with Fibromyalgia.  This <br/>\nneuro guy was trying to convince her she had MS, not CF. Maybe he likes those <br/>\nletters better!  Anyway, she has let him slide.  He put her thru all kinds of <br/>\ntests which she has already had, then told her there was no reason one of his <br/>\npatients couldn&#39;t live alone, and put her in physical therapy and rehab.  <br/>\nNow, with the problems she has, she does good to be able to have two good <br/>\ndays a week to do anything, the rest of the time she can&#39;t walk, or she can&#39;t <br/>\nuse her hands, or she is ill and can&#39;t get out of bed.  So, of course, she <br/>\ngot kicked out of therapy cause she had to cancel appointments.  This was no <br/>\nbig deal, as they were forcing her to do things she just couldn&#39;t do without <br/>\na great deal of pain, or just not at all.  When she started telling me this, <br/>\nwe live in different parts of the state, or I would have put an immediate <br/>\nhalt to all this rubbish, I told her to dump this guy stat.  He obviously <br/>\ndoesn&#39;t believe that CF exists, or he wouldn&#39;t be doing this.  So thats part <br/>\nof sad tale.  She is in a great support group on the web, in fact, I think <br/>\nshe does an information news letter for her group.  This is the really only <br/>\ntype of group she can be in, as it dosen&#39;t matter if she misses a meeting <br/>\ncause she can&#39;t get a ride there or can&#39;t walk that night, or whatever, she <br/>\ncan just go answer her email!<br/>\nThanks for your time, and I wish you good luck.<br/>\nTeresa</div>","specialLinks":[]},{"userId":0,"authorName":"monkeycoop@aol.com","from":"monkeycoop@...","replyTo":"LIST","senderId":"8cb_hVt12jIVVxzEArRhN7ny44LEzmAnfI_KCFPbEjN1NUxu6oIVE5OFxpG2Nul0k_RCQac7pxEL","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Fibro,Lupus,Chronic Fatigue,MS was Re: [Unschooling-dotcom]","postDate":"954426419","msgId":7486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjLjFkODUxYjUuMjYxNGJlMzNAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":7490,"prevInTime":7485,"nextInTime":7487,"topicId":7486,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/30/00 6:30:53 AM Central Standard Time, klement@interlynx.net writes: ","messageBody":"<div id=\"ygrps-yiv-1554116889\">In a message dated 3/30/00 6:30:53 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:klement@...\">klement@...</a> writes:<br/>\n<br/>\n&lt;&lt; I&#39;ve heard<br/>\n accounts of the same balderdash being spewed from neurologists to their<br/>\n patients, from many many MS sufferers on the support newsgroups &gt;&gt;<br/>\nBuzz,<br/>\nI have to add my 2 cents worth here.  I back up every word you&#39;ve said about <br/>\nthis.  It is exactly the same for lupus.  It&#39;s known as the great imitator <br/>\nbecause it can look like so many other things.  From the time symptoms appear <br/>\nuntil lupus is diagnosed is an average of 7 years.  Patients are often made <br/>\nto feel that it&#39;s all in their heads.  My lupus involves my central nervous <br/>\nsystem and so it almost perfectly mimics MS.  I went through the wringer with <br/>\ndoctors looking my MRIs over and telling me that there was nothing wrong with <br/>\nme.  They said that my loss of vision (actually optic neuritis, of course) <br/>\nand my numbness and weakness were just manifestations of hysteria.  I began <br/>\nto feel terrible about myself and to question my own sanity.  Turns out I was <br/>\nright and they were wrong. (blowing big raspberries here...)<br/>\n<br/>\nAnyone who is searching for a diagnosis needs to know that they should RUN, <br/>\nnot walk from these patronizing, consdescending creeps.  <br/>\n<br/>\n<br/>\n<br/>\n*** KiM ***<br/>\nruns with scissors</div>","specialLinks":[]}],"prevTopicId":7573,"nextTopicId":7610}}