{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":25,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442368812","msgId":76203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4RjhFRUI4LUEwQzQtNEM5QS05M0MwLUM0NDM1OThCNzgxQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDgzMUZFOTAzLTM5M0UtNEMxQy1BMkUyLUZDNzEyODJBN0E4OUBiaWdwb25kLmNvbT4=","referencesHeader":"PDZBOTFDMkM1LTM1QzQtNERGMi04Q0Q3LUVCQ0E2QkI3QjMwMUBpY2xvdWQuY29tPiA8NjQ5QTI4MDMtRUY3Ny00QkNDLUJFMDctMDkxRkFBQ0Q2MzlFQFNhbmRyYWRvZGQuY29tPiA8ODEwMzk0QTAtOEY0OC00Mjg5LTkwMDEtMEEzNDhGOUM1RTE5QHZlcml6b24ubmV0PiA8ODMxRkU5MDMtMzkzRS00QzFDLUEyRTItRkM3MTI4MkE3QTg5QGJpZ3BvbmQuY29tPg=="},"prevInTopic":76202,"nextInTopic":0,"prevInTime":76202,"nextInTime":76204,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"Debbie, this is beautiful, and it is to the point: -=-A child of someone new to unschooling, wanting instruction , conjures up a sad image for me of a child","messageBody":"<div id=\"ygrps-yiv-1763904640\">Debbie, this is beautiful, and it is to the point:<br/>\n<br/>\n-=-A child of someone new to unschooling, &quot;wanting instruction&quot;, conjures up a sad image for me of a child who has few options, but who is nonetheless reaching out for more. A child who will say yes to crumbs, when plentiful yummy food is not being offered. -=-<br/>\n<br/>\nI don&#39;t believe the original poster is going to say whether she has a child or not.  TCS&#39;s philosophy prevents it, as it&#39;s theoretical and actual experiences and outcomes aren&#39;t shared. I re-read the original post, and it wasn&#39;t a request for needed information.  It was someone trying to get us to affirm something she might have claimed elsewhere, based on a poor understanding of unschooling.  I think that&#39;s why our links weren&#39;t read and suggestions were batted away—because she already knew what she wanted.<br/>\n<br/>\nThere was some side discussion of who and why and what was going on in that thread, and one person wrote this:<br/>\n<br/>\n<br/>\n-=-She just wants to stir something up. But I wish these tcs people would just be honest and say &#39;I think your ideas have flaws and I want to draw you into a discussion about them. Not because I want to be a better parent but because I paternalistically want to save you and your children from your flawed thinking&#39;, then it would be easier to say &#39;no, thank you&#39; and remove them from the group.-=-<br/>\n<br/>\nMakes sense.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":459359078,"authorName":"D. Regan","from":"&quot;D. Regan&quot; &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442265910","msgId":76202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzMUZFOTAzLTM5M0UtNEMxQy1BMkUyLUZDNzEyODJBN0E4OUBiaWdwb25kLmNvbT4=","inReplyToHeader":"PDgxMDM5NEEwLThGNDgtNDI4OS05MDAxLTBBMzQ4RjlDNUUxOUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDZBOTFDMkM1LTM1QzQtNERGMi04Q0Q3LUVCQ0E2QkI3QjMwMUBpY2xvdWQuY29tPiA8NjQ5QTI4MDMtRUY3Ny00QkNDLUJFMDctMDkxRkFBQ0Q2MzlFQFNhbmRyYWRvZGQuY29tPiA8ODEwMzk0QTAtOEY0OC00Mjg5LTkwMDEtMEEzNDhGOUM1RTE5QHZlcml6b24ubmV0Pg=="},"prevInTopic":76201,"nextInTopic":76203,"prevInTime":76201,"nextInTime":76203,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"The questions and comments presented by the original poster, don t have much meaning in the context of unschooling.  Unwanted vs wanted instruction.  Academics","messageBody":"<div id=\"ygrps-yiv-1022315414\">The questions and comments presented by the original poster, don&#39;t have much meaning in the context of unschooling.  Unwanted vs wanted instruction.  Academics vs not academics. Pressure vs no pressure.   <br/>\n<br/>\nFor unschooling families those dimensions have melted away, and now there is fun, joy, passion, curiosity, connection, opportunity, peace, enthusiasm...  There may be classes in amongst it all; but they are only chosen from among a rich array of happy opportunities and options.<br/>\n<br/>\nA child of someone new to unschooling, &quot;wanting instruction&quot;, conjures up a sad image for me of a child who has few options, but who is nonetheless reaching out for more.  A child who will say yes to crumbs, when plentiful yummy food is not being offered.  <br/>\n<br/>\nDebbie</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442263493","msgId":76201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyNjFFQTQzLUY2MkQtNEIzQy1CRTUxLTJDQzIwNzMyQTk3QUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDgxMDM5NEEwLThGNDgtNDI4OS05MDAxLTBBMzQ4RjlDNUUxOUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDZBOTFDMkM1LTM1QzQtNERGMi04Q0Q3LUVCQ0E2QkI3QjMwMUBpY2xvdWQuY29tPiA8NjQ5QTI4MDMtRUY3Ny00QkNDLUJFMDctMDkxRkFBQ0Q2MzlFQFNhbmRyYWRvZGQuY29tPiA8ODEwMzk0QTAtOEY0OC00Mjg5LTkwMDEtMEEzNDhGOUM1RTE5QHZlcml6b24ubmV0Pg=="},"prevInTopic":76200,"nextInTopic":76202,"prevInTime":76200,"nextInTime":76202,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"... **** My questions are of a theoretical interest regarding unschooling philosophy and how I sometimes see it play out IRL. *** This is the heart of the","messageBody":"<div id=\"ygrps-yiv-74656586\"><blockquote><span title=\"ireply\">&gt; On Sep 14, 2015, at 3:28 PM, Joyce Fetteroll <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a> [AlwaysLearning] &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; wrote:<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>**** My questions are of a theoretical interest regarding<br/>\nunschooling philosophy and how I sometimes see it play out IRL. ***<br/>\n<br/>\nThis is the heart of the difficulty of the discussion.<br/>\n<br/>\nYou&#39;re asking us to speculate about the motives of people once removed from you. You&#39;re telling us what you see then asking us if we agree with your guess at the reason for their actions.<br/>\n<br/>\nFairly often here it&#39;s possible to guess what someone&#39;s roadblock is by how they&#39;re writing. *IF* they want the unschooling discussed here, members here might be able to walk them through from where they are to where they want to be.<br/>\n<br/>\nBut there&#39;s no way to tell where these people you&#39;ve seen are getting their ideas about unschooling. We can&#39;t tell what their goals are for unschooling. They may call themselves unschoolers but may have a different meaning.<br/>\n<br/>\n*** if you consider the kid in my earlier scenario:<br/>\n(The child can drop the class at any time ...   the child decides <br/>\nto *only* go to 1 class or half a class to see what it’s like, and <br/>\nthat would be fine. ***<br/>\n<br/>\nStrawmen aren&#39;t useful for discussion. Strawmen can be twisted to fit the argument. You&#39;re making up what&#39;s inside this mom and child&#39;s heads. <br/>\n<br/>\nYes, there are unschooled children who take classes for fun.<br/>\n<br/>\nBut you&#39;re trying to expand real unschooling children with real unschooling moms into a general rule. I&#39;m not comfortable doing that. My purpose here is to help people understand so **THEY** can decide for themselves whether their child taking a class is part of an environment where natural learning can flourish.<br/>\n<br/>\nI have no interest in dissecting your imaginary friends.<br/>\n<br/>\n*** Do you see how even though the information on the outside is <br/>\nbeing presented in a different form, fundamentally the child is the <br/>\none still choosing what he wants to learn on the inside? ***<br/>\n<br/>\nAnd? That distinction might be useful for creating a rule, but it isn&#39;t useful for helping a real mom who hasn&#39;t deschooled but doesn&#39;t realize it yet.<br/>\n<br/>\nIf you have been involved in TCS, then I&#39;m guessing you&#39;re used to discussing ideas this way. I don&#39;t find it useful for helping real unschoolers with real tangles in their thoughts about what will help them unschool.<br/>\n<br/>\n**** But some of them reject instruction from a person (such as a teacher) for some reason. ***<br/>\n<br/>\nUnless they come here and want the type of unschooling discussed here, we can&#39;t untangle their thoughts.<br/>\n<br/>\nAnd maybe their thoughts are just fine for what they want. We can&#39;t know.<br/>\n<br/>\n*** what is the world is wrong with taking a fun science class <br/>\nor a math class for a hour and then returning home to play video games ***<br/>\n<br/>\nIf your unschooling parents and child are as perfect as your straw men then nothing.<br/>\n<br/>\nBut either these parents don&#39;t match your straw men in perfection or they have reasons other than unschooling (as discussed here) for their choices.<br/>\n<br/>\n*** And I think there are some “unschoolers” (that’s <br/>\nwhat they call themselves), but some people end up <br/>\nrejecting lots of good opportunities for their kids in the <br/>\nform of classes or other instruction-based format…<br/>\nwhich the kids themselves could very well WANT to take. ***<br/>\n<br/>\nThe word unschooling gets used for lots of different approaches to replacing school. The ideas may bear little resemblance to each other. <br/>\n<br/>\nI don&#39;t know where these people -- that you *think* exist -- got their ideas. I don&#39;t know that they want what is discussed here. It&#39;s unfortunate if their kids want classes the parents aren&#39;t letting them.<br/>\n<br/>\nBut it&#39;s not a good use of time to help people who haven&#39;t asked for help. Or help you understand these straw men.<br/>\n<br/>\n*** There’s another group I’ve noticed which is sort <br/>\nof the opposite. They basically breathe a huge sigh <br/>\nof relief if their child shows some interest in academic <br/>\nstuff. They even like to brag about it sometimes. ***<br/>\n<br/>\nThose I&#39;m familiar with. Either they haven&#39;t deschooled yet or they don&#39;t want to. <br/>\n<br/>\nThere are, as Sandra pointed out two days ago, on Facebook parents who define unschooling as not doing school and not doing curriculum.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://www.facebook.com/groups/303347574750/permalink/10153282913069751/\">https://www.facebook.com/groups/303347574750/permalink/10153282913069751/</a><br/>\n<br/>\nSome (so called) unschoolers just want to do what they feel is best for their family. They use the word unschooling for it. <br/>\n<br/>\nIt&#39;s unfortunate the word unschooling got reused to mean other things. There&#39;s no way of knowing whether they want what we discuss here, are confused by imperfect explanations of unschooling, or they want something else.<br/>\n<br/>\n*** But some people seem weird about classes or instruction ***<br/>\n<br/>\nThey aren&#39;t here. They aren&#39;t asking for our help. It&#39;s unfortunate if they want the unschooling discussed here but have gotten bad advice. But if they don&#39;t, they don&#39;t want our concern.<br/>\n<br/>\nThere are so many people who *have* managed to find their way here or to Radical Unschooling Info on Facebook. They&#39;re the ones worth spending time helping.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442258935","msgId":76200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxMDM5NEEwLThGNDgtNDI4OS05MDAxLTBBMzQ4RjlDNUUxOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDY0OUEyODAzLUVGNzctNEJDQy1CRTA3LTA5MUZBQUNENjM5RUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDZBOTFDMkM1LTM1QzQtNERGMi04Q0Q3LUVCQ0E2QkI3QjMwMUBpY2xvdWQuY29tPiA8NjQ5QTI4MDMtRUY3Ny00QkNDLUJFMDctMDkxRkFBQ0Q2MzlFQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":76199,"nextInTopic":76201,"prevInTime":76199,"nextInTime":76201,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"Erin s post isn t formatting properly at Yahoo. I ve pulled out the meat of her reply, leaving behind the way too long quoted parts from my email. If anyone","messageBody":"<div id=\"ygrps-yiv-734616567\">Erin&#39;s post isn&#39;t formatting properly at Yahoo. I&#39;ve pulled out the meat of her reply, leaving behind the way too long quoted parts from my email.<br/>\n<br/>\nIf anyone wants to see her original, contact me off list and I can forward it.<br/>\n<br/>\nJoyce<br/>\nFrom here on down is Erin.<br/>\n==============================================================<br/>\n<br/>\nErin: <br/>\n********************************<br/>\nI’m not asking for approval.  My questions are of a theoretical interest regarding unschooling philosophy and how I sometimes see it play out IRL. <br/>\n********************************<br/>\n<br/>\nErin: <br/>\n********************************<br/>\nif you consider the kid in my earlier scenario:<br/>\n<br/>\n(The child can drop the class at any time. There is no pressure to continue or even take the class.  And I’m not talking about scenarios where parents fool themselves about thinking there is no pressure on the child — when really the mom is just lying to herself about that.  The parent could even pay for the class ahead of time and the child decides to *only* go to 1 class or half a class to see what it’s like, and that would be fine.  This is all discussed in advance and child understands all of this.  The child has never been to school and has been naturally learning all of his life.)<br/>\n<br/>\nDo you see how even though the information on the outside is being presented in a different form, fundamentally the child is the one still choosing what he wants to learn on the inside?<br/>\n<br/>\nThat’s the fundamental similarity I was referring to.  When you think about how learning actually happens - the connections being made - in someone’s mind. <br/>\n********************************<br/>\n<br/>\nErin: <br/>\n********************************<br/>\nThe reason for my chosen comparison is because I’ve gotten the impression that some unschoolers are “ok” with a child reading books or going online to learn stuff.  But some of them reject instruction from a person (such as a teacher) for some reason.<br/>\n<br/>\nThat didn’t make any sense to me, because again imagining the child in my example above, if the child really wants to be there and can leave if they want and there is no pressure whatsoever, then what is the world is wrong with taking a fun science class or a math class for a hour and then returning home to play video games, watch Youtube, and play with toys the rest of the day.  And then perhaps doing that for 1 month and then not being interested in taking another class for 3 years.  No problem.  Just keep finding the best way for the child to explore their interests.<br/>\n<br/>\nIt seems obvious to me that this should be fine, but again some unschoolers seem to want to reject classes (even in the scenario above).<br/>\n<br/>\nAre you familiar with these unschoolers?  But anyways, I wanted to ask those who understand radical unschooling very well what they think about that.<br/>\n<br/>\nAnd also, I wonder if sometimes these “unschoolers&quot; (who are NOT actually following their child’s interests) misinterpret the advice given on unschooling lists.  I don’t know whether this is happening or not.<br/>\n<br/>\nPerhaps, they are stuck in rebellion mode a bit and then end up with a bias for anything academic or instruction related to academics?<br/>\n<br/>\nDo you think there is a chance something like that could be happening?<br/>\n********************************<br/>\n<br/>\nErin: <br/>\n********************************<br/>\nI think that if a person understands *how learning happens* in a fundamental way, then they will know that there is a big, massive difference between unwanted and wanted instruction.  So for such a person, hammering home that distinction could be unnecessary.<br/>\n<br/>\nHowever, lots of people do not understand learning.  At all.  And largely in most situations where kids take classes or have teachers, it IS awful.  Really bad and coercive and it hurts them terribly.  And I’m not even talking much about the parents, who are even more to blame than the teachers.<br/>\n<br/>\nso unschoolers are right to say:  No unwanted instruction.  No forced “learning” (which isn’t even learning).  Learn thru living life.  There’s so much super awesome stuff to be learned just by exploring interests and living life.  Pretend school and all those classes don’t exist.  They are bad.<br/>\n<br/>\nAnd I think there are some “unschoolers” (that’s what they call themselves), but some people end up rejecting lots of good opportunities for their kids in the form of classes or other instruction-based format…which the kids themselves could very well WANT to take.<br/>\n<br/>\nBecause I think there is a bias there.<br/>\n<br/>\nThere’s another group I’ve noticed which is sort of the opposite.  They basically breathe a huge sigh of relief if their child shows some interest in academic stuff.  They even like to brag about it sometimes.<br/>\n<br/>\nBut anyways, I was mainly curious about this other sect of people and was curious about where they might be learning some of the mistaken ideas they seem to hold.<br/>\n********************************<br/>\n<br/>\n<br/>\nErin: <br/>\n********************************<br/>\nincluding math classes.  And this is an area where again some people seem opposed to the idea of higher math (**even for a child who genuinely wants that**).<br/>\n<br/>\nAgain, i wonder if because so many people think they need to try to teach at least some math, then the message coming from unschoolers is:  No - don’t force math.  Stop.  Math is everywhere.  And useful for lots of daily things in your life.  You can learn lots of it just by living life.<br/>\n<br/>\nAnd then ppl misinterpret it to somehow end up ANTI-higher math (even for a kid who wants that and loves numbers and loves exploring the relationships between numbers).<br/>\n********************************<br/>\n<br/>\nErin: <br/>\n********************************<br/>\nBut some people seem weird about classes or instruction - especially those taught by a teacher.  I think they let that bias override the idea that they are supposed to help the child pursue his interests.<br/>\n<br/>\nUnlike in school or school-at-home homeschooling, classes and instruction and teachers should not be given a higher status.  Not at all.  But they also should NOT be given low status either.  It needs to be about helping the child *in the way he WANTS to be helped* pursue what is interesting to him right now.  This may be YouTube, this may be video games, this may be Legos, this may be an audiobook, this may be a trip somewhere, or this may be a class with a teacher.<br/>\n<br/>\nThis last one is not like a second-class citizen.  There should be no ranking or comparing.<br/>\n<br/>\nIt all should come down to what the child chooses is best for him to pursue right now (and to the extent it is best).  e.g.  Maybe the class ended being a mistake and so the kid doesn’t want to go anymore or wants to leave after 20 minutes.  Or the book is boring and so the kid stops reading it.  <br/>\n<br/>\nBut prima facie, if the child wants to and is choosing the class with the teacher, then that is what he values doing right now.  The parent’s bias should not negatively affect that.<br/>\n<br/>\nI don’t think it always plays out this way IRL with ppl who consider themselves unschoolers.<br/>\n<br/>\n(again - in my scenerio, I’m talking about a child who genuinely in a no-presure way WANTS to be there)<br/>\n********************************</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442254722","msgId":76199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0OUEyODAzLUVGNzctNEJDQy1CRTA3LTA5MUZBQUNENjM5RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDZBOTFDMkM1LTM1QzQtNERGMi04Q0Q3LUVCQ0E2QkI3QjMwMUBpY2xvdWQuY29tPg==","referencesHeader":"PDZBOTFDMkM1LTM1QzQtNERGMi04Q0Q3LUVCQ0E2QkI3QjMwMUBpY2xvdWQuY29tPg=="},"prevInTopic":76198,"nextInTopic":76200,"prevInTime":76198,"nextInTime":76200,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"-=- Are you saying it doesn t matter sounds shrill. I could be wrong. It sounds accusatory. Perhaps it wasn t intended that way. -=-Oh, no. Not at all. The","messageBody":"<div id=\"ygrps-yiv-660728354\">-=-&quot;Are you saying it doesn&#39;t matter&quot; sounds shrill. I could be wrong. It sounds accusatory. Perhaps it wasn&#39;t intended that way.<br/>\n<br/>\n-=-Oh, no. Not at all. The very next section which I wrote and which you didn’t quote is actually my guess as to how many unschoolers look at it, including the poster.-=-<br/>\n<br/>\nAnd I&#39;m asking you to STOP guessing, STOP writing things you don&#39;t know.<br/>\nI&#39;m asking you to stop posting noise noise noise and stop.<br/>\nStop and read the links, slowly and thoughtfully.<br/>\nSlow way, way down and really, thoughtfully read what people are writing to you.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442254705","msgId":76198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGN0IwMDBBLTc5MDMtNEFFOC1BNUIwLUM2MDA2Rjk2QTFGNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDYwNzYwMzg4Ni43NzQ5MS4xNDQyMjQ5NDIxNTM0LkphdmFNYWlsLm9wZW4teGNoYW5nZUBveGJlMS50Yi51a21haWwuaXNzLmFzOTE0My5uZXQ+","referencesHeader":"PEVBMjA1MzY1LTRGMUQtNDFBQy1CRjczLTRBOEI1OTNBRUUwNEBpY2xvdWQuY29tPiA8NjA3NjAzODg2Ljc3NDkxLjE0NDIyNDk0MjE1MzQuSmF2YU1haWwub3Blbi14Y2hhbmdlQG94YmUxLnRiLnVrbWFpbC5pc3MuYXM5MTQzLm5ldD4="},"prevInTopic":76196,"nextInTopic":76199,"prevInTime":76196,"nextInTime":76199,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"Erin Minter, you ve sent again what was already approved this morning. Because it was addressed to Joyce Fetteroll, I m going to let her decide whether to let","messageBody":"<div id=\"ygrps-yiv-1519525072\">Erin Minter, you&#39;ve sent again what was already approved this morning.<br/>\n<br/>\nBecause it was addressed to Joyce Fetteroll, I&#39;m going to let her decide whether to let it through to the group or not, or just see it as personal correspondence and not approve it (again).  If it&#39;s approved, and the first one shakes loose, it will be here twice, in thousands of mailboxes twice, and in the archive, twice.  <br/>\n<br/>\nBecause you haven&#39;t told us your child&#39;s age or how long you&#39;ve been unschooling, I went to see if I could find out.<br/>\nThe address you&#39;ve used for this group is found nowhere else but on a Taking Children Seriously discussion.  That philosophy is incompatible with our discussion.  If you won&#39;t tell us whether you have a child, and if you don&#39;t want to ask a question that actually applies to your own unschooling family, then you are trying to use this group for something it was not created to do.<br/>\n<br/>\nAre you an unschooler?<br/>\nHow long?<br/>\nHow old is your child?<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":279436458,"authorName":"kirkpatrick clare","from":"kirkpatrick clare &lt;clare.kirkpatrick@...&gt;","profile":"clarekirkp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442249421","msgId":76195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwNzYwMzg4Ni43NzQ5MS4xNDQyMjQ5NDIxNTM0LkphdmFNYWlsLm9wZW4teGNoYW5nZUBveGJlMS50Yi51a21haWwuaXNzLmFzOTE0My5uZXQ+","inReplyToHeader":"PEVBMjA1MzY1LTRGMUQtNDFBQy1CRjczLTRBOEI1OTNBRUUwNEBpY2xvdWQuY29tPg==","referencesHeader":"PEVBMjA1MzY1LTRGMUQtNDFBQy1CRjczLTRBOEI1OTNBRUUwNEBpY2xvdWQuY29tPg=="},"prevInTopic":76193,"nextInTopic":76196,"prevInTime":76194,"nextInTime":76196,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"-==-So if your child was in a class where there was instruction, would it matter at all to you if they genuinely WANTED to be there or not? Are you saying it ","messageBody":"<div id=\"ygrps-yiv-1427439937\"><html><head>\n    \n \n </head> \n \n  <div id=\"ygrps-yiv-1427439937ygrp-mlmsg\" style=\"\">\n   <div id=\"ygrps-yiv-1427439937ygrp-msg\">\n    <div id=\"ygrps-yiv-1427439937ygrp-text\">\n     <p>-==-So if your child was in a class where there was instruction, would it matter at all to you if they genuinely WANTED to be there or not? Are you saying it doesn&#8217;t matter?-==-</p>\n    </div>\n   </div>\n  </div>\n  <p>I&#39;m not sure how you&#39;ve surmised this from my response to you. If my child didn&#39;t want to be there, then they wouldn&#39;t be there because there would be no point. You can&#39;t learn well under duress anyway.</p>\n  <p>-==-(like the question sort of takes care of itself once you understand supporting a child&#8217;s interests)?-==-</p>\n  <p><br />That&#39;s more what I mean, yes.</p>\n  <p>-==-&#34;&#62; Instead the question should be &#34;is this thing (playing a video game, studying to gain a qualification, lying on the sofa daydreaming...) serving my child in terms of deep happiness? Is this thing strengthening or damaging my relationship with my child?&#160;</p>\n  <div id=\"ygrps-yiv-1427439937ygrp-mlmsg\" style=\"\">\n   <div id=\"ygrps-yiv-1427439937ygrp-msg\">\n    <div id=\"ygrps-yiv-1427439937ygrp-text\">\n     <p> <br /> Well, if a child doesn&#8217;t WANT to be there, that&#8217;s no good for happiness. And if you are in any way pressuring, forcing, manipulating them to be there when they don&#8217;t WANT to be there, that&#8217;s no good for the relationship.<br /> <br /> do you think the distinction I&#8217;m talking about is built into the way you think of things?-==-<br /><br />Again, I&#39;m not really sure what you&#39;re saying here. If my child doesn&#39;t want to be there, then they wouldn&#39;t be there. I don&#39;t think I&#39;ve suggested anywhere that parents should pressure, force or manipulate them to be anywhere - where have you got that idea from?<br /> <br />-==-some people who call themselves unschoolers would try to put her off. Maybe in a subtle way, using pressure. Maybe not so subtle. They are biased against academics and instruction related to academics.<br /> <br />do you know why they would be like that?-==-<br /><br />I have no idea because I am not them. I&#39;m not sure what you are hoping to gain from this conversation - it seems a little leading.<br /> <br /><br />-==-But right now, I&#8217;m curious about this other group.-==-<br /><br />Why? Why not ask them rather than asking people who don&#39;t think those things?<br /> <br />-==-Do you think I think that kids should just learn things in order to accumulate a bunch of stuff in their minds which is disconnected from their IRL, right now problems / projects / interests?-==-<br /> <br />I have no idea what you think, sorry.<br /></p>\n    </div>\n     \n   \n  <p><br />&#160;</p>\n  <blockquote><span title=\"qreply\"> <blockquote type=\"cite\">\n   \n  </blockquote>\n  <p><br />&#160;</p>\n \n</span></blockquote></div></div></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442249277","msgId":76193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDNENFRTc2LTBFQTgtNDJBMC04REE0LUQxOUNBRDhENTY1RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDZBOTFDMkM1LTM1QzQtNERGMi04Q0Q3LUVCQ0E2QkI3QjMwMUBpY2xvdWQuY29tPg==","referencesHeader":"PDZBOTFDMkM1LTM1QzQtNERGMi04Q0Q3LUVCQ0E2QkI3QjMwMUBpY2xvdWQuY29tPg=="},"prevInTopic":76191,"nextInTopic":76195,"prevInTime":76192,"nextInTime":76194,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"-=-Please let that post through so others can read the ideas and to allow for discussion.-=- I ve approved three posts by you today.  If only two have come","messageBody":"<div id=\"ygrps-yiv-2135024583\">-=-Please let that post through so others can read the ideas and to allow for discussion.-=-<br/>\n<br/>\nI&#39;ve approved three posts by you today.  If only two have come through that&#39;s a yahoogroups queue deal.<br/>\nI double checked.<br/>\n<br/>\nif we were at a conference you wouldn&#39;t be given the microphone, so if that other post doesn&#39;t show up, maybe, after you&#39;ve read the responses and thought about them, you could ask your question clearly and simply.   Those two posts were honestly too long for me to want to read fully, because it looked like a lot of &quot;yeah, but...&quot;  I did approve them both by e-mail, though, and your third, complaining that I hadn&#39;t.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":279436458,"authorName":"kirkpatrick clare","from":"kirkpatrick clare &lt;clare.kirkpatrick@...&gt;","profile":"clarekirkp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442248983","msgId":76196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MDUwMTExNTQuNzcxODIuMTQ0MjI0ODk4MzY5MS5KYXZhTWFpbC5vcGVuLXhjaGFuZ2VAb3hiZTEudGIudWttYWlsLmlzcy5hczkxNDMubmV0Pg==","inReplyToHeader":"PEEwNEJBNDlGLUI4MjUtNDU5NC04N0I4LTE1M0I5Q0U3OUNFM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhidzY5NWpxZzVrOTcwNHd0dWI2N243YS4xNDQyMjEzNTg0Mjk0QGVtYWlsLmFuZHJvaWQuY29tPiA8QTA0QkE0OUYtQjgyNS00NTk0LTg3QjgtMTUzQjlDRTc5Q0UzQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":76195,"nextInTopic":76198,"prevInTime":76195,"nextInTime":76198,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"OH NO, I m going to disagree with Clare Kirkpatrick, and I usually don t. Or maybe I m not going to disagree with her. That would be okay. :-) Gah! I had","messageBody":"<div id=\"ygrps-yiv-1981636889\"><html><head>\n    \n \n </head> \n \n  <p>&#34;OH NO, I&#39;m going to disagree with Clare Kirkpatrick, and I usually don&#39;t.<br /> Or maybe I&#39;m not going to disagree with her. That would be okay. :-)&#34;<br /><br />Gah! I had hoped I&#39;d explained myself better than maybe I did, because&#160;I think you&#39;re agreeing with what I meant...although I can&#39;t know that for certain, of course. I&#39;ll try&#160;explaining it differently:<br /><br />If you&#39;re looking at something and your first and/or most important thought is&#160;&#39;is there learning potential in this?&#39; then, even if it is fun and engaging, it&#39;s likely that you will not hit the &#39;fun and engaging&#39; spot as well as if you were looking at it and thinking &#39;is this likely to be something my child will find fun and engaging&#39;. Because&#160;&#39;fun and engaging&#39; is the best&#160;energy in which real, deep learning will happen, prioritising &#39;fun and engaging&#39; over &#39;learning potential&#39; when choosing things to do or buy makes sense because we do, of course, want our children to learn stuff. It&#39;s just that we just know that the learning will happen best when we focus on the joy and connection over and above educational potential ...I&#39;m clearly not as good as explaining this principle as I am the &#39;joy and connection&#39; one :D&#160;<br /><br />As an adult, I don&#39;t choose hobbies or activities based on what they&#39;ll teach me but on whether or not I think I&#39;ll&#160;enjoy them. I love dancing salsa. Obviously, I had to learn salsa in order to dance it but I enjoyed dancing salsa even during&#160;my first lesson when I knew nothing. And I don&#39;t continue to go to classes primarily to learn salsa, I go primarily because getting better at it is fun and enjoying more complex dances during the free-style social dancing at the end is fun too.&#160;<br /><br />I try to extend the same approach to my children - is it fun? Are you enjoying it? Yes? Good - keep doing it. No? How about stopping doing it then?<br /><br />I think that life itself is fun and interesting and that it is impossible not to be learning all the time when the things you&#39;re doing are interesting or enjoyable. And I know my children know amazing things - many things&#160;that I don&#39;t know (until they&#39;ve told me!) - simply by taking this approach of &#39;do fun things&#39;. So I know they *are* learning - they&#39;re learning all the things they need to learn in order to live the lives they want to be living. When they want to put a video on YouTube, they work out how to learn how to edit videos (my 12 year old is ace at doing this now :) ). When they&#39;re inspired by watching their favourite YouTubers to &#160;learn how to draw manga, they ask me to buy them a book and some pens and they watch videos showing them how to draw manga. They&#39;re not waking up each day and thinking &#39;what shall I learn today?&#39;, instead they go from moment to moment thinking &#39;what do I want to do right now?&#39; and doing it and, by default, learning lots in the process.<br /><br /></p>\n  <div id=\"ygrps-yiv-1981636889ygrp-mlmsg\" style=\"\">\n   <div id=\"ygrps-yiv-1981636889ygrp-msg\">\n    <div id=\"ygrps-yiv-1981636889ygrp-text\">\n     <p></p>\n    </div>\n   </div>\n  </div>\n \n</html></div>","specialLinks":[]},{"userId":559765020,"authorName":"Erin Minter","from":"Erin Minter &lt;erinminter@...&gt;","profile":"emint78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442244807","msgId":76191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBOTFDMkM1LTM1QzQtNERGMi04Q0Q3LUVCQ0E2QkI3QjMwMUBpY2xvdWQuY29tPg=="},"prevInTopic":76190,"nextInTopic":76193,"prevInTime":76190,"nextInTime":76192,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"... Oh, no.  Not at all.  The very next section which I wrote and which you didn’t quote is actually my guess as to how many unschoolers look at it,","messageBody":"<div id=\"ygrps-yiv-1380400471\">---In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &lt;Sandra@...&gt; wrote :<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; To me, radical unschooling has little to do with the need to be making such distinctions.<br/>\n&gt;&gt; <br/>\n&gt;&gt; So if your child was in a class where there was instruction, would it matter at all to you if they genuinely WANTED to be there or not? Are you saying it doesn’t matter?<br/>\n&gt; <br/>\n&gt; The point is being missed.<br/>\n&gt; Either the point is being missed willfully and argumentively, or out of a too-fast reading.<br/>\n&gt; <br/>\n&gt; When someone comes looking for one answer, thinking she knows the wrong answers from the right answers, then it becomes a dust storm instead of a clear stream of information.<br/>\n&gt; <br/>\n&gt; &quot;Are you saying it doesn&#39;t matter&quot; sounds shrill. I could be wrong. It sounds accusatory. Perhaps it wasn&#39;t intended that way.<br/>\n<br/>\n </span></blockquote>Oh, no.  Not at all.  The very next section which I wrote and which you didn’t quote is actually my guess as to how many unschoolers look at it, including the poster.<br/>\n<br/>\n&quot;Or are you saying that it’s so obvious that it matters that it’s not worth talking about (like the question sort of takes care of itself once you understand supporting a child’s interests)?&quot;<br/>\n<br/>\nand this:<br/>\n<br/>\n&quot;do you think the distinction I’m talking about is built into the way you think of things?”<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why would one think that an experienced unschooler would have a child in a class where there was instruction when the child did not genuinely want to be there?<br/>\n<br/>\n </span></blockquote>I don’t think that.  I think an experienced unschooler would care about that distinction.  It makes a TON of difference.  But I think they care about it in a way which is already built into their worldview of supporting kids’ interests.  It’s not really “on their radar” because they are focused on living joyfully and learning from life in whatever form their child wants to freely explore.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That would mean that the parent had pressured the child to take a class. That wouldn&#39;t be unschooling.<br/>\n<br/>\n </span></blockquote>I agree.  And do you think that if a parent had pressured the child not to take a class, that also wouldn’t be unschooling?  I explain this so much more in my post which hasn’t been approved yet.<br/>\n<br/>\nPlease let that post through so others can read the ideas and to allow for discussion.<br/>\n<br/>\nI am really interested in responses to that post.  In that post, I try to clear up misunderstandings about my intent for posting and the purpose of my questions.  I think that post actually gets much more to the heart of my questions.  <br/>\n<br/>\nI think I’ve already learned a lot about what I’ve wanted to learn by posting here, but I would love to hear responses to my other post to see if anyone shares some of the ideas I’ve noticed about how unschooling plays out IRL with some people.  It’s not a super common sect of people, but I think it’s there.  And also, I’m curious if anyone has any ideas as to why.<br/>\n<br/>\nThanks,<br/>\n<br/>\nErin</div>","specialLinks":[]},{"userId":243894941,"authorName":"Karen Angstadt","from":"Karen Angstadt &lt;jsearthmom@...&gt;","profile":"jsearthmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unwanted vs wanted instruction","postDate":"1442242634","msgId":76190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRTVEODZELTcxMzEtNDc2Mi05MjhGLTc3QjU3NEIxMDFCOUB5YWhvby5jb20+"},"prevInTopic":76189,"nextInTopic":76191,"prevInTime":76189,"nextInTime":76191,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"... If my child were excited about trying fun experiments, I would find the required items and we would do fun experiments. (And we have done many experiments","messageBody":"<div id=\"ygrps-yiv-329465421\"><blockquote><span title=\"ireply\">&gt;&gt;So what happens if they do? What advice would you give to a parent who’s child wants to try out a science class or something where they do experiments and other fun stuff?&lt;&lt;<br/>\n<br/>\n </span></blockquote>If my child were excited about trying fun experiments, I would find the required items and we would do fun experiments. (And we have done many experiments over time.)<br/>\n<br/>\nThe missing piece here comes from the idea that these things are somehow not available without a class. And that is false. <br/>\n<br/>\nIf my child is asking to take a class, my first step is to communicate with my child about what is her goal- does she see it as an opportunity for more social time? Does she like the varied supplies provided? Are the experiments big and messy- things she thinks might be too much for home? Is she aware that these &quot;fun things&quot; can be done from home without a class? <br/>\n<br/>\nFinding out what she is thinking and wanting helps me be supportive of her real interests. <br/>\nKaren<br/>\n<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442242002","msgId":76189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMUY4RkI3LTczNjUtNDMwQS1COEE2LTUxRDNFRDU5MEI4QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk0NzY2MjBBLUQxRTItNDBCNi1CMEJGLUVDNDc4MDVBNjFEQ0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEVBMjA1MzY1LTRGMUQtNDFBQy1CRjczLTRBOEI1OTNBRUUwNEBpY2xvdWQuY29tPiA8OTQ3NjYyMEEtRDFFMi00MEI2LUIwQkYtRUM0NzgwNUE2MURDQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":76187,"nextInTopic":76190,"prevInTime":76188,"nextInTime":76190,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"This is a false dichotomy. It s the wrong question:  Unwanted vs wanted instruction We could answer it in an unschooling context easly.  If you re telling","messageBody":"<div id=\"ygrps-yiv-1769909538\">This is a false dichotomy. It&#39;s the wrong question:  &quot;Unwanted vs wanted instruction&quot;<br/>\n<br/>\nWe could answer it in an unschooling context easly.  If you&#39;re telling your child how to do something, and he&#39;s not in the mood to hear it, should you stop?<br/>\nIf you&#39;re trying to teach your child how to spell, or hold a pen, and he didn&#39;t ask you to do that, and he&#39;s uncomfortable, should you stop, or not?<br/>\n<br/>\nIf your child asks you how to spell a word, should you spell it for him?  If your child asks what five times three is, should you just tell him?  Or should you consider it a &quot;teachable moment&quot; (a TOTALLY crap phrase) and give him &quot;instruction&quot;?<br/>\n<br/>\nKids might ask WHY, and answering that question might seem like instruction, but when unschooling is working well, it&#39;s conversation.  What does &quot;Twenty&quot; mean?  That turns to the history of English—twa tens.  &quot;Two&quot; has a &quot;w&quot; in it because it used to be pronounced.  It&#39;s still pronounce in &quot;twin&quot; and &quot;twine&quot; and &quot;twice&quot; and &quot;twenty.&quot;  Is that &quot;instruction&quot;?  If the other person in the conversation is interested, it&#39;s conversation.<br/>\n<br/>\n<br/>\n<br/>\nThe question was not about &quot;wanted instruction&quot; (an awkward phrase), but about formal education. It&#39;s a question about a classroom.  It&#39;s a question about whether taking classes is going to keep someone from being an unschooler.  And the answer given by several people was that it might.  But the person who wrote the question didn&#39;t see the problem with the question, and so the responses were to what she SHOULD have asked.<br/>\n<br/>\nThis is big, in this discussion and a (very) few others like it.  We&#39;re not here to answer people&#39;s questions.  We&#39;re here to help people (not just those who post questions, but everyone who&#39;s reading now and in the future) to see what helps unschooling and what hinders it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442241409","msgId":76187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0NzY2MjBBLUQxRTItNDBCNi1CMEJGLUVDNDc4MDVBNjFEQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEVBMjA1MzY1LTRGMUQtNDFBQy1CRjczLTRBOEI1OTNBRUUwNEBpY2xvdWQuY29tPg==","referencesHeader":"PEVBMjA1MzY1LTRGMUQtNDFBQy1CRjczLTRBOEI1OTNBRUUwNEBpY2xvdWQuY29tPg=="},"prevInTopic":76186,"nextInTopic":76189,"prevInTime":76186,"nextInTime":76188,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"-=- To me, radical unschooling has little to do with the need to be making such distinctions. -=-So if your child was in a class where there was instruction,","messageBody":"<div id=\"ygrps-yiv-1994657008\">-=-&gt; To me, radical unschooling has little to do with the need to be making such distinctions.<br/>\n<br/>\n-=-So if your child was in a class where there was instruction, would it matter at all to you if they genuinely WANTED to be there or not? Are you saying it doesn’t matter? -=-<br/>\n<br/>\nThe point is being missed.<br/>\nEither the point is being missed willfully and argumentively, or out of a too-fast reading.<br/>\n<br/>\nWhen someone comes looking for one answer, thinking she knows the wrong answers from the right answers, then it becomes a dust storm instead of a clear stream of information.<br/>\n<br/>\n&quot;Are you saying it doesn&#39;t matter&quot; sounds shrill.  I could be wrong.  It sounds accusatory.  Perhaps it wasn&#39;t intended that way.<br/>\nWhy would one think that an experienced unschooler would have a child in a class where there was instruction when the child did not genuinely want to be there?<br/>\n<br/>\nThat would mean that the parent had pressured the child to take a class.  That wouldn&#39;t be unschooling.<br/>\n<br/>\nBut all that above does not mean that it&#39;s just the same for a new unschooler&#39;s child to be in a class.<br/>\nThat&#39;s why the first link I sent was Kelly Lovejoy&#39;s Three Stages of Unschooling.<br/>\n<br/>\nWhen I send a link, it&#39;s because I believe that reading it would help the person who asked the question.  If the person doesn&#39;t really read it, it&#39;s too early to ask another question.<br/>\nIf the person DOES really read it, it&#39;s too soon to ask a question if she hasn&#39;t taken some time to let the ideas sink in, soak in, percolate through her own life and experiences and hopes and dreams.<br/>\n<br/>\nI&#39;m serious.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/readalittle\">http://sandradodd.com/readalittle</a><br/>\nRead a little<br/>\nTry a little<br/>\nWait a while<br/>\nWatch<br/>\n<br/>\nOtherwise it&#39;s just furious wordplay to the point of exhaustion, and nothing whatsoever is learned.<br/>\n<br/>\nFurious wordplay can be entertaining, but not for all the readers of this discussion.  <br/>\n<br/>\nEvery post should be useful to lots of people, and... from the link below, I&#39;ll quote more.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearningPOSTS\">http://sandradodd.com/lists/alwayslearningPOSTS</a><br/>\n<br/>\nPosts for this list need to fulfill at least one of these criteria:<br/>\n<br/>\n\t• helps lots of people understand unschooling<br/>\n\t• asks a question that actually needs an answer<br/>\n\t• requests help seeing different aspects of a situation<br/>\n\t• helps people have more peaceful and joyful lives (helps lots of people on the list)<br/>\n<br/>\nALL posts should be<br/>\n<br/>\n\t• honest<br/>\n\t• proofread<br/>\n\t• sincere<br/>\n\t• clear<br/>\n<br/>\nAnyone who&#39;s new to Always Learning who hasn&#39;t read this, please do (and both the links to the right, about new members, and how to post)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/alwayslearning/\">http://sandradodd.com/alwayslearning/</a><br/>\n<br/>\nSandra, <br/>\nthe owner of Always Learning, which has been here since November 2001, <br/>\nbut the ideas we started with were not new then—it came out of other rich discussions</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442240793","msgId":76186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFNTA0NjRCLTQ0REEtNDVENy1BMDk4LTAzQkFENDJENkUxQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEVBMjA1MzY1LTRGMUQtNDFBQy1CRjczLTRBOEI1OTNBRUUwNEBpY2xvdWQuY29tPg==","referencesHeader":"PEVBMjA1MzY1LTRGMUQtNDFBQy1CRjczLTRBOEI1OTNBRUUwNEBpY2xvdWQuY29tPg=="},"prevInTopic":76184,"nextInTopic":76187,"prevInTime":76185,"nextInTime":76187,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"Erin, before I read in detail your two exceedingly long posts which at a glanced looked to be rewordings of your first questions... How long have you","messageBody":"<div id=\"ygrps-yiv-639467812\">Erin, before I read in detail your two exceedingly long posts which at a glanced looked to be rewordings of your first questions...<br/>\n<br/>\nHow long have you unschooled?  How old is your child?<br/>\nLet&#39;s get out of the airy hypotheticals, and to a direct situation, please.<br/>\n<br/>\nThose questions are important.<br/>\n<br/>\nThanks,<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442239692","msgId":76181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwNEJBNDlGLUI4MjUtNDU5NC04N0I4LTE1M0I5Q0U3OUNFM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhidzY5NWpxZzVrOTcwNHd0dWI2N243YS4xNDQyMjEzNTg0Mjk0QGVtYWlsLmFuZHJvaWQuY29tPg==","referencesHeader":"PGhidzY5NWpxZzVrOTcwNHd0dWI2N243YS4xNDQyMjEzNTg0Mjk0QGVtYWlsLmFuZHJvaWQuY29tPg=="},"prevInTopic":76176,"nextInTopic":76184,"prevInTime":76180,"nextInTime":76182,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"-=-Radical unschoolers understand that when learning is the primary objective of something, it s at its least efficient. When joy and happiness and connection","messageBody":"<div id=\"ygrps-yiv-98336858\">-=-Radical unschoolers understand that when learning is the primary objective of something, it&#39;s at its least efficient. When joy and happiness and connection are the priorities, deep, truly meaningful learning just happens. -=-<br/>\n<br/>\nOH NO, I&#39;m going to disagree with Clare Kirkpatrick, and I usually don&#39;t.<br/>\nOr maybe I&#39;m not going to disagree with her.  That would be okay. :-)<br/>\n<br/>\nI often had learning as a toggle point—when I was deciding whether to go to place A or place B, or to buy toy/game/oddity A or B, I would consider which would be newer, more stimulating to thought and ideas—THAT kind of learning.  Which would be more intellectually stimulating, or surprising, or exciting.<br/>\n<br/>\nSo MAYBE that&#39;s what Clare meant by joy and happiness and connection. :-)  Or maybe not.<br/>\n<br/>\nI&#39;m going to link my page on balance, because sometimes there&#39;s been too much newness and stimulation, and the thing to choose is mashed potatoes and a repeat of an oft-watched movie, on the couch, in the dark.   But not every time. :-)<br/>\n<br/>\nWhere I think I do agree with Clare is that when I think of the learning I chose, it wasn&#39;t anything LIKE a class, or school, or a subject area.  It was &quot;What will add to the store of ideas and factoid and experience my kids have already?&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\nAnd balance does NOT mean as much school/schooliness as unschooling, because as long as there IS schooliness, there is no unschooling.<br/>\n<br/>\nHere&#39;s something to go with it, about how knowledge forms from trivia:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/substance\">http://sandradodd.com/substance</a><br/>\n<br/>\nDOH!  And now I&#39;m arguing with myself, because (evidenced by that page) I once I wrote this:<br/>\n<br/>\n-=-I was determined from the beginning not to distinguish what was &quot;good for them&quot; (educational) from what was &quot;just fun&quot; and in the course of treating it all the same, it became all the same--not only in reality (which I think it was already) but in the eyes of my children (because they didn&#39;t know any different) and in my own gut.-=-<br/>\n<br/>\nI think &quot;Is there newness?&quot; was my &quot;will they learn?&quot; and it was a tie-breaking factor if other elements were the same.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":559765020,"authorName":"Erin Minter","from":"Erin Minter &lt;erinminter@...&gt;","profile":"emint78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442237395","msgId":76184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBMjA1MzY1LTRGMUQtNDFBQy1CRjczLTRBOEI1OTNBRUUwNEBpY2xvdWQuY29tPg=="},"prevInTopic":76181,"nextInTopic":76186,"prevInTime":76183,"nextInTime":76185,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"... So if your child was in a class where there was instruction, would it matter at all to you if they genuinely WANTED to be there or not?  Are you saying it","messageBody":"<div id=\"ygrps-yiv-1415348512\">---In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &lt;clare.kirkpatrick@...&gt; wrote :<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ---In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &lt;erinminter@...&gt; wrote :<br/>\n&gt; <br/>\n<br/>\n&gt;&gt; &quot; Do radical unschoolers make a distinction between unwanted and wanted instruction? &quot;<br/>\n&gt; <br/>\n&gt; To me, radical unschooling has little to do with the need to be making such distinctions.<br/>\n<br/>\n </span></blockquote>So if your child was in a class where there was instruction, would it matter at all to you if they genuinely WANTED to be there or not?  Are you saying it doesn’t matter? <br/>\n<br/>\nOr are you saying that it’s so obvious that it matters that it’s not worth talking about (like the question sort of takes care of itself once you understand supporting a child’s interests)?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Instead the question should be &quot;is this thing (playing a video game, studying to gain a qualification, lying on the sofa daydreaming...) serving my child in terms of deep happiness? Is this thing strengthening or damaging my relationship with my child? <br/>\n<br/>\n </span></blockquote>Well, if a child doesn’t WANT to be there, that’s no good for happiness.  And if you are in any way pressuring, forcing, manipulating them to be there when they don’t WANT to be there, that’s no good for the relationship.<br/>\n<br/>\ndo you think the distinction I’m talking about is built into the way you think of things?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Once you truly and deeply understand those fundamental priorities of unschooling, your question becomes irrelevant. <br/>\n&gt; <br/>\n&gt; One of my children loves playing with numbers - solving puzzles etc. She&#39;s 12. She considered doing the study required to do a GCSE in maths (we&#39;re in the UK) but rejected the idea after much discussion. I didn&#39;t try to put her off or persuade her.<br/>\n<br/>\n </span></blockquote>some people who call themselves unschoolers would try to put her off.  Maybe in a subtle way, using pressure.  Maybe not so subtle.  They are biased against academics and instruction related to academics.<br/>\n<br/>\ndo you know why they would be like that?<br/>\n<br/>\nHere are my ideas:<br/>\n<br/>\n- they are anti-conformist / rebel *for the sake of it*.  It’s not thoughtful decision making.<br/>\n<br/>\n- they, themselves, are anti-academics or anti-higher math and so they share that bias with their kid<br/>\n<br/>\n- messages coming out of the radical unschool community are focused on the BIG problem of parents wanting to cling to school-ish type thinking.  It’s really hard for many parents to change their ideas about that.  So as a result there is a big emphasis on how classes, instruction, schoolish type stuff, teaching is all anti-learning.  (And in MOST cases, it IS.  It’s true that  this stuff damages kids and hurts real learning.)<br/>\n<br/>\nBut some people then misinterpret this in a way where they become BIASED against learning certain things (higher math, other academic-type stuff).<br/>\n<br/>\nThey are not supporting their children’s interests.  Rather, they are promoting their OWN agenda and bias.<br/>\n<br/>\nIn my most recent email where I explained all of this more, I mentioned that there is another group (who I actually think is more common), whom are *relieved* when their kid wants to do something academic.  I think this is a mistake as well.  But right now, I’m curious about this other group.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I simply helped her think through what it is she actually needs me to help her with to do the things she enjoys doing. Being her partner in this decision strengthened our relationship and prioritising her joy meant that I had no feelings about which option she would choose; which option would create the most joy for her. <br/>\n&gt; <br/>\n&gt; The other point to make here is that she understands learning in a way you don&#39;t appear to do.<br/>\n<br/>\n </span></blockquote>quote?  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She didn&#39;t want to do the formal maths study with the primary goal of learning more maths, but in order to have more time doing more playing with numbers etc.<br/>\n<br/>\n </span></blockquote>Do you think I think that kids should just learn things in order to accumulate a bunch of stuff in their minds which is disconnected from their IRL, right now problems / projects / interests?<br/>\n<br/>\nI think kids should learn what they are interested in learning because learning those things helps them solve the actual, applicable problems they are working on right now in their lives.  Stuff they genuinely care about.  Kids are living life NOW.  It’s not about preparing for adulthood.<br/>\n<br/>\nErin</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"Clare Kirkpatrick &lt;clare.kirkpatrick@...&gt;","profile":"clarekirkp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442213905","msgId":76176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhidzY5NWpxZzVrOTcwNHd0dWI2N243YS4xNDQyMjEzNTg0Mjk0QGVtYWlsLmFuZHJvaWQuY29tPg=="},"prevInTopic":76175,"nextInTopic":76181,"prevInTime":76175,"nextInTime":76177,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":" Do radical unschoolers make a distinction between  ... To me, radical unschooling has little to do with the need to be making such distinctions. Instead","messageBody":"<div id=\"ygrps-yiv-260482261\"><html><head></head><div>&quot;<span class=\"ygrps-yiv-260482261Apple-style-span\" style=\"font-family:Georgia;font-size:13px;\">&nbsp;Do radical unschoolers make a distinction between&nbsp;</span></div><div id=\"ygrps-yiv-260482261ygrp-mlmsg\" style=\"font-size:13px;font-family:Arial, helvetica, clean, sans-serif;color:rgb(0, 0, 0);\"><div id=\"ygrps-yiv-260482261ygrp-msg\" style=\"\"><div id=\"ygrps-yiv-260482261ygrp-text\" style=\"font-family:Georgia;\"><p style=\"margin-top:0px;margin-right:0px;margin-bottom:1em;margin-left:0px;\">&gt; unwanted and wanted instruction?&nbsp;&quot;</p><p style=\"margin-top:0px;margin-right:0px;margin-bottom:1em;margin-left:0px;\">To me, radical unschooling has little to do with the need to be making such distinctions. Instead the question should be &quot;is this thing (playing a video game, studying to gain a qualification, lying on the sofa daydreaming...) serving my child in terms of deep happiness? Is this thing strengthening or damaging my relationship with my child?&nbsp;</p><p style=\"margin-top:0px;margin-right:0px;margin-bottom:1em;margin-left:0px;\">Once you truly and deeply understand those fundamental priorities of unschooling, your question becomes irrelevant.&nbsp;</p><p style=\"margin-top:0px;margin-right:0px;margin-bottom:1em;margin-left:0px;\">One of my children loves playing with numbers - solving puzzles etc. She&#39;s 12. She considered doing the study required to do a GCSE in maths (we&#39;re in the UK) but rejected the idea after much discussion. I didn&#39;t try to put her off or persuade her. I simply helped her think through what it is she actually needs me to help her with to do the things she enjoys doing. Being her partner in this decision strengthened our relationship and prioritising her joy meant that I had no feelings about which option she would choose; which option would create the most joy for her.&nbsp;</p><p style=\"margin-top:0px;margin-right:0px;margin-bottom:1em;margin-left:0px;\">The other point to make here is that she understands learning in a way you don&#39;t appear to do. She didn&#39;t want to do the formal maths study with the primary goal of learning more maths, but in order to have more time doing more playing with numbers etc. It was simply one thing she could do that may have helped her discover more things to do around something she loves.&nbsp;</p><p style=\"margin-top:0px;margin-right:0px;margin-bottom:1em;margin-left:0px;\">Radical unschoolers understand that when learning is the primary objective of something, it&#39;s at its least efficient. When joy and happiness and connection are the priorities, deep, truly meaningful learning just happens.&nbsp;</p></div></div></div><div><br></div><div><br></div><div><div style=\"font-size:75%;color:#575757;\">Sent from Samsung Mobile</div></div></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442199790","msgId":76175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NTA2OUMxLTEyMkQtNEY4RC1BRjFCLUEyRkE2OTQzQUU1QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE5OUY4NkJELTBFOUYtNDgwOS05MzFDLTI0MTJEMEM3MUYyOEB2ZXJpem9uLm5ldD4=","referencesHeader":"PDQ1NjY0Mzc2LTM3QTQtNDdFMy04RENCLUYyM0I1RERDOUM4OUBpY2xvdWQuY29tPiA8MTk5Rjg2QkQtMEU5Ri00ODA5LTkzMUMtMjQxMkQwQzcxRjI4QHZlcml6b24ubmV0Pg=="},"prevInTopic":76174,"nextInTopic":76176,"prevInTime":76174,"nextInTime":76176,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"-=- And do you think unschoolers think *wanted* instruction ... That writing is full of  leading questions, and misinterpretations, and twisty loops. Starting","messageBody":"<div id=\"ygrps-yiv-1146729137\">-=-&gt; And do you think unschoolers think *wanted* instruction <br/>\n<blockquote><span title=\"ireply\"> &gt; is fine for swimming lessons or driving lessons, but <br/>\n&gt; get a bit bothered if the subject is math for example?-=-<br/>\n<br/>\n </span></blockquote>That writing is full of  leading questions, and misinterpretations, and twisty loops.  <br/>\n<br/>\nStarting with a lot of &quot;understanding&quot; and stating what you think we know and believe reminds me of the story of the tea pouring here: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling.html\">http://sandradodd.com/deschooling.html</a><br/>\n<br/>\nRelax.  Clear your mind.  Stop thinking you know. If you think you know, stop telling us.  <br/>\nStart to untangle your fears, prejudices and your &quot;knowledge&quot; about learning, and your &quot;understanding&quot; about unschooling.  It&#39;s all messy and confused.<br/>\n<br/>\n-=-&gt; What advice would you give to a parent who’s child <br/>\n<blockquote><span title=\"ireply\"> &gt; wants to try out a science class or something where <br/>\n&gt; they do experiments and other fun stuff?-=-<br/>\n<br/>\n </span></blockquote>It depends how old the child is, where they are in their understanding of unschooling, what kind of class it is—but mostly, as Joyce points out, I would much rather help the family be so confident with unschooling that the parents know the downside, or the advantage, and that the child doesn&#39;t feel it&#39;s the only way for him to see science in action.<br/>\n<br/>\nIt would depend.<br/>\nAnd if the family was new to unschooling, I would suggest they wait until after everyone has deschooled.  But that&#39;s why I brought the links I brought.  It says all that, but no one (NO ONE) will be able to understand what&#39;s on all those pages all in one reading.  They will need to read a little, try a little, wait a while and watch.<br/>\n<br/>\n-=-&gt; Perhaps by talking about unschoolers freely taking <br/>\n<blockquote><span title=\"ireply\"> &gt; classes for fun *because they WANT to*, you are <br/>\n&gt; afraid it will keep others too much in school-mode.-=-<br/>\n<br/>\n </span></blockquote>Those who have helped other unschoolers for any length of time have seen unschooling attempts that failed.  We could design a failure, and it would involve taking classes. :-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/screwitup\">http://sandradodd.com/screwitup</a><br/>\nThere&#39;s a collection of ways to screw things up, but it might not go into academics.<br/>\nWhen academics are seen as separate from life, and the parent is communicating to unschoolers about &quot;subjects,&quot; deschooling is not in evidence.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/subjects\">http://sandradodd.com/subjects</a><br/>\n<br/>\n-=-&gt; Do some radical unschoolers end up having a bias against <br/>\n<blockquote><span title=\"ireply\"> &gt; academic stuff? Do some have a bias against ALL human <br/>\n&gt; instruction regarding academic-type subjects (even *wanted* instruction)?-=-<br/>\n<br/>\n </span></blockquote>Only beginners will prize or reject &quot;academic stuff.&quot;<br/>\nOnly those who didn&#39;t really get it will continue to reject schoolish topics.<br/>\nThose who get it will stop seeing &quot;academic stuff&quot; as a subset of life, when unschooling is really working well.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reallearning\">http://sandradodd.com/reallearning</a> might help.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442196594","msgId":76174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5OUY4NkJELTBFOUYtNDgwOS05MzFDLTI0MTJEMEM3MUYyOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ1NjY0Mzc2LTM3QTQtNDdFMy04RENCLUYyM0I1RERDOUM4OUBpY2xvdWQuY29tPg==","referencesHeader":"PDQ1NjY0Mzc2LTM3QTQtNDdFMy04RENCLUYyM0I1RERDOUM4OUBpY2xvdWQuY29tPg=="},"prevInTopic":76173,"nextInTopic":76175,"prevInTime":76173,"nextInTime":76175,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"... Why are you asking? What does the opinion of other unschoolers have to do with what a child is enjoying? You re not unschooling for other unschoolers.","messageBody":"<div id=\"ygrps-yiv-2016641017\"><blockquote><span title=\"ireply\">&gt; On Sep 13, 2015, at 5:25 PM, Erin Minter <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erinminter@...\">erinminter@...</a> [AlwaysLearning] &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; wrote:<br/>\n&gt; <br/>\n&gt; then would unschoolers be fine with that?<br/>\n<br/>\n </span></blockquote>Why are you asking? What does the opinion of other unschoolers have to do with what a child is enjoying? You&#39;re not unschooling for other unschoolers. You&#39;re unschooling to support your child exploring her interests. What is and isn&#39;t unschooling isn&#39;t based on collective opinion. It&#39;s not a checklist of what can and can&#39;t be done.<br/>\n<br/>\nOur purpose here isn&#39;t to grant or deny approval. It&#39;s to help people understand how and why to create an environment where natural learning can flourish. As their understanding grows, then they can make better and better decisions on how to do that in their family.<br/>\n<br/>\nThe questions to ask isn&#39;t &quot;Is this okay with unschoolers?&quot; It&#39;s<br/>\n<br/>\nIs the mom worried about whether her child is learning enough?<br/>\n<br/>\nDoes the child feel a shift in the atmosphere when he plays a video game and when he builds with Legos or does a workbook?<br/>\n<br/>\nDoes mom feel relieved when her child wants to take a science class rather than play Magic?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; taking a class with a human person giving you information <br/>\n&gt; (which you can take or leave) is not fundamentally that much <br/>\n&gt; different than reading a book or a website giving you information <br/>\n&gt; (which you can take or leave) or taking an online class giving <br/>\n&gt; you information (which you can take or leave) <br/>\n<br/>\n </span></blockquote>No, they aren&#39;t the same.<br/>\n<br/>\nWith a class there&#39;s intent to be fed information the teacher has chosen in her order at her pace. There&#39;s an understanding you must conform to certain rules so the class can run and other kids can learn. Regardless of whether a child knows they can drop a class, there&#39;s an emotional difference between deciding to take a class and clicking on a Google link or picking up a book.<br/>\n<br/>\nA book or website can be used however the child wants. A child can read a sentence, just look at the pictures, play a video, drop it for another.<br/>\n<br/>\nBUT ... MORE IMPORTANTLY, your examples compare classes and books/reading. That is a view of learning limited by school.<br/>\n<br/>\nUnschooling learning looks like video games, conversations, deciding what to eat, deciding what to buy, dress up, drawing, YouTube, Facebook, Skype, singing, listening to music, baking cookies, watching football, playing football, reading comics, climbing trees ...<br/>\n<br/>\nBut more important than the form is what happens inside the child. Most of an unschooling child&#39;s learning is &quot;I need 3 more weeks of allowance for the new game.&quot; &quot;Do I have enough power left to beat the boss?&quot; &quot;Do I want cheese or peanut butter?&quot; &quot;I&#39;ve heard a country version of that song.&quot; &quot;Pirates or Ninjas?&quot; <br/>\n<br/>\nUnschooling parents don&#39;t limit their children to learning that way. That&#39;s the learning that human are wired to do. We learn when we make connections, when we use what we know in real situations, when we figure out something new.<br/>\n<br/>\nMOST of the time unschooling kids&#39; learning looks like playing. It will be punctuated by a class about as often as a trip to a carnival. <br/>\n<br/>\nYou&#39;re still stuck on the idea that a child reading a book is doing important learning. And perhaps see a cartoon as (supposedly) good for a fact or 2.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So when questions about classes or instruction <br/>\n&gt; are brought up, they maybe cringe a bit.<br/>\n<br/>\n </span></blockquote>I cringe when it&#39;s asked because someone who understands natural learning won&#39;t need to ask. They&#39;ll know what the answer is.<br/>\n<br/>\nI always strongly suspect someone who asks feels very uncomfortable that unschooling can&#39;t (supposedly) look like classes and she really really wants an unschooling stamp of approval on learning that feels formal.<br/>\n<br/>\nYou&#39;re confirming my suspicions!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do radical unschoolers make a distinction between <br/>\n&gt; unwanted and wanted instruction? <br/>\n<br/>\n </span></blockquote>You&#39;re asking for rules.<br/>\n<br/>\nThe question to ask is how do brains react to wanted and unwanted instruction? How does it effect what the child learns? How does it effect the child? How does it effect the child&#39;s growing understanding of how to learn?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you think some radical unschoolers subtly dissuade <br/>\n&gt; their children from taking academic classes which have <br/>\n&gt; some sort of instructor? <br/>\n<br/>\n </span></blockquote>Some parents parents haven&#39;t gotten beyond defining unschooled as &quot;what unschoolers do.&quot; It&#39;s possible they might. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do some unschoolers think it’s better to learn via a book <br/>\n&gt; or own your own compared to taking a class with an actual teacher?<br/>\n<br/>\n </span></blockquote>This question right here sums up the question you&#39;re struggling with.<br/>\n<br/>\nYou&#39;re still valuing learning that resembles school. You see the best learning as coming in discrete chunks in a book or a class. <br/>\n<br/>\nUnschooling learning isn&#39;t an accumulation of knowledge. It&#39;s growing an understanding of how the world works. It will happen the same way as children grew their understanding of language.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do radical unschoolers think a setting like that which involves <br/>\n&gt; *instruction* is fundamentally wrong in some way? Or is it <br/>\n&gt; specifically *unwanted* instruction which is the problem?  <br/>\n<br/>\n<br/>\n </span></blockquote>Instruction is different from learning that&#39;s free form.<br/>\n<br/>\nHow well does a child learn Spanish in a class?<br/>\n<br/>\nHow well does a child learn her native language just by living?<br/>\n<br/>\nThere *might* be a time a child wants a chunk of information. There might be a time when a child wants sprinkles on his ice cream.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yet that distinction (unwanted vs wanted) isn’t really <br/>\n&gt; talked about much because of fear of being misinterpreted?<br/>\n<br/>\n </span></blockquote>Because it isn&#39;t necessary. If a mom has deschooled and has been reading to understand how learning works then she knows finding things her child might enjoy is a big part of her role.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And do you think unschoolers think *wanted* instruction <br/>\n&gt; is fine for swimming lessons or driving lessons, but <br/>\n&gt; get a bit bothered if the subject is math for example?<br/>\n<br/>\n </span></blockquote>Driving and swimming are immediately useful. It isn&#39;t abstract information that the child might use one day.<br/>\n<br/>\nThere have, though, been plenty of discussions of kids learning to swim naturally. (I did.) Driving school is practical because it lowers insurance rates ;-)  (In MA driver&#39;s ed is mandatory so it&#39;s a moot point.)<br/>\n<br/>\nMath instruction is for the most part horrible for growing mathematical thinking. (Some kids like the puzzle aspect. I did.) Kids can learn math from using math the same way they learned to speak. Math instruction is even more counter to how humans learn than Spanish class.<br/>\n<br/>\nHere&#39;s some writing I&#39;ve collected about math instruction<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joyfullyrejoycing.com/#!\">http://www.joyfullyrejoycing.com/#!</a>senselessness-of-school-math/cdz1<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; regardless of “how it [Kat&#39;s college classes] looks”, objectively<br/>\n&gt; was it a problem? or was it the right choice for her?<br/>\n<br/>\n </span></blockquote>I assume you&#39;re asking about the learning she was supposed to get from the classes.<br/>\n<br/>\nWhat she learned (academically) in the classes is none of my business. My concern was with her experience and what she learned from that.<br/>\n<br/>\nShe learned more about how she learns and grew a better idea of how well classes work for math and writing.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In general, sometimes I wonder if some unschoolers are <br/>\n&gt; hesitant to do things which make them no longer “look” <br/>\n&gt; like unschoolers, regardless of whether the thing in question <br/>\n&gt; is the right thing to do or not.<br/>\n<br/>\n </span></blockquote>If someone&#39;s understanding is a list of things that unschoolers do and don&#39;t do, then that&#39;s possible. The information to grow a deeper understanding is here. We can&#39;t make people understand, though. They&#39;ll do with the information whatever they feel is best.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But again, maybe you worry that people who are new to <br/>\n&gt; unschooling who hear this sort of thing will continue to <br/>\n&gt; pressure their kids / force their kids / continue to try <br/>\n&gt; to make their lives resemble school?<br/>\n<br/>\n </span></blockquote>I don&#39;t worry about it. I do *know* that until school is let go of someone who wants to unschool will still worry whether their child is learning enough academically. As long as they continue to worry then classes and books will look very attractive.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Perhaps by talking about unschoolers freely taking <br/>\n&gt; classes for fun *because they WANT to*, you are <br/>\n&gt; afraid it will keep others too much in school-mode.<br/>\n<br/>\n </span></blockquote>IF someone understand kids enjoying what they&#39;re doing (regardless of where it is) is important to learning, then we don&#39;t need to discuss unschoolers taking math classes. Parents will just naturally point out classes they think their kids might find fun.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What advice would you give to a parent who’s child <br/>\n&gt; wants to try out a science class or something where <br/>\n&gt; they do experiments and other fun stuff?<br/>\n<br/>\n </span></blockquote>With all that we write about children pursuing their interests, I would wonder why they needed to ask. I would suspect they had been gathering up a list of do&#39;s and don&#39;ts.<br/>\n<br/>\nI would probably answer yes, then dig into why she needed to ask. The purpose of all this writing here is to help people understand how it works so they won&#39;t need to ask, &quot;Is it unschooling if...?&quot; Because really that&#39;s not a good question. <br/>\n<br/>\n&quot;Is it vegetarian if ...?&quot;<br/>\n&quot;Is it Christian if ...?&quot;<br/>\n<br/>\nThe question is almost, &quot;Is it allowed if ...?&quot;  If they&#39;re asking it means they don&#39;t know why it would or wouldn&#39;t be. They&#39;re still operating on rules.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I DO see a downside to giving that advice if the ***main <br/>\n&gt; problem unschoolers are trying to solve*** is not having <br/>\n&gt; people who are new to unschooling misinterpret things <br/>\n&gt; and think that school classes are something to push for <br/>\n&gt; despite the kid’s resistance.<br/>\n<br/>\n </span></blockquote>The downside is people shouldn&#39;t be looking for advice here. They should be looking to deepen their understanding so they don&#39;t  need to ask, &quot;Is this unschooling.&quot;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do some radical unschoolers end up having a bias against <br/>\n&gt; academic stuff? Do some have a bias against ALL human <br/>\n&gt; instruction regarding academic-type subjects (even *wanted* instruction)?<br/>\n<br/>\n </span></blockquote>If they do, they aren&#39;t posting about it.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":269399205,"authorName":"Alex & Brian Polikowsky","from":"Alex & Brian Polikowsky &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442194284","msgId":76173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwRTUwMUQ1LTVBMzgtNDkxOS1CQzVDLTA2MzEwQzIzRDRGM0B5YWhvby5jb20+","inReplyToHeader":"PDJBRjYwQTA4LTM0REUtNEZCOS1CN0RCLTFCQ0M5NzgxN0M3RkBpY2xvdWQuY29tPg==","referencesHeader":"PDJBRjYwQTA4LTM0REUtNEZCOS1CN0RCLTFCQ0M5NzgxN0M3RkBpY2xvdWQuY29tPg=="},"prevInTopic":76172,"nextInTopic":76174,"prevInTime":76172,"nextInTime":76174,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"Not all take swimming or driving lessons from teachers. My kids learned to swim by playing in the pool ! I learned to drive without lessons. Alex Polikowsky ","messageBody":"<div id=\"ygrps-yiv-729865158\"><html><head></head><div>Not all take swimming or driving lessons from teachers. My kids learned to swim by playing in the pool ! I learned to drive without lessons.</div><div><br></div><div>Alex Polikowsky</div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div><br><br>Sent from my iPhone</div><div><br><blockquote><span title=\"qreply\"> On Sep 13, 2015, at 8:10 AM, Erin Minter <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erinminter@...\">erinminter@...</a> [AlwaysLearning] &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; wrote:<br><br></span></blockquote></div><blockquote type=\"cite\"><div>\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n<span style=\"display:none;\">&nbsp;</span>\n\n\n\n    <div id=\"ygrps-yiv-729865158ygrp-text\">\n      \n      \n      <p>Hi.  I have a question about instruction.<br>\n<br>\nI understand how instruction or teaching does not equate to learning.  The child - the learner - is the one who always controls what is learned.  You can’t force knowledge into a child’s mind.<br>\n<br>\nI also understand that you can learn through living life.  It’s a mistake to think of learning as something separate from life.  Kids will learn lots and lots things just by living in a vibrant environment which supports their interests.<br>\n<br>\nMy question is what about a child who is interested in a specific subject - e.g. biology, math, history - and the child **wants** to take a particular class taught by a teacher.  <br>\n<br>\nBased on the philosophy of radical unschooling, how would a parent respond to this?  Is there a conflict between “supporting the child’s interests” and “learning thru living and not having instruction”?<br>\n<br>\nDo radical unschoolers reject instruction in general?  Do they make a clear distinction between unwanted and wanted instruction?  <br>\n<br>\nLike in this quote:<br>\n<br>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/radical\">http://sandradodd.com/unschool/radical</a><br>\n<br>\n&gt; In different discussions over the years I&#39;ve seen different distinctions made about &quot;radical.&quot; Sometimes it involves whether there is any instruction. Some people want to teach math facts and reading and other than that they&#39;re unschooling. They&#39;re not radical unschoolers.<br>\n<br>\nDo radical unschoolers reject *any* instruction?  Even genuinely wanted instruction?<br>\n<br>\nChildren take swimming lessons or driving lessons from teachers.  But what about an academic subject which the child is interested in taking?<br>\n<br>\nAlso, do you think the age of the child matters regarding whether instruction is ok or not?  I think lots of teens take academic-type classes, but what about a younger child who is interested in something like that?<br>\n<br>\nLastly, do unschoolers think of voluntarily (where they could stop attending if they no longer wanted to go) taking a class being taught by a teacher as somehow different than online instruction or reading a book on their own with no outside instruction?<br>\n<br>\nThanks, <br>\n<br>\nErin Minter<br>\n<br>\n</p>\n\n    </div>\n     \n\n    \n\n\n\n\n\n\n\n</div></blockquote></html></div>","specialLinks":[]},{"userId":559765020,"authorName":"Erin Minter","from":"Erin Minter &lt;erinminter@...&gt;","profile":"emint78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442179513","msgId":76172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1NjY0Mzc2LTM3QTQtNDdFMy04RENCLUYyM0I1RERDOUM4OUBpY2xvdWQuY29tPg=="},"prevInTopic":76170,"nextInTopic":76173,"prevInTime":76171,"nextInTime":76173,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"... yes, this is what I guessed may be happening. ... So if a child has been learning naturally all of his life (no remnants of schoolish thinking in parent","messageBody":"<div id=\"ygrps-yiv-769150899\">In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &lt;jfetteroll@...&gt; wrote :<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On Sep 13, 2015, at 9:10 AM, Erin Minter &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; wrote:<br/>\n&gt; <br/>\n&gt;&gt; My question is what about a child who is interested in a specific subject - e.g. biology, math, history - and the child **wants** to take a particular class taught by a teacher. <br/>\n&gt; <br/>\n&gt; It&#39;s a question that&#39;s difficult to answer without falsely reassuring those who are still deschooling that unschooling might look like school.<br/>\n<br/>\n </span></blockquote>yes, this is what I guessed may be happening.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooled kids sometimes take classes. Kat took fun interest driven classes from the time she was little. Most were art based.<br/>\n&gt; <br/>\n&gt; When she was 14, Kat took her father&#39;s college statistics class for fun. Because she did it for fun, because she could drop it, because she didn&#39;t feel she had to, it still looked like unschooling. (But I wouldn&#39;t use it as an example of unschooling. It makes it harder to understand what unschooling is.)<br/>\n<br/>\n </span></blockquote>So if a child has been learning naturally all of his life (no remnants of schoolish thinking in parent nor kid) and *wants* to take a science class which sounds cool and which he could stop at any time, then would unschoolers be fine with that?<br/>\n<br/>\nAnd taking a class with a human person giving you information (which you can take or leave) is not fundamentally that much different than reading a book or a website giving you information (which you can take or leave) or taking an online class giving you information (which you can take or leave) .  The learning all happens in the mind of the learner.  They are in control, still directing the whole process.  what’s a bit different is just the form of the outside information.<br/>\n<br/>\n(Now one problem here, ofc, would be if a child was pressured to be there, or couldn’t stop going if it became boring, etc.  But that’s not what I’m talking about now.  I’m talking about child choosing, no pressure, no coercion, exploring their interests which happen to involve a class this month.)<br/>\n<br/>\nMy guess is that most longtime radical unschooling parents would be cool with this.  Am i right?<br/>\n<br/>\n<br/>\nHowever, when radical unschoolers are giving advice to people, they are trying to solve another problem too — namely not being misunderstood and not having their advice result in keeping people stuck in “school” mode.<br/>\n<br/>\nSo when questions about classes or instruction are brought up, they maybe cringe a bit.  Because SO MUCH of the time children taking classes and instruction involve such nasty things like subtle pressure, manipulation, force and thinking mistaken thoughts, such as children can’t learn without an external authority directing that process.<br/>\n<br/>\nIn my first email I asked this:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there a conflict between “supporting the child’s interests” and “learning thru living and not having instruction”?<br/>\n&gt; <br/>\n&gt; Do radical unschoolers reject instruction in general? Do they make a clear distinction between unwanted and wanted instruction? <br/>\n<br/>\n </span></blockquote>Do radical unschoolers make a distinction between unwanted and wanted instruction?  <br/>\n<br/>\nI’m guessing yes they do.  But it’s not clear to me.  It seems they are sort hush-hush about it because they want to help people move away from schoolish-type thinking and are afraid that talking about instruction or classes will hinder that goal.<br/>\n<br/>\nDoes this sound right to you?<br/>\n<br/>\nOne thing I wonder though is if this has the side effect of turning some parents off from academic-type subjects in general?  what do you think?  <br/>\n<br/>\nDo you think some radical unschoolers subtly dissuade their children from taking academic classes which have some sort of instructor?  Do some unschoolers think it’s better to learn via a book or own your own compared to taking a class with an actual teacher?<br/>\n<br/>\n(Again the classes I’m thinking of are all of the type where the child can drop at any time.  There is no pressure to continue or take the class.  The parent could even pay for the class ahead of time and the child decides to only go to 1 class or half a class to see what it’s like, and that would be fine.  This is all discussed in advance and child understands all of this.)<br/>\n<br/>\nDo radical unschoolers think a setting like that which involves *instruction* is fundamentally wrong in some way?  Or is it specifically *unwanted* instruction which is the problem?  <br/>\n<br/>\nYet that distinction (unwanted vs wanted) isn’t really talked about much because of fear of being misinterpreted?<br/>\n<br/>\nAnd do you think unschoolers think *wanted* instruction is fine for swimming lessons or driving lessons, but get a bit bothered if the subject is math for example?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She took a college sports writing course but she struggled with that one. The subject interested her but the type of thinking she needed to do was a bit over her head at 14. That looked a lot less like unschooling.<br/>\n&gt; <br/>\n&gt; Then her dad convinced her to take pre-calculus so she didn&#39;t need to waste future college time on pre-college classes. That ended up looking nothing like unschooling and very much like school.<br/>\n<br/>\n </span></blockquote>regardless of “how it looks”, objectively was it a problem?  or was it the right choice for her?<br/>\n<br/>\nIn general, sometimes I wonder if some unschoolers are hesitant to do things which make them no longer “look” like unschoolers, regardless of whether the thing in question is the right thing to do or not.  Often, people like to fit into a group.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The thing is, once you understand unschooling, then you won&#39;t need to ask this question. One, you&#39;ll know when your child is schooling and when your child is taking a class because it sounded fun.<br/>\n<br/>\n </span></blockquote>Ya, I think taking classes because they are fun to someone is a great idea.  <br/>\n<br/>\nBut again, maybe you worry that people who are new to unschooling who hear this sort of thing will continue to pressure their kids / force their kids / continue to try to make their lives resemble school?<br/>\n<br/>\nPerhaps by talking about unschoolers freely taking classes for fun *because they WANT to*, you are afraid it will keep others too much in school-mode.  As opposed to learning to live as if school doesn’t exist.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would further say that it&#39;s very unlikely that a deschooled child will choose a general class like history or biology. It&#39;s just as unlikely as a child who has a few hundred well-written popular books on science to choose from would choose a general history textbook.<br/>\n<br/>\n </span></blockquote>So what happens if they do?  What advice would you give to a parent who’s child wants to try out a science class or something where they do experiments and other fun stuff?<br/>\n<br/>\nI don’t see any downsides to trying a class like that as long as the child can stop going.<br/>\n<br/>\nI DO see a downside to giving that advice if the ***main problem unschoolers are trying to solve*** is not having people who are new to unschooling misinterpret things and think that school classes are something to push for despite the kid’s resistance.<br/>\n<br/>\nSo what then?  Don’t give out advice like that for fear of being misunderstood?<br/>\n<br/>\nBut does that have ramifications?  Do some radical unschoolers end up having a bias against academic stuff?  Do some have a bias against ALL human instruction regarding academic-type subjects (even *wanted* instruction)?<br/>\n<br/>\nErin Minter</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442177852","msgId":76170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4NTQ4NUY4LTE0NDMtNDdBOC04MzUwLTdBRjg5MEQ1OUUxREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDJBRjYwQTA4LTM0REUtNEZCOS1CN0RCLTFCQ0M5NzgxN0M3RkBpY2xvdWQuY29tPg==","referencesHeader":"PDJBRjYwQTA4LTM0REUtNEZCOS1CN0RCLTFCQ0M5NzgxN0M3RkBpY2xvdWQuY29tPg=="},"prevInTopic":76169,"nextInTopic":76172,"prevInTime":76169,"nextInTime":76171,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"By telling us what you think you understand, you re not opening yourself to learn more, or to discover that what you understand is getting in your way. -=-I","messageBody":"<div id=\"ygrps-yiv-1182335401\">By telling us what you think you understand, you&#39;re not opening yourself to learn more, or to discover that what you &quot;understand&quot; is getting in your way.<br/>\n<br/>\n-=-I understand how instruction or teaching does not equate to learning. The child - the learner - is the one who always controls what is learned. You can’t force knowledge into a child’s mind.-=-<br/>\n<br/>\nLearners don&#39;t &quot;control what is learned.&quot;<br/>\nYou&#39;re not going to control what you learn from this discussion, for example.  <br/>\n<br/>\n-=-I also understand that you can learn through living life. It’s a mistake to think of learning as something separate from life. Kids will learn lots and lots things just by living in a vibrant environment which supports their interests.-=-<br/>\n<br/>\nIF the children and the parents succesfully and thoroughly deschool themselves (which will take a year or two of careful attention for an adult, and a month per school/schoolish year for kids), then kids will learn lots just by living in a rich environment.  IF SCHOOLING IS CLUNG TO, a rich environment might be ignored, rejected or resented.<br/>\n<br/>\n-=-It’s a mistake to think of learning as something separate from life.-=-<br/>\n<br/>\nIf unschooling is the goal, then moving toward that goal means beginning gradually, and increasingly, to see the learning in all aspects of life.  It can&#39;t happen all the time.  It doesn&#39;t happen from reciting or asserting a summary fact.<br/>\n<br/>\nGradually move toward really understanding.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/doit\">http://sandradodd.com/doit</a><br/>\n<br/>\nThose three can go together.  But don&#39;t read them schoolishly (fast and looking for key points).  Read them over a week, gradually, as poetry, stopping to think and sleep.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/readalittle\">http://sandradodd.com/readalittle</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442176584","msgId":76169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0OTVCNkFGLUI2QjMtNDEyNC05MTdFLTM2N0QxNzgyQTc5QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PERDOEY1MjBDLUMzOTUtNDhFMC1BNjU0LTRGREJDREY2RTZFRkB2ZXJpem9uLm5ldD4=","referencesHeader":"PDJBRjYwQTA4LTM0REUtNEZCOS1CN0RCLTFCQ0M5NzgxN0M3RkBpY2xvdWQuY29tPiA8REM4RjUyMEMtQzM5NS00OEUwLUE2NTQtNEZEQkNERjZFNkVGQHZlcml6b24ubmV0Pg=="},"prevInTopic":76167,"nextInTopic":76170,"prevInTime":76168,"nextInTime":76170,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"Crucial and I hope people don t miss this: Joyce closed her post with  parents can cling to school approaches until their kids leave home and never actually","messageBody":"<div id=\"ygrps-yiv-1496584808\">Crucial and I hope people don&#39;t miss this:  <br/>\nJoyce closed her post with &quot; parents can cling to school approaches until their kids leave home and never actually unschool.&quot;<br/>\n<br/>\nI have some things collected that apply to the original question.  But before leaving links I want to say that at first, classes should be avoided.  It will keep the parents from deschooling.  It will keep the child from deschooling.   Without deschooling, unschooling never can or will take off.<br/>\n<br/>\nThe Three Stages of Unschooling, by Kelly Lovejoy<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kellylovejoy/stages\">http://sandradodd.com/kellylovejoy/stages</a><br/>\n<br/>\nLearning to See Differently (various writings, not as easy as the link above, but could be very helpful:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/newview\">http://sandradodd.com/peace/newview</a><br/>\n<br/>\nDeschooling<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling/\">http://sandradodd.com/deschooling/</a><br/>\n<br/>\nThere are no shortcuts for deschooling.  There are absolutely detours that can make it take years, or forever.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unwanted vs wanted instruction","postDate":"1442173380","msgId":76167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERDOEY1MjBDLUMzOTUtNDhFMC1BNjU0LTRGREJDREY2RTZFRkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDJBRjYwQTA4LTM0REUtNEZCOS1CN0RCLTFCQ0M5NzgxN0M3RkBpY2xvdWQuY29tPg==","referencesHeader":"PDJBRjYwQTA4LTM0REUtNEZCOS1CN0RCLTFCQ0M5NzgxN0M3RkBpY2xvdWQuY29tPg=="},"prevInTopic":76166,"nextInTopic":76169,"prevInTime":76166,"nextInTime":76168,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"... It s a question that s difficult to answer without falsely reassuring those who are still deschooling that unschooling might look like school. Unschooled","messageBody":"<div id=\"ygrps-yiv-1585369573\"><blockquote><span title=\"ireply\">&gt; On Sep 13, 2015, at 9:10 AM, Erin Minter &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; wrote:<br/>\n&gt; <br/>\n&gt; My question is what about a child who is interested in a<br/>\n&gt; specific subject - e.g. biology, math, history - and the child<br/>\n&gt; **wants** to take a particular class taught by a teacher. <br/>\n<br/>\n </span></blockquote>It&#39;s a question that&#39;s difficult to answer without falsely reassuring those who are still deschooling that unschooling might look like school.<br/>\n<br/>\nUnschooled kids sometimes take classes. Kat took fun interest driven classes from the time she was little. Most were art based.<br/>\n<br/>\nWhen she was 14, Kat took her father&#39;s college statistics class for fun. Because she did it for fun, because she could drop it, because she didn&#39;t feel she had to, it still looked like unschooling. (But I wouldn&#39;t use it as an example of unschooling. It makes it harder to understand what unschooling is.)<br/>\n<br/>\nShe took a college sports writing course but she struggled with that one. The subject interested her but the type of thinking she needed to do was a bit over her head at 14. That looked a lot less like unschooling.<br/>\n<br/>\nThen her dad convinced her to take pre-calculus so she didn&#39;t need to waste future college time on pre-college classes. That ended up looking nothing like unschooling and very much like school.<br/>\n<br/>\nThe thing is, once you understand unschooling, then you won&#39;t need to ask this question. One, you&#39;ll know when your child is schooling and when your child is taking a class because it sounded fun. Two, you&#39;ll know that having a bunch of unschoolers say a class is unschooling won&#39;t make it unschooling if a child or parent hasn&#39;t deschooled.<br/>\n<br/>\nThe parents who ask about history and biology classes generally haven&#39;t deschooled. If their kids are interested in such classes, it&#39;s generally because the kids haven&#39;t deschooled.<br/>\n<br/>\nI would further say that it&#39;s very unlikely that a deschooled child will choose a general class like history or biology. It&#39;s just as unlikely as a child who has a few hundred well-written popular books on science to choose from would choose a general history textbook.<br/>\n<br/>\nUntil both parents and kids know that school isn&#39;t necessary, that school classes replace building connections with memorizing facts, then kids choosing classes aren&#39;t unschooling. If a child chooses a class, it&#39;s very likely that the parent is eager to see learning that looks like school, and the child hasn&#39;t had enough opportunity or support to experience learning through freely exploring their interests.<br/>\n<br/>\nQuite often that parent *won&#39;t want* to examine why a class might not be unschooling. The parent doesn&#39;t want to understand how natural learning is profoundly different than what a child gets in a class. That parent wants the benefit of unschooling without having to go through the discomfort of letting go of school.<br/>\n<br/>\nIt&#39;s like clinging to the side of the pool while you kick your feet and wanting to call it swimming. It&#39;s even less like that since most people *will* let go and eventually swim. But parents can cling to school approaches until their kids leave home and never actually unschool.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":559765020,"authorName":"Erin Minter","from":"Erin Minter &lt;erinminter@...&gt;","profile":"emint78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unwanted vs wanted instruction","postDate":"1442149816","msgId":76166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJBRjYwQTA4LTM0REUtNEZCOS1CN0RCLTFCQ0M5NzgxN0M3RkBpY2xvdWQuY29tPg=="},"prevInTopic":0,"nextInTopic":76167,"prevInTime":76165,"nextInTime":76167,"topicId":76166,"numMessagesInTopic":0,"msgSnippet":"Hi.  I have a question about instruction. I understand how instruction or teaching does not equate to learning.  The child - the learner - is the one who","messageBody":"<div id=\"ygrps-yiv-1648913526\">Hi.  I have a question about instruction.<br/>\n<br/>\nI understand how instruction or teaching does not equate to learning.  The child - the learner - is the one who always controls what is learned.  You can’t force knowledge into a child’s mind.<br/>\n<br/>\nI also understand that you can learn through living life.  It’s a mistake to think of learning as something separate from life.  Kids will learn lots and lots things just by living in a vibrant environment which supports their interests.<br/>\n<br/>\nMy question is what about a child who is interested in a specific subject - e.g. biology, math, history - and the child **wants** to take a particular class taught by a teacher.  <br/>\n<br/>\nBased on the philosophy of radical unschooling, how would a parent respond to this?  Is there a conflict between “supporting the child’s interests” and “learning thru living and not having instruction”?<br/>\n<br/>\nDo radical unschoolers reject instruction in general?  Do they make a clear distinction between unwanted and wanted instruction?  <br/>\n<br/>\nLike in this quote:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/radical\">http://sandradodd.com/unschool/radical</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In different discussions over the years I&#39;ve seen different distinctions made about &quot;radical.&quot; Sometimes it involves whether there is any instruction. Some people want to teach math facts and reading and other than that they&#39;re unschooling. They&#39;re not radical unschoolers.<br/>\n<br/>\n </span></blockquote>Do radical unschoolers reject *any* instruction?  Even genuinely wanted instruction?<br/>\n<br/>\nChildren take swimming lessons or driving lessons from teachers.  But what about an academic subject which the child is interested in taking?<br/>\n<br/>\nAlso, do you think the age of the child matters regarding whether instruction is ok or not?  I think lots of teens take academic-type classes, but what about a younger child who is interested in something like that?<br/>\n<br/>\nLastly, do unschoolers think of voluntarily (where they could stop attending if they no longer wanted to go) taking a class being taught by a teacher as somehow different than online instruction or reading a book on their own with no outside instruction?<br/>\n<br/>\nThanks, <br/>\n<br/>\nErin Minter</div>","specialLinks":[]}],"prevTopicId":76113,"nextTopicId":76204}}