{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;having adult time&quot;  (was Evolution, and kids not wanting to be left alone at night)","postDate":"1319068767","msgId":63495,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3bm84dis5bDBnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM1NEY5NTRGLTQ3NjktNEY5My05QzA3LTZEQTMwOTZCRTFGQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63489,"nextInTopic":0,"prevInTime":63494,"nextInTime":63496,"topicId":63367,"numMessagesInTopic":0,"msgSnippet":"... ================== I wish they would add that into the statistics about the safety of co-sleeping.  To my knowledge, no baby has ever been abducted from","messageBody":"<div id=\"ygrps-yiv-2041002120\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; &quot;I might not leave this note up always, but today, October 6, 2011, on Good Morning America, they said 278 infants have been abducted in the U.S. since 1983. Many were from hospitals, but most were with their parents, or in the house in another bed. Co-sleep. Carry children. Keep hospital-born newborn infants with you in your own room if at all possible.&quot;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/sleep/cosleeping\">http://sandradodd.com/sleep/cosleeping</a><br/>\n&gt; <br/>\n </span></blockquote>==================<br/>\n<br/>\nI wish they would add that into the statistics about the safety of co-sleeping.  To my knowledge, no baby has ever been abducted from her sleeping mother&#39;s arms.  <br/>\n<br/>\nI find it incredible that leaving a sleeping child alone for 6-12 hours even when sober is considered good parenting.  Parenting doesn&#39;t stop when the child goes to sleep.  If the child was awake, leaving them alone for even an hour or two is considered neglect.  But if the child is asleep (or they think the child is asleep- maybe they are thirsty or hungry or lonely), somehow that&#39;s ok?!  <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] &quot;having adult time&quot;  (was Evolution, and kids not wanting to be left alone at night)","postDate":"1319044272","msgId":63489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJBOUM1MURBLUQ5MjktNEIzMC1BRjQzLTQxMTA3N0YwQjc3N0B5YWhvby5jb20+","inReplyToHeader":"PEM1NEY5NTRGLTQ3NjktNEY5My05QzA3LTZEQTMwOTZCRTFGQ0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEUyQUNFQ0Q3LUMzNjAtNENBNS05REZBLTY4Q0JBMzc2Mjk2OEBTYW5kcmFEb2RkLmNvbT4gPEM1NEY5NTRGLTQ3NjktNEY5My05QzA3LTZEQTMwOTZCRTFGQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63479,"nextInTopic":63495,"prevInTime":63488,"nextInTime":63490,"topicId":63367,"numMessagesInTopic":0,"msgSnippet":"... When DD1 was our only child, I told DH that I did not feel comfortable with relatives (his parents and sister when we visited them) drinking while caring","messageBody":"<div id=\"ygrps-yiv-544884736\">-----If you drink, don&#39;t get drunk. If you MUST get drunk, have a babysitter.  &quot;Adult time&quot; should be in the company of adults, not at the same time as &quot;responsible parenting time.&quot;-----<br/>\n<br/>\nWhen DD1 was our only child, I told DH that I did not feel comfortable with relatives (his parents and sister when we visited them) drinking while caring for her.  I didn&#39;t feel comfortable with DH drinking while caring for her -- he&#39;s a chef who drinks daily.  I told him, &quot;We would never hire a babysitter who was drinking on the job.  Why is it OK for family to drink while watching our daughter?  What if some emergency occurred and our daughter needed to be driven away?  How do we know if the people watching her are sober enough to drive?&quot;<br/>\n<br/>\nThankfully, my MIL brought up not drinking around our daughter on her own and I never had to broach the subject with them as my in-laws drink daily, too.<br/>\n<br/>\nI seldom drink, and when I do, it is one glass of wine or a beer.  I have taken it upon myself to be responsible for our girls&#39; safety.  DH enjoys his beer and when DD1 had an ER need late one night, I was grateful that though DH probably was fine to drive, I knew that I would always be fine to drive.<br/>\n<br/>\nCeci</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"&quot;having adult time&quot;  (was Evolution, and kids not wanting to be left alone at night)","postDate":"1319037355","msgId":63479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1NEY5NTRGLTQ3NjktNEY5My05QzA3LTZEQTMwOTZCRTFGQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEUyQUNFQ0Q3LUMzNjAtNENBNS05REZBLTY4Q0JBMzc2Mjk2OEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PEUyQUNFQ0Q3LUMzNjAtNENBNS05REZBLTY4Q0JBMzc2Mjk2OEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":63420,"nextInTopic":63489,"prevInTime":63478,"nextInTime":63480,"topicId":63367,"numMessagesInTopic":0,"msgSnippet":"This is about parenting and safety, responsibility and duty. Last week when i was watching a morning news show hoping to see an article about unschooling, I","messageBody":"<div id=\"ygrps-yiv-1671246489\">This is about parenting and safety, responsibility and duty.<br/>\n<br/>\nLast week when i was watching a morning news show hoping to see an article about unschooling, I saw one on a baby that had been abducted.  After seeing that, I added a note to my co-sleeping page.  <br/>\n<br/>\n&quot;I might not leave this note up always, but today, October 6, 2011, on Good Morning America, they said 278 infants have been abducted in the U.S. since 1983. Many were from hospitals, but most were with their parents, or in the house in another bed. Co-sleep. Carry children. Keep hospital-born newborn infants with you in your own room if at all possible.&quot;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/sleep/cosleeping\">http://sandradodd.com/sleep/cosleeping</a><br/>\n<br/>\nMore information came in about that situation, and although co-sleeping still would&#39;ve helped, that wasn&#39;t the biggest problem.  I&#39;m quoting a little of an updated article from a few days ago.<br/>\n<br/>\n********************<br/>\nShe put Lisa down in her room around 6:40 p.m., she says. Only once more soon afterward did she check on Lisa, finding her standing in her crib before tucking her back in. <br/>\n<br/>\nThen, as the other children of the two next-door-neighbor moms watched a movie inside, Bradley tapped the box of wine that she&#39;d bought earlier that evening, and she and her friend spent much of the evening chatting outside on the front stoop. <br/>\n<br/>\n&quot;I had several glasses of wine,&quot; Bradley tells Fox. More than five? &quot;Probably.&quot; Asked if she was concerned she might be drunk with her infant daughter inside, Bradley replied, &quot;She was sleeping. I don&#39;t have a problem with me having adult time.&quot; <br/>\n. . . .<br/>\nShe adds: &quot;People are going to think what they think. Those people that are out there judging me, please, just look for her.&quot;<br/>\n********************<br/>\n<br/>\nHer lawyer says that admitting she was drunk only proves she&#39;s honest.<br/>\n<br/>\nHonesty and drunkenness don&#39;t equal good parenting.<br/>\nThe one time she did check, the baby was standing up in her crib.  Not asleep.<br/>\n<br/>\nTo think a baby could sleep as long as an adult could be passed out is not smart.  To be the only parent home and to get so drunk she doesn&#39;t remember whether she closed the door and turned off the lights is neglect.  The defense is going to say that the neighbor thinks she remembers seeing the lights in the house go off.  Because the mom can&#39;t swear that she had turned the lights off.  <br/>\n<br/>\nI&#39;m not glad someone took the baby, but I had an aunt who was the sort of drinker who left her children alone, in the house, at the bar.  My parents raised two of my cousins because of that.  <br/>\n<br/>\nIf you drink, don&#39;t get drunk.  If you MUST get drunk, have a babysitter.<br/>\n&quot;Adult time&quot; should be in the company of adults, not at the same time as &quot;responsible parenting time.&quot;<br/>\n<br/>\nI do have a problem with people &quot;having adult time&quot; when it means they aren&#39;t there for their children.<br/>\n<br/>\nOf course I hope the baby is found safe, but I can&#39;t help picturing someone hearing a baby crying and the mom being asleep.  If a crying baby doesn&#39;t wake up a drunk mom, and an intruder doesn&#39;t wake up a drunk mom...  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Evolution, and kids not wanting to be left alone at night.","postDate":"1318685509","msgId":63420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCRDM1NkI5LTE2NzUtNDcxOS1BOEI5LTUyMTI0RUZGRkNDNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEUyQ0ZEMjkxLUJDRDgtNEQ4NC1CRUVGLTFGMUI1N0UxMDRDQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDEzMTg2NTc2MDkuODc0MzIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjAzMTkubWFpbC5iZjEueWFob28uY29tPiA8RTJDRkQyOTEtQkNEOC00RDg0LUJFRUYtMUYxQjU3RTEwNENBQHZlcml6b24ubmV0Pg=="},"prevInTopic":63416,"nextInTopic":63479,"prevInTime":63419,"nextInTime":63421,"topicId":63367,"numMessagesInTopic":0,"msgSnippet":"-=-Being able to survive isn t the same as thriving.-=- Yes. I ve broken my leg once and later (same leg) my ankle.  There s a difference between being able to","messageBody":"<div id=\"ygrps-yiv-308734973\">-=-Being able to survive isn&#39;t the same as thriving.-=-<br/>\n<br/>\nYes.  <br/>\nI&#39;ve broken my leg once and later (same leg) my ankle.  There&#39;s a difference between being able to walk once the cast is off, and in REALLY being able to walk a long way, confidently and strongly.   If the &quot;recovery&quot; from being in an orphanage is in that range, it&#39;s a big range--from being able to function very carefully and a little fearfully, to not even thinking about it as one runs and jumps.<br/>\n<br/>\n-=- from nearly <br/>\nthe first moment of their lives external from my body I&#39;ve been touching and <br/>\nbreathing them. I&#39;ve been setting up biofeedback loops of love and patience and <br/>\nunderstanding. I have overlapped myself with them.-=-<br/>\n<br/>\nThis links (in my head) to the discussion last week about whether it&#39;s fantasy or justification to think that being with a child all the time has real relational advantages over having him in school during the day, or at boarding school.  I don&#39;t think Schuyler is imagining things.  I think she was (as Caren phrased it last week) becoming close and caring, and growing as a parent.<br/>\n<br/>\nSeparation is separation, whether it&#39;s in a bed in the other room with the mom trying to learn to go against her nature and ignore the baby&#39;s cries, or it&#39;s daycare or school.  There are costs beyond the finances.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Evolution, and kids not wanting to be left alone at night.","postDate":"1318675852","msgId":63416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyQ0ZEMjkxLUJDRDgtNEQ4NC1CRUVGLTFGMUI1N0UxMDRDQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMTg2NTc2MDkuODc0MzIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjAzMTkubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PDEzMTg2NTc2MDkuODc0MzIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjAzMTkubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":63414,"nextInTopic":63420,"prevInTime":63415,"nextInTime":63417,"topicId":63367,"numMessagesInTopic":0,"msgSnippet":"... How was long-term damage determined? There are children surviving on the streets of Brazil (and India and Africa). They ve adapted. But what have they","messageBody":"<div id=\"ygrps-yiv-162662340\">On Oct 15, 2011, at 1:46 AM, ceci wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; the baby can adapt to most anything, even a cry-it-out situation  <br/>\n&gt; without supposed long-term damage.<br/>\n<br/>\n </span></blockquote>How was long-term damage determined?<br/>\n<br/>\nThere are children surviving on the streets of Brazil (and India and  <br/>\nAfrica). They&#39;ve adapted. But what have they given up, what were they  <br/>\ndeprived of that allows them to survive without what we&#39;re  <br/>\nbiologically wired to expect? What kind of people do they grow up to  <br/>\nbe? What do they value? What are they able to return?<br/>\n<br/>\nAdaptable shouldn&#39;t be equated with getting your needs met. Being able  <br/>\nto survive isn&#39;t the same as thriving.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Evolution, and kids not wanting to be left alone at night.","postDate":"1318674771","msgId":63414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg2NzQ3NzEuNzU4NTMuWWFob29NYWlsUkNAd2ViODczMDcubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":63413,"nextInTopic":63416,"prevInTime":63413,"nextInTime":63415,"topicId":63367,"numMessagesInTopic":0,"msgSnippet":"================== I remember reading something in Lise Eliot s book, What s Going on in There about how the first 6 months (or maybe a year) of an infant s","messageBody":"<div id=\"ygrps-yiv-546362705\">==================<br/>\n<br/>\n<br/>\nI remember reading something in Lise Eliot&#39;s book, &quot;What&#39;s Going on in There&quot; <br/>\nabout how the first 6 months (or maybe a year) of an infant&#39;s life, the baby can <br/>\nadapt to most anything, even a cry-it-out situation without supposed long-term <br/>\ndamage.  It seemed to make sense to me -- that an infant&#39;s brain be most <br/>\nadaptable in its earliest stage of development so that it had the greatest <br/>\nchance of survival in its new environment.  <br/>\n<br/>\n<br/>\n=====================<br/>\n<br/>\nThe other day, on the radio, there was a programme about Romanian Orphans <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/programmes/b015p62y\">http://www.bbc.co.uk/programmes/b015p62y</a> -- although it may not be playable <br/>\noutside of the UK) and in  and amongst the stories there was a point at which <br/>\nthey said that children who had been in the orphanages for less than 6 months <br/>\nrecovered fully and those children who were in the orphanages for longer than 6 <br/>\nmonths, most recovered fully, although there were some who had long term issues. <br/>\nI wonder, not knowing at all, if that is some part of where the 6 months cut off <br/>\nis coming from? <br/>\n<br/>\n<br/>\nIt seems to me a false understanding of what damage can be caused, or not <br/>\ncaused, to an infant. Those Romanian children didn&#39;t stay in their crap <br/>\nenvironment. And when they did leave their environment recovery could occur. It <br/>\ndoesn&#39;t seem to me that the plasticity was what protected the children, although <br/>\ngiven that many of the children who&#39;d been in the orphanages longer than 6 <br/>\nmonths recovered well may argue against me. It seems to me that it was the <br/>\nremoval from the orphanage that made the difference. So, if 6 months is your lag <br/>\ntime, do you need to radically change your child&#39;s environment by 6 months and 1 <br/>\nday? Or are they then, mostly, buffered against any damage that is within the <br/>\nsame vein as the damage begun at birth? <br/>\n<br/>\n<br/>\n================<br/>\n<br/>\nIf Lise Eliot is right, I almost wonder if the roots of a fear-based culture <br/>\nlike we have in America could come from something like a radical departure in <br/>\nhow hunter-gatherers have been helping their children to sleep for thousands of <br/>\nyears.  If by 6 months, an infant can learn that no one answers when you are <br/>\nafraid, when you cry -- does that create a human who never trusts anyone to be <br/>\nthere for her?<br/>\n<br/>\n===============<br/>\n<br/>\nOur neighbours have just had their first child. I hear him cry and cry and I <br/>\nwant to swoop in and pick him up and love him and hold him close. But my life is <br/>\na luxury. Their lives require that after her 6 month maternity leave she go back <br/>\nto work. They aren&#39;t examining their lives purpose in the same way that David <br/>\nand I did. They have to work in this first 6 months to get their child ready to <br/>\nbe cared for by others. Knowing that helps me to see things in a different <br/>\nlight, in a sadder light, but a less evangelical light (maybe) than I have <br/>\nbefore. My babies were lucky. Still are lucky. Touch and comfort and holding and <br/>\nnot crying very much at all was their first 6 months. <br/>\n<br/>\n<br/>\nThere was an NICHD study done about attachment and daycare and time first in <br/>\ndaycare and one of the findings was that children who were in daycare were more <br/>\nprecocious. They hit academic bars earlier than those children who stayed home <br/>\nlonger. The back side of that finding was that children who were in daycare at <br/>\nyounger ages were more aggressive, more likely to be reactive in a situation in <br/>\na negative way. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/articles/200505/the-trouble-day-care\">http://www.psychologytoday.com/articles/200505/the-trouble-day-care</a> is a review <br/>\nof the findings. At the end of that brief glance of a review is this statement: <br/>\n<br/>\n<br/>\n<br/>\nNumber of hours in day care equals a percentage of bad behavior* <br/>\nLess than 10: 10 percent.<br/>\n10 to 30: 17 percent.<br/>\nMore than 45: then 26 percent.<br/>\n<br/>\n*As reported by mothers. Source: NICHD.<br/>\n<br/>\nThe &quot;as reported by mothers&quot; is interesting to me. And I think it is part of my <br/>\nunderstanding of children. It is possible that I could define things that Simon <br/>\nand Linnaea do as &quot;bad behavior&quot;, but I don&#39;t see them that way. Part of why I <br/>\ndon&#39;t see them that way, those behaviours, my children, is because from nearly <br/>\nthe first moment of their lives external from my body I&#39;ve been touching and <br/>\nbreathing them. I&#39;ve been setting up biofeedback loops of love and patience and <br/>\nunderstanding. I have overlapped myself with them. The women who are finding bad <br/>\nbehaviour in their children at higher rates are with their children less. That <br/>\nmay not mean anything, but it may mean that there is some observer bias in the <br/>\nfindings. <br/>\n<br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"ceci","from":"ceci &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [AlwaysLearning] Evolution, and kids not wanting to be left alone at night.","postDate":"1318657609","msgId":63413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg2NTc2MDkuODc0MzIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjAzMTkubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PDEzMTg0OTc3NDcuNzI0MTYuWWFob29NYWlsUkNAd2ViODczMDEubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":63380,"nextInTopic":63414,"prevInTime":63412,"nextInTime":63414,"topicId":63367,"numMessagesInTopic":0,"msgSnippet":"... I was reading to my 2 and 5 year olds last night and we were looking at an illustration of a baby laughing her first laugh.  The baby was in her crib by","messageBody":"<div id=\"ygrps-yiv-661545874\">parenthetical notes added by me:<br/>\n<br/>\n----- And while they are both pleased, Jamie (parent) also comments that Mabel (baby) can never trust them to be there for her again. -----<br/>\n<br/>\nI was reading to my 2 and 5 year olds last night and we were looking at an illustration of a baby laughing her first laugh.  The baby was in her crib by herself at nighttime and the laugh was the beginning of a fairy&#39;s existence in the story.<br/>\n<br/>\nMy 2 year old asked me where the baby&#39;s mama and papa were.  The story had very little to do with the baby, but it dawned on me that because my girls have always enjoyed the family bed with either mama or papa reading to them, singing to them, telling them stories and falling asleep with them in the same bed that this picture of a baby all alone at night in a crib was odd to them.<br/>\n<br/>\nI told them that the baby was in a crib which is where some babies sleep at night.  They had seen cribs before, but never in the context of nighttime sleep.  Cribs were things for their dolls in playspaces or a bassinet might be for a stroller -- this is not where children or babies fell asleep.<br/>\n<br/>\nI remember reading something in Lise Eliot&#39;s book, &quot;What&#39;s Going on in There&quot; about how the first 6 months (or maybe a year) of an infant&#39;s life, the baby can adapt to most anything, even a cry-it-out situation without supposed long-term damage.  It seemed to make sense to me -- that an infant&#39;s brain be most adaptable in its earliest stage of development so that it had the greatest chance of survival in its new environment.  But, I instinctively felt that I could not leave my baby to cry.  When I (or my husband) would &#39;bed-down&#39; our children and quietly leave the bed after one or both were asleep, we always would run to them when they would awake crying in the middle of the night.  Friends and family warned us of spoiling our children.<br/>\n<br/>\nUnlike the example from Mad About You above, I wanted a bond of trust between me and my children -- that I would do my best to be there for them when they needed me.  If Lise Eliot is right, I almost wonder if the roots of a fear-based culture like we have in America could come from something like a radical departure in how hunter-gatherers have been helping their children to sleep for thousands of years.  If by 6 months, an infant can learn that no one answers when you are afraid, when you cry -- does that create a human who never trusts anyone to be there for her?<br/>\n<br/>\nCeci<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Evolution, and kids not wanting to be left alone at night.","postDate":"1318497747","msgId":63380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg0OTc3NDcuNzI0MTYuWWFob29NYWlsUkNAd2ViODczMDEubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PEUyQUNFQ0Q3LUMzNjAtNENBNS05REZBLTY4Q0JBMzc2Mjk2OEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PEUyQUNFQ0Q3LUMzNjAtNENBNS05REZBLTY4Q0JBMzc2Mjk2OEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":63367,"nextInTopic":63413,"prevInTime":63379,"nextInTime":63381,"topicId":63367,"numMessagesInTopic":0,"msgSnippet":"I ve written almost exactly the same ideas for a book chapter for Valerie Fitzenreiter in a book that was never, at least to my knowledge, published: The","messageBody":"<div id=\"ygrps-yiv-1429388386\">I&#39;ve written almost exactly the same ideas for a book chapter for Valerie <br/>\nFitzenreiter in a book that was never, at least to my knowledge, published: <br/>\n<br/>\n<br/>\n<br/>\nThe television program Mad About You had an episode where Jamie and PaulBuckman <br/>\nFerberize their daughter Mabel, which ran when Simon was about 8 months old. At <br/>\nthe end of the episode, after standing at the door of Mabel’s all-by-herself <br/>\nroom waiting the 5, 10 and 15 minutes required by Ferber’s method to check in <br/>\nand tell her they were there for her, after agonizing over the right and the <br/>\nwrong of it, Mabel finally does fall asleep. And while they are both pleased, <br/>\nJamie also comments that Mabel can never trust them to be there for her again. <br/>\nFor me the choice not to allow Simon to cry himself to sleep was less about that <br/>\nkind of philosophizing and more about the fact that if I lived as humans have <br/>\nlived for thousands of years, letting Simon cry it out would ensure his death. <br/>\nSomething predatory would take an infant abandoned in the bush. Surely that must <br/>\nbe a stressful evolutionary moment for a human infant. It seemed to me then, as <br/>\nit does now, that helping my baby avoid stressful moments was an important part <br/>\nof being his mother.<br/>\n<br/>\n-------------<br/>\n<br/>\nNot that Dr. Peter Gray would know that, but just sayin&#39;...<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wednesday, 12 October, 2011 22:04:13<br/>\nSubject: [AlwaysLearning] Evolution, and kids not wanting to be left alone at <br/>\nnight.<br/>\n<br/>\nI like this a lot.<br/>\n<br/>\nWhy Young Children Protest Bedtime: A Story of Evolutionary Mismatch<br/>\nThe monsters under the bed are real.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn/201110/why-young-children-protest-bedtime-story-evolutionary-mismatch\">http://www.psychologytoday.com/blog/freedom-learn/201110/why-young-children-protest-bedtime-story-evolutionary-mismatch</a><br/>\n<br/>\n<br/>\nWhen my kids were little and they slept with me and Keith, or I slept with them <br/>\nin the next room (variously, variably), and people would ask about it, I would <br/>\nsay &quot;A fox might have five or six babies, but she doesn&#39;t dig five or six little <br/>\nholes and put one in each hole.&quot;  People would always laugh, and while they were <br/>\nlaughing, I&#39;d say mammals are supposed to sleep together that way.<br/>\n<br/>\nThis is Dr. Peter Gray&#39;s blog at Psychology Today, and he&#39;s asking for <br/>\nresponses, over there in the comments.  <br/>\n<br/>\n<br/>\n<br/>\nPart of the post:<br/>\n***********************<br/>\nMany years ago, the famous behavioral psychologist John B. Watson argued, <br/>\nessentially, that such behavior is pathological and derives from parents&#39; <br/>\noverindulgence and spoiling of children.[1]  Remnants of that view still persist <br/>\nin books on baby care, where the typical advice is that parentsmust be firm <br/>\nabout bedtime and not give in. This, the experts say, is a battle of wills, and <br/>\nyou, as parent, must win it to avoid spoiling your child. <br/>\n<br/>\n<br/>\nBut clearly something is missing in this explanation from the experts. Why do <br/>\ninfants and young children choose to challenge their parents&#39; will onthis <br/>\nparticular issue?  They don&#39;t protest against toys, or sunlight, or hugs (well, <br/>\nusually not). Why do they protest going to bed, when sleep is clearly good for <br/>\nthem and they need it?<br/>\n<br/>\nThe answer begins to emerge as soon as we leave the Western world and look at <br/>\nchildren elsewhere. <br/>\n<br/>\n***********************<br/>\n<br/>\nI&#39;m going to link it from my sleeping page.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Evolution, and kids not wanting to be left alone at night.","postDate":"1318453453","msgId":63367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyQUNFQ0Q3LUMzNjAtNENBNS05REZBLTY4Q0JBMzc2Mjk2OEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":63380,"prevInTime":63366,"nextInTime":63368,"topicId":63367,"numMessagesInTopic":0,"msgSnippet":"I like this a lot. Why Young Children Protest Bedtime: A Story of Evolutionary Mismatch The monsters under the bed are real. ","messageBody":"<div id=\"ygrps-yiv-1255723534\">I like this a lot.<br/>\n<br/>\nWhy Young Children Protest Bedtime: A Story of Evolutionary Mismatch<br/>\nThe monsters under the bed are real.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn/201110/why-young-children-protest-bedtime-story-evolutionary-mismatch\">http://www.psychologytoday.com/blog/freedom-learn/201110/why-young-children-protest-bedtime-story-evolutionary-mismatch</a><br/>\n<br/>\nWhen my kids were little and they slept with me and Keith, or I slept with them in the next room (variously, variably), and people would ask about it, I would say &quot;A fox might have five or six babies, but she doesn&#39;t dig five or six little holes and put one in each hole.&quot;  People would always laugh, and while they were laughing, I&#39;d say mammals are supposed to sleep together that way.<br/>\n<br/>\nThis is Dr. Peter Gray&#39;s blog at Psychology Today, and he&#39;s asking for responses, over there in the comments.  <br/>\n<br/>\n<br/>\nPart of the post:<br/>\n***********************<br/>\nMany years ago, the famous behavioral psychologist John B. Watson argued, essentially, that such behavior is pathological and derives from parents&#39; overindulgence and spoiling of children.[1]  Remnants of that view still persist in books on baby care, where the typical advice is that parentsmust be firm about bedtime and not give in. This, the experts say, is a battle of wills, and you, as parent, must win it to avoid spoiling your child. <br/>\n<br/>\nBut clearly something is missing in this explanation from the experts. Why do infants and young children choose to challenge their parents&#39; will onthis particular issue?  They don&#39;t protest against toys, or sunlight, or hugs (well, usually not). Why do they protest going to bed, when sleep is clearly good for them and they need it?<br/>\n<br/>\nThe answer begins to emerge as soon as we leave the Western world and look at children elsewhere. <br/>\n***********************<br/>\n<br/>\nI&#39;m going to link it from my sleeping page.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":41951,"nextTopicId":62563}}