{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":150551601,"authorName":"Stepheny Cappel","from":"&quot;Stepheny Cappel&quot; &lt;stephc62@...&gt;","profile":"stephc621587","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] UnschoolingDiscussion  Things going on around here","postDate":"1065392297","msgId":82180,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZTcwMWMzOGI4ZSQ5NTI1Yjg4MCRhZDhlZDZkMUBzdGVwaGM2Mj4=","referencesHeader":"PDIwMDMxMDA1LjE0NTQ1OC4tNzI4MjkzLjE1LnNpeHJlZGhlYWRzQGp1bm8uY29tPiA8MDBiOTAxYzM4YjhkJDVlNmRhNzQwJGFkOGVkNmQxQHN0ZXBoYzYyPg=="},"prevInTopic":82178,"nextInTopic":0,"prevInTime":82179,"nextInTime":82181,"topicId":82178,"numMessagesInTopic":0,"msgSnippet":"Ugh I forgot to cut the other stuff off... sorry.  I will try to be more mindful.  Steph [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1349680016\">Ugh I forgot to cut the other stuff off... sorry.  I will try to be more mindful.  Steph<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150551601,"authorName":"Stepheny Cappel","from":"&quot;Stepheny Cappel&quot; &lt;stephc62@...&gt;","profile":"stephc621587","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"UnschoolingDiscussion  Things going on around here","postDate":"1065391777","msgId":82178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYjkwMWMzOGI4ZCQ1ZTZkYTc0MCRhZDhlZDZkMUBzdGVwaGM2Mj4=","referencesHeader":"PDIwMDMxMDA1LjE0NTQ1OC4tNzI4MjkzLjE1LnNpeHJlZGhlYWRzQGp1bm8uY29tPg=="},"prevInTopic":0,"nextInTopic":82180,"prevInTime":82177,"nextInTime":82179,"topicId":82178,"numMessagesInTopic":0,"msgSnippet":"Well since we ve been to the conference things have been kind of cool around here.  I am fighting the schooly stuff altogether and sometimes sitting here just","messageBody":"<div id=\"ygrps-yiv-1184186495\">Well since we&#39;ve been to the conference things have been kind of cool around here.  I am fighting the schooly stuff altogether and sometimes sitting here just reading this list helps more than anyone realizes...  Alyssa is the best unschooler so far LOL, I ask her would she please do something and she says no and I just do it myself or don&#39;t do it because it could be just that I think she needs to do it (Bad mindset)  The best thing is I see the kids learning stuff and I didn&#39;t help or show them anything.  Frankie 9 is sitting in front of the tv patiently waiting for someone elses show to be over so he can watch his and just by looking at the digital clock he knows how much time is left.  He did the subraction in his head which I think is way cool because I couldn&#39;t tell time even into my teens with teachers and lots of &quot;help&quot;.  I asked April to watch a video with me about Paul Gaugin which I enjoyed but she was bored and eventually got up and started walking around and left the room.  Alyssa said no she wouldn&#39;t watch it because it was boring and she knew it was thats all folks LOL.  I just watched it because I wanted to which was cool because I could enjoy it without worrying about what anyone else got out of it.  Caitlin was watching a hooked on phonics commercial and said she couldn&#39;t read was I going to get her that?  I asked her if she wanted it and she said no, and that she couldn&#39;t read and didn&#39;t care.  She is 10 and can read what she wants to but for some reason pretends she cannot.  Yesterday Dad told them they could walk around the block, and they stopped to talk to my sil at her daughters house.  They were not supposed to stay so long so he grounded Caitlin because she failed to tell the others they couldn&#39;t stay.  I don&#39;t know his reason.  But a friend was there that was amazed that Frank spoke so calmly to our children when he was disappointed at the time because she has to holler at her children.  I got to jump in about peaceful parenting and that her children could to listen with out screaming.  He listened and then today let Caitlin off her grounding on a matter of trust.  I thought that was good, because he is just following my lead, having read no materials etc. on unschooling or peaceful parenting that I know of.    Alyssa and I did spend alot of time at neopets the other day playing and feeding her little pets... and had alot of fun.  Just thought I&#39;d share.  Stepheny<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Tia Graham <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Sunday, October 05, 2003 2:54 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] on playing for life<br/>\n<br/>\n<br/>\n  &lt;&lt;<br/>\n  I am really struck by the concept of &quot;obedience obstacles&quot; - what a<br/>\n  great phrase. But now I&#39;m nervous that I am not catching your meaning.<br/>\n  Do you mean that you were putting things in the way of them being<br/>\n  obedient to your wishes, or goals for them?&gt;&gt;<br/>\n<br/>\n  &lt;&lt;My mom sometimes wanted something done JUST ONE WAY, her way.  And she<br/>\n  was <br/>\n  more likely to want that when she had no idea on earth WHY she did it<br/>\n  &quot;her way.&quot; &gt;&gt;<br/>\n<br/>\n  Yes, Sandra&#39;s example was what I was talking about. I made arbitraray<br/>\n  things &quot;right&quot; or &quot;wrong&quot;. This was back in authoritarian parenting days.<br/>\n  When they didn&#39;t do things the way I dictated was &quot;right&quot;, they then were<br/>\n  defying me...kind of a double negative.<br/>\n<br/>\n  So it would look like this:<br/>\n  I&#39;d decide snack for the day was crackers. It&#39;s not right or wrong to<br/>\n  have fruit or crackers or cheese for a snack..but I created a &quot;right&quot; by<br/>\n  dictating it.<br/>\n<br/>\n  My kids, would then decide they weren&#39;t hungry for crackers, and refuse<br/>\n  to eat them, and ask repeatedly for something else.<br/>\n<br/>\n  I&#39;d utter *those* words: No, we&#39;re having crackers today &quot;because I said<br/>\n  so&quot; (groan).<br/>\n<br/>\n  They&#39;d refuse. Now I&#39;d feel like I had a differnet problem on my hands.<br/>\n  They didn&#39;t obey my words. So now, discipline would enter the picture,<br/>\n  tears, and &quot;you have to do what Mommy says&quot;. <br/>\n<br/>\n  I had parenting books that actually suggested setting situations up like<br/>\n  this, so that we could &quot;practice&quot; first time obedience. It sounded so<br/>\n  simple at first, but in real life, everything became something I<br/>\n  micro-managed.<br/>\n<br/>\n  When I started learning about non-coercive parenting, I really wanted to<br/>\n  start saying &quot;yes&quot; to my kids more. That meant that first, I had to<br/>\n  analyze the times I said &quot;no&quot;.  What was really going on when I felt<br/>\n  frustrated with them or that they needed punishment? Looking at those<br/>\n  situations, I could see that there were sooo many times when what they<br/>\n  wanted wasn&#39;t something &quot;wrong&quot; and I had the power to say &quot;yes&quot; without<br/>\n  any negative consequences. It was a process, and I&#39;d see things honestly<br/>\n  in steps as I went.<br/>\n<br/>\n  So now, if I offer crackers but they want fruit, they head to the fruit<br/>\n  bowl on my smile. More often, they just go to the snack cupboard when<br/>\n  they are hungry and help themselves, and I&#39;m not even part of it.<br/>\n<br/>\n  Later came the grief I had to go through when I could empathize with<br/>\n  where my kids had been. Really, &quot;doing what Mommy says&quot; doesn&#39;t *have* be<br/>\n  a hard thing, because the times when parents truely have to be commanding<br/>\n  is pretty rare. It&#39;s probably different for different homes and where<br/>\n  different parents are on things too. Around here, I only get absolute<br/>\n  about stuff like safetly anymore. &quot;No, you can NOT help yourself to the<br/>\n  medicine cabinet when you feel like it. You must get me first.&quot;, said to<br/>\n  a 5 year old.  But when I was adding in all that other stuff, my kids<br/>\n  were bound to &quot;disobey&quot; me hourly! It really was like an obstacle course<br/>\n  in those days and they probably couldnt have won for trying.<br/>\n<br/>\n  It&#39;s been fun letting my kids just &quot;be&quot;. We sure are enjoying our days<br/>\n  together alot more.<br/>\n<br/>\n  Tia in Fl<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  To unsubscribe from this send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":81895,"nextTopicId":82203}}