{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Balance and thoughtfulness","postDate":"1206492640","msgId":33629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5REE2OTEyLTc5NjUtNEMyNy1CN0Q0LTVCOTgzQTY5REVCREBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":33628,"nextInTime":33630,"topicId":33629,"numMessagesInTopic":0,"msgSnippet":"-=-I think i am going to the other extreme with my purse. My mother was totally forbidden to even touch.My husband will not let me touch his wallet. I wanted","messageBody":"<div id=\"ygrps-yiv-2084202710\">-=-I think i am going to the other extreme with my purse. My mother&#39; was<br/>\ntotally forbidden to even touch.My husband will not let me touch his<br/>\nwallet. I wanted to be open with Lukas about it but seems to be not  <br/>\nsuch a good idea,right?-=-<br/>\n<br/>\nI have few thoughts.<br/>\n<br/>\nEven if everybody on this list unanimously said &quot;good idea&quot; or &quot;bad  <br/>\nidea,&quot; that wouldn&#39;t make it so.  Needing other people&#39;s approval  <br/>\nisn&#39;t good.<br/>\n<br/>\nIf I think he shouldn&#39;t be digging through your purse, WHY do I think  <br/>\nthat?  Maybe that&#39;s what you could be thinking.  Why did your mom not  <br/>\nwant people in hers?  Why does your husband not want you in his?   <br/>\nMaybe his mom used to get into it.  Maybe they&#39;re going along with  <br/>\nthe tradition of having one little private place.  It IS a tradition,  <br/>\nthat wallets aren&#39;t dug through.  If you go to prison, they go  <br/>\nthrough your wallet.  If you&#39;re in a car wreck, someone will look at  <br/>\nthe ID, but they won&#39;t go through every movie stub and family photo.<br/>\n<br/>\nTo live in reaction to one&#39;s mom&#39;s rules is still letting the mom  <br/>\ncontrol the situation.  It&#39;s still being a child.<br/>\n<br/>\nTo want to allow one&#39;s child to not only get into one&#39;s purse but  <br/>\npull things out (the money out!) in front of one&#39;s mom, at the mom&#39;s  <br/>\nhouse, seems to me to be (potentially) a passive aggressive show of  <br/>\ndefiance and rejection.   You probably didn&#39;t mean to use your son to  <br/>\nget back at your mom, but just from the account of it, it seems like  <br/>\na slight-to-probable possibility.<br/>\n<br/>\nMeanwhile, what is your son learning?  Will he think it&#39;s just cool  <br/>\nto go into anyone else&#39;s purse?  Because I can tell you for sure,  <br/>\nit&#39;s not.<br/>\n<br/>\nI don&#39;t look in my sons&#39; wallets.  I don&#39;t look in Holly&#39;s purse.   <br/>\nSometimes they&#39;ve told me something was in there and I could get it  <br/>\n(a key, or my own debit card or something) and so I know they&#39;re very  <br/>\norganized, like their dad, and that&#39;s cool to see, but it&#39;s a place  <br/>\nI&#39;m very occasionally privileged to go, not something that&#39;s my right  <br/>\n(socially; whether legally or not, I don&#39;t care).<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\nA quote from that:  &quot;My favorite &quot;new rule&quot; has always been that  <br/>\nlearning comes first.&quot;<br/>\n<br/>\nWhen deciding what to advise your son to do, or how to explain things  <br/>\nto him, it IS extreme (&quot;I think i am going to the other extreme&quot;) to  <br/>\nchoose to do the opposite of what your mom did.<br/>\n<br/>\nWe had rules at the table when I was a kid.  I didn&#39;t adopt all of  <br/>\nthem, but I considered each one, as my kids got older, and picked up  <br/>\na few other ideas as Keith and I mingled our own families&#39; traditions  <br/>\nand our own quirks.  My dad never walked around without a shirt on.   <br/>\nKeith has sat down at the table without a shirt.  Not cool, said I.   <br/>\nPlease put a shirt on.  He doesn&#39;t like for someone to read at the  <br/>\ntable, so I don&#39;t read if he&#39;s there.  If I&#39;m sitting all by myself,  <br/>\nI do.<br/>\n<br/>\nMy mom said &quot;No singing at the table,&quot; and she was serious.  We might  <br/>\nchoke.  She didn&#39;t want us goofing around.  My kids aren&#39;t told not  <br/>\nto sing, but they chew with their mouths closed, and they have some  <br/>\nmore-formal and less-formal table knowledge, which is useful for when  <br/>\nthey go to fancy restaurants.  They don&#39;t embarrass themselves at  <br/>\nother people&#39;s houses (or not much, I hope).<br/>\n<br/>\nMindfulness and real thought require more than deciding to do as our  <br/>\nparents did or to do the opposite.  Neither of those is balance and  <br/>\nchoice.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":33618,"nextTopicId":33447}}