{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":3979435,"authorName":"Annette Naake","from":"&quot;Annette Naake&quot; &lt;naake1999@...&gt;","profile":"naake1999","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"mad newbie dynamic","postDate":"1040085271","msgId":51932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY2OHZOdVNOR0RRNm9uN2d6M0YwMDAwMDU0MkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":51931,"nextInTime":51933,"topicId":51932,"numMessagesInTopic":0,"msgSnippet":"I think the reason newbies sometimes get offended is that they ll cheerily try to introduce themselves by recounting some ordinary part of their day or ask","messageBody":"<div id=\"ygrps-yiv-1259702653\">I think the reason newbies sometimes get offended is that they&#39;ll cheerily <br/>\ntry to introduce themselves by recounting some ordinary part of their day or <br/>\nask some question and then be caught completely off-guard by what the <br/>\nveterans see as antithetical to unschooling.<br/>\n<br/>\nFor instance, a mom will proudly say that her kid has total choice of  TV in <br/>\nthe one hour of TV he&#39;s allowed a day.  She asks if others have found it&#39;s <br/>\nbetter to allow this TV in the morning, or before bedtime. Then she&#39;s <br/>\nshocked when someone asks why she limits TV at all.  And someone else <br/>\nsuggests she dispense with bedtime! She wasn&#39;t expecting questions along <br/>\nthose lines. No one has ever confronted her with the notion that it&#39;s <br/>\ncounterproductive to limit TV.  She gets defensive and feels like she&#39;s <br/>\nbeing attacked. She might end up unsubbing. Meanwhile, though, a lot of <br/>\nnewbie lurkers out there are having their eyes opened: &quot;You mean, you DON&#39;T <br/>\nhave to limit TV?&quot; &quot;Is there a better way to make sure I get enough sleep <br/>\nand the kids aren&#39;t harangued into going to bed every night?&quot;<br/>\n<br/>\nIn one of my earliest posts to a similar list many moons ago, I boasted that <br/>\nmy schooled kids and I were looking forward to &quot;unschooling&quot; over summer <br/>\nvacation. I listed the exciting projects and plans I had plotted out.  I&#39;m <br/>\nsure you can all imagine the responses (&quot;How do YOU know they want to fly <br/>\nkites and then follow up with a visit to the space museum?&quot; &quot;What if they <br/>\ndon&#39;t want to go?&quot; &quot;If it&#39;s a vacation it&#39;s not unschooling,&quot; etc.). I was <br/>\nquite taken aback. But it did open my eyes.<br/>\n<br/>\nAnother early question I had: &quot;if you let them do what they want all day, <br/>\nhow do you keep them from spending hours just noodling around on the <br/>\ncomputer?&quot; People very patiently opened my eyes to the fact that this might <br/>\nnot be such a bad thing.<br/>\n<br/>\nOver time, my mind has been stretched. I see learning in so many parts of my <br/>\nkids&#39; day that I once would have regarded as &quot;wasted time.&quot;  I have <br/>\ndiscovered the opportunity for learning that exists every moment (waiting in <br/>\nthe dentist&#39;s office this morning, I was asked to explain a comic strip <br/>\nfeaturing Trent Lott and the Ku Klux Klan to my 10yo). I have learned to <br/>\nlook at video games with a new understanding of the problem-solving skills, <br/>\nthe reading and the concentration.  I have learned not to freak out over <br/>\ncurse words and jokes that pop up in movies most people would think were too <br/>\nold for my 5 and 10yo ds. (Exhibit One: &quot;Austin Powers&quot; movies, which the <br/>\nwhole family loves, though a lot of things have to be explained and other <br/>\nthings go swooshing, thankfully, over the kids&#39; heads. THe other night I had <br/>\nto explain the word &quot;shit&quot; to my 5 yo.) I try to say yes to requests and I <br/>\ntry to be as gracious as possible about it. I do NOT feel guilty about <br/>\npursuing my own interests!<br/>\n<br/>\nThese are all things I have learned here. It took a lot of time. I am still <br/>\nlearning. The big debates are most illuminating of all, and I thank Joyce, <br/>\nSandra, Helen, Mary, et al. for having the patience to explain a new way of <br/>\nlooking at things over and over again. I don&#39;t agree with everything. (After <br/>\ntwo kids, a bad back, one bad co-sleeper and one good solo sleeper, I am NOT <br/>\ninto the family bed!) But I am open to hearing about everything. I do love <br/>\nthis list. I hope people choose to stick around, but if they don&#39;t, I&#39;ve <br/>\nthankful to them anyway because I&#39;ve learned during their time here.<br/>\n<br/>\nAnnette<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nThe new MSN 8: advanced junk mail protection and 2 months FREE* <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a></div>","specialLinks":[]}],"prevTopicId":51894,"nextTopicId":51934}}