{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Digest Number 4584","postDate":"1082227444","msgId":92773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwMjgwMWM0MjQ0NiQxOTU2MThjMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":92772,"nextInTopic":0,"prevInTime":92772,"nextInTime":92774,"topicId":92760,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1665316322\">&lt;&lt;So, the question is, how exactlly do I keep records of what he does do?<br/>\nTell me if I am on the right track.<br/>\nThis week he started using the typing tutor program on my computer and got<br/>\nup to 25 wpm on his left hand home keys.<br/>\nHe read 2 books. One was Dr. Jeckyll and Mr. Hyde, and the other is Oliver<br/>\nTwist. I had him tell me what the story was about and I typed it for him for<br/>\nhis portfolio, since he fought me on writing it. I typed it word for word<br/>\nand encouraged more thought on what happened in the books.&gt;&gt;<br/>\n<br/>\nMy first suggestion is to ascertain what the law says about portfolio<br/>\nreviews in your State and talk to others about what they do. Don&#39;t do more<br/>\nthan the law decrees for them to see - only do what you are both enjoying.<br/>\nSome States have no assessment requirements of any kind, and the hoops are<br/>\nadministrative. <br/>\nWhat were you trying to do with the book reports? Didn&#39;t you believe that he<br/>\nhad done the reading? Was he reading these books to please you? Forcing him<br/>\nto dictate or even discuss with you what he has read is still being<br/>\nschoolish - making it about the report instead of his interest in reading<br/>\nwhatever he wants, or not reading. <br/>\nHe needs to deschool. There is a lot on that topic on Sandra&#39;s site.<br/>\n<br/>\nHere is a fairy tale I have been concocting:<br/>\n<br/>\nOnce upon a time there was a place where almost all the people lived on a<br/>\ntrain. The train went forward at a great pace and of course stayed on the<br/>\ntracks, so the view was the same from all the windows. Most of families<br/>\nstayed in the same carriage for the whole journey.<br/>\nSome families didn&#39;t care for the train, so they got on their bicycles<br/>\ninstead. Many of these families followed right beside the train, and pedaled<br/>\nas hard as they needed to, to stay with it. Others followed the increasingly<br/>\nnumerous bike paths that were set up that started at the depot and ended at<br/>\nthe terminus, but were often more winding and scenic than the train route.<br/>\nAt some distance from the tracks, was a garden park that was full of<br/>\nwalkers. The walkers meandered around sometimes, and at other times were<br/>\nseen to be walking briskly forward or even jogging. To the astonishment of<br/>\npassing cyclists, sometimes walkers in the beautiful garden were seen to be<br/>\nlounging around on the grass, or smelling the flowers. As for the people on<br/>\nthe train, they could barely see the garden, let alone notice the<br/>\ninhabitants.<br/>\nAt the gateway to the garden there was always a gate keeper. People who had<br/>\njumped off the train, as well as the occasional passing cyclist would<br/>\ninquire about how to get in, and the gate keeper would smile and say that it<br/>\nwas a walking park, and the only thing inside was foot traffic. Sometimes<br/>\nhostile cyclists would come close to the gate and shout out that the walkers<br/>\nweren&#39;t going anywhere and should be cycling also, or try to show off with<br/>\ntrick riding, but the walkers would always just keep walking, sitting,<br/>\njogging or dancing along, having such a good time that lots of folks<br/>\nabandoned their bikes and joined in.<br/>\nOne day a cyclist arrived at the gate and wanted to go cycling in the park,<br/>\nbecause it looked so beautiful. <br/>\nThe gate keeper said, &quot;This is a walking park. There are no directions, or<br/>\nmaps, or paths.&quot;<br/>\nThe cyclist replied, &quot;But this is a free country and I should be able to<br/>\ncycle if I want to.&quot;<br/>\nThe gate keeper said, &quot;Then go cycle. There are hundreds of bike paths, but<br/>\nthis is a walking park.&quot;<br/>\nThe cyclist said, &quot;You can get along so much faster on a bike. There are<br/>\nfewer distractions. Biking is better.&quot;<br/>\nThe gate keeper said, &quot;Biking is not better in a walking park. The people<br/>\nwho are walking here have agreed that no-one can ride a bike in here. Your<br/>\nbike will be perfectly safe outside the gate if you ever want to come out<br/>\nand use it.&quot;<br/>\nThe cyclist went off in a huff, but was back the next day. <br/>\nShe said, &quot;What if I agree to walk, can I go in and carry my bike?&quot;<br/>\n<br/>\nWalking in the beautiful park is way harder if you are hauling around your<br/>\nuseless bike.<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.658 / Virus Database: 421 - Release Date: 4/9/2004</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Digest Number 4584","postDate":"1082226113","msgId":92772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1cnNrMStvMGp2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjgwMWM0MjQ0NiQxOTU2MThjMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":92771,"nextInTopic":92773,"prevInTime":92771,"nextInTime":92773,"topicId":92760,"numMessagesInTopic":0,"msgSnippet":"... do? Welcome to the list! I have a 7 yo son and began unschooling in December. What state are you living in? You may be doing more than you have to do. I","messageBody":"<div id=\"ygrps-yiv-1343315750\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &lt;robertgrace@b...&gt; <br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, the question is, how exactlly do I keep records of what he does <br/>\n </span></blockquote>do?<br/>\n<br/>\nWelcome to the list! I have a 7 yo son and began unschooling in <br/>\nDecember.<br/>\n<br/>\nWhat state are you living in? You may be doing more than you &quot;have&quot; <br/>\nto do. <br/>\n<br/>\n<br/>\nI had him tell me what the story was about and I typed it for him for<br/>\n<blockquote><span title=\"ireply\"> &gt; his portfolio, since he fought me on writing it. I typed it word <br/>\n </span></blockquote>for word<br/>\n<blockquote><span title=\"ireply\"> &gt; and encouraged more thought on what happened in the books.<br/>\n<br/>\n </span></blockquote>Does the portfolio require this? (I live in Michigan, and we don&#39;t <br/>\nhave to satisfy any requirements here, so i am not that familiar with <br/>\nwhat a portfolio should look like.)Maybe it would be better for you <br/>\nto just list the books he&#39;s read? Or if you have to include something <br/>\nabout the books, ask him (during the course of the day)how he liked <br/>\nthe book, what was interesting about it...more like a conversation <br/>\nrather than &quot;writing a report for the portfolio&quot;...i know my son <br/>\nwould NOT want to sit down and do this formally. Too much like school <br/>\nfor him.<br/>\n<br/>\nThe rest of your day sounded like fun. I bet your son is so much <br/>\nhappier now than in school! If you post where you live, other list <br/>\nmembers who live in that state could give insight on requirements.<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Digest Number 4584","postDate":"1082225041","msgId":92771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGQwMWM0MjRhNiQ1ZDEyYzllMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDEwODIwNzQ4MjcuNjgyLjQ0NjY2Lm0xMkB5YWhvb2dyb3Vwcy5jb20+IDwwMDI4MDFjNDI0NDYkMTk1NjE4YzAkNjEwMWE4YzBAbGF1bmNobW9kZW0uY29tPg=="},"prevInTopic":92760,"nextInTopic":92772,"prevInTime":92770,"nextInTime":92772,"topicId":92760,"numMessagesInTopic":0,"msgSnippet":"From:  ","messageBody":"<div id=\"ygrps-yiv-2113057339\">From: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robertgrace@...\">robertgrace@...</a>&gt;<br/>\n<br/>\n&lt;&lt;We went to the pet store and played with a Bull Mastiff pup. we have two<br/>\npugs at home, it was neat playing with the big one. They say Pugs are the<br/>\ntoy of the Mastiff.<br/>\nI did some research and can&#39;t find where they are related anywhere?<br/>\nAnyway do I have the idea???&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nWell it sounds like you are off to a great start. Doing what interests you<br/>\nboth and enjoying it. I think I would check and see about unschoolers in my<br/>\nstate as far as what is required by law and go from there as to what you<br/>\nhave to do to fulfill that need. It might not be even as extensive as what<br/>\nyou are keeping now. Sometimes there are loopholes like joining a private<br/>\nschool with a homeschool option that can help.<br/>\n<br/>\nAs far as the dog thing, we have a bullmastiff. They are a cross between a<br/>\nbulldog and a mastiff, both coming from England. Pugs come from Asia and<br/>\nlater on, I have read that pugs were crossed with bulldogs to get them<br/>\nsmaller. But that was after the bullmastiffs. So the bulldogs may have some<br/>\npug in them but bullmastiffs do not. It&#39;s all pretty sketchy really and<br/>\ndepends on where the info comes from.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":170899757,"authorName":"robertgrace@bellsouth.net","from":"&lt;robertgrace@...&gt;","profile":"gracie01_1999","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Digest Number 4584","postDate":"1082183696","msgId":92760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjgwMWM0MjQ0NiQxOTU2MThjMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDEwODIwNzQ4MjcuNjgyLjQ0NjY2Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":92771,"prevInTime":92759,"nextInTime":92761,"topicId":92760,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I am a new unschooler. My name is Gracie. My son is Michael, he is 13. I started homeshooling right after Christmas break as he has a few ","messageBody":"<div id=\"ygrps-yiv-1425860952\">Hi everyone, I am a new unschooler. My name is Gracie. My son is Michael, he<br/>\nis 13. I started homeshooling right after Christmas break as he has a few<br/>\nproblems. He has Obsessive Compulsive Disorder and real bad Anxiety.<br/>\nSeparation Anxiety???Who knows. But I was just totally exhausted trying to<br/>\nget him up in the mornings when he can&#39;t get to sleep by a reasonable time.<br/>\nEven with medication. I was also exhausted from getting phone calls every<br/>\nday making sure I was going to pick him up right after school. I had already<br/>\nmoved him out of public school because of his problems, he needed smaller<br/>\nclass size. Can&#39;t remember much except what is important to him. Also<br/>\nrepeats a whole lot. Couldn&#39;t focus well somedays because he was repeating<br/>\nin his head.<br/>\nI started out continuing using the workbooks that the christian school was<br/>\nusing but again, ran into anxiety issues. If he didn&#39;t want to do it, he<br/>\nwould just scribble in the pages. If I didn&#39;t sit and go over each of his<br/>\nassignments with him as he did them, he would guess at the answers.<br/>\nNow the funny thing is that he is really smart. He is well thought of,<br/>\npeople have a hard time believing that someone so outgoing could suffer with<br/>\nAnxiety, but it is chemical. Not emotional.<br/>\nSo, here we are. I can&#39;t not make him do anything he doesn&#39;t want to do any<br/>\nlonger. 3 and  a half months of fighting is all I could take.<br/>\nSo, the question is, how exactlly do I keep records of what he does do?<br/>\nTell me if I am on the right track.<br/>\nThis week he started using the typing tutor program on my computer and got<br/>\nup to 25 wpm on his left hand home keys.<br/>\nHe read 2 books. One was Dr. Jeckyll and Mr. Hyde, and the other is Oliver<br/>\nTwist. I had him tell me what the story was about and I typed it for him for<br/>\nhis portfolio, since he fought me on writing it. I typed it word for word<br/>\nand encouraged more thought on what happened in the books.<br/>\nHe played yahtzee with me about 40 times, even played it by himself a whole<br/>\nbunch.<br/>\nHe helped me chop carrotts and potatoes for dinner and is some help(not too<br/>\nmuch) at picking up our home.<br/>\nWe went to chucky cheese today and had pizza and played games.<br/>\nWe went to Pier 1 imports and both got a candle.<br/>\nWe went to the pet store and played with a Bull Mastiff pup. we have two<br/>\npugs at home, it was neat playing with the big one. They say Pugs are the<br/>\ntoy of the Mastiff.<br/>\nI did some research and can&#39;t find where they are related anywhere?<br/>\nAnyway do I have the idea???<br/>\nLet me know. I love your site Sandra.<br/>\nAny other sites would be helpful.<br/>\nThanks,<br/>\nGracie</div>","specialLinks":[]}],"prevTopicId":92770,"nextTopicId":92780}}