{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":470047657,"authorName":"bragdontina","from":"&quot;bragdontina&quot; &lt;bragdontina@...&gt;","profile":"bragdontina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: unschooling with &quot;special needs&quot;","postDate":"1351817381","msgId":69576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2djViNSt2MWwzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPg=="},"prevInTopic":69570,"nextInTopic":0,"prevInTime":69575,"nextInTime":69577,"topicId":69559,"numMessagesInTopic":0,"msgSnippet":"Like Rebecca and Maria, I too am an unschooling parent who has a child labelled special needs and this is my first posting to the group as well after joining","messageBody":"<div id=\"ygrps-yiv-1470949843\">Like Rebecca and Maria, I too am an unschooling parent who has a child labelled &quot;special needs&quot; and this is my first posting to the group as well after joining a few months ago.  I have to say a hearty AMEN to Rebecca as well when she was so thankful about all the lists, blog posts, etc that have helped her.  I have always unschooled my kids (BTW I also have a 12yr old dd) and have just been so encouraged as well by all the people like Joyce, Pam Sorooshian, Sandra, Ronnie Maier, Anne Ohman, Pam Larrichia, etc who have shared their ideas in audio and print, so generously.  I have been discouraged at times (even remember posting and getting encouragement from these ladies way back when unschooling.info and unschooling.com existed and I was getting my feet wet in the whole paradigm shift/brain warp unschooling was at first, adn still is at times but less so thankfully) and let me tell you what a blessing they have been to me.<br/>\n<br/>\nTo get right to it, I have a ds who is 9 who has a genetic disorder with an extra gene in a specific spot on one of the chromosomes in the first of the 23 pairs one has (1q21.1 microduplication....only 50 to 60-ish people or so worldwide are diagnosed, with the deletion of this gene being much more common).  He was diagnosed young, at the age of 3 1/2, and has been in intervention (OT/PT/Speech) since...this was a kid who had to crawl up the stairs partway at age 4, who still can&#39;t ride a bike, who has very light shaky large printing due to his motor strength issues, who has issues with &quot;executive functioning/organization&quot;, presents as &quot;ADD&quot; (whatever the hell that is, LOL), has speech delays both in articulation and verbal expression of ideas, etc etc ad nauseum.......at least this is how it has been presented in all those OT/PT reports. All those of you who have had these reports and have read assessments (as I just did in a meeting with his OT today incidentally) have seen this jargon I am sure.<br/>\n<br/>\nWhat has unschooling done for me/us in this situation I have found myself in? I think the biggest concept has been to see him as, well...HIM, and all the strengths he has and for the sweet good natured boy he is, that there is more to him that just the educational-ese they have pegged him with and the shortcomings they see him as having...after all, he is not a product.  After all, that just goes with the whole unschooling philosophy of living without the trappings of school.  <br/>\n<br/>\nJulie/the original poster, I know your child is young, and yes it is normal to be scared of the future.  You can&#39;t see it after all.  I am too, at times, but I always stop and remind myself that the only &quot;comparison&quot; there should be is my child to himself, of keeping a sparkly unschooling life that allows him to be the best he can be and that we just need to focus on what brings him joy on his own path....even me with a bit more experience in this journey had to remind myself of that walking into that OT meeting today.  By keeping him at home (yes, with some great ideas from the OTs, PT, and speech therapist, but nonetheless trying to have him live a life free and pure of judgements and standards to meet as possible), I can see now what a gift unschooling has been.  <br/>\n<br/>\nI recall the quote (from somewhere in unschooling cyber-space) &quot;...the learning is in the living&quot;.  Ds has had opportunites to gradually deal with the world, like ordering his own food in a restauraunt, even when his speech was much harder to understand at a younger age, and get confidence from that, without being thrown into a school situation where he was teased/bullied.. I have seen his confidence soar, he can be in Boy Scouts completely independent of me, something I would have not predicted a few years ago.  To see his self esteem intact compared to other &quot;special needs&quot; kids I know has been HUGE.  He can have a break at home and bounce when he needs to.  Everyone had been panicking about his writing which has been pretty limited...when he plays with his Lego instead of me forcing him to the table to &quot;do writing practice&quot; he develops his fine motor skills and my o my look what has flowed from that...drawing, wanting to labeling his pictures, wanting to make stories, making Lego Ninjago comics, etc etc.  It&#39;s at 9 he is doing this, but really, big deal.  I see it all the time...that meaningful learning.  I could go on and on in this vein.  I used to think &quot;really?&quot; when I first was learning about this way back when, but now it is so neat to be seeing and living it.<br/>\n<br/>\nI really believe we are given the children we have in order to help us to grow.  .  I have been so humbled by my experience, by the words of the ladies on this and other unschooling places, and had a &quot;smarten-up-smack-upside the head&quot; moment or two as well, believe me. Uncomfortable, making me a bit defensive at times, but then I have changed and grown.   I wouldn&#39;t say I have &quot;arrived&quot; already at this point and am perfect, but unschooling in a &quot;special needs&quot; situation has made me patient, able to see how I judge sometimes, how I worry about what others think, how I sometimes don&#39;t &quot;BREATHE!&quot; and live in the now and overthink things, how I grew up unquestioning so many &quot;have-to&#39;s&quot;.  It has given me a family dynamic that I didn&#39;t have growing up...seeing my kids as people, not adults in training....AND peace and joy and fun (usually!) I could go on and on and on...my family and myself would not be where we are today.<br/>\n<br/>\nI hope this has been a help to someone. Thanks for the opportunity to share.<br/>\n<br/>\nTina<br/>\n <br/>\n<br/>\n  <br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;julie day&quot; &lt;julie@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Friends --<br/>\n&gt; <br/>\n&gt; My 5yo daughter has down syndrome, and I am wondering if any of you can share stories of how kids -- whom &quot;experts&quot; argue need all their services (therapies etc) IN SCHOOL -- do simply by living as a whole person in a nurturing &quot;radical unschooling&quot; environment. I&#39;m sure they do, I just need to hear positive stories :)<br/>\n&gt; <br/>\n&gt; Thanks!<br/>\n&gt; <br/>\n&gt; Julie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling with &quot;special needs&quot;","postDate":"1351787206","msgId":69570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERERUQwNzBELTFGMjEtNDNEOC1BRDE4LUM2Q0U2N0NCRUJCQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENPTDExMC1XMzY5OUUxRjRFQTcyODQ1QzREMDYwREQwNjAwQHBoeC5nYmw+","referencesHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPiA8Q09MMTEwLVczNjk5RTFGNEVBNzI4NDVDNEQwNjBERDA2MDBAcGh4LmdibD4="},"prevInTopic":69569,"nextInTopic":69576,"prevInTime":69569,"nextInTime":69571,"topicId":69559,"numMessagesInTopic":0,"msgSnippet":"Mari, I was glad to read your progress and your decision to stop trying to condition your daughter to be just as happy whether you re there or not. For the","messageBody":"<div id=\"ygrps-yiv-297480511\">Mari,<br/>\n<br/>\nI was glad to read your progress and your decision to stop trying to condition your daughter to be just as happy whether you&#39;re there or not.<br/>\n<br/>\nFor the future of your relationship, and for a better understanding of natural learning, though, please reconsider this: <br/>\n<br/>\n-=-She is a great only child actually, never whinging at my feet with boredom if I am busy doing something not involving her-=-<br/>\n<br/>\n&quot;To whinge&quot; is a strong accusation.  Whinging isn&#39;t known in American English.  Whinge rhymes with &quot;hinge,&quot; and it involves whining, but with more intent and with specific complaints.  It&#39;s a way to insult someone&#39;s unhappy communication.  <br/>\n<br/>\nIF your daughter does get bored, it doesn&#39;t mean she&#39;s no longer a great child.  It would more likely mean you weren&#39;t being the greatest mom. :-)<br/>\n<br/>\nIf you decide to keep her home instead of sending her to school, the times that you&#39;re doing something that doesn&#39;t involve her should be fewer than you might have if she were a student in school.  That might sound harsh, but you see how it&#39;s going with trying to get her to accept separation.  It&#39;s possible to be too separate even in the same room.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/boredom\">http://sandradodd.com/boredom</a><br/>\nFind ways to stop seeing boredom as the sin of a bad child.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":514937957,"authorName":"twotoddlersonepuppy","from":"&quot;twotoddlersonepuppy&quot; &lt;rfarrin@...&gt;","profile":"twotoddlersonepuppy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: unschooling with &quot;special needs&quot;","postDate":"1351780490","msgId":69569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2dTFhYSs1amE0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPg=="},"prevInTopic":69567,"nextInTopic":69570,"prevInTime":69568,"nextInTime":69570,"topicId":69559,"numMessagesInTopic":0,"msgSnippet":"Hi all, This my first post on the list, so thank you everyone for everything you have shared so far that has made my home more peaceful and joyful! I think my","messageBody":"<div id=\"ygrps-yiv-725630026\">Hi all,<br/>\n<br/>\nThis my first post on the list, so thank you everyone for everything you have shared so far that has made my home more peaceful and joyful! I think my family&#39;s story may be helpful to this conversation.<br/>\n<br/>\nWhen I adopted my kids about 13 months ago, they were both heavily involved in special education services, especially my daughter who has Marfan Syndrome, low vision and &quot;global developmental delays&quot;, but also my son who was &quot;delayed&quot; and having sensory issues and other effects of prenatal exposure to alcohol. They are currently 3.5 and 5 years old.<br/>\n<br/>\nI will focus on my daughter who is school age and who I received the most advice for how to handle.  I was told that she might not ever potty-train or talk (beyond mimicking) and would likely need to be a full-time special education student in school. When she moved into our home, she was seeing around 30 different professionals between doctors, teachers, therapists and DHS people. <br/>\n<br/>\nWithin a few weeks of my children&#39;s arrival in my home, I started devouring every bit of information I could find on alternatives because I immediately felt that this wasn&#39;t going to be live able for any of us! I came across Sandra&#39;s site, and later, this list, and life has changed dramatically for us!<br/>\n<br/>\nI slowly withdrew both kids from all professionals except the most essential (I.e. eye doctors), transitioned my kids slowly to more freedom and free time and found a counselor for my daughter who agreed with my approach. One year later, my daughter is potty-trained, talks constantly (sharing plenty of her own independent thought!) and most people who meet her would call her quirky but charismatic. She makes friends easily and I suspect that her previous teachers would be shocked if they had an opportunity to see her now!  How?? She learned to talk from watching t.v. With me beside her to repeat phrases and answer the endless question &quot; What they doing?&quot;. She has learned letters and is beginning to read because of t.v. And the iPad, on games such as Starfall ABC, the Meet the Letters/sight words app, videos, podcasts (especially Sesame Street). As it turns out, my daughter needs a lot of repetition while in a safe environment to learn.  The specialized preschool with constant comings and goings if strangers was too unsettling for her!  She loves to act out her own stories while I write them down and read them back to her. She has a passion for Barbie that I would NOT have encouraged with my heavy feminist background, but I did not interfere and instead encouraged and supported this passion, and her storytelling has really taken off! While we have faced many attachment challenges as a result of my kids&#39; foster care experiences and my own difficult childhood experiences, our home has experienced so much positive as a direct result of moving &quot;slowly but quickly&quot; into unschooling.<br/>\n<br/>\nSo, in addition to hoping this example will be of service to others, it is also an opportunity to say thank you so much to everyone on this list whose posts, books, blogs, etc. have influenced our family.<br/>\n<br/>\nCheers,<br/>\nRebecca<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;julie day&quot; &lt;julie@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Friends --<br/>\n&gt; <br/>\n&gt; My 5yo daughter has down syndrome, and I am wondering if any of you can share stories of how kids -- whom &quot;experts&quot; argue need all their services (therapies etc) IN SCHOOL -- do simply by living as a whole person in a nurturing &quot;radical unschooling&quot; environment. I&#39;m sure they do, I just need to hear positive stories :)<br/>\n&gt; <br/>\n&gt; My son is 8, and hated all school (just missed me ... never &quot;got over it&quot;), so I pulled him out of first grade. We&#39;ve been unschooling for almost 2 years. Until a few weeks ago, I restricted TV and video games for them both and felt guilt-ridden when I allowed my instincts sway (that visual, game-based, music-filled media can be compelling on many levels). Anyway, I downloaded the audio from the 2010 Life Is Good unschooling conference specifically to hear Pam Sorooshian&#39;s &quot;Fearless Unschooling&quot; talk. Hearing that her (and others&#39;) kids lived with an atmosphere of trust and support (and media) instead of control and suspicion -- and turned out BRILLIANT and HAPPY -- has left me walking on air. (Thanks Pam!!)<br/>\n&gt; <br/>\n&gt; Which brings me to my daughter, who learned sign language at 2 and is now beginning to read all because of Signing Time, Blues Clues, Elmo, and the webpage starfall.com. She just can&#39;t get enough of all those things. In fact, she wanted to keep watching Blues Clues last night at 11:30 pm, so (this is the new me), I set up the dvd player for her in bed while we all went to sleep. Until now, she&#39;s had much less control in her life than her brother -- with hospital stays, feeding tube for 4 years, she hates getting teeth brushed, and she is fiesty about it! So realizing I can TRUST her ideas/requests (even if they don&#39;t make sense to me) takes the adversariality out our relationship, and I am profoundly grateful for the idea of radical unschooling for existing, and to you veterans for helping the community.<br/>\n&gt; <br/>\n&gt; Radical unschooling is against the grain in so many ways (but it feels so normal to me I&#39;m not worried about it), but doing it with a child with a big label is doubly so. I&#39;m just looking for moral support!<br/>\n&gt; <br/>\n&gt; Thanks!<br/>\n&gt; <br/>\n&gt; Julie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":346626599,"authorName":"guideforthree","from":"&quot;guideforthree&quot; &lt;tinaboster@...&gt;","profile":"guideforthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: unschooling with &quot;special needs&quot;","postDate":"1351774742","msgId":69567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2dHJtbSszdWQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPg=="},"prevInTopic":69565,"nextInTopic":69569,"prevInTime":69566,"nextInTime":69568,"topicId":69559,"numMessagesInTopic":0,"msgSnippet":"My middle child is on the autism spectrum.  At five years old he was diagnosed with Asperger s Syndrome.  He was in a private school with speech and OT","messageBody":"<div id=\"ygrps-yiv-1883618660\">My middle child is on the autism spectrum.  At five years old he was diagnosed with Asperger&#39;s Syndrome.  He was in a private school with speech and OT services provided by the public school system.  The speech services focused on articulation (which was not really a problem) and ignored his problems with pragmatic skills and expressive language.  The OT could not get the equipment my son needed (such as a weighted vest) because the district was underfunded.  Thus, when we pulled him out of the private school at six years old we also stopped the services he was recieving because the were not actually helping him.<br/>\n<br/>\nMy boy blossomed while unschooling.  I was able to control his sensory input and I have spent the past couple of years teaching him to identify his triggers and ask for help when he feels a meltdown coming.  When he was in school he would just walk around alone on the playground because he did not know how to join in to other children&#39;s activities.  While unschooling he has the support of his older brother in social situations, and through his older brother he has learned to initiate play with new children on the playground.<br/>\n<br/>\nWhen he was 10 years old, he decided he wanted to try school again because he thought it might be a good way to meet neighborhood friends (his best friend had just moved from a house down the street to a house 30 minutes away). This turned out to be a very bad situation.  All of the stimming (chewing of furniture and self, hand flapping, etc) that had disappeared while unschooling came back in full force accompanied by toe walking (which we had never seen before).  On top of this, all of his services were focused on helping him get higher standardized test scores.  He never even recieved the OT he was supposed to get.  He never found the friends he was looking for... just a bunch of bullies who made fun of him on the playground (that was really hard to watch).  Thankfully, he had enough after nine weeks and called it quits.<br/>\n<br/>\nFortunately, the stimming stopped immediately when we pulled him out of school for the second time.  Unfortunately, his button aversion turned into a full-fledged button phobia while he attended school.  I was able to find a fabulous private OT through our family physician who has spent the last year helping us though the button issues.  Trevor absolutely adores her.  He was discharged from therapy last week.  Today is the first Thursday in a year that he will not go to OT.  Also, last week my little guy, who used to have a full on panic attack when faced with a button, gave me a hug while I was wearing buttons.  Trevor&#39;s therapist coordinated a dog training therapy group that Trevor now attends.  She is also putting together a lego therapy group and trying to form a sensory friendly boy scout pack.  These are the types of things that Trevor needs and enjoys, and there is no way the school system could provide them.<br/>\n<br/>\nTrevor is 12 years old now, and thanks to our family&#39;s unschooling journey, most of the time when people look at Trevor they see Trevor... not autism.  Not only has unschooling been a blessing, but the school system was actually counter productive.  It took two years to undo the damage that was done in nine weeks.  Also, the therapists available in the private sector are usually much better than the ones available in the system.  Sometimes we come up against challenges we can not handle on our own (such as Trevor&#39;s button phobia), but we do not have to turn to the school system for help.<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":143555554,"authorName":"Maria Willmott","from":"Maria Willmott &lt;mw1370@...&gt;","profile":"piscean30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] unschooling with &quot;special needs&quot;","postDate":"1351745121","msgId":69565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENPTDExMC1XMzY5OUUxRjRFQTcyODQ1QzREMDYwREQwNjAwQHBoeC5nYmw+","inReplyToHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPg=="},"prevInTopic":69564,"nextInTopic":69567,"prevInTime":69564,"nextInTime":69566,"topicId":69559,"numMessagesInTopic":0,"msgSnippet":"Hi Julie and Always Learning Friends, My name is Maria, I am from Australia and joined this group yesterday. I thought I would take a little time to introduce","messageBody":"<div id=\"ygrps-yiv-951302757\">Hi Julie and Always Learning Friends,<br/>\n<br/>\nMy name is Maria, I am from Australia and joined this group yesterday. I thought I would take a little time to introduce myself.<br/>\n<br/>\nI am the only parent of a beautiful little 3 and a half year old girl named Rachael.<br/>\nSince her birth, just for her being her, she has led me down the path of attachment parenting and more recently, educating at home/unschooling.<br/>\nHer presence in my life was a huge surprise for me, but after she was born, the surprises kept coming - we found out she was born with an extra chromosome (Down Syndrome). Luckily, Rachael has been blessed with good health so far, with not too many troubles from the extra chromosome - more typical than not.<br/>\nSo thanks for letting me join your group, I hope to share and learn from discussions.<br/>\n<br/>\nJulie, I certainly hear you when you talk about &quot;going against the grain&quot;, especially when a label has already been placed on your child.<br/>\n<br/>\nMy path to unschooling began when Rachael was having difficulty separating from me when attending her Early Intervention (EI) groups. The Therapists/Teachers (experts) that were working with Rachael were expressing concern to me that she needed to &quot;practice&quot; being away from me in order to become more independant. From next year she was expected to attend centre based EI (where she would be in a classroom type setting with 5 other children and 2 teachers/therapists) and I would be required to leave her there for the 6 hours.<br/>\nAll of our EI up to this point has been with me involved. So Rachael&#39;s Individual Education Plan (IEP) for this year has been to learn to separate from me in readiness for next year, and then of course, school the year after.<br/>\n<br/>\nWell needless to say, Rachael has &quot;failed&quot; miserably at attaining the goal of that IEP. We have been &quot;practicing&quot; all year with lots of tears and heartbreak for both of us. She hates when I leave the room, and I hate hearing and seeing her crying to the point of sobbing from outside of the room. So I just end up helping her to &quot;fail&quot; her IEP goals by going back into the room as driven by my instincts. I also know, through lots of research, from an attachment parenting perspective, that Rachael will learn nothing at all whilst in this state of upset and whilst stress hormones such as cortisol are flooding her brain.<br/>\n<br/>\nAll this is probably painting a picture of Rachael being a very needy and clingy child. In fact she is quite the opposite, she is a pure joy to parent. At home with me, she plays independantly, either by herself, or with a friend, just as long as she knows I am there. With family members that she knows, she is quite happy to wave me goodbye at the door, and stay with them with no tears at all. In fact, every Saturday and Sunday, I go to work for 4 hour shifts, and I leave her with my parents, and sometimes she doesn&#39;t want to come home!!! She is a great only child actually, never whinging at my feet with boredom if I am busy doing something not involving her, she just goes off and amuses herself. Rachael is just quite a sensitive child who is very attached to her Mum, and doesn&#39;t enjoy or trust being left with strangers.<br/>\n<br/>\nSo with all this stress for Rachael and I, with the separating practice not working, I wondered what I would do the first day of school in 2014 if she still hadn&#39;t learnt to leave me. I then announced one day to the Therapist working with Rachael that I will have to keep her at home. At the beginning of the year it would never had occurred to me to keep Rachael at home to learn. But since that realisation, I have researched home schooling and more recently have looked more into unschooling. Also a few weeks ago, I made the very bold move to cease both of Rachael&#39;s EI groups except for Occupational Therapy, Speech Therapy and Physiotherapy. This has been met with much resistance from the Therapist/Teachers involved with Rachael, as they feel that I am doing her a dis-service from pulling her out of EI. Their concern is that she will never be able to socialise normally with her peers. Well I think we have the socialisation covered with weekly swimming lessons, weekly music/movement classes and get togethers with friends and their children. Next year we will probably replace the music classes with dance classes and we will be more involved with the local home educating groups who have a very busy social calender. I have also announced to the Therapists and Teachers that I will be homeschooling Rachael, (not bothering to explain about what unschooling is), and most of them shake their heads in disbelief, believing that I am going to ruin her for life. I think this resistance stems from their lack of knowledge of education at home, with the firm belief that school is the only way to educate a child. It also seems that within much of the Down Syndrome community, in my experience anyway, the ultimate goal of people with DS is to &quot;fit in&quot; with society and become as &quot;normal&quot; or as &quot;typical&quot; as possible. Whilst I understand this need to be included within the community and to fit in with society, learning within a school environment is only one aspect of inclusion. I feel blessed that the majority of my friends and family are supportive regarding our choices. It helps when doubts creep into your mind to know that the people who really matter are there for you. So here we are, after a tumultuous 2012 with lots of decisions being made, and lots of leaving things behind, ready to embark on something that isn&#39;t typical, normal, or usual. But who wants to be like that anyway? Julie, I am glad you posted this topic on my first day on this list. It&#39;s good that we are not alone in our journey. I really understand where you are coming from as it can feel quite lonely and isolating at times. I say, just go with your instincts, and you can&#39;t go wrong.  To those of you who got to the end of this email, thanks for reading. It wasn&#39;t meant to be so long. Bye for now, Mari</div>","specialLinks":[]},{"userId":524195960,"authorName":"Lori Moffit","from":"Lori Moffit &lt;lorimoffit@...&gt;","profile":"homeschoolmom48060","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling with &quot;special needs&quot;","postDate":"1351743266","msgId":69564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2MzY4NjQ5MjExNTM3MTA3NDZAdW5rbm93bm1zZ2lkPg==","inReplyToHeader":"PDVFRjdBNjk4LTFBQTEtNEJGMC1CRDhBLUEyMjQzMUI3QUQzREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPiA8NUVGN0E2OTgtMUFBMS00QkYwLUJEOEEtQTIyNDMxQjdBRDNEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":69563,"nextInTopic":69565,"prevInTime":69563,"nextInTime":69565,"topicId":69559,"numMessagesInTopic":0,"msgSnippet":"My oldest has fetal alcohol syndrome and mild to moderate mental retardation. We ve had him since he was age 2. We were told he might never learn to walk or","messageBody":"<div id=\"ygrps-yiv-652844476\">My oldest has fetal alcohol syndrome and mild to moderate mental<br/>\nretardation. We&#39;ve had him since he was age 2. We were told he might<br/>\nnever learn to walk or talk, and certainly would be unlikely to be<br/>\nable to learn much of anything. He did attend pre-primary impaired<br/>\nclass at public school until he aged out at six, then went to<br/>\nkindergarten, half day in a regular class, half day in a special ed<br/>\nclass. although the PPI class was wonderful, in kindergarten all they<br/>\nreally did was teach him how to behave like a stereotypical special ed<br/>\nstudent. We figured we couldn&#39;t do worse, and pulled him out to<br/>\nhomeschool after his kindergarten year. I had no clue how to<br/>\n&quot;homeschool&quot;, so we purchased a curriculum from Abeka. It was fine, we<br/>\nused the K, and then the 1st and 2nd grade, but had so much trouble<br/>\nwith the penmanship portion, Alex and I were in tears every day. We<br/>\ngave up on it and kind of went to an eclectic Charlotte Mason style.<br/>\nAround the time we began looking for a house to buy, we put all the<br/>\nhomeschooling stuff away and have pretty much unschooled since, with<br/>\nlittle forays into lapbooking, etc when the kids ask to to them. All I<br/>\nknow is that since moving in this direction, all four of our boys (and<br/>\nthey are all special needs in one way or another) have learned so much<br/>\nmore than they ever did when we were buying complete curriculum and<br/>\nbeing regimented. We heard what the &quot;experts&quot; said, smiled, nodded,<br/>\nand went home and did our own thing. :-)<br/>\n<br/>\nLori<br/>\n<br/>\nSent from my iPad<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 31, 2012, at 5:27 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; There are general accounts here:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/specialunschooling\">http://sandradodd.com/specialunschooling</a><br/>\n&gt;<br/>\n&gt; And don&#39;t compare her to a hypothetical ideal, when you consider how the trajectory might have been different with her in school.  Remember that it&#39;s likely that for every bit of advantage gained from special education, there is that and more in the negative column.<br/>\n&gt;<br/>\n&gt; IF there are methods and tools being developed by professional &quot;special educators,&quot; hanging by and letting your daughter grow up securely to the point that she can be separate from you easily won&#39;t prevent her from taking advantage of some (hypothetical) future miracle methods!     (And if the miraculous improvements *don&#39;t* occur in the world of special ed, then it&#39;s just as well she was home.)<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling with &quot;special needs&quot;","postDate":"1351726046","msgId":69563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVFRjdBNjk4LTFBQTEtNEJGMC1CRDhBLUEyMjQzMUI3QUQzREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPg=="},"prevInTopic":69561,"nextInTopic":69564,"prevInTime":69562,"nextInTime":69564,"topicId":69559,"numMessagesInTopic":0,"msgSnippet":"There are general accounts here: http://sandradodd.com/specialunschooling And don t compare her to a hypothetical ideal, when you consider how the trajectory","messageBody":"<div id=\"ygrps-yiv-595584727\">There are general accounts here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/specialunschooling\">http://sandradodd.com/specialunschooling</a><br/>\n<br/>\nAnd don&#39;t compare her to a hypothetical ideal, when you consider how the trajectory might have been different with her in school.  Remember that it&#39;s likely that for every bit of advantage gained from special education, there is that and more in the negative column.  <br/>\n<br/>\nIF there are methods and tools being developed by professional &quot;special educators,&quot; hanging by and letting your daughter grow up securely to the point that she can be separate from you easily won&#39;t prevent her from taking advantage of some (hypothetical) future miracle methods!     (And if the miraculous improvements *don&#39;t* occur in the world of special ed, then it&#39;s just as well she was home.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: unschooling with &quot;special needs&quot;","postDate":"1351722923","msgId":69561,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2czkzYithcDIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPg=="},"prevInTopic":69559,"nextInTopic":69563,"prevInTime":69560,"nextInTime":69562,"topicId":69559,"numMessagesInTopic":0,"msgSnippet":"There are some collected stories here: http://sandradodd.com/special/","messageBody":"<div id=\"ygrps-yiv-1463499435\">There are some collected stories here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/special/\">http://sandradodd.com/special/</a><br/>\n<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":171872689,"authorName":"julie day","from":"&quot;julie day&quot; &lt;julie@...&gt;","profile":"julipfinn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"unschooling with &quot;special needs&quot;","postDate":"1351715931","msgId":69559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2czI4cisyYWEzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":69561,"prevInTime":69558,"nextInTime":69560,"topicId":69559,"numMessagesInTopic":0,"msgSnippet":"Hi Friends -- My 5yo daughter has down syndrome, and I am wondering if any of you can share stories of how kids -- whom experts argue need all their services","messageBody":"<div id=\"ygrps-yiv-365714841\">Hi Friends --<br/>\n<br/>\nMy 5yo daughter has down syndrome, and I am wondering if any of you can share stories of how kids -- whom &quot;experts&quot; argue need all their services (therapies etc) IN SCHOOL -- do simply by living as a whole person in a nurturing &quot;radical unschooling&quot; environment. I&#39;m sure they do, I just need to hear positive stories :)<br/>\n<br/>\nMy son is 8, and hated all school (just missed me ... never &quot;got over it&quot;), so I pulled him out of first grade. We&#39;ve been unschooling for almost 2 years. Until a few weeks ago, I restricted TV and video games for them both and felt guilt-ridden when I allowed my instincts sway (that visual, game-based, music-filled media can be compelling on many levels). Anyway, I downloaded the audio from the 2010 Life Is Good unschooling conference specifically to hear Pam Sorooshian&#39;s &quot;Fearless Unschooling&quot; talk. Hearing that her (and others&#39;) kids lived with an atmosphere of trust and support (and media) instead of control and suspicion -- and turned out BRILLIANT and HAPPY -- has left me walking on air. (Thanks Pam!!)<br/>\n<br/>\nWhich brings me to my daughter, who learned sign language at 2 and is now beginning to read all because of Signing Time, Blues Clues, Elmo, and the webpage starfall.com. She just can&#39;t get enough of all those things. In fact, she wanted to keep watching Blues Clues last night at 11:30 pm, so (this is the new me), I set up the dvd player for her in bed while we all went to sleep. Until now, she&#39;s had much less control in her life than her brother -- with hospital stays, feeding tube for 4 years, she hates getting teeth brushed, and she is fiesty about it! So realizing I can TRUST her ideas/requests (even if they don&#39;t make sense to me) takes the adversariality out our relationship, and I am profoundly grateful for the idea of radical unschooling for existing, and to you veterans for helping the community.<br/>\n<br/>\nRadical unschooling is against the grain in so many ways (but it feels so normal to me I&#39;m not worried about it), but doing it with a child with a big label is doubly so. I&#39;m just looking for moral support!<br/>\n<br/>\nThanks!<br/>\n<br/>\nJulie</div>","specialLinks":[]}],"prevTopicId":69539,"nextTopicId":69580}}