{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"&quot;Radical&quot; and other labels (very long)","postDate":"1115068094","msgId":105852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Yi41MDQ0MTFhNC4yZmE3ZjBiZUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":105851,"nextInTime":105853,"topicId":105852,"numMessagesInTopic":0,"msgSnippet":"This is by the editor of Life Learning Magazine, Wendy Priesnitz.  It  ties in well with recent discussions about what (if anything else) to call  radical ","messageBody":"<div id=\"ygrps-yiv-850309179\">This is by the editor of Life Learning Magazine, Wendy Priesnitz.  It  ties <br/>\nin well with recent discussions about what (if anything else) to call  radical <br/>\nunschooling when it extends into part of life people hadn&#39;t considered  to be <br/>\ncentral/necessary/something.  I think these first two paragraphs will  be good <br/>\nto discuss.  WARNING:  PLEASE do not respond without chopping  off the rest <br/>\nof the post.  It&#39;s monstrous long. I included it because it&#39;s  part of the <br/>\nmagazine&#39;s mailout, and because part of it&#39;s about me.  So  nobody, please, quote <br/>\nit all back.  Once is already way long.<br/>\n <br/>\nQuote starts now, and then the whole newsletter follows.<br/>\n------------------------------------------<br/>\n <br/>\nRadical?<br/>\nAnother reader wrote to say that while she has been enjoying reading about  <br/>\nother people’s learning experiences, she won’t be renewing her subscription  <br/>\nbecause she feels Life Learning magazine is “too radical” for her and that we  <br/>\n“don’t keep to the homeschooling topic all the time”. I thanked her for <br/>\nusing  the word “radical”, and pointed out its meaning. My dictionary tells me <br/>\nthat it  originates with the Latin words radix meaning roots and radicalis,  <br/>\nwhich means having roots. And thus comes the botanical term “radical leaves”,  <br/>\nwhich refers to leaves that arise from the root or crown of the plant. So, for  <br/>\nme, a person who is radical is one who examines the roots of issues. And a  <br/>\nradical solution to a problem is one that arises from that examination,  <br/>\naddressing what we sometimes call the root cause, rather than the more  superficial <br/>\nsymptoms. I suppose that focus on fundamental change is why radical  views, <br/>\nopinions, practices or proposed changes sometimes seem extreme. It is  also why <br/>\nI prefer to examine how people learn by living, rather than to isolate  <br/>\nself-directed learning as just another homeschooling method or  style.<br/>\n<br/>\nWhen I started thinking about these things 35 or so years ago, I  began with <br/>\nthe presumption that what was wrong with our education system  wouldn’t be <br/>\nfixed by tinkering – by adding more subjects, more equipment, more  teachers or <br/>\nmore funding, or, in fact, by changing the location of where the  teaching took <br/>\nplace or the content of the curriculum that was used. I realized  then, and <br/>\nbelieve it ever more passionately now, that what’s needed is an  examination of <br/>\nhow people learn (which includes who controls the agenda) and  whether or not <br/>\nschools provide the best opportunity for that learning to unfold.  (They don’<br/>\nt.) That sort of radical examination of the problem – and the radical  <br/>\nsolutions that life learning families are living every day – is what Life  Learning <br/>\nmagazine is about, whether it seems at first glance to relate  directly to what <br/>\nsome may define as &quot;homeschooling&quot; or not. <br/>\n<br/>\n--------------------------------------------------------<br/>\n----------------------------------<br/>\nLife Learning  E-Letter<br/>\nMay  2005<br/>\n----------------------------------<br/>\n<br/>\nYou are receiving  this e-letter because you asked to be on the mailing list. <br/>\nYou can stop  receiving it at any time by sending us an email from the email <br/>\naccount by which  you&#39;re subscribed. Life Media, Life Learning&#39;s publishing <br/>\ncompany, has a policy  of not sharing any information about those on its mailing <br/>\nlists, either email or  print. Our privacy policy can be found at <br/>\n_www.lifemedia.ca/privacy.html_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifemedia.ca/privacy.html)\">http://www.lifemedia.ca/privacy.html)</a>  .<br/>\n<br/>\nMay/June  Issue<br/>\nIf subscribers haven&#39;t already received the May/June issue of Life  Learning, <br/>\nthey will shortly. The table of contents and PDF version are also  available <br/>\nnow for viewing at _www.lifelearningmagazine.com/0506/index.html_ <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifelearningmagazine.com/0506/index.html)\">http://www.lifelearningmagazine.com/0506/index.html)</a>   <br/>\n<br/>\nThanks For Your Feedback<br/>\nWe hear from our readers regularly by  email and regular mail - and it&#39;s <br/>\nwonderful to receive your comments, article  ideas and input (and the complaints <br/>\ntoo!). Some people write three-page letters;  others jot a friendly note on the <br/>\nbottom of their renewal notices. But every  once in awhile, we receive a <br/>\ncomment that stands out. Subscriber Bonnie Reyes  from Walnut Creek, California <br/>\nhas allowed me to share her recent email message  with you. She wrote: &quot;I must <br/>\ntell you, I had giving up on subscribing to  anything. Too many good intentions <br/>\nbecame piles of disappointment and guilt. A  friend recommended a back issue <br/>\nof your magazine when she learned I was  considering homeschooling my four <br/>\nchildren, and I was hooked. Never before has a  magazine so confirmed and <br/>\ninspired me in my purpose as a parent. I read every  issue in its entirety, and <br/>\nre-read and refer to them regularly. Like Ken  Wilber&#39;s &#39;Theory of Everything&#39;, it <br/>\npulls everything together for me and, more  importantly, demonstrates how to <br/>\napply my beliefs and values and begin living my  vision. Thank you!!!&quot; Thank <br/>\nyou, Bonnie for making my  day!<br/>\n<br/>\nRadical?<br/>\nAnother reader wrote to say that while she has been enjoying reading about  <br/>\nother people’s learning experiences, she won’t be renewing her subscription  <br/>\nbecause she feels Life Learning magazine is “too radical” for her and that we  <br/>\n“don’t keep to the homeschooling topic all the time”. I thanked her for <br/>\nusing  the word “radical”, and pointed out its meaning. My dictionary tells me <br/>\nthat it  originates with the Latin words radix meaning roots and radicalis,  <br/>\nwhich means having roots. And thus comes the botanical term “radical leaves”,  <br/>\nwhich refers to leaves that arise from the root or crown of the plant. So, for  <br/>\nme, a person who is radical is one who examines the roots of issues. And a  <br/>\nradical solution to a problem is one that arises from that examination,  <br/>\naddressing what we sometimes call the root cause, rather than the more  superficial <br/>\nsymptoms. I suppose that focus on fundamental change is why radical  views, <br/>\nopinions, practices or proposed changes sometimes seem extreme. It is  also why <br/>\nI prefer to examine how people learn by living, rather than to isolate  <br/>\nself-directed learning as just another homeschooling method or  style.<br/>\n<br/>\nWhen I started thinking about these things 35 or so years ago, I  began with <br/>\nthe presumption that what was wrong with our education system  wouldn’t be <br/>\nfixed by tinkering – by adding more subjects, more equipment, more  teachers or <br/>\nmore funding, or, in fact, by changing the location of where the  teaching took <br/>\nplace or the content of the curriculum that was used. I realized  then, and <br/>\nbelieve it ever more passionately now, that what’s needed is an  examination of <br/>\nhow people learn (which includes who controls the agenda) and  whether or not <br/>\nschools provide the best opportunity for that learning to unfold.  (They don’<br/>\nt.) That sort of radical examination of the problem – and the radical  <br/>\nsolutions that life learning families are living every day – is what Life  Learning <br/>\nmagazine is about, whether it seems at first glance to relate  directly to what <br/>\nsome may define as &quot;homeschooling&quot; or not.  <br/>\n<br/>\nJuly/August Issue<br/>\nAs readers begin to digest the May/June  issue, I&#39;m already weaving together <br/>\nthe threads that will become the July/August  issue. I&#39;m particularly excited <br/>\nabout an interview with writer and speaker  Sandra Dodd by Canadian writer and <br/>\nradio host Beatrice Ekwa Ekoko. And  interestingly enough, Sandra also uses <br/>\nthe word &quot;radical&quot; in the context of her  unschooling website pages, found at <br/>\n_www.sandradodd.com_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/)\">http://www.sandradodd.com/)</a>  . In  our upcoming feature <br/>\ninterview, Sandra, who lives with her three  always-unschooled teens and <br/>\nhusband in Albuquerque, New Mexico, covers a lot of  ground from her concept of <br/>\n&quot;strewing&quot;, through freedom, learning for fun and  what she calls &quot;spiritual <br/>\nunschooling&quot;. <br/>\n<br/>\nContribute to Life Learning  Magazine<br/>\nAnother reader recently reported that her favorite articles are  the ones <br/>\nwritten by readers who are helping their kids learn without school, and  are <br/>\nsharing their experiences, both good and bad, as they walk this path. <br/>\nIf  you would like to contribute, please see our guidelines at <br/>\n_www.lifelearningmagazine.com/write.html_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifelearningmagazine.com/write.html)\">http://www.lifelearningmagazine.com/write.html)</a>  <br/>\n. Although we can&#39;t  afford to pay contributors, we like to barter <br/>\n(subscriptions, ads, whatever...)  so do get in touch and share your thoughts and <br/>\nexperiences about self-directed  learning. All thoughts and experiences are welcome, <br/>\nno matter how short or  lengthy. And please don&#39;t be shy about your writing <br/>\nability...the whole point of  unschooling is to learn by doing!<br/>\n<br/>\nEvents<br/>\nI am  excited to be co-presenting a four-day course as part of the <br/>\nTransformative  Learning Centre&#39;s annual Summer Institute at OISE/University of Toronto <br/>\nin  Toronto, Ontario from June 16 to 19. It is called Reshaping Self, Family,  <br/>\nCommunity, and Society (through life learning) OISE doctoral  candidate <br/>\nNatalie Zur Nedden and I will be facilitating an exploration of  unschooling, and <br/>\nof how deschooling ourselves and society can produce  personal/family change <br/>\nand enhance the prospects for a sustainable society. We  are inviting a broad <br/>\ncross-section of people to participate, from unschooling  parents to students <br/>\nand teachers, from librarians and community workers to  artists. There are no <br/>\nprerequisites, and affordable accommodation is available  at the university. <br/>\nPeople far and wide regularly attend the Summer Institute to  combine a holiday <br/>\nin downtown Toronto with a transformative learning experience.  Come and find <br/>\nout how we can work together to broaden our families&#39; unschooling  experience <br/>\nand create a learning society. For details, visit <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://tlc.oise.utoronto.ca/events/SI_Reshaping.htm_\">http://tlc.oise.utoronto.ca/events/SI_Reshaping.htm_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://tlc.oise.utoronto.ca/events/SI_Reshaping.htm)\">http://tlc.oise.utoronto.ca/events/SI_Reshaping.htm)</a> <br/>\n  . Coincidentally, Natalie is researching and writing my life history as an  <br/>\nunschooling activist for her PhD dissertation.<br/>\n<br/>\nMy colleague Ron  Miller (Goddard College prof, writer and publisher of <br/>\nholistic education book,  as well as the recently-defunct Paths of Learning <br/>\nmagazine) recently wrote to  update us about the credit course program that Goddard <br/>\nCollege is developing for  homeschoolers. They had to start the program this <br/>\ncoming Fall, but the planning,  design and approval processes are apparently <br/>\ntaking longer than expected. So the  plan now is to launch it next March. The <br/>\nrelated conference they had planned for  June will take place on September 9 to <br/>\n11 instead. It will be an opportunity to  meet homeschoolers who have begun <br/>\ncollege studies, to hear about their  experiences, and there will be workshops <br/>\nfor young people and parents about  beginning college. We&#39;ll make details <br/>\navailable as Ron sends them to  us.<br/>\n<br/>\nFor other events, courses and conferences, visit the  Life Learning <br/>\nconference page at _www.lifelearningmagazine.com/conferences.html_ <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifelearningmagazine.com/conferences.html)\">http://www.lifelearningmagazine.com/conferences.html)</a>  . That&#39;s  where we list the events where <br/>\nLife Learning magazine will be represented. Keep  checking back, because it <br/>\nchanges weekly as we add new  events.<br/>\n<br/>\nFrom our Advertisers<br/>\nAlthough Life Learning is  primarily subscriber-supported, revenue from <br/>\nadvertising, both on the magazine  and the website, is a vital part of <br/>\npublishing...and will help us to grow the  magazine. If you respond to any of our <br/>\nadvertisements, please tell the companies  you learned about them from us. If you are <br/>\ninterested in advertising in Life  Learning, contact Gail Gallant at (818) <br/>\n244-2941 or by email at  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gail@...\">gail@...</a> for details. Here are two of our <br/>\ncurrent advertisers:  <br/>\n<br/>\nLicense Plate Games - Summer is coming and here is an  interesting and <br/>\neducational way to keep people of all ages occupied on a family  car trip. License <br/>\nPlate Games is just one of the fascinating products available  from Interstate <br/>\nDirectory Publishing.  For information, call (800) 347-0473  or (516) 922-7160.<br/>\n<br/>\nAesop&#39;s Room - &quot;Alternative Resources  for Growing Minds&quot; - unique books, <br/>\nchildren&#39;s yoga and meditation, music,  instruments, art supplies, wooden toys, <br/>\ncrafts. Visit _www.AesopsRoom.com_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aesopsroom.com/)\">http://www.aesopsroom.com/)</a>  or call (530)  <br/>\n753-0243.<br/>\n<br/>\nSubscribe<br/>\nYou can now request a trial subscription to  Life Learning online and be <br/>\ninvoiced. Go to _www.lifelearningmagazine.com/subscribe.html_ <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifelearningmagazine.com/subscribe.html)\">http://www.lifelearningmagazine.com/subscribe.html)</a>  and click on  the subscription form in <br/>\nOption 3. Simply provide us with your complete contact  information and send the <br/>\nform. We will mail you the current issue of Life  Learning along with an <br/>\ninvoice. Your subscription will continue once we have  received your payment. <br/>\n<br/>\nWendy Priesnitz, Editor<br/>\nLife Learning  magazine<br/>\n_www.LifeLearningMagazine.com_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifelearningmagazine.com/)\">http://www.lifelearningmagazine.com/)</a>  <br/>\nVisit my blog at _www.LifeMedia.ca/wendy/blog.html<br/>\n<br/>\n_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifemedia.ca/wendy/blog.html)\">http://www.lifemedia.ca/wendy/blog.html)</a> P.S. Feel free to  pass this <br/>\ne-letter along to your friends or post it to discussion  lists.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":105843,"nextTopicId":105857}}