{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"3jAXsRbTAWcB0Ag6yIPhxzbinCsTdNdt8ZWRJJ4xy3-Lx12VvQWcvKi9-YKXWl76L5379pvhY8Xvj18TdDQx41cM0kL8bxk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japanese students","postDate":"953538605","msgId":7215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwMzIwMDc0Mi5RQUExNDY3NUBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":7214,"nextInTime":7216,"topicId":7215,"numMessagesInTopic":0,"msgSnippet":"20 March 2000 Hi all, Here s an article from the Japanese press that I thought might be of some interest. Especially revealing of the survey s bias is the","messageBody":"<div id=\"ygrps-yiv-507283849\">20 March 2000<br/>\n<br/>\n<br/>\nHi all,<br/>\n<br/>\nHere&#39;s an article from the Japanese press that I thought might be of some <br/>\ninterest.<br/>\n<br/>\nEspecially revealing of the survey&#39;s bias is the mention of students <br/>\ndyeing their hair (which Japanese schoolkids tend to think is cool but <br/>\nwhich Japanese educators usually consider a surefire sign of delinquency).<br/>\n<br/>\nAnd it is highly debatable, given all the academic and social pressures <br/>\nJapanese schoolchildren face from the adult world, that they are <br/>\n&quot;satisfied just enjoying their day-to-day lives,&quot; as the quoted official <br/>\nsuggests.<br/>\n<br/>\nWhat the story doesn&#39;t dig into (typical of Japanese newspapers) is the <br/>\n&quot;why&quot; behind this phenomenon of students not wanting to study -- and what <br/>\nthe solutions to the problem might be. But guess we&#39;ll have to wait for <br/>\nanother &quot;survey&quot; before we get *those* answers! &lt;g&gt; <br/>\n<br/>\nBrian<br/>\nin Osaka, Japan<br/>\n<br/>\n-----------------------------------  <br/>\n<br/>\n<br/>\nPOLL SHOWS JAPANESE STUDENTS STUDY LEAST<br/>\n<br/>\nThe Daily Yomiuri - March 18, 2000<br/>\n<br/>\n<br/>\nMore than 40 percent of high school students surveyed across the country <br/>\ndo not study outside school, compared to only about 10 percent in the <br/>\nUnited States and China, according to research conducted by the Japan <br/>\nYouth Research Institute.<br/>\n<br/>\nThe latest finding may indicate that many Japanese high school students <br/>\nlose motivation to study upon completion of school entrance screenings <br/>\nand examinations, analysts said.<br/>\n<br/>\nThe comparative study was conducted on about 2,000 middle and high school <br/>\nstudents in each of the three nations from November to December [1999].<br/>\n<br/>\nA whopping 41.8 percent of Japanese students said they do not spend any <br/>\ntime studying outside school. According to the survey, only one in three <br/>\nhigh school students in the nation studies outside school for more than <br/>\nan hour each day.<br/>\n<br/>\nA total of 12.6 percent of U.S. high [school] students said they do not <br/>\nstudy outside school, while more than half of all high school students in <br/>\nthe country said they study more than an hour outside school.<br/>\n<br/>\nAmong Chinese high school students, 8.3 percent said they do not study <br/>\noutside school, while more than 80 percent said they study more than an <br/>\nhour every day outside class. A total of 29 percent said they spend <br/>\nbetween two and three hours studying each day.<br/>\n<br/>\nAmong Japanese middle school students, 18.4 percent said they do not <br/>\nstudy outside school, and about half said they study more than an hour <br/>\neach day.<br/>\n<br/>\nThe research institute also found that 41.3 percent of Japanese high <br/>\nschool students carry cellular phones to school, a much higher figure <br/>\nthan in the United States and China, where 12.3 percent and 0.9 percent <br/>\nof high school students, respectively, carry such phones to school.<br/>\n<br/>\nIn the survey, Japanese high school students were found most likely to <br/>\ndye their hair among each of the three nations, with 42.9 percent of <br/>\nfemale students and 33 percent of male students responding that they <br/>\ncolor their hair. A total of 18.6 percent of female middle school <br/>\nstudents said they dye their hair.<br/>\n<br/>\nMeanwhile, 36.7 percent of female U.S. high school students and 14.8 <br/>\npercent of male students said they dye their hair.<br/>\n<br/>\nMore than 70 percent of all Japanese middle- and high school students <br/>\nsaid they want high-income jobs in the future, the highest figure of the <br/>\nthree countries.<br/>\n<br/>\nMeanwhile, about half of all Japanese middle- and high school students <br/>\nsaid they do not want to be promoted to positions that carry heavy <br/>\nresponsibilities and require high commitment, also the highest figure <br/>\namong the three nations.<br/>\n<br/>\n&quot;The futures of Japanese students are decided very early on, and that is <br/>\nwhy they have little aspirations for the future compared with their U.S. <br/>\nand Chinese counterparts. Japanese students tend to be satisfied by just <br/>\nenjoying their day-to-day lives rather than preparing for the future,&quot; <br/>\nsaid Tamotsu Sengoku, director of the institute.<br/>\n<br/>\n<br/>\n[copyright - Yomiuri Shimbun, 2000]</div>","specialLinks":[]}],"prevTopicId":7214,"nextTopicId":7216}}