{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Language learning","postDate":"1336387251","msgId":67089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvODhyais3Zjd2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgzOUY1MENBLUEwOUMtNDUyQi1BNkJFLTdGOTA2RTM2MkJGOEBnbWFpbC5jb20+"},"prevInTopic":67082,"nextInTopic":0,"prevInTime":67088,"nextInTime":67090,"topicId":67035,"numMessagesInTopic":0,"msgSnippet":"-=- Would your husband agree to come to an unschooling conference?  -=- I forgot to mention that for my husband, Graham, attending a homeschooling conference","messageBody":"<div id=\"ygrps-yiv-95205824\">-=- Would your husband agree to come to an unschooling conference?  -=-<br/>\n<br/>\nI forgot to mention that for my husband, Graham, attending a homeschooling conference was probably the most helpful part in his decision to unschool. Meeting homeschooled families, attending talks by researchers who had done studies on homeschooled children, hearing stories of parents with grown children, watching older homeschool children interact, and having discussions with different fathers over the weekend really confirmed for him that unschooling would be the best choice for Gianluca and Gisele.<br/>\n<br/>\nRippy<br/>\n(Gianluca 7, Gisele 5)</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Language learning","postDate":"1336345082","msgId":67082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzOUY1MENBLUEwOUMtNDUyQi1BNkJFLTdGOTA2RTM2MkJGOEBnbWFpbC5jb20+","inReplyToHeader":"PGpvMWh2cCtzazI0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpvMWh2cCtzazI0QGVHcm91cHMuY29tPg=="},"prevInTopic":67035,"nextInTopic":67089,"prevInTime":67081,"nextInTime":67083,"topicId":67035,"numMessagesInTopic":0,"msgSnippet":"-=- Any ideas about how to learn a foreign language beyond the basics when true immersion is not an option? -=- -=-Even the television is in German!-=- Maybe","messageBody":"<div id=\"ygrps-yiv-979758658\">-=- Any ideas about how to learn a foreign language beyond the basics when true immersion is not an option? -=-<br/>\n-=-Even the television is in German!-=-<br/>\n<br/>\nMaybe you could pay extra to get Italian television? My mom learned English mostly by watching American soap operas. They are great for learning a language - wonderfully repetitive and dramatic, a new show every week day. I imagine there must be some great Italian soap operas on television. You could also watch dubbed Italian shows or movies of something you&#39;ve seen in English (maybe reruns of the tv series Friends?) Or watch children&#39;s shows in Italian like Sesame Street with your son. Or learn Italian songs - popular songs on the radio, children&#39;s songs, opera!<br/>\n<br/>\nAnother idea is to put up an advert asking if anyone would be interested in a language exchange partner - the first 30-60 minutes spent talking/learning Italian, the second 30-60 minutes spent talking/learning English or German. It&#39;s free and mutually advantageous. Put the advert where Italian people hang out. You could meet at a cafe or the beach, or you could do it on skype with someone living further away. Maybe you could buy an inexpensive second hand &#39;learn Italian&#39; textbook that helps with the basics - the most commonly used words in Italian, verb conjugations, etc.. Or you could always follow a more expensive language program like Rosetta Stone.<br/>\n<br/>\nOr you could become a host through a program like workaway (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.workaway.info/)\">http://www.workaway.info/)</a>. These are work exchange programs where someone works or shares their skills in exchange for food and accommodation. I&#39;m a huge fan of work exchanges - Graham and I did one at a horse ranch in Australia when we first met. We&#39;re looking forward to doing more with the children. You can interview people through skype, ask for references and have contact with them before you agree to a placement. I think you would have some interested Italian people that would love the chance to live on an island and work at a dive center - maybe an older teen, or young adult or a family with young kids. There might even be an Italian unschooling family looking for a little adventure. The exchange person could help you and your son with your Italian and enjoy diving and island life during their free time.<br/>\n<br/>\n-=- The other reason I am much more motivated to learn the language now is because my partner wants to send our son, who is 2, to pre-kindergarten as soon as possible -=-<br/>\n-=-  I am hoping that this will satisfy my husband&#39;s two biggest reasons (language and socialization) to send our son to pre-kindergarten. -=-<br/>\n<br/>\nDo you think you might be able to find an Italian playgroup for moms and toddlers that meets regularly? If there isn&#39;t one, maybe you can start one. I think Italy has a strong culture of pre-kindergarten, but there are likely to be moms who have decided against it and would like to get together with other families. Perhaps they also have husbands who are concerned with their children&#39;s socialization and would appreciate having an alternative to pre-kindergarten. Maybe you can find them through something like a La Leche League or an attachment parenting network?<br/>\n<br/>\n-=- He is not open to homeschooling or unschooling -=-<br/>\n<br/>\nWould your husband agree to come to an unschooling conference? There will be a few dads attending the talks Sandra will be giving in Leiden on June 30th (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradoddleiden.wordpress.com/)\">http://sandradoddleiden.wordpress.com/)</a>. Sandra, Joyce and possibly Alex will be giving talks in Lisbon next year (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradoddemlisboa.blogspot.com/)\">http://sandradoddemlisboa.blogspot.com/)</a>. Sandra&#39;s European meetings are listed here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://speakingsandradodd.blogspot.com/p/europe-2012.html\">http://speakingsandradodd.blogspot.com/p/europe-2012.html</a><br/>\n<br/>\n-=-it is very important to him that ds learns as many languages as possible in his first years of life.-=-<br/>\n<br/>\nI think Alexander is already picking up lots of languages - Dutch, German and English ;-) I think if he learns Italian in a calm and safe environment, close to his mom, he&#39;ll have a better grasp of the language. If he goes to pre-kindergarten and doesn&#39;t like it - if he&#39;s stressed and missing his parents, that&#39;s a sad way to learn a language (or anything really). He might even quickly lose competency in the language once you leave Italy if he associates it with unhappiness. <br/>\n<br/>\nWe are a language rich family. Between Graham and I we have formally studied and/or actively communicated in - English, Dutch, Punjabi, Hindi, Urdu, French, German, Spanish, Ancient Greek, Latin, and Swahili. The languages we are still competent in today are ones that we use for some reason or another, or ones that we learned for our own reasons in fun, dynamic ways -- talking to native speakers with real conversations. We both learned languages as adults and became quite competent. When we were learning for our own reasons, it wasn&#39;t particularly difficult. In both our experience, learning languages at school, for fuzzy reasons, was much more difficult. <br/>\n<br/>\nGianluca and Gisele speak English and Dutch and a tiny bit of Punjabi. We&#39;re not anxious for them to learn other languages unless there is a practical reason or unless they decide they would like to learn a language for their own reasons. An example of a practical reason was when they learned a bit of French last summer. Our plan was to go to France to visit Sandra and her friend Helene. When we booked our train tickets and cottage, Graham started speaking French to the children at bedtime for fun. He helped them learn simple words and phrases that they might use when meeting French children. When we cancelled our plans due to Gisele&#39;s postponed surgery, Graham&#39;s bedtime routine eventually went back to being Dutch. There was no natural reason to continue in French, since we didn&#39;t know when we would be going there next. Occasionally the children ask Graham to speak French and he happily plays the part. But it comes from them - their interest, their desire. <br/>\n<br/>\nRippy<br/>\n(Gianluca 7, Gisele 5)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":444869382,"authorName":"mrssba","from":"&quot;mrssba&quot; &lt;stephanieschrier@...&gt;","profile":"mrssba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Language learning","postDate":"1336167225","msgId":67035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvMWh2cCtzazI0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67082,"prevInTime":67034,"nextInTime":67036,"topicId":67035,"numMessagesInTopic":0,"msgSnippet":"We moved to a small Italian island where my (German) partner runs a (German) dive centre. I find it very hard to learn the language here as it is a touristic","messageBody":"<div id=\"ygrps-yiv-1848694320\">We moved to a small Italian island where my (German) partner runs a (German) dive centre. I find it very hard to learn the language here as it is a touristic island with mostly German speaking tourists. Everything is translated and most Italians also speak German or English. Even the television is in German! <br/>\n<br/>\nWe travelled back and forth to Italy over the years and I never needed the Italian language much, but now we are planning to stay here for the next couple of years and I would like to learn the language. I am Dutch and my German is almost fluent, because of full immersion into the German language here on the island. I never planned on learning German, it just happened! I wish it would have been the same with learning Italian...<br/>\n<br/>\nThe other reason I am much more motivated to learn the language now is because my partner wants to send our son, who is 2, to pre-kindergarten as soon as possible, so he can pick up the language. He is not open to homeschooling or unschooling and it is very important to him that ds learns as many languages as possible in his first years of life. <br/>\n<br/>\nAny ideas about how to learn a foreign language beyond the basics when true immersion is not an option? Does anyone have stories of unschooled kids picking up a language that was not spoken at home?<br/>\n<br/>\nMy goal is to improve my Italian to such a level that this summer I will be able to start talking to Italian kids and parents at the beach and expose my son and myself to the Italian language more and more. I am hoping that this will satisfy my husband&#39;s two biggest reasons (language and socialization) to send our son to pre-kindergarten.<br/>\n<br/>\nGreetings from Elba,<br/>\nStephanie</div>","specialLinks":[]}],"prevTopicId":66982,"nextTopicId":67003}}