{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"NumoAstro@aol.com","from":"NumoAstro@...","replyTo":"LIST","senderId":"Wsy27ceDIlaBCg3y4pGmvksBXE5UpiftVqJWeHjDStZLg_K3R6ODDn53bg7eDffIQKSwB9r6mjU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What do you do all day?","postDate":"964969406","msgId":11629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVlLjg4NmU4Y2MuMjZiNTlkYmVAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":11628,"nextInTime":11630,"topicId":11629,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/30/2000 2:59:47 AM US Mountain Standard Time, Unschooling-dotcom@egroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-123810311\">In a message dated 7/30/2000 2:59:47 AM US Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; May I ask what a typical day of unschooling is for others?  Do you have <br/>\n<blockquote><span title=\"ireply\">  &gt;   certain lesson plans that you go with?  Also, do any of you enroll your <br/>\n &gt;   children in classes given by the school districts &gt;&gt;<br/>\n<br/>\n </span></blockquote>This is a good question and one that I asked over and over again of everyone <br/>\nI know that unschools.  I now know what it means for my family... so heres an <br/>\nexample of a week that we&#39;ve had and it isn&#39;t typical because there isn&#39;t any <br/>\nsuch thing in my family as it varies with whatever else is going on.  I&#39;m <br/>\ngoing to break it down into morning and afternoon otherwise it would take up <br/>\nabout 10,00000 pages.<br/>\n<br/>\nMonday Morning - Max up at 5:30am, Zak up at 6:30am.  Breakfast.  Zak wants <br/>\nto play Madeline Grade 1 Math on the computer (Zak&#39;s 4) to learn more about <br/>\nnumbers.  He plays on the computer for about 3 hours.  I&#39;m cleaning house <br/>\nwith Max following me around while doing it.  Stop into Zak&#39;s room and see if <br/>\nhe needs me periodically.  Couple of times he asks me about numbers and we <br/>\nget his dinosaurs out on the floor of his room and put them in rows according <br/>\nto the number he&#39;s counting.  While the dinosaurs are on the floor he asks <br/>\nabout where they came from and if they are still alive.  I pull out a book in <br/>\nhis closet about dinosaurs and we looks at those pictures for about 5 mins <br/>\nbefore he wants to go back to Madeline.  Max is watching all this <br/>\ninteraction.  I put Max down for a nap and work on my business for 45 mins, <br/>\nwhile Zak is still on the computer.  <br/>\n<br/>\nAfternoon:  Dylan comes over for a playdate (he lives next door and is the <br/>\ntypical daycare - through public school, son of a single mother child)... <br/>\nThey get along great.  They play in the garden baseball, decide they are <br/>\ngoing to take their clothes off and run through the sprinkler (It&#39;s 109 <br/>\ndegrees here).  Max plays in the sand while Dylans&#39; mother and I catch up on <br/>\nwhat&#39;s going on.  Zak tells Dylan about counting dinosaurs and they decide to <br/>\ngo look at them in his room.... After 40 mins they call out for help.  Zak <br/>\nwants to know what is America?  Dylan has been talking about living in <br/>\nTucson, Arizona, USA and Zak wants to know what that means.  I get out his <br/>\nglobe and show him where I was born in England and Where we live now in the <br/>\nUS.  He seems quite happy about that and pulls out a map book he&#39;s got to <br/>\nshow Dylan all the other places we&#39;ve looked at one the map.<br/>\n<br/>\nGrocery Store.. .Zak helps me pick food out by prices.  Max holds packages <br/>\nand tries to eat them.  I ask Zak to get me items that have a 5 and 6 in them <br/>\nand count how many he has.  He does this happily.<br/>\n<br/>\nSteve comes home and takes over:  Lots of play and racing and chasing around <br/>\nthe house with both boys.  Steve baths them both... Zak and Steve watch a DK <br/>\nvideo about the Jungle.  We went to the zoo the other day and Zak wanted to <br/>\nsee where Elephants came from.  Again we talk about where places are such as <br/>\nAfrica.<br/>\n<br/>\nThis is just one day and varies greatly by whatever we are doing.  Of course <br/>\nit may seem to lots of people that we don&#39;t do anything but we do lots.  I <br/>\ndidn&#39;t even add about the socialization he gets from going to the grocery <br/>\nstore where he talks to lots of people.  I ask him to ask for the cheese and <br/>\nturkey breast and he weighs the fruit and veg and I have him put things in <br/>\nbags for me.<br/>\n<br/>\nI&#39;m sure this is different from other people as well, but as far as I&#39;m <br/>\nconcerned that&#39;s what unshcooling is all about.  If you read between the <br/>\nlines you can see what Zak learned that one day.<br/>\n<br/>\nHope this helps<br/>\nDawn F<br/>\nTucson, AZ</div>","specialLinks":[]}],"prevTopicId":11628,"nextTopicId":11630}}