{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":69247285,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","profile":"bearspawprint","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Living/Learning/Teaching With Dyslexia","postDate":"1007618158","msgId":29420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMjA2MDU1NTU4LjYzNjMyLnFtYWlsQHdlYjE0MzA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDExMjA0MjMwNDM4LjY0MTQyLnFtYWlsQHdlYjEyNTAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":29409,"nextInTopic":0,"prevInTime":29419,"nextInTime":29421,"topicId":29347,"numMessagesInTopic":0,"msgSnippet":"Dear Diana Thankyou Sharon __________________________________________________ Do You Yahoo!? Send your FREE holiday greetings online! ","messageBody":"<div id=\"ygrps-yiv-438275255\">Dear Diana<br/>\nThankyou<br/>\nSharon<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nSend your FREE holiday greetings online!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://greetings.yahoo.com\">http://greetings.yahoo.com</a></div>","specialLinks":[]},{"userId":68773051,"authorName":"Elsa Haas","from":"&quot;Elsa Haas&quot; &lt;ElsaHaas@...&gt;","profile":"elsahaas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Living/Learning/Teaching With Dyslexia","postDate":"1007594559","msgId":29409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PExPQkJJSkxOQU5GSEpHT05HRE1CQ0VBSkNIQUEuRWxzYUhhYXNAc2kucnIuY29tPg==","inReplyToHeader":"PDAwNTIwMWMxN2RhZSQ3ZGY2ZWFjMCQwMzAwYThjMEBhbGFuLmNvbT4="},"prevInTopic":29373,"nextInTopic":29420,"prevInTime":29408,"nextInTime":29410,"topicId":29347,"numMessagesInTopic":0,"msgSnippet":"Many, many years ago, I read a book called Reversals, by a woman who considered herself dyslexic and had only learned to read well (after having sort of snuck","messageBody":"<div id=\"ygrps-yiv-1780523670\">Many, many years ago, I read a book called Reversals, by a woman who<br/>\nconsidered herself dyslexic and had only learned to read well (after having<br/>\nsort of snuck her way through school, relying a lot on her memory) when her<br/>\nhusband found out she couldnt.<br/>\n<br/>\nI dont know whether Id recommend the book now or not, since I read it long<br/>\nbefore I had any ideas on the subject. But I do remember that when she was a<br/>\nlittle girl, her grandmother used to have her read aloud and then throw the<br/>\nbook at her head when she made a mistake. I wondered, even way back then (I<br/>\nwas a teenager) just what was cause and what was effect in her particular<br/>\ncase.<br/>\n<br/>\nI love stories told from the inside of whatever disability or other<br/>\ncondition is under discussion. Thanks for yours, Diana. Tell us more.<br/>\n<br/>\nElsa Haas<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Leslie [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leslie@...\">leslie@...</a>]<br/>\nSent: Wednesday, December 05, 2001 12:02 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\nSubject: Re: [Unschooling-dotcom] Living/Learning/Teaching With Dyslexia<br/>\n<br/>\nDiana E,<br/>\n<br/>\nThanks for posting this great interpretation of &quot;dyslexia&quot; and your personal<br/>\nexperience!! I have a brilliant son who deals with many of the issues you<br/>\ndescribe and who I feel I understand so much better after reading your post.<br/>\nIt&#39;s so difficult for him to describe his experience and he was so excited<br/>\nto read your post with me! He knows he&#39;s different and sometimes he feels<br/>\nconfused/concerned about his intelligence or lack of in the eyes of some. A<br/>\nmothers reassurance isn&#39;t always enough. Reading about someone&#39;s real life<br/>\nexperience, not a text book definition, had a very positive effect.<br/>\n<br/>\n....Speaking in clear smooth sentences is sometimes easy and sometimes<br/>\nnearly impossible. I might say an entirely different word than the one I am<br/>\nthinking, or say something that doesn&#39;t sound like any word at all.....<br/>\n<br/>\nThis really rang a bell with him! We used to say that he was reluctant to<br/>\naccept that words had been created before he had a chance to create better<br/>\nones.&lt;bg&gt; We&#39;ve always enjoyed his unique way of making meaning and seeing<br/>\nthe world, he&#39;s expanded us all!<br/>\n<br/>\nLeslie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\nADVERTISEMENT<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=178320.1681224.3270152.1261774/D=egroupweb/S=17050819\">http://rd.yahoo.com/M=178320.1681224.3270152.1261774/D=egroupweb/S=17050819</a><br/>\n72:HM/A=879173/R=0/*<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fastweb.com/ib/yahoo-76f\">http://www.fastweb.com/ib/yahoo-76f</a>&gt;<br/>\n<br/>\n<br/>\nMessage boards, timely articles, a free newsletter and more!<br/>\nCheck it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nTo unsubscribe, set preferences, or read archives:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n<br/>\nAnother great list sponsored by Home Education Magazine!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt; .<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":51352077,"authorName":"Leslie","from":"&quot;Leslie&quot; &lt;leslie@...&gt;","profile":"fromthebeachhouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Living/Learning/Teaching With Dyslexia","postDate":"1007571692","msgId":29373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTIwMWMxN2RhZSQ3ZGY2ZWFjMCQwMzAwYThjMEBhbGFuLmNvbT4=","referencesHeader":"PDIwMDExMjA0MjMwNDM4LjY0MTQyLnFtYWlsQHdlYjEyNTAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":29354,"nextInTopic":29409,"prevInTime":29372,"nextInTime":29374,"topicId":29347,"numMessagesInTopic":0,"msgSnippet":"Diana E, Thanks for posting this great interpretation of dyslexia and your personal experience!! I have a brilliant son who deals with many of the issues you","messageBody":"<div id=\"ygrps-yiv-127607386\">Diana E,<br/>\n<br/>\nThanks for posting this great interpretation of &quot;dyslexia&quot; and your personal experience!! I have a brilliant son who deals with many of the issues you describe and who I feel I understand so much better after reading your post. It&#39;s so difficult for him to describe his experience and he was so excited to read your post with me! He knows he&#39;s different and sometimes he feels confused/concerned about his intelligence or lack of in the eyes of some. A mothers reassurance isn&#39;t always enough. Reading about someone&#39;s real life experience, not a text book definition, had a very positive effect. <br/>\n<br/>\n....Speaking in clear smooth sentences is sometimes easy and sometimes nearly impossible. I might say an entirely different word than the one I am thinking, or say something that doesn&#39;t sound like any word at all.....<br/>\n<br/>\nThis really rang a bell with him! We used to say that he was reluctant to accept that words had been created before he had a chance to create better ones.&lt;bg&gt; We&#39;ve always enjoyed his unique way of making meaning and seeing the world, he&#39;s expanded us all!<br/>\n<br/>\nLeslie<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59497572,"authorName":"Sarah Carothers","from":"&quot;Sarah Carothers&quot; &lt;puddles@...&gt;","profile":"sarahjocarothers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Living/Learning/Teaching With Dyslexia","postDate":"1007523152","msgId":29354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTkwMWMxN2QzZCQ3OTk0NjU1MCQwMjAxYThjMEB6b29vZy5vcmc+","referencesHeader":"PDIwMDExMjA0MjMwNDM4LjY0MTQyLnFtYWlsQHdlYjEyNTAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":29347,"nextInTopic":29373,"prevInTime":29353,"nextInTime":29355,"topicId":29347,"numMessagesInTopic":0,"msgSnippet":"Dear Diana, I want to thank you from the bottom of my heart for writing all that out and explaining what you see, feel, read, etc. I had no idea until I read","messageBody":"<div id=\"ygrps-yiv-610461804\">Dear Diana,<br/>\nI want to thank you from the bottom of my heart for writing all that out and explaining what you see, feel, read, etc. I had no idea until I read your post what it&#39;s like to have dyslexia. I can only say again THANK you for opening up my eyes. I still don&#39;t know if my dd is dyslexic (I would suspect to some degree she is) but this kind of information is priceless.<br/>\nSarah<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":81986835,"authorName":"Diana E","from":"Diana E &lt;dianasheart@...&gt;","profile":"dianasheart","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Living/Learning/Teaching With Dyslexia","postDate":"1007507078","msgId":29347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMjA0MjMwNDM4LjY0MTQyLnFtYWlsQHdlYjEyNTAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":29354,"prevInTime":29346,"nextInTime":29348,"topicId":29347,"numMessagesInTopic":0,"msgSnippet":"Living/Learning/Teaching With Dyslexia: You will find that my view of life is in large part responsible for my understanding of the workings of the mind and","messageBody":"<div id=\"ygrps-yiv-1623661001\">Living/Learning/Teaching With Dyslexia: You will<br/>\n find that my view of life is in large part<br/>\nresponsible for my understanding of the workings of<br/>\nthe mind and the physical brain. I do not intend to<br/>\npreach, just to <br/>\n share my experience. I will start in the middle and<br/>\n go back and forth from there. At age twenty-three I<br/>\nsaw a &quot;Sixty Minutes&quot; segment on dyslexia. Recognition<br/>\nand self-discovery was quite comforting. At age<br/>\ntwenty-six <br/>\n I was tested (for free, as a favor to the children&#39;s<br/>\n home in which I worked and the county counseling<br/>\nfacility which provided me with co-alcoholic /<br/>\nco-dependent therapy) by the institution which tested<br/>\nand counseled the juveniles I supervised. They<br/>\nconfirmed my self-diagnosis and offered nothing beyond<br/>\nthat, saying I was over-compensating as well <br/>\n as would be expected. At age twenty-nine my IQ was<br/>\n tested by a psychologist who said the same thing. My<br/>\nscore qualified me for membership in Mensa. At age<br/>\nthirty-one I started taking my first daughter, then<br/>\ntwo years old, to the library and began a bit of <br/>\n research on dyslexia. My basic understanding then,<br/>\n which has not changed but has expanded, was that the<br/>\ncentral area of the brain is shaped differently in a<br/>\ndyslexic, there is constant interaction between the <br/>\n &quot;left brain/conscious&quot; and the&quot;rightbrain /<br/>\nsubconscious&quot; in the dyslexic, and the perception of<br/>\npatterns is unpredictable. More recent research shows<br/>\ndifferences in the brain on a cellular level as well. <br/>\n Without the common distinction between conscious and<br/>\n subconscious functioning, objects are lost in space<br/>\nand sounds are lost in time. In practical terms, this<br/>\nis something like trying to put together a jigsaw <br/>\n puzzle while it is tossed in the air. Reading is<br/>\n slow because one must reread a sentence until it can<br/>\nbe read in an order that makes sense. Research shows<br/>\nthat in most people a particular area of the brain is<br/>\nused for reading, but in the dyslexic this function is<br/>\nnot restricted to one area.  Cells on the right side<br/>\nof the brain, and the right side as a whole are larger<br/>\nthan on the left side in a dyslexic.  People get the<br/>\nidea that I am very intense, but a lot of that is just<br/>\nmy effort to recognize visual and auditory input. I<br/>\n have to really gaze at a face or page or street or<br/>\nwhatever while the parts settle into place. Listening<br/>\nis difficult and requires repetition<br/>\n because the first time or two a sentence is spoken it<br/>\nmight sound like gibberish. My older daughter could<br/>\nnot understand anything spoken on television or in a <br/>\n group until age five, and so I constantly whispered<br/>\n in her ear, repeating and explaining what was said as<br/>\nbest I could. Now she finds that she must become<br/>\naccustomed to each new person&#39;s speech patterns. <br/>\n  Speaking in clear smooth sentences is sometimes<br/>\n easy and sometimes nearly impossible. I might say an<br/>\nentirely different word than the one I am thinking, or<br/>\nsay something that doesn&#39;t sound like any word at all.<br/>\n<br/>\n So it won&#39;t surprise you when I say I believe the<br/>\n most important tools in educating myself and my<br/>\ndaughter have been the development of patience and<br/>\nself-esteem. Patience I see as the result of<br/>\nforgiveness and persistence. One must forgive self and<br/>\nalso forgive others for not understanding. One must<br/>\nstubbornly continue in the face of discouragement from<br/>\nothers. Where dyslexia is concerned, I have learned <br/>\nand have taught my daughter that she functions a<br/>\n particular way just as she looks a particular way and<br/>\nshould never feel apologetic about her own nature but<br/>\nrather should understand that she has the same right<br/>\nand duty as anyone else to be and do and speak out and<br/>\ntake up space in the world. I<br/>\ncan&#39;t tell you anything useful from my own school<br/>\nyears. I was just a perfectionist who used my own<br/>\ndogged determination to concentrate so hard that I<br/>\nreally didn&#39;t get behind, I just had to try harder and<br/>\nspend more time studying than the others. I did have<br/>\nthe impression of letters and numbers moving and<br/>\nchanging places in unpredictable ways. I did try the<br/>\ncolor films and lenses when I first read about that<br/>\ntheory, but did not find them helpful. I do wear<br/>\nglasses for astigmatism, but they just cut down on<br/>\nblurring. Over the years print moves less than it did<br/>\nearly on, but everything continues to be jigsaw<br/>\npuzzles in the air. I have never been without bruised<br/>\nhands, <br/>\nfeet, knees, and elbows. The physical world is just<br/>\nnever quite where I think it is. The second most<br/>\nimportant tool is familiarity, which comes from a<br/>\ncombination of exposure and time. In general, when <br/>\npresented with new information my daughter would<br/>\nfirst resist and have difficulty understanding (&quot;I<br/>\ncan&#39;t&quot;, &quot;I won&#39;t&quot;, etc.). Then a day or week or month<br/>\nlater she would suddenly and seemingly with great<br/>\ninspiration present me with the same <br/>\ninformation as if it were her own knowledge or idea,<br/>\nand often request additional or expanded studies on<br/>\nthat topic. With something that builds on itself over<br/>\ntime, like reading or math, I took tiny repetitious<br/>\nsteps with her, constantly encouraging her and<br/>\nexplaining over and over again that she must stop<br/>\nexpecting herself to know a thing before she learns <br/>\nit and that such things require years of practice<br/>\nand development. At age six she insisted on learning<br/>\nto read, but could only tolerate a very few minutes<br/>\ndaily before crying or screaming with frustration. So<br/>\neach <br/>\nday we spent just those few minutes, and I emphasized<br/>\nher wonderful progress. I used an old library copy of<br/>\n&quot;Why Johnny Can&#39;t Read&quot;. I copied all the phonics<br/>\nexercises from the back of the book. They begin <br/>\nwith pictures to illustrate the sounds of letters.<br/>\nOne letter is learned at a time, and then two-letter<br/>\nwords are read, and so on. In our own books I<br/>\nunderlined all the words she was working on<br/>\nso that when we read together she was cued by the<br/>\nunderlines to read her part of each sentence. By the<br/>\ntime we got to the more complex and unruly spellings <br/>\nshe was reading so well that we no longer needed the<br/>\nexercises. She finds now, like me, that it is easier<br/>\nto express herself in print than with speech because<br/>\nof the opportunity for editing. At age sixteen her <br/>\nrequest for her birthday was permission to apply for<br/>\nwork. I helped her fill out the applications and<br/>\ncoached her for interviewing. She first worked in a<br/>\nsmall nursing home cooking, cleaning, and doing<br/>\nlaundry. Next she worked in a restaurant cooking,<br/>\ncleaning, waiting tables, and <br/>\nrunning errands. She learned to listen to a greater<br/>\nvariety of people, meet and converse with new people,<br/>\ncarry out multiple tasks, budget a paycheck, and<br/>\nbudget her time, all in relatively homey atmospheres.<br/>\nShe telephoned me often to ask for help and advice in<br/>\ndealing with people and unfamiliar tasks.  She <br/>\ndecided to take her GED as soon as the law allowed,<br/>\nat age eighteen. Soon after this she took her ACT. She<br/>\nattended community college classes full-time for two<br/>\nyears while working twenty to thirty hours per week in<br/>\na second restaurant. <br/>\nShe made A&#39;s, B&#39;s, and C&#39;s. Next she worked in a<br/>\nWalmart store, where many types of work can be learned<br/>\nand tried. Now at age twenty-two<br/>\nshe works third shift in a pizza factory: dismantling,<br/>\nmaintaining, and sterilizing equipment, and helping<br/>\nout in any department that needs her. This is not<br/>\nglamorous <br/>\nbut pays fairly well. She chose not to continue<br/>\nschool. At home, on her own computer, she researches a<br/>\nvast range of subjects, including dyslexia and<br/>\nhomeschooling (which I tend to think of as<br/>\nunschooling). She is amazingly creative. She thinks<br/>\nit&#39;s no big deal to make from scratch, with no<br/>\npattern, perfectly tailored doll clothes or Halloween<br/>\ncostumes for her younger sister. She bakes without<br/>\nrecipes or by using her own variations on cookbook<br/>\nrecipes. If she makes herself sit still<br/>\nlong enough she can draw anything with nearly<br/>\nphotographic quality. Which brings me to my current<br/>\nunderstanding of dyslexia, as not a disability but<br/>\nrather a way of being. With the areas of the brain so<br/>\ninteractive, the dyslexic is dreamy all the time.<br/>\nSlipping into meditative states is normal, <br/>\neffortless, and done without forethought. The<br/>\nintuitive and creative problem-solving abilities are<br/>\nstrongly emphasized. The subconscious uprush is a way<br/>\nof life. Sensitivity is dramatic. The dyslexic can&#39;t <br/>\nhelp noticing everything at once, and sometimes<br/>\nfeels a bit overwhelmed, but they tend to be able to<br/>\ndo and think about several things at once. I<br/>\npersonally can&#39;t help responding to all the<br/>\nstimulation, but my daughter sometimes <br/>\npretends to ignore it all. She needs a lot of quiet<br/>\ntime alone. Too much activity is very unsettling for<br/>\nher.  At age twenty-five I began to write a bit of<br/>\npoetry.  Over the years this has developed.  I never<br/>\nconsciously compose my writing, and in fact cannot<br/>\nwrite about something out of a simple desire to do so,<br/>\nit&#39;s more like a spring-fed stream from the depths of<br/>\nmy soul.  I feel it welling up and am agitated until<br/>\nrunning it through pen or keyboard.  But getting the<br/>\njob done is a slow process, requiring lots of editing<br/>\nto correct what I wrote instead of what I meant.  I<br/>\nwas thirty years old before I began to feel confident<br/>\nand capable in organizing my own thoughts and body of<br/>\nknowledge and experience into lengthy conversations.<br/>\nOkay, that&#39;s as far as I&#39;ll go for now.  I know this<br/>\nnote is very long, but still there are likely to be<br/>\nholes in it because I&#39;ve tried to be brief.  Feel free<br/>\nto ask for more, or to ask me to explain myself.  <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n=====<br/>\nDiana<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nBuy the perfect holiday gifts at Yahoo! Shopping.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://shopping.yahoo.com\">http://shopping.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":29399,"nextTopicId":29421}}