{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: helping my daughter with unschooling","postDate":"1302651475","msgId":60590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0MUUzOTgxLTJDMzQtNDEyQi04OUU4LUYxODhBRDI2NUVBRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlvMmwyMStvbzRyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlvMmwyMStvbzRyQGVHcm91cHMuY29tPg=="},"prevInTopic":60589,"nextInTopic":0,"prevInTime":60589,"nextInTime":60591,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"-=-Having things planned or even partially planned - all the stuff collected in on place so it can be grabbed at the spur of the moment - can make things run","messageBody":"<div id=\"ygrps-yiv-1463618150\">-=-Having things planned or even partially planned - all the stuff collected in on place so it can be grabbed at the spur of the moment - can make things run more smoothly-=-<br/>\n<br/>\nWhen we had planned days or parties, I would try to have two activities, set to go, in different places, and a movie cued up (in videotape days; easier now, maybe), and some food nearly ready to set out.   Maybe they wouldn&#39;t need four acts, but they might.    When/if things got bumpy or boring, I&#39;d have a change of place and mood all ready to go, and while they were doing the next thing, I could clean up the prior activity area. <br/>\n<br/>\nOne trick with that is for the mom not to take it personally or feel hurt if they don&#39;t want ANY of those things but come up with their own Plan E. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: helping my daughter with unschooling","postDate":"1302648705","msgId":60589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvMmwyMStvbzRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlvMXR1YytlODJrQGVHcm91cHMuY29tPg=="},"prevInTopic":60588,"nextInTopic":60590,"prevInTime":60588,"nextInTime":60590,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"... *************** Having things planned or even partially planned - all the stuff collected in on place so it can be grabbed at the spur of the moment - can","messageBody":"<div id=\"ygrps-yiv-326392931\">&quot;Katie&quot; &lt;katie_kees@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;So should I try to plan more cool things for when everyone else is home, so they &quot;see&quot; what we do?<br/>\n </span></blockquote>***************<br/>\n<br/>\nHaving things planned or even partially planned - all the stuff collected in on place so it can be grabbed at the spur of the moment - can make things run more smoothly. It could help direct attention away from, say Legos - which could otherwise be a sort of &quot;default&quot; for the kids and then stir up some issues. So being able to say &quot;oh, hey, look what I&#39;ve got!&quot; is a handy diversion. In a way, this is similar to Sandra&#39;s &quot;museum house&quot; idea. You don&#39;t need to go stock up on games and projects for your visitors, necessarily, but think about things you have and want to do &#39;someday&#39; that could work well with a guest.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/museum\">http://sandradodd.com/museum</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: helping my daughter with unschooling","postDate":"1302635785","msgId":60588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1RTExMUZDLTc2NzctNDNCQy1CODUzLUE4QjZGNDcyNEVFMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlvMXR1YytlODJrQGVHcm91cHMuY29tPg==","referencesHeader":"PGlvMXR1YytlODJrQGVHcm91cHMuY29tPg=="},"prevInTopic":60587,"nextInTopic":60589,"prevInTime":60587,"nextInTime":60589,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"-=-So should I try to plan more cool things for when everyone else is home, so they see what we do?-=- Partly, maybe.  But mostly because sometimes cool","messageBody":"<div id=\"ygrps-yiv-1464436178\">-=-So should I try to plan more cool things for when everyone else is home, so they &quot;see&quot; what we do?-=-<br/>\n<br/>\nPartly, maybe.  But mostly because sometimes cool things are more fun when shared.<br/>\n<br/>\nIf you&#39;re hoping that particular boy would chill out if he saw learning opportunities, I think it&#39;s useful all kinds of ways.  <br/>\n<br/>\nBut if all that happens is your daughter has more fun because there was another child with her, that&#39;s valuable all by itself.<br/>\n<br/>\n-=-when everyone else is home-=-<br/>\n<br/>\nIt doesn&#39;t need to be an &quot;everyone.&quot;  :-)<br/>\n<br/>\nWhen you do talk to the boy about school and unschooling, if you liked school maybe say so.  It would be cruel to make him think school is awful or to remind him that his mom could choose otherwise.  I would support the situation he&#39;s in, but say you don&#39; want your daughter to be made to feel bad.  Maybe that.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":430116031,"authorName":"Katie","from":"&quot;Katie&quot; &lt;katie_kees@...&gt;","profile":"katie_kees","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: helping my daughter with unschooling","postDate":"1302625036","msgId":60587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvMXR1YytlODJrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGludmxmcyticTJuQGVHcm91cHMuY29tPg=="},"prevInTopic":60586,"nextInTopic":60588,"prevInTime":60586,"nextInTime":60588,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"I really appreciate all the suggestions. It has opened my eyes to new ways of handling all sorts of things. Unfortunately I have not been around when the","messageBody":"<div id=\"ygrps-yiv-597852241\">I really appreciate all the suggestions. It has opened my eyes to new ways of handling all sorts of things. <br/>\n<br/>\nUnfortunately I have not been around when the comments are made because he never wants to play at our house. Turns out he is jealous of some legos my daughter has, however he chooses to tell her that her &quot;stuff&quot; isn&#39;t fun to play with. But I have told my daughter that they are only to play at our house for a while. I explained that I would like to be around to help her when these comments come up. I even asked her how she would feel if I said something to him (what a concept huh). She said she would like me to, and seemed relieved that I would handle it.<br/>\n<br/>\nWhile he was on Spring Break we were doing some really fun things a few days and my daughter decided her &quot;friend&quot; would really enjoy it and asked if she could invite him over. She was right, he did really get into making pulleys in the backyard and playing with pvc pipe to water all the flowers at once. So I thought that might open his eyes a bit.  <br/>\n<br/>\nWe&#39;ve gotten into a habit of doing most planned activities (building things, experiments, going to the creek etc) during the day when everyone else is at school. After everyone has finished homework (not my kids) and allowed to play, they seem to show up and ask my daughters to play. So should I try to plan more cool things for when everyone else is home, so they &quot;see&quot; what we do?<br/>\n<br/>\nAlso, do I wait for another &quot;remark&quot; from him or do you recommend addressing the previous comments? My husband feels I should wait until another moment presents itself, but I feel like it&#39;s just waiting for her to have a chance to get hurt again.<br/>\n<br/>\nThanks so much, Katie <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;JustSayin&quot; &lt;mfcappella@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi - <br/>\n&gt; <br/>\n&gt; When I read your post I was reminded of a situation we had that was similar:<br/>\n&gt; <br/>\n&gt; Our neighbor&#39;s son was good friends with my two boys before we started unschooling.  When we stopped sending them to school, he clearly had questions about it (some of which I overheard him asking my kids).  After a while he started making statements like &quot;well if you don&#39;t go to college you&#39;ll be flipping burgers for a living&quot;.  <br/>\n&gt; <br/>\n&gt; When these comments would come up, I could just HEAR his Dad&#39;s voice coming out of this boy&#39;s mouth.  What I also think, knowing what a persistent kid he is, was that he was pretty much bugging them every day to come up with reasons that he had to go to school when our kids didn&#39;t.  <br/>\n&gt; <br/>\n&gt; This can make a pretty difficult scenario for schooling parents, because if they are at all honest with themselves (or their kids) it&#39;s pretty hard to come up with a reason for going to school.  So they fall back on the &quot;they won&#39;t learn anything&quot;, or &quot;they&#39;ll never make any money&quot;, etc.  These comments are then parroted by their kids to their unschooled friends. <br/>\n&gt; <br/>\n&gt; I was lucky enough to be in the vicinity more often than not when these comments were made, because he was most often at our house playing.  I was always pleased at how my boys would respond (or not), I honestly think deep in their souls they understood why we do what we do, and that made all the difference.  I&#39;m pretty fervent in my beliefs about school, so that helps too.  Plus they had each been to school themselves, and no offhand comment from a schooled friend was going to send them back to THAT place.  <br/>\n&gt; <br/>\n&gt; On the rare occasion when a &quot;you&#39;ll be flipping burgers if you don&#39;t go to college&quot; comment would fly, and my kids didn&#39;t have the experience to respond, I would wander by and say, &quot;Hmmm. Bill Gates didn&#39;t finish college, and it seems like he&#39;s done pretty well&quot;.  (I would have loved to have been a fly on the neighbors&#39; wall at the dinner table THAT night ;&gt; )<br/>\n&gt; <br/>\n&gt; For this and other reasons (a little abuse of the convenience that we were home much of the time and as such we became a day camp for their kid, and his schooly ways were not exactly the best match to our unschooled life), we felt we had to limit our interaction with these neighbors. Frankly I think it&#39;s a bit of a relief for them not to have to continually justify (to themselves and to their son) their unquestioning participation in the institution of school. <br/>\n&gt; <br/>\n&gt; If you are physically near enough when they play/talk (and maybe you could make that happen somehow, like limit play times to be at your house or something) to interject with a lighthearted &quot;what works for you doesn&#39;t seem to work as well for us&quot; comment or a &quot;we so enjoy our life, I&#39;m glad you are getting so much out of school&quot; that might help shut it down.  <br/>\n&gt; <br/>\n&gt; If you are worried about making comments and embarrassing her (but remember that&#39;s YOUR experience, not hers) you could ask your daughter how you can help her.  I always ask my boys if they want me to say something to someone or otherwise intervene on their behalf.  Sometimes the answer is yes, sometimes it&#39;s no.  I respect (and do) whichever it is. <br/>\n&gt; <br/>\n&gt; You might want to try to limit her time with this friend for a while (this may happen naturally anyway).  If you think your daughter will understand it, you might just tell her that what we do as unschoolers makes people question what THEY do, and that can make people very nervous, so they try to make themselves feel &quot;right&quot; again by putting down what unschoolers do.  That might be more than she can digest, but it might not hurt to mention it to her in some way. <br/>\n&gt; <br/>\n&gt; You might also want to go over with your daughter the reasons you (and she, presumably) decided to unschool.  You might have to say it&#39;s not what most people do (yet), but that the decision was made because you want her to have ALL of the options life has available to her, not just the options she&#39;ll get in the very narrow confines of a school setting.  Feel good about it in a real (not an afraid) way (because you should - it&#39;s a great decision you&#39;ve made, the rest of the world just hasn&#39;t caught up with you yet), and hopefully she&#39;ll feel stronger and better about it too. <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; --Melissa <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Katie&quot; &lt;katie_kees@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; We&#39;re new to unschooling, so we&#39;re all trying to deschool. My daughter has a friend that she plays with almost everyday. He, in my opinion, belittles her by telling her she isn&#39;t learning what she needs to be learning. She will cry at night sometimes telling me about something he said that makes her feel like she isn&#39;t learning the &quot;right&quot; stuff. This is causing her stress about learning at home. She&#39;s only 8, and really cares about what others think of her and what she&#39;s learning. I have suggested that she not play with him or tell him how his comments are hurtful, but she doesn&#39;t like those suggestions. Is there a better way for me to look at this?<br/>\n&gt; &gt; <br/>\n&gt; &gt; Katie<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: helping my daughter with unschooling","postDate":"1302567889","msgId":60586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4NDI5MUQyLTg0QTUtNEU4Ny1BNEIxLUUzNzYzRkQxMEZEQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGludmxmcyticTJuQGVHcm91cHMuY29tPg==","referencesHeader":"PGludmxmcyticTJuQGVHcm91cHMuY29tPg=="},"prevInTopic":60585,"nextInTopic":60587,"prevInTime":60585,"nextInTime":60587,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"-=-You might also want to go over with your daughter the reasons you (and she, presumably) decided to unschool. You might have to say it s not what most people","messageBody":"<div id=\"ygrps-yiv-332186152\">-=-You might also want to go over with your daughter the reasons you (and she, presumably) decided to unschool. You might have to say it&#39;s not what most people do (yet), but that the decision was made because you want her to have ALL of the options life has available to her, not just the options she&#39;ll get in the very narrow confines of a school setting. Feel good about it in a real (not an afraid) way (because you should - it&#39;s a great decision you&#39;ve made, the rest of the world just hasn&#39;t caught up with you yet), and hopefully she&#39;ll feel stronger and better about it too. -=<br/>\n<br/>\nMelissa had lots of good ideas.<br/>\n<br/>\nAnother thing here to think about, at least for the parents, is that if/when a teen wants to learn all the things she missed by not going to school, it would only take about a year.   But those who went to school couldn&#39;t &quot;unlearn&quot; the things they and school wish they hadn&#39;t learned. :-)<br/>\n<br/>\nNot all kids have a terrible experience.   I hope this list and other such resources will help all unschooled kids have great experiences, though!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":283530155,"authorName":"JustSayin","from":"&quot;JustSayin&quot; &lt;mfcappella@...&gt;","profile":"mfcappella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: helping my daughter with unschooling","postDate":"1302550844","msgId":60585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGludmxmcyticTJuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlucHRxMStqNjlpQGVHcm91cHMuY29tPg=="},"prevInTopic":60573,"nextInTopic":60586,"prevInTime":60584,"nextInTime":60586,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"Hi - When I read your post I was reminded of a situation we had that was similar: Our neighbor s son was good friends with my two boys before we started","messageBody":"<div id=\"ygrps-yiv-462075887\">Hi - <br/>\n<br/>\nWhen I read your post I was reminded of a situation we had that was similar:<br/>\n<br/>\nOur neighbor&#39;s son was good friends with my two boys before we started unschooling.  When we stopped sending them to school, he clearly had questions about it (some of which I overheard him asking my kids).  After a while he started making statements like &quot;well if you don&#39;t go to college you&#39;ll be flipping burgers for a living&quot;.  <br/>\n<br/>\nWhen these comments would come up, I could just HEAR his Dad&#39;s voice coming out of this boy&#39;s mouth.  What I also think, knowing what a persistent kid he is, was that he was pretty much bugging them every day to come up with reasons that he had to go to school when our kids didn&#39;t.  <br/>\n<br/>\nThis can make a pretty difficult scenario for schooling parents, because if they are at all honest with themselves (or their kids) it&#39;s pretty hard to come up with a reason for going to school.  So they fall back on the &quot;they won&#39;t learn anything&quot;, or &quot;they&#39;ll never make any money&quot;, etc.  These comments are then parroted by their kids to their unschooled friends. <br/>\n<br/>\nI was lucky enough to be in the vicinity more often than not when these comments were made, because he was most often at our house playing.  I was always pleased at how my boys would respond (or not), I honestly think deep in their souls they understood why we do what we do, and that made all the difference.  I&#39;m pretty fervent in my beliefs about school, so that helps too.  Plus they had each been to school themselves, and no offhand comment from a schooled friend was going to send them back to THAT place.  <br/>\n<br/>\nOn the rare occasion when a &quot;you&#39;ll be flipping burgers if you don&#39;t go to college&quot; comment would fly, and my kids didn&#39;t have the experience to respond, I would wander by and say, &quot;Hmmm. Bill Gates didn&#39;t finish college, and it seems like he&#39;s done pretty well&quot;.  (I would have loved to have been a fly on the neighbors&#39; wall at the dinner table THAT night ;&gt; )<br/>\n<br/>\nFor this and other reasons (a little abuse of the convenience that we were home much of the time and as such we became a day camp for their kid, and his schooly ways were not exactly the best match to our unschooled life), we felt we had to limit our interaction with these neighbors. Frankly I think it&#39;s a bit of a relief for them not to have to continually justify (to themselves and to their son) their unquestioning participation in the institution of school. <br/>\n<br/>\nIf you are physically near enough when they play/talk (and maybe you could make that happen somehow, like limit play times to be at your house or something) to interject with a lighthearted &quot;what works for you doesn&#39;t seem to work as well for us&quot; comment or a &quot;we so enjoy our life, I&#39;m glad you are getting so much out of school&quot; that might help shut it down.  <br/>\n<br/>\nIf you are worried about making comments and embarrassing her (but remember that&#39;s YOUR experience, not hers) you could ask your daughter how you can help her.  I always ask my boys if they want me to say something to someone or otherwise intervene on their behalf.  Sometimes the answer is yes, sometimes it&#39;s no.  I respect (and do) whichever it is. <br/>\n<br/>\nYou might want to try to limit her time with this friend for a while (this may happen naturally anyway).  If you think your daughter will understand it, you might just tell her that what we do as unschoolers makes people question what THEY do, and that can make people very nervous, so they try to make themselves feel &quot;right&quot; again by putting down what unschoolers do.  That might be more than she can digest, but it might not hurt to mention it to her in some way. <br/>\n<br/>\nYou might also want to go over with your daughter the reasons you (and she, presumably) decided to unschool.  You might have to say it&#39;s not what most people do (yet), but that the decision was made because you want her to have ALL of the options life has available to her, not just the options she&#39;ll get in the very narrow confines of a school setting.  Feel good about it in a real (not an afraid) way (because you should - it&#39;s a great decision you&#39;ve made, the rest of the world just hasn&#39;t caught up with you yet), and hopefully she&#39;ll feel stronger and better about it too. <br/>\n<br/>\n  <br/>\n--Melissa <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Katie&quot; &lt;katie_kees@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; We&#39;re new to unschooling, so we&#39;re all trying to deschool. My daughter has a friend that she plays with almost everyday. He, in my opinion, belittles her by telling her she isn&#39;t learning what she needs to be learning. She will cry at night sometimes telling me about something he said that makes her feel like she isn&#39;t learning the &quot;right&quot; stuff. This is causing her stress about learning at home. She&#39;s only 8, and really cares about what others think of her and what she&#39;s learning. I have suggested that she not play with him or tell him how his comments are hurtful, but she doesn&#39;t like those suggestions. Is there a better way for me to look at this?<br/>\n&gt; <br/>\n&gt; Katie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 12 year old boy (was another topic at first)","postDate":"1302385251","msgId":60573,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGk9QzdxNnRVUUpQLWdua3NtNDJCN0FqUz1GZmtRQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDhGMzgwNUE4QTVGRjQ3MjBBNkY1MEFEMjk0Qzc2ODY4QE1PTXNQQz4=","referencesHeader":"PDBCNDA2NjQ1LTMxM0EtNDFCRC04NTQyLTREQkFDNDAxMzQ0MEBTYW5kcmFkb2RkLmNvbT4JPDhGMzgwNUE4QTVGRjQ3MjBBNkY1MEFEMjk0Qzc2ODY4QE1PTXNQQz4="},"prevInTopic":60572,"nextInTopic":60585,"prevInTime":60572,"nextInTime":60574,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"... Especially the laughing out loud during Xbox live.  I love that laugh, I even love when it wakes me up in the middle of the night. And replace dog with","messageBody":"<div id=\"ygrps-yiv-1945449656\">On Sat, Apr 9, 2011 at 4:40 PM, Rod Thomas &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rthomas314@...\">rthomas314@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  That s pretty much it, except to<br/>\n&gt; stop and eat or play with the dog some. Then he also plays xbox live,<br/>\n&gt; laughs outloud and talks to others .<br/>\n&gt;<br/>\n&gt; He seems happy but I do sense a restlessness, boredom at times. Hoping<br/>\n&gt; it wont last forever, being patient. I do bring him food, find him<br/>\n&gt; online friends, help him buy hardware, etc.<br/>\n&gt;<br/>\n&gt; But I am concerned.<br/>\n&gt;<br/>\n&gt; This sounds like my just turned 11 y/o.<br/>\n<br/>\n </span></blockquote>Especially the laughing out loud during Xbox live.  I love that laugh, I<br/>\neven love when it wakes me up in the middle of the night.<br/>\n<br/>\nAnd replace dog with cats, he loves to pick them up and cuddle them.  Eating<br/>\nhappens while playing video games, we do lots of finger foods for that<br/>\nreason and I pull dishes out of his room throughout the day.<br/>\n<br/>\nHe will typically try something else once.  He made one stop motion video,<br/>\nmade 2 clay figures during one session, planned to paint them, still hasn&#39;t.<br/>\n He&#39;ll make part of a meal with me before heading back to his room and not<br/>\nhelping me cook again for weeks.  He had to start trusting that I would let<br/>\nhim do these things just once or just part way before he started venturing<br/>\nout of his comfort zone (the electronics) to try them.  Now he knows he can<br/>\nstop mid project if he doesn&#39;t like it and either I&#39;ll finish it for him, or<br/>\nwe&#39;ll just clean it up and move on.<br/>\n<br/>\nHe doesn&#39;t particularly like driving anywhere, but lately he loves the idea<br/>\nof walking to the gas station either with our without me.  It helps that I<br/>\nmake sure he has some money to buy himself a slurpee and some gaming snacks.<br/>\nTonight (once it cools down) we might venture a little further and pick up<br/>\nsome prescriptions on foot.<br/>\n<br/>\nI keep offering new ideas, knowing that they will probably be rejected or<br/>\nonly tried once.  These things will likely be revisited sometime in the<br/>\nfuture, but for now he&#39;s learning plenty and getting lots of enjoyment from<br/>\nhis electronics.<br/>\n<br/>\nTina<br/>\n-- <br/>\nUnschooling Untitled &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschoolinguntitled.com\">http://www.unschoolinguntitled.com</a>&gt;  (<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschoolinguntitled.com\">http://www.unschoolinguntitled.com</a> )<br/>\nLiving an unschooled lifestyle, one experience at a time!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":475420444,"authorName":"Rod Thomas","from":"&quot;Rod Thomas&quot; &lt;rthomas314@...&gt;","profile":"flyerkat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] 12 year old boy (was another topic at first)","postDate":"1302381637","msgId":60572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGMzgwNUE4QTVGRjQ3MjBBNkY1MEFEMjk0Qzc2ODY4QE1PTXNQQz4=","inReplyToHeader":"PDBCNDA2NjQ1LTMxM0EtNDFCRC04NTQyLTREQkFDNDAxMzQ0MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60571,"nextInTopic":60573,"prevInTime":60571,"nextInTime":60573,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"He no longer wants to go to our homeschool support group gathering at park, so we haven t in a year.  He plays minecraft a lot, Gary s mod, Fiesta, and watches","messageBody":"<div id=\"ygrps-yiv-275405646\">He no longer wants to go to our homeschool support group gathering at<br/>\npark, so we haven&#39;t in a year.  He plays minecraft a lot, Gary&#39;s mod,<br/>\nFiesta, and watches LOTS of anime type shows like Naruto, tons of<br/>\nepisodes, some nights with his Dad.  That s pretty much it, except to<br/>\nstop and eat or play with the dog some.  Then he also plays xbox live,<br/>\nlaughs outloud and talks to others .  I don&#39;t know what GenCon is.  He<br/>\nplays on line with others, and has an occasional friend over, not v<br/>\noften.  An occasional Friday night bowling is the most he ventures out.<br/>\nDefinitely learning cause whenever I ask &quot;how did you know that?&quot; its<br/>\nusu from gaming or tv.<br/>\nNot into cooking, music, sports, art,.   <br/>\n <br/>\n He seems happy but I do sense a restlessness, boredom at times.  Hoping<br/>\nit wont last forever, being patient.  I do bring him food, find him<br/>\nonline friends, help him buy hardware, etc.<br/>\n <br/>\nBut I am concerned.  <br/>\n <br/>\nkat<br/>\n <br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>] On Behalf Of Sandra Dodd<br/>\nSent: Saturday, April 09, 2011 4:16 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: Re: [AlwaysLearning] 12 year old boy (was another topic at<br/>\nfirst)<br/>\n <br/>\n  <br/>\n-=-What about a 12yo that&#39;s never been to school, and is not at all<br/>\ninterested in leaving the house? I invite him out a lot, but get<br/>\nturned down 95% of the time. We used to play games a lot, made things,<br/>\ncollected things, fun science stuff, exploring, etc. But maybe he<br/>\nburned out. We used to go a lot when he and his older brother were<br/>\nyounger. <br/>\n<br/>\n-=-He is v much interested in his laptop or xbox.-=-<br/>\n<br/>\nHow long has he not wanted to go out? He doesn&#39;t want to go ANYwhere? He<br/>\nwouldn&#39;t want to go to GenCon? <br/>\nDoes he have others over, or is he playing online with others?<br/>\n<br/>\nTwelve year old boys can be very stay-at-home guys, in my experience and<br/>\nfrom other families I&#39;ve seen. I don&#39;t think it will last forever. And<br/>\nwhile it is lasting, the questions you could ask are:<br/>\nIs he happy?<br/>\nIs he learning?<br/>\n<br/>\nIs there a gaming shop like a board games shop in town? <br/>\n<br/>\nDoes he have any other interests at home? Cooking? Music? Sports? Art?<br/>\nWhat does he like about the games? Logic? History/story-line?<br/>\nInteractions between characters? There are parts to what a person is<br/>\ndoing on a laptop. In the past 24 hours, though someone else might say<br/>\n&quot;she is very much interested in her laptop,&quot; I&#39;ve corresponded with<br/>\nseveral people in the UK, planning a trip; corresponded with my friend<br/>\nwho&#39;s living in France but is coming to Albuqeurque in a few weeks for<br/>\nher daughter&#39;s college graduation party; edited photos and written some<br/>\nblog posts; played Angry Birds; looked up places in England, and train<br/>\nstations; listened to several chapters of a book about human nature<br/>\ntoday, and of religion yesterday; printed out some labels for the post<br/>\noffice (rather than buy them, printed some Media Mail labels I found<br/>\nwith image and reproduced in a two-column word file and then taped on a<br/>\ncouple of packages); played a game with Marty; set up two lyrics game<br/>\nplays (one for yesterday, and one will launch at midnight tonight, for<br/>\ntomorrow <a rel=\"nofollow\" target=\"_blank\" href=\"http://lyricsgame.blogspot.com\">http://lyricsgame.blogspot.com</a> ); looked at some photos of<br/>\ninteresting details of buildings, sculptures and features in London<br/>\n(weather vanes, an old cast iron street lamp) that Schuyler sent me;<br/>\nordered a vest with inside pockets for passport and camera; complained<br/>\nto Mattel.com that they wrote and asked me to review some World<br/>\nWrestling action figures that I didn&#39;t buy, and asked them to make sure<br/>\nI wasn&#39;t charged for those, because though I DID get the Barbie with<br/>\npeeing puppies (a gift for Zoya, in India; don&#39;t tell), I didn&#39;t<br/>\nbuy/get/want the action figures. <br/>\n<br/>\nProbably other things.<br/>\n<br/>\nProbably when you look at your son and it looks like laptop or xbox,<br/>\nit&#39;s more like that.<br/>\nHere&#39;s a Gilligan&#39;s Island rundown I wrote years ago:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/gilligan\">http://sandradodd.com/t/gilligan</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] helping my daughter with unschooling","postDate":"1302380257","msgId":60571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Mzc5ODlCLTcwNEEtNEQ3MS04NTM4LUJCQzYzQzBGNkI4RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEI1QzQwQzJFMTY2RjQ2QTQ4OUM2QjMzMTA3OEYzNDRDQE1PTXNQQz4=","referencesHeader":"PEI1QzQwQzJFMTY2RjQ2QTQ4OUM2QjMzMTA3OEYzNDRDQE1PTXNQQz4="},"prevInTopic":60570,"nextInTopic":60572,"prevInTime":60570,"nextInTime":60572,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"-=-What about a 12yo that s never been to school, and is not at all interested in leaving the house? -=- I answered it, but it s not really parallel to a","messageBody":"<div id=\"ygrps-yiv-498561769\">-=-What about a 12yo that&#39;s never been to school, and is not at all<br/>\ninterested in leaving the house? -=-<br/>\n<br/>\nI answered it, but it&#39;s not really parallel to a family that&#39;s just started unschooling and the child is hearing bad information about unschooling before she has enough experience, age  or confidence to see it objectively.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] 12 year old boy (was another topic at first)","postDate":"1302380173","msgId":60570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBCNDA2NjQ1LTMxM0EtNDFCRC04NTQyLTREQkFDNDAxMzQ0MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEI1QzQwQzJFMTY2RjQ2QTQ4OUM2QjMzMTA3OEYzNDRDQE1PTXNQQz4=","referencesHeader":"PEI1QzQwQzJFMTY2RjQ2QTQ4OUM2QjMzMTA3OEYzNDRDQE1PTXNQQz4="},"prevInTopic":60569,"nextInTopic":60571,"prevInTime":60569,"nextInTime":60571,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"-=-What about a 12yo that s never been to school, and is not at all interested in leaving the house? I invite him out a lot, but get turned down 95% of the","messageBody":"<div id=\"ygrps-yiv-1809522356\">-=-What about a 12yo that&#39;s never been to school, and is not at all<br/>\ninterested in leaving the house? I invite him out a lot, but get<br/>\nturned down 95% of the time. We used to play games a lot, made things,<br/>\ncollected things, fun science stuff, exploring, etc. But maybe he<br/>\nburned out. We used to go a lot when he and his older brother were<br/>\nyounger. <br/>\n<br/>\n-=-He is v much interested in his laptop or xbox.-=-<br/>\n<br/>\nHow long has he not wanted to go out?  He doesn&#39;t want to go ANYwhere?  He wouldn&#39;t want to go to GenCon?   <br/>\nDoes he have others over, or is he playing online with others?<br/>\n<br/>\nTwelve year old boys can be very stay-at-home guys, in my experience and from other families I&#39;ve seen.  I don&#39;t think it will last forever.  And while it is lasting, the questions you could ask are:<br/>\nIs he happy?<br/>\nIs he learning?<br/>\n<br/>\nIs there a gaming shop like a board games shop in town?  <br/>\n<br/>\nDoes he have any other interests at home?  Cooking?  Music?  Sports?  Art?  What does he like about the games?  Logic?  History/story-line?  Interactions between characters?  There are parts to what a person is doing on a laptop.  In the past 24 hours, though someone else might say &quot;she is very much interested in her laptop,&quot; I&#39;ve corresponded with several people in the UK, planning a trip; corresponded with my friend who&#39;s living in France but is coming to Albuqeurque in a few weeks for her daughter&#39;s college graduation party; edited photos and written some blog posts; played Angry Birds;  looked up places in England, and train stations; listened to several chapters of a book about human nature today, and of religion yesterday; printed out some labels for the post office (rather than buy them, printed some Media Mail labels I found with image and reproduced in a two-column word file and then taped on a couple of packages); played a game with Marty; set up two lyrics game plays (one for yesterday, and one will launch at midnight tonight, for tomorrow <a rel=\"nofollow\" target=\"_blank\" href=\"http://lyricsgame.blogspot.com\">http://lyricsgame.blogspot.com</a> ); looked at some photos of interesting details of buildings, sculptures and features in London (weather vanes, an old cast iron street lamp) that Schuyler sent me; ordered a vest with inside pockets for passport and camera; complained to Mattel.com that they wrote and asked me to review some World Wrestling action figures that I didn&#39;t buy, and asked them to make sure I wasn&#39;t charged for those, because though I DID get the Barbie with peeing puppies (a gift for Zoya, in India; don&#39;t tell), I didn&#39;t buy/get/want the action figures.    <br/>\n<br/>\nProbably other things.<br/>\n<br/>\nProbably when you look at your son and it looks like laptop or xbox, it&#39;s more like that.<br/>\nHere&#39;s a Gilligan&#39;s Island rundown I wrote years ago:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/gilligan\">http://sandradodd.com/t/gilligan</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: helping my daughter with unschooling","postDate":"1302379530","msgId":60569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0QUM0RTIzLTA4MTEtNEVCMi04Qjg3LUZGNTZCQzMxQjU5RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlucWN2bStiNTc2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlucWN2bStiNTc2QGVHcm91cHMuY29tPg=="},"prevInTopic":60568,"nextInTopic":60570,"prevInTime":60568,"nextInTime":60570,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"-=-A light bulb came on in my head from this, thank you. I m anxiously waiting for my daughter to come home so I can apologize for trying to put it on her.-=- ","messageBody":"<div id=\"ygrps-yiv-774823014\">-=-A light bulb came on in my head from this, thank you. I&#39;m anxiously waiting for my daughter to come home so I can apologize for trying to put it on her.-=-<br/>\n<br/>\nIt should be a shared project, not all you, and not all her.  Please don&#39;t think in extremes about it.  Or rather don&#39;t overcompensate by going completely the other way.   There shouldn&#39;t be a rule about it.  And I&#39;m thinking maybe in your head you had a ghostly rule about &quot;let them work it out.&quot;   (Maybe not.)<br/>\n<br/>\n-=-Any suggestions how I know when I should step in or when she is just wanting to talk and wanting advice?-=-  <br/>\n<br/>\nNobody in the world could know when you should step in for certain. :-)<br/>\nI think more often than &#39;just right,&#39; people respond too soon or too late, too wimpily or too strongly.  It&#39;s hard to get just the right amount at just the right time.<br/>\n<br/>\nWhat you can do, though, is aim toward &quot;a little better than last time,&quot; and eventually you&#39;ll have better aim in general.<br/>\n<br/>\n-=-I remember my mom stepping in for me on a certain occasion and I was so embarrassed because I had really just wanted to talk to her about it. Granted I was in high school and that is much older. But it kept me from going back to her about other issues.-=-<br/>\n<br/>\nDon&#39;t let that color all your decisions now, either.  People can live in too much a reactionary way, rather than a thoughtful way.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n(It&#39;s not a list of rules, it&#39;s how to get away from rules.)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":475420444,"authorName":"Rod Thomas","from":"&quot;Rod Thomas&quot; &lt;rthomas314@...&gt;","profile":"flyerkat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] helping my daughter with unschooling","postDate":"1302378796","msgId":60568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1QzQwQzJFMTY2RjQ2QTQ4OUM2QjMzMTA3OEYzNDRDQE1PTXNQQz4=","inReplyToHeader":"PDRDRkM0MEFELTNDQTUtNDY4RS1CMTNELUNGM0FGQjIzMTRCQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60567,"nextInTopic":60569,"prevInTime":60567,"nextInTime":60569,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1849978401\">&lt;&lt;&lt;If you had a fourteen year old boy, I would say let him sleep late<br/>\nand watch video games all he wanted to, to recover from ten years of<br/>\nschool. But you have an eight year old. Do cool things she likes, out of<br/>\nthe house as much as possible. Go to lunch where you&#39;ve never been, or<br/>\nshop where you&#39;ve never shopped, or go exploring somewhere to take<br/>\nphotos or to do sketches or look for birds&#39; nests or ferns or rocks or<br/>\nsomething.<br/>\n<br/>\nSandra&gt;&gt;&gt;&gt;<br/>\n <br/>\nWhat about a 12yo that&#39;s never been to school, and is not at all<br/>\ninterested in leaving the house?   I invite him out a lot, but get<br/>\nturned down 95% of the time.  We used to play games a lot, made things,<br/>\ncollected things, fun science stuff, exploring, etc.  But maybe he<br/>\nburned out.  We used to go a lot when he and his older brother were<br/>\nyounger.  <br/>\n <br/>\nHe is v much interested in his laptop or xbox.<br/>\n <br/>\nkat<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":430116031,"authorName":"Katie","from":"&quot;Katie&quot; &lt;katie_kees@...&gt;","profile":"katie_kees","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: helping my daughter with unschooling","postDate":"1302378294","msgId":60567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlucWN2bStiNTc2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRDRkM0MEFELTNDQTUtNDY4RS1CMTNELUNGM0FGQjIzMTRCQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60566,"nextInTopic":60568,"prevInTime":60566,"nextInTime":60568,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"***But if she has cried more than once, I think you should have done something directly. It can be friendly and nice, but should be firm. If he were hitting","messageBody":"<div id=\"ygrps-yiv-2109684406\">***But if she has cried more than once, I think you should have done something directly. It can be friendly and nice, but should be firm. If he were hitting her or sexually molesting her, you wouldn&#39;t just let her cry and suggest maybe she could deal with it on her own. If he&#39;s repeatedly insulting her and you, that&#39;s not really okay, is it?***<br/>\n<br/>\nA light bulb came on in my head from this, thank you. I&#39;m anxiously waiting for my daughter to come home so I can apologize for trying to put it on her.<br/>\n<br/>\nAny suggestions how I know when I should step in or when she is just wanting to talk and wanting advice? I remember my mom stepping in for me on a certain occasion and I was so embarrassed because I had really just wanted to talk to her about it. Granted I was in high school and that is much older. But it kept me from going back to her about other issues.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] helping my daughter with unschooling","postDate":"1302370274","msgId":60566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZEMDdCNDIyLTA2NjctNDZFMy1BQTNCLTYwNTAwMEFFMjlDREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk4MUZBOUY4MzQ0NDQxRUI4NUY5NzA0Q0Q4OUJGQ0U4QE1PTXNQQz4=","referencesHeader":"PDk4MUZBOUY4MzQ0NDQxRUI4NUY5NzA0Q0Q4OUJGQ0U4QE1PTXNQQz4="},"prevInTopic":60565,"nextInTopic":60567,"prevInTime":60565,"nextInTime":60567,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"-=-I get the feeling these comments originate from the parents and the kids repeat it. -=- Yes, I agree. They also come from kids playing unsupervised, though,","messageBody":"<div id=\"ygrps-yiv-1418020328\">-=-I get the feeling these comments originate from the parents<br/>\nand the kids repeat it. -=-<br/>\n<br/>\nYes, I agree.<br/>\nThey also come from kids playing unsupervised, though, so maybe arrange to be with those two more for a while and keep the conversation on other, cheerier things so they have a relationship based on their shared experiences rather than their differences.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] helping my daughter with unschooling","postDate":"1302370204","msgId":60565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDRkM0MEFELTNDQTUtNDY4RS1CMTNELUNGM0FGQjIzMTRCQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlucHRxMStqNjlpQGVHcm91cHMuY29tPg==","referencesHeader":"PGlucHRxMStqNjlpQGVHcm91cHMuY29tPg=="},"prevInTopic":60564,"nextInTopic":60566,"prevInTime":60564,"nextInTime":60566,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"-=-I have suggested that she not play with him or tell him how his comments are hurtful, but she doesn t like those suggestions. Is there a better way for me","messageBody":"<div id=\"ygrps-yiv-538153183\">-=-I have suggested that she not play with him or tell him how his comments are hurtful, but she doesn&#39;t like those suggestions. Is there a better way for me to look at this?-=-<br/>\n<br/>\nYOU tell him to stop talking to her about those things, to talk about other things.<br/>\nAnd help her with a couple of phrases she can use when she can&#39;t think of what to say.  Eight is VERY young to be stuck with an awkward social situation without an adult to go to for help.<br/>\n<br/>\nMaybe she could say &quot;Let&#39;s go and talk to my mom about it,&quot; or &quot;Do you want to call my mom and ask her?&quot;<br/>\n<br/>\nYou or she could say &quot;If it turns out she&#39;s not learning enough, she can go to school, but right now we&#39;re really liking this way.<br/>\n<br/>\nOr she could say &quot;There are things you know that you didn&#39;t learn in school,&quot; and name a few (depending what it is he knows; you could help her think of some).<br/>\n<br/>\nBut of she has cried more than once, I think you should have done something directly.  It can be friendly and nice, but should be firm. If he were hitting her or sexually molesting her, you wouldn&#39;t just let her cry and suggest maybe she could deal with it on her own.  If he&#39;s repeatedly insulting her and you, that&#39;s not really okay, is it?<br/>\n<br/>\n-=- helping my daughter with unschooling-=-<br/>\n<br/>\nWhen I saw the topic, my first thought was that children shouldn&#39;t need to understand unschooling.  Parents do.<br/>\nStep up your game.  Maybe your life busy and interesting.  Invite the other boy to go places with you--not things that seem like school field trips, unless there&#39;s something (a museum, zoo) he himself would really love and you know it, but have the boy with your family doing neat stuff so he knows more of what you&#39;re doing.  Don&#39;t talk about learning or about unschooling, just do and be the cool stuff.<br/>\n<br/>\n-=-We&#39;re new to unschooling, so we&#39;re all trying to deschool.-=-<br/>\n<br/>\nIf you had a fourteen year old boy, I would say let him sleep late and watch video games all he wanted to, to recover from ten years of school.  But you have an eight year old.   Do cool things she likes, out of the house as much as possible.  Go to lunch where you&#39;ve never been, or shop where you&#39;ve never shopped, or go exploring somewhere to take photos or to do sketches or look for birds&#39; nests or ferns or rocks or something.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":475420444,"authorName":"Rod Thomas","from":"&quot;Rod Thomas&quot; &lt;rthomas314@...&gt;","profile":"flyerkat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] helping my daughter with unschooling","postDate":"1302368564","msgId":60564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4MUZBOUY4MzQ0NDQxRUI4NUY5NzA0Q0Q4OUJGQ0U4QE1PTXNQQz4=","inReplyToHeader":"PGlucHRxMStqNjlpQGVHcm91cHMuY29tPg=="},"prevInTopic":60563,"nextInTopic":60565,"prevInTime":60563,"nextInTime":60565,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"We had this problem in the past also, my sons friend told him you don t even know how to read .  He actually reads very well, but.. that s not the point. I","messageBody":"<div id=\"ygrps-yiv-2005183761\">We had this problem in the past also, my sons friend told him &quot;you don&#39;t<br/>\neven know how to read&quot;.  He actually reads very well, but.. that&#39;s not<br/>\nthe point. I get the feeling these comments originate from the parents<br/>\nand the kids repeat it.  <br/>\n <br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>] On Behalf Of Katie<br/>\nSent: Saturday, April 09, 2011 11:26 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: [AlwaysLearning] helping my daughter with unschooling<br/>\n <br/>\n  <br/>\nWe&#39;re new to unschooling, so we&#39;re all trying to deschool. My daughter<br/>\nhas a friend that she plays with almost everyday. He, in my opinion,<br/>\nbelittles her by telling her she isn&#39;t learning what she needs to be<br/>\nlearning. She will cry at night sometimes telling me about something he<br/>\nsaid that makes her feel like she isn&#39;t learning the &quot;right&quot; stuff. This<br/>\nis causing her stress about learning at home. She&#39;s only 8, and really<br/>\ncares about what others think of her and what she&#39;s learning. I have<br/>\nsuggested that she not play with him or tell him how his comments are<br/>\nhurtful, but she doesn&#39;t like those suggestions. Is there a better way<br/>\nfor me to look at this?<br/>\n<br/>\nKatie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":430116031,"authorName":"Katie","from":"&quot;Katie&quot; &lt;katie_kees@...&gt;","profile":"katie_kees","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"helping my daughter with unschooling","postDate":"1302362753","msgId":60563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlucHRxMStqNjlpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":60564,"prevInTime":60562,"nextInTime":60564,"topicId":60563,"numMessagesInTopic":0,"msgSnippet":"We re new to unschooling, so we re all trying to deschool. My daughter has a friend that she plays with almost everyday. He, in my opinion, belittles her by","messageBody":"<div id=\"ygrps-yiv-1945067554\">We&#39;re new to unschooling, so we&#39;re all trying to deschool. My daughter has a friend that she plays with almost everyday. He, in my opinion, belittles her by telling her she isn&#39;t learning what she needs to be learning. She will cry at night sometimes telling me about something he said that makes her feel like she isn&#39;t learning the &quot;right&quot; stuff. This is causing her stress about learning at home. She&#39;s only 8, and really cares about what others think of her and what she&#39;s learning. I have suggested that she not play with him or tell him how his comments are hurtful, but she doesn&#39;t like those suggestions. Is there a better way for me to look at this?<br/>\n<br/>\nKatie</div>","specialLinks":[]}],"prevTopicId":60346,"nextTopicId":60591}}