{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"megates@juno.com","from":"megates@...","replyTo":"LIST","senderId":"cBXTngdyQKYDIszzdUaCLS7bSSfboyeCUx-bW-DJ0JKT4l_o2MEp8232cT865iJ75eu4BoN4hg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Is this unschooling?/was making paper","postDate":"999217910","msgId":23917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwODMwLjE3MzQzOC4tMTMyODM1LjMubWVnYXRlc0BqdW5vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":23916,"nextInTime":23918,"topicId":23917,"numMessagesInTopic":0,"msgSnippet":"I get out the paper making kit and tell the kids we will finally make that paper today that I ve been talking about all summer.  This gets BIG SMILES!  First","messageBody":"<div id=\"ygrps-yiv-1646277078\">I get out the paper making kit and tell the kids we will finally make<br/>\nthat paper today that I&#39;ve been talking about all summer.  This gets BIG<br/>\nSMILES!  First we tear up the lintners.  Kids say, &quot;this is too hard&quot;.  I<br/>\nhelp and Lisa grabs the scissors.  She notices how &quot;cottony&quot; the lintners<br/>\nare.  We talk about what paper is made from and how it was once made from<br/>\npapyrus.  Now the paper is torn, so we pour water on it and let it soak<br/>\nwhile we go to Costco (taste samples, find out that mom won&#39;t buy the<br/>\njuice with added sugar and that the bunk bed set that says kids under 6<br/>\naren&#39;t allowed on top really means that once the beds are at home parents<br/>\nare allowed to make their own rules about who can go on top).<br/>\n<br/>\nBack home to the paper - decide that we should have torn it in smaller<br/>\npieces but we throw it in the blender anyway with some lovely orange<br/>\ndryer lint that we&#39;ve been saving for a loooong time.  The kids decide to<br/>\nplay with their American Girl dolls while they are waiting for the paper<br/>\nto blend.  The dolls are going on a campout so they all need sleeping<br/>\nbags.  They use doll quilts for that.  Interesting conversation between<br/>\nthem and the dolls about what kind of food to bring for the campout.  The<br/>\npaper mash doesn&#39;t look quite right but I continue anyway.  Pour the<br/>\nslurry into the tub.  &quot;Look kids, I&#39;m going to make the paper now.&quot; <br/>\n&quot;This stinks!&quot;  &quot;ooh, I don&#39;t want to put my hands in that!&quot;  OK, so I do<br/>\nthe first one.  Lisa decides to give it a try.  Makes one piece and goes<br/>\nback to her dolls.  I do a few more.  Jackie tries one and enjoys<br/>\nstirring up the water with her hands.  She proudly carries her piece of<br/>\npaper outside to dry.  (98 degrees outside helps!)  Then she goes back to<br/>\nthe dolls.  I continue making paper, making occasional comments about<br/>\nwhat I&#39;m doing and asking if anybody wants to do another one.  Nobody<br/>\ndoes.  By the 11th sheet I&#39;m tired of it and have used up most of the<br/>\npulp.  Dump the rest of the slurry in the compost pile and clean up the<br/>\nmess.<br/>\n<br/>\nWe sit down to have a snack and study the piece that is almost dry.  Lisa<br/>\nwonders how it will be to write on.<br/>\n<br/>\nNeighbor calls to say she is held up at work so can we meet her son at<br/>\nthe bus.  Bus is 10 minutes late, but we visit with another neighbor who<br/>\nlives near the bus stop.  The 6th grader talks about how middle school is<br/>\nsoo hard and she will never survive it.  Mom comments on how much they<br/>\nhad to invest in art supplies.  Finally the bus arrives and my kids take<br/>\noff to play with their friends.<br/>\n<br/>\nIs this unschooling?<br/>\n<br/>\nMary Ellen</div>","specialLinks":[]}],"prevTopicId":23742,"nextTopicId":23794}}