{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":120767120,"authorName":"Jocelyn Vilter","from":"Jocelyn Vilter &lt;jocelyn@...&gt;","profile":"jocelynv2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"D and D","postDate":"1126638498","msgId":108242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGNEM3MUIyLjJDQjhEJUpvY2VseW5AVmlsdGVyLnVzPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":108241,"nextInTime":108243,"topicId":108242,"numMessagesInTopic":0,"msgSnippet":"He got up!  And had quite a bit to say on the subject, as you can see below. I transcribed what he was saying, so any errors are my own etc. Jocelyn Vilter ","messageBody":"<div id=\"ygrps-yiv-281003453\">He got up!  And had quite a bit to say on the subject, as you can see below.<br/>\nI transcribed what he was saying, so any errors are my own etc.<br/>\n<br/>\nJocelyn Vilter<br/>\n<br/>\n<br/>\nGood to see some new people getting into the game.  DnD is an interesting<br/>\ngame and can certainly broaden your understanding of a variety of subjects,<br/>\nbut it can also be difficult to get into.<br/>\n<br/>\nDnD basic game is a good way to get started.  You&#39;ll need at least three<br/>\npeople, preferably five, to play a successful game.  This is because you<br/>\nneed at least one dungeon master to run the world and if you only have one<br/>\nadditional player this can cause problems with game balance and enjoyment.<br/>\nAs for what books to get hold of, I would recommend sticking with the basic<br/>\ngame until you&#39;ve run at least two successful sessions with at least three<br/>\npeople.  Once you&#39;ve done that, you should start branching off into the<br/>\nthree core rule books of the the 3.5 edition.<br/>\n<br/>\nThe Players Handbook provides you with all the info you need to create new<br/>\nchars level them all the way up to 20.  It also has all of the combat rules<br/>\nand spells.  What it lacks is any info on DMing and creating encounters and<br/>\ntreasure for your players, if you are the DM.<br/>\n<br/>\nThe Monsters Manual contains 100&#39;s of monsters as well as rules for creating<br/>\nyour own monsters and a glossary of their special abilities.  Very handy<br/>\nwhen running encounters, but useless by itself when creating a campaign.<br/>\n<br/>\nThe Dungeon Masters Guide contains dozens of pages of advice on how to run a<br/>\nsuccessful campaign as well as all of the rules to creating balanced<br/>\nencounters.  Magic items, balanced treasure and info on how to create your<br/>\nown campaign world.<br/>\n<br/>\nIn short, if you&#39;re really serious about getting into DnD, you&#39;ll need at<br/>\nleast these three books.  The non-book accessories you&#39;ll need include<br/>\npencils (I find mechanical pencils are best), as well as plenty of scratch<br/>\npaper and character sheets, which you can download from the Wizards of the<br/>\nCoast site, or photocopy from the players handbook.<br/>\n<br/>\nFrom there you have three options for resolving combat, you can use graph<br/>\npaper, maps and miniatures or your imagination.  Graph paper is a cheap and<br/>\nflexible solution but leaves something to be desired as far aesthetics goes.<br/>\nMiniatures and maps provide clarity where the rules are concerned are<br/>\npleasing visually, but are highly expensive and somewhat limited.  Finally,<br/>\nyour imagination is perhaps the most aesthetically pleasing  and is<br/>\ndefinitely the cheapest, but can result in confusion while resolving combat.<br/>\n<br/>\nIt&#39;s also worth mentioning that there is a line of role playing books using<br/>\nthe d20 system, created specifically for Warcraft.  I haven&#39;t used them<br/>\nmyself, but they seem to be of high quality.  Keep in mind that they were<br/>\ncreated before the WoW online game, so there are some discrepancies there.<br/>\n<br/>\nGood luck!<br/>\n<br/>\nMatthew Vilter</div>","specialLinks":[]}],"prevTopicId":108236,"nextTopicId":78353}}