{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Shannon Nicoletta Manns","from":"&quot;Shannon Nicoletta Manns&quot; &lt;snmanns@...&gt;","replyTo":"LIST","senderId":"L34iZw-0uZX24Y5o88oeM2xm6Sw0M6D4f8CTw5rI4VKJmXMKEmea-JuDhaQ3IwlEmKC5ejI3mWddKl_ACj5zVIVPNKQz8J3UBiZGIVIdAmRBu51GYm4i","spamInfo":{"isSpam":false,"reason":"0"},"subject":"indigo children","postDate":"966779079","msgId":12079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjgwMWMwMGFhYyRlZWI3MGI4MCQxYzY2N2JkOEBmbWFubnM+","referencesHeader":"PDk2Njc2MzUwMC4yMjI4M0BlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":12078,"nextInTime":12080,"topicId":12079,"numMessagesInTopic":0,"msgSnippet":"I was wanting to bring your attention to the following and I would be interested to know what you think: The New Kids Have Arrived! The Indigo Children An","messageBody":"<div id=\"ygrps-yiv-1835271605\">I was wanting to bring your attention to the following and I would be<br/>\ninterested to know what you think:<br/>\n<br/>\nThe New Kids Have Arrived!<br/>\nThe Indigo Children<br/>\nAn Interview With Co-Author Jan Tober<br/>\nAs told to Rick Martin<br/>\n<br/>\nThe great Master Teacher of 2000 years ago said: &quot;Blessed are the children.&quot;<br/>\nThese children will be the guides to return us, as a world, to the path of<br/>\nlove.<br/>\n<br/>\nTo a lot of people, it&#39;s not really news that there is something very<br/>\nspecial going on with the children in this world. It&#39;s been happening for<br/>\nsome time. There are those who say that the &quot;forerunners&quot; to this modern-day<br/>\nphenomenon started being birthed as long as 20 years ago. Futurists, such as<br/>\nGordon-Michael Scallion, have been speaking of their planetary entrance for<br/>\nsome years now, labeled by him as the Blue Children. To Nancy Ann Tappe,<br/>\ngifted with the ability to see the auric field of the human body, they are<br/>\nsimply referred to as Indigos.<br/>\n<br/>\nWhat does the presence of these &quot;super kids&quot; mean? What is their message?<br/>\nWhat is their purpose for being here, right now? Is this just a fanciful<br/>\nidea or a reality? What are the Indigos and what makes them &quot;Indigo&quot;?<br/>\n<br/>\nAlthough it took some months to coordinate, I was finally able to speak with<br/>\nJan Tober, the co-author of the provocative book called The Indigo Children,<br/>\nabout this fascinating subject.<br/>\n<br/>\nThe book, while merely an &quot;introduction&quot; into the subject, is one that every<br/>\nteacher and school administrator should be required to read. If you have a<br/>\nchild who is &quot;a handful&quot;, if you have a child who has been diagnosed with<br/>\nAttention Deficit Disorder (ADD) or Hyperactivity (ADHD), then by all means<br/>\ngo get and read this book! It should be in every library across the land.<br/>\n<br/>\nIt is obvious that, in an hour and a half, we were only able to scratch the<br/>\nsurface on this subject. But if you have been feeling there&#39;s no hope for<br/>\nthe world, you&#39;ll get a definite &quot;boost&quot; from this story!<br/>\n<br/>\n<br/>\nLet&#39;s move now directly into my discussion with Jan Tober on the subject of<br/>\nthese wonderful, wild, provocative, and often exasperating &quot;old&quot; children.<br/>\nMartin: Let&#39;s begin with a fundamental definition; exactly what are the<br/>\nIndigo children?<br/>\n<br/>\nTober: The definition that we are sharing, that rings true for us, is: an<br/>\nIndigo child is one who displays a new and unusual set of psychological<br/>\nattributes, and shows a pattern of behavior generally undocumented before.<br/>\n<br/>\n<br/>\nMartin: Along this line, I want to talk to you about the misdiagnosis of<br/>\nAttention Deficit Disorder (ADD) and (ADHD), and the use of Ritalin to drug<br/>\nthese children. Have you encountered a lot of Indigos who have been drugged<br/>\nand, in your opinion, misdiagnosed?<br/>\n<br/>\nTober: Again, I work as an intuitive counselor. I do not work out in the<br/>\narea where a lot of my clients would put their children on Ritalin. They<br/>\nwould go to alternatives, innately. However, in some of our audiences, which<br/>\nhave a broader cross-section, we are experiencing where, maybe not our<br/>\naudience member would go that route, but they would say: &quot;My sister-in-law&#39;s<br/>\nchild, my niece, my nephew...&quot;, where they (audience members) are not the<br/>\nprimary child caretaker. But, they certainly know other Indigo primary<br/>\ncaretakers or teachers, etc.<br/>\n<br/>\nI want to quote the percentages we shared in the book, about the increase in<br/>\nthe production of Ritalin: &quot;Ritalin production has increased seven-fold in<br/>\nthe last eight years, and 90% of it is consumed in the U.S.&quot;<br/>\n<br/>\nThe trend over the past few years has been clear: the percentage of children<br/>\nwith an ADHD or ADD diagnosis, walking out of a doctor&#39;s office with a<br/>\nprescription, jumped from 55% in 1989 to 75% in 1996. And, if the truth be<br/>\nknown, it&#39;s higher than that.<br/>\n<br/>\nWhat&#39;s happening? What&#39;s happening is, we have a new paradigm of soul, of<br/>\nbeings, coming into the Earth who are, primarily, right-brained. We have<br/>\nthem being shoved into a left-brained society where, to be left-brained is<br/>\nto be honored; to be right-brained, i.e., the artist, the musician, dancer,<br/>\npainter, writer, creative thinker is not to be honored, in this country.<br/>\n<br/>\nSo, they&#39;re coming into a left-brained world. To get their kudos, to get<br/>\ntheir strokes, to be really honored and respected, they have to try to fit<br/>\ninto that old system. These souls, as Masters, KNOW the truth and know that<br/>\nwe are now moving into honoring the right-brain mode, and they are a<br/>\nsignificant part of that.<br/>\n<br/>\nSo, they&#39;re not going to fit in, even if they choose to. They&#39;re here on a<br/>\nmission lifetime-and that&#39;s a very important statement. They&#39;re here on a<br/>\nmission lifetime! They&#39;re NOT here to fit in. We are here to understand<br/>\nthem, to learn from them, and allow them to teach us a new way of being.<br/>\n<br/>\nBack to your question. Because they&#39;re new and different, where do doctors<br/>\ngo? Where do parents go? Where do teachers go? They&#39;ve got children who<br/>\nwould appear to be hyperactive, who have a low attention span, who can&#39;t<br/>\nstand in line-all of the symptoms that fit into something like the chicken<br/>\nor the egg.<br/>\n<br/>\nI mean, which came first: ADD or the child of ADD? It&#39;s fitting into a type<br/>\nof pattern. They don&#39;t know what to do with it.<br/>\n<br/>\nNow, if Ritalin healed the process, it would be different. I don&#39;t want to<br/>\nget into an AMA discussion, but there are so many incredible alternatives<br/>\nthat take, maybe, a little bit more work, but my goodness, isn&#39;t your child<br/>\nworth it?<br/>\n<br/>\nIf the drug, Ritalin heals, then fine. But, it doesn&#39;t. It&#39;s just a coping<br/>\nmechanism or a band aid. Inevitably, they will need to discontinue the drug,<br/>\nand deal with life experiences they were meant to have.<br/>\n<br/>\nI have a book on ADD and ADHD; it&#39;s The ADD And ADHD Diet, written by Rachel<br/>\nBell and Dr. Howard Peiper. I want to include this, although your audience<br/>\nis very savvy, but just for us all to stop, take a deep breath, and think.<br/>\n<br/>\n&quot;People with ADD/ADHD lack sufficient supplies of neuro-transmitters,<br/>\nespecially seratonin. Seratonin is manufactured in the brain in the presence<br/>\nof B6 and tryptophan. Tryptophan is an essential amino acid. If tryptophan<br/>\nand B6 are in short supply, the body cannot make seratonin.&quot; I&#39;m quoting<br/>\nfrom the book.<br/>\n<br/>\n&quot;Therefore, people with ADD/ADHD may require supplements of tryptophan<br/>\nand/or B6. Protein supplies amino acids to the body. If the body contains<br/>\nsufficient protein and tryptophan-rich foods, the supply of amino acids will<br/>\nnot usually be a problem. The calcium/magnesium ratio is a key factor, also.<br/>\nInsufficient magnesium can result in high insulin levels, which reduce<br/>\nseratonin. Therefore it is necessary to insure an adequate supply of<br/>\nmagnesium, in addition to B6 and amino acids.&quot; It goes on. This is one of<br/>\nseveral books we recommend. This book is very short, and sweet, and concise.<br/>\nFirst, we&#39;ve got the Indigo constitution. We&#39;ve got Indigo Masters coming in<br/>\non a mission, saying: &quot;We&#39;re going to help this planet shift into the Divine<br/>\nFeminine, one way or another. We&#39;re going to do it by coming in and being an<br/>\nexample of love. You&#39;re going to learn how to treat us, and as you learn how<br/>\nto treat us, you&#39;re going to learn how to treat each other, with love.&quot; I<br/>\nmean, that&#39;s the bottom line to all of this. When we learn how to love, be<br/>\nwith, parent, if you will, the Indigo child, we&#39;re learning how to operate<br/>\nat the highest level with each other. That&#39;s what they&#39;re teaching us.<br/>\n<br/>\nSo, we&#39;ve got ADD/ADHD, ok. We&#39;ve got a new paradigm coming in. They carry a<br/>\nlot of what has been labeled Attention Deficit Hyperactivity Disorder. It<br/>\ndoesn&#39;t mean it is. What we&#39;re saying to parents is this: please look at<br/>\nalternatives. We know it&#39;s challenging. That&#39;s why the book is out, so you<br/>\ncan pick the book up and look at the list of traits, and you can see that<br/>\nmaybe there&#39;s not something wrong with your child; that your child is part<br/>\nof this new paradigm.<br/>\n<br/>\nNow, how do we work with that? That&#39;s what the book is filled with-healthy<br/>\nalternatives, from diet to techniques. There&#39;s a technique called<br/>\nsleep-talk, where you work with the child in their sleep state. It&#39;s very<br/>\npowerful and it needs to be taught to parents. I&#39;m bringing some teachers<br/>\nwith me, as I put together Indigo workshops, around the country who will<br/>\nshed light on our alternative choices.<br/>\n<br/>\nThere are all kinds of choices that parents can look at. Does your child<br/>\nrespond to food allergies or environmental poisonings? We all have to get<br/>\nvery, very savvy about all of this, and these children are going to force us<br/>\ninto doing it-for ourselves, as well.<br/>\n<br/>\nMartin: Because I&#39;m aware of the time restraints we have here, let me ask<br/>\nyou: You have a fantastic list on your website of Montessori and Waldorf<br/>\nschools. And you talk about those as being excellent places for Indigos.<br/>\nWhat about those Indigos born into families that are economically<br/>\ndisadvantaged? What do you say to people who just can&#39;t afford that kind of<br/>\neducation?<br/>\n<br/>\nTober: There have been some wonderful results we&#39;ve been hearing about with<br/>\nhome schooling. There&#39;s a group in Houston, I believe there&#39;s about 40<br/>\nfamilies, maybe more, as of this interview, and they are successfully<br/>\nworking with home schooling. That might be an alternative. That, certainly,<br/>\nwould be an inexpensive alternative, and they&#39;re getting wonderful results,<br/>\nand the children are walking right into Ivy League colleges.<br/>\n<br/>\nI also know, within my heart of hearts, that there will be, I believe, other<br/>\nforms of schooling coming up that may be not as cost prohibitive to families<br/>\nwho don&#39;t have a comfortable income. And I know there is such a huge<br/>\ninterest in Indigos, and what we can do to help them, that there are a lot<br/>\nof educators now, who are also metaphysicians, who are joining forces and<br/>\nworking at putting this schooling together.<br/>\n<br/>\n<br/>\nMartin: You&#39;ve been around a lot. You&#39;ve been traveling a lot. What do you<br/>\nthink people need to know? What is the most useful information that you can<br/>\npass on to our readers about this subject?<br/>\n<br/>\nTober: There are two words that, if we could say nothing more to you, we<br/>\nwould say, in the parenting of the Indigo child. In relating to the Indigo<br/>\nchild, the two words are: choices and negotiate. If you can remember nothing<br/>\nelse, if you do not read our book, please just give them choices and<br/>\nnegotiate everything. I mean, certainly, they&#39;re not to run rampant over<br/>\nyou. But that is the parenting guide. If we can remember that they&#39;re here<br/>\nto teach us, that gives more of a balance to those words.<br/>\n<br/>\nI want to share with your readers what parents can do to make a difference.<br/>\nIn addition to giving them choices and negotiating with them, you can make a<br/>\nbig difference by guiding them, rather than giving them explicit directions.<br/>\nTreat them and interact with them as your best friend, because in truth,<br/>\nthey are. Treat them with respect. Honor their existence in your family.<br/>\nHelp them create their own disciplinary solutions. You&#39;ll be amazed as a<br/>\nparent what they will come up with. And give them choices about everything.<br/>\nNever belittle them, ever. This is just good parenting advice. If we wanted<br/>\nto be the perfect parent, we would say: &quot;This is the list I will follow.&quot;<br/>\nSo, they are very simply saying: &quot;Now is the time, and you get to practice<br/>\nbeing the perfect parent. Now is the time on the planet to do this.&quot;<br/>\n<br/>\nAlways explain why you give them the instructions you do; never say:<br/>\n&quot;Because I said so.&quot; Instead say: &quot;Because this will help me today. I&#39;m a<br/>\nbit tired today. I need some help from you&quot; knowing that honesty will always<br/>\nwin out with them because they&#39;re intuitive. They know what&#39;s going on,<br/>\nbecause you&#39;re thinking it.<br/>\n<br/>\nMake them your partners in raising them. This is extremely important. This<br/>\ngoes with choices and negotiation. Make them your partner. Let them know<br/>\nthey always have a vote. Be PRESENT with them. And, of course, as a friend,<br/>\nas a grown-up family member, we ask always to be present when we&#39;re in a<br/>\nsituation with people. I mean, that is &quot;be here now&quot;. That&#39;s being in the<br/>\nmoment, all of this metaphysical stuff. Metaphysicians innately know a lot<br/>\nof this. And explain everything to your children, if you think they don&#39;t<br/>\nunderstand something. Know that they DO understand at the soul level. And we<br/>\nknow we can talk to them before birth. Start early, how about before<br/>\nconception!<br/>\n<br/>\nIf serious problems develop, and you feel you want to test them for ADD or<br/>\nADHD, we do not say, &quot;Do not go to doctors.&quot; What we say in the book is:<br/>\n&quot;Look at some alternatives. For instance, diet, supplements, nutrition,<br/>\nhomeopathy, chiropractic, and reversed polarity.&quot; Look at what&#39;s out there<br/>\nholistically. We offer a large list, and access to alternative authors,<br/>\nalternative teachers who you can email, your questions and concerns.<br/>\n<br/>\nProvide safety in your support. Avoid negative criticism. Encourage them in<br/>\ntheir endeavors. This is all stuff we know. An Indigo is not a follower. Let<br/>\nthem decide what THEY are interested in, and what they want to do. Talk to<br/>\nthem, not at them. That, basically, is the information we have found from<br/>\ntherapists, from very conscientious parents, from Nancy&#39;s work, that seems<br/>\nto really help guide the Indigos.<br/>\n<br/>\nThey know who they are. They come in feeling and knowing. It does not serve<br/>\nus to try to mold them into a pattern that possibly we had to learn to break<br/>\nout of, the pattern of how our parents raised us.<br/>\n<br/>\nThere is a new way of being. There&#39;s a new way of parenting, and it&#39;s about<br/>\nmoving into love. The bottom line is love-being present and loving and<br/>\nunderstanding. In the months and years ahead, we&#39;re going to see new school<br/>\nsystems where parents and educators work together.<br/>\n<br/>\n<br/>\nCreate a sacred and harmonious home. This may be achieved by burning sage,<br/>\nburning alcohol and Epsom salts and certain types of incense. Honor your<br/>\nhome as a temple, so that your child can come home to a loving parent or<br/>\nparents in clear loving surroundings.<br/>\n<br/>\nEven if you&#39;re tired, explain this to them. Set aside some special time just<br/>\nfor them, when you can be fully present. Always make them feel safe and let<br/>\nthem come home to their best friend, you.<br/>\n<br/>\nMartin: At the end of the book you have some information on the message that<br/>\nthe Indigo&#39;s bring. Can you comment more about that?<br/>\n<br/>\nTober: Specifically, which part, Rick, were you talking about?<br/>\n<br/>\nMartin: The message that they bring, the message of love.<br/>\n<br/>\nTober: Oh, yes! The message IS of love; it is of honoring that piece of<br/>\nus-again, I mention the Divine Feminine, which comes in and honors love,<br/>\ncompassion, the intuitive process, all of the pieces that need to come<br/>\ntogether to make this Heaven on Earth-and they are here to show us, one way<br/>\nor another.<br/>\n<br/>\nMartin: You talk about them as being &quot;systems busters&quot;. What do you mean by<br/>\nthat?<br/>\n<br/>\nTober: We were told, many years ago, that the first things that would break<br/>\ndown would be the old, established institutions and systems. Do you remember<br/>\nthat?<br/>\n<br/>\nMartin: Yes.<br/>\n<br/>\nTober: We were told that, as we move into this New Age, this Golden Age-<br/>\nThe old systems don&#39;t fit into the new mold-so they&#39;re right out there as<br/>\nthose who will break, for instance, the educational system as it has been<br/>\nfor a hundred years or so. They will not put up with something simply<br/>\nbecause that&#39;s the way it has always been.<br/>\n<br/>\n<br/>\nIn my mind and in my heart, it&#39;s awesome. It&#39;s just so awesome to know that<br/>\nthey&#39;re here working with us! FINALLY!<br/>\n<br/>\n<br/>\nMartin: Let&#39;s talk about using the old tricks of guilt and shame as behavior<br/>\ntools with these kids.<br/>\n<br/>\nTober: They won&#39;t work! The Indigos know who they are. It will just<br/>\nfrustrate, devastate the parents. It will bring in a very agitated<br/>\nenergy-field around the parents and around the child, which will defeat any<br/>\ndiscussion, any real help. It just won&#39;t happen.<br/>\n<br/>\nThey know who they are. They&#39;re on a mission. They are aware of that. So,<br/>\nthis is a challenge, because we have a whole culture that has been raised on<br/>\n&quot;You just wait until your father gets home!&quot; I&#39;m sure you probably heard<br/>\nthat a few times. I certainly did, and that won&#39;t work now!<br/>\n<br/>\nI don&#39;t have children. I&#39;m around them a lot, but I can appreciate what<br/>\nparents must go through when they go back to the old modus operandi for<br/>\nparents, and find out that it doesn&#39;t do anything. The children will test<br/>\nthem to see how far they can get.<br/>\n<br/>\nHowever, these children are not brats. That is not in their consciousness.<br/>\nThey will test the parent, in this respect, to see what the ground-rules<br/>\nare. How far can I do this? What can I do? What, really, is important to my<br/>\nparents? What isn&#39;t important? And they&#39;re going to learn to see how they<br/>\ncan negotiate with the parents. So, if a parent comes back with a<br/>\nnegotiation point-of-view, then they&#39;re going to be on the same page.<br/>\n<br/>\nIt&#39;s quite amazing to see them in action. It&#39;s joyful when you experience<br/>\nthem with conscientious parents, who are coming from love, who certainly are<br/>\nfrom a mind/body/soul integration, through love.<br/>\n<br/>\nMartin: Have you had contact with many parents, who have Indigos, who are<br/>\njust totally beside themselves?<br/>\n<br/>\nTober: We&#39;ve had a lot of mail from parents who are so thrilled when they<br/>\nread the book, and they realize that their children maybe Indigos, When they<br/>\nstarted working with the principles we talk about, they started to find<br/>\nsuccess in their parenting.<br/>\n<br/>\nThey&#39;re all helping each other. They go on-line, interact, and offer each<br/>\nother solutions, ideas and alternatives.<br/>\n<br/>\nI feel that&#39;s going to be the way a lot of this is going to work. The<br/>\nparents are going to have to get really proactive, and put together support<br/>\ngroups, where they can help each other because we&#39;re making it up as we go<br/>\nalong.<br/>\n<br/>\nMartin: Do you find much awareness among family therapists?<br/>\n<br/>\nTober: If they honor their intuitive process, yes. And, of course, in this<br/>\narea, we do have a lot of people who are counselors and do honor their<br/>\nright-brain, intuitive side.<br/>\n<br/>\nMartin: How have you found your reception to be at the United Nations.<br/>\n<br/>\nTober: They invited us back three times; it was very surprising to us. We<br/>\nspoke in one of the smaller rooms, for the Society of Enlightenment and<br/>\nTransformation, (SEAT). It is one of the charter organizations created for<br/>\nmeditating members.<br/>\nWe were honored and we and always feel welcomed there.<br/>\n<br/>\nMartin: Ok, let&#39;s shift back to the Indigos. What would you like to leave<br/>\nour readers with, to think about, with regard to this infusion of new energy<br/>\nin the form of these children?<br/>\n<br/>\nTober: If you had a knock on your door, opened the door, and you saw a great<br/>\nMaster in your doorway, you would be joyful and thrilled! And you would<br/>\ninvite the Master in. Then, you would probably sit down, thank him or her<br/>\nfor coming, and you would say hopefully, &quot;What is it you want me to know?<br/>\nHow can I help you and how can I help the planet? What wisdom do you wish to<br/>\nshare with me?&quot;<br/>\n<br/>\nThis is the way to honor the Indigo!<br/>\n<br/>\nMartin: That&#39;s a good place to end. Thank you for a thoughtful and<br/>\n &quot;inspired&quot; interview. Our readers will truly enjoy this and I&#39;m sure some<br/>\nof them will be contacting you!<br/>\n<br/>\ncheck out www.indigochild.com</div>","specialLinks":[]}],"prevTopicId":12067,"nextTopicId":12080}}