{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"NumoAstro@aol.com","from":"NumoAstro@...","replyTo":"LIST","senderId":"7w3wjfJ7FT95GD_lhPn9eltWjAlSEmvxwEXed5jk9wypnqEJsMYQQi3HlD2j41jeWqTrBYcOrWM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Punishment","postDate":"967929183","msgId":12457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1LjljMTNiYWIuMjZlMmM3NWZAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":12456,"nextInTime":12458,"topicId":12457,"numMessagesInTopic":0,"msgSnippet":"Maybe some people don t want to hear this stuff because they don t want to take a look at the way they are dealing with their kids or are uncomfortable with","messageBody":"<div id=\"ygrps-yiv-1770916367\">Maybe some people don&#39;t want to hear this &quot;stuff&quot; because they don&#39;t want to <br/>\ntake a look at the way they are dealing with their kids or are uncomfortable <br/>\nwith how they are treating their children and certainly don&#39;t want to have to <br/>\naddress that area of their lives!!!  (LOL)... I find that when I&#39;m resistent <br/>\nto learning about something it&#39;s usually because I have some emotions tied up <br/>\nwith a particular subject and I&#39;m scared people are going to disagree with my <br/>\nway of doing things.<br/>\n<br/>\nI love what was written with the Aware Parents and also the 20 things to deal <br/>\nwith kids (I know this is not what they are called, but I&#39;m not on the e-mail <br/>\nthat was written right now and am too lazy to look back for the title)... I <br/>\nread this to my hubby in the car while out driving somewhere... Zak was <br/>\nlistening intently (or so I thought) and then says &quot;mummy can I have the <br/>\npages you have there in your hand with the numbers on it? and why doesn&#39;t it <br/>\ngo up to 100?&quot;  100 is his favorite number right now... I gave him the pages <br/>\nto look at and the numbers and decided to read the rest to hubbie later...<br/>\n<br/>\nI&#39;m not comfortable with hitting my children... I have only seen it bring <br/>\nabout fear in a child and not love, understanding or worship of the person <br/>\ndoing it.  I don&#39;t see that it teaches them anything except how to be sneaky <br/>\nso they don&#39;t get caught or to be petrified of this bigger person who can <br/>\nphysically harm them in a fit of rage.  Hitting, spanking or any kind of <br/>\nviolence to a child, is raging on the parents&#39; part.  I&#39;ve never seen a <br/>\nparent hit a child when the parent was in control of their own emotions.  It <br/>\nalways seems to be out of a need to control the situation or the child.  If <br/>\npeople are comfortable in the knowledge that is the way other people perceive <br/>\nwhat you are doing then go ahead and spank your child, while the rest of us <br/>\nshake our heads and feel so sad for that little person that has to take the <br/>\npunishment of the parents feelings.<br/>\n<br/>\nI&#39;m not particularly bothered who likes this and who doesn&#39;t.  I&#39;m here for <br/>\nmy benefit and what I can learn, so there&#39;s absolutely no point in telling me <br/>\nto keep my opinion to myself.  That would be like telling me to send my child <br/>\nto school....<br/>\n<br/>\nDawn F<br/>\nTucson, AZ</div>","specialLinks":[]}],"prevTopicId":12456,"nextTopicId":12458}}