{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":240358028,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;foehn_jye@...&gt;","profile":"foehn_jye","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: A Two Year Thank You","postDate":"1265300934","msgId":50454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrZXNrNitvMzN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNkE3QzYzLjkwMzA3MDhAbWFjLmNvbT4="},"prevInTopic":50450,"nextInTopic":0,"prevInTime":50453,"nextInTime":50455,"topicId":50440,"numMessagesInTopic":0,"msgSnippet":"... That is a great analogy, Pam. It mirrors what we have been doing in our home, but I didn t have a nice visual to express it. You nailed it!","messageBody":"<div id=\"ygrps-yiv-628840654\"><blockquote><span title=\"ireply\">&gt; I think maybe you all <br/>\n&gt; with young children are sort of preparing the soil, getting the &gt;garden ready - digging up weeds and breaking up the rocks and planting &gt;seeds, but you won&#39;t really have a full gardening experience until &gt;later.<br/>\n<br/>\n </span></blockquote>That is a great analogy, Pam. It mirrors what we have been doing in our home, but I didn&#39;t have a nice visual to express it. You nailed it!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Two Year Thank You","postDate":"1265294418","msgId":50450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJEOTU1NDNGLTk1RTMtNDkzMC1CQUZBLTg3RjhDMDQ0MjIyNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhrZHFwMCt1aGxmQGVHcm91cHMuY29tPg==","referencesHeader":"PGhrZHFwMCt1aGxmQGVHcm91cHMuY29tPg=="},"prevInTopic":50441,"nextInTopic":50454,"prevInTime":50449,"nextInTime":50451,"topicId":50440,"numMessagesInTopic":0,"msgSnippet":"-=- our relationship keeps getting better, AND I have started to really notice some of his natural strengths that really coincide with unschooling - he is a","messageBody":"<div id=\"ygrps-yiv-1970787874\">-=- our relationship keeps getting better, AND I have started to  <br/>\nreally notice some of his natural strengths that really coincide with  <br/>\nunschooling - he is a natural, he just doesn&#39;t know it yet! -=-<br/>\n<br/>\nThis is wonderful.  It might be easier and clearer for moms to feel  <br/>\nlike good moms than for dads to know for sure they&#39;re being good  <br/>\ndads.  There are so many conflicting expectations of men, and though  <br/>\nthe women&#39;s movement was good for women in many ways, it&#39;s been hard  <br/>\nfor men to know with confidence what&#39;s accepted and acceptable.  The  <br/>\npressures on women are pretty well known to people on this list, and  <br/>\nin most discussions involving a lot of women and &quot;women&#39;s issues.&quot;   <br/>\nThere are women who haven&#39;t thought much at all about the confusion  <br/>\nthat has fallen over men in the past several decades.  Do they open  <br/>\ndoors?  Do they pay for all dates?   They risk offering insult by  <br/>\nchoosing gifts that are too girly, or too expensive too early. They  <br/>\nteeter on seeming too callous, or too emotional, or unmanly by saying  <br/>\n&quot;Why don&#39;t you go to work and let me stay home with the kids?&quot;   The  <br/>\nstrengths and choices women gained came out of the simple expectations  <br/>\ntraditional of men.<br/>\n<br/>\nSo those of you with men or boys in your families, please try to give  <br/>\ntheir feelings some extra consideration.  I&#39;m not recommending you  <br/>\ntalk about it to them; they might have no idea what their issues are.   <br/>\nJust be patient and generous and sweet.<br/>\n<br/>\nSometimes men&#39;s natural strengths are things they&#39;ve been told they  <br/>\nshouldn&#39;t be wanting or doing or liking or pursuing.  My husband can  <br/>\nsing all kinds of ways.  His mother didn&#39;t care one bit.  I met him in  <br/>\nan informal madrigal group, and LOVED singing with him.  We&#39;ve found  <br/>\nlots of opportunities to sing together, sometimes just ourselves in  <br/>\nthe car for fun.  We learned a difficult medieval duet in the car on a  <br/>\nlong drive, with just a recorder and the sheet music and continued  <br/>\nwork.  I really appreciate that about him, but his mother would snort  <br/>\nabout us learning &quot;The Holy Martyr Stephen&quot; for fun.  I had  <br/>\nphotocopied it from Musica Britannica, at the fine arts library at the  <br/>\nuniversity.  Keith always liked that about me, my ability to find  <br/>\nobscure things. :-)<br/>\n<br/>\nThe value to the family of the mother making extra allowances for the  <br/>\nodd realities of maleness in these days is immeasurable.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] A Two Year Thank You","postDate":"1265269859","msgId":50441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNkE3QzYzLjkwMzA3MDhAbWFjLmNvbT4=","inReplyToHeader":"PGhrZHFwMCt1aGxmQGVHcm91cHMuY29tPg==","referencesHeader":"PGhrZHFwMCt1aGxmQGVHcm91cHMuY29tPg=="},"prevInTopic":50440,"nextInTopic":50450,"prevInTime":50440,"nextInTime":50442,"topicId":50440,"numMessagesInTopic":0,"msgSnippet":"... I ve been thinking, too, about what Sandra said about deschooling not really fully happening until the kids are older. I think maybe you all with young","messageBody":"<div id=\"ygrps-yiv-2087448684\">On 2/3/2010 10:51 PM, DaBreeze21 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So although I know I am probably far from &quot;done&quot; with deschooling and I also know that my understanding of unschooling will only grow<br/>\n&gt;   deeper as my family grows and experiences it more fully, I am glad to have a jump start, and I am glad to have this list as a sounding board helping me be a better mom every day.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>I&#39;ve been thinking, too, about what Sandra said about deschooling not <br/>\nreally fully happening until the kids are older. I think maybe you all <br/>\nwith young children are sort of preparing the soil, getting the garden <br/>\nready - digging up weeds and breaking up the rocks and planting seeds, <br/>\nbut you won&#39;t really have a full gardening experience until later.<br/>\n<br/>\nThanks for the great post - I remember, too, the thrill of my first <br/>\nencounter with unschooling. It is a fine line between terror and <br/>\nexcitement, sometimes! &lt;G&gt;<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"A Two Year Thank You","postDate":"1265266272","msgId":50440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrZHFwMCt1aGxmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":50441,"prevInTime":50439,"nextInTime":50441,"topicId":50440,"numMessagesInTopic":0,"msgSnippet":"So I am coming up on two years of being a member of this group and reading regularly. It has been life changing! I have come a long way and so has my family.","messageBody":"<div id=\"ygrps-yiv-1897584337\">So I am coming up on two years of being a member of this group and reading regularly. It has been life changing! I have come a long way and so has my family. My husband is now open to the idea of homeschooling, even though he is still unsure about unschooling. I continue to email him little tidbits here and there, our relationship keeps getting better, AND I have started to really notice some of his natural strengths that really coincide with unschooling - he is a natural, he just doesn&#39;t know it yet! Sandra Dodd is a household name; if that isn&#39;t progress I don&#39;t know what is! &lt;g&gt;<br/>\n<br/>\nI came across this quote today in my Midwifery Today E-news - <br/>\n&quot;The most useful piece of learning for the uses of life is to unlearn what is untrue.&quot; ~ Antisthenes<br/>\n<br/>\nI thought is sounded very &quot;unschooly&quot; and very relevant to a lot of what I read here and the &quot;internal work&quot; I have been doing of unlearning what many people think is true in our society. Also I had no idea who Antisthenes was, so I had to google him to find out that he was a greek philosopher, and the action of doing that seemed very appropriate :-)<br/>\n<br/>\nWhen I started reading almost 2 years ago it was like my universe was turned upside down (in a good way though!)I was so excited and felt like I was on a high. I&#39;m pretty sure that if I searched my name on here I would be kind of embarrassed to read my posts. Thank you all for being so patient and for hashing the same issues out repeatedly, from different angles and with such passion. I am also pretty sure that many of my posts would be about similar issues (for me TV and sleep have been tough ones... oh and family!)Old habits die hard!<br/>\n<br/>\nAnyways, I have been in a very intense period of introspection and growth the past month. It hasn&#39;t been apparent from the outside at all, but my mind has been constantly moving. I feel like I have made some major breakthroughs and this list, Sandra, and the people who write here regularly were a HUGE part of that. I can&#39;t tell you how many of the posts here resonate with me. Sometimes the words here spur new thoughts and sometimes I will have been thinking about something and someone here reinforces that, or puts it in a different way, or makes something click even more. <br/>\n<br/>\nI have been thinking about deschooling a lot lately and Sandra&#39;s idea that for parents of very small children deschooling can&#39;t truly begin (or maybe finish is a better word?) until the kids are actually school age. I can see that this may be true because there are going to be many more, different challenges for me and my family as my children grow (guess this is true for everyone!) But I am so glad that I discovered Unschooling when my oldest child was only about 18 months old -- I have been reading here daily for almost 2 years now and I never tire of it. I actually felt a little &quot;addicted&quot; :-) But when I feel I have been reading too much I know what the people, especially Sandra would tell me - go be with your kids. So instead of feeling addicted, I make a choice - keep reading now, be with my kids now, read later, sit with my kids and read... etc. So although I know I am probably far from &quot;done&quot; with deschooling and I also know that my understanding of unschooling will only grow deeper as my family grows and experiences it more fully, I am glad to have a jump start, and I am glad to have this list as a sounding board helping me be a better mom every day. <br/>\n<br/>\nI also know that I am not done &quot;deschooling&quot; because I have come up with a way to test myself to see if I am &quot;getting it&quot;.&lt;g&gt; When I read posts, especially new people&#39;s, I can often imagine what the responses will be, or what the experienced unschoolers might say... then of course I still read them all! I have to say, the advice to read, read, and read some more without posting is the best advice for &quot;newbies&quot; but I also understand the desire to jump right in and get &quot;individualized&quot; answers to questions because I&#39;ve been there. <br/>\n<br/>\nWell, this is basically a really, REALLY long thank you to all of you that contribute so much to this list - Sandra of course for starting it and keeping it going, Pam, Joyce, Jenny, Robyn, Joanna, Alex, and many, many more... I am going to post some of my more personal breakthroughs on my blog.<br/>\n<br/>\nSusan<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crunchyconmom.xanga.com/\">http://crunchyconmom.xanga.com/</a></div>","specialLinks":[]}],"prevTopicId":50436,"nextTopicId":50342}}