{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Stealing","postDate":"1119308699","msgId":106851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlLjQ3YzI3YTk2LjJmZThhNTliQGFvbC5jb20+"},"prevInTopic":106847,"nextInTopic":0,"prevInTime":106850,"nextInTime":106852,"topicId":106717,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/20/2005 3:49:05 PM Mountain Daylight Time, tjulrich@chartermi.net writes: 1. I no  longer have to be making moral judgments about kids","messageBody":"<div id=\"ygrps-yiv-1363596443\">In a message dated 6/20/2005 3:49:05 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tjulrich@...\">tjulrich@...</a> writes:<br/>\n<br/>\n1. I no  longer have to be making &quot;moral&quot; <br/>\njudgments about kids&#39; behavior--there are  more constructive ways to <br/>\ninterpret things.  And 2. I can treat kids  like human beings, not <br/>\ninferior creatures to be managed and  &quot;raised.&quot;<br/>\n<br/>\n<br/>\n<br/>\nI agree with #2, but I think morals are real and legitimate.  <br/>\n <br/>\nKirby was little (seven or eight?), when he came in one day holding a $20  <br/>\nbill and looking at it like he&#39;d never seen one.  He said &quot;Look what I  found in <br/>\nthe road,&quot; but he said it without looking away from it, and without  sounding <br/>\nconvinced, like he was in a fog about where it had come from.<br/>\n <br/>\nI told him to hang onto it, and if nobody claimed it he could have  it.  <br/>\n <br/>\nHe had been at the neighbor&#39;s house, and I figured that the kid there had  <br/>\ngiven it to him, because that kid was always trouble of one sort or another, but <br/>\n I also considered that Kirby had picked it up and not figured out how or <br/>\nwhen to  set it back down again, which is what happened.  <br/>\n <br/>\nThe neighbor mom called and said basically, &quot;Hi, Kirby was just here and a  <br/>\n$20 bill I had on the shelf is missing,&quot; and I said, &quot;Yeah, he has it, we&#39;ll be <br/>\n right over.&quot;<br/>\n <br/>\nSo I walked him over without shaming him and just said sometimes when you  <br/>\npick something up it&#39;s kind of embarrassing to figure out how to put it back  <br/>\nwhere it&#39;s supposed to be but that maybe he could&#39;ve said &quot;Here, I was just  <br/>\nlooking at this,&quot; and give it back as he was leaving.  <br/>\n <br/>\nHe was clearly not trying to be sneaky.  He had it in his hand and  showed it <br/>\nto me the moment he walked in.  He could&#39;ve hidden it, but he  didn&#39;t.<br/>\n <br/>\nA year and some later I got a call from the karate dojo saying some money  <br/>\nwas missing from the men&#39;s dressing room, and Kirby had been in there but hadn&#39;t <br/>\n been the only one.  He wasn&#39;t accusing Kirby, but just wanted me to keep an  <br/>\neye out, and they would follow other leads and keep looking.   I told  him <br/>\nwhen he called about the other incident.  <br/>\n <br/>\nI think some moms would&#39;ve marched in and searched the kid and made a  <br/>\nruckus.  I didn&#39;t.  I thought... what will Kirby do if he has some  cash?  He&#39;ll <br/>\nwant to go to the card shop.  The rest of the day passed  and he didn&#39;t say &quot;Can <br/>\nI got to Magic Moments?&quot;  The next day passed  without a request for me to <br/>\ntake him anywhere.  I don&#39;t remember now  whether I called the dojo or waited <br/>\nuntil I went in, but they had found the  money still in the dressing room, like <br/>\nthe guy had stuck it in his shoe or  something like that, and it was still <br/>\nsitting there.    I didn&#39;t  tell Kirby about it until it was all settled out, I <br/>\nthink.  (It&#39;s been  years now.)<br/>\n <br/>\nOur kids have always been very scrupulous about bringing us the change if  we <br/>\nsend the out with money.  They&#39;ll bring change and receipts usually,  which I <br/>\nwouldn&#39;t care about myself.  Because they&#39;re so honest, I don&#39;t  mind <br/>\nover-supplying them.  Last week Kirby went out to eat and only had $5  or so.  I gave <br/>\nhim a $20 and said take it in case, and if he didn&#39;t need it  bring it back.  <br/>\nHe brought it back.  <br/>\n <br/>\nWhen I was his age if I&#39;d had $20 of my parents money I would&#39;ve found  <br/>\nsomething to spend it on, but I think that&#39;s because I so rarely had any money  and <br/>\nI resented the amount my mom spent on cigarettes and beer, jukeboxes and  <br/>\nbuying drinks for other drunks.   Maybe part of our kids&#39; advantage is  they <br/>\ndon&#39;t see us spending money frivolously and then telling them we don&#39;t have  any <br/>\nto give them.  My dad didn&#39;t do it, but my mom sure did.  (They  divorced when <br/>\nI was Kirby&#39;s age.)<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142467562,"authorName":"Tina Ulrich","from":"&quot;Tina Ulrich&quot; &lt;tjulrich@...&gt;","profile":"tinajoyulrich","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Stealing","postDate":"1119274549","msgId":106847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5NmdubCtxaThvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQ5MnBlMStwbHZqQGVHcm91cHMuY29tPg=="},"prevInTopic":106746,"nextInTopic":106851,"prevInTime":106846,"nextInTime":106848,"topicId":106717,"numMessagesInTopic":0,"msgSnippet":"... that ... one ... item, ... can ... Yes, thanks, Amy.  This is very insightful.  What I m seeing now is that part of the problem is the anxiety of the","messageBody":"<div id=\"ygrps-yiv-1669430607\"><blockquote><span title=\"ireply\">&gt; So I think when he comes over again, you can just share with him<br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; if there&#39;s something he really wants, you will help him try to get <br/>\n </span></blockquote>one<br/>\n<blockquote><span title=\"ireply\"> &gt; for himself.  You could write down the exact name of the toy or<br/>\n </span></blockquote>item,<br/>\n<blockquote><span title=\"ireply\"> &gt; and if he needs to go to a special store or website to get it. You <br/>\n </span></blockquote>can<br/>\n<blockquote><span title=\"ireply\"> &gt; offer to bring it up with his dad.  That will help his brain learn<br/>\n&gt; that there are other ways to manage situations (collecting<br/>\n&gt; information, asking) and to get what he wants.<br/>\n<br/>\n </span></blockquote>Yes, thanks, Amy.  This is very insightful.  What I&#39;m seeing now is <br/>\nthat part of the problem is the anxiety of the adults involved.  We <br/>\nare scared and worried that Cooper is on his way to a life of <br/>\ncrime.  :-)  Seeing this as a developmental task gone wrong really <br/>\nchanges the way I feel about it and will undoubtedly change the way I <br/>\nrespond to Cooper.  I&#39;m sure having a Lego catalog handy and being <br/>\nable to write down the things that he really likes will appeal to him.<br/>\n<br/>\nThis illustrates for me two reasons why this unschooling way of <br/>\nthinking is so good for me.  1. I no longer have to be making &quot;moral&quot; <br/>\njudgments about kids&#39; behavior--there are more constructive ways to <br/>\ninterpret things.  And 2. I can treat kids like human beings, not <br/>\ninferior creatures to be managed and &quot;raised.&quot;</div>","specialLinks":[]},{"userId":201436708,"authorName":"arcarpenter2003","from":"&quot;arcarpenter2003&quot; &lt;arcarpenter@...&gt;","profile":"arcarpenter2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Stealing","postDate":"1119152385","msgId":106746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5MnBlMStwbHZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQ5MWFjYStycjJjQGVHcm91cHMuY29tPg=="},"prevInTopic":106727,"nextInTopic":106847,"prevInTime":106745,"nextInTime":106747,"topicId":106717,"numMessagesInTopic":0,"msgSnippet":"...  wrote: == ... I have a (possibly half-baked) personal theory that there s a developmental reason that kids at about age 7 might try lying","messageBody":"<div id=\"ygrps-yiv-556325643\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Tina Ulrich&quot;<br/>\n&lt;tjulrich@c...&gt; wrote:<br/>\n== <br/>\n<blockquote><span title=\"ireply\"> &gt; What would make a child steal?  Cooper has lots of toys and parents <br/>\n&gt; who love him and provide for him.  It just seems there&#39;s something <br/>\n&gt; else going on there that I&#39;d like to understand.==<br/>\n<br/>\n </span></blockquote>I have a (possibly half-baked) personal theory that there&#39;s a<br/>\ndevelopmental reason that kids at about age 7 might try lying or<br/>\nstealing.  I know quite a few kids who either start lying for a while<br/>\nor try stealing something right around that age.  I did both myself<br/>\nright around that age.<br/>\n<br/>\nThere&#39;s something about age 7 -- a child can really start to see the<br/>\nbig world around him, and is trying to make sense of his place in it.<br/>\n He gets some ideas about managing his situation a little more --<br/>\ntaking some more control.  <br/>\n<br/>\nI know of one boy who told his father he&#39;d already brought his books<br/>\nin from the car, when he hadn&#39;t.  Now if I was his parent, I&#39;d<br/>\nprobably just go get the books myself.  But I think the boy lied<br/>\nbecause he was just starting to figure out that he could manage the<br/>\nsituation so that he wouldn&#39;t have to get up from what he was doing<br/>\nand get the books.  Of course, he hadn&#39;t foreseen the point at which<br/>\nhis father looked in the car and saw that he was lying.  The new<br/>\nconnections only go so far at this point.<br/>\n<br/>\nIn your case, I think Cooper saw the things he wanted and thought<br/>\nabout trying to get them.  He doesn&#39;t see the big world enough yet to<br/>\nthink about asking his parents to buy them -- he wants these specific<br/>\nthings, the ones he sees right now.  It occurs to him, because his<br/>\nbrain is offering up more ideas than it used to, that he might just<br/>\ntry taking what he wants.  And lying about it.  So he tries it.  He<br/>\ndoesn&#39;t feel great about it (that&#39;s part of the learning, too), and it<br/>\ngoes against what he&#39;s been told, which he kind of vaguely remembers.<br/>\n But he&#39;s just trying something out, and seeing if it&#39;s a good way to<br/>\nmanage the situation.<br/>\n<br/>\nSo I think when he comes over again, you can just share with him that<br/>\nif there&#39;s something he really wants, you will help him try to get one<br/>\nfor himself.  You could write down the exact name of the toy or item,<br/>\nand if he needs to go to a special store or website to get it. You can<br/>\noffer to bring it up with his dad.  That will help his brain learn<br/>\nthat there are other ways to manage situations (collecting<br/>\ninformation, asking) and to get what he wants.<br/>\n<br/>\nI hope that helps.<br/>\n<br/>\nPeace,<br/>\nAmy</div>","specialLinks":[]},{"userId":152335345,"authorName":"Diana Tashjian","from":"&quot;Diana Tashjian&quot; &lt;dtashjian@...&gt;","profile":"d_tashjian","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Stealing","postDate":"1119110723","msgId":106727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTEwMWM1NzQxZiQ4OGQ0MjVhMCQ2NTAzYThjMEBqb2huPg==","referencesHeader":"PDIwMDUwNjE4MTUwNTM1Ljg4MjA3LnFtYWlsQHdlYjU0MzA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":106721,"nextInTopic":106746,"prevInTime":106726,"nextInTime":106728,"topicId":106717,"numMessagesInTopic":0,"msgSnippet":"I distinctly remember stealing an Indian doll that someone had brought to share at school. And I brazenly lied about how I had gotten it to my mom. I was 7","messageBody":"<div id=\"ygrps-yiv-1408506345\">I distinctly remember stealing an Indian doll that someone had brought <br/>\nto share at school. And I brazenly lied about how I had gotten it to <br/>\nmy mom. I was 7 also. It seems that I&#39;ve heard many stories like this <br/>\nso I think this is not that unusual for this age range. Although, I&#39;ve <br/>\nnever stolen anything else in my life. I don&#39;t really know the best <br/>\nway to handle it...<br/>\n<br/>\nDiana Tashjian</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Stealing","postDate":"1119107580","msgId":106719,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGQ5MWFjYStycjJjQGVHcm91cHMuY29tPg=="},"prevInTopic":106717,"nextInTopic":106721,"prevInTime":106718,"nextInTime":106720,"topicId":106717,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2131986804\">&lt;&lt;&lt;&lt;&lt;&lt; What would make a child steal?  Cooper has lots of toys and parents <br/>\nwho love him and provide for him.  It just seems there&#39;s something <br/>\nelse going on there that I&#39;d like to understand. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nA few weeks ago our neighbor Renee (7.5) was over here, and the last game<br/>\nthe two girls were playing was &quot;dress up&quot; in the bathroom. A few minutes<br/>\nafter she left I noticed that my diamond ring, that I had left in the<br/>\nbathroom when I washed my hands, was missing, although my gold wedding ring<br/>\nwas still in the tray.<br/>\n<br/>\nI asked Jayn if Renee had tried it on because I couldn&#39;t see it, and she<br/>\nsaid yes, so I called R&#39;s house. I said to her Mom that I thought Renee may<br/>\nhave tried on my ring and &quot;forgotten&quot; that she had it on when she left<br/>\nshortly after. I could hear part of the conversation where Mom asked, Renee<br/>\ndenied and then Mom found the ring - in Renee&#39;s jewelry box. The upshot of<br/>\nit was that Mom assured me that Renee would bring it back at once, although<br/>\nI offered to come up and collect it.<br/>\n<br/>\nBoy was she ever subdued when she came back down the hall in about five<br/>\nminutes - probably the time it took for whatever punishment and<br/>\nunpleasantness to be undertaken. She had a pretty implausible story about<br/>\nbelieving it was her aunt&#39;s ring she had on (my ring is pretty unusual in<br/>\nbeing a heart shaped diamond). I *hope* I handled it well by being kind to<br/>\nher, not acting all accusatory, and thanking her for bringing it back as if<br/>\nshe had done so by choice. <br/>\n<br/>\nI believe that Renee stole my ring because she is jealous of the freedoms,<br/>\nand huge amount of freely shared stuff, that Jayn has. I think maybe she was<br/>\ntrying a bit of magical thinking of bringing something visibly precious of<br/>\nours back with her to put with her personal treasures, or somehow trying to<br/>\ntest the limit of what could be shared. Or maybe she just liked the sparkle<br/>\n- but I doubt it is that picayune. Maybe she was trying to get Jayn into<br/>\ntrouble - for the same reasons of jealousy, and because that is the primary<br/>\ndynamic between her and her little brother.<br/>\n<br/>\nAll it means to me is that I have to step up the vigilance when she visits -<br/>\nand not leave my rings about, however mildly inconvenient that may be. <br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.323 / Virus Database: 267.7.5/18 - Release Date: 6/15/2005</div>","specialLinks":[]},{"userId":143938653,"authorName":"K Krejci","from":"K Krejci &lt;kraekrej@...&gt;","profile":"kraekrej","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Stealing","postDate":"1119107135","msgId":106721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNjE4MTUwNTM1Ljg4MjA3LnFtYWlsQHdlYjU0MzA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGQ5MWFjYStycjJjQGVHcm91cHMuY29tPg=="},"prevInTopic":106719,"nextInTopic":106727,"prevInTime":106720,"nextInTime":106722,"topicId":106717,"numMessagesInTopic":0,"msgSnippet":"What a sad situation all the way around.  I know there are powerful desires at work that seem to overwhelm us.  The apology scene you described makes me ache. ","messageBody":"<div id=\"ygrps-yiv-1920585733\">What a sad situation all the way around.  I know there<br/>\nare powerful desires at work that seem to overwhelm<br/>\nus.  The apology scene you described makes me ache. <br/>\nPoor little guy.<br/>\n<br/>\nI suppose the only alternative might have been for you<br/>\nto &#39;catch&#39; him at the outset, clear up the matter<br/>\ngently and let it go.  But you didn&#39;t really know and<br/>\nI understand that you certainly wouldn&#39;t want to<br/>\naccuse (for lack of a better word) the child without<br/>\nbeing 100% certain.  Bringing in Cooper&#39;s parents<br/>\nprobably made it rougher on everyone involved.<br/>\n<br/>\nMaybe David is the one who can take the lead on this. <br/>\nMaybe Cooper can tell him why that item was so<br/>\nprecious, so dear that he&#39;d risk so much to have it. <br/>\nAnd maybe they can work out a way to let David feel<br/>\nhis treasures are safe and Cooper can feel that he&#39;s<br/>\nable to enjoy them without having them.<br/>\n<br/>\nOnce they have resolved the issue, it seems like all<br/>\nthe grownups could take a breath and be satisfied that<br/>\nthe two parties involved worked it out.  I hope<br/>\neveryone can return to a more enjoyable relationship<br/>\nsoon.  It sounds like these are all very important<br/>\npeople in your family&#39;s life.<br/>\n<br/>\nKathy<br/>\n<br/>\nIt&#39;s Good 2 B Dog Nutz!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.good2bdognutz.com\">http://www.good2bdognutz.com</a><br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":142467562,"authorName":"Tina Ulrich","from":"&quot;Tina Ulrich&quot; &lt;tjulrich@...&gt;","profile":"tinajoyulrich","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Stealing","postDate":"1119104202","msgId":106717,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5MWFjYStycjJjQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":106719,"prevInTime":106716,"nextInTime":106718,"topicId":106717,"numMessagesInTopic":0,"msgSnippet":"Something happened last night that I d like to hear some of your ideas on.  My husband and son, David (11), were going to see Madagascar with a friend and","messageBody":"<div id=\"ygrps-yiv-635546282\">Something happened last night that I&#39;d like to hear some of your <br/>\nideas on.  My husband and son, David (11), were going to <br/>\nsee &quot;Madagascar&quot; with a friend and his son, Cooper (7).  Everyone <br/>\nwas waiting for Cooper in the car.  I came into the house and saw <br/>\nCooper standing by David&#39;s massive pile of Legos with a very guilty <br/>\nlook on his face and with his hands behind his back.  I told him <br/>\nthat they were waiting for him and he sort of slid his hands into <br/>\nhis pockets and slowly inched past me.  I was pretty sure he had <br/>\ntaken something but decided to just let it play out.<br/>\n<br/>\nWhen they got back from the movie I asked David if Cooper had <br/>\nanything &quot;new&quot; in his pockets at the movie.  David said no but both <br/>\nhe and my husband noticed that he was acting very suspicious.  David <br/>\nthen looked through his Legos and immediately noticed that an <br/>\narrangement of Star Troopers was obviously missing something.<br/>\n<br/>\nCooper&#39;s dad is a dear friend so my husband called him and asked if <br/>\nmaybe Cooper had taken something.  Cooper denied it so we said we&#39;d <br/>\nlook again.  In the meantime, his dad had found the Star Trooper and <br/>\nthey came over to bring it back.  <br/>\n<br/>\nWhen they got here, Cooper had been well-rehearsed.  He was supposed <br/>\nto tell David he was sorry, that he wouldn&#39;t do it again, and <br/>\nsomething else (I forget) then he was supposed to apologize to both <br/>\nmy husband and me for doing something wrong in our house.  It was <br/>\nall very painful.  David tried to be gracious and forgiving.  I told <br/>\nCooper that he&#39;s still welcome here anytime.<br/>\n<br/>\nAfter they left, David said, &quot;That was so sad.  Everybody was <br/>\ntelling him what to say.  It just made me sad.&quot;  I thought too that <br/>\nthe scripted apology was just humiliating, yet I also feel for <br/>\nCooper&#39;s dad.  What should he have done?  These are people that we <br/>\ncare about and want to be at ease with.  Still, I don&#39;t want David <br/>\nto feel that his (precious!) posessions are in jeopardy when <br/>\nCooper&#39;s around.<br/>\n<br/>\nWhat would make a child steal?  Cooper has lots of toys and parents <br/>\nwho love him and provide for him.  It just seems there&#39;s something <br/>\nelse going on there that I&#39;d like to understand.<br/>\n<br/>\nOK.  Thanks for your insights!<br/>\n<br/>\nTina</div>","specialLinks":[]}],"prevTopicId":106807,"nextTopicId":106869}}