{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"was Timeline poster now movies and music","postDate":"1278512190","msgId":55729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2OUYwOTUxQkVERDQ0RkFCRkQ5RjM5RDJCOEIyNzIwQEVkUEM+","inReplyToHeader":"PDRDMzQwNTM4LjEwNDAwMDJAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGkxMHJhcStpaG0wQGVHcm91cHMuY29tPiA8NUY2MERBQTQ3NUE2NDBENUIzRTQ5MTNBRkE3NUE5QUZARWRQQz4gPDRDMzQwNTM4LjEwNDAwMDJAZWFydGhsaW5rLm5ldD4="},"prevInTopic":55720,"nextInTopic":0,"prevInTime":55728,"nextInTime":55730,"topicId":55697,"numMessagesInTopic":0,"msgSnippet":"Zachariah (16) also loves the movie score - he has it on his MP3 player as well as CD - we were listening yesterday on our way to horse back riding. Zac really","messageBody":"<div id=\"ygrps-yiv-1847466512\">Zachariah (16) also loves the movie score - he has it on his MP3 player as well as CD - we were listening yesterday on our way to horse back riding.<br/>\n<br/>\nZac really loves the movie and music!<br/>\n<br/>\nHe really enjoys a lot of music from various movies - after a great movie he almost always asks for a CD of the music.  He wanted the music from the new movie &quot;Prince of Persia, The Sands of Time&quot; but we have not found it yet for some reason.  He wanted the &quot;Avatar&quot; music too.  He has done this since he was little - likes the movie and the music.  He still has the CD from Treasure Planet.  He has music from Anime movies as well - Princess Mononoke.  And of course there is Star Wars music!  He also will hear a song that he likes in a show and look it up to buy just that one song - or to listen to it over and over on the computer until he is satisfied / full of that song.  &quot;Ghost Riders in the Sky&quot; from the movie turned him on to Johnny Cash music.  I&#39;m pretty sure that watching old WWII shows and movies is how he started enjoying swing music.<br/>\n<br/>\nThere are many types of music he enjoys and movies are often a lead in - not always but often.<br/>\n<br/>\nWe watched a John Wayne movie the other day called &quot;McLintock&quot; and it is loosely based upon Shakespeare&#39;s &quot;The Taming of the Shrew.&quot;<br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: C-Span&#39;s Presidents Timeline poster","postDate":"1278477624","msgId":55720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMzQwNTM4LjEwNDAwMDJAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDVGNjBEQUE0NzVBNjQwRDVCM0U0OTEzQUZBNzVBOUFGQEVkUEM+","referencesHeader":"PGkxMHJhcStpaG0wQGVHcm91cHMuY29tPiA8NUY2MERBQTQ3NUE2NDBENUIzRTQ5MTNBRkE3NUE5QUZARWRQQz4="},"prevInTopic":55719,"nextInTopic":55729,"prevInTime":55719,"nextInTime":55721,"topicId":55697,"numMessagesInTopic":0,"msgSnippet":"... Patrick O Brien  wrote the Aubrey/Maturin series of books -- there are 21 novels (Master and Commander was first and Patrick O Brien died while writing the","messageBody":"<div id=\"ygrps-yiv-1905235306\">On 7/6/2010 8:28 PM, Ed Wendell wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My sister was here visiting with her family a few weeks ago and we all <br/>\n&gt; watched the movie &quot;Master and Commander&quot; and at one point she jumped <br/>\n&gt; up and was looking at our world map to get a reference point for the <br/>\n&gt; location of the movie.<br/>\n<br/>\n </span></blockquote>Patrick O&#39;Brien  wrote the Aubrey/Maturin series of books -- there are <br/>\n21 novels (Master and Commander was first and Patrick O&#39;Brien died while <br/>\nwriting the 21st book).  Roxana is crazy about these books (not crazy <br/>\nabout the movie that combines book 1 and book 10 which is called &quot;Far <br/>\nSide of the World,&quot; and the movie is really called &quot;Master and <br/>\nCommander: Far Side of the World&quot;).<br/>\n<br/>\nShe has read them more than once. Pretty much because of these books she <br/>\ndeveloped a passionate interest in the Napoleonic Wars time period and <br/>\nnow she is a senior at a university getting a degree in history with <br/>\nthat very specific time period as her area of focus. (She&#39;s getting a <br/>\ndouble major - the other major is Drama.)<br/>\n<br/>\nI&#39;ve listened to the first book and watched the movie - I thought the <br/>\nmovie was slow-moving compared to the excitement of the book.<br/>\n<br/>\nRoxana first heard of these books from an online friend who was in a <br/>\nMaster and Commander fandom.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: C-Span&#39;s Presidents Timeline poster","postDate":"1278473315","msgId":55719,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVGNjBEQUE0NzVBNjQwRDVCM0U0OTEzQUZBNzVBOUFGQEVkUEM+","inReplyToHeader":"PGkxMHJhcStpaG0wQGVHcm91cHMuY29tPg==","referencesHeader":"PGkxMHJhcStpaG0wQGVHcm91cHMuY29tPg=="},"prevInTopic":55718,"nextInTopic":55720,"prevInTime":55718,"nextInTime":55720,"topicId":55697,"numMessagesInTopic":0,"msgSnippet":"We use a tiny straight pin to hang almost everything - even most framed pictures - and it does not leave a discernable mark in the drywall.  We use a pin in","messageBody":"<div id=\"ygrps-yiv-196875609\">We use a tiny straight pin to hang almost everything - even most framed pictures - and it does not leave a discernable mark in the drywall.  We use a pin in each corner of a poster.<br/>\n<br/>\nPosters and maps are always in use around here even by company: My sister was here visiting with her family a few weeks ago and we all watched the movie &quot;Master and Commander&quot; and at one point she jumped up and was looking at our world map to get a reference point for the location of the movie.  Our world and USA maps are constantly in use.  Zac uses the maps a lot while watching videos, TV, movies, playing games, reading news on the net, etc.<br/>\n<br/>\nWe just ordered the president&#39;s poster - thanks!<br/>\n<br/>\nLisa W.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: C-Span&#39;s Presidents Timeline poster","postDate":"1278472346","msgId":55718,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxMHJhcStpaG0wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRFQjI4MjA2LTAxNzUtNDEzMi04NkU3LTdCNzMwOENERjQ5N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":55715,"nextInTopic":55719,"prevInTime":55717,"nextInTime":55719,"topicId":55697,"numMessagesInTopic":0,"msgSnippet":"===Apologies to those outside the U.S.=== Doh! Sorry about not being more specific in the subject line. I definitely had United States history on the brain","messageBody":"<div id=\"ygrps-yiv-2121570983\">===Apologies to those outside the U.S.===<br/>\n<br/>\nDoh! Sorry about not being more specific in the subject line. I definitely had United States history on the brain when I composed that post. (I was so happy about being excited about a timeline of our presidents!)<br/>\n<br/>\nNow I&#39;m curious to look around online to see what kind of timelines are available for world history. And the discussion about Greek mythology has me interested in looking for posters about that.<br/>\n<br/>\nI already have packing tape on my grocery list, Sandra, but I will be sure to get 3M brand. We repainted our common rooms last year so it&#39;s nice to be told about a way to hang things without having a bazillion thumbtack and nail holes everywhere, and which will also protect the poster itself.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] C-Span&#39;s Presidents Timeline poster","postDate":"1278470979","msgId":55715,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFQjI4MjA2LTAxNzUtNDEzMi04NkU3LTdCNzMwOENERjQ5N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkxMGVpMCtzYWxzQGVHcm91cHMuY29tPg==","referencesHeader":"PGkxMGVpMCtzYWxzQGVHcm91cHMuY29tPg=="},"prevInTopic":55697,"nextInTopic":55718,"prevInTime":55714,"nextInTime":55716,"topicId":55697,"numMessagesInTopic":0,"msgSnippet":"Apologies to those outside the U.S., but we had the old poster and had it up and down and up again six or eight times. We got the new one last week, and I put","messageBody":"<div id=\"ygrps-yiv-233659542\">Apologies to those outside the U.S., but we had the old poster and had  <br/>\nit up and down and up again six or eight times.<br/>\n<br/>\nWe got the new one last week, and I put it up the next morning.  One  <br/>\nof the first things Holly said when she came in the house, before she  <br/>\nwas even up the stairs all the way, was &quot;We got a new presidents&#39;  <br/>\nchart?!&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://i26.photobucket.com/albums/c111/SandraDodd/house/kdk_2752.jpg\">http://i26.photobucket.com/albums/c111/SandraDodd/house/kdk_2752.jpg</a><br/>\n<br/>\nHere&#39;s how I put maps and charts up and take them down and get them  <br/>\nback up again:<br/>\nBox tape.  Good, clear 3M 2&quot; wide box tape.<br/>\n<br/>\n<br/>\nOn the back of the chart, on each corner and in the middle, put two  <br/>\nstrips of box tape, about 8&quot; long (for this size of poster), so  <br/>\nthere&#39;s a big reinforced place. That&#39;s like lamination, but you can&#39;t  <br/>\nlaminate the whole thing.<br/>\n<br/>\nYou might need two in the middle on the top; depends on your wall.<br/>\n<br/>\nThen on those, put loops of box tape, like 15&quot; (more or less&quot; put into  <br/>\nan inside-out loop so both sides are sticky.  Put that on the tape  <br/>\nyou&#39;ve already put on the back.  Then stick it to the wall.  You can  <br/>\nreadjust those; you can take it down when you&#39;re tired of it, take  <br/>\nthose loops off and throw them away, and the place where the loops  <br/>\nwere should be as good as new.  No holes in the poster, no torn paper.<br/>\n<br/>\nOn this one, I put three loops of tape in each corner, different  <br/>\ndirections, so gravity can&#39;t  make  them all loose.<br/>\n<br/>\nI have maps and posters that are over 20 years old, still re-useable,  <br/>\nbecause there are good tape-pads on back for new tape loops.<br/>\n<br/>\nDon&#39;t use cheap tape.  Don&#39;t use anything like masking tape (too  <br/>\nwimpy) or duct tape (it will mess up the poster and the wall).  Not  <br/>\nstrapping tape.   Just this stuff:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.boxandsupply.com/images/BAS_TapeAndDispenser/ScotchTapeAndDispenser.jpg\">http://www.boxandsupply.com/images/BAS_TapeAndDispenser/ScotchTapeAndDispenser.jpg</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"C-Span&#39;s Presidents Timeline poster","postDate":"1278459264","msgId":55697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxMGVpMCtzYWxzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":55715,"prevInTime":55696,"nextInTime":55698,"topicId":55697,"numMessagesInTopic":0,"msgSnippet":"http://www.c-spanclassroom.org/Special-Offers.aspx Someone mentioned in an unschooling chat a month or two ago that C-Span was offering a free updated","messageBody":"<div id=\"ygrps-yiv-1702140816\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.c-spanclassroom.org/Special-Offers.aspx\">http://www.c-spanclassroom.org/Special-Offers.aspx</a><br/>\n<br/>\nSomeone mentioned in an unschooling chat a month or two ago that C-Span was offering a free updated President&#39;s Timeline. That day I put in my request for one (they offer them to homeschoolers, as well as to classroom teachers) and it arrived today.<br/>\n<br/>\nIt is SO COOL!<br/>\n<br/>\nI took it into Andrew&#39;s room and spread it out on his floor (which I had decluttered for him just a few hours earlier). He saw me opening it up and came over to see what it was, and we both oohed and aahed over how big (6 ft. wide) and easy to read it is.<br/>\n<br/>\nNow, I came out of my school years with a strong dislike for anything &quot;history&quot;, and it&#39;s only been since we&#39;ve been unschooling that I&#39;ve become interested in it. I still struggle with anything date-related -- I don&#39;t know when wars happened or who was president when, but, in my 40&#39;s, I&#39;m finally interested in learning that kind of stuff.<br/>\n<br/>\nI ordered the poster for myself, but was pretty sure my hubby, who loves all things history, would love it too. And I thought Andrew might find it interesting at some point (or at many points) over the years if it&#39;s hanging in a common space.<br/>\n<br/>\nAnyway, when I had it spread out on Andrew&#39;s floor and we were looking at it together, I hit the highlights with him of how to read it. He has a Pokemon timeline poster on his wall, and one of the gaming magazines he reads has, over the years, done timelines of various game characters, so Andrew knew the basics of how to read a timeline. <br/>\n<br/>\nI didn&#39;t want to give him information overload, so I briefly explained how the &quot;public service&quot; chart works (and we had fun quickly noticing which presidents had long military histories and which only had short tenures in the White House -- very easy to see at a glance on this timeline), I pointed out where it shows how the number of states and the population increased over the years, I explained what the &quot;b.&quot; and &quot;d.&quot; and accompanying dates stood for next to the presidents&#39; names, and then I stopped.<br/>\n<br/>\nHe noticed there have been two President Bushes and asked how were they different, so in giving a brief answer to that I also included that each term of office is 4 years and a president is limited to 2 terms, and we related that directly back to the Bushes and Clinton (the part of the timeline we were looking at at that moment). I know that presidents haven&#39;t always been limited to two terms, but, for that particular moment, that felt like we would&#39;ve been crossing into &quot;too much info at one time&quot; territory. Some other day he may look at that timeline and notice that the red line (length of term of presidency) for FDR was longer than two terms, and ask about that. Or it may come up in some other way, maybe while he&#39;s still living at home, maybe not until he&#39;s living away from home. Or maybe never. <br/>\n<br/>\nWhen we were new to unschooling, I would&#39;ve wanted him to be as excited as I am about that timeline, and I would&#39;ve given him too much info about it. And even then I would&#39;ve wanted to give him *more*. The timeline might&#39;ve become not so interesting, in his eyes. <br/>\n<br/>\nRight now it&#39;s spread out on my and Rodney&#39;s bed (I needed it somewhere off the floor to keep the dogs from walking all over it), and I keep going in there to look at different parts of it. It contains info that I didn&#39;t even notice when Andrew and I were looking at it together! It really is an awesome timeline; thanks to whoever mentioned it on the Unschooling Chat a while back!!<br/>\n<br/>\nGlenda</div>","specialLinks":[]}],"prevTopicId":55453,"nextTopicId":55688}}