{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: When your child is sick...?","postDate":"1327956696","msgId":65349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4RTY3QjExLTM3MzItNEMwNS05QkJDLTdDNkU3NDJGMjczOUBnbWFpbC5jb20+","inReplyToHeader":"PGpnM2picCtoc3NzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpnM2picCtoc3NzQGVHcm91cHMuY29tPg=="},"prevInTopic":65342,"nextInTopic":0,"prevInTime":65348,"nextInTime":65350,"topicId":65293,"numMessagesInTopic":0,"msgSnippet":"... I would help your husband figure out a way to make the PM exercises a special father daughter time. Perhaps he can do some other calming activities with","messageBody":"<div id=\"ygrps-yiv-1510269883\">--- The PM ones are rough. Hub gets home and has been helping her do them after dinner. I&#39;m worn out from the day so i use the time to get a few minutes of quiet (interrupted by wailing and grumpy Dad voice.) He&#39;s worn out and she starts whining... Then HE starts &#39;whining&#39; and then I get annoyed. We&#39;ll have to brainstorm more on this. ---<br/>\n<br/>\nI would help your husband figure out a way to make the PM exercises a special father daughter time. Perhaps he can do some other calming activities with her before and after. Maybe your husband could read her a story and play dolls with her, or any other game she enjoys. Or they could have a spa date - maybe they could have a warm foot bath together and give each other hand massages with warm oil.  You could put out yoga mats in the room and your daughter could give her favourite doll or teddy bear the exercises first and then your husband could give the exercises to your daughter. You can make it extra special by dimming the lights, putting out tea candles, and/or soft music. <br/>\n<br/>\nThe added beauty to the situation might make it more special and magical for your daughter.<br/>\n<br/>\nSee how you can support them in the PM exercises. Maybe you can give your husband some quiet transition time between coming home from work and doing the exercises with your daughter so he can be calm and centered. Maybe you can make them a special snack or dessert, prettily arranged on a beautiful plate so that they can have a tea party together with her dolls. <br/>\n<br/>\nIt might take some time, but encourage your husband to be soft and gentle.<br/>\n<br/>\n---  because we wish it would just disappear ---<br/>\n<br/>\nMe too. But then I remind myself that dealing gracefully with adversity is a wonderful skill to learn. <br/>\n<br/>\nEvery moment is a choice - to feel upset about my daughter&#39;s condition or to feel grateful for all that I do have. The more I practice gratitude, the greater my inner reserve for the really distressing moments of life, which we all have. My children are also learning from watching me deal with difficult situations. The more I try to stretch myself, grow and make better choices, the more they learn about what works, what doesn&#39;t work, what leads to more happiness, what leads to more hurt. <br/>\n<br/>\nRippy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":236160882,"authorName":"jenuhferr","from":"&quot;jenuhferr&quot; &lt;jenuhferr@...&gt;","profile":"jenuhferr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When your child is sick...?","postDate":"1327845561","msgId":65342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnM2picCtoc3NzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYzQzU3N0FBLTk3QUEtNDZFRC1BMkU1LTE1NTg2QUNGRkVFMEBnbWFpbC5jb20+"},"prevInTopic":65310,"nextInTopic":65349,"prevInTime":65341,"nextInTime":65344,"topicId":65293,"numMessagesInTopic":0,"msgSnippet":"Rippy wrote: *---- I don t take our time together for granted. Since that moment, every day with her has felt like a day that I almost never had. I love","messageBody":"<div id=\"ygrps-yiv-1014560530\">Rippy wrote:<br/>\n*---- I don&#39;t take our time together for granted. Since that moment, every day with her has felt like a day that I almost never had. I love filling her life with happy moments and showing her how much I love her. I feel blessed to have the chance to do this. I don&#39;t struggle with the need for me-time (and the accompanying feelings of unhappiness and frustration when it doesn&#39;t work out) like many of my friends do. I&#39;m just so grateful that I have the opportunity every day to *be* with her.<br/>\n<br/>\nI feel that my husband have gained this perspective too. Knowing what is really important and trying to remember that we need to enjoy life and love. I think this has made us better parents.<br/>\n<br/>\n*----- I would do my best to relax and come up with a better strategy. I would tell her a story about magic fairies and unicorns. I filled a small bag with princess toys, stickers, candy, etc. that she could choose from after each exercise. Sometimes I would sing to her. Sometimes I would offer her a small gift of money so we could go to the store together and buy something pretty. Sometimes I would cry with frustration/exhaustion (not in front of her) because I couldn&#39;t figure out a way to help her relax in that moment and do a particular set of exercises. ----*<br/>\n<br/>\nIt&#39;s &#39;funny&#39; how I compartmentalize things sometimes. I guess it&#39;s a security thing. A false sense of being in control. I do things like you mentioned for other things we need to do... Like visiting a museum that my daughter loves near a doc&#39;s office we visit out of state a few times a year. The drive is long but we&#39;ve found ways to make it a time of fun and bonding! I think we have just not been creative enough with the OT exercises. I think giving her the choice of when in the AM to do the AM exercises and then when in the PM to do the afternoon ones, would help as a start. The PM ones are rough. Hub gets home and has been helping her do them after dinner. I&#39;m worn out from the day so i use the time to get a few minutes of quiet (interrupted by wailing and grumpy Dad voice.) He&#39;s worn out and she starts whining... Then HE starts &#39;whining&#39; and then I get annoyed. We&#39;ll have to brainstorm more on this.<br/>\n<br/>\n<br/>\n*------ Most of the time she doesn&#39;t ask for anything special, but if she ever does, I make it a priority to give it to her. I want her to know that I&#39;m on her side and I will do my best to make the situation as comfortable for her as I possibly can.-----*<br/>\n<br/>\nThis is what we try to do. It&#39;s part of our life but I want to make sure it doesn&#39;t take over. We model this in our lives for her. I guess it&#39;s just easy to slip into a mindset that this is &#39;separate&#39; from life (as Sandra mentioned) because we wish it would just disappear. Not reality. <br/>\n<br/>\nThanks so much for sharing your experience! Food for thoughts! Nom nom!<br/>\n<br/>\nJennifer</div>","specialLinks":[]},{"userId":342942830,"authorName":"jay.ford79","from":"&quot;jay.ford79&quot; &lt;jay.ford79@...&gt;","profile":"jay.ford79","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When your child is sick...?","postDate":"1327757776","msgId":65310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnMHRrZytscjRkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGFkNjgwZjAyLTU5YzAtNDRkZS1iN2ZjLTk5ZGVmYThkYjVhMEBlbWFpbC5hbmRyb2lkLmNvbT4="},"prevInTopic":65300,"nextInTopic":65342,"prevInTime":65309,"nextInTime":65311,"topicId":65293,"numMessagesInTopic":0,"msgSnippet":"My son had a life-threatening illness when he was 2.  It required medication that was not optional.  What we did was let him have control over his medication:","messageBody":"<div id=\"ygrps-yiv-805979298\">My son had a life-threatening illness when he was 2.  It required medication that was not optional.  What we did was let him have control over his medication: the where, the when, what we mixed it in, whether it was crushed and mixed or swallowed whole, etc.  The only thing he could not choose was not to take it at all.  It became routine, part of life. Some of the meds affected his mood and appetite and he hated it. We called it the grumpy medicine and were extra supportive when the side effects upset him.  It was just a part of life but we tried to make it as easy as possible on him. <br/>\n<br/>\nThe doctors were great as well.  Which finger did he want pricked (for blood tests), what bandaid, did he want numbing gel or spray or nothing, so he had a lot of choices to make it easier. <br/>\n<br/>\nHe&#39;s fine now.<br/>\n<br/>\nAt 7 she&#39;s old enough to understand more of the consequences of not taking medication, especially if it is something you both share.<br/>\n<br/>\nJon<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; My question is how someone can unschool well when it comes to medical issues. Serious ones. I have never forced my kid into bed when sick with a cold/flu (rare anyway). So boring! But when it comes to a complex disease that involves medicines and even annoying therapies and doc visits, what can we do? Basically, if these are not followed with, let&#39;s say at least 80% accuracy if I have to try to quantify it, she will EVENTUALLY lose her ability to do anything at all. I have personal experience with this unfortunately. She is getting obvious benefits and is happier due to some of the recent therapies in particular but she seems to focus on how much the &#39;exercises&#39; suck. Partial kindergarten was a major blow but she&#39;s getting better. She just turned 7... </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When your child is sick...?","postDate":"1327704421","msgId":65300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpmdjloNStvOWdrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGFkNjgwZjAyLTU5YzAtNDRkZS1iN2ZjLTk5ZGVmYThkYjVhMEBlbWFpbC5hbmRyb2lkLmNvbT4="},"prevInTopic":65298,"nextInTopic":65310,"prevInTime":65299,"nextInTime":65301,"topicId":65293,"numMessagesInTopic":0,"msgSnippet":"... ************** There are real limits in life. Unschooling isn t about pretending otherwise, but one of the advantages of being your child s partner rather","messageBody":"<div id=\"ygrps-yiv-2139445435\">Jennifer &lt;jenuhferr@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My question is how someone can unschool well when it comes to medical issues. Serious ones. <br/>\n </span></blockquote>**************<br/>\n<br/>\nThere are real limits in life. Unschooling isn&#39;t about pretending otherwise, but one of the advantages of being your child&#39;s partner rather than her adversary is that you get to be part of the process for finding ways to deal with those real limits. Sometimes that means finding ways around problems, or juggling a variety of needs creatively, and sometimes it means being the warm safe shoulder to cry on when the limits are not surmountable. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I can&#39;t let her stop taking medicines (pharm and alternative) and let her experience consequences, because a lot of times there is no going back.<br/>\n </span></blockquote>**************<br/>\n<br/>\nThere isn&#39;t some kind of rule that &quot;to be an unschooler&quot; you have to &quot;let your child experience consequences&quot;. Sometimes, its downright cruel to let a child suffer when you could have prevented it. Kids need parents! They don&#39;t need tin soldiers telling them what to do and how to think, but they do need help and support in figuring out a complex and sometimes perilous world. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She is getting obvious benefits and is happier due to some of the recent therapies in particular but she seems to focus on how much the &#39;exercises&#39; suck.<br/>\n </span></blockquote>***************<br/>\n<br/>\nCommiserate and look for options - there may be ways to modify the exercises, or she may be able to do them on a different timetable than what&#39;s convenient to the physical therapist...  or maybe Not, but it could help her to know you&#39;re willing to go to bat for her, to find out if there&#39;s another option which will give her the same benefits. And if not, commiserate some more. Look for ways to make the time she spends on her exercises more pleasant. Look for ways for her to feel more in control - even a little bit can help. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When your child is sick...?","postDate":"1327700386","msgId":65298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzQzU3N0FBLTk3QUEtNDZFRC1BMkU1LTE1NTg2QUNGRkVFMEBnbWFpbC5jb20+","inReplyToHeader":"PGFkNjgwZjAyLTU5YzAtNDRkZS1iN2ZjLTk5ZGVmYThkYjVhMEBlbWFpbC5hbmRyb2lkLmNvbT4=","referencesHeader":"PGFkNjgwZjAyLTU5YzAtNDRkZS1iN2ZjLTk5ZGVmYThkYjVhMEBlbWFpbC5hbmRyb2lkLmNvbT4="},"prevInTopic":65294,"nextInTopic":65300,"prevInTime":65297,"nextInTime":65299,"topicId":65293,"numMessagesInTopic":0,"msgSnippet":"... I think in some ways it helped me with unschooling. I m more peaceful, kinder and compassionate with both children because of my daughter s medical issues.","messageBody":"<div id=\"ygrps-yiv-267925880\">---My question is how someone can unschool well when it comes to medical issues. ---<br/>\n<br/>\nI think in some ways it helped me with unschooling. I&#39;m more peaceful, kinder and compassionate with both children because of my daughter&#39;s medical issues.<br/>\n<br/>\nWhen my daughter was one years old, she had her first febrile convulsion. I saw her turn blue and stop breathing and I thought she was dying in my arms. In that instant, a life without her flashed through my mind. It unraveled me for a very long time. <br/>\n<br/>\nI don&#39;t take our time together for granted. Since that moment, every day with her has felt like a day that I almost never had. I love filling her life with happy moments and showing her how much I love her. I feel blessed to have the chance to do this. I don&#39;t struggle with the need for me-time (and the accompanying feelings of unhappiness and frustration when it doesn&#39;t work out) like many of my friends do. I&#39;m just so grateful that I have the opportunity every day to *be* with her.<br/>\n<br/>\n<br/>\n---she seems to focus on how much the &#39;exercises&#39; suck.---<br/>\n<br/>\nI did everything I could to keep my daughter peaceful after her strabismus surgery. The doctor wanted us to do a series of ten exercises a day with her in the first week. If she didn&#39;t want to do the exercises, I would take a step back and breathe. I would meditate for a few minutes. I would do my best to relax and come up with a better strategy. I would tell her a story about magic fairies and unicorns. I filled a small bag with princess toys, stickers, candy, etc. that she could choose from after each exercise. Sometimes I would sing to her. Sometimes I would offer her a small gift of money so we could go to the store together and buy something pretty. Sometimes I would cry with frustration/exhaustion (not in front of her) because I couldn&#39;t figure out a way to help her relax in that moment and do a particular set of exercises. <br/>\n<br/>\nBut we did do all those exercises (ten sets every day) without her being upset. If she was resistant, I would back down and try again later. I was gentle and patient. Now we do three sets of exercises daily and it goes much smoother. Most of the time she doesn&#39;t ask for anything special, but if she ever does, I make it a priority to give it to her. I want her to know that I&#39;m on her side and I will do my best to make the situation as comfortable for her as I possibly can.<br/>\n<br/>\nRippy<br/>\n(Gianluca 7, Gisele 5)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When your child is sick...?","postDate":"1327685308","msgId":65294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NDk5NTM3LTIwODgtNDkwRS05Nzk3LUM2RDcyODgwNERDMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGFkNjgwZjAyLTU5YzAtNDRkZS1iN2ZjLTk5ZGVmYThkYjVhMEBlbWFpbC5hbmRyb2lkLmNvbT4=","referencesHeader":"PGFkNjgwZjAyLTU5YzAtNDRkZS1iN2ZjLTk5ZGVmYThkYjVhMEBlbWFpbC5hbmRyb2lkLmNvbT4="},"prevInTopic":65293,"nextInTopic":65298,"prevInTime":65293,"nextInTime":65295,"topicId":65293,"numMessagesInTopic":0,"msgSnippet":"-=-My question is how someone can unschool well when it comes to medical issues. Serious ones. I have never forced my kid into bed when sick with a cold/flu","messageBody":"<div id=\"ygrps-yiv-1958131308\">-=-My question is how someone can unschool well when it comes to medical issues. Serious ones. I have never forced my kid into bed when sick with a cold/flu (rare anyway).-=-<br/>\n<br/>\n&quot;As well as you can.&quot;<br/>\n<br/>\n-=-I recently had a relapse (stopped the meds part of it, dumb a) and it was bad. I reassured her that it was ok, just a setback (hoping) and i&#39;d be up and around soon. But her fear is there. She&#39;s no dummy. I am back on my feet but I still have obvious paralysis (improving but impossible to hide!)-=-<br/>\n<br/>\nIf it&#39;s something you and your daughter share, you can help each other through it, and that can be part of the learning that happens.  <br/>\n<br/>\n-=- Don&#39;t want her childhood to be &#39;sickness&#39; and oh yeah we did some fun things. Nightmare!! <br/>\n-=-<br/>\n<br/>\nWhy did you write &quot;Nightmare!!&quot; ?<br/>\nIf you can&#39;t remove the sickness, then it&#39;s part of her life, and &quot;some fun things&quot; is separating life from fun.<br/>\n<br/>\n-=-A &#39;vacation&#39; is not possible. I can&#39;t let her stop taking medicines (pharm and alternative) and let her experience consequences, because a lot of times there is no going back. -=-<br/>\n<br/>\nIf you don&#39;t think you can, then you can&#39;t.  If you&#39;re doing mainstream AND alternative, and she has never experienced consequences, it&#39;s hard for you to know what&#39;s helping and how much is necessary and how much is your fear.   That&#39;s not a good discussion for this list, but being realistic about what is and what isn&#39;t doesn&#39;t just involve your own personal fears.<br/>\n<br/>\n-=-I THINK this kind of falls under the umbrella of &#39;safety?&#39; I wouldn&#39;t let her walk in traffic because she doesn&#39;t like the sandy broken sidewalk or something. She might NOT get hit by a car but it&#39;s just too risky. If she has the the flu but wants to play out in the snow all day? Have fun! Totally different animal. She might get sicker or not but it&#39;s self-limiting.-=-<br/>\n<br/>\nI don&#39;t think playing outside in the snow all day under ANY circumstances is safe or different.  It&#39;s not &quot;self limiting&quot; if she&#39;s already sick and you don&#39;t keep her warm and hydrated.<br/>\n<br/>\nFrom this post alone, it seems your thinking is unclear, and you&#39;re looking for different sets of rules about flu and playing in traffic and serious medical treatment.    Don&#39;t.<br/>\n<br/>\nPractice this a while:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choices\">http://sandradodd.com/choices</a><br/>\nor maybe listen to the sound file here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nAs you get better at making choices in the moment, based on whatever factors are there at that moment, you&#39;ll be able to do it more easily each subsequent time.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":236160882,"authorName":"Jennifer","from":"Jennifer &lt;jenuhferr@...&gt;","profile":"jenuhferr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"When your child is sick...?","postDate":"1327681944","msgId":65293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFkNjgwZjAyLTU5YzAtNDRkZS1iN2ZjLTk5ZGVmYThkYjVhMEBlbWFpbC5hbmRyb2lkLmNvbT4="},"prevInTopic":0,"nextInTopic":65294,"prevInTime":65292,"nextInTime":65294,"topicId":65293,"numMessagesInTopic":0,"msgSnippet":"Hi i m reading a lot and being filled up I guess you could say. I m feeling validated and sooo happy that there are such great articles online to read!","messageBody":"<div id=\"ygrps-yiv-300552759\">Hi i&#39;m reading a lot and being filled up I guess you could say. I&#39;m feeling validated and sooo happy that there are such great articles online to read! Learning a lot.<br/>\n<br/>\nMy question is how someone can unschool well when it comes to medical issues. Serious ones. I have never forced my kid into bed when sick with a cold/flu (rare anyway). So boring! But when it comes to a complex disease that involves medicines and even annoying therapies and doc visits, what can we do? Basically, if these are not followed with, let&#39;s say at least 80% accuracy if I have to try to quantify it, she will EVENTUALLY lose her ability to do anything at all. I have personal experience with this unfortunately. She is getting obvious benefits and is happier due to some of the recent therapies in particular but she seems to focus on how much the &#39;exercises&#39; suck. Partial kindergarten was a major blow but she&#39;s getting better. She just turned 7...<br/>\n<br/>\nI recently had a relapse (stopped the meds part of it, dumb a) and it was bad. I reassured her that it was ok, just a setback (hoping) and i&#39;d be up and around soon. But her fear is there.  She&#39;s no dummy. I am back on my feet but I still have obvious paralysis (improving but impossible to hide!)<br/>\n<br/>\nI&#39;ve tried hard to make sure our fears do not impact things. If she is having a horrible day, we skip the therapy exercises for example. Even one dose of the meds and herbs... whatever. Don&#39;t want her childhood to be &#39;sickness&#39; and oh yeah we did some fun things. Nightmare!! <br/>\n<br/>\nA &#39;vacation&#39; is not possible. I can&#39;t let her stop taking medicines (pharm and alternative) and let her experience consequences, because a lot of times there is no going back. Her choices could realistically be &#39;what part of the ceiling should i stare at today&#39; or &#39;what kind of wheelchair would i like.&#39; She doesn&#39;t resist the meds as it has been part of her life for forever but there are new &#39;exercises&#39; for neuro help that just started a few months ago and change.<br/>\n<br/>\nI THINK this kind of falls under the umbrella of &#39;safety?&#39; I wouldn&#39;t let her walk in traffic because she doesn&#39;t like the sandy broken sidewalk or something. She might NOT get hit by a car but it&#39;s just too risky. If she has the the flu but wants to play out in the snow all day? Have fun! Totally different animal. She might get sicker or not but it&#39;s self-limiting.<br/>\n<br/>\nI have a lot to work on a with other things and I see benefits already but not sure how to fit this medical &#39;stuff&#39; into what I want to do...<br/>\n<br/>\nTried to edit this down more but wanted to give a clear picture... Thanks for reading.<br/>\n<br/>\nThanks, Jen</div>","specialLinks":[]}],"prevTopicId":65317,"nextTopicId":65352}}