{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bigger than Konos; not just Konos  (wasRe:Konos)","postDate":"1064860590","msgId":81764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3LjMwZWJlMjliLjJjYTlkNWFlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":81763,"nextInTime":81765,"topicId":81764,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/29/03 6:25:37 AM, holly@shaltzfarm.com writes: ","messageBody":"<div id=\"ygrps-yiv-883379891\">In a message dated 9/29/03 6:25:37 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:holly@...\">holly@...</a> writes:<br/>\n<br/>\n&lt;&lt; Let&#39;s turn the table.  What about the term &quot;radical unschooler&quot;?  I<br/>\npersonally don&#39;t like it.  &gt;&gt;<br/>\n<br/>\nI don&#39;t mind it.<br/>\n<br/>\nSo you&#39;re stating where your beliefs lie, and I made a statement which <br/>\nincluded where MANY people&#39;s beliefs lie (including hundreds of thousands of <br/>\nChristian Homeschoolers).<br/>\n<br/>\nHow about having stated that you stop trying to convert me and others to your <br/>\nminority view of terminology?<br/>\n<br/>\nIf &quot;alley&quot; means the same thing to most people and there&#39;s a dictionary <br/>\ndefinition and lots of cities define &quot;alley&quot; to mean the same thing, then someone <br/>\ncampaigning to call &quot;alley&quot; something different and to use the word &quot;alley&quot; to <br/>\nmean something particularly other can put up web pages and billboards, but <br/>\nthey&#39;re fighting the tide of language.<br/>\n<br/>\n&lt;&lt;But they don&#39;t make<br/>\nme radical--at least, not in the sense in which I use that word, of<br/>\nwanting to overturn all of the &#39;establishment&#39;. &gt;&gt;<br/>\n<br/>\nThat isn&#39;t what &quot;radical&quot; means.<br/>\nIf, in your mind, the word &quot;radical&quot; means to overturn the establishment, <br/>\nplease spend some time looking it up in dictionaries or in useage guides on the <br/>\ninternet.<br/>\n<br/>\n&lt;&lt;Maybe it&#39;s just I don&#39;t have a great take on the word &#39;radical&#39;.  Maybe<br/>\nit&#39;s just the way I don&#39;t care for labels of any kind, anywhere.  But I<br/>\nwould no more call a group of people radical unschoolers than I would<br/>\ncall a group fundamentalist Christian or a group Christian<br/>\nhomeschoolers.&gt;&gt;<br/>\n<br/>\nOkay.  You won&#39;t.  But I don&#39;t mind labels.  They&#39;re called &quot;nouns.&quot;<br/>\n<br/>\nI know my dog is a dog, and I know she&#39;s a pet, and a blue heeler and an <br/>\nAustralian Cattle Dog.  I didn&#39;t know at first.  At first she was a dog-pound <br/>\npuppy.  Those labels don&#39;t hurt her.  They&#39;re ways of communicating about her.<br/>\n<br/>\n&lt;&lt;Labels are a lot of what we leave school to escape. &gt;&gt;<br/>\n<br/>\nYour &quot;we&quot; should have been something different.  I didn&#39;t leave school to <br/>\nescape labels.  First, I didn&#39;t &quot;leave school.&quot;  I finished it, continued it, and <br/>\nbecame an employee of school.<br/>\n<br/>\nMy children didn&#39;t &quot;leave school,&quot; they never went in the first place.<br/>\n<br/>\nAnd the reason I&#39;m glad they&#39;re home is to avoid structured delivery of <br/>\nsubject matter, not to &quot;escape labels.&quot;<br/>\n<br/>\n&lt;&lt;Just as most of the women on this list would probably<br/>\nprefer that either female pronouns be used in non-specific writing, or<br/>\nthat constructions like his/her be used, because we KNOW that using male<br/>\npronouns almost exclusively creates a worldview which maintains the<br/>\nimportance of the male over the female.&gt;&gt;<br/>\n<br/>\nYou&#39;re proposing (speaking for most of the women on this list, no less) that <br/>\nin referring to a mixed group, the pronoun &quot;she&quot; should be used primarily?  Or <br/>\nhe/she, but if not he/she then &quot;she&quot;?<br/>\n<br/>\nThat&#39;s weird.  I&#39;ve never heard ANYONE propose that in the absence of he/she, <br/>\n&quot;she&quot; should be preferable over &quot;he.&quot;  I&#39;ve known (and done) lots of going <br/>\nback and forth, or using &quot;she&quot; sometimes, as a reminder that we&#39;re not talking <br/>\nonly of boys, in a late-reading situation or whatever.<br/>\n<br/>\n&lt;&lt;Labels are made to pigeon-hole people, to<br/>\navoid our having to see the individuality that lies beneath the facade. <br/>\nFirst we pigeon-hole, then we dehumanize, then we deprive rights,<br/>\nthen.....well, how did the Nazis end up able to slaughter so many<br/>\npeople?&gt;&gt;<br/>\n<br/>\nJESUS CHRIST!!! You think using a label is being a NAZI!?<br/>\n<br/>\nGet a grip.<br/>\n<br/>\n&lt;&lt;Fundamentalist Christian homeschoolers are people, too, working within<br/>\ntheir own sets of values and worldviews.  If we label and avoid, we<br/>\ncontribute to the adversarial relationship that exists. &gt;&gt;<br/>\n<br/>\nPlease read their stuff.  It&#39;s not &quot;adversarial.&quot;<br/>\nIt&#39;s God against Satan.<br/>\n&quot;You&#39;re either with me or against me,&quot; they say in sermons all the time.<br/>\n<br/>\nI don&#39;t know how you were raised, Holly, but I grew up Southern Baptist and I <br/>\nknow what I&#39;m talking about.<br/>\n<br/>\nThey don&#39;t WANT that adversarial relationship to fall.  They built it and <br/>\nthey maintain it.<br/>\n<br/>\n&lt;&lt;<br/>\nI personally prefer to bring people together rather than divide or<br/>\nmaintain divisions. &gt;&gt;<br/>\n<br/>\nDo it on your yourself in your own posts then, instead of disrupting this <br/>\ngroup with talk of Nazis and other ranting.<br/>\n<br/>\nIn the military, people have a job to do together and they are made to get <br/>\nalong by threat of punishment, expulsion or worse.  &quot;Can&#39;t we all just get along <br/>\nlike in the military&quot; isn&#39;t a legitimate argument to use of those for whom <br/>\nthe military won the freedom to be exclusive and separatist.<br/>\n<br/>\nHave you actually read any statements of faith?<br/>\nDo you really understand what those groups intend by them?<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":81737,"nextTopicId":81747}}