{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Look at unschooling from a different angle","postDate":"1316510471","msgId":63029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NjE0NEFDLTA5RjQtNDc2Ny04MUEzLUFGODVGMzQyMjUxNEB5YWhvby5jb20+","inReplyToHeader":"PEFGQTlFREY0LThBNDEtNEI0My1CRDZELURDQURCOTM5RDQzNkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ1MzMwNTYyLTg1QzMtNDAyMi04ODA0LURGNkZGMDIxRjE3MkBTYW5kcmFkb2RkLmNvbT4gPDE0OTQzODY1LTY1OUYtNDhDOS1CNzM2LTlFNkMzMTdCNzYwREBTYW5kcmFkb2RkLmNvbT4gPEFFNDU5ODE0LTJCMTktNDBGNi04RDk0LTk4QkVCMzI3N0U0OUB5YWhvby5jb20+IDxBRkE5RURGNC04QTQxLTRCNDMtQkQ2RC1EQ0FEQjkzOUQ0MzZAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":63024,"nextInTopic":0,"prevInTime":63028,"nextInTime":63030,"topicId":63007,"numMessagesInTopic":0,"msgSnippet":"... DH witnessed a late nite fist fight/bullying amongst teens at an Unschooling conference.  DH was unconvinced before the conference about Unschooling and","messageBody":"<div id=\"ygrps-yiv-1925808929\">On Sep 19, 2011, at 9:31 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I brought the example to say that lots of kids at conferences who aren&#39;t actually unschoolers can potentially devalue the conference itself.<br/>\n </span></blockquote>--------<br/>\n<br/>\nDH witnessed a late nite fist fight/bullying amongst teens at an Unschooling conference.  DH was unconvinced before the conference about Unschooling and while I had hoped seeing Unschooling families (especially teens who had been unschooled) might change his mind, what he saw, instead convinced him that he really does not want to unschool.<br/>\n<br/>\nOf course I mentioned that not everyone at an Unschooling conference is Unschooling (like or family) and that amongst those who are Unschooling, not everyone will be doing it successfully.<br/>\n<br/>\nCeci</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Look at unschooling from a different angle","postDate":"1316484583","msgId":63024,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFNzdGNUU3LjEwNjAwQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGo1OGhrcStna2JsQGVHcm91cHMuY29tPg==","referencesHeader":"PGo1OGhrcStna2JsQGVHcm91cHMuY29tPg=="},"prevInTopic":63019,"nextInTopic":63029,"prevInTime":63023,"nextInTime":63025,"topicId":63007,"numMessagesInTopic":0,"msgSnippet":"... Make soda bottle rockets - super super fun. Kind of amazing! Also - a simple thing...get some string, straws, balloons, and tape. Tie string to something","messageBody":"<div id=\"ygrps-yiv-2036110849\">On 9/19/2011 4:01 PM, emstrength3 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; maybe we will get a toy or model rocket. <br/>\n<br/>\n </span></blockquote>Make soda bottle rockets - super super fun. Kind of amazing!<br/>\n<br/>\nAlso - a simple thing...get some string, straws, balloons, and tape.<br/>\n<br/>\nTie string to something (tree or a chair) and run string through straw. <br/>\nTie other end of string to another tree or chair - maybe 20 feet apart. <br/>\nBlow up balloon - don&#39;t tie. Tape balloon to straw - let it go. It will <br/>\nzoom down the string.<br/>\n<br/>\nWe tie a string for each person and have races. Experiment with taping <br/>\nthe balloon different ways.<br/>\n<br/>\n--pam</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Look at unschooling from a different angle","postDate":"1316473306","msgId":63019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1OGhrcStna2JsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ1QUM3QzFBLTAwNUUtNDYzRS1BMTZDLTdGMzM3OTE1MjNCMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63013,"nextInTopic":63024,"prevInTime":63018,"nextInTime":63020,"topicId":63007,"numMessagesInTopic":0,"msgSnippet":"... ======== Just because a child wants to build a hovercraft (a real one, to ride on, as someone once said her child wanted) and another wants to build a","messageBody":"<div id=\"ygrps-yiv-228598998\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>========&gt; Just because a child wants to build a hovercraft (a real one, to ride on, as someone once said her child wanted) and another wants to build a brick shop of real bricks, doesn&#39;t mean the mother is obligated to say &quot;Okay,&quot; and to try to do it.  Some things aren&#39;t doable by a kid, nor even by an adult.  A rocket ship to ride in; not happenin&#39;, but they could watch The Astronaut Farmer.===================<br/>\n<br/>\n<br/>\nFor several months my 5 year old has wanted to go visit her best friend in another state.  She keeps telling me that a rocket ship would be a &quot;short cut&quot; to which I have responded that an airplane ride is actually shorter (and showed her why).  Today she told me again that she wants to build a rocket ship.  I said we can absolutely save the money for plane tickets, but that a rocket is not going to happen.  We had a fun fantasy discussion about how we would build a rocket if we could, and we talked about her desire to be an astronaut when she grows up and about Mars. <br/>\n<br/>\nI keep a list of my kids&#39; interests to use as inspiration for things to do and see, and rockets is definitely going on the list.  I saw The Astronaut Farmer years ago and couldn&#39;t remember the name of it, so reading this was perfect timing!  I will also look up youtube videos of real rocket launches for her to watch, maybe we will get a toy or model rocket.  We&#39;ll look up Mars and other planets.  <br/>\n<br/>\nWhen she is 15 or 18, if she still wants to be an astronaut, maybe a trip to visit NASA would be in order, if we could afford it.<br/>\n<br/>\nBut letting her believe that we could really build a rocket ship to go visit her friend would be just plain cruel.<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Look at unschooling from a different angle","postDate":"1316450400","msgId":63013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1QUM3QzFBLTAwNUUtNDYzRS1BMTZDLTdGMzM3OTE1MjNCMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDY2RUNGQzA0LUQyRUMtNERDNy1CMTRCLUM5REI0RTAwOEExNkB5YWhvby5jb20+","referencesHeader":"PDQ1MzMwNTYyLTg1QzMtNDAyMi04ODA0LURGNkZGMDIxRjE3MkBTYW5kcmFkb2RkLmNvbT4gPDY2RUNGQzA0LUQyRUMtNERDNy1CMTRCLUM5REI0RTAwOEExNkB5YWhvby5jb20+"},"prevInTopic":63011,"nextInTopic":63019,"prevInTime":63012,"nextInTime":63014,"topicId":63007,"numMessagesInTopic":0,"msgSnippet":"-=-I apologize again for using extreme language. There is no excuse. -=- There s a reason, and it s not even an excuse.  I m not asking you not to every say","messageBody":"<div id=\"ygrps-yiv-2147309738\">-=-I apologize again for using extreme language. There is no excuse. -=-<br/>\n<br/>\nThere&#39;s a reason, and it&#39;s not even an excuse.  I&#39;m not asking you not to every say that on this list, I&#39;m asking you to look at why you thought it.  You DID think it.  You formed the phrase and typed it, and then decided to send it.  That&#39;s several layers from it being accidental. <br/>\n<br/>\nSo if your thinking is that you should never limit anything, unschooling isn&#39;t going to work very well, because your kids might be bummed that you promised them a limitless life you can&#39;t deliver.<br/>\n<br/>\nJust because a child wants to build a hovercraft (a real one, to ride on, as someone once said her child wanted) and another wants to build a brick shop of real bricks, doesn&#39;t mean the mother is obligated to say &quot;Okay,&quot; and to try to do it.  Some things aren&#39;t doable by a kid, nor even by an adult.  A rocket ship to ride in; not happenin&#39;, but they could watch The Astronaut Farmer.   A bridge over the Rio Grande?  Even if one owns the land on both sides, it&#39;s a big damned deal.  Maybe rope and planks, MAYBE, but maybe the county or state would want to have an opinion, and certainly whoever&#39;s carrying that family&#39;s home liability insurance will, too.<br/>\n<br/>\nBut those would not be a parent arbitrarily saying &quot;no.&quot;  I would say no just as quick to a friend or my husband, or at least ask them those kinds of questions.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Look at unschooling from a different angle","postDate":"1316449888","msgId":63011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFGQTlFREY0LThBNDEtNEI0My1CRDZELURDQURCOTM5RDQzNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFFNDU5ODE0LTJCMTktNDBGNi04RDk0LTk4QkVCMzI3N0U0OUB5YWhvby5jb20+","referencesHeader":"PDQ1MzMwNTYyLTg1QzMtNDAyMi04ODA0LURGNkZGMDIxRjE3MkBTYW5kcmFkb2RkLmNvbT4gPDE0OTQzODY1LTY1OUYtNDhDOS1CNzM2LTlFNkMzMTdCNzYwREBTYW5kcmFkb2RkLmNvbT4gPEFFNDU5ODE0LTJCMTktNDBGNi04RDk0LTk4QkVCMzI3N0U0OUB5YWhvby5jb20+"},"prevInTopic":63010,"nextInTopic":63013,"prevInTime":63010,"nextInTime":63012,"topicId":63007,"numMessagesInTopic":0,"msgSnippet":"-=-Meaning if my son decided to go back to school at some point, he would no longer be an unschooler, would it be ok if he (we) were part of the unschooling","messageBody":"<div id=\"ygrps-yiv-1023939339\">-=-Meaning if my son decided to go back to school at some point, he would no longer be an unschooler, would it be ok if he (we) were part of the unschooling community (local groups, going to conferences, events, online gaming, this list and others). -=-<br/>\n<br/>\nThat&#39;s quite case-by-case, but I would question the purpose and need to meet with local groups or go to conferences if he decides to go back to school.   Not &quot;I would question&quot; you at the door, but I&#39;d wonder (or hope you wondered) why you would want to go to an unschooling conference.<br/>\n<br/>\nAs to online gaming and events, that might have to do with friendships and scheduling more than anything else.  Each list or game or guild or event has an organizer, so it would be better to talk to him or her.  But once you&#39;re in a WOW guild, unless you agreed you were an unschooler and would continue to be, I don&#39;t understand why you would wonder.  But if they meet &quot;during school hours&quot; (because for them it&#39;s not an issue), I think it would be uncool to ask them to change that to accommodate a school schedule.<br/>\n<br/>\nThis list is for discussing unschooling in a serious way, and nobody has to sign a statement of faith (that&#39;s kind of a joke) to get in or stay in, they just need not to be disruptive.  This week the primary disruption has been attempts to get us to extend the definition of unschooling a long long way from the focal point.<br/>\n<br/>\nAs to conferences, there is an assumption that the families there are unschoolers.  There is the reality that at any one time, there are families that are new to unschooling, and sometimes their kids are not good examples of unschooling.  How could they be, if they&#39;re not?  But people are there looking around at families to see how unschooling can be.  If some of the families they see are not unschoolers, that can be explained.  If more and more to &quot;a lot&quot; of families aren&#39;t, then one of the biggest benefits of the conference is diluted.<br/>\n<br/>\nWe were at a conference years ago and there was a boy whose mom had taken him out of school not long before.  He wasn&#39;t thrilled about it, and didn&#39;t want to be at that conference.  He was causing trouble for other kids and when my boys talked to him about it, asking him to stop, he threatened them physically.  If I hadn&#39;t been in a position to ask &quot;who the hell!?&quot; or to have confidence (because I knew WE were unschooling, and knew lots of unschoolers), that might have set me back or confused me.  <br/>\n<br/>\nSometimes when kids go to school they get harsh and defensive.  Sometimes they don&#39;t.  But I brought the example to say that lots of kids at conferences who aren&#39;t actually unschoolers can potentially devalue the conference itself.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":206447840,"authorName":"Dragonfly","from":"Dragonfly &lt;nalmeida12@...&gt;","profile":"nalmeida12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Look at unschooling from a different angle","postDate":"1316447594","msgId":63010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2RUNGQzA0LUQyRUMtNERDNy1CMTRCLUM5REI0RTAwOEExNkB5YWhvby5jb20+","inReplyToHeader":"PDQ1MzMwNTYyLTg1QzMtNDAyMi04ODA0LURGNkZGMDIxRjE3MkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ1MzMwNTYyLTg1QzMtNDAyMi04ODA0LURGNkZGMDIxRjE3MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63009,"nextInTopic":63011,"prevInTime":63009,"nextInTime":63011,"topicId":63007,"numMessagesInTopic":0,"msgSnippet":"Apologies Sandra and everyone else. When I read what I wrote, it is insanity. I have never read on this list that no limits should be set on ANYTHING.  What I","messageBody":"<div id=\"ygrps-yiv-185993606\">Apologies Sandra and everyone else. When I read what I wrote, it is insanity.  <br/>\n<br/>\nI have never read on this list that no limits should be set on ANYTHING.  What I have read is to be more open and don&#39;t automatically say no every time.  I have read not to set up arbitrary rules.  I have read that joy and harmony can be the result of successful unschooling. <br/>\n<br/>\nI apologize again for using extreme language. There is no excuse. <br/>\n<br/>\nNuria<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sep 19, 2011, at 10:47 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; This was posted in the &quot;My Apologies&quot; thread: <br/>\n&gt; <br/>\n&gt; &quot; I had been thinking of unschooling as a lifestyle, a way of parenting/ living. Like &#39;we don&#39;t set limits on anything and we don&#39;t automatically say no&#39; type of Unschoolers. And going back to school does not mean you lose access to the unschooling community necessarily.&quot;<br/>\n&gt; <br/>\n&gt; I&#39;ve brought it here to discuss the &quot;we don&#39;t set limits on anything&quot; point that leapt out and grabbed me by the hair.<br/>\n&gt; <br/>\n&gt; IF someone here has been told, or has read, &quot;We don&#39;t set limits on anything,&quot; didn&#39;t that sound insane to you? Please don&#39;t follow insanity. Please don&#39;t adopt ideas that sound crazy. Please don&#39;t attempt to live in a fantasy land (which WILL fail) and then blame unschoolers.<br/>\n&gt; <br/>\n&gt; Trying to unschool by doing what you think others are doing, or by ceasing to do what you used to do for reasons you don&#39;t quite get is not good for kids, it&#39;s not good for parents, families or relationships, and it&#39;s not good for unschooling, either. <br/>\n&gt; <br/>\n&gt; That brings me to this, which is from a facebook discussion that will probably be deleted (the original poster already said she&#39;s thinking of deleting it). I divided it into paragraphs. <br/>\n&gt; Teresa Honey Youngblood wrote:<br/>\n&gt; _____________________________________<br/>\n&gt; <br/>\n&gt; This maybe is a post for another thread, but the question has been brought up before just exactly what do experienced radical unschoolers owe to those who are exploring radical unschooling or who are new and floundering a bit. It&#39;s not acceptance and support, even though we sometimes expect that. Playing nice for the sake of playing nice doesn&#39;t make any of us better parents. Being challenged does.<br/>\n&gt; <br/>\n&gt; I think the best service experienced radical unschoolers can offer (and graciously do offer) to those of us who are new is to maintain the integrity of the philosophy, even to the point that it become social uncomfortable, using our questions and our specific circumstances as illustrative examples. <br/>\n&gt; <br/>\n&gt; This page was powerful for me when I was feeling uncomfortable at the beginning at letting my ideas about acceptable communication styles interfere with my getting the information I needed to be the parent I wanted to be :<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/doit\">http://sandradodd.com/doit</a><br/>\n&gt; <br/>\n&gt; _____________________________________<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":206447840,"authorName":"Dragonfly","from":"Dragonfly &lt;nalmeida12@...&gt;","profile":"nalmeida12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Look at unschooling from a different angle","postDate":"1316447047","msgId":63009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFNDU5ODE0LTJCMTktNDBGNi04RDk0LTk4QkVCMzI3N0U0OUB5YWhvby5jb20+","inReplyToHeader":"PDE0OTQzODY1LTY1OUYtNDhDOS1CNzM2LTlFNkMzMTdCNzYwREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ1MzMwNTYyLTg1QzMtNDAyMi04ODA0LURGNkZGMDIxRjE3MkBTYW5kcmFkb2RkLmNvbT4gPDE0OTQzODY1LTY1OUYtNDhDOS1CNzM2LTlFNkMzMTdCNzYwREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63008,"nextInTopic":63010,"prevInTime":63008,"nextInTime":63010,"topicId":63007,"numMessagesInTopic":0,"msgSnippet":"Meaning if my son decided to go back to school at some point, he would no longer be an unschooler, would it be ok if he (we)  were part of the unschooling","messageBody":"<div id=\"ygrps-yiv-770974002\">Meaning if my son decided to go back to school at some point, he would no longer be an unschooler, would it be ok if he (we)  were part of the unschooling community (local groups, going to conferences, events, online gaming, this list and others). I know no one can answer for everyone, but I would hope some of the unschooling community would still be open to us, especially once friendships have been established. Nuria<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sep 19, 2011, at 10:49 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; -=-&quot; I had been thinking of unschooling as a lifestyle, a way of parenting/ living. Like &#39;we don&#39;t set limits on anything and we don&#39;t automatically say no&#39; type of Unschoolers. And going back to school does not mean you lose access to the unschooling community necessarily.&quot;-=-<br/>\n&gt; <br/>\n&gt; &quot;Access to the unschooling community&quot; meaning what?<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Look at unschooling from a different angle","postDate":"1316443750","msgId":63008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OTQzODY1LTY1OUYtNDhDOS1CNzM2LTlFNkMzMTdCNzYwREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ1MzMwNTYyLTg1QzMtNDAyMi04ODA0LURGNkZGMDIxRjE3MkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ1MzMwNTYyLTg1QzMtNDAyMi04ODA0LURGNkZGMDIxRjE3MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63007,"nextInTopic":63009,"prevInTime":63007,"nextInTime":63009,"topicId":63007,"numMessagesInTopic":0,"msgSnippet":"-=- I had been thinking of unschooling as a lifestyle, a way of parenting/ living. Like we don t set limits on anything and we don t automatically say no","messageBody":"<div id=\"ygrps-yiv-616649167\">-=-&quot; I had been thinking of unschooling as a lifestyle, a way of parenting/ living. Like &#39;we don&#39;t set limits on anything and we don&#39;t automatically say no&#39; type of Unschoolers. And going back to school does not mean you lose access to the unschooling community necessarily.&quot;-=-<br/>\n<br/>\n&quot;Access to the unschooling community&quot; meaning what?<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Look at unschooling from a different angle","postDate":"1316443655","msgId":63007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MzMwNTYyLTg1QzMtNDAyMi04ODA0LURGNkZGMDIxRjE3MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":63008,"prevInTime":63006,"nextInTime":63008,"topicId":63007,"numMessagesInTopic":0,"msgSnippet":"This was posted in the My Apologies thread:  I had been thinking of unschooling as a lifestyle, a way of parenting/ living. Like we don t set limits on","messageBody":"<div id=\"ygrps-yiv-197455487\">This was posted in the &quot;My Apologies&quot; thread:   <br/>\n<br/>\n&quot; I had been thinking of unschooling as a lifestyle, a way of parenting/ living. Like &#39;we don&#39;t set limits on anything and we don&#39;t automatically say no&#39; type of Unschoolers. And going back to school does not mean you lose access to the unschooling community necessarily.&quot;<br/>\n<br/>\nI&#39;ve brought it here to discuss the &quot;we don&#39;t set limits on anything&quot; point that leapt out and grabbed me by the hair.<br/>\n<br/>\nIF someone here has been told, or has read, &quot;We don&#39;t set limits on anything,&quot; didn&#39;t that sound insane to you?  Please don&#39;t follow insanity.  Please don&#39;t adopt ideas that sound crazy.  Please don&#39;t attempt to live in a fantasy land (which WILL fail) and then blame unschoolers.<br/>\n<br/>\nTrying to unschool by doing what you think others are doing, or by ceasing to do what you used to do for reasons you don&#39;t quite get is not good for kids, it&#39;s not good for parents, families or relationships, and it&#39;s not good for unschooling, either.  <br/>\n<br/>\nThat brings me to this, which is from a facebook discussion that will probably be deleted (the original poster already said she&#39;s thinking of deleting it).  I divided it into paragraphs.  <br/>\nTeresa Honey Youngblood wrote:<br/>\n_____________________________________<br/>\n<br/>\nThis maybe is a post for another thread, but the question has been brought up before just exactly what do experienced radical unschoolers owe to those who are exploring radical unschooling or who are new and floundering a bit. It&#39;s not acceptance and support, even though we sometimes expect that. Playing nice for the sake of playing nice doesn&#39;t make any of us better parents. Being challenged does.<br/>\n<br/>\n I think the best service experienced radical unschoolers can offer (and graciously do offer) to those of us who are new is to maintain the integrity of the philosophy, even to the point that it become social uncomfortable, using our questions and our specific circumstances as illustrative examples. <br/>\n<br/>\nThis page was powerful for me when I was feeling uncomfortable at the beginning at letting my ideas about acceptable communication styles interfere with my getting the information I needed to be the parent I wanted to be :<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/doit\">http://sandradodd.com/doit</a><br/>\n<br/>\n_____________________________________<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":21078,"nextTopicId":62936}}