{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":20,"messages":[{"userId":240358028,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;foehn_jye@...&gt;","profile":"foehn_jye","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Intro and a Question","postDate":"1264114810","msgId":49867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYW05citlZm90QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA3QjQ5QkU3LURCN0ItNEFGMS05OTc4LTc0MkE2NTBBODVGQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49862,"nextInTopic":0,"prevInTime":49866,"nextInTime":49868,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"... Auntie was properly offended, in her very conventional manner. Thankfully, she didn t attempt to put them in a time-out!","messageBody":"<div id=\"ygrps-yiv-1418589216\"><blockquote><span title=\"ireply\">&gt; How did their aunt feel about it?   <br/>\n<br/>\n </span></blockquote>Auntie was properly offended, in her very conventional manner.<br/>\nThankfully, she didn&#39;t attempt to put them in a time-out!</div>","specialLinks":[]},{"userId":342163414,"authorName":"Chris Sanders","from":"Chris Sanders &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Newbie Intro and a Question","postDate":"1264112091","msgId":49862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0NjEwQTA2LTA0RjItNENBNS04MTcwLTFCNUVFRDQzRDQ1OUBnbWFpbC5jb20+","inReplyToHeader":"PGhqYWk5bitiNDZxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqYWk5bitiNDZxQGVHcm91cHMuY29tPg=="},"prevInTopic":49860,"nextInTopic":49867,"prevInTime":49861,"nextInTime":49863,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"... Early on, when I was trying to *get* unschooling, I tried real hard to imagine my little-girl-self in  whatever my child s situation was, and I considered","messageBody":"<div id=\"ygrps-yiv-1401424559\"><blockquote><span title=\"ireply\">&gt; I also think I needed to hear what Schuyler said about moments of  <br/>\n&gt; care making up a happy childhood<br/>\n<br/>\n </span></blockquote>Early on, when I was trying to *get* unschooling, I tried real hard to  <br/>\nimagine my little-girl-self in  whatever my child&#39;s situation was, and  <br/>\nI considered how I might have felt if my mom had reacted to me very  <br/>\nsweetly and generously. My little-girl-self always felt happy and well- <br/>\nloved, so I knew that was the right way to react to my kids.<br/>\n<br/>\nChris<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Newbie Intro and a Question","postDate":"1264111714","msgId":49860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3QjQ5QkU3LURCN0ItNEFGMS05OTc4LTc0MkE2NTBBODVGQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqYWZlNisxOG92QGVHcm91cHMuY29tPg==","referencesHeader":"PGhqYWZlNisxOG92QGVHcm91cHMuY29tPg=="},"prevInTopic":49859,"nextInTopic":49862,"prevInTime":49859,"nextInTime":49861,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"-=-Apparently at this attempt to bribe, my oldest looked her Aunt square in the eye and said, Oh come on, Auntie, you CANNOT bribe her to use the toilet. What","messageBody":"<div id=\"ygrps-yiv-100795076\">-=-Apparently at this attempt to bribe, my oldest looked her Aunt  <br/>\nsquare in the eye and said, &quot;Oh come on, Auntie, you CANNOT bribe her  <br/>\nto use the toilet. What do you think she&#39;s gonna do, get a sundae  <br/>\nevery time she goes poop?&quot; When my daughter relayed the story to me I  <br/>\nwas thoroughly overjoyed. -=-<br/>\n<br/>\nHow did their aunt feel about it?   It&#39;s a great story.<br/>\n<br/>\nWe were on our way to a homeschooling conference in Arizona, with  <br/>\nsomeone who wasn&#39;t around unschooling, who was very conventionally  <br/>\nschooled, prep school and fancy university.  He asked Holly, in the  <br/>\nmountains of Arizona, to figure out something about the miles and the  <br/>\ngasoline.  She asked politely and calmly whether he needed to know, or  <br/>\nwhether he just wanted to know whether she could calculate it.  I  <br/>\ndon&#39;t know the exact words.  He was surprised, but not offended.  More  <br/>\namused, and impressed.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":374014398,"authorName":"melissamariemichael","from":"&quot;melissamariemichael&quot; &lt;myatzeck@...&gt;","profile":"melissamariemichael","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Intro and a Question","postDate":"1264110711","msgId":49859,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYWk5bitiNDZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49855,"nextInTopic":49860,"prevInTime":49858,"nextInTime":49860,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"Thanks *so much* for all of your feedback.  I am so glad I joined this list! Sandra, thanks for pointing out my use of the phrases doormat and overly","messageBody":"<div id=\"ygrps-yiv-1512166663\">Thanks *so much* for all of your feedback.  I am so glad I joined this list!  <br/>\n<br/>\nSandra, thanks for pointing out my use of the phrases &quot;doormat&quot; and &quot;overly permissive.&quot;  You are right  those aren&#39;t really my own words and I need to weed them out.  When you asked *what* exactly I was being overly permissive of, that really resonated with me.  I also like your point about agreeing to accompany your husband to the store or doctor or something  that totally makes sense to me.<br/>\n<br/>\nI also appreciated what Alex said about how some children feel love by little things like having their butts wiped.  I hadn&#39;t remembered until you said this, but sometimes when I asked Mary why she wanted me to wipe her butt, she replied, &quot;Because I love you!&quot;  I wish I could go back and say &quot;YES!&quot; for all of those times she asked and I refused, even though at the time I thought I was doing it in her best interests.  I don&#39;t remember the source, but some parenting advice I read or heard somewhere said that if your child is capable of doing something herself, you shouldn&#39;t do it for them because it&#39;s only doing them a disservice.  I see now how this doesn&#39;t make sense.<br/>\n<br/>\nI also think I needed to hear what Schuyler said about moments of care making up a happy childhood.  I&#39;m trying to live more &quot;in the moment,&quot; and saying yes more.  Not only does it make my kids feel good, it makes me feel good too!  Schuyler also said to remember that no matter how well she carries herself or how independent she seems, she&#39;s a 3 year old little girl.  I think that I, and my husband especially, need to work on this one.  Our Mary is actually quite independent and carries herself really well  she is very expressive verbally and was from a very early age (she could sing the ABC&#39;s at 18 months) and so sometimes that makes her seem older than she is. <br/>\n<br/>\nJoyce said that I should let her actions and requests be my guide to helping her rather than some &quot;should&quot; in my head.  I definitely think it was the &quot;shoulds&quot; in my head that prevented me from lovingly saying `Yes&#39; to butt wipe requests.  I&#39;m glad this list is here to help me get rid of those nagging voices.<br/>\n<br/>\nYesterday, Mary asked me on two occasions to help her go to the bathroom.  The first time was in the morning before I had read any of your responses.  I had talked to my husband about the situation earlier and he said we should refuse to help her so she would learn to do it herself.  So I said no.  And she decided that she didn&#39;t have to go to the bathroom anymore.  I didn&#39;t feel good about the whole thing.  A few hours later, she approached me in the kitchen and asked in the sweetest voice, &quot;Mom, will you please come with me to the bathroom?&quot;  I had read a lot of the responses at that point and changed my mind about how to handle it.  So I smiled and said &quot;Sure.&quot;  After she had finished she asked me to wipe her, so I smiled again and said, &quot;Okay,&quot; and did it.  She looked up at me with a huge smile and asked me why I was so happy today.  I know that we were both happier the second time, and it *felt* so much better, and so right.  In the past, sometimes I would say yes and sometimes I would say no, depending on which voices in my head I listened to  now I know I&#39;m tuning into the right ones!<br/>\n<br/>\nAfter that, we went in the kitchen and made hot chocolate and I let her put in as many marshmallows as she wanted.  I&#39;ve never even bought mini marshmallows before, much less let her have however many she wanted!  She dumped in so many there was almost more marshmallow than hot chocolate, but boy was she excited about the whole thing.  She spent a long time spooning them in and out, and stirring them around, and when all was said and done didn&#39;t actually EAT that many of them.  I know that if I would have said she could only have 5 or 10 or whatever, that she would have gobbled them up and begged for more and we would have had to have a huge negotiation about how many she could have.  This way was so much easier and so much happier, and I&#39;m almost certain she ate far less marshmallows than if I had imposed limits.<br/>\n<br/>\nSo thanks again for everything!  I know I still have areas I need to work on, but we&#39;re progressing, and that&#39;s good.</div>","specialLinks":[]},{"userId":93577737,"authorName":"gabihugs","from":"&quot;gabihugs&quot; &lt;gabihugs@...&gt;","profile":"gabihugs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Intro and a Question","postDate":"1264108876","msgId":49855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYWdnYytvaGVrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49851,"nextInTopic":49859,"prevInTime":49854,"nextInTime":49856,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"So many great responses! I am still trying to get my 3 1/2 yr old to use the toilet but apparently she isn t ready yet, will sometimes but mostly not. Don t","messageBody":"<div id=\"ygrps-yiv-2135330962\">So many great responses! I am still trying to get my 3 1/2 yr old to use the toilet but apparently she isn&#39;t ready yet, will sometimes but mostly not. Don&#39;t want to make a huge battle of it, my kids are always welcome during my toilet time (which bugs my hubby that I always leave the door open :), but he closes it when he&#39;s in there. I&#39;m sure part of it is being in a house full of girls. <br/>\n<br/>\nI am getting a little tired of diapers but figure they will be around for a while with one coming in April, the two year old not caring much, occasionally goes on the toilet. We try to have regular potty breaks, anyways going off topic, I say good for your daughter that she uses the toilet!<br/>\n<br/>\nGabi in NM<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;melissamariemichael&quot; &lt;myatzeck@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m new to the list and looking forward to participating - so here goes with the first post!<br/>\n&gt; <br/>\n&gt; My name is Melissa, my husband is Joe and we have two kids.  Mary is turning 4 next month, and Joey is almost 18 months.  I first read about unschooling a little over a year ago.  I immediately liked the idea of unschooling as applied to school, but the concept of radical unschooling as applied to bedtimes, food, etc. seemed strange and irresponsible to me.  Over the past year I&#39;ve been reading lots more (John Holt, John Taylor Gatto, Sandra&#39;s and Joyce&#39;s websites, etc.) and am finding myself being persuaded that it really does make sense and isn&#39;t nearly as weird or irresponsble as I originally thought.<br/>\n&gt; <br/>\n&gt; Some of the most common conflicts in our house with Mary revolved around bedtimes, food, and the all encompassing fault of &quot;not listening&quot; that so many parents lament.  Over the past couple of weeks we&#39;ve started to relax our control of bedtimes and food with really positive results.  So I am excited about that - it feels so much more peaceful and happy.  I am also working on saying YES more.  My husband is coming around as well - he hasn&#39;t done nearly as much reading as I have so I think he&#39;s still a little bit in the &quot;weird and irresponsble&quot; mindset, but we&#39;re progressing.<br/>\n&gt; <br/>\n&gt; Now for the question - one conflict that we continually have with Mary revolves around wiping when she goes to the bathroom.  She has been wearing underwear for years now, and is fully capable of going to the bathroom all by herself including undressing, washing her hands, the whole bit.  She actually does it on her own, happily, some of the time.  <br/>\n&gt; <br/>\n&gt; But other times she insists that someone come along with her to the bathroom, &quot;to watch,&quot; for company I guess.  But almost inevitably, when we go along to watch, she then insists that we wipe for her.  I&#39;ve asked her about it, and she says she doesn&#39;t want to wipe herself because then she&#39;ll get germs on her hands and she doesn&#39;t want to wash her hands.  I will tell her that I don&#39;t want to get germs on my hands and have to wash them either, and that it&#39;s her responsibility since she&#39;s going to the bathroom.  This whole bathroom situation results in tears and meltdowns about whether or not we should come along with her, and whether or not we should wipe rather frequently.  <br/>\n&gt; <br/>\n&gt; Sometimes I just give in and wipe her to avoid the messy conflict, and Joe says I need to stand fast and refuse to wipe her because she&#39;s getting the idea that she doesn&#39;t need to do it herself.  One of the things that is most frustrating for Joe and I is that this whole thing almost always happens right after we sit down to dinner.  Even if I give her gentle reminders to go to the bathroom before dinner, she&#39;ll say she doesn&#39;t have to go and then as soon as we sit down and start eating she&#39;ll suddenly *have* to go to the bathroom and then we have a struggle because we know that going along with her will probably take a while because, being 4, she dawdles and such, and then sometimes we have the whole struggle about whether we should go along and then whether we should wipe and then we all end up frustrated and with cold dinners.  I know that eating stimulates the digestive tract and probably is the cause of her sudden need to go after she starts eating, but I really wish she would just go by herself because I know that she can.  Because sometimes she does.<br/>\n&gt; <br/>\n&gt; I feel I should mention that she doesn&#39;t do a great job of wiping when she goes #2, and this has resulted in painful rashes on 2 occasions when she wiped by herself.  So we&#39;ve talked about that with her and why it happens, and now when she goes #2 we always check and make sure that she&#39;s cleaned off really well so she doesn&#39;t get a rash.  But we usually insist that she wipes first, and then we will check.  <br/>\n&gt; <br/>\n&gt; So, my question is, to all of you more experienced folks, how can I handle this situation better?  I&#39;m struggling with whether or not I should just wipe her whenever she asks, but my fear is that if I do that then I&#39;ll just be letting her walk all over me, and that she needs to learn that going to the bathroom and washing your hands is something everybody has to do, even if they don&#39;t want to.  I want to embrace the radical unschooling approach, but I also don&#39;t want to be a doormat to my kids and end up being an overly permissive parent.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":240358028,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;foehn_jye@...&gt;","profile":"foehn_jye","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Intro and a Question","postDate":"1264107782","msgId":49851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYWZlNisxOG92QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI0MkM2Mzk5LUQ1QkItNDIxMS1CQzM0LUREOTdGRDEyRTdGNkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49837,"nextInTopic":49855,"prevInTime":49850,"nextInTime":49852,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"All these responses have been so great to read...all this great potty talk! Meeting our kids needs often can be done in the smallest of ways, and has the","messageBody":"<div id=\"ygrps-yiv-973826365\">All these responses have been so great to read...all this great potty talk!<br/>\n<br/>\nMeeting our kids needs often can be done in the smallest of ways, and has the potential to bring astonishing outcomes.<br/>\n<br/>\nMy 4-year old daughter still likes to poop in diapers. She learned to use the potty when she was around 2.5, and she has both a little potty and plenty of big potties to choose from. For poop, she prefers diapers and she likes to go into our pantry, her &quot;little poop house&quot; as she calls it. When she was 3 she would tell me that when she turned 4 she would start pooping in the potty.  This was a statement she would make without any prompting from me; she just made it from time to time. On her 4th birthday she said, &quot;well, maybe I&#39;ll wait until I&#39;m 5.&quot;  Which is fine.  She&#39;s one of those people that only poops every couple days, and that&#39;s her norm, it always has been. I suspect if she was a person who pooped once a day or several times a day, the diapers would have become tiresome sooner. When she tells me she needs to poop, we make our way to the bathroom where we have all the diaper goods, and she lies down and the first thing she says is, &quot;I love you, Mommy.&quot; <br/>\n<br/>\nOne of the really neat things I had a chance to witness with regards to our honoring her choice to poop in diapers came from her big sister who is 7.  They had been spending day with their Auntie, a very conventional Mom, but whom they adore as they get &quot;spa days&quot; and have their hair and nails done.  Apparently my youngest felt the urge to go poop, so my sister-in-law tried encouraging her to use the toilet.  When my daughter refused, my sister-in-law started trying to bribe her with going downtown to the Haagen-Daaz and buying a huge ice cream sundae.  Apparently at this attempt to bribe, my oldest looked her Aunt square in the eye and said, &quot;Oh come on, Auntie, you CANNOT bribe her to use the toilet. What do you think she&#39;s gonna do, get a sundae every time she goes poop?&quot;  When my daughter relayed the story to me I was thoroughly overjoyed.</div>","specialLinks":[]},{"userId":352545834,"authorName":"tiffermom@comcast.net","from":"tiffermom@...","profile":"tiffermomof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264097459","msgId":49837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MTg3ODk2MzEuMTIzMjM4NzEyNjQwOTc0NTk2MTIuSmF2YU1haWwucm9vdEBzejAwMzlhLmVtZXJ5dmlsbGUuY2EubWFpbC5jb21jYXN0Lm5ldD4=","inReplyToHeader":"PEJMVTExNS1EUzNENzc4QzcyQzQxNDAxQTREMzExMkEzNjMwQHBoeC5nYmw+"},"prevInTopic":49826,"nextInTopic":49851,"prevInTime":49836,"nextInTime":49838,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"... potty too. It s never really bothered me although I know that conventional parenting wisdom suggests that I m supposed to be annoyed by this ( I never get","messageBody":"<div id=\"ygrps-yiv-1352751817\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;One or both of the bigger boys almost always keeps me company when I go <br/>\n </span></blockquote>potty too. It&#39;s never really bothered me although I know that conventional <br/>\nparenting wisdom suggests that I&#39;m supposed to be annoyed by this (&quot;I never <br/>\nget a break from the kids, not even to go to the bathroom, blah blah blah.&quot;)&lt;&lt;&lt;&lt; <br/>\n<br/>\nThis is so funny. I always &quot;kept my Mom company&quot; in the bathroom. I HATE to be alone. So I kept her company all the time. I would stop what I was doing so she wouldn&#39;t have to go to the store by herself. She loved to be alone sometimes she would get up extra early in the morning to get her peace and quiet. My Mom never made me feel unwelcome. When I was a teen she finally told me that she liked going to the store by herself. My Mom would have made a great unschooler. <br/>\n<br/>\nMy kids also come in to talk while I am in the bathroom.LOL <br/>\n<br/>\nTiffani <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;pamela kaplan&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamelalucinda@...\">pamelalucinda@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Wednesday, January 20, 2010 6:09:36 PM GMT -08:00 US/Canada Pacific <br/>\nSubject: RE: [AlwaysLearning] Newbie Intro and a Question <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nMy 3 & 4 yr olds both need to have grown-up company every time they use the <br/>\ntoilet. Sometimes it&#39;s an inconvenient time for me, but I do it anyhow, and <br/>\nas sweetly as possible - to me there&#39;s no point making us all miserable. <br/>\nThey need what they need, when they need it, and being cranky isn&#39;t going to <br/>\nmake them need it any less. But usually it&#39;s just a matter of shifting my <br/>\ngears, which is what I do all day anyhow, as a mama who values being attuned <br/>\nto my little ones&#39; needs. (As if on cue, my 3 yr old just announced <br/>\n&quot;Pooooooop!&quot; I was typing an email, feeding the baby, so half-fed-baby & I <br/>\nwent to the bathroom, helped big brother, let the cold, forgotten dog back <br/>\nindoors, and everyone is significantly more comfortable now. ) <br/>\n<br/>\nOne or both of the bigger boys almost always keeps me company when I go <br/>\npotty too. It&#39;s never really bothered me although I know that conventional <br/>\nparenting wisdom suggests that I&#39;m supposed to be annoyed by this (&quot;I never <br/>\nget a break from the kids, not even to go to the bathroom, blah blah blah.&quot;) <br/>\nAnd then the other day my 3 yr old said something amazing. He told me that <br/>\nhe stops playing and keeps me company in the bathroom because he doesn&#39;t <br/>\nwant me to feel lonely, or scared, that he loves my company, and he knows I <br/>\nlove his too. What sweetness!!! What a gift I&#39;m evidently giving him, <br/>\nand what a gift he&#39;s giving me. <br/>\n<br/>\nI&#39;m not an experienced unschooler. but I would say just wipe your daughter&#39;s <br/>\nbottom, kindly & gently. Keep her company. Let go of the struggle. Give her <br/>\nthat gift. <br/>\n<br/>\n~pamela k <br/>\n<br/>\n[Non-text portions of this message have been removed] <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":401668605,"authorName":"pamela kaplan","from":"&quot;pamela kaplan&quot; &lt;pamelalucinda@...&gt;","profile":"pamelalucinda","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264039776","msgId":49826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTExNS1EUzNENzc4QzcyQzQxNDAxQTREMzExMkEzNjMwQHBoeC5nYmw+","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49820,"nextInTopic":49837,"prevInTime":49825,"nextInTime":49827,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"My 3 & 4 yr olds both need to have grown-up company every time they use the toilet.  Sometimes it s an inconvenient time for me, but I do it anyhow, and as","messageBody":"<div id=\"ygrps-yiv-1264673111\">My 3 & 4 yr olds both need to have grown-up company every time they use the<br/>\ntoilet.  Sometimes it&#39;s an inconvenient time for me, but I do it anyhow, and<br/>\nas sweetly as possible - to me there&#39;s no point making us all miserable.<br/>\nThey need what they need, when they need it, and being cranky isn&#39;t going to<br/>\nmake them need it any less.  But usually it&#39;s just a matter of shifting my<br/>\ngears, which is what I do all day anyhow, as a mama who values being attuned<br/>\nto my little ones&#39; needs.  (As if on cue, my 3 yr old just announced<br/>\n&quot;Pooooooop!&quot;  I was typing an email, feeding the baby, so half-fed-baby & I<br/>\nwent to the bathroom, helped big brother, let the cold, forgotten dog back<br/>\nindoors, and everyone is significantly more comfortable now. )<br/>\n<br/>\nOne or both of the bigger boys almost always keeps me company when I go<br/>\npotty too.  It&#39;s never really bothered me although I know that conventional<br/>\nparenting wisdom suggests that I&#39;m supposed to be annoyed by this (&quot;I never<br/>\nget a break from the kids, not even to go to the bathroom, blah blah blah.&quot;)<br/>\nAnd then the other day my 3 yr old said something amazing.  He told me that<br/>\nhe stops playing and keeps me company in the bathroom because he doesn&#39;t<br/>\nwant me to feel lonely, or scared, that he loves my company, and he knows I<br/>\nlove his too.  What  sweetness!!!  What a gift I&#39;m evidently  giving him,<br/>\nand what a gift he&#39;s giving me.<br/>\n<br/>\nI&#39;m not an experienced unschooler. but I would say just wipe your daughter&#39;s<br/>\nbottom, kindly & gently.  Keep her company. Let go of the struggle. Give her<br/>\nthat gift.<br/>\n<br/>\n~pamela k<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Newbie Intro and a Question","postDate":"1264033649","msgId":49820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MTAwMTIwMTYyN2oyNWU1ZGMxOGc4MmFjYTE4MWU5YjFlOWY0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhqN2ljaisydGR0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPiA8aGo3aWNqKzJ0ZHRAZUdyb3Vwcy5jb20+"},"prevInTopic":49817,"nextInTopic":49826,"prevInTime":49819,"nextInTime":49821,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"... I miss our pooping talks! I went through times of resentment, though I was always quickly snapped back to appreciation for the intimacy of the moment. ","messageBody":"<div id=\"ygrps-yiv-2080643848\">On Wed, Jan 20, 2010 at 10:34 AM, NCMama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dharmamama1@...\">dharmamama1@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; ~~~So, my question is, to all of you more experienced folks, how can I<br/>\n&gt; handle this situation better? I&#39;m struggling with whether or not I should<br/>\n&gt; just wipe her whenever she asks, but my fear is that if I do that then I&#39;ll<br/>\n&gt; just be letting her walk all over me, and that she needs to learn that going<br/>\n&gt; to the bathroom and washing your hands is something everybody has to do,<br/>\n&gt; even if they don&#39;t want to. I want to embrace the radical unschooling<br/>\n&gt; approach, but I also don&#39;t want to be a doormat to my kids and end up being<br/>\n&gt; an overly permissive parent.~~~<br/>\n&gt;<br/>\n&gt; I went through that! But my youngest was 6... before that, I thought, &quot;If<br/>\n&gt; he doesn&#39;t do it well, it makes more work for me with the laundry! It makes<br/>\n&gt; sense for me to do it.&quot; For some reason, when he turned 6, I thought, &quot;He<br/>\n&gt; should be doing this!&quot; I actually told him, before his birthday, &quot;When you<br/>\n&gt; turn 6, I think you should start wiping your own bottom.&quot; Now I think, WTF?<br/>\n&gt; Why six? How random! But there it was.<br/>\n&gt;<br/>\n&gt; He only wiped his own bottom a couple of times - he asked for help each<br/>\n&gt; time, and I&#39;d dutifully remind him, &quot;That&#39;s your job, now!&quot; But I paid<br/>\n&gt; attention to how it made me feel. I felt as if I had won. I felt separate<br/>\n&gt; from him. I felt a little mean. Paying attention to that, I started wiping<br/>\n&gt; him again. I didn&#39;t make a big production out of it, I just said &quot;yes&quot;. I<br/>\n&gt; bought the wet wipes that are safe for toilets to make it easier. I tickled<br/>\n&gt; him a little, sometimes, on his back, to make him laugh. It became a sweet<br/>\n&gt; time for both of us... sometimes stinky, but sweet!<br/>\n&gt;<br/>\n&gt; When he was around 7, he asked less and less, until he didn&#39;t ask any more.<br/>\n&gt; He&#39;s almost 11 now, and he hasn&#39;t asked for help in years.<br/>\n&gt;<br/>\n&gt; He wasn&#39;t walking all over me, we were partners. Partners in getting a<br/>\n&gt; clean bottom! I&#39;m grateful now to have not insisted on my very arbitrary<br/>\n&gt; limit of being 6-years-old.<br/>\n&gt;<br/>\n&gt; Caren<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I miss our pooping talks! I went through times of resentment, though I was<br/>\nalways quickly snapped back to appreciation for the intimacy of the moment.<br/>\nEarly in my parenting career, a mother of a 4 year old lamented the loss of<br/>\ndiaper-change intimacy and her voice has remained in my head, bringing me<br/>\nback to gratitude.  Intimacy at it&#39;s most pure and innocent.<br/>\nSince moving and remaining in a place of love and acceptance, I&#39;ve met lots<br/>\nof other moms who hang out with their kids in the bathroom. We can talk<br/>\nabout this job as the honor it is and inspire one another to appreciate this<br/>\nbrief stage of life.  I&#39;m now the mom who talks through the door, or the<br/>\ncabinet that opens from the bathroom to his room (funny old house!), and<br/>\nwonders if my future daughter in law will be okay with his tendency to talk<br/>\nwhile pooping... ::::vbg:::<br/>\nAnd don&#39;t forget these children may someday have to change YOUR diapers or<br/>\nwipe YOUR bottom, long after you&#39;ve mastered the skill. How would you like<br/>\nher to respond to your elderly self?  This thought inspired us to use warm<br/>\ncotton wash cloths on our kids - no hippie green reason, no - purely<br/>\ninvestment in our future butt wipes :D<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.wordpress.com<br/>\nhannahsashes.blogspot.com<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264031096","msgId":49817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0MkM2Mzk5LUQ1QkItNDIxMS1CQzM0LUREOTdGRDEyRTdGNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDYxNzRCNjk2LTFCQTItNEExMi05OUE5LTA5QTU3NURGMDQwQ0B2ZXJpem9uLm5ldD4=","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPiA8OTE1ODAxLjk5ODEzLnFtQHdlYjExMDQxMS5tYWlsLmdxMS55YWhvby5jb20+IDw2MTc0QjY5Ni0xQkEyLTRBMTItOTlBOS0wOUE1NzVERjA0MENAdmVyaXpvbi5uZXQ+"},"prevInTopic":49816,"nextInTopic":49820,"prevInTime":49816,"nextInTime":49818,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"-=- it means you are helping her do something that she is clearly ... -=-And this is good advice throughout her life. If she can t or won t do something,","messageBody":"<div id=\"ygrps-yiv-1656507634\">-=-&gt; it means you are helping her do something that she is clearly<br/>\n<blockquote><span title=\"ireply\">  &gt; needing help with.<br/>\n<br/>\n </span></blockquote>-=-And this is good advice throughout her life. If she can&#39;t or won&#39;t do<br/>\nsomething, trust her. She&#39;s asking for a reason. You may not be able<br/>\nto fathom the reason. It may be because it makes her feel loved.-=-<br/>\n<br/>\nI&#39;ve just returned from two hours at Motor Vehicles, with Marty,  <br/>\ngetting a 21-year-old license.<br/>\n<br/>\nHe just wanted me to go with him, so I did.  There was an elderly lady  <br/>\nthere whose grown son had come in with her.  He was dressed as a chef  <br/>\nof some sort, and without the hat I can&#39;t say, but he was a restaurant  <br/>\nworker who had taken off time to help his mom.<br/>\n<br/>\nI&#39;m hoping that when I&#39;m older and just want one of my kids to go with  <br/>\nme to an appointment or government office that they will.  I&#39;m  <br/>\ninvesting in my future.  But I&#39;m also just continuing what I started  <br/>\nwith Marty 21 years ago, which was that if he wanted me help, I would  <br/>\nhelp him.  There have been many things about which he didn&#39;t need my  <br/>\nhelp.  He took care of his own braces very well, and went to most of  <br/>\nthe appointments without me.  I don&#39;t always know in advance when he  <br/>\nwill want my help and when he won&#39;t, and it&#39;s not a big deal either way.<br/>\n<br/>\nIf my husband wants me to go with him to the store or the doctor or  <br/>\nsomething, I&#39;ll go too.  If he doesn&#39;t want me to, that&#39;s just as okay.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Intro and a Question","postDate":"1264025122","msgId":49816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqN3VuMit2dDE2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49813,"nextInTopic":49817,"prevInTime":49815,"nextInTime":49817,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"I also have a 4 year old who usually doesn t wipe herself.  She knows how, but she prefers that we do it for her.  I m not concerned.  I know quite a few","messageBody":"<div id=\"ygrps-yiv-441377856\">I also have a 4 year old who usually doesn&#39;t wipe herself.  She knows how, but she prefers that we do it for her.  I&#39;m not concerned.  I know quite a few people who&#39;s 4 year olds are still in diapers.  I&#39;m quite confident that wiping her butt at 4 does not mean that I&#39;ll be wiping it at 10 or 12 or 15.  I know someone who wiped her son until he was 8.  He&#39;s now 21, has a job, has moved away from home and presumably wipes his own butt.  ;)  <br/>\n<br/>\nEmily  <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;melissamariemichael&quot; &lt;myatzeck@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m new to the list and looking forward to participating - so here goes with the first post!<br/>\n&gt; <br/>\n&gt; My name is Melissa, my husband is Joe and we have two kids.  Mary is turning 4 next month, and Joey is almost 18 months.  I first read about unschooling a little over a year ago.  I immediately liked the idea of unschooling as applied to school, but the concept of radical unschooling as applied to bedtimes, food, etc. seemed strange and irresponsible to me.  Over the past year I&#39;ve been reading lots more (John Holt, John Taylor Gatto, Sandra&#39;s and Joyce&#39;s websites, etc.) and am finding myself being persuaded that it really does make sense and isn&#39;t nearly as weird or irresponsble as I originally thought.<br/>\n&gt; <br/>\n&gt; Some of the most common conflicts in our house with Mary revolved around bedtimes, food, and the all encompassing fault of &quot;not listening&quot; that so many parents lament.  Over the past couple of weeks we&#39;ve started to relax our control of bedtimes and food with really positive results.  So I am excited about that - it feels so much more peaceful and happy.  I am also working on saying YES more.  My husband is coming around as well - he hasn&#39;t done nearly as much reading as I have so I think he&#39;s still a little bit in the &quot;weird and irresponsble&quot; mindset, but we&#39;re progressing.<br/>\n&gt; <br/>\n&gt; Now for the question - one conflict that we continually have with Mary revolves around wiping when she goes to the bathroom.  She has been wearing underwear for years now, and is fully capable of going to the bathroom all by herself including undressing, washing her hands, the whole bit.  She actually does it on her own, happily, some of the time.  <br/>\n&gt; <br/>\n&gt; But other times she insists that someone come along with her to the bathroom, &quot;to watch,&quot; for company I guess.  But almost inevitably, when we go along to watch, she then insists that we wipe for her.  I&#39;ve asked her about it, and she says she doesn&#39;t want to wipe herself because then she&#39;ll get germs on her hands and she doesn&#39;t want to wash her hands.  I will tell her that I don&#39;t want to get germs on my hands and have to wash them either, and that it&#39;s her responsibility since she&#39;s going to the bathroom.  This whole bathroom situation results in tears and meltdowns about whether or not we should come along with her, and whether or not we should wipe rather frequently.  <br/>\n&gt; <br/>\n&gt; Sometimes I just give in and wipe her to avoid the messy conflict, and Joe says I need to stand fast and refuse to wipe her because she&#39;s getting the idea that she doesn&#39;t need to do it herself.  One of the things that is most frustrating for Joe and I is that this whole thing almost always happens right after we sit down to dinner.  Even if I give her gentle reminders to go to the bathroom before dinner, she&#39;ll say she doesn&#39;t have to go and then as soon as we sit down and start eating she&#39;ll suddenly *have* to go to the bathroom and then we have a struggle because we know that going along with her will probably take a while because, being 4, she dawdles and such, and then sometimes we have the whole struggle about whether we should go along and then whether we should wipe and then we all end up frustrated and with cold dinners.  I know that eating stimulates the digestive tract and probably is the cause of her sudden need to go after she starts eating, but I really wish she would just go by herself because I know that she can.  Because sometimes she does.<br/>\n&gt; <br/>\n&gt; I feel I should mention that she doesn&#39;t do a great job of wiping when she goes #2, and this has resulted in painful rashes on 2 occasions when she wiped by herself.  So we&#39;ve talked about that with her and why it happens, and now when she goes #2 we always check and make sure that she&#39;s cleaned off really well so she doesn&#39;t get a rash.  But we usually insist that she wipes first, and then we will check.  <br/>\n&gt; <br/>\n&gt; So, my question is, to all of you more experienced folks, how can I handle this situation better?  I&#39;m struggling with whether or not I should just wipe her whenever she asks, but my fear is that if I do that then I&#39;ll just be letting her walk all over me, and that she needs to learn that going to the bathroom and washing your hands is something everybody has to do, even if they don&#39;t want to.  I want to embrace the radical unschooling approach, but I also don&#39;t want to be a doormat to my kids and end up being an overly permissive parent.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264022715","msgId":49813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxNzRCNjk2LTFCQTItNEExMi05OUE5LTA5QTU3NURGMDQwQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDkxNTgwMS45OTgxMy5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPiA8OTE1ODAxLjk5ODEzLnFtQHdlYjExMDQxMS5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49812,"nextInTopic":49816,"prevInTime":49812,"nextInTime":49814,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"... And this is good advice throughout her life. If she can t or won t do something, trust her. She s asking for a reason. You may not be able to fathom the","messageBody":"<div id=\"ygrps-yiv-1186229788\">On Jan 20, 2010, at 3:59 PM, Jenny Cyphers wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; it means you are helping her do something that she is clearly  <br/>\n&gt; needing help with.<br/>\n<br/>\n </span></blockquote>And this is good advice throughout her life. If she can&#39;t or won&#39;t do  <br/>\nsomething, trust her. She&#39;s asking for a reason. You may not be able  <br/>\nto fathom the reason. It may be because it makes her feel loved. It  <br/>\nmay be something else. But let her actions and requests be your guide  <br/>\nto helping her rather than some &quot;should&quot; in your head.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264021145","msgId":49812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxNTgwMS45OTgxMy5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49810,"nextInTopic":49813,"prevInTime":49811,"nextInTime":49813,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"***So, my question is, to all of you more experienced folks, how can I handle this situation better? I m struggling with whether or not I should just wipe her","messageBody":"<div id=\"ygrps-yiv-21857451\">***So, my question is, to all of you more experienced folks, how can I handle this situation better? I&#39;m struggling with whether or not I should just wipe her whenever she asks, but my fear is that if I do that then I&#39;ll just be letting her walk all over me, and that she needs to learn that going to the bathroom and washing your hands is something everybody has to do, even if they don&#39;t want to. I want to embrace the radical unschooling approach, but I also don&#39;t want to be a doormat to my kids and end up being an overly permissive parent.***<br/>\n<br/>\nNot everyone can and does go to the bathroom, wipe themselves, and wash their hands.  Some kids reach adulthood in diapers and wheel chairs.  Some people end up with bags that are strapped to the outside of their bodies that need to be emptied when full.<br/>\n<br/>\nYes, you should wipe her when she asks.  It doesn&#39;t mean you will be a doormat, it means you are helping her do something that she is clearly needing help with.  Do that until she clearly doesn&#39;t need help anymore.  If dinner time toileting is an issue, I&#39;d go in before sitting down at the dinner table and dawddle a bit while in there, maybe ask her to just give it a try, run water to help.  Then wash hands together, whether she wipes or you wipe, since it&#39;s good to wash hands before eating anyway.<br/>\n<br/>\nI do understand how frustrating it can be.  My youngest is 8 and she still won&#39;t use the bathroom by herself and will only sometimes wipe herself.  Sometimes it&#39;s very inconvenient.  Sometimes I wish she&#39;d just go if she needs to go without needing to involve me everytime.  When I feel that irritation, I take a deep breath and go and be with her in the way she needs me to.  Sometimes I will say, if you need to go, don&#39;t wait for me, I&#39;ll be in as soon as I can, and I get in there as soon as I can.  At night time that never works, she would wet herself before going into a dark bathroom by herself.<br/>\n<br/>\nI&#39;ll let you know when she stops needing help!  It could be next week, or it could be a year from now.  When both my husband and I are away and her older sister is here watching her, she is very independent about going to the bathroom.  The last time she tried to stay the night at someone&#39;s house though, we had to come and get her at 1am, and it was solely because she needed to poop and needed mom or dad to help with that.  We didn&#39;t know that until we got her home.<br/>\n<br/>\nThe worst thing that we could do is make her feel bad about it.  Both her dad and I have experienced frustration in this regard, but we find ways to support each other.  If I&#39;m frustrated, he steps in and takes care of it, and vice versa.  He&#39;s honestly better about it than I am, it is definitely one of the few &quot;ugh&quot; triggers that I have in regards to parenting.  He&#39;s much more able to just go and do and be on this thing of toileting!<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264019221","msgId":49810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4MDkzNC43ODM2NS5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDIyNDUwNC4xODMxOS5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPiA8MjI0NTA0LjE4MzE5LnFtQHdlYjg2MjAzLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":49807,"nextInTopic":49812,"prevInTime":49809,"nextInTime":49811,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"Sorry, wishful writing: They are going to be here forever. should read as They aren t going to be here forever. Schuyler [Non-text portions of this message","messageBody":"<div id=\"ygrps-yiv-166696482\">Sorry, wishful writing:<br/>\n &quot;They are going to be here forever.&quot; should read as &quot;They aren&#39;t going to be here forever.&quot;<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264016283","msgId":49807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyNDUwNC4xODMxOS5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49800,"nextInTopic":49810,"prevInTime":49806,"nextInTime":49808,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"She s 3 years old. Sometimes when you have an 18 month old to compare with, 3 almost 4 seems mature. But it isn t. No matter how well she carries herself or","messageBody":"<div id=\"ygrps-yiv-1672055547\">She&#39;s 3 years old. Sometimes when you have an 18 month old to compare with, 3 almost 4 seems mature. But it isn&#39;t. No matter how well she carries herself or how independent she seems, she&#39;s a 3 year old little girl. My son wasn&#39;t out of diapers until almost 4, wiping his butt was just part of the deal. My daughter liked having me wipe her butt until she was 8. She knew how. She was perfectly capable, but she liked that moment of care. <br/>\n<br/>\nMoments of care make up a happy childhood. Lots of little moments of helping and saying yes and doing for, those things are really important pieces of a loving parent-child relationship. Because those moments are a big part of our days, a big part of our lives, moments of lying in bed together and giggling and telling stories, moments of getting ice in a soda, moments of getting a platter of different things to eat, moments of running to the store to get the one thing that would make them smile, they listen to me and they talk to me and they give back to me. <br/>\n<br/>\nI&#39;m not walked all over. Sometimes I&#39;m taken for granted. But that&#39;s alright. Sometimes I take my husband for granted. Heck, sometimes I take my kids for granted. They are going to be here forever. Hopefully it will be because they have grown up and moved out and into their own lives with other people. But it could be something horrible that takes them out of my life or me out of theirs. And I want all the memories to be good and loving and generous. And when they aren&#39;t, I want them or me to know that we were always trying to be the best we could, trying to move forward into better moments. <br/>\n<br/>\nWipe her butt because she&#39;s your 3 year old little girl who wants to have her butt wiped. Wipe her butt and think about how much you love her. Wipe her butt and know how much it means to her that you do this gentle act of kindness and consideration. Wipe her butt and enjoy that she wants you with her. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: melissamariemichael &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:myatzeck@...\">myatzeck@...</a>&gt;<br/>\n<br/>\n<br/>\nNow for the question - one conflict that we continually have with Mary revolves around wiping when she goes to the bathroom.  She has been wearing underwear for years now, and is fully capable of going to the bathroom all by herself including undressing, washing her hands, the whole bit.  She actually does it on her own, happily, some of the time.  <br/>\n<br/>\nBut other times she insists that someone come along with her to the bathroom, &quot;to watch,&quot; for company I guess.  But almost inevitably, when we go along to watch, she then insists that we wipe for her.  I&#39;ve asked her about it, and she says she doesn&#39;t want to wipe herself because then she&#39;ll get germs on her hands and she doesn&#39;t want to wash her hands.  I will tell her that I don&#39;t want to get germs on my hands and have to wash them either, and that it&#39;s her responsibility since she&#39;s going to the bathroom.  This whole bathroom situation results in tears and meltdowns about whether or not we should come along with her, and whether or not we should wipe rather frequently.  <br/>\n<br/>\nSometimes I just give in and wipe her to avoid the messy conflict, and Joe says I need to stand fast and refuse to wipe her because she&#39;s getting the idea that she doesn&#39;t need to do it herself.  One of the things that is most frustrating for Joe and I is that this whole thing almost always happens right after we sit down to dinner.  Even if I give her gentle reminders to go to the bathroom before dinner, she&#39;ll say she doesn&#39;t have to go and then as soon as we sit down and start eating she&#39;ll suddenly *have* to go to the bathroom and then we have a struggle because we know that going along with her will probably take a while because, being 4, she dawdles and such, and then sometimes we have the whole struggle about whether we should go along and then whether we should wipe and then we all end up frustrated and with cold dinners.  I know that eating stimulates the digestive tract and probably is the cause of her sudden need to go after she starts eating,<br/>\n but I really wish she would just go by herself because I know that she can.  Because sometimes she does.<br/>\n<br/>\nI feel I should mention that she doesn&#39;t do a great job of wiping when she goes #2, and this has resulted in painful rashes on 2 occasions when she wiped by herself.  So we&#39;ve talked about that with her and why it happens, and now when she goes #2 we always check and make sure that she&#39;s cleaned off really well so she doesn&#39;t get a rash.  But we usually insist that she wipes first, and then we will check.  <br/>\n<br/>\nSo, my question is, to all of you more experienced folks, how can I handle this situation better?  I&#39;m struggling with whether or not I should just wipe her whenever she asks, but my fear is that if I do that then I&#39;ll just be letting her walk all over me, and that she needs to learn that going to the bathroom and washing your hands is something everybody has to do, even if they don&#39;t want to.  I want to embrace the radical unschooling approach, but I also don&#39;t want to be a doormat to my kids and end up being an overly permissive parent.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264012704","msgId":49798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5Njk5OC40ODQ0OC5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49797,"nextInTopic":49800,"prevInTime":49797,"nextInTime":49799,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"So, my question is, to all of you more experienced folks, how can I handle this situation better? I m struggling with whether or not I should just wipe her","messageBody":"<div id=\"ygrps-yiv-126377037\">So, my question is, to all of you more experienced folks, how can I handle this situation better? I&#39;m struggling with whether or not I should just wipe her whenever she asks, but my fear is that if I do that then I&#39;ll just be letting her walk all over me, and that she needs to learn that going to the bathroom and washing your hands is something everybody has to do, even if they don&#39;t want to. I want to embrace the radical unschooling approach, but I also don&#39;t want to be a doormat to my kids and end up being an overly permissive parent.<br/>\n <br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nI would lovingly wipe my daughters butt everytime she wanted even if I needed to stop my dinner for a few minutes.<br/>\nI would do it with love and I would be happy about it.<br/>\nShe is 4 years old. You won&#39;t wipe her butt forever. But maybe one day she will need to wipe your and I hope you have modeled love and care so if this ever happens she will lovingly help you too.<br/>\nSome children feel love by little things like having their butts wiped, having their hair brushed, or teeth brushed,even when they can do it themselves.<br/>\nMy seven years old is a pro at brushing his teeth. THere are some days he asks me to do it for him. Those are the days he is feeling he needs mom to care for him more. I gladly do it. He feels loved and cared for.<br/>\nWhy do you think you will be a doormat if you wipe your 4 year old child?<br/>\nWhy do you think it is permissive to physically care for a young child?<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\nGroup Start a New Topic <br/>\nMARKETPLACE<br/>\nGoing Green: Your Yahoo! Groups resource for green living<br/>\n <br/>\nSwitch to: Text-Only, Daily Digest • Unsubscribe • Terms of Use<br/>\n. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Newbie Intro and a Question","postDate":"1264012499","msgId":49800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqN2ljaisydGR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49798,"nextInTopic":49807,"prevInTime":49799,"nextInTime":49801,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"~~~So, my question is, to all of you more experienced folks, how can I handle this situation better?  I m struggling with whether or not I should just wipe her","messageBody":"<div id=\"ygrps-yiv-699811074\">~~~So, my question is, to all of you more experienced folks, how can I handle this situation better?  I&#39;m struggling with whether or not I should just wipe her whenever she asks, but my fear is that if I do that then I&#39;ll just be letting her walk all over me, and that she needs to learn that going to the bathroom and washing your hands is something everybody has to do, even if they don&#39;t want to.  I want to embrace the radical unschooling approach, but I also don&#39;t want to be a doormat to my kids and end up being an overly permissive parent.~~~<br/>\n<br/>\n<br/>\nI went through that! But my youngest was 6... before that, I thought, &quot;If he doesn&#39;t do it well, it makes more work for me with the laundry! It makes sense for me to do it.&quot; For some reason, when he turned 6, I thought, &quot;He should be doing this!&quot; I actually told him, before his birthday, &quot;When you turn 6, I think you should start wiping your own bottom.&quot; Now I think, WTF? Why six? How random! But there it was.<br/>\n<br/>\nHe only wiped his own bottom a couple of times - he asked for help each time, and I&#39;d dutifully remind him, &quot;That&#39;s your job, now!&quot; But I paid attention to how it made me feel. I felt as if I had won. I felt separate from him. I felt a little mean. Paying attention to that, I started wiping him again. I didn&#39;t make a big production out of it, I just said &quot;yes&quot;. I bought the wet wipes that are safe for toilets to make it easier. I tickled him a little, sometimes, on his back, to make him laugh. It became a sweet time for both of us... sometimes stinky, but sweet!<br/>\n<br/>\nWhen he was around 7, he asked less and less, until he didn&#39;t ask any more. He&#39;s almost 11 now, and he hasn&#39;t asked for help in years.<br/>\n<br/>\nHe wasn&#39;t walking all over me, we were partners. Partners in getting a clean bottom! I&#39;m grateful now to have not insisted on my very arbitrary limit of being 6-years-old.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264012170","msgId":49797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3QjZFQjQxLUQ4QkEtNDQ5MC04M0FDLTMyM0YyMzJDOEIzQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49792,"nextInTopic":49798,"prevInTime":49796,"nextInTime":49798,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"Paula has already answered the main question, but I want to address the closing statement: -=-I want to embrace the radical unschooling approach, but I also ","messageBody":"<div id=\"ygrps-yiv-89965296\">Paula has already answered the main question, but I want to address  <br/>\nthe closing statement:<br/>\n<br/>\n-=-I want to embrace the radical unschooling approach, but I also  <br/>\ndon&#39;t want to be a doormat to my kids and end up being an overly  <br/>\npermissive parent.-=-<br/>\n<br/>\nThere are imbedded phrases in people that can pop up and bite them in  <br/>\nthe logical butt from time to time.  They&#39;re insults, and they&#39;re put  <br/>\nthere in the very early years of life.   They sit quietly until the  <br/>\nemotions are stirred and they pop up and insult us, in the voice of  <br/>\nsome long-ago relative or teacher or family &quot;friend.&quot;<br/>\n<br/>\nI think it&#39;s good for mindful parents to cleanse themselves of these  <br/>\nminefields.<br/>\n<br/>\nA Doormat?<br/>\n&quot;Overly permissive&quot;?<br/>\n<br/>\nPermissive of what?  Of giving her assistance?  Of helping her not  <br/>\nhave a rash on her bottom?  Of giving her the presenensce of a  <br/>\ncompassionate parent?<br/>\n<br/>\nWhat&#39;s the opposite of &quot;overly permissive&quot;?<br/>\nWhat&#39;s the opposite of &quot;a doormat&quot;?<br/>\n<br/>\nHere are some similar examples:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/phrases\">http://sandradodd.com/phrases</a><br/>\n<br/>\nI&#39;ll probably add these new examples too.<br/>\n<br/>\nAnd about the toilet assistance:  Some people have to wipe their  <br/>\nchildren&#39;s butts for five or ten or thirty-five years.  See your  <br/>\ndaughter as a healthy child who can go to the toilet on her own.   <br/>\nRejoice in that, and help her all she wants, as long as she wants.  My  <br/>\ncollege friend Mary Ann broke her neck at 24, and has had to have her  <br/>\nbutt wiped by other people ever since.  She&#39;s 59 years old.  They have  <br/>\nto put a tube in her to help her pee, too.  I&#39;ve done it myself.   <br/>\nShe&#39;s my friend; it was fine, but not the ideal situation!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132859234,"authorName":"Paula Sjogerman","from":"Paula Sjogerman &lt;sjogy@...&gt;","profile":"psjogy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Newbie Intro and a Question","postDate":"1264009714","msgId":49792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4NTk2Qjc3LUFCMTAtNEFBOC04NUUyLUM2QTkyNzhDMzQyM0BzYmNnbG9iYWwubmV0Pg==","inReplyToHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":49790,"nextInTopic":49797,"prevInTime":49791,"nextInTime":49793,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"... Hear this is a kindly voice: Someday - I promise - you will laugh at the idea that your child would never learn to wipe herself if you do it for her when","messageBody":"<div id=\"ygrps-yiv-289448414\">On Jan 20, 2010, at 8:13 AM, melissamariemichael wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, my question is, to all of you more experienced folks, how can I  <br/>\n&gt; handle this situation better?  I&#39;m struggling with whether or not I  <br/>\n&gt; should just wipe her whenever she asks, but my fear is that if I do  <br/>\n&gt; that then I&#39;ll just be letting her walk all over me, and that she  <br/>\n&gt; needs to learn that going to the bathroom and washing your hands is  <br/>\n&gt; something everybody has to do, even if they don&#39;t want to.  I want  <br/>\n&gt; to embrace the radical unschooling approach, but I also don&#39;t want  <br/>\n&gt; to be a doormat to my kids and end up being an overly permissive  <br/>\n&gt; parent.<br/>\n<br/>\n<br/>\n </span></blockquote>Hear this is a kindly voice:<br/>\n<br/>\nSomeday - I promise - you will laugh at the idea that your child  <br/>\nwould never learn to wipe herself if you do it for her when she&#39;s 4.<br/>\n<br/>\nModel wiping and washing and soon enough she will want to do it herself.<br/>\n<br/>\nAs for dinner, knowing what you know, maybe sit down at the table  <br/>\nwith some not-hot food (salad, eg) and keep the hot food hot until  <br/>\nafter the bathroom.<br/>\n<br/>\nLook for win-win solutions; this list is also really great for that.<br/>\n<br/>\nPaula</div>","specialLinks":[]},{"userId":374014398,"authorName":"melissamariemichael","from":"&quot;melissamariemichael&quot; &lt;myatzeck@...&gt;","profile":"melissamariemichael","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Newbie Intro and a Question","postDate":"1263996823","msgId":49790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqNzMybitjazlxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49792,"prevInTime":49789,"nextInTime":49791,"topicId":49790,"numMessagesInTopic":0,"msgSnippet":"I m new to the list and looking forward to participating - so here goes with the first post! My name is Melissa, my husband is Joe and we have two kids.  Mary","messageBody":"<div id=\"ygrps-yiv-1796612583\">I&#39;m new to the list and looking forward to participating - so here goes with the first post!<br/>\n<br/>\nMy name is Melissa, my husband is Joe and we have two kids.  Mary is turning 4 next month, and Joey is almost 18 months.  I first read about unschooling a little over a year ago.  I immediately liked the idea of unschooling as applied to school, but the concept of radical unschooling as applied to bedtimes, food, etc. seemed strange and irresponsible to me.  Over the past year I&#39;ve been reading lots more (John Holt, John Taylor Gatto, Sandra&#39;s and Joyce&#39;s websites, etc.) and am finding myself being persuaded that it really does make sense and isn&#39;t nearly as weird or irresponsble as I originally thought.<br/>\n<br/>\nSome of the most common conflicts in our house with Mary revolved around bedtimes, food, and the all encompassing fault of &quot;not listening&quot; that so many parents lament.  Over the past couple of weeks we&#39;ve started to relax our control of bedtimes and food with really positive results.  So I am excited about that - it feels so much more peaceful and happy.  I am also working on saying YES more.  My husband is coming around as well - he hasn&#39;t done nearly as much reading as I have so I think he&#39;s still a little bit in the &quot;weird and irresponsble&quot; mindset, but we&#39;re progressing.<br/>\n<br/>\nNow for the question - one conflict that we continually have with Mary revolves around wiping when she goes to the bathroom.  She has been wearing underwear for years now, and is fully capable of going to the bathroom all by herself including undressing, washing her hands, the whole bit.  She actually does it on her own, happily, some of the time.  <br/>\n<br/>\nBut other times she insists that someone come along with her to the bathroom, &quot;to watch,&quot; for company I guess.  But almost inevitably, when we go along to watch, she then insists that we wipe for her.  I&#39;ve asked her about it, and she says she doesn&#39;t want to wipe herself because then she&#39;ll get germs on her hands and she doesn&#39;t want to wash her hands.  I will tell her that I don&#39;t want to get germs on my hands and have to wash them either, and that it&#39;s her responsibility since she&#39;s going to the bathroom.  This whole bathroom situation results in tears and meltdowns about whether or not we should come along with her, and whether or not we should wipe rather frequently.  <br/>\n<br/>\nSometimes I just give in and wipe her to avoid the messy conflict, and Joe says I need to stand fast and refuse to wipe her because she&#39;s getting the idea that she doesn&#39;t need to do it herself.  One of the things that is most frustrating for Joe and I is that this whole thing almost always happens right after we sit down to dinner.  Even if I give her gentle reminders to go to the bathroom before dinner, she&#39;ll say she doesn&#39;t have to go and then as soon as we sit down and start eating she&#39;ll suddenly *have* to go to the bathroom and then we have a struggle because we know that going along with her will probably take a while because, being 4, she dawdles and such, and then sometimes we have the whole struggle about whether we should go along and then whether we should wipe and then we all end up frustrated and with cold dinners.  I know that eating stimulates the digestive tract and probably is the cause of her sudden need to go after she starts eating, but I really wish she would just go by herself because I know that she can.  Because sometimes she does.<br/>\n<br/>\nI feel I should mention that she doesn&#39;t do a great job of wiping when she goes #2, and this has resulted in painful rashes on 2 occasions when she wiped by herself.  So we&#39;ve talked about that with her and why it happens, and now when she goes #2 we always check and make sure that she&#39;s cleaned off really well so she doesn&#39;t get a rash.  But we usually insist that she wipes first, and then we will check.  <br/>\n<br/>\nSo, my question is, to all of you more experienced folks, how can I handle this situation better?  I&#39;m struggling with whether or not I should just wipe her whenever she asks, but my fear is that if I do that then I&#39;ll just be letting her walk all over me, and that she needs to learn that going to the bathroom and washing your hands is something everybody has to do, even if they don&#39;t want to.  I want to embrace the radical unschooling approach, but I also don&#39;t want to be a doormat to my kids and end up being an overly permissive parent.</div>","specialLinks":[]}],"prevTopicId":49824,"nextTopicId":49879}}