{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":177721839,"authorName":"Game-Enthusiast","from":"&quot;Game-Enthusiast&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A brush with mainstream parenting","postDate":"1094341177","msgId":99080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwOTA0MjMzOTM1LlBUSUg5MjA0Lm10YTEwLmFkZWxwaGlhLm5ldEBsZWlnaD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":99079,"nextInTime":99081,"topicId":99080,"numMessagesInTopic":0,"msgSnippet":"My gosh I live a sheltered life. It isn t often that I am around mainstream parents  because I choose to mostly surround myself with people who support what I","messageBody":"<div id=\"ygrps-yiv-1534313\">My gosh I live a sheltered life. It isn&#39;t often that I am around mainstream<br/>\nparents  because I choose to mostly surround myself with people who support<br/>\nwhat I do and parent in a similar fashion.  But when I am, I am getting<br/>\nworse and worse at keeping my mouth shut. &lt;grin&gt;  Today we went to a family<br/>\ngathering and I tried talking with my 15 yo niece in the presence of her<br/>\nmother.  (one of my sil&#39;s)  Every time I asked her a question and she<br/>\nanswered me, her mother corrected her and told her what she *really* thinks<br/>\nor *really* likes.  She just rolled her eyes and said, &quot;o.k. mom, your<br/>\nright.  that&#39;s what I think or like.&quot;  <br/>\n <br/>\nSomehow the conversation got turned to *what she wants to be when she grows<br/>\nup.*  I certainly didn&#39;t steer it that way.  Heck, I still don&#39;t know what I<br/>\nwant to be when I grow up. &lt;BG&gt;  I said, &quot;Heck, she&#39;s got plenty of time to<br/>\nfigure that out.  There are so many issues to consider&quot;  and I named a few,<br/>\nlike cost of college, what you would like to do for work, how much money<br/>\nyou&#39;d like to make, availability of those jobs in the area you want to live,<br/>\nwhat you enjoy doing, and just knowing what all your options are.  Her<br/>\nmother said, &quot;Well she has to decide soon or I&#39;m not going to pay for it!&quot;<br/>\nI told my niece that she can pick something and go to school on her mom&#39;s<br/>\ndime and then if she decides some day that she hates what she chose she<br/>\nwon&#39;t be out any money and she can work at the grocery store or just pay<br/>\nthen to go to school for whatever she decides she loves.  Her mother pretty<br/>\nmuch told me to shut up.  LOL! <br/>\n <br/>\nThen we got onto the topic of sports and their cost.  Their children are<br/>\nvery involved in sports and the mom way saying that she *has* to work in<br/>\norder for them to play, but she was bemoaning the fact that she works so<br/>\nmuch and doesn&#39;t get to spend much time with her kids.   I asked her if she<br/>\nthought her children would rather have her time or the money for all the<br/>\nfancy sporting goods.  She said, she definitely had to work so they could<br/>\nplay sports (the only other option she could see was to not work and have<br/>\nthe kids not play sports) and she told me how they all have to have matching<br/>\nwarm up suits, matching expensive sneakers, matching uniforms, etc.  It<br/>\n*was* a lot of money.  What ever happened to getting a pair of shorts and a<br/>\ntank top that gets handed down to next years class and doesn&#39;t cost hardly<br/>\nanything if you return them at the end of the season?  Why do the schools<br/>\nmake it cost so much to play?  Just so you all look cool?  She did say that<br/>\nif some kids don&#39;t have the money, that they still get to play and that the<br/>\nsneakers aren&#39;t really mandatory because a few kids do have different ones,<br/>\nbecause the brand they picked doesn&#39;t fit them well.  Do kids need to be so<br/>\nmuch the same that they can&#39;t have different but cool sneakers?  I was<br/>\nreally shocked by what appears to be mandatory to her.  <br/>\n <br/>\nI am so glad that so far my kids don&#39;t want to be part of that system.  I<br/>\nhope they never do.  I would hope that even if they find a team sport they<br/>\nwant to participate in that we can find a way to do that away from the<br/>\nschool system and away from mainstream parenting.  If I ever resort to<br/>\ntelling my kids what they think, I know they&#39;ll have the sense to slat me up<br/>\nside the head, so I think I&#39;m safe.  &lt;whew! glad I taught them to think on<br/>\ntheir own.&gt;<br/>\n <br/>\nAngela <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":99036,"nextTopicId":99085}}