{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: How to deal with the negativity that comes from being with relatives","postDate":"1330993697","msgId":66027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpqM2xuMSsxMGVyZ0BlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDEzMzA4OTgwNDMuMzM4MDMuWWFob29NYWlsTmVvQHdlYjEzMjEwMy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":66017,"nextInTopic":0,"prevInTime":66026,"nextInTime":66028,"topicId":66002,"numMessagesInTopic":0,"msgSnippet":"... There s more and more lego products marketed directly to girls - not just the pink tubs of mixed pieces but there s a whole new assortment of kits with","messageBody":"<div id=\"ygrps-yiv-1371474069\">Dawn Sharkey &lt;sharkeydawn@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; A few minutes later she said &quot;Girls can&#39;t do lego&quot;. Gah!<br/>\n<br/>\n </span></blockquote>There&#39;s more and more lego products marketed directly to girls - not just the pink tubs of mixed pieces but there&#39;s a whole new assortment of kits with girl figures, lots of flowers and various cute animals - think Littest Pets ala Lego. Sometimes it can help to bring up that sort of thing if you&#39;re looking for a way to make your point without arguing. Not only can girls do legos, they can do Girly legos. <br/>\n<br/>\nOh, and one of the astronaut figures in the Lego City rocket launch pad set-up is deliberately female (we call her River Song, for any Dr Who fans, out there - bright red lipstick). <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How to deal with the negativity that comes from being with relatives","postDate":"1330951127","msgId":66017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5RERDRjdGLTE3NzgtNEM1Ri1CQzVCLUIyNzI0RTM1MTI2NUBnbWFpbC5jb20+","inReplyToHeader":"PDEzMzA4OTgwNDMuMzM4MDMuWWFob29NYWlsTmVvQHdlYjEzMjEwMy5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDEzMzA4OTgwNDMuMzM4MDMuWWFob29NYWlsTmVvQHdlYjEzMjEwMy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":66016,"nextInTopic":66027,"prevInTime":66016,"nextInTime":66018,"topicId":66002,"numMessagesInTopic":0,"msgSnippet":"... I probably would have responded with a huge smile, but my girl loves to do everything! Play with legos, build mud huts, play with swords. Then I would","messageBody":"<div id=\"ygrps-yiv-292120039\">----&quot;Girls can&#39;t do lego&quot;-----<br/>\n<br/>\nI probably would have responded with a huge smile, &#39;but my girl loves to do everything! Play with legos, build mud huts, play with swords.&#39; Then I would have looked solemnly at my grandmother and said something like, &#39;thank goodness the world keeps changing. Can you imagine if we still had sati?&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Sati_(\">http://en.wikipedia.org/wiki/Sati_(</a>practice)<br/>\n<br/>\nRippy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to deal with the negativity that comes from being with relatives","postDate":"1330951092","msgId":66016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCMkQzQTBFLUJCNTItNDNENS1CQUI3LTdCOTg0QjE4RDQ0OUBnbWFpbC5jb20+","inReplyToHeader":"PENBQldTM3J0anJFYzEtUURhbXYyazZTVFo3d3dfZXdSTDUrWGV3ZEowdT1mSmNCVHJQUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQldTM3J0anJFYzEtUURhbXYyazZTVFo3d3dfZXdSTDUrWGV3ZEowdT1mSmNCVHJQUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66013,"nextInTopic":66017,"prevInTime":66015,"nextInTime":66017,"topicId":66002,"numMessagesInTopic":0,"msgSnippet":"My side of the family tends to worry and criticize. I have several strategies that help keep me calm. Breathing deeply and smiling. Reminding myself they have","messageBody":"<div id=\"ygrps-yiv-1797359307\">My side of the family tends to worry and criticize. I have several strategies that help keep me calm.<br/>\n<br/>\nBreathing deeply and smiling. Reminding myself they have good intentions and are making these comments from a place of love. <br/>\n<br/>\nReminding myself how fortunate Gianluca and Gisele are for having a family that loves them and cares deeply about them.<br/>\n<br/>\nPreparing myself before the visit that we&#39;re entering an environment where people communicate differently. Reminding myself that if I can keep the space light, peaceful and joyful, we&#39;ll all feel better. I&#39;m the most skilled person in my family who can do this. I feel it is my responsibility. <br/>\n<br/>\nRemembering the times I responded harshly and how badly that made everyone feel and my strong desire to avoid this feeling. <br/>\n<br/>\nWhen I perceive something as an attack, I try to take the &#39;attack&#39; element out of it and address their question respectfully. For example:<br/>\n<br/>\n----&quot;she never eats anything, what are you going to give her for lunch, since I didn&#39;t cook anything special for her?&quot; ----<br/>\n<br/>\n&#39;I&#39;ve got some snacks in my bag that I&#39;m sure she&#39;ll eat&#39;. Or &#39;I&#39;ll make her an omelette in case she doesn&#39;t eat lunch with us&#39;.<br/>\n<br/>\n----&quot;why didn&#39;t you cut her fingernails?&quot;---- <br/>\n<br/>\n&#39;Thanks for reminding me. Gisele, shall we show nanima (grandma) the special game we play when we cut nails?&#39; If Gisele is not interested, promise my mom that I&#39;ll do it when we are home. <br/>\n<br/>\n----- &quot;why isn&#39;t she wearing the other pants?&quot;----- <br/>\n&#39;These pants were his favourite ones today, but we&#39;ve taken a really nice photo of him wearing the pants you got him for his birthday. We&#39;re going to make you a thank you card and put the photo in there and mail it to you.&#39;<br/>\n<br/>\n-----&quot;we must take care of this tendency of hers to say no to everything&quot;---- <br/>\n<br/>\n&#39;I&#39;m working on it. It helps when I say lots of yeses to him&#39;.<br/>\n<br/>\nIf I can manage to be respectful to both my mom (or aunt, uncle, etc.) and my children, I feel like I&#39;ve hit a home run. If my mom gets the feeling that she&#39;s helped us out, she glows. I try to give her that feeling as much as I can.<br/>\n<br/>\nWhat I&#39;ve noticed is that every year we visit, she *is* getting softer and better at communicating respectfully. When my brothers and I were growing up, her main communication tools when she was stressed were spanking, yelling, shaming and criticizing. She&#39;s been able to make huge, positive changes since becoming a grandmother. It helps me to be gentle with her when I remember how far she&#39;s come.<br/>\n<br/>\nRippy<br/>\n(Gianluca 7, Gisele 5)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231389231,"authorName":"Dawn Sharkey","from":"Dawn Sharkey &lt;sharkeydawn@...&gt;","profile":"sharkeydawn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How to deal with the negativity that comes from being with relatives","postDate":"1330898043","msgId":66013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzA4OTgwNDMuMzM4MDMuWWFob29NYWlsTmVvQHdlYjEzMjEwMy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":66003,"nextInTopic":66016,"prevInTime":66012,"nextInTime":66014,"topicId":66002,"numMessagesInTopic":0,"msgSnippet":"Marta I could have written your post. I too have been deschooling myself for some time thanks to this and other lists, have a 2yo (and a 5mo) and have similar","messageBody":"<div id=\"ygrps-yiv-122016321\">Marta I could have written your post.<br/>\n<br/>\nI too have been deschooling myself for some time thanks to this and other lists, have a 2yo (and a 5mo) and have similar issues with family. We&#39;ve just come back from visiting them, and i too expressed myself harshly and ended up feeling rubbish.<br/>\n<br/>\nI&#39;ve already decided to have a longer gap between our next visits.<br/>\n<br/>\nI just wanted to come back re something in your post. I could relate so closely to what you said all the way through, but one thing I think I respond to differently.<br/>\n<br/>\n****I&#39;m also bothered by some of the thingsthey tell her directly and the frequency that they do it, but I&#39;ve become<br/>\naware that I might be projecting my own feelings so I trust that if she&#39;s<br/>\nuncomfortable, I will notice it and act upon it, if needed (I rarely leave<br/>\n<br/>\nher alone, she&#39;s got me or her father nearby).****<br/>\n<br/>\nWe had an incident like this this weekend. My Grandmother made two comments in quick succession that riled me. I didn&#39;t respond well...there was no peace or joy there I tell you. <br/>\n<br/>\nThe first was along the lines of &quot;when are you getting girl toys? Prams and things?&quot; I pointed out that ds, my 2yo, has a toy buggy (stroller?) and that when dd (5m) can walk she&#39;ll be welcome to use it. She is happy playing with ds&#39;s old stuff and when she has preferences we&#39;ll try and meet them by getting  more stuff. It was light hearted but I meant it.<br/>\n<br/>\nA few minutes later she said &quot;Girls can&#39;t do lego&quot;. Gah!<br/>\n<br/>\nI snapped that of course they could and I didn&#39;t want my children to hear things like that..I didn&#39;t say it kindly, I didn&#39;t shout but I can be forthright. I was sad about it as my grandmother was clearly upset (I took her flowers and apologised for being snappy).<br/>\n<br/>\nMy point is  that my dc&#39;s didn&#39;t feel uncomfortable hearing this (especially not the baby!), but neither was it a projection of my issues that made me unhappy about what she said. I don&#39;t want my children to hear &quot;Girls do x, boys do y&quot; if I can help it. I will point out that that is rubbish...but I need to work on ways of doing that better. I just don&#39;t have them yet...I feel like so much emotional energy is tied up in my little ones right now, that unpicking why my relationship with my family has me stuck in &quot;crabby 16yo&quot; mode is hard work. (Actually I have a good idea as to why...I still struggle to change the pattern though)<br/>\n<br/>\nI still think I was right to say something, and I know I should have done it more kindly.<br/>\nI completely agree with a lot of what you say about projecting ones own issues. But I do think that some statements need to be picked up on, even if the child seems fine with what is said. I admire your approach though and am sure I would (hope to) do the same in many situations.<br/>\n<br/>\nYou and I are in a similar place I think. ;-)<br/>\n<br/>\nDawn<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How to deal with the negativity that comes from being with relatives","postDate":"1330817243","msgId":66003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppdTljcis4cjRhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBQldTM3J0anJFYzEtUURhbXYyazZTVFo3d3dfZXdSTDUrWGV3ZEowdT1mSmNCVHJQUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66002,"nextInTopic":66013,"prevInTime":66002,"nextInTime":66004,"topicId":66002,"numMessagesInTopic":0,"msgSnippet":"... If you have trouble shrugging off their comments in some inoffensive way, it may be better to pare down visits to a minimum for awhile. Another option:","messageBody":"<div id=\"ygrps-yiv-1851768912\">Marta Pires &lt;martaborgespires@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Particularly, I often feel attacked by things<br/>\n&gt; my mom and aunt say to me<br/>\n<br/>\n </span></blockquote>If you have trouble shrugging off their comments in some inoffensive way, it may be better to pare down visits to a minimum for awhile.<br/>\n<br/>\nAnother option: invite Them to come join you for kid stuff - a trip to the zoo or a park or science center, for instance. Make it a fun trip around your child, rather than a grown-up visit which happens to include a child. That can shift the dynamic in significant ways. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot;she never eats<br/>\n&gt; anything, what are you going to give her for lunch, since I didn&#39;t cook<br/>\n&gt; anything special for her?&quot;<br/>\n<br/>\n </span></blockquote>I have found it helpful to make preemptive announcements about food like &quot;Mo ate at home, so don&#39;t worry if she doesn&#39;t eat&quot; to stave off those kinds of questions/comments. Mo tends not to eat when she&#39;s excited, so I Do try to make sure she eats before we go out, and have food for the car-ride home. But acknowledging the matter up front saves on commentary. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot;why didn&#39;t you cut her fingernails?&quot;, &quot;why<br/>\n&gt; isn&#39;t she wearing the other pants?&quot;<br/>\n<br/>\n </span></blockquote>I also learned to make statements like &quot;Oh, she does that herself - she&#39;s So Independent sometimes&quot; in a tone of pride. People usually are okay with the idea of a child wanting to be independent, so it puts us on a kind of common ground. They might not agree precisely, but independence is considered desirable. <br/>\n<br/>\nAlso, the tone in which I say things makes a difference. Being able to project a sense of confidence in my parenting doesn&#39;t open a door on unwanted advice. Some people Still offer advice, but if I&#39;m polite while being confident, then I&#39;m not asking for more, simply acknowledging the other person&#39;s point of view.  <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":467797497,"authorName":"Marta Pires","from":"Marta Pires &lt;martaborgespires@...&gt;","profile":"maluborgespires","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"How to deal with the negativity that comes from being with relatives","postDate":"1330803642","msgId":66002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQldTM3J0anJFYzEtUURhbXYyazZTVFo3d3dfZXdSTDUrWGV3ZEowdT1mSmNCVHJQUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":66003,"prevInTime":66001,"nextInTime":66003,"topicId":66002,"numMessagesInTopic":0,"msgSnippet":"Hi everyone! It s my first time posting here on the Always Learning list, but I ve been reading for about a year and a half now and learning, learning,","messageBody":"<div id=\"ygrps-yiv-1813390888\">Hi everyone!<br/>\n<br/>\nIt&#39;s my first time posting here on the Always Learning list, but I&#39;ve been<br/>\nreading for about a year and a half now and learning, learning, learning -<br/>\nboy have I been learning!<br/>\n<br/>\nGoing straight to the point: today was my brother&#39;s birthday and my parents<br/>\ninvited us for lunch at their place, to celebrate. And so we went and<br/>\nthings went smoothly, regarding my little 2 year old Constança (even though<br/>\nwhen she woke up, she just wanted to stay home and play with the Wii - when<br/>\nI realized she really didn&#39;t want to leave the house in that moment, I<br/>\nbreathed and told her that her uncle would love to see her and that it<br/>\nwouldn&#39;t be kind of us if we didn&#39;t show up, and then decided to take her<br/>\nwith her pajamas on and took her clothes along, so she got dressed in the<br/>\ncar ;) something I learned from you guys, among so many other things). Just<br/>\na small side note: I had an aha moment recently and now I totally get what<br/>\nyou mean by mindful parenting and making several thoughtful and respectful<br/>\ndecisions in each situation and how it makes much more sense to be guided<br/>\nby principles that help you be flexible about the decisions you&#39;re making,<br/>\nregarding that specific situation!<br/>\n<br/>\nNow that I think about it all, I might have accumulated some stress from<br/>\nthis morning situation (we also had an appointment to see a house right<br/>\nbefore lunch, so I felt pressed to get there on time), which, along with<br/>\nsome hormonal imbalance I&#39;m feeling as well today, didn&#39;t seem to help me<br/>\nat all.<br/>\n<br/>\nAnyway, she had fun at my parents place, she likes to be with her<br/>\ngrandparents and her uncle and great-aunt and uncle and cousins. The<br/>\nproblem was definitely me and I want to change that, as it only makes me<br/>\nfeel a bit down, which doesn&#39;t help me contribute to the peace and joy I<br/>\nwant to have in our family. Particularly, I often feel attacked by things<br/>\nmy mom and aunt say to me, regarding Constança mainly: &quot;she never eats<br/>\nanything, what are you going to give her for lunch, since I didn&#39;t cook<br/>\nanything special for her?&quot;, &quot;why didn&#39;t you cut her fingernails?&quot;, &quot;why<br/>\nisn&#39;t she wearing the other pants?&quot;, &quot;we must take care of this tendency of<br/>\nhers to say no to everything&quot;, and so on. A lot of issues are commented on<br/>\non a regular basis, from the bed-sharing to the candy she eats, from the<br/>\nclothes she wears to her hair cut. I&#39;m also bothered by some of the things<br/>\nthey tell her directly and the frequency that they do it, but I&#39;ve become<br/>\naware that I might be projecting my own feelings so I trust that if she&#39;s<br/>\nuncomfortable, I will notice it and act upon it, if needed (I rarely leave<br/>\nher alone, she&#39;s got me or her father nearby). In the moment, I feel like<br/>\nexploding (I&#39;m aware that there&#39;s a lot of baggage here) and usually,<br/>\nbecause I&#39;m not the exploding type, I just answer back, harshly (maybe this<br/>\nqualifies as an explosion, even if I seem calm...) - of course, it&#39;s worse<br/>\nif I didn&#39;t sleep well or feel stressed about something, so when I&#39;m<br/>\nfeeling good, I try to answer jokingly or not answer at all. But, it<br/>\ndoesn&#39;t feel good to do this (the angry answering) and I know it hurts<br/>\nthem, so what to do? How can I calm myself in that split second?<br/>\n<br/>\nConstança fell asleep on our way home and when we got here, I felt like<br/>\ncrying. Then I thought, how can I stop this? It won&#39;t help us if I stay<br/>\n*here*. So I decided to do something that would help me feel better, as<br/>\nI&#39;ve seen suggested here on the list - I put on some music, finished a<br/>\ntranslation I&#39;ve been working on (it&#39;s a translation of an interview Sandra<br/>\ngave back in 1998, to Portuguese - reading, learning, talking about radical<br/>\nunschooling is what motivates me most these days!), checked my e-mails and<br/>\nconsciously decided not to do house work, even though I enjoy it. I am<br/>\nfeeling better now, but I&#39;d like to have more tools to deal with this<br/>\nnegativity that stayed with me and also to deal with the at-the-moment<br/>\nknee-jerk reactions.<br/>\n<br/>\n<br/>\nThank you so much for being here and helping us change our lives for the<br/>\nbetter!<br/>\nMarta<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":66019,"nextTopicId":66041}}