{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Dawn Scagnelli","from":"&quot;Dawn Scagnelli&quot; &lt;BACH2YOGA@...&gt;","replyTo":"LIST","senderId":"2nAslKgV3Vpg9PMXMI94LcNpsZmku_b4jhf53JCTo1mCmLCMVcYHw3tMJXnH5EmS4no4F_c6vy4MWGT2QIScuhysVdZr3ri72mrcxQTIWS-q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Shouting","postDate":"999470581","msgId":24055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMjAwMTkwMjIyNDMxMzgwQGVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":24054,"nextInTime":24056,"topicId":24055,"numMessagesInTopic":0,"msgSnippet":"The first time Kirby was around drunken adults who were conversing (insulting each other loudly) he was really afraid.  My sister s kids were just calmy","messageBody":"<div id=\"ygrps-yiv-1409129191\">The first time Kirby was around drunken adults who were &quot;conversing&quot; <br/>\n<br/>\n<br/>\n(insulting each other loudly) he was really afraid.  My sister&#39;s <br/>\nkids were <br/>\n<br/>\njust calmy watching TV--they had obviously heard it all before. <br/>\n<br/>\n <br/>\n<br/>\nQuite honestly, I wouldn&#39;t want my kids around any drunken adults, either. <br/>\nAs I mentioned in my last post, my husband is loud, and I am not. And at first, <br/>\nthat loudness did scare me--not just his, but when I saw it at work (Italian <br/>\nboss at the time). But I&#39;ve learned now that it&#39;s just their ways. I will admit <br/>\nto &quot;Please, calm down...please, lower your voice&quot; on occasion with hubby though. <br/>\n:)<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n I am saying that if a mom says she would prefer not to have her young <br/>\n<br/>\n<br/>\nchildren visit in a home in which the parents yell at their children (not <br/>\n<br/>\n<br/>\n&quot;HEY, come eat ice cream!&quot; but &quot;YOU IDIOT!&quot; and I thought that was clear <br/>\nfrom <br/>\n<br/>\nthe beginning), that if another person says kids need to be exposed to <br/>\nother <br/>\n<br/>\nfamilies&#39; practices, that if &quot;other families&#39; practices&quot; goes from kind of <br/>\n<br/>\n<br/>\nyelling to blatant sexual abuse or crack-house-management, I think EVERY <br/>\n<br/>\n<br/>\nmother will draw her own line somewhere. <br/>\n<br/>\n <br/>\n<br/>\nI think that there should be a clear distinction between yelling and <br/>\nshouting and verbal abuse. That&#39;s not to say that occasionally a voice raised <br/>\ndoesn&#39;t happen in correction, but IMO, it should never include name <br/>\ncalling. Can&#39;t say that I&#39;ve much appreciated some of the recent name calling <br/>\nhere, either. :(<br/>\n<br/>\n <br/>\n<br/>\n Pam is being overly criticized for drawing hers at parents who <br/>\nyell.<br/>\n<br/>\nWhy is that line bad, but other lines are good? <br/>\n<br/>\n<br/>\nI&#39;m not so sure that Pam&#39;s intentions are necessarily what others are <br/>\ninterpreting--but even if they are, it is her decision. I know that if you are <br/>\nnot used to loudness, regardless of its origin, it can send your stomach into <br/>\nyour throat, and make your heart race. It does to me.<br/>\n<br/>\n <br/>\n<br/>\n If no lines are bad, and kids should be exposed to other lifestyles, <br/>\nshould I <br/>\n<br/>\nsend my kids to do volunteer work at the crack house now so they&#39;ll not be <br/>\n<br/>\n<br/>\nsurprised when they come across it later in life? <br/>\n<br/>\n <br/>\n<br/>\nIMO, children are like plants that need to be nurtured. When they are ready <br/>\nthey can be hardened off and transplanted, but if done to soon it can be <br/>\ndisastrous. I realize there are some flaws in this analogy, but I think most of <br/>\nyou know what I mean.<br/>\n<br/>\n <br/>\n<br/>\n From Pam&#39;s quiet-family point of view, abusive-in-face yelling is a bad <br/>\n<br/>\n<br/>\nthing.  It seems (perhaps I am wrong) that people here are <br/>\njustifying <br/>\n<br/>\nyelling, but they&#39;re not talking about marine-drill-sergeant <br/>\nyelling.  If so, <br/>\n<br/>\nthe argument is missing its point and the insults on Pam are unwarranted <br/>\n<br/>\n<br/>\n(something else I&#39;ve been saying). <br/>\n<br/>\n <br/>\n<br/>\nAgain, I that is just what I am wondering...sometimes I hear what you are <br/>\nsaying and what I hear is not what you are saying kind of thing.<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nRenee<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bach2yoga@...\">bach2yoga@...</a> <br/>\n<br/>\nWe are students of words; we are shut up in schools, and colleges, and <br/>\n<br/>\n<br/>\nrecitation rooms, for ten or fifteen years, and come out at last with a bag <br/>\n<br/>\n<br/>\nof wind, a memory of words, and do not know a thing. <br/>\n<br/>\n--Ralph Waldo Emerson <br/>\n<br/>\n&quot;It is in fact nothing short of a miracle that the modern methods of <br/>\n<br/>\ninstruction have not yet entirely strangled the holy curiosity of inquiry; <br/>\n<br/>\n<br/>\nfor this delicate little plant, aside from stimulation, stands mainly in <br/>\nneed <br/>\n<br/>\nof freedom; without this it goes to wrack and ruin without fail.&quot; <br/>\n<br/>\n--Albert Einstein <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":13418,"nextTopicId":24056}}