{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Jeff & Diane Gwirtz","from":"&quot;Jeff & Diane Gwirtz&quot; &lt;jagwirtz@...","replyTo":"LIST","senderId":"4wN29mkvFF4OHjIkNKK5VlWH1fzX87MspU-YsNGBXu57dy9hoCd9uKzRAo2UQaHnlvsZLZXLMm9CObsUyVTm3BPfG_8fSmkttcVIvYX7Pw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: Summer of deschooling and still no","postDate":"936449182","msgId":2538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xODUuMjUzOC45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2537,"nextInTime":2539,"topicId":2538,"numMessagesInTopic":0,"msgSnippet":"... Dragon Ball Z - Ds was really into that for awhile.  He and his friends wrote all kinds of role-playing scenarios around it. Sometimes we get up and have","messageBody":"<div id=\"ygrps-yiv-1309904653\"><blockquote><span title=\"ireply\">&gt; You know, I read this, and the rest of your response, and I think that is so <br/>\n&gt; great.  But I don&#39;t understand it.  The bones of it.  Do you just get up in <br/>\n&gt; the morning and say, &quot;what do you want to do today?&quot; Or do you just get up in <br/>\n&gt; the morning?  All summer, I let the boys pretty much do what they wanted, I <br/>\n&gt; asked them to practice their music everyday, and read 30 min. a day.  They <br/>\n&gt; did that, and then played with their Dragon Ball Z action characters the rest <br/>\n&gt;<br/>\n </span></blockquote>Dragon Ball Z - Ds was really into that for awhile.  He and his <br/>\nfriends wrote all kinds of role-playing scenarios around it.<br/>\n<br/>\nSometimes we get up and have specific things we have to do that day - <br/>\nlike on Wednesdays we deliver Meals on Wheels and on Thursdays , ds <br/>\nhas guitar lessons.  Sometimes we talk about what he wants to do - <br/>\nfor instance if he wants to go to the library, etc.  Most of the time <br/>\nwe just get up.  You can&#39;t tell our summer from the rest of the year, <br/>\nexcept that the phone quits ringing for ds when the other kids go <br/>\nback to school.  He enjoys this because he knows he&#39;ll have <br/>\nuninterrupted time for what he wants to do.  Everything seems to go <br/>\nin spurts here.  Ds spent days playing Civilization II on the <br/>\ncomputer.  Then he started reading _The Odyssey_ and spent hours on <br/>\nthat.  This week he spent hours playing his guitar and working on <br/>\ngeometry, algebra, and physics.  I never know from one day to the <br/>\nnext what he might really throw himself into.<br/>\n<br/>\nNow that I&#39;ve said all that,  let me point out that this is our 4th <br/>\nyear of homeschooling which became unschooling after a few months.<br/>\nHe has had plenty of time to deschool which meant a lot of playing <br/>\nvideo games, watching tv, and staring into space for him.   My dh <br/>\noften had more faith than I did that his motivation would kick back <br/>\nin.  I used to walk into his room when he was playing video games and <br/>\nhe would say,  &quot;I&#39;m sorry - I know I should be doing something more <br/>\nconstructive.&quot;  I&#39;d laugh and respond,  &quot;Why, aren&#39;t you enjoying <br/>\nyourself?&quot;  He finally saw it all start to work and we all breathed a <br/>\nbig sigh of relief.  He still plays video games once in awhile during <br/>\nthe day,  but most of the time,  he wants to use the time while his <br/>\nfriends are at school for other things.<br/>\n<br/>\nI don&#39;t know how long your children have been out of ps or away from <br/>\nstructured unschooling.  Understand that it takes time and a lot of <br/>\npatience.  Just for a time,  try not to do anything educational.  <br/>\nJust have fun.   You&#39;ll find out just how hard it is not to learn <br/>\nanything.<br/>\n<br/>\nDiane from KS<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jagwirtz@...\">jagwirtz@...</a></div>","specialLinks":[]}],"prevTopicId":2492,"nextTopicId":2558}}