{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":59461774,"authorName":"Sarah","from":"Sarah &lt;sarahanne1@...&gt;","profile":"sarahanne1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unschooling today","postDate":"1137709912","msgId":111330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTE5MjIzMTUyLjc0Mzg0LnFtYWlsQHdlYjUyMzEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":111329,"nextInTime":111331,"topicId":111330,"numMessagesInTopic":0,"msgSnippet":"Some of my favorite unschooling days are when we don t even leave the house.  We are sticking close to home this week because my daughter hurt her leg skiing","messageBody":"<div id=\"ygrps-yiv-1192301587\">Some of my favorite unschooling days are when we don&#39;t<br/>\neven leave the house.  We are sticking close to home<br/>\nthis week because my daughter hurt her leg skiing on<br/>\nSunday.  After x-rays, we found out it is just a<br/>\nbruised bone. But this has been good, and today is a<br/>\ngood stay-at-home unschooling day!<br/>\n<br/>\nIt started off with a clean house.  I love that!<br/>\n<br/>\nThis morning my girls and I sat on our couch and read<br/>\na huge stack of picture books from the library.  We<br/>\nread My Rag Coat and Lentil and Bad Baby and Snap and<br/>\nPinkerton Gets a Rose, and some others I can&#39;t<br/>\nremember right now.  We were all in our jammies and I<br/>\nwas thinking how great it was that no one had to hurry<br/>\noff or get dressed or anything.  For some reason,<br/>\nnobody got hungry right away so we didn&#39;t eat<br/>\nbreakfast when we usually do.  <br/>\n<br/>\nWe watched all the Numa Numa videos. (Seamus is our<br/>\nfavorite, and Sophia makes everyone watch it.  He&#39;s<br/>\nfamous here.)  We&#39;re going to ask my husband, Glenn,<br/>\nto help us make our own tonight.<br/>\n<br/>\nThe girls wanted to get in the bath and we left out<br/>\nthe bubbles so they could use their goggles and<br/>\nsnorkle-thingers.  We had planned to go get some<br/>\nsnacks, but....<br/>\n<br/>\nMy mother-in-law brought over some Amish cinnamon<br/>\nbread and a starter for us to do our own ten day bread<br/>\nevent.  Breakfast!  Yay!  We also ate the little<br/>\noranges we all love.  My youngest, Eva, peeled three<br/>\njust because she can.<br/>\n<br/>\nEva then dressed in her swimsuit and we played like we<br/>\nwere at the beach and used her huge ball to play<br/>\nindoor beach soccer.  Very fun.  <br/>\n<br/>\nWe watched lots of birds gather around the flower pots<br/>\nwe had filled with seed on our deck.<br/>\n<br/>\nWe talked about our snowman.  Turns out, we need to<br/>\nmake another because he looks lonely.<br/>\n<br/>\nWe watched a library movie and then I printed some<br/>\ncoloring pages which the girls liked but didn&#39;t choose<br/>\nto color.  We all went our separate ways for awhile, I<br/>\nmade lunch, etc.  <br/>\n<br/>\nWe had a good mail day.  I had ordered some kids art<br/>\nbooks and history of famous people books.  My daughter<br/>\nsaid, &quot;I can&#39;t believe you got all those for $14.00.&quot; <br/>\nShe was thrilled with the Picasso book and we looked<br/>\nat it for awhile.  Her all-time favorite painting is<br/>\nPicasso&#39;s Girl Before a Mirror she told me.  We were<br/>\nalso glad to see a John Lennon book.<br/>\n<br/>\nMy friend sent me a great package today, too.  It had<br/>\na Frida tote bag.  We remembered that our friend had<br/>\ndressed as Frida for our annual Halloween party, and<br/>\nwe looked her up. Oh yeah!  We remembered her<br/>\npaintings.  Interesting, we didn&#39;t get a Frida book<br/>\ntoday so I put it on my wish-list.  I also got a teeny<br/>\ngolden Virgin Mary.  My daughter said, &quot;She *does*<br/>\nknow you&#39;re not religious, right?&quot;  &quot;Oh, yeah,&quot; I<br/>\nsaid, &quot;But I really like Mary.&quot;  Short religious<br/>\nconversation followed.  I also got a metal mirror and<br/>\nswitch-plates, ceramic butterfly and an embroidered<br/>\ntablecloth.  (My friend is from Tucson :)) <br/>\n<br/>\nAnd then I reminded Sophia, my 6 year old, that her<br/>\nfriend, Noah, was coming over.  She promptly asked for<br/>\na huge sheet of paper and drew him a pirate ship<br/>\nposter with Jolly Roger and ghost pirates and spelled<br/>\nthe word girl and Noah.  <br/>\n<br/>\nWhen Noah got here, they decided to play a game they<br/>\ninvented two years ago, and they play whenever they<br/>\nget together.  It has something to do with super<br/>\npowers. That started two hours ago.  When they get<br/>\nbored, Noah brought the Klutz bottle-cap craft book<br/>\nover, and they want to make magnets and pins and such.<br/>\n<br/>\nWe&#39;ll pick up Papa Murphy&#39;s pizza tonight and chat<br/>\nwith Noah&#39;s Dad.  Noah&#39;s Mom is in New Orleans doing<br/>\nclean-up.  She&#39;ll be gone for nine days.  (Last night<br/>\nwe had dinner with friends who talked about their trip<br/>\nto France and the Tahiti trip they are planning.)<br/>\n<br/>\nMy husband bought a new computer for a new programming<br/>\ncontract job and I guess we&#39;ll get it set up tonight. <br/>\nWe&#39;ll have four computers now.<br/>\n<br/>\nEva, my little one, is asleep, and I am emailing, and<br/>\nlife is good!<br/>\n<br/>\nIts funny, I could keep adding little tidbits from<br/>\nconversation or web-pages or books and it is only<br/>\n3:27.<br/>\n<br/>\nSarah Anderson-Thimmes<br/>\n <br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":111328,"nextTopicId":111098}}