{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":27,"messages":[{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] confirmation/diagnosis/looking for trouble (offshoot from peeing the bed)","postDate":"1324941668","msgId":64641,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWRzNjlkR3V6KzVxT2MyWVNFc082WDhiWGNDYj13R3cwN2ZEbUZpR0dLSjdEZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEQ2NjhGMTkxLTE1ODUtNEY4NC1BQzZBLUEzRjM2RUE0QTNDMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpkOTh1aSs4NmJ0QGVHcm91cHMuY29tPgk8RDY2OEYxOTEtMTU4NS00Rjg0LUFDNkEtQTNGMzZFQTRBM0MxQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":64640,"nextInTopic":0,"prevInTime":64640,"nextInTime":64642,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"... I agree with you so very much.  In the many years that I spent working as a social worker I saw a lot of pathology that was really just the result of a","messageBody":"<div id=\"ygrps-yiv-1109494961\">On Mon, Dec 26, 2011 at 7:58 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt; ********I liked Glenda&#39;s practical ideas about laundry and bedding. I<br/>\n&gt; don&#39;t think an assumption of pathology should be high on the list for<br/>\n&gt; dealing with bedwetting, either.<br/>\n&gt;<br/>\n&gt; Sandra********<br/>\n&gt;<br/>\n </span></blockquote>I agree with you so very much.  In the many years that I spent working as a<br/>\nsocial worker I saw a lot of &#39;pathology&#39; that was really just the result of<br/>\na normal child attempting to cope with horribly abnormal circumstances.  In<br/>\nthis day and age there seems to be an enormous push to identify problems,<br/>\nrather than solutions.  There seems to be the magical belief that one day<br/>\nwe will have a pill to cure everything unpleasant including a rainy day....<br/>\n<br/>\nI didn&#39;t follow this thread all the way through, so forgive me if someone<br/>\nhas already suggested this; but I did have a child that I worked with<br/>\nseveral years ago that had trouble with bed wetting and she had chronic<br/>\nbladder and kidney infections and once we got them under control her bed<br/>\nwetting went away.  If the child&#39;s urine is very dark or strong in color,<br/>\nyou may want to have a test for a UTI.<br/>\nChris<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217568290,"authorName":"Laureen","from":"Laureen &lt;splashing@...&gt;","profile":"elementalgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] confirmation/diagnosis/looking for trouble (offshoot from peeing the bed)","postDate":"1324917855","msgId":64640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSFdpbkJyOXJfdjhpS3dCMnpKNVNLNC1fMVhSRjNoQjZNR21fWVBkc3l1Mj1aVGR0d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEQ2NjhGMTkxLTE1ODUtNEY4NC1BQzZBLUEzRjM2RUE0QTNDMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpkOTh1aSs4NmJ0QGVHcm91cHMuY29tPiA8RDY2OEYxOTEtMTU4NS00Rjg0LUFDNkEtQTNGMzZFQTRBM0MxQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":64639,"nextInTopic":64641,"prevInTime":64639,"nextInTime":64641,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"Heya ... In Meredith Small s book Our Babies, Ourselves, she explores the notion that what babies are capable of is completely dependent on parental ","messageBody":"<div id=\"ygrps-yiv-1070369552\">Heya<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Dec 26, 2011 at 4:58 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; Symptoms to look out for, the ad says:<br/>\n&gt;<br/>\n&gt; No big smiles or other joyful expressions by 6 months<br/>\n&gt; No babbling by 12 months.<br/>\n&gt; No words by 16 months.<br/>\n&gt;<br/>\n&gt; Many children speak later than a year; that&#39;s not pathological.<br/>\n&gt;<br/>\n<br/>\nIn Meredith Small&#39;s book &quot;Our Babies, Ourselves,&quot; she explores the notion<br/>\nthat what babies are capable of is completely dependent on parental<br/>\nexpectation. One example she used, that really stuck with me, is that<br/>\nWestern children are assumed to be able to talk far before they walk.<br/>\nWhereas in a few nomadic and semi-nomadic tribes in Africa, babies are<br/>\nexpected to walk by 6 months, but not talk until they&#39;re four years old. In<br/>\nChina, the expectation was that girls would be fully potty-trained by nine<br/>\nmonths, and boys by 11 months. Here in the US, just a few years ago,<br/>\naverage age of potty training was 4.5 years.<br/>\n<br/>\n&quot;Normal&quot; is such a cultural construct, and all kinds of things get<br/>\nnormalized or pathologized, based on all kinds of things, but so rarely on<br/>\nwhat&#39;s right *for that kid* at that time. It also made me think hard about<br/>\nthe damage that &quot;should&quot; (as in, a child should do a given thing by a given<br/>\ntime) creates.<br/>\n<br/>\n<br/>\n-- <br/>\n~~L!<br/>\n<br/>\ns/v Excellent Adventure<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theexcellentadventure.com/\">http://www.theexcellentadventure.com/</a><br/>\n<br/>\n&quot;The greatest expression of rebellion is *joy*.&quot;<br/>\n— Joss Whedon<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"confirmation/diagnosis/looking for trouble (offshoot from peeing the bed)","postDate":"1324904289","msgId":64639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ2NjhGMTkxLTE1ODUtNEY4NC1BQzZBLUEzRjM2RUE0QTNDMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpkOTh1aSs4NmJ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpkOTh1aSs4NmJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":64636,"nextInTopic":64640,"prevInTime":64638,"nextInTime":64640,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"-=-But I think it s damaging to imply there s a connection between the tea and bedwetting without having taken the steps to confirm it. -=- And if the steps","messageBody":"<div id=\"ygrps-yiv-1211851826\">-=-But I think it&#39;s damaging to imply there&#39;s a connection between the tea and bedwetting without having taken the steps to confirm it. -=-<br/>\n<br/>\nAnd if &quot;the steps to confirm it&quot; would be something like reading an article that says so, or going to a doctor to &quot;confirm&quot; the mother&#39;s concerns, that&#39;s not scientific confirmation.<br/>\n<br/>\nThere&#39;s an advertisement in some magazines this month.  There&#39;s a little girl,maybe seven years old, wrapping cloth as a belt, around an odd outfit, and the mom&#39;s watching her (mom&#39;s face doesn&#39;t show).<br/>\n<br/>\nIt says:<br/>\n<br/>\nOdds of a child become a top fashion designer:  1 in 7,000<br/>\nOdds of a child being diagnosed with autism:  1 in 110.<br/>\n<br/>\nJust that is horrible enough.  I had many thoughts. <br/>\nI wondered how much a mother saying &quot;Oh, it&#39;s not exploration of fashion, it&#39;s Asperger&#39;s&quot; would affect a child&#39;s joy in the recombination of clothing as she grew older, or in the mother&#39;s joy and willingness to help provide the child with materials and encouragement to do so.  There are MANY uses for artistry with cloth other than &quot;becoming a top fashion designer.&quot;  There is costuming for theatre, or children&#39;s dance recitals; window and mannequin dressings; home sewing; dressing dolls; home decorating; quilt making, fiber arts; dressing oneself in the morning.<br/>\n<br/>\nBut my hardest thought was that the odds of a child being diagnosed with autism are MUCH higher than the odds of a child **having** autism, as the definition has been QUITE expanded.  <br/>\n<br/>\nSymptoms to look out for, the ad says:<br/>\n<br/>\nNo big smiles or other joyful expressions by 6 months<br/>\nNo babbling by 12 months.<br/>\nNo words by 16 months.<br/>\n<br/>\nMany children speak later than a year; that&#39;s not pathological.<br/>\n<br/>\nI also thought maybe someone was making money off that, but then noticed it was by the Ad Council, which provides public service announcements, and so it wasn&#39;t sponsored by a drug company or a group of doctors or the education association. :-)  I felt a little better, but not much.<br/>\n<br/>\nI liked Glenda&#39;s practical ideas about laundry and bedding.  I don&#39;t think an assumption of pathology should be high on the list for dealing with bedwetting, either.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Peeing the bed; an older child","postDate":"1324885778","msgId":64636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpkOTh1aSs4NmJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64607,"nextInTopic":64639,"prevInTime":64635,"nextInTime":64637,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"===A few nights ago, really late, she was going to drink a can of tea and I stopped her. (Now after reading so much about food restrictions I could kick","messageBody":"<div id=\"ygrps-yiv-1254388178\">===A few nights ago, really late, she was going to drink a can of tea and I stopped her. (Now after reading so much about food restrictions I could kick myself.) Tonight she asked if she could have a can of tea and I told her that I thought it wasn&#39;t a good idea considering what happened last night, but that it was her body. She said something like, &quot;So what does that mean? That confuses kids.&quot; I said, &quot;I mean that I&#39;ve told you my opinion, but it&#39;s your body and your choice.&quot; She drank it.===<br/>\n<br/>\nThere can be better times of day or night for certain foods or drinks for some people, though, and you can provide some guidance in that area -- it sounds like that&#39;s what your daughter was looking for when she asked if she could have the tea.<br/>\n<br/>\nFor example, we seldom drink caffeinated drinks in my family. My son and I prefer to drink water, and the sodas my hubby likes to have on-hand are decaffeinated. My son and I have both figured out through first-hand experience that if we have an energy drink or other caffeinated drink the caffeine tends to make it challenging for us to fall asleep for the next 10-12 hours. <br/>\n<br/>\nSo when he gets a hankering for an energy drink or caffeinated soda, he&#39;ll ask if I think it&#39;d be okay for him to have it. We&#39;ll figure out about how long it could be before the caffeine wears off, and if it&#39;ll be later than he&#39;s usually up I&#39;ll ask if he wants to wait and have it after his first meal the next day. Or I&#39;ll suggest having a small amount of whatever it is that night and having the rest the next day. Or if he&#39;s going to be gaming late with friends and doesn&#39;t mind being up later than usual, then the caffeinated drink becomes a non-issue.<br/>\n<br/>\nThe really important thing here is that if he chooses to wait to have the drink until the next day, I make a point to remind him of it early enough the next day that it won&#39;t interfere with what time he wants to go to bed. I put the energy drink or soda in a very visible place so *I* will see it early enough in the day to remind him after he&#39;s up.<br/>\n<br/>\n===I told her that I thought it wasn&#39;t a good idea considering what happened last night===<br/>\n<br/>\nBut you don&#39;t know for certain the tea is causing the bedwetting, right? <br/>\n<br/>\nI remember when my stepson was 4 or 5 and came to spend the summer with us, he announced that he was allergic to chocolate so couldn&#39;t have anything chocolate. It turned out his mom felt chocolate made him hyper, so she told him and us he was allergic to it and couldn&#39;t eat it anymore. (That didn&#39;t last very long.)<br/>\n<br/>\nIf you&#39;re not positive the tea contributes to the bedwetting, please be thoughtful about how you present that to your daughter. If she&#39;s concerned about the tea or the caffeine in it being problematic and she wants to see if having the tea earlier in the day results in no bedwetting, you could certainly help her with that by being sure other drink options are easily available in the evenings when she&#39;d otherwise be having the tea. If she sets a cut-off time each day for having tea and you notice that time&#39;s drawing near and she hasn&#39;t had tea, you could ask if she wants some before it gets much later in the day and/or take it to her. But I think it&#39;s damaging to imply there&#39;s a connection between the tea and bedwetting without having taken the steps to confirm it. <br/>\n<br/>\n===She seems embarrassed by it, but not enough to try doing anything differently or to put the clothes in the washer or let me know so I can before everyone sees/smells them.===<br/>\n<br/>\nI know at 15 I was way, WAY!, more tolerant of dirty clothes, soiled bedding, and things like that than I am as an adult . . . even as an adult, my tolerance was a lot higher when I was single and in my 20&#39;s than it is nowadays!<br/>\n<br/>\nYou could put a kitchen-sized metal lidded trashcan in your 15yo&#39;s room, line it with a plastic trash bag, and let her know that&#39;s where her wet pj&#39;s and bedding go. That keeps the odor out of the bathroom she shares with her sister. You can put one of those stick-on deodorizers inside the trashcan to help keep the odor in check; a trashcan with a firm-sealing lid will help keep the odor down in her bedroom.<br/>\n<br/>\nDon&#39;t wait on her to let you know if she needs fresh bedding; check daily. If she&#39;s in her room, you could pop your head in and ask in an upbeat voice &quot;need anything washed?&quot;; if she&#39;s not in her room, check the hamper in her room or her bed.<br/>\n<br/>\nYou could put two sets of sheets on her bed, with a liner in-between them, so that it&#39;s easy for her to strip off wet sheets + liner and there already be fresh sheets underneath ready to use. And if there&#39;s a hamper in her room just for soiled bedding + pj&#39;s and she makes use of the hamper, it&#39;d be easy for you to grab it and tote to the washer. <br/>\n<br/>\nAnd I&#39;d be sure to have blankets or comforters that can be easily washed & dried at home, and are easy to take on and off the bed so stripping the bed is easy-n-quick. (I recently purchased a down-alternative comforter for my teen&#39;s bed, because the dogs like to nap on his bed and we need the dog hair washed off regularly because of allergies. His previous comforter was too bulky for our washer and dryer; this new one is lightweight, easy to launder, and easy to take on/off the bed.)<br/>\n<br/>\nAt some point she will very likely become more interested in getting soiled bedding to the laundry quicker. For now, I&#39;d focus on doing what you can to make it easy for her to strip her bedding when needed and to contain the bedding + pj&#39;s in her room until you can snag them in the morning and toss them into the washer. <br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peeing the bed; an older child","postDate":"1324674922","msgId":64607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQjgyNzkwLTkyRDQtNDU4Ny1COEM4LTg5MTk5RTkzNEVCMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpkMmkzOCs4MGczQGVHcm91cHMuY29tPg==","referencesHeader":"PGpkMmkzOCs4MGczQGVHcm91cHMuY29tPg=="},"prevInTopic":64605,"nextInTopic":64636,"prevInTime":64606,"nextInTime":64608,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"Sometimes I think when one part of a person s body grows bigger, other parts haven t caught up.  It is possible that an older kid/young teen could have a","messageBody":"<div id=\"ygrps-yiv-231149172\">Sometimes I think when one part of a person&#39;s body grows bigger, other parts haven&#39;t caught up.  It is possible that an older kid/young teen could have a larger bladder than she was used to, around the same time she&#39;s needing more sleep than she used to.  It might not be &quot;a disease&quot; nor even &quot;a condition.&quot;   And it might, but no sense getting all nervous about it.   If it&#39;s natural growth business, she&#39;ll get used to it and do whatever it takes for her to not need the bathroom.<br/>\n<br/>\nAs to urinary tract infections, I had one once as a teen, and accidentally peeing the bed would have been impossible. It was almost impossible to go in the toilet, and burned like crazy.  <br/>\n<br/>\nAnd speaking of that in general, no one should go without water for convenience.  Dehydration is unhealthy.  It can lead to urinary tract infections, among other things. :-)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":484021822,"authorName":"kazimiria","from":"&quot;kazimiria&quot; &lt;johnsonscarandbody@...&gt;","profile":"kazimiria","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324665768","msgId":64605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpkMmkzOCs4MGczQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64594,"nextInTopic":64607,"prevInTime":64604,"nextInTime":64606,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"A family member of mine had this issue up until about 34 years old. It is called Enuresis and she should see a doctor. I t will not matter if she drinks right","messageBody":"<div id=\"ygrps-yiv-848099648\">A family member of mine had this issue up until about 34 years old. It is called Enuresis and she should see a doctor. I t will not matter if she drinks right before bed or not(at least in many cases) as it does not happen from the same mechanisms as a child who is not yet potty trained. Here is a link with some information. <a rel=\"nofollow\" target=\"_blank\" href=\"http://kidshealth.org/teen/diseases_conditions/urinary/enuresis.html\">http://kidshealth.org/teen/diseases_conditions/urinary/enuresis.html</a>  There is  a lot more info on google if you search &quot;Enuresis&quot;. Having a waterproof mattress pad to take along to family houses and a few sheet sets of your own and a container to put the wet stuff in to bring it home or wash descretly may may be a way to help her not have to &#39;share&#39; about it with family.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I have an interesting question (came by e-mail).  My middle child peed the bed until he was nine; it&#39;s more common in boys, I think.   This is an older person, and female:<br/>\n&gt; <br/>\n&gt; ---------------------------------------<br/>\n&gt; <br/>\n&gt; My fifteen-year-old daughter has had a few accidents over the last few weeks. I&#39;m not sure how many times--she usually doesn&#39;t tell me when it happens--I&#39;ve just found her wet clothes in the clothes hamper or the bidet a few times. She did actually wet her bed once, which she told me about. I told her it was no big deal and helped her change the sheets. Other times when I&#39;ve found the clothes I&#39;ve just simply washed them and asked her about it later when her little sister wasn&#39;t around. When I&#39;ve asked her about the wet clothes, she&#39;s told me that she wakes up and gets out of bed to go, but doesn&#39;t make it in time. Earlier today when I found them in the bidet I asked her to please put them in the washing machine and I would wash them for her. A few minutes ago she still hadn&#39;t done it. <br/>\n&gt; <br/>\n&gt; Once in the past I suggested not drinking so much at night, or maybe going to bed a little earlier so she&#39;s not so exhausted and &quot;out of it&quot; and can wake up more easily (She&#39;s a night person like me and keeps really late hours, but then also is a really, really deep sleeper.), and that if it did happen to please tell me so I could wash her clothes.  A few nights ago, really late, she was going to drink a can of tea and I stopped her. (Now after reading so much about food restrictions I could kick myself.) <br/>\n&gt; <br/>\n&gt; Tonight she asked if she could have a can of tea and I told her that I thought it wasn&#39;t a good idea considering what happened last night, but that it was her body. She said something like, &quot;So what does that mean? That confuses kids.&quot; I said, &quot;I mean that I&#39;ve told you my opinion, but it&#39;s your body and your choice.&quot; She drank it. She seems embarrassed by it, but not enough to try doing anything differently or to put the clothes in the washer or let me know so I can before everyone sees/smells them. I&#39;m worried how she would feel if one her friends dropped by and happened upon her wet clothes. And I don&#39;t think it&#39;s fair to her little sister who is disgusted by the smell. (They share a bathroom.) <br/>\n&gt; <br/>\n&gt; Should I not say or suggest anything at all, just wash the clothes if I notice them and act like it never happened? Should I make her wash the clothes? Could this be a physical problem or is this usually emotional? I haven&#39;t really noticed any new stressful situations that could contribute. I&#39;m not sure how to handle it. <br/>\n&gt; <br/>\n&gt; We&#39;re also supposed to go to my in-laws for a few days for Christmas, so there&#39;s the added complication of being in someone else&#39;s house to think about too. I&#39;m reading some interesting things in the archives, but wanted to mention specific things I&#39;ve said and done to see if there&#39;s something I could have done/could do differently. Any suggestions you guys could give me will be greatly appreciated! <br/>\n&gt; ----------------------------------<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peeing the bed; an older child","postDate":"1324503345","msgId":64594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBBQ0I2RTEzLTI4ODgtNDg0NS04NDI4LUQwRkQwOUI3QUUyQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDZGQzRGQzFELUMyRkYtNDgxOS1BN0IzLTFDRDEzRTUyODg4M0BsZW1vbmNyYWIuY29tPg==","referencesHeader":"PDZGQzRGQzFELUMyRkYtNDgxOS1BN0IzLTFDRDEzRTUyODg4M0BsZW1vbmNyYWIuY29tPg=="},"prevInTopic":64582,"nextInTopic":64605,"prevInTime":64593,"nextInTime":64595,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"This is from a list member who s child didn t want his name associated with the story. ======================= My son has a medical condition that causes his","messageBody":"<div id=\"ygrps-yiv-36116062\">This is from a list member who&#39;s child didn&#39;t want his name associated with the story.<br/>\n<br/>\n=======================<br/>\n<br/>\n <br/>\nMy son has a medical condition that causes his bladder to spasm.  When his bladder is really full (like after sleeping all night) and he has a spasm he can&#39;t stop the flow once it has started so he still has accidents at night on occasion.  He wore diapers to bed until some time last year when he felt really embarrassed that he still wore them at 9 years old. <br/>\n <br/>\nIf your daughter is feeling embarrassed about peeing in her bed , she might be embarrassed about you suggesting she wear a pad.  If you think so, maybe you could leave them in a place where she can see them, but not everyone else, like her underwear drawer.  Maybe along with tips you&#39;ve printed online on how to prevent bed wetting.<br/>\n <br/>\n=Should I not say or suggest anything at all, just wash the clothes if I notice them and act like it never happened? Should I make her wash the clothes?=<br/>\n <br/>\nSometimes when my son does have an accident they are so huge that he&#39;ll wake up covered from chest to knees in urine.  He&#39;ll tell me and while he cleans up I&#39;ll strip the bedding and wash it.  I really don&#39;t feel that I need to say anything about it.  At that point we both know he wet the bed. He doesn&#39;t want to wake up covered in urine and I don&#39;t want to shame or embarrass him because he did. <br/>\n <br/>\nHe has asked me on a couple of occasions what he can do about wetting the bed so, I know it&#39;s a concern of his. I&#39;ve mentioned setting an alarm in the middle of the night to wake him to go pee or maybe not sleeping so late. The biggest accidents he has are when he sleeps in.  If it&#39;s past 10AM and he is still asleep I will go ask him if he wants to wake up to go pee.  He usually does.<br/>\n <br/>\n=I&#39;m worried how she would feel if one her friends dropped by and happened upon her wet clothes.=<br/>\n <br/>\nBecause of the spasms, if my son holds going pee during the day he&#39;ll have a small accident.  I don&#39;t usually know about these until I see him in different clothes.  He changes his clothes and puts them in the hamper.  If I can smell urine I take his hamper and wash the clothes.  If he is having a friend over I take the entire hamper out of his room and put it in the laundry room every time just in case there is a smell I can&#39;t smell and I squirt a couple squirts of room freshener.  I know he doesn&#39;t want this to be happening and he certainly doesn&#39;t want his friends to know either.  I help him in ways that I can.<br/>\n <br/>\n=And I don&#39;t think it&#39;s fair to her little sister who is disgusted by the smell. (They share a bathroom.)=<br/>\n <br/>\nDisgusted sounds so strong.  Does the younger daughter make a big deal about being disgusted about the smell? Does the older daughter feel like her sister thinks she&#39;s disgusting?  Maybe your daughter can keep a hamper in her room so her sister doesn&#39;t have to be disgusted by the smell. <br/>\n <br/>\n=Tonight she asked if she could have a can of tea and I told her that I thought it wasn&#39;t a good idea considering what happened last night, but that it was her body. She said something like, &quot;So what does that mean? That confuses kids.&quot; I said, &quot;I mean that I&#39;ve told you my opinion, but it&#39;s your body and your choice.&quot; She drank it. She seems embarrassed by it,=<br/>\n <br/>\nHer reaction sounds like she feels judged.  Maybe because she asked if she could have a can of tea, not what whether or not you thought it was a good idea.  My son is very sensitive to even the slightest hint of judgement and I have found this page to be helpful when talking to him about things he is sensitive or embarrassed about:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a>  Did you not think it was a good idea because of the caffeine?  Or to have a drink at night?  If it was the caffeine, can you get decaf can tea so she can still have tea at night if she wants too?<br/>\nIf you decide to go to the doctor, I would talk with the office ahead of time about just checking her to make sure nothing is medically wrong and not focusing on bed wetting.  Because of my son&#39;s medical condition we see a urologist twice a year.  There was one time where the doctor asked about bed wetting.  When I said it still happens because of the spasms he jumped all over it and he spent a lot of time talking about how to fix bed wetting.  My son was really embarrassed to be sitting there while someone talked openly about him peeing the bed.<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223130287,"authorName":"Krisula Moyer","from":"Krisula Moyer &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Peeing the bed; an older child","postDate":"1324423619","msgId":64582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGQzRGQzFELUMyRkYtNDgxOS1BN0IzLTFDRDEzRTUyODg4M0BsZW1vbmNyYWIuY29tPg=="},"prevInTopic":64568,"nextInTopic":64594,"prevInTime":64581,"nextInTime":64583,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"Both my girls did this well into the preteen years.  The best thing I discovered (wish I had known about it all along)  was bed wetting pads that are smaller","messageBody":"<div id=\"ygrps-yiv-1151937177\">Both my girls did this well into the preteen years.  The best thing I discovered (wish I had known about it all along)  was bed wetting pads that are smaller than the mattress.  They are just about as big as a baby blanket.  My daughter sleeps on top of one and if she wets, the pad can be removed until morning without disrupting her sleep too much (she does this herself)  usually I just have to wash the pad and the top sheet.  (You can get these at <a rel=\"nofollow\" target=\"_blank\" href=\"http://bedwettingstore.com/reusable-waterproof-overlays.html)\">http://bedwettingstore.com/reusable-waterproof-overlays.html)</a>  Disposable chucks pads like the kind they use in hospitals work too, but my daughter didn&#39;t like the feeling of paper and plastic.  Under that and underneath the regular sheets I keep a rubber mattress pad to protect the mattress in case of shifting or whatever.<br/>\n<br/>\nThe pad can also go into a sleeping bag (or you can buy a &quot;sleeping bag liner&quot; at the same link).  My daughters tended to stay dry better while sleeping at a friend&#39;s house but in case they didn&#39;t the pad can be folded in half inside the sleeping bag and no one has to know it&#39;s there.  Just bring the whole thing home the next day and throw it in the wash.<br/>\n<br/>\nWith these practical matters taken care of, the bedwetting was no longer a big looming problem, just a slight laundry inconvenience that will pass in time.<br/>\n<br/>\nKrisula<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":484143809,"authorName":"mcve@ymail.com","from":"&quot;mcve@...&quot; &lt;marloes@...&gt;","profile":"mcve@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Peeing the bed; an older child","postDate":"1324348412","msgId":64568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjb3M1cytmaTNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIxQkY5MDc0LTY3M0QtNEZEOC05MjZFLTVDOTI5REQ1QTA4MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64556,"nextInTopic":64582,"prevInTime":64567,"nextInTime":64569,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"I am a Type One Diabetic and just before I was diagnosed (14yrs old) I occasionally wet the bed. This was due to the excessive drinking that is a symptom of","messageBody":"<div id=\"ygrps-yiv-617470744\">I am a Type One Diabetic and just before I was diagnosed (14yrs old) I occasionally wet the bed. This was due to the excessive drinking that is a symptom of untreated diabetes and the elevated blood glucose levels can also make you sleep very deeply.<br/>\n<br/>\nJust thought it might be worth checking out especially as Type One Diabetes can often show up in girls at puberty.<br/>\n<br/>\n<br/>\nExcessive thirst, sudden weight loss, pear drop smell to the breath and lethargy are some of the main symptoms.<br/>\n<br/>\nMarloes<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-However more than often bed wetting is fear and anxiety related.-=-<br/>\n&gt; <br/>\n&gt; In unschoolers?<br/>\n&gt; <br/>\n&gt; Mainstream information is out there everywhere.  It was an unschooling question, and the answers shouldn&#39;t be same-old stuff.<br/>\n&gt; <br/>\n&gt; I don&#39;t think saying &quot;more than often bed wetting is fear and anxiety related&quot; without some backup is a good thing to say, and the mom wasn&#39;t asking for causes.  She was asking about attitudes, assistance and tactics.<br/>\n&gt; <br/>\n&gt; -=-She did actually wet her bed once, which she told me about. I told her it was no big deal and helped her change the sheets.-=-<br/>\n&gt; <br/>\n&gt; If it&#39;s only been once that it went past her clothes, incontinence pads or even just sanitary pads would probably help.  The overnight panty liner pads hold quite a bit, but there are also thin, subtle pads for people who are likely to leak.    If you take those for her to use at night on the visits, and bags to take them out so the grandparents don&#39;t need to know, she might feel better.<br/>\n&gt; <br/>\n&gt; Maybe she&#39;s moving to a different sleep cycle.  Lots of teens sleep a lot, because their bodies are changing quickly.  And those changes could cause something like a new relationship between the time-range she&#39;s used to, and her sleep needs.  I bet she&#39;ll adjust.  I doubt it has anything to do with trauma or fears, but even if it does she could use pads for a while.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324335436","msgId":64556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjb2ZnYytjNmF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhOZDZMcVRONzRpNjRyQkN2d3RfcXllTGFuZlJ4NTdyNUx3dmV6U0VhMVFlUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":64553,"nextInTopic":64568,"prevInTime":64555,"nextInTime":64557,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"... When Morgan was a toddler, she d wet the bed if she was wearing underpants, but not if she wasn t. It didn t wake her up, we wouldn t know until morning,","messageBody":"<div id=\"ygrps-yiv-1767025819\">Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Then she wore it that night. As far as I know, it never went off<br/>\n&gt; and she never wet the bed again. Or maybe it went off when she wet just a<br/>\n&gt; tiny bit and that stopped her. Not sure.<br/>\n<br/>\n </span></blockquote>When Morgan was a toddler, she&#39;d wet the bed if she was wearing underpants, but not if she wasn&#39;t. It didn&#39;t wake her up, we wouldn&#39;t know until morning, but somehow no pants sent the right messages to her brain and she didn&#39;t pee. Even if the peeing isn&#39;t a psychological or emotional issue, psychology can play into it in unexpected ways. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":360161182,"authorName":"folkymom","from":"&quot;folkymom&quot; &lt;kelli@...&gt;","profile":"folkymom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324329679","msgId":64553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbzlzZitvYThsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjbTgyOSs5YXJjQGVHcm91cHMuY29tPg=="},"prevInTopic":64552,"nextInTopic":64556,"prevInTime":64552,"nextInTime":64554,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"Also, during adolescence, hormonal changes can bring on new allergies that can manifest in all sorts of ways. My teen recently became unable to eat anything","messageBody":"<div id=\"ygrps-yiv-860688348\">Also, during adolescence, hormonal changes can bring on new allergies that can manifest in all sorts of ways. My teen recently became unable to eat anything with dairy or gluten, after a childhood of having no problems with allergies. I am celiac, and before I went completely off gluten, I used to have to get up to pee at least 4-5 times every single night. I never would have thought that was gluten-related (it was just &#39;normal&#39; after it being that way for 20+ years), but it was a pleasant surprise to see that weird symptom go away after removing gluten from my diet!!<br/>\n<br/>\n~Kelli</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Peeing the bed; an older child","postDate":"1324317520","msgId":64552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOZDZMcVRONzRpNjRyQkN2d3RfcXllTGFuZlJ4NTdyNUx3dmV6U0VhMVFlUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpjbmN2Zys3bW03QGVHcm91cHMuY29tPg==","referencesHeader":"PDEzMjQyMjIyNjYuMzQ4Ni5ZYWhvb01haWxOZW9Ad2ViODE1MDQubWFpbC5tdWQueWFob28uY29tPgk8amNuY3ZnKzdtbTdAZUdyb3Vwcy5jb20+"},"prevInTopic":64551,"nextInTopic":64553,"prevInTime":64551,"nextInTime":64553,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"Roya was pretty old and still wetting the bed - maybe 7 or 8. She wasn t happy about it, but she s an extremely sound sleeper and there wasn t anything she","messageBody":"<div id=\"ygrps-yiv-1836460191\">Roya was pretty old and still wetting the bed - maybe 7 or 8. She wasn&#39;t<br/>\nhappy about it, but she&#39;s an extremely sound sleeper and there wasn&#39;t<br/>\nanything she could do about it. Her friend&#39;s mom told her about a little<br/>\nalarm thing that could tuck into her underpants at night. It would go off<br/>\n(buzz) at the first wetness. She played around with it, getting it slightly<br/>\ndamp, to see how wet it would need to be to go off and to hear/feel the<br/>\nbuzzer. Then she wore it that night. As far as I know, it never went off<br/>\nand she never wet the bed again. Or maybe it went off when she wet just a<br/>\ntiny bit and that stopped her. Not sure. She wore it for a week or so and<br/>\nthen we returned it. It was made to fit in a little tiny pocket sewn into<br/>\nunderpants that came with it - but she was way too big for the little<br/>\nunderpants, so we just sewed a little pocket into her own underwear and put<br/>\nit in there.<br/>\n<br/>\nThe neighbor told me she got it at Sears...no idea of these still exist or<br/>\nwhere to get them, but it was wonderful for her.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Dec 19, 2011 at 5:08 AM, Angela &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:argwolff@...\">argwolff@...</a>&gt; wrote:<br/>\n<br/>\n&gt; So while I know caffeine is a diuretic, I think biology and/or physiology<br/>\n&gt; plays a big role.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324300080","msgId":64551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbmN2Zys3bW03QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjQyMjIyNjYuMzQ4Ni5ZYWhvb01haWxOZW9Ad2ViODE1MDQubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":64549,"nextInTopic":64552,"prevInTime":64550,"nextInTime":64552,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"I did this, too. The last time I remember it happening where I didn t wake myself up was college. But I did it a lot -- what seemed like a lot to me -- as a","messageBody":"<div id=\"ygrps-yiv-440311321\">I did this, too. The last time I remember it happening where I didn&#39;t wake myself up was college. But I did it a lot -- what seemed like a lot to me -- as a teenager. Usually I&#39;d wake up before I&#39;d flooded the whole bed, but it definitely happened from time to time. <br/>\n<br/>\nI don&#39;t know that I ever told anybody when it happened. And I think it probably happened more when I was a teenager than it did when I was a kid. Maybe hormonal shifts played a part? Maybe I was more exhausted because of my schedule and the sports I was playing? Not sure.<br/>\n<br/>\nI do know that I was a very sound sleeper and that I wet the bed on a regular basis longer than either of my siblings did. My son is also a very sound sleeper and at 9 it&#39;s only been in the last year (or several months, I really can&#39;t keep track) that he&#39;s been dry with regularity and is only now comfortable sleeping over somebody&#39;s house without taking a pullup. <br/>\n<br/>\nI grew up in the south and drank caffeinated iced tea all day long, and in college I would often come home from work and drink a cup of coffee to relax before going to bed. But as an adult I only drink coffee in the morning and then I switch to water and I have to go to the bathroom at least once in the middle of the night almost every night. And my son and I seem to have to urinate more frequently during the day compared to my husband and my daughters. So while I know caffeine is a diuretic, I think biology and/or physiology plays a big role.<br/>\n<br/>\nIf you are sure there&#39;s nothing like an undiagnosed urinary tract infection going on, I&#39;d tell her that it&#39;s not something completely uncommon and ask her how she wants to handle it: switching to decaf; or setting an alarm to go to the bathroom a few hours after she&#39;s gone to bed; trying some of the herbal or homeopathic remedies; putting some sort of pad on the bed to save the mattress and just dealing with it when it happens ...<br/>\n<br/>\nI have found that many quilted pads also happen to be waterproof. You can get thin wool pads to put under the sheets (that&#39;s what my husband and I used on our own bed when co-cleeping with infants/toddlers). Many allergy/dust mite covers are water proof. <br/>\n<br/>\nGood luck,<br/>\nAngela in NJ<br/>\nwith Joseph, 9; Hannah, 6; and Miriam, 4<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My husband wet the bed  until his late teens, he actually said he did a couple time in his 20&#39;s and that the last time he<br/>\n&gt; did it he was 27.<br/>\n&gt; He said he would dream he was going to the bathroom and them he would go and  he would be in bed. <br/>\n&gt; All those times he was really really tired and he still sleeps in a very deep state so unlikely to wake up.<br/>\n&gt; That was the reason for him to wet the bed.<br/>\n&gt; <br/>\n&gt; Amazingly his mom  was real nice about it and he had a waterproof mattress pad in his bed and she never made him feel bad about it.<br/>\n&gt; She understood he was not doing it on purpose  and who would really  do that ?<br/>\n&gt; I suggest a waterproof mattress pad,  incontinence pads under the sheets and if she is going to someone house they sell<br/>\n&gt; lots of incontinence products at the drug store that she could wear under PJS and no one would see.<br/>\n&gt; It will most likely pass. Maybe not drink anything with caffeine hours before bed and make sure she does not <br/>\n&gt; have an urinary track infection.<br/>\n&gt; <br/>\n&gt; I am sure your daughter is mortified about doing it.  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; Alex Polikowsky<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324272320","msgId":64549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbWhzMCtqc2E5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64548,"nextInTopic":64551,"prevInTime":64548,"nextInTime":64550,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"I had a boyfriend who would sometimes pee the bed at 25.  As far as I know, he had no medical issues.  It just happened.  There may be nothing behind it.  Lisa","messageBody":"<div id=\"ygrps-yiv-1822425643\">I had a boyfriend who would sometimes pee the bed at 25.  As far as I know, he had no medical issues.  It just happened.  There may be nothing behind it.  Lisa</div>","specialLinks":[]},{"userId":411981224,"authorName":"apprentice_mom","from":"&quot;apprentice_mom&quot; &lt;justine@...&gt;","profile":"apprentice_mom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324262281","msgId":64548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbTgyOSs5YXJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64547,"nextInTopic":64549,"prevInTime":64547,"nextInTime":64549,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"... Given that this is a new development - or that is how I am reading this - I would also check to make sure there is no physical cause here.  Sometimes a UTI","messageBody":"<div id=\"ygrps-yiv-1919361465\"><blockquote><span title=\"ireply\">&gt; My fifteen-year-old daughter has had a few accidents over the last few weeks. I&#39;m not sure how many times--she usually doesn&#39;t tell me when it happens--I&#39;ve just found her wet clothes in the clothes hamper or the bidet a few times. She did actually wet her bed once, which she told me about. <br/>\n<br/>\n </span></blockquote>Given that this is a new development - or that is how I am reading this - I would also check to make sure there is no physical cause here.  Sometimes a UTI can be present without any or very subtle symptoms, and this can cause bladder issues.  I&#39;m not sure of the range of gynecological issues that could cause symptoms, or whether any of these would apply to the teen in question here, but I certainly would check this out.  Many things, such as UTI, can be screened for non-invasively (ie urine sample).  Just a thought.<br/>\n<br/>\nI agree with Sandra that the incontinence pads might be a good idea if it would help the teen feel more comfortable and especially with the added pressure of visiting relatives.<br/>\n<br/>\nJustine</div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324252016","msgId":64547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbHUxZyt1OGk0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwM2YwMWNjYmQ5MCQ3ZGIyNTA0MCQ3OTE2ZjBjMCRAYnRpbnRlcm5ldC5jb20+"},"prevInTopic":64546,"nextInTopic":64548,"prevInTime":64546,"nextInTime":64548,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"Early this year, my 6 yo had a UTI. Her only symptoms were a low-grade fever and a stomachache. The stomach flu was going through our family and it caused both","messageBody":"<div id=\"ygrps-yiv-1798407551\">Early this year, my 6 yo had a UTI. Her only symptoms were a low-grade fever and a stomachache. The stomach flu was going through our family and it caused both of those symptoms for some of us, so a UTI was the last thing I thought of!<br/>\n<br/>\nAndrea Q<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Yvonne Lyon&quot; &lt;ylyon@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I think I&#39;d want to encourage her to make sure there isn&#39;t a medical or<br/>\n&gt; mechanical reason.  She could have a UTI (they are sometimes asymptomatic)<br/>\n&gt; and a simple dip test would confirm it. </span></blockquote></div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324251766","msgId":64546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbHRwbStiOGdzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEExRUY4QTQzLTYzOTEtNERENy1CQjdDLUNEOEJCMTUzNEEwMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64542,"nextInTopic":64547,"prevInTime":64545,"nextInTime":64547,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"... We have waterproof mattress covers from the mattress store that are neither noisy nor hot nor sticky. They were about $80 for the twin size cover and","messageBody":"<div id=\"ygrps-yiv-383970358\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Waterproof mattress pads can be noisy and too hot.  Being sweaty in the bed is also wet and uncomfortable. :-)<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>We have waterproof mattress covers from the mattress store that are neither noisy nor hot nor sticky. They were about $80 for the twin size cover and around $200 for the king size cover. Expensive, but they really work. They feel like terry cloth on the front, but the back is rubberized. <br/>\n<br/>\nAndrea Q</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peeing the bed; an older child","postDate":"1324239356","msgId":64540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1RTIwMUM3LUU5NUEtNEUwQS1BOTgyLUVEQ0EzNjE2RUJCOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEExRUY4QTQzLTYzOTEtNERENy1CQjdDLUNEOEJCMTUzNEEwMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4gPENBRTA1UktQQzVvRGlMZHQ2cjNlcFJoOW95V0dISGZqazUyZVFYU0tLN3VpanQxZTlnQUBtYWlsLmdtYWlsLmNvbT4gPEUyMjEyNzcxLUM0RDEtNEMyNC1BMDZBLTgzN0E2NUNCRDE2QUB5YWhvby5jb20+IDwyMUJGOTA3NC02NzNELTRGRDgtOTI2RS01QzkyOURENUEwODJAU2FuZHJhZG9kZC5jb20+IDwxMzI0MjIyMjY2LjM0ODYuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4gPEExRUY4QTQzLTYzOTEtNERENy1CQjdDLUNEOEJCMTUzNEEwMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64534,"nextInTopic":64541,"prevInTime":64539,"nextInTime":64541,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"Two other data bits: ... Hi Sandra, I didn’t want to post to the list, as I have not posted before, but I just wanted to say my young daughter (5) has","messageBody":"<div id=\"ygrps-yiv-1910774449\">Two other data bits:<br/>\n<br/>\nFrom e-mail:<br/>\n-------------<br/>\n<br/>\nHi Sandra, I didn�t want to post to the list, as I have not posted before, but I just wanted to say my young daughter (5) has problems with bed wetting, and waterproof sheets have come on leaps and bounds lately. We use �B-Sensible� sheets, which look and feel like regular sheets, but have a silent, soft, waterproof backing. We�re in the UK, but I�m sure there must be a similar product in the US.<br/>\n <br/>\nI also wanted to say; I remember very vividly the humiliation I used to feel when my mother pointed out or brought up something unhygienic I had done, and I would just ignore her for as long as I could or kind of laugh hysterically as I didn�t know how else to react to it.<br/>\n<br/>\n----------------<br/>\nend of the e-mail<br/>\n----------<br/>\n<br/>\nI have a friend, grown now with three children, one of whom is grown.  Some of you met her last summer, Helene in Baud.   When she was a kid, ten or 11, she peed the bed sometimes and her mom went with the horrible shame her, hang the sheet out, tell-the-neighbors method.   I&#39;m glad that&#39;s rarer now than it was a few decades back.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":338201201,"authorName":"dkjsv05","from":"&quot;dkjsv05&quot; &lt;dkjsv05@...&gt;","profile":"dkjsv05@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324239334","msgId":64541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbGhsNis0dDZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64540,"nextInTopic":64542,"prevInTime":64540,"nextInTime":64542,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"~Should I not say or suggest anything at all, just wash the clothes if I notice them and act like it never happened? Should I make her wash the clothes?  Could","messageBody":"<div id=\"ygrps-yiv-597403072\">~Should I not say or suggest anything at all, just wash the clothes if I notice them and act like it never happened? Should I make her wash the clothes?  Could this be a physical problem or is this usually emotional? I haven&#39;t really noticed any new stressful situations that could contribute. I&#39;m not sure how to handle it.&quot;~<br/>\n<br/>\n********************<br/>\n<br/>\nHello,<br/>\n<br/>\nI think helping her come up with options that might keep her from getting the bed wet isn&#39;t a bad idea. Like mentioned there are all types of mattress covers or pads that can been worn. The pads may be a better choice to keep her clothes from getting wet too, eliminating the need to wash her wet clothes all together. Talking about how not drinking lots of fluids late at night right before bed might help also but let her be the one to make the decision. I probably would buy thick pads anyway to keep in her bathroom but not pressure in any way to use them.<br/>\n<br/>\nShe probably is really embarrassed about it. I use to play things off when I was embarrassed about something giving others the impression I didn&#39;t care but that wasn&#39;t true at all. I just didn&#39;t really know *how* to communicate my needs.<br/>\n<br/>\n~&quot; Should I make her wash the clothes?&quot;~<br/>\n<br/>\nDo you &quot;make&quot; her wash her own clothes now? If not she may see this as you trying to &quot;punish&quot; her for doing something wrong. If I was the one who wet the bed I would not be happy if my husband *made* me wash my clothes. I would probably want to anyway but if my husband went and got the washer started I would see that as a friend helping me out with an accident. <br/>\n<br/>\n~&quot;I&#39;m not sure how to handle it&quot;.~<br/>\n<br/>\nMaybe looking at it from the angle if you were the one wetting the bed instead of your daughter might help. How would you like to be treated if this happened to you? How would you have liked your parents to have handled something like this? Thinking things out like this has helped me SO much with my own healing process.<br/>\n<br/>\nKim</div>","specialLinks":[]},{"userId":216914372,"authorName":"riasplace3","from":"&quot;riasplace3&quot; &lt;riasplace3@...&gt;","profile":"riasplace3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peeing the bed; an older child","postDate":"1324237953","msgId":64542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbGdhMStla3VwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwM2YwMWNjYmQ5MCQ3ZGIyNTA0MCQ3OTE2ZjBjMCRAYnRpbnRlcm5ldC5jb20+"},"prevInTopic":64541,"nextInTopic":64546,"prevInTime":64541,"nextInTime":64543,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"... I would look for a medical reason first.  Especially if it s suddenly just started happening (from the original post it sounds like it is). My younger","messageBody":"<div id=\"ygrps-yiv-404595260\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Yvonne Lyon&quot; &lt;ylyon@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I think I&#39;d want to encourage her to make sure there isn&#39;t a medical or<br/>\n&gt; mechanical reason.  <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I would look for a medical reason first.  Especially if it&#39;s suddenly just started happening (from the original post it sounds like it is).  <br/>\n<br/>\nMy younger daughter says she feels like she has to pee constantly when she first starts her period, because of the pressure down there....could that perhaps be an issue?<br/>\n<br/>\nI would try buying her some disposable underwear (like Depends, but there are different brands), not the ones like diapers with tapes and stuff, but the ones that are made just like underwear and slip on.  They hold lots and stop leaks very well.  Plus, they&#39;re not too noticeable under clothes.....no one needs to know she&#39;s wearing them, or even that you&#39;ve bought them for her.  If she has an accident, she can just roll them up and throw them away, maybe leave a couple extra small garbage bags in the bathroom in case she wants to double bag them.<br/>\n<br/>\nRia</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peeing the bed; an older child","postDate":"1324224226","msgId":64533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExRUY4QTQzLTYzOTEtNERENy1CQjdDLUNEOEJCMTUzNEEwMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMjQyMjIyNjYuMzQ4Ni5ZYWhvb01haWxOZW9Ad2ViODE1MDQubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4gPENBRTA1UktQQzVvRGlMZHQ2cjNlcFJoOW95V0dISGZqazUyZVFYU0tLN3VpanQxZTlnQUBtYWlsLmdtYWlsLmNvbT4gPEUyMjEyNzcxLUM0RDEtNEMyNC1BMDZBLTgzN0E2NUNCRDE2QUB5YWhvby5jb20+IDwyMUJGOTA3NC02NzNELTRGRDgtOTI2RS01QzkyOURENUEwODJAU2FuZHJhZG9kZC5jb20+IDwxMzI0MjIyMjY2LjM0ODYuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":64532,"nextInTopic":64534,"prevInTime":64532,"nextInTime":64534,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"-=-I suggest a waterproof mattress pad,  incontinence pads under the sheets and if she is going to someone house they sell lots of incontinence products at the","messageBody":"<div id=\"ygrps-yiv-613069619\">-=-I suggest a waterproof mattress pad,  incontinence pads under the sheets and if she is going to someone house they sell lots of incontinence products at the drug store that she could wear under PJS and no one would see.<br/>\nIt will most likely pass.-=-<br/>\n<br/>\nWaterproof mattress pads can be noisy and too hot.  Being sweaty in the bed is also wet and uncomfortable. :-)<br/>\n<br/>\nBut the incontinence pads and disposable &quot;adult diapers&quot; for nighttime aren&#39;t so uncomfortable.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peeing the bed; an older child","postDate":"1324222266","msgId":64532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjQyMjIyNjYuMzQ4Ni5ZYWhvb01haWxOZW9Ad2ViODE1MDQubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PDIxQkY5MDc0LTY3M0QtNEZEOC05MjZFLTVDOTI5REQ1QTA4MkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4gPENBRTA1UktQQzVvRGlMZHQ2cjNlcFJoOW95V0dISGZqazUyZVFYU0tLN3VpanQxZTlnQUBtYWlsLmdtYWlsLmNvbT4gPEUyMjEyNzcxLUM0RDEtNEMyNC1BMDZBLTgzN0E2NUNCRDE2QUB5YWhvby5jb20+IDwyMUJGOTA3NC02NzNELTRGRDgtOTI2RS01QzkyOURENUEwODJAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":64531,"nextInTopic":64533,"prevInTime":64531,"nextInTime":64533,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"My husband wet the bed  until his late teens, he actually said he did a couple time in his 20 s and that the last time he did it he was 27. He said he would","messageBody":"<div id=\"ygrps-yiv-820141333\">My husband wet the bed  until his late teens, he actually said he did a couple time in his 20&#39;s and that the last time he<br/>\ndid it he was 27.<br/>\nHe said he would dream he was going to the bathroom and them he would go and  he would be in bed. <br/>\nAll those times he was really really tired and he still sleeps in a very deep state so unlikely to wake up.<br/>\nThat was the reason for him to wet the bed.<br/>\n<br/>\nAmazingly his mom  was real nice about it and he had a waterproof mattress pad in his bed and she never made him feel bad about it.<br/>\nShe understood he was not doing it on purpose  and who would really  do that ?<br/>\nI suggest a waterproof mattress pad,  incontinence pads under the sheets and if she is going to someone house they sell<br/>\nlots of incontinence products at the drug store that she could wear under PJS and no one would see.<br/>\nIt will most likely pass. Maybe not drink anything with caffeine hours before bed and make sure she does not <br/>\nhave an urinary track infection.<br/>\n<br/>\nI am sure your daughter is mortified about doing it.  <br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":289073156,"authorName":"Yvonne Lyon","from":"&quot;Yvonne Lyon&quot; &lt;ylyon@...&gt;","profile":"ylyon2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Peeing the bed; an older child","postDate":"1324218156","msgId":64534,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2YwMWNjYmQ5MCQ3ZGIyNTA0MCQ3OTE2ZjBjMCRAYnRpbnRlcm5ldC5jb20+"},"prevInTopic":64533,"nextInTopic":64540,"prevInTime":64533,"nextInTime":64535,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"I think I d want to encourage her to make sure there isn t a medical or mechanical reason.  She could have a UTI (they are sometimes asymptomatic) and a simple","messageBody":"<div id=\"ygrps-yiv-254748017\">I think I&#39;d want to encourage her to make sure there isn&#39;t a medical or<br/>\nmechanical reason.  She could have a UTI (they are sometimes asymptomatic)<br/>\nand a simple dip test would confirm it.   Or even something like<br/>\ninterstitial cystitis which can be caused by lots of acidic and sugary<br/>\ndrinks - including the dreaded cranberry juice that people are encouraged to<br/>\ndrink if they think they have a uti (its terrible stuff really because of<br/>\nthe sugar). IC can manifest itself as urgency and/or frequency along with<br/>\nspasm in the urethra which can lead to accidents.  Experimenting with<br/>\nstaying away from sodas for a while may improve things.<br/>\n<br/>\n <br/>\n<br/>\nIf the bed is a concern - We have waterproof covers on our bed that go on<br/>\ntop of our sheets to catch the occasional accident that my 4 year old has<br/>\nand save us from changing an entire kingsize bed. - They have thick cotton<br/>\nlayers either side of a waterproof layer and aren&#39;t at all rustly or hot to<br/>\nsleep on and it means we only have to wash and replace that  one absorbent<br/>\nlayer - The cover is about 1m square and you just take it off and pop it<br/>\nthrough the washing machine and leave hang to dry - so we keep 3 in rotation<br/>\nthat can be swopped over.  Any older child would be able to just whip it off<br/>\nand pop it by the washing machine with minimal embarrassment and return to a<br/>\ndry bed.<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peeing the bed; an older child","postDate":"1324192280","msgId":64531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxQkY5MDc0LTY3M0QtNEZEOC05MjZFLTVDOTI5REQ1QTA4MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEUyMjEyNzcxLUM0RDEtNEMyNC1BMDZBLTgzN0E2NUNCRDE2QUB5YWhvby5jb20+","referencesHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4gPENBRTA1UktQQzVvRGlMZHQ2cjNlcFJoOW95V0dISGZqazUyZVFYU0tLN3VpanQxZTlnQUBtYWlsLmdtYWlsLmNvbT4gPEUyMjEyNzcxLUM0RDEtNEMyNC1BMDZBLTgzN0E2NUNCRDE2QUB5YWhvby5jb20+"},"prevInTopic":64530,"nextInTopic":64532,"prevInTime":64530,"nextInTime":64532,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"-=-However more than often bed wetting is fear and anxiety related.-=- In unschoolers? Mainstream information is out there everywhere.  It was an unschooling","messageBody":"<div id=\"ygrps-yiv-387522291\">-=-However more than often bed wetting is fear and anxiety related.-=-<br/>\n<br/>\nIn unschoolers?<br/>\n<br/>\nMainstream information is out there everywhere.  It was an unschooling question, and the answers shouldn&#39;t be same-old stuff.<br/>\n<br/>\nI don&#39;t think saying &quot;more than often bed wetting is fear and anxiety related&quot; without some backup is a good thing to say, and the mom wasn&#39;t asking for causes.  She was asking about attitudes, assistance and tactics.<br/>\n<br/>\n-=-She did actually wet her bed once, which she told me about. I told her it was no big deal and helped her change the sheets.-=-<br/>\n<br/>\nIf it&#39;s only been once that it went past her clothes, incontinence pads or even just sanitary pads would probably help.  The overnight panty liner pads hold quite a bit, but there are also thin, subtle pads for people who are likely to leak.    If you take those for her to use at night on the visits, and bags to take them out so the grandparents don&#39;t need to know, she might feel better.<br/>\n<br/>\nMaybe she&#39;s moving to a different sleep cycle.  Lots of teens sleep a lot, because their bodies are changing quickly.  And those changes could cause something like a new relationship between the time-range she&#39;s used to, and her sleep needs.  I bet she&#39;ll adjust.  I doubt it has anything to do with trauma or fears, but even if it does she could use pads for a while.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"Alex Polikowsy","from":"Alex Polikowsy &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peeing the bed; an older child","postDate":"1324190551","msgId":64530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyMjEyNzcxLUM0RDEtNEMyNC1BMDZBLTgzN0E2NUNCRDE2QUB5YWhvby5jb20+","inReplyToHeader":"PENBRTA1UktQQzVvRGlMZHQ2cjNlcFJoOW95V0dISGZqazUyZVFYU0tLN3VpanQxZTlnQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4gPENBRTA1UktQQzVvRGlMZHQ2cjNlcFJoOW95V0dISGZqazUyZVFYU0tLN3VpanQxZTlnQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":64529,"nextInTopic":64531,"prevInTime":64529,"nextInTime":64531,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"Or just someone who sleeps very deeply and does not wake up  to pee like my husband who wet the bed in his teens and even a few times in his 20,s. I will write","messageBody":"<div id=\"ygrps-yiv-417021500\">Or just someone who sleeps very deeply and does not wake up  to pee like my husband who wet the bed in his teens and even a few times in his 20,s.<br/>\nI will write more tomorrow.<br/>\nAlex Polikowsky<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 17, 2011, at 11:40 PM, Dola Dasgupta &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:doladg@...\">doladg@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I have had my close cousins and some friends whose children have wet beds<br/>\n&gt; till very late...my own son wet his bed for some time when my family was<br/>\n&gt; going through a lot of turmoil. Possible areas to look at:<br/>\n&gt; <br/>\n&gt; YOUNGER KIDS&quot;<br/>\n&gt; <br/>\n&gt; 1. Worms. (can be easily cured)<br/>\n&gt; <br/>\n&gt; 2. Fear that is based on some emotional turmoil or anxiety. (like anger,<br/>\n&gt; rage, domination in the family)<br/>\n&gt; <br/>\n&gt; OLDER KIDS<br/>\n&gt; <br/>\n&gt; 1. Emotional turmoil due to anger, rage and such emotions in the family.<br/>\n&gt; <br/>\n&gt; 2,Deep anxiety<br/>\n&gt; <br/>\n&gt; 3. Sexual fears. (areas to look at is if the child has seen some sexual<br/>\n&gt; act, content, or heard stories, or even subject to some abuse which is<br/>\n&gt; being supressed)<br/>\n&gt; <br/>\n&gt; However more than often bed wetting is fear and anxiety related.<br/>\n&gt; <br/>\n&gt; If any one has faith in Homeopathy medicines or Bach flower remedies. They<br/>\n&gt; have some miraculous cures too...harmless and with no side effects.<br/>\n&gt; <br/>\n&gt; Dola<br/>\n&gt; <br/>\n&gt; On Sun, Dec 18, 2011 at 10:21 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt; **<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I have an interesting question (came by e-mail). My middle child peed the<br/>\n&gt; &gt; bed until he was nine; it&#39;s more common in boys, I think. This is an older<br/>\n&gt; &gt; person, and female:<br/>\n&gt; &gt;<br/>\n&gt; &gt; ---------------------------------------<br/>\n&gt; &gt;<br/>\n&gt; &gt; My fifteen-year-old daughter has had a few accidents over the last few<br/>\n&gt; &gt; weeks. I&#39;m not sure how many times--she usually doesn&#39;t tell me when it<br/>\n&gt; &gt; happens--I&#39;ve just found her wet clothes in the clothes hamper or the bidet<br/>\n&gt; &gt; a few times. She did actually wet her bed once, which she told me about. I<br/>\n&gt; &gt; told her it was no big deal and helped her change the sheets. Other times<br/>\n&gt; &gt; when I&#39;ve found the clothes I&#39;ve just simply washed them and asked her<br/>\n&gt; &gt; about it later when her little sister wasn&#39;t around. When I&#39;ve asked her<br/>\n&gt; &gt; about the wet clothes, she&#39;s told me that she wakes up and gets out of bed<br/>\n&gt; &gt; to go, but doesn&#39;t make it in time. Earlier today when I found them in the<br/>\n&gt; &gt; bidet I asked her to please put them in the washing machine and I would<br/>\n&gt; &gt; wash them for her. A few minutes ago she still hadn&#39;t done it.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Once in the past I suggested not drinking so much at night, or maybe going<br/>\n&gt; &gt; to bed a little earlier so she&#39;s not so exhausted and &quot;out of it&quot; and can<br/>\n&gt; &gt; wake up more easily (She&#39;s a night person like me and keeps really late<br/>\n&gt; &gt; hours, but then also is a really, really deep sleeper.), and that if it did<br/>\n&gt; &gt; happen to please tell me so I could wash her clothes. A few nights ago,<br/>\n&gt; &gt; really late, she was going to drink a can of tea and I stopped her. (Now<br/>\n&gt; &gt; after reading so much about food restrictions I could kick myself.)<br/>\n&gt; &gt;<br/>\n&gt; &gt; Tonight she asked if she could have a can of tea and I told her that I<br/>\n&gt; &gt; thought it wasn&#39;t a good idea considering what happened last night, but<br/>\n&gt; &gt; that it was her body. She said something like, &quot;So what does that mean?<br/>\n&gt; &gt; That confuses kids.&quot; I said, &quot;I mean that I&#39;ve told you my opinion, but<br/>\n&gt; &gt; it&#39;s your body and your choice.&quot; She drank it. She seems embarrassed by it,<br/>\n&gt; &gt; but not enough to try doing anything differently or to put the clothes in<br/>\n&gt; &gt; the washer or let me know so I can before everyone sees/smells them. I&#39;m<br/>\n&gt; &gt; worried how she would feel if one her friends dropped by and happened upon<br/>\n&gt; &gt; her wet clothes. And I don&#39;t think it&#39;s fair to her little sister who is<br/>\n&gt; &gt; disgusted by the smell. (They share a bathroom.)<br/>\n&gt; &gt;<br/>\n&gt; &gt; Should I not say or suggest anything at all, just wash the clothes if I<br/>\n&gt; &gt; notice them and act like it never happened? Should I make her wash the<br/>\n&gt; &gt; clothes? Could this be a physical problem or is this usually emotional? I<br/>\n&gt; &gt; haven&#39;t really noticed any new stressful situations that could contribute.<br/>\n&gt; &gt; I&#39;m not sure how to handle it.<br/>\n&gt; &gt;<br/>\n&gt; &gt; We&#39;re also supposed to go to my in-laws for a few days for Christmas, so<br/>\n&gt; &gt; there&#39;s the added complication of being in someone else&#39;s house to think<br/>\n&gt; &gt; about too. I&#39;m reading some interesting things in the archives, but wanted<br/>\n&gt; &gt; to mention specific things I&#39;ve said and done to see if there&#39;s something I<br/>\n&gt; &gt; could have done/could do differently. Any suggestions you guys could give<br/>\n&gt; &gt; me will be greatly appreciated!<br/>\n&gt; &gt; ----------------------------------<br/>\n&gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; -- <br/>\n&gt; thou-art-thy-creator<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://thouartthycreator.wordpress.com/\">http://thouartthycreator.wordpress.com/</a><br/>\n&gt; <br/>\n&gt; *&quot;Be kind to yourself and others,*<br/>\n&gt; *Come from love every moment you can,*<br/>\n&gt; *Speak of love with others. Remind each other of your spiritual purpose,*<br/>\n&gt; *Never give up hope,*<br/>\n&gt; *Know that you are loved.&quot; - Deepak Chopra from Love Sutras...*<br/>\n&gt; *<br/>\n&gt; *<br/>\n&gt; *&#39;Laughter we share generates more laughter, and the love we create<br/>\n&gt; together spreads by leaps and bounds.&#39; *<br/>\n&gt; *<br/>\n&gt; *<br/>\n&gt; *Much love and warmth*<br/>\n&gt; * Dola Dasgupta*<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":458624268,"authorName":"Dola Dasgupta","from":"Dola Dasgupta &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peeing the bed; an older child","postDate":"1324186846","msgId":64529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRTA1UktQQzVvRGlMZHQ2cjNlcFJoOW95V0dISGZqazUyZVFYU0tLN3VpanQxZTlnQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64528,"nextInTopic":64530,"prevInTime":64528,"nextInTime":64530,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"I have had my close cousins and some friends whose children have wet beds till very late...my own son wet his bed for some time when my family was going","messageBody":"<div id=\"ygrps-yiv-987722434\">I have had my close cousins and some friends whose children have wet beds<br/>\ntill very late...my own son wet his bed for some time when my family was<br/>\ngoing through a lot of turmoil. Possible areas to look at:<br/>\n<br/>\nYOUNGER KIDS&quot;<br/>\n<br/>\n1. Worms. (can be easily cured)<br/>\n<br/>\n2. Fear that is based on some emotional turmoil or anxiety. (like anger,<br/>\nrage, domination in the family)<br/>\n<br/>\nOLDER KIDS<br/>\n<br/>\n1. Emotional turmoil due to anger, rage and such emotions in the family.<br/>\n<br/>\n2,Deep anxiety<br/>\n<br/>\n3. Sexual fears. (areas to look at is if the child has seen some sexual<br/>\nact, content,  or heard stories, or even subject to some abuse which is<br/>\nbeing supressed)<br/>\n<br/>\n<br/>\nHowever more than often bed wetting is fear and anxiety related.<br/>\n<br/>\nIf any one has faith in Homeopathy medicines or Bach flower remedies. They<br/>\nhave some miraculous cures too...harmless and with no side effects.<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Dec 18, 2011 at 10:21 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I have an interesting question (came by e-mail). My middle child peed the<br/>\n&gt; bed until he was nine; it&#39;s more common in boys, I think. This is an older<br/>\n&gt; person, and female:<br/>\n&gt;<br/>\n&gt; ---------------------------------------<br/>\n&gt;<br/>\n&gt; My fifteen-year-old daughter has had a few accidents over the last few<br/>\n&gt; weeks. I&#39;m not sure how many times--she usually doesn&#39;t tell me when it<br/>\n&gt; happens--I&#39;ve just found her wet clothes in the clothes hamper or the bidet<br/>\n&gt; a few times. She did actually wet her bed once, which she told me about. I<br/>\n&gt; told her it was no big deal and helped her change the sheets. Other times<br/>\n&gt; when I&#39;ve found the clothes I&#39;ve just simply washed them and asked her<br/>\n&gt; about it later when her little sister wasn&#39;t around. When I&#39;ve asked her<br/>\n&gt; about the wet clothes, she&#39;s told me that she wakes up and gets out of bed<br/>\n&gt; to go, but doesn&#39;t make it in time. Earlier today when I found them in the<br/>\n&gt; bidet I asked her to please put them in the washing machine and I would<br/>\n&gt; wash them for her. A few minutes ago she still hadn&#39;t done it.<br/>\n&gt;<br/>\n&gt; Once in the past I suggested not drinking so much at night, or maybe going<br/>\n&gt; to bed a little earlier so she&#39;s not so exhausted and &quot;out of it&quot; and can<br/>\n&gt; wake up more easily (She&#39;s a night person like me and keeps really late<br/>\n&gt; hours, but then also is a really, really deep sleeper.), and that if it did<br/>\n&gt; happen to please tell me so I could wash her clothes. A few nights ago,<br/>\n&gt; really late, she was going to drink a can of tea and I stopped her. (Now<br/>\n&gt; after reading so much about food restrictions I could kick myself.)<br/>\n&gt;<br/>\n&gt; Tonight she asked if she could have a can of tea and I told her that I<br/>\n&gt; thought it wasn&#39;t a good idea considering what happened last night, but<br/>\n&gt; that it was her body. She said something like, &quot;So what does that mean?<br/>\n&gt; That confuses kids.&quot; I said, &quot;I mean that I&#39;ve told you my opinion, but<br/>\n&gt; it&#39;s your body and your choice.&quot; She drank it. She seems embarrassed by it,<br/>\n&gt; but not enough to try doing anything differently or to put the clothes in<br/>\n&gt; the washer or let me know so I can before everyone sees/smells them. I&#39;m<br/>\n&gt; worried how she would feel if one her friends dropped by and happened upon<br/>\n&gt; her wet clothes. And I don&#39;t think it&#39;s fair to her little sister who is<br/>\n&gt; disgusted by the smell. (They share a bathroom.)<br/>\n&gt;<br/>\n&gt; Should I not say or suggest anything at all, just wash the clothes if I<br/>\n&gt; notice them and act like it never happened? Should I make her wash the<br/>\n&gt; clothes? Could this be a physical problem or is this usually emotional? I<br/>\n&gt; haven&#39;t really noticed any new stressful situations that could contribute.<br/>\n&gt; I&#39;m not sure how to handle it.<br/>\n&gt;<br/>\n&gt; We&#39;re also supposed to go to my in-laws for a few days for Christmas, so<br/>\n&gt; there&#39;s the added complication of being in someone else&#39;s house to think<br/>\n&gt; about too. I&#39;m reading some interesting things in the archives, but wanted<br/>\n&gt; to mention specific things I&#39;ve said and done to see if there&#39;s something I<br/>\n&gt; could have done/could do differently. Any suggestions you guys could give<br/>\n&gt; me will be greatly appreciated!<br/>\n&gt; ----------------------------------<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nthou-art-thy-creator<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thouartthycreator.wordpress.com/\">http://thouartthycreator.wordpress.com/</a><br/>\n<br/>\n*&quot;Be kind to yourself and others,*<br/>\n*Come from love every moment you can,*<br/>\n*Speak of love with others. Remind each other of your spiritual purpose,*<br/>\n*Never give up hope,*<br/>\n*Know that you are loved.&quot; - Deepak Chopra from Love Sutras...*<br/>\n*<br/>\n*<br/>\n*&#39;Laughter we share generates more laughter, and the love we create<br/>\ntogether spreads by leaps and bounds.&#39; *<br/>\n*<br/>\n*<br/>\n*Much love and warmth*<br/>\n* Dola Dasgupta*<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Peeing the bed; an older child","postDate":"1324183912","msgId":64528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDQjczOTk3LTdCRUQtNDg4MS1BMzg2LUQyMEU1REYxNTAwQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":64529,"prevInTime":64527,"nextInTime":64529,"topicId":64528,"numMessagesInTopic":0,"msgSnippet":"... My fifteen-year-old daughter has had a few accidents over the last few weeks. I m not sure how many times--she usually doesn t tell me when it","messageBody":"<div id=\"ygrps-yiv-340027733\">I have an interesting question (came by e-mail).  My middle child peed the bed until he was nine; it&#39;s more common in boys, I think.   This is an older person, and female:<br/>\n<br/>\n---------------------------------------<br/>\n<br/>\nMy fifteen-year-old daughter has had a few accidents over the last few weeks. I&#39;m not sure how many times--she usually doesn&#39;t tell me when it happens--I&#39;ve just found her wet clothes in the clothes hamper or the bidet a few times. She did actually wet her bed once, which she told me about. I told her it was no big deal and helped her change the sheets. Other times when I&#39;ve found the clothes I&#39;ve just simply washed them and asked her about it later when her little sister wasn&#39;t around. When I&#39;ve asked her about the wet clothes, she&#39;s told me that she wakes up and gets out of bed to go, but doesn&#39;t make it in time. Earlier today when I found them in the bidet I asked her to please put them in the washing machine and I would wash them for her. A few minutes ago she still hadn&#39;t done it. <br/>\n<br/>\nOnce in the past I suggested not drinking so much at night, or maybe going to bed a little earlier so she&#39;s not so exhausted and &quot;out of it&quot; and can wake up more easily (She&#39;s a night person like me and keeps really late hours, but then also is a really, really deep sleeper.), and that if it did happen to please tell me so I could wash her clothes.  A few nights ago, really late, she was going to drink a can of tea and I stopped her. (Now after reading so much about food restrictions I could kick myself.) <br/>\n<br/>\nTonight she asked if she could have a can of tea and I told her that I thought it wasn&#39;t a good idea considering what happened last night, but that it was her body. She said something like, &quot;So what does that mean? That confuses kids.&quot; I said, &quot;I mean that I&#39;ve told you my opinion, but it&#39;s your body and your choice.&quot; She drank it. She seems embarrassed by it, but not enough to try doing anything differently or to put the clothes in the washer or let me know so I can before everyone sees/smells them. I&#39;m worried how she would feel if one her friends dropped by and happened upon her wet clothes. And I don&#39;t think it&#39;s fair to her little sister who is disgusted by the smell. (They share a bathroom.) <br/>\n<br/>\nShould I not say or suggest anything at all, just wash the clothes if I notice them and act like it never happened? Should I make her wash the clothes? Could this be a physical problem or is this usually emotional? I haven&#39;t really noticed any new stressful situations that could contribute. I&#39;m not sure how to handle it. <br/>\n<br/>\nWe&#39;re also supposed to go to my in-laws for a few days for Christmas, so there&#39;s the added complication of being in someone else&#39;s house to think about too. I&#39;m reading some interesting things in the archives, but wanted to mention specific things I&#39;ve said and done to see if there&#39;s something I could have done/could do differently. Any suggestions you guys could give me will be greatly appreciated! <br/>\n----------------------------------</div>","specialLinks":[]}],"prevTopicId":64606,"nextTopicId":64520}}