{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] bored and lonely teens part II","postDate":"1107467194","msgId":103093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyQTg1NUYzLTc2MkQtMTFEOS04M0FFLTAwMEE5NTdFRkU0NkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMGEwMWM1MGExOCRhYmJlNWU4MCQ0Mjg4ODE0MUBvZW1jb21wdXRlcj4=","referencesHeader":"PDAwMGEwMWM1MGExOCRhYmJlNWU4MCQ0Mjg4ODE0MUBvZW1jb21wdXRlcj4="},"prevInTopic":103083,"nextInTopic":0,"prevInTime":103092,"nextInTime":103094,"topicId":103078,"numMessagesInTopic":0,"msgSnippet":"Gosh Amy - you made me cry. What a thing you ve done! Thank you SO much for sharing it. -pam","messageBody":"<div id=\"ygrps-yiv-1577014672\">Gosh Amy - you made me cry. What a thing you&#39;ve done! Thank you SO much <br/>\nfor sharing it.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 3, 2005, at 9:49 AM, Amy Childs wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; I wanted to post a follow-up, because I had some insights through this <br/>\n&gt; process that I want to share, and because we thought of something new <br/>\n&gt; that hadn&#39;t yet been mentioned. </span></blockquote></div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] bored and lonely teens part II","postDate":"1107459721","msgId":103083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMDI3RTg5LjcwODAzMDRAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDAwMGEwMWM1MGExOCRhYmJlNWU4MCQ0Mjg4ODE0MUBvZW1jb21wdXRlcj4=","referencesHeader":"PDAwMGEwMWM1MGExOCRhYmJlNWU4MCQ0Mjg4ODE0MUBvZW1jb21wdXRlcj4="},"prevInTopic":103078,"nextInTopic":103093,"prevInTime":103082,"nextInTime":103084,"topicId":103078,"numMessagesInTopic":0,"msgSnippet":"** At the same time, she also needs and wants to learn to separate from me, which I think must feel impossible for her when I am the only deep companion she","messageBody":"<div id=\"ygrps-yiv-110822740\">** At the same time, she also needs and wants to learn to separate from <br/>\nme, which I think must feel impossible for her when I am the only deep <br/>\ncompanion she has.<br/>\n<br/>\nWhat we created together was a &quot;circle&quot; of women with whom she felt <br/>\ncomfortable and respected. This wasn&#39;t easy, as she vetoed many people I <br/>\nthought would be great, but we came up with a list of 5 older (than her <br/>\n- most were in their 20s) women who fit the bill.**<br/>\n<br/>\nThis is really, really cool and thoughtful.<br/>\n<br/>\nIsn&#39;t it strange in our society that we give our kids/teens adults to <br/>\nspend time with, namely teachers, who often can&#39;t be trusted as <br/>\nconfidants because their agenda (from the system) is so much at cross <br/>\npurposes with what kids need.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":79168236,"authorName":"Amy Childs","from":"&quot;Amy Childs&quot; &lt;amyc@...&gt;","profile":"aimmee36","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"bored and lonely teens part II","postDate":"1107452949","msgId":103078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWM1MGExOCRhYmJlNWU4MCQ0Mjg4ODE0MUBvZW1jb21wdXRlcj4="},"prevInTopic":0,"nextInTopic":103083,"prevInTime":103077,"nextInTime":103079,"topicId":103078,"numMessagesInTopic":0,"msgSnippet":"I wrote last month [ bored and lonely unschooling teens ] about my 14yo daughter Kayla. I appreciated the input from Kelly, Sandra and Pam - thank you. It is","messageBody":"<div id=\"ygrps-yiv-1108022846\">I wrote last month [ &quot;bored and lonely unschooling teens&quot; ] about my 14yo daughter Kayla. I appreciated the input from Kelly, Sandra and Pam - thank you. It is amazing how good it can feel to know that there are others out in the universe who are thinking well about me and my daughter, and who are willing to offer their good thoughts in my direction. I think I speak on behalf of the [hundreds?] of occassional-skim-lurkers like myself, when I say thanks for your commitment to unschooling, to the unschooling community, and to keeping this list going strong.<br/>\n<br/>\nI wanted to post a follow-up, because I had some insights through this process that I want to share, and because we thought of something new that hadn&#39;t yet been mentioned.<br/>\n<br/>\nIt has taken many conversations (sometimes snuggled and happy, sometimes irritated, sometimes long, sometimes short) for me to hear what Kayla was asking for. In fact, I&#39;m sure that I still do not have it grasped completely (and for that matter, she probably doesn&#39;t either). <br/>\n<br/>\nWhat I am discovering is that Kayla feels that projects, books, classes, groups, clubs, trips, movies, events and choirs - as fun as they might (or might not) be - are not the solution for what ails her. I think to her, they seem almost a distraction from what her heart longs for, which I am increasingly seeing as desire to find her true self, and her place in the world. <br/>\n<br/>\nIn our busy, production-oriented culture, there is not much space given to people of any age (much less adolescent girls), to quietly, honestly and gently discover themselves. Even though Kayla has the philosophical space (from me, and from unschooling) to embark on this journey, she feels a lack of companionship, mentoring, and collaborating along the way. She has me, and she adores me, but I am only one person. At the same time, she also needs and wants to learn to separate from me, which I think must feel impossible for her when I am the only deep companion she has.<br/>\n<br/>\nWhat we created together was a &quot;circle&quot; of women with whom she felt comfortable and respected. This wasn&#39;t easy, as she vetoed many people I thought would be great, but we came up with a list of 5 older (than her - most were in their 20s) women who fit the bill. I sent a letter to these women asking for a 4-week commitment to have one heart-to-heart conversation with Kayla per week, to share in a &quot;side by side playtime&quot; (as Sandra might call it) of self-discovery. The response was amazingly positive, everyone was thrilled to be asked and excited to participate. Perhaps I shouldn&#39;t have been so surprised, given that most human beings seem to long for a deeper sense of connection and belonging.  I guess many people are disconnected from their hearts&#39; desires, and there is often no structure - no class, no club, no party, no project - that encourages and supports us in discovering and sharing our personal truths and inner selves.<br/>\n<br/>\nIt may turn out that in our attempt to feed Kayla&#39;s needs, she ends up giving more than she receives. Seems that life often works out that way. I think we as a species have much to learn about what it is to be human, female, empowered, interconnected and happy. Perhaps it will be the unschooling-14-year-old-girls who lead the way.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":103072,"nextTopicId":103098}}