{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":51,"messages":[{"userId":338201201,"authorName":"dkjsv05","from":"&quot;dkjsv05&quot; &lt;dkjsv05@...&gt;","profile":"dkjsv05@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Mums and computers","postDate":"1311370233","msgId":61940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowY3E1cCtvYXJhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowYzFpZCt0dXEwQGVHcm91cHMuY29tPg=="},"prevInTopic":61939,"nextInTopic":61941,"prevInTime":61939,"nextInTime":61941,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"Hello, I have been silently lurking here for several months but had to jump in here. As one who has just recently lifted all bans off media/ screens there is","messageBody":"<div id=\"ygrps-yiv-1593273925\">Hello, I have been silently lurking here for several months but had to jump in here. As one who has just recently lifted all bans off media/ screens there is so much I can relate to.<br/>\n<br/>\n  To give a very brief history this will be our first year unschooling  but not homeschooling. We are switching after several years of homeschooling using Waldorf education. To those that may not be familiar this means no screens of any kind. I am mother to 3 girls ages 21( off enjoying her life in San Francisco) , 10, and 5. <br/>\n<br/>\nI am learning SO very much here, thank you to everyone who takes their time and shares. <br/>\n<br/>\n&quot;I&#39;m struck by the similarity of the worries about video games people have to the<br/>\nworries we had in my house growing up.&quot;<br/>\n<br/>\nAfter reading Priscilla&#39;s reply it made me think of a time when I was a teenager (um when apple had just came out with the first computer and video games were played at the mall:)) I fell in love with John Steinbeck. One weekend in particular I was really getting in with The Red Pony when my dad came in and yelled at me to go outside that it was way to nice out to have my nose stuck in a book. Granted reading this was for my own pleasure not school related in any way. So I went outside to read. This did not make him happy and he came up and ripped the book out of my hands and said that&#39;s not what I meant. I can still remember how I felt that day. He completely saw me as being lazy without thinking that maybe I just needed to veg after a very stressful week of high school.  <br/>\n<br/>\nRight now my children are enjoying every minute of having the ban lifted. They even got a television added in their room by request(where they are right now as I type this). Already I have seen new passions take off and not the academic type we sometimes get hooked on. Instead of all of us sitting on the couch &quot;together&quot; listening to a read aloud we are sitting on the couch &quot;together&quot; watching episodes of new favorite shows. To be honest not much has really changed except my children are a lot happier and to me that is what counts.<br/>\n<br/>\nAgain really enjoying all the wealth of knowledge here,<br/>\nKim</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Mums and computers","postDate":"1311369747","msgId":61938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowY3BtaitibHY4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1VzhrQzhxaFV4d1lnXz1aZVh5TmloOTVrdVNRNzJ3UkMzbi1YczI2NU8tT01FUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":61937,"nextInTopic":61939,"prevInTime":61937,"nextInTime":61939,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... How possible is it for him to be active while also playing games or using his laptop? If he s stuck choosing between being active and doing something he","messageBody":"<div id=\"ygrps-yiv-1294834469\">Claire Darbaud &lt;cdarbaud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;If he didn&#39;t get out of bed all day reading books<br/>\n&gt; after books, even if one book was a manga and the next one was a treaty of<br/>\n&gt; physics, or he he was switching between books and computer without leaving<br/>\n&gt; the sofa, I&#39;d still be worried about his physical inactivity.<br/>\n<br/>\n </span></blockquote>How possible is it for him to be active while also playing games or using his laptop? If he&#39;s stuck choosing between being active and doing something he enjoys... well, its not hard to guess what he&#39;d choose. Look for ways to make it easier for him to do both. Some kids like a mini-trampoline or one of those exercise balls to sit on when they play. Ask if he&#39;d be interested. If you&#39;re hanging around, you can also suggest he get up and stretch while he&#39;s waiting for something to load - load screens are wonderful for that sort of thing. <br/>\n<br/>\nYou mentioned in the other post he wanted to do something - I don&#39;t recall what - but then when the time came didn&#39;t want to stop what he was doing. It might help to come at that from another angle. If he seems like he really does want to do other things, then help him do them. Remind him, kindly, as a friend - hey we&#39;re going to do X in half an hour, so find a place to save soon. It can help alot to avoid phrasing that as a question - sometimes tossing &quot;do you still want to do this?&quot; into the mix is too much in the moment and its better to assume he wants to keep to his previous decision. That doesn&#39;t mean to &quot;put your foot down&quot; if he&#39;s suddenly very resistant, but it could be good to offer him some reminders, most especially that he&#39;ll be able to get back to his game after he does the other fun thing he wants to do. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;if I take him to our doctor,<br/>\n&gt; she will just be horrified that I have no limits on sugar or screen time and<br/>\n&gt; will give me a very hard time<br/>\n<br/>\n </span></blockquote>So don&#39;t hand out that kind of information. Treat a doctor as a hired consultant - that&#39;s what they are. You hire a doctor to find something out. Say &quot;I&#39;m concerned because he has less energy, he doesn&#39;t have his usual verve and enthusiasm.&quot; How&#39;s his diet? Pretty normal for a kid his age. How much exercise? About as much as if he were in school all day and had a long bus ride. From your description, those are fair comparisons! Don&#39;t set your consultant up to feed your fears about diet and exercise, set him or her up to do some bloodwork and run some tests. He could have something as simple as an infection throwing off his system to something like lyme disease - don&#39;t confuse the issue with &quot;I&#39;m worried about the Wii&quot;.<br/>\n<br/>\nBut!!! it could be just as good to wait another couple months and change the home environment First. Be more supportive. Be friendly. Work more on being positive and inviting - because its possible he&#39;s avoiding you or some other kind of environmental stress. Set things up so he doesn&#39;t have a reason to retreat from the rest of his life. <br/>\nIf you&#39;re worried about food, bring in some options you feel good about - like soda, try some other brands, play around with making your own with soda water and juice or flavorings. Create foods which are attractive and tasty and convenient. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Mums and computers","postDate":"1311368148","msgId":61937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowY280aytlZjFtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTEzMTk0NjkuNTcyMTAuWWFob29NYWlsUkNAd2ViODM5MTQubWFpbC5zcDEueWFob28uY29tPg=="},"prevInTopic":61936,"nextInTopic":61938,"prevInTime":61936,"nextInTime":61938,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... What do you mean there wasn t time? You have a set bedtime? It would have been better to ask him to have a bite to eat first, or bring him a plate of food","messageBody":"<div id=\"ygrps-yiv-1357122686\">amy benton &lt;treewolf@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;When told there wasn&#39;t time to play the game <br/>\n&gt; he immediately began crying, escalating to almost screaming.<br/>\n<br/>\n </span></blockquote>What do you mean there wasn&#39;t time? You have a set bedtime? It would have been better to ask him to have a bite to eat first, or bring him a plate of food he could eat during the game - harder with some games than others. Better to extend whatever bedtime you have so he can touch base with his favorite thing than to pick a fight with him over it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I helped him to process his feelings...<br/>\n<br/>\n </span></blockquote>Did you think that would make them go away? That&#39;s a common mistake. People need to feel their feelings. &quot;Processing&quot; - understanding where the feelings are coming from - doesn&#39;t make the feelings less real or intense, it just provides a little context. If your son has never had an intense reaction to something before, then it could be daunting to you. It may help to consider that he never experienced passion before. He&#39;s found something which touches him in broad, deep ways - that&#39;s marvelous! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This extreme reaction bothered me ( I do understand his disappointment ) and <br/>\n&gt; makes me less inclined to let him play to his heart&#39;s content<br/>\n<br/>\n </span></blockquote>I was shocked when I first started learning about unschooling and found the idea of passion applied to children. On a cultural level, passion is a dirty word when applied to children. Children are expected to move from one thing to another with interest, but no passion. They&#39;re expected to be lukewarm and &quot;well-rounded&quot; rather than have the strength of feeling of adults. A child expressing strong feelings is bad and wrong. <br/>\n<br/>\nAnd yet, children are People. They love and aspire, they experience exhileration, loathing, rapture, grief and terror. They aren&#39;t picture-book cut-outs of children, they&#39;re human beings who can be deeply stirred - and being children, they&#39;ll express that in big ways because they don&#39;t yet have the skills to do so subtly. Kids can grow into subtlety when they&#39;re allowed to feel their feelings rather than stuff them down as inconvenient to adults. Your son won&#39;t always express vast disappointment in such gigantic ways. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Have recently read Michael Gurian and he discusses how in the 4-6 age <br/>\n&gt; range, a child may be distracted from their core nature by material things, and <br/>\n&gt; video games in particular<br/>\n<br/>\n </span></blockquote>The worst thing about theories like this is that they ignore the humanity of individucal children in favor of an ideal of childhood - that&#39;s the &quot;core nature&quot;: an imaginary ideal of what a child should be. <br/>\n<br/>\nIf you want to know who your real child is right now, see what makes him smile - what makes him light up with delight? What stirs his passions and gets him all wrapped up in what he&#39;s doing? That&#39;s what&#39;s important to him right now.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311356935","msgId":61934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCMTFBNUMxLUU4QjYtNDdGOS1BNDVELUIwRTEwRkExOTNGNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTEzMzY0MzguNTU4OTAuWWFob29NYWlsUkNAd2ViODczMTkubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+IDwxMzExMzE5NDY5LjU3MjEwLllhaG9vTWFpbFJDQHdlYjgzOTE0Lm1haWwuc3AxLnlhaG9vLmNvbT4gPDEzMTEzMzY0MzguNTU4OTAuWWFob29NYWlsUkNAd2ViODczMTkubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":61920,"nextInTopic":61936,"prevInTime":61933,"nextInTime":61935,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"-=- I helped him to process his feelings, expressed how disappointed he must feel, and reminded him of his fun day and that the game would be available ","messageBody":"<div id=\"ygrps-yiv-1274267850\">-=- I helped him to process his feelings, expressed how disappointed he <br/>\nmust feel, and reminded him of his fun day and that the game would be available <br/>\ntomorrow. I gave him time to calm down and eat if he chose ( he even said how <br/>\nhungry he was but that he was not going to eat ). -=-<br/>\n<br/>\nI would be really angry if anyone did that to me.  If I were gone all day and someone told me I couldn&#39;t check my e-mail, and then tried to feed me, I wouldn&#39;t want that food.  I wouldn&#39;t want that house.  I wouldn&#39;t want that person.<br/>\n<br/>\nNo one could help me process my feelings in such a case. <br/>\nSomeone who didn&#39;t understand that I had been polite all day, and thinking all day of when I could check e-mail, would not be my friend.  They would not be my partner.  If I had a choice, I would not stay at that house anymore. <br/>\n<br/>\n<br/>\nIf you wanted him to eat, because of the purpose of food and nutrition, the best thing to do would have been to let him get on his game and put easily-eaten food nearby.   If food is important, that would have been best.  If he had been waiting to do something with which he was fascinated, letting him do it would have been best.  If the relationship between the parent and child is important, that would have been best.<br/>\n<br/>\nIt&#39;s not too late to do that next time.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/focus\">http://www.sandradodd.com/focus</a><br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":475612941,"authorName":"e_tamika@y7mail.com","from":"&quot;e_tamika@...&quot; &lt;e_tamika@...&gt;","profile":"e_tamika@y7mail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Mums and computers","postDate":"1311345278","msgId":61939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYzFwdSt2bGczQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg=="},"prevInTopic":61938,"nextInTopic":61940,"prevInTime":61938,"nextInTime":61940,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-371978339\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;corinnaspellerberg@...&quot; &lt;Corinna.Spellerberg@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Hi<br/>\n&gt; I&#39;ve recently joined this group, have been home educating for three years and slowly growing into unschooling. We are UK based, my kids are 12 and 13.<br/>\n&gt; We have decided to skip the computer limit of an hour a day and try &quot;no limits&quot;. With the oldest, it works fine, as he does other things, but the youngest is almost addicted, hardly any time to eat. Now I have read all the interesting stuff on Sandra&#39;s site about video games, and I know it will get better, and all that. I try to be patient. However, my problem is slightly different: When will I ever get to talk to them/see them? Because I understand for unschooling to &quot;work&quot; we would need to talk, at least occasionally? I feel I hardly have any contact with them right now, apart from car rides to activities. Part of my problem is that I feel left out. I can&#39;t help it, they are so close, have so much fun, and I feel bored and want to spent more time with them. I can hear you say: Easy, just play with them then. But I&#39;m not keen on PC games, and feel I would have to change totally to learn to like it. Plus they are not ultra keen to have me there all the time. Maybe they are just growing up and I haven&#39;t adjusted to that yet?<br/>\n&gt; Any ideas appreciated ...<br/>\n&gt; Corinna<br/>\n&gt;Hi Corinna, I&#39;ve been homeschooling for 3yrs now a 12yr old boy and 11yr old girl 2yrs.  I have decided to take some time off for myself ie. I used to love riding bikes and walking, running.  My kids now do what I want to for a change instead of me sitting on the sideline and watching netball and football game after game.  They played fantastically mind you but I&#39;m sick of just sitting and watching, so I&#39;ve decided to do what I want to or used to do pre-kids.  It has taken some adjustment but they are eventually coming around and loving it we plan on taking part in some events all going well.  My 12yr old son is addicited to computer games and will do anything to get onto the computer.  He is very computer savy and mostly all self taught.  I try to restrict because he can do other things plus the cost of running the computer etc.  You don&#39;t have to play computer games just to spend time with your kids.  My kids have to help out with the dishes or help with the cooking on ocassions, even craft.  I know my son is not to keen on craft but if it has a boy theme like water bombs or prirates hats or some other boy theme my son will join in but not the flowers. Maybe they like fixing things a bike or wood work, helping digging in the garden, shooting hoops but then I like running around.  I don&#39;t know if this has been of any use.  But good luck! </span></blockquote></div>","specialLinks":[]},{"userId":221105640,"authorName":"bobcatpris2000","from":"&quot;bobcatpris2000&quot; &lt;bobcatpris2000@...&gt;","profile":"bobcatpris2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Mums and computers","postDate":"1311345037","msgId":61936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYzFpZCt0dXEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+"},"prevInTopic":61934,"nextInTopic":61937,"prevInTime":61935,"nextInTime":61937,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... I m struck by the similarity of the worries about video games people have to the worries we had in my house growing up. I was the oldest of 4, all","messageBody":"<div id=\"ygrps-yiv-761774124\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Corinna Spellerberg &lt;Corinna.Spellerberg@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Thanks ladies, and gentleman, for all your kind advice. I am doing most of the things you have pointed out. Bringing food, listening to their excited success stories, of course I do all that, I love them, I&#39;m their Mum. I&#39;m still sad about the lack of time, a mere lack of opportunity. I remember talks about valuable things such as current news, animals. Computer games now take up so much of our precious time together, and sitting next to them is just not the same as having a real conversation, about which you all seem to be so happy, just like I was.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m struck by the similarity of the worries about video games people have to the worries we had in my house growing up. <br/>\n<br/>\nI was the oldest of 4, all traditionally schooled. We got our first set of World Book encyclopedias when I was in the 8th grade. The four of us wouldn&#39;t leave the living room. It was a whole world opening up for us. Sure there were encyclopedias in the public school library and the public library, but we were always rushed in both places, either by teachers or mom. So to have the equivalent of a tiny computer&#39;s worth of knowledge in our home back then was unbelievable for us, and we already had a lot of books! We read in the new encyclopedias about India, and Albert Einstein, and pyramids, and dog breeds, and Harry Houdini, and so much more. It was glorious for us, but my mother got sick of us &quot;holed up in there laying around reading&quot;. I hadn&#39;t thought of that memory in years. It was just too much of a good thing, she thought - all that reading, when there were others things to be doing.<br/>\n<br/>\nMy traditional mother said all the same things to limit our use of the new encyclopedias: &quot;Aren&#39;t you getting eyestrain, don&#39;t you need to get up and move around and not just sit there, stop that and come eat dinner with your family, don&#39;t spill food, take a shower, do your homework, clean up your room, check the laundry, feed the dog, let the dog out, come here when I call you, go outside and play&quot;. But we were so happy we wanted to sleep in there with them like we would do the days after Christmas, when we would bask in comfort and holiday happiness around our Christmas tree. <br/>\n<br/>\nThe sad thing about the &quot;playing outside&quot; wish that parents have was that later when my younger sister started getting into a lot of trouble in school. My two youngest sisters *chose* to play outside as much as they possibly could, because there was so much strife in our house for a few years. Playing outside away from the turmoil in their own home was a happier place to be. It was away from family and encyclopedias, though, and almost 40 years later they are just getting past it, the *having to choose* to play outside to get peace.<br/>\n<br/>\nPriscilla Sanstead</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311341338","msgId":61920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzNDEzMzguNDc5OTguWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+","referencesHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+"},"prevInTopic":61919,"nextInTopic":61934,"prevInTime":61919,"nextInTime":61921,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"    ","messageBody":"<div id=\"ygrps-yiv-1302665037\"> <br/>\n<br/>\n  <br/>\n&lt;&lt;&lt;Thanks ladies, and gentleman, for all your kind advice. I am doing most of the things you have pointed out. Bringing food, listening to their excited success stories, of course I do all that, I love them, I&#39;m their Mum. I&#39;m still sad about the lack of time, a mere lack of opportunity. I remember talks about valuable things such as current news, animals. Computer games now take up so much of our precious time together, and sitting next to them is just not the same as having a real conversation, about which you all seem to be so happy, just like I was....&gt;&gt;&gt;&gt;&#92;<br/>\n<br/>\n<br/>\nWhy be sad? you are still no valuing a found passion. You should be happy for them they have something they love are engaged doing,.<br/>\nMy son loves video games and his computer. He spends a lot of time on them watching videos , playing games and making stuff ( videos, stick figure animation etc) He also does other stuff like basketball, 4-H, Cub Scouts.Just two days ago he was telling me about a funny video he watched about the US history. He has been interested since watching a few TV shows with us and learning about the US independence from England and the Civil War. He is into that now. <br/>\n He has learned to read and write from playing video games. He is a fabulous speller, he is always sharing with me something he found on his computer and I do the same with him.  <br/>\nAlex Polikowsky<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311338585","msgId":61919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzMzg1ODUuNjg2LllhaG9vTWFpbFJDQHdlYjg3MzEyLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzMTEzMTk0NjkuNTcyMTAuWWFob29NYWlsUkNAd2ViODM5MTQubWFpbC5zcDEueWFob28uY29tPg==","referencesHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+IDwxMzExMzE5NDY5LjU3MjEwLllhaG9vTWFpbFJDQHdlYjgzOTE0Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":61916,"nextInTopic":61920,"prevInTime":61918,"nextInTime":61920,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... must feel, and reminded him of his fun day and that the game would be available tomorrow.  I gave him time to calm down and eat if he chose ( he even said","messageBody":"<div id=\"ygrps-yiv-1744071244\"><blockquote><span title=\"ireply\">&gt;&gt; I helped him to process his feelings, expressed how disappointed he <br/>\n<br/>\n </span></blockquote>must feel, and reminded him of his fun day and that the game would be available <br/>\ntomorrow.  I gave him time to calm down and eat if he chose ( he even said how <br/>\nhungry he was but that he was not going to eat ).  He still chose not to eat.  <br/>\n&lt;&lt;<br/>\n<br/>\nI am assuming the phrase &quot;process his feelings&quot; is some kind of jargon. I <br/>\nassume, because I really don&#39;t know, that it is a term that means that you tried <br/>\nto talk over what he was feeling to help him to move on from how he was feeling. <br/>\nIs that right? It didn&#39;t really work. And, given that your goal was for him to <br/>\nget over it or you&#39;d take away his computer games, I don&#39;t know that you were <br/>\ndoing it right. <br/>\n<br/>\n<br/>\nYou were in a position to change his situation and were telling him that you <br/>\nunderstood how unhappy he was given that the situation was what it was. That&#39;s <br/>\nkind of, almost a contradiction. It&#39;s lip service of a kind. If he&#39;d missed out <br/>\non something because circumstances happened to run against him, that would be <br/>\none thing. But the scenario was that you&#39;d decided he needed to not play on the <br/>\ncomputer and that you weren&#39;t going to let him. Being sympathetic is different, <br/>\nI think, then causing the roadblock and then saying you understand the <br/>\nfrustration someone has when wanting to get around the unpassable roadblock that <br/>\nyou put up. It&#39;s kind of a villian in a movies foil, like Nurse Ratched in One <br/>\nFlew Over the Cuckoo&#39;s Nest. Lots of verbal sympathy without any matching <br/>\nactions. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311336438","msgId":61916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzMzY0MzguNTU4OTAuWWFob29NYWlsUkNAd2ViODczMTkubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PDEzMTEzMTk0NjkuNTcyMTAuWWFob29NYWlsUkNAd2ViODM5MTQubWFpbC5zcDEueWFob28uY29tPg==","referencesHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+IDwxMzExMzE5NDY5LjU3MjEwLllhaG9vTWFpbFJDQHdlYjgzOTE0Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":61915,"nextInTopic":61919,"prevInTime":61915,"nextInTime":61917,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"However, his behavior this evening was upsetting.  After a day spent with his friend, we arrived home in time to shower, eat dinner, and go to bed.  When told","messageBody":"<div id=\"ygrps-yiv-1007705293\">However, his behavior this evening was <br/>\nupsetting.  After a day spent with his friend, we arrived home in time to <br/>\nshower, eat dinner, and go to bed.  When told there wasn&#39;t time to play the game <br/>\n<br/>\nhe immediately began crying, escalating to almost screaming.  He refused to eat <br/>\ndinner.  I helped him to process his feelings, expressed how disappointed he <br/>\nmust feel, and reminded him of his fun day and that the game would be available <br/>\ntomorrow.  I gave him time to calm down and eat if he chose ( he even said how <br/>\nhungry he was but that he was not going to eat ).  He still chose not to eat.  <br/>\nThis extreme reaction bothered me ( I do understand his disappointment ) and <br/>\nmakes me less inclined to let him play to his heart&#39;s content.  Any feedback??<br/>\n<br/>\n-------------<br/>\n<br/>\nWhen Simon goes out for the day one of the things he really looks forward to is <br/>\ncoming home and doing something on the computer. If I smacked down his hopes for <br/>\ndoing that I imagine he&#39;d be pretty pissed off. Could he have eaten dinner while <br/>\nplaying at the computer? Could he have taken a shower in the morning? Could he <br/>\nhave played a little later into the evening rather than going to bed at his <br/>\nusually bedtime? Were there more options available to you than seeing his <br/>\nupsetness as being some sort of evidence that video games are controlling him?<br/>\n<br/>\nImagine that you&#39;d had a really big day and were hungry and tired and came home <br/>\nto be told that you couldn&#39;t do something that you really wanted to do. <br/>\nSomething that you&#39;d thought about in moments when you were out with pleasure <br/>\nand anticipation. Something that you knew would help to relax you, to wind you <br/>\ndown. Have a glass of wine, or a piece of bread that you&#39;d baked that morning. <br/>\nWatch a television show that was on that evening, read the next chapter in a <br/>\nbook that you were really enjoying. Someone who had power over you decided that <br/>\nyou couldn&#39;t do whatever it was that you were wanting to do because you needed <br/>\nto eat dinner, shower and go to bed. Would you savor your meal? Would you enjoy <br/>\nthe feeling of the warm water cascading over you in the shower? Would you fall <br/>\nasleep peacefully? Or would each and every one of those experiences be tainted <br/>\nby the power that someone else had wielded over you, poisoned by your own <br/>\npowerlessness, your weakness in the face of someone else&#39;s flexed muscle?<br/>\n<br/>\nI would have gone on a hunger strike, too. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311335216","msgId":61915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzMzUyMTYuNTE3OS5ZYWhvb01haWxSQ0B3ZWI4NzMxMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PENBRzB1VzhrQzhxaFV4d1lnXz1aZVh5TmloOTVrdVNRNzJ3UkMzbi1YczI2NU8tT01FUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRzB1Vzg9V1B5N0FmX3pEaW5Wem1IV1BjM0pLM0tLbz1qUllLcm9BT3I0ZUp0ZTVfUUBtYWlsLmdtYWlsLmNvbT4gPGowYWcycCtnczNuQGVHcm91cHMuY29tPiA8Q0FHMHVXOGtDOHFoVXh3WWdfPVplWHlOaWg5NWt1U1E3MndSQzNuLVhzMjY1Ty1PTUVRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":61912,"nextInTopic":61916,"prevInTime":61914,"nextInTime":61916,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"What are you taking your fear to? How far are you letting it run? If he continues to not be as physically active as he once was, do you see him becoming a","messageBody":"<div id=\"ygrps-yiv-1556048723\">What are you taking your fear to? How far are you letting it run? If he <br/>\ncontinues to not be as physically active as he once was, do you see him becoming <br/>\na muscleless mass who doesn&#39;t move at all? Some kind of new human without the <br/>\nability to move more than is needed to control a handheld controller? We&#39;ve had <br/>\nbooks for a long time and I&#39;m not sure if there is a subset of the population <br/>\nwho are so without muscles that they are unable to move between bed and bathroom <br/>\nand kitchen and get out to the grocery store when required. <br/>\n<br/>\n<br/>\nMaybe it&#39;s obesity that you think is inevitable if Jolan doesn&#39;t get out of the <br/>\nhouse to the park more. I don&#39;t know. I don&#39;t know if it&#39;s going to the park <br/>\nthat keeps kids from being obese. It didn&#39;t inoculate lots of people I&#39;ve known. <br/>\nMy guess, which is informed both by David&#39;s science and my experience, is that <br/>\nit doesn&#39;t really matter. If you make exercise a requirement in his life it <br/>\nwon&#39;t be anything he&#39;s doing by choice and it will probably, resoundingly, <br/>\nbackfire. If you make him go to the park or go swimming as a sort of fee for <br/>\naccess to his computer, I can&#39;t even picture how that would be a good and <br/>\nsuccessful strategy. How that would do anything other than making the computer <br/>\nthe most amazing thing in his life. <br/>\n<br/>\n<br/>\nJolan moves like crazy when he&#39;s playing. I&#39;ve seen him. He was all over the <br/>\ncouch with excitment and action and bounding. I think maybe you are in a bit of <br/>\na blind panic. Breathe a lot more, but slowly. Offer things not in moments of <br/>\npanic, but in moments of wanting to share. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\nI&#39;m not equating all as the same things. I am just worried about the amount<br/>\nof time spent immobile. If he didn&#39;t get out of bed all day reading books<br/>\nafter books, even if one book was a manga and the next one was a treaty of<br/>\nphysics, or he he was switching between books and computer without leaving<br/>\nthe sofa, I&#39;d still be worried about his physical inactivity.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311331525","msgId":61908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzMzE1MjUuNDc2MjguWWFob29NYWlsUkNAd2ViODczMTUubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":61906,"nextInTopic":61910,"prevInTime":61907,"nextInTime":61909,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... Your children are 12 and 13 and you have only just changed the rules to allow video game access at greater levels. You re nervous and feel that you ve","messageBody":"<div id=\"ygrps-yiv-1320782798\"><blockquote><span title=\"ireply\">&gt;&gt; I&#39;m still sad about the lack of time, a mere lack of opportunity. I remember <br/>\n&gt;&gt;talks about valuable things such as current news, animals. Computer games now <br/>\n&gt;&gt;take up so much of our precious time together, and sitting next to them is just <br/>\n&gt;&gt;not the same as having a real conversation, about which you all seem to be so <br/>\n&gt;&gt;happy, just like I was.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Your children are 12 and 13 and you have only just changed the rules to allow <br/>\nvideo game access at greater levels. You&#39;re nervous and feel that you&#39;ve somehow <br/>\nshunted your charges into scary waters. Your youngest, you argue, is outside of <br/>\nthe unschooling model because he/she has an addiction response to video games. <br/>\nAnd in response you justify your desire to limit their time on the computer by <br/>\nsaying that you can&#39;t unschool if you can&#39;t talk to them. How can you possibly <br/>\ntalk to them if all they want to talk about is something you aren&#39;t interested <br/>\nin?<br/>\n<br/>\nGoodness. What&#39;s a mum to do?<br/>\n<br/>\nSimon and I are sitting at adjacent computers at the moment. We have three set <br/>\nup in the living room (well, four, but I don&#39;t like the laptop so it hasn&#39;t been <br/>\nused for a while), two are on the same table. He&#39;s watching Starcraft II vids <br/>\n(his description) on youtube. About 2 minutes ago he and I had a staredown with <br/>\nme slowly rolling the chair I&#39;m on away from him. He chased me down and cuddled <br/>\nand we talked for maybe 30 seconds and then went back to what we had been doing. <br/>\nSimon&#39;s 14. At 14 I didn&#39;t talk much to my parents. I certainly didn&#39;t chase <br/>\nthem down when they had initiated a game by rolling away from me in a rolling <br/>\noffice chair. At 14 my parents didn&#39;t talk much to me. I could go off on a rant <br/>\npossibly similar to the one that Meredith avoided a few e-mails ago. But I <br/>\nwon&#39;t. I&#39;ll just say that because I&#39;m willing to work to be with my children <br/>\nthey are willing to work to be with me. <br/>\n<br/>\n<br/>\nHave you ever been with someone who is really gifted at conversation? They are <br/>\ncapable of listening well enough to the other people involved and to add enough <br/>\nthat the conversation just flows. The listening and the support of the <br/>\nconversation are really key. Maybe that&#39;s something that you lack. Maybe you are <br/>\ntrying to hard to not find anything interesting in computer games that the <br/>\nconversation dies as soon as you try and join it. Or doesn&#39;t even start because <br/>\nthey know from previous encounters that you are unwilling to explore the ideas <br/>\nand esperiences that they are so excited by. <br/>\n<br/>\n<br/>\nInterestingly we talk alot about animals and current news and chairs and paint <br/>\nball guns and moths and cookies and cakes and birthdays and ukuleles and bottle <br/>\nbasses and cameras and video games and what&#39;s coming out next and movies and <br/>\nlots and lots of things. Even with a life that has 4 computers, 2 xbox 360s, a <br/>\nps2, a gamecube and 3 televisions (actually 4, but that one is in a closet for <br/>\nsome reason) we talk a lot of the time. And we hang out and we laugh and we play <br/>\nand we cuddle and we seek each other out to explore and discuss and share. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311328570","msgId":61906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzMjg1NzAuNDE5MTguWWFob29NYWlsUkNAd2ViODczMDkubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGowYWVpdCs5cW8wQGVHcm91cHMuY29tPg==","referencesHeader":"PGowYWVpdCs5cW8wQGVHcm91cHMuY29tPg=="},"prevInTopic":61902,"nextInTopic":61908,"prevInTime":61905,"nextInTime":61907,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"Rowan Atkinson was on Top Gear, a UK car television show, the other day and I watched it last night on the BBC iplayer. Simon commented that the only thing he ","messageBody":"<div id=\"ygrps-yiv-2043214659\">Rowan Atkinson was on Top Gear, a UK car television show, the other day and I <br/>\nwatched it last night on the BBC iplayer. Simon commented that the only thing he <br/>\nreally liked that Rowan Atkinson had done was Black Adder. I said I really liked <br/>\nMr. Bean, the television series, as well. I liked it because Linnaea used to <br/>\nlaugh and laugh watching him. I would never have watched Mr. Bean if it hadn&#39;t <br/>\nbeen for Simon and Linnaea. I would never have seen Rowan Atkinson&#39;s brilliant <br/>\ncontrol over his face, or watched a man put on a swimsuit without taking off his <br/>\ntrouser&#39;s first <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=yKB1SBu4olk&feature=BFa&list=PL02FDB9E622299742&index=6\">http://www.youtube.com/watch?v=yKB1SBu4olk&feature=BFa&list=PL02FDB9E622299742&index=6</a><br/>\n I don&#39;t know if you can watch it, I can&#39;t in the UK). Or tried to do it myself <br/>\nwith David and Simon and Linnaea. I would have dismissed it as not as good, not <br/>\nas funny, not as thoughtful, maybe, because it was more physical than I tend to <br/>\nlike my comedy. <br/>\n<br/>\n<br/>\nThere is a lot of the world that I know about because Simon and Linnaea liked <br/>\nit. I like to share their interests, and I love that they like to share them <br/>\nwith me. I assume that there is a bit of a feedback loop in there. And anything <br/>\nthat makes them laugh or talk or dance or change their clothes without taking <br/>\noff their other clothes first, well, I can&#39;t help but have a huge fondness for <br/>\nMr. Bean. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\n<br/>\n<br/>\nMo loves physical comedy - and I never liked the stuff very much. I still don&#39;t <br/>\nfind it funny, but I&#39;ve done enough research into the subject now that I at <br/>\nleast understand the humor. I&#39;ve come to appreciate the setups and the timing <br/>\nthat make it work and I can tell when its done well. Whatever core &quot;self&quot; I may <br/>\nhave didn&#39;t change to the point where I&#39;ll watch the Three Stooges for my own <br/>\nenjoyment, but I can watch physical comedy and the animated versions with Mo and <br/>\nenjoy her pleasure in the art form. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/yKB1SBu4olk?wmode=opaque","type":"VIDEO"}]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311323284","msgId":61911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhrQzhxaFV4d1lnXz1aZVh5TmloOTVrdVNRNzJ3UkMzbi1YczI2NU8tT01FUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGowYWcycCtnczNuQGVHcm91cHMuY29tPg==","referencesHeader":"PENBRzB1Vzg9V1B5N0FmX3pEaW5Wem1IV1BjM0pLM0tLbz1qUllLcm9BT3I0ZUp0ZTVfUUBtYWlsLmdtYWlsLmNvbT4JPGowYWcycCtnczNuQGVHcm91cHMuY29tPg=="},"prevInTopic":61910,"nextInTopic":61912,"prevInTime":61910,"nextInTime":61912,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"2011/7/22 plaidpanties666  ... Mostly he likes watching videos of people demonstrating gameplays. We can t afford all the games he","messageBody":"<div id=\"ygrps-yiv-2094314087\">2011/7/22 plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;  Claire Darbaud &lt;cdarbaud@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;&gt; Jolan spends all his time on the computer or playing WII.<br/>\n&gt;<br/>\n&gt; You write that as if it were all one thing, but a computer and a Wii are<br/>\n&gt; two different devices with different capabilities AND each one has a number<br/>\n&gt; of different things you can do with them. It&#39;s like saying &quot;he spends all<br/>\n&gt; his time studying history and neuroscience&quot; - its a statement which says a<br/>\n&gt; whole lot about your own lack of understanding of what he&#39;s actually doing.<br/>\n&gt;<br/>\n&gt; What sorts of things does he enjoy doing?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Mostly he likes watching videos of people demonstrating gameplays. We can&#39;t<br/>\nafford all the games he would like to play on all consoles, so he watches<br/>\nother people playing. And actually, he also really enjoys watching videos of<br/>\npeople playing the games we have. We have over a 80 wii games and over 50 DS<br/>\ngames and a few PC games, not counting the myriad of free flash games they<br/>\nhave access to.<br/>\n<br/>\nLately, his favorites games are Portal 2 (PC), Minecraft (PC), Zack & Wicki<br/>\n(Wii), Dragon Ball Z 3 (especially with Dad for an opponent) and Just Cause<br/>\n(PC). He watches videos of minecraft mods, he watched an entire series about<br/>\nDuke Nukeim Forever, and another one about crash bandicoot. He also likes<br/>\nwatching Sonic and Pokemon episodes.<br/>\n<br/>\nI&#39;m not equating all as the same things. I am just worried about the amount<br/>\nof time spent immobile. If he didn&#39;t get out of bed all day reading books<br/>\nafter books, even if one book was a manga and the next one was a treaty of<br/>\nphysics, or he he was switching between books and computer without leaving<br/>\nthe sofa, I&#39;d still be worried about his physical inactivity.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; He drinks a lot of soda and he is putting on weight fast...<br/>\n&gt; &gt;<br/>\n&gt; &gt; There is a park across the street and there was a fete for July 14th<br/>\n&gt; (french<br/>\n&gt; &gt; national day) with fireworks. He had been excited to go, but on the day,<br/>\n&gt; he<br/>\n&gt; &gt; felt it was to tiring to walk there!<br/>\n&gt;<br/>\n&gt; You&#39;re jumping to a conclusion on very very slim evidence! Fatigue and<br/>\n&gt; sudden weight gain don&#39;t say &quot;computers&quot; to me - in my family that<br/>\n&gt; combination usually says &quot;thyroid&quot;. If he&#39;s having fatigue and/or metabolic<br/>\n&gt; issues, that could account for him wanting to do something sedentary.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t equate fatigue and sudden weight gain with computers. I am worried<br/>\nabout his hardly using his muscles. And as I wrote, I am wondering about his<br/>\nhealth. As you mention, it could be that there is something wrong with his<br/>\nthyroid. But I don&#39;t know what to do, because if I take him to our doctor,<br/>\nshe will just be horrified that I have no limits on sugar or screen time and<br/>\nwill give me a very hard time. I&#39;m pretty sure she will not even check his<br/>\nthyroid or any other possible reason his energy level is so low.<br/>\n<br/>\nHow do you handle health issues? Did you find an &quot;unschooling friendly&quot;<br/>\ndoctor that you can go to when you have worries about your kids health?<br/>\nWould you lie to the doctor? I had found a doctor that respected long<br/>\nbreatsfeeding and cosleeping. All the other doctors I know would have blamed<br/>\nany health issues on breastfeeding being too long or cosleeping...<br/>\n<br/>\nNow with unschooling, it feels like I&#39;m going a step further. Even my<br/>\ncurrent doctor will just blame our life style if I bring her my worries<br/>\nabout my son&#39;s health...<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":410130627,"authorName":"amy benton","from":"amy benton &lt;treewolf@...&gt;","profile":"treewolf@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311319708","msgId":61912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzMTk3MDguOTA0MjkuWWFob29NYWlsUkNAd2ViODM5MDgubWFpbC5zcDEueWFob28uY29tPg==","inReplyToHeader":"PGowYjZ1bSszaTBhQGVHcm91cHMuY29tPg==","referencesHeader":"PGowYjZ1bSszaTBhQGVHcm91cHMuY29tPg=="},"prevInTopic":61911,"nextInTopic":61915,"prevInTime":61911,"nextInTime":61913,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"Thank you for this!  I just wrote a long note and then saw your post, which made me feel a little better. ________________________________ From: Joanna","messageBody":"<div id=\"ygrps-yiv-346363268\">Thank you for this!  I just wrote a long note and then saw your post, which made <br/>\nme feel a little better.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Joanna &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ridingmom@...\">ridingmom@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Fri, July 22, 2011 2:56:22 AM<br/>\nSubject: [AlwaysLearning] Re: Mums and computers<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Corinna Spellerberg <br/>\n&lt;Corinna.Spellerberg@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>&quot;I&#39;m still sad about the lack of time, a mere lack of opportunity. I remember <br/>\ntalks about valuable things such as current news, animals. Computer games now <br/>\ntake up so much of our precious time together, and sitting next to them is just <br/>\nnot the same as having a real conversation, about which you all seem to be so <br/>\nhappy, just like I was.&quot;<br/>\n<br/>\nI think there&#39;s potential here, if you come from a positive, supportive place, <br/>\nand are sensitive to the rhythms of the games they are playing, to have more of <br/>\nwhat you want. You could try asking them if they&#39;d be willing to go do XYZ with <br/>\nyou (and make it something short while the games are so important to them) when <br/>\nthey come to a natural transition in the game. Understand the game so that you <br/>\nknow what you&#39;re talking about. Even if it&#39;s a cuddle on the couch--happy and <br/>\nplayful even better--or to see something interesting with you in the back yard <br/>\nfor a few moments. Their choice and your timing are key.<br/>\n<br/>\nTry being open and appreciative of their choices either way. If they make that <br/>\nbreak and spend those moments with you, thank them. If not, then find a place of <br/>\nfeeling happy that they are so engaged--because they are, and that&#39;s where all <br/>\nthe good stuff will come from. True engagement brings all the learning, problem <br/>\nsolving, emotional development, etc.--everything you want for them. <br/>\n<br/>\n<br/>\nYour job is to not only let it happen, but encourage it and revel in it with <br/>\nthem! If/when they feel that from you, things will shift. And I don&#39;t mean &quot;then <br/>\nthey will play less video games&quot;--I mean that things will shift in ways that you <br/>\ncan&#39;t really predict right now, but will be good for all of you.<br/>\n<br/>\nIt&#39;s hard to see when you&#39;re in it, and when your not in it anymore you&#39;ll wish <br/>\nyou hadn&#39;t stressed out about it so much, but it&#39;ll be too late. :-)<br/>\n<br/>\nI highly recommend the book Reality is Broken, by Jane McGonigal if you want to <br/>\nknow what they really are getting from video games.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":410130627,"authorName":"amy benton","from":"amy benton &lt;treewolf@...&gt;","profile":"treewolf@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311319469","msgId":61910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEzMTk0NjkuNTcyMTAuWWFob29NYWlsUkNAd2ViODM5MTQubWFpbC5zcDEueWFob28uY29tPg==","inReplyToHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+","referencesHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+"},"prevInTopic":61908,"nextInTopic":61911,"prevInTime":61909,"nextInTime":61911,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"This thread couldn t be more timely for me.  Corinna, I empathize with you.  My son is 6.5 yrs. old and has discovered the allure of video games/computer","messageBody":"<div id=\"ygrps-yiv-4599663\">This thread couldn&#39;t be more timely for me.  Corinna, I empathize with you.  My <br/>\nson is 6.5 yrs. old and has discovered the allure of video games/computer games <br/>\nover the past few months.  He has enjoyed two online virtual reality worlds for <br/>\nkids and recently purchased a 1 month membership to his current favorite, with <br/>\nallowance money he saved.  It has been a process for me to become comfortable <br/>\nwith this computer use and playing video games in general as I&#39;m concerned about <br/>\nbrain development, and I admit, I am deschooling in the sense of letting go of <br/>\nmost of his input needing to be &quot;academic&quot; in nature.  I have felt much more at <br/>\nease with all this until recently, prior to and in the few days following his <br/>\nmembership acquisition ( he joined Mon. so it&#39;s been 4-5 days now).  He has <br/>\nwanted to play from the time he wakes up and whenever there is a down moment.  <br/>\nHe wants to play games on my phone and Nook color when not playing on the <br/>\ncomputer.  I have encouraged his new interests ( with difficulty, as I see him <br/>\nlosing interest in most, if not all, of previously enjoyable activities, and in <br/>\ncomplaining of boredom - something he has never done before, whenever he isn&#39;t <br/>\nallowed to play computer games ) by searching for games he might enjoy which <br/>\nalso have some educational value ( again, deschooling! ).  We have talked about <br/>\nbalance in life of physical activities and activities other than these games <br/>\nwhich he could engage in.  His conversations of late have been 99% about this <br/>\none particular game, with anyone who will listen.  He has told me details of the <br/>\ngame repeatedly.  I appreciate his passion, I want him to be happy, I created a <br/>\ncharacter myself so we could play and interact in the game on the weekends when <br/>\nwe have two computers in the house.  But I&#39;m concerned.  I know intellectually <br/>\nthis is a new passion and it will likely subside over time.  I do acknowledge <br/>\nall the many benefits to be gained from navigating the computer and the games in <br/>\ngeneral.  Have recently read Michael Gurian and he discusses how in the 4-6 age <br/>\nrange, a child may be distracted from their core nature by material things, and <br/>\nvideo games in particular.  My child never complained of boredom before.  He has <br/>\n( had? ) a wonderful imagination and enjoyed playing with Legos, creating his <br/>\nown characters/scenes and building stories about them, building/constructing in <br/>\ngeneral, playing outside and in the woods,  creating art of various <br/>\nsorts,listening to stories, asking questions about and learning just about <br/>\nanything we encountered in books, movies/television, life in general.  Now, just <br/>\nabout anything I point out/try to engage him in that I think might be of <br/>\ninterest he ignores or plainly tells me &quot;I&#39;m not interested in that&quot;.  I know <br/>\nthis isn&#39;t all computer game related.  I wonder how much of it is simply his age <br/>\nand a developmental stage.  I miss my child and just want to do what is right <br/>\nfor him!  I can forsee the responses being: the games are right for him, he <br/>\nobviously wants to play those now.  However, his behavior this evening was <br/>\nupsetting.  After a day spent with his friend, we arrived home in time to <br/>\nshower, eat dinner, and go to bed.  When told there wasn&#39;t time to play the game <br/>\nhe immediately began crying, escalating to almost screaming.  He refused to eat <br/>\ndinner.  I helped him to process his feelings, expressed how disappointed he <br/>\nmust feel, and reminded him of his fun day and that the game would be available <br/>\ntomorrow.  I gave him time to calm down and eat if he chose ( he even said how <br/>\nhungry he was but that he was not going to eat ).  He still chose not to eat.  <br/>\nThis extreme reaction bothered me ( I do understand his disappointment ) and <br/>\nmakes me less inclined to let him play to his heart&#39;s content.  Any feedback??<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Corinna Spellerberg &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Corinna.Spellerberg@...\">Corinna.Spellerberg@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Fri, July 22, 2011 1:51:50 AM<br/>\nSubject: Re: [AlwaysLearning] Mums and computers<br/>\n<br/>\n  <br/>\nThanks ladies, and gentleman, for all your kind advice. I am doing most of the <br/>\nthings you have pointed out. Bringing food, listening to their excited success <br/>\nstories, of course I do all that, I love them, I&#39;m their Mum. I&#39;m still sad <br/>\nabout the lack of time, a mere lack of opportunity. I remember talks about <br/>\nvaluable things such as current news, animals. Computer games now take up so <br/>\nmuch of our precious time together, and sitting next to them is just not the <br/>\nsame as having a real conversation, about which you all seem to be so happy, <br/>\njust like I was.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Mums and computers","postDate":"1311317782","msgId":61902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYjZ1bSszaTBhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+"},"prevInTopic":61901,"nextInTopic":61906,"prevInTime":61901,"nextInTime":61903,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... I m still sad about the lack of time, a mere lack of opportunity. I remember talks about valuable things such as current news, animals. Computer games now","messageBody":"<div id=\"ygrps-yiv-1601757227\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Corinna Spellerberg &lt;Corinna.Spellerberg@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>&quot;I&#39;m still sad about the lack of time, a mere lack of opportunity. I remember talks about valuable things such as current news, animals. Computer games now take up so much of our precious time together, and sitting next to them is just not the same as having a real conversation, about which you all seem to be so happy, just like I was.&quot;<br/>\n<br/>\n<br/>\nI think there&#39;s potential here, if you come from a positive, supportive place, and are sensitive to the rhythms of the games they are playing, to have more of what you want. You could try asking them if they&#39;d be willing to go do XYZ with you (and make it something short while the games are so important to them) when they come to a natural transition in the game. Understand the game so that you know what you&#39;re talking about. Even if it&#39;s a cuddle on the couch--happy and playful even better--or to see something interesting with you in the back yard for a few moments. Their choice and your timing are key.<br/>\n<br/>\nTry being open and appreciative of their choices either way. If they make that break and spend those moments with you, thank them. If not, then find a place of feeling happy that they are so engaged--because they are, and that&#39;s where all the good stuff will come from. True engagement brings all the learning, problem solving, emotional development, etc.--everything you want for them. <br/>\n<br/>\nYour job is to not only let it happen, but encourage it and revel in it with them! If/when they feel that from you, things will shift. And I don&#39;t mean &quot;then they will play less video games&quot;--I mean that things will shift in ways that you can&#39;t really predict right now, but will be good for all of you.<br/>\n<br/>\nIt&#39;s hard to see when you&#39;re in it, and when your not in it anymore you&#39;ll wish you hadn&#39;t stressed out about it so much, but it&#39;ll be too late. :-)<br/>\n<br/>\nI highly recommend the book Reality is Broken, by Jane McGonigal if you want to know what they really are getting from video games.</div>","specialLinks":[]},{"userId":300571288,"authorName":"Corinna Spellerberg","from":"Corinna Spellerberg &lt;Corinna.Spellerberg@...&gt;","profile":"corinnaspellerberg@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311313910","msgId":61901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2MEYwQ0JELTI0QkMtNDRFOS04M0U3LUMwNUZDQ0I0MDQ0QkBnbXguZGU+"},"prevInTopic":61891,"nextInTopic":61902,"prevInTime":61900,"nextInTime":61902,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"Thanks ladies, and gentleman, for all your kind advice. I am doing most of the things you have pointed out. Bringing food, listening to their excited success","messageBody":"<div id=\"ygrps-yiv-1921900493\">Thanks ladies, and gentleman, for all your kind advice. I am doing most of the things you have pointed out. Bringing food, listening to their excited success stories, of course I do all that, I love them, I&#39;m their Mum. I&#39;m still sad about the lack of time, a mere lack of opportunity. I remember talks about valuable things such as current news, animals. Computer games now take up so much of our precious time together, and sitting next to them is just not the same as having a real conversation, about which you all seem to be so happy, just like I was.</div>","specialLinks":[]},{"userId":475420444,"authorName":"Rod Thomas","from":"&quot;Rod Thomas&quot; &lt;rthomas314@...&gt;","profile":"flyerkat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Mums and computers","postDate":"1311298237","msgId":61891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxRUM2NzI4MUJBQzRFRDNBMjMxMTJEMTNFQzJGQUY1QE1PTXNQQz4=","inReplyToHeader":"PENBRzB1Vzg9V1B5N0FmX3pEaW5Wem1IV1BjM0pLM0tLbz1qUllLcm9BT3I0ZUp0ZTVfUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":61887,"nextInTopic":61901,"prevInTime":61890,"nextInTime":61892,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"This is v similar to our home/son.   He is 12 and this has been the scenario for at least 2 years.  He also stays up all night and rarely leaves the house. ","messageBody":"<div id=\"ygrps-yiv-1596004397\">This is v similar to our home/son.   He is 12 and this has been the scenario<br/>\nfor at least 2 years.  He also stays up all night and rarely leaves the<br/>\nhouse.  <br/>\n<br/>\n Being patient, supportive, trying to stay connected to him.   Need advice<br/>\nalso.<br/>\n<br/>\n <br/>\n<br/>\nkate<br/>\n<br/>\n <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>]<br/>\nOn Behalf Of Claire Darbaud<br/>\nSent: Thursday, July 21, 2011 5:54 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: Re: [AlwaysLearning] Mums and computers<br/>\n<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\nWe (normally) don&#39;t have limits on computer/wii/tv time in our home. Both<br/>\nkids (Jolan is 7 1/2 and Avana is going to be 6) have their own laptops. We<br/>\nalso have a WII and 2 nintendo DS, and 2 TVs.<br/>\n<br/>\nBut I&#39;m worried.<br/>\n<br/>\nJolan spends all his time on the computer or playing WII. He gets up in the<br/>\nmorning, usually around 8:00AM. He walks to the couch and sits in front of<br/>\nhis laptop. And he can stay there until midnight, sometimes later. He will<br/>\nget up 3 or 4 times for a bathroom break, he joins us for lunch and dinner<br/>\nat the table, about 3 feet away. And that&#39;s all the exercise he might get in<br/>\na day. Now and then he stands to play on the WII. Not everyday.<br/>\n<br/>\nHe drinks a lot of soda and he is putting on weight fast...<br/>\n<br/>\nThere is a park across the street and there was a fete for July 14th (french<br/>\nnational day) with fireworks. He had been excited to go, but on the day, he<br/>\nfelt it was to tiring to walk there! And it&#39;s litterally just accross the<br/>\nstreet. 150 yards at most....<br/>\n<br/>\nYesterday I offered to go swimming and he refused and I got so nervous I<br/>\ntook the laptop away (-&gt; thus the normally in &quot;We (normally) don&#39;t have<br/>\nlimits on computer time&quot;). He agreed to come swimming and had a lot of fun<br/>\nwith dad but was very tired afterwards.<br/>\n<br/>\nI do sit with him and play with him and find new games he likes and watch<br/>\nsome videos with him. And we talk about the games he likes and what he likes<br/>\nbest... So I am not worried about the connection.<br/>\n<br/>\nAll this is making my husband very nervous and I must admit I am worried.<br/>\nBefore we stopped school he was an active little boy, he enjoyed running<br/>\naround, playing football, playing capoeira... all these are now &quot;too<br/>\ntiring&quot;. I&#39;m also puzzled because one of the reasons I took them out of<br/>\nschool was because I think it&#39;s unhealthy to force a young child to sit<br/>\nstill for hours on end.<br/>\n<br/>\nIt feels like his unused muscles are getting numb... or... I don&#39;t know...<br/>\nIt sure doesn&#39;t feel healthy. Where did all his joyful energy go?<br/>\n<br/>\nI thought about taking him to the doctor to check his health but I am scared<br/>\nto admit to a doctor that he drinks a lot of soda, eats lots of sugar and<br/>\ncan spend whole days in front of the computer.<br/>\n<br/>\nI&#39;d be just as worried if he was reading books 8:00AM to midnight days after<br/>\ndays. Or playing the piano...<br/>\n<br/>\nIs this what deschooling looks like? We&#39;ve been homeschooling since February<br/>\nand they got their laptops in May. Do I need to come round to the idea that<br/>\nit could be like that forever?<br/>\n<br/>\nClaire<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Mums and computers","postDate":"1311295172","msgId":61887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYWdzNCtkZDJoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowYWcycCtnczNuQGVHcm91cHMuY29tPg=="},"prevInTopic":61886,"nextInTopic":61891,"prevInTime":61886,"nextInTime":61888,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"I beg everyone s pardon - I m having laptop butterfingers and sent by mistake. I wanted to add that too tiring could also be a way of saying back off . Its","messageBody":"<div id=\"ygrps-yiv-480891817\">I beg everyone&#39;s pardon - I&#39;m having laptop butterfingers and sent by mistake.<br/>\n<br/>\nI wanted to add that &quot;too tiring&quot; could also be a way of saying &quot;back off&quot;. Its something I did as a kid, claimed I was too tired to go do whatever it was my parents wanted but I didn&#39;t in the moment. If my complaint was ignored I&#39;d sometimes have a good time anyway, but I still resented the fact that I had to have a reason beyond &quot;I&#39;m really not in the mood&quot;. It didn&#39;t build trust or communication.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We&#39;ve been homeschooling since February<br/>\n&gt; &gt; and they got their laptops in May.<br/>\n<br/>\n </span></blockquote>It&#39;s July - so that&#39;s less than three months, not very long at all. Not nearly enough time to &quot;fill up&quot; on something new and exciting - and yet he&#39;s not on his exciting-new laptop all the time. He is also playing on the Wii - its something different, remember.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; We (normally) don&#39;t have limits on computer/wii/tv time<br/>\n<br/>\n </span></blockquote>If you&#39;ve only been homeschooling since February, all those things were limited until then - limited by all the hours of school and homework. If you started homeschooling, as opposed to unschooling, then their time was still limited by homeschooling. If you&#39;ve been in the habit of taking things away from them in the past in order to gain their compliance then it will take time to trust you won&#39;t do that anymore - and you&#39;ve just restarted the clock to zero by taking away the laptop. Woops. Now your son knows his laptop use actually does have limits, vague, undefined limits, so he&#39;ll be motivated to spend even more time and more focused time before you crack down again. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Mums and computers","postDate":"1311294361","msgId":61886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYWcycCtnczNuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1Vzg9V1B5N0FmX3pEaW5Wem1IV1BjM0pLM0tLbz1qUllLcm9BT3I0ZUp0ZTVfUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":61885,"nextInTopic":61887,"prevInTime":61885,"nextInTime":61887,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... You write that as if it were all one thing, but a computer and a Wii are two different devices with different capabilities AND each one has a number of","messageBody":"<div id=\"ygrps-yiv-1296077180\">Claire Darbaud &lt;cdarbaud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Jolan spends all his time on the computer or playing WII.<br/>\n<br/>\n </span></blockquote>You write that as if it were all one thing, but a computer and a Wii are two different devices with different capabilities AND each one has a number of different things you can do with them. It&#39;s like saying &quot;he spends all his time studying history and neuroscience&quot; - its a statement which says a whole lot about your own lack of understanding of what he&#39;s actually doing. <br/>\n<br/>\nWhat sorts of things does he enjoy doing? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He drinks a lot of soda and he is putting on weight fast...<br/>\n&gt; <br/>\n&gt; There is a park across the street and there was a fete for July 14th (french<br/>\n&gt; national day) with fireworks. He had been excited to go, but on the day, he<br/>\n&gt; felt it was to tiring to walk there!<br/>\n<br/>\n </span></blockquote>You&#39;re jumping to a conclusion on very very slim evidence! Fatigue and sudden weight gain don&#39;t say &quot;computers&quot; to me - in my family that combination usually says &quot;thyroid&quot;. If he&#39;s having fatigue and/or metabolic issues, that could account for him wanting to do something sedentary.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; We (normally) don&#39;t have limits on computer/wii/tv time in our home. Both<br/>\n&gt; kids (Jolan is 7 1/2 and Avana is going to be 6) have their own laptops. We<br/>\n&gt; also have a WII and 2 nintendo DS, and 2 TVs.<br/>\n&gt; <br/>\n&gt; But I&#39;m worried.<br/>\n&gt; <br/>\n&gt; Jolan spends all his time on the computer or playing WII. He gets up in the<br/>\n&gt; morning, usually around 8:00AM. He walks to the couch and sits in front of<br/>\n&gt; his laptop. And he can stay there until midnight, sometimes later. He will<br/>\n&gt; get up 3 or 4 times for a bathroom break, he joins us for lunch and dinner<br/>\n&gt; at the table, about 3 feet away. And that&#39;s all the exercise he might get in<br/>\n&gt; a day. Now and then he stands to play on the WII. Not everyday.<br/>\n&gt; <br/>\n&gt; He drinks a lot of soda and he is putting on weight fast...<br/>\n&gt; <br/>\n&gt; There is a park across the street and there was a fete for July 14th (french<br/>\n&gt; national day) with fireworks. He had been excited to go, but on the day, he<br/>\n&gt; felt it was to tiring to walk there! And it&#39;s litterally just accross the<br/>\n&gt; street. 150 yards at most....<br/>\n&gt; <br/>\n&gt; Yesterday I offered to go swimming and he refused and I got so nervous I<br/>\n&gt; took the laptop away (-&gt; thus the normally in &quot;We (normally) don&#39;t have<br/>\n&gt; limits on computer time&quot;). He agreed to come swimming and had a lot of fun<br/>\n&gt; with dad but was very tired afterwards.<br/>\n&gt; <br/>\n&gt; I do sit with him and play with him and find new games he likes and watch<br/>\n&gt; some videos with him. And we talk about the games he likes and what he likes<br/>\n&gt; best... So I am not worried about the connection.<br/>\n&gt; <br/>\n&gt; All this is making my husband very nervous and I must admit I am worried.<br/>\n&gt; Before we stopped school he was an active little boy, he enjoyed running<br/>\n&gt; around, playing football, playing capoeira... all these are now &quot;too<br/>\n&gt; tiring&quot;. I&#39;m also puzzled because one of the reasons I took them out of<br/>\n&gt; school was because I think it&#39;s unhealthy to force a young child to sit<br/>\n&gt; still for hours on end.<br/>\n&gt; <br/>\n&gt; It feels like his unused muscles are getting numb... or... I don&#39;t know...<br/>\n&gt; It sure doesn&#39;t feel healthy. Where did all his joyful energy go?<br/>\n&gt; <br/>\n&gt; I thought about taking him to the doctor to check his health but I am scared<br/>\n&gt; to admit to a doctor that he drinks a lot of soda, eats lots of sugar and<br/>\n&gt; can spend whole days in front of the computer.<br/>\n&gt; <br/>\n&gt; I&#39;d be just as worried if he was reading books 8:00AM to midnight days after<br/>\n&gt; days. Or playing the piano...<br/>\n&gt; <br/>\n&gt; Is this what deschooling looks like? We&#39;ve been homeschooling since February<br/>\n&gt; and they got their laptops in May. Do I need to come round to the idea that<br/>\n&gt; it could be like that forever?<br/>\n&gt; <br/>\n&gt; Claire<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311294020","msgId":61885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGQzhDRjIxLTc1MzUtNENENS05RDQyLThEMzU5MzJEQzhGOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRzB1Vzg9V1B5N0FmX3pEaW5Wem1IV1BjM0pLM0tLbz1qUllLcm9BT3I0ZUp0ZTVfUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPiA8MTMxMTI3Nzg0OS40Nzg4OC5ZYWhvb01haWxOZW9Ad2ViMTEwNDA1Lm1haWwuZ3ExLnlhaG9vLmNvbT4gPENBRzB1Vzg9V1B5N0FmX3pEaW5Wem1IV1BjM0pLM0tLbz1qUllLcm9BT3I0ZUp0ZTVfUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":61884,"nextInTopic":61886,"prevInTime":61884,"nextInTime":61886,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"-=-Is this what deschooling looks like? -=- Yes. -=-We ve been homeschooling since February and they got their laptops in May-=- Not very long. -=-Do I need to","messageBody":"<div id=\"ygrps-yiv-795811825\">-=-Is this what deschooling looks like? -=-<br/>\n<br/>\nYes.<br/>\n<br/>\n-=-We&#39;ve been homeschooling since February<br/>\nand they got their laptops in May-=-<br/>\n<br/>\nNot very long.<br/>\n<br/>\n<br/>\n-=-Do I need to come round to the idea that<br/>\nit could be like that forever?-=-<br/>\n<br/>\nNo, but you need to know that your bad reaction, fear and negativity add bad/fear/negativity and do NOT help things settle into a warm, accepting, rich environment.<br/>\n<br/>\n-=-Jolan spends all his time on the computer or playing WII. He gets up in the<br/>\nmorning,-=-<br/>\n<br/>\nNot all his time.  He was asleep, or he couldn&#39;t have gotten up! :-)<br/>\n<br/>\n-=- he joins us for lunch and dinner<br/>\nat the table, about 3 feet away. And that&#39;s all the exercise he might get in<br/>\na day. -=-<br/>\n<br/>\nThat&#39;s been happening every day since May?  <br/>\nEven during the time you were travelling in July?  :-)<br/>\n<br/>\n-=-Yesterday I offered to go swimming and he refused and I got so nervous I<br/>\ntook the laptop away (-&gt; thus the normally in &quot;We (normally) don&#39;t have<br/>\nlimits on computer time&quot;). He agreed to come swimming and had a lot of fun<br/>\nwith dad but was very tired afterwards.-=-<br/>\n<br/>\n<br/>\nMaybe try &quot;After we go swimming, you can play some more.&quot;<br/>\n<br/>\nDon&#39;t create an antagonistic relationship where the way he wins is to reject you and cling to the computer.  He will want to win.  He plays games, and you will be creating a challenge.  Be his friend, his support, his cheering section.  <br/>\n<br/>\n-=-I do sit with him and play with him and find new games he likes and watch<br/>\nsome videos with him. And we talk about the games he likes and what he likes<br/>\nbest... So I am not worried about the connection.-=-<br/>\n<br/>\nThat sounds good.  Do more of that.<br/>\n<br/>\n-=-Before we stopped school he was an active little boy, he enjoyed running<br/>\naround, playing football, playing capoeira... all these are now &quot;too<br/>\ntiring&quot;. I&#39;m also puzzled because one of the reasons I took them out of<br/>\nschool was because I think it&#39;s unhealthy to force a young child to sit<br/>\nstill for hours on end.-=-<br/>\n<br/>\nYeah, but you&#39;re not forcing him.  He&#39;s making a choice.  IF you let him make choices.  If you stop letting him make choices, you open the door for reactionary behavior, sneakiness and avoidance.  <br/>\n<br/>\nI&#39;ve never known a kid to play computers forever, and I&#39;ve known lots of kids play lots of computer games.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311293709","msgId":61884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxNjVDREQxLTAzMDMtNDdBRi1BNDRBLTc5MjdFRDJFNzg1RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGowYWVpdCs5cW8wQGVHcm91cHMuY29tPg==","referencesHeader":"PGowYWVpdCs5cW8wQGVHcm91cHMuY29tPg=="},"prevInTopic":61881,"nextInTopic":61885,"prevInTime":61883,"nextInTime":61885,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"-=-It could also be good to find a game you d like to play for yourself - even if the genre isn t the same, it can help you get a sense of how games work and","messageBody":"<div id=\"ygrps-yiv-1362929486\">-=-It could also be good to find a game you&#39;d like to play for yourself - even if the genre isn&#39;t the same, it can help you get a sense of how games work and what makes them interesting, give you another point on which to connect.-=-<br/>\n<br/>\nPlants vs. Zombies. Easy enough for moms.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Mums and computers","postDate":"1311292829","msgId":61881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYWVpdCs5cW8wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg=="},"prevInTopic":61880,"nextInTopic":61884,"prevInTime":61880,"nextInTime":61882,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... ******************* Ray used to love to skateboard - I can barely stand up on a board, but I did a lot of reading on the subject so I could understand him","messageBody":"<div id=\"ygrps-yiv-1261754969\">&quot;corinnaspellerberg@...&quot; &lt;Corinna.Spellerberg@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m not keen on PC games, and feel I would have to change totally to learn to like it.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nRay used to love to skateboard - I can barely stand up on a board, but I did a lot of reading on the subject so I could understand him when he talked about it. I spent a good bit of time watching him at the skate park and took a bunch of pictures of him skating - we had that as our desktop &quot;wallpaper&quot; for awhile. I didn&#39;t have to make big personal changes to appreciate something he loved, I just had to learn about the subject and be willing to hear about it, talk about it, rent movies about it, support him in his passion. <br/>\n<br/>\nMo loves physical comedy - and I never liked the stuff very much. I still don&#39;t find it funny, but I&#39;ve done enough research into the subject now that I at least understand the humor. I&#39;ve come to appreciate the setups and the timing that make it work and I can tell when its done well. Whatever core &quot;self&quot; I may have didn&#39;t change to the point where I&#39;ll watch the Three Stooges for my own enjoyment, but I can watch physical comedy and the animated versions with Mo and enjoy her pleasure in the art form. <br/>\n<br/>\nHave you done any research into the kinds of games they like? Its easy enough to look up games on Wikipedia and learn some things about them. You can find out something about the genre, what other kinds of games are in the same category, plots, underlying themes. It&#39;s a good place to start so that you can connect a little more. The more you can connect, the less you&#39;ll feel &quot;left out&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Plus they are not ultra keen to have me there all the time.<br/>\n<br/>\n </span></blockquote>Don&#39;t be there allllllll the time. Sit and watch a little. Once you have a basic understanding of the goals, story and format of the game, you can make friendly, unobtrusive comments, but don&#39;t jump in right away with &quot;what&#39;s going on here?&quot; that won&#39;t help - it will more likely frustrate both of you! Do some research so you know what&#39;s going on. It could also be good to find a game you&#39;d like to play for yourself - even if the genre isn&#39;t the same, it can help you get a sense of how games work and what makes them interesting, give you another point on which to connect.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":303699721,"authorName":"Karin Miller","from":"Karin Miller &lt;homeschoolmommio@...&gt;","profile":"karin_roserock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311291500","msgId":61877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTT05VytwPTRxUVNIT2Y0d205UGlqUFhwY0EtWWcyWlBLb2hwMGQwazJpOEZZT3BVZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEU4REYxOTVBLTQ2RkMtNEY4NS04MEI5LTgwQTA0MTA5RkM4N0B2ZXJpem9uLm5ldD4=","referencesHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPgk8RThERjE5NUEtNDZGQy00Rjg1LTgwQjktODBBMDQxMDlGQzg3QHZlcml6b24ubmV0Pg=="},"prevInTopic":61876,"nextInTopic":61880,"prevInTime":61876,"nextInTime":61878,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1476058290\">On Jul 21, 2011 10:40 AM, &quot;Joyce Fetteroll&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On Jul 21, 2011, at 12:48 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:corinnaspellerberg@...\">corinnaspellerberg@...</a> wrote:<br/>\n&gt;<br/>\n&gt;&gt; But I&#39;m not keen on PC games, and feel I would have to change<br/>\n&gt;&gt; totally to learn to like it.<br/>\n&gt;<br/>\n&gt; But you&#39;re basically asking your youngest son to change so he can talk<br/>\n&gt; to you, right? And that&#39;s not necessarily his goal. So you want him to<br/>\n&gt; change so you can meet your goal.<br/>\n&gt;<br/>\n&gt; If you want there to be more connection, then you&#39;re the one that<br/>\n&gt; needs to do the changing. And the easiest way to connect to someone is<br/>\n&gt; to go to them, to be a part of their world rather than trying to pull<br/>\n&gt; them into your world.<br/>\n&gt;<br/>\n&gt;&gt; Plus they are not ultra keen to have me there all the time.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; You don&#39;t need to be with them all the time! Connect with them through<br/>\n&gt; their interests, don&#39;t surgically attach to them ;-)<br/>\n&gt;<br/>\n&gt; And maybe it&#39;s how you&#39;re connecting that&#39;s not working? If someone<br/>\n&gt; wants to make friends with you and just hangs around to be in your<br/>\n&gt; presence and absorb what you&#39;re doing, that can be a bit off putting.<br/>\n&gt; (Creepy even ;-) But if someone enjoys the same activities you do, has<br/>\n&gt; the same feelings about them, and would do them even if you weren&#39;t<br/>\n&gt; there, then there&#39;s the connection :-)<br/>\n&gt;<br/>\n&gt; Can you find games you all like that you can all play together? Why<br/>\n&gt; not pose that question to them?<br/>\n&gt;<br/>\n&gt;&gt; Maybe they are just growing up and I haven&#39;t adjusted to that yet?<br/>\n&gt;<br/>\n&gt; Well, they&#39;ll need you less. And it&#39;s an opportunity to explore your<br/>\n&gt; own interests. But if your interests aren&#39;t crossing much, I&#39;d suggest<br/>\n&gt; putting building the connections between you as a priority.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311290334","msgId":61876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2NEU0OTNCLUVCQjgtNDE4OC04MUVCLUJDRUUxMzQ4MDQ3MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg==","referencesHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg=="},"prevInTopic":61873,"nextInTopic":61877,"prevInTime":61875,"nextInTime":61877,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"-=- With the oldest, it works fine, as he does other things, but the youngest is almost addicted, hardly any time to eat.-=- Until you stop looking for","messageBody":"<div id=\"ygrps-yiv-2029974179\">-=- With the oldest, it works fine, as he does other things, but the youngest is almost addicted, hardly any time to eat.-=-<br/>\n<br/>\nUntil you stop looking for &quot;addiction,&quot; or categorizing fascination and interest as &quot;addiction,&quot; you will not see what he&#39;s doing.<br/>\n<br/>\n-=-hardly any time to eat-=-<br/>\n<br/>\nSet food near him.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/monkeyplatter\">http://sandradodd.com/monkeyplatter</a><br/>\n<br/>\n<br/>\n-=-Now I have read all the interesting stuff on Sandra&#39;s site about video games, and I know it will get better, and all that. I try to be patient. However-=-<br/>\n<br/>\nThat&#39;s a lot of words to say &quot;yeah, but...&quot;<br/>\nIf you know it will get better, there&#39;s nothing to be patient about!<br/>\nIf you believe it will get better, then do other things with your time and energy.<br/>\nIf you&#39;re feeling that you&#39;re trying (not succeeding) to be patient (waiting for change) you&#39;re not believing it will get better.<br/>\n<br/>\n-=- However, my problem is slightly different: When will I ever get to talk to them/see them? Because I understand for unschooling to &quot;work&quot; we would need to talk, at least occasionally? I feel I hardly have any contact with them right now, apart from car rides to activities. Part of my problem is that I feel left out. I can&#39;t help it, they are so close, have so much fun, and I feel bored and want to spent more time with them-=-<br/>\n<br/>\nIF you were to get your way and they were to stop doing what they&#39;re doing to pay attention to you, would they be happier?  Would they be learning more?<br/>\n<br/>\nThey&#39;re having fun.<br/>\nYou feel bored (you said, in your own words).<br/>\n<br/>\n-=-I can hear you say: Easy, just play with them then. But I&#39;m not keen on PC games, and feel I would have to change totally to learn to like it.-=-<br/>\n<br/>\nYou&#39;re going to have to change totally to become an unschooler.<br/>\nDon&#39;t try to &quot;learn to like it.&quot;  Like your children enough to see what it is about the games that THEY like.  And then rejoice that they are thrilled about something, and let that be without whining or complaining about it, or making it about you.<br/>\n<br/>\n-=-Plus they are not ultra keen to have me there all the time. Maybe they are just growing up and I haven&#39;t adjusted to that yet?-=-<br/>\n<br/>\n&quot;Maybe&quot; they are growing up?<br/>\n&quot;Just&quot; growing up?  :-)<br/>\n<br/>\nI wouldn&#39;t want to have you there if you were being critical and bored and unhappy and left out and not keen on what I was doing, and grew up a long time ago. :-)<br/>\n<br/>\n-=-When will I ever get to talk to them/see them? Because I understand for unschooling to &quot;work&quot; we would need to talk, at least occasionally?-=-<br/>\n<br/>\nYou seem to be suggesting, though in a way that&#39;s couched as an honest question (which it isn&#39;t) that if you let them play video games, the possibility exists that they will NEVER speak to you again, you will NEVER see them again.  I can&#39;t answer those things as though they were honest questions, because they aren&#39;t.  I can point that out, though, so you can consider what you&#39;re really expressing. :-)<br/>\n<br/>\nYou just nearly wrote something I could have included here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifilet\">http://sandradodd.com/ifilet</a><br/>\nbut you&#39;re safe on a technicality.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311285227","msgId":61880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1Vzg9V1B5N0FmX3pEaW5Wem1IV1BjM0pLM0tLbz1qUllLcm9BT3I0ZUp0ZTVfUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzMTEyNzc4NDkuNDc4ODguWWFob29NYWlsTmVvQHdlYjExMDQwNS5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPgk8MTMxMTI3Nzg0OS40Nzg4OC5ZYWhvb01haWxOZW9Ad2ViMTEwNDA1Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":61877,"nextInTopic":61881,"prevInTime":61879,"nextInTime":61881,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"We (normally) don t have limits on computer/wii/tv time in our home. Both kids (Jolan is 7 1/2 and Avana is going to be 6) have their own laptops. We also have","messageBody":"<div id=\"ygrps-yiv-2137382589\">We (normally) don&#39;t have limits on computer/wii/tv time in our home. Both<br/>\nkids (Jolan is 7 1/2 and Avana is going to be 6) have their own laptops. We<br/>\nalso have a WII and 2 nintendo DS, and 2 TVs.<br/>\n<br/>\nBut I&#39;m worried.<br/>\n<br/>\nJolan spends all his time on the computer or playing WII. He gets up in the<br/>\nmorning, usually around 8:00AM. He walks to the couch and sits in front of<br/>\nhis laptop. And he can stay there until midnight, sometimes later. He will<br/>\nget up 3 or 4 times for a bathroom break, he joins us for lunch and dinner<br/>\nat the table, about 3 feet away. And that&#39;s all the exercise he might get in<br/>\na day. Now and then he stands to play on the WII. Not everyday.<br/>\n<br/>\nHe drinks a lot of soda and he is putting on weight fast...<br/>\n<br/>\nThere is a park across the street and there was a fete for July 14th (french<br/>\nnational day) with fireworks. He had been excited to go, but on the day, he<br/>\nfelt it was to tiring to walk there! And it&#39;s litterally just accross the<br/>\nstreet. 150 yards at most....<br/>\n<br/>\nYesterday I offered to go swimming and he refused and I got so nervous I<br/>\ntook the laptop away (-&gt; thus the normally in &quot;We (normally) don&#39;t have<br/>\nlimits on computer time&quot;). He agreed to come swimming and had a lot of fun<br/>\nwith dad but was very tired afterwards.<br/>\n<br/>\nI do sit with him and play with him and find new games he likes and watch<br/>\nsome videos with him. And we talk about the games he likes and what he likes<br/>\nbest... So I am not worried about the connection.<br/>\n<br/>\nAll this is making my husband very nervous and I must admit I am worried.<br/>\nBefore we stopped school he was an active little boy, he enjoyed running<br/>\naround, playing football, playing capoeira... all these are now &quot;too<br/>\ntiring&quot;. I&#39;m also puzzled because one of the reasons I took them out of<br/>\nschool was because I think it&#39;s unhealthy to force a young child to sit<br/>\nstill for hours on end.<br/>\n<br/>\nIt feels like his unused muscles are getting numb... or... I don&#39;t know...<br/>\nIt sure doesn&#39;t feel healthy. Where did all his joyful energy go?<br/>\n<br/>\nI thought about taking him to the doctor to check his health but I am scared<br/>\nto admit to a doctor that he drinks a lot of soda, eats lots of sugar and<br/>\ncan spend whole days in front of the computer.<br/>\n<br/>\nI&#39;d be just as worried if he was reading books 8:00AM to midnight days after<br/>\ndays. Or playing the piano...<br/>\n<br/>\nIs this what deschooling looks like? We&#39;ve been homeschooling since February<br/>\nand they got their laptops in May. Do I need to come round to the idea that<br/>\nit could be like that forever?<br/>\n<br/>\nClaire<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311277849","msgId":61873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEyNzc4NDkuNDc4ODguWWFob29NYWlsTmVvQHdlYjExMDQwNS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg==","referencesHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg=="},"prevInTopic":61871,"nextInTopic":61876,"prevInTime":61872,"nextInTime":61874,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"***We have decided to skip the computer limit of an hour a day and try no limits . With the oldest, it works fine, as he does other things, but the youngest","messageBody":"<div id=\"ygrps-yiv-1318710829\">***We have decided to skip the computer limit of an hour a day and try &quot;no limits&quot;. With the oldest, it works fine, as he does other things, but the youngest is almost addicted, hardly any time to eat.***<br/>\n<br/>\n<br/>\nThis is the biggest clue in what you&#39;ve written, as to why your kids might not want to spend time with you.  Why does it work fine with the oldest?  Your answer is because he doesn&#39;t use the computer so much.  You have judged computer time to be unworthy.  You have judged one child&#39;s activities as fine because he doesn&#39;t use that unworthy computer time.  You&#39;ve judged the other child&#39;s activities negatively, addicted.  <br/>\n<br/>\nIf you want to spend time with your children and you want them to enjoy spending time with you, you need to value what they value, you need to SEE the value in what the enjoy doing.  If you can&#39;t do that with something easily tangible like computer usage, you will have a hard time valuing the multitude of other things that they may become interested in.<br/>\n<br/>\nIf you were married to an avid fisherman, and you hated fishing and hated fish, how would you go about supporting your husband&#39;s passion?  It works the same for kids.  You might buy your husband fancy lures for his b-day and you might find fun and interesting recipes for the fish he catches, so that he can eat it and enjoy it.  It doesn&#39;t mean you need to go fishing with him or even eat fish.  Here&#39;s what happens though, once you open your thoughts to being supportive towards something you dislike, you become open to liking it.  Perhaps you start to enjoy shopping for lures because they are very pretty, and fishing shops can be interesting.  Perhaps you start going with your husband to fishing shops, and maybe you decide that a day resting in a boat reading a book might be fun and maybe you try a bite of fish from some new recipe and decide it isn&#39;t as bad as you remember.  Perhaps you just start to like fishing because you&#39;ve supported your<br/>\n husband&#39;s passion and you&#39;ve experienced the fun and joy of it and seen it through his eyes just enough to let go of your dislike and be open to another way of feeling about it.<br/>\n<br/>\nTHAT is how you support your kids, that is how you find value in your son&#39;s passion in computers.  You need to be open to it.  You will have a very very hard time with unschooling if you can&#39;t do that.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Mums and computers","postDate":"1311270593","msgId":61871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowOW9zMSttamEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg=="},"prevInTopic":61870,"nextInTopic":61873,"prevInTime":61870,"nextInTime":61872,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... Big red flag! You have an expectations as to what removing limits will do, how it will look, that doesn t take into account personal interests. Re-read","messageBody":"<div id=\"ygrps-yiv-773205038\">&quot;corinnaspellerberg@...&quot; &lt;Corinna.Spellerberg@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We have decided to skip the computer limit of an hour a day and try &quot;no limits&quot;. With the oldest, it works fine, as he does other things but the youngest is almost addicted, hardly any time to eat. ****************<br/>\n<br/>\n </span></blockquote>Big red flag! You have an expectations as to what removing limits will do, how it will look, that doesn&#39;t take into account personal interests. Re-read those sentences with something other than computers... say, a musical instrument. If one of your children dabbled in playing the piano while the other wanted to play for hours at a time, would you say the second was addicted to the piano? That unlimited piano only worked well for the dabbler? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Now I have read all the interesting stuff on Sandra&#39;s site about video games, and I know it will get better, and all that. I try to be patient. However, my problem is slightly different: When will I ever get to talk to them/see them?<br/>\n </span></blockquote>***************<br/>\n<br/>\nIf you sat down with the child on the computer and talked to him, watched what he was doing, you&#39;d get to see and talk with that child more. <br/>\n<br/>\nYou&#39;ve fallen into the trap of assuming a child at a computer (or watching tv or playing a video game) doesn&#39;t want his mom&#39;s company. Woops! Go hang out with your guy! Discover what fascinates him so much. Be a part of his life. Then it won&#39;t matter if he always loves the computer - it won&#39;t be something that comes between you but something you have in common. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Mums and computers","postDate":"1311270028","msgId":61870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU4REYxOTVBLTQ2RkMtNEY4NS04MEI5LTgwQTA0MTA5RkM4N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg==","referencesHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg=="},"prevInTopic":61868,"nextInTopic":61871,"prevInTime":61869,"nextInTime":61871,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"... But you re basically asking your youngest son to change so he can talk to you, right? And that s not necessarily his goal. So you want him to change so you","messageBody":"<div id=\"ygrps-yiv-1924283250\">On Jul 21, 2011, at 12:48 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:corinnaspellerberg@...\">corinnaspellerberg@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I&#39;m not keen on PC games, and feel I would have to change  <br/>\n&gt; totally to learn to like it.<br/>\n<br/>\n </span></blockquote>But you&#39;re basically asking your youngest son to change so he can talk  <br/>\nto you, right? And that&#39;s not necessarily his goal. So you want him to  <br/>\nchange so you can meet your goal.<br/>\n<br/>\nIf you want there to be more connection, then you&#39;re the one that  <br/>\nneeds to do the changing. And the easiest way to connect to someone is  <br/>\nto go to them, to be a part of their world rather than trying to pull  <br/>\nthem into your world.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Plus they are not ultra keen to have me there all the time.<br/>\n<br/>\n<br/>\n </span></blockquote>You don&#39;t need to be with them all the time! Connect with them through  <br/>\ntheir interests, don&#39;t surgically attach to them ;-)<br/>\n<br/>\nAnd maybe it&#39;s how you&#39;re connecting that&#39;s not working? If someone  <br/>\nwants to make friends with you and just hangs around to be in your  <br/>\npresence and absorb what you&#39;re doing, that can be a bit off putting.  <br/>\n(Creepy even ;-) But if someone enjoys the same activities you do, has  <br/>\nthe same feelings about them, and would do them even if you weren&#39;t  <br/>\nthere, then there&#39;s the connection :-)<br/>\n<br/>\nCan you find games you all like that you can all play together? Why  <br/>\nnot pose that question to them?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe they are just growing up and I haven&#39;t adjusted to that yet?<br/>\n<br/>\n </span></blockquote>Well, they&#39;ll need you less. And it&#39;s an opportunity to explore your  <br/>\nown interests. But if your interests aren&#39;t crossing much, I&#39;d suggest  <br/>\nputting building the connections between you as a priority.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":300571288,"authorName":"corinnaspellerberg@ymail.com","from":"&quot;corinnaspellerberg@...&quot; &lt;Corinna.Spellerberg@...&gt;","profile":"corinnaspellerberg@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Mums and computers","postDate":"1311266938","msgId":61868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowOWw5cSthaTFqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":61870,"prevInTime":61867,"nextInTime":61869,"topicId":61868,"numMessagesInTopic":0,"msgSnippet":"Hi I ve recently joined this group, have been home educating for three years and slowly growing into unschooling. We are UK based, my kids are 12 and 13. We","messageBody":"<div id=\"ygrps-yiv-1405115508\">Hi<br/>\nI&#39;ve recently joined this group, have been home educating for three years and slowly growing into unschooling. We are UK based, my kids are 12 and 13.<br/>\nWe have decided to skip the computer limit of an hour a day and try &quot;no limits&quot;. With the oldest, it works fine, as he does other things, but the youngest is almost addicted, hardly any time to eat. Now I have read all the interesting stuff on Sandra&#39;s site about video games, and I know it will get better, and all that. I try to be patient. However, my problem is slightly different: When will I ever get to talk to them/see them? Because I understand for unschooling to &quot;work&quot; we would need to talk, at least occasionally? I feel I hardly have any contact with them right now, apart from car rides to activities. Part of my problem is that I feel left out. I can&#39;t help it, they are so close, have so much fun, and I feel bored and want to spent more time with them. I can hear you say: Easy, just play with them then. But I&#39;m not keen on PC games, and feel I would have to change totally to learn to like it. Plus they are not ultra keen to have me there all the time. Maybe they are just growing up and I haven&#39;t adjusted to that yet?<br/>\nAny ideas appreciated ...<br/>\nCorinna</div>","specialLinks":[]}],"prevTopicId":61852,"nextTopicId":446}}