{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Swami Beyondananda on optimism","postDate":"1039543842","msgId":11231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1LjQyZTVmODEuMmIyNzg4MjJAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":11230,"nextInTime":11232,"topicId":11231,"numMessagesInTopic":0,"msgSnippet":"Beyondanews -- December, 2002 Choosing the Optimystic Path in a Pessimystic World Dear Friends: The Swami has said there are two kinds of mystics in the world,","messageBody":"<div id=\"ygrps-yiv-1133133090\">Beyondanews -- December, 2002<br/>\n<br/>\nChoosing the Optimystic Path in a Pessimystic World<br/>\n<br/>\nDear Friends:<br/>\n<br/>\n         The Swami has said there are two kinds of mystics in the <br/>\nworld, the optimystics and the pessimystics.  Although pessimystics <br/>\nseem to be more in touch with &quot;reality,&quot; optimystics are happier and <br/>\nlive longer.  It&#39;s the pessimystics who&#39;ve been crying, &quot;The sky is <br/>\nfalling, the sky is falling!&quot; The optimystics simply smile and say, <br/>\n&quot;No.  It only looks that way because we are ascending.&quot;<br/>\n<br/>\n        Of course, for those people who read the news -- not to<br/>\nmention those unfortunate enough to be in the news -- this has not<br/>\nbeen an easy year to offer an optimystic reframe to loads of <br/>\npessimystic evidence.<br/>\n <br/>\nThere&#39;s an old saying, &quot;It always seems darkest before it gets really <br/>\ndark,&quot; but we optimystics don&#39;t buy it.  Call me a hopeless &quot;hopium&quot; <br/>\naddict, but I say it can&#39;t hurt to look on the bright side.<br/>\n<br/>\n         Sure, you can say we human beings have moved further down<br/>\nthe path of self-destruction ... or you could say the earth is<br/>\nridding itself of its most virulent parasite.  You can deplore the <br/>\nincreased war, disease and starvation, or you can go, &quot;Hey,<br/>\npopulation control without birth control or abortion!&quot;  You can worry <br/>\nover America&#39;s turn toward totalitarianism or you can say, &quot;Ah,<br/>\nsimplicity!  We&#39;ve boiled the Bill of Rights down to just one: You<br/>\nhave the right to remain silent.&quot;<br/>\n<br/>\n        Seriously, we do have a choice.  One of my favorite stories <br/>\nrecently is about a Native American grandfather talking to his young <br/>\ngrandson.  He tells the boy he has two wolves inside of him<br/>\nstruggling with each other. The first is the wolf of peace, love and <br/>\nkindness. The other wolf is fear, greed and hatred.  &quot;Which wolf will <br/>\nwin, grandfather?&quot; asks the young boy.<br/>\n<br/>\n        &quot;Whichever one I feed,&quot; is the reply.<br/>\n<br/>\n        Every day -- every moment -- we have the choice to feed the <br/>\nwolf of love or the wolf of fear.  If war is a necessary evil, that <br/>\nmakes it all the more important to express peace as a necessary good.<br/>\nWhatever love, kindness, laughter, or generosity we create in our <br/>\nimmediate vicinity radiates outward like a &quot;perfect Ponzi scheme&quot;<br/>\nwhere everyone wins and nobody loses.<br/>\n<br/>\n        The wolf I have chosen to feed is the wolf of healing<br/>\nlaughter and conscious comedy.  I am happy to say that I have<br/>\n&quot;combined farces&quot; with producer Michael Mears (&quot;The WiseZenHeimers&quot;)<br/>\nto form the Laughmore Society, a membership organization designed to <br/>\nencourage laughter as a tool for healing and awakening.  We will have <br/>\nour first &quot;Wake Up Laughing&quot; event in January (see attached flyer) at <br/>\nUnity in Marin in Novato, California with the Swami and fellow comic <br/>\nRichard Stockton (author of &quot;Fondle the Fear&quot; and master of the <br/>\nreframe).  At this event, for the first time, Swami will be<br/>\ndelivering his annual State of the Universe Address in front of a<br/>\nlive audience.<br/>\n <br/>\n    If you want tickets so you can be there in person and register <br/>\nyour personal laughter on the laugh track, just click on appearances <br/>\nfor details -- and you can buy your tickets online.  This event will<br/>\nbe recorded so you can enjoy it post-humorously, and maybe even <br/>\nwebcast. Watch the January newsletter for more details.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wakeuplaughing.com/cgi-bin/thatsanorder_LE\">http://www.wakeuplaughing.com/cgi-bin/thatsanorder_LE</a><br/>\n<br/>\nHow to Spread More Good Cheer This Season<br/>\n<br/>\n         If you&#39;re looking for a way to help the Swami&#39;s mission to <br/>\nbring good cheerfulness, here is how you can &quot;feed two birds with one <br/>\nscone.&quot; First of all, Swami is making it even easier to give the gift <br/>\nof laughter this season, and goodness knows, we need it!<br/>\n<br/>\n     *  For every $35 special (Duck Soup book, Beyondananda and Beyond<br/>\ncassette, Drive Your Karma, Curb Your Dogma CD) sold between now and<br/>\nDecember 25th, the Swami will throw in a free book, tape or CD -- your<br/>\nchoice.<br/>\n     *  Just click on the order page, and the field that says &quot;where <br/>\ndid you hear about our site&quot; just specify book, tape or CD.  For the <br/>\nsame price, you can now have an extra stocking stuffer.  Or, keep it <br/>\nyourself to enjoy.  As the old saying goes, the laugh you save may be <br/>\nyour own.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wakeuplaughing.com/cgi-bin/thatsanorder_LE\">http://www.wakeuplaughing.com/cgi-bin/thatsanorder_LE</a><br/>\n<br/>\n         And for those who are more ambitious, you can join with <br/>\nSwami&#39;s &quot;matching funs&quot; program and set up your own &quot;Duck Soup<br/>\nkitchen&quot; by giving Duck Soup books to those who could most use a<br/>\nlaugh this holiday season.<br/>\n     *  For $100 (includes shipping), we&#39;ll send you 15 books (5 free <br/>\nbooks) for you to distribute wherever you like -- hospitals, nursing <br/>\nhomes, hospice, women&#39;s and homeless shelters.<br/>\n     *  Or, tell us the kinds of places you&#39;d like them donated, and <br/>\nwe&#39;ll distribute them for you locally.<br/>\n     *  For $275 (includes UPS shipping), we&#39;ll ship you a box of 62 <br/>\nbooks (you&#39;re getting 35 books for free!) to distribute yourself (or <br/>\ntell us where you want the box shipped).<br/>\n     *  Just respond to this email or call Swami&#39;s toll free line at <br/>\n(800) SWAMI-BE and say &quot;duck soup,&quot; and leave any pertinent <br/>\ninformation.<br/>\n<br/>\n         And finally, for this holiday season when things get hectic, <br/>\nwhen family patterns erupt, or when an overdose of holiday &quot;cheer&quot;<br/>\nhas gotten you down, get quiet, take a deep breath and remember<br/>\nSwami&#39;s holiday song, &quot;There&#39;s No Place Like OM For the Holidays.&quot;<br/>\n<br/>\n         Till next year, may you wake up laughing .. and leave<br/>\nlaughter in your wake.<br/>\n<br/>\n    May the FARCE be with you,<br/>\n<br/>\n   Steve Bhaerman<br/>\n                <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wakeuplaughing.com\">http://www.wakeuplaughing.com</a><br/>\n<br/>\n        How would you like to talk to the Swami? Well now you can on <br/>\nour Community Forums! Please visit <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wake\">http://www.wake</a><br/>\nuplaughing.com/forums and take part in the conversation, or start<br/>\nyour own!<br/>\n<br/>\n<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:swamis-beyondanews-unsubscribe@yahoogroups.com\">swamis-beyondanews-unsubscribe@yahoogroups.com</a></div>","specialLinks":[]}],"prevTopicId":6305,"nextTopicId":11176}}