{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: *8 What do you recommend for families that cannot financially keep up  with childrens&#39; demands?","postDate":"1226314489","msgId":40072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3NDQ3MS41NTQ1Mi5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":40069,"nextInTopic":0,"prevInTime":40071,"nextInTime":40073,"topicId":40049,"numMessagesInTopic":0,"msgSnippet":"The run up to Christmas often feels more tense here as well. The other day I was talking about getting my haircut. I don t get a haircut very often, but have","messageBody":"<div id=\"ygrps-yiv-212341346\">The run up to Christmas often feels more tense here as well. The other day I was talking about getting my haircut. I don&#39;t get a haircut very often, but have recently noticed that I&#39;m going thin on the top and want to go to my hairdresser and get him to come up with a good combover or whatever to appease my vanity. Anyhow, Linnaea said she&#39;d like to get her haircut and I got stressed about the additional cost. And I mentioned it and I mentioned that I was trying to save money to have a decent splurge for Christmas. She immediately withdrew her request for a haircut. And she wasn&#39;t upset, she didn&#39;t do it out of spite or grouchiness. Both she and Simon seem to really trust that David and I aren&#39;t trying to trick them into not getting what they want. It&#39;s like their longterm vision is greater than mine. I don&#39;t know if that makes sense. They see that David and I are doing what we can with what money we have to get their needs met and they don&#39;t feel gypped<br/>\n or grouchy or screwed if the need of that moment is delayed for a later date. <br/>\n<br/>\nI can remember needing everything I wanted now. And wanting something merely because the act of getting it was so important. David and I were talking about Christmas presents for each other, and while both of us said that we didn&#39;t really want for anything, I added that I still have a hard time separating what I get for gifts from how much I am loved. Simon and Linnaea don&#39;t seem to have any sense that what you are given is about how much you are loved. They enjoy presents so much more fully than I did. My mom sends kool-aid and microwave macaroni and cheese and trail bars and they are as over the moon about those gifts as they are about other, more expensive presents. They enjoy receiving things.<br/>\n<br/>\nI can still feel hurt by my dead grandma who gave my brother 200 dollars for his birthday and 18 dollars for mine. I took it as censure. My brother was in college at Yale and I was a high school dropout. Maybe it was need, maybe she truly felt that he needed money more than I did. She was dying at the time, she was dead 5 months later. Maybe it was drugs addling her brain. Maybe she was afraid of what I&#39;d do with money. She knew I smoked, she&#39;d seen me from the bedroom window when I was walking to school and she was staying at our house to be tested for cancer. Maybe she thought I did drugs and would spend the money in ways that would be harmful to me. I can remember spending Christmas with her and watching Scared Straight a show with criminals scaring kids to not do bad things, like drugs and other crimes. I imagine she was quite concerned for my well-being. She may have labored over what she gave me. It may have been this huge internal discussion about<br/>\n what was an appropriate amount of  money to give. I took it as an insult, a token gift for the Golden Birthday (my 18th on the 18th) that she had built up in my head in stories of being showered with gifts. And I held it against her. I didn&#39;t see her before she died. I didn&#39;t drive the 90 miles to her home to see her lying in the hospital bed they&#39;d set up in the living room while lung cancer claimed her. I couldn&#39;t let go of the hurt that not being loved more than 18 dollars worth felt like to me. <br/>\n<br/>\nI don&#39;t think Simon or Linnaea think that way. I think the generous world that they live in allows them to enjoy what comes into their lives without trying to read between the lines, or to feel slighted by what someone else gets. And they are very generous with what they have. <br/>\n<br/>\nSchuyler<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n-------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-What do you recommend for families that cannot financially keep up<br/>\n&gt; with childrens&#39; demands?-=-<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ll tell a story about tonight.  My husband and I took Margaux out to<br/>\nsee High School Musical 3, so that Chamille could have the house to<br/>\nherself for a bit.  Afterwards we needed to stop at the store to get a<br/>\nfew grocery items.<br/>\n<br/>\nThe store we went to is a little like a super target or walmart, but<br/>\nlocal.  Margaux DID demand that we look at the toys and she DID demand<br/>\nthat we buy her something.  We are feeling a little tight on money right<br/>\nnow, and trying to save for Christmas.<br/>\n&lt;snip&gt;<br/>\nIf parents are really generous with their time and money, kids will not<br/>\nfeel needy and demanding and when they do, there is usually a good<br/>\nreason.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: *8 What do you recommend for families that cannot financially keep up  with childrens&#39; demands?","postDate":"1226302643","msgId":40069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmOG9iais1aWxzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5Qjk4RDhCLTFCMkUtNDlGNy1BMjdBLThBOTEyRTQ0ODZFMkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40066,"nextInTopic":40072,"prevInTime":40068,"nextInTime":40070,"topicId":40049,"numMessagesInTopic":0,"msgSnippet":"... I ll tell a story about tonight.  My husband and I took Margaux out to see High School Musical 3, so that Chamille could have the house to herself for a","messageBody":"<div id=\"ygrps-yiv-669757423\"><blockquote><span title=\"ireply\">&gt; -=-What do you recommend for families that cannot financially keep up<br/>\n&gt; with childrens&#39; demands?-=-<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ll tell a story about tonight.  My husband and I took Margaux out to<br/>\nsee High School Musical 3, so that Chamille could have the house to<br/>\nherself for a bit.  Afterwards we needed to stop at the store to get a<br/>\nfew grocery items.<br/>\n<br/>\nThe store we went to is a little like a super target or walmart, but<br/>\nlocal.  Margaux DID demand that we look at the toys and she DID demand<br/>\nthat we buy her something.  We are feeling a little tight on money right<br/>\nnow, and trying to save for Christmas.<br/>\n<br/>\nNow, my husband was totally ok with purchasing something for Margaux, I<br/>\nwas the one having qualms about it.  He makes the money, so is willing<br/>\nto make more, I&#39;m the one who pays the bills and has to figure out how<br/>\nto get everything paid with the money we have, so we inherently come at<br/>\nmoney differently in that regard.<br/>\n<br/>\nNeither of us really liked that Margaux demanded we buy her something,<br/>\nbut she was needing food and that was our fault, and that was causing<br/>\nher to not be happy, or subtle, or easy-going about being in a store<br/>\nwith toys a-callin.  We decided that it would be easier and more<br/>\npleasant to agree to buy something relatively inexpensive for peace<br/>\nkeeping.<br/>\n<br/>\nI was in the store trying really hard to adjust my attitude about the<br/>\nwhole thing because my attitude wasn&#39;t helping anybody be or feel<br/>\nbetter.  Margaux asked me why I wasn&#39;t happy about her new toy.  I told<br/>\nher the truth, that we were feeling a bit broke right now and we were<br/>\ntrying to save money for Christmas presents, and that every time we make<br/>\npurchases, we have to shuffle the budget a little and potentially not<br/>\nhave money to put into savings for Christmas.<br/>\n<br/>\nA bit later she asked for a few food items that weren&#39;t on the list, and<br/>\nthen said, &quot;nevermind, I don&#39;t really NEED that, and it makes you have<br/>\nto spend more than you wanted to.&quot;  We assured her that it was ok to ask<br/>\nand that usually we will say &quot;yes&quot;, and that it was okay to add things<br/>\nto our grocery list.  Those who attend shopping, get a lot more say in<br/>\nwhat we buy.  We take requests from those that don&#39;t go, but there will<br/>\nalmost always be those spur of the moment items added.  Margaux agreed<br/>\nthat yes, we do usually say &quot;yes&quot; and that buying things for her isn&#39;t<br/>\nusually a big deal, IF we have the money.<br/>\n<br/>\nIt&#39;s part of learning about finances.  She&#39;s 7, she gets an allowance<br/>\nthat&#39;s usually not enough and we are very generous towards her wants and<br/>\nneeds to supplement that allowance.<br/>\n<br/>\nSo, never go to the toy store with a kid that doesn&#39;t truly understand<br/>\nthat you can&#39;t buy stuff, unless you intend on buying things, don&#39;t go<br/>\nwhen hungry and/or tired.<br/>\n<br/>\nHer demands, although seemingly rude, were based in the assumption that<br/>\nwe can give her &quot;everything&quot;, which is a pretty noble attribute to give<br/>\nto her parents.  She has a lot of faith in our ability to provide what<br/>\nshe wants.  Eventually, as she grows and understands better, she&#39;ll be<br/>\nable to also understand when we truly can&#39;t, or the value of waiting and<br/>\nsaving up for something bigger and better, and in the mean time, it&#39;s<br/>\nour job not to set any of us up for failure, by putting us in situations<br/>\nwhere there is a potential for dischord.  Afterall, we could have gone<br/>\nto a traditional grocery store and got in and out super fast, to go home<br/>\nand eat.<br/>\n<br/>\nIf parents are really generous with their time and money, kids will not<br/>\nfeel needy and demanding and when they do, there is usually a good<br/>\nreason.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] *8 What do you recommend for families that cannot financially keep up  with childrens&#39; demands?","postDate":"1226298476","msgId":40066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdENDQ2ODYwLTBCMUUtNDhGNi1BMjgwLTNGMzBGMDRBQzk4OUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQwOTY1OC41ODYyMC5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDQwOTY1OC41ODYyMC5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":40060,"nextInTopic":40069,"prevInTime":40065,"nextInTime":40067,"topicId":40049,"numMessagesInTopic":0,"msgSnippet":"-=-Legos can be very expensive and they want specific ones.  We do our best to buy what we can, but it is not everything they want. -=- It doesn t sound like","messageBody":"<div id=\"ygrps-yiv-535227122\">-=-Legos can be very expensive and they want specific ones.  We do  <br/>\nour best to buy what we can, but it is not everything they want. -=-<br/>\n<br/>\nIt doesn&#39;t sound like they &quot;demand&quot; Lego, though.  Sounds like they  <br/>\nappreciate it when they can get it!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] *8 What do you recommend for families that cannot financially keep up  with childrens&#39; demands?","postDate":"1226280326","msgId":40060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwOTY1OC41ODYyMC5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDE5Qjk4RDhCLTFCMkUtNDlGNy1BMjdBLThBOTEyRTQ0ODZFMkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40049,"nextInTopic":40066,"prevInTime":40059,"nextInTime":40061,"topicId":40049,"numMessagesInTopic":0,"msgSnippet":"-=-What do you recommend for families that cannot financially keep up with childrens demands?-=- ****I m going to add another perspective.  My boys don t","messageBody":"<div id=\"ygrps-yiv-1272955077\">-=-What do you recommend for families that cannot financially keep up  <br/>\n<br/>\nwith childrens&#39; demands?-=-<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n****I&#39;m going to add another perspective.  My boys don&#39;t care muh about clothes or shoes, other than they have to be comfortable.  However, they LOVE Legos.  <br/>\n<br/>\nLegos can be very expensive and they want specific ones.  We do our best to buy what we can, but it is not everything they want.  So we look at what they might want and discuss.  We buy sets from Ebay.  We avoid other activities that cost money so we can buy more Legos.  <br/>\n<br/>\nWhile I wish we could buy every Lego set out there, they seem satisfied.  They spend a lot of time talking about sets they want, but they understand when we can&#39;t buy them.  They know when John gets paid and that sometimes we have no money left for toys.  However, there is always next week and we sometimes we can rearrage finances to get someting they want.   Money is not a mystery and we are not saying yes or no arbitarily.  They know we would buy out Target if we could.  <br/>\nSo to answer the question, we discuss.  Just like every other problem that comes up.  We look for win-win solutions.  A smaller set and I can buy groceries.  They might wait with the promise that next paycheck there will be more money.  They can&#39;t have everything they want, but they know we are getting them as much as we can.  <br/>\n<br/>\nAmandaEli 7, Samuel 6<br/>\n<br/>\n <br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"*8 What do you recommend for families that cannot financially keep up  with childrens&#39; demands?","postDate":"1226271670","msgId":40049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Qjk4RDhCLTFCMkUtNDlGNy1BMjdBLThBOTEyRTQ0ODZFMkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":40060,"prevInTime":40048,"nextInTime":40050,"topicId":40049,"numMessagesInTopic":0,"msgSnippet":"-=-What do you recommend for families that cannot financially keep up with childrens demands?-=- My children are not at all demanding.  They re happy with","messageBody":"<div id=\"ygrps-yiv-1365341727\">-=-What do you recommend for families that cannot financially keep up  <br/>\nwith childrens&#39; demands?-=-<br/>\n<br/>\nMy children are not at all demanding.  They&#39;re happy with thrift  <br/>\nstore clothes, and shoes from Payless if they didn&#39;t find any at the  <br/>\nthrift store.  Holly has a couple of older friends who have given her  <br/>\nhand-me-downs for years.<br/>\n<br/>\nI&#39;m not sure what the question was intended to include.  Maybe the  <br/>\nquestion was whether if unschoolers want to say yes to children,  <br/>\nchildren won&#39;t &quot;yes&quot; them out of house and home, as it were.  But by  <br/>\nusing &quot;demands&quot; it shows the assumption of antagonism and  <br/>\nselfishness.   Those things are more likely to arise in response to a  <br/>\nlot of &quot;no&quot; and &quot;later&quot; and &quot;you&#39;re not old enough&quot; and &quot;you need to  <br/>\nearn that.&quot;<br/>\n<br/>\nMany of us have been there in our own lives, or seen it in friends,  <br/>\nneighbors and relatives.<br/>\n<br/>\nFewer people have seen the result of years of  unschooling, but many  <br/>\non this list have, and see it daily, and lots more at conferences.<br/>\n<br/>\n<br/>\n<br/>\nIf the question is &quot;What if a family can&#39;t afford to unschool?&quot;  then  <br/>\nthe answer is &quot;Then they should do something different.&quot;   Same as  <br/>\nthe answer would be at the tire store or the pizza parlor from the *1.<br/>\n<br/>\nIt&#39;s not the responsibility of unschoolers to ensure that every  <br/>\nfamily can unschool.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":40068,"nextTopicId":40073}}