{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1694471,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] offtopic: The Case for Defending America","postDate":"1012201196","msgId":31725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOWQwMWMxYTdkNiQ1NWY1ZGEyMCQ4MjVkZDFkMUBjb21wdXRlcj4=","referencesHeader":"PDIwMDIwMTI4MDExMS5nMFMxQmtFRTAyMTI1MEBueWNzbXRwMm91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":31691,"nextInTopic":0,"prevInTime":31724,"nextInTime":31726,"topicId":31691,"numMessagesInTopic":0,"msgSnippet":"Perhaps he needs to talk to his fellow republican and fellow Texan who is throwing money in the billions right, left and inbetween at other countries as we","messageBody":"<div id=\"ygrps-yiv-18445435\">Perhaps he needs to talk to his fellow republican and fellow Texan who is<br/>\nthrowing money in the billions right, left and inbetween at other countries<br/>\nas we speak.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Kolleen&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kolleen@...\">Kolleen@...</a>&gt;<br/>\nTo: &quot;Unschooling.com&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Sunday, January 27, 2002 5:12 PM<br/>\nSubject: [Unschooling-dotcom] offtopic: The Case for Defending America<br/>\n<br/>\n<br/>\n&gt; This article is definately worth reading in its entirety. I think its well<br/>\nwritten and worth the time to read it. -kolleen<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lewisnews.com/article.asp?ID=36074\">http://www.lewisnews.com/article.asp?ID=36074</a><br/>\n&gt;<br/>\n&gt; The Case for Defending America: By Congressman Ron Paul Posted on:<br/>\n1/24/2002 11:15:00 PM - Columnist<br/>\n&gt;<br/>\n&gt; As we begin this new legislative session, we cannot avoid reflecting on<br/>\nthis past year. All Americans will remember the moment and place when<br/>\ntragedy hit us on September 11th. We also all know that a good philosophy to<br/>\nfollow is to turn adversity into something positive, if at all possible.<br/>\nAlthough we have suffered for years from a flawed foreign policy and were<br/>\nalready in a recession before the attacks, the severity of these events has<br/>\nforced many of us to reassess our foreign and domestic policies. Hopefully,<br/>\npositive changes will come of this.<br/>\n&gt;<br/>\n&gt; It is just as well that the economy was already in recession for six<br/>\nmonths prior to the September attacks. Otherwise, the temptation would have<br/>\nbeen too great to blame the attacks for the weak economy rather than look<br/>\nfor the government policies responsible for the recession. Terrorist attacks<br/>\nalone, no matter how disruptive, could never be the sole source of a<br/>\nsignificant economic downturn.<br/>\n&gt;<br/>\n&gt; A major debate over foreign policy has naturally resulted from this<br/>\ncrisis. Dealing with the shortcomings of our policies of the past is<br/>\nessential. We were spending $40 billion a year on intelligence gathering<br/>\nthat, we must admit, failed. This tells us a problem exists. There are<br/>\nshortcomings with our $320 billion DOD budget that did not provide the<br/>\nprotection Americans expect.<br/>\n&gt;<br/>\n&gt; Obviously, a proper response to the terrorists requires sound judgment in<br/>\norder to prevent further suffering of the innocent or foolishly bring about<br/>\na worldwide conflict.<br/>\n&gt;<br/>\n&gt; One of the key responsibilities of the federal government in providing for<br/>\nnational defense is protection of liberty here at home. Unwisely responding<br/>\nto the attacks could undermine our national defense while threatening our<br/>\nliberties. What we have done so far since last September is not very<br/>\nreassuring. What we do here in the Congress in the coming months may well<br/>\ndetermine the survival of our republic. Fear and insecurity must not drive<br/>\nour policies. Sacrificing personal liberty should never be an option.<br/>\n&gt;<br/>\n&gt; Involving ourselves in every complex conflict around the globe hardly<br/>\nenhances our national security. The special interests that were already<br/>\nlined up at the public trough should not be permitted to use the ongoing<br/>\ncrisis as an opportunity to demand even more benefits. Let us all remember<br/>\nwhy the U.S. Congress was established, what our responsibilities are and<br/>\nwhat our oath of office means.<br/>\n&gt;<br/>\n&gt; It&#39;s been reported that since the 9-11 attacks, big-government answers<br/>\nhave gained in popularity, and people, fearful for their security, have<br/>\nlooked to the federal government for help. Polls indicate that acceptance of<br/>\ngovernment solutions to our problems is at its highest level in decades.<br/>\nThat may be true to some degree, or it may merely reflect the sentiments of<br/>\nthe moment, or even the way the questions were asked. Only time will tell.<br/>\nSince the welfare state is no more viable in the long run than a communist<br/>\nor fascist state, most Americans will eventually realize the fallacy of<br/>\ndepending on the government for economic security and know that personal<br/>\nliberty should not be sacrificed out of fear.<br/>\n&gt;<br/>\n&gt; Even with this massive rush to embrace all the bailouts offered up by<br/>\nWashington, a growing number of Americans are rightfully offended by the<br/>\nenormity of it all and annoyed that powerful and wealthy special interests<br/>\nseem to be getting the bulk of the benefits. In one area, though, a very<br/>\nhealthy reaction has occurred. Almost all Americans ­ especially those still<br/>\nflying commercial airlines ­ now know that they have a personal<br/>\nresponsibility to react to any threat on any flight. Passengers have<br/>\nresponded magnificently. Most people recognize that armed citizens best<br/>\nprotect our homes, because it is impossible for the police to be everywhere<br/>\nand prevent crimes from happening. A homeowner&#39;s ability to defend himself<br/>\nserves as a strong deterrent.<br/>\n&gt;<br/>\n&gt; Our government&#39;s ridiculous policy regarding airline safety and<br/>\nprohibiting guns on airplanes had indoctrinated us all ­ pilots, passengers<br/>\nand airline owners ­ to believe we should never resist hijackers. This set<br/>\nup the perfect conditions for terrorists to take over domestic flights, just<br/>\nas they did on September 11th.<br/>\n&gt;<br/>\n&gt; The people of this country now realize, more than ever, their own<br/>\nresponsibility for personal self-defense, using guns if necessary. The<br/>\nanti-gun fanatics have been very quiet since 9-11, and more Americans are<br/>\nready to assume responsibility for their own safety than ever before. This<br/>\nis all good.<br/>\n&gt;<br/>\n&gt; But sadly, the Congress went in the opposite direction in providing safety<br/>\non commercial flights. Pilots are not carrying guns, and security has been<br/>\nsocialized ­ in spite of the fact that security procedures authorized by the<br/>\nFAA prior to 9-11 were not compromised. The problem did not come from<br/>\nfailure to follow FAA rules; the problem resulted from precisely following<br/>\nFAA rules. No wonder so many Americans are wisely assuming they&#39;d better be<br/>\nready to protect themselves when necessary!<br/>\n&gt;<br/>\n&gt; This attitude is healthy, practical and legal under the Constitution.<br/>\nUnfortunately, too many people who have come to this conclusion still cling<br/>\nto the notion that economic security is a responsibility of the U.S.<br/>\ngovernment. That&#39;s the reason we have a $2 trillion annual budget and a<br/>\ngrowing $6 trillion national debt.<br/>\n&gt;<br/>\n&gt; Another positive result of last year&#39;s attacks was the uniting of many<br/>\nAmericans in an effort to deal with the problems the country faced. This<br/>\napplies more to the people who reflect true patriotism than it does to some<br/>\nof the politicians and special interests who took advantage of the<br/>\nsituation. If this renewed energy and sense of unity could be channeled<br/>\ncorrectly, much good could come of it. If misdirected, actual harm will<br/>\nresult.<br/>\n&gt;<br/>\n&gt; I give less credit to the Washington politicians who sing the songs of<br/>\npatriotism, but use the crisis to pursue their endless personal goal to gain<br/>\nmore political power. But the greatest condemnation should be directed<br/>\ntoward the special-interest lobbyists who finance the politicians in order<br/>\nto secure their power, while using patriotism as a cover and the crisis as a<br/>\ngolden opportunity. Indeed, those who are using the crisis to promote their<br/>\nown agenda are many.<br/>\n&gt;<br/>\n&gt; There is no doubt, as many have pointed out, our country changed<br/>\ndramatically with the horror that hit us on 9-11. The changes obviously are<br/>\na result of something other than the tragic loss of over 3,900 people. We<br/>\nkill that many people every month on our government highways. We lost 60,000<br/>\nyoung people in the Vietnam War, yet the sense of fear in our country then<br/>\nwas not the same as it is today. The major difference is that last year&#39;s<br/>\nattacks made us feel vulnerable, because it was clear that our federal<br/>\ngovernment had failed in its responsibility to provide defense against such<br/>\nan assault. And the anthrax scare certainly didn&#39;t help to diminish that<br/>\nfear.<br/>\n&gt;<br/>\n&gt; Giving up our civil liberties has made us feel even less safe from our own<br/>\ngovernment&#39;s intrusion in our lives. The two seem to be in conflict. How can<br/>\nwe be safer from outside threats while making ourselves more exposed to our<br/>\nown government&#39;s threat to our liberty?<br/>\n&gt;<br/>\n&gt; The most significant and dangerous result of last year&#39;s attacks has been<br/>\nthe bold expansion of the federal police state and our enhanced<br/>\ninternational role as the world&#39;s policeman.<br/>\n&gt;<br/>\n&gt; Although most of the legislation pushing the enhanced domestic and<br/>\ninternational role for our government passed by huge majorities, I&#39;m<br/>\nconvinced that the people&#39;s support for much of it is less enthusiastic than<br/>\nWashington politicians believe. As time progresses, the full impact of<br/>\nHomeland Security, and the unintended consequences of our growing overseas<br/>\ncommitments, will become apparent. And a large majority of Americans will<br/>\nappropriately ask, &quot;Why did the Congress do it?&quot;<br/>\n&gt;<br/>\n&gt; Unless we precisely understand the proper role of government in a free<br/>\nsociety, our problems will not be solved without sacrificing liberty. The<br/>\nwonderful thing is that our problems can be easily solved when protecting<br/>\nindividual liberty becomes our goal, rather than the erroneous assumption<br/>\nthat solutions must always be in conflict with liberty and that sacrificing<br/>\nsome liberty is to be expected during trying times. This is not necessary.<br/>\n&gt;<br/>\n&gt; Our Attorney General established a standard for disloyalty to the U.S.<br/>\ngovernment by claiming that those who talk of &quot;lost liberty&quot; serve to &quot;erode<br/>\nour national unity&quot; and &quot;give ammunition to America&#39;s enemies&quot; and &quot;only aid<br/>\nterrorists.&quot;<br/>\n&gt;<br/>\n&gt; The dangerous assumption is that, in the eyes of our top law-enforcement<br/>\nofficial, perceived disloyalty or even criticism of the government is<br/>\napproximating an act of terrorism. The grand irony is that this criticism is<br/>\nbeing directed toward those who, heaven forbid, are expressing concern for<br/>\nlosing our cherished liberties here at home. This, of course, is what the<br/>\nwhole war on terrorism is supposed to be about ­ protecting liberty, and<br/>\nthat includes the right of free expression.<br/>\n&gt;<br/>\n&gt; Our government leaders have threatened foreign countries by claiming that<br/>\nif they &quot;are not with us, they are against us,&quot; which leaves no room for the<br/>\nneutrality that has been practiced by some nations for centuries. This<br/>\nposition could easily result in perpetual conflicts with dozens of nations<br/>\naround the world.<br/>\n&gt;<br/>\n&gt; Could it ever come to a point where those who dissent at home against our<br/>\nmilitary operations overseas will be considered too sympathetic to the<br/>\nenemy? The Attorney General&#39;s comments suggest just that, and it has<br/>\nhappened here in our past. We indeed live in dangerous times. We are unable<br/>\nto guarantee protection from outside threats and may be approaching a time<br/>\nwhen our own government poses a threat to our liberties.<br/>\n&gt;<br/>\n&gt; No matter how sincere and well motivated, the effort to fight terrorism<br/>\nand provide for homeland security, if ill advised, will result neither in<br/>\nvanquishing terrorism nor in preserving our liberties. I am fearful that,<br/>\nhere in Washington, there&#39;s little understanding of the real cause of the<br/>\nterrorist attacks on us, little remembrance of the grand purpose of the<br/>\nAmerican experiment with liberty, or even how our Constitution was written<br/>\nto strictly limit government officials in all that they do.<br/>\n&gt;<br/>\n&gt; The military operation against the Taliban has gone well. The Taliban has<br/>\nbeen removed from power, and our government, with the help of the UN, is<br/>\nwell along the way toward establishing a new Afghan government. We weren&#39;t<br/>\nsupposed to be in the business of nation building, but I guess 9-11 changed<br/>\nall that. The one problem is that the actual number of al-Qaida members<br/>\ncaptured or killed is uncertain. Also the number of Taliban officials that<br/>\nhad any direct contact or knowledge of the attacks on us is purely<br/>\nspeculative. Since this war is carried out in secrecy, we&#39;ll probably not<br/>\nknow the details of what went on for years to come.<br/>\n&gt;<br/>\n&gt; I wonder how many civilians have been killed so far. I know a lot of<br/>\nMembers could care less, remembering innocent American civilians who were<br/>\nslaughtered in New York and Washington. But a policy that shows no concern<br/>\nfor the innocent will magnify our problems rather than lessen them. The hard<br/>\npart to understand in all of this is that Saudi Arabia probably had more to<br/>\ndo with these attacks than did Afghanistan.<br/>\n&gt;<br/>\n&gt; But then again, who wants to offend our oil partners?<br/>\n&gt;<br/>\n&gt; Our sterile approach to the bombing, with minimal loss of American life is<br/>\nto be commended, but it may generate outrage toward us by this lopsided<br/>\nkilling of persons totally unaware of the events of September 11th.<br/>\n&gt;<br/>\n&gt; Our President wisely has not been anxious to send in large numbers of<br/>\noccupying forces into Afghanistan. This also guarantees chaos among the<br/>\nwarring tribal factions. The odds of a stable Afghan government evolving out<br/>\nof this mess are remote. The odds of our investing large sums of money to<br/>\nbuy support for years to come are great.<br/>\n&gt;<br/>\n&gt; Unfortunately, it has been seen only as an opportunity for Pakistan and<br/>\nIndia to resume their warring ways, placing us in a dangerous situation.<br/>\nThis could easily get out of control, since China will not allow a clear-cut<br/>\nIndian victory over Pakistan. The danger of a nuclear confrontation is real.<br/>\nEven the British have spoken sympathetically about Pakistan&#39;s interests over<br/>\nIndia. The tragedy is that we have helped both India and Pakistan<br/>\nfinancially, and, therefore, the American taxpayer has indirectly<br/>\ncontributed funds for the weapons on both sides. Our troops in this region<br/>\nare potential targets of either or both countries.<br/>\n&gt;<br/>\n&gt; Fortunately, due to the many probable repercussions, a swift attack on<br/>\nIraq now seems less likely. Our surrogate army, organized by the Iraqi<br/>\nNational Congress, is now known to be a charade, prompting our<br/>\nadministration to stop all funding of this organization. Relying on the<br/>\nKurds to help remove Hussein defies logic, as the U.S.-funded Turkish army<br/>\ncontinues its war on the Kurds. There is just no coalition in the Persian<br/>\nGulf to take on Iraq, and, fortunately, our Secretary of State knows it.<br/>\n&gt;<br/>\n&gt; Our terrorist enemy is vague and elusive. Our plans to expand our current<br/>\nmilitary operations into many other countries are fraught with great risks ­<br/>\nrisks of making our problems worse. Not dealing with the people actually<br/>\nresponsible for the attacks and ignoring the root causes of the terrorism<br/>\nwill needlessly perpetuate and expand a war that will do nothing to enhance<br/>\nthe security and safety of the American people.<br/>\n&gt;<br/>\n&gt; Since Iraq is now less likely to be hit, it looks like another<br/>\npoverty-ridden, rudderless nation, possibly Somalia, will be the next<br/>\ntarget. No good can come of this process. It will provide more fodder for<br/>\nthe radicals&#39; claim that the war is about America against Islam. Somalia<br/>\nposes no threat to the United States, but bombing Somalia as we have<br/>\nAfghanistan ­ and Iraq for 12 years ­ will only incite more hatred toward<br/>\nthe U.S. and increase the odds of our someday getting hit again by some<br/>\nfrustrated, vengeful, radicalized Muslim.<br/>\n&gt;<br/>\n&gt; Our presence in the Persian Gulf is not necessary to provide for America&#39;s<br/>\ndefense. Our presence in the region makes all Americans more vulnerable to<br/>\nattacks and defending America much more difficult.<br/>\n&gt;<br/>\n&gt; The real reason for our presence in the Persian Gulf, as well as our<br/>\neagerness to assist in building a new Afghan government under UN authority,<br/>\nshould be apparent to us all.<br/>\n&gt;<br/>\n&gt; Stewart Eizenstat, Undersecretary of Economics, Business, and Agricultural<br/>\nAffairs for the previous administration, succinctly stated U.S. policy for<br/>\nAfghanistan, testifying before the Senate Foreign Relations &quot;Trade&quot;<br/>\nSubcommittee on October 13, 1997:<br/>\n&gt;<br/>\n&gt; [One of] &quot;Five main foreign policy interests in the Caspian region [is]<br/>\ncontinued support for U.S. companies&quot; [and] &quot;the least progress has been<br/>\nmade in Afghanistan, where gas and oil pipeline proposals designed to carry<br/>\ncentral Asian energy to world markets have been delayed indefinitely pending<br/>\nestablishment of a broad-based multi-ethnic government.&quot;<br/>\n&gt;<br/>\n&gt; This was a rather blunt acknowledgment of our intentions.<br/>\n&gt;<br/>\n&gt; It is apparent that our policy has not changed with this administration.<br/>\nOur new special envoy to Afghanistan, Zalmay Khalilzad, was at one time a<br/>\nlobbyist for the Taliban and worked for Unocal ­ the American oil company<br/>\nseeking rights to build oil and gas pipelines through northern Afghanistan.<br/>\nDuring his stint as a lobbyist, he urged approval of the Taliban and<br/>\ndefended them in the U.S. press. He now, of course, sings a different tune<br/>\nwith respect to the Taliban, but I am sure his views on the pipeline by U.S.<br/>\ncompanies have not changed.<br/>\n&gt;<br/>\n&gt; Born in Afghanistan, Khalilzad is a controversial figure, to say the<br/>\nleast, due to his close relationship with the oil industry and previously<br/>\nwith the Taliban. His appointment to the National Security Council very<br/>\nconveniently did not require confirmation by the Senate. Khalilzad also is a<br/>\nclose ally of the Secretary of Defense, Paul Wolfowitz, in promoting early<br/>\nand swift military action against Iraq.<br/>\n&gt;<br/>\n&gt; The point being, of course, that it may be good to have a new Afghan<br/>\ngovernment, but the question is whether that is our responsibility and<br/>\nwhether we should be doing it under the constraints of our Constitution.<br/>\nThere&#39;s a real question of whether it will serve our best interests in the<br/>\nlong-term.<br/>\n&gt;<br/>\n&gt; CIA support for the Shah of Iran for 25 years led to the long-term serious<br/>\nproblems with that nation that persist even to this day. Could oil be the<br/>\nreason we have concentrated on bombing Afghanistan while ignoring Saudi<br/>\nArabia, even though we have never found Osama bin Laden? Obviously, Saudi<br/>\nArabia is culpable in these terrorist attacks in the United States, and yet<br/>\nlittle is done about it.<br/>\n&gt;<br/>\n&gt; There are quite a few unintended consequences that might occur if our<br/>\nworldwide commitment to fighting terrorism is unrestrained.<br/>\n&gt;<br/>\n&gt; Russia&#39;s interests in the Afghan region are much more intense than Putin<br/>\nwould have us believe, and Russia&#39;s active involvement in a spreading<br/>\nregional conflict should be expected.<br/>\n&gt;<br/>\n&gt; An alliance between Iraq and Iran against the U.S. is a more likely<br/>\npossibility now than ever before. Iraqi Foreign Minister Naji Sabri is<br/>\noptimistically working on bringing the two nations together in a military<br/>\nalliance. His hope is that this would be activated if we attacked Iraq. The<br/>\ntwo nations have already exchanged prisoners of war as a step in that<br/>\ndirection.<br/>\n&gt;<br/>\n&gt; U.S. military planners are making preparations for our troops to stay in<br/>\nCentral Asia for a long time. A long time could mean 50 years! We have been<br/>\nin Korea for that long, and have been in Japan and Europe even longer, but<br/>\nthe time will come when we will wear out our welcome and have to leave these<br/>\nareas. The Vietnam War met with more resistance, and we left relatively<br/>\nquickly in humiliating defeat. Similarly, episodes of a more minor nature<br/>\noccurred in Somalia and Lebanon.<br/>\n&gt;<br/>\n&gt; Why look for more of these kinds of problems when it does not serve our<br/>\ninterests? Jeopardizing our security violates the spirit of our Constitution<br/>\nand inevitably costs us more than we can afford.<br/>\n&gt;<br/>\n&gt; Our permanent air bases built in Saudi Arabia are totally unessential to<br/>\nour security, contributed to the turmoil in the Middle East, and they<br/>\ncontinue to do so.<br/>\n&gt;<br/>\n&gt; We&#39;re building a giant new air base in Kyrgyzstan, a country once part of<br/>\nthe Soviet Union and close to Russia. China, also a neighbor, with whom we<br/>\neagerly seek a close relationship as a trading partner, will not ignore our<br/>\nmilitary buildup in this region.<br/>\n&gt;<br/>\n&gt; Islamic fundamentalists may overthrow the current government of Saudi<br/>\nArabia ­ a fear that drives her to cooperate openly with the terrorists<br/>\nwhile flaunting her relationship with the United States. The Wall Street<br/>\nJournal has editorialized that the solution ought to be our forcibly seizing<br/>\nthe Saudi Arabian oil fields and replacing the current government with an<br/>\neven more pro-Western government. All along I thought we condemned regimes<br/>\nthat took over their neighbors&#39; oil fields!<br/>\n&gt;<br/>\n&gt; The editorial, unbelievably explicit, concluded by saying: &quot;Finally, we<br/>\nmust be prepared to seize the Saudi oil fields and administer them for the<br/>\ngreater good.&quot; The greater good? I just wonder whose greater good?<br/>\n&gt;<br/>\n&gt; If the jingoism of the Wall Street Journal prevails, and the warmongers in<br/>\nthe Congress and the administration carry the day, we can assume with<br/>\ncertainty that these efforts being made will precipitate an uncontrollable<br/>\nbreakout of hostilities in the region that could lead to World War III.<br/>\n&gt;<br/>\n&gt; How a major publication can actually print an article that openly supports<br/>\nsuch aggression as a serious proposal is difficult to comprehend! Two<br/>\ncountries armed with nuclear weapons, on the verge of war in the region, and<br/>\nwe&#39;re being urged to dig a deeper hole for ourselves by seizing the Saudi<br/>\noil fields?<br/>\n&gt;<br/>\n&gt; Already the presence of our troops in the Muslim holy land of Saudi Arabia<br/>\nhas inflamed the hatred drove the terrorists to carry out their tragic acts<br/>\nof 9-11. Pursuing such an aggressive policy would only further undermine our<br/>\nability to defend the American people and will compound the economic<br/>\nproblems we face.<br/>\n&gt;<br/>\n&gt; Something, anything, regardless of its effectiveness, had to be done,<br/>\nsince the American people expected it, and Congress and the Administration<br/>\nwilled it. An effort to get the terrorists and their supporters is obviously<br/>\nin order, and hopefully that has been achieved. But a never-ending<br/>\ncommitment to end all terrorism in the world, whether it is related to the<br/>\nattack on September 11th or not, is neither a legitimate nor wise policy.<br/>\n&gt;<br/>\n&gt; HJ RES 64 gives the President authority to pursue only those guilty of the<br/>\nattack on us ­ not every terrorist in the entire world. Let there be no<br/>\ndoubt: for every terrorist identified, others will see only a freedom<br/>\nfighter.<br/>\n&gt;<br/>\n&gt; When we aided Osama bin Laden in the 1980s, he was a member of the<br/>\nMujahidien, and they were the freedom fighters waging a just war against the<br/>\nSoviet Army. A broad definition of terrorism outside the understanding of<br/>\n&quot;those who attack the United States&quot; opens a Pandora&#39;s box in our foreign<br/>\npolicy commitments.<br/>\n&gt;<br/>\n&gt; If we concentrate on searching for all terrorists throughout the world and<br/>\nbombing dozens of countries, but forget to deal with the important<br/>\ncontributing factors that drove those who killed our fellow citizens, we<br/>\nwill only make ourselves more vulnerable to new attacks.<br/>\n&gt;<br/>\n&gt; How can we forever fail to address the provocative nature of U.S. taxpayer<br/>\nmoney being used to suppress and kill Palestinians and ignore the affront to<br/>\nthe Islamic people that our military presence on their holy land of Saudi<br/>\nArabia causes ­ not to mention the persistent 12 years of bombing Iraq?<br/>\n&gt;<br/>\n&gt; I&#39;m fearful that an unlimited worldwide war against all terrorism will<br/>\ndistract from the serious consideration that must be given to our policy of<br/>\nforeign interventionism, driven by the powerful commercial interests and a<br/>\ndesire to promote world government. This is done while ignoring our<br/>\nprinciple responsibility of protecting national security and liberty here at<br/>\nhome.<br/>\n&gt;<br/>\n&gt; There is a serious problem with a policy that has allowed a successful<br/>\nattack on our homeland. It cannot be written off as a result of irrational<br/>\nyet efficient evildoers who are merely jealous of our success and despise<br/>\nour freedoms.<br/>\n&gt;<br/>\n&gt; We&#39;ve had enemies throughout our history, but never before have we<br/>\nsuffered such an attack that has made us feel so vulnerable. The cause of<br/>\nthis crisis is much more profound and requires looking inwardly as well as<br/>\noutwardly at our own policies as well as those of others.<br/>\n&gt;<br/>\n&gt; The Founders of this country were precise in their beliefs regarding<br/>\nforeign policy. Our Constitution reflects these beliefs, and all of our<br/>\nearly presidents endorsed these views. It was not until the 20th Century<br/>\nthat our nation went off to far away places looking for dragons to slay.<br/>\nThis past century reflects the new and less-traditional American policy of<br/>\nforeign interventionism. Our economic and military power, a result of our<br/>\ndomestic freedoms, has permitted us to survive and even thrive while<br/>\ndangerously expanding our worldwide influence.<br/>\n&gt;<br/>\n&gt; There&#39;s no historic precedent that such a policy can be continued forever.<br/>\nAll empires and great nations throughout history have ended when they<br/>\nstretched their commitments overseas too far and abused their financial<br/>\nsystem at home. The over-commitment of a country&#39;s military forces when<br/>\nforced with budgetary constraints can only lead to a lower standard of<br/>\nliving for its citizens. That has already started to happen here in the<br/>\nUnited States. Who today is confident the government and our private<br/>\nretirement systems are sound and the benefits guaranteed?<br/>\n&gt;<br/>\n&gt; The unfortunate complicating factor that all great powers suffer is the<br/>\nbuildup of animosity toward the nation currently at the top of the heap,<br/>\nwhich is aggravated by arrogance and domination over the weaker nations. We<br/>\nare beginning to see this, and the Wall Street Journal editorial clearly<br/>\nsymbolizes this arrogance.<br/>\n&gt;<br/>\n&gt; The traditional American foreign policy of the Founders and our presidents<br/>\nfor the first 145 years of our history entailed three points:<br/>\n&gt;<br/>\n&gt; Friendship with all nations desiring of such As much free trade and travel<br/>\nwith those countries as possible Avoiding entangling alliances<br/>\n&gt;<br/>\n&gt; This is still good advice. The Framers also understood that the important<br/>\npowers for dealing with other countries and the issue of war were to be<br/>\nplaced in the hands of the Congress. This principle has essentially been<br/>\nforgotten.<br/>\n&gt;<br/>\n&gt; The executive branch now has much more power than does the Congress.<br/>\nCongress continues to allow its authority to be transferred to the executive<br/>\nbranch, as well as to international agencies, such as the UN, NAFTA, IMF,<br/>\nand the WTO. Through executive orders, our presidents routinely use powers<br/>\nonce jealously guarded and held by the Congress.<br/>\n&gt;<br/>\n&gt; Today, through altering aid and sanctions, we buy and sell our<br/>\n&quot;friendship&quot; with all kinds of threats and bribes in our effort to spread<br/>\nour influence around the world. To most people in Washington, free trade<br/>\nmeans international managed trade, with subsidies and support for the WTO,<br/>\nwhere influential corporations can seek sanctions against their competitors.<br/>\nOur alliances, too numerous to count, have committed our dollars and our<br/>\ntroops to such an extent that, under today&#39;s circumstances, there&#39;s not a<br/>\nborder war or civil disturbance in the world in which we do not have a<br/>\nstake. And more than likely, we have a stake ­ foreign aid ­ in both sides<br/>\nof each military conflict.<br/>\n&gt;<br/>\n&gt; After the demise of our nemesis, the Soviet Union, many believed that we<br/>\ncould safely withdraw from some of our worldwide commitments. It was hoped<br/>\nwe would start minding our own business, save some money, and reduce the<br/>\nthreat to our military personnel. But the opposite has happened. Without any<br/>\ninternational competition for super-power status, our commitments have grown<br/>\nand spread, so that today we provide better military protection to Taiwan<br/>\nand South Korea and Saudi Arabia than we do for our own cities like New York<br/>\nand Washington.<br/>\n&gt;<br/>\n&gt; I am certain that national security and defense of our own cities can<br/>\nnever be adequately provided unless we reconsider our policy of foreign<br/>\ninterventionism.<br/>\n&gt;<br/>\n&gt; Conventional wisdom in Washington today is that we have no choice but to<br/>\nplay the role of the world&#39;s only superpower. Recently, we had to cancel<br/>\nflights of our own Air Force over our cities because of spending<br/>\nconstraints, and we rely on foreign AWACS aircraft to patrol our airspace.<br/>\n&gt;<br/>\n&gt; The American people are not in sync with the assumption that we must<br/>\ncommit ourselves endlessly to being the world&#39;s policemen. If we do not<br/>\nwisely step back and reassess our worldwide commitments and our endless<br/>\nentanglements as we march toward world government, economic law will one day<br/>\nforce us to do so anyway under undesirable circumstances. In the meantime,<br/>\nwe can expect plenty more military confrontations around the world while<br/>\nbecoming even more vulnerable to attack by terrorists here at home.<br/>\n&gt;<br/>\n&gt; January 25, 2002<br/>\n&gt;<br/>\n&gt; Dr. Ron Paul is a Republican member of Congress from Texas.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":85994576,"authorName":"Kolleen","from":"Kolleen &lt;Kolleen@...&gt;","profile":"kaydeecross","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"offtopic: The Case for Defending America","postDate":"1012180365","msgId":31691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTI4MDExMS5nMFMxQmtFRTAyMTI1MEBueWNzbXRwMm91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":0,"nextInTopic":31725,"prevInTime":31690,"nextInTime":31692,"topicId":31691,"numMessagesInTopic":0,"msgSnippet":"This article is definately worth reading in its entirety. I think its well written and worth the time to read it. -kolleen ","messageBody":"<div id=\"ygrps-yiv-1852962679\">This article is definately worth reading in its entirety. I think its well written and worth the time to read it. -kolleen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lewisnews.com/article.asp?ID=36074\">http://www.lewisnews.com/article.asp?ID=36074</a><br/>\n<br/>\nThe Case for Defending America: By Congressman Ron Paul Posted on: 1/24/2002 11:15:00 PM - Columnist <br/>\n<br/>\nAs we begin this new legislative session, we cannot avoid reflecting on this past year. All Americans will remember the moment and place when tragedy hit us on September 11th. We also all know that a good philosophy to follow is to turn adversity into something positive, if at all possible. Although we have suffered for years from a flawed foreign policy and were already in a recession before the attacks, the severity of these events has forced many of us to reassess our foreign and domestic policies. Hopefully, positive changes will come of this.<br/>\n<br/>\nIt is just as well that the economy was already in recession for six months prior to the September attacks. Otherwise, the temptation would have been too great to blame the attacks for the weak economy rather than look for the government policies responsible for the recession. Terrorist attacks alone, no matter how disruptive, could never be the sole source of a significant economic downturn.<br/>\n<br/>\nA major debate over foreign policy has naturally resulted from this crisis. Dealing with the shortcomings of our policies of the past is essential. We were spending $40 billion a year on intelligence gathering that, we must admit, failed. This tells us a problem exists. There are shortcomings with our $320 billion DOD budget that did not provide the protection Americans expect.<br/>\n<br/>\nObviously, a proper response to the terrorists requires sound judgment in order to prevent further suffering of the innocent or foolishly bring about a worldwide conflict.<br/>\n<br/>\nOne of the key responsibilities of the federal government in providing for national defense is protection of liberty here at home. Unwisely responding to the attacks could undermine our national defense while threatening our liberties. What we have done so far since last September is not very reassuring. What we do here in the Congress in the coming months may well determine the survival of our republic. Fear and insecurity must not drive our policies. Sacrificing personal liberty should never be an option.<br/>\n<br/>\nInvolving ourselves in every complex conflict around the globe hardly enhances our national security. The special interests that were already lined up at the public trough should not be permitted to use the ongoing crisis as an opportunity to demand even more benefits. Let us all remember why the U.S. Congress was established, what our responsibilities are and what our oath of office means.<br/>\n<br/>\nIt&#39;s been reported that since the 9-11 attacks, big-government answers have gained in popularity, and people, fearful for their security, have looked to the federal government for help. Polls indicate that acceptance of government solutions to our problems is at its highest level in decades. That may be true to some degree, or it may merely reflect the sentiments of the moment, or even the way the questions were asked. Only time will tell. Since the welfare state is no more viable in the long run than a communist or fascist state, most Americans will eventually realize the fallacy of depending on the government for economic security and know that personal liberty should not be sacrificed out of fear.<br/>\n<br/>\nEven with this massive rush to embrace all the bailouts offered up by Washington, a growing number of Americans are rightfully offended by the enormity of it all and annoyed that powerful and wealthy special interests seem to be getting the bulk of the benefits. In one area, though, a very healthy reaction has occurred. Almost all Americans ­ especially those still flying commercial airlines ­ now know that they have a personal responsibility to react to any threat on any flight. Passengers have responded magnificently. Most people recognize that armed citizens best protect our homes, because it is impossible for the police to be everywhere and prevent crimes from happening. A homeowner&#39;s ability to defend himself serves as a strong deterrent.<br/>\n<br/>\nOur government&#39;s ridiculous policy regarding airline safety and prohibiting guns on airplanes had indoctrinated us all ­ pilots, passengers and airline owners ­ to believe we should never resist hijackers. This set up the perfect conditions for terrorists to take over domestic flights, just as they did on September 11th.<br/>\n<br/>\nThe people of this country now realize, more than ever, their own responsibility for personal self-defense, using guns if necessary. The anti-gun fanatics have been very quiet since 9-11, and more Americans are ready to assume responsibility for their own safety than ever before. This is all good.<br/>\n<br/>\nBut sadly, the Congress went in the opposite direction in providing safety on commercial flights. Pilots are not carrying guns, and security has been socialized ­ in spite of the fact that security procedures authorized by the FAA prior to 9-11 were not compromised. The problem did not come from failure to follow FAA rules; the problem resulted from precisely following FAA rules. No wonder so many Americans are wisely assuming they&#39;d better be ready to protect themselves when necessary!<br/>\n<br/>\nThis attitude is healthy, practical and legal under the Constitution. Unfortunately, too many people who have come to this conclusion still cling to the notion that economic security is a responsibility of the U.S. government. That&#39;s the reason we have a $2 trillion annual budget and a growing $6 trillion national debt.<br/>\n<br/>\nAnother positive result of last year&#39;s attacks was the uniting of many Americans in an effort to deal with the problems the country faced. This applies more to the people who reflect true patriotism than it does to some of the politicians and special interests who took advantage of the situation. If this renewed energy and sense of unity could be channeled correctly, much good could come of it. If misdirected, actual harm will result.<br/>\n<br/>\nI give less credit to the Washington politicians who sing the songs of patriotism, but use the crisis to pursue their endless personal goal to gain more political power. But the greatest condemnation should be directed toward the special-interest lobbyists who finance the politicians in order to secure their power, while using patriotism as a cover and the crisis as a golden opportunity. Indeed, those who are using the crisis to promote their own agenda are many.<br/>\n<br/>\nThere is no doubt, as many have pointed out, our country changed dramatically with the horror that hit us on 9-11. The changes obviously are a result of something other than the tragic loss of over 3,900 people. We kill that many people every month on our government highways. We lost 60,000 young people in the Vietnam War, yet the sense of fear in our country then was not the same as it is today. The major difference is that last year&#39;s attacks made us feel vulnerable, because it was clear that our federal government had failed in its responsibility to provide defense against such an assault. And the anthrax scare certainly didn&#39;t help to diminish that fear.<br/>\n<br/>\nGiving up our civil liberties has made us feel even less safe from our own government&#39;s intrusion in our lives. The two seem to be in conflict. How can we be safer from outside threats while making ourselves more exposed to our own government&#39;s threat to our liberty?<br/>\n<br/>\nThe most significant and dangerous result of last year&#39;s attacks has been the bold expansion of the federal police state and our enhanced international role as the world&#39;s policeman.<br/>\n<br/>\nAlthough most of the legislation pushing the enhanced domestic and international role for our government passed by huge majorities, I&#39;m convinced that the people&#39;s support for much of it is less enthusiastic than Washington politicians believe. As time progresses, the full impact of Homeland Security, and the unintended consequences of our growing overseas commitments, will become apparent. And a large majority of Americans will appropriately ask, &quot;Why did the Congress do it?&quot;<br/>\n<br/>\nUnless we precisely understand the proper role of government in a free society, our problems will not be solved without sacrificing liberty. The wonderful thing is that our problems can be easily solved when protecting individual liberty becomes our goal, rather than the erroneous assumption that solutions must always be in conflict with liberty and that sacrificing some liberty is to be expected during trying times. This is not necessary.<br/>\n<br/>\nOur Attorney General established a standard for disloyalty to the U.S. government by claiming that those who talk of &quot;lost liberty&quot; serve to &quot;erode our national unity&quot; and &quot;give ammunition to America&#39;s enemies&quot; and &quot;only aid terrorists.&quot;<br/>\n<br/>\nThe dangerous assumption is that, in the eyes of our top law-enforcement official, perceived disloyalty or even criticism of the government is approximating an act of terrorism. The grand irony is that this criticism is being directed toward those who, heaven forbid, are expressing concern for losing our cherished liberties here at home. This, of course, is what the whole war on terrorism is supposed to be about ­ protecting liberty, and that includes the right of free expression.<br/>\n<br/>\nOur government leaders have threatened foreign countries by claiming that if they &quot;are not with us, they are against us,&quot; which leaves no room for the neutrality that has been practiced by some nations for centuries. This position could easily result in perpetual conflicts with dozens of nations around the world.<br/>\n<br/>\nCould it ever come to a point where those who dissent at home against our military operations overseas will be considered too sympathetic to the enemy? The Attorney General&#39;s comments suggest just that, and it has happened here in our past. We indeed live in dangerous times. We are unable to guarantee protection from outside threats and may be approaching a time when our own government poses a threat to our liberties.<br/>\n<br/>\nNo matter how sincere and well motivated, the effort to fight terrorism and provide for homeland security, if ill advised, will result neither in vanquishing terrorism nor in preserving our liberties. I am fearful that, here in Washington, there&#39;s little understanding of the real cause of the terrorist attacks on us, little remembrance of the grand purpose of the American experiment with liberty, or even how our Constitution was written to strictly limit government officials in all that they do.<br/>\n<br/>\nThe military operation against the Taliban has gone well. The Taliban has been removed from power, and our government, with the help of the UN, is well along the way toward establishing a new Afghan government. We weren&#39;t supposed to be in the business of nation building, but I guess 9-11 changed all that. The one problem is that the actual number of al-Qaida members captured or killed is uncertain. Also the number of Taliban officials that had any direct contact or knowledge of the attacks on us is purely speculative. Since this war is carried out in secrecy, we&#39;ll probably not know the details of what went on for years to come.<br/>\n<br/>\nI wonder how many civilians have been killed so far. I know a lot of Members could care less, remembering innocent American civilians who were slaughtered in New York and Washington. But a policy that shows no concern for the innocent will magnify our problems rather than lessen them. The hard part to understand in all of this is that Saudi Arabia probably had more to do with these attacks than did Afghanistan.<br/>\n<br/>\nBut then again, who wants to offend our oil partners?<br/>\n<br/>\nOur sterile approach to the bombing, with minimal loss of American life is to be commended, but it may generate outrage toward us by this lopsided killing of persons totally unaware of the events of September 11th.<br/>\n<br/>\nOur President wisely has not been anxious to send in large numbers of occupying forces into Afghanistan. This also guarantees chaos among the warring tribal factions. The odds of a stable Afghan government evolving out of this mess are remote. The odds of our investing large sums of money to buy support for years to come are great.<br/>\n<br/>\nUnfortunately, it has been seen only as an opportunity for Pakistan and India to resume their warring ways, placing us in a dangerous situation. This could easily get out of control, since China will not allow a clear-cut Indian victory over Pakistan. The danger of a nuclear confrontation is real. Even the British have spoken sympathetically about Pakistan&#39;s interests over India. The tragedy is that we have helped both India and Pakistan financially, and, therefore, the American taxpayer has indirectly contributed funds for the weapons on both sides. Our troops in this region are potential targets of either or both countries.<br/>\n<br/>\nFortunately, due to the many probable repercussions, a swift attack on Iraq now seems less likely. Our surrogate army, organized by the Iraqi National Congress, is now known to be a charade, prompting our administration to stop all funding of this organization. Relying on the Kurds to help remove Hussein defies logic, as the U.S.-funded Turkish army continues its war on the Kurds. There is just no coalition in the Persian Gulf to take on Iraq, and, fortunately, our Secretary of State knows it.<br/>\n<br/>\nOur terrorist enemy is vague and elusive. Our plans to expand our current military operations into many other countries are fraught with great risks ­ risks of making our problems worse. Not dealing with the people actually responsible for the attacks and ignoring the root causes of the terrorism will needlessly perpetuate and expand a war that will do nothing to enhance the security and safety of the American people.<br/>\n<br/>\nSince Iraq is now less likely to be hit, it looks like another poverty-ridden, rudderless nation, possibly Somalia, will be the next target. No good can come of this process. It will provide more fodder for the radicals&#39; claim that the war is about America against Islam. Somalia poses no threat to the United States, but bombing Somalia as we have Afghanistan ­ and Iraq for 12 years ­ will only incite more hatred toward the U.S. and increase the odds of our someday getting hit again by some frustrated, vengeful, radicalized Muslim.<br/>\n<br/>\nOur presence in the Persian Gulf is not necessary to provide for America&#39;s defense. Our presence in the region makes all Americans more vulnerable to attacks and defending America much more difficult.<br/>\n<br/>\nThe real reason for our presence in the Persian Gulf, as well as our eagerness to assist in building a new Afghan government under UN authority, should be apparent to us all.<br/>\n<br/>\nStewart Eizenstat, Undersecretary of Economics, Business, and Agricultural Affairs for the previous administration, succinctly stated U.S. policy for Afghanistan, testifying before the Senate Foreign Relations &quot;Trade&quot; Subcommittee on October 13, 1997:<br/>\n<br/>\n[One of] &quot;Five main foreign policy interests in the Caspian region [is] continued support for U.S. companies&quot; [and] &quot;the least progress has been made in Afghanistan, where gas and oil pipeline proposals designed to carry central Asian energy to world markets have been delayed indefinitely pending establishment of a broad-based multi-ethnic government.&quot;<br/>\n<br/>\nThis was a rather blunt acknowledgment of our intentions.<br/>\n<br/>\nIt is apparent that our policy has not changed with this administration. Our new special envoy to Afghanistan, Zalmay Khalilzad, was at one time a lobbyist for the Taliban and worked for Unocal ­ the American oil company seeking rights to build oil and gas pipelines through northern Afghanistan. During his stint as a lobbyist, he urged approval of the Taliban and defended them in the U.S. press. He now, of course, sings a different tune with respect to the Taliban, but I am sure his views on the pipeline by U.S. companies have not changed.<br/>\n<br/>\nBorn in Afghanistan, Khalilzad is a controversial figure, to say the least, due to his close relationship with the oil industry and previously with the Taliban. His appointment to the National Security Council very conveniently did not require confirmation by the Senate. Khalilzad also is a close ally of the Secretary of Defense, Paul Wolfowitz, in promoting early and swift military action against Iraq.<br/>\n<br/>\nThe point being, of course, that it may be good to have a new Afghan government, but the question is whether that is our responsibility and whether we should be doing it under the constraints of our Constitution. There&#39;s a real question of whether it will serve our best interests in the long-term.<br/>\n<br/>\nCIA support for the Shah of Iran for 25 years led to the long-term serious problems with that nation that persist even to this day. Could oil be the reason we have concentrated on bombing Afghanistan while ignoring Saudi Arabia, even though we have never found Osama bin Laden? Obviously, Saudi Arabia is culpable in these terrorist attacks in the United States, and yet little is done about it.<br/>\n<br/>\nThere are quite a few unintended consequences that might occur if our worldwide commitment to fighting terrorism is unrestrained.<br/>\n<br/>\nRussia&#39;s interests in the Afghan region are much more intense than Putin would have us believe, and Russia&#39;s active involvement in a spreading regional conflict should be expected.<br/>\n<br/>\nAn alliance between Iraq and Iran against the U.S. is a more likely possibility now than ever before. Iraqi Foreign Minister Naji Sabri is optimistically working on bringing the two nations together in a military alliance. His hope is that this would be activated if we attacked Iraq. The two nations have already exchanged prisoners of war as a step in that direction.<br/>\n<br/>\nU.S. military planners are making preparations for our troops to stay in Central Asia for a long time. A long time could mean 50 years! We have been in Korea for that long, and have been in Japan and Europe even longer, but the time will come when we will wear out our welcome and have to leave these areas. The Vietnam War met with more resistance, and we left relatively quickly in humiliating defeat. Similarly, episodes of a more minor nature occurred in Somalia and Lebanon.<br/>\n<br/>\nWhy look for more of these kinds of problems when it does not serve our interests? Jeopardizing our security violates the spirit of our Constitution and inevitably costs us more than we can afford.<br/>\n<br/>\nOur permanent air bases built in Saudi Arabia are totally unessential to our security, contributed to the turmoil in the Middle East, and they continue to do so.<br/>\n<br/>\nWe&#39;re building a giant new air base in Kyrgyzstan, a country once part of the Soviet Union and close to Russia. China, also a neighbor, with whom we eagerly seek a close relationship as a trading partner, will not ignore our military buildup in this region.<br/>\n<br/>\nIslamic fundamentalists may overthrow the current government of Saudi Arabia ­ a fear that drives her to cooperate openly with the terrorists while flaunting her relationship with the United States. The Wall Street Journal has editorialized that the solution ought to be our forcibly seizing the Saudi Arabian oil fields and replacing the current government with an even more pro-Western government. All along I thought we condemned regimes that took over their neighbors&#39; oil fields!<br/>\n<br/>\nThe editorial, unbelievably explicit, concluded by saying: &quot;Finally, we must be prepared to seize the Saudi oil fields and administer them for the greater good.&quot;  The greater good? I just wonder whose greater good?<br/>\n<br/>\nIf the jingoism of the Wall Street Journal prevails, and the warmongers in the Congress and the administration carry the day, we can assume with certainty that these efforts being made will precipitate an uncontrollable breakout of hostilities in the region that could lead to World War III.<br/>\n<br/>\nHow a major publication can actually print an article that openly supports such aggression as a serious proposal is difficult to comprehend! Two countries armed with nuclear weapons, on the verge of war in the region, and we&#39;re being urged to dig a deeper hole for ourselves by seizing the Saudi oil fields?<br/>\n<br/>\nAlready the presence of our troops in the Muslim holy land of Saudi Arabia has inflamed the hatred drove the terrorists to carry out their tragic acts of 9-11. Pursuing such an aggressive policy would only further undermine our ability to defend the American people and will compound the economic problems we face.<br/>\n<br/>\nSomething, anything, regardless of its effectiveness, had to be done, since the American people expected it, and Congress and the Administration willed it. An effort to get the terrorists and their supporters is obviously in order, and hopefully that has been achieved. But a never-ending commitment to end all terrorism in the world, whether it is related to the attack on September 11th or not, is neither a legitimate nor wise policy.<br/>\n<br/>\nHJ RES 64 gives the President authority to pursue only those guilty of the attack on us ­ not every terrorist in the entire world. Let there be no doubt: for every terrorist identified, others will see only a freedom fighter.<br/>\n<br/>\nWhen we aided Osama bin Laden in the 1980s, he was a member of the Mujahidien, and they were the freedom fighters waging a just war against the Soviet Army. A broad definition of terrorism outside the understanding of &quot;those who attack the United States&quot; opens a Pandora&#39;s box in our foreign policy commitments.<br/>\n<br/>\nIf we concentrate on searching for all terrorists throughout the world and bombing dozens of countries, but forget to deal with the important contributing factors that drove those who killed our fellow citizens, we will only make ourselves more vulnerable to new attacks.<br/>\n<br/>\nHow can we forever fail to address the provocative nature of U.S. taxpayer money being used to suppress and kill Palestinians and ignore the affront to the Islamic people that our military presence on their holy land of Saudi Arabia causes ­ not to mention the persistent 12 years of bombing Iraq?<br/>\n<br/>\nI&#39;m fearful that an unlimited worldwide war against all terrorism will distract from the serious consideration that must be given to our policy of foreign interventionism, driven by the powerful commercial interests and a desire to promote world government. This is done while ignoring our principle responsibility of protecting national security and liberty here at home.<br/>\n<br/>\nThere is a serious problem with a policy that has allowed a successful attack on our homeland. It cannot be written off as a result of irrational yet efficient evildoers who are merely jealous of our success and despise our freedoms.<br/>\n<br/>\nWe&#39;ve had enemies throughout our history, but never before have we suffered such an attack that has made us feel so vulnerable. The cause of this crisis is much more profound and requires looking inwardly as well as outwardly at our own policies as well as those of others.<br/>\n<br/>\nThe Founders of this country were precise in their beliefs regarding foreign policy. Our Constitution reflects these beliefs, and all of our early presidents endorsed these views. It was not until the 20th Century that our nation went off to far away places looking for dragons to slay. This past century reflects the new and less-traditional American policy of foreign interventionism. Our economic and military power, a result of our domestic freedoms, has permitted us to survive and even thrive while dangerously expanding our worldwide influence.<br/>\n<br/>\nThere&#39;s no historic precedent that such a policy can be continued forever. All empires and great nations throughout history have ended when they stretched their commitments overseas too far and abused their financial system at home. The over-commitment of a country&#39;s military forces when forced with budgetary constraints can only lead to a lower standard of living for its citizens. That has already started to happen here in the United States. Who today is confident the government and our private retirement systems are sound and the benefits guaranteed?<br/>\n<br/>\nThe unfortunate complicating factor that all great powers suffer is the buildup of animosity toward the nation currently at the top of the heap, which is aggravated by arrogance and domination over the weaker nations. We are beginning to see this, and the Wall Street Journal editorial clearly symbolizes this arrogance.<br/>\n<br/>\nThe traditional American foreign policy of the Founders and our presidents for the first 145 years of our history entailed three points:<br/>\n<br/>\nFriendship with all nations desiring of such As much free trade and travel with those countries as possible Avoiding entangling alliances<br/>\n<br/>\nThis is still good advice. The Framers also understood that the important powers for dealing with other countries and the issue of war were to be placed in the hands of the Congress. This principle has essentially been forgotten.<br/>\n<br/>\nThe executive branch now has much more power than does the Congress. Congress continues to allow its authority to be transferred to the executive branch, as well as to international agencies, such as the UN, NAFTA, IMF, and the WTO. Through executive orders, our presidents routinely use powers once jealously guarded and held by the Congress.<br/>\n<br/>\nToday, through altering aid and sanctions, we buy and sell our &quot;friendship&quot; with all kinds of threats and bribes in our effort to spread our influence around the world. To most people in Washington, free trade means international managed trade, with subsidies and support for the WTO, where influential corporations can seek sanctions against their competitors. Our alliances, too numerous to count, have committed our dollars and our troops to such an extent that, under today&#39;s circumstances, there&#39;s not a border war or civil disturbance in the world in which we do not have a stake. And more than likely, we have a stake ­ foreign aid ­ in both sides of each military conflict.<br/>\n<br/>\nAfter the demise of our nemesis, the Soviet Union, many believed that we could safely withdraw from some of our worldwide commitments. It was hoped we would start minding our own business, save some money, and reduce the threat to our military personnel. But the opposite has happened. Without any international competition for super-power status, our commitments have grown and spread, so that today we provide better military protection to Taiwan and South Korea and Saudi Arabia than we do for our own cities like New York and Washington.<br/>\n<br/>\nI am certain that national security and defense of our own cities can never be adequately provided unless we reconsider our policy of foreign interventionism.<br/>\n<br/>\nConventional wisdom in Washington today is that we have no choice but to play the role of the world&#39;s only superpower. Recently, we had to cancel flights of our own Air Force over our cities because of spending constraints, and we rely on foreign AWACS aircraft to patrol our airspace.<br/>\n<br/>\nThe American people are not in sync with the assumption that we must commit ourselves endlessly to being the world&#39;s policemen. If we do not wisely step back and reassess our worldwide commitments and our endless entanglements as we march toward world government, economic law will one day force us to do so anyway under undesirable circumstances. In the meantime, we can expect plenty more military confrontations around the world while becoming even more vulnerable to attack by terrorists here at home.<br/>\n<br/>\nJanuary 25, 2002<br/>\n<br/>\nDr. Ron Paul is a Republican member of Congress from Texas.</div>","specialLinks":[]}],"prevTopicId":31719,"nextTopicId":31704}}