{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":73238415,"authorName":"Julie Stauffer","from":"&quot;Julie Stauffer&quot; &lt;jnjstau@...&gt;","profile":"callingmoon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The party is over","postDate":"1039461044","msgId":11196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWMyOWZiNiRiYTllNWM4MCRkMTgwZWU0MEBkZWZhdWx0Pg==","referencesHeader":"PDEwMzk0MzU3MDAuMzA0LjIzMTU4Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":11191,"nextInTopic":0,"prevInTime":11195,"nextInTime":11197,"topicId":11185,"numMessagesInTopic":0,"msgSnippet":" We used to go through this with a neighbor who only had one female child. The mom liked her dd to play with my","messageBody":"<div id=\"ygrps-yiv-1662763890\">&lt;&lt;You can come inside today but he can not&gt;&gt;<br/>\n<br/>\nWe used to go through this with a neighbor who only had one female child.<br/>\nThe mom liked her dd to play with my oldest dd who is quiet and oh so<br/>\nfeminine but shuddered every time she saw my younger son coming up her walk.<br/>\nThe mom took his rambunctiousness as being poorly behaved and frankly he got<br/>\non her nerves.  Anytime the boys wanted to be included, they weren&#39;t allowed<br/>\nto play in these peoples&#39; home.  It got yucky but I talked to Zach about<br/>\ndifferent people having different comfort levels and made sure he found some<br/>\nfriends whose parents actually loved him.<br/>\n<br/>\nBut we have also been on the other side of the fence.  Little neighbor girl<br/>\nthat my dd did not like whatsoever.  Parents were determined that our girls<br/>\nbe friends.  Kept sending dd over to play and my dd would beg me to answer<br/>\nthe door and make excuses.  Little girl would try to barge in.  I finally<br/>\ntalked with the mom as gently as I could but all I got was grief because<br/>\nAdriane didn&#39;t invite the little girl to her birthday party.  I refused to<br/>\nmake Adriane not be the star of her own birthday and didn&#39;t force Adriane to<br/>\ninvite the little girl.  It got ugly with the little girl yelling things out<br/>\nher door at Adriane.<br/>\n<br/>\nAdriane only wanted the right to choose her own friends.<br/>\n<br/>\n(Not saying this is what is happening with the other kids being discussed at<br/>\nall)<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":48651385,"authorName":"tessimal &lt;tessimal@yahoo.com&gt;","from":"&quot;tessimal &lt;tessimal@...&gt;&quot; &lt;tessimal@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The party is over","postDate":"1039443132","msgId":11191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF0MjhicytyZ2NqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNwcmluZ21haWwuMDk5NC4xMDM5MzczMDg5LjAuNzM3NTkxMDBAd2VibWFpbC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":11187,"nextInTopic":11196,"prevInTime":11190,"nextInTime":11192,"topicId":11185,"numMessagesInTopic":0,"msgSnippet":"... Her mom is the one who decides who comes, controlling the situation. This is why I call it a game.  It s a game of exclusion and its played often here","messageBody":"<div id=\"ygrps-yiv-232567459\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &lt;maryfhickman@j...&gt; wrote:<br/>\n&lt;&gt;Her mom is the one who decides who comes, controlling the <br/>\nsituation. This is why I call it a game.  It&#39;s a game of exclusion <br/>\nand its played often here from this family.Riley is the one who gets <br/>\nexcluded the most. You can come inside today, but he can not... So <br/>\nreally it is no surprise that every year someone does not get to<br/>\ncome. Power, plane and simple.&lt;&gt;<br/>\n<br/>\nMary:<br/>\n<br/>\nI guess when it comes to birthday parties I have to say up front that <br/>\nI feel it is up to the birthday child and their parents to decide who <br/>\ndoes or does not come.  The parents foot the bill and either risk <br/>\ntheir home and whatever damage is done, or must organize a suitable <br/>\nparty venue at their expense.  So the decision isn&#39;t solely up to the <br/>\nchild.  And children are learning to make decisions, too, not out of <br/>\nexclusion, but just time, space, and economic factors.  <br/>\n<br/>\nMy daughter loves birthday celebrations and every year she plans <br/>\nsomething very special.  We are very low income so this is a big deal <br/>\nfor her.  We always look for the best bargains we can find, but ones <br/>\nthat will be memorable.  <br/>\n<br/>\nWhen my daughter was 8 she had 8 friends visit the local children&#39;s <br/>\nmuseum to run and play, then home for outdoor games and activities <br/>\nand a cookout, then spend the night in a big tent in our yard, then <br/>\na &quot;champagne&quot; breakfast (sparkling cider).  She made all the choices <br/>\nalong the way.  The decision to camp out helped determine how many <br/>\nkids could come because the tent could only sleep a certain number.  <br/>\nThe museum was free because my husband is a public safety officer <br/>\nthere so numbers weren&#39;t as important there.  Hauling kids from the <br/>\nmuseum to our home also limited the number to how many we could fit <br/>\nin our two cars since we didn&#39;t get any other parent/volunteers who <br/>\nwere willing to stick around for the whole party and drive kids back <br/>\nand forth.  The overnight campout helped her decide to limit it to <br/>\ngirls, her decision, because we only had one tent.  And then she had <br/>\nto choose who she was going to invite.  This was difficult, but she <br/>\nchose her own list, for her own reasons.  This made it much easier <br/>\nfor her to understand when others had parties to which she was not <br/>\ninvited.  She made sure that others who weren&#39;t invited to her party <br/>\nunderstood that she could only invite a limited number for this <br/>\nparty, that she couldn&#39;t invite everyone.  She also made a point of <br/>\ninviting others to do other things with us at other times.  <br/>\n<br/>\nFor another birthday, recently, at age 15, she also had to limit the <br/>\nnumber for a day of wonderful freebies she had collected with comps <br/>\nand passes.  The day included a trip to the museum to see a special <br/>\nOmniMax film (Dad got comp tickets for everyone), free passes to ice <br/>\nskate (she had earned these working at the ice rink), then a return <br/>\nto our house to make individual personal pan pizzas (I made the dough <br/>\nahead of time and provided the cake pans for each person&#39;s pizza, but <br/>\nshe organized all the topping ingredients).  At the house she also <br/>\nplanned to do henna tattoos and chalk art on the backyard blacktop, <br/>\nwith music for dancing.  This was a mixed group.  Again, the <br/>\nlimitations were who could fit in our two cars to go between the <br/>\nmuseum and the ice rink and our house, and who she wanted to have <br/>\nattending who&#39;d be willing to participate in these activities; who <br/>\nwould enjoy doing these things.  A fun time was had by all, but it <br/>\nwas a limited group.<br/>\n<br/>\nBack to my comment about damage that can be done in the home.  At one <br/>\nof my daughter&#39;s early teen parties she did invite a few more kids <br/>\nsince it was all at our house.  Our house is small, but she invited <br/>\nabout 15 this time, including two girls she didn&#39;t know very well.  <br/>\nThese two were large girls, who somehow ended up sitting on two of my <br/>\nantique wooden chairs, chairs that had long supported my oversize <br/>\npoundage without a problem, but for reasons unknown these two girls <br/>\nutterly destroyed these antiques and family heirlooms.  I mean they <br/>\nwere crushed, broken, shattered in multiple places.  One was a <br/>\nWindsor arm chair in cherry and the other was a bent oak captain&#39;s <br/>\narm chair.  Neither the girls nor their parents offered to pay for <br/>\nthe damage they caused, to help repair the chairs.  We didn&#39;t ask <br/>\nthem to, either.  They never even apologized.  I guess they were <br/>\nsurprised, too, and embarassed.  I was totally taken off guard, never <br/>\nexpecting anything like this.  <br/>\n<br/>\nAt the same party something happened to our six month old DVD player <br/>\nwhile the teens were attempting to watch a movie they had selected <br/>\nand it went kaput!  So that nice &quot;at home&quot; party ended up being a <br/>\nvery expensive party, especially on our limited income.  It was <br/>\nseveral years ago and we still haven&#39;t been able to repair those <br/>\nchairs or replace that DVD player.  Again my daughter learned some <br/>\nimportant lessons about these kinds of decisions.  So, yes, I feel <br/>\nthat parents should have a say.  Not as a power/control issue, but as <br/>\nthe ones who must live with the consequences, or haul kids around in <br/>\nour vehicles, or foot the bill for whatever the kids are doing. <br/>\n<br/>\nOn the other side of things my daughter experienced real exclusion <br/>\nfrom the local homeschool community when a few moms planned a <br/>\nhomeschool prom, unbeknownst to us.  We heard about this prom from <br/>\none of the girls who was planning to go and who innocently asked if <br/>\nmy daughter was going.  She said, no, she didn&#39;t know anything about <br/>\nit.  The girl told her a little about it.  I then posted something to <br/>\nmy e-list asking if anyone knew the details so everyone who might be <br/>\ninterested could know about this event.  I didn&#39;t get any clear <br/>\nresponse, but some interesting evasive answers.  <br/>\n<br/>\nThen one day at the ice rink (we spend a lot of time at the ice rink) <br/>\na mom showed up who doesn&#39;t usually show up there and she sat down <br/>\nand talked to me for quite a while.  Innocent enough, I thought, but <br/>\nsort of a strange conversation.  Next thing I know I get an email <br/>\nfrom this mom informing me that &quot;they&quot; had decided that my daughter <br/>\ncould not attend the homeschool prom.  Very interesting, because the <br/>\nsubject of the homeschool prom never came up in our conversation at <br/>\nthe ice rink.  Truth is that my daughter already had plans to attend <br/>\nthree other formal dances at local high schools and could not have <br/>\nattended another prom even if she had wanted to do so.  But no one <br/>\nhad bothered to ask.  Some moms just assumed that because I was <br/>\ninquiring about the event that my daughter wanted to attend.  <br/>\n<br/>\nThe bottom line on this was that even though my daughter could not <br/>\nhave attended, was attending another prom on the same night as this <br/>\nhomeschool prom, she was being intentionally and pointedly shunned <br/>\nand excluded by fellow homeschoolers.  Why?  Never could get an <br/>\nanswer on that.  The folks doing the shunning chose to spread lies <br/>\ninstead of answering my e-list query.  Word got back to me, in the <br/>\nform of an email, that I had already been told why by one of the <br/>\norganizing moms in a phone call I had supposedly made to her in which <br/>\nshe told me that my daughter was not welcome and why, and in which <br/>\nshe alleged that I had argued with her and she had ultimately hung <br/>\nup.  Wow!  If it had been in a court of law I would have demanded <br/>\nphone records for her to prove those allegations, because there was <br/>\nno phone call.  None of this ever happened.  But I learned to what <br/>\nextent some folks will go to cover their exclusionary behavior.<br/>\n<br/>\nSo, why, you might ask, were these moms so determined to keep my <br/>\ndaughter away from this prom?  My daughter is multi-racial.  Her <br/>\nfather is black and I am  Cherokee/French/Welsh/Irish.  She is a <br/>\nbeautiful young woman, poised and well-behaved, a dedicated <br/>\ncompetitive figure skater with 8 years of skating behind her, aiming <br/>\nfor the U. S. Nationals.  I really don&#39;t know why she would be the <br/>\nonly homeschooler in our large metro area who was definitively <br/>\nshunned and excluded from this homeschool prom, but I can guess, and <br/>\nany of my guesses are not nice.  But then racism and bigotry have <br/>\nbeen around for a long time.  Turns out that pretty girls from mixed <br/>\nracial backgrounds are not so welcome when some moms start looking at <br/>\nthese girls as potential lifemates for their sons.  Obviously these <br/>\nmoms haven&#39;t done much work in genetics or biology, let alone <br/>\nmorality.  But whatever the cause, my daughter cried a little at <br/>\nbeing so directly excluded, but went to her three proms and had a <br/>\ngreat time. <br/>\n<br/>\nSo, yes, exclusion hurts, but I have never felt &quot;left out&quot; when it <br/>\nwas a birthday party.  I figure that based on our own experiences <br/>\nthis type of party has so many built in limitations that it isn&#39;t a <br/>\nbig deal.  Then there are other bigger issues out there, kinds of <br/>\nexclusion involving race and economics that really do hurt and for <br/>\nwhich we take the time to work through how we can best handle  <br/>\ninterfaces with other people&#39;s self-imposed limitations.<br/>\n<br/>\nNorma </span></blockquote></div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] The party is over","postDate":"1039379358","msgId":11187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMTkxNUNFLjEwNDVBJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PFNwcmluZ21haWwuMDk5NC4xMDM5MzczMDg5LjAuNzM3NTkxMDBAd2VibWFpbC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":11185,"nextInTopic":11191,"prevInTime":11186,"nextInTime":11188,"topicId":11185,"numMessagesInTopic":0,"msgSnippet":"... Odd Girl Out by Rachel Simmons http://www.amazon.com/exec/obidos/tg/detail/-/0151006040/qid=1039379159/sr=2 -1/104-7758784-1344702?v=glance&s=books Joyce","messageBody":"<div id=\"ygrps-yiv-1037251613\">on 12/8/02 1:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Has anyone read about the forms of girl aggression? My hubby told me about a<br/>\n&gt; book which addresses this issue and it turns out that girls/women are<br/>\n&gt; aggressive by excluding. If you know the author, let my know.<br/>\n<br/>\n </span></blockquote>Odd Girl Out by Rachel Simmons<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/tg/detail/-/0151006040/qid=1039379159/sr=2\">http://www.amazon.com/exec/obidos/tg/detail/-/0151006040/qid=1039379159/sr=2</a><br/>\n-1/104-7758784-1344702?v=glance&s=books<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"&lt;maryfhickman@...&gt;","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The party is over","postDate":"1039373089","msgId":11185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNwcmluZ21haWwuMDk5NC4xMDM5MzczMDg5LjAuNzM3NTkxMDBAd2VibWFpbC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":11187,"prevInTime":11184,"nextInTime":11186,"topicId":11185,"numMessagesInTopic":0,"msgSnippet":"Hello, We all made it through yesterday with little fuss. The fussing that started in the am, probably a result of my own fussing, ended. I shared a few tears","messageBody":"<div id=\"ygrps-yiv-2076114325\">Hello,<br/>\n<br/>\nWe all made it through yesterday with little fuss. The fussing that started in<br/>\nthe am, probably a result of my own fussing, ended. I shared a few tears with<br/>\nTim. Ashley had a blast. Turns out about 2 other non-family families hung out<br/>\nwith the party too, with siblings. I&#39;ll try not to take it personally. My<br/>\nlittle ones were bummed, but not so terribly this time. Maturity, I guess.<br/>\nHardened from the previous years. What gets me so much is the Birthday Girl<br/>\nreally doesn&#39;t care one way or the other if we come. Her mom is the one who<br/>\ndecides who comes, controlling the situation. This is why I call it a game.<br/>\nIt&#39;s a game of exclusion and its played often here from this family.Riley is<br/>\nthe one who gets excluded the most. You can come inside today, but he can<br/>\nnot... So really it is no surprise that every year someone does not get to<br/>\ncome. Power, plane and simple.<br/>\n<br/>\nHas anyone read about the forms of girl aggression? My hubby told me about a<br/>\nbook which addresses this issue and it turns out that girls/women are<br/>\naggressive by excluding. If you know the author, let my know.<br/>\n<br/>\nMary H.<br/>\n<br/>\nHappily on the other side of this party.</div>","specialLinks":[]}],"prevTopicId":11170,"nextTopicId":6305}}