{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":120206043,"authorName":"averyschmidt","from":"&quot;averyschmidt&quot; &lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: police behavior","postDate":"1133201979","msgId":110279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtZmhucitmM3VtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDN0MyNUE1NkE0Mzg3Ni0xN0MtOTY1M0BtYmxrbi1tMTkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":110276,"nextInTopic":0,"prevInTime":110278,"nextInTime":110280,"topicId":110275,"numMessagesInTopic":0,"msgSnippet":"... yelling at him and refusing to let him leave to come to me.  When I walked up to the partially open bathroom door, the officer was telling my 7 year old","messageBody":"<div id=\"ygrps-yiv-1153658299\"><blockquote><span title=\"ireply\">&gt; The police officer LITERALLY had him cornered in the bathroom, <br/>\n </span></blockquote>yelling at him and refusing to let him leave to come to me.  When I <br/>\nwalked up to the partially open bathroom door, the officer was <br/>\ntelling my 7 year old son that he had the authority to take him away <br/>\n(from the family) and he would never see us again and that my son <br/>\nshould never dial 911 again without permission!!!  <br/>\n<br/>\nI had a completely different experience with this when my oldest son <br/>\nwas little.  One night just after dark a couple of police officers <br/>\nknocked on the door.  When I answered it they asked if everything <br/>\nwas okay, because someone there had dialed 911.  For a split second <br/>\nI was alarmed, imagining a stranger in our home (I was home alone <br/>\nwith my 4 and 2yo sons), then I remembered the recent conversation <br/>\nwith my 4yo about emergencies and 911.  I looked over my shoulder, <br/>\nand sure enough there was the top of a blond head guiltily hiding <br/>\nbehind a chair.  The police officers were obviously trying not to <br/>\nlaugh while I coaxed my son out from behind the chair.  They gave <br/>\nhim a gentle &quot;now you know it really does work, but don&#39;t ever do it <br/>\nagain if it&#39;s not a true emergency, okay?&quot; sort of lecture.  They <br/>\ncouldn&#39;t have been nicer.   And despite their niceness my son never <br/>\ndid it again.<br/>\n<br/>\nPatti</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: police behavior","postDate":"1133201020","msgId":110276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LjUyMzFlMjU5LjMwYmNhMDdjQGFvbC5jb20+"},"prevInTopic":110275,"nextInTopic":110279,"prevInTime":110275,"nextInTime":110277,"topicId":110275,"numMessagesInTopic":0,"msgSnippet":"... Those aren t necessarily two extremes, and terrify and intimidate is an exaggeration. I certainly hope my nephew never kills anyone on this list in a","messageBody":"<div id=\"ygrps-yiv-2129996178\">In a message dated 11/28/05 10:57:09 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leobellalace@...\">leobellalace@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; This particular statement I strongly disagree with.  My reasons?  Police <br/>\n&gt; officers are directed &quot;to protect and serve,&quot; not terrify and intimidate.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Those aren&#39;t necessarily two extremes, and &quot;terrify and intimidate&quot; is an <br/>\nexaggeration.<br/>\n<br/>\nI certainly hope my nephew never kills anyone on this list in a drunk driving <br/>\nincident.<br/>\nI hope he doesn&#39;t kill anyone, but if the slight intimidation he &quot;suffered&quot; <br/>\nprevents an accident or ANY drinking in the future, good; then the policeman&#39;s <br/>\nactions protected and served other drivers and the safety of children Joshua <br/>\ndoesn&#39;t even know who just happen to be in other cars where he might be driving <br/>\nirresponsibly *again.*<br/>\n<br/>\n-=-When my oldest son was 7, he attended a session where the police officer <br/>\nvisits and explains about &quot;911 Emergency&quot; and such.  That night we went out to <br/>\neat and on the way to the bathroom, he decided to test it. -=-<br/>\n<br/>\nIf it wasn&#39;t clear from the presentation that it&#39;s a crime to make a false <br/>\ncall, and that it&#39;s not to play with, maybe you should have made that point.   <br/>\nSeriously.<br/>\n<br/>\n-=-When I walked up to the partially open bathroom door, the officer was <br/>\ntelling my 7 year old son that he had the authority to take him away (from the <br/>\nfamily) and he would never see us again and that my son should never dial 911 <br/>\nagain without permission!!! -=-<br/>\n<br/>\nThat sounds very extreme, but it really is a crime, and you&#39;ve admitted that <br/>\nyour son lied to you and the policeman both. <br/>\n<br/>\n-=-he did admit it to me and we discussed how now he knew it worked, that <br/>\ntesting it again would probably be a bad idea, etc.,-=-<br/>\n<br/>\nI hope you knew and told him it&#39;s worse than &quot;a bad idea,&quot; and not just <br/>\nprobably.<br/>\n<br/>\n-=- I sometimes wonder now whether he would call 911 even in an emergency.  <br/>\nNow how did that (first) officer&#39;s behavior help my son???-=-<br/>\n<br/>\nIt&#39;s not their job to help as much as it&#39;s parents&#39; jobs to help children see <br/>\nthe world clearly.<br/>\n<br/>\nMy brother in law wasn&#39;t doing a very good job of persuading or inspiring or <br/>\ninforming Joshua, and my sister moved to another part of the state, so I&#39;m <br/>\nfranky glad at least a cop recognized him and knew who he was.   And if it wasn&#39;t <br/>\na GOOD recognition, that&#39;s Joshua&#39;s fault entirely.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163488104,"authorName":"leobellalace@netscape.net","from":"leobellalace@...","profile":"leobellalace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: police behavior","postDate":"1133199792","msgId":110275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0MyNUE1NkE0Mzg3Ni0xN0MtOTY1M0BtYmxrbi1tMTkuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDExMzMwNDI5MjkuNzQyMy45MDgzOS5tMzVAeWFob29ncm91cHMuY29tPg==","referencesHeader":"PDExMzMwNDI5MjkuNzQyMy45MDgzOS5tMzVAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":110276,"prevInTime":110274,"nextInTime":110276,"topicId":110275,"numMessagesInTopic":0,"msgSnippet":"... contributions to the accident is probably a necessary and important thing to do. This particular statement I strongly disagree with.  My reasons?","messageBody":"<div id=\"ygrps-yiv-1510972681\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I think a policeman scaring a kid and blaming a kid for his <br/>\n </span></blockquote>contributions to the accident is probably a necessary and important <br/>\nthing to do.&gt;&gt;&gt;<br/>\n <br/>\nThis particular statement I strongly disagree with.  My reasons?  Police officers are directed &quot;to protect and serve,&quot; not terrify and intimidate.  I personally know several people (myself included) who have had such poor experiences with police officers that many of us wouldn&#39;t call the police for anything short of having shot a robber.  <br/>\n <br/>\nVery Important!!!  ---  I am not defending the problem the police were responding to, only the manner in which it was handled.  <br/>\n <br/>\nThe incident that pretty much broke the camel&#39;s back for me???  ---  When my oldest son was 7, he attended a session where the police officer visits and explains about &quot;911 Emergency&quot; and such.  That night we went out to eat and on the way to the bathroom, he decided to test it.  When the operator answered, he panicked and hung up.  Of course, the operator called back to verify and sent an officer past the restaurant to check.  All this happened within about 2 minutes.  <br/>\n <br/>\nAfter my son had been gone about 3 minutes, I went to check on him (he wants to be independant, so I usually stand at the end of the hall and let him go the rest of the way himself, but this time I stopped around the corner and didn&#39;t see him use the phone or see the officer go into the bathroom.  Guess where I *won&#39;t* be standing in the future!!!)  <br/>\n <br/>\nThe police officer LITERALLY had him cornered in the bathroom, yelling at him and refusing to let him leave to come to me.  When I walked up to the partially open bathroom door, the officer was telling my 7 year old son that he had the authority to take him away (from the family) and he would never see us again and that my son should never dial 911 again without permission!!!  <br/>\n <br/>\nI pretty much infuriated the officer by ignoring him and asking my son what happened, then walking into the men&#39;s bathroom and getting my son, but in the end things worked out fine.  Since no one actually saw my son call, and he denied it, they couldn&#39;t really do much so I took my son back to the table and we finished eating.  <br/>\n <br/>\nOn the way out of the restaurant, he did admit it to me and we discussed how now he knew it worked, that testing it again would probably be a bad idea, etc., and I explained the concept of &quot;X&quot; number of officers and &quot;Y&quot; number of 911 calls and we went over the possible consequences of a real emergency not being responded to in time if lots of &quot;test&quot; calls were made.<br/>\n <br/>\nHe has never done this again and I tried to explain that maybe the policeman was just having a bad day and was grouchy, but when we went past an officer in the mall, he moved to the other side of me, got a death grip on my arm and wouldn&#39;t make eye contact with the officer at all.  I sometimes wonder now whether he would call 911 even in an emergency.  Now how did that (first) officer&#39;s behavior help my son???<br/>\n___________________________________________________<br/>\nTry the New Netscape Mail Today!<br/>\nVirtually Spam-Free | More Storage | Import Your Contact List<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.netscape.com\">http://mail.netscape.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":110272,"nextTopicId":110285}}