{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Eating just to eat vs dining (was: On a roll--Wh...","postDate":"1043678863","msgId":56595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NS44Y2ZiMWJkLjJiNjZhMDhmQGFvbC5jb20+"},"prevInTopic":56406,"nextInTopic":0,"prevInTime":56594,"nextInTime":56596,"topicId":56403,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/2003 9:21:39 AM Eastern Standard Time, ... That sounds wonderful!  But even though it IS the food it really ISN T either.  It s the","messageBody":"<div id=\"ygrps-yiv-132951358\">In a message dated 1/26/2003 9:21:39 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So we changed our Thanksgiving.  Now we do something special.  We go on a <br/>\n&gt; short vacation and spend fun time together without the food.  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>That sounds wonderful!  But even though it IS the food it really ISN&#39;T <br/>\neither.  It&#39;s the coming together as a family, even though we aren&#39;t really <br/>\napart.  Two of my children are in college, one is HS and is on an all star <br/>\ncheer team which practices three nights a week until nine, so everyone is <br/>\nbusy.  I know everyone here is busy too.  But to them it&#39;s the ritual I think <br/>\nmore than the actual food.  It&#39;s just an extra that I try to make it special <br/>\nby preparing favorites of theirs and to them it&#39;s a way of my showing I care <br/>\nenough about them to go to the effort of making a meal.  I wouldn&#39;t expect <br/>\nthat younger children would understand this or even think of it as anything <br/>\nother than sustinance, but as they get older it becomes more to them.<br/>\n<br/>\nI have lupus and some days it&#39;s a struggle to cook a meal for them so <br/>\nsomedays it&#39;s leftovers, and somedays I do nothing but make the meal for them <br/>\nto enjoy.  Sounds crazy to some I would expect but my greatest joy in life is <br/>\nmy family.  Nothing makes me happier than all of them coming together <br/>\ntalking, laughing, sharing their experiences, arguing and loving each other.<br/>\n<br/>\nLast Mother&#39;s Day, my oldest son shows up, the other kids are already here, <br/>\nhe has a friend with him and one of his cousins.  I am in the kitchen rushing <br/>\naround trying to finish the ham and get dinner on the table.  The friend <br/>\ncomments that &quot;his dad is taking his Mom OUT TO DINNER for Mother&#39;s Day&quot; <br/>\nwhile I was sweating in the kitchen.  Matthew then asked him if that was so <br/>\nspecial for his MOTHER why was HE HERE!  He stammered and stuttered and <br/>\nMatthew simply told him, to MY mother, WE are her gifts and she asks nothing <br/>\nmore than we all be here together.  I was proud and excited when he gave me a <br/>\nring box and inside was a mother&#39;s ring and each of the children&#39;s names <br/>\nengraved around their birthstone.<br/>\n<br/>\nI know for those who can barely find time to feed their families this does <br/>\nnot make sense.  But if you can understand that it doesn&#39;t matter if it&#39;s <br/>\npigs in a blanket or prime rib, it&#39;s the EVENT that dinner is more than the <br/>\ntype or amount of food.  This becomes more important as children find their <br/>\nway in the world and have jobs and other things going on.  I think sometimes <br/>\nif our children are home with us every day all day, we might sometimes take <br/>\nthat time a little for granted.<br/>\n<br/>\nI know that I did before but try to make an effort not to anymore.<br/>\n<br/>\nI probably didn&#39;t help anyone understand it better but it isn&#39;t about actual <br/>\nfood at all.  <br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Eating just to eat vs dining (was: On a roll--Wh...","postDate":"1043590815","msgId":56406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NS4xYTQ0YTgwNi4yYjY1NDg5ZkBhb2wuY29tPg=="},"prevInTopic":56403,"nextInTopic":56595,"prevInTime":56405,"nextInTime":56407,"topicId":56403,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/03 8:52:06 AM Eastern Standard Time, ... You would feel even worse for us then.  We have no sit down, large Thanksgiving meal.  Have","messageBody":"<div id=\"ygrps-yiv-1011111281\">In a message dated 1/26/03 8:52:06 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rubyprincesstsg@...\">rubyprincesstsg@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Many friends of my older kids are amazed the first time they come to Sunday <br/>\n&gt; dinner, the act as if it&#39;s Thanksgiving and in fact some even mention &quot;this <br/>\n&gt; <br/>\n&gt; is like Thanksgiving at our house&quot;.  I think that&#39;s sad that only a few <br/>\n&gt; times <br/>\n&gt; a year do they gather for an abundant meal full of laughter and people they <br/>\n&gt; <br/>\n&gt; love.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>You would feel even worse for us then.  We have no sit down, large <br/>\nThanksgiving meal.  Have tried it a couple of times.  My boys just aren&#39;t <br/>\nimpressed because food for them is no big deal.  They eat when they are <br/>\nhungry and stop when they are full.  <br/>\n<br/>\nMade a huge Thanksgiving meal, vegetarian here, they stopped playing the play <br/>\nstation for a minute came to the table had a spoon of mashed potato and went <br/>\nback to play some more.  I felt like I had failed but soon realized that the <br/>\nchildren were acting exactly the way I have always wanted them to about food. <br/>\n They weren&#39;t eating to please me or anything else.  They weren&#39;t hungry.  <br/>\n<br/>\nSo we changed our Thanksgiving.  Now we do something special.  We go on a <br/>\nshort vacation and spend fun time together without the food.  <br/>\n<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Eating just to eat vs dining (was: On a roll--Wh...","postDate":"1043589092","msgId":56403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzLjJmNmI2NGZkLjJiNjU0MWU0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":56406,"prevInTime":56402,"nextInTime":56404,"topicId":56403,"numMessagesInTopic":0,"msgSnippet":"This thread intrigues me very much.  While my kids are older than most on this list; dd 22, ds 21, ds 18, dd 14 (and the older two have their own houses both","messageBody":"<div id=\"ygrps-yiv-783839757\">This thread intrigues me very much.  While my kids are &quot;older&quot; than most on <br/>\nthis list; dd 22, ds 21, ds 18, dd 14 (and the older two have their own <br/>\nhouses both within ten miles) the more often than not come to dinner five <br/>\nnights a week.  ALWAYS on Sunday we eat together as a family.  Not always all <br/>\nat the dining room table, sometimes on a table cloth in the living room, but <br/>\nalways Sunday dinner is the ONE time in the week even the older &quot;children&quot; <br/>\nare here and we are a family under the same roof once again.<br/>\n<br/>\nI prepare all our meals at home from scratch, it&#39;s important to me because <br/>\nit&#39;s important to them.  They all have their &quot;favorites&quot; and when they ask, I <br/>\nmake it.  To me cooking for my family is blessing them, the older ones coming <br/>\nhome for dinner blesses me, makes me know they WANT to be with me and their <br/>\nfamily (if you have/had teenagers, you will understand this).<br/>\n<br/>\nWe spend a HUGE amount of our money for food, there are six of us in our <br/>\nfamily and we ALWAYS have one to ten EXTRAS for meals.  I rarely have any <br/>\nhelp preparing in the meal but I always have help cleaning up.<br/>\n<br/>\nMany friends of my older kids are amazed the first time they come to Sunday <br/>\ndinner, the act as if it&#39;s Thanksgiving and in fact some even mention &quot;this <br/>\nis like Thanksgiving at our house&quot;.  I think that&#39;s sad that only a few times <br/>\na year do they gather for an abundant meal full of laughter and people they <br/>\nlove.<br/>\n<br/>\nA few years ago when my teenagers were being especially teenagerly, my New <br/>\nYears Resolution was to try to treat them with the grace and hospitality that <br/>\nI would a guest in my home.  Only in the sense that I would make a conscious <br/>\neffort each week to make their favorite dishes, their favorite snacks/treats. <br/>\n Handle subjects that upset me in a way I would with someone else, delicately <br/>\nand carefully, not just full force MOTHER IN YOUR FACE kinda of thing.<br/>\n<br/>\nThat just naturally spilled over into the big meals on Sunday and a wonderful <br/>\nnew family tradition.  It is a wonderful feeling to know that your grown <br/>\nchildren could go any place on earth and live and prosper yet they CHOOSE to <br/>\nbe near home.<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":56154,"nextTopicId":56600}}