{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sandra&#39;s videos now on Huffington Post!!","postDate":"1243450869","msgId":45580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEOTJCQUM5LTAwQTUtNDkyOS04NEU3LTc0OTU1NzkyRDJENEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGd2OHExYyt0dThxQGVHcm91cHMuY29tPg==","referencesHeader":"PGd2OHExYyt0dThxQGVHcm91cHMuY29tPg=="},"prevInTopic":45492,"nextInTopic":0,"prevInTime":45579,"nextInTime":45581,"topicId":45458,"numMessagesInTopic":0,"msgSnippet":"I m catching up on posts (nowhere near through them all ) after the Life is Good conference, but I checked out Holly s vid.  In addition to her presence and","messageBody":"<div id=\"ygrps-yiv-10692664\">I&#39;m catching up on posts (nowhere near through them all &lt;g&gt;) after the  <br/>\nLife is Good conference, but I checked out Holly&#39;s vid.  In addition  <br/>\nto her presence and sparkle, I noticed her speaking cadence is very  <br/>\nmuch like yours, Sandra. You can tell she&#39;s your daughter. It&#39;s sweet.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 23, 2009, at 5:26 AM, carenkh wrote:<br/>\n<br/>\n&gt; Holly&#39;s video, and the 2 of Sandra, are now up on, of all places,  <br/>\n&gt; the Huffington Post.<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.huffingtonpost.com/lee-stranahan/who-needs-school-intervie_b_206714.html\">http://www.huffingtonpost.com/lee-stranahan/who-needs-school-intervie_b_206714.html</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; or if that doesn&#39;t work  <a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/o54zx5\">http://tinyurl.com/o54zx5</a><br/>\n&gt;<br/>\n&gt; What a surprise to see that this morning!<br/>\n&gt;<br/>\n&gt; Caren<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":336246301,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sandra&#39;s videos now on Huffington Post!!","postDate":"1243081580","msgId":45492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2OHExYyt0dThxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3OURCOEIzLTcxOTQtNEMwOC1BM0I2LTE0RkIyOTI2NjRDN0BTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":45465,"nextInTopic":45580,"prevInTime":45491,"nextInTime":45493,"topicId":45458,"numMessagesInTopic":0,"msgSnippet":"Holly s video, and the 2 of Sandra, are now up on, of all places, the Huffington Post. ","messageBody":"<div id=\"ygrps-yiv-1527387063\">Holly&#39;s video, and the 2 of Sandra, are now up on, of all places, the Huffington Post.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.huffingtonpost.com/lee-stranahan/who-needs-school-intervie_b_206714.html\">http://www.huffingtonpost.com/lee-stranahan/who-needs-school-intervie_b_206714.html</a><br/>\n<br/>\n<br/>\nor if that doesn&#39;t work  <a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/o54zx5\">http://tinyurl.com/o54zx5</a><br/>\n<br/>\nWhat a surprise to see that this morning!<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"College (was Short video of Holly on YouTube)","postDate":"1243019041","msgId":45465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMTZGNzIxLjkwMjA1MDNAbWFjLmNvbT4=","inReplyToHeader":"PDY3OURCOEIzLTcxOTQtNEMwOC1BM0I2LTE0RkIyOTI2NjRDN0BTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDY3OURCOEIzLTcxOTQtNEMwOC1BM0I2LTE0RkIyOTI2NjRDN0BTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":45458,"nextInTopic":45492,"prevInTime":45464,"nextInTime":45466,"topicId":45458,"numMessagesInTopic":0,"msgSnippet":"... Even if it was free (and the community colleges here are darn cheap), the real cost would be what is given up by putting their time and energy into it.","messageBody":"<div id=\"ygrps-yiv-1799340811\">On 5/22/2009 8:46 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;   If it were a free experience that might be very valid,<br/>\n&gt; but many kids are using college as they only way they know of to<br/>\n&gt; escape the bonds of their parents&#39; homes, and the use it as a go-crazy<br/>\n&gt; place and time.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Even if it was free (and the community colleges here are darn cheap), <br/>\nthe real cost would be what is given up by putting their time and energy <br/>\ninto it. These unschooled kids take their own lives seriously and <br/>\nhaven&#39;t been brainwashed into thinking that nothing is more important <br/>\nthan school. That doesn&#39;t stop when they are young adults - they don&#39;t <br/>\nsee college as the entire point of their lives, like so many kids right <br/>\nout of high school do.<br/>\n<br/>\nRoya liked college a lot - she got into it early and got involved in <br/>\ncampus activities - that suited her really well. She was in a small <br/>\nvocal ensemble, involved in the ceramics lab, on the speech and debate <br/>\nteam, and so on. Then, when she transferred to a 4-year college, she <br/>\nmajored in &quot;Recreation and Leisure Studies&quot; and took classes in things <br/>\nlike, &quot;The Universality of Play&quot; and the attitude of all her professors <br/>\nwas that the best learning happens in what people think of as <br/>\nrecreational activities. All perfect for her.<br/>\n<br/>\nRoxana is an intellectual and academic type of person - she LOVES it. <br/>\nShe takes history and literature and anthropology classes for the fun of <br/>\nit - she&#39;s a drama major - those classes are all &#39;extra&#39;. If she doesn&#39;t <br/>\nmake it as a musical theater performer, she&#39;ll be an academic - probably <br/>\nget a PhD. She loves college. (Doesn&#39;t always love the idiotic way <br/>\nthings are run, the sadistic or incompetent teachers, etc, but the <br/>\noverall experience is what she loves - the academic way of life is <br/>\nperfect for her.<br/>\n<br/>\nRosie didn&#39;t think she&#39;d want to go to college - figured she&#39;d do <br/>\nsomething else like run her own karate studio, eventually. She&#39;s a very <br/>\nphysical person - plays soccer, has a black belt and teaches martial <br/>\narts, dances, etc. She&#39;s 18. But she&#39;s been taking musical theater and <br/>\nsome other fun classes at the community college and finally was able to <br/>\nget into an American Sign Language class - and she&#39;s super good at it <br/>\nand loves it. So then she investigated how to pursue interpreting as a <br/>\ncareer and discovered a 4-year university near us is the top one in the <br/>\nwest for Deaf Studies. Just yesterday she met with an adviser from that <br/>\nuniversity and she&#39;s planning to go there in a couple of years - she&#39;s <br/>\nALL excited. It is an awesome program and she&#39;d be living on campus with <br/>\nDeaf roommates and getting lots of interpreting experience. So - now <br/>\nshe&#39;s got that goal and has figured out everything she needs to do to <br/>\nget there.<br/>\n<br/>\nHowever, an interesting thing came up as she was planning her next <br/>\ncouple of years. Turns out that all the interpreting courses are offered <br/>\nonly in the evenings. But she plays soccer two nights a week and teaches <br/>\nkarate two nights a week and does not want to give those up. She decided <br/>\nshe could spread out her plans to take a little longer to get to the <br/>\nuniversity - take fewer classes this year and stick with her martial <br/>\narts and soccer for one more year. She&#39;s not in a hurry. The adviser <br/>\nfrom the school was ALL about how she could get there and get through <br/>\nthe program as quickly as possible - Rosie was having trouble figuring <br/>\nout what the hurry was. So the adviser gave her  a plan in which she <br/>\ncould start going there in fall 2010 (not this fall, but the next) and <br/>\nRosie was thinking more of taking her time and getting there in 2012. <br/>\nThe adviser seemed to think she should just completely and totally <br/>\n&quot;focus on school&quot; as if nothing else in her life mattered. Rosie came <br/>\nout of the meeting with the adviser and refigured all the course plans <br/>\nso that she could fit in the other things that are important to her <br/>\n(including her family life and her boyfriend and social activities like <br/>\nregular game playing).<br/>\n<br/>\nSo - I&#39;ve spent my kids lifetimes saying, &quot;College can be cool, but <br/>\nbetter to only go if you really want to.&quot; I&#39;ve often, very very often, <br/>\ntalked about how awful it is  for the students who are there because <br/>\ntheir parents say they can only live at home if they stay in school. <br/>\nI&#39;ve often talked about how awful it is for those kids who drift into <br/>\ncollege without having a clue why they are there - just not knowing what <br/>\nelse to do with themselves. I&#39;ve talked about how they are picking <br/>\ncollege majors based on liking the teacher of a particular class without <br/>\nany sense of wanting to pursue a personal passion. I&#39;ve been negative, <br/>\nmore often than not, about college because the vast majority of the <br/>\nstudents I have really should not, imo, be there. And I have a family <br/>\nwith a history of going to college much later in life - not right out of <br/>\nhigh school - and I&#39;ve talked about that proudly and happily with my kids.<br/>\n<br/>\nAnd yet, I have one graduated and thinking about grad school, and two in <br/>\nthe midst of going to college. The difference is they are very very <br/>\nclear in their minds that they are choosing it from among a lot of <br/>\noptions and they very much know why they are there and they are <br/>\nrealistic about its value - they definitely don&#39;t see &quot;getting a degree&quot; <br/>\nas enough of a goal to make it worth it to be there - they are there for <br/>\nthe learning and the experience itself.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Short video of Holly on YouTube","postDate":"1243007202","msgId":45458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3OURCOEIzLTcxOTQtNEMwOC1BM0I2LTE0RkIyOTI2NjRDN0BTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":45465,"prevInTime":45457,"nextInTime":45459,"topicId":45458,"numMessagesInTopic":0,"msgSnippet":"Lee Stranahan who interviewed me and put up two videos on YouTube (two so far) also talked to Holly that day (and to both of us the week after, but that might","messageBody":"<div id=\"ygrps-yiv-1035772949\">Lee Stranahan who interviewed me and put up two videos on YouTube (two  <br/>\nso far) also talked to Holly that day (and to both of us the week  <br/>\nafter, but that might be for a different project).<br/>\n<br/>\nTwo of the comments there are friendly and positive but they highlight  <br/>\nthe differences between what we&#39;re going and what it looks like we&#39;re  <br/>\ndoing.   If I commented to these people out in public, it would seem  <br/>\nlike a quibble over nothing, but here on this list I think people  <br/>\nbegin to see the differences, so I&#39;ll comment here!<br/>\n<br/>\n<br/>\n-=-You can always go to college later. Take some time to travel. Your  <br/>\nmother taught you to make the world your classroom, take advantage of  <br/>\nthat. Go back packing in Europe or South America.-=-<br/>\n<br/>\nHolly&#39;s been to Europe.  She&#39;s choosing among cool options right now.   <br/>\nShe turned down a request to go to England and Wales with me.  Her  <br/>\nlife is full and rich.<br/>\n<br/>\nAlso, I didn&#39;t &quot;teach her to make the world her classroom.&quot;   But  <br/>\nstill, the comment was intended to be positive and encouraging.<br/>\n<br/>\n<br/>\n-=-Home schooling is only good when you have good parents. Reg school  <br/>\nis only good when you have good schools. To each his own but you  <br/>\nshould go to college if you can. If nothing more than the experience  <br/>\nit is well worth your time.-=-<br/>\n<br/>\nEven the best of schools have many unhappy kids in them.   And that  <br/>\nlast line on &quot;the experience is well worth your time&quot; about college is  <br/>\ninteresting.   If it were a free experience that might be very valid,  <br/>\nbut many kids are using college as they only way they know of to  <br/>\nescape the bonds of their parents&#39; homes, and the use it as a go-crazy  <br/>\nplace and time.<br/>\n<br/>\nI wouldn&#39;t be surprised if Holly ended up in college at some point  <br/>\nbecause of her interest in memory and dreams and cognition.   But I  <br/>\nwoudln&#39;t be surprised if she didn&#39;t, either.<br/>\n<br/>\n<br/>\n<br/>\nAnyway, the video is here.  It&#39;s just two minutes and forty seconds:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=8pLqYn1OYdU\">http://www.youtube.com/watch?v=8pLqYn1OYdU</a><br/>\n<br/>\nSandra</div>","specialLinks":[{"url":"http://www.youtube.com/embed/8pLqYn1OYdU?wmode=opaque","type":"VIDEO"}]}],"prevTopicId":45549,"nextTopicId":45586}}