{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":2448334,"authorName":"shantinik","from":"&quot;shantinik&quot; &lt;shantinik@...&gt;","profile":"shantinik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Happy BND","postDate":"1038543993","msgId":50828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFzNnE5cCtldXRvQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":50827,"nextInTime":50829,"topicId":50828,"numMessagesInTopic":0,"msgSnippet":"November is a good month for homeschoolers to learn how to be frugal consumers. Of course, the shopping lessons, at least in our family, occur year round, but","messageBody":"<div id=\"ygrps-yiv-753932528\">November is a good month for homeschoolers to learn how to be frugal<br/>\nconsumers. Of course, the shopping lessons, at least in our family,<br/>\noccur year round, but November has a holiday specifically devoted to<br/>\nthis purpose, so we try to take advantage.<br/>\n<br/>\nThere is neither a domesticated fowl nor a funny-hatted man with<br/>\nsilver buckles on his shoes associated with this holiday.  It is not<br/>\nThanksgiving.  In fact, it is a holiday without a name.  I write of<br/>\ncourse of the day after Thanksgiving<br/>\n<br/>\nOn the evening of Thanksgiving Day, after the turkey has hit the soup,<br/>\nwe gather up all the hundreds of pages of ads for the &quot;After<br/>\nThanksgiving Day Sale&quot;. Now in our homeschooling family, as Quakers,<br/>\nwe don&#39;t celebrate a traditional gift-giving Christmas, so some of the<br/>\nheat is off. But the sales are good, I&#39;m told (though I&#39;ve often<br/>\nsuspected that the stores just mark up all the prices on their winter<br/>\ngoods and then take 40% off so that the prices are pretty much the<br/>\nsame.) We then decide what we &#39;need&#39; or &#39;want&#39;. There&#39;s usually one or<br/>\nat most two items to be found in each of six or seven different<br/>\nstores, the stores of course being scattered in various and sundry<br/>\nparts of the city.<br/>\n<br/>\nMy daughters and I arise at 6 a.m. - this is a special homeschooling<br/>\nouting!  I having pressed upon them how important it is to arrive<br/>\nearly, and having convinced them of the compelling superiority of each<br/>\nparticular item in the store that is our destination. We arrive at the<br/>\nfirst store a little before 7. Stand it line. Purchase item. Then on<br/>\nto the next store, and the next. We are relentlessly efficient..<br/>\nSometimes we have to choose among colors, or designs, or whatnot. But<br/>\nno tomfoolery - we know how to do this. We stick to the list. We don&#39;t<br/>\nbrowse. We don&#39;t look at socks in the store where we buy jackets, or<br/>\nties where we get bedspreads. We don&#39;t get distracted by trinkets,<br/>\nsale signs, Santa Claus, or handbills. We refuse to be distracted. By<br/>\n11 a.m., we are home, like homeschooled big game hunters, having<br/>\nbagged our limit.<br/>\n<br/>\nBy 11:30, after surveying our cache over a second cup of coffee,<br/>\nnausea sets in. I have convinced myself, and started to convince most<br/>\nof the rest of the family (my wife, having conscientiously abstained,<br/>\ndoesn&#39;t need much convincing), that at least half the things we<br/>\npurchased we really don&#39;t need, or they aren&#39;t particularly nice, or<br/>\nthey aren&#39;t any better than the same item we saw for ten percent of<br/>\nthe price we paid in the local thrift shop, and I don&#39;t like sleeping<br/>\nunder a blanket made by exploited women in Bangladesh or watching my<br/>\nyounger daughter run around in athletic shoes fabricated in<br/>\nunventilated sweatshops in Indonesia (has anyone found a good<br/>\nalternative for these?) And so my holiday will turn into a weekend of<br/>\nreturns! How do I communicate all of my thoughts and feelings about<br/>\nthese issues to my two daughters as part of our homeschooling experience?<br/>\n<br/>\nThere is no question that I (like many Americans) suffer from a very<br/>\nparticular neurotic &#39;thought disorder&#39;, and I am now in recovery.<br/>\nTeaching our children to become knowledgeable consumers is important,<br/>\neven an essential part of our homeschooling efforts. But, to me,<br/>\nliberating my children by providing alternatives to America&#39;s religion<br/>\nof consumption (of which public education is a key component) and<br/>\nhelping them understand the non-material basis for a truly satisfying<br/>\nlife is central to my family&#39;s homeschooling efforts.<br/>\n<br/>\nAnd now I&#39;ve gotten some help. The day has been given an appropriate<br/>\nname - &quot;International Buy Nothing Day&quot;! Check it out at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://adbusters.org/campaigns/bnd/\">http://adbusters.org/campaigns/bnd/</a>  Started about five years ago by a<br/>\nCanadian magazine named Adbusters. BND, as it is now affectionately<br/>\nknown, was celebrated last year in more than 30 countries, including<br/>\nFrance, Japan, Panama, Israel, South Korea, Canada, Brazil, and the<br/>\nUnited States.  Billed as a &quot;global carnival of life in the face of<br/>\nconsumer conformity&quot;, BND has gone so far as to produce radio and<br/>\ntelevision spots to get their message across, though in most cases the<br/>\nspots have been rejected by network executives [&quot;Contrary to the<br/>\nfunction of advertising itself and against our ethics (sic),&quot; said<br/>\none)] only to make their appearance on the evening news.  On their<br/>\nwebsite, you can download &quot;Christmas Gift Exemption Vouchers&quot; to give<br/>\nto friends and family, templates for buttons and tee shirts, and a<br/>\nfull range of posters and press releases. A celebration is likely<br/>\ncoming to a town or city near you. Your rebellious (or just socially<br/>\nconscious) homeschooled teen or pre-teen will love it!<br/>\n<br/>\nNot quite ready for Buy Nothing Day? Well, then connect up with the<br/>\nCenter for a New American Dream&#39;s &quot;Kids and Commercialism Campaign&quot;.<br/>\nYou can find them online at www.newdream.org/campaign/kids/index.html.<br/>\n Download their excellent brochure, &quot;Tips for Parenting in a<br/>\nCommercial Culture.&quot;  There is a website for kids full of fun,<br/>\nnon-commercial play ideas, advice from responsible consumption gurus,<br/>\nessay contests, and links to dozens of groups who will keep you better<br/>\ninformed as you gird up your loins, take up your battle axe, and stand<br/>\nready to defend your homeschooling hearth and kin against the next<br/>\nadvertising onslaught.<br/>\n<br/>\nHolidays are an important part of our lives as homeschoolers. We can,<br/>\nif we choose, use our holidays to reconnect ourselves with friends,<br/>\nwith nature, and with our playful, creative sides, with our<br/>\nspirituality, and help rebuild communities that extend far beyond the<br/>\nconfines of the shopping mall parking lots. And, if we&#39;re really<br/>\nsmart, we can do that with our children every day. For me, that&#39;s what<br/>\nhomeschooling is all about.<br/>\n<br/>\nMake a poster with your kids emblazoned &quot;More Fun, Less Stuff!&quot; Try it<br/>\nout as a homeschooling family slogan (you could even write a family<br/>\njingle!), and hang it in a prominent place. Next time you feel the<br/>\nurge to shop coming on, look at the poster, and you&#39;ll know it&#39;s time<br/>\nto clean out the garage. &quot;Hey, this could spell the end of<br/>\ncivilization as we know it,&quot; says my friend Anthony (I think he was<br/>\nreferring to responsible consumerism, not to the new era of<br/>\nuncluttered garages across America.) <br/>\n<br/>\nWho said homeschooling is not a subversive idea??<br/>\n<br/>\n<br/>\nCopyright c David H. Albert</div>","specialLinks":[]}],"prevTopicId":50817,"nextTopicId":8066}}