{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]","postDate":"1052970821","msgId":69133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Yi4xZWFkOTRkNS4yYmY0Njk0NUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":69132,"nextInTime":69134,"topicId":69133,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/14/2003 9:26:52 PM Eastern Standard Time, ... Our son does that at times. If you are ok with it let it be. He is your son, your","messageBody":"<div id=\"ygrps-yiv-852746726\">In a message dated 5/14/2003 9:26:52 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robwight@...\">robwight@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi All<br/>\n&gt; <br/>\n&gt; I have a problem that I need some input on by parents who won&#39;t just tell <br/>\n&gt; me that my children just need to learn who is boss!<br/>\n&gt; <br/>\n&gt; When anyone visits, often my 11 year old son, James, likes to listen to the <br/>\n&gt; conversation. While this is okay by me most of the time, sometimes its not. <br/>\n&gt; He doesn&#39;t like to let anything go past without understanding it. So he <br/>\n&gt; keeps interrupting the conversation with &quot;What did she say?&quot;, &quot;What did she <br/>\n&gt; mean when she said...&quot;, &quot;What did you mean when you said that...&quot; &quot;How...&quot; <br/>\n&gt; and so on. Whilst in principal I see no reason why he shouldn&#39;t be there or <br/>\n&gt; shouldn&#39;t take part in the conversation, his need for constant explanations <br/>\n&gt; kills the conversation. The person I am trying to talk to becomes <br/>\n&gt; frustrated, I become frustrated, we forget what we were talking about and <br/>\n&gt; often run out of time. On one occasion, a friend was trying to introduce me <br/>\n&gt; to someone, but James was so demanding that she ended up turning to the <br/>\n&gt; lady, throwing up her hands and saying &quot;It&#39;s impossible to talk to Sue.&quot;<br/>\n&gt; <br/>\n&gt; If I get to a stage where I ask him to let me have a talk on my own to <br/>\n&gt; whoever, he is hurt and feels ostracized (He suffered a lot with bullying <br/>\n&gt; when in school) and just genuinely doesn&#39;t understand why I would need to <br/>\n&gt; talk to someone without him there. I then have to try and explain that we <br/>\n&gt; are not talking about him, not talking about anything top secret but that <br/>\n&gt; we do want to talk and are having trouble having a conversation with his <br/>\n&gt; over involvement. I try to explain that a conversation involves listening <br/>\n&gt; and talking but that with his constant questions he is monopolizing the <br/>\n&gt; conversation.<br/>\n&gt; <br/>\n&gt; Sometimes too there are conversations which are beyond his experience and <br/>\n&gt; whilst I don&#39;t want to give the impression that they are top secret, the <br/>\n&gt; conversation can&#39;t go beyond his understanding while he insists on a <br/>\n&gt; dictionary definition of every word. <br/>\n&gt; <br/>\n&gt; I do find the situation is a lot less stressful around people who have a <br/>\n&gt; more accepting view of children - unschoolers in particular but it still <br/>\n&gt; happens at a lower level. With people who expect to be able to talk <br/>\n&gt; exclusively to me and that the children will just go and play quietly <br/>\n&gt; somewhere, his needs seem to quadruple and I end up feeling overwhelmed by <br/>\n&gt; the struggle of trying to have a conversation. Then I hesitate to ask him <br/>\n&gt; to go away, because I know they will expect me to tell him to go away and <br/>\n&gt; punish him if he doesn&#39;t. I don&#39;t want to do that. When I ask him to go <br/>\n&gt; away he doesn&#39;t understand ends up crying and still doesn&#39;t go away. End of <br/>\n&gt; conversation.<br/>\n&gt; <br/>\n&gt; We have come so far in the time since we left school and began unschooling <br/>\n&gt; (two and a half years ago), but the emotional school scars are still there <br/>\n&gt; and I find it frustrating that visitors usually don&#39;t get to see us as we <br/>\n&gt; now are - far more relaxed and comfortable with each other - because of <br/>\n&gt; this conversation stress.<br/>\n&gt; <br/>\n&gt; I want to respect James&#39; need for explanations, but also be able to meet my <br/>\n&gt; need to talk to people.<br/>\n&gt; <br/>\n&gt; Anyone got any advice?<br/>\n&gt; <br/>\n&gt; Susan<br/>\n<br/>\n </span></blockquote>Our son does that at times.<br/>\nIf you are ok with it let it be. He is your son, your responsibility. I would <br/>\nnot tell him to go away for the sake of anyone else.<br/>\nMy Father In Law says my son knows too much. I ask him what is it that you <br/>\ndont think he should know? He cant answer that. Some people are just in the <br/>\nchildren should been seen and not heard mode. <br/>\nIf it does bother you enough to want to speak to him or ask him to leave, <br/>\nMaybe sit down with him and explain....... What.....Why though ... explain <br/>\nwhat? I was going to give a suggestion but then I wonder why cant he ask, why <br/>\ncant he know what something means?<br/>\n<br/>\nOur son is very sociable, he can talk to anyone about anything. He holds a <br/>\nconversation better than I can and he is only 11.<br/>\n<br/>\nIf you have to tell people he is doing a study on human interactions. Why an <br/>\nexcuse I dont know, I wouldn&#39;t but it may help your situation.<br/>\n<br/>\nAs for the private needed conversations ... I am blank tonight. The only <br/>\nideas I can think of is a movie, video game, do it over the phone or go out <br/>\nside where he may get interested in something else.<br/>\n<br/>\nLaura D<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":68350,"nextTopicId":69138}}