{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Enrichment","postDate":"1013793880","msgId":4864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ni45OGUzYmZjLjI5OWU5ZTU4QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4863,"nextInTime":4865,"topicId":4864,"numMessagesInTopic":0,"msgSnippet":"Looking for something, I found (as usual) something else on the way--an article I had kinda forgotten about.  It was published locally, but is in the ","messageBody":"<div id=\"ygrps-yiv-713219838\">Looking for something, I found (as usual) something else on the way--an <br/>\narticle I had kinda forgotten about.  It was published locally, but is in the <br/>\nunschooling.com library.  This is the last part of it:<br/>\n<br/>\n-=-<br/>\nI&#39;m an unschooler. Lessons are never over. On the other hand, lessons never <br/>\nreally begin. Children&#39;s question are answered and an atmosphere of learning <br/>\nis created so that questions are constant and answers are never far away. <br/>\n<br/>\n-=-When people ask a structured family how much time it takes to homeschool <br/>\nthe response usually ranges from three hours a day to six hours a day (much <br/>\nmore than kids actually spend in classrooms in school). When you ask an <br/>\nunschooling family how much time it takes to homeschool, first there&#39;s a <br/>\npause. I&#39;ve heard, in rapid succession in groups of unschoolers, &quot;None&quot; and <br/>\n&quot;All of it.&quot; Their range is it takes from zero hours a day to 24 hours a day.<br/>\n<br/>\n-=-When learning is recognized in the fabric of life and encouraged, when <br/>\nfamilies make their decisions based on what leads to more interesting and <br/>\neducational ends, children learn without effort, often without even knowing <br/>\nit, and parents learn along with them.<br/>\n<br/>\n-=-Many homeschoolers fall somewhere between structured and seamless-life <br/>\nlearners. There are families whose children attend school whose houses are <br/>\nlearning labs, museums and libraries all rolled into one. Enriching our lives <br/>\nfor the benefit of our children isn&#39;t just for homeschoolers. Small changes <br/>\nin parental attitude are sometimes all it takes.<br/>\n<br/>\n-=-Learning isn&#39;t in fancy books or computer games, it all happens in the <br/>\nideas children have, in the trivial facts they fit together to come up with <br/>\ntheir view of the world--past present and future. You don&#39;t need a lesson or <br/>\na unit to show a child what&#39;s wonderful about woodgrain, ice crystals on the <br/>\nwindshield, or birdsongs. Five seconds worth of pointing and saying &quot;Look, <br/>\nthese trees were not native to North America&quot; might possibly lead to an hour <br/>\nlong discussion, or a lifelong fascination. Bringing something interesting <br/>\nhome, browsing in an antique shop, listening to new music on instruments <br/>\nyou&#39;ve never heard--all those build neural pathways and give you a chance to <br/>\nbe together in a special place.<br/>\n<br/>\n-=-No matter how your children formally learn, take a few more opportunities <br/>\nto share wonder and discovery with them. It will enrich you all.<br/>\n<br/>\nOnline at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/library/essays/essay04.shtml\">http://www.unschooling.com/library/essays/essay04.shtml</a><br/>\n<br/>\nLinked from <a rel=\"nofollow\" target=\"_blank\" href=\"http://maeshell.com/unschooling_what.shtml\">http://maeshell.com/unschooling_what.shtml</a> <br/>\n-=-<br/>\n<br/>\n<br/>\nIn schools, &quot;enrichment&quot; centers are where the good stuff is, for the gifted <br/>\nkids.<br/>\nWhy the whole school can&#39;t be &quot;enriched&quot; is because enrichment is relative, <br/>\nand ongoing.  Something&#39;s never totally and fully &quot;enriched,&quot; because there <br/>\ncould always be more added later.  I suppose for someone to be &quot;as enriched <br/>\nas Midas,&quot; everything they&#39;d touch would turn to fascination.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":4861,"nextTopicId":4866}}