{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;a taste of his own medicine&quot;","postDate":"1084808596","msgId":94191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRhLjJiZDI2MWUxLjJkZGEzNzk0QGFvbC5jb20+"},"prevInTopic":94158,"nextInTopic":0,"prevInTime":94190,"nextInTime":94192,"topicId":94123,"numMessagesInTopic":0,"msgSnippet":"Sorry, this is being posted oddly.  I thought it was a duplicate because of the bottom part.  The top part is the new info. There ve been several posts lately","messageBody":"<div id=\"ygrps-yiv-792649796\">Sorry, this is being posted oddly.  I thought it was a duplicate because of <br/>\nthe bottom part.  The top part is the new info.<br/>\n<br/>\nThere&#39;ve been several posts lately where it was hard to tell the quote from <br/>\nthe new post.  Please try to mark what you&#39;re quoting.  Sorry I misunderstood <br/>\nthis one and pulled it.<br/>\n<br/>\na moderator-person (Sandra)<br/>\n<br/>\n<br/>\nFrom: &quot;Dana Browning&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hsmomofonly3@...\">hsmomofonly3@...</a>&gt; <br/>\nDate: Mon May 17, 2004 6:24am <br/>\nSubject: Re: [UnschoolingDiscussion] Re: &quot;a taste of his own medicine&quot; <br/>\n<br/>\nYesterday DH and I were out with our 2yob. We stopped at 7-11 and DS wanted <br/>\nsome M&Ms. Dh said no. I asked why he said no and DH said because he threw a <br/>\nfit. I asked did he throw the fit before or after you said no? He started to go <br/>\nback for them, but by then we were on the way again. I think it was a totally <br/>\nnew concept for him.<br/>\nDana<br/>\n<br/>\n<br/>\n[and this was quoted from earlier]<br/>\n<br/>\nI&#39;m the type of person who wants to jump immediately to &quot;No&quot; or &quot;its <br/>\ntoo messy/hard/tiring/long&quot; or whatever, but i am finding that <br/>\nthis &quot;saying yes&quot; thing is making our lives so much nicer, kinder, <br/>\nsweeter. I&#39;m so thankful to the people on the list for showing me <br/>\nthat by saying &quot;yes&quot; i am not encouraging laziness or &quot;giving in&quot; to <br/>\nmy child. <br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;a taste of his own medicine&quot;","postDate":"1084756150","msgId":94158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4OTNibStmMGswQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNTgwMWM0M2FlMSQ2YWFmNmEzMCQwMjAxYThjMEBhby5sb3AuY29tPg=="},"prevInTopic":94127,"nextInTopic":94191,"prevInTime":94157,"nextInTime":94159,"topicId":94123,"numMessagesInTopic":0,"msgSnippet":"I m not sure where this fits in, but i wanted to post about it. Today we went to the chinese restaurant (seamus choice), and i had mentioned earlier, before","messageBody":"<div id=\"ygrps-yiv-641090214\">I&#39;m not sure where this fits in, but i wanted to post about it. <br/>\nToday we went to the chinese restaurant (seamus&#39; choice), and i had <br/>\nmentioned earlier, before we went, how i hoped they had these little <br/>\nmini custard pies there, because i really liked the one i ate last <br/>\ntime. So when we got there we each went our seperate ways to get <br/>\nfood. When i got back to the booth, Seamus was sitting there with <br/>\nhis dumplings, and there were two little custard pies on my side of <br/>\nthe table, just for me. How thoughtful is that?! He is just 7. <br/>\n<br/>\nThis evening we packed up the gamecube and went to my sister&#39;s house <br/>\nso seamus and his cousin could work at unlocking a character. When <br/>\nwe got there i realized Seamus forgot to pack up a cord we needed. I <br/>\nwas a little frustrated with that and negativity creeped in (&quot;HOW <br/>\ncould you forget it? I asked you if you had everything!&quot;), but then <br/>\ni thought this was going to really ruin the day. So i said, i&#39;ll <br/>\njust drive home and get it (it was about five miles)....Seamus <br/>\ncouldnt believe it &quot;Really? You&#39;ll drive all the way home??&quot; &quot;Sure.&quot; <br/>\n<br/>\nSo i did, it only took a little while, and they&#39;ve been happily <br/>\nplaying SuperSmash Bros. for hours now while i get time on the <br/>\ncomputer. (oh and i also apologized for losing my temper.)<br/>\n<br/>\nI think most mainstream parents would never even consider driving <br/>\nhome for a videogame cable (just on &quot;general principal&quot; if nothing <br/>\nelse), but then again, i dont think they would get custard pies <br/>\nbrought to their table either! <br/>\n<br/>\nI&#39;m the type of person who wants to jump immediately to &quot;No&quot; or &quot;its <br/>\ntoo messy/hard/tiring/long&quot; or whatever, but i am finding that <br/>\nthis &quot;saying yes&quot; thing is making our lives so much nicer, kinder, <br/>\nsweeter. I&#39;m so thankful to the people on the list for showing me <br/>\nthat by saying &quot;yes&quot; i am not encouraging laziness or &quot;giving in&quot; to <br/>\nmy child. <br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] &quot;a taste of his own medicine&quot;","postDate":"1084669329","msgId":94127,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTgwMWM0M2FlMSQ2YWFmNmEzMCQwMjAxYThjMEBhby5sb3AuY29tPg==","referencesHeader":"PDIwMDQwNTE1LjE3NTU0OC4yODQyMi4yMTI5MzRAd2VibWFpbDEwLm55Yy51bnRkLmNvbT4="},"prevInTopic":94123,"nextInTopic":94158,"prevInTime":94126,"nextInTime":94128,"topicId":94123,"numMessagesInTopic":0,"msgSnippet":"I ve often found that NOT doing what a child needs, or saying no takes a lot more energy than just doing the thing or saying yes. So true.  I hadn t quite","messageBody":"<div id=\"ygrps-yiv-737777750\">I&#39;ve often found that NOT doing what a child needs, or saying &quot;no&quot; takes a lot more energy than just doing the thing or saying &quot;yes.&quot;<br/>\n<br/>\n<br/>\nSo true.  I hadn&#39;t quite thought about that, but you are so right.<br/>\n<br/>\nKristen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;a taste of his own medicine&quot;","postDate":"1084668896","msgId":94123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTE1LjE3NTU0OC4yODQyMi4yMTI5MzRAd2VibWFpbDEwLm55Yy51bnRkLmNvbT4="},"prevInTopic":0,"nextInTopic":94127,"prevInTime":94122,"nextInTime":94124,"topicId":94123,"numMessagesInTopic":0,"msgSnippet":"On the issue of when to say no or not...I often judge the decision (when I m truly exhausted) on which answer takes more energy. I ve often found that NOT","messageBody":"<div id=\"ygrps-yiv-10319143\">On the issue of when to say no or not...I often judge the decision (when I&#39;m truly exhausted) on which answer takes more energy.<br/>\nI&#39;ve often found that NOT doing what a child needs, or saying &quot;no&quot; takes a lot more energy than just doing the thing or saying &quot;yes.&quot;<br/>\nGetting a drink for a kid is a lot easier than spending energy trying to convince him/her to go get it if they don&#39;t want to after a suggestion.<br/>\nMy dh doesn&#39;t totally get this quite yet....he&#39;ll ask the kids to go pick something up that would be easier for HIM to grab and put away.<br/>\nIf it takes more energy to bug someone, I&#39;d rather just do it myself.<br/>\n<br/>\nNot that this is the only consideration, but it&#39;s helped me lots of times to pause and ask myself what is going to be advantageous energy wise....because negativity takes a lot of energy. I&#39;d rather cook something, or get a drink or whatever it takes most of the time, even when I&#39;m tired.<br/>\nIt depends though...if Trevor asks me at 11pm to cook a mess of potatoes and I&#39;m thoroughly tired, I&#39;ve been known to say &quot;there&#39;s no way I can do that right now, I&#39;m ready to pass out, you might have asked me an hour ago.&quot; But even at that, I&#39;ll usually offer to get them started and then leave him to finish.<br/>\n<br/>\nAnd yeah, I work outside the home some. So my children have to manage without me for small spurts. It&#39;s been rare that they really don&#39;t want me to go, because we have a movie, or Dad home for the day, or a fun friend coming to watch them, or cool food...something interesting to make it not so bad. Today I was supposed to work until around 3pm, but my schedule is very much up to me and I left at 2pm instead...it was really fun coming home an hour early and having them surprised.<br/>\n<br/>\nBecause I work, I rarely make plans without the kids, but dh and I do spend some time alone. I usually make sure Jalen is asleep first and Sierra has something to look forward to, like us bringing gum home or something she likes. Promises of things brought home makes time away from Mom a bit easier usually. I DO think it&#39;s important to take care of yourself and spend time doing things you love.  I also know it&#39;s unrealistic to have much of that when children are very little...I get a lot more now because my small guy has older siblings that he loves playing with and a built in babysitter (by choice, he gets paid).<br/>\n<br/>\nI weave my time around them usually. After things calm down in the evening, or before everyone is up in the morning. Sometimes it works, sometimes not. Having a dh that works around my schedule makes it possible, not everyone has that luxury.<br/>\n<br/>\nSo maybe drop expectations, and just be in the moment Sheila, your days sound happy and fun. I have no problem with &quot;no&#39;s&quot;, just a problem with arbitrary &quot;no&#39;s&quot; that don&#39;t take the child&#39;s needs/wants seriously.<br/>\n<br/>\nWe just got back from Wal-Mart where I had many items in my cart for the kids and their neighbor friends that are spending the night. Jalen had picked out M & M&#39;s, Zebra bars, ice cream and pizza already. Plus the things everyone else chose. After I&#39;d put my card in, he kept finding new things he wanted and I said &quot;no, we already have enough right now&quot; and that was true. My budget was maxed and we had a ton of stuff he couldn&#39;t even eat in a night. He&#39;s used to picking out foods at the store, so he just sighed, said &quot;oh man&quot; and put it back.<br/>\nWhen I say &quot;no&quot; it&#39;s not a huge issue, because he does hear &quot;yes&quot; most of the time and feels control over his own choices.<br/>\n<br/>\nRen<br/>\n<br/>\n &quot;There is no way to <br/>\npeace.  Peace is the way.&quot; <br/>\n                   ~Quaker saying</div>","specialLinks":[]}],"prevTopicId":94076,"nextTopicId":94141}}