{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Between you and I (private) Very much agree with you.","postDate":"1029274537","msgId":40961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENTk3QkE5LjIwMTAxMDFAdm9sLmNvbT4=","referencesHeader":"PEI5N0RDMTE0LjEzMDglbmVkdmFyZUBudHBseC5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":40960,"nextInTime":40962,"topicId":40961,"numMessagesInTopic":0,"msgSnippet":"... Your points are solid, clear minded, and ring true: others perception of them sucks, sounds egotistical, and guides people to think you are near sighted.","messageBody":"<div id=\"ygrps-yiv-213241359\"><blockquote><span title=\"ireply\">&gt; Hi Ned:<br/>\n<br/>\n </span></blockquote>Your points are solid, clear minded, and ring true: others perception of <br/>\nthem sucks,<br/>\nsounds egotistical, and guides people to think you are near sighted.   If<br/>\nyou think this to be a punch it is ment to be constructive.   Leaving out<br/>\npersonal pronouns (I, Me, My) will get rid of the perceived egotistical <br/>\nnature<br/>\nof your comments.   The other two are more difficult and would best be <br/>\ndelivered<br/>\nin metaphore.   The problem that exists with all the American Zombies not<br/>\nrealizing that a police state is decending upon them is fear of change.  <br/>\nThe very thing that school has so well implanted. The other thing is <br/>\nthat nobody<br/>\nhere has experienced a police state. So the look and feel is not known. <br/>\n When Capt.<br/>\nCook sailed into Hawaiian Harbors none of the natives ever seen him <br/>\nuntil the smaller<br/>\nboats were launched.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>People are made of a small conscious mind with very limited uses and largely<br/>\nemotionless, the subconscious is as opposed to the conscious a behemoth <br/>\nemotional<br/>\nmonster with capabilities unknown and vast.   Subconscious processes are<br/>\nwhere somebody with a message should speak.  This is why people like <br/>\nMohammad,<br/>\n..., went through such hell prior to their messages being joined, they had<br/>\nto figure out why they were ridiculed.   Subconscious is all emotion, <br/>\nmemory,<br/>\nand process, conscious is a gatekeeper to keep crap out of the subconscious<br/>\nbut it is very easily fouled and to keep pee brain (conscious) from <br/>\noverload.  <br/>\nHypnosis is the bypass of a part of the brain referred to as the hypocampus<br/>\nor if you will a doorway that bypasses the gatekeeper.   The hypocampus <br/>\ndifferentiates<br/>\nbetween what is real and what is imagined.   Metaphore bypasses too but the<br/>\nmetaphore must adhere to a certain structure.  This structure is known as<br/>\n&quot;the rules of mind&quot; This would be fun to study if your goal is to influence<br/>\nthe thoughts in others.   Also in NLP (Neural Linguistic Programming) how<br/>\nto anchor would be a great benefit as it relates to how to attract and repel<br/>\nat choice or associate internal thoughts with attractive and repulsive <br/>\nemotions.  <br/>\nA ripe source for these but probably too advanced is Frogs to Princes  by<br/>\nRichard Bandler.   If you think this is horse shit then perhaps you should<br/>\ncheck out the resolution of a murder case where Richard Bandler acted as<br/>\nhis own attorney.   It is a great deal of fun to see somebody tell the jury<br/>\nthat they committed the murder and see the verdict as not guilty.   Bandler<br/>\nis also not a very nice person in that he had often called the judge and<br/>\njury &quot;fuck ups&quot; durring the trial and was never heard by either, but the<br/>\nstenographer captured it.  Also your use of what are called predicates is<br/>\nnonexistant.   If you will, let a sentence be constructed that describes<br/>\na car it will appeal to different people if it appeals to different <br/>\nsenses.  <br/>\nThat is just as people tend to be different handed they also tend to use<br/>\non one sense more than another.<br/>\n<br/>\n <br/>\n<br/>\nTo appeal to visual people it would suffice to say:  The yellow Volks <br/>\nWagon made a shinning entrance.<br/>\n<br/>\n To appeal to a auditory person:  The yellow Volks Wagon rang my bell.<br/>\n<br/>\nTo appeal to a kinesthetic you would say:   The yellow Volks Wagon had <br/>\nhands on appeal.<br/>\n<br/>\n To appeal to all groups noted:   The yellow VW made a shinning entrance <br/>\nthat rang my bell with its hands on appeal.<br/>\n<br/>\n<br/>\nAn easier reference would be monsters and magical sticks.<br/>\n<br/>\n<br/>\n<br/>\nBill</div>","specialLinks":[]}],"prevTopicId":40878,"nextTopicId":40962}}