{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":118475879,"authorName":"energmom","from":"&quot;energmom&quot; &lt;rzavaleta@...&gt;","profile":"energmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Newby - &quot;special needs&quot; question","postDate":"1077266004","msgId":91214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxNGdvays4NmQ0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":91213,"nextInTime":91215,"topicId":91214,"numMessagesInTopic":0,"msgSnippet":"I ve been reading and listening but not posting because unschooling is a new concept for me.  Just through reading posts I ve already found that my ideas about","messageBody":"<div id=\"ygrps-yiv-356783630\">I&#39;ve been reading and listening but not posting because unschooling <br/>\nis a new concept for me.  Just through reading posts I&#39;ve already <br/>\nfound that my ideas about learning and parenting are radically <br/>\nchanging (for the better!)<br/>\n<br/>\nBut I have a few personal concerns that I hope you more experienced <br/>\nmoms could help me work through.<br/>\n<br/>\nI have 3 children; 10 year old girl, 7 year old boy and a 3 year old <br/>\nboy.  It is the 7 year old who has led me to unschooling.  He is <br/>\nvery interested in the world, especially science, animals, math, <br/>\netc... and though he is just beginning to read simple books, he <br/>\npours over and absorbes any subject he is interested in.  (bats, <br/>\nsharks, deep sea creatures, multiplication, anything science, legos, <br/>\netc...)  He is definately a self-starter, independent thinker and <br/>\nvery verbal and social.  He specifically asked to homeschool because <br/>\nhe found Kindergarten tiresome and saw that he could have the chance <br/>\nto learn what he wanted to know if he stayed home and I could help <br/>\nguide him.  Now he has led me into this new world...<br/>\n<br/>\nHis sister is the reason I started homeschooling.  She was <br/>\nidentified with a developmental delay at 3 yrs., and found the <br/>\nclassroom too stimulating and the level of inquiry and time needed <br/>\nfor her to learn too shallow.  (But in many areas she is clearly <br/>\nbrilliant) She has progressed greatly due to the 1:1 instruction <br/>\nbetween herself and I for the last yr and 1/2.  Now she understands <br/>\nso much more and is poised and self assured, is a terrific reader <br/>\nand has just blossomed into a gem of a girl with the extra attention <br/>\nand explainations.<br/>\n<br/>\nI&#39;ve read some unschooling posts for kids who had been or who would <br/>\nbe &quot;labeled&quot; as having special needs / gifted if they were in the <br/>\npublic school system.  There doesn&#39;t seem to be many parents who <br/>\nunschool children like my daughter.  At this time, I&#39;m aware of <br/>\nwhere she is developmentally, academically, socially in relation to <br/>\nher peers  (and she is now at a &quot;typical level&quot; -- meaning that she <br/>\nhas come a  long way.  **Remember, she was in public school -- it <br/>\nwas for many years my job to know this info. and to help her in <br/>\nher &#39;uneven&#39; areas  --Which I have done better than the <br/>\nprofessionals at public school).<br/>\n<br/>\nSo now we are entering &#39;unschooling&#39; territory.  My daughter who is <br/>\nan exceptional artist and more introverted (mainly due to not <br/>\nfulling undertanding situations or social cues) but not shy, sees <br/>\nlife in a more limiting way than my son does.  I&#39;m through <br/>\nwith &quot;pushing&quot; her to do things -- it doesn&#39;t make sense anymore, <br/>\nshe is almost a teenager and it is disrespectful.  But I also know <br/>\nthat in the past she DID have great gaping holes in core knowledge <br/>\nand awareness.  <br/>\n<br/>\nHow does unschooling work for a child like my daughter?  How do I <br/>\nopen her up to new experiences or new ways of thinking when this is <br/>\nnot generally part of her makeup?<br/>\n<br/>\nThis past month we&#39;ve been unschooling because both of my children <br/>\nhave already met their state goals.  Within this month, we&#39;ve <br/>\nexplored areas my son is interested in and I&#39;m finding this approach <br/>\nworks better learning-wise rather than pages and pages of pre-<br/>\nscheduled cirriculum.  Children do learn a great deal when they are <br/>\nthe guides!  <br/>\n<br/>\nAlso, since she has been labeled with a developmental disability, <br/>\nshe is in the &#39;system,&#39; so having state and/or school officials <br/>\nvisit is and could be a reality.  Since she has exceeded others&#39; <br/>\nexpectations, I doubt if I would have a problem down the road... but <br/>\nI worry.<br/>\n<br/>\nReassurance and advise would be appreciated.  <br/>\nRebeca</div>","specialLinks":[]}],"prevTopicId":91197,"nextTopicId":91133}}