{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Food-Diet-Allergies","postDate":"1012431626","msgId":3509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTMwMjMwMDI2LjEwMTU1LnFtYWlsQHdlYjEzNzA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMTIzNzI3NjMuMTUxMS4yMDA2My5tOUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":3508,"nextInTime":3510,"topicId":3509,"numMessagesInTopic":0,"msgSnippet":"... This had been an ongoing balancing act for us, between good nutrition, the kids freedom of choice with their diet, and restricting dangerous allergens.","messageBody":"<div id=\"ygrps-yiv-452298319\"><blockquote><span title=\"ireply\">&gt;&gt;Suppose your child ate a certain food and was cranky<br/>\n&gt;&gt;and miserable.  .....Would you&gt;ban the food from<br/>\n&gt;&gt;your &gt;house?<br/>\n<br/>\n&gt;Only if it were a life-threatening allergy, and then<br/>\n&gt;only until the child was old enough to really *get*<br/>\n&gt;how important it was.  My granddaughter was <br/>\n&gt;supposed to be allergic to many foods, causing<br/>\n&gt;behavior problems.  <br/>\n&gt;Tia Leschke<br/>\n<br/>\n </span></blockquote>This had been an ongoing balancing act for us, between<br/>\ngood nutrition, the kids&#39; freedom of choice with their<br/>\ndiet, and restricting dangerous allergens.  We HAVE<br/>\nhad to ban foods because of life threatening<br/>\nallergies.  We have not banned them from the house,<br/>\nbut only from that child&#39;s diet.  How can we tell our<br/>\nnon-allergic child that he is not allowed to eat<br/>\nanything with eggs, milk, cheese, or nuts in it?  <br/>\n<br/>\nThankfully, we have been introducing small amounts of<br/>\nfoods with a little dairy or egg in them, and Thomas<br/>\nhas been tolerating them alright, so perhaps these<br/>\nallergies will ease up even more for him as he grows. <br/>\nBut his reaction to eggs and dairy products has been<br/>\nvery violent in the past: projectile vomiting, mucus<br/>\nclogging eyes, ears, nose and throat dangerously,<br/>\nswelling, rashes, hospital intervention, etc.  He has<br/>\nhad that reaction to pancakes two years ago, but just<br/>\nrecently we tried them again (with less egg) and he<br/>\nwas able to eat them fine, if sparingly.  <br/>\n<br/>\nNuts are non-negotiable, as we were VERY lucky to<br/>\ndiscover it the way we did without losing him.  We<br/>\ndon&#39;t try them on him.  We don&#39;t even let him eat<br/>\nthings that say &quot;May contain traces of nuts.&quot;  When he<br/>\nis a little older, I would like to have a doctor test<br/>\nhim, in a controlled setting, to verify the type and<br/>\ndegree of his nut allergies and perhaps free up some<br/>\nof his diet that way.<br/>\n<br/>\nIt has been our experience that he refuses foods that<br/>\ndo not &quot;taste right&quot; to him.  He can detect even trace<br/>\namounts of his allergens and knows which ones he<br/>\ncannot tolerate.  Even if that allergen is disguised<br/>\nin a cookie or other treat, he will take a small bite<br/>\nand either spit it out, or refuse more.  I am the same<br/>\nway with foods that contain my allergens, mushrooms,<br/>\navacados, and bananas.  We read labels on everything<br/>\nor refuse homemade items we are not sure of,<br/>\nparticularly when it comes to nuts.  He brings us<br/>\nfoods and asks if they are alright for him to eat now,<br/>\nbut when he was younger I had to follow him around and<br/>\nwatch what he put in his mouth.  I am helping him to<br/>\nlearn to recognize the words nuts, eggs, milk, etc. on<br/>\nlabels.  We are stressing to him the importance, (when<br/>\neating food that does not come in a labeled package<br/>\nand we did not cook ourselves,) of always asking, AND<br/>\nGETTING ANSWERS, about what is in foods from the COOK,<br/>\n NOT the server, whether we are in a resturaunt or<br/>\nsomeone&#39;s home, or at a picnic, or a store.<br/>\n<br/>\nWe take antihistamines with us when we go out, and an<br/>\nepi-pen (epinephrine punch type hypo) for emergencies.<br/>\n We watch our son closely with any food that has<br/>\namounts of his allergens in it, he knows to tell us<br/>\nthe moment he feels any sort of reaction beginning. <br/>\nWe avoid restaurant food with a lot of mysterious<br/>\ningredients, or asian food (where they often cook with<br/>\nsesame and peanut and other oils).<br/>\n<br/>\nBut then we run into a grey area.  There are foods<br/>\nthat tax his immune system, making him unable to<br/>\nhandle others that he normally can.  There are those<br/>\nthat cause him excess mucus production and aggravate<br/>\nhis asthma.  There are those that make him hyper or<br/>\nover sensative, prone to meltdowns.  Our pattern has<br/>\nbeen set by the foods that we HAD to limit for safety<br/>\nsake, but now, as he gets older, we have to break that<br/>\npattern to allow him to learn his own balance in his<br/>\ndiet, while still helping him to recognize and<br/>\nunderstand how his body reacts to certain substances. <br/>\n<br/>\n<br/>\nWe have to say no sometimes.  We try not to do it<br/>\nexcessively.  We ask him what he thinks about it, or<br/>\nto try a small taste of something (as long as it is no<br/>\nnuts) and see how it feels to him.  It&#39;s hard to have<br/>\nto give him more freedom every day on this issue, as<br/>\nhe grows, but I know we need to.  His allergies are<br/>\ndangerous and that is scary, but I suppose it is good<br/>\npractice for me in letting go, when I can.<br/>\n<br/>\nNanci K.<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nGreat stuff seeking new owners in Yahoo! Auctions! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com\">http://auctions.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":3216,"nextTopicId":3029}}