{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Bridget","from":"&quot;Bridget&quot; &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","senderId":"XvvnEwMBcb-uie_wx5zG9fKT_RU7B4qa6hqa346mgfXxh4Hr4s7RfHcVyYo_GBD6yvVdT1DtQUcaJDpRUyKwKb3VYllTT_MpM84g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Federal dollars","postDate":"1005926985","msgId":27796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDl0M2RvOStzOWJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNTUwMWMxNmRmNyQ1Y2FlZTUwMCQzOGNjN2ZkOEBleGVjcGM+"},"prevInTopic":27760,"nextInTopic":0,"prevInTime":27795,"nextInTime":27797,"topicId":27759,"numMessagesInTopic":0,"msgSnippet":"... created a system to extend the immaturity of our kids instead of letting them stay home and learn from their parents good work and responsibility of","messageBody":"<div id=\"ygrps-yiv-1639253904\">--- In Unschooling-dotcom@y..., &quot;Dan Conine&quot; &lt;dconine@d...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;. Add to that, the liberal kiss-butt education system which has <br/>\n </span></blockquote>created a system to extend the immaturity of our kids instead of <br/>\nletting them stay home and learn from their parents&#39; good work and <br/>\nresponsibility of actions, and you have a perpetually self-<br/>\nreplicating system of shiny, noisy, useless lives who need to be <br/>\nentertained every moment, because when they start to actually think <br/>\nand reflect, they end up running to the psychiatrist for something to <br/>\nget the &#39;voices&#39; out of their heads.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Thus, I give a hearty salute to the unschool efforts of you all !!<br/>\n&gt; <br/>\n&gt; Dan C.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>While I don&#39;t agree complete with what you are saying here, there is <br/>\none part I agree with wholeheartedly.  Our current public education <br/>\nsystem and the system of parenting that seems to have grown up around <br/>\nit, do keep our children from maturing.  I once said, &quot;We treat our <br/>\nteens like children at best and criminals at worst and then wonder <br/>\nwhy they act like children and criminals.&quot;  Someone liked it enough <br/>\nto pick it up as a tagline.  But it is more than a catchy phrase.  <br/>\nOur schools do promote an immaturity and it does have effects on the <br/>\nchildren who are placed there.  A few kids may break free of the <br/>\nsystem but anyone who thinks every child is strong enough to rise <br/>\nabove it is just plain naive.  <br/>\nI don&#39;t however think it is a liberal thing.  The problems in our <br/>\npublic schools have been perpetuated and created by both liberals and <br/>\nconservatives.<br/>\n<br/>\nBridget</div>","specialLinks":[]},{"userId":0,"authorName":"Dan Conine","from":"&quot;Dan Conine&quot; &lt;dconine@...&gt;","profile":"dconine2000","replyTo":"LIST","senderId":"5y29F0iV1zl-7khKZO0uDr-vVe28ub7ReYHqLOBGa_6gUIxNjLVERj1hR8NJU1oQUtIsxoFkRU0lmI1MgWXuXlvd8F9H0KPy","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Federal dollars","postDate":"1005843770","msgId":27759,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTUwMWMxNmRmNyQ1Y2FlZTUwMCQzOGNjN2ZkOEBleGVjcGM+","referencesHeader":"PDEwMDU3OTk4MDQuMjcxMy45NTY0Ni5tOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":27760,"prevInTime":27758,"nextInTime":27760,"topicId":27759,"numMessagesInTopic":0,"msgSnippet":"... I didn t say that you were a freeloader, but, do you feel like one? The federal government does NOT represent everyone, they represent the most votes,","messageBody":"<div id=\"ygrps-yiv-1384298050\"><blockquote><span title=\"ireply\">&gt;The federal government represents all of us in this country. By extension,<br/>\n&gt;me. By extension, you&#39;re calling me a freeloader. I take exception.<br/>\n<br/>\n </span></blockquote>I didn&#39;t say that you were a freeloader, but, do you feel like one? The federal government does NOT represent everyone, they represent the most votes, WHICH in the last several presidential elections, wasn&#39;t even a majority of the VOTERS, let alone the people. In FACT, it is truthful to say that whatever platform was elected, the MAJORITY of people DIDN&#39;T WANT IT ! (and they weren&#39;t given the option of &quot;none of the above&quot;)<br/>\n<br/>\nAs far as roads and safety issues: How many roads do we need for people to go to jobs to create more jobs to sell more shiny, noisy crap that noone really needs?<br/>\nHow many more football stadiums do we need? What are the resource-hounding, struggling masses of the future going to say about the constant waste we create, and how we protected our right to waste things through government actions?<br/>\n<br/>\nThere is a lot of discussion about TV being bad or good. It isn&#39;t the TV, the device is just a device. It isn&#39;t necessarily the entertainment. It IS the exploitation of emotional responses in people that they don&#39;t even know they have. It gets to be &#39;evil&#39; when it is directed at children who don&#39;t know how to discern reason and emotional responses. Add to that, the liberal kiss-butt education system which has created a system to extend the immaturity of our kids instead of letting them stay home and learn from their parents&#39; good work and responsibility of actions, and you have a perpetually self-replicating system of shiny, noisy, useless lives who need to be entertained every moment, because when they start to actually think and reflect, they end up running to the psychiatrist for something to get the &#39;voices&#39; out of their heads.<br/>\n<br/>\nThus, I give a hearty salute to the unschool efforts of you all !!<br/>\n<br/>\nDan C.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"scZ_a8QpKLwvniFN8I5gSgTdrcVfDzp9Dvh_zMGWMk8lIO67wXEnp2RuNJlumjFXXVcgojLJT6xS","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Federal dollars","postDate":"1005839333","msgId":27760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2ZC4zZjk0YWEzLjI5MjUzZGU1QGFvbC5jb20+"},"prevInTopic":27759,"nextInTopic":27796,"prevInTime":27759,"nextInTime":27761,"topicId":27759,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/15/01 8:02:51 AM Mountain Standard Time, ... That s a pretty long and frantic sentence. They have drugs for that! (I m joking, but not.) ","messageBody":"<div id=\"ygrps-yiv-464047591\">In a message dated 11/15/01 8:02:51 AM Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dconine@...\">dconine@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; . Add to that, the liberal kiss-butt education system which has created a <br/>\n&gt; system to extend the immaturity of our kids instead of letting them stay <br/>\n&gt; home and learn from their parents&#39; good work and responsibility of actions, <br/>\n&gt; and you have a perpetually self-replicating system of shiny, noisy, useless <br/>\n&gt; lives who need to be entertained every moment, because when they start to <br/>\n&gt; actually think and reflect, they end up running to the psychiatrist for <br/>\n&gt; something to get the &#39;voices&#39; out of their heads.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>That&#39;s a pretty long and frantic sentence.  <br/>\nThey have drugs for that! <br/>\n<br/>\n(I&#39;m joking, but not.)<br/>\n<br/>\nThe kind of stress that will come from that much eager frustration won&#39;t do <br/>\nyou or your kids any good either.<br/>\n<br/>\nYou live where you live.  Options are to move or to deal with it.  Dealing <br/>\nwith it by calling it Satan and living in opposition to it is a path taken by <br/>\nmillions, but they&#39;re not considered to be the cream of the intellectual <br/>\ncrop.  Then there&#39;s the stylish cynicism of assuming all others are ignorant <br/>\nand evil, and that&#39;s not a great  place for kids to play either.<br/>\n<br/>\n-=-How many roads do we need for people to go to jobs to create more jobs to <br/>\nsell more shiny, noisy crap that noone really needs?-=-<br/>\n<br/>\nI travel on city and federal roads to take Kirby to karate.  I use I-25 to <br/>\nvisit my mom and my sister.  <br/>\n<br/>\nPeople here very much WANT jobs to rent those very non-shiny little houses <br/>\nand apartments they like to live in.  And to buy things to put in them like <br/>\nbedding and food.  <br/>\n<br/>\n-=-The federal government does NOT represent everyone, they represent the <br/>\nmost votes, WHICH in the last several presidential elections, wasn&#39;t even a <br/>\nmajority of the VOTERS, let alone the people. In FACT, it is truthful to say <br/>\nthat whatever platform was elected, the MAJORITY of people DIDN&#39;T WANT IT ! -=<br/>\n<br/>\nNo matter who is elected, those bridges and interstate highways need to be <br/>\nmaintained.  That has been a major purpose of government for thousands of <br/>\nyears.  Water and sewer and transportation safety.<br/>\n<br/>\n-=-. It IS the exploitation of emotional responses in people that they don&#39;t <br/>\neven know they have-=-<br/>\n<br/>\nIt&#39;s good for people to experience a full range of emotional responses.  It&#39;s <br/>\nbiochemically healthy.  People shouldn&#39;t have emotional responses they didn&#39;t <br/>\nknow they had.  They should be exposed to literature, entertainment, stories, <br/>\nsights and sounds that induce joy, awe, fear, peace, humility, thrills, hope <br/>\nand hilarity.  Bummer if some kid finds it first in a commercial!  The <br/>\nparents should get them out more.<br/>\n<br/>\n-=-It gets to be &#39;evil&#39; when it is directed at children who don&#39;t know how to <br/>\ndiscern reason and emotional responses-=-<br/>\n-=-Add to that, the liberal kiss-butt education system which has created a <br/>\nsystem to extend the immaturity of our kids ...-=-<br/>\n<br/>\nKids grow at the rate they grow.  I don&#39;t think anything or anyone can extend <br/>\ntheir immaturity, but it&#39;s easy to blame things and situations for what is <br/>\nnatural in a child.  And it is easy for some parents, especially dads, to <br/>\nexpect more of children than they are emotionally and intellectually ready to <br/>\nunderstand.<br/>\n<br/>\nIt&#39;s possible to unschool without identifying an enemy.  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":27644,"nextTopicId":27788}}