{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":168777859,"authorName":"Paul Rathgeb","from":"Paul Rathgeb &lt;rock7555@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] about democracy in homeschooling and groups","postDate":"1091211117","msgId":97104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzMwMTgxMTU3LjMyMzQxLnFtYWlsQHdlYjUzNTA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFlZC4yNjhjMTViZS4yZTNiYjgwNUBhb2wuY29tPg=="},"prevInTopic":97082,"nextInTopic":0,"prevInTime":97103,"nextInTime":97105,"topicId":97082,"numMessagesInTopic":0,"msgSnippet":"Actually in a nut-shell I suppose my intent is to break the mold of the traditional held myths of democracy and to delve into the meaning of the d word,","messageBody":"<div id=\"ygrps-yiv-412661633\">Actually in a nut-shell I suppose my intent is to break the mold of the traditional held &quot;myths&quot; of democracy and to delve into the meaning of the &quot;d&quot; word, readily supported by those classic ideals. My other objective to those interested is to speak more on behalf of the consensus process that occurs in the home and community.Some questions in the wind... &quot;What works for you as an individual or within group settings?&quot; and &quot;What is this popular rhetorical word democracy really about?&quot; - &quot;Are families commonly democractically structured?&quot; <br/>\n <br/>\nBasically just would like to stir up a pool for discussion by the &quot;experts. As a student, unmarried and without children myself, I have many curiosities about family ideals and how this can relate on a community level and possible global... I greatly appreciate the feedback, it is very insightful and thought provoking. Peas! Paul<br/>\n<br/>\n<br/>\n<br/>\n&quot;The fate of the country does no depend on how you vote at the polls-the worst man is as strong as the best at the game;it does not depend on what type of paper you drop into the ballot box once a year, but on what kind of man you drop from your chamber into the street every morning.&quot;<br/>\n<br/>\nHenry David Thoreau<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"about democracy in homeschooling and groups","postDate":"1091198469","msgId":97082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlZC4yNjhjMTViZS4yZTNiYjgwNUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":97104,"prevInTime":97081,"nextInTime":97083,"topicId":97082,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/30/04 2:55:34 AM, rock7555@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1440723230\">In a message dated 7/30/04 2:55:34 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rock7555@...\">rock7555@...</a> writes:<br/>\n<br/>\n&lt;&lt; The next theme is on democracy at home and community. I am looking for <br/>\nsomeone to perhaps speak (write) on behalf of democracy (if or when it applies) <br/>\nat home or within homeschool groups. &gt;&gt;<br/>\n<br/>\nPaul, <br/>\nMaybe you can collect responses to what I&#39;m about to post, and publish the <br/>\ngood parts of those?   Or maybe someone here would love to write about the topic <br/>\nand could coordinate with Paul on the side, or maybe volunteer to write a <br/>\npost incorporating quotes from what&#39;s below (which might be worthless and <br/>\nexpendable) and (or only) the responses.<br/>\n<br/>\nWhen I ran an unschooling group, starting many years back and fizzling out <br/>\nfour years ago, it wasn&#39;t at all democratic.<br/>\n<br/>\n<br/>\nThe group had grown out of a playgroup of La Leche League families.  First <br/>\nphase was always at the same park (and I was a new member, not an organizer).  <br/>\nThose organizers fell away and those most regular wanted to change parks.  This <br/>\nwas pre-decent-e-mail and pre-webpage, and I used to pass out little booklets <br/>\nof maps (hand drawn and notated) to the next six or seven parks.  We called <br/>\nit &quot;Park Parties&quot; and &quot;The Park Explore.&quot;  After about a year, some of the <br/>\nnewer families started to complain about one park or another being too babyish or <br/>\ntoo dangerous for little kids, or too close to a road, or not enough shade.  <br/>\nBasically they wanted to stick to one park. &lt;g&gt;<br/>\n<br/>\nSo I had lived through a whole set of change with that group, but at least <br/>\nthere were kids my kids had hung out with through the whole time, and always <br/>\nsome new ones.<br/>\n<br/>\nFamilies with oldest kids Kirby&#39;s age got to the school-choice age and many <br/>\nchose school.  With another mom who had chosen homeschooling a year or two <br/>\nbefore, we decided to shift the focus to unschooling, and we made three rules <br/>\nbefore we advertised it.  The rules were based on our certain knowledge of what <br/>\nproblems had come before and they were:<br/>\n<br/>\nNo field trips<br/>\nNo officers<br/>\nNo discussing curriculum<br/>\n<br/>\nOf course that made us the defacto &quot;officers&quot; or enforcers, and we didn&#39;t <br/>\nmind, because if we were going to be there, and have the back-up plan and do the <br/>\ncontacting and reminding, we didn&#39;t want other people trying to turn it into a <br/>\n&quot;learning co-op&quot; or a curriculum-whining session.<br/>\n<br/>\nTo reinforce our intent, we called it &quot;The Goof Group.&quot;  Then we put little <br/>\nflyers with a map to the starting park, and the three rules, in several places <br/>\nwe thought people would be.  It took very quickly.<br/>\n<br/>\nIt was a strong group with sometimes 18 families, for several years (more on <br/>\nthe list, but that many attending).  Stayed at one park for a season, we had <br/>\nsome public-indoor-site rotation winters (didn&#39;t work so well, some families <br/>\ncomplained if there was food for sale, some complained if there was any <br/>\nexpense).  Eventually when we bought a big house, the meetings were at our house.  <br/>\nAfter a year and some of that, my boys had reached their frustration level.  It <br/>\nhad come to be us doing other families a favor by introducing them to other <br/>\nunschooling families and helping them have contacts.  We weren&#39;t benefitting <br/>\nanymore, there was a lot of cleanup (physical and social--handholding of members <br/>\nwho wish other members weren&#39;t just the way they were), a couple of people left <br/>\nbecause I said, &quot;No, really, if you want to do a field trip just announce it, <br/>\nbut it&#39;s not going to be a field trip of this group, and our family is <br/>\ndefinitely not going.<br/>\n<br/>\nEveryone had a list of all the other people&#39;s names and phone numbers and <br/>\nkids&#39; names and that was unbroken tradition since the third group back.    But <br/>\nothers wouldn&#39;t organize things, they would just whine at me to change policies <br/>\nand do it THEIR way.<br/>\n<br/>\nNot democracy.  It was me and Monica Cordova providing an opportunity that <br/>\nwas still a reason for us to get our kids together every week, and which helped <br/>\nsome unschoolers and lots of relaxed and eclectic homeschoolers who did have <br/>\ncurriculum problems and concerns but were wise enough not to tell us about them.<br/>\n<br/>\nAs to my family, we do something I consider to be much better than democracy. <br/>\n We built a freedom nest for our kids.  Who else could have?  <br/>\n<br/>\nI was in a discussion years ago among homeschoolers about the nature of <br/>\nfreedom.  Some said freedom is natural and god-given.  I disagree.  I think freedom <br/>\nis given and defended.   We have given our kids LOTS of freedom, but they <br/>\nhave it because we gave it to them.  And we have responsibilities (legal, moral) <br/>\nthat we still have to hold in mind, so if a child&#39;s free choices go beyond the <br/>\nboundaries of what the city/state/government allow, we (my husband and I) <br/>\nneed to do something.  First plan has always been to explain and reason and <br/>\npersuade.  That has worked in all but a handful of minor instances.  In those <br/>\ninstances, it becomes &quot;freedom denied,&quot; but those  have been about things like <br/>\nfirecrackers or other loud noise  too late at night and being out and about after <br/>\nmidnight when they were very young (city parks have &#39;closed&#39; hours, and it <br/>\ndoesn&#39;t matter if it&#39;s right by your house).<br/>\n<br/>\nSome people confuse freedom with anarchy, and choices with wild destruction.  <br/>\nFreedom has a context and boundaries.    Even when the earth was sparsely <br/>\npopulated  by a few small groups who might&#39;ve thought they were the only humans <br/>\nin the world, their freedom would be limited by the group&#39;s needs and safety <br/>\nconcerns, and by what other neighboring groups or species would allow.   Freedom <br/>\nto hike for miles alone gave lions the opportunity to exercise their freedom <br/>\nto eat you.<br/>\n<br/>\nSo in my two major experiences, I didn&#39;t set up a democratic system either <br/>\ntime.  I&#39;m a benign dictator, or a generous monarch or something.   My husband <br/>\nrarely vetoes plans or policies because he knew me for almost ten years before <br/>\nKirby was born and if he didn&#39;t trust me he wouldn&#39;t have stuck around, and <br/>\nanyway I&#39;ve always incluced him in the benefits of the (weird) designer life <br/>\nwe&#39;ve lived.<br/>\n<br/>\nLots of times it looks like democracy here, but it&#39;s more like individuals <br/>\nhaving options within the stated plan.<br/>\n<br/>\nIf we&#39;re wanting to go to a restaurant because we&#39;re on the road, we will <br/>\nfind a mutually agreeable place if we can.  Last road trip, we went into a KFC <br/>\nbecause Holly wanted macaroni and cheese, and the others were interested in <br/>\naccommodating her desire.  After Kirby and Marty already knew what they wanted, we <br/>\nfound they had no mac&cheese.  So we said, &quot;Oh, sorry, that was the thing we <br/>\ncame in for.  Sorry.&quot;  And we left in search of a mac&cheese place.   When we <br/>\ngot there it was way too crowded and the kids were very hungry, so we ate at a <br/>\nTaco Bell next door.     It wasn&#39;t the work of an evil dictator, but had it <br/>\nbeen &quot;democracy,&quot; we would have stayed at KFC because the group had made a <br/>\nmajority decision and our goal was accomplished once a restaurant was chosen.<br/>\n<br/>\nSo what we do is more consensus on mutual days, than democracy.<br/>\n<br/>\nBut there&#39;s another thing we do, and that is &quot;whose day is it?&quot;   If Holly <br/>\nneeds something from the store, her brothers are probably welcome to go (unless <br/>\nher real request was some alone time with a parent), but Holly gets the front <br/>\nseat, because it&#39;s her trip.    Yesterday was Kirby&#39;s birthday and he got <br/>\ndecisions weighted in his favor, if other factors were equal.  But that&#39;s a <br/>\nmanagement decision, too.  It&#39;s something my husband and I figured out was a <br/>\npeace-tool long ago.  There are precedence issues, and letting the oldest child have <br/>\nprecedence all the time is unfair and oppressive.   When we went to Holly&#39;s <br/>\ngirl scout presentation, it was a Holly night.  We left when she was ready, we <br/>\nwent to a restaurant she chose.   It was a freedom and privilege and power she <br/>\nhad because her parents gave it to her.  And the boys go along with that <br/>\nbecause they know they will have situations in which they are supported and <br/>\nfollowed by the rest of the family.<br/>\n<br/>\nSo I don&#39;t think I&#39;m a good one to write an article on democracy if the <br/>\nintent is to show democracy in its classic, idealized American-mythology form.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":96690,"nextTopicId":97106}}