{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] a possible resource, slightly off topic","postDate":"1077390786","msgId":91255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGQwMWMzZjhhZSRiYzU4MDk3MCQ2NTAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PDFhMS4yMGJkOTI2Ny4yZDY5MDIwNUBhb2wuY29tPg=="},"prevInTopic":91250,"nextInTopic":0,"prevInTime":91254,"nextInTime":91256,"topicId":91250,"numMessagesInTopic":0,"msgSnippet":"Daniel Pink was a former White House speech writer, for Al Gore, I believe. He wrote the book _Free Agent Nation_ which argues that self-employed free-agents","messageBody":"<div id=\"ygrps-yiv-198044982\">Daniel Pink was a former White House speech writer, for Al Gore, I believe. He wrote the book _Free Agent Nation_ which argues that self-employed free-agents are the workers of the new economy. He ends his book by looking at homeschooling as free-agent education, the model for educating free agents for the new economy. I don&#39;t really recall him addressing unschooling, just homeschooling in general.<br/>\n<br/>\nHe&#39;s speaking at this years Maryland Home Education Assoc. (MHEA) conference in April. It should be interesting. I&#39;d like to ask him if he&#39;s ever looked into unschooling and if it isn&#39;t closer to what he&#39;s getting at than school at home.<br/>\n<br/>\n--danielle<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"a possible resource, slightly off topic","postDate":"1077389317","msgId":91250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMS4yMGJkOTI2Ny4yZDY5MDIwNUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":91255,"prevInTime":91249,"nextInTime":91251,"topicId":91250,"numMessagesInTopic":0,"msgSnippet":"Here s something you might share with friends or relatives who think you re off the deep end.   it might be comforting just to keep and read, for people newer","messageBody":"<div id=\"ygrps-yiv-552683757\">Here&#39;s something you might share with friends or relatives who think you&#39;re <br/>\noff the deep end.   it might be comforting just to keep and read, for people <br/>\nnewer to unschooling too.<br/>\n<br/>\nI&#39;m going to look up &quot;folk schools&quot; and &quot;Daniel Pink,&quot; so though we don&#39;t <br/>\nneed to discuss all this stuff here (it&#39;s more shool reform than unschooling) I <br/>\ndid think it might be interesting to people here who are trying to clarify <br/>\nwhere unschooling falls on the spectrum.<br/>\n<br/>\nSandra  (from here down is from someone else)<br/>\n<br/>\n<br/>\n<br/>\n*************************************<br/>\n<br/>\nRELEASE  (EDUCATION)<br/>\n<br/>\n<br/>\n<br/>\nTHE CRITICAL THINKING & THE LIFE-LONG SELF-LEARNING MOVEMENT(S)<br/>\n<br/>\n<br/>\n<br/>\nThere is a &quot;Critical Thinking Movement&quot; in American universities that<br/>\n<br/>\nclosely parallels a recent White Paper, &quot;Life-Long Self-Learning Movement,&quot;<br/>\n<br/>\non K-12 innovations.   They seem to be saying the same thing,-- abandon the<br/>\n<br/>\ncurrent school systems and create a radically different universal learning<br/>\n<br/>\nsystem. <br/>\n<br/>\n<br/>\nUniversities across the country are recognizing that &quot;Americans can expect<br/>\n<br/>\nto change jobs as many as half a dozen times in their lives.&quot;  No amount of<br/>\n<br/>\nuniversity education, as now given, can provide the skills and knowledge<br/>\n<br/>\nrequired  for a long fullfiling and productive life.  Universities must<br/>\n<br/>\ntransform themselves to produce &quot;critical thinkers.&quot; They must cultivate<br/>\n<br/>\nopen minds, able to face any problem, economic, political, scientific, or<br/>\n<br/>\nsocial,  with balanced, critical, reflective judgement.  This does not mean<br/>\n<br/>\nabandoning the learning of,technical and scientific knowledge, nor the arts<br/>\n<br/>\nand humanities. It means aproaching all knowledge with a more questioning,<br/>\n<br/>\nwholistic, exploratory and less dogmatic mind. To recognize that most<br/>\n<br/>\ndecisions are made in a field of uncertainty requiring judgement and wisdom<br/>\n<br/>\nas much as reason and facts.<br/>\n<br/>\n<br/>\nThe difficulty universities are having in producing critical thinkers is, as<br/>\n<br/>\none professor puts it, &quot;that even 4 years of college only brings<br/>\n<br/>\ntraditional-age college students to a very low level of critical thinking<br/>\n<br/>\nand judgement.&quot;<br/>\n<br/>\n<br/>\nIt is hard to see how anyone could expect much better.  Young<br/>\n<br/>\npeople in K-12 schools are imbued with exactly the opposite mindset.<br/>\n<br/>\nAuthoritarian, undemocratic, hierarchal schools prepare<br/>\n<br/>\nstudents for an authoritarian, undemocratic hierarchal world.  Students are<br/>\n<br/>\ntaught to obey orders, work on schedule, and accept authority.  Nothing<br/>\n<br/>\ncould be more contrary to critical thinking.  It is clearly not only<br/>\n<br/>\nunreasonable, but also inefficient, to spend 12 years teaching people to<br/>\n<br/>\naccept order and control, and then 4 years attempting to erase that order<br/>\n<br/>\nand control mode from their minds.<br/>\n<br/>\n<br/>\nThese facts have been recognized in a White Paper on &quot;The Life-long<br/>\n<br/>\nSelf-learning Movement&quot; drated by an ad hoc group of citizens concerned with<br/>\n<br/>\nthe failure of the K-12 schools.  It points out that there are a host of<br/>\n<br/>\nactions aimed an producing a radically different learning system.<br/>\n<br/>\nHomeschooling, Charter Schools, Folk Schools, Vouchers, Democratics Schools,<br/>\n<br/>\nParent Directed Education, and many other learning innovations are replacing<br/>\n<br/>\nthe schools of the past.<br/>\n<br/>\n<br/>\nTogether these two movements show the need for a radically different<br/>\n<br/>\nlife-long learning system. We need to abolish the barriers between higher<br/>\n<br/>\nand lower education, as well as the barriers between real life and school<br/>\n<br/>\nlife at all levels.   This is the challenge facing all elements of our<br/>\n<br/>\ncurrent cultures.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; --------------------<br/>\n<br/>\n&gt; Notes:<br/>\n<br/>\n&gt; For more on THE CRITICAL THINKING MOVEMENT read &quot;Rethinking Thinking&quot; by <br/>\n </span></blockquote>Mark<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Clayton from the Oct. 14 issue of Christian Science Monitor on:<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.csmonitor.com/2003/1014/p18s01-lehl.html\">http://www.csmonitor.com/2003/1014/p18s01-lehl.html</a>&gt;<br/>\n<br/>\n<br/>\n&gt; For more on THE LIFE-LONG SELF-LEARNING MOVEMENT see the White Paper on:<br/>\n<br/>\n<br/>\n </span></blockquote>&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.creatinglearningcommunities.org/resources/Life-longLearning.pdf\">http://www.creatinglearningcommunities.org/resources/Life-longLearning.pdf</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n********************END RELEASE*********************************<br/>\n<br/>\n<br/>\n<br/>\nTHE WHITE PAPER<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n             THE lIFE-LONG SELF-LEARNING MOVEMENT<br/>\n<br/>\n<br/>\n       In the past three decades, there has been a growing movement to<br/>\n<br/>\nreinvent the way citizens learn and how young people are introduced into<br/>\n<br/>\nsociety. Homeschooling, charter schools, cyberschools, unschooling,<br/>\n<br/>\nlife-long learning, Waldorf schools, and Sudbury schools are just a few of<br/>\n<br/>\nthe elements of this movement. The movement has been growing exponentially<br/>\n<br/>\neach decade since 1980. It has become a challenge to the traditional<br/>\n<br/>\nschool/teach/educate system. Life-long learning has been promoted by<br/>\n<br/>\nmanagement guru Peter Drucker in &quot;Post Capitalist Society&quot; on one end of the<br/>\n<br/>\nspectrum and, on the other end, by Elise Boulding in &quot;Building Global Civic<br/>\n<br/>\nCulture,&quot; and by many scholars in between.<br/>\n<br/>\n       The bottom line in this movement is to provide the freedom,<br/>\n<br/>\nopportunity and resources for self-learners of all ages, with their families<br/>\n<br/>\nand in community, to choose to learn what they want, when they want and how<br/>\n<br/>\nthey want -- to self-learn.<br/>\n<br/>\n<br/>\nRECOGNITION<br/>\n<br/>\n<br/>\n       In spite of the rapid growth of this movement, it has drawn little<br/>\n<br/>\npositive attention from governments. Professional educators and their unions<br/>\n<br/>\nhave shown concern that the proliferation of homeschooling will draw funds<br/>\n<br/>\naway from the public school system. A few public school systems have<br/>\n<br/>\naccepted the challenge and established special programs to provide would-be<br/>\n<br/>\nhomeschoolers and other self-learners more autonomy within the public school<br/>\n<br/>\nsystem. Some have established parent-teacher programs that depend on<br/>\n<br/>\nparental involvement and give parents greater autonomy in the learning<br/>\n<br/>\nprocess. But, as parents are increasingly recognizing that personal liberty<br/>\n<br/>\nand private protection from control by majority rule applies to their<br/>\n<br/>\nchildren&#39;s learning, none of the existing systems have completely<br/>\n<br/>\nincorporated that concept. Nor do they fully meet the needs of our<br/>\n<br/>\ninformation society which requires a life-long learning system to provide<br/>\n<br/>\nfor each individual&#39;s continual learning processes, as detailed in the work<br/>\n<br/>\nof writers and thinkers from John Holt and Alfie Kohn to Daniel Pink and<br/>\n<br/>\nHoward Gardner, among so many others.<br/>\n<br/>\n       Foundations, likewise, have been slow to rise to the challenge and<br/>\n<br/>\nopportunity that is unfolding. The millions of dollars for public schools,<br/>\n<br/>\ncoming from all levels of government, is followed by millions more coming<br/>\n<br/>\nfrom private foundations. But little, if any, of this private funding is<br/>\n<br/>\navailable for the many non-public school experiments being undertaken. A<br/>\n<br/>\nsearch of the philanthropy databases with words like &quot;democratic shools,&quot;<br/>\n<br/>\n&quot;homeschooling,&quot; or &quot;deschooling&quot; comes up with no program in any<br/>\n<br/>\nfoundation. Whereas a search under &quot;schools&quot; or &quot;education&quot; comes up with<br/>\n<br/>\nmany thousands. Individual appeals to hundreds of foundations by &quot;homeschool<br/>\n<br/>\nsupport groups,&quot; &quot;learning co-ops&quot; and other forms of nonschool learning<br/>\n<br/>\ncommunities are regularly returned with the words &quot;this proposal does not<br/>\n<br/>\nfit into our current program of support.&quot;<br/>\n<br/>\n<br/>\nMOTIVATION<br/>\n<br/>\n<br/>\n       Motivations for moving toward self-learning and abandonment of<br/>\n<br/>\ntraditional public schooling are many. Perhaps the most prevalent is<br/>\n<br/>\nparental concern about the loss of control of the learning of young<br/>\n<br/>\nchildren. Many families want to take direct responsibility for their<br/>\n<br/>\ncurriculum, approach to learning, and the principles and values upon which<br/>\n<br/>\nthese are based. Some parents believe that the public school system instills<br/>\n<br/>\nvalues which run contrary to those of their family. Some are explicitly<br/>\n<br/>\nguided by their religious beliefs to direct the education of their children.<br/>\n<br/>\nOthers have had disturbing experiences with schoolyard bullies, unfeeling<br/>\n<br/>\nteachers, or misdirected bureaucracies. A few hold that government support<br/>\n<br/>\nis inherently controlling, and that their tax dollars are binding families<br/>\n<br/>\nto a failing system.<br/>\n<br/>\n      Self-learners are also influenced by education critics, philosophers<br/>\n<br/>\nand religious leaders. Some, like Ivan Illich, believe our current life,<br/>\n<br/>\nincluding school, is based on the principle of work now for future rewards.<br/>\n<br/>\nThey urge that schooling, and life, be convivial and vernacular. That is,<br/>\n<br/>\nthat learning and work should be carried out in joyful collaboration with<br/>\n<br/>\nfamily, friends and neighbors. And that it should be embedded in the local<br/>\n<br/>\nculture, ecology, and friendships.<br/>\n<br/>\n       With Paulo Friere, some see schools as perpetuating the socioeconomic<br/>\n<br/>\nrich/poor status quo and preventing the natural social evolution that would<br/>\n<br/>\noccur if future citizens were given more freedom to self-learn in their own<br/>\n<br/>\nfamilies, communities, and nature.<br/>\n<br/>\n       Following John Holt and others, many believe that every brain, that<br/>\n<br/>\nis every student, is unique and no two are prepared to learn the same thing<br/>\n<br/>\nat the same time in the same way. They believe that schooling is not an<br/>\n<br/>\nefficient way to learn, nor for future citizens to be introduced into<br/>\n<br/>\nsociety.<br/>\n<br/>\n       Most great philosophical traditions, including those embodied in<br/>\n<br/>\nGandhi, Tagore, Aurobindo and Krishnamurti, recognize a spiritual component<br/>\n<br/>\nto learning, teaching that knowledge is more than a way to get a job or<br/>\n<br/>\nscore well on a standardized test; that it is the purpose for living, it is<br/>\n<br/>\nbeing human. Rabindrnath Tagore started his learning community,<br/>\n<br/>\nSantiniketan, to transform the human mindset from self-interest, competition<br/>\n<br/>\nand materialism to mutual aid, cooperation, and the love of learning.<br/>\n<br/>\n       Growing out of a variety of personal, philosophical, educational, or<br/>\n<br/>\nreligious motivations, the life-long self-learning movement continues to<br/>\n<br/>\nexpand.<br/>\n<br/>\n<br/>\nPROOFS OF EFFECTIVENESS<br/>\n<br/>\n<br/>\n       It is impossible to measure the success of self-learning with tests,<br/>\n<br/>\ngrades, and scores. Perhaps the most interesting successes are found among<br/>\n<br/>\nthose learners who do not flourish in a traditional setting with standard<br/>\n<br/>\nmeasurements of success. These individuals are free to blossom in their own<br/>\n<br/>\nways and do -- anecdotal evidence abounds about happy and successful<br/>\n<br/>\nlearners who have traveled a nontraditional path to their own personal<br/>\n<br/>\nsuccess. <br/>\n<br/>\n       Self-learners are equally honored among our greatest leaders. Thomas<br/>\n<br/>\nEdison, George Washington, Abraham Lincoln, Abigail Adams, Benjamin<br/>\n<br/>\nFranklin, the Wright Brothers, Helen Keller, Albert Einstein, and Margaret<br/>\n<br/>\nMead are only a few of those who have learned without school. The newspapers<br/>\n<br/>\nare filled with stories of less well-known successes. Ryan Abradi, of Maine,<br/>\n<br/>\nshowed an interest in numbers at an early age, so his parents let him stay<br/>\n<br/>\nhome and self-learn; by age 10 he was working his way through second-year<br/>\n<br/>\ncollege calculus. Caitlin Stern of Haines, Alaska, stayed out of school and<br/>\n<br/>\nbecame a recognized expert by studying bald eagles in the wild. Jedediah<br/>\n<br/>\nPurdy, a self-learner from West Virginia, graduated summa cum laude from<br/>\n<br/>\nHarvard University; in 1996 he was selected as a Truman Scholar and as West<br/>\n<br/>\nVirginia&#39;s nominee for the Rhodes Scholarship. He then went on to Yale Law<br/>\n<br/>\nSchool and, in the meantime, wrote a best selling book.<br/>\n<br/>\n       The growth rate of self-learning is a partial measure of its success.<br/>\n<br/>\nFrom a few scattered homeschoolers in 1980, perhaps 20,000, the number has<br/>\n<br/>\ngrown, according to Newsweek Magazine, to over 200,000 in 1990, and into a<br/>\n<br/>\nbroad integrated network of an estimated 2,000,000 today.<br/>\n<br/>\n       Considerable research has shown that students learn much more easily<br/>\n<br/>\nwhen they self-learn. As long ago as 1930,  the &quot;8 Year Study&quot; of 30 special<br/>\n<br/>\nschools demonstrated that: &quot;The most effective schools used a different<br/>\n<br/>\napproach to learning.  Instead of organizing learning by subjects, they<br/>\n<br/>\norganized it around themes of significance to their students.&quot; There seemed<br/>\n<br/>\nto be an inverse relationship between success in college and formalized<br/>\n<br/>\neducation as opposed to student selected learning.<br/>\n<br/>\n       A recent Cornell University study confirmed this and showed that<br/>\n<br/>\nschooled children become &quot;peer dependent&quot; while those who learned with their<br/>\n<br/>\nparents have more self-confidence, optimism, and courage to explore. A Moore<br/>\n<br/>\nFoundation study of children of parents who had been arrested for truancy<br/>\n<br/>\nfound that their homeschooled children ranked 30 percent higher on standard<br/>\n<br/>\ntests than the average classroom child.<br/>\n<br/>\n       Providing possible insight into the reasons behind these successes, a<br/>\n<br/>\nUCLA project showed that the average schooled student receives 7 minutes of<br/>\n<br/>\npersonal attention a day but the self-learner receives from 100 to 300<br/>\n<br/>\nminutes of attention daily. Following this, a Smithsonian Report on genius<br/>\n<br/>\nconcluded that high achievement was a result of time with responsive<br/>\n<br/>\nparents, little time with peers, and considerable time for free exploration.<br/>\n<br/>\n       Standardized tests reflect self-learner success as well. Time<br/>\n<br/>\nMagazine reported that &quot;the average home schooler&#39;s SAT score is 1100, 80<br/>\n<br/>\npoints higher than the average score for the general population.&quot;<br/>\n<br/>\n       Dr. Lawrence M. Rudner, conducted a study in 1998 that included<br/>\n<br/>\n20,760 students in 11,930 families. He found that in every subject and at<br/>\n<br/>\nevery grade level (K-12), homeschool students scored significantly higher<br/>\n<br/>\nthan their public and private school counterparts. Some 25 percent of all<br/>\n<br/>\nhomeschool students at that time were enrolled at a grade level or more<br/>\n<br/>\nbeyond that indicated by their age. According to the study, the average<br/>\n<br/>\neighth-grade homeschooler was performing four grade levels above the<br/>\n<br/>\nnational average. The average ACT score was 21 out of a possible 36 for<br/>\n<br/>\npublic schooled children. It averaged 23 for self-learners. This qualifies<br/>\n<br/>\nthe average college-bound self-learner for the most prestigious<br/>\n<br/>\nuniversities.<br/>\n<br/>\n<br/>\nVISION<br/>\n<br/>\n<br/>\n       This movement is not only addressing the why, how, when and what all<br/>\n<br/>\ncitizens learn, but is also rebuilding the foundation for the society in<br/>\n<br/>\nwhich we all live. How we learn determines the kind of society we build.<br/>\n<br/>\nAuthoritarian, hierarchal, undemocratic schools prepare future citizens for<br/>\n<br/>\nan authoritarian, hierarchal, undemocratic society. A life-long learning<br/>\n<br/>\nsystem based in family, community, society and nature could be the<br/>\n<br/>\nfoundation for new democracies of freedom, equity and justice.<br/>\n<br/>\n       The movement continues to promote the concepts of life-long<br/>\n<br/>\nself-learning, in all its complexities, to a wider audience, to address<br/>\n<br/>\ncritics on the issues of accountability and credibility, and to promote<br/>\n<br/>\nsupport to help those working to bring their ideals to fruition.<br/>\n<br/>\n<br/>\n<br/>\n        *************END OF WHITE PAPER******************<br/>\n<br/>\n<br/>\nNotes:  <br/>\n<br/>\n<br/>\n&quot;Resources and Further Reading&quot; at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/LearningCommunities/files/Life-Long%20Learning\">http://groups.yahoo.com/group/LearningCommunities/files/Life-Long%20Learning</a><br/>\n<br/>\nand<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.CreatingLearningCommunities.org\">http://www.CreatingLearningCommunities.org</a>&gt;<br/>\n<br/>\n<br/>\nDiscuss:  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LearningCommunities-subscribe@yahoogroups.com\">LearningCommunities-subscribe@yahoogroups.com</a>&gt;<br/>\n<br/>\n<br/>\nDiscussion, Comments, or suggestions to:<br/>\n<br/>\n  &lt;LearningCommunities-subscribe @yahoogroups.com&gt;  or<br/>\n<br/>\n  Nance Confer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&gt;</div>","specialLinks":[]}],"prevTopicId":91242,"nextTopicId":91253}}