{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","replyTo":"LIST","senderId":"NiIDJQ8fQCCIqzRjxrXfanRw3HQr18zX9Z8Xr7C84OQ7OTiNfb6I0r0lNSWPH3ywUFwPYBTbBmk6Aur3k7yyUJ5B9aOmkOintiTSd2kO","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What Exactly Do You Do with Your Kids?","postDate":"987609682","msgId":19035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBHQlowMEFBMFdJQTM0QG10YTUuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":19034,"nextInTime":19036,"topicId":19035,"numMessagesInTopic":0,"msgSnippet":"... Sometimes (not often) they walk.  The requirements are that they help clean up messes they create and are polite to each other, us, pets, and guests","messageBody":"<div id=\"ygrps-yiv-989015930\">----------<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;Subject: [Unschooling-dotcom] Digest Number 1134<br/>\n&gt;Date: Wed, Apr 18, 2001, 8:17 AM<br/>\n&gt;<br/>\n<br/>\n&gt; what exatly does your family do on a daily basis and are your children<br/>\n&gt; required to help around the house? are they just free to run and have no<br/>\n&gt; requirements on them at all?<br/>\n<br/>\n </span></blockquote>Sometimes (not often) they walk. &lt;g&gt; The requirements are that they help<br/>\nclean up messes they create and are polite to each other, us, pets, and<br/>\nguests (that goes both ways, we are also expected to be polite to them;<br/>\nwe&#39;re working on the cats, who are not always polite ;). That pretty much<br/>\ncovers it here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;do they have wake and sleep times that are<br/>\n&gt; set?<br/>\n<br/>\n </span></blockquote>Only if we&#39;re going somewhere do I wake them up. Because they are still very<br/>\nyoung (6 and 3) and I&#39;m not comfortable with them roaming the house while my<br/>\nhusband and I are both asleep, I do sometimes send them &quot;to bed&quot; when I&#39;m<br/>\ngoing to bed -- but I&#39;m a night owl and rarely do they want to stay up later<br/>\nthan I do. I also remind them if we have some kind of earlier-than-usual<br/>\nwakeup time (on Tuesday and Wednesday mornings we have to be out of the<br/>\nhouse at 9 a.m., which doesn&#39;t sound early to &quot;normal&quot; folk, but is to us!<br/>\n&lt;g&gt;) so they can learn the cause-and-effect of stay up late, get up early,<br/>\nfeel cranky. At 35, I still stay up too late even if I know I&#39;m getting up<br/>\nearly, so I&#39;m not real militant about &quot;making them go to sleep&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  what about computer time and tv time is it regulated ?<br/>\n<br/>\n </span></blockquote>Nope. I&#39;m a Libertarian, the fewer regulations the better as far as I&#39;m<br/>\nconcerned. &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; how do you balance house keeping with everything else and are your children<br/>\n&gt; self motivated in any way to help with the house? if so how di they get that<br/>\n </span></blockquote>way?<br/>\n<br/>\nMine are not self-motivated. Yet. Or at least, rarely. Sometimes they<br/>\nsurprise me. I remind myself of two things: 1) If I want the house neat and<br/>\nthey don&#39;t, why should they do as much work as I do? and 2) I,<br/>\nPam-the-Organized, Plucky Girl Cleaner Who Feels Fussy if not Surrounded by<br/>\nOrder, didn&#39;t like chore lists and orders until I lived in my own house.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; at this point two of my older children would do nothing for the household<br/>\n&gt; at all and unless I continually remind and hound them about what I have<br/>\n&gt; asked for like watering the dogs or unloading the dishwasher, they will<br/>\n&gt; just play and do nothing instead they are 14 and 10 I think they should be<br/>\n&gt; able to help out around here without me asking.<br/>\n&gt; what are your veiws on all of this<br/>\n<br/>\n </span></blockquote>Well, regarding expectations I&#39;ll just quote the Maddeningly Sane Dr. Phil:<br/>\n&quot;How&#39;s that working out for you?&quot; &lt;g&gt; Some kids are messy. Some are neat.<br/>\nSome will do things without being asked, but the secret there is usually<br/>\nthat you have to STOP asking them, and wait for them to bloom into natural<br/>\nhousekeepers. This can be a long wait &lt;g&gt;. And if they aren&#39;t ever going to<br/>\nbe natural housekeepers (see my sister), you&#39;ll trip over their Legos until<br/>\nthey move out.<br/>\n<br/>\nHomeschooling is going to be messy. Especially unschooling. If they were in<br/>\nschool, you could clean the house in an hour or so, it would STAY CLEAN<br/>\n::Pam pauses to drool copiously, then sternly reminds herself that she&#39;ll<br/>\nmiss even the mess when her children are grown:: until they got home. Even<br/>\nTHEN, between homework, afterschool activities, dinner, bathtime, early<br/>\nbedtime, there wouldn&#39;t be TIME to make much mess, so it would still stay<br/>\npretty clean.<br/>\n<br/>\nSuch is not the homeschooler&#39;s life. &lt;g&gt; You can improve things by<br/>\ndecluttering, investing in bins, doing things like &quot;Power Cleaning&quot; as a<br/>\ngroup, with much singing, dancing and heck, go for prizes &lt;g&gt;) for 20<br/>\nminutes each morning and night (this should do for a quick pickup, vaccuum,<br/>\ndishes) and do the real housework yourself (toilets, laundry, mopping), or<br/>\nlet them earn extra money if they want it doing things &quot;above and beyond&quot;<br/>\nthe 20 minute segments.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I really need some insight as to attitudes  in other peoples homes not just<br/>\n&gt; what you beleive would be the idealistic way to unschool but how it is<br/>\n&gt; really going down in your own households!<br/>\n&gt; thank you for your help in advance<br/>\n&gt; I do not require any school type work from them, but do have alot of other<br/>\n&gt; controlls going on that I would like to learn to let go of!<br/>\n<br/>\n </span></blockquote>In my household, my husband and I have a home business and unschool. My kids<br/>\nhave a fairly busy activity schedule (dance, ice skating, French, play<br/>\nrehearsal, park day, Girl Scouts). Ideally, Wally and I try to get the<br/>\nupstairs excavated and one major upstairs chore done every morning; then we<br/>\ntry to get the downstairs excavated and one major downstairs chore done<br/>\nevery night. Realistically, we fall short as often as we succeed. We like to<br/>\nthink we&#39;re modelling Real Life in this regard. &lt;g&gt;<br/>\n<br/>\nPam</div>","specialLinks":[]}],"prevTopicId":19028,"nextTopicId":18799}}