{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"fun article on unschooling","postDate":"1014568097","msgId":5135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNy5jOGU4ZjYyLjI5YWE2ZWExQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5134,"nextInTime":5136,"topicId":5135,"numMessagesInTopic":0,"msgSnippet":"http://www.hsc.org/chs/chs00hndwrngrs.html It s better to look at it on the site, but for those who can t get to the internet, here s the text: The","messageBody":"<div id=\"ygrps-yiv-942269947\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hsc.org/chs/chs00hndwrngrs.html\">http://www.hsc.org/chs/chs00hndwrngrs.html</a><br/>\n<br/>\nIt&#39;s better to look at it on the site, but for those who can&#39;t get to the <br/>\ninternet, here&#39;s the text:<br/>\n<br/>\nThe Handwringers Column <br/>\n<br/>\n <br/>\nby Diane Kallas and Barbara Alward <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:handwringers@...\">handwringers@...</a> <br/>\n<br/>\nDear Handwringers, <br/>\n<br/>\nNext fall, my eldest child will be old enough for kindergarten, so the <br/>\npressure&#39;s on. The unschooling philosophy suits us - but I am becoming a <br/>\nlittle freaked by happenings in the news which indicate it&#39;s becoming more <br/>\ndifficult for homeschoolers to earn &quot;diplomas and other credentials&quot; (see <br/>\n&quot;Don&#39;t Let Credentials Get You Down&quot;, Mar.-April &#39;98, Home Education <br/>\nMagazine). We&#39;ve chosen homeschooling for the greater opportunity and <br/>\nenrichment it will allow our children. So any resulting impediment to their <br/>\nfuture life (i.e. COLLEGE) is a big worry. My question is: Do you think a <br/>\nprepackaged, accredited curriculum could serve as a tool used to dispel any <br/>\nadministrator&#39;s concern for the quality of our children&#39;s homeschooling <br/>\neducation? Or should I go ahead and spend all that extra cash we have laying <br/>\naround on baby chicks or more books from the F.U.N. catalog? <br/>\n<br/>\nDana Murguia <br/>\n<br/>\nDear Dana, <br/>\n<br/>\nYour child is just approaching the compulsory sentence and already you hear <br/>\nscary music on the soundtrack of your life? Is your career goal to be a <br/>\nbonafide handwringer? (Motto: &quot;Worry now, and beat the rush.&quot;) <br/>\nAs you make your way through the maze of life you are going to read all kinds <br/>\nof newsy things designed to send you into a tizzy of frivolous consuming. One <br/>\nday you will read that homeschoolers have a tough time getting into college <br/>\nthen the next day (same newspaper, same section, same page, same ad for your <br/>\nlocal tutoring center) you&#39;ll read another article that extols the ease with <br/>\nwhich homeschoolers get into college and how administrators are going door to <br/>\ndoor looking for homeschoolers who, as other articles will tell you and we <br/>\nall know, are self-starters, self-directed, self-esteemed, self-dressing, <br/>\nself-taught, self-motivated, self-defrosting and self-employed. Do these <br/>\nhomeschoolers even NEED college??? Then, on the same day you might come <br/>\nacross another article saying that scientists were wrong and the asteroid <br/>\nthey said couldn&#39;t possibly even come near our galaxy is headed smack dab for <br/>\nthe middle of California. See how quickly our center of gravity shifts? What <br/>\nwe are suggesting is–don&#39;t let the opinions of others determine how you want <br/>\nyour life and your kid&#39;s life to be. Would you prefer baby chicks pecking in <br/>\nyour bathtub next week or more paper stacked on your kitchen table? You <br/>\ndecide. Remember life is a mysterious process, fraught with twists and turns <br/>\nno matter how well we prepare. <br/>\n<br/>\nDon&#39;t give up worrying however. I personally believe that worrying makes life <br/>\nmuch more interesting than it really is. Worry is the Gymboree of the adult <br/>\nmind. Philosophic musing, spiritual contemplation, abstract reasoning–all <br/>\nthat just floats on through, but worry, anxiety and panic, well that&#39;s <br/>\nexciting stuff. Worry isn&#39;t a big problem if it only leads to impulse buying <br/>\nat the educational toy store. The problem comes if you take yourself too <br/>\nseriously and start imposing your panic on others. Forget it. Most children <br/>\nsucceed in life in spite of their parents&#39; ability or inability to worry. <br/>\n<br/>\nDana, please don&#39;t think that we handwringers are not taking your concern <br/>\nseriously. (We aren&#39;t, but don&#39;t think that). We handwringers believe in the <br/>\ncredo &quot;whatever works,&quot; shortened on alternate days to &quot;whatever.&quot; We admit <br/>\nto being committed unschoolers, we believe unschooling is a valid educational <br/>\nand lifestyle choice that we embrace from a generally prone position. We <br/>\nwouldn&#39;t for a minute try to discourage you from buying a curriculum <br/>\nadvertised in your favorite homeschooling magazine but we do have a few words <br/>\nof caution . . . <br/>\nI once paid about $275 for a curriculum that would have cost me about $57.95 <br/>\nif I had just gone out and bought the books myself but I was too smart to go <br/>\nout and buy a bunch of books I knew would just sit on the shelf collecting <br/>\ndust! When the curriculum arrived I thought, &quot;Gee, do I need to pay $275 so I <br/>\ncan say my kid is 5th grade material?&quot; No, I decided I didn&#39;t need to pay <br/>\n$275 to achieve this; I could just practice saying it in the bathroom mirror <br/>\na few times and send the curriculum back. Luckily the curriculum came with a <br/>\nmoney back guarantee and that money came in handy the next time we had to pay <br/>\nsome one to take some chickens off our hands. So don&#39;t give yourself one more <br/>\nthing to worry about Dana: Make sure you get a money back guarantee, postage <br/>\nincluded! <br/>\n<br/>\nGood luck, The Handwringers <br/>\n<br/>\nThe Handwringers, Diane Kallas of Davis and Barbara Alward of Atascadero <br/>\nbelieve that there is no problem too small to fret over. They go where no <br/>\nworriers dare to tread. Be brave, challenge them and send them something to <br/>\nworry about. Send all questions and worries to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:handwringers@...\">handwringers@...</a><br/>\n <br/>\nThis Handwringers Column is from a previous issue of the California <br/>\nHomeSchooler. To be one of the first on your block to get the current <br/>\nHandwringers Column, click here to join HSC and receive your very own copy of <br/>\nthe California HomeSchooler six times a year.</div>","specialLinks":[]}],"prevTopicId":5125,"nextTopicId":5137}}