{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Interesting Reading","postDate":"1046412653","msgId":59806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY2OURyZXM4NENwSUNGNVBORWswMDAxNGJjYkBob3RtYWlsLmNvbT4="},"prevInTopic":59755,"nextInTopic":0,"prevInTime":59805,"nextInTime":59807,"topicId":59755,"numMessagesInTopic":0,"msgSnippet":"... ","messageBody":"<div id=\"ygrps-yiv-1894692619\"><blockquote><span title=\"ireply\">&gt;From: &quot;mcole_1305 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mcole_1305@...\">mcole_1305@...</a>&gt;&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mcole_1305@...\">mcole_1305@...</a>&gt;<br/>\n<br/>\n </span></blockquote>&lt;&lt;I just wonder does anyone have any feedback on these situations?  Isnt <br/>\nthis in some way descriminating against my kids due to an educational choice <br/>\nthat is perfectly legal in our state?  It just kills me to see how hurt they <br/>\nare?  Any ideas?&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nFirst of all I think that&#39;s awful. Second of all, I would do whatever I <br/>\ncould to get your children doing what they would like without having <br/>\nanything to do with the school system. Do they want to hang out with kids <br/>\nand have a dance or picnic or party? Invite the kids to your house or plan a <br/>\nday at a park or beach or bowling alley, etc. I&#39;m sure there are many ways <br/>\nfor your kids to get together with their friends without doing it on school <br/>\ngrounds.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nHelp STOP SPAM with the new MSN 8 and get 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a></div>","specialLinks":[]},{"userId":101701686,"authorName":"mcole_1305 &lt;mcole_1305@yahoo.com&gt;","from":"&quot;mcole_1305 &lt;mcole_1305@...&gt;&quot; &lt;mcole_1305@...&gt;","profile":"mcole_1305","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Interesting Reading","postDate":"1046378443","msgId":59755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIzbHQ0YitvbzNlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":59806,"prevInTime":59754,"nextInTime":59756,"topicId":59755,"numMessagesInTopic":0,"msgSnippet":"Hi, I have been a member of the site for awhile, just setting back and reading.  I am a homeschooling mom of three boys 15,12,8.  I have enjoyed reading about","messageBody":"<div id=\"ygrps-yiv-285758086\">Hi, I have been a member of the site for awhile, just setting back <br/>\nand reading.  I am a homeschooling mom of three boys 15,12,8.  I have <br/>\nenjoyed reading about reading and the different views of <br/>\nhomeschooling vs unschooling and the various definitions of each.  I <br/>\nhazard to label us, each of my sons does it different and I try to <br/>\nwork with each of them in their own way.  We do buy some curriculum, <br/>\nbut I didnt choose it, the boys did.  They had a homeschooling friend <br/>\nthat used ACE Paces (at the time we were unschooling)and they wanted <br/>\nto try it.  So I ordered it, just a couple of paces of each subject <br/>\nand they used it.  I just left them alone.  When they were finished, <br/>\nthey went back to just reading and living but after awhile my middle <br/>\nson asked me to teach him to multiply and divide fractions.  I went <br/>\nthrough it with him and he said he would rather just get the Pace for <br/>\nit and do it that way.  We called them up and wallah!!!  he was <br/>\nworking on fractions.  We have continued along that path.  We do have <br/>\ncurriculum laying all over our house, but each of those is something <br/>\none of the boys have found. Some days they pick up something and use <br/>\nit, some days they dont.  They all ask their friends what they are <br/>\nworking on in school and try to make sure they know it better.  This <br/>\nis all of their own free will.  I have to say that still for my <br/>\nyounger two the day is made up mostly of playing.  They still play <br/>\nwar (both are Warcraft nuts) and explore outside ect.  I cant imagine <br/>\nour life any other way.  I work at home, I have a small hair salon in <br/>\nmy basement and the boys enjoy coming down and visiting with my <br/>\ncustomers or helping clean the tanning bed, make change or sweep <br/>\nhair.  We live in a very anti homeschool community though, and we <br/>\nhave been labled for our &quot;different&quot; lifestyle.  Recently our public <br/>\nschool refused to allow my son to go to a dance with a friend, they <br/>\nhave now decided to close all activities to allow only children <br/>\nenrolled in the district,even if they are invited and signed in <br/>\nbefore.  This is now adding stress to our way of doing things.The <br/>\nboys have never minded the questions or the lable for that matter, <br/>\nbut they are at the age that they want to do these things and I dont <br/>\nknow how to supplement or fix the problem.  I have to say that none <br/>\nof my children have ever caused any problems in any way.  They have <br/>\ngreat times with their friends at karate, youth group, ball games <br/>\nect.  Most adults comment about how well behaved they are and how <br/>\nself assured they seem.  I just wonder does anyone have any feedback <br/>\non these situations?  Isnt this in some way descriminating against my <br/>\nkids due to an educational choice that is perfectly legal in our <br/>\nstate?  It just kills me to see how hurt they are?  Any ideas?<br/>\n<br/>\nMelissa</div>","specialLinks":[]}],"prevTopicId":59720,"nextTopicId":59776}}