{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Peace, etc...","postDate":"1091898291","msgId":97405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZC4yODQwNDlmYi4yZTQ2NjViM0Bhb2wuY29tPg=="},"prevInTopic":97387,"nextInTopic":0,"prevInTime":97404,"nextInTime":97406,"topicId":97387,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/7/04 12:33:06 AM, sweetgypsiedncer@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-588623810\">In a message dated 8/7/04 12:33:06 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sweetgypsiedncer@...\">sweetgypsiedncer@...</a> writes:<br/>\n<br/>\n&lt;&lt; Maybe I just look at things differently.  I think there will be plenty of <br/>\nthings I never consider exposing my daughter to that she will find joy and <br/>\ninterest in.  There are probably things I don&#39;t know even exist out there.  I <br/>\nwill try to discover what I can, but I hope that as she grows she will search and <br/>\ndiscover on her own as well.  Isn&#39;t that what unschooling is partly about - <br/>\nlife long learning, seeking and searching without reproach or guilt, feeling <br/>\ncapable of learning and exploring new ideas and tasks, equiping our children for <br/>\nnew adventures every day of their lives? &gt;&gt;<br/>\n<br/>\nThe &quot;without reproach or guilt&quot; part is why I want to be more open with my <br/>\nkids than less.  I&#39;m protection my own emotional interests. &lt;g&gt;<br/>\n<br/>\nMarty wanted to play ice hockey this year, but he didn&#39;t want it so much that <br/>\nhe hung around the ice rink more.  We  had to ask him to wait a year for <br/>\nfinancial reasons.  He needs braces, starting in January (waiting, for financial <br/>\nreasons, until then).   Kirby will need his wisdom teeth out and we want to do <br/>\nthat while he&#39;s still on our insurance.<br/>\n<br/>\nHe played years ago when he was younger, and he might play in a year or two <br/>\nor five, and maybe after he doesn&#39;t live here.   So I don&#39;t feel guilty, <br/>\nbecause we got him lessons and bought him skates and I drove him lots, and still if <br/>\nhe wants to go and skate, he gets some friends and goes.  He&#39;s had exposure <br/>\nand opportunity.  It&#39;s extremely expensive here, as a sport goes.   If we were <br/>\nin Minnesota he could skate outside for free and play with friends.  Here it&#39;s <br/>\nquite over a hundred dollars a month, plus equipment.<br/>\n<br/>\nI think the guilt is when we know things exist that tSandra</div>","specialLinks":[]},{"userId":184936771,"authorName":"Ali Kat","from":"Ali Kat &lt;sweetgypsiedncer@...&gt;","profile":"sweetgypsiedncer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Peace, etc...","postDate":"1091838685","msgId":97387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODA3MDAzMTI1Ljc0NDU5LnFtYWlsQHdlYjIwNzAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwOTE4MTMyNjUuMzkzMTQuNTg3ODMubTNAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":97405,"prevInTime":97386,"nextInTime":97388,"topicId":97387,"numMessagesInTopic":0,"msgSnippet":"*****The kids find out that they have a talent for, or enjoyment of, riding, and maybe feel resentful that they missed out on years of being part of this","messageBody":"<div id=\"ygrps-yiv-783012541\">*****The kids find out that they have a talent for, or enjoyment of, riding, and maybe feel resentful that they missed out on years of being part of this culture.*****<br/>\n<br/>\n<br/>\nI kind of understand where you are coming from with this, but not sure I agree 100%.  Of course, I am only speaking from my viewpoint.  As an adult, I am frustrated and resentful that I &quot;missed out&quot; on years of being a part of the culture of things I was interested in as a child.  i.e. dance, art, music...  While my parents offered me some options, it was extremely limited and completely un-encouraged.  Those are the things I showed talent and interest in, and the things I resent that they never found SOME way for me to participate in - regardless their finances or opinions...  <br/>\n<br/>\nThe things I have discovered that I enjoy and like as an adult, but never had exposure to as a child, are things that I am excited to learn and discover on my own.  i.e. woodworking, crocheting, video games, poker, and pool...  I did not know much of anything about these things until my adult years.  I am eager to learn all I can, and find ways to feed my new &quot;passions&quot;.  I don&#39;t resent my parents for not exposing me to them as a child - though my father was an apparent card/pool shark in his younger days and a carpenter by trade.  They just weren&#39;t offered to me, but I can learn them now.  <br/>\n<br/>\nMaybe I just look at things differently.  I think there will be plenty of things I never consider exposing my daughter to that she will find joy and interest in.  There are probably things I don&#39;t know even exist out there.  I will try to discover what I can, but I hope that as she grows she will search and discover on her own as well.  Isn&#39;t that what unschooling is partly about - life long learning, seeking and searching without reproach or guilt, feeling capable of learning and exploring new ideas and tasks, equiping our children for new adventures every day of their lives?<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - 100MB free storage!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":97388,"nextTopicId":97411}}