{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Connections, Car Talk, &quot;The New Theory of Learning&quot;","postDate":"1138377437","msgId":111503,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFQzE5RTUzLTVCNTMtNDJGQS1BNjAxLTFEODcxQzU3ODQ3QUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":111502,"nextInTime":111504,"topicId":111503,"numMessagesInTopic":0,"msgSnippet":"The following is from the Car Talk site.  The link was sent to me by one of the fine unschooling moms from the AOL days,  MsTerrE (Nancy).   It s been","messageBody":"<div id=\"ygrps-yiv-1023419321\">The following is from the Car Talk site.  The link was sent to me by  <br/>\none of the fine unschooling moms &quot;from the AOL days, &quot; MsTerrE  <br/>\n(Nancy).   It&#39;s been sitting in my e-mail since before Christmas.   <br/>\nBusy season, busy January, sorry I&#39;m so behind in passing on the good  <br/>\nstuff.<br/>\n<br/>\nIf anyone here is having a hard time reaching some male person,  <br/>\nrelative, husband, maybe send this link:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cartalk.com/content/features/ATC/Education/r-rlast15.html\">http://www.cartalk.com/content/features/ATC/Education/r-rlast15.html</a><br/>\n<br/>\n<br/>\n<br/>\nThe text is below for those who don&#39;t like to follow links, and all  <br/>\nof this can be deleted by anyone not interested in reading stuff from  <br/>\nnon-unschooling parents.  I think it&#39;s wonderful, though.  (The bio  <br/>\nis fun, too, and illuminating, and touching, and inspiring.)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThe New Theory of Learning<br/>\n<br/>\nby Thomas L. Magliozzi<br/>\n<br/>\n<br/>\nA few people actually read my bio, in which I refer to the New Theory  <br/>\nof Learning. Some people asked, &quot;What is the New Theory of Learning?&quot;  <br/>\nWell, here it is.<br/>\n<br/>\nThis is not really a &quot;rant.&quot; In fact, it&#39;s one of the few topics that  <br/>\nI think I actually know something about. And it&#39;s not really new. The  <br/>\nproblem is that it&#39;s so old we seem to have forgotten it and been  <br/>\ncaught up in so-called &quot;modern&quot; methods of teaching.<br/>\n<br/>\nThe theory derives from many years of teaching experience. Nearly all  <br/>\nof this teaching has been to MBA candidates. But, since I wrote this  <br/>\n(about a year ago) I&#39;ve been noticing how even little kids learn, and  <br/>\nI&#39;m more and more convinced that the New Theory may apply at ALL  <br/>\nlevels of learning. Let me know what you think.<br/>\n<br/>\nPremise I: THE LITTLE RED SCHOOLHOUSE THEORY<br/>\n<br/>\nI was a college professor for decades, during which time I became  <br/>\nconvinced that education had not progressed much beyond the Little  <br/>\nRed Schoolhouse theory of learning. We put an expert in a roomful of  <br/>\npeople and the expert proceeds to tell them everything he knows.<br/>\n<br/>\nA major problem with this approach is that we ask people to sit and  <br/>\nlisten for long periods of time. Studies indicate that under such  <br/>\ncircumstances, we have an attention span of 20-30 minutes, and we  <br/>\nretain about 20 percent of what we hear. This so-called &quot;teaching&quot;  <br/>\ndoesn&#39;t result in much learning. It results in, maybe, someone  <br/>\nremembering enough to pass a test. It&#39;s not learning. It&#39;s passing a  <br/>\ntest. You walk away from the test and the valve in your brain opens  <br/>\nand POOF--out goes the information to make room for the subject of  <br/>\nthe next test. An old Chinese proverb offers some guidance here.<br/>\n<br/>\nTell me and I will surely forget.<br/>\nShow me and I might remember.<br/>\nBut make me do it, and I will certainly understand.<br/>\n<br/>\nListening does not lead to understanding; doing does lead to  <br/>\nunderstanding. Does the cobbler teach his son how to cobble by  <br/>\ntelling him about it? Does the doctor learn to perform appendectomies  <br/>\nby reading about them? No. They DO IT.<br/>\n<br/>\n From my own personal experiences, doing something does lead to more  <br/>\nlearning. Perhaps your experience bears this out as well.<br/>\n<br/>\nSo, the first element of the New Theory is that students must &quot;do&quot; as  <br/>\nopposed to sitting and listening.<br/>\n<br/>\nPremise II: ONLY REAL REALITY IS REALITY<br/>\n<br/>\nOf course, there are various teaching methods that allow &quot;doing&quot; (for  <br/>\nexample, in MBA programs we use cases and term projects).<br/>\n<br/>\nA word about cases (which I have used for nearly all my years of  <br/>\nteaching). The MBA case is an attempt to make the student &quot;do it.&quot;  <br/>\nBut it&#39;s a somewhat feeble attempt. First of all, because the student  <br/>\nvery soon learns how to analyze cases and to feed back to the  <br/>\ninstructor what s/he knows the instructor wants to hear. Secondly,  <br/>\ncases very soon get boring. Cases are dead, flat pieces of paper.  <br/>\nThey are an attempt to bring reality into the classroom, but they  <br/>\nfail because they are very poor substitutes for real reality. The  <br/>\nmedical intern may spend some time on cadavers, but would you want a  <br/>\ndoctor trained on cadavers to operate on your heart? Me either.<br/>\n<br/>\nThe second element of the New Theory, then, is this: If you&#39;re going  <br/>\nto DO it, you must do it with real people in real situations.<br/>\n<br/>\nSome may argue against this part of the theory on the following  <br/>\ngrounds. &quot;What happens to the syllabus?&quot; &quot;How can one predict that  <br/>\nthe real situation will offer all the opportunities for subject  <br/>\nmatter that the expert deems necessary for this course?&quot; The answer  <br/>\nis that you can&#39;t predict that it will. In fact, you can be pretty  <br/>\ndamned sure it won&#39;t. It will offer far more! One of the benefits of  <br/>\nREAL reality teaching is that it becomes--of necessity-- <br/>\nmultidisciplinary. You don&#39;t encounter issues that all &quot;fit&quot; into one  <br/>\ncourse. In MBA programs, for example, nearly all problems involve  <br/>\neverything: marketing, finance, organizational behavior, operations  <br/>\nresearch. You CAN&#39;T isolate anything. Everything depends on  <br/>\neverything else.<br/>\n<br/>\nPremise III: THE BACKWARDS LEARNING THEORY<br/>\n<br/>\nHere&#39;s a critical issue. People in the Little Red Schoolhouse  <br/>\nenvironment have little (or no) idea of why they should want to know  <br/>\nwhat the expert knows. In essence, we give them answers before they  <br/>\ncan really understand what the questions are. Sometimes, we tell them  <br/>\nwhat the questions are. But mostly, they have no real understanding  <br/>\nof the relevance of the questions to their lives. Example: &quot;Now I&#39;m  <br/>\ngoing to teach you how to read financial statements.&quot; They ask, &quot;Why  <br/>\nwould I want to know that?&quot; No matter how we answer, they interpret  <br/>\nit as, &quot;Because you will then be able to get a higher-paying job.&quot;  <br/>\nThis is supposed to motivate people to want to learn. It doesn&#39;t.  <br/>\nMotivation literature is very clear on this point. It tells us that  <br/>\nreal motivation doesn&#39;t derive from external rewards (like money or  <br/>\ngrades) but from intrinsic rewards (wanting to know and deriving  <br/>\nsatisfaction from, for example, solving a problem). Our current  <br/>\ntechniques motivate students to struggle to remember enough to pass  <br/>\nan exam.<br/>\n<br/>\nQuestion:<br/>\nWhy are we trying to teach people who don&#39;t really want to learn?  <br/>\nMotivation is the key. Of course, we know that some people are self- <br/>\nmotivated. They have a desire to learn everything and anything. We  <br/>\ndon&#39;t have to worry about them. But others need to know why they  <br/>\nshould listen to you or me. Most of the problem here is that people  <br/>\nare in colleges who don&#39;t belong in colleges. How the heck can an 18- <br/>\nyear-old kid know anything about anything--or more importantly, care  <br/>\nabout anything, besides the opposite sex? We fill up schools with  <br/>\nkids wasting their parent&#39;s money and looking for a place to  <br/>\nsocialize. There are better, less expensive, and more productive ways  <br/>\nto do that. But I digress.<br/>\n<br/>\nHere&#39;s what I&#39;ve noticed about the relationship between learning and  <br/>\nmotivation. Maybe you&#39;ve noticed it, too. Have you ever been faced  <br/>\nwith a problem like any of the following? Maybe you&#39;re trying to  <br/>\ndecide how to deal with a particularly difficult person. Or maybe  <br/>\nyou&#39;re staring at a pile of numbers and you don&#39;t know what the hell  <br/>\nit all means. Or, you&#39;re trying to decide whether to invest some  <br/>\nmoney in a company and you can&#39;t make sense of the financials. Or-- <br/>\nwhatever. It&#39;s a problem for which you WANT an answer.<br/>\n<br/>\nLet&#39;s take the first example--a difficult person--just to follow  <br/>\nthrough on what you might do. You simply don&#39;t understand why the  <br/>\nperson is behaving the way she is behaving. If you understood why,  <br/>\nyou might be able to figure out what to do. Faced with such a problem  <br/>\nyou might seek out an expert--someone who understands people&#39;s  <br/>\nbehavior. He might give you some insights. He might suggest that the  <br/>\nproblem really isn&#39;t unique. Lots of people act this way under  <br/>\ncertain circumstances. YOU MIGHT NOTICE THAT IN SUCH A SITUATION YOU  <br/>\nARE LISTENING VERY INTENTLY. QUITE UNLIKE THE WAY YOU LISTEN IN A  <br/>\nCLASSROOM. He, the expert, might even suggest some things you might  <br/>\nread to find out more. You can&#39;t wait to get to the library. You find  <br/>\nbooks, articles. You read.<br/>\n<br/>\nThink about HOW you&#39;re reading in this situation. Is it the same as  <br/>\nthe way you read textbooks when you were a student? It sure as hell  <br/>\nisn&#39;t. The difference is that you&#39;re INTERESTED in finding the answer.<br/>\n<br/>\nThink about it some more. What do you actually do under these  <br/>\nsituations? Do you read everything? No. You&#39;re looking for answers to  <br/>\nspecific questions. What happens is this. You look at a lot of books  <br/>\nand articles until you find something that seems relevant. You read  <br/>\nit. Something strikes a chord: maybe a word, maybe a theory, maybe a  <br/>\ndescription of a certain personality type that matches the one you&#39;re  <br/>\ndealing with. Now you go in search of more info on that personality  <br/>\ntype. You find more books. They lead you to more. And pretty soon,  <br/>\nyou know what to do and how to do it.<br/>\n<br/>\nWhile all this was happening, how might you have felt? Were you  <br/>\nsaying to yourself, &quot;God, I wish I didn&#39;t have to read all this?&quot; Did  <br/>\nyou yawn a lot? Did you ask, &quot;Why am I reading this?&quot; Hell no. You  <br/>\nprobably wished you had more to read. More people to answer your  <br/>\nquestions. You were--LEARNING!<br/>\n<br/>\nNotice what happened. You worked backwards. You started with the  <br/>\nproblem. A problem that you had a need or desire to solve. You  <br/>\nstarted somewhere--either with an expert or a book--and you went  <br/>\nwhereever it took you. And you went more than willingly; not with  <br/>\nsomeone dragging you, kicking and screaming. You went because you  <br/>\nwanted to go. Because you knew it was taking you where you wanted to go.<br/>\n<br/>\nSo here&#39;s the third element of the New Theory:<br/>\n<br/>\nWork backwards. Start with the problem and go wherever it takes you.<br/>\n<br/>\nThat&#39;s the theory that&#39;s been evolving for me over all my years of  <br/>\nteaching. Don&#39;t let an &quot;expert&quot; stand in front of people and tell  <br/>\nthem everything s/he knows. This is mostly just an ego trip for the  <br/>\nexpert, and a very boring experience for the victims. The overhead  <br/>\nprojector has done more to destroy learning than any other thing I  <br/>\ncan think of.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":111500,"nextTopicId":111510}}