{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":81476095,"authorName":"Julia Swancy","from":"Julia Swancy &lt;bleureves@...&gt;","profile":"bleureves","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"husbands, newbies, and quitting","postDate":"1143051988","msgId":24779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMzIyMTgyNjI4LjIyODc2LnFtYWlsQHdlYjUwODEyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDExNDI5MDI3NDguNDYwLjY0NDM3Lm0xOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":24778,"nextInTime":24780,"topicId":24779,"numMessagesInTopic":0,"msgSnippet":"welcome to all the newcomers! there is a lot of info to absorb when considering/beginning unschooling. it seems a lot of moms have differences of opinion with ","messageBody":"<div id=\"ygrps-yiv-640535031\">welcome to all the newcomers! there is a lot of info<br/>\nto absorb when considering/beginning unschooling. it<br/>\nseems a lot of moms have differences of opinion with<br/>\ntheir dh&#39;s on the unschool lists I am on, lol! in<br/>\naddition to john holt, another author to check out<br/>\n(for your own info as well as for your dh) is john<br/>\ntaylor gatto. some might also find alfie kohn<br/>\ninteresting, although I found his &quot;unconditional<br/>\nparenting&quot; to be a bit condescending. his &quot;punished by<br/>\nrewards&quot; is one that may be very relevant for a<br/>\nreluctant dh.<br/>\n<br/>\nthat article on quitting is truly fabulous! I used to<br/>\nberate myself for being &quot;lazy.&quot; I was in grad school<br/>\nworking on a phd in chemistry and hated doing<br/>\nresearch! I would avoid work in whatever way I could<br/>\nmanufacture. a very wise woman told me, &quot;we aren&#39;t<br/>\nlazy when we&#39;re doing what we want to do.&quot; when was<br/>\nthe last time you avoided doing something you love? I<br/>\nhave learned that laziness is merely the symptom of<br/>\ndoing something that I find uninteresting. for the mom<br/>\nin alaska (sorry I can&#39;t remember your name, I&#39;m on<br/>\ndigest and they all have run together now!), it sounds<br/>\nlike your dh might need some gentle support about not<br/>\nliking his job! it sounds like he feels stuck, and<br/>\nperhaps is resentful (those feelings often go together<br/>\nfor me!). it may not even be homeschooling that he is<br/>\nagainst; it may be his fears talking-- fear of it<br/>\ncosting more money (if you are going to stop working,<br/>\nfor instance) or some other fear-based expectation<br/>\nthat he has. you might try active listening with him<br/>\naround this (I have no idea how well he will respond,<br/>\nnot knowing him). ask him calmly, when you&#39;re not<br/>\nalready arguing about it, what it is about<br/>\nhomeschooling that he has concerns about. perhaps in a<br/>\nseparate conversation you might ask him about work--<br/>\nis it more stressful lately? what would he do if he<br/>\ncould pick any job in the world? why does he think he<br/>\ndoes not have the freedom to pursue that? just some<br/>\npossibilities here... it is important on many levels<br/>\nthat he feels included in the decision, even if your<br/>\ngoal is to convince him of your way, and even if you<br/>\nsucceed in doing so. he may have some valid concerns<br/>\nthat you haven&#39;t thought of! however it goes, dh needs<br/>\nto feel heard and needs his POV considered.<br/>\n<br/>\nI think, as others have said and implied, the litmus<br/>\ntest is the happiness of your children. if they seem<br/>\nwell-adjusted and generally happy, roll with it. you<br/>\nmentioned that your son doesn&#39;t socialize much; if he<br/>\nis content, it&#39;s probably just his personality,<br/>\nsomething your dh will benefit from learning to<br/>\naccept. this can be hard, as many adults were not<br/>\nallowed to be themselves as children (or as adults,<br/>\nfor that matter!). if, however, your son seemed to be<br/>\n*anti*social, or brooding, there might be something<br/>\nelse going on. but I doubt it has anything to do with<br/>\nhaving him in or out of school! as for the one who<br/>\nwants to stay in school, I agree with the post which<br/>\npointed out that you might be creating problems that<br/>\ndon&#39;t exist by pulling her out. &quot;if it ain&#39;t broke,<br/>\ndon&#39;t fix it!&quot; :D<br/>\n<br/>\njust take your time, and enjoy the ride!<br/>\n<br/>\nJulia</div>","specialLinks":[]}],"prevTopicId":24766,"nextTopicId":24780}}