{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":5047879,"authorName":"Joseph Fuerst","from":"&quot;Joseph Fuerst&quot; &lt;fuerst@...&gt;","profile":"jsf491","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] DC","postDate":"1034689918","msgId":46410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyOTkwMWMyNzQ1MiQwN2RhOTEyMCQxNGJlODQwYUB6b29tdG93bi5jb20+","referencesHeader":"PDNEQUJBRjk2LjIwN0BhZGVscGhpYS5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":46409,"nextInTime":46411,"topicId":46410,"numMessagesInTopic":0,"msgSnippet":"Alicia, What a terrifying situation for you to be in!  This situation seems like terrorism at its finest and I can t help but wonder whether the Al-quaida etc.","messageBody":"<div id=\"ygrps-yiv-80913561\">Alicia,<br/>\nWhat a terrifying situation for you to be in!  This situation seems like<br/>\nterrorism at its finest and I can&#39;t help but wonder whether the Al-quaida<br/>\netc.  might be a possibly involved.  Of course,  I suppose Al-quaida has<br/>\nbecome the face of terrorism for us and perhaps that possibity cloaks other<br/>\nterrorist types.<br/>\n<br/>\nI wish you and your family peace and courage.  I hope this mystery is soon<br/>\nsolved and this horror will be stopped<br/>\nSusan<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Mary, thanks for your kind thoughts.<br/>\n&gt;<br/>\n&gt; It&#39;s all real close to home for us. My sister was filling up her car with<br/>\n </span></blockquote>gas less than 10 minutes before the shooting of the cab driver at the Mobil<br/>\nstation in Aspen Hill. The shooting of the lady vaccuming out her car at the<br/>\nKensington Shell station was across the street from my sister&#39;s office, and<br/>\nthe lady who was shot on the bench in front of the Crisp and Juicy by<br/>\nLeisure World was the cousin of a friend of ours.  The Crisp and Juicy is a<br/>\ngreat Peruvian chicken place that we have gone to many times.  I go to the<br/>\nMichael&#39;s Craft Store at Spotsylvania Mall (Fredericksburg) all the time and<br/>\nwas planning to go to a seminar at the Holiday Inn Hotel right across the<br/>\nstreet the same Friday as the shooting, but opted to go to another event in<br/>\nRichmond instead.  My Mom lives about 15 minutes away from the Bowie middle<br/>\nschool where the 13 year old boy was shot.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On Wednesday night, my dh got bitten by a brown recluse spider at home and<br/>\n </span></blockquote>went up to our health care provider for treatment just a few minutes away<br/>\nfrom the Sunoco station where the engineer was shot and killed. I was out at<br/>\na meeting so DH took the boys with him. They were all in the area near<br/>\n<blockquote><span title=\"ireply\"> &gt; the shooting, but were never aware of what occured until they got home.<br/>\n </span></blockquote>(DH&#39;s spider bite is doing fine too, btw.)<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Our local county schools are on lock-down and there are sheriff deputies<br/>\n&gt; patrolling the grounds during school hours.  No one is allowed to play<br/>\n </span></blockquote>outside and all outdoor activities are cancelled, as are field trips to<br/>\nanywhere.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Even we homeschoolers are affected.  We had tickets to see the Lion King<br/>\n </span></blockquote>puppets at the Kennedy Center and that was cancelled. We haven&#39;t been<br/>\nletting the kids play out in the front yard, though we do allow the back<br/>\nyard since it is fenced and the children can&#39;t be seen from the street --<br/>\nand they have to get fresh air somehow! I try not to be out alone anywhere,<br/>\neven though that&#39;s my favorite way to get certain errands, like my weekly<br/>\nshopping, done. No more.  I get gas at stations that are farther away from<br/>\nthe interstate.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The perp&#39;s first targets are in an area that I know like the back of my<br/>\n </span></blockquote>hand<br/>\n<blockquote><span title=\"ireply\"> &gt; -- Rockville, Wheaton,  Aspen Hill, Kensington. I think the investigation<br/>\n&gt; will find that the attacker(s) originated from that area.  The routes are<br/>\n&gt; well-known to people who live in that area, but probably not known to<br/>\n </span></blockquote>outsiders. The perp has gone farther afield to prove that he&#39;s got a wider<br/>\nrange, but in each incident he&#39;s  been less than a mile from the<br/>\ninterstate -- Spotsylvania/Fredericksburg (I-95), Bowie (Rts. 50& 301,<br/>\nManassas (I-66).<br/>\n<blockquote><span title=\"ireply\"> &gt; The shooting just south of us on Friday really hit close to home as I<br/>\n </span></blockquote>drive the kind of vehicle (white Chevy AstroVan) that was being stopped in<br/>\nthe road blocks.  I haven&#39;t driven it much since, partially because we&#39;re<br/>\ntrying to minimize our trips to only essential errands and also because I<br/>\ndon&#39;t want the children to be upset when the police come up to our family<br/>\nvehicle with their guns drawn.  When I do go out, I make sure my drivers<br/>\nlicense and registration are on the dashboard before I leave the driveway.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; It&#39;s been pretty awful coping with the steady drip, drip, drip of stress<br/>\n </span></blockquote>and warily waiting, helpless, for the next shooting to occur.  We had a<br/>\nbreak in the weekend, but last night, another shooting in Falls Church.<br/>\nThis time in a covered parking lot, with lots of concrete pillars and the<br/>\nwoman victim was with her husband. She was doing all the things that police<br/>\nhave been telling us to do to keep safe.  I hope the perp is caught soon so<br/>\nwe can get our lives back to normal again. I refuse to be paralysed with<br/>\nfear, but I am a lot more cautious these days. The world keeps turning,<br/>\nright?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Thanks for letting me vent here!  At times it is very hard to keep a calm<br/>\n </span></blockquote>veneer for the sake of the children, so they will feel safe and free.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Alicia<br/>\n&gt; (from her hidey-hole)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt; If you have questions, concerns or problems with this list, please email<br/>\n </span></blockquote>the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner,<br/>\nHelen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; To unsubscribe from this group, click on the following link or address an<br/>\n </span></blockquote>email to:<br/>\n<blockquote><span title=\"qreply\"> &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":46258,"nextTopicId":46409}}