{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"kids in movie theaters [AlwaysLearning] Kids in Restaurants","postDate":"1313759830","msgId":62434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxNjRCNTRCLUEwMzktNEU2Ny05OTZBLTVBQTVFOUQ1NkE3OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTM2NzYwOTEuODU2ODkuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGoyaTJkZCtiajl0QGVHcm91cHMuY29tPiA8MTMxMzY3NjA5MS44NTY4OS5ZYWhvb01haWxOZW9Ad2ViODE1MDcubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":62425,"nextInTopic":0,"prevInTime":62433,"nextInTime":62435,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"-=-Gigi has been able to go wtih me and walk up and down the isle without anyone being bothered becase there was no one else but us or another family with","messageBody":"<div id=\"ygrps-yiv-1549734375\">-=-Gigi has been able to go wtih me and walk up and down the isle without anyone being bothered becase there was no one else but us or another family with little ones doing the same.<br/>\n Movies early in the day are awesome!-=-<br/>\n<br/>\nI hadn&#39;t thought of this for a while, but we used to sit in the front row when we had toddlers and young kids so they could play between us and the stage/screen, on the floor if they needed to.  If a baby or toddler got grumpy or talktative, I would carry him/her to the back corner and do the sit-on-hip, mom-wag thing.  Sometimes that was just amusing to them, sometimes it would get them sleepy.  If they were not to be consoled or distracted, I was right by the exit and could take them out to the lobby or the bathroom for a little distraction, drink of water from the fountain, look at posters, talk a bit, and go back in, still standing in the back.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Kids in Restaurants","postDate":"1313685986","msgId":62425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyamZsMitmamwyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyajc4Yys3YWdjQGVHcm91cHMuY29tPg=="},"prevInTopic":62422,"nextInTopic":62434,"prevInTime":62424,"nextInTime":62426,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"-=-Restaurants with adjoining gift shops are good for walking around while you re waiting, too - in the US, Cracker Barrel is a good example, but museums","messageBody":"<div id=\"ygrps-yiv-2001974416\">-=-Restaurants with adjoining gift shops are good for walking around while you&#39;re waiting, too - in the US, Cracker Barrel is a good example, but museums sometimes have cafes attached to the gift shop-=-<br/>\n<br/>\nThis reminded me of my son&#39;s favorite place to go with his grandparents--the restaurant at the local small airport. It is cute and airplane themed, but they would sit outside and watch the planes take off. They did this once a week for about two years. I think they started  with PB & J sandwiches in their car and then the restaurant.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":233098946,"authorName":"Lisa E Biesemeyer","from":"Lisa E Biesemeyer &lt;l.biesemeyer@...&gt;","profile":"l.biesemeyer@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Kids in Restaurants","postDate":"1313683609","msgId":62422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTM2ODM2MDkuMzg0MjguWWFob29NYWlsUkNAd2ViODM1MDQubWFpbC5zcDEueWFob28uY29tPg==","inReplyToHeader":"PGoyaTVqNStoYWxlQGVHcm91cHMuY29tPg==","referencesHeader":"PGoyaTVqNStoYWxlQGVHcm91cHMuY29tPg=="},"prevInTopic":62420,"nextInTopic":62425,"prevInTime":62421,"nextInTime":62423,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"-=In the same vein, there are all kinds of restaurants. You could choose a very casual one and go for a plate of fries, or something simple that they would ","messageBody":"<div id=\"ygrps-yiv-131324637\">-=In the same vein, there are all kinds of restaurants. You could choose a very <br/>\ncasual one and go for a plate of fries, or something simple that they would <br/>\nlike. Check out the restaurant without so much invested as a whole meal, with <br/>\nthe whole family in a different city where the only food you can get is at a <br/>\nrestaurant. That&#39;s a lot of pressure for a first experience if you are <br/>\nconcerned. Make it light and easy. You could try going out just for dessert.=-<br/>\n<br/>\nDiner style restaurants tend to be louder than other sit down casual type <br/>\nrestaurants and especially more boisterous than finer dining. My DD has never <br/>\nbeen the sit down and eat type of person, so we have not spent a lot of time in <br/>\nrestaurants. However, when we have gone, we enjoy diners quite a bit. And, if <br/>\nyou&#39;re traveling in the US, diners are much  easier to find. <br/>\n<br/>\n<br/>\nLisa B <br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Kids in Restaurants","postDate":"1313679242","msgId":62420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMEFCRTU2LUUzOEQtNDVDQS05M0ExLUYzQTA0RjFGOTdENUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoyajZwNStmMHVlQGVHcm91cHMuY29tPg==","referencesHeader":"PGoyajZwNStmMHVlQGVHcm91cHMuY29tPg=="},"prevInTopic":62419,"nextInTopic":62422,"prevInTime":62419,"nextInTime":62421,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"It can help to get food quickly, too.  When I was a kid, there were usually crackers on the table.  Nowadays no, but you might request an appetizer or dessert","messageBody":"<div id=\"ygrps-yiv-353443332\">It can help to get food quickly, too.  When I was a kid, there were usually crackers on the table.  Nowadays no, but you might request an appetizer or dessert as soon as they ask you for a drink order, so the kids aren&#39;t getting impatient and hungry.  Smelling other people&#39;s food can be an irritation for people too young to tell time or understand how long it takes to make food.   We have an apple pie story in our family. :-)  Don&#39;t make it so much food that they won&#39;t eat the protein parts when that comes.  Or there might be a protein appetizer.  But filling up on bread or chips can be bad for kids whose peace and thinking depend on protein.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Kids in Restaurants","postDate":"1313677388","msgId":62419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyajc4Yys3YWdjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyaTJkZCtiajl0QGVHcm91cHMuY29tPg=="},"prevInTopic":62418,"nextInTopic":62420,"prevInTime":62418,"nextInTime":62420,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"... ******************* Then it might be better to avoid formal restaurants. Go to family style places - maybe with a buffet, so it s perfectly reasonable","messageBody":"<div id=\"ygrps-yiv-1962224221\">&quot;sylviawoodman&quot; &lt;sylvia057@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Maybe they are still too young to go any place formal.  They both have lots of energy and have a hard time sitting still.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nThen it might be better to avoid &quot;formal&quot; restaurants. Go to &quot;family style&quot; places - maybe with a buffet, so it&#39;s perfectly reasonable for kids to get up and walk around a bit. Or find places with outdoor seating (if you&#39;re someplace with clement weather) - that can work even with somewhat more formal venues, if there&#39;s an exciting view (waterfront restaurants come to mind, but even a place that overlooks a construction site could work if you know something in the area). Restaurants with adjoining gift shops are good for walking around while you&#39;re waiting, too - in the US, Cracker Barrel is a good example, but museums sometimes have cafes attached to the gift shop, and there are bookstores with attached coffee shops and some high-end grocery stores have an eat-in area in the deli. And look for McDonald&#39;s with play-areas.<br/>\n<br/>\nIf you&#39;re going with friends or family, go to places where they are well known, good steady customers and can call ahead and make special arrangements. I have an aunt and uncle who love to treat us when we go visit, and when Mo was younger they arranged for her to have a tour of  the restaurant so she didn&#39;t have to sit while we waited for food. Another time they called and reserved a private dining room, so she could spread out her coloring books in an out-of-the-way corner. But they could do that because they were regular customers with a good reputation at that restaurant. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not to mention I like going to restaurants and would like to share this with them.  My question is how do I share with them what appropriate behavior is and isn&#39;t without having them tune me out or just decide that they don&#39;t want to go. <br/>\n </span></blockquote>****************<br/>\n<br/>\nWe go fairly regularly to small restaurants, coffee shops, and cafes where the service is quick so Mo doesn&#39;t have to wait and wait. Nowadays, we also look for places with free Wi-Fi so she can bring her DSi, but before then we would always pack some things for her to do - things she could do easily sitting at the table. We&#39;ve brought simple games like Boggle or Cosmic Cows and played them while waiting for food. <br/>\n<br/>\nThat&#39;s not to say you shouldn&#39;t help your kids know what the expectations are, but its a bit easier if those expectations aren&#39;t too much for them right from the start. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We had a situation recently where we were thinking about seeing a movie in a theater.  I told them a little about what to expect (lights will be dimmed, other people will be there, we will need to stay in seats and not talk...) and they decided that it wouldn&#39;t be fun<br/>\n </span></blockquote>********************<br/>\n<br/>\nYou could try going to a matinee when few other people will be in the theater. You could also make a big day of it - plan to go early and spend some time in the arcade playing games so they can burn off some steam before the film. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Kids in Restaurants","postDate":"1313676901","msgId":62418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyajZwNStmMHVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyaTJkZCtiajl0QGVHcm91cHMuY29tPg=="},"prevInTopic":62416,"nextInTopic":62419,"prevInTime":62417,"nextInTime":62419,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"We ve dined out a lot since Noor was very small (we even owned a bistro for a short while), and as others have suggested, having a bag of tricks is really","messageBody":"<div id=\"ygrps-yiv-134508351\">We&#39;ve dined out a lot since Noor was very small (we even owned a bistro for a short while), and as others have suggested, having a &quot;bag of tricks&quot; is really important! A few other games we&#39;ve played are a kind of Telephone, but where I&#39;ll trace something on the back or palm of Noor&#39;s hand and she&#39;ll either pass it on or try to guess what it is.  Paper and crayons are great, and small things to trace. You can do collective drawing--one person draws a squiggle/line/shape and then the next person adds to it.  These doodle books are a lot of fun:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Do-You-Doodle-Nikalas-Catlow/dp/0762429275\">http://www.amazon.com/Do-You-Doodle-Nikalas-Catlow/dp/0762429275</a><br/>\n<br/>\nIf the boys have iPods or other handhelds, and they can be used with headphones or without sound, that could be helpful.<br/>\n<br/>\nSmall toys, like little figures are good, especially if they&#39;re new and the kids haven&#39;t seen them before :-).  We always traveled with a few small surprises in my bag.<br/>\n<br/>\nI like what Sandra said about defining a space--our noise stays in the booth.  It can be really helpful for kids to &#39;see&#39; the limits.<br/>\n<br/>\nBooths are far easier to contain rowdy kids, in my opinion. There is something calming about cocooning up in a high-backed booth with your family. Maybe look online or call ahead to find restaurants with that kind of seating.<br/>\n<br/>\nAll kids are different, but with Noor, it has usually been best to talk about specific behavior requirements *briefly* a few days before an event and then not say anything else, unless she asked, until right before going into the situation--and then, kind of an a-b-c reminder.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Kids in Restaurants","postDate":"1313676091","msgId":62416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTM2NzYwOTEuODU2ODkuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGoyaTJkZCtiajl0QGVHcm91cHMuY29tPg==","referencesHeader":"PGoyaTJkZCtiajl0QGVHcm91cHMuY29tPg=="},"prevInTopic":62413,"nextInTopic":62418,"prevInTime":62415,"nextInTime":62417,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-208468300\">&lt;&lt;&lt;We had a situation recently where we were thinking about seeing a movie in a theater.  I told them a little about what to expect (lights will be dimmed, other people will be there, we will need to stay in seats and not talk...) and they decided that it wouldn&#39;t be fun and they would rather wait for it to come out on DVD&gt;&gt;&gt;&gt;<br/>\n <br/>\n <br/>\nWhere I live I can go to the movie with the kids and be the only family watching a movie! Sometimes there are a couple more with small  kids.<br/>\nI have even gone with my oldest to see movies other than kids movies and we were the only ones in there.<br/>\nGigi has been able to go wtih me and walk up and down the isle without anyone being bothered becase there was no one else but us or another family with little ones doing the same.<br/>\n Movies early in the day are awesome!<br/>\n Gigi now stays pretty much down and eats her popcorn. About six months ago she used to need to move a little. She is 5. MD has always sat quietly and  watched it all.<br/>\nI even took Gigi to adult movies during the day when she was a baby and she would just nurse and sleep. When MD was little there was a special  Mom&#39;s club movie session where you even had changing tables inside the movie theather so you could take a baby or young child and watch an adult movie. The light was a little less dim and the sounds were not so loud. It was special for moms that watned to watch and had babies or very young children.<br/>\nMaybe your movie theater is more child friendly than you think.<br/>\nI have a great theater that is very close to my house and they have great costumer service. One time Gigi was a little fussy and there were two other group of people and I did not want to bother them so they just let me come back another day to watch the movie.<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Kids in Restaurants","postDate":"1313646590","msgId":62413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFNENBN0ZFLjQwMjA5MDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGoyaTVqNStoYWxlQGVHcm91cHMuY29tPg==","referencesHeader":"PGoyaTVqNStoYWxlQGVHcm91cHMuY29tPg=="},"prevInTopic":62412,"nextInTopic":62416,"prevInTime":62412,"nextInTime":62414,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"... Few kids are ready to sit quietly and still in a restaurant without entertainment and distraction and support. We played a LOT of waiting games....not","messageBody":"<div id=\"ygrps-yiv-1576732446\">On 8/17/2011 9:48 PM, Joanna wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Plan a game to play like the alphabet game where each person takes a <br/>\n&gt; turn saying what they&#39;ll bring on the trip, starting with an A word, <br/>\n&gt; and then you have to try to remember what&#39;s been added each time. We <br/>\n&gt; had a lot of fun waiting for food playing that game when my kids were <br/>\n&gt; little.<br/>\n<br/>\n </span></blockquote>Few kids are &quot;ready&quot; to sit quietly and still in a restaurant without <br/>\nentertainment and distraction and support. We played a LOT of waiting <br/>\ngames....not just in restaurants, but also in doctor&#39;s offices, in line <br/>\nin the grocery store, etc.<br/>\n<br/>\nOther &quot;Waiting Games:&quot;<br/>\n<br/>\n  &quot;Follow the Leader&#39;s Face,&quot; just like follow the leader, except <br/>\ninstead of moving around you make faces  at each other and try to mimic <br/>\nthem.<br/>\n<br/>\n&quot;What Am I?&quot; Pick a category (animals, TV show characters, etc.) and <br/>\nstart describing something until your child guesses what or who you are. <br/>\n&quot;I&#39;m long and skinny, I have no arms or legs, I live in the earth, I <br/>\nwiggle . . .&quot;<br/>\n<br/>\n&quot;A worm!&quot;<br/>\n<br/>\nFling. Flang. Floo.<br/>\nA variation of Rock, Paper, Scissors. Each player takes either evens or <br/>\nodds. You say together &quot;Fling, flang, floo!&quot; and on &quot;floo&quot; each player <br/>\nputs out his hand with any number of fingers outstretched. Add up the <br/>\nfingers on both players&#39; hands and if it&#39;s an even number or an odd <br/>\nnumber, there&#39;s your winner.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Kids in Restaurants","postDate":"1313642917","msgId":62412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyaTVqNStoYWxlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyNUY3QTE2LUNCMjgtNDNGQS04Q0YyLTY0NTUxRDhBRDYzM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62411,"nextInTopic":62413,"prevInTime":62411,"nextInTime":62413,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"... You could also go to a cheap theater if you have one near you, to a movie they would like to see. That way, if it s not working for them you could just","messageBody":"<div id=\"ygrps-yiv-1427280217\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=- My question is how do I share with them what appropriate behavior is and isn&#39;t without having them tune me out or just decide that they don&#39;t want to go. -=-<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>You could also go to a cheap theater if you have one near you, to a movie they would like to see. That way, if it&#39;s not working for them you could just leave and there&#39;s not so much invested.<br/>\n<br/>\nIn the same vein, there are all kinds of restaurants. You could choose a very casual one and go for a plate of fries, or something simple that they would like. Check out the restaurant without so much invested as a whole meal, with the whole family in a different city where the only food you can get is at a restaurant. That&#39;s a lot of pressure for a first experience if you are concerned. Make it light and easy. You could try going out just for dessert.<br/>\n<br/>\nPlan a game to play like the alphabet game where each person takes a turn saying what they&#39;ll bring on the trip, starting with an A word, and then you have to try to remember what&#39;s been added each time. We had a lot of fun waiting for food playing that game when my kids were little.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kids in Restaurants","postDate":"1313641680","msgId":62411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNUY3QTE2LUNCMjgtNDNGQS04Q0YyLTY0NTUxRDhBRDYzM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoyaTJkZCtiajl0QGVHcm91cHMuY29tPg==","referencesHeader":"PGoyaTJkZCtiajl0QGVHcm91cHMuY29tPg=="},"prevInTopic":62410,"nextInTopic":62412,"prevInTime":62410,"nextInTime":62412,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"-=- My question is how do I share with them what appropriate behavior is and isn t without having them tune me out or just decide that they don t want to go.","messageBody":"<div id=\"ygrps-yiv-1747473209\">-=- My question is how do I share with them what appropriate behavior is and isn&#39;t without having them tune me out or just decide that they don&#39;t want to go. -=-<br/>\n<br/>\nAre they familiar with other places with expectations of not flying around loudly?  Hospitals?  Libraries?   Book stores?  Church?<br/>\n<br/>\nRequest to be seated away from quiet tables, maybe, but don&#39;t turn it into &quot;because we&#39;re not near others, we can be loud,&quot; just as an easier practice place.  I used to tell my kids that our noise shouldn&#39;t go outside our table or booth.  <br/>\n<br/>\n<br/>\n-=-We had a situation recently where we were thinking about seeing a movie in a theater. I told them a little about what to expect (lights will be dimmed, other people will be there, we will need to stay in seats and not talk...) and they decided that it wouldn&#39;t be fun and they would rather wait for it to come out on DVD. Maybe they are still too young to go any place formal. They both have lots of energy and have a hard time sitting still.-=-<br/>\n<br/>\nIf the movie is interesting and they have popcorn and you&#39;re sitting next to them and you&#39;re not sitting too close to other people, it might work.  You could say &quot;Whisper&quot; if they need to ask you something or say something.<br/>\n<br/>\nI think they will learn more from seeing how other people are acting than from a preparatory lecture making it sound very difficult and rules-filled.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":345817076,"authorName":"sylviawoodman","from":"&quot;sylviawoodman&quot; &lt;sylvia057@...&gt;","profile":"sylviawoodman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Kids in Restaurants","postDate":"1313639661","msgId":62410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyaTJkZCtiajl0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62411,"prevInTime":62409,"nextInTime":62411,"topicId":62410,"numMessagesInTopic":0,"msgSnippet":"I saw a discussion on Facebook earlier today that briefly touched on kids in restaurants.  My kids are 5 & 7 and have not been to a lot of restaurants.  Money","messageBody":"<div id=\"ygrps-yiv-1343450080\">I saw a discussion on Facebook earlier today that briefly touched on kids in restaurants.  My kids are 5 & 7 and have not been to a lot of restaurants.  Money was very tight for about 3 years so we cut out eating out.  When we did have a bit to splurge on restaurant food we either went out for breakfast in the morning when the kids were well rested or we brought take-out home if it was later in the day.  We are about to go away for several days and I think eating out is unavoidable.  Not to mention I like going to restaurants and would like to share this with them.  My question is how do I share with them what appropriate behavior is and isn&#39;t without having them tune me out or just decide that they don&#39;t want to go.  We had a situation recently where we were thinking about seeing a movie in a theater.  I told them a little about what to expect (lights will be dimmed, other people will be there, we will need to stay in seats and not talk...) and they decided that it wouldn&#39;t be fun and they would rather wait for it to come out on DVD.  Maybe they are still too young to go any place formal.  They both have lots of energy and have a hard time sitting still.<br/>\n<br/>\nThanks in advance!<br/>\n<br/>\nSylvia</div>","specialLinks":[]}],"prevTopicId":62421,"nextTopicId":62388}}