{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with food allergies","postDate":"1324893417","msgId":64637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpkOWdkOStvdTBiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4="},"prevInTopic":64586,"nextInTopic":0,"prevInTime":64636,"nextInTime":64638,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"===I worry that I m not doing enough to avoid a potentially fatal food allergy.=== I d be sure she understands the symptoms of an anaphylactic reaction, and","messageBody":"<div id=\"ygrps-yiv-277576911\">===I worry that I&#39;m not doing enough to avoid a potentially<br/>\nfatal food allergy.===<br/>\n<br/>\nI&#39;d be sure she understands the symptoms of an anaphylactic reaction, and knows to go immediately to an adult (if not with you) for help if she experiences any of those symptoms. My concern would be that she might have a serious reaction away from home, but having some epi-pens and Benedryl immediately available would ease that concern. My friend who has a daughter with a severe peanut allergy has a little fanny pack her daughter wears when away from home, and the pack has a couple epi-pens + some of the single dose packets of Benedryl -- if my son had food allergies, I&#39;d have something like that available for him.<br/>\n<br/>\nThat said, no allergy test is 100% accurate. If my son had a food come up positive on an allergy test and it was a food he wanted to continue to eat, I&#39;d suggest to him we remove it from his diet for a period of time and then reintroduce it and watch for any kind of reaction.<br/>\n<br/>\n===I worry that she&#39;s uncomfortable, but has gotten so accustomed to the phlegm that she doesn&#39;t realize she could feel better if we did something differently.===<br/>\n<br/>\nI&#39;m 46 and it was just this past summer that I pinned down some pretty expansive food allergies and intolerances that have wreaked havoc with my health all the way back into my teens. In all honesty, I don&#39;t know that I would&#39;ve quit eating the offending foods too many years sooner than I did, though. My various health problems got pretty intense before I figured out my food allergies/intolerances, and by that point I was very ready to take those foods out of my diet in exchange for better health. Some of the foods, I&#39;d already quit eating because the smell or taste grossed me out. But the most expansive allergies/intolerances (corn, corn derivatives, mold) are the foods I craved and ate often. Only after taking them out of my diet for a period of time and then reintroducing them was I able to experience such a noticeable difference in my health with and without them that I was ready to give up those foods in exchange for not having the side effects that came with eating them.<br/>\n<br/>\nI think someone already mentioned phlegm can be associated with asthma. My son&#39;s asthma was diagnosed because he began clearing his throat often and doing this short bark-type cough -- he&#39;s never had wheezing, but when his asthma flares up he is one phlegmy dude. And I didn&#39;t realize I&#39;d been suffering from asthma for as long as I had because I rarely had wheezing with it -- usually only when I did aerobics or ran, but not *always* when I did aerobics or ran. So you might do some reading up on asthma and find out if your daughter&#39;s experiencing any of the not-as-well-known symptoms. When I took the foods to which I&#39;m allergic and intolerant out of my diet, I quit having asthma and phlegm problems -- the asthma had gotten pretty bad, so I&#39;m thrilled to no longer be experiencing it and its side effects!<br/>\n<br/>\n===I worry there are other effects on her body we don&#39;t know about.===<br/>\n<br/>\nAs far as I know, the only way to know that for certain is to remove the potential allergen for a period of time (including any sources of potential cross-contamination) and then reintroduce it and see what changes she notices, internally and externally, and also emotionally. <br/>\n<br/>\nIf your daughter ever wants to try that, I would say to encourage her to tell you about *any* changes she notices, not just the ones people consider &quot;typical&quot;, and keep in mind some reactions can be delayed.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Help with food allergies","postDate":"1324434416","msgId":64586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPOXZ4Tnc2d3NIdkdqNFRobzNTYzRnVXFZYjBoUG90TVhyVTZwNFRCNE82Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpjcjNlZytwYjJiQGVHcm91cHMuY29tPg==","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4JPGpjcjNlZytwYjJiQGVHcm91cHMuY29tPg=="},"prevInTopic":64579,"nextInTopic":64637,"prevInTime":64585,"nextInTime":64587,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"... Roxana figured out for herself that red dye 40 is problematic for her. She gets blisters in her mouth and throat and also it causes her to feel emotionally","messageBody":"<div id=\"ygrps-yiv-1638888243\">On Tue, Dec 20, 2011 at 2:49 PM, dezignarob &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezignarob@...\">dezignarob@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And the child never gets the chance to make his or her own connections<br/>\n&gt; between eating something and any kind of internal reaction, and determine<br/>\n&gt; for him/herself whether the food is worth it.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Roxana figured out for herself that red dye 40 is problematic for her. She<br/>\ngets blisters in her mouth and throat and also it causes her to feel<br/>\nemotionally sensitive and cranky and teary.  She experimented with it quite<br/>\na few times, over years. She says she has felt &quot;unreasonably teary and<br/>\nemotional&quot; a number of times when she did not think she had ingested<br/>\nanything with that chemical in it, but when she went back and looked<br/>\ncarefully, it turned out there was something that had red dye even though<br/>\nit wasn&#39;t red and she hadn&#39;t suspected it. She was 20 or so when she<br/>\nfigured this out. She&#39;s experimented with it a lot and there is also a far<br/>\nless common yellow dye that causes the same reaction.<br/>\n<br/>\nI have mixed feelings. I wish we&#39;d known about it when she was younger<br/>\nbecause she&#39;s a very emotionally intense person anyway and this allergy<br/>\nprobably caused her to feel out of control more than she would have<br/>\notherwise.<br/>\n<br/>\nShe told me that, growing up, she didn&#39;t realize that other people did NOT<br/>\nalways have little blisters coming and going in their mouths - she never<br/>\ncomplained about it because it was mild and she&#39;d ALWAYS had it. So it is<br/>\nsomething she suffered from for her whole life.<br/>\n<br/>\nOn the other hand, it is a very specific reaction to one thing and wouldn&#39;t<br/>\nhave been that hard to mostly avoid it and, knowing myself, I would have<br/>\nbeen very casual about it and let her make her own decisions.<br/>\n<br/>\nI also have some allergies that cause blisters in my mouth and throat - raw<br/>\nwalnuts, eggplant, fresh pineapple, among others. I&#39;ve never noticed that<br/>\nthey have an impact on my emotions - but my reaction has always been strong<br/>\nto even a small amount of these in a food so I quickly spit it out and<br/>\nrinse my mouth, which means very little has ever gotten into my digestive<br/>\nsystem.<br/>\n<br/>\nAs a child who had some really obvious food allergies, my mom never once<br/>\nrestricted my diet, but offered me good alternatives that I appreciated. My<br/>\nsisters now remember that I&#39;m allergic to walnuts, in particular, and will<br/>\nbring no-walnut brownies or cookies to family gatherings, just to be nice<br/>\nto me.  Once in a while I buy lollipops at Whole Foods for Roxana because<br/>\nthey have no artificial colors or flavors in them.<br/>\n<br/>\nI was thinking that if we&#39;d blamed all of Roxana&#39;s emotional ups and downs<br/>\non allergies, she would not have learned to handle herself the way she does<br/>\ntoday. She was very emotional, quick to anger and needed to get quickly<br/>\naway from conflict for a while to settle herself down. If we&#39;d been blaming<br/>\nallergies, I wonder if our energy would have gone totally that direction<br/>\ninstead of helping her develop conflict resolution skills.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with food allergies","postDate":"1324421392","msgId":64579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjcjNlZytwYjJiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4="},"prevInTopic":64527,"nextInTopic":64586,"prevInTime":64578,"nextInTime":64580,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"===We saw a naturopath last year who did a blood draw, the results of which said Hazel had a true allergy (like potentially anaphylactic allergy) to milk and","messageBody":"<div id=\"ygrps-yiv-407799186\">===We saw a naturopath last year who did a blood draw, the results of<br/>\nwhich said Hazel had a true allergy (like potentially anaphylactic<br/>\nallergy) to milk and red meat. As well as sensitivities to wheat and<br/>\neggs.=====<br/>\n<br/>\nHaving only scanned the replies, maybe someone else has addressed this, but having a &quot;naturopath do a blood draw&quot;, is not the same as having an actual MD allergist do a full spectrum of allergy testing. <br/>\n<br/>\nRed meat will kill her? Really? Has she had any kind of immune response immediately after eating some red meat in the past? I mean wouldn&#39;t you have noticed this yourself? Is it wheat or is is gluten? If it&#39;s a lack of enzymes for gluten, she can take supplements for that and still enjoy the foods when she wants to.<br/>\n<br/>\nIf you really believe that some of your child&#39;s allergies have the potential to be fatal, perhaps a second opinion from a specialist would be a good idea. <br/>\n<br/>\nA medical diagnosis would not preclude incorporating the treatment plan from your naturopath. Sometimes it seems that alternative medicine practitioners do use the word &quot;allergic&quot; somewhat fuzzily, even when their advice about nutrition is helpful. <br/>\n<br/>\nSo is your daughter feeling better? Is her phlegm lessening? You have ruled out any kind of virus or bacterial infection already, right? <br/>\n<br/>\nJayn has a mild peanut allergy. If she accidentally gets some peanut, she feels sick, throws up, gets a few hives (this is the immune response part) around her mouth, and usually has a little nap. It has been years since she had any peanut, and she very early on took responsibility for asking if unknown foods contained any (eg Halloween). <br/>\n<br/>\nWe suspected that Jayn had this allergy the first time she ate peanut sauce on Thai food and had the reaction.(Of course I am very lucky that her allergic response is mild rather than anaphylactic.) Some months later she was handed a snack with peanut butter inside it by another child, and had the same reaction. So we knew for sure. (Luckily there are plenty of alternatives to peanut in the world. We love Cashew butter and sunflower seed butter.) <br/>\n<br/>\nAs an infant and toddler, she also would get some mild rashes on her torso, a classic sign of sensitivity to some foods, although it would have been tough to pinpoint which, and they didn&#39;t last or affect her play or emotions. (She has grown out of these by the way). <br/>\n<br/>\nI asked our ped about them. He said, yes she has some allergies. Then he said it would be better for us not to know to what, as they were evidently very mild and would certainly disappear in time. <br/>\n<br/>\nHe had seen the same thing that I have seen - some people seem to turn their whole relationship with their child into being about the allergies, discovering the allergies, controlling their food, seeing their child through the lens of these extremely minor issues, that can become huge, so that every time the child has some kind of emotion about something, it becomes a search to find the allergy culprit. <br/>\n<br/>\nPlus I notice that sometimes people who are being treated by naturopaths, instead of getting better through following the treatment, continually add more and more &quot;allergies&quot; to the list over time. <br/>\n<br/>\nKids get upset (maybe a toy broke) or excited (it&#39;s a birthday party!) or don&#39;t want to comply with some request (eg don&#39;t want to stop in the middle of a game), but hey, they didn&#39;t eat any of the verboten banana or what ever the food is...so they must have another hidden allergy, right, to explain the &quot;bad&quot; behavior? Off to the practitioner, to look at the diet again - and sure enough some other thing is discovered to which the kid is &quot;allergic&quot; - so more limits, more restrictions, and more opportunity for (mal)nutrition related health issues to surface.<br/>\n<br/>\nAnd the child never gets the chance to make his or her own connections between eating something and any kind of internal reaction, and determine for him/herself whether the food is worth it.<br/>\n<br/>\nThink hard before embarking on that slippery slope, eh?<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.blogspot.com</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with food allergies","postDate":"1324183348","msgId":64527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR0bXZHTCswUWYySk9ILW01MTBEaDhmaGE3R1RjdT1fMj1PVHRtb1prWkFhQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpjZG9nbyt0Zjc5QGVHcm91cHMuY29tPg==","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4JPGpjZG9nbyt0Zjc5QGVHcm91cHMuY29tPg=="},"prevInTopic":64457,"nextInTopic":64579,"prevInTime":64526,"nextInTime":64528,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"Just as a bit of FYI, My mother had a lot of allergies, many of which resulted in anaphylaxis. We learned a couple of tricks, the best of which is to keep","messageBody":"<div id=\"ygrps-yiv-1306432774\">Just as a bit of FYI,<br/>\nMy mother had a lot of allergies, many of which resulted in anaphylaxis.<br/>\nWe learned a couple of tricks, the best of which is to keep liquid benadryl<br/>\nhandy.  The dye free seemed to work quickest.  The liquid seems to start<br/>\nworking fastest.  You may also want to ask the doc for a dosing range that<br/>\nis safe for your daughter&#39;s weight.<br/>\n<br/>\nAlso, inflammation apparently has a role in allergic reactions.  Asthma can<br/>\nalso be a factor, even if it is not diagnosed.  A friend of mine is a<br/>\nbiologist and explained about proteins and various chemicals that our<br/>\nbodies create in response to  irritation or inflammation that is created<br/>\nwhen asthma is not well controlled (whether you feel like your breathing is<br/>\nokay or not) and how the presence of these chemicals will cause us to have<br/>\nhives or an anaphylactic reaction if we are exposed to something that will<br/>\nmake us produce more of these chemicals.<br/>\n<br/>\nIt is all very complicated.   If you are interested in natural<br/>\ninterventions, tumeric is a really potent anti-inflammatory herb and is<br/>\navailable in capsules.  It is also easy to add to many dishes without<br/>\nchanging anything except the color.<br/>\nChris<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with food allergies","postDate":"1323984216","msgId":64457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjZG9nbyt0Zjc5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4="},"prevInTopic":64454,"nextInTopic":64527,"prevInTime":64456,"nextInTime":64458,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"... My son went through a period when he was 8 where he was asking for milk constantly. He had never been much of a milk drinker before. I figured he was","messageBody":"<div id=\"ygrps-yiv-1266490182\"><blockquote><span title=\"ireply\">&gt;&gt;The phlegm is pretty constant and she tries to clear it in some pretty noisy unpleasant ways which definitely make people cringe sometimes when we&#39;re out in public.  We&#39;ve been working on more discrete ways for her to clear her throat, but really I&#39;d love to get to the root of it.&lt;&lt;<br/>\n<br/>\n </span></blockquote>My son went through a period when he was 8 where he was asking for milk constantly. He had never been much of a milk drinker before. I figured he was needing to tank up for a growth spurt. We noticed he was getting more and more congested and making some pretty disgusting throat clearing noises. He said he felt like he was choking on the mucus.<br/>\n<br/>\nI suggested cutting out the milk, but he wasn&#39;t interested. It went on for about 6 months, and then it stopped. I asked him if he thought there was less mucus or if he had just learned how to clear his throat without making the noises and he thought about it for a second and said, &quot;A little of both.&quot;<br/>\n<br/>\nHe stopped drinking so much milk on his own. Whether it was because the growth spurt was over or because he figured out it was the source of the phlegm is hard to say, but either way he was listening to his own body, and I think that&#39;s a very important skill for people to develop and/or hold onto.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We tried limiting those things for a week or so of our trip &lt;&lt;<br/>\n<br/>\n </span></blockquote>It&#39;s my understanding that you would have to eliminate milk (casein, etc.)  for three weeks to really clear the protein from her system. Not saying you have to do this. Just that &quot;limiting&quot; for a week or so won&#39;t really give you or your daughter much of an idea of whether or not it would help long-term.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We saw a naturopath last year who did a blood draw, the results of<br/>\n </span></blockquote>which said Hazel had a true allergy (like potentially anaphylactic allergy)&lt;&lt;<br/>\n<br/>\nThis next part is long and drawn out. Sorry. I promise I&#39;ll get to the part about how this relates to the goals of the list. I just think it&#39;s hard for scared parents of allergic children to take advice from parents that have never had to deal with it.<br/>\n<br/>\nI say this as the parent of a child with anaphylactic reactions ... allergy test results in the absence of reaction are not considered to be reliable, and it&#39;s my experience that pretty much any allergy is &quot;potentially anaphylactic.&quot; <br/>\n<br/>\nMy daughter has a cashew allergy. She has reacted at least three times and every time her acute reaction was managed well with benadryl. Then we deal with a few weeks of horrid eczema until all the protein clears her system. <br/>\n<br/>\nShe was too young to be involved in the decision at the time (18 mo old), but we (my husband and I) decided to avoid cashews themselves as well as mango and pistachio which are related, but to allow other tree nuts (against advice of allergist at the time). And I worry about her getting poison ivy as kids with cashew allergies tend to get hospital-bad reactions. <br/>\n<br/>\nNut allergies at the &quot;scary&quot; ones that everyone has heard of, but the only times I have had to sit with the epipen at the ready in case her breathing went south was to things to which she has a known allergy, but for which NO ONE would ever suggest the need to carry an epipen:<br/>\n<br/>\n1)after she pretty much rolled herself in cat dander (crawled under the bed after cats in a small apartment that housed three cats). My allergist acted like I was crazy, but I knew what I was looking at: Her face was puffed up, she was covered in hives, and her lips were starting to tingle. It was pretty scary for about 30 minutes, but benadryl did the trick.<br/>\n<br/>\n2)The other time ... well, we still don&#39;t know  definitively what it was that caused the reaction the other time ... She ate definitely-nut-free cake decorating gels and confetti that were loaded with food coloring and soy derivatives, but not much else. She has never reacted in any way to soy. And she has mood reactions to food coloring, so I suspect the colors. She ate a LOT of the gels after we finished decorating a batch of cupcakes and within 20 minutes she was throwing up, had diarrhea, and was covered head to toe in hives. Benadryl and oral steroids -- and watching her as she slept for hours to make sure her breathing wasn&#39;t compromised -- got her through that one.<br/>\n<br/>\nShe got hives after eating a single colored tootsie rolls on Halloween night this year. It worried me. I was afraid that a full jack-o-lantern of brightly colored candy would bring a full-on anaphylactic reaction again, and I offered to buy her candy or trade her for some from Whole Foods and Trader Joe&#39;s. She wasn&#39;t interested. She&#39;s almost 7. I think she&#39;s old enough to be involved in the decisions. So a week later (our trick or treating was postponed due to snow!!) when she plowed through her bag of candy eating all manner of crazy colors, I had the meds at the ready ... and ... nothing.<br/>\n<br/>\nDoes it mean she&#39;s not allergic to food coloring? No, I think she probably is. But I&#39;m suspecting there are lots of variables to the severity of allergic reactions. My brother-in-law reacts to shrimp, but only if he&#39;s also had beer or it follows an intense physical workout. I&#39;m guessing it&#39;s the same with my daughter and her reactions to food coloring.<br/>\n<br/>\nWith the poison ivy, which is rampant in our part of the country, we&#39;ve given her as much information as we can to prevent exposure. I don&#39;t want her to be afraid of being outside. She knows what poison ivy looks like, where it is in the yard and neighborhood. We&#39;ve talked about the best way to dress for playing in the woods, staying on paths especially if wearing shorts, how to undress and wash appropriately after potential exposure, and precautions to take to prevent exposure from clothing and tools. <br/>\n<br/>\nKeep in mind, the advice you get from your allergist is only theory. I know lots of people with allergic kids and each gets different advice: One allergist will say, &quot;Avoid all nuts&quot;; one will say &quot;Only avoid the specific nut to which you have a known allergy&quot;; and another will say &quot;traces help build immunity.&quot; <br/>\n<br/>\nNo matter what your parenting philosphy, you&#39;ve got to do what feels right and manageable to you. And your daughter is 7, so what feels right to her really needs to be included in that decision making process. <br/>\n<br/>\nMaybe away from a big, exciting, dairy-and-meet-filled trip, see if she wants to eliminate all dairy (and/or other potential allergens) for three weeks and see if she likes the way she feels. If she is truly allergic or intollerant, it could be affecting her in ways you can&#39;t see, too, and maybe she&#39;ll prefer to lay off the dairy, etc. for a while.  <br/>\n<br/>\nIf she&#39;s interested in the experiment, there are lots of GFCF blogs out there with great recipes that aren&#39;t so much trying to replicate the fluffy white bread you can get in the store, but new things that might be enjoyable to the whole family. You could even start trying recipes now so that if she does ever decide to avoid dairy, etc. it won&#39;t be so hard to make the changes.<br/>\n<br/>\nBut if she doesn&#39;t mind the phlegm and the bumps, I&#39;d just let her be and have the Benadryl, steroids and epipen on hand just in case.<br/>\n<br/>\nAnd maybe adding in omega 3s and probiotics -- regardless of what you both decide about any eliminations -- will help smooth out -- or even eliminate --  any reactions she may be having.<br/>\n<br/>\nGood luck,<br/>\nAngela in NJ<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Genevieve Raymond &lt;genevieve.raymond@...&gt; wrote:<br/>\n<br/>\n&gt; <br/>\n&gt; We saw a naturopath last year who did a blood draw, the results of<br/>\n&gt; which said Hazel had a true allergy (like potentially anaphylactic<br/>\n&gt; allergy) to milk and red meat. As well as sensitivities to wheat and<br/>\n&gt; eggs.  Geez.  This happened right before we left for a month long trip<br/>\n&gt; to Argentina.  Not a great time for a beef allergy diagnosis.  Or<br/>\n&gt; milk.  The ice cream In Argentina is amazing.<br/>\n&gt; <br/>\n (meaning<br/>\n&gt; *I* decided to limit them) but then it just sucked to see her<br/>\n&gt; disappointment as the rest of us happily ate our ice cream while she<br/>\n&gt; was stuck with sorbet.  Really delicious sorbet, but, still.  I<br/>\n&gt; figured I had the epi-pen, we&#39;d just risk it.<br/>\n&gt; <br/>\n&gt; Since then we haven&#39;t had any limits on anything despite the doctor&#39;s<br/>\n&gt; warning that the allergy is potentially fatal.  Eeks.  Part of it is<br/>\n&gt; that aside from the phlegm (which is present with or without meat and<br/>\n&gt; milk) she really hasn&#39;t ever shown any more troublesome sign of a<br/>\n&gt; reaction to to any of those foods.  And part of it is that I just hate<br/>\n&gt; telling her she can&#39;t have milk when the rest of us can.  And part of<br/>\n&gt; it is that I know food allergy testing is unreliable and bodies are<br/>\n&gt; always changing.  And I am (sometimes to a fault?) non-alarmist about<br/>\n&gt; my kids&#39; health.  Though I can occasionally be a bit of a<br/>\n&gt; hypochondriac about my own stuff.<br/>\n&gt; <br/>\n&gt; So I&#39;m looking for thoughts and advice on how to proceed.  I worry<br/>\n&gt; that the throat clearing has the potential to turn kids off and think<br/>\n&gt; she&#39;s gross.  I worry that I&#39;m not doing enough to avoid a potentially<br/>\n&gt; fatal food allergy.  I worry that she&#39;s uncomfortable, but has gotten<br/>\n&gt; so accustomed to the phlegm that she doesn&#39;t realize she could feel<br/>\n&gt; better if we did something differently.  (After her blood test came<br/>\n&gt; back, I actually realized I too have a pretty constant coating of<br/>\n&gt; phlegm in my throat that I&#39;ve just gotten so used to I don&#39;t notice it<br/>\n&gt; anymore).  I worry there are other effects on her body we don&#39;t know<br/>\n&gt; about.  I worry that I&#39;m worrying too much or not enough.<br/>\n&gt; <br/>\n&gt; I read a few posts from the archives, and one thought I had was just<br/>\n&gt; to make sure there are non-dairy/meaty/wheaty/eggy choices available<br/>\n&gt; always.  We do stock non-dairy milk but it&#39;s not often in the fridge<br/>\n&gt; right there next to the cow&#39;s milk for her to see.  I haven&#39;t been<br/>\n&gt; buying red meat and she usually chooses something other than a<br/>\n&gt; hamburger or red meat anyway when we&#39;re out.  Se loves eggs, and we<br/>\n&gt; have chickens, so eggs are a pretty big part of our lives.  And she&#39;s<br/>\n&gt; crazy for wheat.  Though we&#39;ve dabbled in gluten free baking and she<br/>\n&gt; likes some of that.  I just don&#39;t like the complexity of baking it.<br/>\n&gt; <br/>\n&gt; I really appreciate all the wisdom I&#39;ve gleaned on this list, and I<br/>\n&gt; thank you in advance for anything you might have to offer.<br/>\n&gt; <br/>\n&gt; Genevieve<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223034209,"authorName":"Genevieve Raymond","from":"Genevieve Raymond &lt;genevieve.raymond@...&gt;","profile":"genevieveraymond","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with food allergies","postDate":"1323983079","msgId":64454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PC0xMjQ5ODg4MDQ1MTIxMjcyMDUxQHVua25vd25tc2dpZD4=","inReplyToHeader":"PDEzMjM5ODIzMzkuMTg1ODkuWWFob29NYWlsTmVvQHdlYjEyMjUwOC5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4gPEJCMjY5NEU0LTc2QkEtNEMyMS1BNzVFLUU0OTEyRDI4MzcxOEBnbWFpbC5jb20+IDw0MzIzQUI5RC1BMTYwLTQ3OTUtQkEyNS00QUJBRjg0RjQ5MjlAU2FuZHJhZG9kZC5jb20+IDxFMDc1ODUxOC0xM0M5LTRDOUMtOTVGOC0wRUIxOTY0RjhDNDhAZ21haWwuY29tPiA8MTMyMzk4MjMzOS4xODU4OS5ZYWhvb01haWxOZW9Ad2ViMTIyNTA4Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":64452,"nextInTopic":64457,"prevInTime":64453,"nextInTime":64455,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"It s funny how when I think about it, I realize that Hazel really does *often* choose foods without dairy.  Or beef.  So maybe there is something to those","messageBody":"<div id=\"ygrps-yiv-163903436\">It&#39;s funny how when I think about it, I realize that Hazel really does<br/>\n*often* choose foods without dairy.  Or beef.  So maybe there is something<br/>\nto those blood tests.  BUT.  I like that *she* gets to choose what feels<br/>\nright to her.  Just now I offered her toast with cheese or with avocado and<br/>\nolive oil.  She chose the avocado.  Her stated favorite cuisines are<br/>\nChinese, Thai, and Indian.  Which have little to no dairy.  (Or wheat for<br/>\nthat matter.). She&#39;ll eat pizza, but she&#39;d prefer other foods to it.  I<br/>\nlike trusting that she&#39;s gonna figure it out.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 15, 2011, at 12:52 PM, Jenny Cyphers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenstarc4@...\">jenstarc4@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\n<br/>\n***But that is the tricky thing about allergies especially when discussing<br/>\nsevere allergies you never know what will be the breaking point.***<br/>\n<br/>\nThe breaking point for me happened when I was 31 and it had EVERYthing to<br/>\ndo with me not being allowed to listen to my own damn body from years of<br/>\npeople telling me what to eat and what not to eat!  I will NEVER do that to<br/>\nmy own kids never never never never!  I would rather my kids get a tummy<br/>\nache here or there or have diarrhea every once in a while because they&#39;ve<br/>\neaten something that doesn&#39;t agree with them but that they WANTED TO EAT!<br/>\n<br/>\n***maybe but at the time it was easier for me to eliminate it to get to<br/>\nbaseline when trying to pinpoint. ***<br/>\n<br/>\nI suppose it depends on how that&#39;s done.  The original poster already<br/>\nknows, already has that base line.  My sister did elimination diet after<br/>\nelimination diet with her kids.  Her kids were terrified of food, they were<br/>\nterrified of eating without their mother&#39;s approval.  She finally did a<br/>\ntest and guess what those kids were allergic to?  Garlic.  She tried<br/>\neliminating all these foods, but the food they couldn&#39;t have was in<br/>\neverything.  All those years of damage that can&#39;t be undone.  All those<br/>\nyears of those poor kids being told they couldn&#39;t have this or that thing<br/>\nthat they really wanted.  One of her kids stated for years that she didn&#39;t<br/>\nlike eggs and was forced to eat them.  Her allergy test said she was<br/>\nallergic to them.<br/>\n<br/>\nI didn&#39;t like what my sister was doing to her kids then and even now that<br/>\nshe knows and she has a baseline, it doesn&#39;t undo all the damage that was<br/>\ndone.  The means did not justify the end.  The kids are still afraid of<br/>\nfood and will have food baggage for years.  A chronic stuffy nose and &quot;off&quot;<br/>\nimmune system, didn&#39;t justify that.  Those kids might have naturally<br/>\navoided all the things they couldn&#39;t eat by being able to say &quot;no thanks&quot;,<br/>\nor &quot;sure, more of that please.&quot;<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with food allergies","postDate":"1323982760","msgId":64452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjM5ODI3NjAuNzAyNTAuWWFob29NYWlsTmVvQHdlYjEyMjUyMC5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGpjYXQwbStpZXIxQGVHcm91cHMuY29tPg==","referencesHeader":"PERBN0Q3QjFDLTgxODItNEVDQy1CMUMyLTNCMUIzRTc1REM0NEB2ZXJpem9uLm5ldD4gPGpjYXQwbStpZXIxQGVHcm91cHMuY29tPg=="},"prevInTopic":64451,"nextInTopic":64454,"prevInTime":64451,"nextInTime":64453,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"***Limiting your child because of test results when they re bodies aren t showing a true reaction can do far more harm than good, not just to your","messageBody":"<div id=\"ygrps-yiv-55584966\">***Limiting your child because of test results when they&#39;re bodies aren&#39;t showing a true reaction can do far more harm than good, not just to your relationship, but also to the very essence of health that you&#39;re trying to protect.***<br/>\n<br/>\n<br/>\nThis is sooo true!  It&#39;s worth repeating LOUDLY!<br/>\n<br/>\nTrue anaphylactic  responses to food are very rare.  I&#39;ve met one person in my whole life that had an anaphylactic reaction to dairy.  Most food allergies are more on the line of rashes, diarrhea, tummy aches, headaches, etc.  I live with a kid that has a peanut allergy.  We keep an epi pen around and keep peanut stuff away from her food. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with food allergies","postDate":"1323982339","msgId":64451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjM5ODIzMzkuMTg1ODkuWWFob29NYWlsTmVvQHdlYjEyMjUwOC5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PEUwNzU4NTE4LTEzQzktNEM5Qy05NUY4LTBFQjE5NjRGOEM0OEBnbWFpbC5jb20+","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4gPEJCMjY5NEU0LTc2QkEtNEMyMS1BNzVFLUU0OTEyRDI4MzcxOEBnbWFpbC5jb20+IDw0MzIzQUI5RC1BMTYwLTQ3OTUtQkEyNS00QUJBRjg0RjQ5MjlAU2FuZHJhZG9kZC5jb20+IDxFMDc1ODUxOC0xM0M5LTRDOUMtOTVGOC0wRUIxOTY0RjhDNDhAZ21haWwuY29tPg=="},"prevInTopic":64450,"nextInTopic":64452,"prevInTime":64450,"nextInTime":64452,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"***But that is the tricky thing about allergies especially when discussing severe allergies you never know what will be the breaking point.*** The breaking","messageBody":"<div id=\"ygrps-yiv-854639877\">***But that is the tricky thing about allergies especially when discussing severe allergies you never know what will be the breaking point.***<br/>\n<br/>\nThe breaking point for me happened when I was 31 and it had EVERYthing to do with me not being allowed to listen to my own damn body from years of people telling me what to eat and what not to eat!  I will NEVER do that to my own kids never never never never!  I would rather my kids get a tummy ache here or there or have diarrhea every once in a while because they&#39;ve eaten something that doesn&#39;t agree with them but that they WANTED TO EAT! <br/>\n<br/>\n<br/>\n***maybe but at the time it was easier for me to eliminate it to get to baseline when trying to pinpoint. ***<br/>\n<br/>\n<br/>\nI suppose it depends on how that&#39;s done.  The original poster already knows, already has that base line.  My sister did elimination diet after elimination diet with her kids.  Her kids were terrified of food, they were terrified of eating without their mother&#39;s approval.  She finally did a test and guess what those kids were allergic to?  Garlic.  She tried eliminating all these foods, but the food they couldn&#39;t have was in everything.  All those years of damage that can&#39;t be undone.  All those years of those poor kids being told they couldn&#39;t have this or that thing that they really wanted.  One of her kids stated for years that she didn&#39;t like eggs and was forced to eat them.  Her allergy test said she was allergic to them.<br/>\n<br/>\nI didn&#39;t like what my sister was doing to her kids then and even now that she knows and she has a baseline, it doesn&#39;t undo all the damage that was done.  The means did not justify the end.  The kids are still afraid of food and will have food baggage for years.  A chronic stuffy nose and &quot;off&quot; immune system, didn&#39;t justify that.  Those kids might have naturally avoided all the things they couldn&#39;t eat by being able to say &quot;no thanks&quot;, or &quot;sure, more of that please.&quot;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with food allergies","postDate":"1323981272","msgId":64450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjM5ODEyNzIuMTgzMzQuWWFob29NYWlsTmVvQHdlYjEyMjUxNC5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4=","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4="},"prevInTopic":64434,"nextInTopic":64451,"prevInTime":64449,"nextInTime":64451,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"***We saw a naturopath last year who did a blood draw, the results of which said Hazel had a true allergy (like potentially anaphylactic allergy) to milk and","messageBody":"<div id=\"ygrps-yiv-1602398314\">***We saw a naturopath last year who did a blood draw, the results of<br/>\nwhich said Hazel had a true allergy (like potentially anaphylactic<br/>\nallergy) to milk and red meat. As well as sensitivities to wheat and<br/>\neggs. Geez. This happened right before we left for a month long trip<br/>\nto Argentina. Not a great time for a beef allergy diagnosis. Or<br/>\nmilk. The ice cream In Argentina is amazing.***<br/>\n<br/>\n<br/>\nDoing an elimination on vacation is never a good idea!<br/>\n<br/>\nI am very allergic to dairy and beef!  The longer it&#39;s gone since I haven&#39;t eaten any, the more it sounds gross to me.  Even a very tiny nibble, crumb size, of cheese would make me really really sick.  I used to have a lot of phlegm, like you described.  I haven&#39;t had it since I stopped eating all beef and dairy.  All the other sensitivities could be because of beef and dairy.<br/>\n<br/>\nThat said, my youngest daughter has similar issues with beef and dairy.  She will still eat it sometimes.  Unlike me, she has never been forced to eat those things nor denied those things.  As a child, I was forced to eat beef and denied all dairy.  <br/>\n<br/>\nMargaux ate 5 grilled cheese sandwiches yesterday.  She rarely eats that much dairy and given past experiences, she won&#39;t likely eat any dairy for a couple of days.  If given the choice between a beef burger or turkey burger, she will ALWAYS choose turkey.  If given the choice of a cheese topping, she will most often choose no cheese.  She loves ice cream and we get it about once a month, she eats it up and deals with the tummy upset.  Non dairy options, she&#39;ll eat, but she likes the real deal better.<br/>\n<br/>\nWhat I see, is that she regulates her own intake of those things.  She either feels like eating it or she doesn&#39;t.  Her body naturally lets her know when she&#39;s had too much because it doesn&#39;t sound good to her.  She regularly turns down things with beef or dairy.  She will often choose chicken and green beans with rice, over pizza.  I honestly think if she didn&#39;t have the choice, pizza would sound very good to her all the time.  In an average week about a third of her meals will include any kind of dairy, maybe even less.  She has the option to eat as much as she wants, but she doesn&#39;t.<br/>\n<br/>\nThat&#39;s what kids do when they have a choice, they choose what sounds good to them and if it makes them sick, they will make the connection and choose something different.  A 7 yr old can do that.  A 2 yr old can do that, perhaps with a little extra help from mom and dad with available choices.  When Margaux was 2, it was really evident that dairy items made her sick, so we had all the same things in non dairy form, like ice cream and soy milk.  She always chose soy milk over regular milk and the non dairy ice cream over regular.  It wasn&#39;t until she was around 7 yrs old that she decided real ice cream was worth a bit of tummy pain and from that point onward she has chosen to eat some dairy.<br/>\n<br/>\nI wish I could have made those choices as a kid.  It&#39;s very likely that I could eat those things in moderation now, instead of complete avoidance.  I might have been able to listen to my body better and not ended up in the hospital with my whole body shut down and nonfunctional.  Kids will eat what they enjoy.  If they enjoy it, the positive association is far far better than any negativity that will arise from taking it away and calling it forbidden.  If it makes them sick, I promise, kids will listen to their bodies!  I&#39;ve seen it!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234407247,"authorName":"sandi_xander","from":"&quot;sandi_xander&quot; &lt;sandanista2000@...&gt;","profile":"sandi_xander","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with food allergies","postDate":"1323950185","msgId":64434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjY245OSs2Y2RpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4="},"prevInTopic":64418,"nextInTopic":64450,"prevInTime":64433,"nextInTime":64435,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"-=-one thought I had was just to make sure there are non-dairy/meaty/wheaty/eggy choices available always.-=- My son is allergic to chicken eggs but we","messageBody":"<div id=\"ygrps-yiv-129055866\">-=-one thought I had was just to make sure there are non-dairy/meaty/wheaty/eggy choices available always.-=-<br/>\n<br/>\nMy son is allergic to chicken eggs but we discovered recently that he has no problem with duck eggs.  We found ours at a farmers market but maybe, whether she&#39;s allergic or not, you&#39;d find it fun to start keeping ducks along with your chickens!<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Genevieve Raymond &lt;genevieve.raymond@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Joyce&#39;s recent post reminded me that I&#39;d love some help with some food<br/>\n&gt; sensitivities and possible allergies.<br/>\n&gt; <br/>\n&gt; My daughter Hazel is 7 and has, for the past couple of years produced<br/>\n&gt; a lot of phlegm in her throat.  She also has a bit of a rash --<br/>\n&gt; nothing red and flaring, just some pimply bumps -- on her cheeks.<br/>\n&gt; They come and go.  The phlegm is pretty constant and she tries to<br/>\n&gt; clear it in some pretty noisy unpleasant ways which definitely make<br/>\n&gt; people cringe sometimes when we&#39;re out in public.  We&#39;ve been working<br/>\n&gt; on more discrete ways for her to clear her throat, but really I&#39;d love<br/>\n&gt; to get to the root of it.<br/>\n&gt; <br/>\n&gt; We saw a naturopath last year who did a blood draw, the results of<br/>\n&gt; which said Hazel had a true allergy (like potentially anaphylactic<br/>\n&gt; allergy) to milk and red meat. As well as sensitivities to wheat and<br/>\n&gt; eggs.  Geez.  This happened right before we left for a month long trip<br/>\n&gt; to Argentina.  Not a great time for a beef allergy diagnosis.  Or<br/>\n&gt; milk.  The ice cream In Argentina is amazing.<br/>\n&gt; <br/>\n&gt; We tried limiting those things for a week or so of our trip (meaning<br/>\n&gt; *I* decided to limit them) but then it just sucked to see her<br/>\n&gt; disappointment as the rest of us happily ate our ice cream while she<br/>\n&gt; was stuck with sorbet.  Really delicious sorbet, but, still.  I<br/>\n&gt; figured I had the epi-pen, we&#39;d just risk it.<br/>\n&gt; <br/>\n&gt; Since then we haven&#39;t had any limits on anything despite the doctor&#39;s<br/>\n&gt; warning that the allergy is potentially fatal.  Eeks.  Part of it is<br/>\n&gt; that aside from the phlegm (which is present with or without meat and<br/>\n&gt; milk) she really hasn&#39;t ever shown any more troublesome sign of a<br/>\n&gt; reaction to to any of those foods.  And part of it is that I just hate<br/>\n&gt; telling her she can&#39;t have milk when the rest of us can.  And part of<br/>\n&gt; it is that I know food allergy testing is unreliable and bodies are<br/>\n&gt; always changing.  And I am (sometimes to a fault?) non-alarmist about<br/>\n&gt; my kids&#39; health.  Though I can occasionally be a bit of a<br/>\n&gt; hypochondriac about my own stuff.<br/>\n&gt; <br/>\n&gt; So I&#39;m looking for thoughts and advice on how to proceed.  I worry<br/>\n&gt; that the throat clearing has the potential to turn kids off and think<br/>\n&gt; she&#39;s gross.  I worry that I&#39;m not doing enough to avoid a potentially<br/>\n&gt; fatal food allergy.  I worry that she&#39;s uncomfortable, but has gotten<br/>\n&gt; so accustomed to the phlegm that she doesn&#39;t realize she could feel<br/>\n&gt; better if we did something differently.  (After her blood test came<br/>\n&gt; back, I actually realized I too have a pretty constant coating of<br/>\n&gt; phlegm in my throat that I&#39;ve just gotten so used to I don&#39;t notice it<br/>\n&gt; anymore).  I worry there are other effects on her body we don&#39;t know<br/>\n&gt; about.  I worry that I&#39;m worrying too much or not enough.<br/>\n&gt; <br/>\n&gt; I read a few posts from the archives, and one thought I had was just<br/>\n&gt; to make sure there are non-dairy/meaty/wheaty/eggy choices available<br/>\n&gt; always.  We do stock non-dairy milk but it&#39;s not often in the fridge<br/>\n&gt; right there next to the cow&#39;s milk for her to see.  I haven&#39;t been<br/>\n&gt; buying red meat and she usually chooses something other than a<br/>\n&gt; hamburger or red meat anyway when we&#39;re out.  Se loves eggs, and we<br/>\n&gt; have chickens, so eggs are a pretty big part of our lives.  And she&#39;s<br/>\n&gt; crazy for wheat.  Though we&#39;ve dabbled in gluten free baking and she<br/>\n&gt; likes some of that.  I just don&#39;t like the complexity of baking it.<br/>\n&gt; <br/>\n&gt; I really appreciate all the wisdom I&#39;ve gleaned on this list, and I<br/>\n&gt; thank you in advance for anything you might have to offer.<br/>\n&gt; <br/>\n&gt; Genevieve<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with food allergies","postDate":"1323904813","msgId":64418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxNDAwRURCLTZCNjItNDgwNy1BNDE1LUE4RDM4QTFBQUIwNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDg0NzJERUYzLTdBREItNEFGNS05MTc2LUU1RThDNEY0OTU4Q0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PERBN0Q3QjFDLTgxODItNEVDQy1CMUMyLTNCMUIzRTc1REM0NEB2ZXJpem9uLm5ldD4gPGpjYXQwbStpZXIxQGVHcm91cHMuY29tPiA8Q0FLTHNXWTVaZ1NpTmdnM3NBR0FnUjhvUFBKYTFOT0I3WFVWM3NQcE1wMVlDRU5uNDlBQG1haWwuZ21haWwuY29tPiA8ODQ3MkRFRjMtN0FEQi00QUY1LTkxNzYtRTVFOEM0RjQ5NThDQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":64417,"nextInTopic":64434,"prevInTime":64417,"nextInTime":64419,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"I left out a word.  Sorry.  Meant to say related TO a situation. ...one example of overdose and of compulsive behavior related to a situation was the story of","messageBody":"<div id=\"ygrps-yiv-769778007\">I left out a word.  Sorry.  Meant to say related TO a situation.<br/>\n<br/>\n...one example of overdose and of compulsive behavior related to a situation was the story of someone ...<br/>\n<br/>\nIt was compulsive behavior in response to emotional trauma.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with food allergies","postDate":"1323904584","msgId":64417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjM5MDQ1ODQuMzE4NjcuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDg0NzJERUYzLTdBREItNEFGNS05MTc2LUU1RThDNEY0OTU4Q0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PERBN0Q3QjFDLTgxODItNEVDQy1CMUMyLTNCMUIzRTc1REM0NEB2ZXJpem9uLm5ldD4gPGpjYXQwbStpZXIxQGVHcm91cHMuY29tPiA8Q0FLTHNXWTVaZ1NpTmdnM3NBR0FnUjhvUFBKYTFOT0I3WFVWM3NQcE1wMVlDRU5uNDlBQG1haWwuZ21haWwuY29tPiA8ODQ3MkRFRjMtN0FEQi00QUY1LTkxNzYtRTVFOEM0RjQ5NThDQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":64416,"nextInTopic":64418,"prevInTime":64416,"nextInTime":64418,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"Too much water is also called water poisoning. That is you drink so much water that it creates an imbalance in the electrolytes  and it affects brain function","messageBody":"<div id=\"ygrps-yiv-1637598990\">Too much water is also called water poisoning. That is you drink so much water that it<br/>\ncreates an imbalance in the electrolytes  and it affects brain function and heart.<br/>\nI know because my husband Brian once drank too much water when he was racing and he<br/>\nhad to go to the hospital. <br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Wednesday, December 14, 2011 5:08 PM<br/>\nSubject: Re: [AlwaysLearning] Re: Help with food allergies<br/>\n <br/>\n<br/>\n  <br/>\n-=-It&#39;s just been hard to let go of the doctor&#39;s voice in the back of my head<br/>\nsaying &quot;potentially fatal&quot;. -=-<br/>\n<br/>\nWhen I was taking psychology classes in college, one example of overdose and of compulsive behavior related a situation was the story of someone (a young woman) whose father died, and she started drinking water.  She drank water for three days or so, and died of too much water--water in her lungs, overloaded organs... and probably stress and panic.  But the physical cause was the water.<br/>\n<br/>\nSo water is certainly potentially fatal.  Drowning, choking, internal drowning, if that story is true.  Yet people have water at their houses and they rarely drown, choke on it or drink so much that their body ceases to function.<br/>\n<br/>\nCoca-cola is not like water, someone might say.  But it is much more like water than many other things are. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with food allergies","postDate":"1323904098","msgId":64416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0NzJERUYzLTdBREItNEFGNS05MTc2LUU1RThDNEY0OTU4Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBS0xzV1k1WmdTaU5nZzNzQUdBZ1I4b1BQSmExTk9CN1hVVjNzUHBNcDFZQ0VObjQ5QUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PERBN0Q3QjFDLTgxODItNEVDQy1CMUMyLTNCMUIzRTc1REM0NEB2ZXJpem9uLm5ldD4gPGpjYXQwbStpZXIxQGVHcm91cHMuY29tPiA8Q0FLTHNXWTVaZ1NpTmdnM3NBR0FnUjhvUFBKYTFOT0I3WFVWM3NQcE1wMVlDRU5uNDlBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":64415,"nextInTopic":64417,"prevInTime":64415,"nextInTime":64417,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"-=-It s just been hard to let go of the doctor s voice in the back of my head saying potentially fatal . -=- When I was taking psychology classes in college,","messageBody":"<div id=\"ygrps-yiv-1149981112\">-=-It&#39;s just been hard to let go of the doctor&#39;s voice in the back of my head<br/>\nsaying &quot;potentially fatal&quot;. -=-<br/>\n<br/>\nWhen I was taking psychology classes in college, one example of overdose and of compulsive behavior related a situation was the story of someone (a young woman) whose father died, and she started drinking water.  She drank water for three days or so, and died of too much water--water in her lungs, overloaded organs... and probably stress and panic.  But the physical cause was the water.<br/>\n<br/>\nSo water is certainly potentially fatal.  Drowning, choking, internal drowning, if that story is true.  Yet people have water at their houses and they rarely drown, choke on it or drink so much that their body ceases to function.<br/>\n<br/>\nCoca-cola is not like water, someone might say.  But it is much more like water than many other things are. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223034209,"authorName":"Genevieve Raymond","from":"Genevieve Raymond &lt;genevieve.raymond@...&gt;","profile":"genevieveraymond","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with food allergies","postDate":"1323893629","msgId":64415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS0xzV1k1WmdTaU5nZzNzQUdBZ1I4b1BQSmExTk9CN1hVVjNzUHBNcDFZQ0VObjQ5QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpjYXQwbStpZXIxQGVHcm91cHMuY29tPg==","referencesHeader":"PERBN0Q3QjFDLTgxODItNEVDQy1CMUMyLTNCMUIzRTc1REM0NEB2ZXJpem9uLm5ldD4JPGpjYXQwbStpZXIxQGVHcm91cHMuY29tPg=="},"prevInTopic":64414,"nextInTopic":64416,"prevInTime":64414,"nextInTime":64416,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"This article was great.  Thanks Brie. We never limited anything for very long, in part because the symptoms (phlegm, bumps) are manageable.  (I just asked","messageBody":"<div id=\"ygrps-yiv-441529922\">This article was great.  Thanks Brie.<br/>\n<br/>\nWe never limited anything for very long, in part because the symptoms<br/>\n(phlegm, bumps) are manageable.  (I just asked Hazel whether they bothered<br/>\nher, and she said no.)  And it just felt &quot;off&quot; as Joyce said.  So I think I<br/>\nwill just make an effort to have alternatives to potentially allergenic<br/>\nfoods readily available, in case that&#39;s what feels right for her at any<br/>\npoint.<br/>\n<br/>\nIt&#39;s just been hard to let go of the doctor&#39;s voice in the back of my head<br/>\nsaying &quot;potentially fatal&quot;.  Kind of like when I went to the head<br/>\nperinatologist of our insurance company saying I really wanted to try to<br/>\nhave a vaginal delivery for my breech twins, and he mentioned &quot;dead babies&quot;<br/>\nabout 5 times within the first 5 minutes of meeting him.  Ergh.<br/>\n<br/>\nGenevieve<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Dec 14, 2011 at 11:21 AM, sheeboo2 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brmino@...\">brmino@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ---So, if you hadn&#39;t gone to the doctor, you&#39;d never know she had something<br/>\n&gt;<br/>\n&gt; potentially fatal because there are no symptoms? (Except the bumps?)<br/>\n&gt;<br/>\n&gt; There&#39;s something off there.-----<br/>\n&gt;<br/>\n&gt; A few years ago, my husband&#39;s cousin was put through a Child Protective<br/>\n&gt; Service investigation when she brought her then three-year-old son into the<br/>\n&gt; hospital ER and the doctors concluded he was malnourished. She&#39;d been<br/>\n&gt; feeding him a very limited diet of rice and raw fruits because she had been<br/>\n&gt; told that he tested positive for so many food allergies.<br/>\n&gt;<br/>\n&gt; Upon further testing and food trials by the hospital, it turned out that<br/>\n&gt; his only real allergy was to milk.<br/>\n&gt;<br/>\n&gt; Limiting your child because of test results when they&#39;re bodies aren&#39;t<br/>\n&gt; showing a true reaction can do far more harm than good, not just to your<br/>\n&gt; relationship, but also to the very essence of health that you&#39;re trying to<br/>\n&gt; protect.<br/>\n&gt;<br/>\n&gt; Here&#39;s an article I remember reading at the time that was helpful:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2009/02/03/health/03well.html\">http://www.nytimes.com/2009/02/03/health/03well.html</a><br/>\n&gt;<br/>\n&gt; Brie<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with food allergies","postDate":"1323890518","msgId":64414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjYXQwbStpZXIxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PERBN0Q3QjFDLTgxODItNEVDQy1CMUMyLTNCMUIzRTc1REM0NEB2ZXJpem9uLm5ldD4="},"prevInTopic":64412,"nextInTopic":64415,"prevInTime":64413,"nextInTime":64415,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"... potentially fatal because there are no symptoms? (Except the bumps?) There s something off there.----- A few years ago, my husband s cousin was put through","messageBody":"<div id=\"ygrps-yiv-1312901592\">---So, if you hadn&#39;t gone to the doctor, you&#39;d never know she had something<br/>\npotentially fatal because there are no symptoms? (Except the bumps?)<br/>\n<br/>\nThere&#39;s something off there.-----<br/>\n<br/>\nA few years ago, my husband&#39;s cousin was put through a Child Protective Service investigation when she brought her then three-year-old son into the hospital ER and the doctors concluded he was malnourished.  She&#39;d been feeding him a very limited diet of rice and raw fruits because she had been told that he tested positive for so many food allergies.<br/>\n<br/>\nUpon further testing and food trials by the hospital, it turned out that his only real allergy was to milk.<br/>\n<br/>\nLimiting your child because of test results when they&#39;re bodies aren&#39;t showing a true reaction can do far more harm than good, not just to your relationship, but also to the very essence of health that you&#39;re trying to protect.<br/>\n<br/>\nHere&#39;s an article I remember reading at the time that was helpful:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2009/02/03/health/03well.html\">http://www.nytimes.com/2009/02/03/health/03well.html</a><br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with food allergies","postDate":"1323886479","msgId":64410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBN0Q3QjFDLTgxODItNEVDQy1CMUMyLTNCMUIzRTc1REM0NEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4=","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4="},"prevInTopic":64409,"nextInTopic":64411,"prevInTime":64409,"nextInTime":64411,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"... So, if you hadn t gone to the doctor, you d never know she had something potentially fatal because there are no symptoms? (Except the bumps?) There s","messageBody":"<div id=\"ygrps-yiv-615240915\">On Dec 14, 2011, at 9:52 AM, Genevieve Raymond wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Since then we haven&#39;t had any limits on anything despite the doctor&#39;s<br/>\n&gt; warning that the allergy is potentially fatal.<br/>\n<br/>\n </span></blockquote>So, if you hadn&#39;t gone to the doctor, you&#39;d never know she had something potentially fatal because there are no symptoms? (Except the bumps?)<br/>\n<br/>\nThere&#39;s something off there. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And part of it is that I just hate<br/>\n&gt; telling her she can&#39;t have milk when the rest of us can.<br/>\n<br/>\n </span></blockquote>I assume you&#39;re saying no because of the &quot;fatal&quot; warning?<br/>\n<br/>\nIf it were diabetes or a clear deadly allergy because a child has had a sever reaction, I know there have been ideas posted on how to partner with a child. But making changes based only on a doctor&#39;s word and not on symptoms? I&#39;d dig into that more since it&#39;s leading you to control something that isn&#39;t having a noticeable effect on her.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":426834801,"authorName":"Jenni Feingold","from":"Jenni Feingold &lt;jenni.lanabella@...&gt;","profile":"charmedgirlies","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with food allergies","postDate":"1323884967","msgId":64412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwNzU4NTE4LTEzQzktNEM5Qy05NUY4LTBFQjE5NjRGOEM0OEBnbWFpbC5jb20+","inReplyToHeader":"PDQzMjNBQjlELUExNjAtNDc5NS1CQTI1LTRBQkFGODRGNDkyOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4gPEJCMjY5NEU0LTc2QkEtNEMyMS1BNzVFLUU0OTEyRDI4MzcxOEBnbWFpbC5jb20+IDw0MzIzQUI5RC1BMTYwLTQ3OTUtQkEyNS00QUJBRjg0RjQ5MjlAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":64411,"nextInTopic":64414,"prevInTime":64411,"nextInTime":64413,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"==And not able to breathe is quite an exaggeration, I think. But that is the tricky thing about allergies especially when discussing severe allergies you","messageBody":"<div id=\"ygrps-yiv-1729394758\">==And &quot;not able to breathe&quot; is quite an exaggeration, I think.<br/>\n<br/>\nBut that is the tricky thing about allergies especially when discussing severe allergies you never know what will be the breaking point. <br/>\n<br/>\n==Is &quot;nightmare&quot; also an exaggeration?<br/>\n<br/>\nYes I suppose it is. However watching a child who is 3 going through as his dr quoted when we trialed it in a &quot;controlled environment&quot; heroin like withdrawls and honestly find a movie with someone detoxing and that is what my child experiences in addition to actual night terrors when he is able to fall asleep. <br/>\n<br/>\n==Neither force-feeding something nor forbidding it can help a child see what his own tolerance level is.<br/>\n<br/>\nSometimes you also have to eliminate to get to the baseline to be able to reintroduce to see what a tolerance level with. However food is also addictive and that also needs to be taken into consideration and for me ketchup on his fries wasn&#39;t worth 12-18 hours of him being in a detox state with other children needing care also. <br/>\n<br/>\n==Maybe he has grown past the problem, but he won&#39;t know if it&#39;s eliminated from his environment. <br/>\n<br/>\nThanks to a big sister and a trip to mcdonald&#39;s we recently learned he hasn&#39;t grown out of it his response is still the same.<br/>\n<br/>\n==The stress of helping the children figure out on their own how foods affect them might be less stressful than either of those.<br/>\n<br/>\nmaybe but at the time it was easier for me to eliminate it to get to baseline when trying to pinpoint.  <br/>\n jenni mama to Brenna (18) Lexi (12)  Jack (7)  Rory (5) & Finn (3) and stepmama to Aidan (12)<br/>\nLana Bella handcrafted soaps, artisanal teas, herbal salves, and bath teas, salts & scrubs<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223034209,"authorName":"Genevieve Raymond","from":"Genevieve Raymond &lt;genevieve.raymond@...&gt;","profile":"genevieveraymond","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with food allergies","postDate":"1323884341","msgId":64411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczNTUxNTM2ODY3MzAzOTkyMDdAdW5rbm93bm1zZ2lkPg==","inReplyToHeader":"PEJCMjY5NEU0LTc2QkEtNEMyMS1BNzVFLUU0OTEyRDI4MzcxOEBnbWFpbC5jb20+","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4gPEJCMjY5NEU0LTc2QkEtNEMyMS1BNzVFLUU0OTEyRDI4MzcxOEBnbWFpbC5jb20+"},"prevInTopic":64410,"nextInTopic":64412,"prevInTime":64410,"nextInTime":64412,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"I have eliminated corn from our diets entirely not an easy task however something that needed to be done because I wasn t about to tell him nope sorry hahaha","messageBody":"<div id=\"ygrps-yiv-1334131835\">I have eliminated corn from our diets entirely not an easy task however<br/>\nsomething that needed to be done because I wasn&#39;t about to tell him nope<br/>\nsorry hahaha you can&#39;t have this while I was.<br/>\n<br/>\n<br/>\nI did try just not buying cow&#39;s milk, having talked to my husband and son<br/>\nand thinking if we all showed some solidarity it might be easier.  Sam, who<br/>\nis also 7, was fine with it for a little while, wanted to support his<br/>\nsister.  But then he just really wanted some milk.  The kid really likes<br/>\nmilk.  (And so does Hazel for that matter.)  So enforcing it for him was<br/>\njust bound to make him resentful of Hazel, and that&#39;s not cool either.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help with food allergies","postDate":"1323880093","msgId":64409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMjNBQjlELUExNjAtNDc5NS1CQTI1LTRBQkFGODRGNDkyOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJCMjY5NEU0LTc2QkEtNEMyMS1BNzVFLUU0OTEyRDI4MzcxOEBnbWFpbC5jb20+","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4gPEJCMjY5NEU0LTc2QkEtNEMyMS1BNzVFLUU0OTEyRDI4MzcxOEBnbWFpbC5jb20+"},"prevInTopic":64408,"nextInTopic":64410,"prevInTime":64408,"nextInTime":64410,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"-=-Stop and think WHY she is clearing her throat is it possible its a sign her airway is compromised? Is an icecream cone worth not being able to breathe? -=- ","messageBody":"<div id=\"ygrps-yiv-1351582684\">-=-Stop and think WHY she is clearing her throat is it possible its a sign her airway is compromised? Is an icecream cone worth not being able to breathe? -=-<br/>\n<br/>\nEXACTLY.<br/>\nIt should be the child&#39;s decision.<br/>\nAnd &quot;not able to breathe&quot; is quite an exaggeration, I think.<br/>\n<br/>\n-=-I have a child who doesn&#39;t tolerate corn at all. The kid eats something with HFCS in it and I cringe. I know that sometime in the next 12-72 hours when it leaves his system the nightmare begins. -=-<br/>\n<br/>\nIs &quot;nightmare&quot; also an exaggeration?<br/>\n<br/>\n-=-I have eliminated corn from our diets entirely not an easy task however something that needed to be done because I wasn&#39;t about to tell him nope sorry hahaha you can&#39;t have this while I was-=-<br/>\n<br/>\nBut &quot;nope sorry hahaha&quot; isn&#39;t the only alternative.  It&#39;s not what happens when families are giving kids choices.<br/>\n<br/>\nNeither force-feeding something nor forbidding it can help a child see what his own tolerance level is.<br/>\n<br/>\n-=- Its been a few years now honestly we don&#39;t miss it ...-=-<br/>\n<br/>\nMaybe he has grown past the problem, but he won&#39;t know if it&#39;s eliminated from his environment.<br/>\n<br/>\n-=-Honestly eliminating dairy for us was much easier than corn or gluten. Tricky was corn & gluten combined because so many GF foods have corn in them. FWIW I find the stressing about eliminating a food much worse than the actual elimination of the food most of the time. -=-<br/>\n<br/>\nThe stress of helping the children figure out on their own how foods affect them might be less stressful than either of those.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":426834801,"authorName":"Jenni Feingold","from":"Jenni Feingold &lt;jenni.lanabella@...&gt;","profile":"charmedgirlies","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with food allergies","postDate":"1323879328","msgId":64408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCMjY5NEU0LTc2QkEtNEMyMS1BNzVFLUU0OTEyRDI4MzcxOEBnbWFpbC5jb20+","inReplyToHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4=","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4="},"prevInTopic":64404,"nextInTopic":64409,"prevInTime":64407,"nextInTime":64409,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"=== And part of it is that I just hate telling her she can t have milk when the rest of us can. Why single her out? Why not just eliminate it? Stop and think","messageBody":"<div id=\"ygrps-yiv-1493372665\">=== And part of it is that I just hate<br/>\ntelling her she can&#39;t have milk when the rest of us can. <br/>\n<br/>\nWhy single her out? Why not just eliminate it? Stop and think WHY she is clearing her throat is it possible its a sign her airway is compromised? Is an icecream cone worth not being able to breathe? <br/>\n<br/>\nI have a child who doesn&#39;t tolerate corn at all. The kid eats something with HFCS in it and I cringe. I know that sometime in the next 12-72 hours when it leaves his system the nightmare begins. His inability find and use words (having ms I know how frustrating word recall issues are), inability to control his body temperature, usually he starts shaking & sweating, he is a pretty skinny kid and you can see the muscles in his legs start to spasm, he screams in pain, can&#39;t get comfortable, SOMETIMES but very rarely he will allow me to hold him & sometimes we get in the shower together but usually he can&#39;t stand to be touched & light and sounds hurt. I have eliminated corn from our diets entirely not an easy task however something that needed to be done because I wasn&#39;t about to tell him nope sorry hahaha you can&#39;t have this while I was. Its been a few years now honestly we don&#39;t miss it and to be honest every once in a while I do sneak a Dr Pepper while I&#39;m out alone. There are still so many things to eat. <br/>\n<br/>\nHonestly eliminating dairy for us was much easier than corn or gluten. Tricky was corn & gluten combined because so many GF foods have corn in them. FWIW I find the stressing about eliminating a food much worse than the actual elimination of the food most of the time. <br/>\n jenni mama to Brenna (18) Lexi (12)  Jack (7)  Rory (5) & Finn (3) and stepmama to Aidan (12)<br/>\nLana Bella handcrafted soaps, artisanal teas, herbal salves, and bath teas, salts & scrubs<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with food allergies","postDate":"1323878175","msgId":64404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwNjk0NkZDLUMyNzgtNEU2OS1BRDlDLTI2RkQ4OEEzNzk3OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4=","referencesHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4="},"prevInTopic":64402,"nextInTopic":64408,"prevInTime":64403,"nextInTime":64405,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"-=-They come and go. The phlegm is pretty constant and she tries to clear it in some pretty noisy unpleasant ways which definitely make people cringe sometimes","messageBody":"<div id=\"ygrps-yiv-438135302\">-=-They come and go. The phlegm is pretty constant and she tries to<br/>\nclear it in some pretty noisy unpleasant ways which definitely make<br/>\npeople cringe sometimes when we&#39;re out in public. We&#39;ve been working<br/>\non more discrete ways for her to clear her throat, but really I&#39;d love<br/>\nto get to the root of it.-=-<br/>\n<br/>\nHolly doesn&#39;t have much phlegm, but she clears her throat in an... interesting way. :-)<br/>\n<br/>\nYears back I asked why she did that and she said &quot;Because I love my daddy.&quot;<br/>\nShe was copying his throat-clearing style.<br/>\n<br/>\nShe was eight or so when a then-20-year-old friend told her she wasn&#39;t going to get boyfriends if she kept doing that.<br/>\n<br/>\nHmmmm.... I thought.  A safety feature! <br/>\n<br/>\nShe&#39;s on her second boyfriend.  She&#39;s 20 now.  If someone doesn&#39;t like her enough to like her even though she has a hoiky throat-clearing routine, they that&#39;s fine with her.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223034209,"authorName":"Genevieve Raymond","from":"Genevieve Raymond &lt;genevieve.raymond@...&gt;","profile":"genevieveraymond","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Help with food allergies","postDate":"1323874330","msgId":64402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PC0zODI0MTI4NDgxMDc1MTA5MzkwQHVua25vd25tc2dpZD4="},"prevInTopic":0,"nextInTopic":64404,"prevInTime":64401,"nextInTime":64403,"topicId":64402,"numMessagesInTopic":0,"msgSnippet":"Joyce s recent post reminded me that I d love some help with some food sensitivities and possible allergies. My daughter Hazel is 7 and has, for the past","messageBody":"<div id=\"ygrps-yiv-952603262\">Joyce&#39;s recent post reminded me that I&#39;d love some help with some food<br/>\nsensitivities and possible allergies.<br/>\n<br/>\nMy daughter Hazel is 7 and has, for the past couple of years produced<br/>\na lot of phlegm in her throat.  She also has a bit of a rash --<br/>\nnothing red and flaring, just some pimply bumps -- on her cheeks.<br/>\nThey come and go.  The phlegm is pretty constant and she tries to<br/>\nclear it in some pretty noisy unpleasant ways which definitely make<br/>\npeople cringe sometimes when we&#39;re out in public.  We&#39;ve been working<br/>\non more discrete ways for her to clear her throat, but really I&#39;d love<br/>\nto get to the root of it.<br/>\n<br/>\nWe saw a naturopath last year who did a blood draw, the results of<br/>\nwhich said Hazel had a true allergy (like potentially anaphylactic<br/>\nallergy) to milk and red meat. As well as sensitivities to wheat and<br/>\neggs.  Geez.  This happened right before we left for a month long trip<br/>\nto Argentina.  Not a great time for a beef allergy diagnosis.  Or<br/>\nmilk.  The ice cream In Argentina is amazing.<br/>\n<br/>\nWe tried limiting those things for a week or so of our trip (meaning<br/>\n*I* decided to limit them) but then it just sucked to see her<br/>\ndisappointment as the rest of us happily ate our ice cream while she<br/>\nwas stuck with sorbet.  Really delicious sorbet, but, still.  I<br/>\nfigured I had the epi-pen, we&#39;d just risk it.<br/>\n<br/>\nSince then we haven&#39;t had any limits on anything despite the doctor&#39;s<br/>\nwarning that the allergy is potentially fatal.  Eeks.  Part of it is<br/>\nthat aside from the phlegm (which is present with or without meat and<br/>\nmilk) she really hasn&#39;t ever shown any more troublesome sign of a<br/>\nreaction to to any of those foods.  And part of it is that I just hate<br/>\ntelling her she can&#39;t have milk when the rest of us can.  And part of<br/>\nit is that I know food allergy testing is unreliable and bodies are<br/>\nalways changing.  And I am (sometimes to a fault?) non-alarmist about<br/>\nmy kids&#39; health.  Though I can occasionally be a bit of a<br/>\nhypochondriac about my own stuff.<br/>\n<br/>\nSo I&#39;m looking for thoughts and advice on how to proceed.  I worry<br/>\nthat the throat clearing has the potential to turn kids off and think<br/>\nshe&#39;s gross.  I worry that I&#39;m not doing enough to avoid a potentially<br/>\nfatal food allergy.  I worry that she&#39;s uncomfortable, but has gotten<br/>\nso accustomed to the phlegm that she doesn&#39;t realize she could feel<br/>\nbetter if we did something differently.  (After her blood test came<br/>\nback, I actually realized I too have a pretty constant coating of<br/>\nphlegm in my throat that I&#39;ve just gotten so used to I don&#39;t notice it<br/>\nanymore).  I worry there are other effects on her body we don&#39;t know<br/>\nabout.  I worry that I&#39;m worrying too much or not enough.<br/>\n<br/>\nI read a few posts from the archives, and one thought I had was just<br/>\nto make sure there are non-dairy/meaty/wheaty/eggy choices available<br/>\nalways.  We do stock non-dairy milk but it&#39;s not often in the fridge<br/>\nright there next to the cow&#39;s milk for her to see.  I haven&#39;t been<br/>\nbuying red meat and she usually chooses something other than a<br/>\nhamburger or red meat anyway when we&#39;re out.  Se loves eggs, and we<br/>\nhave chickens, so eggs are a pretty big part of our lives.  And she&#39;s<br/>\ncrazy for wheat.  Though we&#39;ve dabbled in gluten free baking and she<br/>\nlikes some of that.  I just don&#39;t like the complexity of baking it.<br/>\n<br/>\nI really appreciate all the wisdom I&#39;ve gleaned on this list, and I<br/>\nthank you in advance for anything you might have to offer.<br/>\n<br/>\nGenevieve</div>","specialLinks":[]}],"prevTopicId":64603,"nextTopicId":64606}}