{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":158577738,"authorName":"unschoolingdiscussion","from":"&quot;unschoolingdiscussion&quot; &lt;unschoolingdiscussion@...&gt;","profile":"unschoolingdiscussion","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New List Posting Policies","postDate":"1062453489","msgId":79685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJqMGZkaCs1OGxsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJqMGVrMCszNnRhQGVHcm91cHMuY29tPg=="},"prevInTopic":79684,"nextInTopic":0,"prevInTime":79684,"nextInTime":79686,"topicId":79681,"numMessagesInTopic":0,"msgSnippet":"UnschoolingDiscussion List Posting Policies It is our sincere wish to provide a forum for those seeking to deepen their understanding of the unschooling","messageBody":"<div id=\"ygrps-yiv-1256085353\">UnschoolingDiscussion List Posting Policies<br/>\n<br/>\nIt is our sincere wish to provide a forum for those seeking to deepen <br/>\ntheir understanding of the unschooling philosophy. The primary <br/>\npurpose of this list is to encourage the critical examination of <br/>\nideas, beliefs and viewpoints. <br/>\n<br/>\nQuestioning of deeply-held ideas and beliefs can be very <br/>\nuncomfortable and sometimes responses to that process can stand in <br/>\nthe way of people getting what they need out of the list.<br/>\n<br/>\nTherefore, we offer the following guidelines to help our members get <br/>\nthe most from the list:<br/>\n<br/>\n1. Read for at least a couple of weeks before posting yourself. Spend <br/>\nthat time getting a &quot;feel&quot; for the list and its members. This will <br/>\nhelp you decide if this list is worth your time or whether some other <br/>\nlist might be more useful to you in meeting your needs.<br/>\n<br/>\n2 Expect your beliefs to be challenged. Welcome this as an <br/>\nopportunity to critically examine your own ideas.<br/>\n<br/>\n3. When differences of opinion arise, stick to discussing ideas, not <br/>\nthe person with whom you are disagreeing.<br/>\n<br/>\n4. If you have a belief or practice that you don&#39;t want held up to <br/>\npublic examination, don&#39;t post it to the list.<br/>\n<br/>\n5. Before you hit &quot;send,&quot; consider whether your post will contribute<br/>\npositively to the unschooling discussion.<br/>\n<br/>\n6. Avoid using loaded terminology. For instance, &quot;If you have no TV<br/>\nrestrictions why don&#39;t your kids just watch TV all day?&quot; will get you <br/>\nmore useful responses than, &quot;I don&#39;t see how your kids learn anything <br/>\nif all they ever do is sit around like zombies watching unlimited TV.&quot;<br/>\n<br/>\n7. It is not useful to inform the list that you believe someone else <br/>\nis being rude or discourteous; please trust the rest of the list to <br/>\nrecognize rudeness for themselves. Saying, &quot;Jane was rude to me,&quot; <br/>\njust bogs down the list. It is also a waste of everyone&#39;s time when <br/>\nparticipants attempt to correct or improve other list members&#39; <br/>\nmanners. It never works and always disrupts the list. Avoid<br/>\nstatements such as: &quot;Jane, here is my suggestion of how you could <br/>\nwrite more nicely so people wouldn&#39;t think you are being rude.&quot;<br/>\n<br/>\n8. Our brains automatically supply a &quot;tone&quot; to posts as we read. It <br/>\ncan be helpful to imagine your best friend speaking the words you are <br/>\nreading, in the gentlest, most well-meaning tone you can imagine. It <br/>\nis unacceptable to attack the &quot;tone&quot; of the list or to make <br/>\ngeneralizations about it. &quot;I&#39;ve been on many other lists and this one <br/>\nis the rudest I&#39;ve seen,&quot; would be unacceptable. Instead, attempt to <br/>\ncreate a positive, helpful tone with your own posts by setting the <br/>\nexample you hope others will follow.<br/>\n<br/>\n9. Envision every post and response as a dish at a potluck dinner. <br/>\nYou won&#39;t love every dish at a potluck any more than you will love <br/>\nevery poster&#39;s style of help. But a dish/post may be exactly what <br/>\nsomeone else needs. If ou don&#39;t like a certain list member&#39;s <br/>\nofferings, skip them and leave them for others.<br/>\n<br/>\n10. Read and write as clearly as you can. In casual conversation we <br/>\noften don&#39;t realize how much we rely on others to fill in the gist of <br/>\nour conversation based on what they expect us to say. But here, <br/>\nwithout body language or inflection, all we have to go on are your <br/>\nwords and they should say what you mean. If you say, for example, <br/>\nyou &quot;never&quot; do something, it should not mean &quot;almost never.&quot;<br/>\n<br/>\n<br/>\nOur goal is to make the list as useful as possible for those seeking <br/>\nto deepen their understanding of the unschooling philosophy. To do <br/>\nthat, all new list members are initially moderated to prevent <br/>\nspamming and catch posts that could disrupt the list. People will <br/>\nalso be moderated if they disrupt the usefulness of the list. <br/>\nPotentially disruptive posts will be returned for revision. <br/>\n<br/>\nIf you have questions, please write to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingdiscussion-owner@yahoogroups.com\">unschoolingdiscussion-owner@yahoogroups.com</a><br/>\n<br/>\nJoyce Fetteroll, Pam Sorooshian, and Sandra Dodd</div>","specialLinks":[]},{"userId":158577738,"authorName":"unschoolingdiscussion","from":"&quot;unschoolingdiscussion&quot; &lt;unschoolingdiscussion@...&gt;","profile":"unschoolingdiscussion","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New List Description","postDate":"1062452672","msgId":79684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJqMGVrMCszNnRhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxMDQ3NjEuMTA2MjQ1MDQyMDQzNy5KYXZhTWFpbC5wYW1zb3Jvb3NoQG1hYy5jb20+"},"prevInTopic":79683,"nextInTopic":79685,"prevInTime":79683,"nextInTime":79685,"topicId":79681,"numMessagesInTopic":0,"msgSnippet":"This new list description is available on the yahoogroups homepage for this group and will be sent to each new list subscriber: ******* Although unschooling is","messageBody":"<div id=\"ygrps-yiv-1775707743\">This new list description is available on the yahoogroups homepage <br/>\nfor this group and will be sent to each new list subscriber:<br/>\n<br/>\n*******<br/>\nAlthough unschooling is often described as a homeschooling style, it <br/>\nis, in fact, much more than just another homeschool teaching method. <br/>\nUnschooling is both a philosophy of natural learning and the <br/>\nlifestyle that results from living according to the principles of <br/>\nthat philosophy. <br/>\n<br/>\nThe most basic principle of unschooling is that children are born <br/>\nwith an intrinsic urge to explore -- for a moment or a lifetime -- <br/>\nwhat intrigues them, as they seek to join the adult world in a <br/>\npersonally satisfying way. Because of that urge, an unschooling child <br/>\nis free to choose the what, when, where and how of his/her own <br/>\nlearning from mud puddles to video games and SpongeBob Squarepants to <br/>\nShakespeare! And an unschooling parent sees his/her role, not as a <br/>\nteacher, but as a facilitator and companion in a child&#39;s exploration <br/>\nof the world. <br/>\n<br/>\nUnschooling is a mindful lifestyle which encompasses, at its core, an <br/>\natmosphere of trust, freedom, joy and deep respect for who the child <br/>\nis. This cannot be lived on a part-time basis. Unschooling sometimes <br/>\nseems so intuitive that people feel they&#39;ve been doing it all along, <br/>\nnot realizing it has a name. Unschooling sometimes seems so <br/>\ncounterintuitive that people struggle to understand it, and it can <br/>\ntake years to fully accept its worth. <br/>\n<br/>\nThe purpose of this list is to move out of our own comfort zones as <br/>\nwe critically examine our beliefs, ideas, and viewpoints about <br/>\nlearning, and seek a deeper understanding of unschooling and more <br/>\nrespectful relationships with our children. <br/>\n<br/>\nPlease read for at least a week or two, before posting, to get a feel <br/>\nfor the list. New members are on moderation, to avoid spam and other <br/>\ndisruptions. &quot;List Posting Policies&quot; can be found in the files area <br/>\nof this list or, along with other list information, at: <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/lists/info\">http://www.sandradodd.com/lists/info</a>&gt;.<br/>\n<br/>\nIf you have questions, contact: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingdiscussion-owner@yahoogroups.com\">unschoolingdiscussion-owner@yahoogroups.com</a>. <br/>\n<br/>\nJoyce Fetteroll, Pam Sorooshian, and Sandra Dodd</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshiantafti","from":"Pamela Sorooshiantafti &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion]What Jack said; was: Introducing The Rall family","postDate":"1062450420","msgId":79683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMDQ3NjEuMTA2MjQ1MDQyMDQzNy5KYXZhTWFpbC5wYW1zb3Jvb3NoQG1hYy5jb20+"},"prevInTopic":79682,"nextInTopic":79684,"prevInTime":79682,"nextInTime":79684,"topicId":79681,"numMessagesInTopic":0,"msgSnippet":"... the night before (which is a family favorite and I fix often) makes him sick, ","messageBody":"<div id=\"ygrps-yiv-387743338\"><blockquote><span title=\"ireply\">&gt;&gt;looked right at me and said that the meal I fixed <br/>\n </span></blockquote>the night before (which is a family favorite and I fix often) makes him sick, &lt;&lt;<br/>\n<br/>\n<br/>\nWell - gosh, poor kid - good he told you! So -- what WAS in the meal? Is it an allergy or ???<br/>\n<br/>\nCuriosity, y&#39;know!<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":4335759,"authorName":"HaHaMommy@aol.com","from":"HaHaMommy@...","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion]What Jack said; was: Introducing The Rall family","postDate":"1062449622","msgId":79682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3LjNjZTI2ZWM0LjJjODUwYmQ2QGFvbC5jb20+"},"prevInTopic":79681,"nextInTopic":79683,"prevInTime":79681,"nextInTime":79683,"topicId":79681,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9-1-2003 2:07:49 PM Mountain Daylight Time, Dnowens@aol.com writes: So Jack took a deep breath, looked right at me and said that the meal I","messageBody":"<div id=\"ygrps-yiv-454869143\">In a message dated 9-1-2003 2:07:49 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Dnowens@...\">Dnowens@...</a> writes:<br/>\nSo Jack took a deep breath, looked right at me and said that the meal I fixed <br/>\nthe night before (which is a family favorite and I fix often) makes him sick, <br/>\nand he did not want to eat it any more. I asked how it made him sick, and he <br/>\nsaid it makes him have to go to the bathroom a lot and makes his stomach ache. <br/>\nBy this time he was crying hard. He felt bad, he didn&#39;t want to hurt my <br/>\nfeelings, and he really hadn&#39;t wanted to tell me this. Darin looked at me and said; <br/>\n&quot;You know, it took a lot out of him to come tell you this.&quot; I hugged Jack and <br/>\ntold him he didn&#39;t have to eat that meal ever again if he didn&#39;t want to, <br/>\nthat he could pick something else for me to fix him. <br/>\nThanks Nancy!  I&#39;m crying too, but tears of joy ~ what a lucky boy you have <br/>\nand what an inspiration you are :&#39;)<br/>\n<br/>\ndiana,<br/>\nThe wackiest widow westriver...<br/>\n&quot;You can follow your book and your map of wars, but I&#39;ll go and follow my <br/>\nkids.&quot; -- Woody Guthrie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[UnschoolingDiscussion]What Jack said; was: Introducing The Rall family","postDate":"1062446611","msgId":79681,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkuMTgxYzgyYTkuMmM4NTAwMTNAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":79682,"prevInTime":79680,"nextInTime":79682,"topicId":79681,"numMessagesInTopic":0,"msgSnippet":"I am quite a good cook. I bake wonderful smelling, heavenly tasting breads, cakes, and pies. I fix delicious, mouthwatering meals. No bragging, its the one ","messageBody":"<div id=\"ygrps-yiv-608439377\">I am quite a good cook. I bake wonderful smelling, heavenly tasting breads, <br/>\ncakes, and pies. I fix delicious, mouthwatering meals. No bragging, its the one <br/>\ngood *suzie homemaker* thing I do. Mostly my house is a cozy, cluttered, <br/>\nneeds to be dusted, maybe I should vacuum, boy it sure smells good in here, home. <br/>\nDarin and the kids like to look through my cookbooks and ask; &quot;Could you make <br/>\nthis? Would you make that?&quot; and I do. (Darin has been known to ask for recipes <br/>\nat restaurants, family reunions, homeschool group potlucks.) Not every day <br/>\nmind you. Some days I loathe the sight of the kitchen. Some days it is nicer, <br/>\neasier, just because no other reason, to go out to the local national chain <br/>\ninsert the name here restaurant. <br/>\n<br/>\nOne day, despite my skills, despite the pride I take in placing nutritious, <br/>\nsometimes well balanced, lovely tasting food in front of my family, Jack came <br/>\nto me with a sad look on his face. He stammered, and hemmed and hawed. He said, <br/>\nMommy, ummm you know? Then stopped. Darin smiled, I smiled. We didn&#39;t know <br/>\nwhat was going to come out of our little guy&#39;s mouth, but we knew it was <br/>\nimportant by the look on his face. I told him to tell me, Darin asked if he was hurt. <br/>\nSo Jack took a deep breath, looked right at me and said that the meal I fixed <br/>\nthe night before (which is a family favorite and I fix often) makes him sick, <br/>\nand he did not want to eat it any more. I asked how it made him sick, and he <br/>\nsaid it makes him have to go to the bathroom a lot and makes his stomach ache. <br/>\nBy this time he was crying hard. He felt bad, he didn&#39;t want to hurt my <br/>\nfeelings, and he really hadn&#39;t wanted to tell me this. Darin looked at me and said; <br/>\n&quot;You know, it took a lot out of him to come tell you this.&quot; I hugged Jack and <br/>\ntold him he didn&#39;t have to eat that meal ever again if he didn&#39;t want to, <br/>\nthat he could pick something else for me to fix him. <br/>\n<br/>\nWhen I was a kid, I could have never, ever told my Mom what Jack told me. I <br/>\nate what she fixed and that was the end of it. I wanted guitar lessons when I <br/>\nwas about seven, by the third or fourth lesson, I hated the teacher and wanted <br/>\nto quit. My parents let me, but never again did I ask for something without <br/>\nhearing about how I had quit the guitar, how I would never amount to anything if <br/>\nI quit everything, how much money was going to be spent and on and on. <br/>\n<br/>\nI don&#39;t know how this fits with what everyone is talking about, but I think <br/>\nsomehow it does. Sometimes, we do have to do things we don&#39;t want to, that is <br/>\nlife. Like visiting Grandma, who has a smelly house and five too many cats, and <br/>\nknits ugly hats and even uglier afghans. But, most of the time we get to <br/>\nchoose what we do and we choose to do things that make us happy. There is no <br/>\nreason in the world we can&#39;t and shouldn&#39;t extend that same right to our children. <br/>\nThey are so small and dependent on us, (even when they are 16, 17, and 18 and <br/>\nlook like full grown adults, they are still forming and growing and we need to <br/>\nremember this) they need to practice making choices, forming opinions, and <br/>\ndeciding what they like in the safety and comfort of home with their parents. If <br/>\nwe make it difficult for them, putting up roadblocks of our own opinions, <br/>\nviews, morals, tastes, then they begin to balk. (this isn&#39;t to say we can&#39;t and <br/>\nshouldn&#39;t show and model our values and morals for them, we just can&#39;t expect <br/>\nthem to accept them without testing the validity of said values and morals for <br/>\nthemselves.) They resist and rebel. They learn that parents and other adults <br/>\ndon&#39;t care. So sometimes we have to look at money spent, time gone by, projects <br/>\ngathering dust in a corner as evidence that our children are building good <br/>\nlives for themselves, that they are discovering who they are and how they fit in <br/>\nthis world, and THAT is good and worth the money, time, and effort. <br/>\n<br/>\n~Nancy<br/>\n<br/>\nPeople always call it luck when you&#39;ve acted more sensibly than they have. <br/>\nAnne Tyler <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":79680,"nextTopicId":79690}}