{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":70,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1326054234","msgId":64798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplY3UwcStnMWhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVlNTIuMmQ0YTgyOTMuM2MzYTYwYjBAY3MuY29tPg=="},"prevInTopic":64797,"nextInTopic":64799,"prevInTime":64797,"nextInTime":64799,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"... A lot of what parents say to young children Isn t useful info - so it makes a difference to be more thoughtful in general about what you say to a young","messageBody":"<div id=\"ygrps-yiv-1573540431\">In response to this:<br/>\n<blockquote><span title=\"ireply\"> &gt;If you tell her a version of the game is better, why would she not <br/>\n&gt; take that as useful<br/>\n&gt; info?<br/>\n<br/>\n </span></blockquote> LisaMDJ@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; When I read that I thought -- not a whole lot of young kids take everything <br/>\n&gt; their parents say as useful info.<br/>\n<br/>\n </span></blockquote>A lot of what parents say to young children Isn&#39;t useful info - so it makes a difference to be more thoughtful in general about what you say to a young child. Lots of &quot;nos&quot; and &quot;don&#39;ts&quot; and &quot;be carefuls&quot; can set the stage for kids ignoring what parents have to say. That&#39;s one of the reasons it helps to support what kids want - your information, as a parent, Becomes more valuable as your child learns that it&#39;s good, trustworthy data. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1326053442","msgId":64797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplY3Q4MisxMGtiakBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGplYWM2YSsxMDNjaEBlR3JvdXBzLmNvbT4="},"prevInTopic":64796,"nextInTopic":64798,"prevInTime":64796,"nextInTime":64798,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"... Not necessarily - there are dads who have their own room or bed, while mom and kids mostly sleep separately. Work is often a reason, but snoring and back","messageBody":"<div id=\"ygrps-yiv-855286312\">&quot;kb10112003&quot; &lt;ransomedrogue@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;she&#39;ll have to be in her own room.<br/>\n<br/>\n </span></blockquote>Not necessarily - there are dads who have &quot;their own room&quot; or bed, while mom and kids mostly sleep separately. Work is often a reason, but snoring and back pain are two other common reasons for dads to sleep separate. And even &quot;separate&quot; is variable and negotiable. <br/>\n<br/>\nIt helps a whole lot - with this and many other issues besides - to step away from the idea that there&#39;s One best way to sort things out. Instead create a set of options which are helpful Now - they&#39;ll change as your kids and circumstances change. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s still hard because even trying to do nice things for a toddler can backfire.  At first she screamed about the playdough before deciding she liked it.<br/>\n </span></blockquote>***************<br/>\n<br/>\nSometimes it&#39;s easier to set something out and not say much, rather than make a big presentation and get your hopes dashed when a little kid isn&#39;t in the mood for your wonderful idea. Strew ideas and options, for sure, but as options, things to maybe look at or try, if there&#39;s nothing else more wonderful or compelling at the moment. To a toddler, a loose thread on a pair of jeans can be more wonderful and compelling than the most well-thought-out activity! Put your exciting idea on hold for another time. I have books and projects and craft supplies that were utter duds when I first brought them home, only to have them seem interesting a month, a year, five years later, when whatever it was suddenly became relevant. <br/>\n<br/>\nHave you read Sandra&#39;s Museum House essay?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/museum\">http://sandradodd.com/museum</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To me, a parking lot is like part of the road.  I absolutely will not let her play in the road, it is dangerous, and I will not let her play in the parking lot, its for cars.<br/>\n </span></blockquote>***************<br/>\n<br/>\nDo you mean it has a lot of traffic? All the time? I&#39;ll bet there are times when the parking lot isn&#39;t busy at all, especially at a park. I used to live next to a park, myself, and got to know the &quot;busy&quot; hours pretty well so I could avoid them. Take her out to play during the &quot;safe&quot; times - even if that means going after dark. Make it a fun adventure, with glow-in-the-dark toys and flashlights and have a blast. The more you make it off-limits, the more she&#39;ll be intrigued and fascinated - that&#39;s what limits do! Humans are curious! Nothing gets our attention like &quot;do not cross this line&quot; ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When she is older &#39;don&#39;t play in the parking lot&#39; won&#39;t need to be a rule because she&#39;ll know WHY that is not a good idea.<br/>\n </span></blockquote>***************<br/>\n<br/>\nOr she&#39;ll know her mother doesn&#39;t have a good sense of danger. It makes sense to say &#39;don&#39;t play in traffic&quot; - but a parking lot? It depends on the traffic. If you focus on the place rather than the circumstance, you set yourself up as untrustworthy. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also had a question about violent/sexual tv and toddlers.  Do you let young children see mature shows? <br/>\n </span></blockquote>***********<br/>\n<br/>\n&quot;Let&quot; is a fallacy - little kids don&#39;t really want to watch &quot;mature&quot; programming for the most part - that&#39;s why there are shows and movies for kids! Little kids find adult drama and sexuality dull and/or baffling. And violence is pretty subjective - some kids have no problem with special effects or action but will come unglued if an adult shouts at a child on screen. It&#39;s something to play -gently!- by ear, seeing what your child enjoys and being very responsive to your child&#39;s reactions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know you believe that unschooled children react differently to tv because they aren&#39;t using it as an escape, and the shows are often discussed, opinions aired and all that, you can&#39;t do that with a toddler so I was wondering about that situation.<br/>\n </span></blockquote>****************<br/>\n<br/>\nYou&#39;ve got it backwards - the key is setting kids up to choose what they want to see. When tv is limited, kids don&#39;t have as much power to choose because limits make things seem more valuable. So they&#39;re more inclined to watch things they&#39;d otherwise switch off if you limit them - you set the stage for them seeing More things they&#39;d rather not see.<br/>\n<br/>\nBeing able to make choices about tv sets the stage for discussing what they see - if &quot;what do you think?&quot; is a setup which might get tv limited, kids won&#39;t tell the truth when they see something which bothers them. <br/>\n<br/>\nThe same principles come into play with your toddler in the parking lot! The more you limit it, the more desirable it becomes, and the more likely she is to dash off without looking - because she only gets a few seconds to explore before the limits come down. If the parking lot is just one more place to play, it&#39;s easier to talk about the dangers - the way you&#39;d talk about being careful around swings, or on the see-saw or merry-go-round, or in the sandbox. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":439465581,"authorName":"Colleen","from":"&quot;Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1326037245","msgId":64796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplY2RkdCs4ZHQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhOX29Lc0dXRG89NGdHQXQ5Q3pEdGpFVzNlZW9PaEpuRFJBLUt5VzY9X0U4QUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":64794,"nextInTopic":64797,"prevInTime":64795,"nextInTime":64797,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"****It is very important. Adversarial relationships are pretty much the norm between most parents and children. It is adversarial when the parent feels that","messageBody":"<div id=\"ygrps-yiv-2143799588\">****It is very important. Adversarial relationships are pretty much the norm between most parents and children. It is adversarial when the parent feels that she and the child have opposing goals. Most parents think that way.  When a child wants to run into a road, the parent tries to stop the child, yells &quot;no,&quot; or grabs the child or even swats the child&#39;s bottom. The parent might repeat a rule, &quot;No going in the road.&quot; So when the child does head for the road, the parent sees it as the child being disobedient, intentionally doing something &quot;against&quot; the parent. Why can&#39;t the parent help the child go across the road (or parking lot?)****<br/>\n<br/>\nYes!  Just yesterday, it was almost 50 degrees in New Hampshire (balmy for January!) and we went to the beach to meet up with another unschooling family.  As we were leaving in our car, a dad and son crossed the road far in front of our car to go from a parking lot to a playground area.  As we got a little closer to the crossing spot, the daughter (maybe 6 years old) came zooming toward the road on her scooter.  From the playground side of the road, the father yelled &quot;STOP!!&quot; at the top of his lungs - then he pointed to her - pointed to our car - gestured angrily and continued to yell thing like she &quot;needs to learn how to look both ways&quot; and she &quot;needs to THINK!!!&quot; and that she &quot;could have been KILLED!!!&quot;  After a moment, when he was done yelling, he turned away from her and went to the playground with his son, leaving her to negotiate crossing the road by herself while she cried.<br/>\n<br/>\nThe girl who was yelled at had been nowhere near being run over - we were far enough away that she&#39;d have been fine to cross - but that&#39;s not the point :-)  The thing is, my 8 year old watched all this from inside our minivan - and as the dad walked away he said &quot;Wow!  Couldn&#39;t that dad just help that girl go across?  Why did he make her cry?  She just wanted to go play!&quot;<br/>\n<br/>\nTo him, at 8 years old and with much different life experiences than that girl seems to be having, it&#39;s so plain and simple  help your kids!  They simply want to go play (or go explore, or go see things, or go for a walk, or or).  And sometimes they need your help to do what they want to do or need to do  and that&#39;s your job  to help them.  Not to yell at them or shame them or look for ulterior motives for their behavior.  Be their friend  be their partner  be there for them and help them get what they want and need whenever you can.</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1326001725","msgId":64793,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOX29Lc0dXRG89NGdHQXQ5Q3pEdGpFVzNlZW9PaEpuRFJBLUt5VzY9X0U4QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGVlNTIuMmQ0YTgyOTMuM2MzYTYwYjBAY3MuY29tPg==","referencesHeader":"PGVlNTIuMmQ0YTgyOTMuM2MzYTYwYjBAY3MuY29tPg=="},"prevInTopic":64791,"nextInTopic":64794,"prevInTime":64792,"nextInTime":64794,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"... My question was an actual question: Why would she not take that as useful information? I was actually asking - why not? It was something for you to think","messageBody":"<div id=\"ygrps-yiv-1019441674\">On Sat, Jan 7, 2012 at 7:00 PM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LisaMDJ@...\">LisaMDJ@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  And your answer was this: &quot;You seem very adversarial. Try to find<br/>\n&gt; opportunity to support her, not disagree with her or try to talk her into<br/>\n&gt; your own  choices. If you tell her a version of the game is better, why<br/>\n&gt; would she not  take that as useful info?&quot;<br/>\n&gt;<br/>\n&gt; When I read that I thought -- not a whole lot of young kids take<br/>\n&gt; everything  their parents say as useful info. So I was confused about that<br/>\n&gt; response.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>My question was an actual question: Why would she not take that as useful<br/>\ninformation? I was actually asking - why not? It was something for you to<br/>\nthink more about - what prevents her from accepting useful information from<br/>\nyou? Are you saying it just isn&#39;t in the nature of children to accept<br/>\ninformation from their parents?  Do you believe that? I&#39;m not saying they<br/>\nwill always do what you say - are you thinking that is what I meant? I may<br/>\nbe old and my kids in their 20&#39;s, but I really do remember what 2 year olds<br/>\nare like. I was trying to get you to think about how to talk with her in<br/>\nways that make it more likely she&#39;ll consider what you say. Wouldn&#39;t it be<br/>\ngreat if she grew up thinking of you as a valuable partner, rather than an<br/>\noppressor or adversary? Start now.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I  also didn&#39;t understand why you thought the poster was adversarial, but<br/>\n&gt;  that&#39;s neither here nor there.<br/>\n&gt;<br/>\n </span></blockquote>It is very important. Adversarial relationships are pretty much the norm<br/>\nbetween most parents and children. It is adversarial when the parent feels<br/>\nthat she and the child have opposing goals. Most parents think that way.<br/>\nWhen a child wants to run into a road, the parent tries to stop the child,<br/>\nyells &quot;no,&quot; or grabs the child or even swats the child&#39;s bottom. The parent<br/>\nmight repeat a rule, &quot;No going in the road.&quot; So when the child does head<br/>\nfor the road, the parent sees it as the child being disobedient,<br/>\nintentionally doing something &quot;against&quot; the parent. Why can&#39;t the parent<br/>\nhelp the child go across the road (or parking lot?) Can the parent say, &quot;Go<br/>\nahead, run in the parking lot - I&#39;m watching for cars for you?&quot; (My local<br/>\nunschooling group meets in a park with a large parking lot and parents<br/>\nfrequently go and stand in the parking lot and watch while kids skate or<br/>\nride scooters or just run around. Kids come and ask their parents, &quot;Will<br/>\nyou watch me in the parking lot?&quot;)<br/>\n<br/>\nOf course, the child just might BE running into the road to prove he/she<br/>\ncan ignore the rules - more likely if there are a lot of rules.<br/>\n<br/>\nBut, there is another way to live - a nonadversarial way to think about<br/>\nthis. What does a child running into a road usually really want? Probably<br/>\nthe child wants to run - to run free and unhindered. Probably the child<br/>\ndoesn&#39;t want to be constrained. So - can the parent help with that? A child<br/>\nwho frequently runs toward roads is a child that might need a LOT more open<br/>\nspace to run in. A child who frequently bolts, in general, needs a lot less<br/>\ntime spent restrained. This can be inconvenient for the parent, but if you<br/>\nthink of yourselves as a team, you can think  of the child&#39;s needs as<br/>\nimportant for the team.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I understand your answer better now, and it&#39;s  certainly great advice to<br/>\n&gt; support a child instead of talking her into your own  choices, but with<br/>\n&gt; toddlers that obviously doesn&#39;t always work since their choices are<br/>\n&gt; frequently things that simply aren&#39;t good for their health (like<br/>\n&gt; running into a road, perhaps).<br/>\n&gt;<br/>\n </span></blockquote>I said try to support a child&#39;s choices. Your response is that that won&#39;t<br/>\nwork and your example of a choice is a child running into a road.<br/>\n<br/>\nCan you see that you are looking at extremes that seem to you to contradict<br/>\nwhat I&#39;m offering, but, in the meantime, you might be missing the actual<br/>\npoint?<br/>\n<br/>\nI hope you don&#39;t think I was saying support a child&#39;s choice to run into a<br/>\nbusy street.<br/>\n<br/>\nThis is a lot like when we say, &quot;Say yes more,&quot; and someone hears it as,<br/>\n&quot;Never say no.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; It seems that sometimes parents of older or grown children forget a bit<br/>\n&gt;  about the details of everyday life with toddlers, which makes sense, as<br/>\n&gt; I&#39;ve  already forgotten some of the struggles I used to have when my son<br/>\n&gt; was a  newborn or infant, and he&#39;s only three.<br/>\n&gt;<br/>\n </span></blockquote>I haven&#39;t forgotten. The difference is that I have perspective - I know how<br/>\nfast the time will pass and how the details of everyday life will change<br/>\njust about as fast as you figure out how to handle them &lt;G&gt;. I do remember<br/>\n- and I also remember that it is a lot harder to think clearly while you&#39;re<br/>\nimmersed in it.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":221105640,"authorName":"bobcatpris2000","from":"&quot;bobcatpris2000&quot; &lt;bobcatpris2000@...&gt;","profile":"bobcatpris2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1325996159","msgId":64794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplYjU5disyZGtlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGplYWM2YSsxMDNjaEBlR3JvdXBzLmNvbT4="},"prevInTopic":64793,"nextInTopic":64796,"prevInTime":64793,"nextInTime":64795,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"-==== I know you believe that unschooled children react differently to tv because they aren t using it as an escape, and the shows are often discussed,","messageBody":"<div id=\"ygrps-yiv-1770587169\">-==== I know you believe that unschooled children react differently to tv because they aren&#39;t using it as an escape, and the shows are often discussed, opinions aired and all that, you can&#39;t do that with a toddler so I was wondering about that situation.====-<br/>\n<br/>\n<br/>\nI was wondering why you think you can&#39;t watch a TV show with a toddler and discuss it or air opinions about it. <br/>\n<br/>\nDo you watch shows (or parts of shows) about animals with her? <br/>\n<br/>\nI have watched animal TV programs and animal commercials with toddlers while we stack blocks or played with toys or rocked. I might talk about how the momma animal was caring for the baby, or what the people were doing with the animals (like petting, feeding, or brushing), or if animals could really talk like they do sometimes on TV. I could voice opinions about how a little pig might be rough with his brother getting to the food or how the I liked the gentle way the farmer got all his baby goats back in the pen. I would read animal picture books to them and then when we saw animal shows we could talk about the animals we had seen in the book or in another TV show. We would laugh at funny animals in TV commercials and I would talk about what our pets might do if they were in that commercial. <br/>\n<br/>\nWhether toddlers can express themselves well or not at age 2 or 3 doesn&#39;t stop me from talking to them about TV shows we watch and enjoy together.<br/>\n<br/>\nPriscilla</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325993407","msgId":64791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFMTFBMjc5LTREQzgtNDcxMS05QjE3LTcxNTJDNzkxNEE3MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg==","referencesHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":64789,"nextInTopic":64793,"prevInTime":64790,"nextInTime":64792,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"-=-what if your toddler wanted to go to the park and in the park is a parking lot which the child just loves to go walk in because she knows she isn t supposed","messageBody":"<div id=\"ygrps-yiv-1745418424\">-=-what if your toddler wanted to go to the park and in the park is a parking lot which the child just loves to go walk in because she knows she isn&#39;t supposed to.-=-<br/>\n<br/>\nIf you really don&#39;t like her, you could put her up for adoption.<br/>\nThat sounds harsh, no doubt.<br/>\nMaybe your husband wouldn&#39;t mind.  You said he would rather be with you more, and doesn&#39;t want to be so involved.<br/>\n<br/>\n-=- Should I stop taking her to the park? Because then I would still be saying no, and going to the park is good for her. -=-<br/>\n<br/>\nYou&#39;ve pre-decided what&#39;s good for her, what &#39;isn&#39;t supposed to&quot; be done, and what her motives are.  Why do you need her, really?<br/>\n<br/>\n-=- I&#39;d be saying yes, but what about the whole preventative thing? -=-<br/>\n<br/>\nWHAT &quot;preventative thing&quot; do you mean?  <br/>\n<br/>\n-=-And what about toddler contrariness? -=-<br/>\n<br/>\nI&#39;ve never heard of &quot;toddler contrariness.&quot;  Do you think it&#39;s a solid reality you will need to deal with?<br/>\n<br/>\nBack to that adoption idea.  I hope you were a little shocked by it and decided you did NOT want to put her up for adoption.   (If you weren&#39;t shocked, that&#39;s another matter, but you wouldn&#39;t need this list anymore.)<br/>\n<br/>\nIF you decided somewhere in this e-mail that you did NOT want to put her up for adoption, that&#39;s a step toward thinking of two things and then making the better choice. If you can learn to do that for yourself, you can model it for your child, and help her practice doing it, too.<br/>\n<br/>\nIf you think you &quot;have to&quot; take care of her, you&#39;re stuck; you&#39;re trapped.  <br/>\nIf you see that there are options, then (and only then) you can choose to keep her, and be glad of your choice.<br/>\n<br/>\n-=-. I try to ask questions to find out what exactly is going through her head at these times, but -=-<br/>\n<br/>\nShe&#39;s a baby.  She doesn&#39;t know exactly what&#39;s going through her head.<br/>\n<br/>\n-=-The other day we were petting the neighbor&#39;s dog and she threw a fit when he went inside. I suggested we go pet our dog, or play with the ball, it didn&#39;t matter she wanted to keep petting that dog. Is that just something I&#39;m supposed to ride out while trying to empathize with her?-=-<br/>\n<br/>\nInstead of asking if it&#39;s something you&#39;re supposed to do (like the parking lot is a no, and the &quot;ride out screaming&quot; is a yes), which makes it seem you want a list of rules, maybe ask what would help.  Something happened before the screaming.  The screaming is a reaction to something.<br/>\n<br/>\n-=- as much sense as it makes, I&#39;m often tempted to give up. I&#39;m just trying to keep thoughts of my daughter&#39;s happiness in the forefront of my mind. -=-<br/>\n<br/>\nIf it makes sense to think about it, that&#39;s not enough. <br/>\nIt needs to make sense to you in a way that affects the way you react, and think about it.<br/>\nKeeping thoughts of her happiness in mind will be easier when you learn to help her be happier.<br/>\n<br/>\nParking lots do not swallow children whole.  Walk with her through parking lots.  You&#39;ll be there.  You&#39;re tall.  You can talk to her about watching to see if cars are moving.  Talk about brake lights maybe, if you see some.  Don&#39;t go on and on 200 words, just &quot;Look--lights.  Let&#39;s stand here until the car goes.&quot;  Or fewer words than that.<br/>\n<br/>\nIf you&#39;re her partner there won&#39;t be anything to be contrary about.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rebellion\">http://sandradodd.com/rebellion</a><br/>\nIf you&#39;re not trying to control her irrationally or arbitrarily, what is there to rebell against?<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325992010","msgId":64789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzRTNDRTQ1LUM5NEItNDk2Mi04NjBFLUFCMUVFREFEMkE2NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGVlNTIuMmQ0YTgyOTMuM2MzYTYwYjBAY3MuY29tPg==","referencesHeader":"PGVlNTIuMmQ0YTgyOTMuM2MzYTYwYjBAY3MuY29tPg=="},"prevInTopic":64788,"nextInTopic":64791,"prevInTime":64788,"nextInTime":64790,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"-=When I read that I thought -- not a whole lot of young kids take everything their parents say as useful info. -=- The trick is to be a parent who never says","messageBody":"<div id=\"ygrps-yiv-1757823999\">-=When I read that I thought -- not a whole lot of young kids take everything <br/>\ntheir parents say as useful info. -=-<br/>\n<br/>\nThe trick is to be a parent who never says anything that&#39;s not useful.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Nearly two year old with a struggling mama...","postDate":"1325991675","msgId":64787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1NUYyQ0Y4LTE1RkYtNDVGQS05OTExLTAyQzY4QjczNTAxMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGplYXY2YStvM200QGVHcm91cHMuY29tPg==","referencesHeader":"PGplYXY2YStvM200QGVHcm91cHMuY29tPg=="},"prevInTopic":64786,"nextInTopic":64788,"prevInTime":64786,"nextInTime":64788,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"-=- It feels as though you are trying to tick off unschooling boxes, or wanting to get credit or congratulations for making play dough or not getting annoyed","messageBody":"<div id=\"ygrps-yiv-2129369075\">-=- It feels as though you are trying to tick off unschooling boxes, or wanting to get credit or congratulations for making play dough or not getting annoyed when your toddler doesn&#39;t want to put her shoes on.-=-<br/>\n<br/>\nI think progress is progress. <br/>\n<br/>\nIf a mom can see that she is starting to make better choices, after having fallen into a morass of bad reactions, that&#39;s good!<br/>\n<br/>\n-=- If you are sighing and growling at her a lot then I think you do need to focus on that, not just on the times you succeed in being patient. That&#39;s just another way to soothe yourself by saying you&#39;re doing your best and who can ask for more? -=-<br/>\n<br/>\nThere&#39;s a point to that, but I think the fact that she posted here shows she would like to have ideas for doing better.<br/>\n<br/>\n-=-. Several things you have written make it sound as though you think she is doing things &#39;at&#39; you. Screetching at you, refusing to put on shoes, your attempts at doing something nice backfiring...it all sounds so negative and adversarial.-=-<br/>\n<br/>\nThat&#39;s true, and I&#39;ve just gotten back from several hours out of the house so I don&#39;t now if anyone brought this link, but it might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a><br/>\nSeeing yourself and your child as being on the same team will make a difference.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":75737502,"authorName":"LisaMDJ@cs.com","from":"LisaMDJ@...","profile":"lisamdj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325991600","msgId":64788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVlNTIuMmQ0YTgyOTMuM2MzYTYwYjBAY3MuY29tPg=="},"prevInTopic":64787,"nextInTopic":64789,"prevInTime":64787,"nextInTime":64789,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/6/12 10:36:27 PM, pamsoroosh@gmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-1528481478\">In a message dated 1/6/12 10:36:27 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\n&lt;&lt; I don&#39;t think anybody here has really recommended &quot;explanations&quot; for a<br/>\ntoddler. And we&#39;ve often recommended against long explanations and<br/>\nsuggested just using a key word or two. &gt;&gt;<br/>\n<br/>\nI&#39;m probably thinking of other forums. I was also thinking of exchanges <br/>\nlike the following: a poster asked this: &quot;In the example I mentioned (where she <br/>\nwanted to download a<br/>\nparticular version of a game), I&#39;m not sure how I could have done things<br/>\ndifferently? I&#39;m not sure that she was being mean, as it didn&#39;t cause a<br/>\nproblem for anyone else?&quot;<br/>\n<br/>\nAnd your answer was this: &quot;You seem very adversarial. Try to find <br/>\nopportunity to support her, not disagree with her or try to talk her into your own <br/>\nchoices. If you tell her a version of the game is better, why would she not <br/>\ntake that as useful<br/>\ninfo?&quot;<br/>\n<br/>\nWhen I read that I thought -- not a whole lot of young kids take everything <br/>\ntheir parents say as useful info. So I was confused about that response. I <br/>\nalso didn&#39;t understand why you thought the poster was adversarial, but <br/>\nthat&#39;s neither here nor there. I understand your answer better now, and it&#39;s <br/>\ncertainly great advice to support a child instead of talking her into your own <br/>\nchoices, but with toddlers that obviously doesn&#39;t always work since their <br/>\nchoices are frequently things that simply aren&#39;t good for their health (like <br/>\nrunning into a road, perhaps). <br/>\n<br/>\nIt seems that sometimes parents of older or grown children forget a bit <br/>\nabout the details of everyday life with toddlers, which makes sense, as I&#39;ve <br/>\nalready forgotten some of the struggles I used to have when my son was a <br/>\nnewborn or infant, and he&#39;s only three.<br/>\n&lt;/HTML&gt;</div>","specialLinks":[]},{"userId":359203961,"authorName":"annavblack99","from":"&quot;annavblack99&quot; &lt;anna.black@...&gt;","profile":"annavblack99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1325989898","msgId":64786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplYXY2YStvM200QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGplYWM2YSsxMDNjaEBlR3JvdXBzLmNvbT4="},"prevInTopic":64785,"nextInTopic":64787,"prevInTime":64785,"nextInTime":64787,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"Something in the tone of this post seems off somehow.  It feels as though you are trying to tick off unschooling boxes, or wanting to get credit or","messageBody":"<div id=\"ygrps-yiv-956070098\">Something in the tone of this post seems off somehow.  It feels as though you are trying to tick off unschooling boxes, or wanting to get credit or congratulations for making play dough or not getting annoyed when your toddler doesn&#39;t want to put her shoes on.  If you are sighing and growling at her a lot then I think you do need to focus on that, not just on the times you succeed in being patient.  That&#39;s just another way to soothe yourself by saying you&#39;re doing your best and who can ask for more?  When  I&#39;m cranky, irritable and nasty to my kids I pull myself up, I resolve to cut it out and do better, and I do do better.  I don&#39;t ignore it, rationalize it or pretend it&#39;s not damaging.<br/>\n<br/>\nYou don&#39;t sound very connected to her somehow.  Several things you have written make it sound as though you think she is doing things &#39;at&#39; you.  Screetching at you, refusing to put on shoes, your attempts at doing something nice backfiring...it all sounds so negative and adversarial.<br/>\n<br/>\nFrom my very beginning understanding, unschooling has to come from a place of love, connection and joy with your child/children.  If that core isn&#39;t there then no matter how perfectly you try to follow some kind of template with regards to tv watching or sleep arrangements or rules/no rules it&#39;s not going to work.  <br/>\n<br/>\nPlease correct anything here if I&#39;m on the wrong track, Sandra/Joyce/Schulyer.  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;kb10112003&quot; &lt;ransomedrogue@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Thank you everyone for your replies.  <br/>\n&gt; <br/>\n&gt; I&#39;ve been doing a lot of thinking about how to work make co-sleeping work for us and decided to put a mattress on the floor in the nursery and nursing Alex to sleep before slipping away.  That way she can come get me if she wants, or I can come to her when she cries.  I would put the mattress in our room, but my husband will be starting a night shift soon so to avoid us waking him or him waking Alex, she&#39;ll have to be in her own room.<br/>\n&gt; <br/>\n&gt; Today she hasn&#39;t even asked to nurse once, so perhaps whatever was making her feel the need to nurse more than usual has passed.  <br/>\n&gt; <br/>\n&gt; I think I have been overwhelmed with trying to fix everything all at once, and doing everything &#39;perfect.&#39;  I do need to do more preventative things.  This morning I made Alex some playdough and we played with that for awhile.  I took her to the park when she asked.<br/>\n&gt; <br/>\n&gt; It&#39;s still hard because even trying to do nice things for a toddler can backfire.  At first she screamed about the playdough before deciding she liked it.  She wanted to go to the park but didn&#39;t want to put on socks, shoes and a jacket.  She gives me lots of practice at patience. I just need to stop focusing on all the times I screw up, the times I sigh and growl and focus on how I succeeded.<br/>\n&gt; <br/>\n&gt; I didn&#39;t get so frustrated that I said, &quot;Forget the park, you&#39;re being ridiculous.&quot;  I was patient and unoffended when she screeched about the playdough.  I&#39;ve been making eye contact more often and smiling at her more.  I&#39;m doing better.  <br/>\n&gt; <br/>\n&gt; I do have issues with closeness altogether, I know I do and I know why, it&#39;s why I feel so strongly that making these changes gradually will be necessary for me.  When I&#39;m confronted with too much emotional intimacy all at once I freak out and &#39;run away.&#39;  <br/>\n&gt; <br/>\n&gt; The park is actually right beyond our backyard, we have a gate that leads straight into it.  As far as I know every park around here has a parking lot, and this park is one of the bigger ones in the area, so there is plenty of space for her to roam around without needing to be in the parking lot.  <br/>\n&gt; <br/>\n&gt; To me, a parking lot is like part of the road.  I absolutely will not let her play in the road, it is dangerous, and I will not let her play in the parking lot, its for cars.  Usually I try to distract her but there have been times when she absolutely refused to be distracted and she inched her way into the parking lot and then I pick her up and we leave.  <br/>\n&gt; <br/>\n&gt; I don&#39;t think she is attempting to punish me, but it is deliberate, she looks back at me often and she KNOWS it isn&#39;t allowed.  Usually she is pretty good about following the rules, and I know how everyone here feels about rules but I&#39;m not ready to throw them ALL out the window just yet.<br/>\n&gt; <br/>\n&gt; When she is older &#39;don&#39;t play in the parking lot&#39; won&#39;t need to be a rule because she&#39;ll know WHY that is not a good idea.  Right now she doesn&#39;t understand why and I doubt it will help to try and explain it to her.  <br/>\n&gt; <br/>\n&gt; I also had a question about violent/sexual tv and toddlers.  Do you let young children see mature shows?  I remember reading that toddlers can&#39;t tell that tv is fake, so I&#39;ve pretty strictly regulated her tv watching.  <br/>\n&gt; <br/>\n&gt; But what I want to know is if you or an older child wanted to watch something that, generally speaking, isn&#39;t appropriate for a toddler, do you watch it after the child is in bed, or distract them with a game, their own show, or the like, or do you let them watch it if they want to?  <br/>\n&gt; <br/>\n&gt; I know you believe that unschooled children react differently to tv because they aren&#39;t using it as an escape, and the shows are often discussed, opinions aired and all that, you can&#39;t do that with a toddler so I was wondering about that situation.<br/>\n&gt; <br/>\n&gt; Oh, and I wanted to thank everyone for the book recommendations.  I have &quot;How to Talk so Kids will Listen & Listen so Kids will Talk&quot; on hold at the library.  I will look into the other ones as well.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;kb10112003&quot; &lt;ransomedrogue@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Oh geeze, I don&#39;t even know where to start.  I was an attachment parent till my daughter was about 9 months old.  She never slept well and month 8 in particular was a nightmare.  I gave up and when she was 10 months she was sleeping in her crib at night and for naps.  She was never happy about this although honestly it was a huge relief for my husband and I.<br/>\n&gt; &gt; <br/>\n&gt; &gt; After reading all I could find about unschooling I realized that I had withdrawn from her emotionally in order to manage to leave her crying like that.  Now I&#39;m trying to reconnect with her and finding that the whole process is leaving me exhausted, angry and depressed.  <br/>\n&gt; &gt; <br/>\n&gt; &gt; One thing is that I was preparing for her to be weaned when she turned two.  We were down to two feedings a day, and I loved that.  I don&#39;t know what the deal is, but I always tense up when nursing her.  I constantly have to remind myself to relax my muscles and unclench my jaw and it&#39;s gotten worse as she&#39;s gotten older.  Now all of a sudden we are back to 5 or 6 nursing sessions a day (that is with me still saying no sometimes) and afterwards I don&#39;t want anything to do with her.  I keep thinking if she were weaned, this would be so much easier.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Add to that that my husband has never really been a big fan of attachment parenting.  I think he realized it was best for our daughter, but he doesn&#39;t like sharing my time quite so much or being THAT involved.  We can&#39;t have a family bed, mostly because my husband would never be able to sleep with her flopping around in the bed all night, neither can I for that matter.  But, I can&#39;t leave her in the crib to cry anymore.  I don&#39;t know what to do, but I am REALLY tired.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I read to try and avoid situations that would require you to say no to a toddler, but what if your toddler wanted to go to the park and in the park is a parking lot which the child just loves to go walk in because she knows she isn&#39;t supposed to.  Should I stop taking her to the park?  Because then I would still be saying no, and going to the park is good for her.  <br/>\n&gt; &gt; <br/>\n&gt; &gt; And what about when she wants to go to the park first thing in the morning after a rough night with little sleep?  I&#39;d be saying yes, but what about the whole preventative thing?  Because she&#39;d be tired and hungry within a little while, it&#39;d be asking for a meltdown.  <br/>\n&gt; &gt; <br/>\n&gt; &gt; And what about toddler contrariness?  Sometimes she&#39;ll want something, I&#39;ll go to do or get what she wanted and she&#39;ll screech &quot;No!&quot; so I stop and then she screams that she wants whatever it is, I go to do it and she screeches, and so on and so forth.  I try to ask questions to find out what exactly is going through her head at these times, but she never answers other than to scream at me.    <br/>\n&gt; &gt; <br/>\n&gt; &gt; The other day we were petting the neighbor&#39;s dog and she threw a fit when he went inside.  I suggested we go pet our dog, or play with the ball, it didn&#39;t matter she wanted to keep petting that dog.  Is that just something I&#39;m supposed to ride out while trying to empathize with her?<br/>\n&gt; &gt; <br/>\n&gt; &gt; I realize this is a long rant with lots of questions, I really want this to work and I know it&#39;s more us parents with the problems than our little girl.  She is a toddler who is trying to make do with tired, selfish and impatient parents.  I want to change, I just feel like it&#39;s impossible.  <br/>\n&gt; &gt; <br/>\n&gt; &gt; Yesterday I broke down and cried for a long, long time.  I feel very alone in this, it is scary knowing that my entire family (and my husband&#39;s), if they knew what I was doing, would be (will be) against me.  Actually, I don&#39;t know ANYONE who parents like this, and as much sense as it makes, I&#39;m often tempted to give up.  I&#39;m just trying to keep thoughts of my daughter&#39;s happiness in the forefront of my mind.<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":311341422,"authorName":"dapsign","from":"&quot;dapsign&quot; &lt;dapsign@...&gt;","profile":"dapsign","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1325973452","msgId":64785,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplYWY0Yys5a204QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGplYWM2YSsxMDNjaEBlR3JvdXBzLmNvbT4="},"prevInTopic":64783,"nextInTopic":64786,"prevInTime":64784,"nextInTime":64786,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"... She doesn t have to be in her own room.  It can help to find more options in a situation when you stop thing about things you have to do. ","messageBody":"<div id=\"ygrps-yiv-20804512\"><blockquote><span title=\"ireply\">&gt; I would put the mattress in our room, but my husband will be starting a night shift soon so to avoid us waking him or him waking Alex, she&#39;ll have to be in her own room.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>She doesn&#39;t &quot;have to&quot; be in her own room.  It can help to find more options in a situation when you stop thing about things you &quot;have to&quot; do.<br/>\n<br/>\nwww.sandradodd.com/haveto<br/>\n<br/>\nMy husband has worked the night shift (midnight - 8 AM) on and off for close to ten years and our sleeping arrangements have changed as our family has changed and grown.  He currently sleeps alone during the day (usually 1 or 2 PM - 9 PM) with a fan on to block out any noise the kids and I might make.  The boys (5 years old and 1 year old) and I sleep on a larger bed in another bedroom.<br/>\n<br/>\nDina</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325973081","msgId":64783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZGMTY3MjMwLUE2MkEtNDhGOS05Q0RGLTAyQTMxNjUwOTk2QUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGplYWM2YSsxMDNjaEBlR3JvdXBzLmNvbT4=","referencesHeader":"PGplYWM2YSsxMDNjaEBlR3JvdXBzLmNvbT4="},"prevInTopic":64781,"nextInTopic":64785,"prevInTime":64782,"nextInTime":64784,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"... Rules and nos can make things that aren t interesting more interesting. ... It doesn t need to be a rule. You can reframe it in your mind as a way to be","messageBody":"<div id=\"ygrps-yiv-1547838652\">On Jan 7, 2012, at 4:07 PM, kb10112003 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t think she is attempting to punish me, but it is deliberate,<br/>\n&gt; she looks back at me often and she KNOWS it isn&#39;t allowed.<br/>\n<br/>\n </span></blockquote>Rules and nos can make things that aren&#39;t interesting more interesting.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Usually she is pretty good about following the rules, and I<br/>\n&gt; know how everyone here feels about rules but I&#39;m not ready<br/>\n&gt; to throw them ALL out the window just yet.<br/>\n<br/>\n </span></blockquote>It doesn&#39;t need to be a rule. You can reframe it in your mind as a way to be safe.<br/>\n<br/>\nYou can frame it as an if-then. If the two of you can stay safe, then you and she can walk through it. If she can&#39;t stay safe, then you need to leave. It&#39;s not a rule. It&#39;s being safe.<br/>\n<br/>\nKeep it simple. Tell her the drivers can&#39;t see small people very well.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know how everyone here feels about rules<br/>\n<br/>\n<br/>\n </span></blockquote>Probably not everyone! ;-)<br/>\n<br/>\nAre there unschooling rules against rules?<br/>\n<br/>\nOr is it about living by principles? Helping kids find safe, kind, respectful, thoughtful solutions to their needs?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you let young children see mature shows?<br/>\n<br/>\n </span></blockquote>Does she want to watch mature shows? Think of it not as letting her watch anything but as helping her find what she likes and helping her avoid what she doesn&#39;t.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I remember reading that toddlers can&#39;t tell that tv is fake,<br/>\n&gt; so I&#39;ve pretty strictly regulated her tv watching. <br/>\n<br/>\n </span></blockquote>Rather than thinking of it as regulating, think of it as helping her avoid what she doesn&#39;t care for. My daughter was pretty good about ignoring whatever didn&#39;t interest her. But I wouldn&#39;t have had the news on or some slasher movie. It just wouldn&#39;t be respectful of her to have that playing when she didn&#39;t have the power to avoid it herself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But what I want to know is if you or an older child wanted to watch s<br/>\n&gt; omething that, generally speaking, isn&#39;t appropriate for a toddler,<br/>\n&gt; do you watch it after the child is in bed, or distract them with a game,<br/>\n&gt; their own show, or the like, or do you let them watch it if they want to? <br/>\n<br/>\n </span></blockquote>It depends on the age.<br/>\n<br/>\nBut in general, if children are treated with kindness and respect they understand if they&#39;re asked to watch something later.<br/>\n<br/>\nHelp the kids peacefully coexist with each other and the world as they meet their needs.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":515231140,"authorName":"kb10112003","from":"&quot;kb10112003&quot; &lt;ransomedrogue@...&gt;","profile":"kb10112003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1325970442","msgId":64781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplYWM2YSsxMDNjaEBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":64780,"nextInTopic":64783,"prevInTime":64780,"nextInTime":64782,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"Thank you everyone for your replies. I ve been doing a lot of thinking about how to work make co-sleeping work for us and decided to put a mattress on the","messageBody":"<div id=\"ygrps-yiv-263837856\">Thank you everyone for your replies.  <br/>\n<br/>\nI&#39;ve been doing a lot of thinking about how to work make co-sleeping work for us and decided to put a mattress on the floor in the nursery and nursing Alex to sleep before slipping away.  That way she can come get me if she wants, or I can come to her when she cries.  I would put the mattress in our room, but my husband will be starting a night shift soon so to avoid us waking him or him waking Alex, she&#39;ll have to be in her own room.<br/>\n<br/>\nToday she hasn&#39;t even asked to nurse once, so perhaps whatever was making her feel the need to nurse more than usual has passed.  <br/>\n<br/>\nI think I have been overwhelmed with trying to fix everything all at once, and doing everything &#39;perfect.&#39;  I do need to do more preventative things.  This morning I made Alex some playdough and we played with that for awhile.  I took her to the park when she asked.<br/>\n<br/>\nIt&#39;s still hard because even trying to do nice things for a toddler can backfire.  At first she screamed about the playdough before deciding she liked it.  She wanted to go to the park but didn&#39;t want to put on socks, shoes and a jacket.  She gives me lots of practice at patience. I just need to stop focusing on all the times I screw up, the times I sigh and growl and focus on how I succeeded.<br/>\n<br/>\nI didn&#39;t get so frustrated that I said, &quot;Forget the park, you&#39;re being ridiculous.&quot;  I was patient and unoffended when she screeched about the playdough.  I&#39;ve been making eye contact more often and smiling at her more.  I&#39;m doing better.  <br/>\n<br/>\nI do have issues with closeness altogether, I know I do and I know why, it&#39;s why I feel so strongly that making these changes gradually will be necessary for me.  When I&#39;m confronted with too much emotional intimacy all at once I freak out and &#39;run away.&#39;  <br/>\n<br/>\nThe park is actually right beyond our backyard, we have a gate that leads straight into it.  As far as I know every park around here has a parking lot, and this park is one of the bigger ones in the area, so there is plenty of space for her to roam around without needing to be in the parking lot.  <br/>\n<br/>\nTo me, a parking lot is like part of the road.  I absolutely will not let her play in the road, it is dangerous, and I will not let her play in the parking lot, its for cars.  Usually I try to distract her but there have been times when she absolutely refused to be distracted and she inched her way into the parking lot and then I pick her up and we leave.  <br/>\n<br/>\nI don&#39;t think she is attempting to punish me, but it is deliberate, she looks back at me often and she KNOWS it isn&#39;t allowed.  Usually she is pretty good about following the rules, and I know how everyone here feels about rules but I&#39;m not ready to throw them ALL out the window just yet.<br/>\n<br/>\nWhen she is older &#39;don&#39;t play in the parking lot&#39; won&#39;t need to be a rule because she&#39;ll know WHY that is not a good idea.  Right now she doesn&#39;t understand why and I doubt it will help to try and explain it to her.  <br/>\n<br/>\nI also had a question about violent/sexual tv and toddlers.  Do you let young children see mature shows?  I remember reading that toddlers can&#39;t tell that tv is fake, so I&#39;ve pretty strictly regulated her tv watching.  <br/>\n<br/>\nBut what I want to know is if you or an older child wanted to watch something that, generally speaking, isn&#39;t appropriate for a toddler, do you watch it after the child is in bed, or distract them with a game, their own show, or the like, or do you let them watch it if they want to?  <br/>\n<br/>\nI know you believe that unschooled children react differently to tv because they aren&#39;t using it as an escape, and the shows are often discussed, opinions aired and all that, you can&#39;t do that with a toddler so I was wondering about that situation.<br/>\n<br/>\nOh, and I wanted to thank everyone for the book recommendations.  I have &quot;How to Talk so Kids will Listen & Listen so Kids will Talk&quot; on hold at the library.  I will look into the other ones as well.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;kb10112003&quot; &lt;ransomedrogue@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Oh geeze, I don&#39;t even know where to start.  I was an attachment parent till my daughter was about 9 months old.  She never slept well and month 8 in particular was a nightmare.  I gave up and when she was 10 months she was sleeping in her crib at night and for naps.  She was never happy about this although honestly it was a huge relief for my husband and I.<br/>\n&gt; <br/>\n&gt; After reading all I could find about unschooling I realized that I had withdrawn from her emotionally in order to manage to leave her crying like that.  Now I&#39;m trying to reconnect with her and finding that the whole process is leaving me exhausted, angry and depressed.  <br/>\n&gt; <br/>\n&gt; One thing is that I was preparing for her to be weaned when she turned two.  We were down to two feedings a day, and I loved that.  I don&#39;t know what the deal is, but I always tense up when nursing her.  I constantly have to remind myself to relax my muscles and unclench my jaw and it&#39;s gotten worse as she&#39;s gotten older.  Now all of a sudden we are back to 5 or 6 nursing sessions a day (that is with me still saying no sometimes) and afterwards I don&#39;t want anything to do with her.  I keep thinking if she were weaned, this would be so much easier.<br/>\n&gt; <br/>\n&gt; Add to that that my husband has never really been a big fan of attachment parenting.  I think he realized it was best for our daughter, but he doesn&#39;t like sharing my time quite so much or being THAT involved.  We can&#39;t have a family bed, mostly because my husband would never be able to sleep with her flopping around in the bed all night, neither can I for that matter.  But, I can&#39;t leave her in the crib to cry anymore.  I don&#39;t know what to do, but I am REALLY tired.<br/>\n&gt; <br/>\n&gt; I read to try and avoid situations that would require you to say no to a toddler, but what if your toddler wanted to go to the park and in the park is a parking lot which the child just loves to go walk in because she knows she isn&#39;t supposed to.  Should I stop taking her to the park?  Because then I would still be saying no, and going to the park is good for her.  <br/>\n&gt; <br/>\n&gt; And what about when she wants to go to the park first thing in the morning after a rough night with little sleep?  I&#39;d be saying yes, but what about the whole preventative thing?  Because she&#39;d be tired and hungry within a little while, it&#39;d be asking for a meltdown.  <br/>\n&gt; <br/>\n&gt; And what about toddler contrariness?  Sometimes she&#39;ll want something, I&#39;ll go to do or get what she wanted and she&#39;ll screech &quot;No!&quot; so I stop and then she screams that she wants whatever it is, I go to do it and she screeches, and so on and so forth.  I try to ask questions to find out what exactly is going through her head at these times, but she never answers other than to scream at me.    <br/>\n&gt; <br/>\n&gt; The other day we were petting the neighbor&#39;s dog and she threw a fit when he went inside.  I suggested we go pet our dog, or play with the ball, it didn&#39;t matter she wanted to keep petting that dog.  Is that just something I&#39;m supposed to ride out while trying to empathize with her?<br/>\n&gt; <br/>\n&gt; I realize this is a long rant with lots of questions, I really want this to work and I know it&#39;s more us parents with the problems than our little girl.  She is a toddler who is trying to make do with tired, selfish and impatient parents.  I want to change, I just feel like it&#39;s impossible.  <br/>\n&gt; <br/>\n&gt; Yesterday I broke down and cried for a long, long time.  I feel very alone in this, it is scary knowing that my entire family (and my husband&#39;s), if they knew what I was doing, would be (will be) against me.  Actually, I don&#39;t know ANYONE who parents like this, and as much sense as it makes, I&#39;m often tempted to give up.  I&#39;m just trying to keep thoughts of my daughter&#39;s happiness in the forefront of my mind.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":359203961,"authorName":"annavblack99","from":"&quot;annavblack99&quot; &lt;anna.black@...&gt;","profile":"annavblack99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1325969170","msgId":64780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplYWF1aSs4dWx1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExMDI1MjdCLTUwQkQtNDBFMC1COEI3LTI1MTI3MzVGNzJBNkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64779,"nextInTopic":64781,"prevInTime":64779,"nextInTime":64781,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"... Sorry Sandra, post natal depression! Typing on the iPad is a pain and the abbreviation was too hard to resist.  Will resist in future. ... I was already","messageBody":"<div id=\"ygrps-yiv-1017752369\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=- This comes from my background as a Montessori teacher I think, as well as some PND.-=-<br/>\n<br/>\n&gt; <br/>\n&gt; &quot;PND&quot; is a mystery; please explain, and write things out in future.<br/>\n<br/>\n </span></blockquote>Sorry Sandra, post natal depression! Typing on the iPad is a pain and the abbreviation was too hard to resist.  Will resist in future.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I told him (in this formal vigil situation, sitting in a tent I had designed and made, that we had loaned him for the occasion) that if every time he replaced a piece of his camp--chair, tent, dish--that he make the more medieval choice, he would gradually come to a good set of equipment.  If his choice of purchased tent was canvas or nylon, choose canvas.  If the canvas colors were blue or brown, choose brown.  Make the better choice.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I was already trying to do the two choices, I think I read about it on Joyce&#39;s site, but I found the tent story in the archives, which I am reading back through, and loved it.  Having that picture in my mind of creating a beautiful, authentic, environment piece by piece, choice by choice, is so helpful to me.  I think in pictures, so &#39;nylon or canvas&#39; and &#39;orange or brown&#39;, makes perfect sense to me.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; You don&#39;t have to change everything.  You can&#39;t change everything at once anyway. If you start acting consciously and mindfully with a goal in mind (more peaceful, richer environment, more patient, more gentle--whatever direction or combination of principles you want to hold as your guiding lights), you can and will be a better (more conscious, more thoughtful) mother, and a better person.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choices\">http://sandradodd.com/choices</a><br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":182207143,"authorName":"Nancy Machaj","from":"Nancy Machaj &lt;nmachaj@...&gt;","profile":"nmachaj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1325956699","msgId":64779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0MTBBQzEyLTZFOTAtNDAzRS04MDA1LTk1REYzNjVCNkYxOEBzYmNnbG9iYWwubmV0Pg=="},"prevInTopic":64775,"nextInTopic":64780,"prevInTime":64778,"nextInTime":64780,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"I found a lot of support and friends and helpful advice from attending La Leche League meetings, Attachment Parenting International meetings, and finding a","messageBody":"<div id=\"ygrps-yiv-1252591805\">I found a lot of support and friends and helpful advice from attending  <br/>\nLa Leche League meetings, Attachment Parenting International meetings,  <br/>\nand finding a local homeschool group to spend time with. My La Leche  <br/>\nLeague group even had a special meeting for moms with toddlers.<br/>\n<br/>\nThere is also a great book called Mothering Your Nursing Toddler by  <br/>\nNorma Baumgartner.<br/>\n<br/>\nFor me support group type things feel good. I like the sense of  <br/>\ncommunity and not feeling alone. It helps me see what other people  <br/>\nwith similar goals are doing. I have made friends with people and  <br/>\nfamilies.<br/>\n<br/>\nI am also a reader and I like books. Sometimes local LLL groups have  <br/>\nlending libraries and they lend out books.<br/>\nI have read a ton of books on parenting. One of the first was Meredith  <br/>\nSmall&#39;s &quot;Our Babies, Ourselves&quot; It really opened my eyes to a new way  <br/>\nof thinking about parenting, and how that fits into and is shaped by  <br/>\nour culture and time of existence. Anyway.<br/>\n<br/>\nMy advice is to find people who do what you want to do, and see how  <br/>\nthey do it. You may not end up doing it exactly the same way, but  <br/>\nother perspectives can be helpful.<br/>\n<br/>\nNancy Machaj<br/>\nblogging at <a rel=\"nofollow\" target=\"_blank\" href=\"http://happychildhood.homeschooljournal.net\">http://happychildhood.homeschooljournal.net</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325944332","msgId":64775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2RTdFMTc3LTJEMUEtNDY1Ri05RjEwLTdBNTdGRDJFRUFGQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg==","referencesHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":64774,"nextInTopic":64779,"prevInTime":64774,"nextInTime":64776,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"-=-my husband has never really been a big fan of attachment parenting. I think he realized it was best for our daughter, but he doesn t like sharing my time","messageBody":"<div id=\"ygrps-yiv-944515893\">-=-my husband has never really been a big fan of attachment parenting. I think he realized it was best for our daughter, but he doesn&#39;t like sharing my time quite so much or being THAT involved. We can&#39;t have a family bed, mostly because my husband would never be able to sleep with her flopping around in the bed all night, neither can I for that matter. But, I can&#39;t leave her in the crib to cry anymore. I don&#39;t know what to do, but I am REALLY tired.-=-<br/>\n<br/>\nWe didn&#39;t have a room big enough for everyone when my kids were little, but we had two small bedrooms next to each other, and the doors were nearly always open.<br/>\n<br/>\nUsually the baby was between me and Keith at first, or in a side-car arrangement (we didn&#39;t even have room for that after the first few months), but by the time we had three, I was going to sleep in &quot;the kids&#39; room&quot; which had a bunk bed with a full-sized/double bed on the bottom and a single on top.  Sometimes I got up and went to sleep in what came to be called &quot;Keith&#39;s bed&quot; or &quot;dad&#39;s bed.&quot;  He went to work really early, so if he had work the next day, we let him sleep from 10:00 or 10:30 until 4:30 or 5:00 a.m. with as little interruption as we could.  Sometimes, especially if he didn&#39;t have work the next day, one of the kids might go sleep with him--either starting off there and finding me if they woke up and Keith didn&#39;t, or going there if they woke up and felt crowded by me or the other kids.<br/>\n<br/>\nIt wasn&#39;t so important that each person had his own bed, or important that we were &#39;co-sleeping&#39; as it was that each person was sleeping comfortably in a place that felt safe and secure.<br/>\n<br/>\nSome families go for the rules and the appearance rather than the principles.<br/>\n<br/>\nIf they decide they will &quot;do&quot; family bed, they stop thinking of alternative arrangements, thinking they &quot;have to&quot; all be in one place at one time every single night, no matter how unhappy it&#39;s making one or more of the participants.<br/>\n<br/>\nThat said, though, the adults should think more of the children than of their own needs, within reason, and not be clinging to their own rules and vision about how a married couple should share a private bed forever.<br/>\n<br/>\nThey DO have a child--a living, thinking human who has natural, biological needs.  Emotional needs.  Who is growing and learning.   Learning isn&#39;t just about school subjects, with radical unschooling but is learning about the world, one&#39;s own self, one&#39;s environment. <br/>\n<br/>\n-=- I think he realized it was best for our daughter, but he doesn&#39;t like sharing my time quite so much or being THAT involved. -=-<br/>\n<br/>\nSomething here might help him realize that he has the choice each time he acts or speaks to move toward being a closer, better dad or move away from that.  Each journey begins with a single step, they say, but steps in the wrong direction don&#39;t get you to a good place.  Milling around a thousand steps without regard to the intended goal isn&#39;t &quot;a journey.&quot;  <br/>\n<br/>\nIf he knows what kind of person he wants to be, and what kind of father a child needs, his decisionmaking will be easier.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dads\">http://sandradodd.com/dads</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Nearly two year old with a struggling mama...","postDate":"1325943665","msgId":64774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMDI1MjdCLTUwQkQtNDBFMC1COEI3LTI1MTI3MzVGNzJBNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGplOHRxaCtncWVyQGVHcm91cHMuY29tPg==","referencesHeader":"PGplOHRxaCtncWVyQGVHcm91cHMuY29tPg=="},"prevInTopic":64773,"nextInTopic":64775,"prevInTime":64773,"nextInTime":64775,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"-=- This comes from my background as a Montessori teacher I think, as well as some PND.-=- PND is a mystery; please explain, and write things out in future. ","messageBody":"<div id=\"ygrps-yiv-1961460167\">-=- This comes from my background as a Montessori teacher I think, as well as some PND.-=-<br/>\n<br/>\n&quot;PND&quot; is a mystery; please explain, and write things out in future.<br/>\n<br/>\nI like the response except for that part. :-)  I could google it, but there are other readers who won&#39;t have known, too.  I don&#39;t want to know so much as I want each post to be as clear as possible.<br/>\n<br/>\n-=-I decided to heal both of us as best I could. I stopped asking her to wait anywhere without me, I stopped letting myself feel irritated when she followed me from room to room, or was scared to go outside because of the cats (deep breathing helped)....-=-<br/>\n<br/>\nHealing one&#39;s own losses and lacks by lavishing touch and attention on a child is one of the greatest things EVER.  For me, it came because I joined Adult Children of Alcoholics before I was pregnant with Kirby, and went to meetings weekly until Marty could walk.  I wasn&#39;t yet planning to homeschool, and still the effect on my parenting was profound.  I treated them as I would have liked to have been treated.  Any time I started to do something just because my mother had, or the way my mother had, I tried to ask myself gently:  &quot;Why?&quot;   Why say no?  Why get mad?  And with that thought, I would think of alternatives.<br/>\n<br/>\nThis was my favorite part of Anna&#39;s post:  <br/>\n<br/>\n-=-And then finding unschooling, saying yes more, letting go of arbitrary limits, practicing pausing and finding at least two choices in how to respond to any situation and choosing the kinder, more loving one - these things are bringing so much peace and fun to my family.-=-<br/>\n<br/>\nI had already, when Kirby was not a year old, come up with the &quot;make the better choice&quot; tool, though it was first in the context of the SCA (Society for Creative Anachronism), in response to a serious, formal question from a candidate for knighthood about his concern that his camp and equipment weren&#39;t nice enough or &quot;medievalesque&quot; (&quot;period&quot; was the term we were using, but evocative-of-the-period was what he was meaning) for a knight&#39;s camp, and he didn&#39;t know how to move from the single-young-man camp he had to a nice camp that would add well to the ambiance of the overall group.  <br/>\n<br/>\nI told him (in this formal vigil situation, sitting in a tent I had designed and made, that we had loaned him for the occasion) that if every time he replaced a piece of his camp--chair, tent, dish--that he make the more medieval choice, he would gradually come to a good set of equipment.  If his choice of purchased tent was canvas or nylon, choose canvas.  If the canvas colors were blue or brown, choose brown.  Make the better choice.<br/>\n<br/>\nThat helped me immediately and forever after.   His camp got better, yes, and he wasn&#39;t always a single guy and all that.  But for me, with Kirby, I started considering an alternative as often as I could, so that I wouldn&#39;t operate on automatic, with a slide toward default, thoughtless, bad actions and reactions.<br/>\n<br/>\nYou don&#39;t have to change everything.  You can&#39;t change everything at once anyway. If you start acting consciously and mindfully with a goal in mind (more peaceful, richer environment, more patient, more gentle--whatever direction or combination of principles you want to hold as your guiding lights), you can and will be a better (more conscious, more thoughtful) mother, and a better person.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choices\">http://sandradodd.com/choices</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1325936638","msgId":64773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplOWI1dSszM2s2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":64770,"nextInTopic":64774,"prevInTime":64772,"nextInTime":64774,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"Hopefully your library has these wonderful books: ","messageBody":"<div id=\"ygrps-yiv-2077591150\">Hopefully your library has these wonderful books:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Mothering-Nursing-Toddler-Norma-Bumgarner/dp/0912500522/ref=sr_1_1?ie=UTF8&qid=1325936348&sr=8-1\">http://www.amazon.com/Mothering-Nursing-Toddler-Norma-Bumgarner/dp/0912500522/ref=sr_1_1?ie=UTF8&qid=1325936348&sr=8-1</a><br/>\n<br/>\nand<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/How-Weaning-Happens-Diane-Bengson/dp/0912500549/ref=sr_1_1?s=books&ie=UTF8&qid=1325936390&sr=1-1\">http://www.amazon.com/How-Weaning-Happens-Diane-Bengson/dp/0912500549/ref=sr_1_1?s=books&ie=UTF8&qid=1325936390&sr=1-1</a><br/>\n<br/>\nThey both are written in a way that feels like you are chatting with lots and lots of friends experienced in nursing babies and toddlers. <br/>\n<br/>\nmaryann</div>","specialLinks":[]},{"userId":359203961,"authorName":"annavblack99","from":"&quot;annavblack99&quot; &lt;anna.black@...&gt;","profile":"annavblack99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1325922961","msgId":64770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplOHRxaCtncWVyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":64769,"nextInTopic":64773,"prevInTime":64769,"nextInTime":64771,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"I am new to unschooling, so am still feeling my way. I know much wiser people will be offering help but  I do have some suggestions for the","messageBody":"<div id=\"ygrps-yiv-2049579892\">I am new to unschooling, so am still feeling my way. I know much wiser people will be offering help but  I do have some suggestions for the attachment-parenting-a-two-year old issues..<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;kb10112003&quot; &lt;ransomedrogue@...&gt; wrote:<br/>\n<br/>\n&gt; <br/>\n&gt; After reading all I could find about unschooling I realized that I had withdrawn from her emotionally in order to manage to leave her crying like that.  Now I&#39;m trying to reconnect with her and finding that the whole process is leaving me exhausted, angry and depressed.  <br/>\n<br/>\nI have always co-slept at least part-time with my girls, but I have definitely expected more independence from Abi than she could reasonably give.  This comes from my background as a Montessori teacher I think, as well as some PND.  She has always been sensitive, anxious and very attached to me.  I used to find it irritating and frustrating that she would stick so close to me in social situations and how she seemed frightened of other kids.  I would sometimes snap and try to push her to be more confident, which would result in more anxiety and clingyness (duh).<br/>\n<br/>\nI did a lot of reading and thinking and soul-searching and saw that I had been pushed away before I was ready (no co-sleeping, weaned at five months) by my otherwise very loving mother.  I decided to heal both of us as best I could.  I stopped asking her to wait anywhere without me, I stopped letting myself feel irritated when she followed me from room to room, or was scared to go outside because of the cats (deep breathing helped). I held her and carried her in the sling, let her wear a nappy at night, stopped restricting her breastfeeding so tightly, generally &#39;babied&#39; her as much as I could.<br/>\n<br/>\nThis started six months ago, when she was four and a half.  She is now much, much more confident and less anxious.  Part of that is probably a maturity thing, but I know our relationship is closer and more trusting, and continues to grow on that positive path.  she has even decided to wean, something I couldn&#39;t have imagined six months ago.<br/>\n<br/>\nAnd then finding unschooling, saying yes more, letting go of arbitrary limits, practicing pausing and finding at least two choices in how to respond to any situation and choosing the kinder, more loving one - these things are bringing so much peace and fun to my family.<br/>\n<br/>\n<br/>\n&gt; One thing is that I was preparing for her to be weaned when she turned two.  We were down to two feedings a day, and I loved that.  I don&#39;t know what the deal is, but I always tense up when nursing her.  I constantly have to remind myself to relax my muscles and unclench my jaw and it&#39;s gotten worse as she&#39;s gotten older.  Now all of a sudden we are back to 5 or 6 nursing sessions a day (that is with me still saying no sometimes) and afterwards I don&#39;t want anything to do with her.  I keep thinking if she were weaned, this would be so much easier.<br/>\n&gt; <br/>\nI had pretty severe breastfeeding aversion, especially when tandem feeding my two girls.  Distraction works well, pocasts,reading, tv whatever helps tou relax and let her feed.  Relaxation breathing is great.  I think if you forcibly wean her before she is ready, her need will just be pushed down to surface in another way.  I&#39;m in Australia, we have the Australian Breastfeeding Association for support, I would really recommend something similar (la leche league?) to help you connect with like-minded parents, even just online.  <br/>\n<br/>\n&gt; Add to that that my husband has never really been a big fan of attachment parenting.  I think he realized it was best for our daughter, but he doesn&#39;t like sharing my time quite so much or being THAT involved.  We can&#39;t have a family bed, mostly because my husband would never be able to sleep with her flopping around in the bed all night, neither can I for that matter.  But, I can&#39;t leave her in the crib to cry anymore.  I don&#39;t know what to do, but I am REALLY tired.<br/>\n&gt; <br/>\nTry putting her on a single/futon mattress on the floor of your room.  When she wakes, hop in with her and either feed her back to sleep and get back in your bed or just stay in bed with her.  Abi didn&#39;t sleep longer than two or three hours at a stretch (usually less) until she was two and a half.  Without co sleeping I would have lost my mind.<br/>\n<br/>\n&gt; I read to try and avoid situations that would require you to say no to a toddler, but what if your toddler wanted to go to the park and in the park is a parking lot which the child just loves to go walk in because she knows she isn&#39;t supposed to.  Should I stop taking her to the park?  Because then I would still be saying no, and going to the park is good for her.  <br/>\n&gt; <br/>\n<br/>\nDifferent park?  Hold her hand and help her explore the car park safely?  She&#39;s not wanting to walk there because she &#39;knows she isn&#39;t supposed to&#39;,  she&#39;s  interested and not even two years old.<br/>\n<br/>\n&gt; And what about when she wants to go to the park first thing in the morning after a rough night with little sleep?  I&#39;d be saying yes, but what about the whole preventative thing?  Because she&#39;d be tired and hungry within a little while, it&#39;d be asking for a meltdown.  <br/>\n&gt;<br/>\n<br/>\nJust go for a little while.  Take breakfast. Let her sleep in the pram/carrier/ car.<br/>\n <br/>\n&gt; .  <br/>\n&gt; <br/>\n&gt; Yesterday I broke down and cried for a long, long time.  I feel very alone in this, it is scary knowing that my entire family (and my husband&#39;s), if they knew what I was doing, would be (will be) against me.  Actually, I don&#39;t know ANYONE who parents like this, and as much sense as it makes, I&#39;m often tempted to give up.  I&#39;m just trying to keep thoughts of my daughter&#39;s happiness in the forefront of my mind.<br/>\n&gt;<br/>\n<br/>\nFind other people.  They&#39;re out there.  I don&#39;t think it would make life easier or more fun to parent conventionally.  Simpler maybe, and more formulaic, but you would just fall further into adversarial patterns repeated over and over. </span></blockquote></div>","specialLinks":[]},{"userId":345817076,"authorName":"sylvia057@gmail.com","from":"sylvia057@...","profile":"sylviawoodman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325922115","msgId":64769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFRjAyMEM5LTMxMzgtNDQwOC1BREY4LTdCREMwQzVGQkE1NEBnbWFpbC5jb20+","inReplyToHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg==","referencesHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":64767,"nextInTopic":64770,"prevInTime":64768,"nextInTime":64770,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"Can you find more ways to rest with your daughter during the day?  I know that I can make better, more creative choices the more rest I ve had.  When","messageBody":"<div id=\"ygrps-yiv-1623708064\">Can you find more ways to rest with your daughter during the day?  I know that I can make better, more creative choices the more rest I &#39;ve had.  When Gabriella was not quite two, and no longer napping, and I was pregnant and in need of some rest time in the afternoon we would cuddle up on the couch with a pile of picture books and some snacks and drinks.  Sometimes we would watch Elmo DVDs or Curious George on PBS.  It was a lovely, cuddly,snugly, peaceful time.  It might help you feel more connected to her.  <br/>\n<br/>\nWarmly,<br/>\n<br/>\nSylvia<br/>\n<br/>\nSent from my iPad<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 6, 2012, at 3:34 PM, &quot;kb10112003&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ransomedrogue@...\">ransomedrogue@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Oh geeze, I don&#39;t even know where to start. I was an attachment parent till my daughter was about 9 months old. She never slept well and month 8 in particular was a nightmare. I gave up and when she was 10 months she was sleeping in her crib at night and for naps. She was never happy about this although honestly it was a huge relief for my husband and I.<br/>\n&gt; <br/>\n&gt; After reading all I could find about unschooling I realized that I had withdrawn from her emotionally in order to manage to leave her crying like that. Now I&#39;m trying to reconnect with her and finding that the whole process is leaving me exhausted, angry and depressed. <br/>\n&gt; <br/>\n&gt; One thing is that I was preparing for her to be weaned when she turned two. We were down to two feedings a day, and I loved that. I don&#39;t know what the deal is, but I always tense up when nursing her. I constantly have to remind myself to relax my muscles and unclench my jaw and it&#39;s gotten worse as she&#39;s gotten older. Now all of a sudden we are back to 5 or 6 nursing sessions a day (that is with me still saying no sometimes) and afterwards I don&#39;t want anything to do with her. I keep thinking if she were weaned, this would be so much easier.<br/>\n&gt; <br/>\n&gt; Add to that that my husband has never really been a big fan of attachment parenting. I think he realized it was best for our daughter, but he doesn&#39;t like sharing my time quite so much or being THAT involved. We can&#39;t have a family bed, mostly because my husband would never be able to sleep with her flopping around in the bed all night, neither can I for that matter. But, I can&#39;t leave her in the crib to cry anymore. I don&#39;t know what to do, but I am REALLY tired.<br/>\n&gt; <br/>\n&gt; I read to try and avoid situations that would require you to say no to a toddler, but what if your toddler wanted to go to the park and in the park is a parking lot which the child just loves to go walk in because she knows she isn&#39;t supposed to. Should I stop taking her to the park? Because then I would still be saying no, and going to the park is good for her. <br/>\n&gt; <br/>\n&gt; And what about when she wants to go to the park first thing in the morning after a rough night with little sleep? I&#39;d be saying yes, but what about the whole preventative thing? Because she&#39;d be tired and hungry within a little while, it&#39;d be asking for a meltdown. <br/>\n&gt; <br/>\n&gt; And what about toddler contrariness? Sometimes she&#39;ll want something, I&#39;ll go to do or get what she wanted and she&#39;ll screech &quot;No!&quot; so I stop and then she screams that she wants whatever it is, I go to do it and she screeches, and so on and so forth. I try to ask questions to find out what exactly is going through her head at these times, but she never answers other than to scream at me. <br/>\n&gt; <br/>\n&gt; The other day we were petting the neighbor&#39;s dog and she threw a fit when he went inside. I suggested we go pet our dog, or play with the ball, it didn&#39;t matter she wanted to keep petting that dog. Is that just something I&#39;m supposed to ride out while trying to empathize with her?<br/>\n&gt; <br/>\n&gt; I realize this is a long rant with lots of questions, I really want this to work and I know it&#39;s more us parents with the problems than our little girl. She is a toddler who is trying to make do with tired, selfish and impatient parents. I want to change, I just feel like it&#39;s impossible. <br/>\n&gt; <br/>\n&gt; Yesterday I broke down and cried for a long, long time. I feel very alone in this, it is scary knowing that my entire family (and my husband&#39;s), if they knew what I was doing, would be (will be) against me. Actually, I don&#39;t know ANYONE who parents like this, and as much sense as it makes, I&#39;m often tempted to give up. I&#39;m just trying to keep thoughts of my daughter&#39;s happiness in the forefront of my mind. <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325920161","msgId":64767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwMTQ1Qjk4LTZCQTItNEEzRC1CQzQ3LTZFMDFGMjQyMUI0NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBT09UYVhOV3Ayem1ESEMyYl91amU1QnJpdl9qanpWbVJhcEt5eEhic1RhZkhPakIzZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDFjYzZkLjM1MWUyMWZjLjNjMzhjMzdiQGNzLmNvbT4gPENBT09UYVhQMGNvNDM0ZVNibjNxNk1pWm1DYXJpekUyd2J0LXJoeVJmZm5nM3VaTXUrQUBtYWlsLmdtYWlsLmNvbT4gPENBRkxLeTMwdHp3T0RWXzFMUHViPUNZaTVrM0Z4WW9tcEQ5dDFyNEJQa09rbl9yOTI0Z0BtYWlsLmdtYWlsLmNvbT4gPEUxOURENDRFLTBGM0ItNEUzNS04ODIxLTdGQUNCMERDM0RCOUBTYW5kcmFkb2RkLmNvbT4gPENBT09UYVhOV3Ayem1ESEMyYl91amU1QnJpdl9qanpWbVJhcEt5eEhic1RhZkhPakIzZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":64766,"nextInTopic":64769,"prevInTime":64766,"nextInTime":64768,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"-=-I wasn t thinking of La Leche as a place for attachment parenting help, but it should be a good source of breastfeeding support, right? -=- Yes, true. ","messageBody":"<div id=\"ygrps-yiv-511895065\">-=-I wasn&#39;t thinking of La Leche as a place for attachment parenting help, but<br/>\nit should be a good source of breastfeeding support, right? -=-<br/>\n<br/>\nYes, true.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325917864","msgId":64766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOV3Ayem1ESEMyYl91amU1QnJpdl9qanpWbVJhcEt5eEhic1RhZkhPakIzZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEUxOURENDRFLTBGM0ItNEUzNS04ODIxLTdGQUNCMERDM0RCOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDFjYzZkLjM1MWUyMWZjLjNjMzhjMzdiQGNzLmNvbT4JPENBT09UYVhQMGNvNDM0ZVNibjNxNk1pWm1DYXJpekUyd2J0LXJoeVJmZm5nM3VaTXUrQUBtYWlsLmdtYWlsLmNvbT4JPENBRkxLeTMwdHp3T0RWXzFMUHViPUNZaTVrM0Z4WW9tcEQ5dDFyNEJQa09rbl9yOTI0Z0BtYWlsLmdtYWlsLmNvbT4JPEUxOURENDRFLTBGM0ItNEUzNS04ODIxLTdGQUNCMERDM0RCOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64765,"nextInTopic":64767,"prevInTime":64765,"nextInTime":64767,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"... I wasn t thinking of La Leche as a place for attachment parenting help, but it should be a good source of breastfeeding support, right? I didn t go to La","messageBody":"<div id=\"ygrps-yiv-876206110\">On Fri, Jan 6, 2012 at 9:28 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;La Leche League could be a good resource, but quite a few people there<br/>\n&gt; will have excused themselves from thoughts of attachment parenting once<br/>\n&gt; their kids are weaned.&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I wasn&#39;t thinking of La Leche as a place for attachment parenting help, but<br/>\nit should be a good source of breastfeeding support, right? I didn&#39;t go to<br/>\nLa Leche -- well, I went once and didn&#39;t like the leader and didn&#39;t go<br/>\nback. But the women who did go to our local group were very into extended<br/>\nbreastfeeding up through 5 or 6 years old or so.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325914090","msgId":64765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxOURENDRFLTBGM0ItNEUzNS04ODIxLTdGQUNCMERDM0RCOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRkxLeTMwdHp3T0RWXzFMUHViPUNZaTVrM0Z4WW9tcEQ5dDFyNEJQa09rbl9yOTI0Z0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDFjYzZkLjM1MWUyMWZjLjNjMzhjMzdiQGNzLmNvbT4gPENBT09UYVhQMGNvNDM0ZVNibjNxNk1pWm1DYXJpekUyd2J0LXJoeVJmZm5nM3VaTXUrQUBtYWlsLmdtYWlsLmNvbT4gPENBRkxLeTMwdHp3T0RWXzFMUHViPUNZaTVrM0Z4WW9tcEQ5dDFyNEJQa09rbl9yOTI0Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":64764,"nextInTopic":64766,"prevInTime":64764,"nextInTime":64766,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"I m surprised people are giving resources off the list. The same principles that make unschooling work can help a mother wanting to restore attachment","messageBody":"<div id=\"ygrps-yiv-1876761629\">I&#39;m surprised people are giving resources off the list.<br/>\n<br/>\nThe same principles that make unschooling work can help a mother wanting to restore attachment parenting.  The same things that go wrong with unschooling older kids can be going wrong with a younger child.<br/>\n<br/>\nLa Leche League could be a good resource, but quite a few people there will have excused themselves from thoughts of attachment parenting once their kids are weaned.<br/>\n<br/>\nSomething in here might help:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/babies/\">http://sandradodd.com/babies/</a><br/>\n<br/>\nThere are several related links at the bottom of that page.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nearly two year old with a struggling mama...","postDate":"1325913561","msgId":64764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplOGtrcCttMG5hQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":64763,"nextInTopic":64765,"prevInTime":64763,"nextInTime":64765,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"I ve been there. One practice I started that helped me a lot was to check in with myself and ask, Is what I m about to do connecting, or distancing? And each","messageBody":"<div id=\"ygrps-yiv-23757093\">I&#39;ve been there. One practice I started that helped me a lot was to check in with myself and ask, &quot;Is what I&#39;m about to do connecting, or distancing?&quot; And each time, make the more connected choice. Weaning? It might seem easier, but it&#39;s less connected, especially if she&#39;s needing to nurse a lot right now.<br/>\n<br/>\nI think I suffered from &quot;attachment disorder&quot; of a kind, and I had to learn how to be open and truly available and present to my guys. It was a process.<br/>\n<br/>\nWhen I would feel that antsy, I need space, push them away feeling, I used to think that as an introvert, I *needed* that space. I told myself I&#39;d be a better mom with more time to myself - and that view is certainly supported in the mainstream! But the truth was, getting away led to wanting more time away. It didn&#39;t ease that antsy feeling, it fed it.<br/>\n<br/>\nWhat eased and finally erased that feeling was moving *closer* to my guys when I felt that way. Finding a way to laugh with them. Watching them play video games, and playing if I was invited. (sometimes, inviting myself) Doing something sweet for them, just because.<br/>\n<br/>\nTaking those actions healed whatever part of me believed that being close was painful, and I haven&#39;t had that antsy, get-them-away feeling in years. Making the choice to be closer to my guys, and doing the things that fostered that closeness, did more to heal my own childhood stuff than years of therapy had done.<br/>\n<br/>\nBelow, I&#39;m going to copy a lovely post that I&#39;ve had bookmarked since I first read it. I&#39;ve shared it before; it&#39;s always a good reminder for me. I think it&#39;s in reference to older kids, but if you let us know difficulties with your toddler, we can share things that will help your relationship with her. (the post is here - <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/45076\">http://groups.yahoo.com/group/AlwaysLearning/message/45076</a>  )<br/>\n<br/>\npeace,<br/>\nCaren<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; You can casually be more attentive without forcing yourself on him. Do<br/>\n&gt; it in a thousand different ways by thinking of him throughout the day<br/>\n&gt; and doing some little thing for him. I just went to my daughter&#39;s room<br/>\n&gt; and got a pillow off her bed and put it under her head (she&#39;s on the<br/>\n&gt; couch nearby). She smiled sleepily at me and said, &quot;I love you, Mommy.&quot;<br/>\n&gt; She&#39;s 18.<br/>\n&gt;<br/>\n&gt; Maybe just take him a soda into his room - or a monkey platter of little<br/>\n&gt; things he likes. Show him by your little actions throughout the day that<br/>\n&gt; you love him.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Pam, I loved this. These practical, tangible,<br/>\ndoable-because-they&#39;re-single-small-moments suggestions. This post reminded<br/>\nme of something else you wrote which I read on Sandra&#39;s site a long time<br/>\nago. It&#39;s on the &quot;becoming the parent you want to be&quot; page.<br/>\n<br/>\nYou wrote:<br/>\n<br/>\nStop thinking about changing &quot;for good and not just for days or moments.&quot;<br/>\nThat is just another thing to overwhelm you and you don&#39;t need that!<br/>\n<br/>\nJust change the next interaction you have with the kids.<br/>\n<br/>\nStop reading email right now and do something &quot;preventative&quot; - something<br/>\nthat helps build your relationship with them. Fix them a little tray of<br/>\ncheese and crackers and take it to them, wherever they are, unasked. Sit<br/>\ndown on the floor and play with them. If nothing else, just go and give each<br/>\nof them a little hug and a kiss and say, &quot;I was just thinking about how much<br/>\nI love you.&quot;<br/>\n<br/>\nOkay - so that is one good, positive interaction.<br/>\n<br/>\n<br/>\nHere&#39;s the link:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/peace/becoming.html\">http://www.sandradodd.com/peace/becoming.html</a><br/>\n<br/>\nThat thing about the cheese and crackers really jumped out at me then,<br/>\nwhenever it was (years ago, I&#39;m thinking) that I first read it. The<br/>\nsimplicity of it, the love and tenderness in the gesture. Such an ordinary<br/>\nthing, fixing a plate of cheese and crackers, and yet--and yet--<br/>\n<br/>\n&quot;Take it to them, wherever they are, unasked.&quot; Anticipating a possible need,<br/>\nshowing love with action, not making a big deal or grand gesture out of it.<br/>\nIt&#39;s an active kind of love that is thinking about the other person and<br/>\nputting yourself in his shoes and imagining what would make that person feel<br/>\nhappy and loved.<br/>\n<br/>\nI don&#39;t know why that post gobsmacked me the way it did the first time I<br/>\nread it, but it made me examine the best relationships in my life and<br/>\nappreciate the magnitude of the little things people did for me, like the<br/>\nway my husband always keeps our Brita water dispenser filled up. I don&#39;t<br/>\neven notice it & could easily take it for granted. I&#39;m the one home all day<br/>\ndrinking the water, but I bet I haven&#39;t refilled that thing more than five<br/>\ntimes in five years--probably times he was out of town. He keeps it filled<br/>\nup because he loves me. There are things like that I do for him, and for<br/>\neach of my kids, some things I was doing even before I read that post and<br/>\nstarted really thinking about how much love there can be in a simple quiet<br/>\nact like bringing a plate of snacks to someone playing a video game. Ever<br/>\nsince I read the post, I think of it all the time, looking at my children,<br/>\nthinking, What kind of cheese and crackers could I bring them right now?<br/>\nIt&#39;s figurative--&quot;cheese and crackers&quot; has become my mental code for looking<br/>\nfor nice little things to do for my kids. Or sometimes if I catch myself<br/>\nstarting to be cross or distracted, I&#39;ll think: &quot;where&#39;s the cheese and<br/>\ncrackers?&quot; It&#39;s a memory-trigger for me, a reminder to be present and nice.<br/>\n<br/>\nSo thanks, Pam, for the cheese and crackers, and Sandra, for posting it on<br/>\nyour site.<br/>\n<br/>\nLissa in San Diego, mom of six</div>","specialLinks":[]},{"userId":327852347,"authorName":"Tress Miles","from":"Tress Miles &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325907723","msgId":64763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMwdHp3T0RWXzFMUHViPUNZaTVrM0Z4WW9tcEQ5dDFyNEJQa09rbl9yOTI0Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBT09UYVhQMGNvNDM0ZVNibjNxNk1pWm1DYXJpekUyd2J0LXJoeVJmZm5nM3VaTXUrQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDFjYzZkLjM1MWUyMWZjLjNjMzhjMzdiQGNzLmNvbT4JPENBT09UYVhQMGNvNDM0ZVNibjNxNk1pWm1DYXJpekUyd2J0LXJoeVJmZm5nM3VaTXUrQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":64762,"nextInTopic":64764,"prevInTime":64762,"nextInTime":64764,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"Check out this website www.consciouslyparenting.com.  They offer help with attachment parenting. You can also talk to a parenting coach by phone to get help","messageBody":"<div id=\"ygrps-yiv-510708023\">Check out this website www.consciouslyparenting.com.  They offer help with<br/>\nattachment parenting.<br/>\nYou can also talk to a parenting coach by phone to get help with attachment<br/>\nand relationship<br/>\nparenting.<br/>\nTress, unschooling Lillie since 2008<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Jan 6, 2012 at 10:36 PM, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Fri, Jan 6, 2012 at 1:36 PM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LisaMDJ@...\">LisaMDJ@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; Parents in this forum and elsewhere sometimes talk about reasoning with<br/>\n&gt; &gt; their<br/>\n&gt; &gt; children and how their children often make better choices after things<br/>\n&gt; are<br/>\n&gt; &gt; explained, but a two or three-year-old doesn&#39;t always understand a<br/>\n&gt; &gt; situation<br/>\n&gt; &gt; enough to make a good choice.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; I don&#39;t think anybody here has really recommended &quot;explanations&quot; for a<br/>\n&gt; toddler. And we&#39;ve often recommended against long explanations and<br/>\n&gt; suggested just using a key word or two.<br/>\n&gt;<br/>\n&gt; And 2-year-olds seldom, if ever, make &quot;better&quot; choices after things are<br/>\n&gt; explained. They don&#39;t have that kind of abstract thinking ability yet.<br/>\n&gt;<br/>\n&gt; With toddlers, be sympathetic and gently use distraction to help them move<br/>\n&gt; on when they are frustrated or upset. Set the stage to keep them happily<br/>\n&gt; occupied as much as possible.<br/>\n&gt;<br/>\n&gt; I&#39;d suggest attending a LaLeche league meeting - get some help with the<br/>\n&gt; feelings about nursing and some support for ways to enjoy it more.<br/>\n&gt;<br/>\n&gt; -pam<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325907384","msgId":64762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQMGNvNDM0ZVNibjNxNk1pWm1DYXJpekUyd2J0LXJoeVJmZm5nM3VaTXUrQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDFjYzZkLjM1MWUyMWZjLjNjMzhjMzdiQGNzLmNvbT4=","referencesHeader":"PDFjYzZkLjM1MWUyMWZjLjNjMzhjMzdiQGNzLmNvbT4="},"prevInTopic":64760,"nextInTopic":64763,"prevInTime":64761,"nextInTime":64763,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"... I don t think anybody here has really recommended explanations for a toddler. And we ve often recommended against long explanations and suggested just","messageBody":"<div id=\"ygrps-yiv-1875466088\">On Fri, Jan 6, 2012 at 1:36 PM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LisaMDJ@...\">LisaMDJ@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Parents in this forum and elsewhere sometimes talk about reasoning with<br/>\n&gt; their<br/>\n&gt; children and how their children often make better choices after things are<br/>\n&gt; explained, but a two or three-year-old doesn&#39;t always understand a<br/>\n&gt; situation<br/>\n&gt; enough to make a good choice.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t think anybody here has really recommended &quot;explanations&quot; for a<br/>\ntoddler. And we&#39;ve often recommended against long explanations and<br/>\nsuggested just using a key word or two.<br/>\n<br/>\nAnd 2-year-olds seldom, if ever, make &quot;better&quot; choices after things are<br/>\nexplained. They don&#39;t have that kind of abstract thinking ability yet.<br/>\n<br/>\nWith toddlers, be sympathetic and gently use distraction to help them move<br/>\non when they are frustrated or upset. Set the stage to keep them happily<br/>\noccupied as much as possible.<br/>\n<br/>\nI&#39;d suggest attending a LaLeche league meeting - get some help with the<br/>\nfeelings about nursing and some support for ways to enjoy it more.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325888806","msgId":64758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyOURFQjRGLTczRjAtNDRBNS1BRUVDLTIwQzZGREFENjVEMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg==","referencesHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":64757,"nextInTopic":64760,"prevInTime":64757,"nextInTime":64759,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"... Avoid, yes, but it isn t a rule. It s principle. It creates a peaceful atmosphere and helps grow a better relationship. It s not because a single no is","messageBody":"<div id=\"ygrps-yiv-1289964089\">On Jan 6, 2012, at 3:34 PM, kb10112003 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I read to try and avoid situations that would require you<br/>\n&gt; to say no to a toddler,<br/>\n<br/>\n </span></blockquote>Avoid, yes, but it isn&#39;t a rule. It&#39;s principle. It creates a peaceful atmosphere and helps grow a better relationship. It&#39;s not because a single no is soul damaging.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but what if your toddler wanted<br/>\n&gt; to go to the park and in the park is a parking lot <br/>\n&gt; which the child just loves to go walk in because she knows<br/>\n&gt; she isn&#39;t supposed to. Should I stop taking her to the park?<br/>\n<br/>\n </span></blockquote>The way you&#39;ve phrased it sounds like she&#39;s punishing you or wants something from you that you give her when she&#39;s doing what you don&#39;t want her to. It might be worth looking into what that might be.<br/>\n<br/>\nHave you read Your Two-Year Old by Louise Bates Ames? The books are quite accurate and helpful for most kids.<br/>\n<br/>\nHave you read How To Talk So Kids Listen and Listen So Kids Talk?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Because then I would still be saying no, and going to the park is good for her. <br/>\n<br/>\n </span></blockquote>It will help unschooling if you think in terms of what she enjoys rather than what is good for her.<br/>\n<br/>\nIs that the only park? Are there other play spaces like McDonalds? Are there other creative places you can come up with for her to play at?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And what about when she wants to go to the park first thing<br/>\n&gt; in the morning after a rough night with little sleep? I&#39;d be s<br/>\n&gt; aying yes, but what about the whole preventative thing?<br/>\n&gt; Because she&#39;d be tired and hungry within a little while,<br/>\n&gt; it&#39;d be asking for a meltdown. <br/>\n<br/>\n </span></blockquote>Take some food with you so she can eat when she&#39;s hungry. Do you have a backpack? She might be able to nap on the walk back. Or she could rest her head on your lap in the park.<br/>\n<br/>\nLook for options. Think broader.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And what about toddler contrariness? Sometimes she&#39;ll want<br/>\n&gt; something, I&#39;ll go to do or get what she wanted and she&#39;ll screech &quot;No!&quot;<br/>\n&gt; so I stop and then she screams that she wants whatever it is,<br/>\n<br/>\n </span></blockquote>I know being tired makes this worse. But calmness will help. Learn to breath through it.<br/>\n<br/>\nAnd tell her not to scream at you. Not as a rule or order. Not as a way to control her but as information. Tell her calmly that you can&#39;t help her very well when she&#39;s screaming.<br/>\n<br/>\nDon&#39;t take it personally. Don&#39;t let her emotions turn up your emotions.<br/>\n<br/>\nShe&#39;s going through something. She itchy on the inside and it&#39;s leaking out. You might be causing some of the itchiness with lack of sleep and being frazzled. The best medicine for disturbance is to be the calm and peace. Not a pretend, tense calm with your teeth clenched as you ride out her emotions. A true calm. Her emotions are not your emotions.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I go to do it and she screeches, and so on and so forth. I try to ask<br/>\n&gt; questions to find out what exactly is going through her head<br/>\n&gt; at these times, but she never answers other than to scream at me. <br/>\n<br/>\n </span></blockquote>Then don&#39;t do that. Her actions are telling you LOUDLY that isn&#39;t what she wants or needs.<br/>\n<br/>\nIf you were irritated and someone was nattering at you trying to get you to stop being irritated, would it make you calmer?<br/>\n<br/>\nSometimes the best you can do is sympathy.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The other day we were petting the neighbor&#39;s dog and<br/>\n&gt; she threw a fit when he went inside. I suggested we go<br/>\n&gt; pet our dog, or play with the ball, it didn&#39;t matter she<br/>\n&gt; wanted to keep petting that dog. Is that just something<br/>\n&gt; I&#39;m supposed to ride out while trying to empathize with her?<br/>\n<br/>\n </span></blockquote>Sometimes alternatives are good. Sometimes it&#39;s sympathy. There isn&#39;t one answer. It sounds like you&#39;re trying to fix her when she isn&#39;t broken. She&#39;s upset. It&#39;s the natural response to something fun coming to an unexpected end. What if you were in the middle of a great movie and the film broke? Would you be instantly happy if they offered you a different movie?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to change, I just feel like it&#39;s impossible. <br/>\n<br/>\n </span></blockquote>If you think it&#39;s impossible, then it is.<br/>\n<br/>\nIf you give yourself no option other than to change, then it can&#39;t help but be possible.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":75737502,"authorName":"LisaMDJ@cs.com","from":"LisaMDJ@...","profile":"lisamdj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325885819","msgId":64760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjYzZkLjM1MWUyMWZjLjNjMzhjMzdiQGNzLmNvbT4="},"prevInTopic":64758,"nextInTopic":64762,"prevInTime":64759,"nextInTime":64761,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"I ve felt exactly like this many, many times. My son is three and a half. I nursed until he was three, but it was mostly a good experience. We co-slept but we","messageBody":"<div id=\"ygrps-yiv-1892847993\">I&#39;ve felt exactly like this many, many times. My son is three and a half. I <br/>\nnursed until he was three, but it was mostly a good experience. We co-slept <br/>\nbut we occasionally tried (at my husband&#39;s urging) letting him cry on his <br/>\nown, which I regret. Never worked anyway. He&#39;s never fallen asleep on his <br/>\nown, and I believe he&#39;s simply not ready to do so.<br/>\n<br/>\nI can relate so much to your post because I also try very hard to say yes <br/>\nas often as possible and it can be tough with children as young as ours. <br/>\nParents in this forum and elsewhere sometimes talk about reasoning with their <br/>\nchildren and how their children often make better choices after things are <br/>\nexplained, but a two or three-year-old doesn&#39;t always understand a situation <br/>\nenough to make a good choice. And with children of all ages, the more <br/>\nexplaining a parent does the more they may tune you out (not always, of course).<br/>\n<br/>\nUnfortunately, I don&#39;t have advice for you (and I&#39;m new here so I&#39;d be <br/>\nafraid to even attempt throwing advice out here yet) but I want to tell you that <br/>\nyou&#39;re certainly not alone because I often feel exactly as you do, and I <br/>\ndon&#39;t really know anyone else who parents this way in my &quot;real&quot; life either. <br/>\nMy family members and some of my friends think I&#39;m a kook. I firmly believe <br/>\nthat traditional parenting is unhealthy in many ways, so I&#39;m ok with being <br/>\nthe &quot;kook,&quot; but it can be tough when you feel like you&#39;re on your own. <br/>\n<br/>\nLisa&lt;/HTML&gt;</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nearly two year old with a struggling mama...","postDate":"1325885679","msgId":64757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyM0E2MzM3LUVDNjItNEVGQy04MDI4LTE2NjdDMUEzODlBOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg==","referencesHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":64756,"nextInTopic":64758,"prevInTime":64756,"nextInTime":64758,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"-=-Oh geeze, I don t even know where to start. -=- Start with thinking of the way you would have liked to have been treated if you were her age, in her","messageBody":"<div id=\"ygrps-yiv-741616516\">-=-Oh geeze, I don&#39;t even know where to start. -=-<br/>\n<br/>\nStart with thinking of the way you would have liked to have been treated if you were her age, in her situation.  Be her best mother.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/issues/\">http://sandradodd.com/issues/</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":515231140,"authorName":"kb10112003","from":"&quot;kb10112003&quot; &lt;ransomedrogue@...&gt;","profile":"kb10112003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Nearly two year old with a struggling mama...","postDate":"1325882098","msgId":64756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplN2x0aStqc28xQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":64757,"prevInTime":64755,"nextInTime":64757,"topicId":64756,"numMessagesInTopic":0,"msgSnippet":"Oh geeze, I don t even know where to start.  I was an attachment parent till my daughter was about 9 months old.  She never slept well and month 8 in","messageBody":"<div id=\"ygrps-yiv-69105050\">Oh geeze, I don&#39;t even know where to start.  I was an attachment parent till my daughter was about 9 months old.  She never slept well and month 8 in particular was a nightmare.  I gave up and when she was 10 months she was sleeping in her crib at night and for naps.  She was never happy about this although honestly it was a huge relief for my husband and I.<br/>\n<br/>\nAfter reading all I could find about unschooling I realized that I had withdrawn from her emotionally in order to manage to leave her crying like that.  Now I&#39;m trying to reconnect with her and finding that the whole process is leaving me exhausted, angry and depressed.  <br/>\n<br/>\nOne thing is that I was preparing for her to be weaned when she turned two.  We were down to two feedings a day, and I loved that.  I don&#39;t know what the deal is, but I always tense up when nursing her.  I constantly have to remind myself to relax my muscles and unclench my jaw and it&#39;s gotten worse as she&#39;s gotten older.  Now all of a sudden we are back to 5 or 6 nursing sessions a day (that is with me still saying no sometimes) and afterwards I don&#39;t want anything to do with her.  I keep thinking if she were weaned, this would be so much easier.<br/>\n<br/>\nAdd to that that my husband has never really been a big fan of attachment parenting.  I think he realized it was best for our daughter, but he doesn&#39;t like sharing my time quite so much or being THAT involved.  We can&#39;t have a family bed, mostly because my husband would never be able to sleep with her flopping around in the bed all night, neither can I for that matter.  But, I can&#39;t leave her in the crib to cry anymore.  I don&#39;t know what to do, but I am REALLY tired.<br/>\n<br/>\nI read to try and avoid situations that would require you to say no to a toddler, but what if your toddler wanted to go to the park and in the park is a parking lot which the child just loves to go walk in because she knows she isn&#39;t supposed to.  Should I stop taking her to the park?  Because then I would still be saying no, and going to the park is good for her.  <br/>\n<br/>\nAnd what about when she wants to go to the park first thing in the morning after a rough night with little sleep?  I&#39;d be saying yes, but what about the whole preventative thing?  Because she&#39;d be tired and hungry within a little while, it&#39;d be asking for a meltdown.  <br/>\n<br/>\nAnd what about toddler contrariness?  Sometimes she&#39;ll want something, I&#39;ll go to do or get what she wanted and she&#39;ll screech &quot;No!&quot; so I stop and then she screams that she wants whatever it is, I go to do it and she screeches, and so on and so forth.  I try to ask questions to find out what exactly is going through her head at these times, but she never answers other than to scream at me.    <br/>\n<br/>\nThe other day we were petting the neighbor&#39;s dog and she threw a fit when he went inside.  I suggested we go pet our dog, or play with the ball, it didn&#39;t matter she wanted to keep petting that dog.  Is that just something I&#39;m supposed to ride out while trying to empathize with her?<br/>\n<br/>\nI realize this is a long rant with lots of questions, I really want this to work and I know it&#39;s more us parents with the problems than our little girl.  She is a toddler who is trying to make do with tired, selfish and impatient parents.  I want to change, I just feel like it&#39;s impossible.  <br/>\n<br/>\nYesterday I broke down and cried for a long, long time.  I feel very alone in this, it is scary knowing that my entire family (and my husband&#39;s), if they knew what I was doing, would be (will be) against me.  Actually, I don&#39;t know ANYONE who parents like this, and as much sense as it makes, I&#39;m often tempted to give up.  I&#39;m just trying to keep thoughts of my daughter&#39;s happiness in the forefront of my mind.</div>","specialLinks":[]}],"prevTopicId":64967,"nextTopicId":64895}}