{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"metta","from":"metta &lt;metta@...&gt;","replyTo":"LIST","senderId":"5rsQEq1C3cuhUMyyBPyckXx3r649SVBtNAtVBaH5d6aFCjoysYWoyhtgVCDxG_crbKGkZKMwXnemHF7zK0z4PXeGvA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Breastfeeding","postDate":"955248558","msgId":7924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1MTUzREJFLkZCOUUlbWV0dGFAcGFjaWZpY25ldC5uZXQ+","inReplyToHeader":"PDk1NTE4NjY5Mi4zMDUzQGVncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7923,"nextInTime":7925,"topicId":7924,"numMessagesInTopic":0,"msgSnippet":"... I don t preach breastfeeding but I do get very upset when I hear stories like this. Not because you didn t breastfeed, but because you got inadequate/and","messageBody":"<div id=\"ygrps-yiv-1480421613\">on 4/8/00 2:38 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:JodyeB1@...\">JodyeB1@...</a>  wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The right side was another story.  I can&#39;t describe the<br/>\n&gt; strange sort of pain I felt.  It wasn&#39;t anything like the normal pain I was<br/>\n&gt; feeling on the left side, and it didn&#39;t go away.  For some reason my right<br/>\n&gt; breast (especially the nipple)  is very, very sensitive (all the time).  I<br/>\n&gt; talked to my doctor who dismissed me saying &quot; no one&#39;s body is perfectly<br/>\n&gt; symmetrical.  We&#39;re not exactly the same on both sides - not in shape, size<br/>\n&gt; or sensation&quot;.  So, I stopped breastfeeding my son.  I didn&#39;t even try with<br/>\n&gt; my next daughter.  I was very discouraged at that point.  When my fourth baby<br/>\n&gt; was born, 14 months ago, I did try to nurse her.  She was injured at birth<br/>\n&gt; (by the same doctor who gave me the advice on symmetry) and because of low<br/>\n&gt; muscle tone she had problems latching on and sucking.  I was totally stressed<br/>\n&gt; out!  There was just too much going on.  It was our first year of<br/>\n&gt; homeschooling, my baby was hurt, and I knew that to successfully breastfeed<br/>\n&gt; her was going to take lots of time and energy (especially since I&#39;d basically<br/>\n&gt; be doing it for the first time).  Besides all that I never did figure out<br/>\n&gt; what the problem with my right breast was...or is.  So, I quit.  I spent the<br/>\n&gt; first few months of her life avoiding some of the very people who<br/>\n&gt; could/should have been supporting me.   You know why?  Because I didn&#39;t want<br/>\n&gt; to hear the breastfeeding lecture...again.  I know it&#39;s best for the baby!  I<br/>\n&gt; know! I know! I know!  And guess what?  I think homeschooling is best for<br/>\n&gt; kids.  But I don&#39;t go around preaching about it to every person I meet.<br/>\n<br/>\n </span></blockquote>I don&#39;t preach breastfeeding but I do get very upset when I hear stories<br/>\nlike this. Not because you didn&#39;t breastfeed, but because you got<br/>\ninadequate/and or wrong information from your doctor. I hear lots of stories<br/>\nsimilar to yours. My mom wasn&#39;t given a choice. She was told she couldn&#39;t<br/>\nbreastfeed and was given a shot to dry her up and she wasn&#39;t even allowed to<br/>\ntry. She wanted to, though. That makes me crazy. I preach patients rights<br/>\nand the responsibilty of informing ourselves. I don&#39;t care if women make an<br/>\ninformed choice not to breastfeed. But I really don&#39;t like when women are<br/>\nmisinformed or don&#39;t feel they can question the doctor or go against his/her<br/>\nadvice. I&#39;ve met women who didn&#39;t know they could change doctors if they<br/>\nfelt the care was inadequate. Or their health plans wouldn&#39;t let them<br/>\nchange. That makes me nuts.<br/>\n<br/>\nThe baby book my mom had when she was pregnant with me admonished women not<br/>\nto talk to any doctors but their own or to talk to other women about what<br/>\ntheir doctors were telling them about pregnancy/birth/breastfeeding. The<br/>\nauthors thought that would only confuse us poor dears. That was in the 60&#39;s,<br/>\nbut I know there are doctors who value these same unquestioning and helpless<br/>\nattributes in their patients. In my career as a nurse I&#39;ve met doctors who<br/>\ndidn&#39;t know what they were doing, but that didn&#39;t stop them from giving<br/>\nadvice/writing orders/doing surgery.<br/>\n<br/>\nI think informed choice is the key here. I know there are women who choose<br/>\nnot to inform themselves, but more often I think they are discouraged from<br/>\ndoing so.<br/>\n<br/>\n-- <br/>\nThea<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:metta@...\">metta@...</a></div>","specialLinks":[]}],"prevTopicId":7923,"nextTopicId":7614}}