{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":58,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335994418","msgId":66980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCODFFMjE4LTlCMjItNDdBOC1BRjNCLTExMjc5NTVEMkZCREBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGpucTN1ditjMW82QGVHcm91cHMuY29tPg==","referencesHeader":"PGpucTN1ditjMW82QGVHcm91cHMuY29tPg=="},"prevInTopic":66979,"nextInTopic":66981,"prevInTime":66979,"nextInTime":66981,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=- I feel like he is in the midst of a huge developmental leap, and his growing awareness of the world, his desire to get serious, and his desire to widen his","messageBody":"<div id=\"ygrps-yiv-2127819589\">-=- I feel like he is in the midst of a huge developmental leap, and  <br/>\nhis growing awareness of the world, his desire to get serious, and his  <br/>\ndesire to widen his social circle are completely normal and  <br/>\nwonderful.  If there were no schools, how would a person move through  <br/>\nthis stage? -=-<br/>\n<br/>\nI&#39;m going to take a different tack, from my experience.<br/>\n<br/>\nAt 12, my daughter got completely exhausted from riding classes,  <br/>\nmartial arts, park days, even. She didn&#39;t know what to do with herself  <br/>\n(though I will say that school didn&#39;t even come up). That&#39;s when she  <br/>\nstarted playing more computer games (Zoo Tycoon and Impossible  <br/>\nCreatures were her favorites). She focussed on her passion, which was  <br/>\nanimals, and played Nintendogs on her DS, in addition to reading a lot  <br/>\nabout animals and watching nature shows. She soon started playing more  <br/>\nPokemon DS games, then getting into more online role-playing games  <br/>\nlike World of Warcraft. As she played and got to know people who  <br/>\nplayed with her, she joined fan sites (hunter character, in her case),  <br/>\nthen role-playing groups, then World-of-Warcraft-players-who-love- <br/>\nPokemon role-playing groups (!) We went to Blizzcon, the Blizzard  <br/>\nGames convention. Right now, she&#39;s still into Pokemon in a big way,  <br/>\nplus anime and manga. We&#39;ve attended Sakura-Con (a huge anime  <br/>\nconvention) for the last 3 years. From her connection with artists on  <br/>\ndeviantArt, she has been learning better techniques for drawing. She  <br/>\nwas originally a clay artist, but her drawing skills have really  <br/>\nimproved.<br/>\n<br/>\nShe&#39;s around like-minded people, even if they are not next door to  <br/>\nhang out with, and she&#39;s fine with that! She knows lots of people on- <br/>\nline from all over the world. Her writing and grammar skills are  <br/>\namazing and have been polished by communicating on-line and in-game.  <br/>\nShe can meet up with others who share her passions and I will always  <br/>\ndo my best to facilitate that. She has &quot;a big pool of kids around&quot;,  <br/>\nonly not always in-person. She&#39;s really on-line savvy and that will  <br/>\nhelp her down the road, probably more than handwriting :-).<br/>\n<br/>\nMy daughter is not an extrovert and being in a school setting would  <br/>\noverwhelm her too much. When we go to conventions or unschooling  <br/>\nconferences, she needs plenty of downtime. I guess what I&#39;m saying is  <br/>\nfor certain kids, more people are not the answer to improving writing  <br/>\nskills or math skills or science skills. Passions (and a parent  <br/>\nwilling to support those passions) are the key. Strewing possibilities  <br/>\nfor them is, too, but for my kid, more classes were not the answer. My  <br/>\nkeeping up with her interests and thinking of what would advance them  <br/>\nhelped. My playing games with her helped. My making costumes from her  <br/>\ndesigns helped.<br/>\n<br/>\nOne other thing - my daughter has never been to school and to be  <br/>\nhonest, I don&#39;t think she cares what&#39;s in a textbook.<br/>\n<br/>\n-=- but he sees this stuff in the books and feels incompetent and  <br/>\noverwhelmed.-=-<br/>\n<br/>\nTextbooks are outdated by the time they&#39;re published. Is he finding  <br/>\nthem in the library and then worrying?<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335988160","msgId":66978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhNWm5yOGRoRStIeDFLZDZSZUpicktCMjdGVUQ1Z1hIWm5UaHM3Vl94WDlVd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpucnMyOCtlaG90QGVHcm91cHMuY29tPg==","referencesHeader":"PGpucmRuNis5Z3FwQGVHcm91cHMuY29tPgk8am5yczI4K2Vob3RAZUdyb3Vwcy5jb20+"},"prevInTopic":66977,"nextInTopic":66979,"prevInTime":66977,"nextInTime":66979,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"We are talking about a 12 year old boy, right? I wouldn t put find a tutor on the top of the list of how to make his life glorious. Maybe part of it is that","messageBody":"<div id=\"ygrps-yiv-1261550335\">We are talking about a 12 year old boy, right? I wouldn&#39;t put &quot;find a<br/>\ntutor&quot; on the top of the list of how to make his life glorious.<br/>\n<br/>\nMaybe part of it is that he wants to meet more girls and he doesn&#39;t want to<br/>\ntell that to his mom. Delving too deeply into exactly what he wants out of<br/>\nit might not be useful at this stage (where he&#39;s talking about at least 4<br/>\nor 5 months away) because the reasons are probably complex combinations of<br/>\ndifferent emotions and interests and he likely doesn&#39;t really understand<br/>\nhis own reasons well enough to fully articulate them.<br/>\n<br/>\nAt this age, though, I would bet that social time with girls might be<br/>\nwelcome. EVEN if he doesn&#39;t mention it or denies it, you might just quietly<br/>\nbehind the scenes make that opportunity happen. A conference or campout<br/>\nwhere there are a lot of other unschooled young teens might really make a<br/>\nhuge impression.<br/>\n<br/>\nSo - to make his life glorious - I&#39;d suggest going to an unschooling event<br/>\nbut make sure first that it is one with a good sized group of young teens.<br/>\nThe HSC Conference in California has about a hundred teens and an entire<br/>\nprogram of activities and dances and more all planned by the teens<br/>\nthemselves. It is amazing. Many of those teens go to homeschooling campouts<br/>\ntogether every couple of months throughout the year. Some of them are on<br/>\nthe teen conference planning committee and they meet for an entire weekend<br/>\nonce a month. Between times they travel and visit each other a lot. Some<br/>\nalso go to not-back-to-school-camp in the fall.<br/>\n<br/>\nMy daughter, Rosie, is 21 now. When she was around your son&#39;s age she had a<br/>\nsmall group of friends who got together once a week to play games (Magic,<br/>\nthe Gathering; Risk, D&D, and other games). That was a highlight of her<br/>\nweek. Game playing started as early as 9 or 10 am and went on until late<br/>\nnight. The players changed over the years, there are two of them who are<br/>\nstill playing now, every week, with other young adults, and this is over a<br/>\ndecade later. It took work to keep that game day going all these years, but<br/>\nit has been very very important to her.<br/>\n<br/>\nI&#39;m just giving you some sense of the things that made life really glorious<br/>\nfor my kids - but mine aren&#39;t yours. Still, it was quite a large effort in<br/>\nthe teen years to get them to the other teens, to give them challenges and<br/>\nexcitement.<br/>\n<br/>\nWhich reminds me, lots of times boys that age need challenge and risk in<br/>\ntheir lives - and they don&#39;t necessarily know that&#39;s what is missing but<br/>\nthey feel something is missing. Physical challenge can be good - maybe<br/>\nmartial arts (which is something he can start at any age). You should see<br/>\nthe teens, especially the adolescent boys, climbing the boulders at our<br/>\nJoshua Tree National Park campouts - it is great because they can challenge<br/>\nthemselves exactly as much as they want.<br/>\n<br/>\nTravel is sometimes a really satisfying thing for kids this age...my oldest<br/>\nwanted to travel a lot and her favorite &quot;challenging risk&quot; for herself was<br/>\nto travel on her own - taking a train, bus, or going somewhere on a plane.<br/>\nTraveling to be with other teens she had met at a conference or campout was<br/>\nthe joy of her life!!<br/>\n<br/>\nMy friend, who has 3 boys, travels with them every couple of months or so<br/>\nto go camping or to visit other families with teens - girls and boys. As<br/>\nthey drive around the state, they find skate parks and courses for riding<br/>\ntheir bikes - they really love trying out all the new places - it is<br/>\nexciting and a new challenge all the time.<br/>\n<br/>\nWe live in Southern California and when we have visitors from other states,<br/>\nI often try to arrange for the teens/older adolescents to get a chance to<br/>\nhave a surfing lesson. If they&#39;ve not done it before, it is a great<br/>\nchallenge and very exciting for them.<br/>\n<br/>\nPerforming in a theater production can be an amazing challenge - it is<br/>\nterribly risky (to put yourself up on a stage in front of people) and very<br/>\nvery social at the same time. So if you have a kid who might like that sort<br/>\nof thing, there is another kind of challenge.<br/>\n<br/>\nWe had a Destination Imagination Team for 5 years - a group of 7 teens who<br/>\ndid &quot;challenges&quot; that required teamwork, creativity, technical skills. It<br/>\nis a competitive program and the kids really really loved it. The team met<br/>\ntwice a week and the team members became very close friends. Odyssey of the<br/>\nMind is a similar program.<br/>\n<br/>\nDid you consider going to the Minecraft convention in Las Vegas this past<br/>\nyear? That would have been very exciting for him, I&#39;d bet - there were over<br/>\n5,000 attendees and just being in Las Vegas is exciting and there is a TON<br/>\nto see and do (much much more than just gambling there). The next Minecon<br/>\nis supposed to be in Europe - imagine building a trip to Europe around<br/>\nattending Minecon. Think of those kinds of really exciting things. Plan<br/>\nahead - he might want to earn money toward something like that.<br/>\n<br/>\nVolunteering at the library - not very exciting or challenging. I had one<br/>\ndaughter do it for years, but she also had martial arts and soccer playing<br/>\nin her life for the real challenges. Volunteering at the horse stables WAS<br/>\nexciting and challenging for her, though. It would have bored me out of my<br/>\nmind - grooming and mucking stables - but the challenge of being around<br/>\nlarge animals was perfect for her to test her bravery and become more and<br/>\nmore skilled and competent.<br/>\n<br/>\nKids that age are often wanting to feel competent - that is a biggie for<br/>\nthem.<br/>\n<br/>\nSo - when considering &quot;things to do&quot; keep these keywords in mind:<br/>\n<br/>\nchallenge, risk, building competence, and meeting girls! &lt;G&gt;<br/>\n<br/>\nI have watched dozens of unschooled kids become teens and many of them have<br/>\nchosen to go to school. It is almost always because they have a lack of<br/>\nunschooled friends and/or a lack of having something in their lives that<br/>\nthey really love that keeps them too busy for school.<br/>\n<br/>\nSometimes it is just pure curiosity and a short time in school is enough<br/>\nfor them.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, May 2, 2012 at 10:48 AM, danajeh &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danajeh@...\">danajeh@...</a>&gt; wrote:<br/>\n<br/>\n&gt; He said that he wasn&#39;t interested in a tutor, though, which makes me think<br/>\n&gt; his wanting to go to school is more about *feeling* like he knows just as<br/>\n&gt; much as everyone else, or about being around lots of kids his age, or about<br/>\n&gt; feeling like part of something bigger than himself, or about wanting to<br/>\n&gt; have somewhere to get up and go to every morning, or...<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":69128708,"authorName":"danajeh","from":"&quot;danajeh&quot; &lt;danajeh@...&gt;","profile":"danajeh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal","postDate":"1335986559","msgId":66979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuczFoditlZGhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpucnFmaithdGlwQGVHcm91cHMuY29tPg=="},"prevInTopic":66978,"nextInTopic":66980,"prevInTime":66978,"nextInTime":66980,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... We have some sample questions from our state s test, and we have pulled some things from the internet. Much of it is reinforcing his feeling that he","messageBody":"<div id=\"ygrps-yiv-161034236\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Has he looked at any? You may be able to get some from your local school district if you want, or find some old copies at library book sales. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>We have some sample questions from our state&#39;s test, and we have pulled some things from the internet. Much of it is reinforcing his feeling that he doesn&#39;t know the stuff (because school stuff looks different from his real life stuff.) <br/>\n<br/>\nLast night he said he was going to grab the checklist assessment (a list of things typically covered during his grade that I use to fulfill our state&#39;s homeschool law) and go through the items one by one to make sure he knew them. I quickly told him, &quot;don&#39;t be surprised if it doesn&#39;t make sense.  They use school language to make it sound scientific and official.  They&#39;ll turn &#39;go to the store&#39; into &#39;transport by vehicular means to the depository of edibles, apparel, and toiletries&#39;&quot;  He came back a few minutes later and confirmed it.  I reminded him that every year we go over the checklist and find that he has picked up most of the stuff, plus a lot of other stuff, in everyday life, doing the things that he loves to do.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As Sandra pointed out, though, it&#39;s important to let your son know that All the kids in the class won&#39;t be utterly perfect with the material. Show him things like the in-book quizzes and answers in the back, maybe talk about the tricks kids use to get good grades without actually doing more than skim the book (for the english stuff). With the math, note that most of it is review from the previous year and most of it will be reviewed the following year, and the year after that, and still most people will finish high school and draw a blank on manipulating fractions and pull out a calculator for any kind of division problem. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I can see the benefit of de-mystifying school. I don&#39;t want to discourage him from stretching and striving, though. If he says he wants to improve his writing and I offer that he could do x or y or z and he chooses z (school)...hm, I guess it is the difference between does he want to improve his writing because he loves to write and he wants to write more effectively, or does he want to improve his writing so he can integrate into the school where he thinks everyone else is in on some secret that he is missing out on.  <br/>\n<br/>\nMaybe he is just tired of feeling different.  He&#39;s not clicking with our local friends (friendships started years ago because we had home/unschool in common), and he doesn&#39;t fit in with all the other kids because he doesn&#39;t go to school. He actually doesn&#39;t know anyone who goes to school besides a few older kids who used to homeschool. He only knows one older kid who doesn&#39;t go to school.<br/>\n<br/>\nAlso, I think he is simply wanting *more*. Things to really sink his teeth into.  He spent the last year or so working with a skype friend setting up a Minecraft server.  Researching hosting companies, looking into advertising, figuring out how offer tiered rankings to encourage people to donate, building epic spawn points, carving up the terrain into plots to sell to people, researching and installing mods, foiling griefers, governing the players, etc.  The server is stable now and there isn&#39;t much to do.  He needs a new thing.<br/>\n<br/>\nSo, that, plus his vague idea that he might want to work in some field that would require excellent math, writing, science, whatever skills, plus I think a desire to have a big pool of kids to be around, is why he&#39;s thinking of school.  <br/>\n<br/>\nI&#39;d love for him to feel so busy that he couldn&#39;t commit to the M-F school schedule, too focused on specific interests to put up with the tedium of texts and review and testing, too involved in good friendships to have use for the typical school social scene.  How to get from here to there?</div>","specialLinks":[]},{"userId":69128708,"authorName":"danajeh","from":"&quot;danajeh&quot; &lt;danajeh@...&gt;","profile":"danajeh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal","postDate":"1335980936","msgId":66977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucnMyOCtlaG90QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpucmRuNis5Z3FwQGVHcm91cHMuY29tPg=="},"prevInTopic":66975,"nextInTopic":66978,"prevInTime":66976,"nextInTime":66978,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"When he brought up the idea of going to school we talked about many possibilities in order to try to get a better idea of what he was looking for. Joining the","messageBody":"<div id=\"ygrps-yiv-228517267\">When he brought up the idea of going to school we talked about many possibilities in order to try to get a better idea of what he was looking for. Joining the teen homeschool group?  Forming a study group?  Starting a business? Online class?  Making a daily home study schedule?  Sign up for regular school? More classes/days at an alternative school?  Form a hiking, film-making, or computer club? Find a tutor?  <br/>\n<br/>\nSo a tutor was one of the things we talked about.  I was thinking along the lines of finding someone like a family friend or someone from the wider homeschool community (or a college student, or someone found through community ed) who could help him with specific learning goals rather than those businesses that offer test-prep.  He said that he wasn&#39;t interested in a tutor, though, which makes me think his wanting to go to school is more about *feeling* like he knows just as much as everyone else, or about being around lots of kids his age, or about feeling like part of something bigger than himself, or about wanting to have somewhere to get up and go to every morning, or...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;how is any different that I suggested a tutor, than you suggesting he try out school. Wouldn&#39;t the first choice be an easier, less traumatic way for him to find out if he truly wants or needs more academics?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: wanting to feel normal","postDate":"1335979315","msgId":66975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucnFmaithdGlwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpucTN1ditjMW82QGVHcm91cHMuY29tPg=="},"prevInTopic":66974,"nextInTopic":66977,"prevInTime":66974,"nextInTime":66976,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... ************** Has he looked at any? You may be able to get some from your local school district if you want, or find some old copies at library book","messageBody":"<div id=\"ygrps-yiv-209675602\">&quot;danajeh&quot; &lt;danajeh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He thinks he should be able to crack open a 7th grade math or english textbook and understand it.  He wants to know the terms so he doesn&#39;t feel stupid. <br/>\n </span></blockquote>**************<br/>\n<br/>\nHas he looked at any? You may be able to get some from your local school district if you want, or find some old copies at library book sales. <br/>\n<br/>\nAs Sandra pointed out, though, it&#39;s important to let your son know that All the kids in the class won&#39;t be utterly perfect with the material. Show him things like the in-book quizzes and answers in the back, maybe talk about the tricks kids use to get good grades without actually doing more than skim the book (for the english stuff). With the math, note that most of it is review from the previous year and most of it will be reviewed the following year, and the year after that, and still most people will finish high school and draw a blank on manipulating fractions and pull out a calculator for any kind of division problem. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: wanting to feel normal","postDate":"1335978837","msgId":66974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucnEwbCs4MGNsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpucmRuNis5Z3FwQGVHcm91cHMuY29tPg=="},"prevInTopic":66973,"nextInTopic":66975,"prevInTime":66973,"nextInTime":66975,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... **************** He s not asking for a tutor, he s asking to go to school. He wants to know he can do what other kids can do - and he s muuuuch more likely","messageBody":"<div id=\"ygrps-yiv-1955847618\">&quot;debwal777&quot; &lt;debwal777@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;how is any different that I suggested a tutor, than you suggesting he try out school<br/>\n </span></blockquote>****************<br/>\n<br/>\nHe&#39;s not asking for a tutor, he&#39;s asking to go to school. He wants to know he can do what other kids can do - and he&#39;s muuuuch more likely to learn that in school, where the other kids are. If he has a tutor, he&#39;s more likely to compare himself to some unrealistic standard because he&#39;s isolated from what kids are Really learning in school. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Wouldn&#39;t the first choice be an easier, less traumatic way for him to find out if he truly wants or needs more academics?<br/>\n </span></blockquote>**************<br/>\n<br/>\nHe&#39;s not really asking about academics, though, he&#39;s asking to be able to jump through the same school hoops other kids do. That&#39;s really different. If he wants to be &quot;just like everyone else&quot; then a tutor is a set up to feel more different - if he knows kids in school, he&#39;ll find out in a hurry that kids with tutors are &quot;less than&quot; in some way - labeled with a learning deficit. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335977707","msgId":66973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGREM1QUU5LTI5NjYtNDRBQy05QjQ0LTk0NEM4MkE3QTMzRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpucmRuNis5Z3FwQGVHcm91cHMuY29tPg==","referencesHeader":"PGpucmRuNis5Z3FwQGVHcm91cHMuY29tPg=="},"prevInTopic":66972,"nextInTopic":66974,"prevInTime":66972,"nextInTime":66974,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=-I m sorry for going back on my word by I have to ask you, Sandra-=- http://sandradodd.com/haveto People make choices all the time.  Make better choices","messageBody":"<div id=\"ygrps-yiv-1895998255\">-=-I&#39;m sorry for going back on my word by I have to ask you, Sandra-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nPeople make choices all the time.  Make better choices concerning this discussion, please.  <br/>\n(for the benefit of others reading, this follows on several side notes to this member from me and two other moderators)<br/>\n<br/>\n<br/>\n-=-how is any different that I suggested a tutor, than you suggesting he try out school. Wouldn&#39;t the first choice be an easier, less traumatic way for him to find out if he truly wants or needs more academics?-=-<br/>\n<br/>\nIt&#39;s not school, as Joyce pointed out.<br/>\n<br/>\nTutors are very expensive, and are not at ALL a big building filled with other kids of similar ages wearing cool clothes, going to art and music classes and sports practices and having lunch together.  <br/>\n<br/>\nIt&#39;s QUITE likely that any unschooled child with no preparation could go into school and be making great grades before very long (if not the first day).  They might need to practice their handwriting, but that can be done in school, with the homework, and doesn&#39;t need to be done in advance.  They might need to learn math notation, but that too can be done on a need-to-know basis, and wouldn&#39;t take much checkup.   I&#39;ve had all three of my kids now take placement tests for math and take a community-college remedial math class, be confused at first, and then get an easy A.  Marty&#39;s in for-credit math classes now, and economics, still getting A&#39;s without much effort, and he&#39;s in classes with people who went to school for twelve, thirteen, fourteen years, took thousands of hours of school math classes, and are dropping out, failing or struggling in those classes.<br/>\n<br/>\nA tutor isn&#39;t necessary unless someone (child or adult) has a serious test to pass for some reason and wants to train for it with a coach.<br/>\n<br/>\nIf a parent isn&#39;t going to withhold food, safety or freedom because of bad grades, why would a child need a tutor?  Kids get tutors because parents are pressing them to compete and win, not knowing (or not wanting to know) that schools are competitions designed to have LOTS of losers.<br/>\n<br/>\nSchools create a few winners, and a whole lot of losers.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] wanting to feel normal","postDate":"1335976832","msgId":66972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5QzNFRkNCLTA2MjUtNEEyRS1BNDE2LUQwOTU5NDcwRDZEOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA3RDlDOTFFLTY5Q0MtNDUxMi05MUZGLUVBNDAxNDM3RDMxQkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGpucTFsNCtnM2ttQGVHcm91cHMuY29tPiA8MDdEOUM5MUUtNjlDQy00NTEyLTkxRkYtRUE0MDE0MzdEMzFCQHZlcml6b24ubmV0Pg=="},"prevInTopic":66971,"nextInTopic":66973,"prevInTime":66971,"nextInTime":66973,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=- I did read the page about this group but I think I need to read more and really figure all this out.-=- Joyce wrote:  -=-Reading about something isn t as","messageBody":"<div id=\"ygrps-yiv-62262538\">-=- I did read the page about this group but I think I need to read more and really figure all this out.-=-<br/>\n<br/>\nJoyce wrote:  -=-Reading about something isn&#39;t as learnigful as experiencing something.-=-<br/>\n<br/>\nI guess &quot;Read a little, try a little, wait a while, watch&quot; applies to participation on the list, too, only maybe it should have the &quot;try a little&quot; further down the list. :-)<br/>\n<br/>\nFor a couple of months I&#39;ve had a folder on my desktop to collect things for a FAQ for this list, because there are lots of wonderful things already written, and Joyce just wrote another one.  Rippy wrote something a while back that was AWESOME (though I didn&#39;t say so then, but I&#39;m saying so now and I intend to work it into the information people can get to when they join).<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/66419\">http://groups.yahoo.com/group/AlwaysLearning/message/66419</a><br/>\n<br/>\nBut whether I have one paragraph or fifteen pages, there are going to be people who ignore the group description, who see DO NOT POST without reading this  in big green letters, and who get an introductory e-mail and throw it away without reading it.  I don&#39;t know what to do about that.<br/>\n<br/>\nThere was a pre-test made one time, but I don&#39;t know where it is.  It had crazy questions about how big the list was, how old....  I can&#39;t find it by searching. Maybe someone else remembers a phrase that could dredge it up from our ten-and-a-half-year-old lake.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":39016202,"authorName":"Elizabeth","from":"&quot;Elizabeth&quot; &lt;Tealzabet@...&gt;","profile":"tealzabet","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal and feeling better instead!","postDate":"1335974189","msgId":66971,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucmxmZCtjYjlpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI3REM2RjBFLTk5RTktNEYwMy04MEVDLTY2QzZEMjM0NURCREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66970,"nextInTopic":66972,"prevInTime":66970,"nextInTime":66972,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"This is a huge thank you to this list, although most of you have never seen me post. My fab. kid is 18, doing great, and this fab mom needs a wee bit more","messageBody":"<div id=\"ygrps-yiv-634246099\">This is a huge thank you to this list, although most of you have never seen me post.  <br/>\n<br/>\nMy fab. kid is 18, doing great, and this fab mom needs a wee bit more space in her computer!   <br/>\n<br/>\nas always, great advise - he loved khanacademy and still goes in every now and then to play. ( he will im with friends sometimes while they play on it) oh what joy to watch the whole event!<br/>\n<br/>\nI am going to take myself off this list, but did not want to go before saying thank you from my cyber corner for being and holding the space for the voice of unschooling.<br/>\n<br/>\nLiz Teal<br/>\n<br/>\n-<br/>\n<blockquote><span title=\"qreply\"> &gt; Maybe you could make a list with him of the things he thinks he&#39;s missing out on, and look at ways to find those.  Maybe he could look at some Khan Academy videos<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.khanacademy.org/\">http://www.khanacademy.org/</a><br/>\n&gt; or if it&#39;s history and geography, maybe you could make a chart or get a world map or a poster of flags of nations and check off what you know about (what he knows about, or what the two of you or the family as a whole knows) and seek out info on the others.  <br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] wanting to feel normal","postDate":"1335970653","msgId":66969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3RDlDOTFFLTY5Q0MtNDUxMi05MUZGLUVBNDAxNDM3RDMxQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpucTFsNCtnM2ttQGVHcm91cHMuY29tPg==","referencesHeader":"PGpucTFsNCtnM2ttQGVHcm91cHMuY29tPg=="},"prevInTopic":66968,"nextInTopic":66970,"prevInTime":66968,"nextInTime":66970,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... Reading about something isn t as learnigful as experiencing something. While I think the description of the group is accurate and clear and useful to read","messageBody":"<div id=\"ygrps-yiv-573361194\">On May 1, 2012, at 9:12 PM, debwal777 wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I did read the page about this group but I think I need to read more and really figure all this out.<br/>\n<br/>\n </span></blockquote>Reading about something isn&#39;t as learnigful as experiencing something.<br/>\n<br/>\nWhile I think the description of the group is accurate and clear and useful to read before plunging in, it&#39;s hard to truly grasp what it&#39;s saying until someone has experienced how the list works for a while.<br/>\n<br/>\nPeople mostly know two kinds of groups. One is a social gathering where the number one rule is to help others feel welcome and comfortable. The other is where there&#39;s a clear division between the presenters of information (or entertainment) and the audience where the number one rule is to keep quiet unless invited to speak.<br/>\n<br/>\nAt first glance this list looks like a social gathering where anyone can ask a question and offer an opinion. But the reactions to opinions often feel like sarcastic reprimands to stay quiet unless you think you&#39;re qualified to be a teacher.<br/>\n<br/>\nIt&#39;s very confusing to most people. And there isn&#39;t a way to explain what this group is like when there isn&#39;t anything common to compare it to.<br/>\n<br/>\nIt&#39;s been called a discussion but it isn&#39;t really. In a discussion people are tying to come to a mutual understanding of a variety of views. But on this list we&#39;re trying to help people understand a very specific philosophy.<br/>\n<br/>\nIt&#39;s been called a place to get an unschooling view on issues. But people misinterpret that to mean &quot;an unschooler&#39;s&quot; view because the list looks like a social gathering. (Because in social groups all views that don&#39;t make someone uncomfortable are welcome.) And then when their suggestions are reacted to with &quot;That&#39;s not unschooling,&quot; it gets interpreted as &quot;You&#39;re not an unschooler.&quot; Or &quot;You&#39;re wrong.&quot; (Which are unwelcoming and uncomfortable in social gatherings.)<br/>\n<br/>\nI&#39;ve likened it to a Zen center to paint a picture of a place where you expect and want to get information that&#39;s from a singular point of view. Not in a religious or classroom doctrine way where you&#39;re expected to believe it without question. But in a clear, focused way to cut out all the clutter. And then people can take that home and do what they want with it. But Zen center still has that classroom feel to it except the criteria for becoming an &quot;expert&quot; aren&#39;t clear.<br/>\n<br/>\nMaybe this helps. After having helped write a dozen of these over the years, I&#39;m not sure if it really can be made clearer.<br/>\n==============<br/>\nThis list is different. The rules are not those of a classroom or a social gathering or anything you&#39;re likely to have encountered before. To avoid getting your feelings unintentionally hurt:<br/>\n<br/>\nRead for a few weeks.<br/>\n<br/>\nAs you read, look for the following:<br/>\n<br/>\nAnswers come from an unschooling perspective. NOT from the perspective of unschoolers! Those who label themselves unschoolers may have different ideas about what unschooling is! But answers that are either principles of the radical unschooling philosophy or ways families have put the principles into practice to tackle a problem.<br/>\n<br/>\nAll posts sent to the list are subject to analysis based on the unschooling philosophy. If an idea or a wording feels like it could muddy someone&#39;s understanding of the unschooling philosophy or steer them away from the direction they want unschooling to help them keep heading in, it will be pulled apart and analyzed on the list.<br/>\n<br/>\nThe unschooling philosophy is not a set of rules. It is a set of principles used to make the choices that will keep someone steering toward joyful living and learning.<br/>\n<br/>\nOn this list the unschooling philosophy is expanded into parenting.<br/>\n==============<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] wanting to feel normal","postDate":"1335969935","msgId":66968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyMDU4NjhCLTVEOTAtNDQwMC05ODE5LTcyMjEzRTY5RTNCRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpucTFsNCtnM2ttQGVHcm91cHMuY29tPg==","referencesHeader":"PGpucTFsNCtnM2ttQGVHcm91cHMuY29tPg=="},"prevInTopic":66966,"nextInTopic":66969,"prevInTime":66967,"nextInTime":66969,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... Have you seen every suggestion of classes and tutors and outside instructors met with cautions not to do that? Or is it only in specific cases? What s","messageBody":"<div id=\"ygrps-yiv-614811708\">On May 1, 2012, at 9:12 PM, debwal777 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Do we always have to be the ones to guide our children into learning experiences?<br/>\n<br/>\n </span></blockquote>Have you seen every suggestion of classes and tutors and outside instructors met with cautions not to do that?<br/>\n<br/>\nOr is it only in specific cases? What&#39;s different about this instance?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s what he wants ultimately, to be like his friends and get prepared for life.<br/>\n<br/>\n </span></blockquote>His friends are going to school, not being tutored.<br/>\n<br/>\nHe has heard the belief that school prepares people for life. Are you saying unschooling won&#39;t prepare someone for life? And that school will?<br/>\n<br/>\nI think it&#39;s clearer to say unschooling allows kids to grow their skills and knowledge by living in the world. Just as kids grow their knowledge of reading and math by reading and doing math. They aren&#39;t preparing to read or preparing to do math. They&#39;re doing it. Unschooled kids aren&#39;t preparing for life. They&#39;re living it. They are step by step learning to be more independent but that shouldn&#39;t be equated with preparing for life. That just muddies the thinking.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why would his mother deny him that? Why would you?<br/>\n<br/>\n </span></blockquote>Why would you suggest tutoring when he asked for school? Why do you see them as the same? Experiencing a tutor isn&#39;t the same as experiencing school like his friends.<br/>\n<br/>\nEquating the two suggests a sticking point in trusting unschooling that you may not realize you have.<br/>\n<br/>\nMy unschooling was stuck for a long time by my being drawn to the satisfying feeling that learning can (supposedly) come in neat packages . That it can have a well laid out path through just the important stuff, with a clear endpoint when you&#39;re done with that chunk, and feedback on how well you&#39;re doing.<br/>\n<br/>\nBy contrast, unschooling is chaotic. There&#39;s no sense that kids are making progress or even headed in a particular direction. It isn&#39;t quantifiable. It&#39;s mostly touchy feely.<br/>\n<br/>\nThe idea of formal learning is so satisfying: It&#39;s so captivating that you can (supposedly) read the right stuff, have a teacher tell you the right stuff, practice it a bit and you&#39;ve got it.<br/>\n<br/>\nBut the reality is that it&#39;s a very ineffective way to learn. Our brains don&#39;t learn that way very well. Even when formal instruction &quot;works&quot;, e.g., someone has memorized and can spit back what they were supposed to, they don&#39;t necessarily understand it.<br/>\n<br/>\nBut because the idea of letting someone pour in &quot;the stuff you need&quot; is so captivating, kids can be drawn to the idea too. It&#39;s especially common at some point in the middle school years. That&#39;s when kids generally want something more &quot;meaty&quot; than free play. And they  can *think* kids in school are getting what the child wants for himself.<br/>\n<br/>\nSomeone who trusts natural learning will know that sometimes kids get worried about not learning enough. Kids don&#39;t have any basis for trusting unschooling if everyone around them is doing school and learning things the child doesn&#39;t know.<br/>\n<br/>\nSomeone who trusts natural learning will know from their kid&#39;s choices whether the child is drawn to formal learning or not. The child will be choosing nonfiction for fun. They will be more focused on getting a chunk of learning. They will ask for more classes. They will be oriented toward more rigorous ways of learning something. There will be clues.<br/>\n<br/>\nSomeone who trusts natural learning won&#39;t&#39; immediately, without any other indication, assume &quot;I want to try school,&quot; means &quot;I want formal learning.&quot;<br/>\n<br/>\nSo the &quot;doesn&#39;t fit with unschooling philosophy&quot; alarm bells aren&#39;t triggered by &quot;tutor&quot;. They&#39;re triggered by someone reading &quot;I want to try school,&quot; or &quot;I&#39;m worried I&#39;m not learning enough,&quot; and responding with tutors. An unschooling approach would be to help a child explore that worry to find out if it has some foundation rather than responding in ways that support the child&#39;s worry as having a sound basis. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do<br/>\n&gt; you think it&#39;s an u schooling sort of weakness to go to someone else for instruction?<br/>\n<br/>\n </span></blockquote>But the child wasn&#39;t asking for help learning a specific chunk of knowledge like Tae Kwon Do or throwing a pot or differential calculus or interpreting Shakespearean sonnets. The child was worried about not knowing as much as his peers. So a mom responding with the idea of tutors is saying the child&#39;s right, he can&#39;t learn all he needs to know through unschooling.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":525780168,"authorName":"debwal777","from":"&quot;debwal777&quot; &lt;debwal777@...&gt;","profile":"debwal777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal","postDate":"1335966246","msgId":66970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucmRuNis5Z3FwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdBQjczNjEzLTUwREItNEM1QS1CQUVGLURFQTdFRkZGMEJDREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66969,"nextInTopic":66971,"prevInTime":66969,"nextInTime":66971,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"I m sorry for going back on my word by I have to ask you, Sandra, how is any different that I suggested a tutor, than you suggesting he try out school.","messageBody":"<div id=\"ygrps-yiv-707971388\">I&#39;m sorry for going back on my word by I have to ask you, Sandra, how is any different that I suggested a tutor, than you suggesting he try out school. Wouldn&#39;t the first choice be an easier, less traumatic way for him to find out if he truly wants or needs more academics?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-He thinks he should be able to crack open a 7th grade math or english textbook and understand it. He wants to know the terms so he doesn&#39;t feel stupid. He is very bright and competent in his everyday life, but he sees this stuff in the books and feels incompetent and overwhelmed. He feels like he is on the outside.-=-<br/>\n&gt; <br/>\n&gt; I taught 7th grade English.  Tell him at least half the 7th graders can&#39;t do that.  It&#39;s part of the deal.  School is a competition, and 1/3 of the kids are set in advance to get D&#39;s and F&#39;s. No matter how hard kids work, they cannot all get A&#39;s.  It&#39;s not the way a race works.<br/>\n&gt; <br/>\n&gt; And because teachers get paid for being there (rather than for results) and because kids know they can&#39;t all get good grades, there is a TON of foot-dragging, and by the time most kids are 12 they know that very well; they&#39;re experts and sloughing and dodging.<br/>\n&gt; <br/>\n&gt; On the other hand, there are people who prefer to follow the directions exactly, to do what other people tell them to do, to do it the most expedient way and get their points/pay/grades and not think about it.  And that&#39;s not a crime or a sin.  And if he&#39;s that way, he might thrive in school.  But whether he stays and thrives or visits and comes home, I think he would know more from going to school, about how school works and about how much he really does know.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: wanting to feel normal","postDate":"1335961425","msgId":66966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucjkwaCtldDhkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpucTFsNCtnM2ttQGVHcm91cHMuY29tPg=="},"prevInTopic":66965,"nextInTopic":66968,"prevInTime":66965,"nextInTime":66967,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... ******************* But why Start there - with a tutor, no less? Even if someone wants to study something in a formal way, there are options other than","messageBody":"<div id=\"ygrps-yiv-37762938\">&quot;debwal777&quot; &lt;debwal777@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; why would it be so awful to ask the kid if he would like to try a formal subject?<br/>\n </span></blockquote>*******************<br/>\n<br/>\nBut why Start there - with a tutor, no less? Even if someone wants to study something in a formal way, there are options other than &quot;get a tutor&quot; and a kid who&#39;s feeling like he might have missed something in school may not want anything close to that. He might, as several people have pointed out, just need some reassurance - or reassurance and a quickie run-through of &quot;what the other kids are learning&quot;. It doesn&#39;t take much more than a quick run-through to catch up with elementary education. Studying a &quot;formal subject&quot; shouldn&#39;t come before that whole process. <br/>\n<br/>\nLet me give you a counter example. Offering to get a tutor would be just as nonsensical as saying &quot;oh, you want to be like other kids and learn important stuff, so you&#39;re going to join the football team.&quot; Because that&#39;s what a normal school education consists of, right? Sports. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;That&#39;s what he wants ultimately, to be like his friends and get prepared for life.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nI bet his friends don&#39;t have tutors. And there&#39;s a biiiiiiiiig difference between &quot;getting an education&quot; and getting prepared for life - the biggest complaint teachers, parents, college professors and employers all have about school is it Doesn&#39;t prepare kids for life. That&#39;s something to talk about with a kid, maybe - what gets left out in school, if he&#39;s really concerned about the &quot;ready for life&quot; part. But I&#39;m guessing he&#39;s heard some of the commonly repeated folderol about school and it&#39;s worrying him. Every time one of his friends has asked a parent &quot;why do I have to go to school&quot; they&#39;ve been told something like &quot;because it&#39;s important for life&quot; (get into college, make you smart, learn what you need to know...) and someone, maybe several someones, has repeated that stuff to this kid and he&#39;s worried about it. Or maybe he&#39;s seen it on tv.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Why would his mother deny him that?<br/>\n<br/>\n </span></blockquote>Honestly, if my daughter asked about going to school and wanting to be like other kids, getting her a tutor would be Below putting her in school on the options list. Trying school would most likely meet whatever needs and desires she was trying to express than a tutor. <br/>\n<br/>\nBut if she said she wanted to learn a whoooooole lot about something specific, that would be a different matter. Then I&#39;d start looking into resources which would let her study that thing, including other people - a mentor or tutor. My stepson has taken classes and studied with individuals on specific subjects - iron mongery and silver smithing and wood carving. It&#39;s not that unschooling is somehow &quot;against&quot; teaching and teachers, it&#39;s that their use is very limited and specific. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335952620","msgId":66965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGOEQ0NTIxLUY3MzUtNDhEQi1BNzcwLUY0RTg5NDQzRkExQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpucWdrZCtuYm84QGVHcm91cHMuY29tPg==","referencesHeader":"PGpucWdrZCtuYm84QGVHcm91cHMuY29tPg=="},"prevInTopic":66964,"nextInTopic":66966,"prevInTime":66964,"nextInTime":66966,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=-Also, what kinds of things might be helpful to say to him?-=- Let s go to Florida!  (Well... depending where you live.) Get out of the house, maybe.  Go","messageBody":"<div id=\"ygrps-yiv-1167353421\">-=-Also, what kinds of things might be helpful to say to him?-=-<br/>\n<br/>\n&quot;Let&#39;s go to Florida!&quot;  (Well... depending where you live.)<br/>\nGet out of the house, maybe.  Go somewhere as a family--to visit friends, or to an unschooling conference or gathering or campout, to meet and be around other unschoolers.<br/>\n<br/>\nGo to a play or a sports event or concert in a nearby town, and stay in an inexpensive hotel overnight, even. <br/>\n<br/>\nBring more interesting things and people home, or go out to more interesting things and people.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335951952","msgId":66964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBMURBM0I1LTExMjUtNEIzQy1BNDA1LUQ2MDkxRTY3MjhDMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpucWNtdCtxNTZzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpucWNtdCtxNTZzQGVHcm91cHMuY29tPg=="},"prevInTopic":66962,"nextInTopic":66965,"prevInTime":66963,"nextInTime":66965,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=-I don t think it s a bad thing to be so serious, but I think it s not a good thing to put this personality into a school setting where they will use those","messageBody":"<div id=\"ygrps-yiv-1586741684\">-=-I don&#39;t think it&#39;s a bad thing to be so serious, but I think it&#39;s not a good thing to put this personality into a school setting where they will use those traits for their ends, which I don&#39;t think are conducive to growing and learning. If he ends up in school I will be offering that perspective in hopes of helping him not get swallowed up in hoop jumping for gold stars.-=-<br/>\n<br/>\nThere&#39;s a difference between going to school by choice and being put there and left there and pressed to jump hoops.  Some kids play school as they would a video game. :-)<br/>\n<br/>\nHis personality might be good for the military, and it can be easier to get into that more directly from school.  If there is an ROTC program at the local schools, that might be of interest to him.  One of our unschooled friends became a marine, but because he had been homeschooled, he needed 15 hours of college credit before he could enlist.  He was frustrated about that at the time, but it worked out, and he&#39;s been to Afghanistan and back.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":69128708,"authorName":"danajeh","from":"&quot;danajeh&quot; &lt;danajeh@...&gt;","profile":"danajeh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal","postDate":"1335936461","msgId":66962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucWdrZCtuYm84QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhOeWVnTGVUU0FTM3NjeEFVSHBuY1dKZDg5MEJQZj10c3FESmZ1enNmYk02Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66961,"nextInTopic":66964,"prevInTime":66961,"nextInTime":66963,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... I d love some ideas for ways to make his life so glorious that he d never want to give it up :-)  We are in a time right now where the thing that he has","messageBody":"<div id=\"ygrps-yiv-1941928918\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Be really hard on yourself - challenge yourself to find ways to not just<br/>\n&gt; &quot;meet his needs&quot; but make his life so glorious that he&#39;d never want to give<br/>\n&gt; it up.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I&#39;d love some ideas for ways to make his life so glorious that he&#39;d never want to give it up :-)  We are in a time right now where the thing that he has been immersed in for quite a while (Minecraft) has lost some of it&#39;s challenge, it&#39;s excitement of new things to discover and he hasn&#39;t found the next thing(s). He is trying new things: a writing workshop, horse riding lessons, volunteering at the library, an outdoor skills class, a drama class.  But nothing has grabbed him yet, and he is in that restless spot.  Also, what kinds of things might be helpful to say to him?</div>","specialLinks":[]},{"userId":69128708,"authorName":"danajeh","from":"&quot;danajeh&quot; &lt;danajeh@...&gt;","profile":"danajeh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal","postDate":"1335932445","msgId":66961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucWNtdCtxNTZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdBQjczNjEzLTUwREItNEM1QS1CQUVGLURFQTdFRkZGMEJDREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66960,"nextInTopic":66962,"prevInTime":66960,"nextInTime":66962,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... He is very much this personality, without the and not think about it. After a year of 1/2 day kindergarten I encouraged him to go to a 2 day/ wk","messageBody":"<div id=\"ygrps-yiv-201268706\"><blockquote><span title=\"ireply\">&gt; On the other hand, there are people who prefer to follow the directions exactly, to do what other people tell them to do, to do it the most expedient way and get their points/pay/grades and not think about it.  And that&#39;s not a crime or a sin.  And if he&#39;s that way, he might thrive in school.  But whether he stays and thrives or visits and comes home, I think he would know more from going to school, about how school works and about how much he really does know.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>He is very much this personality, without the &quot;and not think about it.&quot; After a year of 1/2 day kindergarten I encouraged him to go to a 2 day/ wk alternative school instead of regular 1st grade because he was exhausting himself with paying attention to the teacher&#39;s every move and trying to do everything exactly right. I don&#39;t think it&#39;s a bad thing to be so serious, but I think it&#39;s not a good thing to put this personality into a school setting where they will use those traits for their ends, which I don&#39;t think are conducive to growing and learning. If he ends up in school I will be offering that perspective in hopes of helping him not get swallowed up in hoop jumping for gold stars.</div>","specialLinks":[]},{"userId":69128708,"authorName":"danajeh","from":"&quot;danajeh&quot; &lt;danajeh@...&gt;","profile":"danajeh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal","postDate":"1335929336","msgId":66960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucTlsbytjajJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhOeWVnTGVUU0FTM3NjeEFVSHBuY1dKZDg5MEJQZj10c3FESmZ1enNmYk02Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66959,"nextInTopic":66961,"prevInTime":66959,"nextInTime":66961,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"We ve had occasional conversations over the years about learning, education, school, homeschool, unschool, how many things he has learned since he started","messageBody":"<div id=\"ygrps-yiv-737323426\">We&#39;ve had occasional conversations over the years about learning, education, school, homeschool, unschool, how many things he has learned since he started playing Minecraft :-)  When he was upset wasn&#39;t the time to talk about it because he was simply feeling bad, but we talked a bit about it today.  He seems to understand, but still says he just wants to go to school. <br/>\n<br/>\nI feel like he is in the midst of a huge developmental leap, and his growing awareness of the world, his desire to get serious, and his desire to widen his social circle are completely normal and wonderful.  If there were no schools, how would a person move through this stage?  What would he be doing that would be satisfying his needs? Going to school is so common that maybe it seems to him that if he&#39;s having a bumpy patch it&#39;s because he&#39;s not in school and the solution is to go to school.  <br/>\n<br/>\nI had thought of The Teenage Liberation Handbook and checked it out of the library recently, but he didn&#39;t pick it up.  I first read it when he was very young and skimming it now my impression is that it is from the perspective of a person in school needing to shift their thinking and get out.  My son has always had input into where he spends his days.  His complaint is too much choice, too much free time (even though I think he is quite busy).  He just wants someone else to tell him what to do, he says.<br/>\n<br/>\nAs far as being a little grown-up and thinking too much about his future, he seems to have this as part of his personality.  Every time we go to Subway he is paying close attention to what they are doing, saying that he is going to get a job there.  He looked up the laws which say he needs to be 14.  In order to have a better chance of getting hired he decided to volunteer at the library so he&#39;d have some references and work experience.  He is discouraged, though, that the volunteering at the library is a bit lame (prepping the little kids&#39; storytime craft projects and, in a month, sitting around waiting for kids to bring their summer reading booklets in to collect prizes.) <br/>\n<br/>\nMy idea is that the thing that would set him to thriving is a mentor who would take him under their wing and/or one or two really like-minded friends that he could set off into exploring the world with.  <br/>\n<br/>\nI&#39;m sorry that I&#39;m not good at cutting and pasting quotes to reply to.  I&#39;m appreciating everyone&#39;s replies.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335924921","msgId":66959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdBQjczNjEzLTUwREItNEM1QS1CQUVGLURFQTdFRkZGMEJDREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpucTN1ditjMW82QGVHcm91cHMuY29tPg==","referencesHeader":"PGpucTN1ditjMW82QGVHcm91cHMuY29tPg=="},"prevInTopic":66958,"nextInTopic":66960,"prevInTime":66958,"nextInTime":66960,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=-He thinks he should be able to crack open a 7th grade math or english textbook and understand it. He wants to know the terms so he doesn t feel stupid. He","messageBody":"<div id=\"ygrps-yiv-162640494\">-=-He thinks he should be able to crack open a 7th grade math or english textbook and understand it. He wants to know the terms so he doesn&#39;t feel stupid. He is very bright and competent in his everyday life, but he sees this stuff in the books and feels incompetent and overwhelmed. He feels like he is on the outside.-=-<br/>\n<br/>\nI taught 7th grade English.  Tell him at least half the 7th graders can&#39;t do that.  It&#39;s part of the deal.  School is a competition, and 1/3 of the kids are set in advance to get D&#39;s and F&#39;s. No matter how hard kids work, they cannot all get A&#39;s.  It&#39;s not the way a race works.<br/>\n<br/>\nAnd because teachers get paid for being there (rather than for results) and because kids know they can&#39;t all get good grades, there is a TON of foot-dragging, and by the time most kids are 12 they know that very well; they&#39;re experts and sloughing and dodging.<br/>\n<br/>\nOn the other hand, there are people who prefer to follow the directions exactly, to do what other people tell them to do, to do it the most expedient way and get their points/pay/grades and not think about it.  And that&#39;s not a crime or a sin.  And if he&#39;s that way, he might thrive in school.  But whether he stays and thrives or visits and comes home, I think he would know more from going to school, about how school works and about how much he really does know.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":69128708,"authorName":"danajeh","from":"&quot;danajeh&quot; &lt;danajeh@...&gt;","profile":"danajeh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal","postDate":"1335923487","msgId":66958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucTN1ditjMW82QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpucHJtaitxMzdxQGVHcm91cHMuY29tPg=="},"prevInTopic":66957,"nextInTopic":66959,"prevInTime":66957,"nextInTime":66959,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... He thinks he should be able to crack open a 7th grade math or english textbook and understand it.  He wants to know the terms so he doesn t feel stupid.","messageBody":"<div id=\"ygrps-yiv-822186648\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; What kinds of things does he think he should know? Have other kids been pestering and teasing him? Maybe it would help to look over an 8th grade curriculum so he can see what he Does already know and reassure him he&#39;ll be able to catch up quickly with the rest.<br/>\n<br/>\n </span></blockquote>He thinks he should be able to crack open a 7th grade math or english textbook and understand it.  He wants to know the terms so he doesn&#39;t feel stupid.  He is very bright and competent in his everyday life, but he sees this stuff in the books and feels incompetent and overwhelmed.  He feels like he is on the outside.<br/>\n<br/>\nI don&#39;t think he&#39;s been pestered or teased. He&#39;s watching some tween/teen sitcoms like ANT Farm that involve school, and he has a skype/minecraft friend in England who goes to Catholic school but he says that they don&#39;t talk about school.  Many of the homeschool and unschool kids he knows locally have hit this age and signed up for school, so maybe that seems like the logical progression of things to him.  I also get the sense that he has outgrown what he&#39;s been doing (random classes, activities, clubs, social get-togethers, his minecraft obsession.) I wish that there were common, visible alternatives to school...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; It might help him to know that other unschoolers who have gone to jr high or high school have caught up quickly - embarrassingly so from the school&#39;s perspective. It could help him to discover that himself - but if he&#39;s nervous, don&#39;t set him up to fail, get some information about the local school curriculum. Or get one of the standardized tests and go over the questions with him. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I have rounded up various materials but we haven&#39;t hit on the right thing, I guess.  I&#39;m a bit concerned that the quantity of choices is itself overwhelming -internet websites, various books and workbooks, puzzles/games, Kahn Academy, etc. He says he just wants someone to tell him what to do...maybe I need that book that Daniel Greenberg used at SVS when the kids wanted to learn math!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335922317","msgId":66957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwRDk3MDM5LTAxQUMtNDFENC05NzAwLTc0QTQ1RDlGRjE0NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpucTFsNCtnM2ttQGVHcm91cHMuY29tPg==","referencesHeader":"PGpucTFsNCtnM2ttQGVHcm91cHMuY29tPg=="},"prevInTopic":66956,"nextInTopic":66958,"prevInTime":66956,"nextInTime":66958,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=-With all due respect, as I m aware of your reputation in the unschooling world, why would it be so awful to ask the kid if he would like to try a formal","messageBody":"<div id=\"ygrps-yiv-575425974\">-=-With all due respect, as I&#39;m aware of your reputation in the unschooling world, why would it be so awful to ask the kid if he would like to try a formal subject? That&#39;s what he wants ultimately, to be like his friends and get prepared for life. Why would his mother deny him that? Why would you? -=-<br/>\n<br/>\nI let this post through because I had already returned three today.<br/>\n<br/>\nIf a child is not &quot;getting prepared for life,&quot; then unschooling isn&#39;t going very well.  The purpose of this discussion is CLEARLY stated and it&#39;s not to help parents get kids into school, though there were some suggestions (from experienced unschoolers) about ways to go about that if it&#39;s really what he wants, and so neither I nor anyone else was recommending denying him anything.<br/>\n<br/>\nMainstream advice from people who don&#39;t know much about unschooling is available all over the place, from neighbors, women&#39;s magazines, TV talk shows.   Good unschooling advice is rare even within unschooling discussions, and the way to keep a discussion like this one clear and focussed is to discuss ideas in light of which are better and which are worse--which are getting warm, and which are moving in a direction that does NOT clarify or contribute to anyone&#39;s understanding of unschooling.<br/>\n<br/>\n-=-Do we always have to be the ones to guide our children into learning experiences? -=-<br/>\n<br/>\nWe should be always providing an environment in which learning flourishes.<br/>\n<br/>\n&quot;Guiding children into learning experiences&quot; isn&#39;t a  good description of unschooling, but as to paying attention to whether our children are learning and whether their environments are filled with input and opportunities, yes, that falls to us first and foremost.  We won&#39;t be the only people from whom they will learn, but we should be right up front there.<br/>\n<br/>\n-=-I said I was gonna stop posting for awhile and I think that would be best. -=-<br/>\n<br/>\nYes, it&#39;s often best for people to do what they say they&#39;re going to do.<br/>\n<br/>\nWhat I said I was going to do ten and a half years ago was to maintain this discussion and keep it on topic.  Others help me to do that.  That&#39;s why your post was taken apart.  I could have returned it as I did some others today, but honestly, I was trying to be nice.  And Pam Sorooshian was trying to give you a chance to see what the problems were with your suggestions, as to helping others understand unschooling.<br/>\n<br/>\n-=-Maybe I don&#39;t understand how this group operates-=-<br/>\n<br/>\nEven just today there have been posts about how this group operates.<br/>\n<br/>\n-=- I&#39;ve been on other unschooling sites and never had a problem with anyone, or any opinion I brought to the table.-=-<br/>\n<br/>\nWe have no obligation to be like other unschooling sites.  If there are places you like better, those are where you should be, I guess.<br/>\n<br/>\n-=- I did read the page about this group but I think I need to read more and really figure all this out.-=-<br/>\n<br/>\nThere are several pages discussing this group, why it works as it does, what&#39;s expected, what&#39;s welcome, and what is not.<br/>\n<br/>\nIt&#39;s really fine for people to read without posting.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":525780168,"authorName":"debwal777","from":"&quot;debwal777&quot; &lt;debwal777@...&gt;","profile":"debwal777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal","postDate":"1335921124","msgId":66956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucTFsNCtnM2ttQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYzRTQ0QkJBLTcyNzItNEVGMi1BQUZDLThDNzBGMDI1MzQ3RUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66955,"nextInTopic":66957,"prevInTime":66955,"nextInTime":66957,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"With all due respect, as I m aware of your reputation in the unschooling world, why would it be so awful to ask the kid if he would like to try a formal","messageBody":"<div id=\"ygrps-yiv-1150687791\">With all due respect, as I&#39;m aware of your reputation in the unschooling world, why would it be so awful to ask the kid if he would like to try a formal subject? That&#39;s what he wants ultimately, to be like his friends and get prepared for life. Why would his mother deny him that? Why would you? Do you think it&#39;s an u schooling sort of weakness to go to someone else for instruction? Do we always have to be the ones to guide  our children into learning experiences? Why not ask him if he&#39;s interested is all I&#39;m saying. I&#39;m not clear why all the defensiveness turned up. I apologize if I was out of place but I just wanted to add a different idea into the mix. There&#39;s no need to chastise me for it I am not your child, although that&#39;s the tone you took with me. <br/>\n<br/>\nI said I was gonna stop posting for awhile and I think that would be best. Maybe I don&#39;t understand how this group operates. I&#39;ve been on other unschooling sites and never had a problem with anyone, or any opinion I brought to the table. I did read the page about this group but I think I need to read more and really figure all this out.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-Maybe you could get him a tutor for the subjects he thinks he&#39;s missing. Maybe start with one subject at a time. Then if he&#39;s serious about it, the you know he needs to be given the opportunity to study the subject with you, your spouse, or maybe a friend who knows a lot about the subject. I don&#39;t think he hates homeschool or anything I think he&#39;s just starting to think like a little grown up about his future. That&#39;s great right? You wanted that for him I would think, right? Don&#39;t be hard on yourself either just do what you can to meet his needs at the place where he is right now. -=-<br/>\n&gt; <br/>\n&gt; I&#39;m glad Pam responded to this so thoroughly.  It really is a bunch of mainstream &quot;supportive&quot; kind of stuff, and not a good unschooling response.<br/>\n&gt; <br/>\n&gt; -=- I don&#39;t think he hates homeschool or anything...-=-<br/>\n&gt; <br/>\n&gt; Really?  There was nothing in there except indication that he felt betrayed and unprepared.  Sounds like he&#39;s having a negative reaction, but not to &quot;homeschool.&quot;<br/>\n&gt; <br/>\n&gt; Unschooling needs to be rich, full, vibrant and BIG.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wonder\">http://sandradodd.com/wonder</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/misconceptions\">http://sandradodd.com/misconceptions</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -=- I think he&#39;s just starting to think like a little grown up about his future. -=-<br/>\n&gt; <br/>\n&gt; If people don&#39;t treat their children &quot;like little children,&quot; there won&#39;t be a point when they start to think like a little grown up.  People.   Treat them respectfully as the individuals they are, and make their lives whole and real.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335920267","msgId":66955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzRTQ0QkJBLTcyNzItNEVGMi1BQUZDLThDNzBGMDI1MzQ3RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpucHI2cSs3Z21jQGVHcm91cHMuY29tPg==","referencesHeader":"PGpucHI2cSs3Z21jQGVHcm91cHMuY29tPg=="},"prevInTopic":66954,"nextInTopic":66956,"prevInTime":66954,"nextInTime":66956,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=-Maybe you could get him a tutor for the subjects he thinks he s missing. Maybe start with one subject at a time. Then if he s serious about it, the you know","messageBody":"<div id=\"ygrps-yiv-1734797674\">-=-Maybe you could get him a tutor for the subjects he thinks he&#39;s missing. Maybe start with one subject at a time. Then if he&#39;s serious about it, the you know he needs to be given the opportunity to study the subject with you, your spouse, or maybe a friend who knows a lot about the subject. I don&#39;t think he hates homeschool or anything I think he&#39;s just starting to think like a little grown up about his future. That&#39;s great right? You wanted that for him I would think, right? Don&#39;t be hard on yourself either just do what you can to meet his needs at the place where he is right now. -=-<br/>\n<br/>\nI&#39;m glad Pam responded to this so thoroughly.  It really is a bunch of mainstream &quot;supportive&quot; kind of stuff, and not a good unschooling response.<br/>\n<br/>\n-=- I don&#39;t think he hates homeschool or anything...-=-<br/>\n<br/>\nReally?  There was nothing in there except indication that he felt betrayed and unprepared.  Sounds like he&#39;s having a negative reaction, but not to &quot;homeschool.&quot;<br/>\n<br/>\nUnschooling needs to be rich, full, vibrant and BIG.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wonder\">http://sandradodd.com/wonder</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/misconceptions\">http://sandradodd.com/misconceptions</a><br/>\n<br/>\n<br/>\n-=- I think he&#39;s just starting to think like a little grown up about his future. -=-<br/>\n<br/>\nIf people don&#39;t treat their children &quot;like little children,&quot; there won&#39;t be a point when they start to think like a little grown up.  People.   Treat them respectfully as the individuals they are, and make their lives whole and real.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335919111","msgId":66954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOeWVnTGVUU0FTM3NjeEFVSHBuY1dKZDg5MEJQZj10c3FESmZ1enNmYk02Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpucHI2cSs3Z21jQGVHcm91cHMuY29tPg==","referencesHeader":"PGpucDZqMStqbnY0QGVHcm91cHMuY29tPgk8am5wcjZxKzdnbWNAZUdyb3Vwcy5jb20+"},"prevInTopic":66953,"nextInTopic":66955,"prevInTime":66953,"nextInTime":66955,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... This seems like an over-reaction and not what I d recommend as a first response to his concerns. Seems like the first response would be to reassure him and","messageBody":"<div id=\"ygrps-yiv-2091675766\">On Tue, May 1, 2012 at 4:22 PM, debwal777 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debwal777@...\">debwal777@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe you could get him a tutor for the subjects he thinks he&#39;s missing.<br/>\n&gt; Maybe start with one subject at a time.<br/>\n<br/>\n<br/>\n </span></blockquote>This seems like an over-reaction and not what I&#39;d recommend as a first<br/>\nresponse to his concerns. Seems like the first response would be to<br/>\nreassure him and have some good conversations about schooling and<br/>\nunschooling - many kids (especially boys) grow up unschooled and never<br/>\nreally even consider much about why their parents made that choice. To him,<br/>\nit probably feels like the parents chose to &quot;let him just play&quot; all the<br/>\ntime and maybe like his parents didn&#39;t even care about &quot;learning.&quot; He would<br/>\nvery possibly benefit from some grounding in the basics of unschooling.<br/>\n<br/>\nSecond - instead of almost instantly going along with turning his learning<br/>\nover to someone else - a school or a tutor - I&#39;d help him consider that he<br/>\ncan take the initiative to learn about anything he wants to learn about.<br/>\nI&#39;d definitely give him Grace Llewelyn&#39;s book, &quot;The Teenage Liberation<br/>\nHandbook,&quot; (might want to suggest he skip the first chapter or at least<br/>\ngive him the heads up that the rest of the book is very different). The<br/>\nTeenage Liberation Handbook&#39;s second half is ALL about ways to learn<br/>\noutside of school.<br/>\n<br/>\nThird - IF and only IF he&#39;s seriously concerned about having &quot;missed out&quot;<br/>\non certain subjects and only IF he continues to care about that after steps<br/>\none and two above, you might get the &quot;What Your X-Grader Should Know&quot; books<br/>\nand he could read those starting with the kindergarten one - that would<br/>\n&quot;catch him up&quot; through 6th grade (he&#39;s 12, right?). They are pretty easy<br/>\nreading and he could choose how much or how little he wanted to read from<br/>\neach book. IF he decided to try this, remember to stay light and easy about<br/>\nit - he might change his mind halfway through the first book. Don&#39;t buy<br/>\nthem all at once! Talk about this as going over &quot;stuff taught in schools.&quot;<br/>\n<br/>\n<br/>\nThen if he&#39;s serious about it, the you know he needs to be given the<br/>\n<blockquote><span title=\"ireply\"> &gt; opportunity to study the subject with you, your spouse, or maybe a friend<br/>\n&gt; who knows a lot about the subject.<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;d try not to even talk about &quot;subjects&quot; at first. Talk about what he DOES<br/>\nknow. This might be a time to talk about what you think is wrong with<br/>\nschools - a bit - not in a scary &quot;school will ruin you&quot; way - but to help<br/>\nhim understand why you chose unschooling. He might like to read &quot;Dumming us<br/>\nDown&quot; by John Gatto - it is about schooling and it might help him to<br/>\nunderstand some of the problems with schooling.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t think he hates homeschool or anything I think he&#39;s just starting<br/>\n&gt; to think like a little grown up about his future.<br/>\n<br/>\n<br/>\n </span></blockquote>That sounds pretty condescending - a &quot;little grownup?&quot; I think you meant he<br/>\nis growing up and starting to think more &quot;meta&quot; - big picture - and not<br/>\nalways be so completely &quot;in the moment&quot; as littler kids usually are. He<br/>\nmight think about this a bit and be concerned and then get back into his<br/>\nwonderful unschooling life and forget about it for a year or two - I&#39;ve<br/>\nseen that happen many times. Parents should be sure he HAS a wonderful<br/>\nunschooling life. His life should be so supportive and sparkly and so right<br/>\nfor him that he would be really loathe to give it up.THAT is unschooling.<br/>\n<br/>\nThat&#39;s great right? You wanted that for him I would think, right?<br/>\n<br/>\n<br/>\nI doubt she wanted him worrying about his future at 12 years old. It is<br/>\npointless and not really very healthy. He should be thinking about what he<br/>\nloves to do NOW and they should be supporting and encouraging and expanding<br/>\non that - not worrying about what will happen when he&#39;s grown up. WAY too<br/>\nsoon for that kind of concern. In fact, I&#39;d TELL him that - that it is okay<br/>\nnot to be worrying about that stuff yet - that THAT is one of the<br/>\nadvantages of not going to school - that kids are not pushed to worry about<br/>\nthings that they don&#39;t need to think about for years yet. His poor school<br/>\nfriends are all worried - and there is NO reason for it.<br/>\n<br/>\nDon&#39;t be hard on yourself either just do what you can to meet his needs at<br/>\n<blockquote><span title=\"ireply\"> &gt; the place where he is right now.<br/>\n<br/>\n<br/>\n </span></blockquote>Be really hard on yourself - challenge yourself to find ways to not just<br/>\n&quot;meet his needs&quot; but make his life so glorious that he&#39;d never want to give<br/>\nit up.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: wanting to feel normal","postDate":"1335915655","msgId":66952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucHNhNytidTZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM0Mjc1MzgyLUI1RDUtNDY2My1BMDEwLTAxQkMyMjlCRTY3NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66951,"nextInTopic":66953,"prevInTime":66951,"nextInTime":66953,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... *************** I actually just went to the world book encyclopedia site and looked up the typical 8th grade curriculum out of curiosity... here s the","messageBody":"<div id=\"ygrps-yiv-1107045952\">Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If he&#39;s thinking of going to 8th grade, look over a 6th or 7th grade curriculum, because there is ancient tradition of kids getting to school and claiming never to have heard of any of the things the teachers bring up, so there is ALWAYS review of the stuff from before.<br/>\n </span></blockquote>***************<br/>\n<br/>\nI actually just went to the world book encyclopedia site and looked up the typical 8th grade curriculum out of curiosity... here&#39;s the link:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.worldbook.com/typical-course-of-study\">http://www.worldbook.com/typical-course-of-study</a><br/>\n<br/>\nAnd then I looked at the 5th grade, because Mo&#39;s around that age... maybe 4th, I&#39;d have to look it up. Anyway, the first thing I noticed was how much was a repeat/review - between 5th and 8th. It was a lot - especially &quot;general knowledge&quot; sorts of things, lots of review there.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: wanting to feel normal","postDate":"1335915228","msgId":66951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0Mjc1MzgyLUI1RDUtNDY2My1BMDEwLTAxQkMyMjlCRTY3NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpucHJtaitxMzdxQGVHcm91cHMuY29tPg==","referencesHeader":"PGpucHJtaitxMzdxQGVHcm91cHMuY29tPg=="},"prevInTopic":66950,"nextInTopic":66952,"prevInTime":66950,"nextInTime":66952,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=-What kinds of things does he think he should know? Have other kids been pestering and teasing him? Maybe it would help to look over an 8th grade curriculum","messageBody":"<div id=\"ygrps-yiv-1136629015\">-=-What kinds of things does he think he should know? Have other kids been pestering and teasing him? Maybe it would help to look over an 8th grade curriculum so he can see what he Does already know and reassure him he&#39;ll be able to catch up quickly with the rest.-=-<br/>\n<br/>\nIf he&#39;s thinking of going to 8th grade, look over a 6th or 7th grade curriculum, because there is ancient tradition of kids getting to school and claiming never to have heard of any of the things the teachers bring up, so there is ALWAYS review of the stuff from before.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: wanting to feel normal","postDate":"1335915027","msgId":66950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucHJtaitxMzdxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpucDZqMStqbnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":66944,"nextInTopic":66951,"prevInTime":66949,"nextInTime":66951,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"... ****************** What kinds of things does he think he should know? Have other kids been pestering and teasing him? Maybe it would help to look over an","messageBody":"<div id=\"ygrps-yiv-971626338\">&quot;danajeh&quot; &lt;danajeh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My 12 yr old son has recently been saying that he is going to go to school next year (8th grade). Last night he was very upset and said that he wants to go to school, to feel normal, to know that he can do what everyone else can do, to know what he needs to know to get a job.  He said he wishes someone had told him years ago that he would need to know this stuff, and that someone should have made him do it. <br/>\n </span></blockquote>******************<br/>\n<br/>\nWhat kinds of things does he think he should know? Have other kids been pestering and teasing him? Maybe it would help to look over an 8th grade curriculum so he can see what he Does already know and reassure him he&#39;ll be able to catch up quickly with the rest.<br/>\n<br/>\nIt might help him to know that other unschoolers who have gone to jr high or high school have caught up quickly - embarrassingly so from the school&#39;s perspective. It could help him to discover that himself - but if he&#39;s nervous, don&#39;t set him up to fail, get some information about the local school curriculum. Or get one of the standardized tests and go over the questions with him. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":525780168,"authorName":"debwal777","from":"&quot;debwal777&quot; &lt;debwal777@...&gt;","profile":"debwal777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: wanting to feel normal","postDate":"1335914522","msgId":66953,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucHI2cSs3Z21jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpucDZqMStqbnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":66952,"nextInTopic":66954,"prevInTime":66952,"nextInTime":66954,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"Maybe you could get him a tutor for the subjects he thinks he s missing. Maybe start with one subject at a time. Then if he s serious about it, the you know he","messageBody":"<div id=\"ygrps-yiv-919534504\">Maybe you could get him a tutor for the subjects he thinks he&#39;s missing. Maybe start with one subject at a time. Then if he&#39;s serious about it, the you know he needs to be given the opportunity to study the subject with you, your spouse, or maybe a friend who knows a lot about the subject. I don&#39;t think he hates homeschool or anything I think he&#39;s just starting to think like a little grown up about his future. That&#39;s great right? You wanted that for him I would think, right? Don&#39;t be hard on yourself either just do what you can to meet his needs at the place where he is right now. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;danajeh&quot; &lt;danajeh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My 12 yr old son has recently been saying that he is going to go to school next year (8th grade). Last night he was very upset and said that he wants to go to school, to feel normal, to know that he can do what everyone else can do, to know what he needs to know to get a job.  He said he wishes someone had told him years ago that he would need to know this stuff, and that someone should have made him do it. <br/>\n&gt; <br/>\n&gt; He is my oldest and he has always been a person who took things seriously. As a 3 yr old he ran the children&#39;s museum&#39;s mini-grocery store like it was a real business and as a 12 yr old he works on Minecraft servers with the same seriousness.   <br/>\n&gt; <br/>\n&gt; I would love to hear your ideas on this. I am feeling like he is fine, exactly where he needs to be, but wondering how to help him transition. He is feeling like he is -not- fine, and is overwhelmed at the idea of getting to a place where he feels prepared to go to school.<br/>\n&gt; <br/>\n&gt; Thanks.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] wanting to feel normal","postDate":"1335897956","msgId":66944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3REM2RjBFLTk5RTktNEYwMy04MEVDLTY2QzZEMjM0NURCREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpucDZqMStqbnY0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpucDZqMStqbnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":66942,"nextInTopic":66950,"prevInTime":66943,"nextInTime":66945,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"-=-. Last night he was very upset and said that he wants to go to school, to feel normal, to know that he can do what everyone else can do, to know what he","messageBody":"<div id=\"ygrps-yiv-534022704\">-=-. Last night he was very upset and said that he wants to go to school, to feel normal, to know that he can do what everyone else can do, to know what he needs to know to get a job.-=-<br/>\n<br/>\nIt&#39;s quite likely that if he went for a while he would get over the idea that kids at school knew all kinds of great things he didn&#39;t know.<br/>\n<br/>\nBut it&#39;s also normal for kids about 11 to 13 to think school kids know TONS they don&#39;t know, and it&#39;s because the kids at school are doing things with fancy  names--essays, and equations and stuff.  But by the time kids in school are 14 or 15 and their hormones are kicking in they get tired and frustrated of more and more of the same school stuff, and that&#39;s about the time unschoolers are learning all sorts of real-world things.  It&#39;s not universal, it&#39;s not a guarantee, but I&#39;ve seen it lots and heard account of it from several sources.<br/>\n<br/>\nIt&#39;s possible someone (a relative or neighbor) has spooked him about not ever getting a job or some such.  <br/>\nIt&#39;s possible that he&#39;s read something or seen something in a movie or on TV.  <br/>\n<br/>\nSometimes in a family if there&#39;s been a new baby, an injury or illness, financial problems, depression or anything difficult and stressful, older kids get restless and want to go where there&#39;s livelier input.  Maybe he wants to be with other kid his age.  <br/>\n<br/>\nMaybe you could make a list with him of the things he thinks he&#39;s missing out on, and look at ways to find those.  Maybe he could look at some Khan Academy videos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.khanacademy.org/\">http://www.khanacademy.org/</a><br/>\nor if it&#39;s history and geography, maybe you could make a chart or get a world map or a poster of flags of nations and check off what you know about (what he knows about, or what the two of you or the family as a whole knows) and seek out info on the others.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":69128708,"authorName":"danajeh","from":"&quot;danajeh&quot; &lt;danajeh@...&gt;","profile":"danajeh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"wanting to feel normal","postDate":"1335893409","msgId":66942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpucDZqMStqbnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":66944,"prevInTime":66941,"nextInTime":66943,"topicId":66942,"numMessagesInTopic":0,"msgSnippet":"My 12 yr old son has recently been saying that he is going to go to school next year (8th grade). Last night he was very upset and said that he wants to go to","messageBody":"<div id=\"ygrps-yiv-1330661910\">My 12 yr old son has recently been saying that he is going to go to school next year (8th grade). Last night he was very upset and said that he wants to go to school, to feel normal, to know that he can do what everyone else can do, to know what he needs to know to get a job.  He said he wishes someone had told him years ago that he would need to know this stuff, and that someone should have made him do it. <br/>\n<br/>\nHe is my oldest and he has always been a person who took things seriously. As a 3 yr old he ran the children&#39;s museum&#39;s mini-grocery store like it was a real business and as a 12 yr old he works on Minecraft servers with the same seriousness.   <br/>\n<br/>\nI would love to hear your ideas on this. I am feeling like he is fine, exactly where he needs to be, but wondering how to help him transition. He is feeling like he is -not- fine, and is overwhelmed at the idea of getting to a place where he feels prepared to go to school.<br/>\n<br/>\nThanks.</div>","specialLinks":[]}],"prevTopicId":67023,"nextTopicId":67077}}