{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"strategies for success","postDate":"1130942868","msgId":109257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0FERDM4NkUwRTVEOS0xREYwLTQxNDhATUJMSy1NMTcuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":109256,"nextInTime":109258,"topicId":109257,"numMessagesInTopic":0,"msgSnippet":"This was on AOL this morning. I found it funny that this list is the opposite of what schools, most parents, and society encourage in children (except maybe","messageBody":"<div id=\"ygrps-yiv-1956329169\">This was on AOL this morning. I found it funny that this list is the opposite of what schools, most parents, and society encourage in children (except maybe the &quot;talk less, listen more&quot; one).<br/>\n <br/>\n-=-=-=-=-=-=-=-=-<br/>\n <br/>\nSix New Strategies for Success<br/>\nCareerBuilder.com<br/>\nIf you want to wow them on the job or find your next great opportunity, all it takes are some subtle and simple changes. Adopt one or all of these concepts, and you&#39;ll find yourself thriving in your career.<br/>\n<br/>\n1. Spend ten minutes a day doing nothing.<br/>\nIt&#39;s no accident good ideas come to many of us in the shower or the middle of the night. The mind is more creative, solution-oriented and receptive to new answers when we relax.<br/>\n<br/>\nWhen our minds become overactive, they tend to churn over the same set of facts causing thinking to become repetitive and habitual. Perspective, wisdom and common sense get lost, and you fail to see the obvious.<br/>\n<br/>\nPsychologist and author Dr. Richard Carlson says devoting 10 minutes each day to sitting still and doing nothing is one of the most important mental techniques you can practice. While at first this may seem counterproductive, Carlson says meditating or putting your brain in a neutral state allows your mind to sort things out, settle down and gain perspective.<br/>\n<br/>\n2. Identify that one thing that will make the most difference.<br/>\nBetween bosses, co-workers, clients and family obligations, most of us are pulled in hundreds of directions each day. As a result, we often end up attending to urgent requests, regardless of whether they are the most important and effective things we could be doing.<br/>\n<br/>\nAs you set your career goals, heed the advice of leadership expert Stephen Covey, who says that anything less than a conscious commitment to the important is an unconscious commitment to the unimportant.<br/>\n<br/>\nIn his book, &#39;First Things First,&#39; Covey says you should ask yourself: &quot;What is the one activity that if I did superbly well and consistently would have significant positive results in my professional or work life?&quot; Then make sure you build time into your day or week to do it!<br/>\n<br/>\n3. Strengthen your &quot;presence.&quot;<br/>\nOne of the best ways to build relationships and make everything you do more enjoyable and effective is to strengthen your &quot;presence.&quot; Dr. Carlson defines presence as that magical quality people exude when they are completely in the moment. And he says the best way to strengthen your presence is to understand its value.<br/>\n<br/>\n&quot;When you are with someone, be with them,&quot; he says. &quot;Don&#39;t think of anything else. Show them they are important and worth paying attention to.&quot;<br/>\n<br/>\nBy developing your presence, Carlson says, people will be more drawn to you, more cooperative and more willing to help you succeed.<br/>\n<br/>\n4. Talk to strangers.<br/>\nBy opening up to others, you will expand your network of personal contacts and invite opportunity into your life. In fact, a whole book has been written on the subject of serendipitous meetings that have turned into new clients, brilliant ideas and attractive job offers.<br/>\n<br/>\nIn &#39;How to Create Your Own Luck,&#39; networking expert Susan Roane illustrates how being interested in others and making small talk with people you meet on planes, elevators, health clubs or hair salons can magically open doors and turn situations of serendipity into success.<br/>\n<br/>\n5. Listen more, speak less.<br/>\nIf you&#39;re talking, you&#39;re not learning. The best way to know what someone wants or needs -- whether it&#39;s your assistant, your client or your boss -- is to ask them. Then listen. You will not only uncover priceless information, but also become much more popular.<br/>\n<br/>\n6. Run your own race.<br/>\nDon&#39;t compare your success to the successes of your former classmates, co-workers, colleagues or neighbors. Give your very best effort to excel and try to enjoy and find something good in everything you do. Practice believing in yourself and finding meaning in your daily activities. <br/>\n <br/>\n-=-=-=-=-=-=-=-==-<br/>\n <br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":2933,"nextTopicId":109261}}