{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I want to post some positive things that have  been happening","postDate":"1268423815","msgId":51981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3OUQ3RUFDLTNFQzgtNENEMC1CQUE0LTE2N0NEMTA2MTJEQ0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDc4NjBiMzFlMTAwMzEyMDU0M2c0OGY0YzczOWc1YmU1MTE3NTcwNGIzNDg0QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDc4NjBiMzFlMTAwMzEyMDU0M2c0OGY0YzczOWc1YmU1MTE3NTcwNGIzNDg0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":51966,"nextInTopic":0,"prevInTime":51980,"nextInTime":51982,"topicId":51902,"numMessagesInTopic":0,"msgSnippet":"... I wonder, Deb, if she might be open to reading Sandra s book (she s a former teacher, too )? It might help her relax about what she perceived her role","messageBody":"<div id=\"ygrps-yiv-492386400\"><blockquote><span title=\"ireply\">&gt; His relationship with his Gram (who, for the record, is my mother-in- <br/>\n&gt; law)<br/>\n&gt; has not changed, except in the amount of time he spends with her.   <br/>\n&gt; He loves<br/>\n&gt; doing fun things with her, which has actually been better, I think,  <br/>\n&gt; because<br/>\n&gt; she doesn&#39;t feel forced into this role as &quot;teacher.&quot;  She really  <br/>\n&gt; struggled<br/>\n&gt; with the role switch, thinking she had to be this tough  <br/>\n&gt; disciplinarian as<br/>\n&gt; his teacher and then feeling all guilty as his grandmother.<br/>\n<br/>\n </span></blockquote>I wonder, Deb, if she might be open to reading Sandra&#39;s book (she&#39;s a  <br/>\nformer teacher, too &lt;g&gt;)? It might help her relax about what she  <br/>\nperceived her role to be and enjoy her grandma-ness now.<br/>\n<br/>\nIt might be a good way to introduce what you are doing now with Julian  <br/>\nand maybe change the kind of interactions she has with him.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":240838916,"authorName":"Deborah McKee Kelly","from":"Deborah McKee Kelly &lt;dlmckee@...&gt;","profile":"hael_harobed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I want to post some positive things that have \tbeen happening","postDate":"1268401381","msgId":51966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4NjBiMzFlMTAwMzEyMDU0M2c0OGY0YzczOWc1YmU1MTE3NTcwNGIzNDg0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":51921,"nextInTopic":51981,"prevInTime":51965,"nextInTime":51967,"topicId":51902,"numMessagesInTopic":0,"msgSnippet":"Jenny Cyphers said:  Wow! Thanks for sharing all of that! I have a question... How s his relationship with his gram now that she s not his teacher anymore?","messageBody":"<div id=\"ygrps-yiv-498040047\">Jenny Cyphers said: &quot;<br/>\nWow! Thanks for sharing all of that! I have a question... How&#39;s his<br/>\nrelationship with his gram now that she&#39;s not his teacher anymore? When you<br/>\nfirst posted a while back I had wondering how that would change.&quot;<br/>\n<br/>\nHis relationship with his Gram (who, for the record, is my mother-in-law)<br/>\nhas not changed, except in the amount of time he spends with her.  He loves<br/>\ndoing fun things with her, which has actually been better, I think, because<br/>\nshe doesn&#39;t feel forced into this role as &quot;teacher.&quot;  She really struggled<br/>\nwith the role switch, thinking she had to be this tough disciplinarian as<br/>\nhis teacher and then feeling all guilty as his grandmother.  That&#39;s what<br/>\nhappened with the older child, my step-daughter, who is now 14 and in public<br/>\nschool.  Their relationship deteriorated to the point of tears and fighting<br/>\nand awful, awful &quot;school&quot; days by the time Caitlin was 11.  It was awful.<br/>\nWhich is partly why Darin and I decided we needed to transition Julian<br/>\nbefore the same thing happened.  He was starting to hate learning and he was<br/>\nstarting to rebel a lot against his Gram.<br/>\n<br/>\nI think it&#39;s been better for both of them.<br/>\n<br/>\nBiggest issue is that when she comes over or sees him, one of the first<br/>\nthings she inevitably asks Julian is, &quot;How&#39;s school going?&quot;<br/>\n<br/>\nSince Julian&#39;s days are nothing like his school days with her, he usually<br/>\nsays, &quot;I&#39;m not really doing much school,&quot; and she looks at me alarmed and<br/>\nstarts giving me ideas.<br/>\n<br/>\nShe made a big deal about it when she was giving up teaching, because she<br/>\nthought I might not be able to &quot;handle everything&quot; with the baby and another<br/>\non the way.  I continue to assure her that we are handling things and that<br/>\nhe is learning.  Of course, in her mind, Handling It means doing it Her Way,<br/>\nand we&#39;re not doing that, so....she probably still thinks I&#39;m not handling<br/>\nit, but...whatever.<br/>\n<br/>\nI frankly think it ticked her off when we emptied out the school room -- but<br/>\nthat&#39;s more about her relationship with *us* than anything having to do with<br/>\nJulian.  She adores Julian and he adores her.<br/>\n<br/>\nShe has always been really, really involved, and that&#39;s been part of our<br/>\ntransition that&#39;s been difficult, but has more required Darin to step up and<br/>\nsay, &quot;Hey, this is my kid and this is how we want to live life with him --<br/>\nnot your way.&quot;  Not that abruptly of course, but in his own mind.<br/>\n<br/>\nExample of learning I shared with Gram recently:<br/>\nA couple of weeks ago, our entire family came down with a terrible stomach<br/>\nvirus -- every single one of us, one day after another, got hit.  Two of us<br/>\n-- me and my step-daughter -- ended up in the hospital getting IV fluids<br/>\nbecause of it.  Julian had TONS of questions about viruses -- how they work,<br/>\nhow they spread, what they look like, how we avoid them in the future, etc.<br/>\netc. etc.  So, for days and days after our bout, we looked up all kinds of<br/>\nstuff about viruses.  He had questions about soaps and cleaners and if the<br/>\nvirus could live on his toothbrush -- and so we spent as long as he wanted<br/>\ntalking about it and looking stuff up.<br/>\n<br/>\nWhen I told his Gram about this, I think she almost felt a little jealous<br/>\nthat she hadn&#39;t had such interesting &quot;science lessons&quot; ever with him, or<br/>\nsuch involvement or interest by him.  I told her about it, because I often<br/>\nshare the ideas I think about learning and &quot;education,&quot; and I used that as<br/>\nan example of how we&#39;re &quot;doing school&quot; differently.<br/>\n<br/>\nShe has a lot of anxiety about the kids&#39; bio-mom getting angry and seeking<br/>\ncustody -- we are more laid back about that.  For one thing, it hasn&#39;t<br/>\nhappened.  For another, it probably isn&#39;t ever going to happen.  Julian&#39;s<br/>\nbio-mom is a lot more reasonable than Gram gives her credit for, and she<br/>\nknows we&#39;re taking good care of the kids.  Anytime anything comes up, we all<br/>\ntalk about it.  So, I&#39;m really not concerned.  But Gram will continue to<br/>\nworry.<br/>\n<br/>\nGram also keeps bringing me school stuff from her house -- &quot;for when<br/>\nJosephine gets older&quot; -- flash cards and grammar books etc. etc. etc.  I<br/>\njust thank her and pack them for &quot;later.&quot;<br/>\n<br/>\nJulian&#39;s relationship with Gram is fine -- OUR relationship with her<br/>\ncontinues to evolve.  :)<br/>\n<br/>\n<br/>\n_____________________<br/>\nDeb McKee Kelly |  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dlmckee@...\">dlmckee@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I want to post some positive things that have been happening","postDate":"1268334599","msgId":51921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3OTQxOS4zODY3Ny5xbUB3ZWIxMTA0MDUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDc4NjBiMzFlMTAwMzExMDY1Nmo0ZTZiMzc3NWphMWNlNTc2MjE2ZTNiZjQzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDc4NjBiMzFlMTAwMzExMDY1Nmo0ZTZiMzc3NWphMWNlNTc2MjE2ZTNiZjQzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":51908,"nextInTopic":51966,"prevInTime":51920,"nextInTime":51922,"topicId":51902,"numMessagesInTopic":0,"msgSnippet":"***Anyway, I just wanted to post some of our positives as we continue to deschool and as Julian is getting more control over his world.*** Wow!  Thanks for","messageBody":"<div id=\"ygrps-yiv-828510973\">***Anyway, I just wanted to post some of our positives as we continue to<br/>\ndeschool and as Julian is getting more control over his world.***<br/>\n<br/>\nWow!  Thanks for sharing all of that!  I have a question... How&#39;s his relationship with his gram now that she&#39;s not his teacher anymore?  When you first posted a while back I had wondering how that would change.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I want to post some positive things that have been happening","postDate":"1268324862","msgId":51908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJFOTdEMDAyLTZFQ0YtNDMxQy05MzEyLUJBMTFENzA0REYwNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCOTkxNkNCLjYwNzAzMDlAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDc4NjBiMzFlMTAwMzExMDY1Nmo0ZTZiMzc3NWphMWNlNTc2MjE2ZTNiZjQzQG1haWwuZ21haWwuY29tPiA8NEI5OTE2Q0IuNjA3MDMwOUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":51907,"nextInTopic":51921,"prevInTime":51907,"nextInTime":51909,"topicId":51902,"numMessagesInTopic":0,"msgSnippet":"-=-I think the phenomenon of older kids watching tv shows aimed at younger kids is really interesting. Rosie, especially, has gone through phases of watching a","messageBody":"<div id=\"ygrps-yiv-758423476\">-=-I think the phenomenon of older kids watching tv shows<br/>\naimed at younger kids is really interesting. Rosie, especially, has gone<br/>\nthrough phases of watching a lot of kids&#39; shows on tv (and it wasn&#39;t<br/>\nbecause she missed out on them when she was young). For her, there is<br/>\nsome kind of recentering going on within her when she does this. I get<br/>\nthe feeling of it putting her back in touch with who she was when she<br/>\nwatched those shows - there is some kind of personality integration<br/>\ngoing on.-=-<br/>\n<br/>\nHolly watches them with an eye to how they were produced and what the  <br/>\nintent is.  She came back with stories about children&#39;s shows in the  <br/>\nU.K., especially Big Cook, Little Cook.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=KNKfTrrJVJI\">http://www.youtube.com/watch?v=KNKfTrrJVJI</a><br/>\n<br/>\nShe watches them just for fun, too, but even when she was little she  <br/>\nwould come and say &quot;They&#39;re trying to help kids want to go to school,&quot;  <br/>\nor &quot;This is about being nice to old people.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/KNKfTrrJVJI?wmode=opaque","type":"VIDEO"}]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I want to post some positive things that have been happening","postDate":"1268324043","msgId":51907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOTkxNkNCLjYwNzAzMDlAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDc4NjBiMzFlMTAwMzExMDY1Nmo0ZTZiMzc3NWphMWNlNTc2MjE2ZTNiZjQzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDc4NjBiMzFlMTAwMzExMDY1Nmo0ZTZiMzc3NWphMWNlNTc2MjE2ZTNiZjQzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":51902,"nextInTopic":51908,"prevInTime":51906,"nextInTime":51908,"topicId":51902,"numMessagesInTopic":0,"msgSnippet":"... Nice update! I think the phenomenon of older kids watching tv shows aimed at younger kids is really interesting. Rosie, especially, has gone through phases","messageBody":"<div id=\"ygrps-yiv-891110214\">On 3/11/2010 6:56 AM, Deborah McKee Kelly wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyway, I just wanted to post some of our positives as we continue to<br/>\n&gt; deschool and as Julian is getting more control over his world.<br/>\n&gt;<br/>\n&gt; The list has been really helpful to me during this process.<br/>\n<br/>\n </span></blockquote>Nice update! I think the phenomenon of older kids watching tv shows <br/>\naimed at younger kids is really interesting. Rosie, especially, has gone <br/>\nthrough phases of watching a lot of kids&#39; shows on tv (and it wasn&#39;t <br/>\nbecause she missed out on them when she was young). For her, there is <br/>\nsome kind of recentering going on within her when she does this. I get <br/>\nthe feeling of it putting her back in touch with who she was when she <br/>\nwatched those shows - there is some kind of personality integration <br/>\ngoing on.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":240838916,"authorName":"Deborah McKee Kelly","from":"Deborah McKee Kelly &lt;dlmckee@...&gt;","profile":"hael_harobed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"I want to post some positive things that have been happening","postDate":"1268319395","msgId":51902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4NjBiMzFlMTAwMzExMDY1Nmo0ZTZiMzc3NWphMWNlNTc2MjE2ZTNiZjQzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":51907,"prevInTime":51901,"nextInTime":51903,"topicId":51902,"numMessagesInTopic":0,"msgSnippet":"I am definitely new to unschooling.  I love reading all the posts and Sandra s stuff and haven t posted much myself.  I have been seeing some really neat stuff","messageBody":"<div id=\"ygrps-yiv-137552066\">I am definitely new to unschooling.  I love reading all the posts and<br/>\nSandra&#39;s stuff and haven&#39;t posted much myself.  I have been seeing some<br/>\nreally neat stuff happening in our house, though, and I wanted to share.<br/>\n<br/>\nI have the privilege of living and learning with a 9-year-old boy who is my<br/>\nstep-son.  I also have an almost-1-year-old daughter (as of St. Patrick&#39;s<br/>\nDay, next week!).  I also have a 14-year-old step-daughter who attends<br/>\npublic school, and I am due with my second baby in May.  Whew.  My energy<br/>\nlevel waxes and wanes.<br/>\n<br/>\nJulian, my step-son, and I (and Julian&#39;s dad, my hubby Darin) have been<br/>\ndeschooling for only a little while -- maybe since December, so not long at<br/>\nall.  He had been homeschooled by his grandmother in a very traditional,<br/>\nstructured curriculum/program since he &quot;started school&quot; at age five.  Since<br/>\nI &quot;took over,&quot; as it was termed, we&#39;ve been working on deschooling.  And we<br/>\nare still going to be working on that for a long time.<br/>\n<br/>\nJulian has been saying and hearing &quot;let&#39;s do school,&quot; &quot;let&#39;s get done with<br/>\nschool so we can do something fun,&quot; &quot;are you/we done with school yet?&quot; &quot;how<br/>\nmuch school have you got done?&quot; his whole life.  That line of commentary<br/>\nabout &quot;school&quot; had become very stifling for all of us.  We had a &quot;school<br/>\nroom&quot; in our house, up on the third floor, that he avoided at all times<br/>\nunless forced, a room he hated.  As soon as I became the &quot;teacher&quot; (another<br/>\nword we have tossed out for the most part, although Julian still uses it<br/>\nfrom time to time), one of the first things we did was to empty the school<br/>\nroom out.  I told Julian he could have that room to turn into a play room or<br/>\nwhatever.  You ought to see it now.  He filled it up with toys and Legos and<br/>\nrace tracks.  He&#39;s got a cool racetrack set up in there, and spends hours<br/>\nplaying with his cars and other toys that have been sort of packed away and<br/>\nhard to get to for awhile.  I packed away a lot of the schooly stuff in<br/>\ntotes, to go through later.  I&#39;ve kept out many books and stuff and brought<br/>\nthem down to my bookshelves, but since we&#39;ve been pretty &quot;grade&quot;-oriented<br/>\nhere for a long time, I am putting away text books that proclaim to be<br/>\n&quot;fourth grade&quot; or &quot;fifth grade,&quot; etc.<br/>\n<br/>\nAbout the &quot;teacher&quot; word:  for awhile, J was going around telling everyone,<br/>\n&quot;Deb is my teacher now, not Gram.&quot;  But we kind of talked about that -- he<br/>\nand I have been having conversations about &quot;learning&quot; and finding things out<br/>\ntogether.  It&#39;s been helpful to have a baby around who is learning all kinds<br/>\nof stuff, because I can use her as an example.  I say things like, &quot;Look at<br/>\nyour little sister learning to walk.  I can&#39;t teach her that -- I&#39;m not her<br/>\nteacher.  She is learning because she is enjoying the challenge and the new<br/>\nfeel of being able to get around in a different way.  There&#39;s not much I can<br/>\ndo except offer a hand or a support, and give her a big hug when she is so<br/>\nhappy with herself for walking.  Same thing with you -- I don&#39;t know most of<br/>\nthese things you&#39;re interested in, so we have to learn together.&quot;  And he&#39;s<br/>\nrealizing that I don&#39;t do what his Gram did -- make him sit at a desk in the<br/>\nschool room, while I stand up at a white board at the front of the room and<br/>\nlecture from curriculum books.  So, that&#39;s what he thinks of when he thinks<br/>\n&quot;teacher,&quot; and I don&#39;t do anything close to that.<br/>\n<br/>\nWhen Julian asks me his million questions daily, my common response is, &quot;I<br/>\nreally don&#39;t know -- let&#39;s look it up.&quot;  He used to hate that -- because it<br/>\nmeant he was going to get a &quot;lesson.&quot;  But now, if we look something up, we<br/>\nonly look it up long enough to satiate his momentary curiosity.  Some things<br/>\nhe spends more time on, but others, he has a fleeting question (as I do<br/>\nsometimes), and it&#39;s good enough to find a definition or a quick blurb on<br/>\nWikipedia or something.  Also, he asks me the meanings of words fairly<br/>\noften.  I used to ask him to look the words up, but now, most of the time, I<br/>\njust give him the definition if I feel like I can give him a good definition<br/>\nor a good, useful synonym.  He has a dictionary lying around if I&#39;m not<br/>\navailable or if I can&#39;t seem to put the right meaning to the word.  Then<br/>\nI&#39;ll look it up for or with him.<br/>\n<br/>\nOur biggest obstacle is Julian&#39;s bio-mom, only because she has a real say in<br/>\nwhether or not Julian continues to be homeschooled.  She could come to us<br/>\ndisgruntled and say, &quot;I want him in school,&quot; and we&#39;d have to discuss it<br/>\nwith her and come to a compromise.  Julian keeps saying, &quot;I didn&#39;t do any<br/>\nschool today,&quot; or &quot;We didn&#39;t hardly do anything today,&quot; which, if we were an<br/>\nintact family and not subject to whims of another parent, wouldn&#39;t bother me<br/>\nat all.  We&#39;ve kind of had to work around that -- talking about how we&#39;re<br/>\nall always learning, and he does some computer-based stuff that he enjoys.<br/>\nI find this is the most difficult part for me -- having to answer to someone<br/>\nelse about him.  There are very few &quot;have-tos,&quot; but this is one that I can&#39;t<br/>\nfigure a way around.  Julian&#39;s bio-mom isn&#39;t capable of taking care of him,<br/>\nbut she has a lot of say in how *we* take care of him.  I don&#39;t know if it<br/>\nwill ever come up, but I do keep track (out of Julian&#39;s sight) of the<br/>\n&quot;projects&quot; he does and activities he does so that I can, if necessary, try<br/>\nto justify the types of learning he is experiencing.  Some people, I<br/>\nunderstand, have to do this based on the state in which they live.  We live<br/>\nin Indiana -- a very laid-back homeschooling state as far as reporting<br/>\nrequirements (as in, we only have to report attendance) -- but I just<br/>\nimagine myself living in a more strict state where I may have to answer to<br/>\nsomeone at some point, and make notes to that effect.<br/>\n<br/>\nLuckily, my hubby and I are both pretty connected with the idea of<br/>\nunschooling -- something I was thinking about last night, and wanted to<br/>\nmention.  He and I are both over-educated, and we both agree that the amount<br/>\nof formal education we received was unnecessary.<br/>\n<br/>\nWe both left &quot;mainstream&quot; jobs and made lots of sacrifices to live a<br/>\nfamily-centered life, growing veggies and selling to restaurants and farmers<br/>\nmarkets to make our living.  My husband is not attached to any sense of<br/>\ncompetition for his children, nor does he care whether or not they go to<br/>\ncollege or do anything that mainstream society might expect for them.  If<br/>\nthey want to work with us on the farm, great.  If they want to do something<br/>\nelse, great.  He supports their passions, and has no problem with Julian<br/>\ndeciding he&#39;d rather spend the day working in the greenhouse with dad than<br/>\ninside reading.  We both like &quot;apprentice&quot;-type learning, and try to find<br/>\nother adults who are doing things that Julian might express an interest in.<br/>\nAs he gets older, we&#39;ll probably help him find resources like that for<br/>\nthings that inspire him.  Not too worried about it at the moment.<br/>\n<br/>\nI know this message is all over the place, but I wanted to mention one other<br/>\nthing.  Julian&#39;s Gram had placed all of the &quot;age-appropriate&quot; books on<br/>\nshelves in the school room when she was teaching.  And since Julian avoided<br/>\nanything smacking of school or the school room, those books sat there<br/>\ncollecting dust.  When I emptied the room out, we carried a bunch of those<br/>\nbooks down to the main living area in our house, where we have all kinds of<br/>\nbooks on shelves -- my books, Darin&#39;s books, baby and little kid books,<br/>\nreference books, etc.  When Julian was &quot;doing school,&quot; his Gram required him<br/>\nto do book reports -- which he hated and which I thought were incredibly<br/>\ncounterproductive and boring.  It made him HATE reading, hate books, and<br/>\nhate writing.  Well, since we quit all that nonsense, and I scattered all<br/>\nthose books among our books, he has been asking me things like, &quot;Deb, can I<br/>\npick out a book to read?&quot;  I said sure and told him he doesn&#39;t have to ask<br/>\nme.  He devoured James and the Giant Peach in two days about a week ago.<br/>\nOnly thing I asked him was if he liked it.  There are other books lying<br/>\naround and I&#39;m not suggesting anything at all.  I love reading.  His dad is<br/>\na big reader.  We read a lot to Josephine (the baby).  And he reads a lot on<br/>\nhis computer games -- mostly World of Warcraft.<br/>\n<br/>\nI have also noticed this:  he is spending less time on World of Warcraft and<br/>\nmore time doing all kinds of other stuff -- NOT that there is anything wrong<br/>\nwith video games, but I will say that I think World of Warcraft had become<br/>\nJ&#39;s ONLY means of control in his world.  He used to die to &quot;finish&quot; school<br/>\nso he could get to his WoW.  I don&#39;t have a problem with WoW.  Nowadays,<br/>\nthough, he&#39;ll spend a little time on WoW, then go outside and play a little,<br/>\nthen go up to his playroom, then read for awhile, then watch TV for awhile,<br/>\netc.  I just think he feels a little bit more in control of his world, and<br/>\nWoW is just part of it.<br/>\n<br/>\nHe is watching a lot of TV -- mostly PBS because we don&#39;t have cable -- and<br/>\nhe watches a lot of shows that are maybe &quot;too young&quot; for him -- but I don&#39;t<br/>\ncare.  He never got to watch this stuff before because he was so busy &quot;doing<br/>\nschool.&quot;  He gets something out of these shows, and when he gets tired of<br/>\nthem, he&#39;ll move on, I&#39;m sure.  He also LOVES to watch M*A*S*H -- his dad&#39;s<br/>\nfavorite show -- and he will watch one episode after another from our DVDs.<br/>\nHe has had all kinds of questions about war, and army ranks, and how things<br/>\nare now in Korea and medicine and ethics (even though he doesn&#39;t know that&#39;s<br/>\nwhat he&#39;s asking).<br/>\n<br/>\nAnyway, I just wanted to post some of our positives as we continue to<br/>\ndeschool and as Julian is getting more control over his world.<br/>\n<br/>\nThe list has been really helpful to me during this process.<br/>\n<br/>\nDeb<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n_____________________<br/>\nDeb McKee Kelly |  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dlmckee@...\">dlmckee@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":7141,"nextTopicId":51983}}