{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":689589,"authorName":"KT","from":"KT &lt;Tuck@...&gt;","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] jealous neice","postDate":"1011708498","msgId":2891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDNEQ3MjUyLjIwNjAxQG1pZHNvdXRoLnJyLmNvbT4=","referencesHeader":"PDEwMTE2NjYwMTMuMjQ0OC4xOTgyNi5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2890,"nextInTime":2892,"topicId":2891,"numMessagesInTopic":0,"msgSnippet":"... I read this whole situation and this is what I think.  I think if your family has the privilege to visit with Grandma whenever and wherever, then you","messageBody":"<div id=\"ygrps-yiv-341838861\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt; It&#39;s <br/>\n&gt;just that my family has way more time to spend with her, as a family, <br/>\n&gt;and even my kids have a lot more opportunities to be with her, <br/>\n&gt;because of unschooling, and we both hate feeling like we have to hold <br/>\n&gt;back on the opportunities because of my nieces feelings, but there it<br/>\n&gt;is.  Should we be insensative to a 12 yo? <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I read this whole situation and this is what I think.  I think if your <br/>\nfamily has the privilege to visit with Grandma whenever and wherever, <br/>\nthen you should take advantage of it at your pleasure.  The relationship <br/>\nis between you and Grandma...other people don&#39;t get to interfere with <br/>\nthat *on purpose*.  Of course, if you have practical reasons not to see <br/>\nGrandma at the same time as your neice, such as there would not be <br/>\nenough sleeping room or everyone can&#39;t fit in the car, then obviously, <br/>\nanother person is &quot;interfering&quot; with your relationship with Grandma in a <br/>\nsense.  But it&#39;s not deliberate, and it can all be worked out.  <br/>\n<br/>\nMy brother and his wife and two daughters live 5 miles from my father <br/>\nand his wife and 2 dogs.  I live 300 miles from our father.  I visited <br/>\nmy father 3 or 4 times last year, as I do every year.  My brother could <br/>\nstop by at any time.  He did so *once* in all of 2001.  My dad never saw <br/>\nhis daughter-in-law or the youngest girl the whole year.  They don&#39;t see <br/>\nmy family being in town as an opportunity to visit our dad, either.  The <br/>\n*reason* they don&#39;t want to go there is because they don&#39;t like his <br/>\nwife, or her children.  Her children are grown and gone with families of <br/>\ntheir own, and she works full-time and Dad is retired.  There&#39;s a slight <br/>\npossibility that my brother might accidentally be visiting when her <br/>\nchildren show up to visit or she gets home for work.  That&#39;s what keeps <br/>\nmy brother away.  <br/>\n<br/>\nIs that just the most inane reason in the world or what?  Of course, I <br/>\nknow that the reasons are deeper than that, in a psychological sense. <br/>\n He&#39;s incredibly intolerant, etc.  A snob, basically.  The point is, <br/>\nhe&#39;d rather hurt his father and deprive his children of a relationship <br/>\nwith a wonderful person for a lifetime, to avoid spending 20 minutes <br/>\nwith people he considers white trash. (And the dogs--he hates the dogs, <br/>\nwho are terriers and excitable.  When he goes he won&#39;t push the dogs off <br/>\nof him like everyone else in the house does, because he thinks our dad&#39;s <br/>\nfeelings are so tender towards the dogs that dad would just melt in a <br/>\npuddle of pain if he did push them off.  So he doesn&#39;t go.  Which hurts <br/>\nmy dad&#39;s feelings and would be much more likely to melt my dad into a <br/>\npuddle, which is much less likely than anyone thinks!)<br/>\n<br/>\nCan you tell I&#39;m a little ticked off about this situation?  :)  <br/>\n<br/>\nI realize that this situation is extreme and a little different than <br/>\nyours.  But the point is that I&#39;m not going to let my step-mom and her <br/>\nchildren keep me from a relationship with my father.  (I love the dogs <br/>\nand have a matching set. &lt;g&gt;)  I don&#39;t think you&#39;re being insensitive to <br/>\nyour neice.  I think she should learn to be a little more sensitive <br/>\nothers and learn to live and let live.  I thought it was incredibly nice <br/>\nof you in a bending-over-backwards sort of way to change your Easter <br/>\ntrip.  But I don&#39;t think it was necessary.  You&#39;re a much nicer person <br/>\nthan I would be!  lol.<br/>\n<br/>\nTuck</div>","specialLinks":[]}],"prevTopicId":2645,"nextTopicId":2839}}