{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":78742842,"authorName":"Lucie Caunter","from":"Lucie Caunter &lt;lucie.caunter@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"L x 3 Intro","postDate":"1053618433","msgId":14634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFQ0NGMTAxLjIwNzAxMDhAc3ltcGF0aWNvLmNhPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14633,"nextInTime":14635,"topicId":14634,"numMessagesInTopic":0,"msgSnippet":"Sometimes you just have to take the leap, and build your wings on the way down. --Kobi Yamada Wrote the following for another list.  Then I thought,... Been","messageBody":"<div id=\"ygrps-yiv-1425193055\">&quot;Sometimes you just have to take the leap, and build your<br/>\nwings on the way down.&quot;<br/>\n--Kobi Yamada<br/>\nWrote the following for another list.  Then I thought,...<br/>\n<br/>\nBeen here for a while.  Time to come out of my shell.  Here is my intro. <br/>\n Friendship.  Lucie<br/>\n<br/>\n<br/>\nName: Lucie Caunter<br/>\n<br/>\nAge: 46<br/>\n<br/>\nLocation: Ottawa, Ontario, Canada.  We live on the eastern side of the <br/>\ncapital right now ( sub-urban).  But our house is for sale.  We&#39;re <br/>\nlooking for a new home south central of the Ottawa region ( more rural). <br/>\n Traveled a lot over the years.  Lived in 4 provinces and one state, so <br/>\nfar.  Think we&#39;re back home permanently.<br/>\n<br/>\nProfession: Good question? Mother , home manager, student, freelance <br/>\nwriter, Adult guide to three boys ( my son Lewis gave me that title ), <br/>\nmate, taxi driver ( That might change soon.  Now that the twins are <br/>\n16. ).<br/>\n<br/>\nInterest: organic gardening, permaculture, animals rights, plants <br/>\nrights, biomimicry, social activism, world peace, environments <br/>\nprotection, Home, hiking, camping, folk art painting, world culture and <br/>\nworld religions, reading, music, arts,  homeopathy, natural healing <br/>\nmethods, Natural health, Creative writing, yoga, Tae Kwon Do, my family<br/>\n<br/>\nFavorite book, authors:  Very eclectic taste. Daniel Quinn, Alice <br/>\nWalker, Marc Kingwall, Shel Silvestein, Jane Jacob, Christopher <br/>\nAlexander, Lewis Thomas, Margaret Laurence, Charles De Lint.... I read <br/>\nfiction novel, Science fiction - fantasy, Non-fiction, Biography,... In <br/>\nbooks format, short story, or in magazines.<br/>\nFavorite magazines: Utne Reader, Organic Gardening, The Sun, Natural <br/>\nlife, Natural Learning, HEM Mag., and lots more...   <br/>\n<br/>\nSpouse&#39;s name: Brian<br/>\n<br/>\nSpouse&#39;s profession: Information security consultant (second carreer ). <br/>\n My editor.<br/>\n<br/>\nSpouse&#39;s interest: Drummer, woodworking, cars, reading, music, playing <br/>\nsport games with his sons, games, movies, sports on T.V., golf, Me<br/>\n<br/>\nChildren&#39;s name and ages: Marc 16, Philip 16, Lewis 10<br/>\n<br/>\nTwins interest: Reading( science fictions especially), writing, music ( <br/>\nplaying and listening), sports games, card games , chess, sports on <br/>\nT.V., movies, curves on the street ( especially on girls), Drama, <br/>\ndiscussing issues, hiking, computer games, Tae Kwon Do (ITF), <br/>\nArchitecture, A.I., golfing, Popular science, Star Trek, Internet, email <br/>\nwith their friends, &quot;Who&#39;s line it is anyway&quot; type shows, piano and guitar<br/>\n<br/>\nLewis interests: The Simpsons, movies, music, drama, playing games of <br/>\nany kind, some reading of adventure stories, (Very outspoken and <br/>\nauditory), roller blading, skateboard (or snow boarding in the winter) , <br/>\nTae  Kwon Do, Scout, hiking, camping, computer games, golfing, space, <br/>\nStar Trek, sleep over with his friends, piano , guitar, singing, lego ( <br/>\nbig ships and robots),<br/>\n<br/>\nFavorites books: For the twins: R.H. Hamilton, Frank Herbert ( or his <br/>\nson) , or any other science fiction authors.  They read series. They <br/>\nlike comedy also.  And lots more...<br/>\n For Lewis: Scott Adams, Calvin & Hobbes, and J.Fritzgerald McCurdy  ( <br/>\nStill sorting out reading )<br/>\n<br/>\nUnschooling experiences:  The boys have never been in schools.  They <br/>\nhave taken organized classes.  They have been to workshops.  They have <br/>\ndone workshops.   I read all ( the late) John Holt books, some before <br/>\nthe boys were born.  I read all Growing Without Schooling ( from # 1 to <br/>\nthe end), I read all( the late) Donn Reed&#39;s books, and lots more. <br/>\n We don&#39;t school.  If we use a text book it&#39;s as reference and by <br/>\nchoice.  We live, learn, argue, have great conversations, enjoy, play a <br/>\nlot, travel, enjoy good food which we shop for, grow, cook together . <br/>\n In the next few days, we will be shopping for a new Home together. <br/>\n Each of us, five,  are different learner types, different <br/>\npersonalities. We tend to view ideas from different perspectives.  Makes <br/>\nfor lively discussions.  In 1998, I read Mary Griffith&#39; book &quot;The <br/>\nUnschooling Handbook&quot; and thouht : &quot;Ah, Ah!  This is what we&#39;ve been <br/>\ndoing.  It does seem to have an official name&quot;...<br/>\n<br/>\nUnschooling Questions or Concerns:  University opportunity in Ontario <br/>\nfor home based learner ( not so good).  <br/>\n<br/>\nUnschooling Joys:  Blessings are understood in the background of their <br/>\nabsences.  When I compare my happy sons with teenagers on the streets... <br/>\nI feel bless.<br/>\n But there are also these moments, I would like to trap in time:  Like <br/>\nwhen the three of them played guitar in a concert last month ( they only <br/>\nstarted to play last November );  or seeing them acting plays they  <br/>\nauthored; Or seeing the twins and one of their friend putting a whole <br/>\nservice for the fellowship  ( Philip was the service leader !  );  Or <br/>\nlistening to  Lewis discussing computer system configurations with one <br/>\nof our specialist friend...( and our friend was awed by his knowledge, <br/>\nwhich was way over my head )<br/>\n  In other words, seeing them fit so well in life.<br/>\n<br/>\nUnschooling does work.  It&#39;s learning with pleasure. An unschooler is a healthy life-long learner.  <br/>\nLucie <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":14626,"nextTopicId":14638}}