{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":31,"messages":[{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: navigating the unschooling ocean : )","postDate":"1262629377","msgId":49435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDIzMjAxLjMwODAyMDlAbWFjLmNvbT4=","inReplyToHeader":"PDNBREEyODAwRkZCNzQyMzJCMUE0MDg0NDZBNTJDMkRBQGJpZ3N1cnByaXNlPg==","referencesHeader":"PDNBREEyODAwRkZCNzQyMzJCMUE0MDg0NDZBNTJDMkRBQGJpZ3N1cnByaXNlPg=="},"prevInTopic":49434,"nextInTopic":49436,"prevInTime":49434,"nextInTime":49436,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"... I could have written most of that about my husband, too. He also tends to be a bit negative. I ve had to remind myself that if the kids were in school,","messageBody":"<div id=\"ygrps-yiv-232236165\">On 1/4/2010 10:04 AM, Deb Lewis wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; If David had really fought with me about it, it couldn&#39;t have worked. I know that.  But David&#39;s not much of a fighter.  He needed reassurance that unschooled kids turn out ok and I&#39;d show him posts from the lists.  I think Pam&#39;s daughters and Sandra&#39;s kids held my husband together.&lt;g&gt;    They were all just older than Dylan and they were normal and that helped David calm down.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>I could have written most of that about my husband, too. He also tends <br/>\nto be a bit negative. I&#39;ve had to remind myself that if the kids were in <br/>\nschool, he&#39;d be negative about that, too. Two things helped him a lot. <br/>\nOne was getting to know other unschooling/homeschooling kids and <br/>\nparents. The other was getting to know school-age kids who were exactly <br/>\nour kids&#39; ages. When he started coaching my daughters&#39; soccer teams, and <br/>\ngot to really know a bunch of other schooled girls all born within a <br/>\nyear of ours, he really began to appreciate ours more.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: navigating the unschooling ocean : )","postDate":"1262628267","msgId":49434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBREEyODAwRkZCNzQyMzJCMUE0MDg0NDZBNTJDMkRBQGJpZ3N1cnByaXNlPg=="},"prevInTopic":49431,"nextInTopic":49435,"prevInTime":49433,"nextInTime":49435,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"***But in any case, in a marriage there needs to be agreement to do anything big...Unschooling is BIG, like those things are.*** David wasn t sold on","messageBody":"<div id=\"ygrps-yiv-420187634\">***But in any case, in a marriage there needs to be agreement to do anything big...Unschooling is BIG, like those things are.***<br/>\n<br/>\nDavid wasn&#39;t sold on unschooling.  He didn&#39;t enjoy school and he knew some homeschooled kids who didn&#39;t always enjoy that and he liked the idea of unschooling but living with it was worrisome to him. <br/>\n<br/>\nLot&#39;s of times I told him to be nicer, to be more patient or to calm down and trust me. &lt;g&gt; <br/>\n<br/>\nThere was a time when Dylan was seven or eight and maybe nine, his play was imaginative, inside his head, play.  He would pace and twirl his long hair and live out these great stories in his head.  He wore the grass down in our front yard from pacing and jumping off the steps.  Neighbors thought he was impaired in some way.  It was also around the time he was wearing his clothes inside out to avoid scratchy seams and tucking his pants into his socks. &lt;g&gt; Goofy little critter.  <br/>\n<br/>\nDavid can be negative.  When his nieces and nephews were around (all from one to four years older than Dylan) and they seemed so *normal* and well rounded and our kid was pacing and twirling his hair, well, David sometimes had doubts. <br/>\n<br/>\nI&#39;d remind him of the other things Dylan was doing, Karate, Tae Kwon Do, Judo, swimming, playing piano, writing stories, drawing cartoons and I&#39;d tell David not to say anything negative about Dylan until he&#39;d first said or thought five positive things.  That slowed him some.<br/>\n<br/>\nIf David had really fought with me about it, it couldn&#39;t have worked. I know that.  But David&#39;s not much of a fighter.  He needed reassurance that unschooled kids turn out ok and I&#39;d show him posts from the lists.  I think Pam&#39;s daughters and Sandra&#39;s kids held my husband together. &lt;g&gt;   They were all just older than Dylan and they were normal and that helped David calm down.  <br/>\n<br/>\nAnd when he had concerns about Dylan doing too much of one thing, pacing or twirling or whatever, I&#39;d be especially sure to talk with him about things we&#39;d done that day.   Or I&#39;d add a few more adventures to our week or have people over so that David could see something other than what he was imagining in his own head.   That didn&#39;t hurt unschooling at all, for me to get on the ball and make the world a little bigger, and it was fun for Dylan and reassured David.  Altogether good. <br/>\n<br/>\nDavid has a tone that sounds harsher than what he means.  His dad had that tone and *was* harsh and I often reminded David that they way he talked or sounded could hurt feelings.  <br/>\n<br/>\nWhile I realized I couldn&#39;t make David parent the way I did I didn&#39;t feel badly about sharing good ideas with him or asking him to be a nicer or more patient, less critical parent.   I stuck up for Dylan if I thought David was wrong about something.  I stuck up for David sometimes too. &lt;g&gt;   I&#39;m grateful for times when David saw something more clearly than I did and called it to my attention.  <br/>\n<br/>\nHow you talk to a partner about being less authoritarian or calmer depends on your relationship.  I&#39;ve know David since we were ten and fourteen.  I know when he can&#39;t be reasoned with, when he&#39;s willing to listen, when he&#39;s hurt or cranky and talk to him (or not) with those things in mind.   And I tried to be fair and address his concerns.   <br/>\nI don&#39;t think parents have to agree entirely.  They have to be able to live peacefully when they don&#39;t agree.  I would have preferred for David  to believe in unschooling as profoundly as I  did but I was happy to settle for him not fighting me about it and I was happy to try to reassure and comfort him when I could.  I also just told him to chill sometimes. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: navigating the unschooling ocean : )","postDate":"1262585518","msgId":49431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoczByZStpcWtvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhob3ZqNis3anRkQGVHcm91cHMuY29tPg=="},"prevInTopic":49428,"nextInTopic":49434,"prevInTime":49430,"nextInTime":49432,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"... Well I am admittedly not an unschooling expert, but I am in a similar situation with a new (well 3yr) partner and an intense, high needs child who were","messageBody":"<div id=\"ygrps-yiv-378106913\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;mamanandi&quot; &lt;mamanandi@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; Kids&#39; father passed away 6 years ago.  It was quite traumatic and now his mother has passed.  I know that this has affected dd&#39;s attitude, although it seems to be her innate personality to some extent. &lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Well I am admittedly not an unschooling expert, but I am in a similar situation with a new (well 3yr) partner and an intense, high needs child who were until recently in frequent conflict, trying to bring unschooling into the mix. It has been a challenge, but one thing has been really clear from the beginning, that my children are the priority (my son from a past relationship is 9, my daughter with new dh is 1.5). <br/>\n<br/>\nWhen there has been conflict with dh and ds, I make it clear that I understand dh&#39;s concerns, but I do not &quot;put up a united front&quot; or any of the other crap they suggest to parents trying to create a blended family. I do what is most kind or helpful or needed to diffuse the situation even if Dh thinks I am being soft or putting up with too much or whatever his interpretation of the situation is. He has seen me do this enough times now that he knows not to interfere, but sometimes he does storm off. Usually if I say nothing, he feels pretty sheepish later and apologizes or is especially nice. But not if I try to prove my point or get him to see it my way in the moment. Then he just gets more mad. <br/>\n<br/>\nDh and I jumped into or marriage pretty quickly without him having a clear sense of how it would impact his life, how challenging things would be, and I make sure to empathize with him, but I don&#39;t let his difficulties affect my absolute commitment to creating the best life I can for my kids, and especially to healing the damaged relationship I have had with my son from years of controlling parenting in the past, among other reasons. He knows that, he gets it. I am a mother bear and I will fight for my cubs. If I had to choose, there is no question in my mind, sad as I would be, but I would choose my kids. I have made a lot of poor choices in the past, and I am really, really conscious of the effects that has had on my relationship with my son, so my number one priority is healing that and trying to avoid doing any further damage.<br/>\n<br/>\nIt sounds, imo, like your daughter needs to know she can count on you, that you are on her side, in her corner. That is what my son needed and what I have been trying to give him since discovering unschooling. And your partner needs to know that you care about his concerns and you want to work together to address them, but that you are really clear about how you are parenting your kids and why. When I was confused on unsure, that is when my partner was the most angry and frustrated, because I really looked like I didn&#39;t know what I was doing. (I didn&#39;t). It has created some tension in my relationship, but there was tension before in much worse ways. There is also more compassion and love and understanding all around, especially when I remember that dh doesn&#39;t have the benefit of years of attachment and connection with my son, that he is trying his best and that he is also deschooling and not even by his own choice. Then I can honour him and still be really clear about what I am doing and why. <br/>\n<br/>\nCan you try to bring him on board in little ways? Is there something he does really well with the kids that you are not so good at? Can you make that his official job? My dh is the official toothbrusher because he can make it fun and I just get mad and want to make them do it. When we were first starting with more peaceful parenting, we would swap off. If we could see that the other was about to lose it and do something they&#39;d regret, we&#39;d step in gently and say something like, no worries babe, I&#39;ve got this one, and then usually things would chill out since it was almost always the adult&#39;s need for control that was causing the problem. Can you ask your partner to step back from &quot;active&quot; parenting and to focus on building a relationship with your kids? Research shows that in the most successful blended families, the new partner takes a friendly but non-parental role with the kids and is able to accept a lot of resentment and testing before they are accepted. They lower their expectations and open their hearts, and often it is a one way street for a long time. I know it was like that with my step mom, though now I love her as much as my  own mom in a different way. Usually the first 3 years is the most difficult time in a blended family and that has certainly been my experience, in both my dad&#39;s remarriage and mine. <br/>\n<br/>\nOne more thing. I have seen with my dh and others that a lot of men, especially if they were raised by controlling fathers, feel a sense of entitlement to the kind of deference and &quot;respect&quot; (actually fear) that was required of them by their dads. They don&#39;t know how to relate to a kid who has a sense of their own power because they never had that when they were a child. Their own inner child and past hurts are all mixed up in the need to be respected, and they don&#39;t even realize it. As I type this I realize that of course it is not just men,  but could be anyone raised this way. So gently helping them see how things might have been different for them if they had had a real respectful relationship with their father/parents and how you want that for your kids may be helpful. Modelling kindness with both him and your kids. Also maybe having him meet some older unschooled kids might help, or kids who have been unschooled all along, and other dads who are on board with unschooling/peaceful parenting? Those things were also a big help for my Dh in getting on board. <br/>\n<br/>\nAnyway, it sounds like a tricky situation and I can really feel for you. Good luck!</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262566694","msgId":49428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MTAwMTAzMTY1OHI1ODc1MGY3MGs0ZjliYTM2YTE4ZGRlNDMzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPg=="},"prevInTopic":49425,"nextInTopic":49431,"prevInTime":49427,"nextInTime":49429,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"I want to chime in, as I ve been widowed with young children, too.  (they were 2 & 4, when their dad died 9 years ago) I will say first, I am struggling,","messageBody":"<div id=\"ygrps-yiv-1663985954\">I want to chime in, as I&#39;ve been widowed with young children, too.  (they<br/>\nwere 2 & 4, when their dad died 9 years ago)<br/>\nI will say first, I am struggling, looking for the advice I would have<br/>\nappreciated and been open to actually *hearing* if in your shoes...<br/>\nin my head, these blurbs of wisdom seem harsh and I don&#39;t intend them to be;<br/>\nstrong, yes- harsh, no.<br/>\nMy dating mantra was &quot;No one will ever be more important than my kids.&quot;<br/>\nThey&#39;d already lost one parent involuntarily, I had a choice about being<br/>\npresent while I still could be. I had a few good longer relationships, in<br/>\nwhich there was NO parental responsibility put upon a non-parent. I was<br/>\ntotally up front that I was a Mom first and a girlfriend second. The guys<br/>\nwho were okay with that stuck around, the ones who weren&#39;t didn&#39;t.<br/>\nOne guy who stuck around for a while and really made an effort, had been our<br/>\nfriend for 7 years before dh died. A True Love in my book. And after two<br/>\nyears of pretty serious dating, he knew he was really, really sure that he<br/>\njust is NOT a kid guy and no matter how much we love each other and want<br/>\nthis to work (or how much he likes my kids as other-people&#39;s-kids), he<br/>\ncannot be in a family. Maybe, he said, we&#39;ll meet up when the kids are<br/>\ngrown. Broke my heart in the short run and in the long run, I *SO*<br/>\nappreciate the honesty. We were better off apart and happy, than with<br/>\nsomeone for whom this life is not ideal.<br/>\nNow we got Scotty my super cool boyfriend.   We&#39;ve been together almost<br/>\nthree years and he and Hayden get along splendidly. We&#39;ve done lots of<br/>\nnavigating over the years, to find balance in everything. I was pretty clear<br/>\nfrom the beginning, though, not wanting to waste time with anyone who&#39;s<br/>\nideas were too far different than my own.  ;)<br/>\nWhen I married my husband, we decided early on that our children would be<br/>\nthe priority of our young marriage; if we were going to be married forever,<br/>\ntheir childhoods are a mere blip of time and there will be plenty of times<br/>\nfor grown up stuff when the grown ups are alone.  As the kids get older,<br/>\nthere&#39;s a lot more time for grownups to be alone and do those things put of<br/>\nas &quot;not as important as being there for the small kids.&quot; It was a mentality<br/>\nI carry with me, even without him.  (I&#39;ll have plenty of time to be<br/>\npolitically active and volunteer and get some letters after my name, when<br/>\nI&#39;m done with my acute parenting)<br/>\n<br/>\nIf your child, especially your sensitive, mourning child needs you and that<br/>\nneed is resented by someone in your life -- it needs to be discussed and<br/>\nclarified.  She *is* the child, he *is* the grownup; I expect he has the<br/>\nability to understand her need of her mama and not to judge it. The more you<br/>\nmeet her needs, the fewer needs there&#39;ll be to meet (a LLL wisdom).  Be<br/>\nthere for her now, show her she can count on your presence and support as<br/>\nshe navigates through this scary bit of life. Then life won&#39;t be so scary<br/>\nand her need of you less acute.<br/>\n<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.wordpress.com<br/>\nhannahsashes.blogspot.com<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Jan 1, 2010 at 11:50 AM, mamanandi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamanandi@...\">mamanandi@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Another is with DD&#39;s attitude. I love her more than anything in the world<br/>\n&gt; and she is a very sweet girl, but has always felt easily frustrated. I know<br/>\n&gt; that she feels a lot of pain inside from the passing of her papa (and<br/>\n&gt; recently, her beloved grandmother), but lately she has been freaking out<br/>\n&gt; over almost everything that doesn&#39;t go her way. I try to set her up for<br/>\n&gt; success as much as possible, but ends up in a meltdown at least 3-4<br/>\n&gt; times/day. Right now i try as much as possible to be loving and give her<br/>\n&gt; space if she need it or embrace and positive words if she can handle them,<br/>\n&gt; but I want to do better for her. DH (actually fiance) is struggling even<br/>\n&gt; more than me because he is new to the parenting thing and had strict parents<br/>\n&gt; that he rebelled against. He wants to be a good parent but struggles with<br/>\n&gt; thinking that means control or &quot;being respected&quot;. I try to remind him to<br/>\n&gt; love her and be there for her and build trust with her.<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: navigating the unschooling ocean : )","postDate":"1262553973","msgId":49425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5ODA2Mi4xMjEwLnFtQHdlYjExMDQxNC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PFNOVDEwNy1XMTNBQzgyN0EzODFBNjRFRUIyNjFBQkQ3NzUwQHBoeC5nYmw+","referencesHeader":"PFNOVDEwNy1XNjQ0NDlFRkQyQkY2QjYwNzQ5ODM3QUQ3NzUwQHBoeC5nYmw+LDxoaHBhazAraGs4ZEBlR3JvdXBzLmNvbT4gPFNOVDEwNy1XMTNBQzgyN0EzODFBNjRFRUIyNjFBQkQ3NzUwQHBoeC5nYmw+"},"prevInTopic":49418,"nextInTopic":49428,"prevInTime":49424,"nextInTime":49426,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"***I cannot countermand his arbitrary rules. I see that I can treat the children respectfully and with abundance of love and compassion (and I already am doing","messageBody":"<div id=\"ygrps-yiv-2144050704\">***I cannot countermand his arbitrary rules. I see that I can treat the children respectfully and with abundance of love and compassion (and I already am doing that - or trying to), but in terms of really opening up the household to a more unschooling way of life - eg. lifting restrictions on food, TV, not having to say &quot;no&quot; to them so often, etc. - I am somewhat stuck.***<br/>\n<br/>\nCan you coach the kids on how to discuss options with their dad?  If there are a lot of arbitrary rules that the kids really dislike, and seem to get in the way more than other rules, can you all work together on those ones to find ways where everyone can be happy, dad included.  If there is a restriction on the amount of time spent watching TV, can it be eased a little to allow for more flexibility?  If dad&#39;s reasoning is because he wants to see that the kids are doing lots of other things, can they still do that and be more flexible with the amount of time watching TV?  Parents shouldn&#39;t be dictators, even if they want to set rules and have kids follow them.<br/>\n<br/>\nMy parents were very much typical parents, in the sense that they had expectations, and even a few rules that we had to follow, but there was never any doubt in my mind that I could discuss any of those things at any time with them and negotiate for something to be done differently.  My parents were particularly susceptible to well thought out, reasoned arguments for something to be done differently.  In this way, I felt that I could be truly heard on important things.  It wasn&#39;t unschooling and it didn&#39;t produce a kindred relationship between me and my parents, like the kind I have with my own children, but it was certainly a lot better than a lot of other kids&#39; relationships.  I also have a good relationship with them now.  I talk to them at least once a week, sometimes more and have been doing that since I left their house when I was 18.<br/>\n<br/>\n***So how does that work? I see clearly that unschooling will bring great healing to my own child-self and to our kids - but will it really work its magic for them if one parent is continually inflicting damage with criticism and harsh words and arbitrary rules? Maybe the answer is &quot;no&quot; and I just have to accept that my kids are not going to get the full benefits of an unschooled upbringing. But that answer is excruciating. ***<br/>\n<br/>\nEach child will have their own relationship with each parent.  I think each parent gets to foster how that relationship gets to be.  Perhaps the dad here doesn&#39;t want that kind of relationship with his kids, maybe he really wants to have a more traditional relationship where he is the big man of the house that the kids must go through in a power sort of way.  There isn&#39;t anything inherently wrong with that, and it certainly doesn&#39;t mean that the mom has to have that sort of relationship with her kids.  The kids may learn to ask mom first before asking dad because they&#39;ll know that mom will say &quot;yes&quot;, and once mom says &quot;yes&quot;, then dad&#39;s &quot;no&quot; becomes less.  The way I&#39;m saying that could be taken as undermining dad, but I think it can be done in such a way that it doesn&#39;t, especially if everyone amps up the sweetness towards dad.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: navigating the unschooling ocean : )","postDate":"1262532949","msgId":49418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0MjZERkMwLUM2QzctNDMwNC05RDU4LTUxRUY1MUQzRERBOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFNOVDEwNy1XMTNBQzgyN0EzODFBNjRFRUIyNjFBQkQ3NzUwQHBoeC5nYmw+","referencesHeader":"PFNOVDEwNy1XNjQ0NDlFRkQyQkY2QjYwNzQ5ODM3QUQ3NzUwQHBoeC5nYmw+LDxoaHBhazAraGs4ZEBlR3JvdXBzLmNvbT4gPFNOVDEwNy1XMTNBQzgyN0EzODFBNjRFRUIyNjFBQkQ3NzUwQHBoeC5nYmw+"},"prevInTopic":49416,"nextInTopic":49425,"prevInTime":49417,"nextInTime":49419,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"-=-***What if you let him parent as he wants and you parent as you want without either of you trying to control the other?*** -=-This is exactly my question.","messageBody":"<div id=\"ygrps-yiv-1369746150\">-=-***What if you let him parent as he wants and you parent as you  <br/>\nwant without either of you trying to control the other?***<br/>\n<br/>\n-=-This is exactly my question. How does this really work? If I am  <br/>\ntruly respecting his role/feelings/choices as a parent, I cannot  <br/>\nunilaterally make decisions for the kids without his consent. I cannot  <br/>\ncountermand his arbitrary rules. -=-<br/>\n<br/>\nMaybe you could request single exceptions and see how that goes.   <br/>\nMaybe gradually the kids could have more leeway and choices.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237179913,"authorName":"LEAH ROSE","from":"LEAH ROSE &lt;mama25kids@...&gt;","profile":"smartymom5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: navigating the unschooling ocean : )","postDate":"1262531986","msgId":49416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwNy1XMTNBQzgyN0EzODFBNjRFRUIyNjFBQkQ3NzUwQHBoeC5nYmw+","inReplyToHeader":"PGhocGFrMCtoazhkQGVHcm91cHMuY29tPg==","referencesHeader":"PFNOVDEwNy1XNjQ0NDlFRkQyQkY2QjYwNzQ5ODM3QUQ3NzUwQHBoeC5nYmw+LDxoaHBhazAraGs4ZEBlR3JvdXBzLmNvbT4="},"prevInTopic":49414,"nextInTopic":49418,"prevInTime":49415,"nextInTime":49417,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"***I m not sure it s really your job to bring him along.  Can you treat the kids in the manner in which you deem appropriate or right without requiring the","messageBody":"<div id=\"ygrps-yiv-1385023094\">***I&#39;m not sure it&#39;s really your job to &quot;bring him along.&quot;  Can you treat the kids in the manner in which you deem appropriate or right without requiring the same from your husband?  Your example might inspire him to change his course, yet it might not!***<br/>\n<br/>\n***Would it be fair for him to want to bring you along to his way of parenting? Maybe he&#39;s trying to do just that. How does that feel?***<br/>\n<br/>\nOf course the control freak in me does want to &quot;make&quot; him parent my way and I recognize that that&#39;s a destructive mentality and impulse, so I try to stay mindful of it and reject it.  So no, it&#39;s not my business to change how he parents.  I do want to inspire him, which may or may not happen.  <br/>\n<br/>\n***What if you let him parent as he wants and you parent as you want without either of you trying to control the other?***<br/>\n<br/>\nThis is exactly my question.  How does this really work?  If I am truly respecting his role/feelings/choices as a parent, I cannot unilaterally make decisions for the kids without his consent.  I cannot countermand his arbitrary rules.  I see that I can treat the children respectfully and with abundance of love and compassion (and I already am doing that - or trying to), but in terms of really opening up the household to a more unschooling way of life - eg. lifting restrictions on food, TV, not having to say &quot;no&quot; to them so often, etc. - I am somewhat stuck.  Or maybe I just have to be content to let it take time.  But then I read somewhere in one of Sandra&#39;s essays that with older kids, time is running out - if you wait too long to start unschooling, you may lose the opportunity for it to make any real difference in their lives.  <br/>\n<br/>\n***What if you see the little boy in him that was parented harshly and give him the parenting that you give your kids?***<br/>\n<br/>\nGot it.  This is what I meant in my original post when I said: &quot;My instincts tells me that if I shower my husband with the same abundance of love, compassion and patience that I want us to show our children, then maybe he&#39;ll begin to see the light and/or follow my lead with them, and so I&#39;ve started consciously trying to do that.&quot;<br/>\n<br/>\n***But in any case, in a marriage there needs to be agreement to do anything big...Unschooling is BIG, like those things are.***<br/>\n<br/>\nYES!  This is why I&#39;m conflicted.  We&#39;ve always made decisions together, and Dh has gone along quite happily with unschooling the &quot;academics,&quot; but I see the real griefs in our family arising from our parenting and relationship dynamics.  That is what I want to heal.  But it IS a personal journey that you can not force another person to take.  So how does that work?  I see clearly that unschooling will bring great healing to my own child-self and to our kids - but will it really work its magic for them if one parent is continually inflicting damage with criticism and harsh words and arbitrary rules?  Maybe the answer is &quot;no&quot; and I just have to accept that my kids are not going to get the full benefits of an unschooled upbringing.  But that answer is excruciating. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: navigating the unschooling ocean : )","postDate":"1262530718","msgId":49414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxQzcwNDc5LTg0RUQtNDRGQi05Q0FBLTY0MDgwNkQzN0NEQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhocGFrMCtoazhkQGVHcm91cHMuY29tPg==","referencesHeader":"PGhocGFrMCtoazhkQGVHcm91cHMuY29tPg=="},"prevInTopic":49413,"nextInTopic":49416,"prevInTime":49413,"nextInTime":49415,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"-=-I m not sure it s really your job to bring him along. Can you treat the kids in the manner in which you deem appropriate or right without requiring the","messageBody":"<div id=\"ygrps-yiv-2143066367\">-=-I&#39;m not sure it&#39;s really your job to &quot;bring him along.&quot; Can you  <br/>\ntreat the kids in the manner in which you deem appropriate or right  <br/>\nwithout requiring the same from your husband? Your example might  <br/>\ninspire him to change his course, yet it might not! -=-<br/>\n<br/>\nI never thought of this until this morning.  Some of you probably  <br/>\nthought of it a long time ago.<br/>\n<br/>\nIt is possible that if the mom is the only one in the marriage or in  <br/>\nthe family who thinks unschooling would be awesome, it could  <br/>\npotentially be that she wants to recover from her own children, and  <br/>\nthat she needs that more than her children do.  Although I&#39;ve long  <br/>\nheld that kids shouldn&#39;t be taken out of school against their will, it  <br/>\nhadn&#39;t occurred to me that a parent might insist for her own healing.   <br/>\nI don&#39;t know why I hadn&#39;t thought of that, since I&#39;ve also written  <br/>\nabout how healing it could be.  &lt;g&gt;<br/>\n<br/>\nSo another bit of info fills in spaces in my understanding of  <br/>\nunschooling.<br/>\n<br/>\nClearly there are parents who live vicariously through their  <br/>\nchildren&#39;s potential to be tennis stars or golf champions or Olympic  <br/>\ngold medalists.  Some parents press children to play violin or piano.<br/>\n<br/>\nIf a mother is bucking her husband&#39;s wishes *and* her children&#39;s  <br/>\nwishes to insist on unschooling, IF that is really an attempt to  <br/>\nrelive her own childhood, that could be a bad thing.<br/>\n<br/>\nBut in any case, in a marriage there needs to be agreement to do  <br/>\nanything big.  If one partner changes religions, that&#39;s a threat to  <br/>\nthe marriage.  If one changes religions and assumes and expects that  <br/>\nthe other will just blindly change too, there&#39;s not much good in that  <br/>\nat all.  If that doesn&#39;t destroy the marriage, one of those people is  <br/>\na saint, and probably it&#39;s the less religious one.   One partner can&#39;t  <br/>\nbuy a yacht or an airplane without the other one knowing and saying  <br/>\nokay, even if they could afford one.  Unschooling is BIG, like those  <br/>\nthings are.  Unschooling isn&#39;t like the decision between private  <br/>\nschool and public, or between ABeka and Sonlight for a Christian  <br/>\nCurriculum.<br/>\n<br/>\nMaybe some people are treating it as a light, quick decision.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":58132404,"authorName":"Marcia Simonds","from":"&quot;Marcia Simonds&quot; &lt;MarSi77@...&gt;","profile":"m6hschch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: navigating the unschooling ocean : )","postDate":"1262524093","msgId":49413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCNzE4NTE4OENGQzQ0MkM4NjM3RUM2OUIwOUE4OTA4QG1hcmNpYVBDPg==","inReplyToHeader":"PGhocGFrMCtoazhkQGVHcm91cHMuY29tPg==","referencesHeader":"PGhocGFrMCtoazhkQGVHcm91cHMuY29tPg=="},"prevInTopic":49411,"nextInTopic":49414,"prevInTime":49412,"nextInTime":49414,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1923089651\">&lt;&lt;&lt;I am struggling with how to bring him along, to foster a more respectful way of parenting in our household. Because from where I&#39;m standing, autocratic methods do not mesh at all with unschooling ways of being.&lt;&lt;&lt;<br/>\n<br/>\nPerhaps he doesn&#39;t know any other way. If you model the behavior you want to see , perhaps he will see that there are other ways to go about things. <br/>\n<br/>\nLook for opportunities to talk about *why* you said what you did to the children and your feelings on it. But with objectivity towards your husband. <br/>\n<br/>\nMy husband, who came from a *because I said so* home, and we raised 4 older children via traditional parenting methods, needed to have me point out concrete examples with the children in order for him to change his thinking and respond in a different way than he was used to. And mainly having a reason for *why* is it better this way. It led to further discussions ( sometimes heated &lt;&lt;G&gt;&gt;) about choice, mutual respect, and what all children deserve and why. It all helped with his future parenting. <br/>\n<br/>\nHe treats the children with much more respect now and realizes that they have do a choice in life and accepts their answer if it is a *no* &lt;&lt;G&gt;&gt;.  It could be better but it is at a point where unschooling can( and does!) flourish.<br/>\n<br/>\n<br/>\nmarcia simonds<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://livefreeinharmony.xanga.com/\">http://livefreeinharmony.xanga.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.anestinnature.com/\">http://www.anestinnature.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: theburkemommy <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Sunday, January 03, 2010 12:40 AM<br/>\n  Subject: [AlwaysLearning] Re: navigating the unschooling ocean : )<br/>\n<br/>\n<br/>\n    <br/>\n  I&#39;m not sure it&#39;s really your job to &quot;bring him along.&quot; Can you treat the kids in the manner in which you deem appropriate or right without requiring the same from your husband? Your example might inspire him to change his course, yet it might not! <br/>\n<br/>\n  --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, LEAH ROSE &lt;mama25kids@...&gt; wrote:<br/>\n  &gt;<br/>\n  &gt; <br/>\n  &gt; ***He&#39;s right, children aren&#39;t adults, they shouldn&#39;t be treated as adults. They should be treated with the same respect and regard that you&#39;d treat any other human being that you care deeply for. Kids learn from examples. If you are treating them with respect and kindness then they will, in turn, do the same. If you disregard their feelings, then they will do the same towards you. That is what is usually meant when unschoolers talk about treating children respectfully. ***<br/>\n  &gt; <br/>\n  &gt; Jenny, thank you for responding and for the web site. Yes, my husband is right that children are not adults, but my point was that he thinks unschooling is about treating children like adults exactly because it&#39;s about treating them as a people in their own right (which he views as the way to treat adults, not children). He does not really buy into the need to set an example; he is very much of the &quot;do as I say, not as I do&quot; school of thought. As far as he is concerned, children should defer to parental authority because they are kids and parents are the adults charged with their upbringing and well-being. If he says &quot;jump,&quot; they don&#39;t necessarily have to respond &quot;how high?&quot; but &quot;no&quot; is not an acceptable answer. He does not believe feelings matter much - certainly are not the priority or gauge by which child/parent interactions should be calibrated. I feel like I have really come to understand the basics of unschooling - the what, why, and how, so to speak. I am struggling with how to bring him along, to foster a more respectful way of parenting in our household. Because from where I&#39;m standing, autocratic methods do not mesh at all with unschooling ways of being.<br/>\n  &gt; <br/>\n  &gt; Robin - thanks so much for the book recommendation. I&#39;m on it! ~ Leah<br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; <br/>\n  &gt; [Non-text portions of this message have been removed]<br/>\n  &gt;<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262516341","msgId":49411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZGRkY5N0E2LUFFQTUtNDdFMC04NTZELUU2RjYwN0VFMTA0NUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PFNOVDEwNy1XNjQ0NDlFRkQyQkY2QjYwNzQ5ODM3QUQ3NzUwQHBoeC5nYmw+","referencesHeader":"PFNOVDEwNy1XNDg3OERBMEYzRjY1NEM4OTIxOEEwN0Q3NzYwQHBoeC5nYmw+LCA8MzQzNDAwLjU1MDk2LnFtQHdlYjExMDQwNi5tYWlsLmdxMS55YWhvby5jb20+IDxTTlQxMDctVzY0NDQ5RUZEMkJGNkI2MDc0OTgzN0FENzc1MEBwaHguZ2JsPg=="},"prevInTopic":49409,"nextInTopic":49413,"prevInTime":49410,"nextInTime":49412,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"... Would it be fair for him to want to bring you along to his way of parenting? Maybe he s trying to do just that. How does that feel? What if you let him","messageBody":"<div id=\"ygrps-yiv-1551800308\">On Jan 2, 2010, at 11:23 PM, LEAH ROSE wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am struggling with how to bring him along, to foster a more  <br/>\n&gt; respectful way of parenting in our household. Because from where  <br/>\n&gt; I&#39;m standing, autocratic methods do not mesh at all with  <br/>\n&gt; unschooling ways of being.<br/>\n<br/>\n </span></blockquote>Would it be fair for him to want to bring you along to his way of  <br/>\nparenting? Maybe he&#39;s trying to do just that. How does that feel?<br/>\n<br/>\nWhat if you let him parent as he wants and you parent as you want  <br/>\nwithout either of you trying to control the other?<br/>\n<br/>\nWhat if you see the little boy in him that was parented harshly and  <br/>\ngive him the parenting that you give your kids?<br/>\n<br/>\nIf he gets upset that the kids always go to you because you&#39;re soft,  <br/>\ndon&#39;t take it as an accusation. It&#39;s a fact he&#39;s observed! (Even if  <br/>\nhe states it as an accusation ;-) Be honest and say you want to be  <br/>\nsomeone they feel they can take their problems to. You want to help  <br/>\nthem find safe and respectful ways to solve problems, not leave them  <br/>\nalone to try things that they don&#39;t realize are dangerous, or to go  <br/>\nto their friends, or some stranger who offers soothing words.<br/>\n<br/>\nLook at his needs too and treat them with the respect you want to  <br/>\ntreat your kids needs. If he needs some peace in the evening, for  <br/>\ninstance, find ways to make that happen. If he needs a clean spot in  <br/>\nthe house, find a way to make that happen. Joyfully do that and  <br/>\nengage the kids in offering that to him as a gift.<br/>\n<br/>\nIt&#39;s hard for someone to embrace something new when that new thing  <br/>\ncauses them misery! Unschooling and mindful parenting is something  <br/>\nyou want to bring into the house helping your husband feel safe and  <br/>\nappreciated in his own home is part of that.<br/>\n<br/>\nDo you know about the Peaceful Partnerships list:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Peacefulpartnerships/\">http://groups.yahoo.com/group/Peacefulpartnerships/</a><br/>\n<br/>\nJust reading the archives should give you a wealth of ways to use the  <br/>\nphilosophy of unschooling to build a better relationship with him.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334729351,"authorName":"theburkemommy","from":"&quot;theburkemommy&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: navigating the unschooling ocean : )","postDate":"1262497216","msgId":49409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhocGFrMCtoazhkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDEwNy1XNjQ0NDlFRkQyQkY2QjYwNzQ5ODM3QUQ3NzUwQHBoeC5nYmw+"},"prevInTopic":49408,"nextInTopic":49411,"prevInTime":49408,"nextInTime":49410,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"I m not sure it s really your job to bring him along.  Can you treat the kids in the manner in which you deem appropriate or right without requiring the same","messageBody":"<div id=\"ygrps-yiv-887122447\">I&#39;m not sure it&#39;s really your job to &quot;bring him along.&quot;  Can you treat the kids in the manner in which you deem appropriate or right without requiring the same from your husband?  Your example might inspire him to change his course, yet it might not!  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, LEAH ROSE &lt;mama25kids@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; ***He&#39;s right, children aren&#39;t adults, they shouldn&#39;t be treated as adults.  They should be treated with the same respect and regard that you&#39;d treat any other human being that you care deeply for.  Kids learn from examples.  If you are treating them with respect and kindness then they will, in turn, do the same.  If you disregard their feelings, then they will do the same towards you.  That is what is usually meant when unschoolers talk about treating children respectfully. ***<br/>\n&gt; <br/>\n&gt; Jenny, thank you for responding and for the web site.  Yes, my husband is right that children are not adults, but my point was that he thinks unschooling is about treating children like adults exactly because it&#39;s about treating them as a people in their own right (which he views as the way to treat adults, not children).  He does not really buy into the need to set an example; he is very much of the &quot;do as I say, not as I do&quot; school of thought.  As far as he is concerned, children should defer to parental authority because they are kids and parents are the adults charged with their upbringing and well-being.  If he says &quot;jump,&quot; they don&#39;t necessarily have to respond &quot;how high?&quot; but &quot;no&quot; is not an acceptable answer.   He does not believe feelings matter much - certainly are not the priority or gauge by which child/parent interactions should be calibrated.  I feel like I have really come to understand the basics of unschooling - the what, why, and how, so to speak.  I am struggling with how to bring him along, to foster a more respectful way of parenting in our household.  Because from where I&#39;m standing, autocratic methods do not mesh at all with unschooling ways of being.<br/>\n&gt; <br/>\n&gt; Robin - thanks so much for the book recommendation.  I&#39;m on it!      ~ Leah<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;    \t\t \t   \t\t  <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":237179913,"authorName":"LEAH ROSE","from":"LEAH ROSE &lt;mama25kids@...&gt;","profile":"smartymom5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262492588","msgId":49408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwNy1XNjQ0NDlFRkQyQkY2QjYwNzQ5ODM3QUQ3NzUwQHBoeC5nYmw+","inReplyToHeader":"PDM0MzQwMC41NTA5Ni5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PFNOVDEwNy1XNDg3OERBMEYzRjY1NEM4OTIxOEEwN0Q3NzYwQHBoeC5nYmw+LDwzNDM0MDAuNTUwOTYucW1Ad2ViMTEwNDA2Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":49404,"nextInTopic":49409,"prevInTime":49407,"nextInTime":49409,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"***He s right, children aren t adults, they shouldn t be treated as adults.  They should be treated with the same respect and regard that you d treat any other","messageBody":"<div id=\"ygrps-yiv-1870641514\">***He&#39;s right, children aren&#39;t adults, they shouldn&#39;t be treated as adults.  They should be treated with the same respect and regard that you&#39;d treat any other human being that you care deeply for.  Kids learn from examples.  If you are treating them with respect and kindness then they will, in turn, do the same.  If you disregard their feelings, then they will do the same towards you.  That is what is usually meant when unschoolers talk about treating children respectfully. ***<br/>\n<br/>\nJenny, thank you for responding and for the web site.  Yes, my husband is right that children are not adults, but my point was that he thinks unschooling is about treating children like adults exactly because it&#39;s about treating them as a people in their own right (which he views as the way to treat adults, not children).  He does not really buy into the need to set an example; he is very much of the &quot;do as I say, not as I do&quot; school of thought.  As far as he is concerned, children should defer to parental authority because they are kids and parents are the adults charged with their upbringing and well-being.  If he says &quot;jump,&quot; they don&#39;t necessarily have to respond &quot;how high?&quot; but &quot;no&quot; is not an acceptable answer.   He does not believe feelings matter much - certainly are not the priority or gauge by which child/parent interactions should be calibrated.  I feel like I have really come to understand the basics of unschooling - the what, why, and how, so to speak.  I am struggling with how to bring him along, to foster a more respectful way of parenting in our household.  Because from where I&#39;m standing, autocratic methods do not mesh at all with unschooling ways of being.<br/>\n<br/>\nRobin - thanks so much for the book recommendation.  I&#39;m on it!      ~ Leah<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: navigating the unschooling ocean : )","postDate":"1262490640","msgId":49404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NTE5MS40MTU1Ni5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhob3ZqNis3anRkQGVHcm91cHMuY29tPg==","referencesHeader":"PGhob3ZqNis3anRkQGVHcm91cHMuY29tPg=="},"prevInTopic":49402,"nextInTopic":49408,"prevInTime":49403,"nextInTime":49405,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"This is a very difucult situation.  Is he interested and learning more about parenting?   Alex Polikowsky http://polykow.blogspot.com/ ","messageBody":"<div id=\"ygrps-yiv-957845631\">This is a very difucult situation. <br/>\nIs he interested and learning more about parenting?<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326490917,"authorName":"mamanandi","from":"&quot;mamanandi&quot; &lt;mamanandi@...&gt;","profile":"mamanandi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: navigating the unschooling ocean : )","postDate":"1262485926","msgId":49402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhob3ZqNis3anRkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU3OTQ1LjExMjQyLnFtQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":49399,"nextInTopic":49404,"prevInTime":49401,"nextInTime":49403,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"Kids father passed away 6 years ago.  It was quite traumatic and now his mother has passed.  I know that this has affected dd s attitude, although it seems to","messageBody":"<div id=\"ygrps-yiv-522034323\">Kids&#39; father passed away 6 years ago.  It was quite traumatic and now his mother has passed.  I know that this has affected dd&#39;s attitude, although it seems to be her innate personality to some extent. She and my fiance  have had struggles from the beginning.  Both are very headstrong.  I guess what I need assistance with is how to help my guy interact with her without needing to control her behavior because their interactions are like a downward spiral.  It is my belief and experience that if i give her time to unwind her frustration she snaps back pretty quickly.  He, on the other hand, wants to &quot;nip things in the bud&quot;.  In other words, to not let her get away with throwing a fit, not just let it go and talk to her when she is calmer.  this take usually ends up with an hour plus long fit.  But he says that he cannot deal anymore with her rudeness and will just stay in the bedroom and not interact with her.  I am starting to think that I made a very bad choice in a relationship.  If he can&#39;t deal with rudeness now, what is going to happen when she gets older and doesn&#39;t have any trust built with him and therefore no real respect?<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; So the children&#39;s father passed away recently and you have a new relationship ?<br/>\n&gt; Could that be related to your daughter&#39;s having more meldowns?<br/>\n&gt; Sounds like your living situation just changed or have you been living with your fiance long?<br/>\n&gt; ï¿½<br/>\n&gt; Alex Polikowsky<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262476842","msgId":49399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDOTk2NDhFLUE2NTEtNEEyNS1CQTU3LTQ0QzA2QzBBRjcxMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDExNDQxLjY0MDc1LnFtQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PFNOVDEwNy1XNDg3OERBMEYzRjY1NEM4OTIxOEEwN0Q3NzYwQHBoeC5nYmw+IDwzNDM0MDAuNTUwOTYucW1Ad2ViMTEwNDA2Lm1haWwuZ3ExLnlhaG9vLmNvbT4gPDExNDQxLjY0MDc1LnFtQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":49392,"nextInTopic":49402,"prevInTime":49398,"nextInTime":49400,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"-=- My husband really liked to listen to Sandra Peaceful Parenting  ( is that the title?) talk. You can hear it too it on her site.-=- ","messageBody":"<div id=\"ygrps-yiv-1769681631\">-=-<br/>\nMy husband really liked to listen to Sandra Peaceful Parenting  ( is  <br/>\nthat the title?) talk.<br/>\nYou can hear it too it on her site.-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nThere are other things to listen to here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/listen\">http://sandradodd.com/listen</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262471647","msgId":49392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNDQxLjY0MDc1LnFtQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDM0MzQwMC41NTA5Ni5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PFNOVDEwNy1XNDg3OERBMEYzRjY1NEM4OTIxOEEwN0Q3NzYwQHBoeC5nYmw+IDwzNDM0MDAuNTUwOTYucW1Ad2ViMTEwNDA2Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":49391,"nextInTopic":49399,"prevInTime":49391,"nextInTime":49393,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"My husband really liked to listen to Sandra Peaceful Parenting  ( is that the title?) talk. You can hear it too it on her site.   Alex Polikowsky ","messageBody":"<div id=\"ygrps-yiv-1340748166\">My husband really liked to listen to Sandra Peaceful Parenting  ( is that the title?) talk.<br/>\nYou can hear it too it on her site.<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262471380","msgId":49391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyQjNBNjI1LUVDQ0MtNDdGNy1CNEYwLTc0REZEQTIwNTU4MEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PFNOVDEwNy1XNDg3OERBMEYzRjY1NEM4OTIxOEEwN0Q3NzYwQHBoeC5nYmw+","referencesHeader":"PFNOVDEwNy1XNDg3OERBMEYzRjY1NEM4OTIxOEEwN0Q3NzYwQHBoeC5nYmw+"},"prevInTopic":49390,"nextInTopic":49392,"prevInTime":49390,"nextInTime":49392,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"... Pam has recommended this book before and I heartily recommend it, too: Parent/Teen Breakthrough: The Relationship Approach by Mira Kirshenbaum and Charles","messageBody":"<div id=\"ygrps-yiv-1156559413\"><blockquote><span title=\"ireply\">&gt; So I guess I&#39;m writing to ask if any of you have ideas about how to  <br/>\n&gt; proceed in this situation.  I hear Pam advising not to disregard the  <br/>\n&gt; feelings and ideas of the less committed parent but to try to  <br/>\n&gt; incorporate them.  I&#39;m struggling to understand how I do that in my  <br/>\n&gt; situation.  My instincts tells me that if I shower my husband with  <br/>\n&gt; the same abundance of love, compassion and patience that I want us  <br/>\n&gt; to show our children, then maybe he&#39;ll begin to see the light and/or  <br/>\n&gt; follow my lead with them, and so I&#39;ve started consciously trying to  <br/>\n&gt; do that.  And to his credit, he always has been willing to read  <br/>\n&gt; anything I ask him to, so I plan to give him some of Sandra&#39;s  <br/>\n&gt; essays.  (She&#39;s the one of been reading, mostly)  She provides a  <br/>\n&gt; very logical and balanced explanation of unschooling, which I hope  <br/>\n&gt; might counteract the initial reading we did on the topic - some of  <br/>\n&gt; that literature used the &quot;radical unschooling&quot; term and that totally  <br/>\n&gt; turned off my husband to the ideas.<br/>\n&gt;<br/>\n </span></blockquote>Pam has recommended this book before and I heartily recommend it, too:<br/>\n<br/>\nParent/Teen Breakthrough: The Relationship Approach by Mira  <br/>\nKirshenbaum and Charles Foster<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Parent-Teen-Breakthrough-Relationship-Approach/dp/0452266165\">http://www.amazon.com/Parent-Teen-Breakthrough-Relationship-Approach/dp/0452266165</a><br/>\n<br/>\nIt&#39;s not an unschooling or radical unschooling book, but the  <br/>\nsuggestions put forth segue nicely with unschooling. It addresses the  <br/>\nauthoritarian approach and how it doesn&#39;t work, especially with teens,  <br/>\nbut it&#39;s helpful information for relationships with any-aged children.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262469749","msgId":49390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0MzQwMC41NTA5Ni5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PFNOVDEwNy1XNDg3OERBMEYzRjY1NEM4OTIxOEEwN0Q3NzYwQHBoeC5nYmw+","referencesHeader":"PFNOVDEwNy1XNDg3OERBMEYzRjY1NEM4OTIxOEEwN0Q3NzYwQHBoeC5nYmw+"},"prevInTopic":49389,"nextInTopic":49391,"prevInTime":49389,"nextInTime":49391,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"***He flat out doesn t believe in treating children as adults (which is how he understands unschooling philosophy); in his mind, setting rules and limits and","messageBody":"<div id=\"ygrps-yiv-1583254789\">***He flat out doesn&#39;t believe in &quot;treating children as adults&quot; (which is how he understands unschooling philosophy); in his mind, setting rules and limits and disciplining IS the role of a parent - the moral obligation***<br/>\n<br/>\nHe&#39;s right, children aren&#39;t adults, they shouldn&#39;t be treated as adults.  They should be treated with the same respect and regard that you&#39;d treat any other human being that you care deeply for.  Kids learn from examples.  If you are treating them with respect and kindness then they will, in turn, do the same.  If you disregard their feelings, then they will do the same towards you.  That is what is usually meant when unschoolers talk about treating children respectfully.  Yet, they aren&#39;t adults, so the adults around them, out of a moral obligation, if you will, should treat them with respect and kindness, KNOWing that they are less knowledgeable and able and will, over time, become more knowledgeable and able.  Doing that, being respectful and acknowledging their feelings, will go a looooong way to a peaceful relationship with your kids and they will be way more likely to listen to your wisdom and follow it.<br/>\n<br/>\n***so I plan to give him some of Sandra&#39;s essays. (She&#39;s the one of been reading, mostly) She provides a very logical and balanced explanation of unschooling, which I hope might counteract the initial reading we did on the topic - some of that literature used the &quot;radical unschooling&quot; term and that totally turned off my husband to the ideas. ***<br/>\n<br/>\nJoyce has a great website too, full of good logical sound writings on unschooling!  <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262468656","msgId":49389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0OTguMTY4My5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRCM0Y4MDk1LjcwNzAzQG1hYy5jb20+","referencesHeader":"PDM3ODQwODAyMi40ODIxNjIxMjYyMzk3OTg3MzM0LkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+IDw0QjNGODA5NS43MDcwM0BtYWMuY29tPg=="},"prevInTopic":49386,"nextInTopic":49390,"prevInTime":49388,"nextInTime":49390,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"***If a parent thinks his own life should be mostly unimpacted by having children - he should still get to pretty much always do what he wants without regard","messageBody":"<div id=\"ygrps-yiv-1541907846\">***If a parent thinks his own life <br/>\nshould be mostly unimpacted by having children - he should still get to <br/>\npretty much always do what he wants without regard to the children <br/>\n(watch what he wants on tv, have quiet when he wants it, listen to his <br/>\nown music, engage in his own hobbies or interests without any <br/>\ninterruptions) then the kids are going to often seem to be in the way. <br/>\nI&#39;ve heard moms say that it always seems like their husband is trying to <br/>\nfind ways to spend time without the kids. (I&#39;m sure this is sometimes <br/>\nreversed - sometimes dads are more into the kids than the moms - but not <br/>\ncommonly.)***<br/>\n <br/>\nI have a really good friend who&#39;s husband is this way.  He&#39;s a really nice guy, super good provider and really loves their child, but it doesn&#39;t change the fact that he&#39;s not a &quot;kid&quot; person.  He&#39;s way better now that his daughter is 15 than when she was 4.  My friend, his wife accomodated that on every level possible to create peace in the house for all of them.  Mothers with husbands like that, should do that for all of their sakes.  Sometimes you don&#39;t know in advance whether or not the person you chose to have a child with is actually good with kids, and some men grow into it better than others, and some are just natural at it.<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237179913,"authorName":"LEAH ROSE","from":"LEAH ROSE &lt;mama25kids@...&gt;","profile":"smartymom5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262461181","msgId":49386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwNy1XNDg3OERBMEYzRjY1NEM4OTIxOEEwN0Q3NzYwQHBoeC5nYmw+"},"prevInTopic":49376,"nextInTopic":49389,"prevInTime":49385,"nextInTime":49387,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"Hello all, I m new to this list, been reading and pondering for a few days.  But here Pam has touched on something I am struggling with: how to navigate the","messageBody":"<div id=\"ygrps-yiv-1583028101\">Hello all,<br/>\n<br/>\nI&#39;m new to this list, been reading and pondering for a few days.  But here Pam has touched on something I am struggling with: how to navigate the unschooling life when mom and dad have different parenting philosophies/styles.  We&#39;re into our second year of unschooling - kids are 7.5ds, 10.5ds, 12.5dd, 15ds (he just started this fall) and 18dd (has chosen to remain in school and will graduate in May).  Until now we&#39;ve really been just unschooling the academic side of life - taking the structure out of learning, letting the kids live their lives doing what they&#39;re interested in doing.  It&#39;s been going very well.  Dad is totally on board with this aspect of unschooling and has always been very interested in the kids, coming up with things for the family to do/see/explore, finding ways to spend time with our children.  He&#39;s an awesome dad in that respect.<br/>\n<br/>\nRecently I&#39;ve spent a lot of time reading more about unschooling and now feel very ready to move our family towards the fullness of it that I see people like Pam and Jenny and Sandra advocating.  The issue is, Dad has a very authoritarian style of parenting; he and I have always struggled for harmony in this area, but I can foresee that tension escalating into a huge problem if I try to push my unschooling agenda.  Both he and I were raised in extremely authoritarian homes - his worse than mine, I think.  To put it in terms of &quot;abundance&quot; of love, nurturing, compassion, etc.: he and I were both starved as children.  The result for me has been that in mothering our kids I&#39;ve struggled hugely with how to make sense of my impulses to nurture (go with the child) and my contrary impulses to detach (claim personal space) and to control, judge and correct (deeply ingrained).  It&#39;s been very painful for the kids and for me.  But I have found that unschooling philosophy frames my internal chaos in a way that makes sense of it, so that I can see the path forward with clarity, without the constant plague of doubt.  I feel myself &quot;coming home&quot; internally, opening to our children in a way that feels totally authentic and right, and filled with energy.<br/>\n<br/>\nI think unschooling resonates with me because I remember what it feels like to hurt as a child, to struggle for selfhood, and I&#39;ve been open to using that knowledge in my parenting.  My husband, though, has little to no memory of his pre-adolescent years (from what I can glean, &quot;paddling&quot; - ie. spankings with a paddle, - criticism and manipulation were on-going in his childhood) and he doesn&#39;t believe such memories are relevant to good parenting anyway.  He flat out doesn&#39;t believe in &quot;treating children as adults&quot; (which is how he understands unschooling philosophy); in his mind, setting rules and limits and disciplining IS the role of a parent - the moral obligation - at least if one wants their children to grow up to be good, productive people.  He does not regard feelings as being an important concern in parenting.  For him, life is all about doing the right thing regardless of one&#39;s feelings.  So while he and I both incline towards control-freakism and impatience, I&#39;m in a constant battle against those tendencies and he is less concerned with their effects, more likely to justify their indulgence.<br/>\n<br/>\nSo I guess I&#39;m writing to ask if any of you have ideas about how to proceed in this situation.  I hear Pam advising not to disregard the feelings and ideas of the less committed parent but to try to incorporate them.  I&#39;m struggling to understand how I do that in my situation.  My instincts tells me that if I shower my husband with the same abundance of love, compassion and patience that I want us to show our children, then maybe he&#39;ll begin to see the light and/or follow my lead with them, and so I&#39;ve started consciously trying to do that.  And to his credit, he always has been willing to read anything I ask him to, so I plan to give him some of Sandra&#39;s essays.  (She&#39;s the one of been reading, mostly)  She provides a very logical and balanced explanation of unschooling, which I hope might counteract the initial reading we did on the topic - some of that literature used the &quot;radical unschooling&quot; term and that totally turned off my husband to the ideas.<br/>\n<br/>\nThank you for any thoughts or ideas you can share about this.~Leah<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 1/1/2010 6:06 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tiffermom@...\">tiffermom@...</a> wrote:<br/>\n<br/>\n&gt; I think when we began on this path I felt like I had to do everything right. Now I know it is more about the relationships not the rules.<br/>\n<br/>\n&gt;<br/>\n<br/>\nYou are so right - relationships come first and foremost! And, maybe<br/>\n<br/>\nanother way to think of it is that it is about taking a fresh look at<br/>\n<br/>\nour own actions and asking ourselves very honest and straightforward<br/>\n<br/>\nquestions about why we&#39;re making the choices we&#39;re making. Unschooling<br/>\n<br/>\nmeans constantly questioning our choices in the light of our<br/>\n<br/>\nunderstanding about how people (including child-people) learn best.<br/>\n<br/>\n<br/>\n<br/>\nApplying that to bedtimes, conventional parenting says children need<br/>\n<br/>\nroutine and scheduling, so a regular bedtime is important. So, some of<br/>\n<br/>\nus question whether or not that is true.  Question it - not just toss it<br/>\n<br/>\nout because some unschoolers say THEY tossed it out. Not just toss it<br/>\n<br/>\nout because we&#39;re tossing out all conventional parenting ideas. When my<br/>\n<br/>\nchildren were little, I sometimes asked myself if they DID need more<br/>\n<br/>\nroutine and scheduling....should I have been imposing a regular bedtime?<br/>\n<br/>\nBut, when I looked straight on at my own actual real-life children, not<br/>\n<br/>\nsome hazy concept of children-in-general, it was apparent that what they<br/>\n<br/>\nneeded was flexibility. Sometimes they needed some help getting to sleep<br/>\n<br/>\nwhen they were sleepy. We&#39;d lower the lights, turn down the volume of<br/>\n<br/>\nthe tv, put on a movie they&#39;d already seen, maybe entice a very-tired<br/>\n<br/>\nchild into another room to cuddle up and read - sometimes make a &quot;cocoa<br/>\n<br/>\nparty&quot; - which meant I&#39;d bring out a tray with little cups of warm cocoa<br/>\n<br/>\nand some little cookies. The point was to help the children  learn to<br/>\n<br/>\nrecognize when they needed sleep and help them be able to go to sleep<br/>\n<br/>\nwhen sleepy.<br/>\n<br/>\n<br/>\n<br/>\nConventional parenting says parents need &quot;adult-time&quot; away from the<br/>\n<br/>\nchildren every evening. So, children are supposed to be put to bed at<br/>\n<br/>\nleast an hour or two before the parents bed time. So, we questioned<br/>\n<br/>\nwhether we really needed that hour or two of adult-only time every<br/>\n<br/>\nnight. Did it need to be then? Every night? Did the kids really have to<br/>\n<br/>\n&quot;go to bed&quot; for us to have that? What other options were there? Did it<br/>\n<br/>\nhave to be the same option every night? Instead of coming up with a<br/>\n<br/>\nrule, we played it by ear every single night. As the parent who spent<br/>\n<br/>\nmost of her waking moments with the kids, &quot;I&quot; did feel like I sometimes<br/>\n<br/>\nneeded some time when nobody was needing something from me. But that<br/>\n<br/>\n&quot;adult time&quot; in the evening wasn&#39;t really good quality time for that -<br/>\n<br/>\nbecause I was tired. There were better options. I learned to take little<br/>\n<br/>\ntiny mini-vacations. I learned to really appreciate a few minutes here<br/>\n<br/>\nand there when the kids were busily occupied - to recognize those<br/>\n<br/>\nminutes as my rejuvenation time. Changing my mindset on this made much<br/>\n<br/>\nmore difference than anything else. Instead of feeling desperate for<br/>\n<br/>\nsome time without the kids, I started paying attention and reveling in<br/>\n<br/>\nthe minutes throughout the day when I &quot;did&quot; have breaks. The end of the<br/>\n<br/>\nday came and I was much less exhausted and mentally drained.<br/>\n<br/>\n<br/>\n<br/>\nConventional parenting wisdom says that the mother and father need time<br/>\n<br/>\ntogether in the evenings, without the kids, to talk about their days and<br/>\n<br/>\nreconnect and, I suppose, talk about the kids and make decisions, etc.<br/>\n<br/>\nAgain, these are important, but is an hour or two at the end of every<br/>\n<br/>\nday really what is needed? Is that the best time for mom and dad to have<br/>\n<br/>\n&quot;quality time&quot; anyway - every night when both are tired?<br/>\n<br/>\n<br/>\n<br/>\nI think, sometimes, that bedtimes are for protecting dads from too much<br/>\n<br/>\ntime with their own children because the dads get impatient and cranky<br/>\n<br/>\nwith them - sounds sad, but I really do think it is true. Normal kid<br/>\n<br/>\nbehavior can seem demanding and annoying to someone who isn&#39;t really<br/>\n<br/>\ninto being with kids on their terms. If a parent thinks his own life<br/>\n<br/>\nshould be mostly unimpacted by having children - he should still get to<br/>\n<br/>\npretty much always do what he wants without regard to the children<br/>\n<br/>\n(watch what he wants on tv, have quiet when he wants it, listen to his<br/>\n<br/>\nown music, engage in his own hobbies or interests without any<br/>\n<br/>\ninterruptions) then the kids are going to often seem to be in the way.<br/>\n<br/>\nI&#39;ve heard moms say that it always seems like their husband is trying to<br/>\n<br/>\nfind ways to spend time without the kids.  (I&#39;m sure this is sometimes<br/>\n<br/>\nreversed - sometimes dads are more into the kids than the moms - but not<br/>\n<br/>\ncommonly.)<br/>\n<br/>\n<br/>\n<br/>\nIf people are in this kind of situation, where one parent really wants<br/>\n<br/>\nless time with the kids than the  other parent, it makes sense to me to<br/>\n<br/>\naccommodate that in various ways. I think some moms get into unschooling<br/>\n<br/>\nand they have this wishful-thinking sense of how they want their family<br/>\n<br/>\nto be, but the dad&#39;s real interests and needs and lesser level of<br/>\n<br/>\ncommitment to that lifestyle are disregarded. Instead of living in<br/>\n<br/>\nwishful-thinking land, it is better to live in reality. Setting up the<br/>\n<br/>\nhousehold in a way that gives a parent the opportunity to have space to<br/>\n<br/>\nthemselves can be super super helpful. There are lots of ways to<br/>\n<br/>\nconsider each person&#39;s interests/needs. Do what makes sense to enhance<br/>\n<br/>\nrelationships for your family, in your living circumstances.<br/>\n<br/>\n<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262452885","msgId":49376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCM0Y4MDk1LjcwNzAzQG1hYy5jb20+","inReplyToHeader":"PDM3ODQwODAyMi40ODIxNjIxMjYyMzk3OTg3MzM0LkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+","referencesHeader":"PDM3ODQwODAyMi40ODIxNjIxMjYyMzk3OTg3MzM0LkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+"},"prevInTopic":49369,"nextInTopic":49386,"prevInTime":49375,"nextInTime":49377,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"... You are so right - relationships come first and foremost! And, maybe another way to think of it is that it is about taking a fresh look at our own actions","messageBody":"<div id=\"ygrps-yiv-204269109\">On 1/1/2010 6:06 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tiffermom@...\">tiffermom@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think when we began on this path I felt like I had to do everything right. Now I know it is more about the relationships not the rules.<br/>\n&gt;    <br/>\n </span></blockquote>You are so right - relationships come first and foremost! And, maybe <br/>\nanother way to think of it is that it is about taking a fresh look at <br/>\nour own actions and asking ourselves very honest and straightforward <br/>\nquestions about why we&#39;re making the choices we&#39;re making. Unschooling <br/>\nmeans constantly questioning our choices in the light of our <br/>\nunderstanding about how people (including child-people) learn best.<br/>\n<br/>\nApplying that to bedtimes, conventional parenting says children need <br/>\nroutine and scheduling, so a regular bedtime is important. So, some of <br/>\nus question whether or not that is true.  Question it - not just toss it <br/>\nout because some unschoolers say THEY tossed it out. Not just toss it <br/>\nout because we&#39;re tossing out all conventional parenting ideas. When my <br/>\nchildren were little, I sometimes asked myself if they DID need more <br/>\nroutine and scheduling....should I have been imposing a regular bedtime? <br/>\nBut, when I looked straight on at my own actual real-life children, not <br/>\nsome hazy concept of children-in-general, it was apparent that what they <br/>\nneeded was flexibility. Sometimes they needed some help getting to sleep <br/>\nwhen they were sleepy. We&#39;d lower the lights, turn down the volume of <br/>\nthe tv, put on a movie they&#39;d already seen, maybe entice a very-tired <br/>\nchild into another room to cuddle up and read - sometimes make a &quot;cocoa <br/>\nparty&quot; - which meant I&#39;d bring out a tray with little cups of warm cocoa <br/>\nand some little cookies. The point was to help the children  learn to <br/>\nrecognize when they needed sleep and help them be able to go to sleep <br/>\nwhen sleepy.<br/>\n<br/>\nConventional parenting says parents need &quot;adult-time&quot; away from the <br/>\nchildren every evening. So, children are supposed to be put to bed at <br/>\nleast an hour or two before the parents bed time. So, we questioned <br/>\nwhether we really needed that hour or two of adult-only time every <br/>\nnight. Did it need to be then? Every night? Did the kids really have to <br/>\n&quot;go to bed&quot; for us to have that? What other options were there? Did it <br/>\nhave to be the same option every night? Instead of coming up with a <br/>\nrule, we played it by ear every single night. As the parent who spent <br/>\nmost of her waking moments with the kids, &quot;I&quot; did feel like I sometimes <br/>\nneeded some time when nobody was needing something from me. But that <br/>\n&quot;adult time&quot; in the evening wasn&#39;t really good quality time for that - <br/>\nbecause I was tired. There were better options. I learned to take little <br/>\ntiny mini-vacations. I learned to really appreciate a few minutes here <br/>\nand there when the kids were busily occupied - to recognize those <br/>\nminutes as my rejuvenation time. Changing my mindset on this made much <br/>\nmore difference than anything else. Instead of feeling desperate for <br/>\nsome time without the kids, I started paying attention and reveling in <br/>\nthe minutes throughout the day when I &quot;did&quot; have breaks. The end of the <br/>\nday came and I was much less exhausted and mentally drained.<br/>\n<br/>\nConventional parenting wisdom says that the mother and father need time <br/>\ntogether in the evenings, without the kids, to talk about their days and <br/>\nreconnect and, I suppose, talk about the kids and make decisions, etc. <br/>\nAgain, these are important, but is an hour or two at the end of every <br/>\nday really what is needed? Is that the best time for mom and dad to have <br/>\n&quot;quality time&quot; anyway - every night when both are tired?<br/>\n<br/>\nI think, sometimes, that bedtimes are for protecting dads from too much <br/>\ntime with their own children because the dads get impatient and cranky <br/>\nwith them - sounds sad, but I really do think it is true. Normal kid <br/>\nbehavior can seem demanding and annoying to someone who isn&#39;t really <br/>\ninto being with kids on their terms. If a parent thinks his own life <br/>\nshould be mostly unimpacted by having children - he should still get to <br/>\npretty much always do what he wants without regard to the children <br/>\n(watch what he wants on tv, have quiet when he wants it, listen to his <br/>\nown music, engage in his own hobbies or interests without any <br/>\ninterruptions) then the kids are going to often seem to be in the way.  <br/>\nI&#39;ve heard moms say that it always seems like their husband is trying to <br/>\nfind ways to spend time without the kids.  (I&#39;m sure this is sometimes <br/>\nreversed - sometimes dads are more into the kids than the moms - but not <br/>\ncommonly.)<br/>\n<br/>\nIf people are in this kind of situation, where one parent really wants <br/>\nless time with the kids than the  other parent, it makes sense to me to <br/>\naccommodate that in various ways. I think some moms get into unschooling <br/>\nand they have this wishful-thinking sense of how they want their family <br/>\nto be, but the dad&#39;s real interests and needs and lesser level of <br/>\ncommitment to that lifestyle are disregarded. Instead of living in <br/>\nwishful-thinking land, it is better to live in reality. Setting up the <br/>\nhousehold in a way that gives a parent the opportunity to have space to <br/>\nthemselves can be super super helpful. There are lots of ways to <br/>\nconsider each person&#39;s interests/needs. Do what makes sense to enhance <br/>\nrelationships for your family, in your living circumstances.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262411602","msgId":49367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyOTQzOUFFLThGMzEtNEQzQy04QTFGLTBCMDQzRDI0RDVDREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDBBQzNDM0RCNDIwNzREMjg4MkIzNkE5NzI1QjY3REZEQExZTEFMQVAyPg==","referencesHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPiA8NTc5NDUuMTEyNDIucW1Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPiA8MEFDM0MzREI0MjA3NEQyODgyQjM2QTk3MjVCNjdERkRATFlMQUxBUDI+"},"prevInTopic":49366,"nextInTopic":49369,"prevInTime":49366,"nextInTime":49368,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262411590","msgId":49366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCRjJGRTU2LTU5REMtNDYzOS1BMjU4LTdDQ0YyMjA4REIwMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU3OTQ1LjExMjQyLnFtQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPiA8NTc5NDUuMTEyNDIucW1Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":49365,"nextInTopic":49367,"prevInTime":49365,"nextInTime":49367,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"","specialLinks":[]},{"userId":39016202,"authorName":"tealzabet","from":"&quot;tealzabet&quot; &lt;Tealzabet@...&gt;","profile":"tealzabet","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: navigating the unschooling ocean : )","postDate":"1262410698","msgId":49369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhobW00YStjY3N0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDczMDcyODE3LTI4N0QtNDkwQS1CMjc1LTZCN0I3OEI3MTg1MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49367,"nextInTopic":49376,"prevInTime":49368,"nextInTime":49370,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"5 years ago a lifelearner/unschooler parent I know looked at me very seriously and said, Lizzie, unschooling does not mean unparenting -- it means honest","messageBody":"<div id=\"ygrps-yiv-1529746578\">5 years ago a lifelearner/unschooler parent I know looked at me very seriously and said, Lizzie, unschooling does not mean unparenting -- it means honest parenting.  (she is my mum) and I try to live up to that.<br/>\n<br/>\nI do not believe any lies are age appropriate ---- If you are tired and need quiet time be honest, so that they can be honest also  (this does not mean full detailed explanations at every chance either!!) ......when I was 10 we had a lights out at 10  -  no one had to go to sleep -- and some times quiet talk did go on into the night --but so did snores ;)<br/>\n<br/>\nI&#39;m still learning my compass! Like if you have information that can help someone who is feeling injured or hurt -- how to make yourself available to give it without overstepping and still honoring their growth ---or being gossippy ----  so I am listening to them and anyone with similar situations....thanks.<br/>\n<br/>\nBest!,,<br/>\nLiz T.</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262403266","msgId":49365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4ODc3NS40Mjc4OS5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDBBQzNDM0RCNDIwNzREMjg4MkIzNkE5NzI1QjY3REZEQExZTEFMQVAyPg==","referencesHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPiA8NTc5NDUuMTEyNDIucW1Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPiA8MEFDM0MzREI0MjA3NEQyODgyQjM2QTk3MjVCNjdERkRATFlMQUxBUDI+"},"prevInTopic":49364,"nextInTopic":49366,"prevInTime":49364,"nextInTime":49366,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"I see. But has the situation at home changed? If yes change can bring a  lot of stress or at least take some time for people to adapt. If the daughter was","messageBody":"<div id=\"ygrps-yiv-266565677\">I see. But has the situation at home changed?<br/>\nIf yes change can bring a  lot of stress or at least take some time <br/>\nfor people to adapt.<br/>\nIf the daughter was not used to sharing mom&#39;s attention at home that could bring a lot if insecurites to a young child.<br/>\nWe need to be aware how big changes , or even small, can affect our children&#39;s lives.<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262400309","msgId":49364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBBQzNDM0RCNDIwNzREMjg4MkIzNkE5NzI1QjY3REZEQExZTEFMQVAyPg==","inReplyToHeader":"PDU3OTQ1LjExMjQyLnFtQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPiA8NTc5NDUuMTEyNDIucW1Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":49363,"nextInTopic":49365,"prevInTime":49363,"nextInTime":49365,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"i was assuming by papa she meant grandpa... ... From: BRIAN POLIKOWSKY To: AlwaysLearning@yahoogroups.com Sent: Friday, January 01, 2010 6:38 PM Subject: Re:","messageBody":"<div id=\"ygrps-yiv-598537142\">i was assuming by papa she meant grandpa...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: BRIAN POLIKOWSKY <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Friday, January 01, 2010 6:38 PM<br/>\n  Subject: Re: [AlwaysLearning] navigating the unschooling ocean : )<br/>\n<br/>\n<br/>\n    <br/>\n  So the children&#39;s father passed away recently and you have a new relationship ?<br/>\n  Could that be related to your daughter&#39;s having more meldowns?<br/>\n  Sounds like your living situation just changed or have you been living with your fiance long?<br/>\n   <br/>\n  Alex Polikowsky<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262399901","msgId":49363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3OTQ1LjExMjQyLnFtQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPg=="},"prevInTopic":49362,"nextInTopic":49364,"prevInTime":49362,"nextInTime":49364,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"So the children s father passed away recently and you have a new relationship ? Could that be related to your daughter s having more meldowns? Sounds like your","messageBody":"<div id=\"ygrps-yiv-2057268508\">So the children&#39;s father passed away recently and you have a new relationship ?<br/>\nCould that be related to your daughter&#39;s having more meldowns?<br/>\nSounds like your living situation just changed or have you been living with your fiance long?<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":352545834,"authorName":"tiffermom@comcast.net","from":"tiffermom@...","profile":"tiffermomof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262397987","msgId":49362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3ODQwODAyMi40ODIxNjIxMjYyMzk3OTg3MzM0LkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+","inReplyToHeader":"PDczMDcyODE3LTI4N0QtNDkwQS1CMjc1LTZCN0I3OEI3MTg1MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49359,"nextInTopic":49363,"prevInTime":49361,"nextInTime":49363,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"Sandra, Thank you very much for this. I have 5 kids and when I came across unschooling 1 1/2 years ago I thought I had to toss out our 8:00 bedtime. The kids","messageBody":"<div id=\"ygrps-yiv-97068407\">Sandra, <br/>\n<br/>\nThank you very much for this. I have 5 kids and when I came across unschooling 1 1/2 years ago I thought I had to toss out our 8:00 bedtime. The kids had always gone to bed at 8. Then when I let that structure go it was total chaos. I decided we were not ready for such a radical change. I really need some down time before I go to bed. So we modified things over time slowly and naturally. Life is so much better without the strict bedtime and it is nice that Hubby and I get some down time at night, even if it is not at exactly the same each night. <br/>\n<br/>\nI think when we began on this path I felt like I had to do everything right. Now I know it is more about the relationships not the rules. <br/>\n<br/>\nTiffani <br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Sandra Dodd&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, January 1, 2010 5:56:21 PM GMT -08:00 US/Canada Pacific <br/>\nSubject: Re: [AlwaysLearning] navigating the unschooling ocean : ) <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-=- Right now our strategy for this is that on &quot;regular&quot; nights (no <br/>\nsleepovers, special occasions, etc.) 10 pm is quiet room time. This is <br/>\nnot strict or forced, but is strongly suggested as we live in a small <br/>\napartment and Dh and I need time alone and to unwind. Overall it is <br/>\nworking okay but it doesn&#39;t feel completely right. Any suggestions?-=- <br/>\n<br/>\nI don&#39;t think quiet room time is a problem at all, especially if <br/>\nyou&#39;re in an apartment. The neighbors have the right to quiet after <br/>\nthen, and there might be laws and all. <br/>\n<br/>\nI know there are people who think it&#39;s &quot;against the unschooling rules&quot; <br/>\nto have a bedtime. I think I know what started it years ago, and it <br/>\nwas people asking me how I enforced bedtimes and I said we didn&#39;t have <br/>\na bedtime, and that was true. But we never had. We didn&#39;t change in <br/>\nmid stream to something different. And when we did say &quot;go to bed&quot; it <br/>\nwas for a real reason. So what we didn&#39;t have was an arbitrary, <br/>\nregular, routine bedtime. Each night was its own case, and that was <br/>\nbefore we were even thinking about unschooling. If the kids were up <br/>\nlate it was because they were out doing something with us, or we had <br/>\npeople over, or we were all doing something interesting, or Keith had <br/>\ngone to sleep and I stayed up to do something with the kids. <br/>\n<br/>\nWhat some new unschooling families seem to do is the parents still go <br/>\nto bed but the kids are told &quot;there&#39;s no bedtime because we&#39;re <br/>\nunschoolers,&quot; and that doesn&#39;t create a happy situation for the entire <br/>\nfamily. <br/>\n<br/>\nI think 10 PM as quiet time is completely fine. <br/>\n<br/>\nSandra <br/>\n<br/>\n[Non-text portions of this message have been removed] <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] navigating the unschooling ocean : )","postDate":"1262397381","msgId":49359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczMDcyODE3LTI4N0QtNDkwQS1CMjc1LTZCN0I3OEI3MTg1MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPg=="},"prevInTopic":49355,"nextInTopic":49362,"prevInTime":49358,"nextInTime":49360,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"-=- Right now our strategy for this is that on regular nights (no sleepovers, special occasions, etc.) 10 pm is quiet room time. This is not strict or","messageBody":"<div id=\"ygrps-yiv-2080811723\">-=- Right now our strategy for this is that on &quot;regular&quot; nights (no  <br/>\nsleepovers, special occasions, etc.) 10 pm is quiet room time. This is  <br/>\nnot strict or forced, but is strongly suggested as we live in a small  <br/>\napartment and Dh and I need time alone and to unwind. Overall it is  <br/>\nworking okay but it doesn&#39;t feel completely right. Any suggestions?-=-<br/>\n<br/>\nI don&#39;t think quiet room time is a problem at all, especially if  <br/>\nyou&#39;re in an apartment.  The neighbors have the right to quiet after  <br/>\nthen, and there might be laws and all.<br/>\n<br/>\nI know there are people who think it&#39;s &quot;against the unschooling rules&quot;  <br/>\nto have a bedtime.  I think I know what started it years ago, and it  <br/>\nwas people asking me how I enforced bedtimes and I said we didn&#39;t have  <br/>\na bedtime, and that was true.   But we never had.  We didn&#39;t change in  <br/>\nmid stream to something different.  And when we did say &quot;go to bed&quot; it  <br/>\nwas for a real reason.  So what we didn&#39;t have was an arbitrary,  <br/>\nregular, routine bedtime.  Each night was its own case, and that was  <br/>\nbefore we were even thinking about unschooling.   If the kids were up  <br/>\nlate it was because they were out doing something with us, or we had  <br/>\npeople over, or we were all doing something interesting, or Keith had  <br/>\ngone to sleep and I stayed up to do something with the kids.<br/>\n<br/>\nWhat some new unschooling families seem to do is the parents still go  <br/>\nto bed but the kids are told &quot;there&#39;s no bedtime because we&#39;re  <br/>\nunschoolers,&quot; and that doesn&#39;t create a happy situation for the entire  <br/>\nfamily.<br/>\n<br/>\nI think 10 PM as quiet time is completely fine.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326490917,"authorName":"mamanandi","from":"&quot;mamanandi&quot; &lt;mamanandi@...&gt;","profile":"mamanandi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"navigating the unschooling ocean : )","postDate":"1262375402","msgId":49355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhobGpsYSs3OHR0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49359,"prevInTime":49354,"nextInTime":49356,"topicId":49355,"numMessagesInTopic":0,"msgSnippet":"This is my first post after lurking for a while.  I really respect the ideas and wisdom that is offered on this list and was hoping for some input on","messageBody":"<div id=\"ygrps-yiv-1126465761\">This is my first post after lurking for a while.  I really respect the ideas and wisdom that is offered on this list and was hoping for some input on strategies for our family.  Overall we are doing well.  There are a few points on which we are struggling and would like to be doing better-as far as integrating respect for our childrens&#39; explorations   <br/>\n<br/>\nOne revolves around bedtime.  My children (6 and 9) are wanting to stay up to 1 am (on average).  While I know that this may come and go, it is difficult for me and my partner, who many nights are definitely not getting to bed when we feel we need to. Right now our strategy for this is that on &quot;regular&quot; nights (no sleepovers, special occasions, etc.) 10 pm is quiet room time.  This is not strict or forced, but is strongly suggested as we live in a small apartment and Dh and I need time alone and to unwind.  Overall it is working okay but it doesn&#39;t feel completely right.  Any suggestions?<br/>\n<br/>\nAnother is with DD&#39;s attitude.  I love her more than anything in the world and she is a very sweet girl, but has always felt easily frustrated.  I know that she feels a lot of pain inside from the passing of her papa (and recently, her beloved grandmother), but lately she has been freaking out over almost everything that doesn&#39;t go her way.  I try to set her up for success as much as possible, but ends up in a meltdown at least 3-4 times/day.  Right now i try as much as possible to be loving and give her space if she need it or embrace and positive words if she can handle them, but I want to do better for her.  DH (actually fiance) is struggling even more than me because he is new to the parenting thing and had strict parents that he rebelled against.  He wants to be a good parent but struggles with thinking that means control or &quot;being respected&quot;.  I try to remind him to love her and be there for her and build trust with her. <br/>\n??????<br/>\n<br/>\nHope everyone is having happy holidays.  Namaste, Nandi</div>","specialLinks":[]}],"prevTopicId":49433,"nextTopicId":10480}}