{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":58,"messages":[{"userId":97705702,"authorName":"Honor","from":"&quot;Honor&quot; &lt;like_fire_and_moonlight@...&gt;","profile":"like_fire_and_moonlight","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Leaving &quot;home&quot; at 18","postDate":"1132843515","msgId":110170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtNGpscitjaDRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJGQTlFNzUwLkQzQjIlYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4="},"prevInTopic":110160,"nextInTopic":110181,"prevInTime":110169,"nextInTime":110171,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... out at age ... military or ... My sister and I struggled for years to catch up because of this attitude that at 18 YOU ARE AN ADULT . My sister was","messageBody":"<div id=\"ygrps-yiv-690544894\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Barb Lundgren <br/>\n&lt;barb.lundgren@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Frankly, from what I have seen, 99% of kids are basically kicked <br/>\n </span></blockquote>out at age<br/>\n<blockquote><span title=\"ireply\"> &gt; 18 by being given one of three options:  go to college, join the <br/>\n </span></blockquote>military or<br/>\n<blockquote><span title=\"ireply\"> &gt; get a job and an apartment.  The kids know this too, <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>My sister and I struggled for years to &quot;catch up&quot; because of this <br/>\nattitude that at 18 &quot;YOU ARE AN ADULT&quot;. My sister was abused and <br/>\nneglected, I was just a late bloomer. She has finally stabilized her <br/>\nlife, and is happily married, after years of floating, moving and <br/>\nmany, many jobs. I don&#39;t think I was ready for &quot;ADULT&quot; life untill a <br/>\nfew years ago (I&#39;m 30 now); right out of high school, I went to <br/>\ncollege, and then got married. I was well educated and intelligent, <br/>\nbut I really had no common sense or maturity. The biggest problem I <br/>\nhad/have is no one will help some one that they think should &quot;know <br/>\nall of this by now&quot; or is &quot;just a loser&quot;. So then, when I figure it <br/>\nout by myself, I want to turn and be angry with them. I just wish I <br/>\nhad a mentor now. This is hard on my kids too!</div>","specialLinks":[]},{"userId":235318765,"authorName":"janddplus5","from":"&quot;janddplus5&quot; &lt;janddplus5@...&gt;","profile":"janddplus5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: OT: Missing Homeschooled Teenager","postDate":"1132764534","msgId":110160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtMjZobitzZzViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI2NC43MDAyYzYuMzBiNWVlMWFAYW9sLmNvbT4="},"prevInTopic":110159,"nextInTopic":110170,"prevInTime":110159,"nextInTime":110161,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... have one. ... This isn t ... babies and ... living our lives ... ***  I agree, what I meant to clarify was that between two specific avenues set before me","messageBody":"<div id=\"ygrps-yiv-356108161\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; In a message dated 11/23/05 8:34:36 AM, janddplus5@b... writes:<br/>\n&gt; -=- Now my dream is to make as many of my<br/>\n&gt; children&#39;s dreams come true as I can.-=-<br/>\n&gt; <br/>\n&gt; That&#39;s beautiful, but...<br/>\n&gt; <br/>\n&gt; &gt; -=-Mostly my children know what choices I have made to<br/>\n&gt; &gt; give my life to them. -=-<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; ... that wording implies that you&#39;ve lost your life and no longer <br/>\n </span></blockquote>have one.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; -=- It is not giving something up from my<br/>\n&gt; perspective it is just making a better choice of what to do with my<br/>\n&gt; life. -=-<br/>\n&gt; <br/>\n&gt; Those two lines, right next to each other, seem contradictory.    <br/>\n </span></blockquote>This isn&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; something parents have much time to really contemplate, because <br/>\n </span></blockquote>babies and <br/>\n<blockquote><span title=\"ireply\"> &gt; toddlers overwhelm us, but to keep the perspective that we ARE <br/>\n </span></blockquote>living our lives <br/>\n<blockquote><span title=\"ireply\"> &gt; is good.<br/>\n<br/>\n </span></blockquote>***  I agree, what I meant to clarify was that between two specific <br/>\navenues set before me (by me), one being a career and the other to <br/>\nstay home and live with my kids and spend my life being with them, I <br/>\npicked to stay home.  Not because I felt obligated because at 21 <br/>\nyears old I didn&#39;t &quot;feel&quot; obligated.  But I found that I really <br/>\nliked my kids on top of loving them.  I liked being with them and <br/>\nwatching them grow.  I liked to play with them. I liked it so much <br/>\nthat I had 5 (never really thought I liked kids that much &lt;g&gt;) <br/>\n<br/>\nI had an option that some may not have the luxury of to choose not <br/>\nto work and made what I feel is the better choice.  I knew I <br/>\ncouldn&#39;t give 100% to being a parent if I wasn&#39;t there to do it. I <br/>\nlove my life and can&#39;t even begin to imagine all I would have missed <br/>\nwith my kids if I had chosen the career. That list would be <br/>\nendless...<br/>\n<br/>\nI left the newly started career and never looked back.  It has been <br/>\n11 and a half years and what a fun ride it has been.  I look forward <br/>\nto having teenagers that are happy and confident and free to think <br/>\nand be who they want to be.  <br/>\n<br/>\nMy life is more wonderful than I ever knew life could be, even with <br/>\nmy health issues, I never imagined it could be like this. I <br/>\ncertainly didn&#39;t grow up this way.  My children have shown me how <br/>\nhappy I can be by showing me how to be free from some ridiculous <br/>\nexpectations that someone else feels the need to impose on me.<br/>\n<br/>\nAs I sit and type this my 6 yr old is sitting on the arm of the <br/>\nchair singing &quot;sweet, sweet Mooommmyyy, sweet, sweet mooommmyyy to <br/>\nthe the tune of Sweet Sweet Nightengale from Cinderella.  My life is <br/>\nso wonderful.<br/>\n <br/>\nDana</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] OT: Missing Homeschooled Teenager","postDate":"1132763752","msgId":110159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4Ni4xM2M4YWEuMzBiNWY0NjhAYW9sLmNvbT4="},"prevInTopic":110158,"nextInTopic":110160,"prevInTime":110158,"nextInTime":110160,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... He told people where he was going.   He wasn t kidnapped.    I m going to assume that he chose to leave on his own terms, as thousands of kids do every ","messageBody":"<div id=\"ygrps-yiv-1882011165\">In a message dated 11/23/05 9:14:43 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-The dad in this runaway<br/>\n&gt; family may have been giving his son the same message but because the son<br/>\n&gt; chose to leave on his own terms (if he did and we don&#39;t know he did),-=-<br/>\n&gt; <br/>\n </span></blockquote>He told people where he was going.   He wasn&#39;t kidnapped.    I&#39;m going to <br/>\nassume that he chose to leave on his own terms, as thousands of kids do every <br/>\nyear.<br/>\n<br/>\n-=- The fact that he doesn&#39;t know where he is or what condition he is<br/>\nin would concern any parent obviously.-=-<br/>\n<br/>\nThe concerns of any parents aren&#39;t the topic of this list.<br/>\nThe boy probably knows where he is, and it&#39;s the boy&#39;s life I&#39;m more <br/>\nconcerned with.   His parents knew about unschooling, I presume, and decided it wasn&#39;t <br/>\nwhat they wanted.   There&#39;s where the topic touches this list.<br/>\n<br/>\n-=-It would be interesting to see what happens to the boy if and when he is <br/>\nfound.-=-<br/>\n<br/>\nWe all know stories of runaways being found, don&#39;t we?   The details of a <br/>\nlife of someone not on this list aren&#39;t the business of this list.<br/>\n<br/>\n-=-Any person&#39;s greatest mistake is thinking they have control over anyone <br/>\nbut<br/>\nthemselves.  Parents most commonly fall victim to this way of thinking,-=-<br/>\n<br/>\nControl over decisions and thoughts we don&#39;t have, but control over affecting <br/>\nthe environment of others we absolutely DO have.    <br/>\n<br/>\nI have three children all still in bed.   The house was cold, so I turned up <br/>\nthe heat and lit the oven to make cake.   They will awaken to warmth and a <br/>\ngood smell.   <br/>\n<br/>\nI *could* (legally, and it is within my power) turn music on really loud, and <br/>\nslam doors and run the vacuum cleaner and bitch at them about being lazy when <br/>\nthey do wake up.   I am choosing not to do that.    That is within my <br/>\ncontrol.<br/>\n<br/>\nWhat my kids will think about me is not in my control, but it is within my <br/>\nsphere of influence.   I make choices every moment of my life, and those choices <br/>\nmatter.<br/>\n<br/>\n-=-It&#39;s good we can find support for<br/>\nalternative ways of parenting among our unschool support networks.<br/>\n-=-<br/>\n<br/>\nThis list isn&#39;t a support group.<br/>\n<br/>\nOne thing a person needs to feel supported is information and ideas, and this <br/>\nlist does try to help people have ideas they need to change their thinking so <br/>\nthat unschooling can thrive, but this list isn&#39;t intended to be the be-all, <br/>\nend-all for any unschooling family&#39;s life.   We&#39;re not going to call to remind <br/>\npeople of dentist&#39;s appointments or bring casseroles if someone&#39;s injured.   <br/>\nIt&#39;s an international all-spread-out list for the discussion of unschooling.    <br/>\nThat&#39;s a lot already, and we don&#39;t need to feel bad about what we&#39;re NOT <br/>\nproviding people.   No sense going to the sporting goods store and complaining <br/>\nthat you really needed eggnog and some earrings.<br/>\n<br/>\nThere are lists for discussing missing persons, right? <br/>\n<br/>\n-=- Frankly, from what I have seen, 99% of kids are basically kicked out at <br/>\nage<br/>\n18 by being given one of three options:  go to college, join the military or<br/>\nget a job and an apartment. -=-<br/>\n<br/>\nWe&#39;ve all lived in the same world, and many of those on this list are trying <br/>\nto live differently.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132762138","msgId":110156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2NC43MDAyYzYuMzBiNWVlMWFAYW9sLmNvbT4="},"prevInTopic":110154,"nextInTopic":110158,"prevInTime":110155,"nextInTime":110157,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/23/05 8:34:36 AM, janddplus5@bellsouth.net writes: -=- Now my dream is to make as many of my children s dreams come true as I can.-=- ","messageBody":"<div id=\"ygrps-yiv-868299428\">In a message dated 11/23/05 8:34:36 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:janddplus5@...\">janddplus5@...</a> writes:<br/>\n-=- Now my dream is to make as many of my<br/>\nchildren&#39;s dreams come true as I can.-=-<br/>\n<br/>\nThat&#39;s beautiful, but...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Mostly my children know what choices I have made to<br/>\n&gt; give my life to them. -=-<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>... that wording implies that you&#39;ve lost your life and no longer have one.<br/>\n<br/>\n<br/>\n-=- It is not giving something up from my<br/>\nperspective it is just making a better choice of what to do with my<br/>\nlife. -=-<br/>\n<br/>\nThose two lines, right next to each other, seem contradictory.    This isn&#39;t <br/>\nsomething parents have much time to really contemplate, because babies and <br/>\ntoddlers overwhelm us, but to keep the perspective that we ARE living our lives <br/>\nis good.<br/>\n<br/>\nWhen I get frustrated when having to do things for my kids sometimes, maybe <br/>\nlaundry or taking care of one who&#39;s sick or has had dental surgery (liquid diet <br/>\nand painkillers for three days or so after Kirby&#39;s wisdom teeth came out), I <br/>\ngive myself an internally stern reminder to STOP IT.   Every one of my <br/>\nchildren is strong and whole.   I have no wheelchair bound child.   I have children <br/>\nwho can see, hear, and speak.   I have no child whose ass I have to wipe as a <br/>\nteenager; many parents do and I&#39;m grateful and happy that mine will likely move <br/>\nout of our house by choice, carry their own boxes, and not have to have <br/>\ngovernment subsidized health attendants to do it.    <br/>\n<br/>\nIt&#39;s not off topic for me and myself, in my mind.   My role as a mother <br/>\nhasn&#39;t been all that hard.   I could have made it more difficult by making a bunch <br/>\nof rules my kids would have failed to follow, and by setting a hurdles of my <br/>\nown creation that they might have failed to jump.<br/>\n<br/>\n-=-My kids know what I &quot;gave up&quot; if we have to say it that way-=-<br/>\n<br/>\nWe don&#39;t have to say it that way. &lt;g&gt;<br/>\nIf we choose how to think and choose our words, we don&#39;t &quot;have to&quot; do <br/>\nanything.<br/>\n<br/>\nI could leave my family today, but I&#39;m choosing to stay.   I don&#39;t &quot;have to&quot; <br/>\nbe here.   I WANT to be here.<br/>\n<br/>\n-=- I was a runaway teen at 16 and NEVER went back.  I have<br/>\nnever lived at home again and I just turned 33 two weeks ago.-=-<br/>\n-=-<br/>\n&quot;I&quot; didn&#39;t want anyone turning me in.  If I had I wouldn&#39;t have<br/>\nlooked for an escape route.  My mother was smart though and began to<br/>\ntry and work on our relationship.  She didn&#39;t force me to come home<br/>\nwhen she found me.  She flew to where I was and talked with me and<br/>\nleft me there and told me she would always be there if I wanted to<br/>\ncome home.-=-<br/>\n<br/>\nThat is very cool.   That&#39;s one of the best outcome stories I&#39;ve ever seen.<br/>\n<br/>\nKeith says one friend of his who ran away had a better life when he got back <br/>\nin that his parents gave him the privacy of his room, and less grief about <br/>\ngoing out with friends, but they also immediately formed his &quot;exit plan&quot; so that <br/>\nhe was scheduled to be OUT when he turned eighteen.   They gave him a <br/>\nkind-of-nicer last couple of years in their home before they booted him.    Not as <br/>\nnice as your mom&#39;s response.<br/>\n<br/>\nMy mom was nicer to me after I was grown, and for a few years she stopped <br/>\ndrinking and we hung out more (before she started again because she said simply <br/>\nthat drinking was more fun than being sober).   She apologized for some things <br/>\nshe had done, and she was supportive of my parenting, but I accepted it pretty <br/>\nneutrally.   It didn&#39;t change my childhood for her to change her mind years <br/>\nlater.   It was &quot;nice&quot; (wanly nice, better than nothing) but not thrilling or <br/>\nlifechanging.   It was easy for her, after she was living alone, to claim she <br/>\nwished she had done better.   It was a &quot;whatever&quot; situation for me, though.   <br/>\nShe generally chose not to do better when it mattered and when she had the <br/>\nchance.<br/>\n<br/>\nWe all have the chance to learn from others&#39; mistakes (and our own) and make <br/>\nbetter choices today, and tomorrow.   That&#39;s why this list exists and has <br/>\nsurvived, because it has helped and is helping real children&#39;s lives be better <br/>\nnow.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235318765,"authorName":"janddplus5","from":"&quot;janddplus5&quot; &lt;janddplus5@...&gt;","profile":"janddplus5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: OT: Missing Homeschooled Teenager","postDate":"1132759967","msgId":110154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtMjIyditqdXRzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRtMXVscCtvZTQ2QGVHcm91cHMuY29tPg=="},"prevInTopic":110153,"nextInTopic":110156,"prevInTime":110153,"nextInTime":110155,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"I don t think we ever need to tell our children all we have given up for them.  Mostly my children know what choices I have made to give my life to them.  It","messageBody":"<div id=\"ygrps-yiv-482360067\">I don&#39;t think we ever need to tell our children &quot;all&quot; we have given <br/>\nup for them.  Mostly my children know what choices I have made to <br/>\ngive my life to them.  It is not giving something up from my <br/>\nperspective it is just making a better choice of what to do with my <br/>\nlife.  <br/>\n<br/>\nThere is a line in the movie Cheaper By the Dozen where Steve Martin <br/>\nquits his new job that is taking so much time from his family and <br/>\nhis boss asks &quot;Are you giving up the dream?&quot; and he replies &quot;No, <br/>\njust going with a different one!&quot;.<br/>\n<br/>\nThat is how I feel about my life.  I had many ideas about my life <br/>\nbefore I had children.  Now my dream is to make as many of my <br/>\nchildren&#39;s dreams come true as I can.  I don&#39;t deny myself <br/>\neverything either but I do make choices in how I spend the time in <br/>\nmy life.  If I wanted it to be all about me then I should have <br/>\nremained childless. <br/>\n<br/>\nMy kids know what I &quot;gave up&quot; if we have to say it that way, because <br/>\nthey ask &quot;Mommy what did you used to do before you had kids?  Did <br/>\nyou like it? Will you ever do it again?  What will you do when we <br/>\ngrow up?&quot;  And so forth.  I chose to have 5 wonderful children and <br/>\nmy children, I hope, will always feel that I have no regrets in they <br/>\nway I chose to spend my life staying home and raising them.<br/>\n<br/>\nMy kids have one childhood and I intend to make it magical as much <br/>\nas I can.  I missed out on childhood and realized it after I was an <br/>\nadult.  I was a runaway teen at 16 and NEVER went back.  I have <br/>\nnever lived at home again and I just turned 33 two weeks ago. <br/>\n<br/>\n&quot;I&quot; didn&#39;t want anyone turning me in.  If I had I wouldn&#39;t have <br/>\nlooked for an escape route.  My mother was smart though and began to <br/>\ntry and work on our relationship.  She didn&#39;t force me to come home <br/>\nwhen she found me.  She flew to where I was and talked with me and <br/>\nleft me there and told me she would always be there if I wanted to <br/>\ncome home.  When I came back to town I had my own apartment and a <br/>\njob!  She supported me in those choices because she realized her <br/>\nmistakes and loved me so much that she wasn&#39;t willing to lose me or <br/>\nmy love.  I love her for it to this day.  <br/>\n<br/>\nThis pretty much alienated her from my family, but my relationship <br/>\nwith her was better for it and we were closer than ever and remained <br/>\nthat way until she died at 44 years old.  I am grateful for the time <br/>\nthat I had in the relationship with her in the years that followed.  <br/>\nIt didn&#39;t make up for or I should say take away the years of <br/>\npressure and disappointment in me, but it did enable me to have a <br/>\ncloser relationship with her than I had ever had and learn from her <br/>\ndecision to respect me.  It taught me alot in how I parent my <br/>\nchildren and how I treat my friends for that matter.<br/>\n<br/>\nI hope that things will work out with this family, but I know that <br/>\nfor me it wouldn&#39;t have if my mother had chased me down and made me <br/>\nfeel guilty over all she had given up for an ungrateful child like <br/>\nme.  Some relatives reacted just like this and to this day the <br/>\nrelationships are strained at best if there is even a relationship <br/>\nat all.  Being a military family we always look for orders as far <br/>\naway as possible because I feel strangled by family and always <br/>\ndisapproved of even to this day.  We just put in for Hawaii, nope no <br/>\nfamily there! It&#39;s sad but I really hope we get those orders.<br/>\n<br/>\nDana</div>","specialLinks":[]},{"userId":153458693,"authorName":"Barb Lundgren","from":"Barb Lundgren &lt;barb.lundgren@...&gt;","profile":"barb_lundgren","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"OT: Missing Homeschooled Teenager","postDate":"1132759857","msgId":110158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGQTlFNzUwLkQzQjIlYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGRtMXVscCtvZTQ2QGVHcm91cHMuY29tPg=="},"prevInTopic":110156,"nextInTopic":110159,"prevInTime":110157,"nextInTime":110159,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"Frankly, from what I have seen, 99% of kids are basically kicked out at age 18 by being given one of three options:  go to college, join the military or get a","messageBody":"<div id=\"ygrps-yiv-1943039672\">Frankly, from what I have seen, 99% of kids are basically kicked out at age<br/>\n18 by being given one of three options:  go to college, join the military or<br/>\nget a job and an apartment.  The kids know this too, ahead of time, and get<br/>\nto stress out over it for years before it happens.  The dad in this runaway<br/>\nfamily may have been giving his son the same message but because the son<br/>\nchose to leave on his own terms (if he did and we don&#39;t know he did), he is<br/>\nfreaked.  The fact that he doesn&#39;t know where he is or what condition he is<br/>\nin would concern any parent obviously.  It would be interesting to see what<br/>\nhappens to the boy if and when he is found.<br/>\n<br/>\nAny person&#39;s greatest mistake is thinking they have control over anyone but<br/>\nthemselves.  Parents most commonly fall victim to this way of thinking, but<br/>\nthey have learned it and been conditioned to it themselves all their lives<br/>\nso they think it&#39;s natural, right and unquestionable.  I often wonder how<br/>\nand why things lined up magically for me such that I consciously chose to<br/>\nabandon all I had learned and move in a complete and total opposite<br/>\ndirection from how I was raised.   It&#39;s good we can find support for<br/>\nalternative ways of parenting among our unschool support networks.<br/>\n<br/>\nBarb<br/>\nE-mail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a><br/>\n<br/>\n&quot;Whatever you can do, or dream you can do, begin it.  Boldness<br/>\nhas genius, power, and magic in it.&quot;   Goethe<br/>\n<br/>\n<br/>\nFrom: &quot;elainegh8&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elainegh8@...\">elainegh8@...</a>&gt;<br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nDate: Wed, 23 Nov 2005 14:34:33 -0000<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager<br/>\n<br/>\n<br/>\nFrom a personal perspective the father is using emotional blackmail in<br/>\nhis letter to try and get his son back. It might work this time but<br/>\neventually it won&#39;t. Using emotional blackmail such  &quot;see what I&#39;ve<br/>\ndone for you&quot; and &quot;see what I&#39;ve given up for you&quot; does not make<br/>\npeople want to be with you or do things for you.<br/>\n<br/>\nI&#39;ve had this kind of thing from my mother most of my life. Not as<br/>\novertly as the dad has done, it was much more subtle, but it doesn&#39;t<br/>\nmake you feel loved it just makes you feel permanently disapproved of.<br/>\nBoth me and my brother had left home by the age of 18.<br/>\n<br/>\n                        BWs Elaine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nVisit the Unschooling website and message boards:<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt;<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8037645,"authorName":"elainegh8","from":"&quot;elainegh8&quot; &lt;elainegh8@...&gt;","profile":"elainegh8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: OT: Missing Homeschooled Teenager","postDate":"1132756473","msgId":110153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtMXVscCtvZTQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU3MkE3NENBLUM3Q0QtNDVFNS1BM0U4LURCMUMyRUExNzczNkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":110152,"nextInTopic":110154,"prevInTime":110152,"nextInTime":110154,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"From a personal perspective the father is using emotional blackmail in his letter to try and get his son back. It might work this time but eventually it won t.","messageBody":"<div id=\"ygrps-yiv-128584162\">From a personal perspective the father is using emotional blackmail in <br/>\nhis letter to try and get his son back. It might work this time but <br/>\neventually it won&#39;t. Using emotional blackmail such  &quot;see what I&#39;ve <br/>\ndone for you&quot; and &quot;see what I&#39;ve given up for you&quot; does not make <br/>\npeople want to be with you or do things for you. <br/>\n<br/>\nI&#39;ve had this kind of thing from my mother most of my life. Not as <br/>\novertly as the dad has done, it was much more subtle, but it doesn&#39;t <br/>\nmake you feel loved it just makes you feel permanently disapproved of. <br/>\nBoth me and my brother had left home by the age of 18. <br/>\n<br/>\n                         BWs Elaine</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132738593","msgId":110152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU3MkE3NENBLUM3Q0QtNDVFNS1BM0U4LURCMUMyRUExNzczNkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PEJGQTkxMTFDLkQzN0IlYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4=","referencesHeader":"PEJGQTkxMTFDLkQzN0IlYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4="},"prevInTopic":110151,"nextInTopic":110153,"prevInTime":110151,"nextInTime":110153,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... The this it should prompt is discussion about unschooling. How can we make our family s lives better? And it has pointed to the fact that if we create a","messageBody":"<div id=\"ygrps-yiv-1261796819\">On Nov 22, 2005, at 7:17 PM, Barb Lundgren wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I couldn&#39;t agree with you more.  You admittedly accepted the  <br/>\n&gt; initial email<br/>\n&gt; that prompted this however. If you had refused to put it through, this<br/>\n&gt; would not be an issue.<br/>\n<br/>\n </span></blockquote>The &quot;this&quot; it should prompt is discussion about unschooling. How can  <br/>\nwe make our family&#39;s lives better? And it has pointed to the fact  <br/>\nthat if we create a home they want to run away from, they can.<br/>\n<br/>\nSo how can we create homes they don&#39;t want to run away from?<br/>\n<br/>\nHow can we get rid of the boxes we might be confining them in so they  <br/>\ndon&#39;t feel like they have to escape?<br/>\n<br/>\nIt&#39;s not saying to kids &quot;Go do whatever you want.&quot; If it were we  <br/>\ncould just put that on the list description and shut it down ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Since you did however, and later seemed to suggest<br/>\n&gt; that his pain was less important because he was a homeschooler vs. an<br/>\n&gt; unschooler, is your opinion.  Mine is different.<br/>\n<br/>\n </span></blockquote>No. *For the purposes of the list*, how this father&#39;s life turned out  <br/>\nis not as important as how an unschoolers life turns out. His child  <br/>\ndidn&#39;t run away because he was unschooling and practicing respectful  <br/>\nparenting so *for the purposes of this list* we should stick to  <br/>\ndiscussions that help us make better lives for our families.<br/>\n<br/>\nPeople in this world make all sorts of decisions that create  <br/>\nunpleasant situations for themselves. *The purpose of the list* is  <br/>\nnot to express the hurt we feel for those people. Individuals on the  <br/>\nlist can feel how ever they wish, discuss whatever they wish. They  <br/>\njust need to express it elsewhere so this list can be what the list  <br/>\ndiscription says its purpose is: discussing unschooling.<br/>\n<br/>\nI know once people find a place where others they like gather, the  <br/>\nlist can start to feel like a comfy place to come chit-chat about our  <br/>\nlives and hopes and fears. But that&#39;s not its purpose. The purpose is  <br/>\nto discuss unschooling -- which *can be* our lives and hopes and (how  <br/>\nto get past our) fears about unschooling ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132394532,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132720142","msgId":110151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTcwMWM1ZWZlNiQ3MTdmNmNhMCQ5ZmM1Zjg0NUBrcmlzdGVueDMxZHZkOD4=","referencesHeader":"PDEyOC42OWIxOWYxZC4zMGI1MWQ3MkBhb2wuY29tPg=="},"prevInTopic":110148,"nextInTopic":110152,"prevInTime":110150,"nextInTime":110152,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"I agree it isn t ours to resolve, except where we might see similarities in our own families.  I wasn t speaking of anyone in particular jumping to","messageBody":"<div id=\"ygrps-yiv-780784070\">I agree it isn&#39;t ours to resolve, except where we might see similarities in our own families.  I wasn&#39;t speaking of anyone in particular jumping to conclusions, just putting a general caution out there.  <br/>\n<br/>\nKristen<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Tuesday, November 22, 2005 8:18 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager<br/>\n<br/>\n<br/>\n<br/>\n  In a message dated 11/22/05 5:29:31 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a> writes:<br/>\n<br/>\n<br/>\n  &gt; -=-I agree his letter is telling, but I don&#39;t think we should jump to <br/>\n  &gt; conclusions.-=-<br/>\n  &gt; <br/>\n  There are no conclusions, just observations.   The situation isn&#39;t ours to <br/>\n  resolve.<br/>\n<br/>\n  Sandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt; <br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS Graduate school education  High school education  Home school education  <br/>\n        Middle school education  New york school education  School education in california  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    a..  Visit your group &quot;UnschoolingDiscussion&quot; on the web.<br/>\n      <br/>\n    b..  To unsubscribe from this group, send an email to:<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c..  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132713705","msgId":110148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4My40NDcxNC4zMGI1MzBlOUBhb2wuY29tPg=="},"prevInTopic":110147,"nextInTopic":110151,"prevInTime":110147,"nextInTime":110149,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... Agreeing with me, I m guessing, as I let the mail through. There should be no issue outside of discussion on how the situation applies to unschooling, and","messageBody":"<div id=\"ygrps-yiv-1965126110\">In a message dated 11/22/05 7:08:34 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I couldn&#39;t agree with you more.  You admittedly accepted the initial <br/>\n&gt; email<br/>\n&gt; that prompted this however.  If you had refused to put it through, this<br/>\n&gt; would not be an issue. -=-<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Agreeing with me, I&#39;m guessing, as I let the mail through.<br/>\nThere should be no issue outside of discussion on how the situation applies <br/>\nto unschooling, and as that family isn&#39;t unschooling the situation turns <br/>\nquickly to the relationships we ARE involved in.<br/>\n<br/>\n-=-Since you did however, and later seemed to suggest<br/>\nthat his pain was less important because he was a homeschooler vs. an<br/>\nunschooler, is your opinion. -=-<br/>\n<br/>\n&quot;His&quot; pain the dad&#39;s?   Or his-pain the son&#39;s?<br/>\n<br/>\nIn such cases I personally am more concerned with the child&#39;s feelings than <br/>\nthe parent&#39;s.   Your choice can certainly be different.   But the discussion <br/>\nshouldn&#39;t be about a particular family or person, it&#39;s about the ideas and how <br/>\nthey apply to this list.    Even if it were an unschooling family, even if they <br/>\nwere on the list, we&#39;re here to discuss ideas and philosophies.   <br/>\n<br/>\n-=-I would love to see this unschool list jump at any opportunity to help<br/>\nlocate the boy, if for no other reason to come to his aid and help him get<br/>\nwhat he is after.-=-<br/>\n<br/>\nI like to see this unschooling list discuss unschooling.   <br/>\nThis list can&#39;t locate a boy.      I doubt he left home in order to garner <br/>\nthe help of other parents.   If he trusted parents better, he might have stayed <br/>\nwith his own.   Maybe he has gone to some adults he does trust.   I hope so.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132709764","msgId":110145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0JERTU2NzYwOTU5Mi1DMzgtMUVGMkBNQkxLLU0zOS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PEJGQTkxMDIwLkQzN0ElYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4="},"prevInTopic":110144,"nextInTopic":110147,"prevInTime":110144,"nextInTime":110146,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... From: Barb Lundgren barb.lundgren@comcast.net I would love to see this unschool list jump at any opportunity to help locate the boy, if for no other reason","messageBody":"<div id=\"ygrps-yiv-1429949278\">-----Original Message-----<br/>\nFrom: Barb Lundgren <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a><br/>\n<br/>\nI would love to see this unschool list jump at any opportunity to help<br/>\nlocate the boy, if for no other reason to come to his aid and help him get<br/>\nwhat he is after.<br/>\n <br/>\n-=-=-<br/>\n <br/>\nI don&#39;t think ANYONE here would hesitate to help this child. ANYONE. But I *do* think that the reasons for his leaving are fodder for discussing unschooling (and parenting philosophy) and its benefits.<br/>\n<br/>\n <br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132708722","msgId":110144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyOC42OWIxOWYxZC4zMGI1MWQ3MkBhb2wuY29tPg=="},"prevInTopic":110142,"nextInTopic":110145,"prevInTime":110143,"nextInTime":110145,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... There are no conclusions, just observations.   The situation isn t ours to resolve. Sandra [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-470227151\">In a message dated 11/22/05 5:29:31 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I agree his letter is telling, but I don&#39;t think we should jump to <br/>\n&gt; conclusions.-=-<br/>\n&gt; <br/>\n </span></blockquote>There are no conclusions, just observations.   The situation isn&#39;t ours to <br/>\nresolve.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153458693,"authorName":"Barb Lundgren","from":"Barb Lundgren &lt;barb.lundgren@...&gt;","profile":"barb_lundgren","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132705020","msgId":110147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGQTkxMTFDLkQzN0IlYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDI3Yy4yMmNjZDMuMzBiNGY0M2RAYW9sLmNvbT4="},"prevInTopic":110145,"nextInTopic":110148,"prevInTime":110146,"nextInTime":110148,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"I couldn t agree with you more.  You admittedly accepted the initial email that prompted this however.  If you had refused to put it through, this would not be","messageBody":"<div id=\"ygrps-yiv-2141726162\">I couldn&#39;t agree with you more.  You admittedly accepted the initial email<br/>\nthat prompted this however.  If you had refused to put it through, this<br/>\nwould not be an issue.  Since you did however, and later seemed to suggest<br/>\nthat his pain was less important because he was a homeschooler vs. an<br/>\nunschooler, is your opinion.  Mine is different.<br/>\n<br/>\nBarb<br/>\n<br/>\nE-mail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a><br/>\n<br/>\n&quot;Whatever you can do, or dream you can do, begin it.  Boldness<br/>\nhas genius, power, and magic in it.&quot;   Goethe<br/>\n<br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nDate: Tue, 22 Nov 2005 17:22:53 EST<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I don&#39;t agree that someone who reads this list couldn&#39;t find or help<br/>\n&gt; find<br/>\n&gt; this boy. -=-<br/>\n&gt; <br/>\n </span></blockquote>Those in New Zealand, Australia, England, France and Canada won&#39;t.<br/>\nHe seems to be gone from Florida.   Few other parts of the U.S. are affected<br/>\none way or another.<br/>\n<br/>\nThe list isn&#39;t for local discussion, and the runaway child of someone who&#39;s<br/>\nnot an unschooler is thrice removed from the list&#39;s purpose.<br/>\n<br/>\n-=-Like Sandra, I would not turn him in either if I found him. -=-<br/>\n<br/>\nWe&#39;ll, you&#39;ve forwarded the father&#39;s request for people to turn him in, so<br/>\nyou might be contributing to that, as was I by letting the announcement<br/>\nthrough. <br/>\n I hope he&#39;s not turned in, still.<br/>\n<br/>\n-=-I like to think that unschoolers make up some sort of community of folks,<br/>\ndespite whatever geographic distance exists between us, that allows us to<br/>\nhelp and comfort one another.-=-<br/>\n<br/>\nIt doesn&#39;t prevent those who want to help and comfort from doing so, but the<br/>\npurpose of this list isn&#39;t   &quot;support&quot; of the parents.   It&#39;s the discussion<br/>\nof the benefits of unschooling and how they play out in everyday life.<br/>\n<br/>\n-=-The fact that this boy may not have been an<br/>\nunschooler, but rather a homeschooler, is an irrelevant point to me.-=-<br/>\n<br/>\nThat&#39;s fine for you.   Each of us makes decisions in different ways.   Five<br/>\nhundred different angles on the idea of community still shouldn&#39;t keep this<br/>\nlist from discussing how parenting affects relationships.<br/>\n<br/>\n-=-Just because Sandra says her kids would never run away from home does not<br/>\nmean that they never would-=-<br/>\n<br/>\nIf they do or don&#39;t, it won&#39;t be because of what I wrote on this list,<br/>\nthat&#39;s <br/>\nfor sure.   They&#39;re 19, 16 and 14 and they haven&#39;t so much as slammed a door<br/>\nin anger for years.<br/>\n<br/>\nIf I wanted to frustrate a child to the point of running away, I&#39;m sure I<br/>\nknow how to do it.   I&#39;ve seen others do it my whole life.   I wouldn&#39;t WANT<br/>\nto <br/>\ndo it, but if I snapped and wanted to, or wanted to win some big bet or<br/>\nsomething I can only imagine... here&#39;s what I would do:   I would attempt to<br/>\nforce <br/>\nthe kid to do what I said, eat when and where and how I said (OF COURSE eat<br/>\nWHAT <br/>\nI said), and stop eating when I said, and not snack between meals.   I would<br/>\nforce the child to clean his room to my satisfaction and on my schedule.   I<br/>\nwould force him to go to school even if he didn&#39;t want to, or just as good,<br/>\nmaybe I would force him to homeschool even though he wanted to go to school.<br/>\nI <br/>\nwould make him help me and then complain about the quality of his work.   I<br/>\nwould give him very little money and never help him out financially, but<br/>\nmake <br/>\nhim live within his allowance.     I would tell him what to wear and how to<br/>\nwear <br/>\nit.   I&#39;d make him be home and in bed at a certain time.   I wouldn&#39;t let<br/>\nhim <br/>\nlisten to music or watch TV to go to sleep, because that would be wasting my<br/>\nelectricity.   I would make him fill out college applications, and then<br/>\ncomplain about his handwriting.   If I let him play video games at all, I<br/>\nwould make <br/>\nhim sell his old system and put that money toward a new one.   I wouldn&#39;t<br/>\nlet <br/>\nhim watch R rated movies.     If I let him drive the car I would charge him<br/>\nby the mile and make him pay his own insurance and remind him frequently<br/>\nwhat a <br/>\nbig favor I was doing by not making him wait until he had enough to buy his<br/>\nown car.   When he turned 18, I would start charging him rent.   Happy<br/>\nbirthday.   <br/>\n<br/>\nI doubt the family in question did al those things, but they probably did<br/>\nsome of them.<br/>\nThey&#39;re all things I&#39;ve seen done by families I know or have known.<br/>\n<br/>\nNone of those families has kids happier than mine, nor relationships with<br/>\ntheir kids as good as Keith and I have with ours.<br/>\n<br/>\n-=-I<br/>\nagree that this list supports such tenets as unconditional love, respect for<br/>\nthe unique learning styles of each child, good communication vs. top-down<br/>\ndiscipline, etc.  How is this relevant however to the fact that a family in<br/>\nour broad homeschool community is in crisis and needs help?-=-<br/>\n<br/>\nI don&#39;t know about &quot;unconditional love&quot;--it&#39;s a concept often misused and<br/>\nabused.<br/>\n<br/>\nWhat is relevant about what the list supports is that this list doesn&#39;t<br/>\nexist <br/>\nto help a family in &quot;a broad homeschool community.&quot;    Even it this were a<br/>\nWashington State unschooling list, it wouldn&#39;t be the purpose of the list.<br/>\n<br/>\nSupport and help come in different ways.   We&#39;re working through and honing<br/>\nideas and ways to express those ideas that have helped MANY families have<br/>\nbetter relationships, more peace, more stability and security in their<br/>\nfamily <br/>\nlives.<br/>\n<br/>\nThe woman whose husband and church made her homeschool against her will...<br/>\n(yeah, which one?) , the one who drowned her kids.   Was she part of our<br/>\nbroad <br/>\nhomeschool community?   The mom who killed kids with a rock (was she in<br/>\nTexas <br/>\ntoo?)   Did we owe her help and support?     The family with all the adopted<br/>\nkids they can&#39;t take care of (yeah, which one?) and so they left some in the<br/>\nhouse and hungry (still doesn&#39;t narrow it down to one family...)--them too?<br/>\n<br/>\nI have more in common with others who grew up in Northern New Mexico than I<br/>\nhave in common with the people in the paragraph above.   I have more in<br/>\ncommon <br/>\nwith other folksinging guitar players, even those who are childless or send<br/>\ntheir kids to school, than I will ever have in common with a family whose<br/>\nchildren are dressed for school each morning by 8:00 and report to their<br/>\nin-house <br/>\nschoolroom or kitchen table.<br/>\n<br/>\nJoyce, one of the listowners, wrote this:<br/>\n<br/>\n-=-Everyone who is interested in unschooling or finding out more about it is<br/>\nwelcome to join. But be aware that the list is for those who are seeking a<br/>\ndeeper understanding of unschooling, a more respectful relationship with<br/>\ntheir <br/>\nchildren, to move out of their comfort zone to reach for something better.<br/>\nThat <br/>\nmeans, though we recognize how hard the journey is and how far people come<br/>\nto <br/>\njust let go of one schoolish thing, this list can&#39;t offer on line support<br/>\nfor <br/>\npeople who are pausing at some comfortable spot on their journey towards<br/>\nunschooling. We are here to support those who are actively pushing beyond<br/>\ntheir <br/>\ncomfort zones.-=-<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nVisit the Unschooling website and message boards:<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt;<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153458693,"authorName":"Barb Lundgren","from":"Barb Lundgren &lt;barb.lundgren@...&gt;","profile":"barb_lundgren","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: OT: Missing Homeschooled Teenager","postDate":"1132704768","msgId":110142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGQTkxMDIwLkQzN0ElYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEJCNEZFMDlCLTAzQkQtNDZDNS05RTk1LTJFQzNDQUYwMjYxN0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":110141,"nextInTopic":110144,"prevInTime":110141,"nextInTime":110143,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"I was voicing a counter opinion, I thought, to what I read was Sandra s opposition to help this father find his son.  It is entirely possible I misread her","messageBody":"<div id=\"ygrps-yiv-1978325207\">I was voicing a counter opinion, I thought, to what I read was Sandra&#39;s<br/>\nopposition to help this father find his son.  It is entirely possible I<br/>\nmisread her intentions.. this is only email afterall, and a far cry from<br/>\nperson-so-person communication.  I totally understand if this discussion is<br/>\nnot appropriate for this list, although since the announcement was allowed,<br/>\nI think a discussion should follow.<br/>\n<br/>\nInsight on the family:  I know the father professionally and somewhat<br/>\npersonally.  He and his wife gave up their NYC jobs and moved to lower key<br/>\nFlorida, starting a home business (home school related) so they could spend<br/>\nmore time with their young teen... about 3 years ago.  They are admittedly<br/>\nnot unschoolers and we have had discussions about the difference.  They<br/>\ndefinitely have had more of a plan to &quot;produce the well educated child&quot;.<br/>\nSo, while we all have our opinions about that, and we have seen a taste<br/>\nthrough this family of a possible outcome of this approach which we are all<br/>\nsensitive to and certainly empathetic, the fact remains that a child is<br/>\nmissing.  Even though parents believe he is in the northwest, they don&#39;t<br/>\nknow and don&#39;t know how he got there, why or where he is, nor what condition<br/>\nhe is in.  All this is as troubling as it gets for a parent, and I am deeply<br/>\nconcerned for them.<br/>\n<br/>\nI would love to see this unschool list jump at any opportunity to help<br/>\nlocate the boy, if for no other reason to come to his aid and help him get<br/>\nwhat he is after.<br/>\n<br/>\nBarb<br/>\n<br/>\nE-mail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a><br/>\n<br/>\n&quot;Whatever you can do, or dream you can do, begin it.  Boldness<br/>\nhas genius, power, and magic in it.&quot;   Goethe<br/>\n<br/>\n<br/>\nFrom: Pamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nDate: Tue, 22 Nov 2005 15:28:30 -0800<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 22, 2005, at 11:59 AM, Barb Lundgren wrote:<br/>\n<br/>\n&gt; Like Sandra, I would not turn him in either if I found him.  I<br/>\n&gt; might simply<br/>\n&gt; let the father know he was seen (but not say where) and that he is<br/>\n&gt; ok or has<br/>\n&gt; a message for his family, or whatever the boy asked for.  The fact<br/>\n&gt; that you<br/>\n&gt; chose to let the announcement go through to your list in the first<br/>\n&gt; place<br/>\n&gt; should now be followed up with a discussion, if one occurs.<br/>\n&gt;<br/>\n&gt; I like to think that unschoolers make up some sort of community of<br/>\n&gt; folks,<br/>\n&gt; despite whatever geographic distance exists between us, that allows<br/>\n&gt; us to<br/>\n&gt; help and comfort one another.  The fact that this boy may not have<br/>\n&gt; been an<br/>\n&gt; unschooler, but rather a homeschooler, is an irrelevant point to me.<br/>\n&gt;<br/>\n&gt; Just because Sandra says her kids would never run away from home<br/>\n&gt; does not<br/>\n&gt; mean that they never would, nor that other unschool kids wouldn&#39;t.<br/>\n&gt; Life is<br/>\n&gt; too complex, with too many variables, to make predictions that involve<br/>\n&gt; &#39;never&#39;.  I too empathize with the son... but also with the<br/>\n&gt; parents.  I<br/>\n&gt; agree that this list supports such tenets as unconditional love,<br/>\n&gt; respect for<br/>\n&gt; the unique learning styles of each child, good communication vs.<br/>\n&gt; top-down<br/>\n&gt; discipline, etc.  How is this relevant however to the fact that a<br/>\n&gt; family in<br/>\n&gt; our broad homeschool community is in crisis and needs help?<br/>\n<br/>\nNot sure what you&#39;re complaining about, Barb. Sounds like you and<br/>\nSandra (and I) are in agreement. We wouldn&#39;t automatically &quot;turn in&quot;<br/>\na 16 year old who has left home. He could have really good reasons,<br/>\nwe just don&#39;t know. I would let parents know that I knew he was okay,<br/>\ntoo.<br/>\n<br/>\nI DID call a runaway kid&#39;s parents, once, because I read some of his<br/>\nemail and he appeared to be suicidal. I KNEW his parents and I knew<br/>\nwhat the problem was - he was gay and he didn&#39;t think they could<br/>\naccept that. HE was wrong - as hard as it was for them, I knew they&#39;d<br/>\nfind a way because I knew they loved him through and through.<br/>\n<br/>\nI called his dad and read him some of his son&#39;s email and told him<br/>\nwhere he was. They got help for him and for themselves and they are<br/>\nall doing fine, today. Dad and son have both thanked us.<br/>\n<br/>\nBut - in that case, I knew the child and the parents and I knew what<br/>\nthe problem was, exactly. And I was very certain that the son was<br/>\nwrong about what his parents&#39; reaction was going to be.<br/>\n<br/>\nWe don&#39;t know why this 16 year old has left home. We don&#39;t know what<br/>\nhis relationship with his parents is really like. We don&#39;t know much<br/>\nof anything, except he isn&#39;t a young child and it isn&#39;t obvious to me<br/>\nthat a 16 year old young man should automatically be returned against<br/>\nhis will to parents he&#39;s run away from.<br/>\n<br/>\nBarb, if you know them, them maybe you have some insight that the<br/>\nrest of us do not have. That might make a difference in how you feel<br/>\nabout it.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nVisit the Unschooling website and message boards:<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt;<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":132394532,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132703788","msgId":110141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTIwMWM1ZWZjMCQ1YzBhNWVmMCQ5ZmM1Zjg0NUBrcmlzdGVueDMxZHZkOD4=","referencesHeader":"PEJGQThENEMwLkQzNjYlYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4gPEJCNEZFMDlCLTAzQkQtNDZDNS05RTk1LTJFQzNDQUYwMjYxN0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":110140,"nextInTopic":110142,"prevInTime":110140,"nextInTime":110142,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"know what his relationship with his parents is really like. We don t know much of anything, except he isn t a young child and it isn t obvious to me that a 16","messageBody":"<div id=\"ygrps-yiv-347373250\">know what  <br/>\nhis relationship with his parents is really like. We don&#39;t know much  <br/>\nof anything, except he isn&#39;t a young child and it isn&#39;t obvious to me  <br/>\nthat a 16 year old young man should automatically be returned against  <br/>\nhis will to parents he&#39;s run away from.<br/>\n<br/>\n<br/>\n******************************8<br/>\n<br/>\nWe also don&#39;t know that the dad didn&#39;t write what he did out of an exagerrated sense of guilt.  Parents who have things like this happen many times will put more blame on themselves than maybe they deserve.  I agree his letter is telling, but I don&#39;t think we should jump to conclusions.  These parents are both distraught.  There may be much more to this story than anyone really knows.<br/>\n<br/>\nHaving said that, I hope they find him and work it out for the better.<br/>\n<br/>\nKristen<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Pamela Sorooshian <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Tuesday, November 22, 2005 6:28 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager<br/>\n<br/>\n<br/>\n<br/>\n  On Nov 22, 2005, at 11:59 AM, Barb Lundgren wrote:<br/>\n<br/>\n  &gt; Like Sandra, I would not turn him in either if I found him.  I  <br/>\n  &gt; might simply<br/>\n  &gt; let the father know he was seen (but not say where) and that he is  <br/>\n  &gt; ok or has<br/>\n  &gt; a message for his family, or whatever the boy asked for.  The fact  <br/>\n  &gt; that you<br/>\n  &gt; chose to let the announcement go through to your list in the first  <br/>\n  &gt; place<br/>\n  &gt; should now be followed up with a discussion, if one occurs.<br/>\n  &gt;<br/>\n  &gt; I like to think that unschoolers make up some sort of community of  <br/>\n  &gt; folks,<br/>\n  &gt; despite whatever geographic distance exists between us, that allows  <br/>\n  &gt; us to<br/>\n  &gt; help and comfort one another.  The fact that this boy may not have  <br/>\n  &gt; been an<br/>\n  &gt; unschooler, but rather a homeschooler, is an irrelevant point to me.<br/>\n  &gt;<br/>\n  &gt; Just because Sandra says her kids would never run away from home  <br/>\n  &gt; does not<br/>\n  &gt; mean that they never would, nor that other unschool kids wouldn&#39;t.   <br/>\n  &gt; Life is<br/>\n  &gt; too complex, with too many variables, to make predictions that involve<br/>\n  &gt; &#39;never&#39;.  I too empathize with the son... but also with the  <br/>\n  &gt; parents.  I<br/>\n  &gt; agree that this list supports such tenets as unconditional love,  <br/>\n  &gt; respect for<br/>\n  &gt; the unique learning styles of each child, good communication vs.  <br/>\n  &gt; top-down<br/>\n  &gt; discipline, etc.  How is this relevant however to the fact that a  <br/>\n  &gt; family in<br/>\n  &gt; our broad homeschool community is in crisis and needs help?<br/>\n<br/>\n  Not sure what you&#39;re complaining about, Barb. Sounds like you and  <br/>\n  Sandra (and I) are in agreement. We wouldn&#39;t automatically &quot;turn in&quot;  <br/>\n  a 16 year old who has left home. He could have really good reasons,  <br/>\n  we just don&#39;t know. I would let parents know that I knew he was okay,  <br/>\n  too.<br/>\n<br/>\n  I DID call a runaway kid&#39;s parents, once, because I read some of his  <br/>\n  email and he appeared to be suicidal. I KNEW his parents and I knew  <br/>\n  what the problem was - he was gay and he didn&#39;t think they could  <br/>\n  accept that. HE was wrong - as hard as it was for them, I knew they&#39;d  <br/>\n  find a way because I knew they loved him through and through.<br/>\n<br/>\n  I called his dad and read him some of his son&#39;s email and told him  <br/>\n  where he was. They got help for him and for themselves and they are  <br/>\n  all doing fine, today. Dad and son have both thanked us.<br/>\n<br/>\n  But - in that case, I knew the child and the parents and I knew what  <br/>\n  the problem was, exactly. And I was very certain that the son was  <br/>\n  wrong about what his parents&#39; reaction was going to be.<br/>\n<br/>\n  We don&#39;t know why this 16 year old has left home. We don&#39;t know what  <br/>\n  his relationship with his parents is really like. We don&#39;t know much  <br/>\n  of anything, except he isn&#39;t a young child and it isn&#39;t obvious to me  <br/>\n  that a 16 year old young man should automatically be returned against  <br/>\n  his will to parents he&#39;s run away from.<br/>\n<br/>\n  Barb, if you know them, them maybe you have some insight that the  <br/>\n  rest of us do not have. That might make a difference in how you feel  <br/>\n  about it.<br/>\n<br/>\n  -pam<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt; <br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS Graduate school education  High school education  Home school education  <br/>\n        Middle school education  New york school education  School education in california  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    a..  Visit your group &quot;UnschoolingDiscussion&quot; on the web.<br/>\n      <br/>\n    b..  To unsubscribe from this group, send an email to:<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c..  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132702110","msgId":110140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCNEZFMDlCLTAzQkQtNDZDNS05RTk1LTJFQzNDQUYwMjYxN0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PEJGQThENEMwLkQzNjYlYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4=","referencesHeader":"PEJGQThENEMwLkQzNjYlYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4="},"prevInTopic":110139,"nextInTopic":110141,"prevInTime":110139,"nextInTime":110141,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... Not sure what you re complaining about, Barb. Sounds like you and Sandra (and I) are in agreement. We wouldn t automatically turn in a 16 year old who","messageBody":"<div id=\"ygrps-yiv-704263331\">On Nov 22, 2005, at 11:59 AM, Barb Lundgren wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Like Sandra, I would not turn him in either if I found him.  I  <br/>\n&gt; might simply<br/>\n&gt; let the father know he was seen (but not say where) and that he is  <br/>\n&gt; ok or has<br/>\n&gt; a message for his family, or whatever the boy asked for.  The fact  <br/>\n&gt; that you<br/>\n&gt; chose to let the announcement go through to your list in the first  <br/>\n&gt; place<br/>\n&gt; should now be followed up with a discussion, if one occurs.<br/>\n&gt;<br/>\n&gt; I like to think that unschoolers make up some sort of community of  <br/>\n&gt; folks,<br/>\n&gt; despite whatever geographic distance exists between us, that allows  <br/>\n&gt; us to<br/>\n&gt; help and comfort one another.  The fact that this boy may not have  <br/>\n&gt; been an<br/>\n&gt; unschooler, but rather a homeschooler, is an irrelevant point to me.<br/>\n&gt;<br/>\n&gt; Just because Sandra says her kids would never run away from home  <br/>\n&gt; does not<br/>\n&gt; mean that they never would, nor that other unschool kids wouldn&#39;t.   <br/>\n&gt; Life is<br/>\n&gt; too complex, with too many variables, to make predictions that involve<br/>\n&gt; &#39;never&#39;.  I too empathize with the son... but also with the  <br/>\n&gt; parents.  I<br/>\n&gt; agree that this list supports such tenets as unconditional love,  <br/>\n&gt; respect for<br/>\n&gt; the unique learning styles of each child, good communication vs.  <br/>\n&gt; top-down<br/>\n&gt; discipline, etc.  How is this relevant however to the fact that a  <br/>\n&gt; family in<br/>\n&gt; our broad homeschool community is in crisis and needs help?<br/>\n<br/>\n </span></blockquote>Not sure what you&#39;re complaining about, Barb. Sounds like you and  <br/>\nSandra (and I) are in agreement. We wouldn&#39;t automatically &quot;turn in&quot;  <br/>\na 16 year old who has left home. He could have really good reasons,  <br/>\nwe just don&#39;t know. I would let parents know that I knew he was okay,  <br/>\ntoo.<br/>\n<br/>\nI DID call a runaway kid&#39;s parents, once, because I read some of his  <br/>\nemail and he appeared to be suicidal. I KNEW his parents and I knew  <br/>\nwhat the problem was - he was gay and he didn&#39;t think they could  <br/>\naccept that. HE was wrong - as hard as it was for them, I knew they&#39;d  <br/>\nfind a way because I knew they loved him through and through.<br/>\n<br/>\nI called his dad and read him some of his son&#39;s email and told him  <br/>\nwhere he was. They got help for him and for themselves and they are  <br/>\nall doing fine, today. Dad and son have both thanked us.<br/>\n<br/>\nBut - in that case, I knew the child and the parents and I knew what  <br/>\nthe problem was, exactly. And I was very certain that the son was  <br/>\nwrong about what his parents&#39; reaction was going to be.<br/>\n<br/>\nWe don&#39;t know why this 16 year old has left home. We don&#39;t know what  <br/>\nhis relationship with his parents is really like. We don&#39;t know much  <br/>\nof anything, except he isn&#39;t a young child and it isn&#39;t obvious to me  <br/>\nthat a 16 year old young man should automatically be returned against  <br/>\nhis will to parents he&#39;s run away from.<br/>\n<br/>\nBarb, if you know them, them maybe you have some insight that the  <br/>\nrest of us do not have. That might make a difference in how you feel  <br/>\nabout it.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132698173","msgId":110139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3Yy4yMmNjZDMuMzBiNGY0M2RAYW9sLmNvbT4="},"prevInTopic":110138,"nextInTopic":110140,"prevInTime":110138,"nextInTime":110140,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... Those in New Zealand, Australia, England, France and Canada won t. He seems to be gone from Florida.   Few other parts of the U.S. are affected one way or","messageBody":"<div id=\"ygrps-yiv-682961691\"><blockquote><span title=\"ireply\">&gt; -=-I don&#39;t agree that someone who reads this list couldn&#39;t find or help <br/>\n&gt; find<br/>\n&gt; this boy. -=-<br/>\n&gt; <br/>\n </span></blockquote>Those in New Zealand, Australia, England, France and Canada won&#39;t.<br/>\nHe seems to be gone from Florida.   Few other parts of the U.S. are affected <br/>\none way or another.<br/>\n<br/>\nThe list isn&#39;t for local discussion, and the runaway child of someone who&#39;s <br/>\nnot an unschooler is thrice removed from the list&#39;s purpose.<br/>\n<br/>\n-=-Like Sandra, I would not turn him in either if I found him. -=-<br/>\n<br/>\nWe&#39;ll, you&#39;ve forwarded the father&#39;s request for people to turn him in, so <br/>\nyou might be contributing to that, as was I by letting the announcement through. <br/>\n  I hope he&#39;s not turned in, still.<br/>\n<br/>\n-=-I like to think that unschoolers make up some sort of community of folks,<br/>\ndespite whatever geographic distance exists between us, that allows us to<br/>\nhelp and comfort one another.-=-<br/>\n<br/>\nIt doesn&#39;t prevent those who want to help and comfort from doing so, but the <br/>\npurpose of this list isn&#39;t   &quot;support&quot; of the parents.   It&#39;s the discussion <br/>\nof the benefits of unschooling and how they play out in everyday life.<br/>\n<br/>\n-=-The fact that this boy may not have been an<br/>\nunschooler, but rather a homeschooler, is an irrelevant point to me.-=-<br/>\n<br/>\nThat&#39;s fine for you.   Each of us makes decisions in different ways.   Five <br/>\nhundred different angles on the idea of community still shouldn&#39;t keep this <br/>\nlist from discussing how parenting affects relationships.<br/>\n<br/>\n-=-Just because Sandra says her kids would never run away from home does not<br/>\nmean that they never would-=-<br/>\n<br/>\nIf they do or don&#39;t, it won&#39;t be because of what I wrote on this list, that&#39;s <br/>\nfor sure.   They&#39;re 19, 16 and 14 and they haven&#39;t so much as slammed a door <br/>\nin anger for years.   <br/>\n<br/>\nIf I wanted to frustrate a child to the point of running away, I&#39;m sure I <br/>\nknow how to do it.   I&#39;ve seen others do it my whole life.   I wouldn&#39;t WANT to <br/>\ndo it, but if I snapped and wanted to, or wanted to win some big bet or <br/>\nsomething I can only imagine... here&#39;s what I would do:   I would attempt to force <br/>\nthe kid to do what I said, eat when and where and how I said (OF COURSE eat WHAT <br/>\nI said), and stop eating when I said, and not snack between meals.   I would <br/>\nforce the child to clean his room to my satisfaction and on my schedule.   I <br/>\nwould force him to go to school even if he didn&#39;t want to, or just as good, <br/>\nmaybe I would force him to homeschool even though he wanted to go to school.   I <br/>\nwould make him help me and then complain about the quality of his work.   I <br/>\nwould give him very little money and never help him out financially, but make <br/>\nhim live within his allowance.     I would tell him what to wear and how to wear <br/>\nit.   I&#39;d make him be home and in bed at a certain time.   I wouldn&#39;t let him <br/>\nlisten to music or watch TV to go to sleep, because that would be wasting my <br/>\nelectricity.   I would make him fill out college applications, and then <br/>\ncomplain about his handwriting.   If I let him play video games at all, I would make <br/>\nhim sell his old system and put that money toward a new one.   I wouldn&#39;t let <br/>\nhim watch R rated movies.     If I let him drive the car I would charge him <br/>\nby the mile and make him pay his own insurance and remind him frequently what a <br/>\nbig favor I was doing by not making him wait until he had enough to buy his <br/>\nown car.   When he turned 18, I would start charging him rent.   Happy <br/>\nbirthday.   <br/>\n<br/>\nI doubt the family in question did al those things, but they probably did <br/>\nsome of them.<br/>\nThey&#39;re all things I&#39;ve seen done by families I know or have known.<br/>\n<br/>\nNone of those families has kids happier than mine, nor relationships with <br/>\ntheir kids as good as Keith and I have with ours.<br/>\n<br/>\n-=-I<br/>\nagree that this list supports such tenets as unconditional love, respect for<br/>\nthe unique learning styles of each child, good communication vs. top-down<br/>\ndiscipline, etc.  How is this relevant however to the fact that a family in<br/>\nour broad homeschool community is in crisis and needs help?-=-<br/>\n<br/>\nI don&#39;t know about &quot;unconditional love&quot;--it&#39;s a concept often misused and <br/>\nabused.<br/>\n<br/>\nWhat is relevant about what the list supports is that this list doesn&#39;t exist <br/>\nto help a family in &quot;a broad homeschool community.&quot;    Even it this were a <br/>\nWashington State unschooling list, it wouldn&#39;t be the purpose of the list.<br/>\n<br/>\nSupport and help come in different ways.   We&#39;re working through and honing <br/>\nideas and ways to express those ideas that have helped MANY families have <br/>\nbetter relationships, more peace, more stability and security in their family <br/>\nlives.<br/>\n<br/>\nThe woman whose husband and church made her homeschool against her will... <br/>\n(yeah, which one?) , the one who drowned her kids.   Was she part of our broad <br/>\nhomeschool community?   The mom who killed kids with a rock (was she in Texas <br/>\ntoo?)   Did we owe her help and support?     The family with all the adopted <br/>\nkids they can&#39;t take care of (yeah, which one?) and so they left some in the <br/>\nhouse and hungry (still doesn&#39;t narrow it down to one family...)--them too?<br/>\n<br/>\nI have more in common with others who grew up in Northern New Mexico than I <br/>\nhave in common with the people in the paragraph above.   I have more in common <br/>\nwith other folksinging guitar players, even those who are childless or send <br/>\ntheir kids to school, than I will ever have in common with a family whose <br/>\nchildren are dressed for school each morning by 8:00 and report to their in-house <br/>\nschoolroom or kitchen table.<br/>\n<br/>\nJoyce, one of the listowners, wrote this:<br/>\n<br/>\n-=-Everyone who is interested in unschooling or finding out more about it is <br/>\nwelcome to join. But be aware that the list is for those who are seeking a <br/>\ndeeper understanding of unschooling, a more respectful relationship with their <br/>\nchildren, to move out of their comfort zone to reach for something better. That <br/>\nmeans, though we recognize how hard the journey is and how far people come to <br/>\njust let go of one schoolish thing, this list can&#39;t offer on line support for <br/>\npeople who are pausing at some comfortable spot on their journey towards <br/>\nunschooling. We are here to support those who are actively pushing beyond their <br/>\ncomfort zones.-=-<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132695862","msgId":110138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4OC4yYzFmZTcuMzBiNGViMzZAYW9sLmNvbT4="},"prevInTopic":110137,"nextInTopic":110139,"prevInTime":110137,"nextInTime":110139,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... Then he would run away from you too, and would have been better off staying. -=-Really?  I wonder if you could be charged with holding him or  ","messageBody":"<div id=\"ygrps-yiv-1176507551\">In a message dated 11/22/05 12:59:21 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I would give him  every<br/>\n&gt; opportunity to make contact himself before I did so, and I&#39;d have a  <br/>\n&gt; deadline. -=-<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Then he would run away from you too, and would have been better off staying.<br/>\n<br/>\n-=-Really?  I wonder if you could be charged with holding him or  <br/>\nsomething?-=-<br/>\n<br/>\nReally.   I wouldn&#39;t BE &quot;holding him.&quot;   There are hundreds of people whose <br/>\nwhereabouts I know.   I&#39;m not reponsible for them and I&#39;m not holding them.   <br/>\nIf I knew this boy&#39;s whereabouts I would reassure the parents without calling <br/>\nthe sheriff.   (I don&#39;t suppose he&#39;s in Albuquerque and I don&#39;t know him, so <br/>\nit&#39;s just a hypothetical point.)<br/>\n<br/>\n-=- I would want someone to tell me as soon as <br/>\npossible, if they knew something about him that I wouldn&#39;t otherwise <br/>\nknow. -=-<br/>\n<br/>\nThat&#39;s not the same as turning him in to authorities.<br/>\n<br/>\n-=-he dad of this boy who ran  away at 15<br/>\ndoesn&#39;t have those options, and no matter how mainstream his  parenting was, <br/>\nI<br/>\nthink he deserves to know if someone knows where his son  is. -=-<br/>\n<br/>\nSure.<br/>\nI never said I wouldn&#39;t tell them.   I said plainly that I would contact his <br/>\ndad.<br/>\n<br/>\n-=-But I agree that the letter points up some very sad misunderstandings on  <br/>\nthe<br/>\nfather&#39;s part, and I hope he is so relieved when he gets his son back that <br/>\nhe finally understands.-=-<br/>\n<br/>\nI&#39;ve not ever yet seen or heard of a case in which a runaway went home and <br/>\nthe parents gave him all the space and respect   he needed.      (Anyone here <br/>\nhave stories of parents really feeling in the wrong and changing their ways when <br/>\na runaway came home or was delivered by the sheriff?)<br/>\n<br/>\n-=-<br/>\nWe had a neighbor whom we told could come here any time she needed a safe <br/>\nplace. Her father called one night and asked that we tell him when she was here. <br/>\nI refused, saying that she needed a safe place. His brother-in-law, the <br/>\nlawyer, got a restraining order against us.-=-<br/>\n<br/>\nA restraining order saying you couldn&#39;t come near the girl!?   I wonder that <br/>\nhe could do that on her behalf (as it were) without her consent.     A <br/>\nrestraining order against the father, sure.   Or the uncle.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132692439","msgId":110136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0JEQkQxMDYzRUU1NC1BRTQtMjY4NUBGV00tRDAzLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDY4LjYxYjI5YmZiLjMwYjRkMjNhQGFvbC5jb20+","referencesHeader":"PDY4LjYxYjI5YmZiLjMwYjRkMjNhQGFvbC5jb20+"},"prevInTopic":110135,"nextInTopic":110137,"prevInTime":110135,"nextInTime":110137,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... From: tuckervill2@aol.com Really?  I wonder if you could be charged with holding him or  something? --=-=- We had a neighbor whom we told could come here","messageBody":"<div id=\"ygrps-yiv-1770651651\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a><br/>\n<br/>\nReally?  I wonder if you could be charged with holding him or  something?<br/>\n <br/>\n <br/>\n--=-=-<br/>\n <br/>\nWe had a neighbor whom we told could come here any time she needed a safe place. Her father called one night and asked that we tell him when she was here. I refused, saying that she needed a safe place. His brother-in-law, the lawyer, got a restraining order against us.<br/>\n <br/>\nShe still came by. &lt;g&gt;<br/>\n <br/>\n-=-=-=-<br/>\n<br/>\n <br/>\nFifteen is still a minor, and I wouldn&#39;t want to be in a position of being  <br/>\ncharged with contributing to the delinquency of a minor or maybe a trumped up  <br/>\ncharge of holding him against his will or whatever.  What if he wanted to  <br/>\nstay with me but didn&#39;t want me to call his parents?  I would give him  every <br/>\nopportunity to make contact himself before I did so, and I&#39;d have a  deadline.  <br/>\nI have sympathy for the kid, but I also have sympathy for his  parents, who <br/>\nmust be heartsick with worry.<br/>\n <br/>\n-=-=-=-=-<br/>\n <br/>\nBut they made their bed. Seriously. They set up the adversarial relationship. I would also encourage him to let them know he was safe, but I wouldn&#39;t turn him in. Basically he&#39;s doing to them what&#39;s been done to him for 15 years. The tables have simply been turned.<br/>\n <br/>\nI&#39;d maybe suggest having the letter sent to a different state to be postmarked far away. <br/>\n <br/>\n-=-=-=-<br/>\n <br/>\nMy son&#39;s in Iraq and could be killed at any moment and I wouldn&#39;t know how  <br/>\nor where for a long time.  I would want someone to tell me as soon as  <br/>\npossible, if they knew something about him that I wouldn&#39;t otherwise know.   <br/>\nHe&#39;ll be home for good next month, and then I will finally exhale and won&#39;t be  <br/>\nmentioning it again, but for 18 months he has been in the forefront of my mind  <br/>\nat all times.  He choose to go and I can email him and call his wife who  talks or <br/>\nIMs with him every day, and he&#39;s 23. <br/>\n <br/>\n-=-=-=-<br/>\n <br/>\nI&#39;m glad he&#39;ll be home soon! I can&#39;t imagine what you&#39;ve been through.<br/>\n <br/>\n-=-=-=-<br/>\n <br/>\n The dad of this boy who ran  away at 15 <br/>\ndoesn&#39;t have those options, and no matter how mainstream his  parenting was, I <br/>\nthink he deserves to know if someone knows where his son  is.  <br/>\n <br/>\n-=-=-=-<br/>\n <br/>\nI think it&#39;s kind to let him know the child is safe. The *child* obviously felt he was OUT of options. His parents did that.<br/>\n <br/>\n-=-=-=-<br/>\n <br/>\nBut I agree that the letter points up some very sad misunderstandings on  the <br/>\nfather&#39;s part, and I hope he is so relieved when he gets his son back that  <br/>\nhe finally understands.<br/>\n <br/>\n-=-=--=<br/>\n <br/>\nYeah---that would be nice. But I doubt it&#39;ll happen. The letter to his son is very telling. It&#39;s sad, and there&#39;s no way to go back and change what&#39;s happened. But telling the boy that they&#39;ve sacrificed so much for him is pretty shitty. It would make *me* want to stay away forever.<br/>\n <br/>\nWe only get one chance to make our children&#39;s childhoods magical. To shame him into coming home??? Wouldn&#39;t work on me. I&#39;d just be more resentful.<br/>\n <br/>\nBarb, I hope that it all works out well and that he&#39;s safe and happy. Maybe give the dad a copy of Rue&#39;s book???<br/>\n <br/>\n  <br/>\n <br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153458693,"authorName":"Barb Lundgren","from":"Barb Lundgren &lt;barb.lundgren@...&gt;","profile":"barb_lundgren","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: OT: Missing Homeschooled Teenager","postDate":"1132689568","msgId":110137,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGQThENEMwLkQzNjYlYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGNkLjM0MjIyN2VlLjMwYjRjZTM1QGFvbC5jb20+"},"prevInTopic":110136,"nextInTopic":110138,"prevInTime":110136,"nextInTime":110138,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"I don t agree that someone who reads this list couldn t find or help find this boy.  I first heard of this on this list and it has caused me to think of the","messageBody":"<div id=\"ygrps-yiv-1130942450\">I don&#39;t agree that someone who reads this list couldn&#39;t find or help find<br/>\nthis boy.  I first heard of this on this list and it has caused me to think<br/>\nof the unschool friends I have in the northwest and email the information to<br/>\nthem, thinking it may be possible that their teens have heard of him and his<br/>\nplight.  I will make phone calls as well.<br/>\n<br/>\nLike Sandra, I would not turn him in either if I found him.  I might simply<br/>\nlet the father know he was seen (but not say where) and that he is ok or has<br/>\na message for his family, or whatever the boy asked for.  The fact that you<br/>\nchose to let the announcement go through to your list in the first place<br/>\nshould now be followed up with a discussion, if one occurs.<br/>\n<br/>\nI like to think that unschoolers make up some sort of community of folks,<br/>\ndespite whatever geographic distance exists between us, that allows us to<br/>\nhelp and comfort one another.  The fact that this boy may not have been an<br/>\nunschooler, but rather a homeschooler, is an irrelevant point to me.<br/>\n<br/>\nJust because Sandra says her kids would never run away from home does not<br/>\nmean that they never would, nor that other unschool kids wouldn&#39;t.  Life is<br/>\ntoo complex, with too many variables, to make predictions that involve<br/>\n&#39;never&#39;.  I too empathize with the son... but also with the parents.  I<br/>\nagree that this list supports such tenets as unconditional love, respect for<br/>\nthe unique learning styles of each child, good communication vs. top-down<br/>\ndiscipline, etc.  How is this relevant however to the fact that a family in<br/>\nour broad homeschool community is in crisis and needs help?<br/>\n<br/>\nBarb Lundgren<br/>\nE-mail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a><br/>\n<br/>\n&quot;Whatever you can do, or dream you can do, begin it.  Boldness<br/>\nhas genius, power, and magic in it.&quot;   Goethe<br/>\n<br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nDate: Tue, 22 Nov 2005 14:40:37 EST<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 11/22/05 12:22:42 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I know this man personally who is looking for his son and I have just<br/>\n&gt; learned firsthand that this is unfortunately true.-=-<br/>\n&gt; <br/>\n </span></blockquote>I didn&#39;t doubt that it was true, but it&#39;s not the purpose of this list to<br/>\nfind runaways in Seattle.<br/>\nThe fact that they know he&#39;s going to Seattle shows he&#39;s not a &quot;missing<br/>\nperson,&quot; but now that authorities are alerted, he will probably hide and be<br/>\nthat <br/>\nmuch harder to find.<br/>\n<br/>\nNone of our readers in other states or in other countries or on other<br/>\ncontinents can help find this boy.   Those few in Washington probably won&#39;t<br/>\nhappen on <br/>\nhim.   If I were one of them and if I did I would offer him assistance and I<br/>\nwould suggest he let his parents know he was okay (or I would) but I would<br/>\nnot <br/>\nturn him in to the sheriff&#39;s department.<br/>\n<br/>\nThe post came and my option as the first moderator to come upon it was to<br/>\nlet <br/>\nit through or return it to the sender.   I let it through because it seemed<br/>\ncold not to, but in light of unschooling and what the father revealed on his<br/>\npublic website which he ASKED be shared, I feel some sympathy for the son.<br/>\n<br/>\nThis is a list clearly marked and intended for discussing unschooling, and<br/>\nanything brought to the list is up for discussion in an unschooling light.<br/>\nThat&#39;s why the list exists.<br/>\n<br/>\n-=-4. If you have a belief or practice that you don&#39;t want held up to public<br/>\nexamination, don&#39;t post it to the list.-=-<br/>\n<br/>\nIf one of my sons ran away and left enough information that I knew where he<br/>\nwas going, I wouldn&#39;t call the police at the other end and say &quot;I want him<br/>\nbrought back.&quot;   I would wait for him to contact me; I would leave<br/>\ninformation <br/>\nwith his friends about places he might be able to get help at his point of<br/>\ndestination.     There&#39;s no reason, though, for my sons to run away and<br/>\nthat&#39;s an <br/>\nimportant part of this whole package of parenting and unschooling.    It&#39;s<br/>\nTHEIR <br/>\nHOUSE too. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rebellion\">http://sandradodd.com/rebellion</a><br/>\n<br/>\nThat page needs some more work before it&#39;s announced to the list of folks<br/>\nwho <br/>\nwant site news, but I think the ideas are important to share with any family<br/>\ninterested in having stronger relationships with their children.<br/>\n<br/>\nCertainly there are millions and millions of parents who think these ideas<br/>\nare just wrongheaded and that they have the right and duty to be harsh on<br/>\ntheir <br/>\nkids, and to nag them and such.   They DO have that right.   But there are<br/>\nconsequences for people&#39;s choices.   They have the right to choose other<br/>\nways, <br/>\ntoo.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nVisit the Unschooling website and message boards:<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt;<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132689466","msgId":110135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4LjYxYjI5YmZiLjMwYjRkMjNhQGFvbC5jb20+"},"prevInTopic":110134,"nextInTopic":110136,"prevInTime":110134,"nextInTime":110136,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/22/2005 1:42:05 PM Central Standard Time, SandraDodd@aol.com writes: If I  were one of them and if I did I would offer him assistance and","messageBody":"<div id=\"ygrps-yiv-502040853\">In a message dated 11/22/2005 1:42:05 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nIf I  were one of them and if I did I would offer him assistance and I <br/>\nwould  suggest he let his parents know he was okay (or I would) but I would <br/>\nnot  <br/>\nturn him in to the sheriff&#39;s department. <br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nReally?  I wonder if you could be charged with holding him or  something?<br/>\n <br/>\nFifteen is still a minor, and I wouldn&#39;t want to be in a position of being  <br/>\ncharged with contributing to the delinquency of a minor or maybe a trumped up  <br/>\ncharge of holding him against his will or whatever.  What if he wanted to  <br/>\nstay with me but didn&#39;t want me to call his parents?  I would give him  every <br/>\nopportunity to make contact himself before I did so, and I&#39;d have a  deadline.  I <br/>\nhave sympathy for the kid, but I also have sympathy for his  parents, who <br/>\nmust be heartsick with worry.<br/>\n <br/>\nMy son&#39;s in Iraq and could be killed at any moment and I wouldn&#39;t know how  <br/>\nor where for a long time.  I would want someone to tell me as soon as  <br/>\npossible, if they knew something about him that I wouldn&#39;t otherwise know.   He&#39;ll be <br/>\nhome for good next month, and then I will finally exhale and won&#39;t be  <br/>\nmentioning it again, but for 18 months he has been in the forefront of my mind  at <br/>\nall times.  He choose to go and I can email him and call his wife who  talks or <br/>\nIMs with him every day, and he&#39;s 23.  The dad of this boy who ran  away at 15 <br/>\ndoesn&#39;t have those options, and no matter how mainstream his  parenting was, I <br/>\nthink he deserves to know if someone knows where his son  is.  <br/>\n <br/>\nBut I agree that the letter points up some very sad misunderstandings on  the <br/>\nfather&#39;s part, and I hope he is so relieved when he gets his son back that  <br/>\nhe finally understands.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132688437","msgId":110134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkLjM0MjIyN2VlLjMwYjRjZTM1QGFvbC5jb20+"},"prevInTopic":110132,"nextInTopic":110135,"prevInTime":110133,"nextInTime":110135,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... I didn t doubt that it was true, but it s not the purpose of this list to find runaways in Seattle. The fact that they know he s going to Seattle shows","messageBody":"<div id=\"ygrps-yiv-183643257\">In a message dated 11/22/05 12:22:42 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I know this man personally who is looking for his son and I have just<br/>\n&gt; learned firsthand that this is unfortunately true.-=-<br/>\n&gt; <br/>\n </span></blockquote>I didn&#39;t doubt that it was true, but it&#39;s not the purpose of this list to <br/>\nfind runaways in Seattle.<br/>\nThe fact that they know he&#39;s going to Seattle shows he&#39;s not a &quot;missing <br/>\nperson,&quot; but now that authorities are alerted, he will probably hide and be that <br/>\nmuch harder to find.<br/>\n<br/>\nNone of our readers in other states or in other countries or on other <br/>\ncontinents can help find this boy.   Those few in Washington probably won&#39;t happen on <br/>\nhim.   If I were one of them and if I did I would offer him assistance and I <br/>\nwould suggest he let his parents know he was okay (or I would) but I would not <br/>\nturn him in to the sheriff&#39;s department.    <br/>\n<br/>\nThe post came and my option as the first moderator to come upon it was to let <br/>\nit through or return it to the sender.   I let it through because it seemed <br/>\ncold not to, but in light of unschooling and what the father revealed on his <br/>\npublic website which he ASKED be shared, I feel some sympathy for the son.<br/>\n<br/>\nThis is a list clearly marked and intended for discussing unschooling, and <br/>\nanything brought to the list is up for discussion in an unschooling light.   <br/>\nThat&#39;s why the list exists.<br/>\n<br/>\n-=-4. If you have a belief or practice that you don&#39;t want held up to public <br/>\nexamination, don&#39;t post it to the list.-=-<br/>\n<br/>\nIf one of my sons ran away and left enough information that I knew where he <br/>\nwas going, I wouldn&#39;t call the police at the other end and say &quot;I want him <br/>\nbrought back.&quot;   I would wait for him to contact me; I would leave information <br/>\nwith his friends about places he might be able to get help at his point of <br/>\ndestination.     There&#39;s no reason, though, for my sons to run away and that&#39;s an <br/>\nimportant part of this whole package of parenting and unschooling.    It&#39;s THEIR <br/>\nHOUSE too. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rebellion\">http://sandradodd.com/rebellion</a><br/>\n<br/>\nThat page needs some more work before it&#39;s announced to the list of folks who <br/>\nwant site news, but I think the ideas are important to share with any family <br/>\ninterested in having stronger relationships with their children.<br/>\n<br/>\nCertainly there are millions and millions of parents who think these ideas <br/>\nare just wrongheaded and that they have the right and duty to be harsh on their <br/>\nkids, and to nag them and such.   They DO have that right.   But there are <br/>\nconsequences for people&#39;s choices.   They have the right to choose other ways, <br/>\ntoo.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132686977","msgId":110131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJiMy4zZWM5NmMuMzBiNGM4ODFAYW9sLmNvbT4="},"prevInTopic":110129,"nextInTopic":110132,"prevInTime":110130,"nextInTime":110132,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... That s the favor I ll do him.   I ll leave him alone.   I do think it s a good thing to set out on the table for a day or two at this list, though, to ","messageBody":"<div id=\"ygrps-yiv-1335367616\">In a message dated 11/22/05 11:34:27 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I see I&#39;m not the only one who felt the urge to write the dad a  letter....<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>That&#39;s the favor I&#39;ll do him.   I&#39;ll leave him alone.   I do think it&#39;s a <br/>\ngood thing to set out on the table for a day or two at this list, though, to <br/>\nremind people that children CAN make their own choices even if you don&#39;t &quot;let <br/>\nthem.&quot;   Parents think they can command their children&#39;s presence and attention <br/>\nand service and gratitude, but it&#39;s not doable, and can backfire badly.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132683969","msgId":110129,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMwLjM0MjFhZmFlLjMwYjRiY2MxQGFvbC5jb20+"},"prevInTopic":110126,"nextInTopic":110131,"prevInTime":110128,"nextInTime":110130,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/22/2005 9:20:41 AM Central Standard Time, ddzimlew@juno.com writes: .   Father acknowledges the son felt pressured and nagged but then","messageBody":"<div id=\"ygrps-yiv-738205820\">In a message dated 11/22/2005 9:20:41 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<br/>\n.   Father acknowledges the son felt pressured and<br/>\nnagged but then goes on  justify that treatment and to say how much they<br/>\nneed him and how much  they&#39;ve given up for him.   <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nI see I&#39;m not the only one who felt the urge to write the dad a  letter....<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153458693,"authorName":"Barb Lundgren","from":"Barb Lundgren &lt;barb.lundgren@...&gt;","profile":"barb_lundgren","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: OT: Missing Homeschooled Teenager","postDate":"1132683358","msgId":110132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGQThCQzdELkQzNTklYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDIyNi4yMjhhM2EwLjMwYjRiNWFiQGFvbC5jb20+"},"prevInTopic":110131,"nextInTopic":110134,"prevInTime":110131,"nextInTime":110133,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"Unschoolers: I know this man personally who is looking for his son and I have just learned firsthand that this is unfortunately true.  Any help folks can offer","messageBody":"<div id=\"ygrps-yiv-611090754\">Unschoolers:<br/>\n<br/>\nI know this man personally who is looking for his son and I have just<br/>\nlearned firsthand that this is unfortunately true.  Any help folks can offer<br/>\nto find his son are greatly appreciated.<br/>\n<br/>\nBarb Lundgren<br/>\nE-mail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a><br/>\n<br/>\n&quot;Whatever you can do, or dream you can do, begin it.  Boldness<br/>\nhas genius, power, and magic in it.&quot;   Goethe<br/>\n<br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nDate: Tue, 22 Nov 2005 12:55:55 EST<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 11/22/05 8:08:33 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:patti.schmidt2@...\">patti.schmidt2@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Is there a part of the Dad&#39;s website that describes all of this? <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>The letter from the dad.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nVisit the Unschooling website and message boards:<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt;<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"7"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132682155","msgId":110126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyNi4yMjhhM2EwLjMwYjRiNWFiQGFvbC5jb20+"},"prevInTopic":110125,"nextInTopic":110129,"prevInTime":110125,"nextInTime":110127,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... The letter from the dad. [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-329525244\">In a message dated 11/22/05 8:08:33 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:patti.schmidt2@...\">patti.schmidt2@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Is there a part of the Dad&#39;s website that describes all of this? <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>The letter from the dad.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: OT: Missing Homeschooled Teenager","postDate":"1132672758","msgId":110125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMTIyLjA4MTkxOC4yOTY4LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":110124,"nextInTopic":110126,"prevInTime":110124,"nextInTime":110126,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"***Is there a part of the Dad s website that describes all of this? *** If you click on letter from dad (or something like that) in the upper left hand","messageBody":"<div id=\"ygrps-yiv-627310824\">***Is there a part of the Dad&#39;s website that describes all of this? ***<br/>\n<br/>\nIf you click on &quot;letter from dad&quot; (or something like that) in the upper<br/>\nleft hand corner you can read what the dad wrote to his son.<br/>\n<br/>\nI found it very sad.  Father acknowledges the son felt pressured and<br/>\nnagged but then goes on justify that treatment and to say how much they<br/>\nneed him and how much they&#39;ve given up for him.   <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":120206043,"authorName":"averyschmidt","from":"&quot;averyschmidt&quot; &lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: OT: Missing Homeschooled Teenager","postDate":"1132672001","msgId":110124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRsdmM2MStkZDJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI3ZS4zMzRkOC4zMGIzYzA0OUBhb2wuY29tPg=="},"prevInTopic":110118,"nextInTopic":110125,"prevInTime":110123,"nextInTime":110125,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"... work and ... success for ... Is there a part of the Dad s website that describes all of this?  When I go to the website I just see the information about","messageBody":"<div id=\"ygrps-yiv-300711\"><blockquote><span title=\"ireply\">&gt; I would not call <br/>\n&gt; the sheriff and help them return them to his parents, who make him <br/>\n </span></blockquote>work and <br/>\n<blockquote><span title=\"ireply\"> &gt; make him feel giuilty that they gave up careers and professional <br/>\n </span></blockquote>success for <br/>\n<blockquote><span title=\"ireply\"> &gt; him.<br/>\n<br/>\n </span></blockquote>Is there a part of the Dad&#39;s website that describes all of this?  When <br/>\nI go to the website I just see the information about him missing, <br/>\nnothing about his family background (except for the sheltered <br/>\ncomment).  Is there a link to something else?<br/>\n<br/>\nPatti</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] OT: Missing Homeschooled Teenager","postDate":"1132619337","msgId":110118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3ZS4zMzRkOC4zMGIzYzA0OUBhb2wuY29tPg=="},"prevInTopic":110117,"nextInTopic":110124,"prevInTime":110117,"nextInTime":110119,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"I thought for a while about whether to let this announcement through to the list, but after I read the dad s website, I thought I should. This information can","messageBody":"<div id=\"ygrps-yiv-1434432996\">I thought for a while about whether to let this announcement through to the <br/>\nlist, but after I read the dad&#39;s website, I thought I should.<br/>\n<br/>\nThis information can help people understand unschooling better, I think, or <br/>\nat least to appreciate the value of the kind of parenting we have long promoted <br/>\non this list, even in the face of criticism and rejection.<br/>\n<br/>\nOn a day when this boy is missing, I was saying yes to Marty who wanted to go <br/>\nand do something at 7:00 in the morning (I could have said no, but I said yes <br/>\nbecause it wasn&#39;t going to hurt anyone for him to stand in line for 18 hours <br/>\nto try to get an XBox 360).    On a day when a 16 year old who has been <br/>\nsheltered has run away, my 19 year old who has enjoyed huge amounts of freedom chose <br/>\nto sit down (in the restaurant where he&#39;s employed) after his shift ended <br/>\nwith me, his sister, and another unschooling family and talk for nearly an hour, <br/>\neven though there were cooler people, and friends his age, in the restaurant.<br/>\n<br/>\nChildren cannot choose to be with their families if they have no choice.<br/>\n<br/>\nThe relationships parents have with their children ARE important to the <br/>\nchildren&#39;s growth, learning and safety.   In not keeping my children sheltered, I <br/>\nhave children who voluntarily come home every night.   A life of pressure, <br/>\nnagging, pushing, guilt and sheltering has resulted in a teen who would rather <br/>\nrisk the dangers of traveling alone than to stay home.   If running away seems <br/>\nsafer and freer than being at home, perhaps there should have been a safer, <br/>\nfreer way for that family to live.<br/>\n<br/>\nIf I knew where Michael Thompson was and that he was safe, I would just write <br/>\nto his parents and tell them so.   I&#39;d probably send them some unschooling <br/>\nlinks, and then get a hateful e-mail, and that would be that.   I would not call <br/>\nthe sheriff and help them return them to his parents, who make him work and <br/>\nmake him feel giuilty that they gave up careers and professional success for <br/>\nhim.<br/>\n<br/>\nThough I do feel for his parent&#39;s and their fears, and I hope he&#39;s well and <br/>\nthat he contacts them, I hope the situation can be resolved without him being <br/>\nforced back into the same situation (or worse, as sometimes happens when <br/>\nrunaways return and are then grounded and shamed).<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234694333,"authorName":"Rosalind Guder","from":"Rosalind Guder &lt;rguder@...&gt;","profile":"rguder2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"OT: Missing Homeschooled Teenager","postDate":"1132603484","msgId":110117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlY2MzZTIwNTExMjExMjA0djQ4MWRhMjZhaDdkMTA5OWEzZDQxMzRkZmJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":110118,"prevInTime":110116,"nextInTime":110118,"topicId":110117,"numMessagesInTopic":0,"msgSnippet":"Forwarded from another list... I know this is off-topic, but if I were in this dad s position, I would want to get the word out any way possible. Rosalind ... ","messageBody":"<div id=\"ygrps-yiv-1391921520\">Forwarded from another list...<br/>\n<br/>\nI know this is off-topic, but if I were in this dad&#39;s position, I would want<br/>\nto get the word out any way possible.<br/>\n<br/>\nRosalind<br/>\n<br/>\n---------- Forwarded message ----------<br/>\nFrom: Ron Thompson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ron@...\">ron@...</a>&gt;<br/>\n<br/>\nwww.mike-thompson.org &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mike-thompson.org\">http://www.mike-thompson.org</a>&gt;<br/>\n<br/>\nPlease keep an eye out for this missing homeschooled teenage boy. He is<br/>\npossibly in Oregon or California. Last known destination was Portland<br/>\nOregon. He does not know Oregon, but does know Northern California. Much<br/>\nof our family lives in Northern in California. Also if any of you<br/>\nrunning web sites could post a link to this URL it would be greatly<br/>\nappreciated. Mike has never run away before and is not street wise. He<br/>\nhas lived a somewhat sheltered life. We do not know why he ran away, he<br/>\ntold his girlfriend it was not about his family or her. His family and<br/>\nfriends are very worried about him.<br/>\n<br/>\nThank you<br/>\nMike&#39;s Dad<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":16558,"nextTopicId":109995}}