{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Worth reading","postDate":"1054230501","msgId":71281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJmLjNhMzI1NzVkLjJjMDdhMWU1QGFvbC5jb20+"},"prevInTopic":71274,"nextInTopic":0,"prevInTime":71280,"nextInTime":71282,"topicId":71250,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/29/03 11:32:43 AM, shyrley.williams@verizon.net writes:  You re doing fine.  Carry on!","messageBody":"<div id=\"ygrps-yiv-720447157\">In a message dated 5/29/03 11:32:43 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shyrley.williams@...\">shyrley.williams@...</a> writes:<br/>\n<br/>\n&lt;&lt; Anyone want to join me up here on the soapbox? &gt;&gt;<br/>\n<br/>\nYou&#39;re doing fine.  Carry on!  Amen!<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":112038769,"authorName":"Shyrley","from":"Shyrley &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Worth reading","postDate":"1054228497","msgId":71274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFRDY0MDExLkREMjAyQTBAdmVyaXpvbi5uZXQ+","referencesHeader":"PDFkYy5hOWIwZjU1LjJjMDc4NGRlQGFvbC5jb20+"},"prevInTopic":71262,"nextInTopic":71281,"prevInTime":71273,"nextInTime":71275,"topicId":71250,"numMessagesInTopic":0,"msgSnippet":"... Yep http://edheretics.gn.apc.org/ That takes you to the main site where there are about 20 articles by Roland. They are all so good that I was tempted to","messageBody":"<div id=\"ygrps-yiv-1973641136\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is that online somewhere so I could link it to my site?<br/>\n<br/>\n </span></blockquote>Yep<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://edheretics.gn.apc.org/\">http://edheretics.gn.apc.org/</a><br/>\nThat takes you to the main site where there are about 20 articles by Roland. They are all so good that I was tempted to send them all to the list!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; And is &quot;script&quot; what we call &quot;printing&quot; here?<br/>\n&gt;<br/>\n&gt; &quot;Perhaps more pain is inflicted on children in the joined-up<br/>\n&gt;<br/>\n&gt; handwriting pursuit than any other. Yet printers print in script because it<br/>\n&gt; is clearer.&quot;<br/>\n&gt;<br/>\n&gt; Great article!  Thanks!<br/>\n<br/>\n </span></blockquote>Yup. script is printing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I&#39;d like to be able to send it on to others.  Someone just got all crazy<br/>\n&gt; defensive on the message board at unschooling.com about teaching cursive<br/>\n&gt; handwriting, but I&#39;m not sure she would be patient enough to tranlate joined-up as<br/>\n&gt; cursive and really THINK about it.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;ve never really understood this obsession with cursive. When Heather was in school they strated teaching it at 7 and her writing went from legible to illegible overnight. My boys, who spent much less<br/>\ntime in school have legible writing. Heather still hasn&#39;t thrown of school-thinking (even after 3 years at home) and I can barely read her writing.<br/>\nAs for *teaching* writing....arm soapbox...soapbox armed....that really bugs me. I&#39;ve watched people here, and in school, *making* their kids write and watched the tears and tantrums and the child&#39;s<br/>\nlove of exploring squiggles and writing evaporate. Yet the people doing it don&#39;t want to listen, they are following some external agenda of what kids *should* be doing at a certain age, always with a<br/>\ncompetative eye on other people&#39;s kids and they fail to see what coercian is doing to their children. Grrrrrrrrrrrr<br/>\nAnyone want to join me up here on the soapbox?<br/>\n<br/>\nShyrley, rant ambassador to the US<br/>\n:-)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Worth reading","postDate":"1054223160","msgId":71260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJiNTl2bys0a2loQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFRDYwNzkzLjQ4RjgwRjQ0QHZlcml6b24ubmV0Pg=="},"prevInTopic":71250,"nextInTopic":71262,"prevInTime":71259,"nextInTime":71261,"topicId":71250,"numMessagesInTopic":0,"msgSnippet":"I like it. copy, pasted, and printed for my education resources and theories notebook. :) HeidiC ... share... ... Handwriting","messageBody":"<div id=\"ygrps-yiv-931175416\">I like it. copy, pasted, and printed for my &quot;education resources and <br/>\ntheories&quot; notebook. :)<br/>\n<br/>\nHeidiC<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, Shyrley <br/>\n&lt;shyrley.williams@v...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; Article by Roland Meighan that was so interesting I thought I would <br/>\n </span></blockquote>share...<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Educational Heretics Press<br/>\n&gt; <br/>\n&gt; Pages from the Roland Meighan column in Natural Parent magazine<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; 4. Educational Superstitions of our time - Shakespeare, Maths and <br/>\n </span></blockquote>Handwriting<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Worth reading","postDate":"1054223070","msgId":71262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYy5hOWIwZjU1LjJjMDc4NGRlQGFvbC5jb20+"},"prevInTopic":71260,"nextInTopic":71274,"prevInTime":71261,"nextInTime":71263,"topicId":71250,"numMessagesInTopic":0,"msgSnippet":"Is that online somewhere so I could link it to my site? And is script what we call printing here? Perhaps more pain is inflicted on children in the","messageBody":"<div id=\"ygrps-yiv-802161171\">Is that online somewhere so I could link it to my site?<br/>\n<br/>\nAnd is &quot;script&quot; what we call &quot;printing&quot; here?<br/>\n<br/>\n&quot;Perhaps more pain is inflicted on children in the joined-up<br/>\n<br/>\nhandwriting pursuit than any other. Yet printers print in script because it <br/>\nis clearer.&quot;<br/>\n<br/>\nGreat article!  Thanks!<br/>\n<br/>\nI&#39;d like to be able to send it on to others.  Someone just got all crazy <br/>\ndefensive on the message board at unschooling.com about teaching cursive <br/>\nhandwriting, but I&#39;m not sure she would be patient enough to tranlate joined-up as <br/>\ncursive and really THINK about it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":112038769,"authorName":"Shyrley","from":"Shyrley &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Worth reading","postDate":"1054214035","msgId":71250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFRDYwNzkzLjQ4RjgwRjQ0QHZlcml6b24ubmV0Pg==","referencesHeader":"PDIwMDMwNTI5LjA1NTcyMC4xNDQ4LjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":71260,"prevInTime":71249,"nextInTime":71251,"topicId":71250,"numMessagesInTopic":0,"msgSnippet":"Article by Roland Meighan that was so interesting I thought I would share... Educational Heretics Press Pages from the Roland Meighan column in Natural Parent","messageBody":"<div id=\"ygrps-yiv-1683628008\">Article by Roland Meighan that was so interesting I thought I would share...<br/>\n<br/>\nEducational Heretics Press<br/>\n<br/>\nPages from the Roland Meighan column in Natural Parent magazine<br/>\n<br/>\n<br/>\n<br/>\n4. Educational Superstitions of our time - Shakespeare, Maths and Handwriting<br/>\n<br/>\nProfessor S. Bengu, The Minister of Education for South Africa, gave a keynote speech at a conference on democratic education<br/>\nlast May. In it explained his country&#39;s intention to move away from a bureaucrat-driven imposed curriculum towards a<br/>\nlearner-driven curriculum by 2005.<br/>\n<br/>\nThe enthusiasts for imposing a curriculum on the learners are often horrified at such heresy. &quot;What if the learners do not choose<br/>\nto learn Shakespeare?&quot; I always thought that Bertrand Russell gave the cool answer here, when he said: &quot;Shakespeare did not<br/>\nwrite with a view to boring school-children; he wrote to with a view to delighting his audiences. If he does not give you<br/>\ndelight, you had better ignore him.&quot;<br/>\n<br/>\nI always found comfort in this view, since I admit that, despite many visits to performances at Stratford-on-Avon, I can take or<br/>\nleave the bard. This does not mean I want to stand in the way of those who want to encounter Shakespeare, and for this reason, I<br/>\nfind that the work of John and Leela Hort in making the language of his plays intelligible, is well worth both parents and children<br/>\ninvestigating. With their love of the bard, Leela and John have spent their time and money producing the Inessential Shakespeare<br/>\nseries, &#39;shortened and simplified versions in modern English&#39;, a snip at £2-95 each. Five plays have been translated into modern<br/>\nEnglish so far, and the sixth, Hamlet, is in preparation ready.<br/>\n<br/>\nThe enthusiasts for imposing a curriculum on the learners are also worried by Maths. &quot;What if the learners do not choose to<br/>\nlearn Mathematics?&quot; Bertrand Russell, who should have a valid opinion since he was one of the world&#39;s most renowned<br/>\nmathematicians himself, had this to say on the matter: &quot;In universities, mathematics is taught mainly to men who are going to<br/>\nteach mathematics to men who are going to teach mathematics to ... Sometimes, it is true, there is an escape from this<br/>\ntreadmill. Archimedes used mathematics to kill Romans, Galileo to improve the Grand Duke of Tuscany&#39;s artillery, modern<br/>\nphysicists (grown more ambitious) to exterminate the human race. It is usually on this account that the study of<br/>\nmathematics is commended to the general public as worthy of State support.&quot;<br/>\n<br/>\nMaths is useful, however, if you are doing something like designing bridges, but the idea that we must all go through the Maths<br/>\nexperience to identify those who are good at it and need it later for specific tasks, is about as sound as saying we must all study<br/>\ndentistry to enable some expert dentists to emerge. When I was learning Maths at school, then teaching it in school myself, and<br/>\nthen watching my son learn it, the same heretical thought kept occurring, that surely there are better things we could all be doing<br/>\nthan this.<br/>\n<br/>\nIt is a common error to confuse mathematics with arithmetic, and so perhaps it is the latter that should be imposed? Again, Russell<br/>\nis a dissenter: &quot;Arithmetic ... is overvalued; in British elementary schools and it takes up far more of the time than it should.<br/>\nHe goes on to propose that there are much more useful things to learn. Russell admitted that although he was a leading<br/>\nmathematician and philosopher, he was never much good at arithmetic himself.<br/>\n<br/>\nIt is another common error to think industry has &#39;needs&#39; that can be &#39;covered&#39;. A colleague who was a Maths tutor, conducted a<br/>\nsurvey of the &#39;needs&#39; of hundreds of firms around Birmingham. When I asked him what he had found, he said, &quot;Total confusion.&quot;<br/>\nHe could not find any common requirements in mathematics, and the common ground as regards arithmetic amounted to<br/>\nknowledge and confidence in the four basic rules. This squares with my own experience because when I left school at 16 and<br/>\nwent work in a bank, my &#39;O&#39; level Maths proved to be pretty useless and I had to learn the number games of the bank on the spot.<br/>\n<br/>\nOne home-educating family, where the father was an engineer, asked me at a conference what to do about Maths. I ran through<br/>\nthe arguments. They decided it was a superstition, and to have the courage to ignore it unless it cropped-up in the course of other<br/>\ninvestigations. Later they said how pleased they were with this policy and how well it had worked out in practice. But then, with<br/>\nCD-ROM interactive discs now available that will teach you &#39;O&#39; level Maths in a quarter or less of the time of a taught course, you<br/>\ncan take the subject on board whenever you wish.<br/>\n<br/>\nIf I believed in compelling people to learn things, which I no longer do since I advocate the learner-driven/catalogue curriculum<br/>\napproach instead, I could make out a much better case for teaching Logic which is usually missing from the curriculum altogether.<br/>\nBut it was Paul Goodman, in a book that shocked people in 1962 entitled Compulsory Mis-education, who described mass<br/>\nschooling, including its imposed mathematics, as a mass superstition.<br/>\n<br/>\nThe enthusiasts for imposing a curriculum on the learners are also worried by joined-up handwriting. &quot;What if the learners do not<br/>\nchoose to learn joined-up handwriting?&quot; I must admit to being much more worried if they do not develop the skills of joined-up<br/>\nthinking that learning logic encourages, but that is another issue. Perhaps more pain is inflicted on children in the joined-up<br/>\nhandwriting pursuit than any other. Yet printers print in script because it is clearer. Natural Parent would be hard work to read if<br/>\nit were presented in handwriting<br/>\n<br/>\nNobody shows much enthusiasm for joined-up figures in sums either, and would see anyone as a bit odd for suggesting it. John<br/>\nHolt in his investigations could find no reasons on offer except a claim that joined-up handwriting was speedier. He showed that<br/>\nthis usually was a fallacy by conducting a number of classroom experiments and by experimenting on himself. Usually, script was<br/>\nas quick or often quicker, more legible and looked better. Those who chose to learn Italic script produced very attractive results.<br/>\n<br/>\nIn discussion recently, one handwriting enthusiast told me that the body movements used in the teaching of it were essential for the<br/>\ncomposed development of children. This was her justification for teaching handwriting. If this is so, why not teach the body<br/>\nmovements on their own without the clutter?<br/>\n<br/>\nThe enthusiasts for imposing learning on children in school do not have a good track record. There were earlier superstitions. For a<br/>\ntime they tried to make all left-handed children become right-handed, with a heavy punishment regime. Drill was imposed as a<br/>\nsubject on all children for many years. Children in Welsh-speaking areas of Wales were punished if they did not speak in English in<br/>\nschool. Later compulsory Welsh appeared in English-speaking parts of Wales and I have met adults who resented this being<br/>\nenforced on them as children. And so on.<br/>\n<br/>\nPart of the task of &#39;parents as researchers&#39; that I advocated in a previous edition of Natural Parent, is to be on the look-out for<br/>\nlearning systems based on possible superstitions and get equipped to answer them and deal with them. In later editions I intend to<br/>\nanalyse two big superstitions - &#39;socialisation&#39;, and then &#39;subjects&#39;.<br/>\n<br/>\nThe Inessential Shakespeare website<br/>\n<br/>\nThe Inessential Shakespeare Series is available from 239 Bramcote Lane, Wollaton, Nottingham NG8 2QL Telephone<br/>\n0115 928 3001 for a brochure.<br/>\n<br/>\n A version of this piece was published in Natural Parent in April 1998, as the Roland Meighan column, entitled &#39;The three<br/>\n                                             myths&#39;.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":58868,"nextTopicId":71283}}