{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":255893983,"authorName":"Laura Endres","from":"&quot;Laura Endres&quot; &lt;piscesgrrl@...&gt;","profile":"intuitiongrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] TV and focus","postDate":"1141871376","msgId":112621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNDAwMWM2NDMyMSQ1MDIyODg2MCQxOWNjOTQwY0BFbmRyZXM+","referencesHeader":"PDAwMDIwMWM2NDAwNSQxNjNhOTUzMCQ5NDhiZmVhOUBNVVNJQ1JPT00+"},"prevInTopic":112543,"nextInTopic":0,"prevInTime":112620,"nextInTime":112622,"topicId":112543,"numMessagesInTopic":0,"msgSnippet":"... I was just discussing this with some friends today, about how my 9 yo son absorbs things, even when it appears (according to schoolish standards, I guess)","messageBody":"<div id=\"ygrps-yiv-2120679769\"><blockquote><span title=\"ireply\">&gt; Ok.  This is really bugging me.  It is from the article in the latest Life Learning Magazine.<br/>\n&gt; &quot;Nurturing Your Child&#39;s Ability to Focus&quot; by Naomi Aldort.<br/>\n&gt; <br/>\n&gt; TV is listed as one of the &quot;common robbers of children&#39;s innate ability to focus...&quot;  <br/>\n<br/>\n<br/>\n </span></blockquote>I was just discussing this with some friends today, about how my 9 yo son absorbs things, even when it appears (according to schoolish standards, I guess) he is not.  He likes &quot;number challenges&quot; on rare occasions, asks me to give them to him, and he does them in his head.  While he figures the answers, he walks in circles around the table, tapping his head with a pencil.  It&#39;s almost a rhythmic pace, a very deliberate walk with occasional pauses.  This may go on for 10 or more minutes.  I once mistook it for confusion and asked, &quot;Do you want a hint?&quot;  His reply was to yell an immediate, &quot;NO!!!  I&#39;m DOING it!&quot;  <br/>\n<br/>\nAnother example, the other day he said he wanted to watch Cats, the musical, for the first time.  He put it on in his bedroom and snuggled in bed for a short while, but after that he began wandering in and out of his room, and seemed to be doing other things instead.  I thought perhaps he wasn&#39;t enjoying the video, but didn&#39;t pay much attention.  However, later that day, he was singing a large portion of lyrics from varying songs, and was naming which cats he liked best and why.  I had watched it only once and could only hum one or two songs, but no lyrics (except Memories, which I already knew)!  He has an ability to focus and multi-task that I may never have.  <br/>\n<br/>\nI just don&#39;t think &quot;focusing&quot; is something we can measure or determine or gauge in another.<br/>\n<br/>\nLaura in IL<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":81672136,"authorName":"One of the Wechts","from":"&quot;One of the Wechts&quot; &lt;scott-wecht@...&gt;","profile":"momo3kaj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"TV and focus","postDate":"1141529286","msgId":112543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDIwMWM2NDAwNSQxNjNhOTUzMCQ5NDhiZmVhOUBNVVNJQ1JPT00+"},"prevInTopic":0,"nextInTopic":112621,"prevInTime":112542,"nextInTime":112544,"topicId":112543,"numMessagesInTopic":0,"msgSnippet":"Ok.  This is really bugging me.  It is from the article in the latest Life Learning Magazine. Nurturing Your Child s Ability to Focus by Naomi Aldort. TV is","messageBody":"<div id=\"ygrps-yiv-566966733\">Ok.  This is really bugging me.  It is from the article in the latest Life Learning Magazine.<br/>\n&quot;Nurturing Your Child&#39;s Ability to Focus&quot; by Naomi Aldort.<br/>\n<br/>\nTV is listed as one of the &quot;common robbers of children&#39;s innate ability to focus...&quot;  <br/>\n<br/>\nI must present 3 cases to the contrary...<br/>\n<br/>\nMy 17 yos watched a lot of TV/videos as a child. He probably had some restrictions, by default, because he was in school till he was 12.  I actually have a video of him playing with toys, and the TV is on in the &quot;background. &quot; So much for the &quot;passive state&quot;.  This child could focus on anything for hours, like trains, cars, dinosaurs, puzzles, drawing etc.  He still can as a teen.  Sometimes he is playing PC games (which I suspect would not count because of those fast moving pictures).    Sometimes he is creating maps or characters or a storyline or histories for his D & D world. Other times he is painting Warhammer. Sometimes, he has been know to read a series of books for days! <br/>\n<br/>\nMy 13yos is growing up with no limits on TV/screen time.  When he was little, he watched his share of Thomas the Tank Engine and Disney videos.  We even had cable then, with cartoon network and all the regular stuff including PBS.  Now as a teen, he focuses in front of a computer screen for hours, editing his movies. (Maybe that does not count either.)  But, making these claymation movies take hours and hours of intense detailed work with clay and light and sets and sound... When he is not engrossed in movie making, he may be found with his brother painting Warhammer, or on his own learning a new song on the piano. (The most recent one is Hungary Rhapsody.)  Finally, at the end of the day, he is often found listening to French language tapes.<br/>\n <br/>\nI must admit that my 10yod is the toughest case.  She definitely watches more TV than anyone now.  She even watches and plays Gameboy at the same time.  Lack of focus or just multi-talented?  She focuses on a book tape and colors at the same time.  Lack of focus or multi-tasking?  Those maybe &quot;suspect&quot;, but she can also focus on elaborate beanie baby games for hours.  Other times, she can be found focusing intently on the tasks of drawing creatures and designing dungeons for her next turn as a DM.  And one of her nighttime favorites is pouring over an I Spy book for what seems like hours (cause those things give me a head ache).<br/>\n<br/>\nNo matter how flashy or how quickly the picture changes in a TV show, if it is boring, my kids turn it off or tune it out. They always have.<br/>\n<br/>\nLack of focus equals lack of interest at my house. Period.  Not TV trauma!<br/>\n<br/>\nBeth in MD<br/>\n( Getting ready to watch a fast-paced rapidly-changing movie my son and his friend made. So there ! )<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":112618,"nextTopicId":48982}}