{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2630","postDate":"1037305436","msgId":49773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMjc2LTNERDQwNjVDLTU3MkBzdG9yZWZ1bGwtMjM3Ny5wdWJsaWMubGF3c29uLndlYnR2Lm5ldD4=","inReplyToHeader":"VW5zY2hvb2xpbmctZG90Y29tQHlhaG9vZ3JvdXBzLmNvbSdzIG1lc3NhZ2Ugb2YgMTQgTm92IDIwMDIJMTQ6NTY6MzkgLTAwMDA="},"prevInTopic":49739,"nextInTopic":0,"prevInTime":49772,"nextInTime":49774,"topicId":49739,"numMessagesInTopic":0,"msgSnippet":"We had a huckster who came by with a truck full of fruits, vegtables, gum and candy - ice cream too! We used to get the fudgesicles that as soon as they were","messageBody":"<div id=\"ygrps-yiv-753722670\">We had a huckster who came by with a truck full of fruits, vegtables,<br/>\ngum and candy - ice cream too! We used to get the fudgesicles that as<br/>\nsoon as they were in the heat would form a thin sheet of ice on them -<br/>\nwatch that tongue. They were SO good. Can&#39;t find that kind any more.<br/>\nFire balls. Bubble gum. Umm. We had the Hood man come with milk and<br/>\njuice. A nice man came with a truck load of donuts and breads. We use to<br/>\ntease grandma to buy the powder sugar donuts and the cardboard container<br/>\nfull of little cookies - I liked the ones made of coconut and the ones<br/>\nwith the little red jelly that was hard and chewy in the middle. We<br/>\nwould swim for hours in my grandmothers pond. It was so big people for<br/>\nmiles around came to swim, too. I spent hours and hours there as a child<br/>\ncatching fish - some the size of quarters - little sunfish or bluegills.<br/>\nI would dig in the muck where ever I saw a little hole and find a crab<br/>\nto toss into a bucket full of pollywogs, frogs, baby turtle the size of<br/>\nquarters, etc. My hair would end up the same color as my tan. We would<br/>\nice skate in the winter. Have a bonfire. Pop popcorn over the open fire<br/>\nwith my grandmothers old popcorn popper - long handle with black box at<br/>\nthe end made of metal. She used to call the fry pans, spiders. I didn&#39;t<br/>\nget that the first time she asked me for one! She had a huge flower<br/>\ngarden and a goldfish pond. A creek ran in back of her house. Fresh mint<br/>\nand horseradish grew in it. We used to go sledding there in the winter -<br/>\nslidding along the bank and down another and ending up on the frozen<br/>\ncreek. I would walk on that creek in the dead of winter with boughs hung<br/>\nheavily with snow - so peaceful and quiet. In the summer she grew<br/>\nhyacynth, lily of the valley along it&#39;s banks. Sweet william and<br/>\nhollyhocks. She had a grape arbor with huge purple grapes - green on the<br/>\ninside with seeds. A crabapple tree. A tree with little red pears that<br/>\nturned yellowish when ripe. Pear trees lined our driveway - the big<br/>\ngreen pears that turned yellow when ripe - so many bees came then! Her<br/>\nfront yard was big enough to invite many kids over to play baseball.<br/>\nThat was where I had my first crush on Bob Barnes - red haired young man<br/>\nwho was more interested in tuning his first car than play ball - died in<br/>\nthe VietNam war. So many cherished memories... Like the Waltons. Only we<br/>\ngot beat and molested. Thank God for the wonderful land where I grew up<br/>\n- central New York. Gosh I miss it now. Not there anymore when John<br/>\nGlenn (astronaut) Blvd. was made. The state tried to say my grandmothers<br/>\nland was a cess pool. Good thing she had pictures - went to court - got<br/>\nmoney. She never acted uppity about it. She always shared the land. She<br/>\nmade lousy oatmeal cookies though - the woman couldn&#39;t cook:) Blessings,<br/>\nMichele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":90421708,"authorName":"LsMe@aol.com","from":"LsMe@...","profile":"katielouba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2630","postDate":"1037287425","msgId":49739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRhLjIwYjhkZjhiLjJiMDUxYTAxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":49773,"prevInTime":49738,"nextInTime":49740,"topicId":49739,"numMessagesInTopic":0,"msgSnippet":"Mary: Thanks for the memory! I m from Buffalo originally, and I haven t thought about running to the milk machine for my mom in years! My memories are very","messageBody":"<div id=\"ygrps-yiv-806219999\">Mary: Thanks for the memory! I&#39;m from Buffalo originally, and I haven&#39;t <br/>\nthought about running to the &quot;milk machine&quot; for my mom in years! My memories <br/>\nare very vague, since I was really small, but very pleasant.<br/>\n<br/>\nLinda <br/>\n<br/>\nIn a message dated 11/14/02 9:58:18 AM Eastern Standard Time, From: &quot;mary <br/>\nkrzyzanowski&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meembeam@...\">meembeam@...</a>&gt;<br/>\n<br/>\nMy &gt; dh remembers milk vending machines on street corners of Buffalo, NY.  I&#39;d <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; love it if milk was delivered to my door daily, it would save me the late <br/>\n&gt; night/early morning trips just to get milk.<br/>\n&gt; Mary-NY<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49765,"nextTopicId":49696}}