{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: ASSISTED LIVING, ETC...","postDate":"1091910796","msgId":97414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMTUzQzhDLjIwNzA4MDlAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDIwMDQwODA0MTYxNTQ0LjI2ODEucW1haWxAd2ViMjA3MDMubWFpbC55YWhvby5jb20+","referencesHeader":"PDIwMDQwODA0MTYxNTQ0LjI2ODEucW1haWxAd2ViMjA3MDMubWFpbC55YWhvby5jb20+"},"prevInTopic":97313,"nextInTopic":0,"prevInTime":97413,"nextInTime":97415,"topicId":97302,"numMessagesInTopic":0,"msgSnippet":"**We have paths through all her stuff (which I have tried to clean but she refuses because she claims SHE needs to go through it all). ** There was a Dr. Phil","messageBody":"<div id=\"ygrps-yiv-899131567\">**We have paths through all her stuff (which I have tried to clean but <br/>\nshe refuses because she claims SHE needs to go through it all). **<br/>\n<br/>\nThere was a Dr. Phil episode aired this summer about a family dealing <br/>\nwith a grandma with a hording OCD behavior.  It looked unbearably hard <br/>\nto deal with.  On the drphil.com website there might be resources and <br/>\ndiscussion about this topic (linked to this episode). <br/>\n<br/>\nIt seems that people who keep really broken down trash have something <br/>\ngoing on in their brains that impairs their judgement.  Likely, it is <br/>\nnot possible to reason with them.  So, please don&#39;t blame yourself when <br/>\nyour mom won&#39;t let you help.<br/>\n<br/>\nBest wishes,<br/>\nBetsy</div>","specialLinks":[]},{"userId":100122184,"authorName":"Lisa M. Cottrell Bentley","from":"&quot;Lisa M. Cottrell Bentley&quot; &lt;cottrellbentley@...&gt;","profile":"cottrellbentley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: ASSISTED LIVING, ETC...","postDate":"1091731020","msgId":97311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMTI3RTRDLjEwODA1MDVAY294Lm5ldD4=","inReplyToHeader":"PDIwMDQwODA0MTYxNTQ0LjI2ODEucW1haWxAd2ViMjA3MDMubWFpbC55YWhvby5jb20+","referencesHeader":"PDIwMDQwODA0MTYxNTQ0LjI2ODEucW1haWxAd2ViMjA3MDMubWFpbC55YWhvby5jb20+"},"prevInTopic":97302,"nextInTopic":97313,"prevInTime":97310,"nextInTime":97312,"topicId":97302,"numMessagesInTopic":0,"msgSnippet":"... With all that stuff, you could probably quit your job and spend time selling it all on ebay and make some good money for quite a while. Spend your","messageBody":"<div id=\"ygrps-yiv-884419026\"><blockquote><span title=\"ireply\">&gt; We have paths through all her stuff (which I have tried to clean but she refuses because she claims SHE needs to go through it all).  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>With all that stuff, you could probably quit your job and spend time <br/>\nselling it all on ebay and make some good money for quite a while. <br/>\nSpend your afternoons holding up objects for your Mom to say &quot;sell&quot;, <br/>\n&quot;give to so-and-so&quot;, etc.  Maybe a live auction if you don&#39;t want to <br/>\nsort it  yourself?  If your Mom understands the financial situation <br/>\nproperly, she might be game for something like this (and she would feel <br/>\nlike she is contributing!).<br/>\n<br/>\n-Lisa in AZ</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: ASSISTED LIVING, ETC...","postDate":"1091729801","msgId":97313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDQwODA0MTYxNTQ0LjI2ODEucW1haWxAd2ViMjA3MDMubWFpbC55YWhvby5jb20+"},"prevInTopic":97311,"nextInTopic":97414,"prevInTime":97312,"nextInTime":97314,"topicId":97302,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-556041648\">&lt;&lt;&lt;Also, since I am moving in January it wouldn&#39;t make sense to get a loan<br/>\nthat I would be responsible for and unable to pay while paying rent, etc...<br/>\nAdditionally, I don&#39;t want any legal troubles with my father since the house<br/>\nis in his name and her name.  He is currently incarcerated and when he gets<br/>\nout my mom plans on divorcing him.  I don&#39;t want him suing me because I<br/>\nsigned for a loan etc...  Lastly, I will be getting married in about a year<br/>\nand do not want to take anymore debt into my marriage than I already have.<br/>\nI don&#39;t think that&#39;s fair to do to my fiancee. <br/>\n<br/>\n[snip] My daughter is with my mom right now.  I don&#39;t know what I will do<br/>\nwhen I move.  I am not sure my mom is &quot;healthy&quot; for her to be with anymore,<br/>\nand I don&#39;t know if I can afford child care while I am working. <br/>\n<br/>\n[snip] mom has a hard time seeing me as an adult too, and I feel like a kid<br/>\nbeing ordered around by her all the time.  I have even begun to feel like I<br/>\nhave no say in my daughter&#39;s life and care.  Nothing I ever do is &quot;right&quot; or<br/>\n&quot;good&quot;.  There is always something wrong ro missing that is all my<br/>\nresponsibility according to mom (i.e. I feed Bekka too much corn and peas<br/>\nwhich makes her overweight - but never mind my mom feeds her bologna and<br/>\nhotdogs for lunch all the time...).  There are gigantic boundary issues, and<br/>\nit gets worse. &gt;&gt;&gt;<br/>\n<br/>\nWell this is clearly a more complex situation than I understood when I made<br/>\nthe loan suggestion, and the taking in borders suggestion. To be honest I<br/>\nthink waiting to get your daughter out of a situation that is not only<br/>\nundermining unschooling, but is probably having a deleterious effect on your<br/>\nrelationship with your daughter and her personal growth, is a shame.<br/>\nDaughter&#39;s needs for freedom outweigh grandmother&#39;s needs to be in charge in<br/>\nmy philosophy. My fear is that your mother can&#39;t be trusted to not be<br/>\nundermining you constantly with your daughter. It could be making her<br/>\nstressed and conflicted.<br/>\n<br/>\nIt may not be your house, but it is currently your home, and your income is<br/>\nevidently making it possible for your mother to stay in her home. It may not<br/>\nbe your house, but your daughter is still legally and morally your<br/>\nresponsibility, not hers. If your mother can&#39;t treat you with respect as a<br/>\ndaughter, maybe she should treat you with respect as a guest. Or perhaps as<br/>\nher employer - in a sense you are paying her to be a childcare provider.<br/>\n<br/>\nI&#39;m kinda hesitant to say this but I will anyway ;) - I suppose there is a<br/>\ngenuine and top priority reason why you aren&#39;t marrying sooner, like at<br/>\nonce? What is magic about January to move, instead of, say, tomorrow. <br/>\n<br/>\n&lt;&lt;&lt;&lt;We used to have a good relationship, but between all the stuff she&#39;s<br/>\ndealing with emotionally and us living on top of each other it has become<br/>\nimpossible to maintain a well-defined relationship.  I have often thought<br/>\nthat maybe things would be different if I had my own place.  Even if she<br/>\neventually moved in, it would be &quot;MY&quot; place, and perhaps I would have more<br/>\nof a backbone when it comes to finances, house, child, etc... &gt;&gt;&gt;&gt; <br/>\n <br/>\nI&#39;m a pessimist about people changing emotionally and spiritually when there<br/>\nis no internal reason for doing so. I bet she would be exactly the same,<br/>\nexcept that she might call her interference &quot;advice&quot;. Chances are you would<br/>\nfeel even more put upon because it is your house. But as I said, I&#39;m a<br/>\npessimist.<br/>\n<br/>\nWould your mother do any reading about respectful parenting or unschooling?<br/>\nI have had some success with my mother sending her articles from the kind of<br/>\nsources on the internet she respects about different issues. She may<br/>\ncontinue to disagree, but at least she knows I am not just making this stuff<br/>\nup out of the air.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.732 / Virus Database: 486 - Release Date: 7/29/2004</div>","specialLinks":[]},{"userId":184936771,"authorName":"Ali Kat","from":"Ali Kat &lt;sweetgypsiedncer@...&gt;","profile":"sweetgypsiedncer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: ASSISTED LIVING, ETC...","postDate":"1091636144","msgId":97302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODA0MTYxNTQ0LjI2ODEucW1haWxAd2ViMjA3MDMubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDEwOTE2MTY2MjUuNDYwLjQwOTI1Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":97311,"prevInTime":97299,"nextInTime":97303,"topicId":97302,"numMessagesInTopic":0,"msgSnippet":"Robyn, Your suggestions are good.  A home equity loan will not work - neither one of us has the finances (I make $10.30 an hour for 3 people...) and neither","messageBody":"<div id=\"ygrps-yiv-1121622681\">Robyn,<br/>\n<br/>\nYour suggestions are good.  A home equity loan will not work - neither one of us has the finances (I make $10.30 an hour for 3 people...) and neither one of us has credit for it anyways.  Also, since I am moving in January it wouldn&#39;t make sense to get a loan that I would be responsible for and unable to pay while paying rent, etc...  Additionally, I don&#39;t want any legal troubles with my father since the house is in his name and her name.  He is currently incarcerated and when he gets out my mom plans on divorcing him.  I don&#39;t want him suing me because I signed for a loan etc...  Lastly, I will be getting married in about a year and do not want to take anymore debt into my marriage than I already have.  I don&#39;t think that&#39;s fair to do to my fiancee.<br/>\n<br/>\nMy mother refuses to consider renting out... she&#39;s afraid of people ruining the house, smoking, etc.  ALSO it is in no condition to have anyone there.  We have paths through all her stuff (which I have tried to clean but she refuses because she claims SHE needs to go through it all).  Heck... you have to dump water in the toilet tank to flush it because it isn&#39;t hooked up to water lines, we only have 1 working phone jack, and the electrical is something to be desired between missing light fixtures and non-working outlets...  I try, but there&#39;s only so much I can do at a time.  I think it&#39;s all a mental thing for my mom, and there&#39;s nothing I can do about it.  It&#39;s getting worse, not better.  It has begun to negatively affect my daughter and I don&#39;t want that at all for her.  The whole thing is a mess.  <br/>\n<br/>\nAssisted living would be nice, but she&#39;d also do fine in a small apartment of her own where she didn&#39;t have to worry about anything.  It&#39;s just getting her to consider those options that seems impossible.  <br/>\n<br/>\n*****<br/>\nIt is obvious that your daughter *needs* more<br/>\nattention from you.  What does she do/where is she<br/>\nwhen you are working?  <br/>\n<br/>\ntrying to keep up with the reading,<br/>\nJennefer in Oregon<br/>\n*************<br/>\n<br/>\nMy daughter is with my mom right now.  I don&#39;t know what I will do when I move.  I am not sure my mom is &quot;healthy&quot; for her to be with anymore, and I don&#39;t know if I can afford child care while I am working.  I am looking into potential assistance, but I may not qualify for much with my income.  I am trying to find something that I may be able to do from home as far as work goes.  I find it hard to focus on my daughter with the 101 things going on at home that need done and the constant voice of my mother in my head (or my ears...)<br/>\n<br/>\n<br/>\nMy mom has a hard time seeing me as an adult too, and I feel like a kid being ordered around by her all the time.  I have even begun to feel like I have no say in my daughter&#39;s life and care.  Nothing I ever do is &quot;right&quot; or &quot;good&quot;.  There is always something wrong ro missing that is all my responsibility according to mom (i.e. I feed Bekka too much corn and peas which makes her overweight - but never mind my mom feeds her bologna and hotdogs for lunch all the time...).  There are gigantic boundary issues, and it gets worse.  It&#39;s beyond frustrating.  We used to have a good relationship, but between all the stuff she&#39;s dealing with emotionally and us living on top of each other it has become impossible to maintain a well-defined relationship.  I have often thought that maybe things would be different if I had my own place.  Even if she eventually moved in, it would be &quot;MY&quot; place, and perhaps I would have more of a backbone when it comes to finances, house, child, etc...  <br/>\n<br/>\nI just don&#39;t know.<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - Send 10MB messages!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":97411,"nextTopicId":24417}}