{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] My opinions,,","postDate":"1093371056","msgId":20461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0LjVlYTlmMzg2LjJlNWNkZWIwQGFvbC5jb20+"},"prevInTopic":20459,"nextInTopic":0,"prevInTime":20460,"nextInTime":20462,"topicId":20457,"numMessagesInTopic":0,"msgSnippet":"OOOPS.  VERY sorry to have sent a blank. In a message dated 8/24/04 11:50:42 AM, mozafamily@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1194012747\">OOOPS.  VERY sorry to have sent a blank.<br/>\n<br/>\nIn a message dated 8/24/04 11:50:42 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mozafamily@...\">mozafamily@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I don&#39;t think that it&#39;s <br/>\n<br/>\nwhat we call ourselves that is as important as how we treat our <br/>\n<br/>\nchildren. &gt;&gt;<br/>\n<br/>\nI agree.  One thing I know I did do, a year or so ago maybe, was to decline <br/>\nto agree that anyone who is registered with any public school program is no <br/>\nlonger homeschooling.  I think if kids are home and not having to do lessons and <br/>\nare with their moms, it doesn&#39;t bother me if they&#39;re signed up with an <br/>\numbrella school, or a school program in California or British Columbia (wasn&#39;t that <br/>\nwhere it was?) so they can get funding for big stuff like lessons and pianos.   <br/>\nI only care about their freedom and how the learning takes place.<br/>\n<br/>\nThose programs are very rare anyway.  But for where my interest and passion <br/>\nlie, I would be more supportive of a natural-learning situation with state <br/>\nfunding than of a family who is NOT at all enrolled in a state program but they <br/>\nmight a well be because the kids are forced to &quot;do school,&quot; often WORSE than <br/>\nschool would have done.   I regret it when I think that anything I have ever done <br/>\nmade it easier for a family to command a child to STAY at that table and read <br/>\nthis revisionist history or that &quot;creationist science.&quot;<br/>\n<br/>\nI care about how children learn, not about what their relationship to the <br/>\nstate is.<br/>\n<br/>\nAnd for making a statement like that last one, I probably lost value in some <br/>\nquarters.  That&#39;s okay.  I went to school.  I know exactly how to do what the <br/>\nteacher (supervisor, editor) wants.  I know how to compromise myself to get an <br/>\nA.   Integrity is more important to me, though.  Through the years when <br/>\npeople have asked me to do this, or that, organization, board, politics, I&#39;ve <br/>\nalways said &quot;I only care about unschooling.&quot;    And it&#39;s still true.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] My opinions,,","postDate":"1093370526","msgId":20459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkOC4yOWQxOGIwOC4yZTVjZGM5ZUBhb2wuY29tPg=="},"prevInTopic":20458,"nextInTopic":20461,"prevInTime":20458,"nextInTime":20460,"topicId":20457,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/24/04 11:50:42 AM, mozafamily@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1427752852\">In a message dated 8/24/04 11:50:42 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mozafamily@...\">mozafamily@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I don&#39;t think that it&#39;s <br/>\n<br/>\nwhat we call ourselves that is as important as how we treat our <br/>\n<br/>\nchildren. &gt;&gt;</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] My opinions,,","postDate":"1093370502","msgId":20458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwLjQzMmIzZTQxLjJlNWNkYzg2QGFvbC5jb20+"},"prevInTopic":20457,"nextInTopic":20459,"prevInTime":20457,"nextInTime":20459,"topicId":20457,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/24/04 11:50:42 AM, mozafamily@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-519525520\">In a message dated 8/24/04 11:50:42 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mozafamily@...\">mozafamily@...</a> writes:<br/>\n<br/>\n&lt;&lt; In my opinion if you give your child an assignment in <br/>\n<br/>\nthe morning then they&#39;re NOT unschooling! SO far I think this is the <br/>\n<br/>\nONLY list I belong to that this is not a problem. If your child HAS <br/>\n<br/>\nto do their math and reading before they can go to the park then <br/>\n<br/>\nthey&#39;re NOT unschooling! &gt;&gt;<br/>\n<br/>\nYes, it gave me a chill just reading it.<br/>\nThe Barq&#39;s ice cream float pop thing probably helped.<br/>\n<br/>\nBut honestly, I shuddered.  Poor kids.  Poor kids.<br/>\n<br/>\nAnd poor overall reputation of unschooling.    <br/>\n<br/>\n-=- If it were not for the internet then I wouldn&#39;t know <br/>\n<br/>\nwhat AP is - They should start a media campain or something - -=-<br/>\n<br/>\nWho would pay for it?  There&#39;s no money to be made, no products to sell them, <br/>\nwhen you&#39;re telling people  &quot;just hold them.&quot;<br/>\n<br/>\nIn fact, the stronger such things get, the more the OTHERS advertise.  <br/>\nFormula, bottle, crib manufacturors don&#39;t want parent discouraging each other from <br/>\nNEEDING that stuff.<br/>\n<br/>\nWe were supposed to babysit today for the little girl we kept last Spring a <br/>\nlot.  She&#39;s nearly 13 months old now.   8:10 a.m. I got a call saying she <br/>\nwouldn&#39;t be here.  Bummer.    It was going to be out last time for a long time or <br/>\nforever, and I wanted to take a photo of her and Holly for Holly to keep.    <br/>\nBut her parents bring her with toys we don&#39;t use, a pacifier we don&#39;t use, and <br/>\nteething tablets we don&#39;t use.   At home, apparently, they consider all these <br/>\nthings necessary.     Holly has asked me WHY they use them or think we need <br/>\nthem.<br/>\n<br/>\nBut...<br/>\nIt is very labor-intensive to do things our way here, which is to hold her, <br/>\nplay with her on the floor, take her wherever we&#39;re going so she can see, let <br/>\nher touch things.  It&#39;s tiring.  But she doesn&#39;t need a pacifier.   <br/>\n<br/>\nOh well.<br/>\nWe can&#39;t change the whole world at once. &lt;g&gt;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":99936689,"authorName":"mozafamily","from":"&quot;mozafamily&quot; &lt;mozafamily@...&gt;","profile":"mozafamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"My opinions,,","postDate":"1093369756","msgId":20457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnZnYycytyMmZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":20458,"prevInTime":20456,"nextInTime":20458,"topicId":20457,"numMessagesInTopic":0,"msgSnippet":"So much stuff to talk about and so little time... First - Congratulations Sandra! on your article in the first Live Free learn Free Magazine, I got my copy","messageBody":"<div id=\"ygrps-yiv-1172897009\">So much stuff to talk about and so little time...<br/>\nFirst - Congratulations Sandra! on your article in the first &quot;Live <br/>\nFree learn Free&quot; Magazine, I got my copy yesturday and it&#39;s looking <br/>\nnice although yours was the only article I have actually had the <br/>\ntime to complete yet, seems like a nice resource overall though. <br/>\nSecond - I live in MO where compulsory age is 7-16 - My ds is only 6 <br/>\nso again this year I am lucky enough to not to HAVE to keep a log of <br/>\nhis &quot;hours, classes, courses, etc.&quot; not that any of those mean he <br/>\nlearned anything anyways! I am against compulsory schooling <br/>\naltogether now that I  understand it more, or schooling in any <br/>\nmatter that forces the coersion of the child I am against!<br/>\nThird - We refer to ourselves as &quot;homeschoolers&quot; because if I <br/>\nsay &quot;unschoolers&quot; people first ask if that is legal and then still <br/>\nbe totally confused about it. I dislike anything with the <br/>\nword &quot;school&quot; in it because of what school represents to me. IF they <br/>\nas for details I state we are Child-Led learners - which we are! <br/>\nLuckily that term is a little more self explanatory. <br/>\nFourth - With it being &quot;back to school&quot; time I am frankly <br/>\noverwhelmed with the amount of people, even people who claim to <br/>\nbe &quot;unschoolers&quot; talking about their lessons, textbooks and <br/>\nassignments. In my opinion if you give your child an assignment in <br/>\nthe morning then they&#39;re NOT unschooling! SO far I think this is the <br/>\nONLY list I belong to that this is not a problem. If your child HAS <br/>\nto do their math and reading before they can go to the park then <br/>\nthey&#39;re NOT unschooling! So mabye I don&#39;t know what unschooling is <br/>\nas much as what it is NOT. As you can tell I am feeling overwhelmed <br/>\nby this, I was just feeling a little more comfortable in my beliefs <br/>\nwhen all of these people who claimed to be unschooling apparently <br/>\nare clueless to what that really is - in my opinion. <br/>\nFifth - Also having a BIG problem with people who push thier child <br/>\ninto &quot;school&quot; early. Like I stated in my state compulsory age isn&#39;t <br/>\nuntil 7, so why are people starting their &quot;Lessons&quot; at 4 or earlier -<br/>\n I talked to another mom who has a daughter my son&#39;s age last week, <br/>\nshe said she kept logs last year and this year so she could <br/>\nget &quot;used&quot; to doing them, but then she went off into the curriculum <br/>\nchoices that they gave her as well! Urgh - having a choice also <br/>\nmeans you can choose NOT to use any curriculum! I am NOT looking <br/>\nforward to having to prepare a log of my sons &quot;hours&quot; because I feel <br/>\nit is an invasion of our privacy, to have these just in case - to <br/>\nhave them to &quot;prove&quot; that my son is learning - Urgh why don&#39;t you <br/>\nsit down and have a conversation with him!!! Another homeschooler <br/>\nnearby has a child one year younger than ours - they are obsessed <br/>\nwith &quot;lessons&quot;, that their child can do all these thing that are <br/>\nhigh for her age, that if she ever were to have to be &quot;placed&quot; in <br/>\nschool that she would certainly enter at a grade or two ahead of the <br/>\nothers her age. It is so sad that things are corrupted so much! <br/>\nAnyhow as I stated we call what we do &quot;child-led learning&quot; because <br/>\nif my child doesn&#39;t want it then we don&#39;t do it. I am trying to <br/>\nstart a small support network of likeminded people but it is really <br/>\nhard to find people who &quot;get it&quot; about their children (Get it in the <br/>\nmeaning of Jan Hunt - that they believe that what a child thinks is <br/>\nimportant). I wish I would have known about AP when my child was <br/>\nyoung, as it was I held him almost constantly and was often told <br/>\nto &quot;put him down before you spoil him&quot; and if I fell asleep nursing <br/>\nthen I would wake in a scare &quot;I could have killed my child by <br/>\nnursing him in bed with me!&quot; and unfortuantely I suffured from PPP <br/>\nand it took me awhile to stand up to most of the family that I <br/>\nwanted to not work and stay at home with my child and we could make <br/>\nour &quot;payments&quot; still fine - And have proved as much time after time <br/>\nover the last 6 years! Unfortunately I didn&#39;t stop working until my <br/>\nmilk had started to dry from the 8 hours away from my baby, and <br/>\nbeing I was a poor milker without any support (another story - <br/>\nurgh)  I wish I had another chance to nurse but that is another <br/>\nstory as well. If it were not for the internet then I wouldn&#39;t know <br/>\nwhat AP is - They should start a media campain or something - <br/>\nperhaps if parents started out with their children close then they <br/>\nwould have a harder time sending them to the hands of strangers in <br/>\ndaycare and schools. <br/>\nSorry that I am rambling so much - apparently I just had a lot of <br/>\nget out - I feel better now. So to recap I don&#39;t think that it&#39;s <br/>\nwhat we call ourselves that is as important as how we treat our <br/>\nchildren. Moza</div>","specialLinks":[]}],"prevTopicId":20387,"nextTopicId":20470}}