{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":203597060,"authorName":"janethamlin@sbcglobal.net","from":"&lt;janethamlin@...&gt;","profile":"jefhdvm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: children within us","postDate":"1104285385","msgId":101862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzYwMWM0ZWQ0OSQ5YjI2NGFiMCQwYjAxYThjMEBKQU5FVEhBTUxJTj4=","referencesHeader":"PDExMDQyODUwMDYuMzA5LjExMjA4Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":101826,"nextInTopic":0,"prevInTime":101861,"nextInTime":101863,"topicId":101826,"numMessagesInTopic":0,"msgSnippet":"Sylvia and Sandra, thanks for these reminders as I try to help my husband.  We re going through a major rough patch with our marriage right now and this is","messageBody":"<div id=\"ygrps-yiv-594488122\">Sylvia and Sandra, thanks for these reminders as I try to help my husband.  We&#39;re going through a major rough patch with our marriage right now and this is encouraging me to reach out to meet his needs and temporarily overlook my needs to see if we can help each other meet both of our needs, if that makes sense.<br/>\n<br/>\nJanet<br/>\n<br/>\n  Maybe I&#39;m misunderstanding what is meant by &quot;an equal - a partner, a friend, and a lover.&quot;  Sometimes one person in any couple or friendship is needier than another, and withholding compassion because he just shouldn&#39;t need it seems cruel.<br/>\n<br/>\n  Inside every adult of any gender are the memories and fears and needs of the child he or she was.  Inside every other adult is the capacity to blow that by or to acknowledge it.<br/>\n<br/>\n  Sandra<br/>\n   <br/>\n  ******<br/>\n   <br/>\n  Thanks for saying this, Sandra.  I think, too often, people get locked into feeling like it&#39;s not okay to give support to other adults.  The flip side is that too many of us don&#39;t feel okay asking for support when we need it.  <br/>\n   <br/>\n  I can&#39;t think of anyone I know who doesn&#39;t have some moments of need.  And some need more compassion, or more care, more often than others.  Usually they&#39;re genuinely more hurt, long-term, and really need that support, space and kindness to heal and become whole people.<br/>\n   <br/>\n  In a marriage, in good or bad times, doing what one can to help support and maybe heal your partner&#39;s pain is always a good thing.  In all we do, we&#39;re examples to our kids.  Also, no matter how the adults feel about each other, your spouse (or ex-spouse) will always be the other parent to your children.  Isn&#39;t it better to reach out and help your children&#39;s father?  It may be just what he needs to become the father your children deserve, and it shows them how to be compassionate to others.  It also can help everyone involved to see how childhood pain, or even last week&#39;s pain, affects today, and how healing it can save tomorrow.  <br/>\n   <br/>\n  Sylvia<br/>\n   <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] children within us","postDate":"1104244197","msgId":101826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNi41MzNlMGM5Ni4yZjAyYzdlNUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":101862,"prevInTime":101825,"nextInTime":101827,"topicId":101826,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/28/2004 9:17:06 A.M. Eastern Standard Time, SandraDodd@aol.com writes: Maybe  I m misunderstanding what is meant by an equal - a","messageBody":"<div id=\"ygrps-yiv-45373097\">In a message dated 12/28/2004 9:17:06 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nMaybe  I&#39;m misunderstanding what is meant by &quot;an equal - a partner, a friend, <br/>\nand  a lover.&quot;  Sometimes one person in any couple or friendship is needier  <br/>\nthan another, and withholding compassion because he just shouldn&#39;t need it  <br/>\nseems <br/>\ncruel.&lt;&lt;&lt;&lt;<br/>\n <br/>\nBen and I have tried to realize that, at times, we would each need to play  <br/>\nthe role of parent, child, partner, or friend to the other&#39;s opposite. <br/>\nSometimes  I need to be a child and have Ben act more as a father figure. Sometimes he <br/>\n needs me as a mom. Sometimes we need to be partners---at others, we need to <br/>\nplay  devil&#39;s advocate. <br/>\n <br/>\nNo one is saying that you need to &quot;mother&quot; your husband all the time. But  he <br/>\nmay have needs sometimes that need a mom&#39;s touch every now and then. Other  <br/>\ntimes, he needs to play the role of a father-figure to *you*. Mostly, you&#39;re  <br/>\npartners/equals.<br/>\n <br/>\nAssuming we can be on equal footing all the time doesn&#39;t take into  <br/>\nconsideration the day your own mom dies or the day he loses his job or just the  <br/>\noccasional &quot;really bad, horrible, terrible, no-good day&quot; when he needs more  hugs <br/>\nand a foot-rub. *That&#39;s* the mothering we&#39;re talking about. NOT turning him  <br/>\ninto a &quot;Peter Pan&quot;. But being catered to a bit when he needs it. Being  sensitive <br/>\nto his needs as well as your own and those of your children.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":101778,"nextTopicId":101823}}