{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"Ra70ed4c-UDZTjbrztaLEnQjxR-oEP6mSIyjsYkpsEF3WujhT1weZcF6A1pkFeNfn_XzXRRRYKvA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Responses at last  (long)","postDate":"986653369","msgId":18259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhLjEzNTZkNDJkLjI4MDA3Y2I5QGFvbC5jb20+"},"prevInTopic":18246,"nextInTopic":0,"prevInTime":18258,"nextInTime":18260,"topicId":18246,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/6/01 10:01:41 PM, yuliwomie@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1214825908\">In a message dated 4/6/01 10:01:41 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yuliwomie@...\">yuliwomie@...</a> writes:<br/>\n<br/>\n&lt;&lt; I&#39;ve known people like that, and the blanket and thumb haven&#39;t <br/>\nbeen a problem, really, except trying to convince her the blanket <br/>\nneeds washing when it smells. &gt;&gt;<br/>\n<br/>\nCan you just hang it outside on the line to let the sun &quot;sanitize it&quot; some <br/>\nwithout removing all the juju?<br/>\n<br/>\n&lt;&lt;Her brother does comment <br/>\ndisparagingly about it sometimes. &gt;&gt;<br/>\n<br/>\nI think the best thing you can do is persuade the brother to hush up totally. <br/>\n <br/>\nI hope he&#39;s not saying worse things when you&#39;re not around.<br/>\n<br/>\n&lt;&lt;We&#39;re really not a shaming or pressuring <br/>\nfamily at all. However, ds may make her feel shame when he lets her <br/>\nknow he thinks the blanket is gross.&gt;&gt;<br/>\n<br/>\nNo doubt.<br/>\nBut the question of what she&#39;d rather give up was really unfair, and <br/>\nshouldn&#39;t have been answered (shouldn&#39;t have been asked).  There can be <br/>\ninherent and subtle shaming (even about words which are allowed).  If the <br/>\nblanket she loves stinks (or even &quot;smells bad&quot;), that is shame.  IT stinks, <br/>\nor she herself MADE it stink.  And because of that stink it is (even <br/>\ntemporarily) taken away from her.<br/>\n<br/>\nMaybe she can sit out near it when it&#39;s on the line.<br/>\nIt can be called &quot;warmed up&quot; instead of &quot;aired out&quot; maybe, or...  I don&#39;t <br/>\nknow.  But if she loves the blanket it might make her feel better to think <br/>\nher family at least didn&#39;t hate the blanket, or had some respect for it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"yuliwomie@yahoo.com","from":"yuliwomie@...","replyTo":"LIST","senderId":"huAqO-aofsmTNRSkp1wpDqhPF4F2GW259I5z9S8FgCReRO2zNLsT8C5EyBveoAAnWviKkvOdi6FAqw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Responses at last  (long)","postDate":"986616052","msgId":18246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlhbTNkaysxZ29oQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":18259,"prevInTime":18245,"nextInTime":18247,"topicId":18246,"numMessagesInTopic":0,"msgSnippet":"I m finally sorting out all the great things people said in response to my post about Aubrey so I can answer some of the comments. ... Thanks! I ll look into","messageBody":"<div id=\"ygrps-yiv-1247707425\">I&#39;m finally sorting out all the great things people said in response <br/>\nto my post about Aubrey so I can answer some of the comments.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Aspergers, Autism, Tony Atwood, and bipolar.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Thanks! I&#39;ll look into this stuff. I know an Aspergers person, though <br/>\nand I really don&#39;t think that&#39;s Aubrey.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Have you been able to talk to your daughter since this happened? <br/>\n </span></blockquote>Is she withdrawn? Have you reassured her of your love? She may feel <br/>\nlike she betrayed you. Does your son realize how unfair his question <br/>\nwas? Why did he ask her that in the first place? Do you still notice <br/>\nthe mood swing periods since you have been homeschooling? Does she <br/>\ncommunicate her feelings much when she seems down? &lt;&lt;&lt;<br/>\n<br/>\nYes, we&#39;ve talked about it a couple times. No, she&#39;s  very &quot;up&quot; now <br/>\nintensely so. In fact, she lapsed into what I can only describe as <br/>\nmanic hysteria earlier. Yes, I&#39;m always telling her I love her. Yes, <br/>\nI talked to my son about asking the question. Today, probably because <br/>\nof the incident, Aubrey asked me out of the blue who I loved more, <br/>\nher or dh, her or ds, dh or ds? To each question I said I love both <br/>\nas much as I could possibly love anyone. Then she said it&#39;s the same <br/>\nfor her, with me and the blanket. Yes, the mood swings are unchanged <br/>\nsince homeschooling, even though she absolutely loves homeschooling. <br/>\nNo, when she&#39;s down, she withdraws and won&#39;t speak or interact. She <br/>\nhides in her room, curled up in a ball in bed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Maybe you could keep a mood journal of sorts and <br/>\n </span></blockquote>see if you notice a pattern or possibly something that triggers her <br/>\nmoods.&lt;&lt;&lt;<br/>\n<br/>\nThis is a fantastic idea, and I&#39;ve already started! Thanks!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;she never really did out-grow the thing&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>A lot of people wrote about older kids still needing blankets or <br/>\ndolls. I&#39;ve known people like that, and the blanket and thumb haven&#39;t <br/>\nbeen a problem, really, except trying to convince her the blanket <br/>\nneeds washing when it smells. It was the incident where my son <br/>\nquestioned her and I felt hurt and she went into a withdrawn stage <br/>\nthat was the problem, not the long-term blanket attachment itself.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;You are right to be concerned about how children can<br/>\n </span></blockquote>often be over-medicated these days. Maybe the day will come when she<br/>\ncould benefit from medication but I wouldn&#39;t think that day is <br/>\nhere.&lt;&lt;&lt;<br/>\n<br/>\nYes, I think I&#39;m feeling strong agreement with that at this point. <br/>\nSomeone mentioned someone who was like Aubrey and said it wasn&#39;t a <br/>\nproblem until he started self-medicating with alcohol and drugs. I <br/>\nguess if I see Aubrey heading in that direction, I&#39;ll consider <br/>\nmedication.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;If you become truly concerned with moodiness and unhappiness as<br/>\n </span></blockquote>time goes on perhaps experimenting with the herbal St. John&#39;s Wort <br/>\ncould indicate some change.&lt;&lt;&lt;<br/>\n<br/>\nI&#39;ve thought of that in the past, but I&#39;ve been hesitant because SJW <br/>\nmakes *me* burn to a crisp in the sun, and Aubrey has my skin. But <br/>\nmaybe I could start her on it in the fall when it&#39;s less sunny and <br/>\nsee if it helps.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Our 7yo, Owen, chews his clothes.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>A few people wrote about this. Both my kids chew their clothes until <br/>\nthere are holes in them. Actually, Erik (10yo ds) mostly stopped at <br/>\naround 9yo. It&#39;s not a big issue, except when I see something new <br/>\ngetting holes chewed into it. Then I just ask them to change clothes. <br/>\nBut her blankey is chewed, on and off, all day, every day, for the <br/>\npast 6 years, ever since she got teeth. In fact, most of the dye has <br/>\nbeen chewed out of it, and it&#39;s significantly smaller than it used to <br/>\nbe.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I would really hate to see them start to wonder if something <br/>\n </span></blockquote>is &quot;wrong with me&quot;. To me THAT is much more damaging &quot;Is something <br/>\nwrong with me?&quot; is a question that haunts many of us from our <br/>\nchildhood, and it breaks my heart when a child starts to wonder <br/>\nthis.&lt;&lt;&lt;<br/>\n<br/>\nThis really hit home. I keep thinking about it. I was always made to <br/>\nfeel there was something wrong with me as a kid. It was my parents&#39; <br/>\nstyle to be very critical and unaccepting. I hope that I haven&#39;t made <br/>\nAubrey feel this way. I&#39;m pretty sure she knows how wonderful I think <br/>\nshe is. She&#39;s self-confident and she likes herself, so she probably <br/>\ndoes. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;The first was that it sounds to me like your daughter&#39;s reaction <br/>\n </span></blockquote>may be more from feeling like she&#39;s being pushed to give up the <br/>\nblanket than how she separates her attachment to others.  She may be <br/>\nreluctant to admit that it&#39;s not as important as any other loved <br/>\nthing or person for fear it will mean she has to give it up.&lt;&lt;&lt;<br/>\n<br/>\nThis also hit home. I think you&#39;re right. She is always afraid when <br/>\nit&#39;s misplaced for a minute or two. Her brother does comment <br/>\ndisparagingly about it sometimes. I mean, it *IS* a very ugly, <br/>\ntattered thing, and it *DOES* smell sometimes. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;The good thing about homeschooling is that Aubrey won&#39;t HAVE <br/>\n </span></blockquote>teachers and counselors and other kids making her moods worse, or <br/>\nspotlighting them, or praising her for being &quot;up&quot;&lt;&lt;&lt;<br/>\n<br/>\nYes, I don&#39;t like when friends or relatives praise her for being <br/>\ncheerful. (Oh! I see you&#39;re in a better mood today! That&#39;s great!) I <br/>\nthink that&#39;s done less with boys, so it gets my feminist hackles up. <br/>\nI like to think that BOTH the up and down moods are still Aubrey, and <br/>\nI don&#39;t like it implied that a significant part of her personality is <br/>\nbad, or that she should pretend to be happy when she&#39;s feeling down. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I would recommend dealing gently with Aubrey in the moment.  It&#39;s <br/>\n </span></blockquote>possible that the dye and bacteria aren&#39;t as bad as the shaming and <br/>\npressure.   So because I was that way as a kid too, I teach him <br/>\ntricks which nobody thought to teach me.&lt;&lt;&lt;<br/>\n<br/>\nThis comment made me blush, because of the words &quot;shame&quot; <br/>\nand &quot;pressure.&quot; I&#39;m embarrassed to think I implied that I shame or <br/>\npressure her about her moods, her blanket, her thumb, or anything <br/>\nelse. We are the sort of family where, rather than forbid kids to <br/>\nswear, we tell them we don&#39;t believe certain words are inherently <br/>\nbad, but that name calling is hurtful and using certain words in <br/>\npublic offendes people who do believe they&#39;re bad.So we&#39;d rather they <br/>\nsay shit when they stub their toes than call someone a jerk. But that <br/>\nlots of people disagree, so saying shit in public isn&#39;t a good idea. <br/>\nThis is just an example. We&#39;re really not a shaming or pressuring <br/>\nfamily at all. However, ds may make her feel shame when he lets her <br/>\nknow he thinks the blanket is gross.<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;allergy-related behavioral issues.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>This is a very good point. We all have allergies and asthma. I <br/>\nbookmarked the website you mentioned to look at when I get a chance. <br/>\nThanks!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I&#39;d suggest maybe contacting La Leche League to see if they have <br/>\n </span></blockquote>the name of someone who is pro-attachment and can give you a balanced <br/>\nviewpoint on whether or not you should seek additional help&lt;&lt;&lt;<br/>\n<br/>\nThis is good advice I hadn&#39;t thought of. Thanks! I will do that.  <br/>\n<br/>\nThanks again to all of you, who amazed me with the time you were <br/>\nwilling to take to offer advice and support. I&#39;m SO glad I found this <br/>\ngroup!  Love and gratitude, Juli</div>","specialLinks":[]}],"prevTopicId":18247,"nextTopicId":17998}}