{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":158120320,"authorName":"Christine Ralston","from":"&quot;Christine Ralston&quot; &lt;lalsoong@...&gt;","profile":"lalsoong01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] DH&#39;s letter to a friend about Unschooling--LONG","postDate":"1067435190","msgId":83394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5ZDYwMWMzOWUyNiRlNTQwNTQxMCQ2NDAwYThjMEBjcm9zaXM+","referencesHeader":"PDAwZDIwMWMzOWMyMCRiYWI1YTlhMCQ2NDA3YThjMEBQcmVzYXJpbz4="},"prevInTopic":83289,"nextInTopic":0,"prevInTime":83393,"nextInTime":83395,"topicId":83268,"numMessagesInTopic":0,"msgSnippet":"Lisa, Thanks for sharing this letter.  It was very insightful.  You are lucky to have a husband who is so understanding and supportive. Christine","messageBody":"<div id=\"ygrps-yiv-895053200\">Lisa,<br/>\n<br/>\nThanks for sharing this letter.  It was very insightful.  You are lucky to<br/>\nhave a husband who is so understanding and supportive.<br/>\n<br/>\nChristine</div>","specialLinks":[]},{"userId":63347449,"authorName":"Odrade","from":"Odrade &lt;odrade7@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] DH&#39;s letter to a friend about Unschooling--LONG","postDate":"1067267026","msgId":83289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDI3MTUwMzQ2LjQxODUwLnFtYWlsQHdlYjQxNTA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNjcyMjAyODYuMjA2NS40MzgwNy5tMThAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":83281,"nextInTopic":83394,"prevInTime":83288,"nextInTime":83290,"topicId":83268,"numMessagesInTopic":0,"msgSnippet":"Thanks so much for sharing that! TreeGoddess __________________________________ Do you Yahoo!? Exclusive Video Premiere - Britney Spears ","messageBody":"<div id=\"ygrps-yiv-972304356\">Thanks so much for sharing that!<br/>\n<br/>\nTreeGoddess<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nExclusive Video Premiere - Britney Spears<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://launch.yahoo.com/promos/britneyspears/\">http://launch.yahoo.com/promos/britneyspears/</a></div>","specialLinks":[]},{"userId":150551601,"authorName":"Stepheny Cappel","from":"&quot;Stepheny Cappel&quot; &lt;stephc62@...&gt;","profile":"stephc621587","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: DH&#39;s letter to a friend about Unschooling--LONG","postDate":"1067228703","msgId":83281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZDEwMWMzOWM0MiQ0YzM0YTkwMCRhZDhlZDZkMUBzdGVwaGM2Mj4=","referencesHeader":"PGJuaTR0ZisxMDJ2cEBlR3JvdXBzLmNvbT4="},"prevInTopic":83280,"nextInTopic":83289,"prevInTime":83280,"nextInTime":83282,"topicId":83268,"numMessagesInTopic":0,"msgSnippet":"I sent this letter to my daughter who is also homeschooling her daughters.  I hoped you didn t mind.  It will stir up discussion about how she hates to make","messageBody":"<div id=\"ygrps-yiv-752978528\">I sent this letter to my daughter who is also homeschooling her daughters.  I hoped you didn&#39;t mind.  It will stir up discussion about how she hates to make them sit down and do things she has torn out of a workbook or whatever so she can say she did &quot;school&quot;.  She doesn&#39;t do it to them everyday because it&#39;s such a hassle.  Big surprise.  My mom often mentions my &quot;intelligence&quot; lol, which I know is from learning on my own the things I needed, wanted to know.  I quit high school, but did the ged thing and some college, I suppose she is surprised.  Thanks for sending this.  It&#39;s very good.  Stepheny<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] DH&#39;s letter to a friend about Unschooling--LONG","postDate":"1067227708","msgId":83280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOUM5QTNDLjYwNTAwMDZAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDAwZDIwMWMzOWMyMCRiYWI1YTlhMCQ2NDA3YThjMEBQcmVzYXJpbz4="},"prevInTopic":83278,"nextInTopic":83281,"prevInTime":83279,"nextInTime":83281,"topicId":83268,"numMessagesInTopic":0,"msgSnippet":"**What I m getting at with all of this is that schooling didn t work for me.  The pot of gold wasn t at the end of the rainbow.  Even if I had landed a $100k","messageBody":"<div id=\"ygrps-yiv-1572853204\">**What I&#39;m getting at with all of this is that schooling didn&#39;t work for<br/>\nme.  The pot of gold wasn&#39;t at the end of the rainbow.  Even if I had<br/>\nlanded a $100k job straight out of college, I don&#39;t think I would have<br/>\nbeen happy.  I still would have felt the need for the bigger house, the<br/>\nnewer computer, etc.  And I still would have been looking to others<br/>\n(coworkers and managers now) to give me the good grades to assure my<br/>\nworth. **<br/>\n<br/>\nHi, Lisa --<br/>\n<br/>\nThanks for sharing your husband&#39;s post.<br/>\n<br/>\nI think this part is really key.<br/>\n<br/>\nI&#39;ve just been reading Po Bronsons&#39;s book, What Should I Do With My <br/>\nLife, about people who are looking for fulfilling work.  I think one of <br/>\nthe things that makes career decisions so hard, is that for many years <br/>\nwe were all running on an educational treadmill with very few choices.<br/>\n<br/>\n**What&#39;s more - I don&#39;t<br/>\neven remember most of what I &quot;learned&quot;.**<br/>\n<br/>\nIn many subject areas, that&#39;s true for me as well.<br/>\n<br/>\n**But how can that be?  I got 100% on the test - that proves I learned it<br/>\nright?  The parts of it I do remember I had already learned on my own<br/>\nbefore it was &quot;taught&quot; to me, or I had an interest in already and would<br/>\nhave learned about it on my own.**<br/>\n<br/>\nYep.  The Emperor&#39;s Clothes are looking pretty transparent.<br/>\n<br/>\n**Or the characters and themes of<br/>\nDeath of a Salesman? **<br/>\n<br/>\nI don&#39;t think that particular play is relevant until you are middle aged.<br/>\n<br/>\n**What&#39;s this Turing machine<br/>\nthing I&#39;ve heard about in some of these books?   (computer science,<br/>\nbiography, World War II history, sociology (discrimination))**<br/>\n<br/>\nI&#39;ve seen a cool drama about Alan Turing on PBS, starring Derek Jacobi, <br/>\nI just don&#39;t remember the title.  Sounds like maybe your husband watched <br/>\nit or read the same (true) story.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"Sandra Dodd","from":"&quot;Sandra Dodd &quot; &lt;SandraDodd@...&gt;","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: DH&#39;s letter to a friend about Unschooling--LONG","postDate":"1067226863","msgId":83278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJuaTR0ZisxMDJ2cEBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDAwZDIwMWMzOWMyMCRiYWI1YTlhMCQ2NDA3YThjMEBQcmVzYXJpbz4="},"prevInTopic":83271,"nextInTopic":83280,"prevInTime":83277,"nextInTime":83279,"topicId":83268,"numMessagesInTopic":0,"msgSnippet":"That was really fun to read. I ve been realizing more and more lately how much I learned after school, in the library on my own for fun, from looking things up","messageBody":"<div id=\"ygrps-yiv-1670001314\">That was really fun to read.<br/>\n<br/>\nI&#39;ve been realizing more and more lately how much I learned after <br/>\nschool, in the library on my own for fun, from looking things up I&#39;d <br/>\nread about in novels, from stuff I read under the desk during class, <br/>\nfrom conversations with friends who knew things I didn&#39;t--and I got <br/>\ngreat grades, and the teachers kind of stretched and preened, like my <br/>\ngood grades proved they were good teachers.<br/>\n<br/>\nYour husband&#39;s letter was stirring some of that back up, but in a <br/>\ngood way.<br/>\n<br/>\nI  hope your friend reacts well and gets it!<br/>\n<br/>\nSandra<br/>\n-----------------------------------</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] DH&#39;s letter to a friend about Unschooling--LONG","postDate":"1067220157","msgId":83271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmIwMWMzOWMyZSQ2NTNiOWM2MCQ2NTAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PDAwZDIwMWMzOWMyMCRiYWI1YTlhMCQ2NDA3YThjMEBQcmVzYXJpbz4="},"prevInTopic":83268,"nextInTopic":83278,"prevInTime":83270,"nextInTime":83272,"topicId":83268,"numMessagesInTopic":0,"msgSnippet":"thanks! that was great! -cat ... From: Lisa M. Cottrell Bentley To: UnschoolingDiscussion@yahoogroups.com Sent: Sunday, October 26, 2003 7:24 PM Subject:","messageBody":"<div id=\"ygrps-yiv-1833120114\">thanks! that was great! <br/>\n<br/>\n-cat<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Lisa M. Cottrell Bentley <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Sunday, October 26, 2003 7:24 PM<br/>\n  Subject: [UnschoolingDiscussion] DH&#39;s letter to a friend about Unschooling--LONG<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":100122184,"authorName":"Lisa M. Cottrell Bentley","from":"&quot;Lisa M. Cottrell Bentley&quot; &lt;cottrellbentley@...&gt;","profile":"cottrellbentley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"DH&#39;s letter to a friend about Unschooling--LONG","postDate":"1067214287","msgId":83268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZDIwMWMzOWMyMCRiYWI1YTlhMCQ2NDA3YThjMEBQcmVzYXJpbz4="},"prevInTopic":0,"nextInTopic":83271,"prevInTime":83267,"nextInTime":83269,"topicId":83268,"numMessagesInTopic":0,"msgSnippet":"Hello, Unschooling List-  I m not a frequent contributor to this list, but I ve read every single e-mail that has gone through here for over a year.  My family","messageBody":"<div id=\"ygrps-yiv-1376719801\">Hello, Unschooling List-  I&#39;m not a frequent contributor to this list, but I&#39;ve read every single e-mail that has gone through here for over a year.  My family has officially been an Unschooling family since we first heard of the term &quot;Unschooling&quot;, but we&#39;d already been living the lifestyle for quite a while.  What I have chosen to send to the list today is a personal e-mail that my DH, Greg, sent to one of our close (single male) friends yesterday in regards to some of the questions that he has posed to both of us (via e-mail since we live far away from each other now) about Unschooling.  I have sent many e-mails to the friend in response.  However since we don&#39;t have a lot of male perspective on this list, I thought that this e-mail might be enjoyed as it shows DH&#39;s personal journey toward the Unschooling lifestyle that we now enjoy with our children.<br/>\n<br/>\n-Lisa in AZ<br/>\n---------------------------------------------------<br/>\nI&#39;ve been meaning to put down my thoughts on unschooling for some time<br/>\nnow. Unfortunately, I&#39;m a terrible procrastinator when it comes to<br/>\nwriting.<br/>\n<br/>\nFirst a bit of background about my own education.  It probably won&#39;t<br/>\nsurprise you to hear I was a straight A student clear through high<br/>\nschool.  I got all the right answers and did well on all the<br/>\nstandardized tests.  I was led to believe that to succeed in life you<br/>\nneeded to do well in grade school so you would be placed in the advanced<br/>\nclasses in junior high and the college prep classes in high school.  You<br/>\nhad to get good grades and score high on the SATs/ACTs to get into a<br/>\ngood college.  You had to get good marks there so you could get a good<br/>\n(i.e. high-paying) job.  You&#39;d then have loads of money so you could buy<br/>\nthe nice house, cars, assorted other toys to live happily.<br/>\n<br/>\nSo I followed the rules and got the good grades.  I did the reports,<br/>\nexercises, and projects.  In actuality, this consumed only a portion of<br/>\nmy time.  I generally did the assignments from one class during the next<br/>\nclass while the teacher lectured.  (They weren&#39;t saying much<br/>\ninteresting, and they said it all multiple times to assure everyone got<br/>\nit.)  After I&#39;d fulfilled the requirements, I then &quot;played&quot;.  This<br/>\nmostly consisted of solving puzzles, reading books, writing computer<br/>\nprograms, and experimenting with electronics kits.<br/>\n<br/>\nIn college, I always took at least 18 credit hours per semester (the<br/>\nmost allowed at ISU) in order to stay &quot;at the top&quot;.  I worked frenziedly<br/>\nto keep up with all the readings, papers, and projects, but I would<br/>\nstill sneak in some time for more &quot;play&quot;.  Now this consisted of<br/>\nexploring the VAX system, BITnet, the Internet, the campus network,<br/>\nnetwork programming, configuring and using a Linux system (version 0.99<br/>\nin those days), and some occasional late night DOOM sessions.<br/>\n<br/>\nWhen I graduated and it came time to look for a job, I was a bit<br/>\nsurprised to find that employers weren&#39;t exactly beating down my door. <br/>\nThe job market was a bit tighter than it had been a few years before,<br/>\nand employers seemed more impressed with coop&#39;ing experience and<br/>\ninterviewing skills than GPAs.  While I did get a fine job (and I very<br/>\nmuch enjoyed working at Microware), it was a bit of a disappointment<br/>\nthat I still had to watch money (had debt in fact) and couldn&#39;t buy the<br/>\nnice house, cars, etc. that I had felt I was promised by following the<br/>\nprescribed education paths.<br/>\n<br/>\nWhat I&#39;m getting at with all of this is that schooling didn&#39;t work for<br/>\nme.  The pot of gold wasn&#39;t at the end of the rainbow.  Even if I had<br/>\nlanded a $100k job straight out of college, I don&#39;t think I would have<br/>\nbeen happy.  I still would have felt the need for the bigger house, the<br/>\nnewer computer, etc.  And I still would have been looking to others<br/>\n(coworkers and managers now) to give me the good grades to assure my<br/>\nworth.  While I still can&#39;t say I have the secrets to eternal happiness,<br/>\nI have at least come to realize that bigger isn&#39;t necessarily better and<br/>\nthat I should be the one to judge how well I&#39;m doing.<br/>\n<br/>\nThe other thing I&#39;ve realized is that all those homework problems,<br/>\nreports, and projects didn&#39;t really do much for me.  I no longer have<br/>\nany of them.  None of them had any actual use.  What&#39;s more - I don&#39;t<br/>\neven remember most of what I &quot;learned&quot;.<br/>\n<br/>\nBut how can that be?  I got 100% on the test - that proves I learned it<br/>\nright?  The parts of it I do remember I had already learned on my own<br/>\nbefore it was &quot;taught&quot; to me, or I had an interest in already and would<br/>\nhave learned about it on my own.  The things that didn&#39;t interest me<br/>\n(and my bored, boring, uninspired teachers did nothing to make it<br/>\ninteresting), I memorized for the test and forgot quickly thereafter. <br/>\nIt&#39;s not that I conscientiously consigned the information to short-term<br/>\nmemory, it just never formed any connections with the long-term stuff<br/>\nrattling around in my brain.  What does the year of the French and<br/>\nIndian War have to do with anything?  Or the characters and themes of<br/>\nDeath of a Salesman?  Or the rules of badminton?  Or the capitol of<br/>\nCzechoslovakia?  None of them meant anything to me beyond checking the<br/>\nright answer on the test.<br/>\n<br/>\nBesides having no significance to me, the subjects were always strictly<br/>\ndelineated.  You didn&#39;t learn about the scientific discoveries (in any<br/>\ndepth) that Archimedes, Newton, or Franklin made in your history class. <br/>\n(BTW, I saw a fascinating show on PBS recently about how Archimedes may<br/>\nhave been developing integral calculus centuries before the rest of the<br/>\nworld knew about it.)  You didn&#39;t learn about math in science class (and<br/>\nthus weren&#39;t allowed to do too complicated of experiments).  You didn&#39;t<br/>\nlearn about the historical events taking place when novels were written<br/>\nin English class.  Everything is chopped into categories and furthermore<br/>\nyour time is chopped into periods.  You can&#39;t spend any more or less<br/>\ntime studying a topic than one hour.<br/>\n<br/>\nIn retrospect, the things that I truly learned (and still know to this<br/>\nday) are the things that I had a great interest in and learned inside<br/>\nout.  These were mostly the things I learned while &quot;playing around&quot;.  It<br/>\nwent something like this:  computers are fun - how do I program them  <br/>\nWhat&#39;s this stuff about binary and hexadecimal?  (math and logic)  How<br/>\ndo I make pictures on the screen? (art)  What&#39;s this Turing machine<br/>\nthing I&#39;ve heard about in some of these books?  (computer science,<br/>\nbiography, World War II history, sociology (discrimination))  My<br/>\nprogram&#39;s too slow.  Why and how do I make it faster?  (more computer<br/>\nscience, possibly getting down to the hardware which mean computer<br/>\nengineering, electrical engineering, and depending how far you want to<br/>\ntake it, Maxwell&#39;s electromagnetic equations and particle physics)<br/>\n<br/>\nI think you can see where I&#39;m heading with all of this.  Regimented<br/>\nschooling with its &quot;you&#39;ll learn this facts about this confined topic<br/>\narea for the next 60 minutes and then switch to a different confined<br/>\ntopic&quot; mentality doesn&#39;t have much lingering benefit.  It&#39;s like trying<br/>\nto fill a water bottle with a firehouse.  It&#39;s blasting all over the<br/>\nplace.  Sure some of it&#39;s going to go in, but most of it&#39;s going to wash<br/>\nright over you. To make matters worse, you&#39;ve got a different firehouse<br/>\nfor each topic.  If you follow your interests, it&#39;s more like a wet/dry<br/>\nvac that you stick into a barrel of water.  You&#39;re going to suck it all<br/>\nin and keep searching for more.<br/>\n<br/>\nOn the other side of the coin, schooling did leave some lasting ill<br/>\nimpressions.  Such as: others know better than you what&#39;s important;<br/>\ncompetition is all-important - you have to be the best; work isn&#39;t<br/>\nmeant to be fun - if it&#39;s fun, it&#39;s frivolous; always be conscious of<br/>\nwhat others think of you - don&#39;t make yourself stand out; learn your<br/>\nplace in the hierarchy and don&#39;t be too &quot;insubordinate&quot; - best to parrot<br/>\nback what the authority figure says.  I&#39;d much rather teach my children<br/>\n(or rather allow them to discover) that they are wonderful, intelligent<br/>\npeople capable of making their own decisions and not dependent upon<br/>\nother&#39;s approval for their self-worth.<br/>\n<br/>\nI&#39;ve been addressing the whole topic of home-schooling rather generally<br/>\nso far.  Let me address some of your specific concerns.  First, you<br/>\nmentioned a concern that an unschooled child would have to &quot;catch up&quot;<br/>\nlater on an area they were never exposed to earlier.  This is, of<br/>\ncourse, a possibility.  But think about when you&#39;re interviewing a<br/>\npotential new employee.  I think you&#39;re probably like me.  You&#39;ll want<br/>\nto know that they have the basic required knowledge (which nearly all<br/>\nthe applicants will), but you&#39;ll be more interested in if they can think<br/>\nthrough new problems and learn on their own.  You want someone who<br/>\ndoesn&#39;t get stymied by a new situation and doesn&#39;t need to run to others<br/>\nfor help all the time.  You want someone who can dig into the problem<br/>\nand _make_ himself/herself an expert.  That&#39;s the essence of<br/>\nunschooling.  Take an interest and examine the hell out of it.  Learn<br/>\nevery facet, then move on to the next thing.<br/>\n<br/>\nYou also mentioned having a sufficient breadth of knowledge.  There are<br/>\nbasically two parts to the answer of this.  First, is the digging around<br/>\nin all directions already mentioned.  This can lead to all sorts of<br/>\nthings that at first glance are completely unrelated.  Think about the<br/>\nlast time you looked something up in an encyclopedia.  You probably read<br/>\nthree or four other articles along the way to looking up what you were<br/>\nfirst looking for.  The other half of the answer is the parents.  This<br/>\nis the difference between real unschoolers and parents who just say<br/>\nthey&#39;re unschooling but are really just too lazy to follow a<br/>\ncurriculum.  An unschooling parent is continually (though not constantly<br/>\nand distractingly) exposing their children to new topics.  We buy them<br/>\nbooks (not text books) on a variety of topics - both fiction and<br/>\nnon-fiction, watch movies and TV shows with them, get them computer<br/>\nprograms, do arts and crafts with them, do experiments with them, and<br/>\nmost importantly talk with them.  Zoe is at an age now where she&#39;s<br/>\nreally fun to talk with.  She might want to make paper airplanes which<br/>\ncould lead to a discussion of the Wright brothers or DaVinci.  We were<br/>\ndriving in the car the other day and she asked about the lights on a<br/>\ntruck, and I explained about the various signals used when driving.  I<br/>\ntook her to work one day and told her a bit about what I was doing and<br/>\nshowed her how to cut-and-paste.  The conversations work both ways,<br/>\ntoo.  She showed Lisa and I how to pause the DVD player on Lisa&#39;s laptop<br/>\nusing the spacebar (so you don&#39;t have to waste time pulling up the menu<br/>\nand mousing to the right spot).  She told me the other day that turtles<br/>\nlive in water and tortoises live on land (which I didn&#39;t know).  Often<br/>\nI&#39;ll think of something interesting related to what we&#39;re doing and<br/>\nmention it to her only to have her tell me that yeah she knows and did I<br/>\nknow this other thing too?<br/>\n<br/>\nWe take our kids with us and involve them in nearly everything we do. <br/>\nThey learn not only from us, but also from the people we interact with<br/>\nand the situations we&#39;re in.  (Zoe helped the pool guy draw the arcs<br/>\non the ground to mark where our pool would go.)  If they don&#39;t discover<br/>\nsome topic through their interests or through their interactions with<br/>\nthe world, chances are the topic can wait.  Public school may expose<br/>\nchildren to a laundry list of topics that get thrown at them like darts<br/>\nat a dartboard, but how valuable is it to just know the name of a<br/>\ntopic?  If it is important, the bookstores carry &quot;What you 1st/2nd/Nth<br/>\ngrader should know&quot; which contains the laundry list.<br/>\n<br/>\nThis might have been more than you wanted to know, and I hope it didn&#39;t<br/>\ntake too much time out of your day to read it.  I think this is the<br/>\nlongest e-mail I&#39;ve ever sent to you.  :-)<br/>\n<br/>\n-gdb<br/>\n--------------------------------------------------------------------------<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":83344,"nextTopicId":83393}}