{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":147376218,"authorName":"liza sabater","from":"liza sabater &lt;listdiva@...&gt;","profile":"lm_sabater","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Labor Inducing hints.","postDate":"1074367646","msgId":89185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJFQTQ0NjAzLTQ5MjMtMTFEOC05NTIzLTAwMDM5M0I4NEZCNkBjdWx0dXJla2l0Y2hlbi5jb20+","inReplyToHeader":"PDdCNTA4RkQyLjcxNTlDNThCLjNGRjY2MEJCQGFvbC5jb20+"},"prevInTopic":89184,"nextInTopic":89204,"prevInTime":89184,"nextInTime":89186,"topicId":89176,"numMessagesInTopic":0,"msgSnippet":"... Thanks for the clarification. I just want to say though that, given we lost here in NYC the Elizabeth Seton Childbirthing Center, the practice of midwifery","messageBody":"<div id=\"ygrps-yiv-478801458\">On Saturday, January 17, 2004, at 11:43  AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rpofwarwick@...\">rpofwarwick@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m sorry I&#39;ve written so much.  Can you tell birth is my passion.  I <br/>\n&gt; just wanted to clarify the laws and options of birth in NY.<br/>\n<br/>\n </span></blockquote>Thanks for the clarification.<br/>\n<br/>\nI just want to say though that, given we lost here in NYC the Elizabeth <br/>\nSeton Childbirthing Center, the practice of midwifery is overridden by <br/>\nthe laws that protect insurance companies. As you must already know, <br/>\nESCbC was put out of business because no insurance company would cover <br/>\ntheir practice --and there is even a law in NY that is supposed to <br/>\nprevent that kind of thing from happening!<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://birthcenter.typepad.com/\">http://birthcenter.typepad.com/</a><br/>\n<br/>\nI would never have a homebirth here in this apartment but I have <br/>\nfriends that had them in even smaller places. Homebirths are a question <br/>\nof taste and, more importantly access to money and a good nearby <br/>\nhospital. We live across the street from a hospital but we&#39;ve been <br/>\ntreated so horridly in the past that not even dead I&#39;d want to go in <br/>\nthere. They are not very alternative medicine friendly at the hospital <br/>\nitself, even though they have one of the largest alternative medicine <br/>\ncenters in the city (it is in a separate building). The inquisition we <br/>\nhad to sustain because of the medical treatments we were questioning <br/>\nwere more than rude. They threatened us with CWS. When we told our <br/>\npediatrician at the time, she shrugged it off as standard hospital <br/>\nprocedure (no wonder we ran out of that practice). Then there is the <br/>\ncost. We heard low estimates of homebirths (we never did the legwork) <br/>\nat around $2K. That was on the low side. And I know of no insurance <br/>\nthat covers a homebirth. Having a birth center, on the other hand, is a <br/>\nmiddle ground compromise that I find very attractive. Now we have no <br/>\nindependent working birth centers in Manhattan. It&#39;s a terrible loss.<br/>\n<br/>\nCould my midwives have handled the situation better? Unfortunately, <br/>\nthey had no control over hospital medical personnel and theirs, in the <br/>\nend, was a losing situation. I had conversations with some of the <br/>\nmidwives and they talked about the balancing act they had to do by <br/>\nbeing affiliated with a Catholic hospital and, hence, having to deal <br/>\nwith the politics that comes with that relationship.  Last I heard 2 of <br/>\nthe 4 midwives that joined the hospital left. The ESCbC situation is <br/>\njust sad.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Homebirth VBACs and birth center VBACs are also legal as long as the <br/>\n&gt; midwife is state certified.  I have a good homeschooling friend who <br/>\n&gt; will be having her 2nd legally attended VBAC homebirth this summer.  <br/>\n&gt; Her first was a cesarean due to footling breech, her second was VBAC <br/>\n&gt; in a birthing center.<br/>\n<br/>\n </span></blockquote>Was this birthing center in NY? Because I was given a legal document <br/>\nstating how the center could not perform a first-time VBAC. I could <br/>\nhave any child  at a birthing center after a successful VBAC but not <br/>\nright after a cesarean.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There is not a specific state law denying you this as a choice(at <br/>\n&gt; least not directly).<br/>\n<br/>\n </span></blockquote>Unless this was a recent change in the law, I&#39;ll have to get my hands <br/>\non that piece of paper because it had all to do with the legal and not <br/>\nthe medical liability involved.<br/>\n<br/>\nl i z a<br/>\n=========================<br/>\nwww.culturekitchen.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Labor Inducing hints.","postDate":"1074366607","msgId":89184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1LjM1MThlMmMuMmQzYWUyOGZAYW9sLmNvbT4="},"prevInTopic":89176,"nextInTopic":89185,"prevInTime":89183,"nextInTime":89185,"topicId":89176,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/17/2004 11:12:33 AM Central Standard Time, ... Well, I don t live in NY, I have no intention of having another baby or moving to New York","messageBody":"<div id=\"ygrps-yiv-556093549\">In a message dated 1/17/2004 11:12:33 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rpofwarwick@...\">rpofwarwick@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m sorry I&#39;ve written so much.  Can you tell birth is my passion.  I just <br/>\n&gt; wanted to clarify the laws and options of birth in NY.  <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Well, I don&#39;t live in NY, I have no intention of having another baby or <br/>\nmoving to New York but I found your information fascinating. I love reading or <br/>\nlistening to someone who has a passion for what they do and has acquired the <br/>\nknowledge to back it up.<br/>\nLaura Buoni<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157311507,"authorName":"eaglefalconlark","from":"&quot;eaglefalconlark&quot; &lt;eaglefalconlark@...&gt;","profile":"eaglefalconlark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Labor Inducing hints.","postDate":"1074361736","msgId":89204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1YnNpOCsxNjQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdCNTA4RkQyLjcxNTlDNThCLjNGRjY2MEJCQGFvbC5jb20+"},"prevInTopic":89185,"nextInTopic":0,"prevInTime":89203,"nextInTime":89205,"topicId":89176,"numMessagesInTopic":0,"msgSnippet":"Regina, that was great, thank you! The New York maternity care system seems to be particularly difficult concerning birth choices, I m always hearing this or","messageBody":"<div id=\"ygrps-yiv-405137970\">Regina, that was great, thank you! The New York maternity care <br/>\nsystem seems to be particularly difficult concerning birth choices, <br/>\nI&#39;m always hearing this or that is &quot;the law&quot; and suspect otherwise, <br/>\nbut it&#39;s nearly impossible to find info regarding birthing laws and <br/>\nregulations on the internet. (Do you happen to know if there are any <br/>\non the internet?) They don&#39;t want to make it easy for us, <br/>\napparently! So it was very nice to hear from a health care provider <br/>\nactually living there. <br/>\n<br/>\nOf course it&#39;s not just New York, it happens all over. I am <br/>\nconstantly coming across women who consider themselves intelligent, <br/>\ninformed, and strong, who are shocked at how easy it was for them to <br/>\nbe manipulated into non-medically-necessary interventions. I am <br/>\nreading a book right now called Hard Labor by Susan Diamond, an L&D <br/>\nnurse detailing the reasons for and tactics by which hospital <br/>\nworkers accomplish this. (The outrageousness of it is heightened by <br/>\nthe fact that she is actually largely *sympathetic* to those <br/>\nhospital workers.)  <br/>\n<br/>\n(Every time I post on this thread I am thinking of how incredibly OT <br/>\nit is, but it is a passion of mind as well and can hardly help <br/>\nmyself. It is funny that it would be on an unschooling list that I <br/>\nwould find this information -- but it does make sense that people <br/>\nseeking freedom in one area of their lives would seek it in others, <br/>\nincluding birth choices.)<br/>\n<br/>\nThanks again, <br/>\nLinda</div>","specialLinks":[]},{"userId":155049550,"authorName":"rpofwarwick@aol.com","from":"rpofwarwick@...","profile":"rpofwarwick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Labor Inducing hints.","postDate":"1074357837","msgId":89176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCNTA4RkQyLjcxNTlDNThCLjNGRjY2MEJCQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":89184,"prevInTime":89175,"nextInTime":89177,"topicId":89176,"numMessagesInTopic":0,"msgSnippet":"Hi All, I am new to the group and felt it was time to share in the discussion.   ","messageBody":"<div id=\"ygrps-yiv-1741588922\">Hi All,<br/>\n<br/>\nI am new to the group and felt it was time to share in the discussion.  <br/>\n<br/>\n&lt;Sandra Dodd wrote:&gt;<br/>\n<br/>\n&lt;The medical system strongarms people all kinds of ways.&gt;<br/>\n<br/>\n&lt;Sandra&gt;<br/>\n<br/>\nI do agree that the medical system can strongarm people in many ways.  I am not sure what year Liza birthed this baby, where she is located, or whether the midwives she used were CNMs or CMs or Lay midwives.  I do believe this is exactly what was happening in her situation.  It also seems she was being misfed information regarding NY state laws involving birth and VBAC choices.  &quot;Sigh&quot;<br/>\n<br/>\nI live in NY and work as a doula and midwife assistant for a midwifery practice that does both hospital births and homebirths.  The founder of the group is a CM and her associate is a CNM.  <br/>\n<br/>\nDuring the 6 year time period in which I had my 3 children (all homebirths with a CM) the laws pertaining to midwifery and assisted homebirths went through changes.  When my first was born (1993) homebirth was considered allegal (not legal or illegal) when I had my 2nd (1996) the laws changed making homebirths assisted by non-state certified midwives illegal, but unassisted homebirths or those attended by state certified midwives were legal.  Being that there were no state certified midwives at the time, I had an assisted homebirth with the understanding that if I needed to transport, I would have to protect my midwife and deny her presence, fortunately I did not have to cross that bridge.  When I delivered my 3rd (1999), I used the same CM by then she was state licensed and legal.  <br/>\n<br/>\nFor the past 6 years, midwife assisted homebirth has been legal in NY as long as they are state licensed and affiliated with a board certified physician.  Homebirth VBACs and birth center VBACs are also legal as long as the midwife is state certified.  I have a good homeschooling friend who will be having her 2nd legally attended VBAC homebirth this summer.  Her first was a cesarean due to footling breech, her second was VBAC in a birthing center.  There is not a specific state law denying you this as a choice(at least not directly).  Whether or not a state certified careprovider will attend a VBAC homebirth would be dependent on their personal philosophy and policy, the pregnant woman&#39;s personal birth history, current pregnancy health, the area of which they live, and the obstetrician&#39;s policies of whom the midwife is affiliated with.  I have attended legal homebirth VBACs in NY and know of many midwives who also attend them.<br/>\n<br/>\nIt is not state law that the EDD (expected due date) determined by an ultrasound is the legal date a baby is due.<br/>\nStudies have indicated that 1/2 to 70% of the time, the EDD given to women is innaccurate.  Policy and acceptance of an EDD and the methods chosen to address post-EDD is at the discretion of each individual careprovider.<br/>\n<br/>\nAlso, it is not state law that if you are 2 weeks postdate you have to be induced.  This again is at the discretion of the careprovider and the way they choose to manage (Or not manage) birth.  Although there are some risks that can occur when gestation goes beyond 42 weeks.  Induction is not the only option.  A woman can opt to have either CST (contraction stress test), NST (non-stress test), or a BPP (Bio-physical profile) done.  These are all legal a viable alternatives.  These tests monitor the FHR (fetal heart rate) of the unborn child during contractions to determine whether or not the child is under stress.  If the test results are good, then the woman can wait until labor begins naturally or until her next appointment for another test.  If the test results are bad, they will strongly encourage induction, but they cannot force you.   <br/>\n<br/>\n&lt;But they could disqualify her from using midwives and she&#39;d go into the hospital&#39;s cattle chute system.&gt;<br/>\n<br/>\nAlthough this is true under some circumstances, I have had clients fire their careproviders near their EDD, and also while in labor, because they disagreed with the way their care was being managed.  They then hired a different careprovider more capatible with there wishes (again where one lives and their personal circumstances will determine what other careprovider options there are).  They cannot force you to conceed to their wishes, especially once they have been fired, but they can and often times will threaten and try to intimidate you to try and make you doubt your decision and conceed to theirs.  <br/>\n<br/>\nWhen a woman refuses to use a particular hospital, because of their non-mother friendly policies or when they change care providers, because their wishes are not being honored, this sends a strong message.  Consumer demand is what changes birth options and policies.  If we want to see more evidence based medicine being practiced in the USA, then more woman need to demand it. <br/>\n<br/>\nUnfortunately, many women are not aware of their rights.  OB&#39;s nationwide are obligated to heed &quot;The Pregnant Woman&#39;s Bill of Rights,&quot; which was is acknowledges by ACOG since 1974.  This states that OBs are obligated to clearly inform their patient about all options, procedures, risks, benefits and possible side effects of the the treatments they are suggesting and obtain the woman&#39;s informed consent.  If they do not, they can be held liable in a court of law.  The complete document can be found and printed at www.aimsusa.org/ppbr.htm<br/>\n<br/>\n&lt;And you know what, something did go wrong. I did have almost 4th degree tears and lost a lot of blood. So going underground would have not been in my best interest.&gt;<br/>\n <br/>\n<br/>\nWow! You&#39;ve been put through a lot.  I have to agree with some of the other posts that it is possible the complications were a result of the induction and/or how the delivery was managed, however without being there, it is hard to say.  No matter what the reasons were, I&#39;m sure it was tough.  It sounds like you followed your instincts as to where you needed to be.<br/>\n<br/>\nPossible side effects and increased risks of induction are cesarean section, uterine hyperstimulation, need for other interventions, more painful contractions, fetal distress, uterine rupture (even without previous c-sec), amniotic fluid embolism, higher infant and maternal death rate, shock, retained placenta, passage of meconium in utero, hemorrhage, risk of hysterectomy, tachycardia, brachycardia, shoulder dystocia, newborn jaundice, and reduced uterine blood flow.  An Information fact sheet about induction and other birth info can be found at www.motherfriendly.org   Click on &quot;resources&quot; on the right side of their homepage.<br/>\n<br/>\nNow that state certified midwives can legally attend homebirths, women do not have to go underground if they choose homebirth as an option.  Complications such as the one&#39;s you&#39;ve experienced can also be successfully managed at home with safe transport for further treatment if necessary.  The midwives I work with carry pitocin among other things to homebirths for treatment in the event a hemorrhage occurs.  The risk of hemmorhage is low for homebirths due to less intervention, generally if one does occur it can be rectified quickly without the need to transport.  I do know of one case where they transported for a 4th degree tear (it was the midwife&#39;s daughter).  She had a severe case of shoulder dystocia and after trying every manuever and option she knew, the midwife had to perform an episiotomy to get the baby out faster. Research has shown episotomies increase a woman&#39;s risk for severe tears and this is the reason they feel the tear was so severe.  In the end everyone was healthy and doing well, the baby was 12+ lbs. <br/>\n<br/>\nI&#39;m sorry I&#39;ve written so much.  Can you tell birth is my passion.  I just wanted to clarify the laws and options of birth in NY.  <br/>\n<br/>\nWarmest Wishes,<br/>\n<br/>\nRegina Phelps</div>","specialLinks":[]}],"prevTopicId":89131,"nextTopicId":89213}}