{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":33,"messages":[{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1319096394","msgId":63498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhrQVZTaXYyPStnNnpNaERQVHhjbmh4djR6MHRMaTlEbkU0c09ZQUROXz1OZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo3a3AzcytqN2hvQGVHcm91cHMuY29tPg==","referencesHeader":"PENBRzB1Vzg9eEQtWDJKdHNIQUpfcDRYTmdaVlZLQTRMVkdnTDBtVFJpWXN5Kzd2blpCQUBtYWlsLmdtYWlsLmNvbT4JPGo3a3AzcytqN2hvQGVHcm91cHMuY29tPg=="},"prevInTopic":63468,"nextInTopic":63499,"prevInTime":63497,"nextInTime":63499,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"2011/10/18 Eva  ... I guess that s what happen when you post in the heat of a moment, from the bottom of the well. I make us all look like","messageBody":"<div id=\"ygrps-yiv-689603075\">2011/10/18 Eva &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:evawitsel@...\">evawitsel@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt; *** Maybe you should find a compromise. Your husband does not want to<br/>\n&gt; unschool, he does not even want to homeschool. You want to unschool, but<br/>\n&gt; you write that you have little confidence in yourself. You write that your<br/>\n&gt; son is unhappy, you are unhappy and your husband is unhappy. You can<br/>\n&gt; continue on your unschooling path hoping that things will get better, but<br/>\n&gt; maybe you should change strategy. Maybe the step to unschooling was too big<br/>\n&gt; a step for now. ***<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I guess that&#39;s what happen when you post in the heat of a moment, from the<br/>\nbottom of the well. I make us all look like unhappy people.<br/>\n<br/>\nI am not attached to unschooling. At all. I am attached to finding ways for<br/>\nmy family to thrive and be happy. If my kids had enjoyed school, they&#39;d<br/>\nstill be there. If we could find a friendly enough school that&#39;s within our<br/>\nfinancial reach, they would be going. It just happens that my kids were<br/>\nunhappy at public school. And my husband was blaming it on us parents. And<br/>\nthe private schools within our financial reach would have even more of what<br/>\nmade them unhappy (ie: homework, punishments, no talking to other kids<br/>\nduring class...). There are some VERY expensive private schools around here<br/>\nwhere I think my kids might enjoy themselves. The price tag is crazy. It<br/>\nwould mean I go back to work more then full time. I refuse to put school at<br/>\nthe center of our lives to the point of slaving myself to pay school fees.<br/>\n(And then how much room would there be for the kids freedom to like it or<br/>\nnot?) I want my family and my kids in the center of our lives.<br/>\n<br/>\nIf I thought I could make eclectic homeschooling work for us. I would.<br/>\nReally. We tried that last year, but it really didn&#39;t look like a promising<br/>\npath. My son reluctantly did some school work to please dad.  Dad wasn&#39;t<br/>\nhappy. It wasn&#39;t enough. Jolan was grumpy and resentful. It didn&#39;t improve<br/>\ntheir relationship nor my husband&#39;s trust in homeschooling. It wasn&#39;t very<br/>\ngood on the family atmosphere either.<br/>\n<br/>\nWhat looks like the most promising path to a happy thriving family, for us,<br/>\nis unschooling. Only I need to &quot;show him the money&quot; rather then<br/>\nrelentlessly try to talk him into it. I need to build my ability to see<br/>\nnatural learning occurring. And point it out to him, on the spot. When I do<br/>\nthat, it really changes things. In a major way. AND I need to work at<br/>\nmaking our lives more joyful and sparkly. He&#39;s very sensitive to that too<br/>\nand that helps him see what it is I am trying to do.<br/>\n<br/>\nIt just gets hard when I doubt, or stumble. When I get tired and grumpy.<br/>\nThen he freaks out and wants the kids back in school. Now! Yesterday!<br/>\n<br/>\nI suppose to him it must feel like I&#39;m taking the family for a hike on<br/>\nMount Everest. When I&#39;m rested and joyful and empowered, when the kids are<br/>\nplaying and joking and running around in laughter and having fun, he can<br/>\nrelax some of his fears and enjoy the view. When I am doubtful and tired<br/>\nand grumpy, he freaks out and wants us back down in the valley with<br/>\n&quot;normal&quot; people.<br/>\n<br/>\nI guess I &quot;simply&quot; need to find ways to process my doubts and worries that<br/>\ndon&#39;t freak him out... Writing here is a lot of help. Maybe the heat of an<br/>\nargument is not the best time to do it thought ;-)<br/>\n<br/>\n*** One other thing: you write that you offer your children lots of fun<br/>\n<blockquote><span title=\"ireply\"> &gt; things to do, but they always refuse. My children are the same if I only<br/>\n&gt; speak about some activity. They have to *see* it. So I usually start<br/>\n&gt; something, like baking, by myself and within minutes I have two little<br/>\n&gt; helpers :-) If I ask them if they want to do a fun experiment, they will<br/>\n&gt; say no. But if I set the experiment up on the table, they are immediately<br/>\n&gt; interested. ***<br/>\n&gt;<br/>\n </span></blockquote>That&#39;s a very good and helpful reminder, thank you. I have noticed that<br/>\ntoo. :-)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":311108332,"authorName":"Eva","from":"&quot;Eva&quot; &lt;evawitsel@...&gt;","profile":"evawitsel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1318971324","msgId":63468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3a3AzcytqN2hvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1Vzg9eEQtWDJKdHNIQUpfcDRYTmdaVlZLQTRMVkdnTDBtVFJpWXN5Kzd2blpCQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63454,"nextInTopic":63498,"prevInTime":63467,"nextInTime":63469,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"... Maybe you should find a compromise. Your husband does not want to unschool, he does not even want to homeschool. You want to unschool, but you write that","messageBody":"<div id=\"ygrps-yiv-1047944716\">--- I don&#39;t have a clue how to reconcile their needs---<br/>\n<br/>\nMaybe you should find a compromise. Your husband does not want to unschool, he does not even want to homeschool. You want to unschool, but you write that you have little confidence in yourself. You write that your son is unhappy, you are unhappy and your husband is unhappy. You can continue on your unschooling path hoping that things will get better, but maybe you should change strategy. Maybe the step to unschooling was too big a step for now. <br/>\n<br/>\nMaybe you could do eclectic homeschooling and over the course of time ease into unschooling? Even the most hardcore homeschoolers I know only do one or two hours of school per day. Maybe you could do one hour of school a day and let your children choose their own activities for the rest of the day. It&#39;s not unschooling, but it&#39;s not school either. For the school hour you could find some educational activities that are in line with the interests of your children and build a curriculum from that. Maybe make some kind of walk through or comic book or something else together with your son about the game he is most interested in. Perhaps you could sell it to your husband as a curriculum &#39;especially tailored to your children&#39;. And sell it to your children as the only way they are able to stay home. <br/>\nDo you know pathways? It&#39;s a website where you can easily make your own curriculum. It looks very schooly, and has lots of suggestions of educational activities, so I think it would impress your husband ;-)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lessonpathways.com/Pathways/Featured\">http://www.lessonpathways.com/Pathways/Featured</a><br/>\n<br/>\nAnd then when things have settled down with you, your husband and your children, you could maybe start thinking about unschooling again. <br/>\n<br/>\nOne other thing: you write that you offer your children lots of fun things to do, but they always refuse. My children are the same if I only speak about some activity. They have to *see* it. So I usually start something, like baking, by myself and within minutes I have two little helpers :-) If I ask them if they want to do a fun experiment, they will say no. But if I set the experiment up on the table, they are immediately interested. <br/>\nIf I want to go somewhere, it helps if I show them pictures of what it will look like. Even if they already know the place. <br/>\n<br/>\nEva<br/>\nBerend (6) & Fiene (4)<br/>\nFrom The Netherlands</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1318907268","msgId":63454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCNzE2MTRELTA0MjYtNEQxNS1BRDI4LTQ0MjNGOEQ1NUQxQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRzB1Vzg9eEQtWDJKdHNIQUpfcDRYTmdaVlZLQTRMVkdnTDBtVFJpWXN5Kzd2blpCQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRzB1Vzg9blNxSHJKdFVxR1dkLTh4eEgrRW81Qm11ZE9qN1BLN1V1SC1VN196cEFpd0BtYWlsLmdtYWlsLmNvbT4gPGo2YTJvOCtiYWMyQGVHcm91cHMuY29tPiA8Q0FHMHVXOD14RC1YMkp0c0hBSl9wNFhOZ1pWVktBNExWR2dMMG1UUmlZc3krN3ZuWkJBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63441,"nextInTopic":63468,"prevInTime":63453,"nextInTime":63455,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"Claire, I came across this page tonight and thought possibly it might help somehow: http://sandradodd.com/obsessions/feedpassions.html It touches on a dad","messageBody":"<div id=\"ygrps-yiv-1236873660\">Claire, I came across this page tonight and thought possibly it might help somehow:<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/obsessions/feedpassions.html\">http://sandradodd.com/obsessions/feedpassions.html</a><br/>\n<br/>\n<br/>\nIt touches on a dad having seen a different aspect.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1318773183","msgId":63441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMzk0NDE3LTkwMDMtNDkyRC1BRkVBLTI4NDEwNTA1OEQxQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRzB1Vzg9eEQtWDJKdHNIQUpfcDRYTmdaVlZLQTRMVkdnTDBtVFJpWXN5Kzd2blpCQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRzB1Vzg9blNxSHJKdFVxR1dkLTh4eEgrRW81Qm11ZE9qN1BLN1V1SC1VN196cEFpd0BtYWlsLmdtYWlsLmNvbT4gPGo2YTJvOCtiYWMyQGVHcm91cHMuY29tPiA8Q0FHMHVXOD14RC1YMkp0c0hBSl9wNFhOZ1pWVktBNExWR2dMMG1UUmlZc3krN3ZuWkJBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63438,"nextInTopic":63454,"prevInTime":63440,"nextInTime":63442,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=- I reminded him I had agreed to send them to school but he gave up to the begging child. He says that s not true... :-(((-=- I think if I were you, in your","messageBody":"<div id=\"ygrps-yiv-1862094131\">-=- I<br/>\nreminded him I had agreed to send them to school but he gave up to the<br/>\nbegging child. He says that&#39;s not true... :-(((-=-<br/>\n<br/>\nI think if I were you, in your situation, I would talk my son into going to school.  It won&#39;t last forever, but it will be something you can document how it goes in writing so that your husband can&#39;t deny it next time.  OR maybe your son will take to school.  It&#39;s possible.<br/>\n<br/>\nWith the amount of resistance you&#39;re describing, I don&#39;t think unschooling is going to work for you.  It&#39;s horribly sad, but not as sad as a divorce with your kids living in (or visiting for months at a time) Madagascar where you wouldn&#39;t be anywhere near to help or mediate for them.<br/>\n<br/>\nIf you want a flush toilet but you don&#39;t have running water, there&#39;s no sense buying the toilet.<br/>\nIf you want a computer but you don&#39;t have electricity, don&#39;t get a computer.<br/>\nIf you end up divorced, unschooling won&#39;t happen.  First, the marriage.  Then the possibility of unschooling.  <br/>\n<br/>\nIf what I wrote above is not anything you want to consider, you might tell your husband that he had a clear opportunity to meet other unschooling families, and dads too, and he opted out, but you DID drive across France and you DID meet them, and you HAVE seen that others are making it work.  <br/>\n<br/>\nBut if it were me, I would go with school of some sort and give your husband a chance to think about it.<br/>\n<br/>\nLots of times Keith will deny something, in a discussion or argument, and say flat out that it didn&#39;t happen, and that&#39;s when I know I&#39;ve talked way too much and he&#39;s not thinking anymore, just has his lizard-defenses out.   Very often, after a day or two, he comes back at the situation from a new angle.  It&#39;s not an admission, and it&#39;s not an apology, but I can tell that he thought about it.  No sense saying &quot;AHA!  So you thought about it!  That means I WIN!&quot;  That would be adversarial.  You need to be your husband&#39;s partner.  I don&#39;t think a hundred or a million words can change that.  When he trusts you again, you will have more influence, pull, power, ability to propose changes.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1318771995","msgId":63438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1Vzg9eEQtWDJKdHNIQUpfcDRYTmdaVlZLQTRMVkdnTDBtVFJpWXN5Kzd2blpCQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo2YTJvOCtiYWMyQGVHcm91cHMuY29tPg==","referencesHeader":"PENBRzB1Vzg9blNxSHJKdFVxR1dkLTh4eEgrRW81Qm11ZE9qN1BLN1V1SC1VN196cEFpd0BtYWlsLmdtYWlsLmNvbT4JPGo2YTJvOCtiYWMyQGVHcm91cHMuY29tPg=="},"prevInTopic":63279,"nextInTopic":63441,"prevInTime":63437,"nextInTime":63439,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"Help... I m confused and tired and don t know what to do... DH sees Jolan not wanting to get out of the house as the very proof unschooling is not working. He","messageBody":"<div id=\"ygrps-yiv-394462382\">Help...<br/>\n<br/>\nI&#39;m confused and tired and don&#39;t know what to do...<br/>\n<br/>\nDH sees Jolan not wanting to get out of the house as the very proof<br/>\nunschooling is not working. He is very afraid I am spoiling our kids future.<br/>\n<br/>\nHe is getting more and more critical of my educational choices. Lately he<br/>\nhas decided he was going to teach them stuff. That means quizzing and<br/>\nlecturing and quizzing and quizzing and more quizzing. Avana likes it a lot,<br/>\nso I don&#39;t say much. Jolan totally hates it and a few times he came to me<br/>\ncrying for help, very upset. Once, while I was out with Avana, Jolan asked<br/>\nhis dad for help reading instructions on a video game. When I came home,<br/>\nJolan was crying and screaming in frustration. He and DH were in a power<br/>\nstruggle with DH asking Jolan to spell out the words and telling him he<br/>\nwould fail his life if he could not read... Apparently the struggle and<br/>\nquizzing and crying went on for over 1/2 hour :-(((<br/>\n<br/>\nI don&#39;t have a clue how to reconcile their needs<br/>\n- How can I help DH relax and see the learning when I only catch glimpses? I<br/>\nam trying as hard as I can to recognise the natural learning and trust the<br/>\nprocess and pay attention to my son and strew his path with exciting<br/>\nstuff... For no, the only strewing that interests him is computer related.<br/>\nDH sees that as a proof of his &quot;computer addiction&quot;...<br/>\n- How can I help Jolan ease into a new home, new family organisation (back<br/>\nwith Dad after 1.5 year separation) when his staying home is precisely what<br/>\nmakes dad freak out?<br/>\n<br/>\nI tried to explain to DH that I think Jolan needs time to settle down into<br/>\nyet a new life (we moved 6 times in his 7.5 years lifetime). He says I&#39;m<br/>\nmaking it up and everything would be fine if only they were in school. I<br/>\nreminded him I had agreed to send them to school but he gave up to the<br/>\nbegging child. He says that&#39;s not true... :-(((<br/>\n<br/>\nI&#39;m lost and confused... again :-(<br/>\n<br/>\nI am dreading the time he spends home. I can&#39;t wait for sunday to be over so<br/>\nhe goes back to work and I can breathe again.<br/>\n<br/>\nAny help in looking at all this from a different angle, finding ways to a<br/>\nmore peacefull home is more then welcome<br/>\n<br/>\nClaire<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1317572168","msgId":63279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2YTJvOCtiYWMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1Vzg9blNxSHJKdFVxR1dkLTh4eEgrRW81Qm11ZE9qN1BLN1V1SC1VN196cEFpd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63277,"nextInTopic":63438,"prevInTime":63278,"nextInTime":63280,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"... Get something portable for him to bring along. That s been a big help with Mo - she can have her games or programming platform on her DS or laptop, And she","messageBody":"<div id=\"ygrps-yiv-108579461\">Claire Darbaud &lt;cdarbaud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And I&#39;d love to read your thinking on that one: how would you deal with an 8<br/>\n&gt; year old who wants to stay alone at home, playing computer games and a 6<br/>\n&gt; year old who badly wants to go out and play?<br/>\n<br/>\n </span></blockquote>Get something portable for him to bring along. That&#39;s been a big help with Mo - she can have her games or programming platform on her DS or laptop, And she gets to decide to participate in other activities (or not) once we&#39;re there. Having a game or laptop also lets her take her time getting a feel for people and places - she can ease in to new situations rather than being stuck in the middle, and she has a retreat if she needs a break. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve<br/>\n&gt; noticed he feels resistant to meet new people, make new friends. A couple of<br/>\n&gt; times he said accusingly: &quot;I make millions of friends but then we move and I<br/>\n&gt; never see them again&quot;.<br/>\n<br/>\n </span></blockquote>He&#39;s got a point. Does he play any multiplayer games online? That could seem like a vastly safer way for him to make friends. Moving can be traumatic - and he&#39;s been made to move half a dozen times already. See him as someone who has experienced traumatic events - maybe even do some reading about Post Traumatic Stress and how long it can take people to recover from that, what sorts of things are helpful. Expect it to take him a couple years to feel &quot;at home&quot; anywhere, at least. Dragging him away from his comfort zone won&#39;t speed that up.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1317551514","msgId":63277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwRDE5QjdGLTgxNEUtNDhBNC04QTBBLTFENTM5QzBENzIyN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBRzB1Vzg9blNxSHJKdFVxR1dkLTh4eEgrRW81Qm11ZE9qN1BLN1V1SC1VN196cEFpd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEVFMDAyNjhGLUU5RjktNDdBNC05RUIxLTAwREVBODk0OUFEOUBTYW5kcmFkb2RkLmNvbT4gPGoza2ZwYSs4djlrQGVHcm91cHMuY29tPiA8Q0FHMHVXOG42R0pSRERCaTR1ZUNRNUhlaHNMVjJTLVdEakRUcE0yRTRnMEtYenZIK3ZRQG1haWwuZ21haWwuY29tPiA8Nzg1Qjg0MzctRENCOS00QTc3LTg4N0UtMkIyMkY3QkI5QTMwQFNhbmRyYWRvZGQuY29tPiA8Q0FHMHVXOD1uU3FIckp0VXFHV2QtOHh4SCtFbzVCbXVkT2o3UEs3VXVILVU3X3pwQWl3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63275,"nextInTopic":63279,"prevInTime":63276,"nextInTime":63278,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"... It sounds like you re right that he needs a sense of security and stability. 6 moves and a separation is a lot of trauma in 8 years. To an adult it would","messageBody":"<div id=\"ygrps-yiv-1083800128\">On Oct 1, 2011, at 5:03 PM, Claire Darbaud wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I&#39;d love to read your thinking on that one: how would you deal  <br/>\n&gt; with an 8<br/>\n&gt; year old who wants to stay alone at home, playing computer games and  <br/>\n&gt; a 6<br/>\n&gt; year old who badly wants to go out and play? Leaving Jo behind feels  <br/>\n&gt; like I<br/>\n&gt; am abandoning him to a computer... Is there another way to approach  <br/>\n&gt; this?<br/>\n<br/>\n </span></blockquote>It sounds like you&#39;re right that he needs a sense of security and  <br/>\nstability. 6 moves and a separation is a lot of trauma in 8 years. To  <br/>\nan adult it would feel like a lot. To an 8 yo it&#39;s how he&#39;s spent his  <br/>\n*entire* life, almost a move each year of his life, including the  <br/>\nultimate security killer, the splitting up of his family.<br/>\n<br/>\nIf the outings are random (and desperate), it probably feels to him  <br/>\nlike you&#39;re always going out. And it probably feels to your daughter  <br/>\nlike you never go out!<br/>\n<br/>\nWhat about scheduling days so each knows what to expect? And bringing  <br/>\nalong as much home as you can for your boy. (A handheld game, a way to  <br/>\nget on the internet if he&#39;s playing games on line. The ability to stay  <br/>\nin the car playing if you go to a playground.) And making the home  <br/>\ndays sparkly for your daughter and snuggly for your son.<br/>\n<br/>\nHe may very well be retreating to the computer as a way to feel  <br/>\nsecure. Take that need seriously. And rather than trying to pull his  <br/>\nway of soothing the hurt away, surround him with even more options.  <br/>\nMake snuggling with him -- or whatever he enjoys like his favorite  <br/>\nfoods, beloved videos, reading together, playing video games together  <br/>\n-- a priority.<br/>\n<br/>\nWhat about someone who can come and be with him while you go out with  <br/>\nyour daughter? Or someone he can go to? Or some other family your  <br/>\ndaughter can go with. I know that&#39;s difficult with a new move. Have  <br/>\nyou made any local contacts on line? Maybe you can find some other  <br/>\nfamily in the same situation and trade half your kids once a week so  <br/>\none family gets the stay at homers and one family gets the get out of  <br/>\nthe housers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Leaving Jo behind feels like I am abandoning him to a computer.<br/>\n<br/>\n<br/>\n </span></blockquote>If he&#39;s enjoying himself, don&#39;t recast it as something different.  <br/>\nShift your view to *his* view. Be happy that he&#39;s getting to do  <br/>\nexactly what he wants. Express your joy that he gets to do what he  <br/>\nenjoys. (With an open attitude that what he enjoys is ever changing.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1317502981","msgId":63275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1Vzg9blNxSHJKdFVxR1dkLTh4eEgrRW81Qm11ZE9qN1BLN1V1SC1VN196cEFpd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDc4NUI4NDM3LURDQjktNEE3Ny04ODdFLTJCMjJGN0JCOUEzMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEVFMDAyNjhGLUU5RjktNDdBNC05RUIxLTAwREVBODk0OUFEOUBTYW5kcmFkb2RkLmNvbT4JPGoza2ZwYSs4djlrQGVHcm91cHMuY29tPgk8Q0FHMHVXOG42R0pSRERCaTR1ZUNRNUhlaHNMVjJTLVdEakRUcE0yRTRnMEtYenZIK3ZRQG1haWwuZ21haWwuY29tPgk8Nzg1Qjg0MzctRENCOS00QTc3LTg4N0UtMkIyMkY3QkI5QTMwQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":62748,"nextInTopic":63277,"prevInTime":63274,"nextInTime":63276,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"A month later... Our family team is coming together... some of the time. Marriage improvement efforts are starting to show. The general atmosphere here is","messageBody":"<div id=\"ygrps-yiv-2025754985\">A month later...<br/>\n<br/>\nOur family team is coming together... some of the time.<br/>\n<br/>\nMarriage improvement efforts are starting to show. The general atmosphere<br/>\nhere is starting to feel lighter and happier. Yeh... :-)<br/>\n<br/>\nJolan still spends A LOT of time on the computer. I feel anxious and worried<br/>\nabout it. I don&#39;t limit it, but it does bother me. It feels like he is<br/>\nretreating in his games/you tube videos. He does not want to do anything<br/>\nelse. He only gets out of the house if I drag him because Avana so badly<br/>\nwants to be outside. Avana has been saying she wishes we had never bought<br/>\nthem computers (they have a laptop each) because now Jolan never wants to<br/>\nplay with her anymore...<br/>\n<br/>\nToday I &quot;gave up&quot;, Jolan decided he&#39;d rather stay home alone with his<br/>\ncomputer then come with us. Avana and I went to the board game festival<br/>\ntogether for the afternoon and Jolan stayed at home. He says he&#39;s &quot;happy&quot;<br/>\nstaying home alone. But he doesn&#39;t strike me as happy and blooming at all<br/>\n(but it could be that he is mirroring my worries of leaving him...). I can&#39;t<br/>\nhelp but wonder: what happened to my boy? He used to be a lively, social,<br/>\nfriendly person, full of energy. Now it feels like he is hardly there<br/>\nanymore... I can&#39;t help but wonder about computer addiction. I totally get<br/>\nthe rat park ideas about addiction being an effect of the environment. And<br/>\nthen what if the environment is indeed pushing my boy into an addiction to<br/>\ncomputers?<br/>\n<br/>\nI think he went through a lot. We have moved 6 times since he was born (he<br/>\nis going on 8). The first time we moved out of Madagascar into France when<br/>\nhe was one. We left behind a live in nanny he was very attached to and her 2<br/>\nkids who had been like a brother and a sister to my son. And grandma and<br/>\ngrandpa and the uncles, aunties and cousins... Then we moved several times<br/>\nin France. One of the moving was because DH and I had separated. We were<br/>\nseparated for a year and a half. The latest move was moving back together,<br/>\nbut in a new city. All the moving involved letting go of family, young<br/>\nfriends... I can tell it really got to him. We went back to Lyon to visit my<br/>\nmother this week and spent some time with Jolan&#39;s best friend there. I can<br/>\nsee Jolan feels very sad not to be able to play with his friend everyday<br/>\nlike he used to. I guess he must be going through a lot of grieving.... I&#39;ve<br/>\nnoticed he feels resistant to meet new people, make new friends. A couple of<br/>\ntimes he said accusingly: &quot;I make millions of friends but then we move and I<br/>\nnever see them again&quot;.<br/>\n<br/>\nWhen I feel hopeful and trusting, I think I should make it as safe and<br/>\ngentle as possible for him. Give him room and time to grieve, and retreat to<br/>\nwhatever cave he feels safe in. Spend as much time as I can snuggling and<br/>\ncuddling and keeping him company in his retreat. Trust him to heal in his<br/>\nown terms, in his own time and be there to help whenever he asks for help or<br/>\nto simply hug him and be there with him.<br/>\n<br/>\nAnd then society&#39;s voice comes in sometimes, and my husband&#39;s worries...<br/>\nTelling me it&#39;s completely crazy to let him be on the computer for hours and<br/>\nhours and hours... All becomes blurry and I feel lost and not so sure<br/>\nanymore...<br/>\n<br/>\nI read this list a lot and unschooling basics and Sandra&#39;s site and Joyce<br/>\nand demand euphoria... it helps clear the clouds in my thinking.<br/>\nSometimes...<br/>\n<br/>\nSome comments about Sandra&#39;s last email...<br/>\n<br/>\n2011/9/2 Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt; ***Do the things you remember from school. Do you have a car during the<br/>\n&gt; day? Get out. Make yourself a deal to get out every single day.***<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>What if Jolan just doesn&#39;t want to get out. As in &quot;I said I don&#39;t want to<br/>\ngo, you&#39;re trying to force me!&quot; ?<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You could tell your kids: Either our lives become busier and more<br/>\n&gt; impressive and your dad starts to agree, or you go to school.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I tried that most of last year. It felt wrong. I sounded like blackmail. It<br/>\nmade dad look like the bad guy we were all afraid of. The kids tried hard to<br/>\ndo some school stuff to please dad. It wasn&#39;t enough to please dad and it<br/>\nmade everybody grumpy. I don&#39;t know how to approach this without making it<br/>\nsound like school will be the punishment if our lives are not exciting<br/>\nenough (and then how do we measure exciting? who sets the standard?).<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***If even YOU can&#39;t see value in your days, how will you defend what<br/>\n&gt; you&#39;re doing to government representatives?***<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I know, that&#39;s VERY scary. when I look at it like that it just freaks me<br/>\nout. I try to remember that we are all still deschooling (and I am probably<br/>\nthe one having the hardest time with it), adjusting to our new life in a new<br/>\ncity...<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=- I can see what could be learned from it. But I have no clue what it is<br/>\n&gt; they are actually learning.-=-<br/>\n&gt;<br/>\n&gt; ****Typical and normal. It takes time. And if they&#39;re used to you or their<br/>\n&gt; dad quizzing them about what they&#39;re learning, it will take longer,<br/>\n&gt; probably, for them to spontaneously start telling you. ****<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>That&#39;s getting better. They have spent quite some time on Team Fortress 2<br/>\nlately. A month ago, I would only have been horrified at the blood and all<br/>\nthe shooting. Now I can tell they&#39;re getting better at reading the game very<br/>\nfast. They&#39;re experiencing joining a team and figuring out for yourself how<br/>\nbest you can help your team. They have different strategies. Avana likes to<br/>\nplay the medic and follow another player around to heal them. Jolan like to<br/>\nbe the mechanic and build machines to help out. They both have noticed it&#39;s<br/>\nmore efficient to play a character that&#39;s not played by too many others and<br/>\nthat if everybody plays big muscle, the other team with a more diverse set<br/>\nof skills has a big advantage... I feel it&#39;s awesome to be able to learn<br/>\nthat at such a young age. Being able to read a situation and get a sense of<br/>\nwhat you can do to help sounds like an amazing asset in everyday life!<br/>\n<br/>\nThat&#39;s just an example, but I am getting better at seeing learning happening<br/>\nin it&#39;s raw form. Yippie for that :-)<br/>\n<br/>\nYou&#39;re feedback is welcome...<br/>\n<br/>\nAnd I&#39;d love to read your thinking on that one: how would you deal with an 8<br/>\nyear old who wants to stay alone at home, playing computer games and a 6<br/>\nyear old who badly wants to go out and play? Leaving Jo behind feels like I<br/>\nam abandoning him to a computer... Is there another way to approach this?<br/>\n<br/>\nThanks for being out there. Your lists and blogs and gentle presence feel<br/>\nlike a lighthouse in the fog...<br/>\n<br/>\nWarmly<br/>\nClaire<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1315068901","msgId":62748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFNjI1QkU1LjUwMzA1MDJAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGozdGk4NSsyYmdhQGVHcm91cHMuY29tPg==","referencesHeader":"PGozdGk4NSsyYmdhQGVHcm91cHMuY29tPg=="},"prevInTopic":62747,"nextInTopic":63275,"prevInTime":62747,"nextInTime":62749,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"... Don t do it by subject -- do it by more real-life categories. Use: listening, watching, speaking, conversing, reading, writing, visiting, playing,","messageBody":"<div id=\"ygrps-yiv-2011491163\">On 9/3/2011 8:48 AM, sheeboo2 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; It is, but I want to caution folks who don&#39;t need to document for the <br/>\n&gt; government, that breaking things up as I have by &quot;subject&quot; could very <br/>\n&gt; well slow down deschooling.<br/>\n<br/>\n </span></blockquote>Don&#39;t do it by subject -- do it by more real-life categories. Use: <br/>\nlistening, watching, speaking, conversing, reading, writing, visiting, <br/>\nplaying, building, inventing, creating, thinking, puzzling, organizing, <br/>\njoking, observing, and so on.<br/>\n<br/>\nThen, later, the parent can put all that into whatever documentation is <br/>\nneeded. The advantages are many: 1) kids who become aware of the <br/>\ndocumentation aren&#39;t edged into thinking in terms of school subjects; 2) <br/>\nparents don&#39;t revert to or hang on to the idea of school subjects but <br/>\nreally come to embrace the reality that kids are always learning; 3) <br/>\nparents don&#39;t start getting worried that a kid isn&#39;t doing enough in <br/>\nsome particular subject and try to push that on the kids (oh so subtle <br/>\nas it may be); 4) it can actually help a parent really see what the kids <br/>\nare doing and help the parent let go of biases in favor of certain ways <br/>\nof learning (reading, writing) as opposed to others (playing, <br/>\nconstructing, listening, watching); and 5) when the parents do put the <br/>\nmaterial into documentation that is &quot;by subject,&quot; things can almost <br/>\nalways go into multiple categories and you can choose so as to fill all <br/>\nthe categories and satisfy the authorities.<br/>\n<br/>\nIf you try to record activity with these kinds of categories, you&#39;ll <br/>\nfind that any one activity can go into multiple categories. It doesn&#39;t <br/>\nmatter which category you put it into - the categories are just <br/>\n&quot;ticklers&quot; to help you recognize that the kid IS doing something that <br/>\nyou can record and use (later) for documentation.<br/>\n<br/>\nThese kinds of categories are also a pretty good way to start out <br/>\nunschooling for those who have the urge to keep records of some kind. I <br/>\nused this kind of thing to keep a journal for about 3 months and then <br/>\nconverted it to slightly more educationeze language and showed it to my <br/>\nhusband who perused it and said I could &quot;make anything sound <br/>\neducational.&quot; I just smiled and said, &quot;Yep, that&#39;s pretty much true <br/>\nbecause, y&#39;know, everything they do does actually involve learning.&quot; He <br/>\ndidn&#39;t have an aha moment &lt;G&gt;, but it got him on the road to seeing that <br/>\nlearning didn&#39;t have to look like a result of school-style teaching.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1315064901","msgId":62747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozdGk4NSsyYmdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGozdGZmNis2dnQzQGVHcm91cHMuY29tPg=="},"prevInTopic":62745,"nextInTopic":62748,"prevInTime":62746,"nextInTime":62748,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"... It is, but I want to caution folks who don t need to document for the government, that breaking things up as I have by subject could very well slow down","messageBody":"<div id=\"ygrps-yiv-527061922\">----Brie talked about the Evernote system a while back and that sounds really cool.----<br/>\n<br/>\nIt is, but I want to caution folks who don&#39;t need to document for the government, that breaking things up as I have by &quot;subject&quot; could very well slow down deschooling. It&#39;s a  Procrustean bed of sorts (<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Procrustes)\">http://en.wikipedia.org/wiki/Procrustes)</a> wherein the forced categorization  may blind you to other, bigger and brighter realizations about learning in general, and that learning is happening all the time, even where it isn&#39;t expected.<br/>\n<br/>\nIt is a great as a multi-text journal for photos, thoughts, links.<br/>\n<br/>\nIf your purpose is to keep the family informed by offering exciting photos and discoveries, and maybe links to things the kids are learning from, a blog might suit you better as you can jazz up the presentation.<br/>\n<br/>\n---You could begin by noting all the skills Meredith and Brie discussed in their email in regards to Pokemon.----<br/>\n<br/>\nI was curious if &quot;educators&quot; had looked at Pokemon. Among the few things I found was this, which has some good edu-speak language you could lift:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://resources.curriculum.org/secretariat/files/Nov29Pokemon.pdf\">http://resources.curriculum.org/secretariat/files/Nov29Pokemon.pdf</a><br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1315063292","msgId":62745,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVEMDgzMzRELUJDOUUtNDY3NS1CREM1LTk1OTQ2RTc5RUM1Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGozdGZmNis2dnQzQGVHcm91cHMuY29tPg==","referencesHeader":"PGozdGZmNis2dnQzQGVHcm91cHMuY29tPg=="},"prevInTopic":62744,"nextInTopic":62747,"prevInTime":62744,"nextInTime":62746,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=-Brie talked about the Evernote system a while back and that sounds really cool.-=- http://sandradodd.com/portfolio  (links to Brie s, but mine I have","messageBody":"<div id=\"ygrps-yiv-656735173\">-=-Brie talked about the Evernote system a while back and that sounds really cool.-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/portfolio\">http://sandradodd.com/portfolio</a>  (links to Brie&#39;s, but mine I have memorized)</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1315062054","msgId":62744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozdGZmNis2dnQzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1VzhuVWd2SCszU3hRSm5HaTJPWkU2XzJfNlRnYkZBY01Ia01KNEVLUlpnQWEtZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62737,"nextInTopic":62745,"prevInTime":62743,"nextInTime":62745,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=-Dad is somewhat giving up, saying things like have it your way but I will take no responsability for the result ... and but they will fail their life, I m","messageBody":"<div id=\"ygrps-yiv-825075955\">-=-Dad is somewhat giving up, saying things like &quot;have it your way but I will<br/>\ntake no responsability for the result&quot;... and &quot;but they will fail their<br/>\nlife, I&#39;m certain they will&quot;... and &quot;don&#39;t count on me to support them when<br/>\nthey&#39;re 20 and sitting at home being bums&quot;.... it feels like he&#39;s casting a<br/>\ndark prophecy...<br/>\n<br/>\nI sooooo don&#39;t know what to do... How can I help change this? I wish I had<br/>\nmore faith in the kids and myself as their guide... -=-<br/>\n<br/>\nI think you mentioned in another email that your husband was afraid of his father. Maybe it is extra difficult for him to accept unschooling because he is afraid he will look like a failure to his father if his own children fail to impress? <br/>\n<br/>\nIf it were me, I would joyfully take on the challenge of wowing my husband. Especially if he is able to talk impressively about his children&#39;s learning to his own family. You could start a scrapbook or a blog. Brie talked about the Evernote system a while back and that sounds really cool.<br/>\n<br/>\nYou could begin by noting all the skills Meredith and Brie discussed in their email in regards to Pokemon. <br/>\n<br/>\nHere&#39;s a cool video that your children might enjoy that could later be filed in your Evernote &#39;Science&#39; section:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sciencefriday.com/videos/watch/10397\">http://www.sciencefriday.com/videos/watch/10397</a><br/>\n<br/>\nRippy</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1315059841","msgId":62737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozdGRhMSt2OHNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1VzhrbysyWnBYXzREajZORm5rSnRDaXJoK1VWdHRjTTc1dEhfU1NVZ1VHZEVDUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62733,"nextInTopic":62744,"prevInTime":62736,"nextInTime":62738,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=-it would help us meet people in this city where we hardly know anybody. The kids would get to know the other kids in our building and neighborhood. -=- I","messageBody":"<div id=\"ygrps-yiv-812345584\">-=-it would help us meet people in this city where we hardly know anybody. The kids would get to know the other kids in our building and neighborhood. -=-<br/>\n<br/>\nI think it&#39;s great to be proactive about this and help your children meet people and make friends. We&#39;re helpful and friendly with our neighbors and it has a positive impact on our unschooling lives. A few months ago we hosted a children&#39;s neighborhood movie party with popcorn, cookies and lemonade. The children and I made posters and invitations and delivered them to the children on our street. We&#39;ve also had impromptu craft parties. I try to make our home an inviting and cool place for children to come visit.<br/>\n<br/>\nIf we are home in the afternoons, we usually leave our doors unlocked so children can come in and out. Many of our neighbors do this as well. I realize that this might be a cultural thing - I was born and raised in Canada, my ancestry is Indian and I&#39;ve lived in the Netherlands for almost 10 years. In all 3 countries, it&#39;s not unusual to have open doors.  I&#39;ve had days where my children were over playing at one neighbor friend&#39;s house and some other neighborhood children were playing pretend games in our toy shop in our living room. <br/>\n<br/>\nOne of the most helpful things that I have done for the children is to start a weekly homeschooling group. My son was the first homeschooler in our city and now there are a couple more families. Most of the children come to the group from different cities though. It&#39;s wonderful that if my children want to play with another child, we no longer have to wait until 3pm. <br/>\n<br/>\nOur group is loosely based on Pam&#39;s Dragontree Home Learners group, but we had to make several adjustments based on the reality of living in the Netherlands. I&#39;ve been helping a few families in other parts of the Netherlands and Belgium set up their own homeschooling groups. If you are interested in setting up a group, I would be happy to help in any way that I can if you email me off list.<br/>\n<br/>\nRippy</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1315057267","msgId":62733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozdGFwaitqMmNsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1VzhrbysyWnBYXzREajZORm5rSnRDaXJoK1VWdHRjTTc1dEhfU1NVZ1VHZEVDUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62727,"nextInTopic":62737,"prevInTime":62732,"nextInTime":62734,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=- I feel lost and confused and not sure what to offer... -=- Do you have any open air museums in your area? Any museum with interactive activities for","messageBody":"<div id=\"ygrps-yiv-1513910997\">-=- I feel lost and confused and not sure what to offer... -=-<br/>\n<br/>\nDo you have any open air museums in your area? Any museum with interactive activities for children can be exciting for children and parents. Often the museums offer brochures to explain the educational merit of their activities, which your husband might appreciate.<br/>\n<br/>\nI live in a small university town in the Netherlands and I&#39;m amazed at the quality of children&#39;s activities at the local museums or museums that are easily accessible by train. My 6 and 4 year old recently did a virtual CSI autopsy of a porpoise at the Natural History Museum, dug up artifacts and glued together a broken clay pot at the Museum of Antiquities, witnessed a gladiator fight in a Roman arena, learned how to give Roman massages and how to throw a javelin. Here is an example of daily children&#39;s activities at our nearest Open Air Museum:<br/>\n<br/>\nwww.archeon.nl/engels/the+park/daily+activities.html<br/>\n<br/>\nThe wonderful thing about going to a museum in a country with very few homeschoolers is that the staff have a lot of time to explain things to the children and let them touch things and tell them stories. <br/>\n<br/>\nWe also have a lot of free concerts and festivals. We were visiting an amusement park the other day in a city we had never before visited. We heard a loud speaker and followed the voices. It ended up being a hot air balloon festival in a clearing in the middle of the woods. The children were thrilled.<br/>\n<br/>\nBe curious and take detours. Other detours this week have led to a discovery of a skate park with teenagers and younger children doing all sorts of cool tricks on their bikes and skateboards and a lost and found shed at the beach with a sign saying &#39;Take anything. Everything will be thrown out by the end of the week&#39;. They children each picked out a boogie board.<br/>\n<br/>\nWe buy a national museum card for every member of our family and most museum entrance fees are covered by this. We also got the children yearly national train passes (which cost 15 euros each for the year) and they can go anywhere in the country without paying anything extra. I have a discount card for myself, which gives me a 40% discount on all national train travel. <br/>\n<br/>\nMaybe France has something similar?<br/>\n<br/>\nRippy</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1315011255","msgId":62727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozcnRybitxdjBlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGozcnNjZStlZGMxQGVHcm91cHMuY29tPg=="},"prevInTopic":62726,"nextInTopic":62733,"prevInTime":62726,"nextInTime":62728,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"--Maybe ask your husband what he learned in his 12, or however many years he spent in school. Not university, but up until then.---- That don t come out right.","messageBody":"<div id=\"ygrps-yiv-558016663\">--Maybe ask your husband what he learned in his 12, or however many years he spent<br/>\nin school. Not university, but up until then.----<br/>\n<br/>\nThat don&#39;t come out right.  <br/>\n<br/>\nAsk your husband what he *remembers* from his 12 or whatever years in school, in regards to &quot;academics.&quot;<br/>\n<br/>\nI thought about it as I reread my post, and I don&#39;t even remember much from my studies as an undergrad.  The majority of what I remember in an academic sense comes from graduate school, and that pales in comparison to the things I&#39;ve learned and retained since I graduated. <br/>\n<br/>\nFor me, that was one of my biggest ah-ha moments about unschooling and academics.  When I realized that everything I remembered from 12 years of school I could have learned in a few months, maybe even in a few weeks if I was really focused, I let go of any remaining belief that schools and teaching were required for learning.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1315009742","msgId":62726,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozcnNjZStlZGMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc4NUI4NDM3LURDQjktNEE3Ny04ODdFLTJCMjJGN0JCOUEzMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62724,"nextInTopic":62727,"prevInTime":62725,"nextInTime":62727,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"... There may be some good short writing on Simon Dor s blog: http://www.simondor.com/ A French Canadian author you could look for is Bernard Perron who writes","messageBody":"<div id=\"ygrps-yiv-494138506\">----Are there books in favor of the modern world that are in French in audio files? Anything about digital natives?---<br/>\n<br/>\nThere may be some good short writing on Simon Dor&#39;s blog: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.simondor.com/\">http://www.simondor.com/</a><br/>\n<br/>\nA French Canadian author you could look for is Bernard Perron who writes about game theory. Some of his writing is heady and academic, but he also writes for mainstream French magazines.  You may find more ideas here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://ludicine.ca/en\">http://ludicine.ca/en</a><br/>\nNot sure if anything will be in an audio file, but quite possibly you&#39;ll find some hypertexts.<br/>\n<br/>\n*********<br/>\n<br/>\nWe took our cats to the vet today for their annual checkups. Noor, our 8 year old daughter was nuzzling Victor&#39;s head and talking to him to distract him while he was getting his vaccines.  She remarked that he was shedding A LOT and said it must be because he&#39;s nervous.  The vet looked at me, kind of stunned, and asked if I had &quot;taught her that?&quot;<br/>\n<br/>\nI laughed and said that Noor is very observant.<br/>\n<br/>\nThat kind of analytical thinking, which seemed so surprising to him coming from an 8 year old, is something I think is quite common with unschooled kids who get to spend as much time as they want following trails of interesting information from one discovery to another.  <br/>\n<br/>\n&quot;Studying&quot; video games and Pokemon are no different, at their core, than studying botany or physics--the brain is categorizing, remembering, building connections, generating theories, checking and re-checking hypotheses, coming to conclusions. Right now, your kids are interested in Pokemon and video games--their brains are active, they&#39;re getting a rigorous workout *because* they&#39;re engaged in things that are compelling, which is far more indicative of active learning, in my opinion, than what happens most of the time in a classroom. <br/>\n<br/>\nSomeone posted an Alfie Kohn article recently on Facebook that found that the majority of educational research is conducted over a brief period of a few weeks. What that means is, students appear to &quot;learn&quot; something after lots of homework and detailed instruction a week or two after that instruction took place.  BUT, when students are followed for a longer period of time, poof! Not much is retained.<br/>\n<br/>\nMaybe ask your husband what he learned in his 12, or however many years he spent in school.  Not university, but up until then. <br/>\n<br/>\nHere&#39;s that article:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.huffingtonpost.com/alfie-kohn/studies-support-rewards-h_b_843050.html\">http://www.huffingtonpost.com/alfie-kohn/studies-support-rewards-h_b_843050.html</a><br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1315001268","msgId":62724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozcmszayt2MWpnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1VzhuNkdKUkREQmk0dWVDUTVIZWhzTFYyUy1XRGpEVHBNMkU0ZzBLWHp2SCt2UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62717,"nextInTopic":62726,"prevInTime":62723,"nextInTime":62725,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"... You can t ever actually know what another person is learning if you want to think of it that way. Never ever ever. Tests and textbooks and worksheets only","messageBody":"<div id=\"ygrps-yiv-1642746740\">Claire Darbaud &lt;cdarbaud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I could list a lot of things she might be learning from it. What she IS<br/>\n&gt; actually learning... I really don&#39;t know.<br/>\n<br/>\n </span></blockquote>You can&#39;t ever actually know what another person is learning if you want to think of it that way. Never ever ever. Tests and textbooks and worksheets only give you an illusion of knowing and even that illusion is temporary. You know what your kids find interesting - that&#39;s wonderful! You&#39;re sharing their lives and days. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I really need to figure out a way to get the whole family on the same team.<br/>\n&gt; For now it feels like Dad ad the kids are on opposite teams.<br/>\n<br/>\n </span></blockquote>Are there things Dad like that the kids also enjoy? Find ways to do more of that. Are there things the kids can do for dad to help him feel loved and appreciated? That could help, too. It could also help to be gentle and reassuring with him for now - let him know that right now there&#39;s still a transition going on. You&#39;re not really &quot;there&quot; yet in many ways. Ask for more time and let him know you are grateful for his forbearance. <br/>\n<br/>\nIt might also help to show him some of the posts in the &quot;math in real life&quot; thread going on right now<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/62694\">http://groups.yahoo.com/group/AlwaysLearning/message/62694</a><br/>\n - those where kids who were unschooled found they hadn&#39;t lost much of anything, academically speaking, by staying out of school. There are more &quot;unschooling success stories&quot; here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://whyunschool.info/\">http://whyunschool.info/</a><br/>\n<br/>\nDespite the fact that you can&#39;t ever know what a person *really* learns ;) you can still break down what the kids are doing every day and show dad some of the &quot;topics&quot; which are being &quot;covered&quot; so he can feel reassured. Pokemon involves a lot of logical thinking and problem solving - a Lot. It also involves not just reading but learning how words are built up from parts. You&#39;ll find Latin roots in Pokemon names. You&#39;ll find scientific principles, too - the categories of Pokemon are reminiscent of the ways scientists classify all sorts of things, and the simple &quot;evolutions&quot; are often modeled on the way plants and animals mature.<br/>\n<br/>\nYour son seems to be fascinated with logic and problem solving, too, if he&#39;s watching solutions to games so much. Games use a lot of logic and sequencing. They also contain many elements of literature - they have story lines, character development, scenes and settings, themes, foreshadowing, and they reference literature and history as well as other games and movies. Very rich stuff!  <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1314976458","msgId":62717,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4NUI4NDM3LURDQjktNEE3Ny04ODdFLTJCMjJGN0JCOUEzMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRzB1VzhuNkdKUkREQmk0dWVDUTVIZWhzTFYyUy1XRGpEVHBNMkU0ZzBLWHp2SCt2UUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEVFMDAyNjhGLUU5RjktNDdBNC05RUIxLTAwREVBODk0OUFEOUBTYW5kcmFkb2RkLmNvbT4gPGoza2ZwYSs4djlrQGVHcm91cHMuY29tPiA8Q0FHMHVXOG42R0pSRERCaTR1ZUNRNUhlaHNMVjJTLVdEakRUcE0yRTRnMEtYenZIK3ZRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":62709,"nextInTopic":62724,"prevInTime":62716,"nextInTime":62718,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=-I suppose if you ask Dad he will tell you the he and I are on different teams and the kids chose to be on my side. Whichever way I look at it, it s not","messageBody":"<div id=\"ygrps-yiv-2000246247\">-=-I suppose if you ask Dad he will<br/>\ntell you the he and I are on different teams and the kids chose to be on my<br/>\nside. Whichever way I look at it, it&#39;s not fun...-=-<br/>\n<br/>\nI think many families look that way at first, with the kids choosing mom and the dad being baffled, whether they&#39;re unschooling or not!<br/>\n<br/>\n-=- And part<br/>\nof my issues is I feel I don&#39;t measure up. A lot of our days here are very<br/>\nboring compared to how much excitement there was at school when I was small.-=-<br/>\n<br/>\nDo the things you remember from school.  Do you have a car during the day?  Get out.  Make yourself a deal to get out every single day.  You don&#39;t have to do something fancy.  Going to a different store or window shopping or hiking or collecting rocks or pinecones or I don&#39;t know what the heck is on the ground where you live. :-)  Maybe something to climb on or swing on or slide down.  THAT could be your &quot;schedule,&quot; maybe.  And in the car you could have music that was educational or funny or both.  We had tapes, back in the day, and some of them had stories, and one of them had song about counting, and the alphabet and my kids still know those songs, and we made funny parodies or wrote our own verses.<br/>\n<br/>\nYou could tell your kids:  Either our lives become busier and more impressive and your dad starts to agree, or you go to school.  Get their help.  Get their ideas and their cooperation.   If even YOU can&#39;t see value in your days, how will you defend what you&#39;re doing to government representatives?<br/>\n<br/>\n-=-And some of our days are a lot of fun. In my book, the days<br/>\nwhen we are out and about, visiting friends or going places rank much higher<br/>\nthen the days when we stay at home and spend our days playing video games<br/>\nand watching animes. The kids seem to like both, and we probably have a<br/>\nfairly good balance (ie out and about 1/3 of the time).-=-<br/>\n<br/>\nThat is a lot of time out, so maybe once you start seeing the learning they&#39;re doing (and it will come out in conversational references, and connections) you&#39;ll have a different point of view about the days at home.  But if they seem lame to you... something needs to change, either in schedule or point of view.<br/>\n<br/>\n-=- I can see what could be learned from it. But I have no clue what it is they are actually learning.-=-<br/>\n<br/>\nTypical and normal. It takes time.  And if they&#39;re used to you or their dad quizzing them about what they&#39;re learning, it will take longer, probably, for them to spontaneously start telling you. <br/>\n<br/>\n-=-It&#39;es strange<br/>\nthough, he is so meticulous and dedicated, it almost feels like he is<br/>\nstudying them. As if he had an internal curriculum that he is precisely<br/>\nfollowing.-=-<br/>\n<br/>\nThese pages might help with that.  He IS studying, but the word is unfortunate.  Too &quot;studious.&quot;  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/focus\">http://sandradodd.com/focus</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/addlightandstir\">http://sandradodd.com/addlightandstir</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/modeloftheuniverse\">http://sandradodd.com/modeloftheuniverse</a>  (I really need to get in there and add more to that one.)<br/>\n<br/>\n-=-Dad gets really upset about all these things and more. He sees video games<br/>\nand animes as useless, unproductive and stupid. -=-<br/>\n<br/>\nYou could tell him that more is written about them every single day, and if he isn&#39;t willing to read what you&#39;re reading, he should let it go for a year or two and let your kids show him.  If he puts them in school, you could say, they will miss being on the cutting edge of something new and exciting.  The future will be filled with electronics.  The present is!!    Are there books in favor of the modern world that are in French in audio files?  Anything about digital natives?  Anything by Gerard Jones?<br/>\n<br/>\n-=- He wants kids in bed at<br/>\n20:30 and can&#39;t understand why Jolan wants to stay up late. (Jolan went to<br/>\nbed at 3:00 am the day before yesterday, I have no clue what time he went to<br/>\nbed last night, I was fast asleep...)-=-<br/>\n<br/>\nWas Jolan at least in his room being as quiet as if he was asleep?  Outright defiance of what a dad wants can lead to a worse place.<br/>\n<br/>\n-=-Since we got them out of school a few months ago, I&#39;ve tried to encourage<br/>\nthe kids to make compromises to please dad. We also tried to do some<br/>\nschoolish activities in the morning. It just doesn&#39;t work. The kids sort of<br/>\ndo some efforts. It&#39;s noway near enough to make dad happy. Everybody ends up<br/>\ngrumpy and annoyed. There has to be a better way!-=-<br/>\n<br/>\nAsk the kids to help you find a better way.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1314949492","msgId":62709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhuNkdKUkREQmk0dWVDUTVIZWhzTFYyUy1XRGpEVHBNMkU0ZzBLWHp2SCt2UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGoza2ZwYSs4djlrQGVHcm91cHMuY29tPg==","referencesHeader":"PEVFMDAyNjhGLUU5RjktNDdBNC05RUIxLTAwREVBODk0OUFEOUBTYW5kcmFkb2RkLmNvbT4JPGoza2ZwYSs4djlrQGVHcm91cHMuY29tPg=="},"prevInTopic":62634,"nextInTopic":62717,"prevInTime":62708,"nextInTime":62710,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"So... So dad gave up to the begging kids. But it makes him really grumpy. I really need to figure out a way to get the whole family on the same team. For now","messageBody":"<div id=\"ygrps-yiv-1295582999\">So...<br/>\n<br/>\nSo dad gave up to the begging kids. But it makes him really grumpy.<br/>\n<br/>\nI really need to figure out a way to get the whole family on the same team.<br/>\nFor now it feels like Dad ad the kids are on opposite teams. And I try to be<br/>\na peace maker, with very little success. I suppose if you ask Dad he will<br/>\ntell you the he and I are on different teams and the kids chose to be on my<br/>\nside. Whichever way I look at it, it&#39;s not fun...<br/>\n<br/>\nI need help in seing things differently and finding ways to make things work<br/>\nfor everybody.<br/>\n<br/>\nI don&#39;t demonise school. At all. I loved school when I was young. And part<br/>\nof my issues is I feel I don&#39;t measure up. A lot of our days here are very<br/>\nboring compared to how much excitement there was at school when I was small.<br/>\nTo be honest, I am somewhat surprised my kids prefer to stay home. I suppose<br/>\nit could be because the price to pay for the exciting stuff in school (ie:<br/>\nvery little freedom to explore what your decide, punishments...) is to high<br/>\nin my kids eyes. And some of our days are a lot of fun. In my book, the days<br/>\nwhen we are out and about, visiting friends or going places rank much higher<br/>\nthen the days when we stay at home and spend our days playing video games<br/>\nand watching animes. The kids seem to like both, and we probably have a<br/>\nfairly good balance (ie out and about 1/3 of the time).<br/>\n<br/>\nAt this point, if I am honest with myself I have to admit I believe in<br/>\nunschooling, but I don&#39;t see the learning in my kids yet. I mean, when we<br/>\nengage in a video game or watch something, I can see what could be learned<br/>\nfrom it. But I have no clue what it is they are actually learning. My<br/>\ndaughter is into Pokemon battles these days. We played a lot on her DS and<br/>\non the wii in the past few days. I got her a pokedex book and we look into<br/>\nit for the appropriate strategies depending on the type of Pokemon. We had a<br/>\nlot of fun. She might learn some maths from it, and possibly some reading<br/>\nand I could list a lot of things she might be learning from it. What she IS<br/>\nactually learning... I really don&#39;t know.<br/>\n<br/>\nJolan&#39;s favorite activity is watching you tube video solutions of video<br/>\ngames. He&#39;s very dedicated to it. He can litterally do that for 16 hours in<br/>\none day. And again the next day. I have fewer ideas about what he could be<br/>\nlearning from it. I have no clue what he IS learning from it. It&#39;es strange<br/>\nthough, he is so meticulous and dedicated, it almost feels like he is<br/>\nstudying them. As if he had an internal curriculum that he is precisely<br/>\nfollowing.<br/>\n<br/>\nDad gets really upset about all these things and more. He sees video games<br/>\nand animes as useless, unproductive and stupid. He wants kids in bed at<br/>\n20:30 and can&#39;t understand why Jolan wants to stay up late. (Jolan went to<br/>\nbed at 3:00 am the day before yesterday, I have no clue what time he went to<br/>\nbed last night, I was fast asleep...)<br/>\n<br/>\nSince we got them out of school a few months ago, I&#39;ve tried to encourage<br/>\nthe kids to make compromises to please dad. We also  tried to do some<br/>\nschoolish activities in the morning. It just doesn&#39;t work. The kids sort of<br/>\ndo some efforts. It&#39;s noway near enough to make dad happy. Everybody ends up<br/>\ngrumpy and annoyed. There has to be a better way!<br/>\n<br/>\nClaire<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1314767466","msgId":62634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoza2ZwYSs4djlrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEVFMDAyNjhGLUU5RjktNDdBNC05RUIxLTAwREVBODk0OUFEOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62629,"nextInTopic":62709,"prevInTime":62633,"nextInTime":62635,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"... Sorry--bad joke. And absolutely about continued support! It will take a while for what you know up in your head to be tested in the world with your kids,","messageBody":"<div id=\"ygrps-yiv-916000772\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-Is that the flip side of, &quot;How can I miss you if you won&#39;t go away?&quot;-=-<br/>\n&gt; <br/>\n&gt; No.  It&#39;s not about me or about Claire either one.  It&#39;s about the benefit to her children of her staying in the flow of encouraging information rather than going home, losing ground, and coming back for a therapeutic catch-up.   Her kids will be better off if she doesn&#39;t get away from thinking about why and how and when and where of being present and joyful.-=-<br/>\n<br/>\n </span></blockquote>Sorry--bad joke.<br/>\n<br/>\nAnd absolutely about continued support! It will take a while for what you know up in your head to be tested in the world with your kids, and for that confidence to grow strong roots. Keep finding resources to help you through the rough patches. <br/>\n<br/>\nJoanna<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1314761421","msgId":62629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFMDAyNjhGLUU5RjktNDdBNC05RUIxLTAwREVBODk0OUFEOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGozazloais1amEwQGVHcm91cHMuY29tPg==","referencesHeader":"PGozazloais1amEwQGVHcm91cHMuY29tPg=="},"prevInTopic":62625,"nextInTopic":62634,"prevInTime":62628,"nextInTime":62630,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=-Is that the flip side of, How can I miss you if you won t go away? -=- No.  It s not about me or about Claire either one.  It s about the benefit to her","messageBody":"<div id=\"ygrps-yiv-65513288\">-=-Is that the flip side of, &quot;How can I miss you if you won&#39;t go away?&quot;-=-<br/>\n<br/>\nNo.  It&#39;s not about me or about Claire either one.  It&#39;s about the benefit to her children of her staying in the flow of encouraging information rather than going home, losing ground, and coming back for a therapeutic catch-up.   Her kids will be better off if she doesn&#39;t get away from thinking about why and how and when and where of being present and joyful.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Getting there?","postDate":"1314761075","msgId":62625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozazloais1amEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZERDc1MzQ3LTIzOTQtNDIzQS1BMDNGLTlDMTNDOUE4QTU1QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62612,"nextInTopic":62629,"prevInTime":62624,"nextInTime":62626,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"Is that the flip side of, How can I miss you if you won t go away?  Joanna","messageBody":"<div id=\"ygrps-yiv-43811373\">Is that the flip side of, &quot;How can I miss you if you won&#39;t go away?&quot;<br/>\n<br/>\n&lt;bwg&gt;<br/>\n<br/>\nJoanna<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-Can I come back for more of that now and then? ;-)-=-<br/>\n&gt; <br/>\n&gt; Dear Claire,<br/>\n&gt; <br/>\n&gt; If you come here every day, you won&#39;t need to come back. :-)<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1314727523","msgId":62612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZERDc1MzQ3LTIzOTQtNDIzQS1BMDNGLTlDMTNDOUE4QTU1QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRzB1VzhrSHN5X3VjOEpIMWZKdXQ3Q253UDNSUng0THoyUXNoMXdZUzhtb3lKRTZaQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGozZzdzNis0cjVwQGVHcm91cHMuY29tPiA8QUQ0RkIyQjEtNEYxRS00NDQ0LUJDQzktMzYyRUYwQ0IyRjNCQFNhbmRyYWRvZGQuY29tPiA8NEU1QkRENUIuOTA1MDYwNkBlYXJ0aGxpbmsubmV0PiA8Q0FHMHVXOG5VZ3ZIKzNTeFFKbkdpMk9aRTZfMl82VGdiRkFjTUhrTUo0RUtSWmdBYS1nQG1haWwuZ21haWwuY29tPiA8NTUwRkY2NTgtNjYzRC00MjVFLUFENTktQTJCRjQ5NzA3NDY3QFNhbmRyYWRvZGQuY29tPiA8Q0FHMHVXOGtIc3lfdWM4SkgxZkp1dDdDbndQM1JSeDRMejJRc2gxd1lTOG1veUpFNlpBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":62611,"nextInTopic":62625,"prevInTime":62611,"nextInTime":62613,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=-Can I come back for more of that now and then? ;-)-=- Dear Claire, If you come here every day, you won t need to come back. :-) Sandra [Non-text portions of","messageBody":"<div id=\"ygrps-yiv-681733361\">-=-Can I come back for more of that now and then? ;-)-=-<br/>\n<br/>\nDear Claire,<br/>\n<br/>\nIf you come here every day, you won&#39;t need to come back. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1314725402","msgId":62611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhrSHN5X3VjOEpIMWZKdXQ3Q253UDNSUng0THoyUXNoMXdZUzhtb3lKRTZaQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDU1MEZGNjU4LTY2M0QtNDI1RS1BRDU5LUEyQkY0OTcwNzQ2N0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGozZzdzNis0cjVwQGVHcm91cHMuY29tPgk8QUQ0RkIyQjEtNEYxRS00NDQ0LUJDQzktMzYyRUYwQ0IyRjNCQFNhbmRyYWRvZGQuY29tPgk8NEU1QkRENUIuOTA1MDYwNkBlYXJ0aGxpbmsubmV0Pgk8Q0FHMHVXOG5VZ3ZIKzNTeFFKbkdpMk9aRTZfMl82VGdiRkFjTUhrTUo0RUtSWmdBYS1nQG1haWwuZ21haWwuY29tPgk8NTUwRkY2NTgtNjYzRC00MjVFLUFENTktQTJCRjQ5NzA3NDY3QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":62610,"nextInTopic":62612,"prevInTime":62610,"nextInTime":62612,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"Waoooaaa Sandra. That s exactly what I need to read! THANKS :-))) Can I come back for more of that now and then? ;-) Claire 2011/8/30 Sandra Dodd","messageBody":"<div id=\"ygrps-yiv-2048876804\">Waoooaaa Sandra. That&#39;s exactly what I need to read! THANKS :-)))<br/>\n<br/>\nCan I come back for more of that now and then? ;-)<br/>\n<br/>\nClaire<br/>\n<br/>\n<br/>\n<br/>\n2011/8/30 Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-Dad is somewhat giving up, saying things like &quot;have it your way but I<br/>\n&gt; will<br/>\n&gt;<br/>\n&gt; take no responsability for the result&quot;... and &quot;but they will fail their<br/>\n&gt; life, I&#39;m certain they will&quot;... and &quot;don&#39;t count on me to support them when<br/>\n&gt; they&#39;re 20 and sitting at home being bums&quot;.... it feels like he&#39;s casting a<br/>\n&gt; dark prophecy...-=-<br/>\n&gt;<br/>\n&gt; Don&#39;t think of it as dark prophecy. You seem to understand your daughter&#39;s<br/>\n&gt; fear of school (and I hope it&#39;s natural and honest, and not created by you,<br/>\n&gt; but either way, you&#39;re sympathetic.<br/>\n&gt;<br/>\n&gt; You should try to understand your husband&#39;s fear of homeschooling the same<br/>\n&gt; way. You love him, he loves you (or you did at one time love each other) and<br/>\n&gt; he&#39;s afraid. Your move is to comfort and reassure him, or distract him and<br/>\n&gt; help him feel comfortable so he can sleep and eat better, so he can go to<br/>\n&gt; work and support your crazy idea of staying home.<br/>\n&gt;<br/>\n&gt; -=-Dad is somewhat giving up, saying things like &quot;have it your way but I<br/>\n&gt; will<br/>\n&gt; take no responsability for the result&quot;...-=-<br/>\n&gt;<br/>\n&gt; You could say &quot;Okay, but I think it&#39;s going to work well, and I&#39;ll share<br/>\n&gt; credit for the success.&quot;<br/>\n&gt;<br/>\n&gt; -=- and &quot;but they will fail their life, I&#39;m certain they will&quot;... -=-<br/>\n&gt;<br/>\n&gt; I don&#39;t know of anyone who has actually gotten unschooling to work at their<br/>\n&gt; houses and then had a child who grew up and &quot;failed in life.&quot; Not one. And<br/>\n&gt; IF I knew one, that would be one out of hundreds.<br/>\n&gt;<br/>\n&gt; Of hundreds of randomly chosen homeschooled kids, how many grow up and feel<br/>\n&gt; they are failures? Or have been told for years they are failures? Or had<br/>\n&gt; high dreams that didn&#39;t materialize, and so they feel bad? More than one, in<br/>\n&gt; each batch, no doubt.<br/>\n&gt;<br/>\n&gt; -=-and &quot;don&#39;t count on me to support them when they&#39;re 20 and sitting at<br/>\n&gt; home being bums&quot;.-=-<br/>\n&gt;<br/>\n&gt; Then just say happily, &quot;Okay, no problem.&quot; And smile. And give him a nice<br/>\n&gt; bit of food or drink, and sing and dance away. Infuse happiness into the<br/>\n&gt; situation. Thank him for giving you a chance to make this work. Work around<br/>\n&gt; him until he himself sees the benefits.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1314724991","msgId":62610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1MEZGNjU4LTY2M0QtNDI1RS1BRDU5LUEyQkY0OTcwNzQ2N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRzB1VzhuVWd2SCszU3hRSm5HaTJPWkU2XzJfNlRnYkZBY01Ia01KNEVLUlpnQWEtZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGozZzdzNis0cjVwQGVHcm91cHMuY29tPiA8QUQ0RkIyQjEtNEYxRS00NDQ0LUJDQzktMzYyRUYwQ0IyRjNCQFNhbmRyYWRvZGQuY29tPiA8NEU1QkRENUIuOTA1MDYwNkBlYXJ0aGxpbmsubmV0PiA8Q0FHMHVXOG5VZ3ZIKzNTeFFKbkdpMk9aRTZfMl82VGdiRkFjTUhrTUo0RUtSWmdBYS1nQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":62607,"nextInTopic":62611,"prevInTime":62609,"nextInTime":62611,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=-Dad is somewhat giving up, saying things like have it your way but I will take no responsability for the result ... and but they will fail their life, I m","messageBody":"<div id=\"ygrps-yiv-1516004528\">-=-Dad is somewhat giving up, saying things like &quot;have it your way but I will<br/>\ntake no responsability for the result&quot;... and &quot;but they will fail their<br/>\nlife, I&#39;m certain they will&quot;... and &quot;don&#39;t count on me to support them when<br/>\nthey&#39;re 20 and sitting at home being bums&quot;.... it feels like he&#39;s casting a<br/>\ndark prophecy...-=-<br/>\n<br/>\nDon&#39;t think of it as dark prophecy.  You seem to understand your daughter&#39;s fear of school (and I hope it&#39;s natural and honest, and not created by you, but either way, you&#39;re sympathetic.<br/>\n<br/>\nYou should try to understand your husband&#39;s fear of homeschooling the same way.  You love him, he loves you (or you did at one time love each other) and he&#39;s afraid.  Your move is to comfort and reassure him, or distract him and help him feel comfortable so he can sleep and eat better, so he can go to work and support your crazy idea of staying home.<br/>\n<br/>\n<br/>\n-=-Dad is somewhat giving up, saying things like &quot;have it your way but I will<br/>\ntake no responsability for the result&quot;...-=-<br/>\n<br/>\nYou could say &quot;Okay, but I think it&#39;s going to work well, and I&#39;ll share credit for the success.&quot;<br/>\n<br/>\n-=- and &quot;but they will fail their life, I&#39;m certain they will&quot;... -=-<br/>\n<br/>\nI don&#39;t know of anyone who has actually gotten unschooling to work at their houses and then had a child who grew up and &quot;failed in life.&quot;  Not one.  And IF I knew one, that would be one out of hundreds.<br/>\n<br/>\nOf hundreds of randomly chosen homeschooled kids, how many grow up and feel they are failures?  Or have been told for years they are failures?  Or had high dreams that didn&#39;t materialize, and so they feel bad?    More than one, in each batch, no doubt.<br/>\n<br/>\n-=-and &quot;don&#39;t count on me to support them when they&#39;re 20 and sitting at home being bums&quot;.-=-<br/>\n<br/>\nThen just say happily, &quot;Okay, no problem.&quot; And smile.  And give him a nice bit of food or drink, and sing and dance away.   Infuse happiness into the situation.  Thank him for giving you a chance to make this work.  Work around him until he himself sees the benefits.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1314723806","msgId":62607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhuVWd2SCszU3hRSm5HaTJPWkU2XzJfNlRnYkZBY01Ia01KNEVLUlpnQWEtZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRFNUJERDVCLjkwNTA2MDZAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGozZzdzNis0cjVwQGVHcm91cHMuY29tPgk8QUQ0RkIyQjEtNEYxRS00NDQ0LUJDQzktMzYyRUYwQ0IyRjNCQFNhbmRyYWRvZGQuY29tPgk8NEU1QkRENUIuOTA1MDYwNkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":62578,"nextInTopic":62610,"prevInTime":62606,"nextInTime":62608,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"The kids REALLY don t want to go to school. They re begging and begging and begging daily: please don t force us to go . I m trying to make it sound ","messageBody":"<div id=\"ygrps-yiv-863050683\">The kids REALLY don&#39;t want to go to school. They&#39;re begging and begging and<br/>\nbegging daily: &quot;please don&#39;t force us to go&quot;. I&#39;m trying to make it sound<br/>\ninteresting, they don&#39;t buy it. Avana says things like &quot;if you force me to<br/>\ngo, I&#39;ll behave so badly they will not keep me&quot;...<br/>\n<br/>\nDad is somewhat giving up, saying things like &quot;have it your way but I will<br/>\ntake no responsability for the result&quot;... and &quot;but they will fail their<br/>\nlife, I&#39;m certain they will&quot;... and &quot;don&#39;t count on me to support them when<br/>\nthey&#39;re 20 and sitting at home being bums&quot;.... it feels like he&#39;s casting a<br/>\ndark prophecy...<br/>\n<br/>\nI sooooo don&#39;t know what to do... How can I help change this? I wish I had<br/>\nmore faith in the kids and myself as their guide...<br/>\n<br/>\n<br/>\n<br/>\n2011/8/29 Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On 8/29/2011 7:50 AM, Sandra Dodd wrote:<br/>\n&gt; &gt; But if your husband doesn&#39;t want to do it, you really can&#39;t do it. It<br/>\n&gt; &gt; needs to be a family activity, a family project.<br/>\n&gt; I don&#39;t think it needs the other spouse to be fully on board and<br/>\n&gt; understand and thoroughly embrace all aspects of unschooling. I think it<br/>\n&gt; needs the other spouse (the one who is less informed, maybe doubtful or<br/>\n&gt; fearful), to be willing to have confidence in the one who is gungho<br/>\n&gt; unschooling and have at least a &quot;give it a try,&quot; attitude. And the<br/>\n&gt; gungho unschooling spouse needs to be willing to take the other spouse&#39;s<br/>\n&gt; fear and doubts seriously. It needs to not be adversarial - I think<br/>\n&gt; that&#39;s the important thing.<br/>\n&gt;<br/>\n&gt; My husband was not fully on board as an unschooling true believer for<br/>\n&gt; many years. He&#39;s always questioned whether or not the kids might have<br/>\n&gt; &quot;done better&quot; if they were schooled. He questioned it, but he also, at<br/>\n&gt; the same time, fully supported it. I don&#39;t see questioning something as<br/>\n&gt; a lack of support - we&#39;re doing this strange thing that he can&#39;t even<br/>\n&gt; really talk about with anybody at work (because he doesn&#39;t have the<br/>\n&gt; knowledge or skill to counter their pro-school arguments). It would seem<br/>\n&gt; uncaring and detached if he hadn&#39;t questioned it or expressed doubts at<br/>\n&gt; times.<br/>\n&gt;<br/>\n&gt; I gave him some stuff to read. He wasn&#39;t interested. I asked for him to<br/>\n&gt; be supportive while we tried it out with the understanding that I, too,<br/>\n&gt; would be open to changing my mind. He agreed mostly because he thought<br/>\n&gt; Roya&#39;s school year had been really clearly largely a waste of time and<br/>\n&gt; he didn&#39;t figure we&#39;d do worse than the school even if we did almost<br/>\n&gt; nothing. I put things we did into a journal for a few months and made<br/>\n&gt; them sound a bit educational - to help him make the connection between<br/>\n&gt; their play and their learning. I only kept that up for a few months but<br/>\n&gt; I do think it was helpful.<br/>\n&gt;<br/>\n&gt; I sometimes felt pretty impatient with his doubts because it was SO<br/>\n&gt; clear to me that the kids were thriving-- but, again, I was with them<br/>\n&gt; all day plus I was the one who really put my energy into understanding<br/>\n&gt; child development and human behavior and how learning happens and all<br/>\n&gt; that stuff. I was a much better observer of kids than he was, in<br/>\n&gt; general. I did, over time, realize that he thought the kids were doing<br/>\n&gt; fantastically well - he was super happy with them, but it is his nature<br/>\n&gt; to look at and comment on how things could be different/better and not<br/>\n&gt; to comment on how great things are. There is a cultural element there<br/>\n&gt; (dh is Iranian) - superstitionish ideas that commenting on good stuff<br/>\n&gt; will create bad luck.<br/>\n&gt;<br/>\n&gt; Anyway, I do think it is possible for parents to work out unschooling<br/>\n&gt; even when one partner is not fully on board if they are willing to work<br/>\n&gt; together anyway and be supportive of each other and care about each<br/>\n&gt; other&#39;s concerns, etc.<br/>\n&gt;<br/>\n&gt; -pam<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1314643291","msgId":62578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFNUJERDVCLjkwNTA2MDZAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PEFENEZCMkIxLTRGMUUtNDQ0NC1CQ0M5LTM2MkVGMENCMkYzQkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGozZzdzNis0cjVwQGVHcm91cHMuY29tPiA8QUQ0RkIyQjEtNEYxRS00NDQ0LUJDQzktMzYyRUYwQ0IyRjNCQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":62571,"nextInTopic":62607,"prevInTime":62577,"nextInTime":62579,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"... I don t think it needs the other spouse to be fully on board and understand and thoroughly embrace all aspects of unschooling. I think it needs the other","messageBody":"<div id=\"ygrps-yiv-1125005104\">On 8/29/2011 7:50 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But if your husband doesn&#39;t want to do it, you really can&#39;t do it. It <br/>\n&gt; needs to be a family activity, a family project.<br/>\n </span></blockquote>I don&#39;t think it needs the other spouse to be fully on board and <br/>\nunderstand and thoroughly embrace all aspects of unschooling. I think it <br/>\nneeds the other spouse (the one who is less informed, maybe doubtful or <br/>\nfearful), to be willing to have confidence in the one who is gungho <br/>\nunschooling and have at least a &quot;give it a try,&quot; attitude. And the <br/>\ngungho unschooling spouse needs to be willing to take the other spouse&#39;s <br/>\nfear and doubts seriously. It needs to not be adversarial - I think <br/>\nthat&#39;s the important thing.<br/>\n<br/>\nMy husband was not fully on board as an unschooling true believer for <br/>\nmany years. He&#39;s always questioned whether or not the kids might have <br/>\n&quot;done better&quot; if they were schooled. He questioned it, but he also, at <br/>\nthe same time, fully supported it. I don&#39;t see questioning something as <br/>\na lack of support - we&#39;re doing this strange thing that he can&#39;t even <br/>\nreally talk about with anybody at work (because he doesn&#39;t have the <br/>\nknowledge or skill to counter their pro-school arguments). It would seem <br/>\nuncaring and detached if he hadn&#39;t questioned it or expressed doubts at <br/>\ntimes.<br/>\n<br/>\nI gave him some stuff to read. He wasn&#39;t interested. I asked for him to <br/>\nbe supportive while we tried it out with the understanding that I, too, <br/>\nwould be open to changing my mind. He agreed mostly because he thought <br/>\nRoya&#39;s school year had been really clearly largely a waste of time and <br/>\nhe didn&#39;t figure we&#39;d do worse than the school even if we did almost <br/>\nnothing. I put things we did into a journal for a few months and made <br/>\nthem sound a bit educational - to help him make the connection between <br/>\ntheir play and their learning. I only kept that up for a few months but <br/>\nI do think it was helpful.<br/>\n<br/>\nI sometimes felt pretty impatient with his doubts because it was SO <br/>\nclear to me that the kids were thriving-- but, again, I was with them <br/>\nall day plus I was the one who really put my energy into understanding <br/>\nchild development and human behavior and how learning happens and all <br/>\nthat stuff. I was a much better observer of kids than he was, in <br/>\ngeneral. I did, over time, realize that he thought the kids were doing <br/>\nfantastically well - he was super happy with them, but it is his nature <br/>\nto look at and comment on how things could be different/better and not <br/>\nto comment on how great things are. There is a cultural element there <br/>\n(dh is Iranian) - superstitionish ideas that commenting on good stuff <br/>\nwill create bad luck.<br/>\n<br/>\nAnyway, I do think it is possible for parents to work out unschooling <br/>\neven when one partner is not fully on board if they are willing to work <br/>\ntogether anyway and be supportive of each other and care about each <br/>\nother&#39;s concerns, etc.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Getting there?","postDate":"1314629417","msgId":62571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFENEZCMkIxLTRGMUUtNDQ0NC1CQ0M5LTM2MkVGMENCMkYzQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGozZzdzNis0cjVwQGVHcm91cHMuY29tPg==","referencesHeader":"PGozZzdzNis0cjVwQGVHcm91cHMuY29tPg=="},"prevInTopic":62569,"nextInTopic":62578,"prevInTime":62570,"nextInTime":62572,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"-=-how can I go from believing to knowing? How did you seasoned unschoolers make it?-=- By seeing it work for your children.  At first it s faith in what","messageBody":"<div id=\"ygrps-yiv-4841541\">-=-how can I go from believing to knowing? How did you seasoned unschoolers make it?-=-<br/>\n<br/>\nBy seeing it work for your children.  At first it&#39;s faith in what someone else says, or in other families you&#39;ve seen.  At some point it would come to be about your own experiences with your own children.<br/>\n<br/>\nBut if your husband doesn&#39;t want to do it, you really can&#39;t do it.  It needs to be a family activity, a family project.<br/>\n<br/>\n-=- I take full responsability for unschooling the kids. A kind of leap of<br/>\n faith, me stating &quot;we&#39;ll do it this way, no discussion&quot; (in intention if not<br/>\n in words).-=-<br/>\n<br/>\nYou can&#39;t do that any more than you could personally move the family to Japan or personally buy a yacht, without your husband agreeing and helping out.<br/>\n<br/>\n-=- Keep the kids home with a curriculum: I might be able to convince my<br/>\n<blockquote><span title=\"ireply\"> &gt; husband to homeschool if we follow a curriculum... that would probably be<br/>\n&gt; easier on my son (my daughter loves schoolish work, so I don&#39;t worry about<br/>\n&gt; her too much). But It won&#39;t help us meet people and I am afraid it will<br/>\n&gt; prevent us from deschooling-=-<br/>\n<br/>\n </span></blockquote>If he will go along with that, it would keep your kids from being in school which they seem afraid of or resistant to.   Don&#39;t demonize school.  That goes for anyone here.  If you live a life of ANTI-school, of school is the devil, what happens if you die and your kids end up in school?  And too much anti-school creates complacency in homeschooling parents.  If you decide school is nothing but harm and abuse with no redeeming value, then it would be easy to do NOTHING and say to yourself &quot;It&#39;s better than school.&quot;   But if you see the value in school, and the benefits, then THAT is what your life needs to be better than.  And not slightly, barely better, but so much better that relatives and government officials can see it without even looking very closely.  It should be impressive.<br/>\n<br/>\nThis is not really a bad idea:<br/>\n<br/>\n-=-&gt; We have an urgent decision to make as the new school year starts next week:<br/>\n<blockquote><span title=\"ireply\"> &gt; - Put the kids back in school: Dad&#39;s 1st and only choice. There are a<br/>\n&gt; few good sides to it: it would help us meet people in this city where we<br/>\n&gt; hardly know anybody. The kids would get to know the other kids in our<br/>\n&gt; building and neighborhood. And it would hopefully give us adults<br/>\n&gt; some breathing room (as in less tension between Mum and Dad) to work more at<br/>\n&gt; making the marriage work. The kids say VERY clearly that they don&#39;t want to<br/>\n&gt; go.-=-<br/>\n<br/>\n </span></blockquote>Let your husband have his way LOTS and he will let you have your way more easily. It works with kids, it works with husbands.<br/>\n<br/>\nFind ways to persuade the kids to want to go, and if it&#39;s NOT terrible, then all the benefits you&#39;ve listed kick in.  If it is terrible (and don&#39;t try to design that or to sabotage the potential good), then your husband will see that.  The strongest position you could be in would be for your husband to want to homeschool, but don&#39;t entrap or trick or anything.  Try for the best of school.    If it&#39;s your husband&#39;s only choice, why could you be considering otherwise right now anyway?<br/>\n<br/>\nHelp the kids with schoolwork to get your son caught up, and do it happily, as a joyful, laughter-filled game.  Sing his math, and dance his reading.  Tell him you love having fun with him (regardless of whether he&#39;s &quot;making progress&quot; or not).  Make it funny to do it right, and funny to do it wrong, and all fun.  &quot;You&#39;ll get it soon&quot; is better than &quot;Why didn&#39;t you get it yet!?&quot;   And for your husband, too.  He&#39;ll get it soon is better than he will never get it.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Getting there?","postDate":"1314628294","msgId":62569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozZzdzNis0cjVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1VzhrbysyWnBYXzREajZORm5rSnRDaXJoK1VWdHRjTTc1dEhfU1NVZ1VHZEVDUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62563,"nextInTopic":62571,"prevInTime":62568,"nextInTime":62570,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"I m quoting this whole post because I didn t get it in my mailbox and I want to respond from e-mail.  So I m sorry if I m the only one who didn t get it and","messageBody":"<div id=\"ygrps-yiv-23753402\">I&#39;m quoting this whole post because I didn&#39;t get it in my mailbox and I want to respond from e-mail.  So I&#39;m sorry if I&#39;m the only one who didn&#39;t get it and it&#39;s too much.<br/>\n<br/>\nFor anyone wanting to consider how to respond to this, too, Claire is French, lives near Geneva (in France, though), and her husband is Malagasy (from Madagascar). Those factors make a difference.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Claire Darbaud &lt;cdarbaud@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; We&#39;re not unschooling yet.<br/>\n&gt; <br/>\n&gt; We&#39;ve taken the kids out of school in March, moved to a new home in a new<br/>\n&gt; city reuniting with Dad. Our kids are 6 and 7,5 years old. We did some<br/>\n&gt; &quot;school&quot; stuff to please dad and the school district. The school district<br/>\n&gt; was happy. Not Dad...<br/>\n&gt; <br/>\n&gt; Dad doesn&#39;t understand unschooling and doesn&#39;t want to hear about it. He<br/>\n&gt; wants the kids back in school. But our son was struggling in school in 1st<br/>\n&gt; grade and I suppose it would be super hard for him to go into 2nd grade with<br/>\n&gt; only half a 1st grade of struggling. He can hardly read... But if we ask for<br/>\n&gt; him to go back into 1st grade, I&#39;m afraid he will feel like a failure...<br/>\n&gt; <br/>\n&gt; Currently, we are in a nowhere land... A lot of our days are somewhat dull.<br/>\n&gt; The kids get up and get hooked on their computers as soon as they walk into<br/>\n&gt; our living room. Our son refuses most our offers for outside activities<br/>\n&gt; (like going for a bike ride with Dad, going swimming - which he loves<br/>\n&gt; though)... Our daughter gets super fidgetty around her computer. She<br/>\n&gt; complains that she is bored a lot, but a lot of the time, I feel lost and<br/>\n&gt; confused and not sure what to offer... I try my best but at this stage I<br/>\n&gt; really don&#39;t think I&#39;m doing a very good job at it.<br/>\n&gt; <br/>\n&gt; I am full of doubts. Maybe I don&#39;t have what it takes to be unschooling? I<br/>\n&gt; am also full of fears and doubts. Will they really learn what they need to<br/>\n&gt; thrive?<br/>\n&gt; <br/>\n&gt; Could it be that I am deschooling myself and that it&#39;s way harder then I had<br/>\n&gt; thought? How do you go from believing unschooling works to knowing it does?<br/>\n&gt; Is Mum feeling dull and bored and confused part of deschooling?<br/>\n&gt; <br/>\n&gt; We have an urgent decision to make as the new school year starts next week:<br/>\n&gt; - Put the kids back in school: Dad&#39;s 1st and only choice. There are a<br/>\n&gt; few good sides to it: it would help us meet people in this city where we<br/>\n&gt; hardly know anybody. The kids would get to know the other kids in our<br/>\n&gt; building and neighborhood.  And it would hopefully give us adults<br/>\n&gt; some breathing room (as in less tension between Mum and Dad) to work more at<br/>\n&gt; making the marriage work. The kids say VERY clearly that they don&#39;t want to<br/>\n&gt; go.<br/>\n&gt; <br/>\n&gt; - Keep the kids home with a curriculum: I might be able to convince my<br/>\n&gt; husband to homeschool if we follow a curriculum... that would probably be<br/>\n&gt; easier on my son (my daughter loves schoolish work, so I don&#39;t worry about<br/>\n&gt; her too much). But It won&#39;t help us meet people and I am afraid it will<br/>\n&gt; prevent us from deschooling. I doubt we can do &quot;enough&quot; to please Dad...<br/>\n&gt; this could mean ongoing tension and conflict...<br/>\n&gt; <br/>\n&gt; - I take full responsability for unschooling the kids. A kind of leap of<br/>\n&gt; faith, me stating &quot;we&#39;ll do it this way, no discussion&quot; (in intention if not<br/>\n&gt; in words). With other &quot;problem&quot; areas (like sweets and chocolate and coca<br/>\n&gt; cola...) it really worked. There was a lot of tension about these between my<br/>\n&gt; husband and I untill I came to peace with them inside me. Then the tension<br/>\n&gt; was gone. Which takes me back to my question: how can I go from believing to<br/>\n&gt; knowing? How did you seasoned unschoolers make it?<br/>\n&gt; <br/>\n&gt; Claire<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Getting there?","postDate":"1314603183","msgId":62563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhrbysyWnBYXzREajZORm5rSnRDaXJoK1VWdHRjTTc1dEhfU1NVZ1VHZEVDUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":62569,"prevInTime":62562,"nextInTime":62564,"topicId":62563,"numMessagesInTopic":0,"msgSnippet":"We re not unschooling yet. We ve taken the kids out of school in March, moved to a new home in a new city reuniting with Dad. Our kids are 6 and 7,5 years old.","messageBody":"<div id=\"ygrps-yiv-1139193147\">We&#39;re not unschooling yet.<br/>\n<br/>\nWe&#39;ve taken the kids out of school in March, moved to a new home in a new<br/>\ncity reuniting with Dad. Our kids are 6 and 7,5 years old. We did some<br/>\n&quot;school&quot; stuff to please dad and the school district. The school district<br/>\nwas happy. Not Dad...<br/>\n<br/>\nDad doesn&#39;t understand unschooling and doesn&#39;t want to hear about it. He<br/>\nwants the kids back in school. But our son was struggling in school in 1st<br/>\ngrade and I suppose it would be super hard for him to go into 2nd grade with<br/>\nonly half a 1st grade of struggling. He can hardly read... But if we ask for<br/>\nhim to go back into 1st grade, I&#39;m afraid he will feel like a failure...<br/>\n<br/>\nCurrently, we are in a nowhere land... A lot of our days are somewhat dull.<br/>\nThe kids get up and get hooked on their computers as soon as they walk into<br/>\nour living room. Our son refuses most our offers for outside activities<br/>\n(like going for a bike ride with Dad, going swimming - which he loves<br/>\nthough)... Our daughter gets super fidgetty around her computer. She<br/>\ncomplains that she is bored a lot, but a lot of the time, I feel lost and<br/>\nconfused and not sure what to offer... I try my best but at this stage I<br/>\nreally don&#39;t think I&#39;m doing a very good job at it.<br/>\n<br/>\nI am full of doubts. Maybe I don&#39;t have what it takes to be unschooling? I<br/>\nam also full of fears and doubts. Will they really learn what they need to<br/>\nthrive?<br/>\n<br/>\nCould it be that I am deschooling myself and that it&#39;s way harder then I had<br/>\nthought? How do you go from believing unschooling works to knowing it does?<br/>\nIs Mum feeling dull and bored and confused part of deschooling?<br/>\n<br/>\nWe have an urgent decision to make as the new school year starts next week:<br/>\n- Put the kids back in school: Dad&#39;s 1st and only choice. There are a<br/>\nfew good sides to it: it would help us meet people in this city where we<br/>\nhardly know anybody. The kids would get to know the other kids in our<br/>\nbuilding and neighborhood.  And it would hopefully give us adults<br/>\nsome breathing room (as in less tension between Mum and Dad) to work more at<br/>\nmaking the marriage work. The kids say VERY clearly that they don&#39;t want to<br/>\ngo.<br/>\n<br/>\n- Keep the kids home with a curriculum: I might be able to convince my<br/>\nhusband to homeschool if we follow a curriculum... that would probably be<br/>\neasier on my son (my daughter loves schoolish work, so I don&#39;t worry about<br/>\nher too much). But It won&#39;t help us meet people and I am afraid it will<br/>\nprevent us from deschooling. I doubt we can do &quot;enough&quot; to please Dad...<br/>\nthis could mean ongoing tension and conflict...<br/>\n<br/>\n- I take full responsability for unschooling the kids. A kind of leap of<br/>\nfaith, me stating &quot;we&#39;ll do it this way, no discussion&quot; (in intention if not<br/>\nin words). With other &quot;problem&quot; areas (like sweets and chocolate and coca<br/>\ncola...) it really worked. There was a lot of tension about these between my<br/>\nhusband and I untill I came to peace with them inside me. Then the tension<br/>\nwas gone. Which takes me back to my question: how can I go from believing to<br/>\nknowing? How did you seasoned unschoolers make it?<br/>\n<br/>\nClaire<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":63367,"nextTopicId":63511}}