{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I&#39;d like to add this to the spanking collection","postDate":"1084821272","msgId":94204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJhLjU2N2JiZmM0LjJkZGE2OTE4QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":94203,"nextInTime":94205,"topicId":94204,"numMessagesInTopic":0,"msgSnippet":"Please ask your daughter if it s okay if I add this to the spanking stories page. http://sandradodd.com/spanking It s a really, really good story.  If she s","messageBody":"<div id=\"ygrps-yiv-888978455\">Please ask your daughter if it&#39;s okay if I add this to the spanking stories <br/>\npage. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spanking\">http://sandradodd.com/spanking</a> <br/>\n<br/>\nIt&#39;s a really, really good story.  If she&#39;s nervous about it, I&#39;d understand <br/>\nand won&#39;t press.  If she wants to add or tell it in her own words or whatever <br/>\nthat would be great.  I&#39;ll put as much or as little (or nothing) as she wants.<br/>\n<br/>\n--------------------------------------------------------------<br/>\n<br/>\n<br/>\nIn a message dated 5/17/04 11:20:54 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> writes:<br/>\n<br/>\n&lt;&lt; They never realized that there was anything wrong with it when it was done <br/>\nto <br/>\n<br/>\nthem, so they continue the behavior because that&#39;s what they think is normal. <br/>\n<br/>\n&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nRight. &quot;And *I* turned out just fine&quot; seems to be the mantra.<br/>\n<br/>\n<br/>\n*****************<br/>\n<br/>\n       DD14 just told me about a conversation along these lines.<br/>\n<br/>\n       She performed in a recital/musical theatre revue on Saturday. It <br/>\ninvolved all ages, but her own peer group within the &quot;company&quot; is six or <br/>\nseven <br/>\ngirls and a couple of boys, age 13-16 or so. (A couple are homeschooled, none <br/>\nis <br/>\nunschooled except DD, but a few others do have thoughtful, mindful parents.) <br/>\nThey&#39;d been together in the theatre almost around the clock, what with dress <br/>\nrehearsal and an earlier show that day, and they were cooling their heels in <br/>\nthe <br/>\nwings in costume, before the first number of the second show. <br/>\n<br/>\n       As DD tells it, someone mentioned what a brat one of the youngest <br/>\ndancers was, what a pain, why didn&#39;t her parents make her behave better, be <br/>\nquieter and less of a prima donna.  DD helps work with the younger ones and <br/>\nknows <br/>\nthem pretty well, so she said oh, no, really they&#39;re all great kids. <br/>\n<br/>\n       Several of the others turned on her and said not this one, this one <br/>\nneeds lots morems, like DD, had never been <br/>\nspanked or slapped or even given a &quot;time-out.&quot;.) <br/>\n<br/>\n       One of these girls suggested maybe all the spanking and swatting could <br/>\nbe part of the problem rather than the answer, to a chorus of angry denial <br/>\nfrom those who grew up being hit by their parents. They started telling <br/>\nstories <br/>\nto show being spanked was necessary to being raised right, saying &quot;DUH - <br/>\nthat&#39;s why they call it *discipline*!&quot; and that it had made them moral and <br/>\nwell-behaved -- if ganging up to make mean remarks about some smaller child <br/>\nin your <br/>\ncircle can be considered moral or well-behaved &lt;grrr&gt;<br/>\n<br/>\n       What was really interesting though, and the reason I bring it up now, <br/>\nis that DD said she realized at that point there was nothing to say. At least <br/>\nthere was nothing anyone who&#39;d never been hit or punished could say. Her few <br/>\ngently parented peers there just seemed to sense that anything they said <br/>\nwould <br/>\nsound like a put-down of someone else&#39;s parents. And that it wouldn&#39;t help <br/>\nanybody, anyway.<br/>\n<br/>\n       Here is the Power of Story I see in this. By the teen years, being <br/>\nspanked and smacked becomes something its victims must either internalize and <br/>\ndefend, or break from their family&#39;s teachings to reject (two really poor <br/>\nlife <br/>\nchoices for a young teen, imo). But NOT being smacked and spanked seems by <br/>\nthe <br/>\nteen years to foster a natural, internal kind of moral, well-behaved <br/>\nsensitivity (one that even the girls themselves weren&#39;t conscious of). <br/>\n<br/>\n       These lovely, thoughtful, beautifully mannered, compassionate and <br/>\nhappy girls were just sad and felt sorry about what others had been taught to <br/>\nbelieve, and so today I&#39;m thinking of this as one of the first world windows <br/>\nthrough which DD and her similarly parented peers are seeing for themselves <br/>\nthe <br/>\nlogical results of how humans treat each other --  and DD and I both are <br/>\ndespairing  of how to ever share this with those who&#39;ve had other <br/>\nsensibilities beaten <br/>\ninto (or out of) them. JJ<br/>\n<blockquote><span title=\"qreply\">  &gt;&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":94141,"nextTopicId":94092}}