{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"marianne","from":"&quot;marianne&quot; &lt;tonitoni@...&gt;","profile":"mariannenz2001","replyTo":"LIST","senderId":"YWKEhHDKl3r1XTQgL-OnKiY8I5FObzz-o4sZXpHVnNQh-YqFHQiBDVkCx6RAGggZWWllQwtQ66Z-kvyKPXXWOxSSmbv-lKo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Great article in Canadian paper","postDate":"1003258441","msgId":26904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlxaHZvOStwczBrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMuMC41LjMyLjIwMDExMDE1MTc1NTE2LjAwN2JlZDIwQHBvcC50ZWx1cy5uZXQ+"},"prevInTopic":26898,"nextInTopic":0,"prevInTime":26903,"nextInTime":26905,"topicId":26898,"numMessagesInTopic":0,"msgSnippet":"How ... front page ... doing my 13yr old dd no favours by not sending her to school - she would never learn the social skills she needs to get a job. My ds","messageBody":"<div id=\"ygrps-yiv-844397182\">How<br/>\n<blockquote><span title=\"ireply\"> &gt; are your children socialized&quot; ..out comes a great article on the <br/>\n </span></blockquote>front page<br/>\n<blockquote><span title=\"ireply\"> &gt; of the National Post (one of Canada&#39;s national daily papers). <br/>\n&gt; Read on and enjoy!<br/>\n&gt; Brooke in BC<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I have been getting some flack from my 34yr ds, who told me I was <br/>\n </span></blockquote>doing my 13yr old dd no favours by not sending her to school - she <br/>\nwould never learn the social skills she needs to get a job.<br/>\nMy ds went to ps, and is academically gifted.<br/>\n<br/>\nI have sent him part of this article to do with socializing and <br/>\ntesting!!!!!<br/>\n<br/>\nNow we will see what he has to say.<br/>\n<br/>\nMarianne</div>","specialLinks":[]},{"userId":0,"authorName":"Campbell","from":"Campbell &lt;wegirls@...&gt;","replyTo":"LIST","senderId":"TbjdeDv5f2h6SR6fhsvdbH4fBk1DQxa-w71K3zB_1yQ-scKoaBcgcRzxd7Xf60xkXKna3BAcz4wKtUeqUNr4vbZXsg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Great article in Canadian paper","postDate":"1003193716","msgId":26898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMuMC41LjMyLjIwMDExMDE1MTc1NTE2LjAwN2JlZDIwQHBvcC50ZWx1cy5uZXQ+"},"prevInTopic":0,"nextInTopic":26904,"prevInTime":26897,"nextInTime":26899,"topicId":26898,"numMessagesInTopic":0,"msgSnippet":"Hi all, Just when we are getting really tired of hearing the old line.. How are your children socialized ..out comes a great article on the front page of the","messageBody":"<div id=\"ygrps-yiv-1761138607\">Hi all, Just when we are getting really tired of hearing the old line..&quot;How<br/>\nare your children socialized&quot; ..out comes a great article on the front page<br/>\nof the National Post (one of Canada&#39;s national daily papers). <br/>\nRead on and enjoy!<br/>\nBrooke in BC<br/>\n<br/>\n<br/>\nChildren schooled at home have better social skills<br/>\nChallenges orthodoxy<br/>\n<br/>\n<br/>\nJulie Smyth<br/>\nNational Post<br/>\n <br/>\nPeter J. Thompson, National Post<br/>\n<br/>\n<br/>\nHome schooling parent Pamela Christie helps her son Nolan, 7.<br/>\n<br/>\n <br/>\nChildren who are educated at home have better social skills and achieve<br/>\nhigher grades on standardized tests than students in private or public<br/>\nschools, according to a new report.<br/>\n<br/>\nContrary to the popular belief that children educated at home are<br/>\ndisadvantaged because of a lack of peers, the study by the Fraser Institute<br/>\nshows they are happier, better adjusted and more sociable that those at<br/>\ninstitutional schools. The average child educated at home participates in a<br/>\nrange of activities with other children outside the family and 98% are<br/>\ninvolved in two or more extracurricular activities such as field trips and<br/>\nmusic lessons per week, the report says.<br/>\n<br/>\nHome-schooled children also regularly outperform other students on<br/>\nstandardized tests.<br/>\n<br/>\nChildren taught at home in Canada score, on average, at the 80th percentile<br/>\nin reading, at the 76th percentile in languages and at the 79th percentile<br/>\nin mathematics, the report shows. Private and public students perform, on<br/>\naverage, in the 50th percentile on mandatory tests in the same subjects.<br/>\n<br/>\nIn the United States, students educated at home also achieve the highest<br/>\ngrades on standardized tests and outperform other students on college<br/>\nentrance exams, including the Scholastic Aptitude Test (SAT), according to<br/>\nthe study.<br/>\n<br/>\nParents of home-schooled children in both countries are generally higher<br/>\neducated when compared to the national average.<br/>\n<br/>\nThey tend to be in two-parent families and have a higher-than-average<br/>\nnumber of children than the overall population.<br/>\n<br/>\nPatrick Basham, a senior fellow at the Cato Institute, a conservative<br/>\npublic policy group in Washington, and author of the report, said he was<br/>\nsurprised to see such positive results linked to home schooling.<br/>\n<br/>\n&quot;People think these children are neurotic, unsocialized and can&#39;t function<br/>\nin normal society. But the opposite is true. I think the fact children<br/>\neducated at home do better than private school students would also surprise<br/>\npeople. It is not something that is widely debated or studied,&quot; he said.<br/>\n<br/>\nHome-schooled children are still a tiny minority in Canada, although an<br/>\nincreasing number of parents are opting for this style of education. In<br/>\n1979, 2,000 children were educated at home. By 1996, 17,500 students --<br/>\n0.4% of total enrollment -- were home schooled. The most recent figures<br/>\nshow the number has risen to 80,000 children.<br/>\n<br/>\nParents educate their children at home for a variety of reasons, including<br/>\nthe desire to impart a particular set of beliefs and values, an interest in<br/>\nhigher academic performance and a lack of discipline in public schools,<br/>\nsays the report.<br/>\n<br/>\n&quot;Although parents home school their children for myriad reasons, the<br/>\nprincipal stimulus is dissatisfaction with public education,&quot; said Claudia<br/>\nHepburn, director of education policy at the Fraser Institute, a<br/>\nVancouver-based conservative think-tank.<br/>\n<br/>\nHome schooling is legal throughout Canada, but most provinces require<br/>\nparents comply with provincial education legislation, which means they must<br/>\nprovide satisfactory instruction. Alberta is the only province that funds<br/>\nhome-based education.<br/>\n<br/>\nNone of the provinces requires that parents have teaching qualifications.<br/>\nHowever, having one parent who is a certified teacher has no significant<br/>\neffect on the achievement of students educated at home, the research shows.<br/>\n<br/>\nGary Duthler, executive director of the Federation of Independent Schools<br/>\nin Canada, the association for non-public schools, said children educated<br/>\nat home likely do better and are more sociable because of the smaller<br/>\nstudent-teacher ratio and the fact students of all ages learn together.<br/>\n<br/>\n&quot;In institutional schools, there is social pressure for 10-year-old<br/>\nchildren to behave like other 10-year-olds and they tend to not play with<br/>\nany older children at school.<br/>\n<br/>\n&quot;In a home setting, that same pressure is not there, so it helps the<br/>\nchildren mature.&quot;<br/>\n<br/>\nHe said they probably also do well because they have access to education<br/>\nresources and teaching expertise over the Internet but their parents are<br/>\ncontrolling their education.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wegirls@...\">wegirls@...</a></div>","specialLinks":[]}],"prevTopicId":26900,"nextTopicId":26908}}