{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":321996436,"authorName":"Alex","from":"&quot;Alex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Lost and Confused","postDate":"1351451956","msgId":69507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2azBmays0N2k3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2aDdtaSt2a2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":69499,"nextInTopic":0,"prevInTime":69506,"nextInTime":69508,"topicId":69456,"numMessagesInTopic":0,"msgSnippet":"Hi there, Just a couple thoughts from someone who has had adult in-laws move in with us for 2 1/2 years ongoing and 16 mos just moved out today. Your parents","messageBody":"<div id=\"ygrps-yiv-1587646520\">Hi there, <br/>\n<br/>\nJust a couple thoughts from someone who has had adult in-laws move in with us for 2 1/2 years ongoing and 16 mos just moved out today. Your parents probably feel trapped too. To you the reasons may seem unavoidable. To them, fair or not, they may at least in part see it as the result of of a string of bad or questionable decisions that you made that adversely affected them. (Please don&#39;t take this as a request to elaborate--it doesn&#39;t matter!) In my experience that would make them understandably leary of any new decisions that you make that are not the most obvious right choice. If that is true, and possibly even if not, making an issue out of whether you are right is going to be a lot less effective than focusing as an individual and parent on gratitude for their generosity (whether or not you pay some of the bills), what you enjoy doing together, and building connections with them. What positive things can they offer you and your kids? <br/>\n<br/>\nHave you been taking advantage of the opportunity for your kids to hear family stories and ask questions about how their lives/the world used to be different? We very often ask my daughter&#39;s grandma and great-grandparents about things we encounter during the week, and how they used to be. Some stuff is boring to my daughter now at 5 but some is fascinating and/or hilarious, like how people celebrated holidays, and what were new inventions back in the day--like tape! Might this be a good time for you to formalize some family history research with interviews, research, trees etc? Ancestry.com has a free trial and more than one family member can sign up one after another. There&#39;s a book called Listening Is An Act of Love that has a great list of family history questions, and your library & the internet probably have similar resources. Notice I said YOU. You can do this, all this, for everyone, and your parents will feel loved and appreciated and happy that their grandkids are being exposed to them and history--a real school subject!--through it. Family history documentation makes a good holiday gift when money is tight. I also find that asking people in a positive way what they enjoyed, remembered, and really was able to apply later from school is interesting for both of us. You may be not ready for that with your family if you&#39;re in an adversarial rut. <br/>\n<br/>\nIt&#39;s a real gift to learn how to ask questions that make people feel like you&#39;re interested in them. It&#39;s even more awesome to learn how to ask people who seem boring questions that will prompt them to tell you interesting things. The longer you live, the more weird crap you see. :)<br/>\n<br/>\nEveryone wants peace where they live. Most if not all people want to fully relax alone, sometimes. It&#39;s nice when in someone else&#39;s home to let them know when they can expect you to be gone for a while so they can anticipate and enjoy that peace. Going out a lot is often good for unschooling anyway. If you pack lunches, you and your kids choose what you bring, and that can help you be more relaxed about the food situation when you are at home. I don&#39;t know if you&#39;re being questioned a lot, but being out for a long time and coming home with library books or having said you were at the library (doing what you want) could give an impression of &quot;educating.&quot; I worked in an independant school where the head of the middle school said kids at that age learn so much better from just doing because of puberty etc and she wished we could build a farm. Feel free to quote me!<br/>\n<br/>\nThe flip side is making sure that anyone you&#39;re staying with feels that you value spending time with them. If you secretly schedule a weekly time for yourself when you check in with one or both of them with only the plan of being friendly, pleasant, and asking how they are doing, it will take a lot of strain off the relationship. At least that&#39;s our experience coming from the other end. Or maybe you could have a special theme night the same night every week--game night, or some kind of food thing where you cook dinner.<br/>\n<br/>\nIf you focus on what you can do to help your parents relax in general, you will reap the benefits of them being more relaxed in general, and model kindness for your kids. My MIL works with little kids and finds it wonderfully theraputic when I set up craft projects for her and my kid. I got pissed off and swore to my husband I wasn&#39;t going to do all the work to maintain our relationship any more at one point, but she has warm fuzzy feelings about me when I do, and then I like her more too, and everyone wins. <br/>\n<br/>\nGood luck-<br/>\nAlex N.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost and Confused","postDate":"1351433507","msgId":69499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwNzczRDJBLUQ0MzYtNEYzNy04NTNDLTVEMDMzM0IyNEE3N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2aWxxMStqa2NjQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2aWxxMStqa2NjQGVHcm91cHMuY29tPg=="},"prevInTopic":69496,"nextInTopic":69507,"prevInTime":69498,"nextInTime":69500,"topicId":69456,"numMessagesInTopic":0,"msgSnippet":"-=-Always Learning is, in my opinion, absolutely the best place to be if you want to understand unschooling.-=- Thanks, Bob. That s a weighty recommendation,","messageBody":"<div id=\"ygrps-yiv-220267117\">-=-Always Learning is, in my opinion, absolutely the best place to be if you want to understand unschooling.-=-<br/>\n<br/>\nThanks, Bob.<br/>\n<br/>\nThat&#39;s a weighty recommendation, because I&#39;d bet any amount of money that Bob Collier has read more of what&#39;s available online and in current publications, regarding parenting, alternative education and home schooling, than anyone else.  For years he published lists of what was good and new, and you can go back through those  ideas at his site:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parental-intelligence.com\">http://www.parental-intelligence.com</a><br/>\n<br/>\nThere are other things you can look through that might be good to show parents in my smaller collection here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://unschooling.blogspot.com\">http://unschooling.blogspot.com</a><br/>\n<br/>\nIt&#39;s mostly news articles.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Lost and Confused","postDate":"1351408257","msgId":69496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2aWxxMStqa2NjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2aDdtaSt2a2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":69467,"nextInTopic":69499,"prevInTime":69495,"nextInTime":69497,"topicId":69456,"numMessagesInTopic":0,"msgSnippet":"... Well the problem is my parents. Their are very old school and the only school there can be is hours and hours of vigorous math problems, history lessons,","messageBody":"<div id=\"ygrps-yiv-906369005\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;amberb.sanders&quot; &lt;amberb.sanders@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>Well the problem is my parents. Their are very old school and the only &quot;school&quot; there can be is hours and hours of vigorous math problems, history lessons, science facts, etc followed by insulting tests. <br/>\n<br/>\n<br/>\n<br/>\nIf my experiences are anything to go by, many if not most people amongst the older generations think of school in the context of their memories of when they went to school themselves, and, given that the &#39;world of education&#39; has opened up dramatically over the past decade, that can mean that their perception of schooling is out of date, if not irrelevant. <br/>\n<br/>\nI went to school in the 1950s and 60s (in London, England), and I well remember the hours and hours of vigorous math problems, history lessons, science facts, etc followed by tests that were a part of the educational process rather than insulting but I think I know what you mean in your situation.<br/>\n<br/>\nI have a grown up daughter who went to school from 1990 to 2002 and then on to five years at university and who now, in the recent words of a mutual friend, &quot;has more degrees than a thermometer&quot; (actually three plus several post-graduate and career related qualifications). She&#39;s currently in the final year of her Master of Laws. I mention this not to boast but to explain my own situation (in fact, a visitor to my daughter&#39;s home would see no evidence at all of her academic achievements and I admire her even more for that).<br/>\n<br/>\nI have a son, now 17, who went to school for two years. He started school the year after we got the internet in our home and, not only did he have unrestricted access to the world wide web, he also was a videogamer, that was his major interest. This became of significance when he didn&#39;t take to school and eventually became chronically unhappy in his second year. At the end of that year, he was removed from school to be educated at home, and the reason I agreed to it was because I came to realise from spending time in his school that it was wasting his time! What he was doing was like occupational therapy, or waiting for a bus that never arrives, compared to the proactive full on learning he was engaged in at home through videogaming, watching TV, and exploring the world wide web. Strange but true.<br/>\n<br/>\nAlways Learning is, in my opinion, absolutely the best place to be if you want to understand unschooling.<br/>\n<br/>\nI think also it can sometimes help in dealing with skeptical family members to prise them loose just a little bit from fondly held beliefs about school that may no longer apply so that they can see learning (or at least &#39;education&#39;) in a more expansive light. Without being anti-school.<br/>\n<br/>\nTo begin with, as much as it may come as a shock to people who believe that schools are king of the educational hill, modern research into how human beings learn best tells us that schooling gets it mostly wrong. See, for example, the opening statement of this video from Dr. John Medina, author of &quot;Brain Rules&quot; (12 things scientists know for sure about how our brains work):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=ck-tQt0S0Os\">http://www.youtube.com/watch?v=ck-tQt0S0Os</a><br/>\n<br/>\nThere&#39;s also the work of Clark Aldrich (&quot;Unschooling Rules&quot;, blog and book, also writes on game based learning), I think he does a pretty good job of explaining where unschooling fits into the modern educational landscape, so to speak.<br/>\n<br/>\nThere&#39;s Judy Breck (The Golden Swamp, Handschooling), more to do with school reform than unschooling, but it&#39;s essentially ideas about the use of mobile digital technology and that doesn&#39;t require a school environment. <br/>\n<br/>\nIn 2012, education is online and mobile however much schools might wish it otherwise, and that&#39;s a game changer. Older people whose thoughts about school come from memories of their own schooldays may not be aware that we&#39;ve now entered an age when any individual who chooses to do so can decide for themselves what learning is of value to them, and how, where and when they will engage in that learning (and those with a vested interest in the school system are certainly not going to tell them).<br/>\n<br/>\nAnyway, I appreciate that&#39;s all not really about promoting natural learning (and I don&#39;t want to use the &#39;s word&#39; too much because this group is for the discussion of unschooling) but it might be a helpful angle to approach your parents from. Maybe. <br/>\n<br/>\nAlfie Kohn&#39;s classic article &quot;What Does It Mean to Be Well Educated?&quot;. That&#39;s worth a read and thinking about too.<br/>\n<br/>\nBob</div>","specialLinks":[{"url":"http://www.youtube.com/embed/ck-tQt0S0Os?wmode=opaque","type":"VIDEO"}]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Lost and Confused","postDate":"1351366637","msgId":69467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJENDgyNDY5LTI5QzAtNEYzNy1BMDEzLTA5Rjk1OTQ3QzA1QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2aDdtaSt2a2RyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2aDdtaSt2a2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":69465,"nextInTopic":69496,"prevInTime":69466,"nextInTime":69468,"topicId":69456,"numMessagesInTopic":0,"msgSnippet":"-=-Well the problem is my parents. Their are very old school and the only school there can be is hours and hours of vigorous math problems, history lessons,","messageBody":"<div id=\"ygrps-yiv-2018985955\">-=-Well the problem is my parents. Their are very old school and the only &quot;school&quot; there can be is hours and hours of vigorous math problems, history lessons, science facts, etc followed by insulting tests. I have tried to explain natural learning vs force fed schooling 1000 times over but to no avail they are still against it. They are always saying that playing is not learning anything and that they will fail in life without proper schooling and that if they are ever question they will have to tell the governing school board how my kids never do any school. <br/>\n<br/>\n-=-My question is.... how do I get them to first of all butt out and second of all understand and accept unschooling???? -=-<br/>\n<br/>\nI don&#39;t think the problem is your parents.<br/>\n<br/>\n&quot;Butt out&quot; isn&#39;t nice.  You&#39;re in their house.  If you&#39;re lucky, they&#39;ll let you stay there.<br/>\n<br/>\nWould it be more helpful to your children for a year or two for you to work and get a house separate from your parents?  <br/>\nIs unschooling a luxury you can&#39;t afford, but that you could save up for?<br/>\n<br/>\nPam Laricchia has a book.  If you have tried 1000 times to do somethig that&#39;s not working, that&#39;s a problem.  If you say 1000 times when you mean five, that&#39;s a problem.   <br/>\n<br/>\nBuy this book and read it, and share the good parts with your parents. <br/>\nI think it&#39;s all good parts.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pamlaricchia\">http://sandradodd.com/pamlaricchia</a>   (I need to leave for Holly&#39;s birthday party, or I would find the right address).<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost and Confused","postDate":"1351366396","msgId":69465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwM0VBQTY1LUUzM0EtNDhCRS1CNTdBLTREODIxQTVDMDQxNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2aDdtaSt2a2RyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2aDdtaSt2a2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":69456,"nextInTopic":69467,"prevInTime":69464,"nextInTime":69466,"topicId":69456,"numMessagesInTopic":0,"msgSnippet":"-=-Since day one I have constantly battled my mother over how to raise MY KIDS but for the most part I have come out on top, but there are still several","messageBody":"<div id=\"ygrps-yiv-1345403679\">-=-Since day one I have constantly battled my mother over how to raise &quot;MY KIDS&quot; but for the most part I have come out on top, but there are still several issues like the junk food she keeps bringing into the house.-=-<br/>\n<br/>\n#1, it&#39;s her house and you are guests.<br/>\n<br/>\n#2, if you call some food &quot;junk,&quot; you can&#39;t give your children real choices.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\nRead that, please, especially the page on turning down sugar, and don&#39;t tell us what you think about it unless you read a little, try a little, wait a while and watch.<br/>\n<br/>\nYou can&#39;t have peace and battles at the same time.  Stop battling your mother.<br/>\n<br/>\n-=-My family was forced to move back in with my parents-=-<br/>\nAt gunpoint?  <br/>\nOr did you choose to move in with your parents?<br/>\n<br/>\nThe difference is HUGE.  If you speak of force, and battles, and lost, and confused, you are setting yourself in an adversarial situation where there will be losers and winners.  I think your children will be losers, if peace if your goal.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\nIf you feel small and trapped, that can make you mean and helpless.   <br/>\n<br/>\nWe can&#39;t help you get to joy if you don&#39;t step out of the dark.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":480244778,"authorName":"amberb.sanders","from":"&quot;amberb.sanders&quot; &lt;amberb.sanders@...&gt;","profile":"amberb.sanders","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Lost and Confused","postDate":"1351361042","msgId":69456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2aDdtaSt2a2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":69465,"prevInTime":69455,"nextInTime":69457,"topicId":69456,"numMessagesInTopic":0,"msgSnippet":"Hello Everyone! I am new to this group and want to start off by saying thank you for allowing me to join such a great group. I have been watching the threads","messageBody":"<div id=\"ygrps-yiv-33491577\">Hello Everyone! I am new to this group and want to start off by saying thank you for allowing me to join such a great group. I have been watching the threads to get a feel of the different personalities and topics. <br/>\n<br/>\nI have a dilemma I am not sure how to handle and was hoping some of you might be able to at least point me in the right direction. I will not bore you with the tedious details but I will get a brief insight into my situation so you can possibly understand what I am dealing with before I ask my question.<br/>\n<br/>\nMy family was forced to move back in with my parents last year for reasons that were simply unavoidable. The kids (B-12 and D-11)are completely miserable here for more reason than one but that is understandable for its hard to learn to live with two families under one roof. Since day one I have constantly battled my mother over how to raise &quot;MY KIDS&quot; but for the most part I have come out on top, but there are still several issues like the junk food she keeps bringing into the house. I feel like its her house and I have no right to tell her what she can and cannot eat in her house but in the same respect its impossible to keep my kids from eating because it is here and readily available. I try to counter balance things with fresh fruit and veggies which works great with my daughter but my son would rather a debbie cake of an apple any day :( That is a my life right now in a nutshell.<br/>\n<br/>\n We have decided this year to homeschool, at first we went through a virtual school that took me about a month to realize it was a &quot;brick & mortar&quot; program in disguise so we pulled out of that and decided to homeschool under the third option. Of course at first I thought I had to replicate school and turned one bedroom into a &quot;school&quot; room. We spent 4-5 hours every morning do academic studies just like school would do. It was then I noticed my children for the first time in a way I almost cannot describe. These so-called subject lesson were painfully being forced down their throats like the most disgusting food. I actually felt like a failure to them all these years. I spent days just talking to them getting to know their likes and dislikes with school things, their personal interests, etc. Then after much research online I came to a term I had never heard before... Unschooling! I read and read all I could find to read on Unschooling and the more I learned the more drawn to this foreign concept I felt. So I did the one thing I had never done with my kids.... I sat them down and explained to them what unschooling was and asked them what they thought and if they wanted to try that route for a while to see just how well it would work for our family. They both wanted to try it and so we have been living this way for about a month now and I can&#39;t believe how well we are getting along with each other. I know most of you (if you are still reading my rambling) are asking yourself, &quot;ok so whats the problem?&quot; Well the problem is my parents. Their are very old school and the only &quot;school&quot; there can be is hours and hours of vigorous math problems, history lessons, science facts, etc followed by insulting tests. I have tried to explain natural learning vs force fed schooling 1000 times over but to no avail they are still against it. They are always saying that playing is not learning anything and that they will fail in life without proper schooling and that if they are ever question they will have to tell the governing school board how my kids never do any school. <br/>\n<br/>\nMy question is.... how do I get them to first of all butt out and second of all understand and accept unschooling???? Any suggestions will be greatly appreciated.</div>","specialLinks":[]}],"prevTopicId":69485,"nextTopicId":69438}}