{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":482435422,"authorName":"","from":"nancyannh.bennett@...","profile":"nancyannbennett","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Scissors, mom-reactions, lots of questions","postDate":"1512894345","msgId":78342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwaXIyOSsxbmQ5dW9pQFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PENBMTEzNTg1LTdGRTMtNEI3Mi1CNTFCLTQ0RkE5RDQ2RUI4OEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBMTEzNTg1LTdGRTMtNEI3Mi1CNTFCLTQ0RkE5RDQ2RUI4OEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78341,"nextInTopic":0,"prevInTime":78341,"nextInTime":78343,"topicId":78337,"numMessagesInTopic":0,"msgSnippet":"You’ve already had lots of good advice. I just had a few further thoughts around options for your daughter to further support and expand her explorations.","messageBody":"<div id=\"ygrps-yiv-827488830\">You’ve already had lots of good advice. I just had a few further thoughts around options for your daughter to further support and expand her explorations. Maybe you could have 2 cutting boxes- one she can have access to all the time with interesting items she can cut with children’s scissors (that are not sharp enough to cut sheets or dresses) and another that you pull out when you can sit with her?<br/>\n<br/>\nIf she wants to cut things to see what’s inside, maybe you could make little “surprises” in her cutting box like tin foil wrapped up blocks or foil wrapped straw sculptures (made with pipe-cleaners threaded through straw pieces and bent into shapes), straws filled with flour and sealed, playdoh wrapped around objects...craft foam shapes can also be quite satisfying to cut. She may like to help you “make” straw sculptures or bracelets or necklaces by cutting the straws for you to use to thread onto pipecleaners to make these other things. <br/>\n <br/>\nIn her other box you could have balloons to cut open that are filled with different textures things like flour, shredded paper, water beads (you can get giant ones now that she might like to slice in an egg slicer too), etc, little craft boxes wrapped and filled with gems or other items. You could raid the recycling to see what interesting items were there for her to cut. I think you can use child scissors to cut balloons filled with coloured water in the bath to add colours to the water at bath time. <br/>\nShe might enjoy cutting sweets or other foods like lettuce or long green beans or peas in their pods when you can get them (or grow them) or fruits with scissors to see what’s inside. All to be cut open with you, when you have time to be with her to share her joy of cutting things open and keep everything  safe. Obviously lots of these items are small so you’d definitely want to be right there with her to guide her. My little one went through a brief phase of wanting to cut open googly eyes so I bought a packet of large ones for her. Something about the springiness of the plastic was appealing to her.<br/>\nOutside twigs and leaves might be satisfying to cut. You could show her how to glue the pieces to paper or card to make a collage if she wants. Not quite scissors but she might be interested in a nut cracker to open nuts, or a hole punch to make different shapes out of paper, leaves etc maybe? Would another option be to have those child “squiggly” scissors available for her to use anytime with different colours & textures  of paper/ card etc and keep the real ones out of reach and sight until you can be with her? Those squiggle scissors cut all sorts interesting curved lines that she might like but I think they don’t work on materials other than paper or card, so might be a safer option to have access to? Maybe she likes the action and fine motor control so having a bunch of tweezers and scoops that are operated like scissors could give her other fun scissor-like things to do...I’m thinking a bit like these:<br/>\nLearning Resources Handy Tools <a rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.co.uk/dp/B00I0CEAZG/ref=cm_sw_r_sms_c_api_VrnlAbKWX1AG9\">https://www.amazon.co.uk/dp/B00I0CEAZG/ref=cm_sw_r_sms_c_api_VrnlAbKWX1AG9</a></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Scissors, mom-reactions, lots of questions","postDate":"1512787407","msgId":78341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MTU2MTRBLUI3QkYtNEJFOS05RjYxLTk1Q0VFMjRBMENDQkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBMTEzNTg1LTdGRTMtNEI3Mi1CNTFCLTQ0RkE5RDQ2RUI4OEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBMTEzNTg1LTdGRTMtNEI3Mi1CNTFCLTQ0RkE5RDQ2RUI4OEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78340,"nextInTopic":78342,"prevInTime":78340,"nextInTime":78342,"topicId":78337,"numMessagesInTopic":0,"msgSnippet":"I disagree completely with this: -=-Some of the things she wants to cut through are not so harmless , though. She cut a small hole through one of our fitted","messageBody":"<div id=\"ygrps-yiv-1038749004\">I disagree completely with this:<br/>\n<br/>\n-=-Some of the things she wants to cut through are not so &quot;harmless&quot;, though. She cut a small hole through one of our fitted sheets the other day, and one of her &quot;special&quot; dresses, and huge chunks of her hair. I tried to talk to her about why it was not okay to cut up those things, but I wasn&#39;t communicating it clearly because I could feel a lot of baggage attached to my reaction and was failing to separate it from what is real and truthful. On all those occasions, i felt a surge of panic go through me and found myself reacting impulsively and strongly, which just made her angry and actually made her shut me out and lose a bit of trust in me. -=-<br/>\n<br/>\nIf she cut a special dress, YELL.  React strongly.<br/>\nIf it makes her angry, walk away, with the scissors, and tell her that it is NOT okay to cut clothing.<br/>\n<br/>\nI seriously doubt it would make her lost trust in you.<br/>\nI’m losing trust. :-)<br/>\n<br/>\nSometimes parents think unschooling means kids do anything they want anytime, anywhere, to anything and anybody, and the parent doesn’t have the right to an opinion.  That makes no sense.<br/>\n<br/>\nBe your child’s partner.  Don’t let your team be a bad team.  <br/>\n<br/>\nFitted sheets are expensive.  Your team cut a sheet.  You, the older, smarter, ranking team members screwed up.   <br/>\nShe had scissors around a sheet.  Problem.<br/>\n<br/>\nIF when she cut the sheet you “tried to talk to her about why it was not okay” instead of expressing honest surprise and frustration, you will lost trust by being dishonest.<br/>\n<br/>\nHow will she learn the difference between expensive sheets and clothes, and scrap crap, if the mom uses a sweetie-pop poodle voice both times?<br/>\n<br/>\n-=-Sometimes I&#39;ve managed to catch her before she cut through a few other things and pointed out why cutting through them would not be such a good idea (like; her lego crane wouldn&#39;t be able to lift stuff up and down anymore if she cut the string); and she actually gave my advice some thought and decided against cutting them.-=-<br/>\n<br/>\nDon’t give her the option to destroy things.  It won’t make her life or yours any better.  Don’t make it “advice.”  Say no, this isn’t a thing to cut.<br/>\n<br/>\n-=-But I think its creating a disconnection in our relationship because she can sense me wanting to control her and takes it as a loss of trust in her. I feel like this is an area where I need some deschooling before I can helpfully guide my daughter through her exploration. I&#39;m just not seeing how to do it. And i actually don&#39;t yet understand why I react the way I do. I would appreciate any thoughts and ideas on how to handle the situation with the health of our relationship as the priority.-=-<br/>\n<br/>\nPart of your job is to protect peaace and property, not to let cash go down the drain from destruction of property.<br/>\n<br/>\nYou SHOULD control the environment for the safety of property and peace, and investments in household goods.<br/>\n<br/>\n-=-...  and takes it as a loss of trust in her. -=-<br/>\nI doubt that.<br/>\n<br/>\nMy guess is that you’re talking to her without changing your tone for fun, wonderful cutting that was appropriate, and horrible wasteful cutting that is not even kind of okay.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tone\">http://sandradodd.com/tone</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":420468373,"authorName":"Lisa Celedon","from":"Lisa Celedon &lt;lisajceledon@...&gt;","profile":"lisajceledon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Scissors, mom-reactions, lots of questions","postDate":"1512785388","msgId":78340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNTc2Mjg4MDguMTU5MzIzMy4xNTEyNzg1Mzg4MzI5QG1haWwueWFob28uY29tPg==","referencesHeader":"PDEwNTc2Mjg4MDguMTU5MzIzMy4xNTEyNzg1Mzg4MzI5LnJlZkBtYWlsLnlhaG9vLmNvbT4="},"prevInTopic":78339,"nextInTopic":78341,"prevInTime":78339,"nextInTime":78341,"topicId":78337,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-285227479\">&lt;&lt;<br style=\"color:rgb(51, 51, 51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;\"><span style=\"color:rgb(51, 51, 51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784478714\">I had been managing to make sure that I&#39;m always with her any time she does any cutting, until I became confident that she could use them safely&gt;&gt;</span><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\"><br></span></font></div><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784480728\">A three year old, especially one who is cutting things she shouldn&#39;t be, is too young to ever be left unattended with scissors.</span></font></div><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784649958\"><br></span></font></div><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784650315\">Put them where she can&#39;t reach them if she can&#39;t be trusted to not cut things she shouldn&#39;t (which is very developmentally reasonable for a three year old - she does not have the executive functioning to stop herself if you say not to once or twice or fifty times).</span></font></div><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\"><br></span></font></div><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784557133\">For one, there is no philosophy you could share with CPS about letting children be free from control that could explain away an accident if one were to ever occur.</span></font></div><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784963452\"><br></span></font></div><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784963709\">I think it&#39;s kinder, especially with very young children, to take measures to prevent them from doing things they really shouldn&#39;t, things especially that you already know might happen, rather than carelessly allowing them to happen. Even if it&#39;s relatively harmless, like cutting sheets.&nbsp;</span></font></div><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784757956\"><br></span></font></div><div id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784783277\"><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784784940\">I think maybe parents can get scared (consciously or subconsciously too) to not be &quot;good unschoolers&quot; and to not be &quot;good supportive parents&quot; so that it can impair their judgement. I went through a period like that early on and it was sometimes fueled by bad advice from very well meaning people.</span></font></div><div id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784783277\"><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784845939\"><br></span></font></div><div id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784783277\"><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784846205\">You shouldn&#39;t get bad advice here, and if you do, it won&#39;t be left to sit unquestioned. :)</span></font></div><div id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784783277\"><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512785359999\"><br></span></font></div><div id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512784783277\"><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"font-size:13px;\" id=\"ygrps-yiv-285227479yMail_cursorElementTracker_1512785360154\">Lisa Celedon</span></font></div><div><br><div id=\"ygrps-yiv-285227479ymail_android_signature\"><a rel=\"nofollow\" target=\"_blank\" href=\"https://overview.mail.yahoo.com/mobile/?.src=Android\">Sent from Yahoo Mail on Android</a></div></div></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Scissors, mom-reactions, lots of questions","postDate":"1512784762","msgId":78339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1QkJBRkQ2LTdBRDctNEEyRS05RTVELTA5RDA2RjkzRUUzQ0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE4ODRBNTZFLTUyODktNDNBNS1CNUYxLTBFM0M2NTgzNjZEMUB5N21haWwuY29tPg==","referencesHeader":"PDE4ODRBNTZFLTUyODktNDNBNS1CNUYxLTBFM0M2NTgzNjZEMUB5N21haWwuY29tPg=="},"prevInTopic":78338,"nextInTopic":78340,"prevInTime":78338,"nextInTime":78340,"topicId":78337,"numMessagesInTopic":0,"msgSnippet":"-=Play dough scissors are very satisfying to use as well, even though they’re plastic. And have the real scissors inaccessible unless you are able to be","messageBody":"<div id=\"ygrps-yiv-1603897005\">-=Play dough scissors are very satisfying to use as well, even though they’re plastic. And have the real scissors inaccessible unless you are able to be present to help her cut safely. Don’t put her in the position of making her own decisions about what to cut with her three year old impulse control ability.-=-<br/>\n<br/>\nGood point.<br/>\nAnd she could cut playdough with real scissors, too.<br/>\n<br/>\nFood, bread.<br/>\n<br/>\nScrap cloth, maybe, or ribbons.<br/>\n<br/>\nWhen you’re not right there put the scissors away, up high, not where she can see them, not where she can find them, but where they’re “out of sight, out of mind.”<br/>\n<br/>\n-=-She become tall enough this year to reach the drawer that holds the scissors -=-<br/>\n<br/>\nThen that drawer became worthless to you.  ALL scissors should be inaccessible until she has no desire to cut sheets.<br/>\n<br/>\n=But now she uses them to serve different purposes throughout the day and it&#39;s not so easy 5o anticipate when she might use them.=<br/>\n<br/>\nIt will be easier to know if you know when she has the scissors.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":359203961,"authorName":"Anna Black","from":"Anna Black &lt;anna.black@...&gt;","profile":"annavblack99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Scissors, mom-reactions, lots of questions","postDate":"1512783927","msgId":78338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4ODRBNTZFLTUyODktNDNBNS1CNUYxLTBFM0M2NTgzNjZEMUB5N21haWwuY29tPg=="},"prevInTopic":78337,"nextInTopic":78339,"prevInTime":78337,"nextInTime":78339,"topicId":78337,"numMessagesInTopic":0,"msgSnippet":"it might help you to step away from ideas of control and trust and think more about being your child’s partner.  She’s only three.  She needs your help to","messageBody":"<div id=\"ygrps-yiv-1786044327\">it might help you to step away from ideas of control and trust and think more about being your child’s partner.  She’s only three.  She needs your help to not cut things that she will want later (like the lego crane example).<br/>\n<br/>\nSo she loves to cut things and you have a box of interesting things for her to cut.  You are available to sit with her a lot of the time to help her cut safely.  Sometimes you stop her from cutting valuable things. This is not control, this is support.  <br/>\n<br/>\nUnschooling doesn’t mean never say no, or allow your child to cut whatever they want.  It means find creative ways for your child to do what she wants to do; for example, the box of cutting things and your presence to make it safe. <br/>\n<br/>\nShe’s three.  It really doesn’t have anything to do with her feeling you don’t trust her.  That’s a very adult way of thinking.  She just wants to cut things and is annoyed when you stop her.  But she is not equipped to make the kinds of decisions she needs to be able to make to cut safely and non-destructively. <br/>\n<br/>\nKeep finding fun things for her to cut.  Take her outside and let her cut grass and weeds. Get old Barbies from second hand shops just for hair cutting. Help her cut flowers for vases inside.  Continue to add to your box of cutting things.  Play dough scissors are very satisfying to use as well, even though they’re plastic. And have the real scissors inaccessible unless you are able to be present to help her cut safely.  Don’t put her in the position of making her own decisions about what to cut with her three year old impulse control ability.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Scissors, mom-reactions, lots of questions","postDate":"1512711048","msgId":78337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBMTEzNTg1LTdGRTMtNEI3Mi1CNTFCLTQ0RkE5RDQ2RUI4OEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":78338,"prevInTime":78336,"nextInTime":78338,"topicId":78337,"numMessagesInTopic":0,"msgSnippet":"Request to have this posted: _________________________ My 3 year old daughter has become very interested in using scissors to cut all sorts of stuff. I","messageBody":"<div id=\"ygrps-yiv-917040180\">Request to have this posted:<br/>\n_________________________<br/>\n<br/>\nMy 3 year old daughter has become very interested in using scissors to cut all sorts of stuff. I introduced her to using &quot;real&quot; scissors(as opposed to plastic ones) last year in October by doing lots of &quot;mundane&quot; projects together. (It&#39;s also around the time I started discovering unschooling after I stumbled upon Sandra&#39;s page while looking for less &quot;control driven&quot; approaches to attachment parenting in the toddler years and beyond.)<br/>\n<br/>\nWhen we started off (she was 2 then), her focus was solely on getting used to handling the scissors and being able to actually cut through paper (mostly). It was her main interest for about the next month and half; until she started using them to cut her nails - *close* to the point of bleeding(she said they didn&#39;t hurt). This really scared me, so i took the scissors out of the craft box and kept them out of reach.<br/>\n<br/>\nShe become tall enough this year to reach the drawer that holds the scissors ��   She is back to her passion for using the scissors  and it&#39;s now more about discovering what happens to different materials when cut, what she might discover inside them, and probably a lot more that I haven’t really figured out yet. She doesn&#39;t like cutting just for the sake of it like she was doing last year. Its got to serve a purpose.<br/>\n<br/>\nI had been managing to make sure that I&#39;m always with her any time she does any cutting, until I became confident that she could use them safely. But now she uses them to serve different purposes throughout the day and it&#39;s not so easy 5o anticipate when she might use them. For example, she loves to help my husband and I open packages, and she likes to give her dolls hair cuts, cut up mashems and num noms to see what&#39;s inside...<br/>\n<br/>\nSome of the things she wants to cut through are not so &quot;harmless&quot;, though. She cut a small hole through one of our fitted sheets the other day, and one of her &quot;special&quot; dresses,  and huge chunks of her hair. I tried to talk to her about why it was not okay to cut up those things, but I wasn&#39;t communicating it clearly because I could feel a lot of baggage attached to my reaction and was failing to separate it from what is real and truthful. On all those occasions, i felt a surge of panic go through me and found myself reacting impulsively and strongly, which just made her angry and actually made her shut me out and lose a bit of trust in me. <br/>\n<br/>\nI created a &quot;cutting box&quot; for her and filled it with different materials; soft, normal and card paper, plastic packaging, cloth, nets, straws, squidgy toys, cotton..., but it doesn&#39;t seem to satisfy that need to explore different materials.<br/>\n<br/>\nSometimes I&#39;ve managed to catch her before she cut through a few other things and pointed out why cutting through them would not be such a good idea (like; her lego crane wouldn&#39;t be able to lift stuff up and down anymore if she cut the string); and she actually gave my advice some thought and decided against cutting them.<br/>\n<br/>\nBut I think its creating a disconnection in our relationship because she can sense me wanting to control her and takes it as a loss of trust in her. I feel like this is an area where I need some deschooling before I can helpfully guide my daughter through her exploration. I&#39;m just not seeing how to do it. And i actually don&#39;t yet understand why I react the way I do. I would appreciate any thoughts and ideas on how to handle the situation with the health of our relationship as the priority.</div>","specialLinks":[]}],"prevTopicId":78336,"nextTopicId":78345}}