{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Anita Bower","from":"Anita Bower &lt;homequaker@...&gt;","replyTo":"LIST","senderId":"nN6HA7GHlq5LKuzLGgJT4l7Z36RulT107MSP1sqgnkNO_npEko1nwbw8YxwLijnEvKBNF0e_MKCJYUOEtKWbZh38BmXTRN7TykMOZDHo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] getting teens out of the house","postDate":"956170910","msgId":8259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMuMC42LjMyLjIwMDAwNDE5MTUwMTUwLjAwOGJlMTAwQHRyb3V0LmJyYW5keXdpbmUubmV0Pg==","inReplyToHeader":"PDk2LjNhOGU1ZTMuMjYyZjFmMWZAYW9sLmNvbT4="},"prevInTopic":8258,"nextInTopic":0,"prevInTime":8258,"nextInTime":8260,"topicId":8258,"numMessagesInTopic":0,"msgSnippet":"Holly: Many thanks for the answer.  Just what I wanted! As my son is 11, I haven t had experience with how people treat teens.  I do know that many use","messageBody":"<div id=\"ygrps-yiv-416640124\">Holly:<br/>\n<br/>\nMany thanks for the answer.  Just what I wanted!<br/>\n<br/>\nAs my son is 11, I haven&#39;t had experience with how people treat teens.  I<br/>\ndo know that many use different standards for kids than for adults.<br/>\n<br/>\nAnita<br/>\n<br/>\n<br/>\n<br/>\nHomeschooling Mom<br/>\nNottingham, PA<br/>\n<br/>\n&quot;There are many will claim to tell you what is due from you, but only one<br/>\nwho can shear through the many, and reach the truth.  And that is you, by<br/>\nwhat light falls for you to show the way.&quot;  Brother Cadfael in &quot;The Devil&#39;s<br/>\nNovice&quot; by Ellis Peters.</div>","specialLinks":[]},{"userId":0,"authorName":"hjshaltz@aol.com","from":"hjshaltz@...","replyTo":"LIST","senderId":"oLJeTaLkgaFW7jI-VmpfdE-Qkd5cPeVfKGq0p5ZgqcDhx-N5I1kkFtK1rLNoF-CuxO4ApacLAQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"getting teens out of the house","postDate":"956155167","msgId":8258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2LjNhOGU1ZTMuMjYyZjFmMWZAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":8259,"prevInTime":8257,"nextInTime":8259,"topicId":8258,"numMessagesInTopic":0,"msgSnippet":"Anita wrote: ","messageBody":"<div id=\"ygrps-yiv-204495944\">Anita wrote:<br/>\n<br/>\n&lt;&lt;&quot;It will often take a parent willing to make a few promises and guarntees<br/>\nbefore opportunities come open.&quot;<br/>\n<br/>\nWould you   expand on this?  I&#39;m interested in how to go about creating<br/>\ncommunity opportunities for my son.  &gt;&gt;<br/>\n<br/>\nIn my experience, most people seem to feel teens are a big risk.  They are <br/>\nregarded as irresponsible, lazy, and apathetic; or resentful, angry, and <br/>\nviolent.  Given the conditions in which most teens are held, those <br/>\ndescriptions can, in fact, be accurate!  It&#39;s a sad commentary on our society <br/>\nthat the potentially most energetic, creative, committed, and hopeful portion <br/>\nof our population ends up being viewed, and feeling, so negatively.  <br/>\nEditorializing aside, though, we need to be willing to understand and accept <br/>\nthat most people are coming from a place of fear when dealing with teens.<br/>\n<br/>\nI found there was a little resistance to my younger son being a volunteer in <br/>\ncharge of the data base he rebuilt.  I think the people in charge were <br/>\nconcerned he would work on it for a bit, then quit, because to be honest, the <br/>\njob was boring!  But they were desperate--they were in charge of a rapidly <br/>\nexpanding (exploding :) training program and *had* to have a way to keep the <br/>\ndata base current, and my son was the only option for them.  No adult, after <br/>\nmonths of asking, advertising, and begging, was willing to take it on.  So <br/>\nthey agreed, and ended up getting much more than they expected.<br/>\n<br/>\nMy role was in identifying the need, realizing my son could fill that need, <br/>\nconvincing (nagging :) my son until he was willing to take a shot at it, and <br/>\nconvincing (promising) the staff he would deliver.  I had the advantage of <br/>\nhaving been known to these people for quite a while.  If I had been a total <br/>\nstranger, I&#39;m not sure they would have accepted my son, no matter what their <br/>\nneed, because of the negative stereotypes we carry about teens.<br/>\n<br/>\nSo, if you have an activity in mind for your child, but early efforts have <br/>\nfailed because the people in charge of that activity don&#39;t want to &#39;risk&#39; <br/>\nusing a teen, you can realize what is behind that refusal, and work to show <br/>\nthat your child comes with guarantees :)  You can document other programs the <br/>\nchild has worked with, for example, showing your child was prompt, courteous, <br/>\nrespectful, would follow through, etc.  Ask adults who have been impressed by <br/>\nyour child for reference letters, for example.  Or you can be known for your <br/>\nown positive attributes, and open the door to your child that way.  Either <br/>\nway, understand that people have that negative concept of teens, and don&#39;t <br/>\ntry to change it for teens in general, just your kids in particular.  Show <br/>\nyou, and your teens or kids, are worthy of trust, and the rest will follow.  <br/>\nThe nicest part about it is knowing you&#39;re helping in a small way to <br/>\npermanently change our culture&#39;s view of teens in general :)<br/>\n<br/>\nAs an aside, neither I nor my son ever thought of him as being the leader he <br/>\nturned out to be.  We thought he would do the computer thing, and leave it at <br/>\nthat.  But pretty soon he was helping out with other jobs, small ones at <br/>\nfirst, like stapling and labeling newsletters, while he waited for me to come <br/>\npick him up.  Then he was troubleshooting the rest of the computers in the <br/>\nbuilding.  Then he was answering questions for visitors when they stopped by <br/>\nwhen the paid staff were out.  Then he was answering the phone, and pretty <br/>\nsoon they asked him to be a Trainer himself, in that pilot program.  OK, so <br/>\nI&#39;m still bragging :)  But the point is, neither of us thought of him as more <br/>\nthan a computer guy--I won&#39;t say &#39;geek&#39;, though if he had been in school, he <br/>\nwould have been stereotyped like that.  But when he had the opportunity to <br/>\nshow his initiative, the rest followed naturally, even though in a direction <br/>\nwe never anticipated.<br/>\n<br/>\nHolly<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hjshaltz@...\">hjshaltz@...</a><br/>\nHJS Studio and Shaltz Farm Shetlands and Angora Rabbits<br/>\nList Mom, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:FiberFlock@onelist.com\">FiberFlock@onelist.com</a> and <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:FiberProfessionals@onelist.com\">FiberProfessionals@onelist.com</a></div>","specialLinks":[]}],"prevTopicId":8250,"nextTopicId":8260}}