{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] body piercings","postDate":"1219587770","msgId":37469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzREUyMkYyLTM5QzMtNDQyNy04NTdDLTQ0NEE1QzM1MTMxQUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGc4cWNkbis1OTM1QGVHcm91cHMuY29tPg==","referencesHeader":"PGc4cWNkbis1OTM1QGVHcm91cHMuY29tPg=="},"prevInTopic":37462,"nextInTopic":0,"prevInTime":37468,"nextInTime":37470,"topicId":37455,"numMessagesInTopic":0,"msgSnippet":"Some things go beyond unschooling. If she wasn t old enough to have certain piercings done without parental permission, maybe she wasn t old enough to legally","messageBody":"<div id=\"ygrps-yiv-360344926\">Some things go beyond unschooling.<br/>\n<br/>\nIf she wasn&#39;t old enough to have certain piercings done without  <br/>\nparental permission, maybe she wasn&#39;t old enough to legally do them  <br/>\non herself, even with parental permission.  But it&#39;s kind of hard for  <br/>\nthe law to say anything once the hole&#39;s there.  What they could do,  <br/>\nthough, is consider that her parents were being negligent.<br/>\n<br/>\nNegligence or any lawbreaking is a special danger for unschoolers,  <br/>\nbecause many state laws have their homeschooling laws worded in such  <br/>\nways that they expect you to be using a curriculum.  Some unschooling  <br/>\nfamilies would be able to stand in court and describe unschooling in  <br/>\nschoolish ways and to justify what they&#39;re doing and why, quoting  <br/>\nexperts.  Many others (more and more as time goes by) could not.<br/>\n<br/>\nThe best thing to do, then is to lie low until the kids are 18.  You  <br/>\nmight think I&#39;m not practicing that, because my name is on the  <br/>\ninternet and my kids&#39; names and photos.  But what I mean is I kept  <br/>\nthem in and quiet after 10:00 until they were old enough to be out  <br/>\nlater.  I help make sure they have licenses, insurance, IDs on them,  <br/>\nthat I know where they are and who they&#39;re with, and that they have a  <br/>\ncharged phone on them when they&#39;re out, that it&#39;s a place they can  <br/>\nstay over if they need to, or that there&#39;s someone to drive them home  <br/>\nif not (or that we could go and get them).<br/>\n<br/>\nI&#39;m not paranoid about laws or lawbreaking, but neither am I reckless.<br/>\n<br/>\nThe first &quot;kid party&quot; at our house where we had liquor out was last  <br/>\nmonth, a combined birthday party for me and Kirby.  Everyone who was  <br/>\ninvited was told they could stay over if they got drunk.  We had LOTS  <br/>\nof clean bedding and crash space.  And the vast majority of the  <br/>\nattendees were over 21, too.  (Kirby&#39;s 22nd birthday, and most of his  <br/>\nfriends are older than he is.)<br/>\n<br/>\nBeing an unschooler won&#39;t be a defense if another family gets angry  <br/>\nthat your daughter pierced their kid (regardless of infection or  <br/>\ndamage).<br/>\n<br/>\nAnd advise her not to charge ANYthing.  Even haircutting can&#39;t be  <br/>\ndone for money unless the person is licensed.<br/>\n<br/>\nMy ears were pierced by a friend when I was a kid.  We read up and we  <br/>\nwere careful and there weren&#39;t problems.  As there come to be more  <br/>\nand more laws, though, it&#39;s a good thing to help our kid be aware of  <br/>\nthe immediate dangers of lawbreaking and the possible secondary  <br/>\ndangers to the legal peace and quiet of an unschooling family.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] body piercings","postDate":"1219562294","msgId":37462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHTUVMRU9LQUQuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PGc4cWNkbis1OTM1QGVHcm91cHMuY29tPg=="},"prevInTopic":37457,"nextInTopic":37469,"prevInTime":37461,"nextInTime":37463,"topicId":37455,"numMessagesInTopic":0,"msgSnippet":"... Your daughter sounds like she has done a responsible and admirable job in learning how to pierce! I would find out the legal and health ramifications and","messageBody":"<div id=\"ygrps-yiv-722406025\"><blockquote><span title=\"ireply\">&gt;&gt;I am ok with my daughter doing her own piercings, but I am not ok with<br/>\n&gt;&gt;her doing piercings on other people. I don&#39;t know how to handle<br/>\n&gt;&gt;this....help!!&lt;&lt;<br/>\n<br/>\n </span></blockquote>Your daughter sounds like she has done a responsible and admirable job in<br/>\nlearning how to pierce!<br/>\n<br/>\nI would find out the legal and health ramifications and give that<br/>\ninformation to the girls.<br/>\n<br/>\nThen I would probably just go to my room and read. I don&#39;t think I would<br/>\ncondone or condemn the activity.<br/>\n<br/>\nIf anything goes wrong, I may feel the need to contact the other person&#39;s<br/>\nparents, depending on the situation.<br/>\n<br/>\nMy teenagers have had parties where &quot;illegal&quot; things have happened. People<br/>\nwere safe, they slept here, no one drove, no one became ill, and I was<br/>\nnearby if I was needed. I don&#39;t have issues with these things because my<br/>\nkids are particularly responsible with their friends and their lives, and<br/>\nthey appear to regulate things themselves very well. They would not let<br/>\nanyone get out of hand, would not allow anything at our house outside of<br/>\nalcohol or pot, and themselves don&#39;t like to engage in much of either. These<br/>\nare not rules that we have laid down, but the natural result of them having<br/>\nfreedom and information their whole lives. So far they have made good<br/>\ndecisions.<br/>\n<br/>\nI do have to say that I would not want to be liable for what other people&#39;s<br/>\nkids do, and so I stay nearby but not part of any kid-parties here. If there<br/>\nwas a problem, I would get involved right away and my kids count on that<br/>\ntoo! One time a young man arrived here very drunk. My son called me (I was 5<br/>\nminutes away) and asked me to come home to help deal with it. I played the<br/>\nheavy and told him I was uncomfortable with his condition like that at our<br/>\nhouse and drove him home. I called his parents on the way to let them know<br/>\nwhat happened, because in my thinking, he needed someone&#39;s attention, I<br/>\ncouldn&#39;t just drop him off somewhere, he needed to be watched. My kids were<br/>\nvery relieved. So far, that&#39;s the only situation where someone was unstable<br/>\nand I thought my kids handled it well. AND, I was very glad they felt safe<br/>\nand comfortable to call me in. They trust me too!<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: body piercings","postDate":"1219541869","msgId":37457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4cWUxZCt0cmhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc4cWNkbis1OTM1QGVHcm91cHMuY29tPg=="},"prevInTopic":37455,"nextInTopic":37462,"prevInTime":37456,"nextInTime":37458,"topicId":37455,"numMessagesInTopic":0,"msgSnippet":"... In a lot of states it is illegal to do without a liscence.  If the parents don t know about it before hand and then find out that your daughter did it with","messageBody":"<div id=\"ygrps-yiv-1801969479\"><blockquote><span title=\"ireply\">&gt; I am ok with my daughter doing her own piercings, but I am not ok with<br/>\n&gt; her doing piercings on other people. I don&#39;t know how to handle<br/>\n&gt; this....help!!<br/>\n<br/>\n<br/>\n </span></blockquote>In a lot of states it is illegal to do without a liscence.  If the<br/>\nparents don&#39;t know about it before hand and then find out that your<br/>\ndaughter did it with your consent, you could be in trouble legally. <br/>\nFind out what the law is first.<br/>\n<br/>\nThen, if they are dead set to do it, tell them that you don&#39;t want any<br/>\npart in it and to not let you in on it when and if they do go through<br/>\nwith it.  Like saying, &quot;go ahead, but don&#39;t make me an accomplice.&quot; <br/>\nThere are good reasons to have it done professionaly, maybe find and<br/>\nshare those reasons.</div>","specialLinks":[]},{"userId":275193975,"authorName":"blue_mountain34","from":"&quot;blue_mountain34&quot; &lt;blue_mountain34@...&gt;","profile":"blue_mountain34","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"body piercings","postDate":"1219540215","msgId":37455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4cWNkbis1OTM1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":37457,"prevInTime":37454,"nextInTime":37456,"topicId":37455,"numMessagesInTopic":0,"msgSnippet":"My daughter has done much research about body piercings, and has over the past 3 or 4 years done various piercings on herself. Most of them I am just recently","messageBody":"<div id=\"ygrps-yiv-196967716\">My daughter has done much research about body piercings, and has over<br/>\nthe past 3 or 4 years done various piercings on herself. Most of them<br/>\nI am just recently finding out about. She recently ordered a sterile<br/>\npiercing needle and all that she needed to pierce her ear cartilege<br/>\ntoday on her 16th birthday. <br/>\n<br/>\nNot only did I know about it this time, she invited me to watch and to<br/>\ntake pictures, which I did. As I mentioned, she is very knowledgeable<br/>\nabout how to pierce safely, and she is considering becoming a tattoo<br/>\nartist or a surgeon.<br/>\n<br/>\nDuring her birthday party today, the conversation turned to piercings.<br/>\nOne of her friends asked her to pierce her belly button and my<br/>\ndaughter was all set to do this, when I said we needed to talk about<br/>\nit first. The friend is 16, and legally old enough to get a piercing<br/>\ndone without her parents signature.<br/>\n<br/>\nI am ok with my daughter doing her own piercings, but I am not ok with<br/>\nher doing piercings on other people. I don&#39;t know how to handle<br/>\nthis....help!!<br/>\n<br/>\nMarie</div>","specialLinks":[]}],"prevTopicId":37368,"nextTopicId":37506}}