{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":161002657,"authorName":"AM Brown","from":"&quot;AM Brown&quot; &lt;ambdkf@...&gt;","profile":"ambdkf92","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] re: Just needed to vent","postDate":"1066383531","msgId":16676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMC0yMjAwMzEwNTE3OTM4NTEyNDdAZWFydGhsaW5rLm5ldD4="},"prevInTopic":16673,"nextInTopic":0,"prevInTime":16675,"nextInTime":16677,"topicId":16673,"numMessagesInTopic":0,"msgSnippet":"... Thankfully, this is the norm in our house too.  18 months ago that wasn t the case.  When we pealed back the layers we realized it was coming from TV, PBS","messageBody":"<div id=\"ygrps-yiv-1018115969\"><blockquote><span title=\"ireply\">&gt;  My two <br/>\n&gt; children play wonderfully together the vast majority of the time.  It <br/>\n&gt; always surprises me to hear that that is not the norm in our society.<br/>\n<br/>\n </span></blockquote>Thankfully, this is the norm in our house too.  18 months ago that wasn&#39;t<br/>\nthe case.  When we pealed back the layers we realized it was coming from<br/>\nTV, PBS kids to be specific.  My girls decided to stop watching on their<br/>\nown and literally within 48 hours we had a new house and have never looked<br/>\nback.  This programming was filled with sibling rivalry and bullying -<br/>\nthings that are not in their day to day life (or mine).  We have chosen not<br/>\nto put them in the artificial environment of school so it seemed strange to<br/>\nbring that environment into our home.  I really have come to believe so<br/>\nmuch of what our society believes about children is just plain wrong<br/>\n(sibling rivalry, kids are mean, kids need to be taught, etc.).   I<br/>\nrealized TV is a &#39;hot&#39; subject on unschooling lists, for me it is not about<br/>\nthe TV but about coercion.  I would not have forced my children to stop<br/>\nwatching TV, we talked about what was happening in our home and they came<br/>\nup with a solution that worked for all of us.  They continue to watch<br/>\nvideos of their choice, mostly birth videos and animal videos and play a<br/>\nlot of computer games.   <br/>\n<br/>\n<br/>\nI also wanted to comment on the registering in NC post.  There have been<br/>\ntoo many overzealous DSS cases here for me to consider not registering.  We<br/>\nhave made choices that many considered &#39;outside the norm&#39; (extended breast<br/>\nfeeding, co-sleeping, not vaccinating, unschooling, etc ).  While I feel<br/>\nthese decisions are well researched and the best for my family, I don&#39;t<br/>\nwant to specifically break a law that might jeopardize my family.  The<br/>\ntesting requirement goes totally against my beliefs but as I have talked to<br/>\nmore homeschoolers it seems it really can be handled in a non-threatening,<br/>\nno big deal kind of way.  <br/>\n<br/>\nAnna</div>","specialLinks":[]},{"userId":147655303,"authorName":"Kathy","from":"&quot;Kathy&quot; &lt;ndb1499@...&gt;","profile":"ndbwgb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re: Just needed to vent","postDate":"1066360661","msgId":16673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtbm4wbCt0bXIwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":16676,"prevInTime":16672,"nextInTime":16674,"topicId":16673,"numMessagesInTopic":0,"msgSnippet":"I typed a nice long response, but the computer ate it!!! I can t seem to get a message to reply directly.  I have to go in & send a seperate post.  Is anyone","messageBody":"<div id=\"ygrps-yiv-489221287\">I typed a nice long response, but the computer ate it!!!<br/>\n<br/>\nI can&#39;t seem to get a message to reply directly.  I have to go in & <br/>\nsend a seperate post.  Is anyone else having this problem?<br/>\n<br/>\n<br/>\nWell, I just wanted to say that you have definetely vented to <br/>\nsympathetic ears.  It always saddens me to see children more attached <br/>\nto the daycare workers or even worse to no one at all then their own <br/>\nfamily.  And this thing about not allowing siblings to be together <br/>\njust boggles my mind.  I have heard so many people of my parents <br/>\ngeneration talk about how great their kids got along until they <br/>\nstarted school & then it was all down hill from there.  My two <br/>\nchildren play wonderfully together the vast majority of the time.  It <br/>\nalways surprises me to hear that that is not the norm in our society.<br/>\n<br/>\nI think it is hard for a parent to ever admit that something they <br/>\nhave done to or for their children is wrong.  Despite this, maybe <br/>\nsomething that you have said to your sister will sink in one day or <br/>\nmaybe she will witness an incident and everything you have said will <br/>\nkick in.  If nothing else she is witness to the example & closeness <br/>\nof your family.  I know it must make you feel so sad to see your <br/>\nsister and her kids miss out on something so special that they will <br/>\nnever get back.  <br/>\n<br/>\nAs for your comment on the toilet training of elephants, or was that <br/>\nchildren, it reminded me of a time that I was at a pre-school doing a <br/>\ntoy fundraiser.  There were about 15 kids all lined up waiting to go <br/>\nto the bathroom.  This by itself was a little unsettling, but not as <br/>\nmuch as what followed.  This daycare worker stepped out of the <br/>\nbathroom with a face mask on and gloves with her hands held up.  It <br/>\nlooked like something out of a horror flick.  One of the children <br/>\ntoward the end of the line could not wait & had an accident.  A <br/>\ncomplete sterilization of the room then took place.  This took some <br/>\ntime & the entire time these kids just sat there waiting their turn <br/>\nto use the toilet.  It just amazed me that these kids could actually <br/>\njust sit there for so long.  I left that school crying & never <br/>\nreturned to another day care again.<br/>\n<br/>\nIt can really be disheartening to witness such tragedy.  Best of luck <br/>\nwith supporting your niece & nephew in any way you can.<br/>\n<br/>\nKat.</div>","specialLinks":[]}],"prevTopicId":16666,"nextTopicId":16671}}