{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":240838916,"authorName":"Hael","from":"&quot;Hael&quot; &lt;dlmckee@...&gt;","profile":"hael_harobed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Ideas for extra room as part of unschooling &quot;nest&quot;","postDate":"1263498577","msgId":49631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpbnNnaCs0ZWZiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":49630,"nextInTime":49632,"topicId":49631,"numMessagesInTopic":0,"msgSnippet":"I mentioned before that we had a school room in our house where my step-son s grandmother has done school with Julian for several years. Now that we are","messageBody":"<div id=\"ygrps-yiv-1748397021\">I mentioned before that we had a &quot;school&quot; room in our house where my step-son&#39;s grandmother has &quot;done school&quot; with Julian for several years.  <br/>\n<br/>\nNow that we are changing things and easing into an unschooling way of life, I want to remove the &quot;school&quot; association from that room.<br/>\n<br/>\nI am looking for some ideas.<br/>\n<br/>\nFor one thing, the room is directly across from Julian&#39;s bedroom, on the second floor.  It&#39;s not all that easily accessible during the day, mainly because we hang out on the first floor, where all the computers are, and where things are a little more accessible for the baby.  Julian likes to be on the first floor, where his dad is, and the kitchen and all that.<br/>\n<br/>\nSo, I&#39;m trying to decide -- and maybe a good thing to do would be to ask Julian what HE would like to do with the room -- but I could give him some possible ideas to explore.<br/>\n<br/>\nIt&#39;s got a great south-facing window, and I thought maybe we could set a shelf up there and use it as a propagation room for his new business venture -- growing green beans to sell at the farmers markets where we work.<br/>\n<br/>\nWe got a new computer for Christmas, with a new printer, and the initial idea was to put the printer up there so that he could carry the laptop back and forth and print things out for &quot;school.&quot;  But now, I&#39;m not so sure we should do that ... unless he wants to for now.<br/>\n<br/>\nWe&#39;ve got an awesome microscope that J always wants to play with, but there&#39;s no good place for it here on the first floor -- I could set it up up there, and that could be its permanent home for whenever he brings things in to look at.<br/>\n<br/>\nI&#39;m kind of reluctant to put many of our books or things up there, because I think when he&#39;s on fire to look something up, he&#39;ll more likely go to the books and computers if they&#39;re down here on the first floor.  He&#39;s more likely to say, nah, I don&#39;t want to go upstairs to look it up.  I&#39;ll do it later.<br/>\n<br/>\nWe *could* put more of his toys and stuff in there, and make it more of a play room, as well as the propagation room...<br/>\n<br/>\nThere are lots of possibilities.  It&#39;s a cool little room.  It&#39;s got its own sink and toilet, and a couple of built-in bookshelves that could be used for other stuff, collections or toys or whatever.<br/>\n<br/>\nAs he gets older, if we just make it sort of his room to do what he wants with, then it will evolve, I&#39;m sure.<br/>\n<br/>\nAny ideas?  <br/>\n<br/>\nThank you!<br/>\n<br/>\nDeb</div>","specialLinks":[]}],"prevTopicId":49522,"nextTopicId":49570}}