{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":287005496,"authorName":"Jessica Voigts","from":"Jessica Voigts &lt;jessica.voigts@...&gt;","profile":"jessiev9","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschooling and traveling abroad","postDate":"1266360300","msgId":50843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRiOTE5YWE5MTAwMjE2MTQ0NXA0MzQzNmEyMXk5OWQwOGNmODJiMmM0ZmI0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhsZjVnaSs0OWhrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPiA8aGxmNWdpKzQ5aGtAZUdyb3Vwcy5jb20+"},"prevInTopic":50840,"nextInTopic":0,"prevInTime":50842,"nextInTime":50844,"topicId":50791,"numMessagesInTopic":0,"msgSnippet":"these are all good points! i d also recommend a new book by maya frost, called the new global student. we ve intereviewed her on our site: ","messageBody":"<div id=\"ygrps-yiv-2093755357\">these are all good points! i&#39;d also recommend a new book by maya frost,<br/>\ncalled the new global student. we&#39;ve intereviewed her on our site:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wanderingeducators.com/books-film/books/book-review-new-global-student.html\">http://www.wanderingeducators.com/books-film/books/book-review-new-global-student.html</a><br/>\n<br/>\nit is really inspiring!! cheers, jessie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Feb 16, 2010 at 5:16 PM, wtexans &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wtexans@...\">wtexans@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ---What if our boys resist the idea of traveling? I know this is *our*<br/>\n&gt; dream and not necessarily theirs. We would bring our dog with us, and lots<br/>\n&gt; of our things and their toys to make for a home environment they are used<br/>\n&gt; to.---<br/>\n&gt;<br/>\n&gt; Your boys are old enough to be an integral part of this decision. Have you<br/>\n&gt; talked with them yet about this extended trip you and your husband would<br/>\n&gt; like to make? In my opinion, that would be one of the discussions that<br/>\n&gt; should happen sooner than later. Taking your dog and your kids&#39; things along<br/>\n&gt; might or might not be enough for them to want to make such a big change. But<br/>\n&gt; you won&#39;t know until you&#39;ve talked with them about it.<br/>\n&gt;<br/>\n&gt; How enmeshed are they in your current location? Are they involved in<br/>\n&gt; activities they don&#39;t want to leave for a year? Are there friends or<br/>\n&gt; extended family members they don&#39;t want to be away from for a year? A year<br/>\n&gt; can be a very long time if it&#39;s spent somewhere you don&#39;t want to be.<br/>\n&gt;<br/>\n&gt; People view change differently, but you should already have a good idea of<br/>\n&gt; how each of your boys might react to such a change. With my own son, I would<br/>\n&gt; know in advance what some of the areas of concern would be for him re:<br/>\n&gt; traveling for a year, and I would do my research beforehand so that I could<br/>\n&gt; address those concerns when presenting the idea to him, knowing that there<br/>\n&gt; would very likely be other concerns popping up during and subsequent to that<br/>\n&gt; initial conversation.<br/>\n&gt;<br/>\n&gt; I think you and your husband should be open-minded about not expecting your<br/>\n&gt; boys to give you their answer right away, or not even for several weeks or a<br/>\n&gt; month (unless they&#39;re generally &quot;up for anything, spur of the moment&quot; kind<br/>\n&gt; of kids). If you present it to them as something you truly want their input<br/>\n&gt; about, something that is not already a &quot;done deal&quot; in your minds, and<br/>\n&gt; something they won&#39;t be forced to do, you allow them to think about it with<br/>\n&gt; a more open mind.<br/>\n&gt;<br/>\n&gt; It might help, too, for you and your husband to be flexible about length of<br/>\n&gt; time. I know that my own son would be more willing to consider such a trip<br/>\n&gt; if we presented it as being a shorter trip that had the option to be<br/>\n&gt; extended. He would want reassurance that once we reached the minimum length<br/>\n&gt; of time for the trip, if he was ready to come back to the States, we would,<br/>\n&gt; indeed, come back to the States -- and then hubby and I would absolutely<br/>\n&gt; have to be willing to do that.<br/>\n&gt;<br/>\n&gt; ---But isn&#39;t it a great learning and life experience to go somewhere<br/>\n&gt; new?---<br/>\n&gt;<br/>\n&gt; It&#39;s only great if they want to be there! Parents do things all the time<br/>\n&gt; that affect their kids, in the name of &quot;it&#39;ll be good for you&quot;. It will,<br/>\n&gt; indeed, be a learning experience and a life experience, but that doesn&#39;t<br/>\n&gt; mean it will necessarily be one *they* consider great. If it&#39;s something<br/>\n&gt; they want to do, then &quot;great&quot; has a better chance of being their<br/>\n&gt; perspective.<br/>\n&gt;<br/>\n&gt; Keep in mind, too, that great experiences can happen without going<br/>\n&gt; overseas, if they&#39;re not ready for that kind of travel. A month-long trip to<br/>\n&gt; someplace nearer home might be a nice way to try out long-term traveling.<br/>\n&gt; Rent a house for a month in another state, someplace where you can take your<br/>\n&gt; dog and the things important to your boys. You could use that house as your<br/>\n&gt; homebase and take daytrips from there. Or you could rent a RV or travel<br/>\n&gt; trailer and travel that way for a month. If a month-long trip worked out<br/>\n&gt; nicely, your next trip after that could be longer or maybe not longer but<br/>\n&gt; overseas. The nice thing about dreams is that you can work towards them --<br/>\n&gt; it doesn&#39;t have to be traveling overseas for a year -or- not traveling at<br/>\n&gt; all.<br/>\n&gt;<br/>\n&gt; Glenda<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and traveling abroad","postDate":"1266358610","msgId":50840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsZjVnaSs0OWhrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPg=="},"prevInTopic":50819,"nextInTopic":50843,"prevInTime":50839,"nextInTime":50841,"topicId":50791,"numMessagesInTopic":0,"msgSnippet":"... Your boys are old enough to be an integral part of this decision. Have you talked with them yet about this extended trip you and your husband would like to","messageBody":"<div id=\"ygrps-yiv-175514208\">---What if our boys resist the idea of traveling? I know this is *our* dream and not necessarily theirs. We would bring our dog with us, and lots of our things and their toys to make for a home environment they are used to.---<br/>\n<br/>\nYour boys are old enough to be an integral part of this decision. Have you talked with them yet about this extended trip you and your husband would like to make? In my opinion, that would be one of the discussions that should happen sooner than later. Taking your dog and your kids&#39; things along might or might not be enough for them to want to make such a big change. But you won&#39;t know until you&#39;ve talked with them about it.<br/>\n<br/>\nHow enmeshed are they in your current location? Are they involved in activities they don&#39;t want to leave for a year? Are there friends or extended family members they don&#39;t want to be away from for a year? A year can be a very long time if it&#39;s spent somewhere you don&#39;t want to be.<br/>\n<br/>\nPeople view change differently, but you should already have a good idea of how each of your boys might react to such a change. With my own son, I would know in advance what some of the areas of concern would be for him re: traveling for a year, and I would do my research beforehand so that I could address those concerns when presenting the idea to him, knowing that there would very likely be other concerns popping up during and subsequent to that initial conversation. <br/>\n<br/>\nI think you and your husband should be open-minded about not expecting your boys to give you their answer right away, or not even for several weeks or a month (unless they&#39;re generally &quot;up for anything, spur of the moment&quot; kind of kids). If you present it to them as something you truly want their input about, something that is not already a &quot;done deal&quot; in your minds, and something they won&#39;t be forced to do, you allow them to think about it with a more open mind.<br/>\n<br/>\nIt might help, too, for you and your husband to be flexible about length of time. I know that my own son would be more willing to consider such a trip if we presented it as being a shorter trip that had the option to be extended. He would want reassurance that once we reached the minimum length of time for the trip, if he was ready to come back to the States, we would, indeed, come back to the States -- and then hubby and I would absolutely have to be willing to do that.<br/>\n<br/>\n---But isn&#39;t it a great learning and life experience to go somewhere new?---<br/>\n<br/>\nIt&#39;s only great if they want to be there! Parents do things all the time that affect their kids, in the name of &quot;it&#39;ll be good for you&quot;. It will, indeed, be a learning experience and a life experience, but that doesn&#39;t mean it will necessarily be one *they* consider great. If it&#39;s something they want to do, then &quot;great&quot; has a better chance of being their perspective.<br/>\n<br/>\nKeep in mind, too, that great experiences can happen without going overseas, if they&#39;re not ready for that kind of travel. A month-long trip to someplace nearer home might be a nice way to try out long-term traveling. Rent a house for a month in another state, someplace where you can take your dog and the things important to your boys. You could use that house as your homebase and take daytrips from there. Or you could rent a RV or travel trailer and travel that way for a month. If a month-long trip worked out nicely, your next trip after that could be longer or maybe not longer but overseas. The nice thing about dreams is that you can work towards them -- it doesn&#39;t have to be traveling overseas for a year -or- not traveling at all. <br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":402609764,"authorName":"Ana Maria Bruce","from":"Ana Maria Bruce &lt;bittersweetanamaria@...&gt;","profile":"bittersweetanamaria","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling and traveling abroad","postDate":"1266273235","msgId":50819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0MzEzOS4yNjA0NS5xbUB3ZWIxMTE4MDkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPg=="},"prevInTopic":50802,"nextInTopic":50840,"prevInTime":50818,"nextInTime":50820,"topicId":50791,"numMessagesInTopic":0,"msgSnippet":"We have experience traveling with Children.  We are American so we never had any issues of people questioning what we were doing with our children.  In the","messageBody":"<div id=\"ygrps-yiv-1652993716\">We have experience traveling with Children.  We are American so we never had any issues of people questioning what we were doing with our children.  In the early years it was good to be away from my own culture....for 5 years I was living in Guatemala...where I learned to trust my own instincts as a mother.  We also took our 4 kids to SE Asia when I was pregnant with our 5th.  We are taking our 13 and 16 to Peru in May.  We had some wonderful experiences traveling and learning together.  I would be happy to share any details of our time traveling with Kids to anyone. <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bittersweetanamaria@...\">bittersweetanamaria@...</a>  AnaMaria<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287005496,"authorName":"Jessica Voigts","from":"Jessica Voigts &lt;jessica.voigts@...&gt;","profile":"jessiev9","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [AlwaysLearning] Unschooling and traveling abroad","postDate":"1266195025","msgId":50802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRiOTE5YWE5MTAwMjE0MTY1MHQ1ZWQ0NGYwOW85NGI0NzU1MjAzMWQwZDVmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPg=="},"prevInTopic":50800,"nextInTopic":50819,"prevInTime":50801,"nextInTime":50803,"topicId":50791,"numMessagesInTopic":0,"msgSnippet":"i am so excited for you! i think that there is much you can do to work around the homeschooling issue. extended vacation, perhaps, you could call it. there are","messageBody":"<div id=\"ygrps-yiv-1083577828\">i am so excited for you! i think that there is much you can do to work<br/>\naround the homeschooling issue. extended vacation, perhaps, you could call<br/>\nit.<br/>\n<br/>\n<br/>\nthere are lots of resources online for you - unschooling families on the<br/>\nroad listserv; soultravelers3 is a great resource - they are a homeschooling<br/>\nfamily that lives and travels through europe. we&#39;ve interviewed them on our<br/>\ntravel site for global educators, wanderingeducators.com. you could also<br/>\ncheck the websites of wandermom, mom most traveled, and more. while not<br/>\nunschooling-based, they do travel a lot with their kids. i&#39;ve learned, from<br/>\na plethora of interviews with traveling families on our site, that when you<br/>\ngive kids a voice in where, what, etc., then they totally get excited. of<br/>\ncourse! our 7yo does, too - she loves to help plan our travels. so - offer<br/>\nthem a part of the planning process. i think you&#39;ll all learn so much more -<br/>\nand have a vibrant, exciting time. :)<br/>\n<br/>\ni&#39;d be happy to talk more off-list, if you&#39;d like. YAY!! cheers, jessie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Feb 14, 2010 at 4:14 PM, kaclip &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katrine@...\">katrine@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My husband and I are dreaming together! We have lived in California for<br/>\n&gt; more than a decade, and we want to go on an adventure. We are dreaming of<br/>\n&gt; going away with the kids (8 and 11) for a year or so, to Europe. We were<br/>\n&gt; thinking of using a house exchange system and find a place (or places) to<br/>\n&gt; live in France and/or Italy.<br/>\n&gt;<br/>\n&gt; We are Europeans and won&#39;t have difficulty with visas or work permissions.<br/>\n&gt; We speak French, so the kids will be able to communicate from the beginning.<br/>\n&gt; And we would all be able to learn Italian if that&#39;s where we go...<br/>\n&gt;<br/>\n&gt; Does anyone have experience traveling with their kids?<br/>\n&gt; Is unschooling or homeschooling common in France? How will locals view us<br/>\n&gt; when we don&#39;t send the children to school... Would we get in trouble with<br/>\n&gt; the authorities there? We filed a PSA, can we use this abroad? Is it valid?<br/>\n&gt;<br/>\n&gt; What if our boys resist the idea of traveling? I know this is *our* dream<br/>\n&gt; and not necessarily theirs. But isn&#39;t it a great learning and life<br/>\n&gt; experience to go somewhere new?<br/>\n&gt;<br/>\n&gt; We would bring our dog with us, and lots of our things and their toys to<br/>\n&gt; make for a home environment they are used to.<br/>\n&gt;<br/>\n&gt; This is a good time in our lives to go on an adventure, but we are also new<br/>\n&gt; homeschoolers/unschoolers and we&#39;re still deschooling and getting used to<br/>\n&gt; this new way of living. Maybe going away and exploring and learning together<br/>\n&gt; would be great? Or is it &quot;safer&quot; for the kids to stay with the life they<br/>\n&gt; know?<br/>\n&gt;<br/>\n&gt; Thanks for any perspectives on this.<br/>\n&gt;<br/>\n&gt; -Katrine<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":413967925,"authorName":"Bea","from":"&quot;Bea&quot; &lt;beatrice.mantovani@...&gt;","profile":"bmantovani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and traveling abroad","postDate":"1266194464","msgId":50800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsYTU3MCtuMTNzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPg=="},"prevInTopic":50799,"nextInTopic":50802,"prevInTime":50799,"nextInTime":50801,"topicId":50791,"numMessagesInTopic":0,"msgSnippet":"... Homeschooling is not common, but is done in France.  Unschooling is harder, but some people still do it. I think it would depend on how long you stayed in","messageBody":"<div id=\"ygrps-yiv-311732411\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;kaclip&quot; &lt;katrine@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; <br/>\n&gt; Is unschooling or homeschooling common in France? How will locals view us when we don&#39;t send the children to school... Would we get in trouble with the authorities there? We filed a PSA, can we use this abroad? Is it valid?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Homeschooling is not common, but is done in France.  Unschooling is harder, but some people still do it.<br/>\n<br/>\nI think it would depend on how long you stayed in the country, and if you are registered as a resident.  <br/>\n<br/>\nI think if you get in contact with somebody from the association &quot;Les Enfants d&#39;Abord&quot; (French homeschooling association) they could tell you how the law works:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lesenfantsdabord.org/relais.htm\">http://www.lesenfantsdabord.org/relais.htm</a><br/>\n<br/>\nyou might also want to check on their website:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lesenfantsdabord.org/\">http://www.lesenfantsdabord.org/</a><br/>\n<br/>\n<br/>\nBea</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling and traveling abroad","postDate":"1266192405","msgId":50799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4OURCOTFCLTZGQ0MtNDA1MS04MjM2LTYyODVDRjVBODNFMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPg=="},"prevInTopic":50794,"nextInTopic":50800,"prevInTime":50798,"nextInTime":50800,"topicId":50791,"numMessagesInTopic":0,"msgSnippet":"-=-Is unschooling or homeschooling common in France? How will locals view us when we don t send the children to school... Would we get in trouble with the","messageBody":"<div id=\"ygrps-yiv-238966759\">-=-Is unschooling or homeschooling common in France? How will locals  <br/>\nview us when we don&#39;t send the children to school... Would we get in  <br/>\ntrouble with the authorities there? We filed a PSA, can we use this  <br/>\nabroad? Is it valid?-=-<br/>\n<br/>\nThere are ways to be registered with a school, and being in California  <br/>\nthat would be easy.  You could call it a big old field trip. &lt;G&gt;<br/>\n<br/>\nFrance isn&#39;t doing so well lately, with homeschooling, but I have some  <br/>\nlinks you can look through.   I know more about some of them than  <br/>\nothers.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.louves-online.com/\">http://www.louves-online.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rama.1901.org/vens/\">http://www.rama.1901.org/vens/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://fr.groups.yahoo.com/group/grandir_ensemble_grandir_libres/\">http://fr.groups.yahoo.com/group/grandir_ensemble_grandir_libres/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://parents.autrement.free.fr/\">http://parents.autrement.free.fr/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wmaker.net/maisonenfant/Unschooling_a10.html\">http://www.wmaker.net/maisonenfant/Unschooling_a10.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.s-mz.net/\">http://www.s-mz.net/</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":430148316,"authorName":"Joy","from":"Joy &lt;whatismyusername@...&gt;","profile":"whatismyusername@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling and traveling abroad","postDate":"1266184511","msgId":50794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwNzgzNy43MzM4NS5xbUB3ZWIxMTQwMDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":50791,"nextInTopic":50799,"prevInTime":50793,"nextInTime":50795,"topicId":50791,"numMessagesInTopic":0,"msgSnippet":"One of the many reasons we choose to unschool is that we love traveling. I cannot imagine living a life based on school schedule. Plus there are so much to","messageBody":"<div id=\"ygrps-yiv-137284731\">One of the many reasons we choose to unschool is that we love traveling. I cannot imagine living a life based on school schedule. Plus there are so much to learn and to experience on the road when all our senses are highten in a new environment. <br/>\n<br/>\nI have been traveling with my two children (4 and 1 now) since they were four months old. They both have been to three continents and seven countries and my son has flown 80,000 when he reached two-year-old birthday. We were in Europe for a month last May when DS was 3 and DD 7 months old. We tried MANY forms of transportation during that trip since DS is crazy about trains cars trucks boats...<br/>\n<br/>\nI think unschooling and travel are perfect combination. There are &quot;tricks&quot; and &quot;tips&quot; for traveling with children that makes travel easier. <br/>\n<br/>\nWe travel through homeexchange priceline and other ways. So far we love it. Our children are very used to moving to different places. We remember their milestones by where they happened. <br/>\n<br/>\nAs a matter of fact we are going to be traveling today I would live to follow this thread and write more once we settle in. <br/>\n<br/>\nJoy (ds4.25 dd1.25)<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 14, 2010, at 11:14 AM, &quot;kaclip&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katrine@...\">katrine@...</a>&gt; wrote:<br/>\n<br/>\nMy husband and I are dreaming together! We have lived in California for more than a decade, and we want to go on an adventure. We are dreaming of going away with the kids (8 and 11) for a year or so, to Europe. We were thinking of using a house exchange system and find a place (or places) to live in France and/or Italy. <br/>\n<br/>\nWe are Europeans and won&#39;t have difficulty with visas or work permissions. We speak French, so the kids will be able to communicate from the beginning. And we would all be able to learn Italian if that&#39;s where we go...<br/>\n<br/>\nDoes anyone have experience traveling with their kids? <br/>\nIs unschooling or homeschooling common in France? How will locals view us when we don&#39;t send the children to school... Would we get in trouble with the authorities there? We filed a PSA, can we use this abroad? Is it valid?<br/>\n<br/>\nWhat if our boys resist the idea of traveling? I know this is *our* dream and not necessarily theirs. But isn&#39;t it a great learning and life experience to go somewhere new? <br/>\n<br/>\nWe would bring our dog with us, and lots of our things and their toys to make for a home environment they are used to.<br/>\n<br/>\nThis is a good time in our lives to go on an adventure, but we are also new homeschoolers/unschoolers and we&#39;re still deschooling and getting used to this new way of living. Maybe going away and exploring and learning together would be great? Or is it &quot;safer&quot; for the kids to stay with the life they know?<br/>\n<br/>\nThanks for any perspectives on this.<br/>\n<br/>\n-Katrine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":139171607,"authorName":"kaclip","from":"&quot;kaclip&quot; &lt;katrine@...&gt;","profile":"kaclip","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and traveling abroad","postDate":"1266182078","msgId":50791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsOXAzdStvN3ZtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":50794,"prevInTime":50790,"nextInTime":50792,"topicId":50791,"numMessagesInTopic":0,"msgSnippet":"My husband and I are dreaming together! We have lived in California for more than a decade, and we want to go on an adventure. We are dreaming of going away","messageBody":"<div id=\"ygrps-yiv-1845326528\">My husband and I are dreaming together! We have lived in California for more than a decade, and we want to go on an adventure. We are dreaming of going away with the kids (8 and 11) for a year or so, to Europe. We were thinking of using a house exchange system and find a place (or places) to live in France and/or Italy. <br/>\n<br/>\nWe are Europeans and won&#39;t have difficulty with visas or work permissions. We speak French, so the kids will be able to communicate from the beginning. And we would all be able to learn Italian if that&#39;s where we go...<br/>\n<br/>\nDoes anyone have experience traveling with their kids? <br/>\nIs unschooling or homeschooling common in France? How will locals view us when we don&#39;t send the children to school... Would we get in trouble with the authorities there? We filed a PSA, can we use this abroad? Is it valid?<br/>\n<br/>\nWhat if our boys resist the idea of traveling? I know this is *our* dream and not necessarily theirs. But isn&#39;t it a great learning and life experience to go somewhere new? <br/>\n<br/>\nWe would bring our dog with us, and lots of our things and their toys to make for a home environment they are used to.<br/>\n<br/>\nThis is a good time in our lives to go on an adventure, but we are also new homeschoolers/unschoolers and we&#39;re still deschooling and getting used to this new way of living. Maybe going away and exploring and learning together would be great? Or is it &quot;safer&quot; for the kids to stay with the life they know?<br/>\n<br/>\nThanks for any perspectives on this.<br/>\n<br/>\n-Katrine</div>","specialLinks":[]}],"prevTopicId":50829,"nextTopicId":36624}}