{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":284087656,"authorName":"semajrak","from":"&quot;semajrak&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friend and snacks","postDate":"1303227687","msgId":60724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlva2FmNytmanQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyRkI5M0U5RTk1RjRGQTM4ODdERTU4MDkwNDRDNUIxQEx5bGFQQz4="},"prevInTopic":60633,"nextInTopic":0,"prevInTime":60723,"nextInTime":60725,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"Thanks for the ideas and perspective, everyone.  Popcorn...why didn t I think of that?!  Abundant, easy and inexpensive. As I was reading, I felt some sense of","messageBody":"<div id=\"ygrps-yiv-893475706\">Thanks for the ideas and perspective, everyone.  Popcorn...why didn&#39;t I think of that?!  Abundant, easy and inexpensive.<br/>\n<br/>\nAs I was reading, I felt some sense of pride that my son&#39;s choices are made from a place of action, and not reaction.  This not only gives me confidence in my choices as a parent, it encourages me to be compassionate for our little friend.  I think that was what I was looking for.<br/>\n<br/>\nKaren.</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Friend and snacks","postDate":"1302977741","msgId":60633,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyRkI5M0U5RTk1RjRGQTM4ODdERTU4MDkwNDRDNUIxQEx5bGFQQz4=","inReplyToHeader":"PERGQ0QwQjZDLUNCMjAtNDQ0NS1BQTkzLTI4OTVDNTRCRUNDMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGlvY2hqZitvamg4QGVHcm91cHMuY29tPiA8REZDRDBCNkMtQ0IyMC00NDQ1LUFBOTMtMjg5NUM1NEJFQ0MyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":60631,"nextInTopic":60724,"prevInTime":60632,"nextInTime":60634,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"Much of what I learned (in the deep personal knowledge way, not the oh, I read in a book... way) was from seeing the way kids acted when they were limited","messageBody":"<div id=\"ygrps-yiv-544514494\">Much of what I learned (in the deep personal knowledge way, not the &quot;oh, I read in a book...&quot; way) was from seeing the way kids acted when they were limited and measured and deprived and shamed at home. Sometimes I saw how it affected eating, or watching TV, or playing video games, or making noise, or just laughing and being silly, or asking questions. And though sometimes my kids were surprised by or inconvenienced by the other kids&#39; neediness and overexuberance, what it did for me was to reinforce and solidify that our policy of choices are REALLY, and truly, creating thoughtful children who chose for real, personal reasons and not in wild thought-free reaction to limits.<br/>\n<br/>\nNo matter how much Marty might play a video game now as a young adult, It&#39;s an action, and not a reaction. Holly wore heavy (for her) eye makeup yesterday, but it wasn&#39;t in reaction to limitations, or to shock anyone. It was an artistic choice made from vast freedom to choose less or more without it carrying an interpersonal &quot;message&quot; or without being done for the sake of going right up to some limit and not past (or going up to a limit and then a little past). I&#39;m not thinking of a way to describe that, and if anyone can help, that would be great.<br/>\n<br/>\nSandra+++++++++++++++++++++++++++++++++<br/>\n++++++++++++++++++======================================================<br/>\nthis makes perfect sense to me, and I think I have clear contrast with my children because they WERE in school and then they were unschooled, and after a good, loooong time of deschooling, I can now see contrast in their choices now vs. then.  so in a sense it’s like a study that doesn’t need random selection because it’s the same exact people being studied, at different points in time.  so maturity affects things for sure, but I am positive that’s not all there is to it!  <br/>\nlast week, my son had a sleepover here, with his two friends (brothers) – and we had talked with them (the other parents and i) about how the last few sleepovers had involved staying up all night, and how it had taken days for them all to recover, and how that didn’t really work well for the rest of the family, and impacted on other plans, etc.  They’d all agreed that they felt the same way and would make sure to go to sleep by 2 or 3am.    the first sleepover after that conversation, my son had been adamant that 3am would be it, but he ended up coming up to bed on his own at 2, when he felt tired.  last week, he came up at 1 and read to himself before going to sleep.      he has the same level of adjustment to personal enjoyment/experience/needs with regard to food, media, etc. now, to which he used to be desperately and disconnectedly attached, when he experienced limitations, judgment, etc. around those topics.<br/>\nI have seen the same transformation in my daughter over the years of unschooling – especially with sleep and style/dress/hair, and with socializing.    she has an “alternative” look as far as style goes, but it’s not in any way for *anyone* else anymore, the way it used to be, when she was trying desperately to be something recognizable and valuable to others.    when she was in school, that took many forms, in terms of style – sometimes trying to “fit in” and keep up with the latest styles with clothes and makeup and hair, etc., and at other times trying to be different and noticeable – but it was never for *her* it was always in reaction to something.  seeking something.  now – her style is her own, and there’s just a different *vibe* about it, so I can understand not being able to describe it well, sandra, with regard to holly’s makeup and marty’s video gaming, but action not reaction captures it very well, I think!<br/>\nmy experience with kids who were in school, then not, limited and controlled, then not, really is abundant evidence for the misconceptions of “if I let” (if I let them watch as much t.v as they want, they will do nothing else, if I let them eat candy, they will eat nothing but candy, if I don’t make them go to sleep, they will stay up all night forever, etc.) – because even previously controlled kids find a balance point once they really trust that the controls are gone forever.  <br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Friend and snacks","postDate":"1302973858","msgId":60631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGQ0QwQjZDLUNCMjAtNDQ0NS1BQTkzLTI4OTVDNTRCRUNDMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlvY2hqZitvamg4QGVHcm91cHMuY29tPg==","referencesHeader":"PGlvY2hqZitvamg4QGVHcm91cHMuY29tPg=="},"prevInTopic":60630,"nextInTopic":60633,"prevInTime":60630,"nextInTime":60632,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"-=-We used to host a family of four kids, and while all the kids liked to snack, the youngest guys were bottomless pits. -=-Plus they had snack limits at home","messageBody":"<div id=\"ygrps-yiv-101771935\">-=-We used to host a family of four kids, and while all the kids liked to snack, the youngest guys were bottomless pits.<br/>\n-=-Plus they had snack limits at home so it became a free for all - they were really interested in all we had available and wanted to have it all.-=-<br/>\n<br/>\nMuch of what I learned (in the deep personal knowledge way, not the &quot;oh, I read in a book...&quot; way) was from seeing the way kids acted when they were limited and measured and deprived and shamed at home.   Sometimes I saw how it affected eating, or watching TV, or playing video games, or making noise, or just laughing and being silly, or asking questions.   And though sometimes my kids were surprised by or inconvenienced by the other kids&#39; neediness and overexuberance, what it did for me was to reinforce and solidify that our policy of choices are REALLY, and truly, creating thoughtful children who chose for real, personal reasons and not in wild thought-free reaction to limits.<br/>\n<br/>\nNo matter how much Marty might play a video game now as a young adult, It&#39;s an action, and not a reaction.  Holly wore heavy (for her) eye makeup yesterday, but it wasn&#39;t in reaction to limitations, or to shock anyone.  It was an artistic choice made from vast freedom to choose less or more without it carrying an interpersonal &quot;message&quot; or without being done for the sake of going right up to some limit and not past (or going up to a limit and then a little past).  I&#39;m not thinking of a way to describe that, and if anyone can help, that would be great.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":76178688,"authorName":"jennifer.neary","from":"&quot;jennifer.neary&quot; &lt;pcjen@...&gt;","profile":"jennifer.neary","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friend and snacks","postDate":"1302972847","msgId":60630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvY2hqZitvamg4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlvNTl0ZStkcWw5QGVHcm91cHMuY29tPg=="},"prevInTopic":60612,"nextInTopic":60631,"prevInTime":60629,"nextInTime":60631,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"We used to host a family of four kids, and while all the kids liked to snack, the youngest guys were bottomless pits. Plus they had snack limits at home so it","messageBody":"<div id=\"ygrps-yiv-1657910698\">We used to host a family of four kids, and while all the kids liked to snack, the youngest guys were bottomless pits.<br/>\n<br/>\nPlus they had snack limits at home so it became a free for all - they were really interested in all we had available and wanted to have it all.<br/>\n<br/>\nI was getting tired of dealing with all the requests for food, so what I ended up doing was setting out a variety of snacks on the kitchen table and telling them they could have as much as they wanted of any of it.  I put out a variety of stuff I knew they liked, and it seemed to satisfy their desire to root around and see what we had.<br/>\n<br/>\nJennie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;semajrak&quot; &lt;semajrak@...&gt; wrote:<br/>\n<br/>\n&gt; <br/>\n&gt; This friend starts eating from the moment he walks through the door.  He used to just grab the food himself, but he tends to drop the food all over, so I asked that he come and get me.  So, now, numerous times throughout their play he asks for snacks. </span></blockquote></div>","specialLinks":[]},{"userId":274801552,"authorName":"HA","from":"&quot;HA&quot; &lt;verbiosa@...&gt;","profile":"verbiosa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Friend and snacks","postDate":"1302891837","msgId":60612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvYTJmdCtxODUzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlvOWwybCtncm02QGVHcm91cHMuY29tPg=="},"prevInTopic":60608,"nextInTopic":60630,"prevInTime":60611,"nextInTime":60613,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"If you ve given him the expectation of getting whatever he wants, whenever and however he asks for it, he won t believe his parents if they say he shouldn t","messageBody":"<div id=\"ygrps-yiv-1042150353\">If you&#39;ve given him the expectation of getting whatever he wants, whenever and however he asks for it, he won&#39;t believe his parents if they say he shouldn&#39;t ask. <br/>\n<br/>\nThe next time he comes over, you might say, &quot;Okay, we can all have one snack today and save the rest for other days. We have granola bars/apples/whatever. Which one would you like, or I could make you a platter?&quot; Or whatever you feel comfortable providing.<br/>\n<br/>\nHilary</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friend and snacks","postDate":"1302878550","msgId":60608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvOWxnbSt0ODVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUwQTJBQUMwLUVGNTMtNEVCQi1BQjE3LTk0QUQyQzEzREVEMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60607,"nextInTopic":60612,"prevInTime":60607,"nextInTime":60609,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"... ***************** Popcorn and peanut butter cookies are two of my standbys . Both are cheap. Popcorn is good for the kind of mindless snacking some","messageBody":"<div id=\"ygrps-yiv-20364289\">Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Maybe get vegetables and ranch dressing, or other things that are filling but not expensive.  Graham crackers.  Or make sandwiches cut in fourths.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nPopcorn and peanut butter cookies are two of my &quot;standbys&quot;. Both are cheap. Popcorn is good for the kind of &quot;mindless snacking&quot; some people do while watching tv or playing video games. Peanut butter cookies are filling and can be made fast (these are my favorite with Zannon because he can help and it gives Mo a longer break - and Mo hates to put her hands in batter so I get a dose of that kind of play which I sometimes miss with her). Oh! and we also stock up on cheap mac-n-cheese - the kind that you can buy at 3 for a dollar but it feels like a treat to some kids. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friend and snacks","postDate":"1302878101","msgId":60607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvOWwybCtncm02QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlvNTl0ZStkcWw5QGVHcm91cHMuY29tPg=="},"prevInTopic":60598,"nextInTopic":60608,"prevInTime":60606,"nextInTime":60608,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"... **************** Ray had an enormous apetite as a kid - it was shocking how much he could eat, as much as an adult with a big metabolism. I would try to","messageBody":"<div id=\"ygrps-yiv-837747436\">&quot;semajrak&quot; &lt;semajrak@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I have casually said to the mom that their son sure eats a lot after school.  She stated that her husband mentioned to her that he must be eating us out of house and home.<br/>\n </span></blockquote>****************<br/>\n<br/>\nRay had an enormous apetite as a kid - it was shocking how much he could eat, as much as an adult with a big metabolism. I would try to bring or send snacks with him when he was visiting, but his bio mom didn&#39;t have the same thoughts on the matter as I did - in her view, everyone should feed everyone else&#39;s children. It takes a village, right? I don&#39;t agree with that, but it&#39;s useful to know some people think that way and will be surprised by your aversion to feeding their high-metabolism child enough for an entire football team. Hinting may not be enough. If you want the other family to provide some food from him, you&#39;ll need to tell them in so many words - kindly, but do let them know you don&#39;t have the same expectations they do.<br/>\n<br/>\nMorgan has a young friend who likes a lot of snacks when he comes over, and I use it as a way to give Mo breaks - hey, Zannon, come on in the kitchen and I&#39;ll get you another snack. But he&#39;s not over every day, either. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My son said to me one evening (I did not ask him) that he never eats like that at his friend&#39;s house.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nWhich &quot;he&quot;? Your son or his friend? Sometimes kids with food restrictions will go a little nuts in homes where there are none. But if the other boy snacks like that at home, then that&#39;s how much he eats. School is rough on kids who need a lot of calories b/c they&#39;re strictly limited to when they can eat - and if they buy lunch at school, how much they can eat, too. So he may need to eat even more when he&#39;s home. <br/>\n<br/>\nNone of this is to say you should feel obligated to feed him as much as he wants, though. It&#39;s sweet of you to do so, and if you can offer him filling snacks that don&#39;t break your budget, that&#39;s great. You can&#39;t unschool a guest, though. You can be friendly and provide support, be a good hostess and a thoughtful, kind adult presence, but most of what other kids &#39;bring&#39; to your home in terms of behavior will be reactions to the rest of their life. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Friend and snacks","postDate":"1302792709","msgId":60598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwQTJBQUMwLUVGNTMtNEVCQi1BQjE3LTk0QUQyQzEzREVEMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlvNmc4ZSszdnZqQGVHcm91cHMuY29tPg==","referencesHeader":"PGlvNmc4ZSszdnZqQGVHcm91cHMuY29tPg=="},"prevInTopic":60596,"nextInTopic":60607,"prevInTime":60597,"nextInTime":60599,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"-=-It sounds as if your son s friend s parents are aware he s eating a lot at your house, but are assuming it s not a problem. Maybe that was his mom s way of","messageBody":"<div id=\"ygrps-yiv-187040438\">-=-It sounds as if your son&#39;s friend&#39;s parents are aware he&#39;s eating a lot at your house, but are assuming it&#39;s not a problem. Maybe that was his mom&#39;s way of feeling you out about it, when she said her husband said their son was probably eating you out of house and home. -=-<br/>\n<br/>\nThere were a couple of times I would ask another mom to send snacks for all the kids to share, and they would send things that weren&#39;t very appealing.  So it&#39;s possible that part of the problem is that. :-)<br/>\n<br/>\nMaybe get vegetables and ranch dressing, or other things that are filling but not expensive.  Graham crackers.  Or make sandwiches cut in fourths.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friend and snacks","postDate":"1302774862","msgId":60596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvNmc4ZSszdnZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUwMDU0MC4zNTExMi5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":60595,"nextInTopic":60598,"prevInTime":60595,"nextInTime":60597,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"===If he says he is still hungry I would ask him if he wants to go home get some dinner and then came back later.=== I d actually address it with his mom, by","messageBody":"<div id=\"ygrps-yiv-128201394\">===If he says he is still hungry I would ask him if he wants to go home get some dinner and then came back later.===<br/>\n<br/>\nI&#39;d actually address it with his mom, by telling her he&#39;s welcome to bring an after-school snack over to your house with him if he doesn&#39;t want to eat before he comes over, but that it&#39;s seeming he needs something substantial in his tummy after school because he&#39;s focusing on that more than playing when he&#39;s over.<br/>\n<br/>\nI have one niece, in particular, who used to, immediately upon arriving at our house, tell me she was starving. If she gets here hungry, she&#39;s cranky and can be quite rude in how she interacts with us. After that happened a couple times, the next time she was planning to come over after school I asked my sis-in-law ahead of time if she&#39;d be sure my niece had something to eat *before* coming over, so that she&#39;d be energetic and ready to play when she got here. It can be an awkward subject to broach, but if the alternative is that you don&#39;t want the kiddo to come visit (which was how I was feeling about that particular niece of mine), then it&#39;s worth broaching the subject.<br/>\n<br/>\nIt sounds as if your son&#39;s friend&#39;s parents are aware he&#39;s eating a lot at your house, but are assuming it&#39;s not a problem. Maybe that was his mom&#39;s way of feeling you out about it, when she said her husband said their son was probably eating you out of house and home.  <br/>\n<br/>\nAlso, if the food rules are different at your house than at his house, and/or if you offer different foods than he gets at home, I can understand why it&#39;d be appealing to him to eat his fill at your house. When my younger nieces and nephew are over, I more or less go with the food rules they have at home. My son&#39;s fine with that because it&#39;s not a long period of time (2 or 3 hours) and he knows that when they&#39;re gone he has open access to whatever he wants to eat. Maybe doing something like that would be helpful when your son&#39;s friend is over.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Friend and snacks","postDate":"1302742080","msgId":60595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMDU0MC4zNTExMi5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDg4N0JDMTc1LTYzQUYtNEM1Qy04Q0E0LUI1RDg0NTZGMEE4NEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGlvNTl0ZStkcWw5QGVHcm91cHMuY29tPiA8ODg3QkMxNzUtNjNBRi00QzVDLThDQTQtQjVEODQ1NkYwQTg0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":60594,"nextInTopic":60596,"prevInTime":60594,"nextInTime":60596,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"If I had a huge food budged that allowed me to have a lot of snacks available I may not mind at all. SinceI have a small budged and my kids and my husband","messageBody":"<div id=\"ygrps-yiv-537266461\">If I had a huge food budged that allowed me to have a lot of snacks available I <br/>\nmay not mind at all.<br/>\nSinceI have a small budged and my kids and my husband have several foods they <br/>\nlove to eat and snacks they<br/>\n like, my priority is them.<br/>\nI would serve oe snack  and if he wanted more I would say &quot; Sorry but that is <br/>\nall I have today&quot;.<br/>\nIf he says he is still hungry I would ask him if he wants to go home get some <br/>\ndinner and then came back later.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Friend and snacks","postDate":"1302739515","msgId":60594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4N0JDMTc1LTYzQUYtNEM1Qy04Q0E0LUI1RDg0NTZGMEE4NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlvNTl0ZStkcWw5QGVHcm91cHMuY29tPg==","referencesHeader":"PGlvNTl0ZStkcWw5QGVHcm91cHMuY29tPg=="},"prevInTopic":60593,"nextInTopic":60595,"prevInTime":60593,"nextInTime":60595,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"-=- Sharing stresses him out, and makes him eat really fast. After he finishes his platter, he asks for more. I am beginning to resent it (I probably need help","messageBody":"<div id=\"ygrps-yiv-1921788491\">-=- Sharing stresses him out, and makes him eat really fast. After he finishes his platter, he asks for more. I am beginning to resent it (I probably need help here, seeing it a different way).-=-<br/>\n<br/>\nI don&#39;t think you&#39;re obligated to provide more than a small snack to a visiting kid.  Seriously, don&#39;t feel like you have to feed him as much as he can possibly eat.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"semajrak","from":"&quot;semajrak&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Friend and snacks","postDate":"1302735598","msgId":60593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvNTl0ZStkcWw5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":60594,"prevInTime":60592,"nextInTime":60594,"topicId":60593,"numMessagesInTopic":0,"msgSnippet":"I am hoping to get some input on a situation with my son s friend. My son is 8 and has never been to school.  We have been radically unschooling for the past","messageBody":"<div id=\"ygrps-yiv-884673289\">I am hoping to get some input on a situation with my son&#39;s friend.  <br/>\n<br/>\nMy son is 8 and has never been to school.  We have been radically unschooling for the past couple years, and I feel like our life is peaceful and full of learning.  Because of the way we choose to live, our son eats when he is hungry.  He snacks throughout the day, and his choices are varied from cookies, to apples, to chickpeas...whatever is in our home and whatever he is craving.  <br/>\n<br/>\nOur friend lives next door.  He is schooled and comes from a very mainstream, but relatively open-minded family.  The boys get along great most of the time.  This friend shows up at our door almost daily, and my son is usually eager to play with him.  <br/>\n<br/>\nThis friend starts eating from the moment he walks through the door.  He used to just grab the food himself, but he tends to drop the food all over, so I asked that he come and get me.  So, now, numerous times throughout their play he asks for snacks.  Some days he will go through 3 granola bars, two bowls of cereal, a couple apples that he prefers peeled and chopped up, and some juice.  I actually did start stacking our pantry with the items he ate most.  I make him his own monkey platter with his favourite snacks.  Sharing stresses him out, and makes him eat really fast.  After he finishes his platter, he asks for more.  I am beginning to resent it (I probably need help here, seeing it a different way).<br/>\n<br/>\nMy son and husband have both said they believe this friend is snacking too much.  My son has started wanting to play only outside with him, and I believe it is because he is kind of annoyed by his friend&#39;s constant snacking.  My son said to me one evening (I did not ask him) that he never eats like that at his friend&#39;s house.  I was glad to hear this, as I would feel uncomfortable if my son was eating this much at our friend&#39;s house.<br/>\n<br/>\nI have casually said to the mom that their son sure eats a lot after school.  She stated that her husband mentioned to her that he must be eating us out of house and home.  <br/>\n<br/>\nAny suggestions or similar experiences?</div>","specialLinks":[]}],"prevTopicId":60665,"nextTopicId":60548}}