{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] free speech online","postDate":"1253578137","msgId":47542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0RjNCQkMyLTVEQzMtNEE3Ny1COUMyLTM5QzAwQ0UxQTAxMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg5OHQ4dit0ZGc3QGVHcm91cHMuY29tPg==","referencesHeader":"PGg5OHQ4dit0ZGc3QGVHcm91cHMuY29tPg=="},"prevInTopic":47541,"nextInTopic":0,"prevInTime":47541,"nextInTime":47543,"topicId":47541,"numMessagesInTopic":0,"msgSnippet":"-=- If I catch you peeing in my yard, I will hose you.-=- I liked that line. He s wrong about the free speech, though. It s like freedom of the press.  I don t","messageBody":"<div id=\"ygrps-yiv-407468598\">-=- If I catch you peeing in my yard, I will hose you.-=-<br/>\n<br/>\nI liked that line.<br/>\n<br/>\nHe&#39;s wrong about the free speech, though. It&#39;s like freedom of the  <br/>\npress.  I don&#39;t have the right to demand that Newsweek publishes my  <br/>\narticle, or even my letter to the editor I do have as much right to  <br/>\npublish a magazine as the owners of Newsweek have.<br/>\n<br/>\nWhat people don&#39;t want is to write their one little article and send  <br/>\nit to their friends and relatives. They want the entire readership of  <br/>\nNewsweek!<br/>\n<br/>\nIf someone wants to be in a big unschooling discussion but doesn&#39;t  <br/>\nwant it to be mine, that&#39;s a problem. It belongs to somebody.  They  <br/>\ncan go along with the discussion as the owner prefers, or they can  <br/>\nstart their own discussion.  Their freedom of speech has to do with  <br/>\nthem having the same right I had to start a yahoo list or to have a  <br/>\nwebpage or a blogspot page or a Twitter account.  But some don&#39;t want  <br/>\ntheir own small new list.  They want my fat, ripe eight-year-old  <br/>\nvibrant list.   Nope; they don&#39;t get that.<br/>\n<br/>\nI&#39;ve used the analogy he used to, about people being guests in my  <br/>\nhome, when they&#39;re guests on my forum/message board/whatever.   Some  <br/>\npeople don&#39;t get it because they think &quot;freedom of speech&quot; means they  <br/>\ncan say whatever they want to wherever they want to.  It means they  <br/>\ncan say what they want to at their own house (if it&#39;s not too loud for  <br/>\nthe neighbors and not too threatening).<br/>\n<br/>\nHere&#39;s the dark and shady part, though, and twice it happened this  <br/>\nweekend.  Someone writes to me on the side and is really hateful or  <br/>\nthreatening because of something that happened in a public discussion,  <br/>\nor because I returned a post on someone who was on moderation for  <br/>\nbeing new to the group.  For someone to write me something mean on the  <br/>\nside, that&#39;s like following me home to my house, and in the dark on my  <br/>\nfront porch, saying something really awful.   In my real life if  <br/>\nsomeone did that I would turn on the porch light and if they didn&#39;t  <br/>\nscurry off like a cockroach, I would call 911.  When it&#39;s e-mail, my  <br/>\nversion of turning on the porchlight is to bring it to the list and  <br/>\nsay &quot;Look what someone just did out on the dark front porch.&quot;<br/>\n<br/>\nI am under no obligation whatsoever to let people threaten or insult  <br/>\nme on my porch or in my e-mail.  I have the right to open the trapdoor  <br/>\nunder people on this list.  It&#39;s right in the intro, &quot;trapdoors for  <br/>\nthe uncooperative.&quot;  I&#39;m also not under any obligation to trap-door  <br/>\nsomeone quickly.  If they insist on staying and being tacky, it&#39;s not  <br/>\nillegal or immoral for me to give them another chance or three to see  <br/>\nthe porchlight and do better.<br/>\n<br/>\nWhen someone acts like a twerp or a twitchy-witchy woman, others will  <br/>\nsee and learn how not to be on other lists.  So there&#39;s a learning  <br/>\naspect too.  And if someone sees for the first time how terrible  <br/>\nsomeone can be, even when there are others trying sincerely and freely  <br/>\nto help them understand unschooling or parenting better, then many  <br/>\npeople have learned something, even if the crazed front-porch speech  <br/>\nmaker hasn&#39;t (yet).<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"free speech online","postDate":"1253570655","msgId":47541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5OHQ4dit0ZGc3QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47542,"prevInTime":47540,"nextInTime":47542,"topicId":47541,"numMessagesInTopic":0,"msgSnippet":"The blogger, Steve Pavlina posted an article today about online communities, that I thought had some well-stated points. It s VERY long - start with You re an","messageBody":"<div id=\"ygrps-yiv-482657079\">The blogger, Steve Pavlina posted an article today about online communities, that I thought had some well-stated points. It&#39;s VERY long - start with &quot;You&#39;re an Invited Guest&quot; for the parts I thought most relevant about these email lists.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.stevepavlina.com/blog/2009/09/free-speech-in-online-communities-the-delusion-of-entitlement/\">http://www.stevepavlina.com/blog/2009/09/free-speech-in-online-communities-the-delusion-of-entitlement/</a><br/>\n<br/>\nI can say I get the most value from the moderated lists. Our local unschooling list barely discusses unschooling at all, because the owners have taken a &quot;we&#39;re not here to judge what people call unschooling&quot; attitude. It&#39;s nice for finding homeschoolers (who might call themselves unschoolers) who live close to me, but that&#39;s really about it.<br/>\n<br/>\nThere has to be a clear vision for the email group and some discernment about what gets discussed, for it to be very valuable *unschooling* discussion. I&#39;m grateful this list is here.<br/>\n<br/>\nCaren</div>","specialLinks":[]}],"prevTopicId":47533,"nextTopicId":47548}}