{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I think I&#39;m getting it... Warning!  I talk about my actual children ;-)","postDate":"1246487885","msgId":46187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3ODc2MS44NDIzMi5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGgyZ2prMSt1c2lpQGVHcm91cHMuY29tPg==","referencesHeader":"PGgyZ2prMSt1c2lpQGVHcm91cHMuY29tPg=="},"prevInTopic":46186,"nextInTopic":0,"prevInTime":46186,"nextInTime":46188,"topicId":46182,"numMessagesInTopic":0,"msgSnippet":"Kelly has your daughter Amelia tried Roblox.com? Lots of kids making their own games and learning Lua language (scripting) It is free and very cool.   Alex","messageBody":"<div id=\"ygrps-yiv-1942839887\">Kelly has your daughter Amelia tried Roblox.com?<br/>\nLots of kids making their own games and learning Lua language (scripting)<br/>\nIt is free and very cool.<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I think I&#39;m getting it... Warning!  I talk about my actual children ;-)","postDate":"1246487797","msgId":46186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5MjAyOS43MzE1Ny5xbUB3ZWI1OTIwNC5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PGgyZ2prMSt1c2lpQGVHcm91cHMuY29tPg==","referencesHeader":"PGgyZ2prMSt1c2lpQGVHcm91cHMuY29tPg=="},"prevInTopic":46182,"nextInTopic":46187,"prevInTime":46185,"nextInTime":46187,"topicId":46182,"numMessagesInTopic":0,"msgSnippet":"Kelly, I was really moved by this post, thanks for the work you put into it. Cameron [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-712459815\">Kelly, I was really moved by this post, thanks for the work you put into it. Cameron<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":381959449,"authorName":"kelly_sturman","from":"&quot;kelly_sturman&quot; &lt;conspicuousfamily@...&gt;","profile":"kelly_sturman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"I think I&#39;m getting it... Warning!  I talk about my actual children ;-)","postDate":"1246482881","msgId":46182,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyZ2prMSt1c2lpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46186,"prevInTime":46181,"nextInTime":46183,"topicId":46182,"numMessagesInTopic":0,"msgSnippet":"So, here I am, deschooling. Here are some choices I ve made lately that I think are better than ones I used to make: 1) Samantha (9 y.o., adopted 5.5 years ago","messageBody":"<div id=\"ygrps-yiv-944751791\">So, here I am, deschooling.<br/>\nHere are some choices I&#39;ve<br/>\nmade lately that I think are<br/>\nbetter than ones I used to make:<br/>\n<br/>\n1) Samantha (9 y.o., adopted<br/>\n5.5 years ago from China) just<br/>\nhad a birthday.  She got everything<br/>\nthat she asked for, namely, a laptop<br/>\nand &quot;Guitar Hero:  World Tour&quot; for<br/>\nPS3.  When she opened them, though,<br/>\nshe showed no emotion whatsoever<br/>\nabout the game and actually complained<br/>\nabout the laptop, b/c she wasn&#39;t thrilled<br/>\nabout the color.<br/>\n<br/>\nOld reaction might have been to think,<br/>\n&quot;What a spoiled child.  How ungrateful<br/>\ncan she be?&quot;<br/>\n<br/>\nNew response:  I remembered that Sam<br/>\nhas a hard time with abundance.  Her<br/>\nearly experiences were of extreme deprivation,<br/>\nand she is still recovering from those <br/>\nexperiences.  I felt disappointed, not<br/>\nin Sam, but in myself, that I hadn&#39;t <br/>\nprepared her better for her birthday.<br/>\n<br/>\nI know, but had forgotten, that Samantha<br/>\nfinds it helpful to role play giving and<br/>\nreceiving gifts in the days immediately<br/>\nleading up to a gift receiving occasion.<br/>\nIt helps her remember what others expect<br/>\nher to say when receiving a gift to role<br/>\nplay it beforehand.  I had assumed--you know <br/>\nwhat they say about &quot;assume&quot;--that Samantha no <br/>\nlonger needed this practice.  My assumption<br/>\nwas wrong.<br/>\n<br/>\nMy mother was annoyed that Sam didn&#39;t show<br/>\ngratitude for the gift.  The sad truth is,<br/>\nthere was a time I probably would have agreed<br/>\nwith, and sided with, my mother.  I probably<br/>\nwould have scolded and shamed my daughter, and<br/>\non her birthday, no less.<br/>\n<br/>\nNow, though, I had a different response.  I knew<br/>\nSamantha was picking up on my parents&#39; disappointed<br/>\nvibes, and I took responsibility.  Better late than<br/>\nnever.  It was a bad moment, but that didn&#39;t mean<br/>\nthat we all had to go on to have a bad day.  ;-)<br/>\n<br/>\nI gave Sam a reassuring hug.  I gave voice<br/>\nto her feelings.  (I knew what she was feeling, b/c<br/>\nshe&#39;s explained it to me, in private, in the past,<br/>\nafter receiving lots of gifts, or expensive gifts.)<br/>\nSo I hugged her, and smiled at her, and let my love <br/>\nfor her flow.  I felt my total acceptance of her, just <br/>\nas she is.  <br/>\n<br/>\nI also decided, then and there, not to let myself get <br/>\nstuck in blaming myself for not preparing Sam better for <br/>\nreceiving presents.  Instead, I looked at what I could do <br/>\nto make things better for her in that moment.<br/>\n<br/>\nI said, &quot;Even though you wanted this game, it&#39;s still pretty surprising that you actually got it, isn&#39;t it?&quot;  She nodded.  <br/>\nI saw my parents eyes light up with understanding, saw their<br/>\ndisappointment and harsh judgements melt away.  We all know<br/>\nthat it is still really hard for her to accept abundance.<br/>\nThen, I whispered in her ear; I told her that her grandma and <br/>\ngrandpa would like to hear a &quot;thank you&quot; for the present they<br/>\ngave her.<br/>\n<br/>\nShe ran up to them, hugged each of them, and said, very <br/>\nsincerely, &quot;Thank you sooooo much!  I really wanted this<br/>\ngame.  I hope you will play it with me.&quot;  What could have<br/>\nbeen a very bad moment became a very sweet one.  And there<br/>\nwere more sweet moments later as three generations played<br/>\nthe game together.<br/>\n<br/>\nI also told her we could look into exchanging the laptop<br/>\nfor a different color.  She thought about that, and <br/>\ndecided that she does like red, after all.<br/>\n<br/>\n2) I read the wonderful essay, in sonnet form, posted<br/>\nhere.  It gave me goosebumps.  And I knew that there<br/>\nwas a time when I would have reacted with jealousy and<br/>\nfear.  You see, my 12 y.o. son, Caleb, struggles to put <br/>\nhis ideas into writing.  It comes up sometimes... <br/>\nFor example, he has a very large repertoire of songs he <br/>\ncan play on violin. His violin teacher asked him to write <br/>\ndown the first few measures of each of the tunes on index <br/>\ncards. That way, he can bring the index cards to gigs, and <br/>\nhave a reminder of how his songs start.  (Once he&#39;s started <br/>\nplaying, he can continue on from memory.)  Or, he goes to <br/>\nreligious school, b/c he wants to participate in a Bar <br/>\nMitzvah ceremony next year.  Writing assignments come up <br/>\nthere, and he struggles.<br/>\n<br/>\nHe is very bright.  He can read well, and he is very <br/>\narticulate and thoughtful.  He&#39;s also a talented musician<br/>\nand a fairly good athlete.  He has amazing inter- and intra-<br/>\npersonal skills.  He has a knack for mathematics and a <br/>\nnatural facility for strategic thinking.  He is incredibly<br/>\nkind, and generous.  But when he tries to write... oh!  He <br/>\ncan&#39;t remember which way 9s go versus Ps.  He can&#39;t spell <br/>\nvery well.  He struggles with the grammar and punctuation.  <br/>\nIf he were in school, he would be labeled &quot;dysgraphic&quot; and <br/>\nhe&#39;d be constantly challenged to write better.  It could get discouraging.  Anybody judging him by his writing, and <br/>\nonly his writing, would get a very inaccurate idea of <br/>\nwho he is. <br/>\n<br/>\nAnyway, I read that amazing sonnet, and I didn&#39;t feel <br/>\njealous.  I felt happy that this young woman could<br/>\nwrite something so wonderful, and also happy for my<br/>\nson, for all the things he can do well, and for the<br/>\nfact that he doesn&#39;t have to struggle with language<br/>\narts classes for 12 or more years.  I&#39;m not worried.<br/>\nHe will find his way in life.  He will even learn to<br/>\nwrite well, if he wants to, when he wants to.  And<br/>\nif not, that will be fine.<br/>\n<br/>\n3) We went to a cave yesterday.  Samantha, who loves<br/>\ngaming, said she wanted to stay home to play video <br/>\ngames.  Old response would have been along the lines of:  <br/>\n&quot;Video games are a waste of time, and you play them all <br/>\nthe time.  YOu can play on the computer any old time, but<br/>\nyou can&#39;t go to a cave every day.  You are coming with us,<br/>\nand that is that.&quot;  New response:  &quot;Okay.&quot;  (And it really<br/>\n*was* okay with me.)  &quot;I know how it feels to want to<br/>\nkeep playing.  We will miss you, but I know you will<br/>\nhave fun.&quot;  (All said sincerely; I am a video game convert.)  <br/>\nAnd then...<br/>\n<br/>\n...Samantha logged off, saying, &quot;This 2D cave will be<br/>\nhere when we get home; I wanna see a 3D cave.&quot;<br/>\n<br/>\nMOREOVER, while I was delighted to have her company,<br/>\nI truly would have been happy if she stayed home to<br/>\ncontinue gaming.  I&#39;m glad she really has choices.<br/>\n<br/>\n4) At the caves, my 9 y.o. son, Mark, adopted last<br/>\nJuly from China, asked me how the stalagmites<br/>\nand stalagtites had formed.  I admitted that I<br/>\ndidn&#39;t know how to explain it to him, but I would<br/>\nfigure it out.  On the ride home, I realized that<br/>\nwe could make a supersaturated sugar solution,<br/>\nthen grow sugar crystals and make rock candy.<br/>\nThat&#39;s not exactly the same as how stalagmites<br/>\nare formed, but I think the general idea is close<br/>\nenough... for now.  The four younger kids all<br/>\nwanted to make rock candy, so we started on that.<br/>\nOnce upon a time, I would have been frustrated<br/>\nabout how to explain such a concept.  Opening<br/>\nup and being more playful helped me to see a<br/>\nsolution... no pun intended.<br/>\n<br/>\n5) My 10 y.o. daughter, Amelia, has a lot of<br/>\nneat ideas for video games she wants to write.<br/>\nBut so far, the only programming she can do<br/>\nis with Alice software, and she is bumping up<br/>\nagainst the limits of that software.  If she<br/>\nreally wants to write these games, that will<br/>\ninvolve choosing to learn to program in a more<br/>\npowerful computer language.  I would like to<br/>\nlearn to program, and I told Amelia so, and<br/>\nsaid that if she&#39;d like, we could learn together.<br/>\n<br/>\nShe said that sounded cool, but hasn&#39;t come back<br/>\nto me yet about doing it.  She continues to<br/>\nrefine her ideas about the games, though.  <br/>\n<br/>\nThere was a time when I would have pushed her<br/>\nto get into the programming part of it.  Now I can<br/>\nsee that would have crushed her enthusiasm.  She<br/>\nmight have abandoned the whole project, even though<br/>\nit means a lot to her.  So now, I focus my interest<br/>\nwhere her interest is focused:  on the storylines and <br/>\ncharacters.  She loves to talk about the games, so I <br/>\nask her about them and really listen to what she has<br/>\nto say, and only offer suggestions when she asks for them.  <br/>\nI may decide to learn a programming language just for my <br/>\nown pleasure, and if I do, maybe I can program the games <br/>\nfor her, if she wants me to.  <br/>\n<br/>\n6) My 17 y.o. son, Yuyu, adopted 3.5 years ago <br/>\nfrom China, is visiting us at our summer home.  He<br/>\nwill soon be returning to our year-round home<br/>\nto take a summer class (English for Speakers of<br/>\nOther Languages) and to take a summer job.  He<br/>\ngot a position in the kitchen of a local nursing<br/>\nhome.  It&#39;s a good foot in the door for him; he<br/>\nwants to work in food service.  Anyway... he&#39;s<br/>\nbeen acting like he feels blue.  Once upon a time,<br/>\nI would have left him alone in his unhappiness,<br/>\nfiguring, &quot;teens are just like that sometimes.&quot;<br/>\nBut now, I realize that his boredom is my<br/>\nresponsibility.  He came to visit us; we could<br/>\ndo more to make his stay pleasant.  I asked him<br/>\nto come along to the cave, and he did, and he had<br/>\na great time.  I asked my husband to take him grocery<br/>\nshopping and to cook with him--two things he loves--<br/>\nand my husband did, and Yuyu was happy.  I asked my<br/>\nparents if they would invite Yuyu to come along<br/>\nwith them when they go out to walk the dogs, and <br/>\nthey agreed, and Yuyu was happy, and so were my parents.<br/>\n<br/>\nYeah, I&#39;ve had a lot of parenting moments that I&#39;m<br/>\nnot proud of, but being present and aware and positive<br/>\nand focused on now is helping... I think.  I&#39;m still<br/>\nmaking mistakes, I&#39;m sure, and will continue to, but<br/>\nhopefully they will be fewer and farther between, and<br/>\nhopefully I am making amends with each good choice I<br/>\nmake now, and in each moment from here on out.<br/>\n<br/>\nNo names have been changed, and everybody involved<br/>\nis fine with the sharing of our family experiences.<br/>\n<br/>\nKelly Sturman</div>","specialLinks":[]}],"prevTopicId":46184,"nextTopicId":46157}}