{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":70,"messages":[{"userId":127921172,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;syltoyama@...&gt;","profile":"syltoyama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075221177","msgId":18515,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTI3MTYzMjU3LjI2NTAxLnFtYWlsQHdlYjIxNjAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDE3ZC4yNWQyYzA1MC4yZDQ3NThhOUBhb2wuY29tPg=="},"prevInTopic":18514,"nextInTopic":18516,"prevInTime":18514,"nextInTime":18516,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"I am getting better at the whole doing housework without feeling pissy thing. Just yesterday, I was feeling restless, the house was cluttered, that kind of","messageBody":"<div id=\"ygrps-yiv-774574552\">I am getting better at the whole doing housework without feeling pissy thing.  <br/>\n <br/>\nJust yesterday, I was feeling restless, the house was cluttered, that kind of thing.  Turns out I was PMSy, but that&#39;s part of what makes the moment even sweeter for me, since when I&#39;m that way I&#39;m more likely to be cranky than gracious.  Earlier in the morning, I had casually mentioned to Andy that maybe he could neaten up his room. He told me he likes it messy.<br/>\n <br/>\nI had cleaned the living room, unloaded (and reloaded) the dishwasher, and started gathering socks and underwear to wash with the sheets.  Remembering that Andy had complained about having the wear the same socks &#39;every time&#39; I went into his room to look for socks.  His room was an explosion of stuff everywhere -- duct tape stuck to the carpet, apparently just for fun, clothes, toys and scraps of paper everywhere, and clearly -- from the smell -- it was time to put new litter in the mouse cage.  I sorted thru it all, filled a shopping bag with paper scraps and tape, emptied and replaced the mouse litter, put all the toys in a box, thru all the blankets on the beds.  As I was finishing up the mouse cage, Dan insisted on filling the water bottle, and did a great job with it (and he&#39;s only 3).  Andy came, saw it all, and said, &quot;You cleaned my room?&quot;  I answered that I had been looking for socks, needed to clear trash out of my way, and changed the mouse cage because the smell bothered<br/>\n me -- that it had never been a mission to clean his room, really just to find socks.  And, it really wasn&#39;t clean, just less cluttered and lighter by some trash.  Along the way, I found the missing nail clippers -- a bonus!<br/>\n <br/>\nSeveral minutes later, he came to me in the kitchen and invited me to see his room.  I was busy making lunch, but guessing where this was going, I asked what I&#39;d see if I went to his room.  With a grin, I asked if he&#39;d already messed it up again.  He said, &quot;Yes.  When my room is clean it&#39;s like I&#39;m in another dimension.  When I can see the floor, it&#39;s like a 4th dimension.&quot;  I laughed with him and said, &quot;Really? It&#39;s your room, you have it any way you like it.  I didn&#39;t clean it for you, or because I expect you to keep it clean.  I cleaned so I could find your socks for the laundry.&quot;  And it really was okay with me. <br/>\n <br/>\nWhat was different this time?  Because in the past, I&#39;ve gone on about how other people could help me clean.  Yanno, the whole martying Mom thing.   As I started cleaning yesterday morning, I reminded myself of something I read about living peacefully with your kids.  I clean and do other needful things for me, because I want them done or I think they need to be done.  I&#39;m not doing all this for other people, and it&#39;s not fair to ask them to do it just to please me.  I&#39;ve invited these children into my life, to live in our home, not so that I could turn them into slave labor to keep my house clean.  It&#39;s also not part of my job to teach them how to keep house.  They&#39;ll figure out how they like things kept, watch me do it and choose to do it themselves, or not -- as they wish, not as I insist.  And it really is so much more pleasant to do things myself than to force others to do my bidding.  <br/>\n <br/>\nOkay, so now it sounds like rambling, but it was a really big moment for me.  I&#39;ve always been something of a control freak, so the living part of unschooling is often harder than giving up the schooly part.  It&#39;s just part of that natural progression from unschooling newbies still clinging to some pretense of control to the freedom of just living together.<br/>\nThis is nice!<br/>\n <br/>\nSylvia  <br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free web site building tool. Try it!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128695025,"authorName":"Wife2Vegman","from":"Wife2Vegman &lt;wifetovegman2002@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Need some input here...","postDate":"1075221046","msgId":18514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTI3MTYzMDQ2LjQ3MTk3LnFtYWlsQHdlYjQxNDA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDdlLjQ1YTQyYmEyLjJkNDdjOWU3QGFvbC5jb20+"},"prevInTopic":18509,"nextInTopic":18515,"prevInTime":18513,"nextInTime":18515,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"Guns and Swords and Knives. Not play guns or play swords and play knives. The real things. My 12.5yo boy is tired of the play things, and is askingfor the real","messageBody":"<div id=\"ygrps-yiv-490238394\">Guns and Swords and Knives.<br/>\n<br/>\nNot play guns or play swords and play knives.<br/>\n<br/>\nThe real things.<br/>\n<br/>\nMy 12.5yo boy is tired of the play things, and is<br/>\naskingfor the real versions to &quot;hang on his bedroom<br/>\nwall&quot;, to &quot;use at the target range with Dad&quot;, to have<br/>\n&quot;cuz a real knife would be neat&quot;.<br/>\n<br/>\nMy timid, mild-mannered,<br/>\nstill-scared-of-scarey-movies, gentle-giant wants<br/>\nweapons!  The boy who quit karate because he didn&#39;t<br/>\nwant to hurt the boys and girls he had to spar with.<br/>\n<br/>\nACK!<br/>\n<br/>\nHis friend Benjamin has a collection of real swords on<br/>\nthe wall of his room, mostly japanese swords and I<br/>\nthink one civil war sword.<br/>\n<br/>\nHe went to the target range with his daddy and his<br/>\ncousin and his uncle for the first time a couple weeks<br/>\nago and got to fire a real gun.<br/>\n<br/>\nHe knows his daddy has a real diver&#39;s knife and covets<br/>\nit quite a bit.<br/>\n<br/>\nI&#39;ve always tried my best to supply them with whatever<br/>\nmaterials and supplies they need to explore their<br/>\ninterests.  At Christmas it was an electric guitar and<br/>\na set of electric drums.<br/>\n<br/>\nThey have never asked for something that I was<br/>\nunwilling to supply before (well, except for when they<br/>\nasked for the snake...but that was years ago before I<br/>\nstarted really believing in unschooling).<br/>\n<br/>\nNow I am in a quandry.  Do I supply the 13yo boy with<br/>\nreal weapons?  I am not afraid of his going off on a<br/>\ncolumbine-type rampage, but he does have a 5yo brother<br/>\nwith a temper and who does not always respect other<br/>\npeople&#39;s property like he should.<br/>\n<br/>\n<br/>\n<br/>\n=====<br/>\n--Susan in VA<br/>\nWifetoVegman<br/>\n<br/>\nWhat is most important and valuable about the home as a base for children&#39;s growth into the world is not that it is a better school than the schools, but that it isn&#39;t a school at all.  John Holt<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free web site building tool. Try it!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://webhosting.yahoo.com/ps/sb/\">http://webhosting.yahoo.com/ps/sb/</a></div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill & Diane","from":"Bill & Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: the real question/newness (if any) is in the middle","postDate":"1075214596","msgId":18503,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMTY3OTA0LjkwNTA3MDRAdm9sLmNvbT4=","inReplyToHeader":"PDViLjQ1ZGNmZTU4LjJkNDc0YTcwQGFvbC5jb20+","referencesHeader":"PDViLjQ1ZGNmZTU4LjJkNDc0YTcwQGFvbC5jb20+"},"prevInTopic":18502,"nextInTopic":18504,"prevInTime":18502,"nextInTime":18504,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"I don t agree with this (below). I think unschooling was doable (and widely done) when the skills kids were learning were building cabins, hunting, digging","messageBody":"<div id=\"ygrps-yiv-1636146940\">I don&#39;t agree with this (below). I think unschooling was doable (and <br/>\nwidely done) when the skills kids were learning were building cabins, <br/>\nhunting, digging wells, planting, sewing, drawing water and washing, <br/>\nbuilding a cook fire, etc.<br/>\n<br/>\nWhat makes it work for the *modern world* is access to the modern world, <br/>\na world of great information and information resources, but what made it <br/>\nwork for pioneers was access to the pioneer world!<br/>\n<br/>\n:-) Diane<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;I agree, and I remind myself sometimes that the reason this is doable is that <br/>\n&gt;people do NOT have to build their own cabins by hand, hunt, dig wells, plant <br/>\n&gt;with a horse-drawn plow, make clothes from feedsacks and wash them in water <br/>\n&gt;drawn up by hand, heated over a fire or on a woodstove, and so forth and so on.<br/>\n&gt;<br/>\n&gt;What makes this work is modern life, the internet, the constant flow of <br/>\n&gt;printed word, television, newspapers everywhere, really decent magazines like <br/>\n&gt;Smithsonian and National Geographic, radios and calculators cheap to free at every <br/>\n&gt;hand.   <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075213588","msgId":18509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0YzMwMWMzZTRlMSQ4ZDYwYzYxMCQwNDAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PDE4MC4yNTE1ODIwYi4yZDQ2OWUzN0Bhb2wuY29tPiA8MDAwYTAxYzNlNDU1JDcyZjE1ZWMwJGEyMzMxOWFjQHlvdXJnZzg3dnF6b3pxPiA8MDQ4ZTAxYzNlNGRmJGNkMmM3YTcwJDA0MDBhOGMwQFRpbmtlcmJlbGw+"},"prevInTopic":18508,"nextInTopic":18514,"prevInTime":18508,"nextInTime":18510,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1719699545\">&lt;&lt;I think that&#39;s why newcomers are often surprised/shocked to hear: &quot;Your child uses workbooks?!&quot;; &quot;You don&#39;t have bedtimes?!&quot;; &quot;You let them eat what they want?!&quot;; &quot;You don&#39;t insist they come to church with you?!&quot;;  &quot;Your children don&#39;t have chores?!&quot;; &quot;What does all that have to do with unschooling?!&quot;; &quot;Where are the rules, people?!&quot;&gt;&gt;<br/>\n<br/>\nOkay ... that didn&#39;t come across very well. I&#39;ll try again:<br/>\n<br/>\nI think that&#39;s why newcomers are often surprised/shocked at what they read and reply with: &quot;Your child uses workbooks?!&quot;; &quot;You don&#39;t have bedtimes?!&quot;; &quot;You let them eat what they want?!&quot;; &quot;You don&#39;t insist they come to church with you?!&quot;;  &quot;Your children don&#39;t have chores?!&quot;; &quot;What does all that have to do with unschooling?!&quot;; &quot;Where are the rules, people?!&quot;<br/>\n<br/>\nSorry!<br/>\n<br/>\nPam L<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the real question/newness (if any) is in the middle","postDate":"1075213453","msgId":18508,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTI3LjA3MjQxMy4yMDgwLjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":18507,"nextInTopic":18509,"prevInTime":18507,"nextInTime":18509,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"***There s more life changing stuff to tell,*** Dylan was my first life changing, unschooly thing.  Everyone told me I d know my baby in the first moment, that","messageBody":"<div id=\"ygrps-yiv-1815891542\">***There&#39;s more life changing stuff to tell,***<br/>\n<br/>\nDylan was my first life changing, unschooly thing.  Everyone told me I&#39;d<br/>\nknow my baby in the first moment, that I&#39;d hold him and know him and how<br/>\nbonding and beautiful it would be.  But when he was born and we looked at<br/>\nhim here was a brand new person with his own mind, not a copy of me or<br/>\nhis dad.   That astounded me.  It seems so stupid now, but he was a<br/>\nstranger we needed to get to know and so we found ourselves asking<br/>\nquestions like &quot;what if he doesn&#39;t like that?&quot;  <br/>\n<br/>\nAnother moment was when my mother said she wished she&#39;d never hit any of<br/>\nher kids.  She said upon reflection she came to see that children respond<br/>\nto their environment and that when they&#39;re behaving in ways we don&#39;t like<br/>\nthere&#39;s always a reason, and a gentle, helpful solution, but mom&#39;s are<br/>\nsometimes too stressed or busy to notice.  <br/>\n<br/>\nWe had decided before Dylan was born that we&#39;d never spank him and that<br/>\nwe&#39;d listen to him and let him be himself.  In moments since then when<br/>\nhis dad had a hard time with the letting-him-be-himself philosophy he&#39;s<br/>\nsaid he was expecting Dylan&#39;s &quot;self&quot; to be more like his own. &lt;g&gt;  <br/>\n<br/>\nThe first time I watched Dylan push a chair to the counter and climb for<br/>\na glass I knew he was some kind of super genius!&lt;g&gt;  That was the<br/>\nbeginning of wondering what all he&#39;d learn by living.   I still had a<br/>\nhard time not believing there was some magic in teaching that could<br/>\ndeliver the world to my kid at some future date, but that took care of<br/>\nitself in the moments I was really paying attention to what Dylan was<br/>\ndoing.   What our kids show us will push out our years of schooling but<br/>\nwe have to let it.   <br/>\n<br/>\nSo we started with the beginning foundation of unschooling, and when<br/>\nDylan said he didn&#39;t want to go to school it was easy for us to listen to<br/>\nhim. <br/>\n<br/>\nPam Hartley wrote that having the opportunity to take care of our<br/>\nfamily&#39;s needs (cooking, housework) was our gift to them.  That was<br/>\nanother moment of enlightenment for me, that I had made these choices,<br/>\nhusband, home, stuff, child and that all those things made my life<br/>\nbetter.  I got rid of the things I was resenting.  I tore out the carpet<br/>\nI was having to wash too frequently because of critter accidents and was<br/>\namazed that a mess or spill wiped up quickly, no stains, no worries.  <br/>\n<br/>\nSandra changed things for my husband.  She wrote about treating our kids<br/>\nthe way we wish we&#39;d been treated.  It wasn&#39;t easy for David to admit his<br/>\nparents might have done better, he felt ungrateful and disloyal.  But<br/>\ngiving his son what he never got emotionally has been a healing thing for<br/>\nhim.  It eased a lot of personal anguish and it&#39;s given Dylan a loving,<br/>\ninvolved dad. <br/>\n<br/>\nI think there are people who can&#39;t unschool.  They are the folks who are<br/>\nunwilling to rethink everything they thought they knew.  They are afraid<br/>\nor unwilling to give up control.  And they are convinced kids aren&#39;t good<br/>\nor smart or capable until an adult makes them so.<br/>\n <br/>\nUnschooling parents need to be willing to honor their child&#39;s<br/>\nindividuality.  That&#39;s hard to do if all you want is for your kid to fit<br/>\nin and make you look good.   It&#39;s hard to do because then you have some<br/>\nethical obligation to meet that individuals needs.  That individual might<br/>\nwant or need something you wouldn&#39;t have chosen for him.  <br/>\n<br/>\nI can&#39;t count how many times I&#39;ve heard &quot;I unschool, I don&#39;t un parent!&quot; <br/>\nwhen the conversation has turned from kids having control of their<br/>\nlearning to kids having control of their lives.  A parent&#39;s comfort with<br/>\nand ability to see life and learning as the same thing is essential to<br/>\nunschooling.  <br/>\n<br/>\nAnd hiding in there, in that unwillingness to give kids control, is the<br/>\nfear that children allowed their individuality will walk all over their<br/>\nparents.  There&#39;s big, weird psychology in the idea that our own little<br/>\nchildren will grind us into dirt given half a chance.  People who won&#39;t<br/>\nthink about that won&#39;t be able to unschool. <br/>\n<br/>\nDeb</div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075212836","msgId":18507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0OGUwMWMzZTRkZiRjZDJjN2E3MCQwNDAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PDE4MC4yNTE1ODIwYi4yZDQ2OWUzN0Bhb2wuY29tPiA8MDAwYTAxYzNlNDU1JDcyZjE1ZWMwJGEyMzMxOWFjQHlvdXJnZzg3dnF6b3pxPg=="},"prevInTopic":18506,"nextInTopic":18508,"prevInTime":18506,"nextInTime":18508,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-29117547\">&lt;&lt;This type of questioning could be applied to all sorts of topics,  we&#39;ve all<br/>\nseen them,  from chores to going to church.   Doesn&#39;t it just permeate into<br/>\nall parts of our lives if we practice respectful parenting?   With my family<br/>\nwe first started homeschooling in an eclectic type style,  then went to<br/>\nunschooling,  then the unschooling went into practically every crevice of<br/>\nour lives.   It was the whole snowball effect. :)&gt;&gt;<br/>\n<br/>\nI equate this snowball effect with the shift from rules to principles.  I think sometimes (maybe pretty often?) schoolers/homeschoolers get to the concept that kids/people learn best when they are interested in something and that initially brings them to unschooling.  As beginning unschoolers they are looking for &quot;rules&quot; or at least definitive guidelines &lt;g&gt;, to make unschooling successful for them.  Akin to the &quot;rules&quot; of school or school-at-home.  They want to trade out the rules that aren&#39;t working for them for a set they believe will work better.  They probably have an idea in their head what unschooling rules &quot;should&quot; look like but they often still have a schoolish model in their heads about what learning looks like.<br/>\n<br/>\nI think that&#39;s why newcomers are often surprised/shocked to hear: &quot;Your child uses workbooks?!&quot;; &quot;You don&#39;t have bedtimes?!&quot;; &quot;You let them eat what they want?!&quot;; &quot;You don&#39;t insist they come to church with you?!&quot;;  &quot;Your children don&#39;t have chores?!&quot;; &quot;What does all that have to do with unschooling?!&quot;; &quot;Where are the rules, people?!&quot;<br/>\n<br/>\nIf someone can&#39;t get past the point of looking for the best set of unschooling &quot;rules&quot; that will finally get their kid learn &quot;schoolishly&quot; (and happily of course), and start understanding and applying the underlying principles, I think they will have a hard time unschooling successfully.  And even better, pushing on through to the realization that these principles apply to life in general, not just &quot;academics&quot; - the snowball effect.<br/>\n<br/>\nPam L<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: the real question/newness (if any) is in the middle","postDate":"1075212263","msgId":18506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlLjQ1YTQyYmEyLjJkNDdjOWU3QGFvbC5jb20+"},"prevInTopic":18504,"nextInTopic":18507,"prevInTime":18505,"nextInTime":18507,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/27/04 6:42:53 AM, cen46624@vol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1307549331\">In a message dated 1/27/04 6:42:53 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cen46624@...\">cen46624@...</a> writes:<br/>\n<br/>\n&lt;&lt; I don&#39;t agree with this (below). I think unschooling was doable (and <br/>\nwidely done) when the skills kids were learning were building cabins, <br/>\nhunting, digging wells, planting, sewing, drawing water and washing, <br/>\nbuilding a cook fire, etc. <br/>\n<br/>\n&lt;&lt;What makes it work for the *modern world* is access to the modern world, <br/>\na world of great information and information resources, but what made it <br/>\nwork for pioneers was access to the pioneer world!&gt;&gt;<br/>\n<br/>\nTo an extent I agree.  But we are in the modern world, so that model matters. <br/>\n In 1960, skills and information needed in the modern world were NOT at most <br/>\npeople&#39;s houses.  They were at few to no houses of average people.  Nobody had <br/>\na home computer.  There weren&#39;t even cheap dictionaries yet.  Home <br/>\ndictionaries were big two-volume expensive things.  (I have a very small collection of <br/>\nthem.)   Some families bought encyclopedias, already outdate by the time they <br/>\narrived.<br/>\n<br/>\nIn the 19th century, people wanted and needed schools because books (in the <br/>\nwestern U.S. particularly, where people had travelled by covered wagon and <br/>\ndidn&#39;t have a trailer full of books) were rare and somewhat suspect.   Where books <br/>\ncould arrive by ship and later by train, there were more books. There were <br/>\nnewspapers, but they weren&#39;t built to last and they didn&#39;t have illustrations <br/>\nand maps and charts.  They had text only (and a few lame little repeated <br/>\nillustrations that could be set in at the printship).   Without books, reading <br/>\ndoesn&#39;t get you very far.  Bibles and hymnals.<br/>\n<br/>\nIf somone wanted to learn geography or anatomy or chemistry, they just had to <br/>\nleave home even to get to charts and models.  That&#39;s not true anymore.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: the real question/newness (if any) is in the middle","postDate":"1075211611","msgId":18504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4NC4yNTJmYjFiNS4yZDQ3Yzc1YkBhb2wuY29tPg=="},"prevInTopic":18503,"nextInTopic":18506,"prevInTime":18503,"nextInTime":18505,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/04 11:35:36 PM, loueliandguy@ntlworld.com writes: ","messageBody":"<div id=\"ygrps-yiv-1438694248\">In a message dated 1/26/04 11:35:36 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:loueliandguy@...\">loueliandguy@...</a> writes:<br/>\n<br/>\n&lt;&lt; I am new to unschooling and I think I could heartily agree that <br/>\n<br/>\nthere must be higher levels of unschooling understanding, it surely <br/>\n<br/>\nis called experience?!! &gt;&gt;<br/>\n<br/>\nIt&#39;s more, though.  Someone could stay at the same level of awareness and <br/>\npractice for years.    Experience without examination and analysis and the desire <br/>\nto tweak it toward improvement isn&#39;t necessarily growth.<br/>\n<br/>\n&lt;&lt;You know one thing we always said at school (when I was full time <br/>\n<br/>\nteaching) was that childrens research skills are poor. Research <br/>\n<br/>\nskills are the key to learning and knowledge is the lock!<br/>\n<br/>\nYou&#39;re the lock people!!!&gt;&gt;<br/>\n<br/>\nNone of it needs to be locked up.  Nobody needs a key.  They just need to <br/>\nlearn to be accepting and happy and to live away from people and places that will <br/>\nsquelch their openness and curiosity and joy.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075183273","msgId":18496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3ZC4yNWQyYzA1MC4yZDQ3NThhOUBhb2wuY29tPg=="},"prevInTopic":18494,"nextInTopic":18498,"prevInTime":18495,"nextInTime":18497,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/04 8:19:20 PM, SandraDodd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1040518392\">In a message dated 1/26/04 8:19:20 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n&lt;&lt; There&#39;s more life changing stuff to tell, but I&#39;m going to watch TV with <br/>\nKeith for an hour.  Everwood, his soap opera.<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>AND...<br/>\n<br/>\nThe thing about chores.  I sure didn&#39;t think that up, but I&#39;m glad someone <br/>\ndid and I&#39;m glad we incorporated it into our other wild living, because it has <br/>\nmade things way more happy here.  Maybe not cleaner, but more peaceful, more <br/>\ncozy, more loving, more cooperative, more all kinds of good things.  Except <br/>\ncleaner. &lt;g&gt;  But it&#39;s not much messier either.  And when I&#39;m cleaning I feel <br/>\nhappy instead of pissy.<br/>\n<br/>\nHappy instead of pissy cannot be bought, and there are no pills for it, but <br/>\nyou can get it by just changing a few thoughts and terms.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: the real question/newness (if any) is in the middle","postDate":"1075182757","msgId":18494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4LjRmZjhjYmI4LjJkNDc1NmE1QGFvbC5jb20+"},"prevInTopic":18493,"nextInTopic":18496,"prevInTime":18493,"nextInTime":18495,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/04 10:14:22 PM, SandraDodd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-2144454485\">In a message dated 1/26/04 10:14:22 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n&lt;&lt; I still remember the first several times I really wanted to do something <br/>\ncool, show Kirby how to do something, get him interested in some new kit or <br/>\nscience toy or whatever, and he had no interest whatsoever. &gt;&gt;<br/>\n<br/>\nclarification:  often he was interested, but when we were really unschooling <br/>\nand sometimes he wasn&#39;t interested in my (overly)exciteable enthusiasm to show <br/>\nhim something, it used to hurt my feelings at first.  Now it doesn&#39;t.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"&quot;Pam Hartley&quot; &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: the real question/newness (if any) is in\t the middle","postDate":"1075182553","msgId":18493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTI3MDU0OC5pMFI1bU9DTjAwMDUyNEBtdGF3Ni5wcm9kaWd5Lm5ldD4="},"prevInTopic":18491,"nextInTopic":18494,"prevInTime":18492,"nextInTime":18494,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"... I d like to thank the Academy...  That baby turned 9 in November, and is taller than one of her aunts, and though she didn t walk until she was","messageBody":"<div id=\"ygrps-yiv-2088898222\"><blockquote><span title=\"ireply\">&gt; Oh, Pam Hartley used to wax dramatically poetic when her now-oldest was an<br/>\n&gt; only and a baby,<br/>\n<br/>\n </span></blockquote>&quot;I&#39;d like to thank the Academy...&quot; &lt;g&gt;<br/>\n<br/>\nThat baby turned 9 in November, and is taller than one of her aunts, and<br/>\nthough she didn&#39;t walk until she was almost-2 and Sandra put up with a long<br/>\nfreaked-out IM from me on AOL about how her baby pediatrician ((not only was<br/>\nshe a baby, the doc was a baby, just out of med school)) wanted to consider<br/>\nleg braces) she now runs and climbs and collects arms and armor (the better<br/>\nto pretend to be Link from Legend of Zelda) just fine. I don&#39;t think a day<br/>\nhas gone by when I haven&#39;t been happily amazed by something she (and now her<br/>\nsister) has done or said or known or opined.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and we rolled our eyes but by god we took notes sometimes,<br/>\n&gt; because she was pretty clear thinking and sharp writing!  And look at her now.<br/>\n&gt; All courage and confidence and experience, because (it seems) she never<br/>\n&gt; faltered and never doubted.<br/>\n<br/>\n </span></blockquote>It&#39;s easy to be the courageous rookie when you&#39;re surrounded by the<br/>\nSuperbowl Winning Unschooling Team, as AOL&#39;s homeschooling forum was in<br/>\nthose days.<br/>\n<br/>\nAnd sometimes Brit and Mikey roll their eyes at me &lt;g&gt;, so things have a way<br/>\nof circling back around again...<br/>\n<br/>\nPam</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"&quot;Pam Hartley&quot; &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the\t middle","postDate":"1075181762","msgId":18491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTI3MDUzNS5pMFI1WkRDTjAxMzM1NUBtdGF3Ni5wcm9kaWd5Lm5ldD4="},"prevInTopic":18488,"nextInTopic":18493,"prevInTime":18490,"nextInTime":18492,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"Happiness good. ;) Pam ... middle","messageBody":"<div id=\"ygrps-yiv-931056403\">&quot;Happiness good.&quot; ;)<br/>\n<br/>\nPam<br/>\n<br/>\n----------<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n&gt;Subject: Re: [AlwaysLearning] the real question/newness (if any) is in the<br/>\n </span></blockquote>middle<br/>\n<blockquote><span title=\"qreply\"> &gt;Date: Mon, Jan 26, 2004, 6:30 PM<br/>\n&gt;<br/>\n<br/>\n&gt; &lt;&lt; Things like, &quot;unschooling works in a house full of people who love each<br/>\n&gt; other and are willing to go out of their way to help each other to be happy<br/>\n&gt; and peaceful. It does not work in a house full of people who resent each<br/>\n&gt; other for real or imagined flaws and failings.&quot; &gt;&gt;<br/>\n&gt;<br/>\n&gt; I&#39;ve been stating it in Tarzan/Frankenstein terms:  &quot;Cynicism bad.&quot; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: the real question/newness (if any) is in the middle","postDate":"1075180098","msgId":18488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxLjM5NTM2OTM5LjJkNDc0YzQyQGFvbC5jb20+"},"prevInTopic":18487,"nextInTopic":18491,"prevInTime":18487,"nextInTime":18489,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/04 9:09:38 PM, mozafamily@yahoo.com writes:  I still","messageBody":"<div id=\"ygrps-yiv-886319214\">In a message dated 1/26/04 9:09:38 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mozafamily@...\">mozafamily@...</a> writes:<br/>\n<br/>\n&lt;&lt; but that you <br/>\n<br/>\nbest have some tough skin and some kind of activity or hobby  &gt;&gt;<br/>\n<br/>\nI still remember the first several times I really wanted to do something <br/>\ncool, show Kirby how to do something, get him interested in some new kit or <br/>\nscience toy or whatever, and he had no interest whatsoever.  He was wanly polite.   <br/>\nI was left standing there with a sparkly 20 minute &quot;lesson&quot; (song &#39;n&#39; dance) <br/>\nin my head, and no audience!   <br/>\n<br/>\nI got used to it.  It took Keith longer.  He used to mutter and grump about <br/>\nit, about how they obviously didn&#39;t care about anything he thought was <br/>\nimportant, or that he wasn&#39;t going to be very involved in their learning since they <br/>\ndidn&#39;t seem very interested in hearing him, etc.<br/>\n<br/>\nWe both got over it.  And &quot;it&quot; was our school conditioning saying that if the <br/>\nkid ASKS something, then he&#39;s invited instruction.   Sometimes they just want <br/>\na one-word answer to a three-word question and that&#39;s all they need!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: the real question/newness (if any) is in the middle","postDate":"1075179632","msgId":18487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDViLjQ1ZGNmZTU4LjJkNDc0YTcwQGFvbC5jb20+"},"prevInTopic":18482,"nextInTopic":18488,"prevInTime":18486,"nextInTime":18488,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/04 7:37:00 PM, berryhead@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1077837782\">In a message dated 1/26/04 7:37:00 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:berryhead@...\">berryhead@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\n<br/>\nIt&#39;s tempting to say that unschooling is only for certain types of people <br/>\nbecause then <br/>\n<br/>\nwe can be the rebels, the mavericks who are blazing a bitchin&#39; new trail. &gt;&gt;<br/>\n<br/>\nI think travelling from Missouri to Oregon was only for certain types of <br/>\npeople in 1830 or whenever they were doing that movie-photogenic thang.   Me, I <br/>\nstay where I am.  I&#39;m really familiar knowing how to read local clouds, knowing <br/>\nthe local food, being able to visit places I played as a kid, and know where <br/>\nlots of my friends are because if they&#39;re gone I know where their moms or <br/>\nbrothers are.  I personally can&#39;t imagine moving a thousand miles away in the days <br/>\nbefore telephones or even decent postal service.  Not me.<br/>\n<br/>\nYet all my grandparents did.  People didn&#39;t move to Texas or New Mexico by <br/>\ntrain, when my great and great-greats or however far back came to Texas and New <br/>\nMexico.   They were leaving the country, in most cases.  <br/>\n<br/>\nNot even everyone would have been physically able, or morally able, or find a <br/>\nmarriage partner who was into it, strong enough, creative enough, flexible <br/>\nenough, crazy enough, able to build a cabin and plant when they got there, able <br/>\nto hunt, and so for and so on.<br/>\n<br/>\nIt wasn&#39;t one skill or personality trait they needed.<br/>\n<br/>\nYet once a bunch of them got there it was easier for others to come.<br/>\n<br/>\nThat might happen with unschooling too, to some extent.<br/>\n<br/>\nNow when people go to Oregon they&#39;re going TO civilization.<br/>\n<br/>\nI don&#39;t know if that applies, but some of it will apply in some people&#39;s <br/>\nworld-models and analogy-jumbles, maybe.<br/>\n<br/>\n&lt;&lt;It&#39;s scary to most people to imagine a world with no schools. Would society <br/>\nfall apart? Or would it be better? &gt;&gt;<br/>\n<br/>\nEurope was still full of people when big batches of them started going to the <br/>\nAmericas.<br/>\nThe east cost was still full when the Appalachians and the Midwest started <br/>\nbeing populated, and so forth.  <br/>\n<br/>\nSchools will never disappear.<br/>\n<br/>\n&lt;&lt;I think that most people who unschool are giving their children an amazing <br/>\ngift: the <br/>\n<br/>\ngift of being able to be a child. There is no rush. All that needs to be <br/>\nlearned will be <br/>\n<br/>\nlearned, each thing in it&#39;s own time, in a natural way. There is also plenty <br/>\nof time for <br/>\n<br/>\nlearning what the real world is like,&gt;&gt;<br/>\n<br/>\nI agree, and I remind myself sometimes that the reason this is doable is that <br/>\npeople do NOT have to build their own cabins by hand, hunt, dig wells, plant <br/>\nwith a horse-drawn plow, make clothes from feedsacks and wash them in water <br/>\ndrawn up by hand, heated over a fire or on a woodstove, and so forth and so on.<br/>\n<br/>\nWhat makes this work is modern life, the internet, the constant flow of <br/>\nprinted word, television, newspapers everywhere, really decent magazines like <br/>\nSmithsonian and National Geographic, radios and calculators cheap to free at every <br/>\nhand.   <br/>\n<br/>\n&lt;&lt;Please all of you keep in <br/>\n<br/>\nmind that everything I wrote above is just my opinion. My dd is only 8 months <br/>\nold so I <br/>\n<br/>\ncan&#39;t say conclusively, &quot;unschooling worked for me.&quot; However I promise to <br/>\nkeep you <br/>\n<br/>\nall posted on whether I was right or not!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>Oh, Pam Hartley used to wax dramatically poetic when her now-oldest was an <br/>\nonly and a baby, and we rolled our eyes but by god we took notes sometimes, <br/>\nbecause she was pretty clear thinking and sharp writing!  And look at her now.   <br/>\nAll courage and confidence and experience, because (it seems) she never <br/>\nfaltered and never doubted.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":99936689,"authorName":"mozafamily","from":"&quot;mozafamily&quot; &lt;mozafamily@...&gt;","profile":"mozafamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the real question/newness (if any) is in the middle","postDate":"1075176395","msgId":18482,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ2NG80YitlNGZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg4LjIwMzJkZWYuMmQ0NzJkZWVAYW9sLmNvbT4="},"prevInTopic":18480,"nextInTopic":18487,"prevInTime":18481,"nextInTime":18483,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"Hello - I would consider myself new to unschooling although I am learning as fast as I am able about it. Because I dream big I would like to think that","messageBody":"<div id=\"ygrps-yiv-303374059\">Hello - I would consider myself new to unschooling although I am <br/>\nlearning as fast as I am able about it. Because I dream big I would <br/>\nlike to think that unschooling can be a reality for everyone <br/>\nespecially if more unschooling communities develop instead of <br/>\nschools to cover where home unschooling is impractical. But you all <br/>\nhave probably figured that out about me already :) so what I would <br/>\nlike to add to this discussion is that unschooling will be much <br/>\neasier to talk with people about when there is even more written and <br/>\ndiscussed on the subject, the more people are &quot;subjected&quot; <br/>\nor &quot;exposed&quot; to new ideas the more the ideas become real or probable <br/>\nto them. Just as homeschooling is a bit easier today that it was 20 <br/>\nyears ago because more people are doing it and more has been written <br/>\nand &quot;media&quot; -ed about it so we could hopefully conclude that the <br/>\nmore people know about unschooling then the more people will be <br/>\nwilling to accept it.<br/>\nI am so definately new to unschooling because as I read one of the <br/>\nearlier posts on this topic it poped out at me why the &quot;newbies&quot; to <br/>\nunschooling say something like &quot;their child stopped watching TV <br/>\ntoday and actually spent some time reading&quot; meaning that perhaps <br/>\nthey thought the only activity of value to their child for the day <br/>\nwas the reading, that they didn&#39;t place the same value on TV viewing <br/>\nas they did reading. I think unschoolers believe that ANY activity <br/>\nthe child wishes to do of their own occord should have value - that <br/>\nmore value shouldn&#39;t be placed on one activity than another. <br/>\nSo that is where I am - my ds is doing activities that matter to him <br/>\nand he is definately developing even more of his sturdiness as I <br/>\nlike to call it. OK not that &quot;Mom - I&#39;m busy&quot; or when I&#39;m explaining <br/>\nsomething he ask about that he usually abruptly stops me the second <br/>\nhe &quot;gets it&quot; and usually stops me mid-sentence with a &quot;Stop - I <br/>\nunderstand&quot; or &quot;Yeah, I know&quot; or the RARE &quot;OK - Thanks&quot; then walks <br/>\nimmediately off, LOL! So what I have learned so far from this <br/>\nbeginning &quot;level&quot; is that being an unschooling student&#39;s mom is not <br/>\nall happy and hugs (although we have those times also) but that you <br/>\nbest have some tough skin and somekind of activity or hobby to keep <br/>\nyourself busy when your children don&#39;t need your attentions, because <br/>\nit&#39;s not as if you have to entertain or be &quot;teacher&quot; to your child <br/>\nas much as perhaps just be there for them when they need you. Am I <br/>\nstill following what most of you consider to be unschooling?</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075172334","msgId":18480,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4LjIwMzJkZWYuMmQ0NzJkZWVAYW9sLmNvbT4="},"prevInTopic":18478,"nextInTopic":18482,"prevInTime":18479,"nextInTime":18481,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/04 4:25:58 PM, barb@netcetera.com writes: ","messageBody":"<div id=\"ygrps-yiv-2025500990\">In a message dated 1/26/04 4:25:58 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a> writes:<br/>\n<br/>\n&lt;&lt; But, if I<br/>\nam open w/o expectation I might actually come up with something that might<br/>\neven be helpful to Sandra - who has been at it for a long time.  (Well, a<br/>\ngirl can dream!!) &gt;&gt;<br/>\n<br/>\nEven though I had been seriously planning to be a teacher from the time I was <br/>\nsix and I paid a lot of attention to it, it was *SO* school-focussed, that to <br/>\nme until I was nearly 30, school was (for me) the real world.  It took me <br/>\nquite a while to really appreciate that there were people who had never gone to <br/>\ncollege who didn&#39;t feel like they lost out on &quot;real life,&quot; who didn&#39;t WANT to <br/>\ngo, who had really honestly chosen not to go to college.  <br/>\n<br/>\nThen it took me a while to really appreciate that someone could be an expert <br/>\nBIGtime in something without &quot;studying&quot; it with a teacher, but just doing, and <br/>\nreading, and experimenting, and going to museums, and talking to others who <br/>\nwere doing, reading and experimenting.    That knowledge came from my time in <br/>\nthe SCA, getting to know armorers and costumers and calligraphers who started <br/>\nknowing ZIP before they started doing that, and some have gotten so good they <br/>\ndo contract work from time to time for living history museums, projects like <br/>\nThe Mary Rose (ship restoration),  movies, restoration of real antiques (museum <br/>\nstuff), and not beause they have degrees in anything, but because they are <br/>\ncompetent and honest and real.<br/>\n<br/>\nI learned on AOL from advice given by another unschooling mom that it&#39;s bad <br/>\nto condemn a whole day by saying &quot;having a bad day,&quot; so she only ever said <br/>\n&quot;having a bad moment,&quot; so the next moment could be better!   That changed my life.<br/>\n<br/>\nThere&#39;s more life changing stuff to tell, but I&#39;m going to watch TV with <br/>\nKeith for an hour.  Everwood, his soap opera.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075171238","msgId":18478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzOS4yYTY5NDc0My4yZDQ3MjlhNkBhb2wuY29tPg=="},"prevInTopic":18476,"nextInTopic":18480,"prevInTime":18477,"nextInTime":18479,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/04 6:48:26 PM, barb@netcetera.com writes: ","messageBody":"<div id=\"ygrps-yiv-672170551\">In a message dated 1/26/04 6:48:26 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a> writes:<br/>\n<br/>\n&lt;&lt; ahhh, but I know I&#39;ve been in situations where I &quot;think&quot; I&#39;m being loving<br/>\nand going out of my way to help my dd when I end up catching myself<br/>\nteaching her.   &gt;&gt;<br/>\n<br/>\nBut was that for her immediate peace and happiness?  Or her potential <br/>\ntheoretical future peace and happiness?  Maybe the proposed ideal unschooling <br/>\nsituation needs to be -=-Things like, &quot;unschooling works in a house full of people <br/>\nwho love each other and are willing to go out of their way to help each other to <br/>\nbe happy and peaceful **now, not when they&#39;re grown.**  (Or something suaver.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075170655","msgId":18476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYS4xOTMxZmQzMy4yZDQ3Mjc1ZkBhb2wuY29tPg=="},"prevInTopic":18475,"nextInTopic":18478,"prevInTime":18475,"nextInTime":18477,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/26/04 5:11:04 PM, pamhartley@mindspring.com writes: ","messageBody":"<div id=\"ygrps-yiv-1348087704\">In a message dated 1/26/04 5:11:04 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamhartley@...\">pamhartley@...</a> writes:<br/>\n<br/>\n&lt;&lt; Things like, &quot;unschooling works in a house full of people who love each<br/>\nother and are willing to go out of their way to help each other to be happy<br/>\nand peaceful. It does not work in a house full of people who resent each<br/>\nother for real or imagined flaws and failings.&quot; &gt;&gt;<br/>\n<br/>\nI&#39;ve been stating it in Tarzan/Frankenstein terms:  &quot;Cynicism bad.&quot;<br/>\nKinda related.  I&#39;ll save yours for future distribution, pre-test and final <br/>\nexam.<br/>\n<br/>\n<br/>\nSandra<br/>\nJoking, really. <br/>\nHonest.</div>","specialLinks":[]},{"userId":157270430,"authorName":"Barbara Chase","from":"Barbara Chase &lt;barb@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Re: the real question/newness (if any) is in the middle","postDate":"1075166355","msgId":18475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjAxMDIwOWJjM2I2ZDEwMTA0NEBbMjA0LjE4OS4xMS40MV0+"},"prevInTopic":18474,"nextInTopic":18476,"prevInTime":18474,"nextInTime":18476,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"... This phrase really caught my eye... About 3 years before our dd was born my dh and I both chose to leave big city paying jobs to live rurally, and to live","messageBody":"<div id=\"ygrps-yiv-1655950705\"><blockquote><span title=\"ireply\">&gt;deferring her happiness until retirement.<br/>\n<br/>\n<br/>\n </span></blockquote>This phrase really caught my eye... About 3 years before our dd was born my<br/>\ndh and I both chose to leave big city paying jobs to live rurally, and to<br/>\nlive more in the moment.  The money afforded us time to travel, to get away<br/>\nfrom our lives, to save for the &quot;some day when we retire&quot; cycle, but we<br/>\nwanted to be living our lives now!  It hasn&#39;t been easy, but perhaps this<br/>\nwas the first step to our attraction to unschooling.  Interesting.....<br/>\n<br/>\n--bc--<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157270430,"authorName":"Barbara Chase","from":"Barbara Chase &lt;barb@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the \t middle","postDate":"1075166341","msgId":18474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjAxMDIwOGJjM2I2ZDAyMGNmM0BbMjA0LjE4OS4xMS40MV0+"},"prevInTopic":18472,"nextInTopic":18475,"prevInTime":18473,"nextInTime":18475,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"... ahhh, but I know I ve been in situations where I think I m being loving and going out of my way to help my dd when I end up catching myself teaching her.","messageBody":"<div id=\"ygrps-yiv-729657903\"><blockquote><span title=\"ireply\">&gt;Things like, &quot;unschooling works in a house full of people who love each<br/>\n&gt;other and are willing to go out of their way to help each other to be happy<br/>\n&gt;and peaceful. It does not work in a house full of people who resent each<br/>\n&gt;other for real or imagined flaws and failings.&quot;<br/>\n<br/>\n </span></blockquote>ahhh, but I know I&#39;ve been in situations where I &quot;think&quot; I&#39;m being loving<br/>\nand going out of my way to help my dd when I end up catching myself<br/>\nteaching her.  I know because she just sort of gets this blank look... like<br/>\nwhat planet did you all of a sudden come from?  So whereas I agree with<br/>\nyou, if you are saying this to someone who doesn&#39;t know about unschooling<br/>\nor to a newbie it is likely to go right over their head.<br/>\n<br/>\n--bc--<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":107749866,"authorName":"veejie72","from":"&quot;veejie72&quot; &lt;berryhead@...&gt;","profile":"veejie72","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the real question/newness (if any) is in the middle","postDate":"1075164735","msgId":18472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ2NGNuditqbWE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwMTI2MjMxMS5pMFFOQlF1ODAwODE0NEBtdGE0LnJjc250eC5zd2JlbGwubmV0Pg=="},"prevInTopic":18470,"nextInTopic":18474,"prevInTime":18471,"nextInTime":18473,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"... I think this is fascinating! It s a discussion that operates on several levels. On the one hand you could easily say, Oh, unschooling isn t for everyone,","messageBody":"<div id=\"ygrps-yiv-332005481\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Pam Hartley&quot; &lt;pamhartley@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think it&#39;s safe and interesting to discuss, and look forward to reading <br/>\n&gt; other responses on the meat of what you wrote.<br/>\n&gt; <br/>\n&gt; But, doing my Border Collie look-at-the-whole-field-at-once thing &lt;g&gt;, I<br/>\n&gt; wonder what we can do with it we&#39;ve got it, other than to caveat, &quot;Look,<br/>\n&gt; unschooling doesn&#39;t work for all parents, even though it works for all kids<br/>\n&gt; given the right family situation&quot; (and yes, I do believe that, but would<br/>\n&gt; welcome debate on it as well).<br/>\n&gt; <br/>\n&gt; I might think and might mostly be right (or not, haven&#39;t really tried to<br/>\n&gt; &quot;follow up&quot; on my guesses on this one) that I can i.d. the<br/>\n&gt; unschooling-wannabes who will &quot;get it&quot; at some point or another versus those<br/>\n&gt; who won&#39;t, but what do I do with that? Tell them? That would probably not go<br/>\n&gt; over well.<br/>\n&gt; <br/>\n </span></blockquote>I think this is fascinating! It&#39;s a discussion that operates on several levels. On the one <br/>\nhand you could easily say, &quot;Oh, unschooling isn&#39;t for everyone,&quot; and on some level <br/>\nyou&#39;d be right. But I think that -- in theory -- unschooling could work for anyone/<br/>\neveryone, but only if they really throw themselves into the mindset wholeheartedly <br/>\nand give it a real chance to take root. <br/>\n<br/>\nIt&#39;s tempting to say that unschooling is only for certain types of people because then <br/>\nwe can be the rebels, the mavericks who are blazing a bitchin&#39; new trail. It&#39;s scary to <br/>\nmost people to imagine a world with no schools. Would society fall apart? Or would it <br/>\nbe better? <br/>\n<br/>\nIt&#39;s easy for some family to say, &quot;We tried it and it didn&#39;t work.&quot; What does &quot;tried&quot; <br/>\nmean? That you took your kids out of school for three months and when they weren&#39;t <br/>\nwinning spelling bees or solving quadratic equations but rather were watching TV, <br/>\nplaying video games or surfing the web you decided the experiment was a failure?<br/>\n<br/>\nWhat does &quot;work&quot; mean? (Not to get too Clinton-ish with defining simple words, lol.) <br/>\nFor one family it might mean the difference between discord and harmony, the <br/>\ndifference between having an antagonistic mistrustful relationship with kids you <br/>\nhardly ever see and having a close relationship with kids you are really proud of. That <br/>\ncould be considered &quot;working&quot; in some families. <br/>\n<br/>\nIn other families it&#39;s not working unless the child is performing light years ahead of <br/>\ngrade level, or demonstrating a clear trajectory that will land them in a certain field, <br/>\nbe it medicine, law, aeronautics, etc. <br/>\n<br/>\nFor me, there are no people in the world I would rather spend time with than my <br/>\nhusband and daughter. The thought of saying goodbye to her for 13 years except for <br/>\na few hurried stressful moments in the morning and a few moments (probably spent <br/>\nnagging about homework) in the evening is repugnant to me. <br/>\n<br/>\nI think back on what I learned in school and even though I&#39;m only 31, I don&#39;t <br/>\nremember much that was good or useful. I can&#39;t add or subtract easily in my head, <br/>\nand forget about higher math. I couldn&#39;t tell you squat about history besides what I&#39;ve <br/>\nread as an adult. I don&#39;t remember diddly about the periodic table or any of the laws <br/>\nof physics that were drilled into my head. I only remember what interested me: books <br/>\nand authors, grammar, poetry, art, music, biology. And I went to a private school! <br/>\nImagine the amazing unschooling experiences I could have had for $15K per year for <br/>\n13 years! <br/>\n<br/>\nWhat I DO I remember is countless moments of frustration and humiliation, at the <br/>\nhands of my teachers and especially my peers. Why on earth would I subject my <br/>\ndaughter to that? It would probably be worse for her, since I can&#39;t afford to send her <br/>\nto private school. Plus she is spirited and sensitive and stubborn, three things that <br/>\nwon&#39;t help her in the school environment. I was already so thoroughly &quot;broken&quot; by my <br/>\ndistastrous home environment that I hadn&#39;t any spark left to rock the boat at all, so I <br/>\njust went with the program meekly. I can&#39;t see dd being that resigned and self-<br/>\nnegating. I certainly don&#39;t plan to break my daughter&#39;s spirit, and I&#39;m not about to <br/>\nstand by and let it happen in a school. <br/>\n<br/>\nI don&#39;t care what she decides to do with her life. It&#39;s her life. All I want for her is to <br/>\nenjoy her childhood, something many children don&#39;t get to do. When she is older, I <br/>\nwant her to be able to pursue what she is interested in, whatever that may turn out to <br/>\nbe. I won&#39;t judge. And when she is an adult, I don&#39;t want her to be suddenly thrust out <br/>\ninto the world with no idea of how it really works, or to be trapped in a McJob, <br/>\ndeferring her happiness until retirement. <br/>\n<br/>\nI think that most people who unschool are giving their children an amazing gift: the <br/>\ngift of being able to be a child. There is no rush. All that needs to be learned will be <br/>\nlearned, each thing in it&#39;s own time, in a natural way. There is also plenty of time for <br/>\nlearning what the real world is like, how to navigate the world safely, how to handle <br/>\nmoney, how to deal with different types of people and situations. <br/>\n<br/>\nI think that parents who unschool are also showing their children, &quot;You are worth it,&quot; <br/>\nby choosing (for example) to be a single income family and doing without certain <br/>\nthings to make unschooling possible, by choosing to be with them day in and day out, <br/>\nby strewing their paths with interesting experiences and listening to them whenever <br/>\nthey want to talk, whatever they want to say, without judging or belittling. If children <br/>\nare raised to feel they deserve a good, fulfilling life, they are not going to be content <br/>\nin a McJob. They most likely will not get trapped in a toxic relationship, romatic or <br/>\nplatonic. <br/>\n<br/>\nIn my opinion it is 99% guaranteed to work if you really pratice true unschooling. But <br/>\nto bring up Yoda again, you can&#39;t just &quot;try&quot; you have to &quot;do.&quot; Please all of you keep in <br/>\nmind that everything I wrote above is just my opinion. My dd is only 8 months old so I <br/>\ncan&#39;t say conclusively, &quot;unschooling worked for me.&quot; However I promise to keep you <br/>\nall posted on whether I was right or not!<br/>\n<br/>\n-Vijay</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075162705","msgId":18470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTI2LjE2MTgyNS4xNTQwLjAuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":18469,"nextInTopic":18472,"prevInTime":18469,"nextInTime":18471,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"On Mon, 26 Jan 2004 15:06:03 -0800 Pam Hartley ... I Hey, I never thought of it that way, but my border collie sure does do that. Today I let the dogs out to","messageBody":"<div id=\"ygrps-yiv-414342422\">On Mon, 26 Jan 2004 15:06:03 -0800 &quot;Pam Hartley&quot;<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamhartley@...\">pamhartley@...</a>&gt; writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; But, doing my Border Collie look-at-the-whole-field-at-once thing  &lt;g&gt;,<br/>\n </span></blockquote>I<br/>\n<br/>\nHey, I never thought of it that way, but my border collie sure does do<br/>\nthat. Today I let the dogs out to play and then went to call them in and<br/>\nthey didn&#39;t come... finally Nana (the border collie) came running up,<br/>\nlicked my hand, then ran 20 feet or so back the way she had come and<br/>\nlooked back like she wanted me to follow. So I did, and she led me to our<br/>\nold lab, who had gotten himself stuck in the branches of a small<br/>\nfallen-down tree. When I got there and called him he came out... he had a<br/>\nbad arthritis attack a few days ago and has been on something<br/>\nprescription for it, and I wonder if it&#39;s affectng his mental state<br/>\nbecause he seems more confused... but anyway, Nana did the Lassie thing<br/>\nsuperbly - &quot;Come quick, Keithie&#39;s fallen into a well!&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; wonder what we can do with it we&#39;ve got it, other than to caveat, <br/>\n </span></blockquote>&quot;Look,<br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling doesn&#39;t work for all parents, even though it works for all<br/>\n </span></blockquote>kids<br/>\n<blockquote><span title=\"ireply\"> &gt; given the right family situation&quot; (and yes, I do believe that, but <br/>\n </span></blockquote>would<br/>\n<blockquote><span title=\"ireply\"> &gt; welcome debate on it as well).<br/>\n<br/>\n </span></blockquote>I think that&#39;s true, and I&#39;ve said it, and gotten half of a large mailing<br/>\nlist up in arms...<br/>\n<br/>\nI tend to talk about unschooling working best (or at all) when parents<br/>\nhave certain values. If you value knowing that your child&#39;s academic<br/>\nskills are as good as or better than other kid his age, you&#39;ll have a<br/>\nhard time with unschooling. Ditto if you value having a child who will<br/>\nfollow rules without questioning, or will chose a &quot;balanced&quot; variety of<br/>\nactivities, of a child who has an all-consuming passion. These things may<br/>\nhappen, but I don&#39;t think it&#39;s fair to count on any of them.<br/>\n<br/>\nOTOH, If you value allowing your child to grow and learn at his own pace,<br/>\nyou&#39;re on the unschooling road. Ditto if you value happiness<br/>\n(here-and-now happiness, not &quot;He&#39;ll be glad later that I made him<br/>\npractice piano/learn cursive/read Tom Sawyer now&quot;), and freedom... I<br/>\nreally think it all comes down to freedom. And freer people are happier<br/>\npeople, and they&#39;re easier to live with and more fun to be with, imo...<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"&quot;Pam Hartley&quot; &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the\t middle","postDate":"1075158363","msgId":18468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTI2MjMxMS5pMFFOQlF1ODAwODE0NEBtdGE0LnJjc250eC5zd2JlbGwubmV0Pg=="},"prevInTopic":18467,"nextInTopic":18469,"prevInTime":18467,"nextInTime":18469,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"I think it s safe and interesting to discuss, and look forward to reading other responses on the meat of what you wrote. But, doing my Border Collie","messageBody":"<div id=\"ygrps-yiv-532280691\">I think it&#39;s safe and interesting to discuss, and look forward to reading <br/>\nother responses on the meat of what you wrote.<br/>\n<br/>\nBut, doing my Border Collie look-at-the-whole-field-at-once thing &lt;g&gt;, I<br/>\nwonder what we can do with it we&#39;ve got it, other than to caveat, &quot;Look,<br/>\nunschooling doesn&#39;t work for all parents, even though it works for all kids<br/>\ngiven the right family situation&quot; (and yes, I do believe that, but would<br/>\nwelcome debate on it as well).<br/>\n<br/>\nI might think and might mostly be right (or not, haven&#39;t really tried to<br/>\n&quot;follow up&quot; on my guesses on this one) that I can i.d. the<br/>\nunschooling-wannabes who will &quot;get it&quot; at some point or another versus those<br/>\nwho won&#39;t, but what do I do with that? Tell them? That would probably not go<br/>\nover well.<br/>\n<br/>\nWhen I got your two partial posts this morning, they got my just-awake brain<br/>\nwandering to what maybe new unschoolers most need to hear about the<br/>\nunschooled environment, which I think is 99% of unschooling anyway.<br/>\n<br/>\nThings like, &quot;unschooling works in a house full of people who love each<br/>\nother and are willing to go out of their way to help each other to be happy<br/>\nand peaceful. It does not work in a house full of people who resent each<br/>\nother for real or imagined flaws and failings.&quot;<br/>\n<br/>\nPam<br/>\n<br/>\n<br/>\n<br/>\n----------<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: [AlwaysLearning] the real question/newness (if any) is in the<br/>\nmiddle<br/>\nDate: Mon, Jan 26, 2004, 8:45 AM<br/>\n<br/>\n<br/>\nI don&#39;t think the answer is for those who have been helping others to stop<br/>\ndoing that.   I don&#39;t think the answer is for us to deny for all time even<br/>\nto<br/>\neach other that there ARE beginning levels and more advanced levels.  Joyce<br/>\nFetteroll said something on UnschoolingDiscussion last month about something<br/>\nbeing<br/>\ntoo difficult for beginners (which might be what inspired Kelly&#39;s upcoming<br/>\narticle, or not) and my first response was fear and then laughter (I kept it<br/>\nprivate).  She was right, it was just the idea that she WROTE it and put it<br/>\nout<br/>\nin public.<br/>\n<br/>\nDo we need to bury that idea again or can we safely discuss it?<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"&quot;Pam Hartley&quot; &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the\t middle","postDate":"1075158363","msgId":18469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTI2MjMwNS5pMFFONURIYzAxMjkzNUBtdGF3Ni5wcm9kaWd5Lm5ldD4="},"prevInTopic":18468,"nextInTopic":18470,"prevInTime":18468,"nextInTime":18470,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"I think it s safe and interesting to discuss, and look forward to reading other responses on the meat of what you wrote. But, doing my Border Collie","messageBody":"<div id=\"ygrps-yiv-282923249\">I think it&#39;s safe and interesting to discuss, and look forward to reading <br/>\nother responses on the meat of what you wrote.<br/>\n<br/>\nBut, doing my Border Collie look-at-the-whole-field-at-once thing &lt;g&gt;, I<br/>\nwonder what we can do with it we&#39;ve got it, other than to caveat, &quot;Look,<br/>\nunschooling doesn&#39;t work for all parents, even though it works for all kids<br/>\ngiven the right family situation&quot; (and yes, I do believe that, but would<br/>\nwelcome debate on it as well).<br/>\n<br/>\nI might think and might mostly be right (or not, haven&#39;t really tried to<br/>\n&quot;follow up&quot; on my guesses on this one) that I can i.d. the<br/>\nunschooling-wannabes who will &quot;get it&quot; at some point or another versus those<br/>\nwho won&#39;t, but what do I do with that? Tell them? That would probably not go<br/>\nover well.<br/>\n<br/>\nWhen I got your two partial posts this morning, they got my just-awake brain<br/>\nwandering to what maybe new unschoolers most need to hear about the<br/>\nunschooled environment, which I think is 99% of unschooling anyway.<br/>\n<br/>\nThings like, &quot;unschooling works in a house full of people who love each<br/>\nother and are willing to go out of their way to help each other to be happy<br/>\nand peaceful. It does not work in a house full of people who resent each<br/>\nother for real or imagined flaws and failings.&quot;<br/>\n<br/>\nPam<br/>\n<br/>\n<br/>\n<br/>\n----------<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: [AlwaysLearning] the real question/newness (if any) is in the<br/>\nmiddle<br/>\nDate: Mon, Jan 26, 2004, 8:45 AM<br/>\n<br/>\n<br/>\nI don&#39;t think the answer is for those who have been helping others to stop<br/>\ndoing that.   I don&#39;t think the answer is for us to deny for all time even<br/>\nto<br/>\neach other that there ARE beginning levels and more advanced levels.  Joyce<br/>\nFetteroll said something on UnschoolingDiscussion last month about something<br/>\nbeing<br/>\ntoo difficult for beginners (which might be what inspired Kelly&#39;s upcoming<br/>\narticle, or not) and my first response was fear and then laughter (I kept it<br/>\nprivate).  She was right, it was just the idea that she WROTE it and put it<br/>\nout<br/>\nin public.<br/>\n<br/>\nDo we need to bury that idea again or can we safely discuss it?<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157270430,"authorName":"Barbara Chase","from":"Barbara Chase &lt;barb@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075155930","msgId":18467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjAxMDIwM2JjM2I0NDU2ODRkM0BbMjA0LjE4OS4xMS40MV0+"},"prevInTopic":18466,"nextInTopic":18468,"prevInTime":18466,"nextInTime":18468,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"... I loved this image!!  Yes, at times I feel like I am totally in the dark like Luke.  Believing in what???  If you could only just show it to me, then maybe","messageBody":"<div id=\"ygrps-yiv-114712219\"><blockquote><span title=\"ireply\">&gt;We can play Yoda on lists like this, but we can&#39;t lift your child out of<br/>\n&gt;the mire of school.  You have to believe that you can do it, and then you<br/>\n&gt;have to maintain your resolve and your balance and your focus for years.<br/>\n<br/>\n </span></blockquote>I loved this image!!  Yes, at times I feel like I am totally in the dark<br/>\nlike Luke.  Believing in what???  If you could only just show it to me,<br/>\nthen maybe I&#39;d get it.  But that&#39;s not really how it works, and I know<br/>\nthat.  Sometimes, I just close my eyes to find the path.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t think the answer is for us to deny for all time even to<br/>\n&gt;each other that there ARE beginning levels and more advanced levels.<br/>\n<br/>\n </span></blockquote>Here&#39;s another way of thinking about this... there are various levels even<br/>\nwithin ourselves.  I haven&#39;t been thinking about or living the ideas of<br/>\nunschooling for very long... so I think of myself as a beginner.  But, if I<br/>\nam open w/o expectation I might actually come up with something that might<br/>\neven be helpful to Sandra - who has been at it for a long time.  (Well, a<br/>\ngirl can dream!!)  Anyway, I think the reverse is also true... I believe<br/>\nthat Sandra would be open to receiving some new insight from a newbie like<br/>\nme or anyone else as well.  So, it&#39;s like life... we are all beginners and<br/>\nwe&#39;re all advanced at the same time.  (I love paradoxes btw.)<br/>\n<br/>\nIsn&#39;t this part of the unschooling path?  It&#39;s not bound, it&#39;s limitless!!<br/>\nIt&#39;s not something with any certainty, but in each moment it is glorious.<br/>\n<br/>\n<br/>\n<br/>\nBTW, Sandra... please put your post on your website.  It&#39;s worth saving!<br/>\n<br/>\n<br/>\nNamaste<br/>\n--bc--<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157848909,"authorName":"Louise Robbins","from":"&quot;Louise Robbins&quot; &lt;loueliandguy@...&gt;","profile":"soulribbons","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the real question/newness (if any) is in the middle","postDate":"1075155280","msgId":18498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ2NDNnZytqNDNtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4MC4yNTE1ODIwYi4yZDQ2OWUzN0Bhb2wuY29tPg=="},"prevInTopic":18496,"nextInTopic":18502,"prevInTime":18497,"nextInTime":18499,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"Another thing on the lines of letting children do what they want to do as they will be learning is something I read on a web page about autistic children. It","messageBody":"<div id=\"ygrps-yiv-1819597672\">Another thing on the lines of &quot;letting children do what they want to <br/>\ndo as they will be learning&quot; is something I read on a web page about <br/>\nautistic children. It rather hammers the point home, but is <br/>\ninteresting nonetheless.<br/>\nThe article was about a little boy who&#39;s interest surrounded toilets <br/>\n(OK I hear you giggling!!) Weeell, he recorded all the different <br/>\ntoilets, size, make etc. etc. Who&#39;d be worried huh!!??<br/>\nAnyway he later went on to be the head of a company that designs and <br/>\nmakes toilets! <br/>\nLearning at it&#39;s best!<br/>\n<br/>\nLouise ;)</div>","specialLinks":[]},{"userId":157848909,"authorName":"Louise Robbins","from":"&quot;Louise Robbins&quot; &lt;loueliandguy@...&gt;","profile":"soulribbons","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the real question/newness (if any) is in the middle","postDate":"1075154195","msgId":18502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ2NDJlaitidDFkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4MC4yNTE1ODIwYi4yZDQ2OWUzN0Bhb2wuY29tPg=="},"prevInTopic":18498,"nextInTopic":18503,"prevInTime":18501,"nextInTime":18503,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"Hi! I am new to unschooling and I think I could heartily agree that there must be higher levels of unschooling understanding, it surely is called experience?!!","messageBody":"<div id=\"ygrps-yiv-78696066\">Hi!<br/>\nI am new to unschooling and I think I could heartily agree that <br/>\nthere must be higher levels of unschooling understanding, it surely <br/>\nis called experience?!!<br/>\nMy thoughts so far to move forward is to really get a feel for the <br/>\nway Guy learns and then make as much as I can available to him (and <br/>\nElinor my 2 year old) so that he follows interests and is introduced <br/>\nto new things.<br/>\nSo you go for it you experienced people, but just make sure you help <br/>\nus newies out. <br/>\nAs for this being a place for experienced unschoolers... If I wanted <br/>\nto learn something specific I would go to the person/s that are most <br/>\nknowledgeable on the subject I needed to know, I would go to the <br/>\nlibrary (archives, past posts), I would listen to others and not <br/>\nnecessarily interrupt, but try it out and then share the results.<br/>\nThis is what we want our children to learn isn&#39;t it?<br/>\nYou know one thing we always said at school (when I was full time <br/>\nteaching) was that childrens research skills are poor. Research <br/>\nskills are the key to learning and knowledge is the lock!<br/>\nYou&#39;re the lock people!!!<br/>\n<br/>\nLouise &lt;&lt;winsome smile!&gt;&gt;</div>","specialLinks":[]},{"userId":144628419,"authorName":"Kelli Traaseth","from":"&quot;Kelli Traaseth&quot; &lt;tktraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075153414","msgId":18466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWMzZTQ1NSQ3MmYxNWVjMCRhMjMzMTlhY0B5b3VyZ2c4N3Zxem96cT4=","referencesHeader":"PDE4MC4yNTE1ODIwYi4yZDQ2OWUzN0Bhb2wuY29tPg=="},"prevInTopic":18465,"nextInTopic":18467,"prevInTime":18465,"nextInTime":18467,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote: ***  Some people s first move is to be angry that ... harsh ... to ... Joyce ... something being ... it ... it out ... I m glad you brought this","messageBody":"<div id=\"ygrps-yiv-821950167\">Sandra wrote:<br/>\n<br/>\n***  Some people&#39;s first move is to be angry<br/>\nthat<br/>\n<blockquote><span title=\"ireply\"> &gt; anyone else thinks they know more about unschooling than others.  I get<br/>\n </span></blockquote>harsh<br/>\n<blockquote><span title=\"ireply\"> &gt; insults every few weeks by people who show up cocky and overconfident and<br/>\n&gt; clueless and unbalanced (one way or another).<br/>\n&gt;<br/>\n&gt; I don&#39;t think the answer is for those who have been helping others to stop<br/>\n&gt; doing that.   I don&#39;t think the answer is for us to deny for all time even<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; each other that there ARE beginning levels and more advanced levels.<br/>\n </span></blockquote>Joyce<br/>\n<blockquote><span title=\"ireply\"> &gt; Fetteroll said something on UnschoolingDiscussion last month about<br/>\n </span></blockquote>something being<br/>\n<blockquote><span title=\"ireply\"> &gt; too difficult for beginners (which might be what inspired Kelly&#39;s upcoming<br/>\n&gt; article, or not) and my first response was fear and then laughter (I kept<br/>\n </span></blockquote>it<br/>\n<blockquote><span title=\"ireply\"> &gt; private).  She was right, it was just the idea that she WROTE it and put<br/>\n </span></blockquote>it out<br/>\n<blockquote><span title=\"ireply\"> &gt; in public.<br/>\n&gt;<br/>\n&gt; Do we need to bury that idea again or can we safely discuss it?***<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m glad you brought this up.   And glad I finally got your whole post. &lt;g&gt;<br/>\nI hope we can discuss it.<br/>\n<br/>\nI was going to post something last week on some what of the same subject,<br/>\nbut never did.  I&#39;m glad it was you that started it. &lt;g&gt;<br/>\n<br/>\nI do think there are some sort of levels in unschooling.<br/>\n<br/>\nI don&#39;t think we can call it beginner, intermediate or advanced.  Of course<br/>\nyou can&#39;t<br/>\nput labels on it that way.  (I know Kelly was joking around earlier when she<br/>\nreferred to the list that way,  but we know what she means.)   There are<br/>\ndifferent levels of<br/>\nawareness in it.  Maybe its how far a person wants it to permiate into their<br/>\nlife.  But yet that&#39;s when we start getting into trouble.  &lt;g&gt;  Because<br/>\nisn&#39;t unschooling living your life,  so isn&#39;t it going to encompass it?<br/>\n<br/>\nWhat hit me and what got me thinking last week was a simple statement from<br/>\nsomeone on one of the lists,  something like, &quot;they are finally off the<br/>\nPlaystation&quot;  or equally &quot;they are finally doing something other than video<br/>\ngames&quot;.   These types of statements now jump out at me.   When I first<br/>\nstarted unschooling,  I&#39;m sure I would have said the same thing and not<br/>\nblinked twice at the statements.<br/>\n<br/>\nNow as I read something like that,  it really bothers me.   I don&#39;t always<br/>\nrespond to comments like these because people aren&#39;t always ready to hear<br/>\nthe criticism.  Which could be good or bad of me,  in helping them<br/>\nunderstand unschooling.   I want to say something to the effect of &quot;so what<br/>\nif they are still playing video games?&quot;     Isn&#39;t a big part of<br/>\nunschooling,  accepting where our children are?   My child might end up<br/>\ndesigning games, programming, testing games,  what-ever.<br/>\nIsn&#39;t that a good place to be in?      I think so.<br/>\nI think that is the beauty of unschooling.   But I&#39;m at that point.  I see<br/>\nthe sense in it.  Its crystal clear to me,  now.  It wasn&#39;t at first.<br/>\n<br/>\nThis type of questioning could be applied to all sorts of topics,  we&#39;ve all<br/>\nseen them,  from chores to going to church.   Doesn&#39;t it just permeate into<br/>\nall parts of our lives if we practice respectful parenting?   With my family<br/>\nwe first started homeschooling in an ecletic type style,  then went to<br/>\nunschooling,  then the unschooling went into practically every crevice of<br/>\nour lives.   It was the whole snowball effect. :)<br/>\n<br/>\nSo then it goes back to where the parent is in that awareness.   Also maybe<br/>\nwhat the objective of the parent is.   If a person is caught up in a child<br/>\nlearning certain things,  its pretty hard to be ok with what the child wants<br/>\nnow.   If a person&#39;s objective is the child&#39;s happiness,  well, then I think<br/>\nits alot easier to foster the unschooling environment.<br/>\n<br/>\n<br/>\nMaybe it depends alot on where the parent&#39;s mindset is.<br/>\n<br/>\nMaybe it depends on the level of acceptance they are at. Acceptance of their<br/>\nchildren&#39;s choices and also acceptance of what other people have to say if<br/>\none is discussing unschooling.    I guess my mind goes to people who come to<br/>\ndiscussions looking for resurrance or that they are doing things OK.   Like<br/>\nwith the whole restrictions thing.    In a different place they might get<br/>\nthe pat on the back,  here or other places you&#39;re going to be questioned on<br/>\nit.   At that point I think is where a person can either open up their mind<br/>\nand think through what they are doing.   Or they can shut down and say, &quot;<br/>\nno,  that doesn&#39;t/won&#39;t work&quot;.   Possibly getting defensive and all that.<br/>\nThat might be where a person either stops at one level or goes on to the<br/>\nnext.<br/>\n<br/>\nI guess it comes down to how far an individual lets unschooling go.  Does it<br/>\nencompass your whole life or does it stop with the learning;   but wouldn&#39;t<br/>\na true unschooler say the learning never stops so why would the unschooling?<br/>\n:)<br/>\n<br/>\n<br/>\n<br/>\nKelli~<br/>\n~who is not saying she is at the top level &lt;g&gt;  just making some<br/>\nobservations that have been jumping around in my brain the last few weeks~</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] the real question/newness (if any) is in the middle","postDate":"1075152672","msgId":18465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMTU4NzIwLjUwOTAzMDlAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDE4MC4yNTE1ODIwYi4yZDQ2OWUzN0Bhb2wuY29tPg=="},"prevInTopic":18464,"nextInTopic":18466,"prevInTime":18464,"nextInTime":18466,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"**I m not a soccer player; some of you are or have been or could be. ** Dancing in and out of your analogy: I m way to heavy to be a good soccer player, but","messageBody":"<div id=\"ygrps-yiv-1976667044\">**I&#39;m not a soccer player; some of you are or have been or could be. **<br/>\n<br/>\nDancing in and out of your analogy:<br/>\n<br/>\nI&#39;m way to heavy to be a good soccer player, but sometimes I do play <br/>\nsoccer with the moms and kids at our park day on Tuesday.  (I play <br/>\ngoalie and don&#39;t run much at all.)  However, last Monday I stubbed my <br/>\ntoe so badly that I thought it might be broken, and when I was at the <br/>\npark Tuesday there was no way that I was going to kick a hard ball with <br/>\nsuch a sore toe.<br/>\n<br/>\nSo if Professor Snape could whip up Toe-Desensitizing-Potion, more <br/>\npeople could overcome their pains and issues and unschool successfully. <br/>\n  But without some kind of persuasive magic trying to unschool with <br/>\ncertain issues is probably a lot like playing soccer with a sore toe.<br/>\n<br/>\nBetsy, stretching the analogy a bit too far</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"the real question/newness (if any) is in the middle","postDate":"1075135543","msgId":18464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4MC4yNTE1ODIwYi4yZDQ2OWUzN0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":18465,"prevInTime":18463,"nextInTime":18465,"topicId":18464,"numMessagesInTopic":0,"msgSnippet":"The real question/newness (if any) is in the middle. I retyped the second and third paragraphs because when I mailed the file to myself it had a bad text","messageBody":"<div id=\"ygrps-yiv-850679741\">The real question/newness (if any) is in the middle.<br/>\n<br/>\nI retyped the second and third paragraphs because when I mailed the file to <br/>\nmyself it had a &quot;bad text&quot; note in the middle there.   IF this all goes <br/>\nthrough, the end should have a row of *****<br/>\n<br/>\n<br/>\nThere was a little discussion on another list that turned to the idea that <br/>\nthere was a group of unschoolers saying who could and couldn&#39;t unschool.  It&#39;s <br/>\nbeen making me think.  A thought made me get out of bed and come and write when <br/>\nI should be sleeping.  But it wasn&#39;t we were saying &quot;We won&#39;t let you,&quot; we <br/>\nwere saying, &quot;If you believe thus and such more than you believe your child is a <br/>\nnatural natural-learner, unschooling won&#39;t work.&quot;<br/>\n<br/>\nThis difficult sort of question has been on the edge of every online <br/>\ndiscussion I&#39;ve been in since I was first on Prodigy and reading newsgroups in the <br/>\ndays when computers were in black and white.  Does someone else saying you can <br/>\nmake you able to?  No.  Does someone else saying you can&#39;t prevent you?  No.  <br/>\nWhat will enable a person to do ANYthing?  Talent, interest, ability, desire, <br/>\nactionthings like that.<br/>\n<br/>\nI&#39;m not a soccer player; some of you are or have been or could be.  Some of <br/>\nyou play no musical instruments while I do; some of you could, some have too <br/>\nlittle talent, interest and desire in that area.  Cooking, engine tune-up, lens <br/>\ngrinding, geological prospecting, oil painting some we do, some we don&#39;t, <br/>\nsome could, some couldn&#39;t.<br/>\n<br/>\nAnyway, when and if people come to an unschooling source or resource, does <br/>\ntouching the book or joining the group guarantee understanding or success? <br/>\n<br/>\nHere&#39;s what I wrote when I woke up:<br/>\n============<br/>\n<br/>\n<br/>\nIf someone can&#39;t handle real questions about their own thoughts, unschooling <br/>\nwill not come easily.  If others asking &quot;WHY do you think what you say you <br/>\nbelieve?&quot; makes them so angry that they slam away muttering, how will they handle <br/>\nthe simpler questions of friends, neighbors, and grocery store clerks?  <br/>\n<br/>\nWithout examining our own past learning, our fears and the times and ways we <br/>\nhave shut out input and feedback,, the conscious direction of our thoughts <br/>\nwon&#39;t be easy.   Unschoolers need to come to the point that they can face their <br/>\npast so that they can make peace with it, and pass the peace on to their <br/>\nchildren.<br/>\n<br/>\nMy husband&#39;s favorite parts of movies tends to be the &quot;training scenes&quot; of <br/>\nheroes and avengers.   From old Hong Kong kick flicks through Star Wars, Zorro, <br/>\nBuffy and the Matrix,, there are people carrying water, walking on rice paper, <br/>\ncatching flies with chopsticks, lifting, sensing, enduring and growing strong <br/>\nand calm.  He helped me gain an appreciation for that traditional glimpse <br/>\ninto what makes the change in a person&#39;s outlook and skills.   <br/>\n<br/>\nPeople new to unschooling are easily unbalanced with a question like &quot;Why?&quot; <br/>\nor &#39;How do you propose to do that?&quot;   We can help them find that balance, but <br/>\nit has to be their own real balance and knowledge, not them parroting our <br/>\nwords.  <br/>\n<br/>\nSchool calls test scores &quot;knowing.&quot;  If we &quot;knew&quot; everything we had ever spat <br/>\nback out on a ten-question Friday quiz, school would be the most successful <br/>\nthing in the history of the world.    I have a piece of paper that says I <br/>\n&quot;know&quot; Middle English, and for a phrase or two I might, but what I did was to keep <br/>\nin the 80% range of cooperation and performance for four months one time as a <br/>\nteacher presented information about Middle English.   What I do know, I <br/>\nlearned by caring about it, and following it up in the years to follow.   Some <br/>\npeople think they know geometry or the history of Rome, but if they look at what <br/>\nthey know it will probably be divided into what someone else said they knew and <br/>\nwhat they&#39;ve learned from their own curiosity and fascination.  If all they <br/>\nhave is what they repeated back on tests in school, they will know less than <br/>\nthey could.<br/>\n<br/>\nIn learning to unschool, what people learn to speak back on Friday is too <br/>\nsmall to count.  What they do &quot;in the field,&quot; with their own real children, in <br/>\nreal time, on difficult mornings, on feverish evenings, on boring afternoons or <br/>\ndays filled with bickering is the hard part.  The unbalancing, frightening <br/>\ntimes when they feel alone are when they do or do not.  We can play Yoda on lists <br/>\nlike this, but we can&#39;t lift your child out of the mire of school.  You have <br/>\nto believe that you can do it, and then you have to maintain your resolve and <br/>\nyour balance and your focus for years.<br/>\n<br/>\n-------------------------<br/>\n<br/>\n<br/>\nMaybe it could be an article, or maybe it&#39;s just me muttering to myself to <br/>\nimprove my own thinking.<br/>\nProbably it would be better as a discussion here.  Someone lately said this <br/>\nwas an advanced unschooling list. &lt;g&gt;  I know there are beginning unschoolers <br/>\nhere too, and that&#39;s fine.  <br/>\n<br/>\n<br/>\nI read something last night that Kelly Lovejoy is writing about stages of <br/>\nunschooling, and maybe I dreamed about it, and woke up with a thought like a <br/>\nsticker.  Some people don&#39;t want to hear that there are higher levels of <br/>\nunschooling thought.  People have been &quot;shushing&quot; such ideas for years, and I had some <br/>\nurge to shush Kelly last night.  Some people&#39;s first move is to be angry that <br/>\nanyone else thinks they know more about unschooling than others.  I get harsh <br/>\ninsults every few weeks by people who show up cocky and overconfident and <br/>\nclueless and unbalanced (one way or another).<br/>\n<br/>\nI don&#39;t think the answer is for those who have been helping others to stop <br/>\ndoing that.   I don&#39;t think the answer is for us to deny for all time even to <br/>\neach other that there ARE beginning levels and more advanced levels.  Joyce <br/>\nFetteroll said something on UnschoolingDiscussion last month about something being <br/>\ntoo difficult for beginners (which might be what inspired Kelly&#39;s upcoming <br/>\narticle, or not) and my first response was fear and then laughter (I kept it <br/>\nprivate).  She was right, it was just the idea that she WROTE it and put it out <br/>\nin public.<br/>\n<br/>\nDo we need to bury that idea again or can we safely discuss it?  <br/>\n<br/>\n<br/>\n******************************</div>","specialLinks":[]}],"prevTopicId":18662,"nextTopicId":18666}}