{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"food choices","postDate":"1031724671","msgId":43688,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMTZBTzJScHk5dE1URjRpYTUwMDAwMDU5Y0Bob3RtYWlsLmNvbT4="},"prevInTopic":43606,"nextInTopic":0,"prevInTime":43687,"nextInTime":43689,"topicId":43593,"numMessagesInTopic":0,"msgSnippet":"Just wanted to add something about the whole food issue. Just in case anyone is wondering about the choices their children are making. Tara, my oldest was a","messageBody":"<div id=\"ygrps-yiv-1605405325\">Just wanted to add something about the whole food issue. Just in case anyone <br/>\nis wondering about the choices their children are making.<br/>\n<br/>\nTara, my oldest was a great eater as a baby. She ate everything put in front <br/>\nof her, veggies and whatever it was. When she turned 2, it was like a <br/>\ndifferent child. Within a week, she cut out all meat to only meatballs. <br/>\nWithin the next month after that, she cut out just about everything else she <br/>\nate. She cut out milk, meat of any kind, veggies except for corn, fruit <br/>\nexcept for baby peaches. (I mean baby food) She started to survive on french <br/>\nfries, spaghettio&#39;s without the meatballs, pasta with sauce and no meat in <br/>\nthe sauce. Lunches were a chore as she was going to school. From the 2nd <br/>\ngrade up to last year, (she&#39;s almost 17)she took peanut butter and jelly to <br/>\nschool every day of her life. When she was young, I thought it was phase. <br/>\nWhn I realized it was going to be a very long one, I let her go. What was I <br/>\ngoing to do, force food into her?? I would feed her before going anywhere <br/>\nelse to eat like someone&#39;s house and even would send her with food if she <br/>\nwent visiting. Very gradually she started to add some things on her own. She <br/>\nstarted with chicken tenders from BK and went from there.<br/>\n<br/>\nNow she can eat out at any restuarant and manages quite well. She added some <br/>\nveggies and fruit along the way. She doesn&#39;t &quot;pig out&quot; on snacks, drinks <br/>\nonly water and ice tea, and has even gone as far as to eat steak now. The <br/>\nonly other meat from chicken she&#39;ll touch. Doesn&#39;t eat any kind of seafood <br/>\nat all. Point is it all worked for her. Even though she&#39;s a school kid, <br/>\nshe&#39;s healthier than most I know. Most of the time, the whole house can <br/>\ncatch a cold and she gets nothing. So it certainly hasn&#39;t hurt her any and <br/>\nwe&#39;ve saved countless hours of fighting over nothing.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] food choices","postDate":"1031673141","msgId":43606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI2LjExNzNmM2NjLjJhYWY2ZjM1QGFvbC5jb20+"},"prevInTopic":43593,"nextInTopic":43688,"prevInTime":43605,"nextInTime":43607,"topicId":43593,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/10/02 8:49:15 AM, starsuncloud@cs.com writes: ","messageBody":"<div id=\"ygrps-yiv-615535143\">In a message dated 9/10/02 8:49:15 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\n&lt;&lt; Or you could relax, watch them eat it happily and think how wonderful it <br/>\nis <br/>\nthat they aren&#39;t feeling stressed about their food choices.<br/>\nAnd then watch them eat their broccoli just as happily because they feel <br/>\nconfident in their own choices. :) &gt;&gt;<br/>\n<br/>\nLast night at a restaurant, Holly wanted mozarella sticks for her meal.  When <br/>\nmine came (salmon) she didn&#39;t want any salmon, but she DID want the cooked <br/>\ncarrots and the rice.  When desert time came, she didn&#39;t want any.  We <br/>\nwould&#39;ve bought her one.  She came home to a fridge she knew had cheesecake, <br/>\nice cream and popsicles.  They&#39;re all still there.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"food choices","postDate":"1031669246","msgId":43593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyOC4xNzRmMWJlYy4yYWFmNWZmZUBjcy5jb20+"},"prevInTopic":0,"nextInTopic":43606,"prevInTime":43592,"nextInTime":43594,"topicId":43593,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/10/02 9:17:10 AM Central Daylight Time, Unschooling-dotcom@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-2032281836\">In a message dated 9/10/02 9:17:10 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; I still don&#39;t have rules.  But I fear I&#39;ve done as much damage in talking <br/>\n about this being less nutritious than that as my friends did in having all <br/>\n those rules.  How do others handle these kinds of issues? &gt;&gt;<br/>\n<br/>\nHere&#39;s our life, just for an example, not to tell you how to do it.<br/>\nI buy mostly wholesome, healthy foods. I cook fairly nutritous meals and try <br/>\nto make good snacks easily available. I also include my children in the meal <br/>\nplanning (ie: &quot;what do you guys want to eat this week?) and the grocery <br/>\nshopping.<br/>\nThey love going to the grocery store.<br/>\nMost kids I know hate it. But I go where they want, we look at all the foods <br/>\ntogether, we talk about where they are from and how to cook the weird ones <br/>\n(cactus, ugli fruit, Jicama) and they choose what they want also.<br/>\nIf it&#39;s junky, I try to offer a healthier alternative that would meet the <br/>\ndesire. Like my dd wanted Tang juices the other day, I showed her the Capri <br/>\nsun (full of sugar, but at least with real fruit juice and not all the <br/>\npreservatives and dye of the Tang) and she thought that was fine. If she <br/>\nstill really wanted the Tang I&#39;d get it.<br/>\nSure I cringe.<br/>\nBut here&#39;s my thought process on this.<br/>\nI&#39;ve seen people eat all the things I am horrified about and live to be OLD <br/>\nand healthy.<br/>\nI believe that emotional/mental health is by far the most important aspect of <br/>\na persons total well being.<br/>\nSo if I have a choice between physical health and emotional health, I&#39;ll do <br/>\ndeprive the physical before the emotional.<br/>\nAnd I hugely believe that having control of one&#39;s life, of the choices in <br/>\nthat life and not having feelings of deprivation, contribute to a person&#39;s <br/>\nemotional health.<br/>\nSo sure, I cringe over the dye or sugar, but I&#39;ve also seen my children less <br/>\nneedy with the junk and more willing to try anything I cook. Because they <br/>\ntrust me to not be coercive with food.<br/>\nWhile I was fixing their dinner last night, they all pulled out popsicles <br/>\nthat Sierra had made herself earlier and ate those.  I didn&#39;t notice that it <br/>\nmade a dent in what they ate.<br/>\nI dislike that  &quot;you&#39;ll spoil your appetite&quot; garbage.<br/>\nIsn&#39;t that the whole point of eating? To stop the feelings of hunger? But I <br/>\nguess we just shouldn&#39;t eat since it will spoil our appetite!! LOL<br/>\nBut I digress...<br/>\nThe point is, you could make a big deal about the stuff you consider junk and <br/>\ncause them to feel needy and not trust you.<br/>\nOr you could relax, watch them eat it happily and think how wonderful it is <br/>\nthat they aren&#39;t feeling stressed about their food choices.<br/>\nAnd then watch them eat their broccoli just as happily because they feel <br/>\nconfident in their own choices. :)<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":43543,"nextTopicId":41730}}