{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Kathryn McGowan","from":"Kathryn McGowan &lt;kbmimac@...&gt;","replyTo":"LIST","senderId":"S6I0P9DeAkVxlCPy3plwqv3qj7Hy5wn2mpVt9D4X-OyqPq3__HoEVGGrktultj5ZA-X-lDejFtBOFd15Nxm-0t5aq5Z3W68DygYTuaN-","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[Unschooling-dotcom] how electricity works (sort of)","postDate":"961157140","msgId":9332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NEExODEwLjgyN0ZGODJEQGVhcnRobGluay5uZXQ+","referencesHeader":"PDk2MDY5MTU1Ny4yNTA5MkBlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":9331,"nextInTime":9333,"topicId":9332,"numMessagesInTopic":0,"msgSnippet":"Hi Trisha, I was thinking about electricity and how I first learned about sort of the basic ideas. Maybe this will interest you and Gary. One idea is that","messageBody":"<div id=\"ygrps-yiv-1597252625\">Hi Trisha,<br/>\n<br/>\nI was thinking about electricity and how I first learned about sort of the basic<br/>\nideas. Maybe this will interest you and Gary.<br/>\n<br/>\nOne idea is that electricity sort of flows through a wire like water through a<br/>\nhose. The light switch is the valve, voltage is like water pressure, watts are<br/>\nlike how much water a sprinkler can put out, amps are like how much water the<br/>\nhose can safely carry, resistance is like anything that can slow the flow.  Show<br/>\nhim ratings of appliances in your home and compare how many watts a space heater<br/>\nor hair dryer puts out to a blender or a TV. The watts are sort of like heat,<br/>\nmaybe more like energy output. If you have circuit breakers or a fuse boxes, say<br/>\nthat the main is like the main water line into the house, and all the smaller<br/>\nones are like pipes to different areas of the house and the outlets and switches<br/>\nare like faucets. Where&#39;s the drain? Tell him all circuits are a path. There are<br/>\nwires to and from all outlets and switches and even in and out of your house.<br/>\n<br/>\nSometimes the traffic analogy is useful. When you close the switch it&#39;s like<br/>\nlowering the bridge so traffic can flow around the circuit from the source<br/>\n(battery +) to the load (light) then along the wire to the other end of the<br/>\nbattery(-).<br/>\n<br/>\nYou could explain it like dominoes. Set up a row (as long as you want) and say<br/>\nthat the first tap is like turning on the switch and the last one falling can<br/>\nknock something over that could represent a light bulb going on. The electrons in<br/>\nthe copper in a wire (or anything else that conducts electricity) get tapped<br/>\nalong like dominoes till they reach the other end.<br/>\n<br/>\nI don&#39;t know if Radio Shack still sells these, but I had a &quot;101 Projects&quot; kit<br/>\nwhen I was a kid where it was a board with color coded wires of different lengths<br/>\nand several tiny resistors, capacitors, transistors etc. all soldered to it. You<br/>\nfollowed the directions about which wires to connect where and you could make a<br/>\nradio or a light or a morse code beeper thing. The wires connected via springs so<br/>\nyou could take it apart again and again. That probably is too old for him right<br/>\nnow, but maybe they have simpler kits that you could build together to illustrate<br/>\nand play. Like the old basic of a battery, 2 wires, and a light bulb, maybe even<br/>\nadd a simple switch.<br/>\n<br/>\nI hope that some of this could be interesting to you and Gary. I know I&#39;ve had<br/>\nalot of fun over the years making things.<br/>\n<br/>\nKathy in Avon<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Message: 13<br/>\n&gt;    Date: Sat, 10 Jun 2000 16:17:06 CDT<br/>\n&gt;    From: &quot;Trisha Sides&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yschild@...\">yschild@...</a>&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Gary has been VERY into bugs since before he could walk, and recently he,ms<br/>\n&gt; gotten interested in Spanish,and how electricity works(which has stumped me,<br/>\n&gt; I have no idea how to explain this to a 6 year old without boring him to<br/>\n&gt; tears,I have looked on the web, but most of what I found is a little too<br/>\n&gt; advanced as he doesn&#39;t read much yet.)<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":9296,"nextTopicId":9341}}