{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Ann Bagala","from":"Ann Bagala &lt;bagala@...&gt;","replyTo":"LIST","senderId":"15r8NfNhCv7PvOaDfCQ-iqkNktXPiBN0Z_KHUAMRZ08VfZJd1w8GIqjVqL7UPeUuhWS4Mk8GGqjwXGLH-a15v4LT","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 637","postDate":"962272918","msgId":10221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NUIxRTk2LjVGRUI0NEM0QGd3aS5uZXQ+","referencesHeader":"PDk2MjI0NjA3MC4xODE4OUBlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":10220,"nextInTime":10222,"topicId":10221,"numMessagesInTopic":0,"msgSnippet":"Amen, Billy!!! Ann Bagala","messageBody":"<div id=\"ygrps-yiv-268998017\">\n<html>\nAmen, Billy!!!\n<p>Ann Bagala\n<br>&nbsp;\n<br>&nbsp;\n<blockquote><span title=\"qreply\"> <blockquote TYPE=\"CITE\">\n<pre>Billy wrote:</pre>\n</blockquote>\n\n<blockquote TYPE=\"CITE\">\n<pre>Okay, I told myself I was going to stay out of this one, but . . .\n\nI have to agree with someone else who made a comment about some of the\nattitudes seeming inappropriate for an &quot;unschooling&quot; list. I thought\nunschoolers disliked the artificial environment of schoolish learning where\nit is important to learn a bunch of facts because they will be on a test and\nif you don&#39;t learn them you will have the very artificial consequence of\nperforming poorly on the test.\n\nDoes anyone else see the similarity between saying that bad actions have bad\nconsequences and I will teach you that by imposing the artificial\nconsequence of spanking you when you do what I consider to be a bad action?\n\nThat attitude in school teaches many unintended lessons. Learning isn&#39;t\nimportant, getting a good grade on the test is. Knowing about a subject\nisn&#39;t as important as knowing what your teacher thinks is important. Since\nit is important to get good grades, cheating may become an acceptable\noption. Cheating is only possible for getting grades, not for learning.\nNotice that if learning is important, there is also no reason to cheat.\n\nSpanking also teaches many unintended lessons. The biggest person gets to\nmake the rules. It is okay to hurt someone if you don&#39;t like what they are\ndoing. Might makes right. Don&#39;t get caught. Lying may become an acceptable\noption if you are trying to avoid physical punishment.\n\nThere are lots of studies to show that positive reinforcement is much more\neffective than negative reinforcement. Spanking is never necessary to teach\nor correct. There are lots of options and the best one is to avoid the\nproblem to begin with. The best dog trainers will tell you that instead of\nswatting a dog on the nose with a newspaper because he had an accident in\nthe house, you should take him outside after every meal and at regular\nintervals between meals so he doesn&#39;t have the chance of having an accident\nin the house.\n\nFrankly, I have always been horrified by the thought of a parent who can\n&quot;calmly, and lovingly&quot; spank their child. I have more sympathy with a parent\nwho momentarily &quot;loses&quot; it but can later apologize and admit that they acted\nin anger.\n\nOkay, where did I put my flame-proof suit. There it is. Give me a second to\nget it zipped. I&#39;m now ready to push the send button and stand back from the\nflames.</pre>\n</blockquote>\n</span></blockquote></p></html>\n</div>","specialLinks":[]}],"prevTopicId":10220,"nextTopicId":10225}}