{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"trust and freedom (was Can electronic media become addictive in children?","postDate":"1096307271","msgId":99889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJiLjQ2NjRlMjM3LjJlODlhYzQ3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":99888,"nextInTime":99890,"topicId":99889,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/27/04 10:35:22 AM, tuckervill2@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1803752415\">In a message dated 9/27/04 10:35:22 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a> writes:<br/>\n<br/>\n&lt;&lt; A kid knowing that he has that freedom to go and do what he wants AND has  <br/>\nthe option to change his mind is much more empowered than one who is forced <br/>\nto  <br/>\nget up every day, just to practice getting up every day.   &gt;&gt;<br/>\n<br/>\nSeems that way to me too.<br/>\nBut I don&#39;t think they&#39;re addicted to empowerment.<br/>\n<br/>\nAnd part of that empowerment probably came from times when the kids took <br/>\npaths or exercised obsessions that worried the parents, but the parents trusted <br/>\nthe kids.<br/>\n<br/>\nIt would be hard for me to change courses now and NOT trust that Holly and <br/>\nMarty and Kirby were thoughtful and responsible.   It would be going directly <br/>\nagainst something I  know is true if I were to pretend they were NOT <br/>\ntrustworthy.   But I came to it gradually over years of sometimes worrying and wondering, <br/>\nbut of trying to make the more trusting choices every time.<br/>\n<br/>\nMarty started a job last week, and hadn&#39;t collected his allowance for two <br/>\nweeks, so last night he had $75 in his pocket, and was restless and wanted to go <br/>\ndo something.  He can drive now, too.  His nearest-living friend had already <br/>\ngone to sleep (8:30 at night) but Marty was just antsy to go somewhere.  I <br/>\nasked if he wanted to go to Walmart and pick up some paint for me (for Thinking <br/>\nSticks).   At first he didn&#39;t.  Then he did.   So at 9:00 he left saying he <br/>\nmight want to buy a video game.<br/>\n<br/>\nCame back soon with my paint, and no video game.<br/>\nBorrowed the Hollywood Video card and went to rent one (out the back gate, <br/>\nacross the vacant lot, 9:45 p.m.)<br/>\n<br/>\nCame back without a rental game because they didn&#39;t have one he wanted.<br/>\n<br/>\nMarty took my van and didn&#39;t run around irresponsibly.<br/>\nMarty had $75 and it didn&#39;t burn a hole in his pocket.<br/>\n<br/>\nI could spend $75 at Walmart without even trying, and on stuff I hadn&#39;t even <br/>\nheard of before I went.   But Marty, having had trust and freedom and plenty <br/>\n(emotionally speaking at least) his whole life is not living as I did, and as I <br/>\ndo.<br/>\n<br/>\nThe other day I was at the dentist for almost two hours, four fillings, shots <br/>\nin 3/4 of my mouth, very relieved to have it over.  And so I rewarded myself <br/>\nby spending money.  I went to a healthfood store I&#39;d never been in and bought <br/>\nfrivolous stuff.  Some gifts for Holly&#39;s birthday.   Cashew Butter.   Caraway <br/>\nseeds, because they were cheap, even though I already have some. A bathbrush <br/>\nbecause Holly&#39;s broke.  I spend money sometimes as self-comfort.   None of my <br/>\nkids do that.  (At least I&#39;ve learned to go and spend on other people, or to <br/>\nbuy food, and I don&#39;t do expensive clothes or shoes or whatever all, so I still <br/>\nhave the needy behavior, I just channel it as well as I can.)<br/>\n<br/>\nI was supposed to wake Marty and Holly up by 11:30.  I stood up to go do it, <br/>\nand met Marty.  I started up to wake Holly up, and met her on the stairs.   <br/>\nThey had me as backup, but each set an alarm.<br/>\n<br/>\nThey&#39;re going to watch Buffy (borrowed DVDs of the first season) with a <br/>\nfriend in a town 20 miles away.  Marty&#39;s driving.  They&#39;re stopping by a community <br/>\ncenter on the way to try to buy a membership so they can use the gym (exercise <br/>\nequipment) and gameroom (pool, pingpong, foosball).  Their idea.   I loaned <br/>\nhim a charge card in case they need to gas the van.  <br/>\n<br/>\nI don&#39;t know that people who started attachment parenting and really trusting <br/>\nkids later in the kids&#39; lives will get those results, but there are people <br/>\nreading whose kids are still little who are still in the decision making phase.<br/>\n<br/>\nI think trusting them will pay off in unimaginable ways.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":95205,"nextTopicId":99883}}