{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Sandra Brown","from":"&quot;Sandra Brown&quot; &lt;sbrown2@...","replyTo":"LIST","senderId":"ZorkL1krTdNH16spvFwQnkYap_3vFLCIAdtZw4zg3nBgH05XP5cfhMuBNkAN8TObdyiSMxuwD28ncqWUOCyueVfYPibv4iZtKwrN","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Higher Ed","postDate":"936019074","msgId":2424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzkuMjQyNC45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2423,"nextInTime":2425,"topicId":2424,"numMessagesInTopic":0,"msgSnippet":"Sandra, I have to disagree here.  The point, for me, about HE is choice. The choice whether to go to college, or train as an apprentice, or do nothing,","messageBody":"<div id=\"ygrps-yiv-256701528\">&lt;snip&gt;Sandra, I have to disagree here.  The point, for me, about HE is<br/>\nchoice.<br/>\nThe choice whether to go to college, or train as an apprentice, or do<br/>\nnothing, or get pregnant at sixteen (I hope not, but it&#39;s a choice!)  Some<br/>\npeople&#39;s God-given gifts will not serve them in coolege.  Mine would have,<br/>\nbut I chose not to go.<br/>\n<br/>\nThe world would be a better place without the pursuit of money, but that&#39;s<br/>\nhow it is.  The world would be a better place without forcing people into<br/>\nboxes that don&#39;t fit them.  The world would be a better place if people knew<br/>\nwhat they were, and stopped trying to be what they aren&#39;t.  That&#39;s my<br/>\nsoapbox time over, I&#39;ll hand over to someone else!&lt;snip&gt;<br/>\n<br/>\nI completely agree with you, Tracy.  My point is that there should be that<br/>\nopportunity for all who desire it, not just those who can afford it.  I went<br/>\nto college for two years and couldn&#39;t learn what I wanted to learn there.  I<br/>\nspent several years midwifing, several years unschooling young children, and<br/>\nin the middle of all that I am a volunteer administrator for an organization<br/>\nthat I srongly believe in and a permaculture activist working together to<br/>\nbuild a sustainable community in my area.  It is very hard for people to<br/>\nlive by their true values and principles in our society where we are judged<br/>\nby money and acheivement.  My point about Higher Ed was that if there isn&#39;t<br/>\nfree choice and the option, it is exclusive and elitist.<br/>\n<br/>\nA lot of people had dreams of what they wanted to do, just ask your parents<br/>\nand your grandparents.  My father wanted to be an architect, but became a<br/>\npharmacist beacuse the corner drug store where he worked through high school<br/>\npaid his way through college.  My father-in-law wanted to be a veterinarian,<br/>\nbut could not get in to college because of poor grades  and lack of money.<br/>\nHe ended up working in factories his whole life.  My mother wanted to be a<br/>\ndoctor, and well, she just saw no other option than to have six kids and be<br/>\nhome with them, but we won&#39;t go there.<br/>\n<br/>\nHere in Michigan, the governor and the State Board of Education are<br/>\nconstantly trying to figure out how to get the kids in high school to<br/>\nprepare for the jobs that are available, namely factory work.  Most of these<br/>\njobs don&#39;t require a college education, and just a month or so our local<br/>\npaper the governor was touting this as wonderful for the economy, that there<br/>\nare all of these *great* jobs that don&#39;t require a college ed.  This sickens<br/>\nme!!!!!  No mention of what kind of society we want to live in, what gifts<br/>\nand skills all of these young people have, what kind of important work they<br/>\nwant to do with their lives.<br/>\n<br/>\nThere should be the option to go to school or not, to learn by doing and<br/>\napprenticeship instead of only by books and tests, to raise a family or make<br/>\na million.  I guess that instead of saying we should be working for<br/>\nuniversal higher education, what I really meant to say was the goal is the<br/>\n*option* for *everyone* to have a higher education if they so choose.  Would<br/>\nyou agree here?<br/>\n<br/>\nInstead, we have &quot;compulsory education&quot; for pre-schoolers, and a job market<br/>\nthat is exclusive and elitist.  Is there any wonder that drug use,<br/>\ndepression, and suicide is rampant among teenagers?<br/>\n<br/>\nSandra Brown<br/>\nAnn Arbor, MI where I&#39;ll be making sauce, salsa, and pickles all week long</div>","specialLinks":[]}],"prevTopicId":2342,"nextTopicId":2412}}