{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Article About Gun Play","postDate":"1283915315","msgId":57155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5M0UwMERBLUZFRDctNEZENC1CMjdGLTMxQUI0NDI2NzI3REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGk2NnJqZSszcWQyQGVHcm91cHMuY29tPg==","referencesHeader":"PGk2NnJqZSszcWQyQGVHcm91cHMuY29tPg=="},"prevInTopic":57154,"nextInTopic":0,"prevInTime":57154,"nextInTime":57156,"topicId":57154,"numMessagesInTopic":0,"msgSnippet":"Knowing that some people are disturbed by toy guns and swords, we said from the time our boys were two and big enough to pick one up and go, that they should","messageBody":"<div id=\"ygrps-yiv-2022881247\">Knowing that some people are disturbed by toy guns and swords, we said  <br/>\nfrom the time our boys were two and big enough to pick one up and go,  <br/>\nthat they should only hit someone else with a toy sword, or only shoot  <br/>\nat someone else who also had a toy gun.   That seemed reasonable.<br/>\n<br/>\nAs they got older, then, it was easy to extend that to playing, and  <br/>\nhumor.  &quot;It&#39;s only playing if everyone&#39;s playing.&quot;  And they got that,  <br/>\nbecause it was like toy guns.  Making fun of someone who wasn&#39;t  <br/>\nlaughing wasn&#39;t done, by my kids, because of that.  I hadn&#39;t foreseen  <br/>\nthat, but it worked.<br/>\n<br/>\n-=-He wrote me back: &quot;Why do boys shoot their mothers? My answer is  <br/>\nthat a boy&#39;s mother gets to see everything he is proud of or excited  <br/>\nabout; she is his first and best audience. But why does he shoot at  <br/>\nyou? Doesn&#39;t he love you? Yes, of course he loves you, and doesn&#39;t  <br/>\nreally want to hurt you. He&#39;s playing and he is quite confident that  <br/>\nhis actions won&#39;t really hurt you. After all, he knows that it isn&#39;t a  <br/>\nreal gun. He just wants to see you react to his imagined power.&quot;-=-<br/>\n<br/>\nSure.  Bullies want to see other react to their imagined power, too,  <br/>\nso I don&#39;t agree with the necessity of accepting &quot;being shot&quot; in play  <br/>\nif one isn&#39;t playing.<br/>\n<br/>\nA mother can react to a child&#39;s imagined power without being the  <br/>\nimagined target.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/guns\">http://sandradodd.com/peace/guns</a><br/>\n<br/>\nand everything Gerard Jones writes about violent fantasy in comic  <br/>\nbooks, play and video games is awesome.<br/>\nHere&#39;s an interview from some years ago, but he keeps on researching  <br/>\nand writing, and isn&#39;t only getting stronger in his convictions.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://motherjones.com/politics/2000/06/violent-media-good-kids-0\">http://motherjones.com/politics/2000/06/violent-media-good-kids-0</a><br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":263488403,"authorName":"hmbpie","from":"&quot;hmbpie&quot; &lt;heatherpie@...&gt;","profile":"hmbpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Article About Gun Play","postDate":"1283912110","msgId":57154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk2NnJqZSszcWQyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":57155,"prevInTime":57153,"nextInTime":57155,"topicId":57154,"numMessagesInTopic":0,"msgSnippet":"I loved this article! Especially the way they described why boys shoot at their moms.  It was found at SFgate.com. My friend Mark took his two boys to a","messageBody":"<div id=\"ygrps-yiv-2133781728\">I loved this article! Especially the way they described why boys shoot at their moms.  It was found at SFgate.com.<br/>\n<br/>\nMy friend Mark took his two boys to a Berkeley park last weekend. His boys brought their soft Styrofoam swords along, and next to the playground the 4- and 6-year-old engaged in battle, pretending to be dueling medieval knights.<br/>\n<br/>\nTypical, harmless boy behavior, right?<br/>\n<br/>\nWell, not according to a mom who was at the park with her three girls. This woman came over to Mark&#39;s boys and said, &quot;Stop that! You are bringing everyone at the park down with your violent play.&quot; (Note: The boys weren&#39;t even near the girls and their &quot;weapons&quot; never touched them.)<br/>\n<br/>\nIt&#39;s tempting to make this a story about pesky Berkeley people, but that has already been brilliantly done many times, especially by local writer Michael Chabon in a 2002 Gourmet magazine article.<br/>\n<br/>\nAnd so this will be a story about boys and aggression as well as an attempt to prove this Berkeley mom wrong.<br/>\n<br/>\nRoughhousing: Most experts will tell you that boys benefit from it.<br/>\n<br/>\nIs &#39;violent&#39; play normal for boys?<br/>\n<br/>\nMost any parent of a boy has witnessed their sweet, innocent, cherub-faced son turn a pencil into a machine gun, a chopstick into a sword, a tennis ball into a hand grenade. <br/>\n<br/>\nBoys seem to be &quot;hard-wired&quot; with the XY chromosome that allows them to see a stick as an M60. In fact, a recent survey of 98 female preschool teachers found that 4-year-old boys play superhero or enact mock fights much more frequently than girls, who seem to favor house or family themes for playtime.<br/>\n<br/>\nWhile many parents view boys&#39; aggressive behavior as typical, others find it unsettling, at least when it first starts around 3 years of age. <br/>\n<br/>\nWhen my husband brought a toy gun home for my son and my 3-year-old aimed it at me and said, I&#39;m going to shoot you,&quot; I grabbed the thing from his tiny, little hands.<br/>\n<br/>\nNow that he&#39;s 6 years old and I&#39;ve witnessed three years of imaginative play with weapons, I know that I overreacted.<br/>\n<br/>\nMost child psychologists will tell you that it&#39;s normal, even healthy, for a boy to play with a toy weapon. &quot;Since the beginning of recorded time, little boys have enjoyed games in which they project their power into the world, and that means playing with &#39;weapons,&#39;&quot; says Michael Thompson, coauthor of The New York Times bestseller Raising Cane: Protecting the Emotional Life of Boys. &quot;I have no doubt that &#39;cave&#39; boys pointed sticks at each other in threatening ways, or chucked rocks at one another, or imitated the spear-throwing actions of their fathers.&quot;<br/>\n<br/>\nResearch has found that boys actually benefit from aggressive play. Studies indicate that through &quot;sophisticated play (including games like cops and robbers), children learn to delay gratification, prioritize, consider the perspectives of others, represent things symbolically, and control impulses,&quot; according to a recent article in LiveScience. <br/>\n<br/>\nResearchers at the University of Maine&#39;s Katherine M. Durst Child Development Learning Center in Orono recently conducted an interesting experiment around boys and aggression. Boys in the program were banned from play involving &quot;bad guys,&quot; and suddenly their imaginations became dead.<br/>\n<br/>\n&quot;We decided that having banished the bad guys diminished the running and noise level but, also, the pretend play and energy within the classroom. No more extravagant stories were being told and the group of boys who so passionately desired the bad guys were having more difficulty sustaining long periods of play,&quot; researchers wrote. <br/>\n<br/>\nAs I mentioned earlier, when my son got his first-ever toy gun, I was appalled and irrationally feared it might turn him into a mass murderer--even though there isn&#39;t any research indicating that young boys who play with toy weapons become serial killers. <br/>\n<br/>\nFor advice, I sent an email to Thompson, who is known for his understanding of boy behavior. <br/>\n<br/>\nHe wrote me back: &quot;Why do boys shoot their mothers? My answer is that a boy&#39;s mother gets to see everything he is proud of or excited about; she is his first and best audience. But why does he shoot at you? Doesn&#39;t he love you? Yes, of course he loves you, and doesn&#39;t really want to hurt you. He&#39;s playing and he is quite confident that his actions won&#39;t really hurt you. After all, he knows that it isn&#39;t a real gun. He just wants to see you react to his imagined power.&quot;<br/>\n<br/>\nI have to wonder if Mark&#39;s sons noticed those three girls eying their swordplay and if they heightened the intensity of their battle in an effort to show off<br/>\n<br/>\n<br/>\n<br/>\nRead more: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sfgate.com/cgi-bin/blogs/sfmoms/detail?entry_id=71776#ixzz0ytrvTid9\">http://www.sfgate.com/cgi-bin/blogs/sfmoms/detail?entry_id=71776#ixzz0ytrvTid9</a></div>","specialLinks":[]}],"prevTopicId":57032,"nextTopicId":57150}}