{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":135098343,"authorName":"Peggy","from":"Peggy &lt;durrell@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Vonnegut at 80","postDate":"1042940467","msgId":55568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMkEwMjMzLjZBMkZCODdBQGFpdGFjY2Vzcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":55567,"nextInTime":55569,"topicId":55568,"numMessagesInTopic":0,"msgSnippet":"He still hasn t lost his edge. Peggy From: http://www.alternet.org/story.html?StoryID=14919 Vonnegut at 80 By David Hoppe, NUVO January 10, 2003 Asked how he s","messageBody":"<div id=\"ygrps-yiv-2037310273\">He still hasn&#39;t lost his edge. <br/>\n<br/>\nPeggy<br/>\n<br/>\nFrom:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.alternet.org/story.html?StoryID=14919\">http://www.alternet.org/story.html?StoryID=14919</a><br/>\n<br/>\nVonnegut at 80<br/>\nBy David Hoppe, NUVO<br/>\nJanuary 10, 2003<br/>\n<br/>\nAsked how he&#39;s doing, Kurt Vonnegut says, &quot;I&#39;m mad about being old<br/>\nand I&#39;m mad about being American. Apart from that, OK.&quot; <br/>\n<br/>\nVonnegut has just turned 80. Although he claims he&#39;s retired from<br/>\nwriting, he has just finished an introduction for a book of anti-war<br/>\nposters by artist Micah Ian Wright. Vonnegut continues to be a<br/>\ncultural presence, speaking out against war with Iraq to 10,000<br/>\nprotestors at a rally in New York&#39;s Central Park and making a<br/>\nspoken-word contribution to the new multimedia world music<br/>\nproduction, One Giant Leap. <br/>\n<br/>\nWhile Vonnegut has always owned his Indianapolis sense of place, he<br/>\nhas seemed less interested in grounding himself to a particular<br/>\nlocale than in using place as a portal to some greater, universal<br/>\nunderstanding of life. Vonnegut has long argued that we are,<br/>\nultimately, planetary citizens -- whether we realize it or not. <br/>\n<br/>\nAs extraordinarily popular as Vonnegut&#39;s work has proved to be -<br/>\nvirtually everything he&#39;s written is still in print -- he&#39;s hardly a<br/>\nbringer of reassuring tidings. History, he seems to suggest, is<br/>\nimportant not, as per Santyana, so that we can avoid past mistakes,<br/>\nbut as a predictor of what we corrupt souls are likely to do to one<br/>\nanother. <br/>\n<br/>\nVonnegut, after all, is an avant-garde artist, whose &quot;aggressively<br/>\nunconventional&quot; (his words) approach to storytelling would likely<br/>\nput readers off if it weren&#39;t for the wryly aphoristic,<br/>\nconversational tone of his voice. He has said he learned to<br/>\neffectively write the way he talked by having to phone in stories<br/>\nduring his days as a reporter for the Chicago News Bureau. <br/>\n<br/>\nKurt Vonnegut recently took some time to talk from his home in New<br/>\nYork City about how he thinks things are going these days: <br/>\n<br/>\nIn 1991, you spoke to the Wordstruck Festival in Indianapolis right<br/>\nafter the end of the Gulf War against Iraq. During your speech you<br/>\nremarked on television footage you&#39;d seen of Iraqi soldiers who&#39;d<br/>\nbeen taken prisoner and said, &quot;Those men are my brothers.&quot; <br/>\n<br/>\nVonnegut: All soldiers are. <br/>\n<br/>\nAnd here we are on the brink of another war with Iraq. <br/>\n<br/>\nI don&#39;t want to belong to a country that attacks little countries. I<br/>\ndon&#39;t want to belong to that kind of a country. I wrote a piece for<br/>\n7 Stories Press here in New York. They&#39;re about to publish a book of<br/>\nanti-war posters by a guy nobody&#39;s heard of before -- he&#39;s a pretty<br/>\ngood artist and so I was asked to write a piece for it. Would you<br/>\nlike me to read it? <br/>\n<br/>\nPlease. <br/>\n<br/>\n(Reading) &quot;These anti-war posters by Micah Ian Wright are<br/>\nreminiscent in spirit of works by artists like Kathe Kollwitz and<br/>\nGeorg Grosz and on and on during the 1920s, when it was becoming<br/>\never more evident that the infant German democracy was about to be<br/>\nmurdered by psychopathic personalities -- hereinafter P.P.s -- the<br/>\nmedical term for smart, personable people who have no conscience.<br/>\nP.P.s are fully aware of how much suffering their actions will<br/>\ninflict on others but do not care. They cannot care. <br/>\n<br/>\n&quot;The classic medical text about how such attractive leaders bring us<br/>\ninto unspeakable calamities is The Mask of Sanity by Dr. Hervey<br/>\nCleckley. An American P.P. at the head of a corporation, for<br/>\nexample, could enrich himself by ruining his employees and investors<br/>\nand still feel as pure as the driven snow. A P.P., should he attain<br/>\na post near the top of our federal government, might feel that<br/>\ntaking the country into an endless war with casualties in the<br/>\nmillions was simply something decisive to do today. So to bed. <br/>\n<br/>\n&quot;With a P.P., decisiveness is all. Or, to put it another way, we now<br/>\nhave a Reichstag fire of our own.&quot; <br/>\n<br/>\nWhat&#39;s become of conscience? <br/>\n<br/>\nAgain, as Cleckley says, these people are around and do rise. Women<br/>\nare attracted to them. I mean, this is a defect, but women are<br/>\nattracted to them because they are so confident. They really don&#39;t<br/>\ngive a fuck what happens - not even to themselves. But this is a<br/>\nserious defect and, no, we haven&#39;t been invaded and conquered by<br/>\nMartians. We have been conquered by psychopathic personalities who<br/>\nare attractive. <br/>\n<br/>\nHas television played a part in this? <br/>\n<br/>\nWe have no idea what technology has done to us. Last night I went to<br/>\na party for Gordon Parks, a black genius. Walter Cronkite was there.<br/>\nCronkite&#39;s an old friend. I said to him, &quot;You know, the country you<br/>\ndid so much to shape seems so shapeless now.&quot; One thing about TV is<br/>\nyou don&#39;t have to do anything ... <br/>\n<br/>\nWe become spectators. <br/>\n<br/>\nYes. And that&#39;s enough. We&#39;re thanked for that: &quot;Thank You For<br/>\nWatching ...&quot; (laughs) <br/>\n<br/>\nRatings are becoming more important than votes. <br/>\n<br/>\nWell, technology has fucked us up in many ways. What I&#39;ve said about<br/>\nthe computer revolution is that it&#39;s allowed white collar criminals<br/>\nto do what the Mob would have loved to do -- put a pawn shop and a<br/>\nloan shark in every home! <br/>\n<br/>\nTechnology changes us, yet it&#39;s very difficult for us to recognize<br/>\nthe changes because we&#39;re in their midst. <br/>\n<br/>\nOf course it does. Life asks us for this and asks us for that: Go<br/>\nget yourself some food. You have tasks, it turns out, in order to<br/>\nget satisfied. But you don&#39;t have to do them now. You can sit at<br/>\nhome and it&#39;s simply done to you. So we&#39;re not terribly interesting<br/>\nanimals anymore. <br/>\n<br/>\nYou&#39;ve talked about how the Bush Administration seems driven by<br/>\nrevenge. <br/>\n<br/>\nIt&#39;s a story to tell. He&#39;s in the same business I&#39;m in. He&#39;s telling<br/>\nstories. It turns out this is the simplest of all stories to tell. I<br/>\nmean, I want to hold attention when I write something. What he wants<br/>\nto be is interesting. And revenge is interesting. I&#39;ve said there<br/>\nare two radical ideas that have been introduced into human thought.<br/>\nOne of them is that energy and matter are pretty much the same sort<br/>\nof stuff. That&#39;s Einstein. The other is that revenge is a bad idea.<br/>\nIt&#39;s an enormously popular idea but, of course, Jesus came along<br/>\nwith the radical idea of forgiveness. That was radical. If you&#39;re<br/>\ninsulted, you have to square accounts. So this invention by Jesus is<br/>\nas radical as Einstein&#39;s. <br/>\n<br/>\nYou&#39;ve placed a high premium on what you call decency. <br/>\n<br/>\nOne kid said he had the key to all my books and he put it in a<br/>\nsentence. He said, &quot;Love may fail but courtesy will prevail.&quot; Love<br/>\ndoes fail all the time, you know, and it makes people vicious. <br/>\n<br/>\nThat&#39;s interesting because it seems that psychopathic personalities<br/>\ntend to give courtesy a bad rap. They find it weak. <br/>\n<br/>\nThey are decisive. They are gonna do something every fuckin&#39; day and<br/>\nthey are not afraid. <br/>\n<br/>\nYou&#39;ve used satire as a tool to defend against the world&#39;s insanity.<br/>\nCan it also work to change things? <br/>\n<br/>\nI guess it works some. Just telling people, &quot;You are not alone.<br/>\nThere are a lot of others who feel as you do.&quot; We&#39;re a terribly<br/>\nlonesome society. For all I know, all societies are. You can make a<br/>\nfew new friends, that&#39;s all. You can&#39;t change history. History is<br/>\nhappening to us now. George Bush has hydrogen bombs if he needs<br/>\nthem. It really matters who&#39;s around and who&#39;s holding attention. I<br/>\ndon&#39;t think television will let anybody else hold attention. <br/>\n<br/>\nWhy is that? <br/>\n<br/>\nDuring the Vietnam War, which lasted longer than any war we&#39;ve ever<br/>\nbeen in -- and which we lost -- every respectable artist in this<br/>\ncountry was against the war. It was like a laser beam. We were all<br/>\naimed in the same direction. The power of this weapon turns out to<br/>\nbe that of a custard pie dropped from a stepladder six feet high.<br/>\n(laughs) <br/>\n<br/>\nPowers Hapgood was an internationally known Indianapolis radical and<br/>\nsocialist. You met him didn&#39;t you? <br/>\n<br/>\nOh, yes. He was an official of the CIO then. He was a typical<br/>\nHoosier idealist. Socialism is idealistic. Think of Eugene Debs from<br/>\nTerre Haute. What Debs said echoes the Sermon on the Mount: &quot;As long<br/>\nas there&#39;s a lower class I am in it. As long as there is a criminal<br/>\nelement, I am of it. As long as there is a soul in prison, I am not<br/>\nfree.&quot; <br/>\n<br/>\nNow why can&#39;t the religious right recognize that as a paraphrase of<br/>\nthe Sermon on the Mount? Hapgood and Debs were both middle-class<br/>\npeople who thought there could be more economic justice in this<br/>\ncountry. They wanted a better country, that&#39;s all. Hapgood&#39;s family<br/>\nowned a successful cannery in Indianapolis<br/>\nand Hapgood turned it over to the employees, who ruined it. He led<br/>\nthe pickets against the execution of Sacco and Vanzetti. Hapgood was<br/>\ntestifying in court in Indianapolis about some picket-line dust-up<br/>\nconnected with the CIO and the judge stops everything. He says, &quot;Mr.<br/>\nHapgood, here you are, you&#39;re a graduate of Harvard and you own a<br/>\nsuccessful business. Why would anyone with your advantages choose to<br/>\nlive as you have?&quot; Powers Hapgood actually became a coal miner for a<br/>\nwhile. His answer to the judge was great: &quot;The Sermon on the Mount,<br/>\nsir.&quot; <br/>\n<br/>\nMy God, the religious right will not acknowledge what a merciful<br/>\nperson Jesus was. <br/>\n<br/>\nWhy are they so intent on making god a punisher? <br/>\n<br/>\nBecause they enjoy punishment. It&#39;s a form of entertainment. The<br/>\nreason we still have the death penalty in this country is because<br/>\nit&#39;s a major form of entertainment -- a way of holding attention. <br/>\n<br/>\nYou left Indianapolis for the East Coast. But you&#39;ve also said<br/>\nthere&#39;s good reason for staying put. <br/>\n<br/>\nYou leave home because of lonesomeness, no spiritual reason. You&#39;re<br/>\nnot going to be able to have shop talk. So you&#39;re going to be<br/>\nterribly lonesome. So yes, you go to Greenwich Village or somewhere<br/>\nelse where people are talking all the time. The turning point in my<br/>\nlife, even though I was an established writer, was when I went to<br/>\nthe Writer&#39;s Workshop at the University of Iowa. We were talking<br/>\nabout literature all the time! On Cape Cod there was nobody for me<br/>\nto talk to. It&#39;s a very simple social reason. Of course, I&#39;ve also<br/>\nsaid the more provincial a story is, the more universal it becomes.<br/>\nThat just happens to be true. <br/>\n<br/>\nWhy is that? Attention to detail? <br/>\n<br/>\nYes. It&#39;s going to be a totally human story which people are going<br/>\nto recognize as such and so they&#39;ll resonate with it. I mean: Madame<br/>\nBovary - how provincial can you get? <br/>\n<br/>\nYour work moves people across generations. How do you account for<br/>\nthat? <br/>\n<br/>\nI don&#39;t have to. All I know is it happened. <br/>\n<br/>\nDavid Hoppe is associate/arts editor of Nuvo, a weekly newspaper in<br/>\nIndianapoli</div>","specialLinks":[]}],"prevTopicId":55567,"nextTopicId":55455}}