{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: When I want to go and they want to stay","postDate":"1298503160","msgId":60051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwMjBFQTVBLTdENjAtNDc2Ni1CNjEwLTFDMzRBQTY5NzdDNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlrNDM5OStjdjhjQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrNDM5OStjdjhjQGVHcm91cHMuY29tPg=="},"prevInTopic":60050,"nextInTopic":0,"prevInTime":60050,"nextInTime":60052,"topicId":60029,"numMessagesInTopic":0,"msgSnippet":"-=-As Sandra pointed out, I gave too much detail. -=- The too much detail comment was in hopes that people wouldn t go on about the particulars of any","messageBody":"<div id=\"ygrps-yiv-43629727\">-=-As Sandra pointed out, I gave too much detail. -=-<br/>\n<br/>\nThe &quot;too much detail&quot; comment was in hopes that people wouldn&#39;t go on about the particulars of any certain conference.  I would rather keep to principles than particulars.  I don&#39;t want to criticize any conference or list in particular, though I don&#39;t mind if we talk about WHY a situation might be awkward or what could be done to prevent similar situations in the future.  <br/>\n<br/>\nSometimes most of a conference is great, but there&#39;s one problematical aspect.  It doesn&#39;t make the conference (or future conferences by the same organizers) something to avoid, but it&#39;s fine to discuss what could be done differently by organizers of other conferences, or attendees at conferences.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: When I want to go and they want to stay","postDate":"1298501737","msgId":60050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrNDM5OStjdjhjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlrM2R1disyb3BuQGVHcm91cHMuY29tPg=="},"prevInTopic":60049,"nextInTopic":60051,"prevInTime":60049,"nextInTime":60051,"topicId":60029,"numMessagesInTopic":0,"msgSnippet":"... As Sandra pointed out, I gave too much detail. The amount of detail I gave made it seem like my concern was more about the event than the nature of the","messageBody":"<div id=\"ygrps-yiv-38003598\"><blockquote><span title=\"ireply\">&gt;&gt; Well, I was also at this event and I saw different things. &lt;&lt;<br/>\n<br/>\n </span></blockquote>As Sandra pointed out, I gave too much detail. <br/>\n<br/>\nThe amount of detail I gave made it seem like my concern was more about the event than the nature of the interaction with my son, and my worry that I would handle things no better in the future.<br/>\n<br/>\nSorry for muddling the issue.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It&#39;s not not clear to me if the young one wanted to participate or just watch. &lt;&lt;<br/>\n<br/>\n </span></blockquote>The 5YO and 2YO wanted very much to leave. The 5YO probably could have been convinced to watch from the sidelines, but the 2YO would no longer be put down, leaving me unable to assist my 8YO who most definitely was NOT content to watch.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Or, you could have had the young one go back with another family who was going back and stayed with the older one, or gone back with the young one and left the older one with someone to keep an eye on him. &lt;&lt;<br/>\n<br/>\n </span></blockquote>Typically the type of thing we do, but in this instance, not really an option for a variety of reasons.<br/>\n<br/>\nSandra&#39;s suggestion to invite him TO DO something rather than to insist that he LEAVE something was exactly what I was looking for, and exactly what I was unable to think about in the moment. A similar situation -- his two sisters want to leave and he wants to stay -- will inevitably come up, so I&#39;d be thrilled to have more suggestions for navigating it with a bit more grace.<br/>\n<br/>\n-Angela</div>","specialLinks":[]},{"userId":71714187,"authorName":"Linda","from":"&quot;Linda&quot; &lt;playingwith3@...&gt;","profile":"playingwith3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: When I want to go and they want to stay","postDate":"1298479903","msgId":60049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrM2R1disyb3BuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlrMThwayt1MWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":60037,"nextInTopic":60050,"prevInTime":60048,"nextInTime":60050,"topicId":60029,"numMessagesInTopic":0,"msgSnippet":"Well, I was also at this event and I saw different things.  The acoustics were terrible in the site and no one knew that before hand. I  was sitting in the","messageBody":"<div id=\"ygrps-yiv-1358282278\">Well, I was also at this event and I saw different things.  The acoustics were terrible in the site and no one knew that before hand. I  was sitting in the back with a bunch of people and we had to keep asking each other what the performers were saying.  It&#39;s no wonder some of the kids got bored and started playing around.  The talent show took an intermission so there wouldn&#39;t be a conflict between the performers and the people playing tug a war and frisbee and such.  Some kids took this opportunity to go up on stage and fool around and talk into the mic and stuff.  I thought it was responsive to the audience to go with what the majority wanted to do (play tug of war) and it was kind of cool that some of the kids, who may have been too shy to &quot;perform&quot; took the opportunity to go on stage and do their thing.<br/>\n<br/>\nI saw the tug of war get larger and larger.  Because that&#39;s what the participants wanted.  There was still plenty of room for observers to get out of the way.  It sounded as if the 8 year old was having a great time and you were making sure he was safe.  Some people really like rough play like that and an opportunity for them to participate in that is a good thing.  I can think of an example of this with myself even.  When I was a young adult, I used to go to these punk rock clubs and go into the mosh pit.  I was a fairly pettite person and the other dancers tended to be very large men with spikes and leather and steel toed boots.  I got tossed around there a lot.  Most of my friends just noticed how much fun I was having and admired my bruises the next day.  My friends who tried to protect me and keep me away from this dancing that was sure to hurt me were not appreciated and did not come back with me.  I just loved the whole scene.  And now I&#39;m pretty normal and tend to be pretty cautious.   But that is what I wanted to do at the time.  My kids take a trampoline and gymnastics class and get some of the same physical sensations, minus the gay abandon.<br/>\n<br/>\nI can see where you might have been concerned about you two year old, though.  It&#39;s not not clear to me if the young one wanted to participate or just watch.  You could have stood in a corner or on stage or on the steps up to the stage where it was safe and kept an eye on the older one, who was enjoying himself, and staying out of the way of the people who were playing the game.  From this safe place you could have observed the good time people were having and had a kind of vicarious thrill yourself.  Or, you could have had the young one go back with another family who was going back and stayed with the older one, or gone back with the young one and left the older one with someone to keep an eye on him.  Or, like some one else just said, find something fun to do, either in the building, just outside where there was light, or back at the lodge that both kids would enjoy.  Or done what you did just because the whole thing made you so uncomfortable and that happens sometimes.<br/>\n<br/>\nFrom my perspective, though, there were a whole lot of people having a whole lot of fun at that event - kids and parents.  Many parents were right in there playing tug of war, too.  So you can&#39;t say that there was neglect going on.  People enjoyed it.  Often people get uncomfortable when they see others having that kind of good time.  I don&#39;t think that, in every case, the raucous revelers should stop because a few people are uncomfortable with it.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; But when it came to tug-o-war in middle of the audience of the talent show, we were not. My 8YO was none too pleased, and no amount of explaining how unsafe or how rude I thought the situation was to those performing could sway him. There would be situations where I would say, &quot;You can stay by yourself,&quot; but several factors -- the long walk across the dark field, the fact that I&#39;d had to go and untangle him from the ropes twice (serious, four-way tug-o-war ropes with a metal link in the middle), people trying to watch were getting trampled -- made it so this wasn&#39;t one of those situations...<br/>\n&gt; <br/>\n&gt; But basically I over ruled him. He was pretty insistent that he wanted to stay, so I don&#39;t really remember how I did that. I may have threatened some punishment. We finally left, but he wasn&#39;t happy. I wasn&#39;t happy. It was a LONG walk across that field. But I had nothing better in my arsenal at the time. And honestly, I don&#39;t know that I do now, either.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When I want to go and they want to stay","postDate":"1298426062","msgId":60037,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDMTU2NURFLUY4RTQtNDI5Ri1CRjMwLTFCRTYxMTMwRkE0NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlrMThwayt1MWxtQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrMThwayt1MWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":60034,"nextInTopic":60049,"prevInTime":60036,"nextInTime":60038,"topicId":60029,"numMessagesInTopic":0,"msgSnippet":"-=- This isn t fair! all the way across that field. -=-Thoughts?-=- Too much detail was my first thought. :-) Sometimes things don t go perfectly well at a","messageBody":"<div id=\"ygrps-yiv-1337518048\">-=-&quot;This isn&#39;t fair!&quot; all the way across that field.<br/>\n<br/>\n-=-Thoughts?-=-<br/>\n<br/>\nToo much detail was my first thought. :-)<br/>\n<br/>\nSometimes things don&#39;t go perfectly well at a conference, but rather than analyze the exact problem, it&#39;s better to move toward the principles involved.<br/>\n<br/>\nThat particular night involved mud, bad acoustics and pitch darkness.<br/>\n<br/>\nIn general, though, it&#39;s good to try to take kids toward something rather than away.  If you could&#39;ve found another family and said &quot;Let&#39;s all go do COOL FUN SOMETHING (a game, a snack, a something-somewhere-else), it would&#39;ve been a happy project rather than an early departure.<br/>\n<br/>\nAnd of course (as you mentioned in the other e-mail) helping make future gatherings safer and more peaceful is good, too!<br/>\n<br/>\nNot everything can be perfect.  Nothing can be perfect.  We can just aim toward &quot;better.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When I want to go and they want to stay","postDate":"1298420912","msgId":60034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5MjU5MC4xNTY5Ni5xbUB3ZWIxMTA0MDIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGlrMThwayt1MWxtQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrMThwayt1MWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":60029,"nextInTopic":60037,"prevInTime":60033,"nextInTime":60035,"topicId":60029,"numMessagesInTopic":0,"msgSnippet":"***the fact that I d had to go and untangle him from the ropes twice (serious, four-way tug-o-war ropes with a metal link in the middle), people trying to ","messageBody":"<div id=\"ygrps-yiv-259865458\">***the fact that I&#39;d had to go and untangle him from the ropes twice (serious, <br/>\nfour-way tug-o-war ropes with a metal link in the middle), people trying to <br/>\nwatch were getting trampled -- made it so this wasn&#39;t one of those situations...<br/>\n<br/>\nBut basically I over ruled him. He was pretty insistent that he wanted to stay, <br/>\nso I don&#39;t really remember how I did that. I may have threatened some <br/>\npunishment. We finally left, but he wasn&#39;t happy. I wasn&#39;t happy. It was a LONG <br/>\nwalk across that field. But I had nothing better in my arsenal at the time. And <br/>\nhonestly, I don&#39;t know that I do now, either.***<br/>\n<br/>\nThat&#39;s also an issue that should have been a concern of other parents too.  It <br/>\nobviously involved more than just your kid.  In ANY situation that I&#39;ve been in, <br/>\nwith unschooled kids or not, where there are parents absent from the scene and <br/>\nthere are problems brewing, I can step in and DO something about it.  You can <br/>\nget involved and change the game entirely and create a safe game that is still <br/>\nloads of fun without disturbing whatever is going on onstage or whoever is <br/>\nwatching.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"When I want to go and they want to stay","postDate":"1298409076","msgId":60029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrMThwayt1MWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":60034,"prevInTime":60028,"nextInTime":60030,"topicId":60029,"numMessagesInTopic":0,"msgSnippet":"Posting about my experience at a conference last year brought up something about which I could use some advice: ... My deciding to leave was all well and good,","messageBody":"<div id=\"ygrps-yiv-1931315224\">Posting about my experience at a conference last year brought up something about which I could use some advice:<br/>\n<br/>\nWhat I said was:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The campfire was one of a handful of situations at the conference that made me very uncomfortable, and in which I was unsure the best action to take other than to just leave. I didn&#39;t leave the conference itself, but I left the individual activities. I explained best I could to my children why I was uncomfortable.&lt;&lt;<br/>\n<br/>\n </span></blockquote>My deciding to leave was all well and good, but I had three children in tow. We were in agreement about about the campfire: they were uncomfortable, too, and were happier to leave and play kickball and play on the swings than to risk getting burned and not be able to hear the storyteller. <br/>\n<br/>\nBut when it came to tug-o-war in middle of the audience of the talent show, we were not. My 8YO was none too pleased, and no amount of explaining how unsafe or how rude I thought the situation was to those performing could sway him. There would be situations where I would say, &quot;You can stay by yourself,&quot; but several factors -- the long walk across the dark field, the fact that I&#39;d had to go and untangle him from the ropes twice (serious, four-way tug-o-war ropes with a metal link in the middle), people trying to watch were getting trampled -- made it so this wasn&#39;t one of those situations...<br/>\n<br/>\nBut basically I over ruled him. He was pretty insistent that he wanted to stay, so I don&#39;t really remember how I did that. I may have threatened some punishment. We finally left, but he wasn&#39;t happy. I wasn&#39;t happy. It was a LONG walk across that field. But I had nothing better in my arsenal at the time. And honestly, I don&#39;t know that I do now, either.<br/>\n<br/>\nI&#39;m pretty good at navigating leaving at the end of an activity or day with friends. I&#39;m good with allowing more time and not planning too many things on top of each other so that end times don&#39;t need to be so hard and fast, or so one child isn&#39;t aching to get somewhere new while the other is aching to stay. I understand how rest, nourishment, etc. play into moods, cooperation, etc.<br/>\n<br/>\nBut in a situation like this where I felt a true need to get out of there, but my 8YO was very focused on what looked like fun -- even though he had gotten the wind knocked out of him and been stepped on -- and that &quot;everybody else is doing it!&quot; ... what&#39;s there to do _other than_ to over rule?<br/>\n<br/>\nIn the moment, things like &quot;If I were the one up there performing, I would be very upset that people were making so much noise and not paying attention,&quot; or, &quot;I don&#39;t feel safe being here with your [2YO] little sister,&quot; made no impression. They did later, but there was a whole lot of &quot;This isn&#39;t fair!&quot; all the way across that field.<br/>\n<br/>\nThoughts?</div>","specialLinks":[]}],"prevTopicId":59818,"nextTopicId":60055}}