{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":99252750,"authorName":"scookeafan","from":"&quot;scookeafan&quot; &lt;sherrycook@...&gt;","profile":"scookeafan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleased to find Sandra Dodd","postDate":"1069159236","msgId":17379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwZDQwNCtkNGl0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJwYWpxMCs2OGI0QGVHcm91cHMuY29tPg=="},"prevInTopic":17368,"nextInTopic":0,"prevInTime":17378,"nextInTime":17380,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"... Norma, Would you mind posting the name and addresses (or at least area of Cincinnati) of the Russian store and the tobacco store? Thanks, Sherry","messageBody":"<div id=\"ygrps-yiv-129594086\">Norma wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And we have discovered lots of neat little hidden resources, <br/>\n&gt; like the Russian store where one can buy all things Russian, and the <br/>\n&gt; little Mexican place called Miscellaneous Rodriguez where we can get <br/>\n&gt; some of our favorite foods.  Or the little tobacco store we stumbled <br/>\n&gt; on that has great empty wooden cigar boxes for sale for a dollar or <br/>\n&gt; two for lots of neat projects.  <br/>\n<br/>\n </span></blockquote>Norma,<br/>\n<br/>\nWould you mind posting the name and addresses (or at least area of<br/>\nCincinnati) of the Russian store and the tobacco store?<br/>\n<br/>\nThanks,<br/>\nSherry</div>","specialLinks":[]},{"userId":9309534,"authorName":"Norma","from":"&quot;Norma&quot; &lt;athomeopathy@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleased to find Sandra Dodd","postDate":"1069105046","msgId":17368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwYmYybis2ZG9qQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1ZS4yN2U0MTA2MS4yY2VhNmVmZkBhb2wuY29tPg=="},"prevInTopic":17367,"nextInTopic":17379,"prevInTime":17367,"nextInTime":17369,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"Tuck: No need to reframe.  It is easier with mountains, at least mountains like there are in Albuquerque, where the mountains form a clear border to the east","messageBody":"<div id=\"ygrps-yiv-1961339656\">Tuck:<br/>\n<br/>\nNo need to reframe.  It is easier with mountains, at least mountains <br/>\nlike there are in Albuquerque, where the mountains form a clear <br/>\nborder to the east rising almost another mile above the city.  So you <br/>\nalways know where east is.  And they stick up nice and high above <br/>\neverything else, since Albuquerque is built on a flood plain.  Plus <br/>\nAlbuquerque is laid out on a nice grid system with streets labeled by <br/>\nquadrants, NE, SE, NW, SW.  Very easy to get around.  In addition the <br/>\nnormally clear skies allow you to see those mountains 99% of the <br/>\ntime.  <br/>\n<br/>\nI can&#39;t really say why people don&#39;t get around much in Cincinnati.  <br/>\nBut I meet people all the time who just don&#39;t get far from their home <br/>\nturf.  Neighborhoods are very divided here, very separate. And you <br/>\nmust have a car here, since mass transit is nearly non-existant, and <br/>\ngrocery stores are not very convenient.  But I do know that streets <br/>\nthat change names all the time, and lots of missing signs contribute <br/>\nto the confusion.   I meet lots of homeschoolers who determine what <br/>\nthey will do solely on how close it is to home.  Not that I blame <br/>\nthem because traffic can be a killer around here.  But that is true <br/>\nin lots of places. <br/>\n<br/>\nYou said:  &lt;&gt;What you basically said was that people in Ohio isolated <br/>\nthemselves because it was too hard to get around without mountains. I <br/>\njust kinda find this attitude arrogant and insulting.  I&#39;m not from <br/>\nOhio, btw.&lt;&gt;<br/>\n<br/>\nI do not need other people translating what I said.  I said that *I* <br/>\nfind it more difficult to get around without mountains.  And without <br/>\na grid system.  And without street signs.  And with streets that <br/>\nconstantly change names.  What happens to anyone else is not my <br/>\nproblem, just that people I meet here say they don&#39;t seem to get <br/>\naround much here. <br/>\n<br/>\nYou said:  &lt;&gt;What if I said, it&#39;s harder to do it that way, so I <br/>\nguess that makes people without mountains more adaptive and <br/>\nintelligent than people with mountains.&lt;&gt;<br/>\n<br/>\nAnd you might be right!  At least relating to that particular kind of <br/>\nintelligence.  Like rats who run complex mazes.  I simply do not like <br/>\nto spend so much of my time figuring out the maze.  I would rather be <br/>\ndoing other things.  I&#39;m a pretty good navigator.  I have traveled <br/>\naround a good percentage of the world and navigated just fine, though <br/>\nnever by boat, at least not for a long journey.  But I find <br/>\nCincinnati to be one of the most confusing cities.  Could very well <br/>\nbe my personal failing, for I do prefer mountains.  I also know of <br/>\nfolks in NYC who found themselves disoriented when the WTC towers <br/>\nwere gone, because they used them, much like mountains, to help them <br/>\nnavigate that city.  But I grew up, learned to drive and navigate, in <br/>\nDetroit.  And some folks think that is a very difficult city to get <br/>\naround.  But it is an auto city, designed for the car.<br/>\n<br/>\nYou transmitted:  &lt;&gt;Maybe you should reframe your stance about lack <br/>\nof mountains into the attitude that most newcomers and non-natives <br/>\nhave about their area--that of not understanding how it&#39;s done in the <br/>\nnew area or pining away for the &quot;better&quot; things and ways of home.&lt;&gt;<br/>\n<br/>\nNew Mexico was &quot;home&quot; for 27 years, but the 26 before that I lived in <br/>\nmy native state, Michigan.  I navigated just fine there, but still <br/>\nprefer Albuquerque.<br/>\n<br/>\n&lt;&gt;Maybe it&#39;s not lack of mountains to navigate by, but a natural <br/>\nlonging for the familiarity of what you had, and what was &quot;easier&quot; <br/>\nbecause you knew it from birth.&lt;&gt;<br/>\n<br/>\nDefinitely longing for what was easier.  Why not?  I do not enjoy <br/>\ndriving around in circles, wasting time and gas, especially at <br/>\ntoday&#39;s gas prices.  Especially at night when &quot;adventuring&quot; can get <br/>\ndicey at times.  I just think that Albuquerque, despite its problems, <br/>\nis a better planned city.  Cincinnati, a city originally settled by <br/>\ncarpetbaggers and slave traders and other assorted scoundrels, is on <br/>\nthe other hand, predominantly controlled by the interests of certain <br/>\ncorporations whose home offices are located here.  What does and what <br/>\ndoes not happen here is often determined by whether it will serve <br/>\ntheir corporate interests.  And the taxpayers end up paying for it.  <br/>\nI know that happens elsewhere, too.  But it is annoying.  Exits on <br/>\nthe highways are determined by how well they will work for certain <br/>\ncorporate entities.  If you get off the freeway along certain long <br/>\nurban stretches you will not be able to get back on.  Because these <br/>\nexits were not designed for anyone else but those who work at or are <br/>\ndelivering goods to the corporations whose plants are located near <br/>\nthose exits.  Pity the poor tourist who loops off and then finds him <br/>\nor herself wandering around significantly lost. <br/>\n<br/>\n&lt;&gt;See how ridiculous that thinking is?&lt;&gt;<br/>\n<br/>\nOne person&#39;s ridiculous is another person&#39;s opus or chef d&#39;oeuvre, <br/>\nor, &quot;A foolish consistency is the hobgoblin of little minds,&quot; <br/>\n(Emerson).  To each his or her own.  I don&#39;t feel the need to insult <br/>\nanyone to express my opinion.  I like Albuqerque.  It is a friendly <br/>\ncity, I think.  Cincinnati is, generally, not.  Much more racist, <br/>\nvery &quot;neighborhood,&quot; very economically segregated.  The terrain here <br/>\nand the roads that access it have been designed to keep that kind of <br/>\nseparation going, most successfully, too.  My opinion.  That&#39;s all.<br/>\n<br/>\nNorma</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleased to find Sandra Dodd","postDate":"1069103191","msgId":17367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2LjQxYWFhN2U3LjJjZWE5MjU3QGFvbC5jb20+"},"prevInTopic":17364,"nextInTopic":17368,"prevInTime":17366,"nextInTime":17368,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/17/03 12:12:24 PM, tuckervill2@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1210752082\">In a message dated 11/17/03 12:12:24 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a> writes:<br/>\n<br/>\n&lt;&lt; What you basically said was that people in Ohio isolated themselves <br/>\nbecause <br/>\nit was too hard to get around without mountains. I just kinda find this <br/>\nattitude arrogant and insulting.  &gt;&gt;<br/>\n<br/>\nThere are places where people don&#39;t have to drive very far and so they don&#39;t. <br/>\n It would be kinda crazy.<br/>\n<br/>\nThere are places, like New Mexico, where the population is so sparsely spread <br/>\nover such a huge area that if you want to do things or get together with <br/>\npeople, you HAVE to drive a long way, and so people dno&#39;t think it&#39;s that big a <br/>\ndeal.  <br/>\n<br/>\nBecause people have moved here from other places and commented on it, I know <br/>\nit&#39;s unusual in much of the country.<br/>\n<br/>\nI have to drive three hours to see my sister.  It used to be only two hours.  <br/>\nThat&#39;s only really two towns away.  We still have to pass through the <br/>\ntwo-hour town now, and we pass through two REALLY small towns, Abiquiu and Tierra <br/>\nAmarilla to get to Brazos, which isn&#39;t really a town.<br/>\n<br/>\nFor Thanksgiving we&#39;ll drive four hours to get to Alamogordo.  We won&#39;t pass <br/>\nthrough another large town at all.  Places with one business which might not <br/>\nbe open.  Corona.  Carizozo.  There are two turns in all that 200+ miles that <br/>\nwe have to take to get to Alamogordo.<br/>\n<br/>\nThere are places where the road&#39;s high enough you can see the road for 50 <br/>\nmiles ahead of you.  We can tell we&#39;re making progress because mountains appear, <br/>\nloom larger, and eventually disappear behind us.  Otherwise, it&#39;s the same <br/>\nbarbed wire fences and the same cholla cactus with a few cows and a windmill for <br/>\na long, long time without anything but mountains to break up the monotony.<br/>\n<br/>\n&lt;&lt;What if I said, it&#39;s harder to <br/>\ndo it that way, so I guess that makd thing to say, but I doubt people would <br/>\njump on you about it.<br/>\n<br/>\n&lt;&lt;See how ridiculous that thinking is?  Maybe you should reframe your stance <br/>\nabout lack of mountains into the attitude that most newcomers and non-natives <br/>\nhave about their area--that of not understanding how it&#39;s done in the new <br/>\narea <br/>\nor pining away for the &quot;better&quot; things and ways of home.  Maybe it&#39;s not lack <br/>\nof mountains to navigate by, but a natural longing for the familiarity of <br/>\nwhat <br/>\nyou had, and what was &quot;easier&quot; because you knew it from birth. &gt;&gt;<br/>\n<br/>\nCould be some ofthose things, but it doesn&#39;t make it ridiculous.  I think it <br/>\nwas friendly humor rather than serious commentary.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleased to find Sandra Dodd","postDate":"1069094143","msgId":17364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZS4yN2U0MTA2MS4yY2VhNmVmZkBhb2wuY29tPg=="},"prevInTopic":17363,"nextInTopic":17367,"prevInTime":17363,"nextInTime":17365,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/17/2003 7:55:34 AM Central Standard Time, athomeopathy@hotmail.com writes: So much easier to get around out there! ~~~ I tried to make","messageBody":"<div id=\"ygrps-yiv-913470204\">In a message dated 11/17/2003 7:55:34 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:athomeopathy@...\">athomeopathy@...</a> writes:<br/>\nSo much easier <br/>\nto get around out there!<br/>\n~~~<br/>\n<br/>\n I tried to make light of it when I point it out, but I guess I&#39;ll just have <br/>\nto go ahead and say it right out.  <br/>\n<br/>\nWhat you basically said was that people in Ohio isolated themselves because <br/>\nit was too hard to get around without mountains. I just kinda find this <br/>\nattitude arrogant and insulting.  I&#39;m not from Ohio, btw.  <br/>\n<br/>\nI navigate by bodies of water that I can&#39;t even see 80% of the time and the <br/>\nslant of the sun and landmarks that I know, and the direction I just came.  I <br/>\ndo this in Ohio, Florida, California, Arkansas, Tennessee, Texas, St. Croix and <br/>\nlots of other places and wherever I&#39;ve been.  What if I said, it&#39;s harder to <br/>\ndo it that way, so I guess that makes people without mountains more adaptive <br/>\nand intelligent than people with mountains.  <br/>\n<br/>\nSee how ridiculous that thinking is?  Maybe you should reframe your stance <br/>\nabout lack of mountains into the attitude that most newcomers and non-natives <br/>\nhave about their area--that of not understanding how it&#39;s done in the new area <br/>\nor pining away for the &quot;better&quot; things and ways of home.  Maybe it&#39;s not lack <br/>\nof mountains to navigate by, but a natural longing for the familiarity of what <br/>\nyou had, and what was &quot;easier&quot; because you knew it from birth. <br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9309534,"authorName":"Norma","from":"&quot;Norma&quot; &lt;athomeopathy@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleased to find Sandra Dodd","postDate":"1069089940","msgId":17363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwYjBhaytncW85QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNhLjI0YTk2NzU5LjJjZWE1MTRlQGFvbC5jb20+"},"prevInTopic":17361,"nextInTopic":17364,"prevInTime":17362,"nextInTime":17364,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"... He drove until Marty had to say Dad! to keep him from going off the road. That woke me up (and the adrenaline came back) and I chipperly offered to","messageBody":"<div id=\"ygrps-yiv-1179623707\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n&lt;&gt;He drove until Marty had to say &quot;Dad!&quot; to keep him from going off <br/>\nthe road. That woke me up (and the adrenaline came back) and I <br/>\nchipperly offered to drive and let Keith sleep.  He was snoring <br/>\nbefore I pulled back on the road and whispered to Marty &quot;Get me a Dr <br/>\nPepper.&quot;&lt;&gt;<br/>\n<br/>\nMy husband worked at the State Pen near Santa Fe and there was many a <br/>\nnight when he said that whole stretches of that twisty-turny route <br/>\njust disappeared.  He&#39;d have no memory of driving them, but somehow <br/>\nhe always made it home alive.  Nothing short of a miracle after 16-24 <br/>\nhour mandatory overtime stints   <br/>\n<br/>\nThere&#39;s something very hypnotic about driving in NM, perhaps the <br/>\nopenness.  Here it&#39;s just the opposite.  Every stretch between exits <br/>\nis filled with heart-stopping insanity!  Is it any wonder that my 16-<br/>\nyear-old is vacillating about learning to drive?  We get up early on <br/>\nSunday mornings and head for big parking lots to get her started.  <br/>\nBut road driving may be best left up to the professionals here.  Let <br/>\nthem take the risk and the high anxiety.  She wants the freedom, but <br/>\nfears the crazy traffic.  She will work it out, I&#39;m sure.<br/>\n<br/>\nNorma </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleased to find Sandra Dodd","postDate":"1069086542","msgId":17361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhLjI0YTk2NzU5LjJjZWE1MTRlQGFvbC5jb20+"},"prevInTopic":17359,"nextInTopic":17363,"prevInTime":17360,"nextInTime":17362,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/17/03 6:55:34 AM, athomeopathy@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-658409598\">In a message dated 11/17/03 6:55:34 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:athomeopathy@...\">athomeopathy@...</a> writes:<br/>\n<br/>\n&lt;&lt; What I have learned is that lots of folks who live here never really <br/>\n<br/>\nleave their own little neighborhoods, never venture very far from <br/>\n<br/>\nwhere they feel secure.  That would be like the South Valley folks <br/>\n<br/>\nnever venturing to Winrock or Corrales folks never leaving the North <br/>\n<br/>\nValley.  &gt;&gt;<br/>\n<br/>\nI think there are some people like that.<br/>\n<br/>\nI&#39;ve heard there are people who live in New York City who have never seen the <br/>\nStatue of Liberty, and who have never driven a car, and some who&#39;ve never <br/>\neven BEEN in a car.<br/>\n<br/>\nCarlsbad Caverns, I didn&#39;t see until I was 28 or so, and we had relatives in <br/>\nCarlsbad we visited.  But they&#39;d all been, and my parents had been, and they <br/>\nfigured &quot;next time.&quot;<br/>\n<br/>\nI do my best touristing when I have out of town guests who want to go to <br/>\nSanta Fe or see a mountain from the top end. &lt;g&gt;<br/>\n<br/>\nThat view of Albuquerque from Nine Mile Hill, coming in from the West is SUCH <br/>\na welcome sight sometimes.    ANY lights are welcom sometimes.<br/>\n<br/>\nA week ago Saturday, Keith&#39;s car broke down 6 mile north of Cuba (N.Mex.) <br/>\nwhich is almost to Farmington, which is almost to Utah.   Marty and I left at <br/>\n8:30 to pick him up at a convenience store (which was going to close at 10:00).   <br/>\n<br/>\nI don&#39;t drive so well in the dark, and I was already tired, so I got Marty to <br/>\ngo with me to keep me awake, even though he was going to miss hanging out <br/>\nwith his friend Brett to do it.<br/>\n<br/>\nI nearly hit a deer.<br/>\n<br/>\nI had written down mile marker 12, and it was 112.   <br/>\n<br/>\nI was trying not to be a nervous adrenaline-loaded wreck when we found the <br/>\nplace and Keith was sitting huddled in the cold.  He had walked six miles (in <br/>\nhis medieval boots) to find a phone.  He hadn&#39;t taken his glasses with him, so <br/>\nhe couldn&#39;t even buy a newspaper to have something to read.  He had waited two <br/>\nand a half hours.  <br/>\n<br/>\nHe drove until Marty had to say &quot;Dad!&quot; to keep him from going off the road. <br/>\nThat woke me up (and the adrenaline came back) and I chipperly offered to <br/>\ndrive and let Keith sleep.  He was snoring before I pulled back on the road and <br/>\nwhispered to Marty &quot;Get me a Dr Pepper.&quot;   <br/>\n<br/>\nEven coming in from the north, and getting off at the Tramway exit, I was <br/>\nthrilled to see all those too-many lights and roads.<br/>\n<br/>\nBut from the west, the whole town looks like an aerial map and you can just <br/>\npoint at where you&#39;re headed.   People get used to such things. &lt;g&gt;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":9309534,"authorName":"Norma","from":"&quot;Norma&quot; &lt;athomeopathy@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleased to find Sandra Dodd","postDate":"1069077344","msgId":17359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwYWsxMCtkNmp2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJwOWNiMCttdWFyQGVHcm91cHMuY29tPg=="},"prevInTopic":17358,"nextInTopic":17361,"prevInTime":17358,"nextInTime":17360,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"... LOL!  In Cincinnati we call leaving the laundry overnight a science experiment !  Never know what lethal form of mold or mildew will be growing there next","messageBody":"<div id=\"ygrps-yiv-654302674\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;aicitticia&quot; &lt;ticiamama@h...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Then I remember (everytime I do laundry in fact) her analogy on <br/>\n&gt; leaving wet clothes in the washing machine. It went something like: <br/>\n&gt; What happens when you leave wet clothes in the washing machine and <br/>\n&gt; she answered her own question...nothing...well at my house, that <br/>\n&gt; is..they are actually pretty dry by the next day. But I hear in <br/>\n&gt; California they are all smelly the next day and mildew in even more <br/>\n&gt; humid states. <br/>\n<br/>\n </span></blockquote>LOL!  In Cincinnati we call leaving the laundry overnight a &quot;science <br/>\nexperiment&quot;!  Never know what lethal form of mold or mildew will be <br/>\ngrowing there next morning.  Even hanging clothes out can net strange <br/>\nresults here.<br/>\n<br/>\nNorma</div>","specialLinks":[]},{"userId":9309534,"authorName":"Norma","from":"&quot;Norma&quot; &lt;athomeopathy@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleased to find Sandra Dodd","postDate":"1069077120","msgId":17358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwYWpxMCs2OGI0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY1LjFjYTg1MzA1LjJjZTk2MGQwQGFvbC5jb20+"},"prevInTopic":17357,"nextInTopic":17359,"prevInTime":17357,"nextInTime":17359,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"... around all this ... Well, in southwestern Ohio (Cincinnati) they have Seven Hills, little hills, intertwined with lots of rivers.  These hills only succeed","messageBody":"<div id=\"ygrps-yiv-587468896\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, tuckervill2@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; In a message dated 11/16/2003 11:56:26 AM Central Standard Time, <br/>\n&gt; athomeopathy@h... writes:<br/>\n&gt; and that change names every so many blocks to <br/>\n&gt; be sure you don&#39;t know where you are (no mountains to guide you), <br/>\n&gt; ~~~<br/>\n&gt; Gee, I just don&#39;t know how people from Ohio have been getting <br/>\n </span></blockquote>around all this <br/>\n<blockquote><span title=\"ireply\"> &gt; time with NO mountains!  <br/>\n&gt; <br/>\n&gt; heehee.  <br/>\n&gt; <br/>\n&gt; Tuck<br/>\n<br/>\n </span></blockquote>Well, in southwestern Ohio (Cincinnati) they have Seven Hills, little <br/>\nhills, intertwined with lots of rivers.  These hills only succeed in <br/>\ninterrupting one&#39;s view enough so that getting anywhere is a guessing <br/>\ngame, at best.  Maps sometimes help, but not always.  Whenever we <br/>\nstart out for somewhere new we say we are going on an &quot;adventure.&quot;  <br/>\nThat way it doesn&#39;t really matter if we never find what we were <br/>\nlooking for.  We print out our Yahoo! maps and head out.<br/>\n<br/>\nAfter six years here we started off for a new ice rink the other <br/>\nnight, for figure skating ice, and spent 1-1/2 hours wandering <br/>\naround, asking at gas stations and Walgreen&#39;s to no avail.  I mean, <br/>\nyou&#39;d think it would be hard to hide an ice arena!  But the way the <br/>\nroads are designed contributes greatly to the maze effect. Finally we <br/>\narrived near the end of the skate session, frustrated.  One of the <br/>\nother moms totally sympathized with us, told us she had done the same <br/>\nthing her first time at this huge old arena.  And she had lived here <br/>\nall her life!  <br/>\n<br/>\nAt one time Cincinnati was trying to hype having the Olympics here, <br/>\nhad a big group raising funds to make that happen.  I got wind of <br/>\nthis and sent off a letter to the editor asking if they were trying <br/>\nto start World War III.  There would be so many foreign nationals <br/>\nwandering around, unable to find the Olympic venues, or their hotels, <br/>\nor restaurants, that surely an international incident would erupt!  <br/>\n<br/>\nWhat I have learned is that lots of folks who live here never really <br/>\nleave their own little neighborhoods, never venture very far from <br/>\nwhere they feel secure.  That would be like the South Valley folks <br/>\nnever venturing to Winrock or Corrales folks never leaving the North <br/>\nValley.  As newbies here, and unschoolers, we made a habit of taking <br/>\noff on &quot;adventures,&quot; usually with some specific vector in mind, but <br/>\noften ending up somewhere else entirely.  Consequently we have <br/>\nlearned to get around pretty well, better than many locals, at <br/>\nleast.  And we have discovered lots of neat little hidden resources, <br/>\nlike the Russian store where one can buy all things Russian, and the <br/>\nlittle Mexican place called Miscellaneous Rodriguez where we can get <br/>\nsome of our favorite foods.  Or the little tobacco store we stumbled <br/>\non that has great empty wooden cigar boxes for sale for a dollar or <br/>\ntwo for lots of neat projects.  This is great fun when you have the <br/>\ntime and aren&#39;t worried about getting somewhere for something.  <br/>\nOtherwise it is pure aggravation.  I keep seeing Albuquerque as we <br/>\nused to come in from the mountains (lived in Cedar Crest for 27 <br/>\nyears) or as it looks arriving on I-40 from the west.  So much easier <br/>\nto get around out there!<br/>\n<br/>\nNorma</div>","specialLinks":[]},{"userId":99944316,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;ikonstitcher@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleased to find Sandra Dodd","postDate":"1069045295","msgId":17357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCREQ5NjJGLjM3NkNGJWlrb25zdGl0Y2hlckBjb3gubmV0Pg==","inReplyToHeader":"PGZiLjRhMTEwNjkxLjJjZTk5MzYwQGFvbC5jb20+"},"prevInTopic":17356,"nextInTopic":17358,"prevInTime":17356,"nextInTime":17358,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"... I watched the film, Little Buddha, on TV this morning.  The moment in which Siddartha recognizes the path he should follow is contained in a scene where","messageBody":"<div id=\"ygrps-yiv-1467442886\">on 11/16/03 6:58 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My now-on-newstands column in Home Education Magazine this month is about<br/>\n&gt; that.  It&#39;s called &quot;Balancing in the Middle Ground,&quot; and it&#39;s on the HEM<br/>\n&gt; website.<br/>\n<br/>\n </span></blockquote>I watched the film, &quot;Little Buddha,&quot; on TV this morning.  The moment in<br/>\nwhich Siddartha recognizes the path he should follow is contained in a scene<br/>\nwhere he hears a musician say the string on his instrument must be just taut<br/>\nenough: too slack, and it will not play; too tight, and it will break.<br/>\n<br/>\nI have the HEM issue, but haven&#39;t read the article yet :-)<br/>\n<br/>\nNancy<br/>\n<br/>\n<br/>\n-- <br/>\nIn times of change, learners inherit the Earth, while the learned find<br/>\nthemselves beautifully equipped to deal with a world that no longer exists.<br/>\n- Eric Hoffer</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleased to find Sandra Dodd","postDate":"1069037920","msgId":17356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZiLjRhMTEwNjkxLjJjZTk5MzYwQGFvbC5jb20+"},"prevInTopic":17354,"nextInTopic":17357,"prevInTime":17355,"nextInTime":17357,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/03 7:39:19 PM, ticiamama@hotmail.com writes:  ","messageBody":"<div id=\"ygrps-yiv-1159569356\">In a message dated 11/16/03 7:39:19 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ticiamama@...\">ticiamama@...</a> writes:<br/>\n<br/>\n&lt;&lt; nothing...well at my house, that <br/>\n<br/>\nis..they are actually pretty dry by the next day. &gt;&gt;<br/>\n<br/>\nDry like ROCKS, shaped just like they landed. &lt;g&gt;<br/>\n<br/>\nThanks for the kind words.  I remember that day!  I was hoarse and woozy <br/>\nsick, wasn&#39;t I?<br/>\n<br/>\n&lt;&lt;Joylyn&#39;s daughter Lexie was mostly devouring a Harry <br/>\n<br/>\nPotter book while Sandra was speaking, but piped up with some <br/>\n<br/>\nquestions and comments which Sandra addressed without overlooking <br/>\n<br/>\nher.&gt;&gt;<br/>\n<br/>\nHey, she was close enough to kick me, and she&#39;s athletic!  I better not <br/>\noverlook her!  &lt;g&gt;<br/>\n<br/>\n&lt;&lt;When I type it all out and re-read it it seems kind of silly, but it <br/>\n<br/>\nmade me think more deeply on some of my own absolute kind of <br/>\n<br/>\nthinking and how there isn&#39;t always one answer or even two.&gt;&gt;<br/>\n<br/>\nMy now-on-newstands column in Home Education Magazine this month is about <br/>\nthat.  It&#39;s called &quot;Balancing in the Middle Ground,&quot; and it&#39;s on the HEM website.<br/>\n<br/>\n(Sorry if I&#39;ve already brought that link here.  Not trying to show off, it&#39;s <br/>\njust that it&#39;s been a well received column and it&#39;s about avoiding absolute <br/>\nthinking in extremes.)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/206/ndunschool.html\">http://www.home-ed-magazine.com/HEM/206/ndunschool.html</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":67613657,"authorName":"aicitticia","from":"&quot;aicitticia&quot; &lt;ticiamama@...&gt;","profile":"aicitticia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleased to find Sandra Dodd","postDate":"1069036704","msgId":17354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwOWNiMCttdWFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJwN2N2bStlbHNpQGVHcm91cHMuY29tPg=="},"prevInTopic":17352,"nextInTopic":17356,"prevInTime":17353,"nextInTime":17355,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"I always think of when I met Sandra and she left some great lasting impressions on me too. I heard Sandra speak at the Bayshore conference in Long Beach, CA. I","messageBody":"<div id=\"ygrps-yiv-410600962\">I always think of when I met Sandra and she left some great lasting <br/>\nimpressions on me too.<br/>\n<br/>\nI heard Sandra speak at the Bayshore conference in Long Beach, CA. I <br/>\nwas first impressed with her respectfulness to the kids who asked <br/>\nquestions. Joylyn&#39;s daughter Lexie was mostly devouring a Harry <br/>\nPotter book while Sandra was speaking, but piped up with some <br/>\nquestions and comments which Sandra addressed without overlooking <br/>\nher. I liked that.<br/>\n<br/>\nThen I remember (everytime I do laundry in fact) her analogy on <br/>\nleaving wet clothes in the washing machine. It went something like: <br/>\nWhat happens when you leave wet clothes in the washing machine and <br/>\nshe answered her own question...nothing...well at my house, that <br/>\nis..they are actually pretty dry by the next day. But I hear in <br/>\nCalifornia they are all smelly the next day and mildew in even more <br/>\nhumid states. <br/>\n<br/>\nWhen I type it all out and re-read it it seems kind of silly, but it <br/>\nmade me think more deeply on some of my own absolute kind of <br/>\nthinking and how there isn&#39;t always one answer or even two. Mostly <br/>\nit has made me take my children&#39;s requests more seriously and to <br/>\nlook at things from their eyes rather then my own. This was/is <br/>\nimportant to me and is a constant internal dialogue.<br/>\n<br/>\nI just have always liked this line of thinking...more global, not so <br/>\nblack and white so to speak. <br/>\n<br/>\nJust thought I&#39;d share.<br/>\nTicia</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleased to find Sandra Dodd","postDate":"1069027880","msgId":17352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDguNDA2ZjZkYzkuMmNlOTZjMjhAYW9sLmNvbT4="},"prevInTopic":17351,"nextInTopic":17354,"prevInTime":17351,"nextInTime":17353,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/03 4:25:37 PM, tuckervill2@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1671307565\">In a message dated 11/16/03 4:25:37 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a> writes:<br/>\n<br/>\n&lt;&lt; Gee, I just don&#39;t know how people from Ohio have been getting around all <br/>\nthis <br/>\ntime with NO mountains!   &gt;&gt;<br/>\n<br/>\nThey just don&#39;t know there&#39;s an easier way.<br/>\n(And those who know the easier way can&#39;t easily learn the harder way!)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleased to find Sandra Dodd","postDate":"1069024976","msgId":17351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1LjFjYTg1MzA1LjJjZTk2MGQwQGFvbC5jb20+"},"prevInTopic":17348,"nextInTopic":17352,"prevInTime":17350,"nextInTime":17352,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/2003 11:56:26 AM Central Standard Time, athomeopathy@hotmail.com writes: and that change names every so many blocks to be sure you","messageBody":"<div id=\"ygrps-yiv-1897880709\">In a message dated 11/16/2003 11:56:26 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:athomeopathy@...\">athomeopathy@...</a> writes:<br/>\nand that change names every so many blocks to <br/>\nbe sure you don&#39;t know where you are (no mountains to guide you), <br/>\n~~~<br/>\nGee, I just don&#39;t know how people from Ohio have been getting around all this <br/>\ntime with NO mountains!  <br/>\n<br/>\nheehee.  <br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleased to find Sandra Dodd","postDate":"1069007414","msgId":17348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3ZC4yMzM4YWFkZi4yY2U5MWMzNkBhb2wuY29tPg=="},"prevInTopic":17346,"nextInTopic":17351,"prevInTime":17347,"nextInTime":17349,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/03 10:56:26 AM, athomeopathy@hotmail.com writes:  Just in time for sand","messageBody":"<div id=\"ygrps-yiv-1112233337\">In a message dated 11/16/03 10:56:26 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:athomeopathy@...\">athomeopathy@...</a> writes:<br/>\n<br/>\n&lt;&lt; Plan to be back to visit the Appleturkey in March. &gt;&gt;<br/>\n<br/>\nJust in time for sand storms.<br/>\n<br/>\n&lt;&lt;you don&#39;t know where you are (no mountains to guide you)&gt;&gt;<br/>\n<br/>\nI feel lost in flat places.  Especially when sometimes you can&#39;t even see the <br/>\nsun or moon because of humidity.<br/>\n<br/>\n&lt;&lt;mold and mildew . . .no solar snow removal&gt;&gt;<br/>\n<br/>\nforeign mysteries<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":9309534,"authorName":"Norma","from":"&quot;Norma&quot; &lt;athomeopathy@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleased to find Sandra Dodd","postDate":"1069005270","msgId":17346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwOGRrbis0dTdAZUdyb3Vwcy5jb20+","inReplyToHeader":"PGJwN2N2bStlbHNpQGVHcm91cHMuY29tPg=="},"prevInTopic":17345,"nextInTopic":17348,"prevInTime":17345,"nextInTime":17347,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"... By the way, who else is in New Mexico? We re not, but wish we were, miss it every day.  Hunkered down in Ohio.  What s good about Ohio?  Hmmmmmmm?","messageBody":"<div id=\"ygrps-yiv-717916534\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Nicole&quot; &lt;fenom70@y...&gt; wrote:<br/>\n&lt;&gt;By the way, who else is in New Mexico?&lt;&gt;<br/>\n<br/>\nWe&#39;re not, but wish we were, miss it every day.  Hunkered down in <br/>\nOhio.  What&#39;s good about Ohio?  Hmmmmmmm?  Besides the long period of <br/>\ngrey skies, mold and mildew to let, weather that changes radically <br/>\nfrom day to day, moment to moment, no solar snow removal, tornadoes <br/>\n(one hit in &#39;99 just blocks from our house turning brick houses into <br/>\nbrick dust!), floods, streets that wind all over the place (much <br/>\nworse than Santa Fe), and that change names every so many blocks to <br/>\nbe sure you don&#39;t know where you are (no mountains to guide you), and <br/>\nCincinnati being the second most popular place for Dubya to come for <br/>\ncampaign funding? <br/>\n<br/>\nOkay.  What&#39;s good about it is a large homeschooling population, of <br/>\nall varieties, oodles of great community-based learning resources, <br/>\nand dozens of ice surfaces within two hours drive (which is what <br/>\nbrought us here in the first place).  But we will be back in New <br/>\nMexico!  We have not been won over by the Queen City, far prefer the <br/>\nDuke City.  Plan to be back to visit the Appleturkey in March.<br/>\n<br/>\nNorma </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Pleased to find Sandra Dodd","postDate":"1069003749","msgId":17345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4Mi4yMzNkZWQwMS4yY2U5MGRlNUBhb2wuY29tPg=="},"prevInTopic":17344,"nextInTopic":17346,"prevInTime":17344,"nextInTime":17346,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/16/03 1:38:02 AM, fenom70@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-234309740\">In a message dated 11/16/03 1:38:02 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fenom70@...\">fenom70@...</a> writes:<br/>\n<br/>\n&lt;&lt; Sandra offered great support and encouragement, as I was facing a lot <br/>\n<br/>\nof pressure from my mother at the time.  I would like to say thank <br/>\n<br/>\nyou. &gt;&gt;<br/>\n<br/>\nGood!<br/>\nI&#39;m glad something I said helped.<br/>\n<br/>\nThere&#39;s a small unschooling list set up for New Mexico and southern Colorado. <br/>\n I did the list but was really hoping someone(s) else would have a bout of <br/>\norganizational fervor and get us something going locally.  It&#39;s not too late. &lt;g&gt;<br/>\n<br/>\nAnd I wouldn&#39;t mind more activity on that list a bit, if you&#39;d like to join <br/>\nit.   <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolarama@yahoogroups.com\">unschoolarama@yahoogroups.com</a><br/>\n<br/>\nWelcome to this list, which is also relatively quiet (but not THAT quiet).<br/>\n<br/>\nOther more booming-business (and slightly more dangerous) places I post <br/>\nregularly are the message board at www.unschooling.com and <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n<br/>\nI also have a steadily growing collection of stuff collected in a maze of <br/>\npages which can start here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\nor here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/life\">http://sandradodd.com/life</a><br/>\n<br/>\nor just sandradodd.com<br/>\n<br/>\nThose have been fun to do.  They don&#39;t match, and nobody will ever hire me to <br/>\ndo a webpage for them (good, because I don&#39;t want the responsibility anyway), <br/>\nbut for lack of flash, they still do have some good information, because I <br/>\ntry to swipe from the best.   Many of the pages, like reading and math, are <br/>\nmostly quotes and articles from other unschoolers.<br/>\n<br/>\nI haven&#39;t read e-mail for many hours, having had company (another <br/>\nhomeschooling family is having marital problems and the kids chose to camp out here for a <br/>\nwhile) and a party Friday night (good party, and exhausting--we played games <br/>\nmostly run by Kirby and Marty, though it was an birthday party for an adult <br/>\nfriend of ours).   So I&#39;ll read more mail and maybe think of something new and <br/>\nclever to bring to this list.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":127921172,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;syltoyama@...&gt;","profile":"syltoyama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Pleased to find Sandra Dodd","postDate":"1069000939","msgId":17344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMTE2MTY0MjE5LjI2Mzg0LnFtYWlsQHdlYjIxNjAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGJwN2N2bStlbHNpQGVHcm91cHMuY29tPg=="},"prevInTopic":17341,"nextInTopic":17345,"prevInTime":17343,"nextInTime":17345,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"Hi Nicole, We re in Albuquerque. Sylvia ... Do you Yahoo!? Protect your identity with Yahoo! Mail AddressGuard [Non-text portions of this message have been","messageBody":"<div id=\"ygrps-yiv-2031654950\">Hi Nicole,<br/>\n <br/>\nWe&#39;re in Albuquerque.<br/>\n <br/>\nSylvia<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nProtect your identity with Yahoo! Mail AddressGuard<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126182534,"authorName":"Nicole","from":"&quot;Nicole&quot; &lt;fenom70@...&gt;","profile":"fenom70","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Pleased to find Sandra Dodd","postDate":"1068971830","msgId":17341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwN2N2bStlbHNpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":17344,"prevInTime":17340,"nextInTime":17342,"topicId":17341,"numMessagesInTopic":0,"msgSnippet":"I am so happy to see that Sandra is on this list!  I am a fellow John Holt fan, but no less a Sandra Dodd fan.  Any of you who haven t met her or heard her","messageBody":"<div id=\"ygrps-yiv-818126749\">I am so happy to see that Sandra is on this list!  I am a fellow John <br/>\nHolt fan, but no less a Sandra Dodd fan.  Any of you who haven&#39;t met <br/>\nher or heard her speak are missing out!  I met her and Holly at a <br/>\nsmall conference last year here in Albuquerque when I was first <br/>\nintroduced to the idea of unschooling.  Our family had been <br/>\nunschooling for a year instinctively but had never heard the word!<br/>\n<br/>\nSandra offered great support and encouragement, as I was facing a lot <br/>\nof pressure from my mother at the time.  I would like to say thank <br/>\nyou.<br/>\n<br/>\nBy the way, who else is in New Mexico?</div>","specialLinks":[]}],"prevTopicId":17370,"nextTopicId":17382}}