{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":283374811,"authorName":"Carol","from":"Carol &lt;carolfhs79@...&gt;","profile":"carolfhs79","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Nationwide Unschoolers Winter Waterpark Gathering !!!!","postDate":"1196038550","msgId":31557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0OTA5Ny4yOTcxOS5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":31556,"nextInTime":31558,"topicId":31557,"numMessagesInTopic":0,"msgSnippet":"UNSCHOOLERS WINTER WATERPARK GATHERING:  Jan, 21 - 25, 2008. There s less than a month left to register for the big Unschoolers Winter Waterpark Gathering. ","messageBody":"<div id=\"ygrps-yiv-34509421\">UNSCHOOLERS WINTER WATERPARK GATHERING:  Jan, 21 - 25, 2008.  <br/>\n   <br/>\n  There&#39;s less than a month left to register for the big Unschoolers Winter Waterpark Gathering.  <br/>\n   <br/>\n  Join Unschoolers from around the country and Canada, for a fun week among other unschoolers at the Sandusky,Ohio Kalahari Waterpark Resort,  They&#39;re giving us super discounted rates on rooms, that also includes waterpark passes to the largest indoor waterpark in the country! <br/>\n   <br/>\n  We&#39;ll also be using some of their conference rooms and we&#39;ll be having lots of fun activities and events for all ages, including funshops, toddler area, talent show, dance, unschooling discussions, social activities, and more. So. our families will have an additional way to connect with other unschoolers.  Plus, the Kalahari has an activities coordinator who will work with us to organize additional activities, from crafts to movies.  So, theyll be plenty to do, throughout the week for the kids, parents and grandparents! <br/>\n   <br/>\n  We&#39;ve already filled their original wing of suites and as of about 3 weeks ago, they began putting our guest in their newest wing of suites.  Rooms are going fast, so hurry and make your reservations while rooms are still available!<br/>\n   <br/>\n  Join our yahoo group today, for further details and information on how to register, order t-shirts,etc...<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UWWG/\">http://groups.yahoo.com/group/UWWG/</a> <br/>\n   <br/>\n  Hope you can join us!<br/>\n   <br/>\n  Carol Reinhard<br/>\n  UWWG Coordinator<br/>\n   <br/>\n  =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=<br/>\n   <br/>\n  Heres some more information about the gathering:<br/>\n   <br/>\n  UNSCHOOLERS WINTER WATERPARK GATHERING<br/>\n   <br/>\n   <br/>\n  The first nationwide UWWG (Unschoolers Winter Waterpark Gathering) will be at the Kalahari Resort in Sandusky, Ohio; January 2125, 2008.  They&#39;re giving us super discounted rates that will be good whether you decide to come for 1 or all 4 nights!  <br/>\n   <br/>\n   Please join our Unschoolers Winter Waterpark Gatherings ( UWWG) yahoo group at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UWWG/\">http://groups.yahoo.com/group/UWWG/</a> )<br/>\n   <br/>\n  The Kalahari Waterpark Resort is the premier in waterpark resorts.  When their addition is completed in December, they&#39;ll be the largest indoor waterpark in the USA ( 173,000sq. ft. of indoor waterpark). The Kalahari is like a mini village with 884 rooms, a full service spa, fitness room, 4 restaurants, bars, nightclub, 5 gift shops, a candy/ice cream shop, live African animals on display, putt-putt, giant game room, bowling, and more.  <br/>\n   <br/>\n  Their indoor waterpark includes everything from lazy river rides and a wave pool for surfing and boogie boarding, to giant water slides and thrilling water coasters.  The new waterpark addition will also include a special UV roof for year round tanning.  <br/>\n   <br/>\n  The Kalahari are also allowing us to use some of their conference rooms throughout our stay.  We have 2 moms coordinating events, funshops, unschooling discussion,  social activities, ect   So, our families will have an additional way to now connect with other unschoolers.  Another mom is coordinating field trips for local places around Sandusky.  Plus, the Kalahari also has their own activities coordinator who will work with us to organize activities, from crafts to movies.  So, theyll be plenty to do, through out the week for both the kids and parents!<br/>\n   <br/>\n  Here&#39;s the Kalahari&#39;s link to their website:  ( Check it out. This place is AWESOME! )<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kalahariresort.com/\">http://www.kalahariresort.com/</a> waterpark/ ?locid=2&areaid=16 <br/>\n   <br/>\n  We have set-up yahoo group specifically for the UWWG  - Unschoolers Winter Waterpark Gatherings.  This way everyone can discuss on-line who&#39;s coming, types of events and activities to plan for our conference rooms, local field trips, etc..<br/>\n   <br/>\n  Heres the website for joining the UWWG Yahoo group: <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UWWG/\">http://groups.yahoo.com/group/UWWG/</a><br/>\n   <br/>\n  Note  - you will need to join the Yahoo group to obtain our groups reservation  code for making reservations. The Kalahari will be handling all reservations.<br/>\n   <br/>\n  Reservations must be made before December 22, 2007 to obtain these super discounted rates, or until the hotel rooms are filled.  Reservations made after this date, will not be guaranteed these discounted rates.<br/>\n   <br/>\n  Feel free to pass this info. along to all unschoolers, life learners and relaxed, eclectic, homeschoolers that you know throughout the country. (The more the merrier, as the hotel will fill the rooms with other guests, so better to get more unschoolers filling these rooms!).<br/>\n   <br/>\n  Carol Reinhard <br/>\n  UWWG Coordinator<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":31549,"nextTopicId":31558}}