{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: How Do I Change This?","postDate":"1337023034","msgId":67145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvcmxucSsycHNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZGMUE0MzE3LTU2RDYtNEE4NC1BQ0UzLTkzMEFFRjNCQUVDQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67108,"nextInTopic":0,"prevInTime":67144,"nextInTime":67146,"topicId":67099,"numMessagesInTopic":0,"msgSnippet":"... My 12 yo daughter often wears floral mesh leggings under her cut off jean shorts, because layering fashionable. She has been choosing her own clothes since","messageBody":"<div id=\"ygrps-yiv-641138592\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=- She looked a bit disgruntled then I told her she didn&#39;t have to wear tights under them and she perked up and put them on.  That felt really amazing. -=-<br/>\n&gt; <br/>\n&gt; Shorts without tights under them probably felt amazing too. :-)====<br/>\n<br/>\n<br/>\n </span></blockquote>My 12 yo daughter often wears floral mesh leggings under her cut off jean shorts, because layering fashionable. She has been choosing her own clothes since infancy when I would hold up a couple of choices and buy the one she reached for.<br/>\n<br/>\nMy suggestion is to spend some time together looking at some of the catalogs of clothing for Juniors. Limited Too has a &quot;catazine&quot; as they call it. JC Penney has a pretty large Juniors section online too. You can talk about what she likes, why she likes them, different combinations. <br/>\n<br/>\nAny time the &quot;indecent&quot; judgement pops into your mind, you have the chance to really look at that, and ask yourself if it is objective. Are these teenage models in the catalogs really trying to tempt men into sin? Or are the clothes just cute, comfortable, age appropriate and current?<br/>\n<br/>\nMaybe she would like to learn to sew, so that she can adapt the looks she likes, and express her own creativity.<br/>\n<br/>\nMy daughter and I talk a lot about appropriate for the occasion. We watch all those fashion competition shows, and we even watch Fashion Police - but you have to like Joan Rivers&#39; sarcastic humor. Funnily enough, the FP come down strongly against overly revealing, &quot;too old/sexual&quot; garments for the teenage stars all the time.<br/>\n<br/>\nIf your daughter was wearing hand me downs and not helped to care for her clothes for such a long time, it might take longer for her to discover her own personal style. Don&#39;t set up a situation where the main factor in her clothing choices become reactive to your judgment.<br/>\n<br/>\nBy the way, maxi dresses are very in right now.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.robyncoburn.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How Do I Change This?","postDate":"1336509037","msgId":67108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZGMUE0MzE3LTU2RDYtNEE4NC1BQ0UzLTkzMEFFRjNCQUVDQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMzY1MDMzMjUuNzkzNTEuWWFob29NYWlsTmVvQHdlYjE4NDUwNy5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGpvYWQ1OCtsaGJ1QGVHcm91cHMuY29tPiA8OUFDREU3NjUtMUJGNS00MDI1LUE2MzMtQTRBNjExOTAwRUQ5QFNhbmRyYWRvZGQuY29tPiA8MTMzNjUwMzMyNS43OTM1MS5ZYWhvb01haWxOZW9Ad2ViMTg0NTA3Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":67107,"nextInTopic":67145,"prevInTime":67107,"nextInTime":67109,"topicId":67099,"numMessagesInTopic":0,"msgSnippet":"-=- She looked a bit disgruntled then I told her she didn t have to wear tights under them and she perked up and put them on.  That felt really amazing. -=- ","messageBody":"<div id=\"ygrps-yiv-465009515\">-=- She looked a bit disgruntled then I told her she didn&#39;t have to wear tights under them and she perked up and put them on.  That felt really amazing. -=-<br/>\n<br/>\nShorts without tights under them probably felt amazing too. :-)<br/>\n<br/>\nThe way anyone changes anything is by doing something different.  Maybe only a little bit different, at first.  There&#39;s a bit at the bottom of this page (recently transcribed!) from the sound file (so you don&#39;t need to hear the whole sound file to get to that very useful part)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nMy dad grew up in a small town where everyone was Nazarene or Baptist.  Even though he didn&#39;t go to church as an adult, he didn&#39;t want me to have my ears pierced or cut my hair or wear makeup.  My mom was generally the same way, but didn&#39;t think haircuts would be too bad.   The basis of his belief was religious and cultural.  There are prejudices in there about harlots, and Catholics and &quot;Mexicans&quot; (who would pierce the ears of BABIES, which proved they were evil and not just regular Catholics).  And my dad maintained these prejudices even though he moved our whole family, when I was six, to a VERY Catholic, Hispanic town and he was social and sociable with everyone for the rest of his life.  Still, though, without being analytical about those things, he just felt that girls and women should be natural.  My mom curled her hair and wore makeup, especially bright red lipstick.  He forgave in women his own age what he was sure was nasty in younger girls. ;-)<br/>\n<br/>\nAnd those weren&#39;t his direct beliefs, either.  They were things his mother and dad had believed, and they were born in 1902 or so.  <br/>\n<br/>\nIf you can trace your prejudice back, that&#39;s worth doing.<br/>\nIf your response is resentment or jealousy, that&#39;s important to realize, too.  If unschooling is going to be as restrictive and shame-filled as a mainstream life with school, why even bother?<br/>\n<br/>\nIt&#39;s true there are people who homeschool to shelter their children from the evil, bad influences of strangers.  They&#39;re not usually unschoolers, though!  :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":352884218,"authorName":"Tiffani","from":"Tiffani &lt;tiffermomof5@...&gt;","profile":"tiffermomof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How Do I Change This?","postDate":"1336503325","msgId":67107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzY1MDMzMjUuNzkzNTEuWWFob29NYWlsTmVvQHdlYjE4NDUwNy5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDlBQ0RFNzY1LTFCRjUtNDAyNS1BNjMzLUE0QTYxMTkwMEVEOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpvYWQ1OCtsaGJ1QGVHcm91cHMuY29tPiA8OUFDREU3NjUtMUJGNS00MDI1LUE2MzMtQTRBNjExOTAwRUQ5QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":67106,"nextInTopic":67108,"prevInTime":67106,"nextInTime":67108,"topicId":67099,"numMessagesInTopic":0,"msgSnippet":"////-=-I have been in a tug of war with my daughter over her clothes for years literally-=- How old is she? It s been going on for years, but how old is she","messageBody":"<div id=\"ygrps-yiv-298151560\">////-=-I have been in a tug of war with my daughter over her clothes for years literally-=-<br/>\n<br/>\nHow old is she? It&#39;s been going on for years, but how old is she now?///<br/>\n<br/>\nShe will be 13 on Thursday.  We adopted her at 8 from foster care.  She was very used to wearing very tight old and dirty clothes.  It started out with me wanting her to wear clean clothes everyday. Then we have VERY different taste in clothes.  I grew up in a very conservative family and I was only allowed to wear dresses as a child as a teen I wore long things under my summer clothes.  I was very modest so I never pushed against the expectation. <br/>\n<br/>\n<br/>\n////Generally, though, it sounds like you&#39;re operating from rules (unstated rules, if it&#39;s repeating and you are &quot;locked&quot; in a &quot;battle.&quot; Those are very strong words, and are quite the opposite of partnership. They&#39;re VERY antagonistic.<br/>\nIn such a situation, there are losers. If she wears what she wants to wear, you LOSE. If she wear what you want her to wear, she LOSES. But nobody wins.////<br/>\n<br/>\nI know those are strong words but that is really what it is like.  I do force a winner and loser from this situation.  I am really baffled by it because this is not my usual temperament. Today I suggested she wear these new shorts that she got(it is really hot today and she was in jeans).  She looked a bit disgruntled then I told her she didn&#39;t have to wear tights under them and she perked up and put them on.  That felt really amazing.  She has a spring in her step and she looks super cute.<br/>\n<br/>\nI thought this was a stupid question to ask.  I am glad I asked anyway. Thank you for all the links.  You have given me a great place to go from here.<br/>\n<br/>\nTiffani<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How Do I Change This?","postDate":"1336491352","msgId":67106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlBQ0RFNzY1LTFCRjUtNDAyNS1BNjMzLUE0QTYxMTkwMEVEOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpvYWQ1OCtsaGJ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpvYWQ1OCtsaGJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":67104,"nextInTopic":67107,"prevInTime":67105,"nextInTime":67107,"topicId":67099,"numMessagesInTopic":0,"msgSnippet":"-=-I have been in a tug of war with my daughter over her clothes for years literally-=- How old is she?  It s been going on for years, but how old is she now? ","messageBody":"<div id=\"ygrps-yiv-1484374668\">-=-I have been in a tug of war with my daughter over her clothes for years literally-=-<br/>\n<br/>\nHow old is she?  It&#39;s been going on for years, but how old is she now?<br/>\n<br/>\nFor someone raised by fundamentalist or very conservative parents, or someone who went to a Catholic girls&#39; school, it can be very hard to see a younger girl or teen wearing anything revealing, and part of that could be because of those voices in the head--of parents, grandparents, nuns...<br/>\n<br/>\nIf what you say to her is not in your own voice or in your own words, this might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/phrases\">http://sandradodd.com/phrases</a><br/>\n<br/>\nGenerally, though, it sounds like you&#39;re operating from rules (unstated rules, if it&#39;s repeating and you are &quot;locked&quot; in a &quot;battle.&quot;  Those are very strong words, and are quite the opposite of partnership.  They&#39;re VERY antagonistic.<br/>\n<br/>\nIn such a situation, there are losers.  If she wears what she wants to wear, you LOSE.  If she wear what you want her to wear, she LOSES.  But nobody wins.<br/>\n<br/>\n-=-So after interrogating myself I have no good reason to send her back other then I have locked us into this battle. I want to stop. My question is how? Do I tell her I was wrong? Or do I tell her she looks beautiful the next time she comes out in something I would have not approved of?<br/>\n-=-<br/>\n<br/>\nThis might seem odd advice, but read this.  And if at the end you don&#39;t know why, read it again.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n<br/>\nI think if you ARE sorry, you should apologize.  You&#39;re saying you want it to stop, and that it&#39;s your fault you are &quot;locked into battle.&quot; <br/>\n<br/>\nGo somewhere with her--a long errand, or a drive for the sake of driving.  Or find something fun to do side by side that isn&#39;t verbal at all.  And talk there, that way.  Not face to face.  Not a formal discussion.  A side-by-side discussion, so that there can be long silences without it being awkward, and so that you don&#39;t have to feel that you&#39;ve said everything there is to say, and so the conversation can pick back up after you&#39;ve had some time to think about it.<br/>\n<br/>\nMy dad was not happy in the late 1960s with mini skirts and girls going without bras.  I was able to talk to him about it, though, and say that we were around boys our own age who didn&#39;t feel the same way as men his age felt about it, and that there were things people his age had done and worn that their own parents thought was lewd or nasty or rude.<br/>\n<br/>\nJudging kids&#39; fashions by the standards of 30 years before is a problem.  It&#39;s as wrong as saying the music you grew up with was great, but the new stuff isn&#39;t music at all.<br/>\n<br/>\nExplain WHY you&#39;re concerned.  If the reasons are spurious or vestigial leftovers from vague messages from your own youth, stating them aloud should reveal that.  It&#39;s okay to laugh and be embarrassed about a concern that&#39;s not so current.  (I went to school in high school with Catholic girls who had been told in elementary (1-8) that wearing sleeveless dresses would lead them to hell.)  <br/>\n<br/>\nWhat you should NOT do is what you did with unschooling.  Don&#39;t try to throw off everything for something new and totally different, in an extreme and opposite way.  Don&#39;t say &quot;I will never, ever advise you on clothes again, EVER!  You can wear anything you want to!&quot;<br/>\n<br/>\nMaybe say that your discomfort alone isn&#39;t reason enough, but sometimes there are reasons having to do with safety (a young teen out alone late at night might do better to dress a little more conservatively, depending where and why and why and all) or appropriateness (funerals and spaghetti straps aren&#39;t a good match; neither is going to jury duty or to court).<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a>  (think of what the principles are behind what you&#39;re concerned about)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla","from":"&quot;Lyla&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How Do I Change This?","postDate":"1336490217","msgId":67104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvYmRkOSttcG1xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpvYWQ1OCtsaGJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":67099,"nextInTopic":67106,"prevInTime":67103,"nextInTime":67105,"topicId":67099,"numMessagesInTopic":0,"msgSnippet":"... i would think an apology would go a long way, preceding a change of approach, for a specific issue like this one.  i have found that apologies and stating","messageBody":"<div id=\"ygrps-yiv-2052746934\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Tiffani&quot; &lt;tiffermomof5@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; When we switched to unschooling I was one of those parents who made a declaration that &quot;now we are unschoolers&quot; and it did not work out so well. We reverted back to a more structured way and gradually made changes. I do not want to throw us off balance, but I would like to apologize for all the harassment of her clothes or at the very least stop it. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>i would think an apology would go a long way, preceding a change of approach, for a specific issue like this one.  i have found that apologies and stating my intent for the future have had profound meaning and have brought deeper understanding between me and my kids.  Broadly stating you are unschooling is pretty different from apologizing and changing a specific issue. :)<br/>\n<br/>\nlyla</div>","specialLinks":[]},{"userId":352884218,"authorName":"Tiffani","from":"&quot;Tiffani&quot; &lt;tiffermomof5@...&gt;","profile":"tiffermomof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"How Do I Change This?","postDate":"1336457192","msgId":67099,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvYWQ1OCtsaGJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67104,"prevInTime":67098,"nextInTime":67100,"topicId":67099,"numMessagesInTopic":0,"msgSnippet":"I have been in a tug of war with my daughter over her clothes for years literally.  Now with all the evaluating I have been doing of myself, I am not sure why.","messageBody":"<div id=\"ygrps-yiv-584915806\">I have been in a tug of war with my daughter over her clothes for years literally.  Now with all the evaluating I have been doing of myself, I am not sure why. She will come out looking really cute and then I send her back because something is to short(which it really isn&#39;t) or spaghetti straps(not sure why that bothers me). So after interrogating myself I have no good reason to send her back other then I have locked us into this battle.  I want to stop.  My question is how?  Do I tell her I was wrong? Or do I tell her she looks beautiful the next time she comes out in something I would have not approved of?<br/>\n<br/>\nWhen we switched to unschooling I was one of those parents who made a declaration that &quot;now we are unschoolers&quot; and it did not work out so well. We reverted back to a more structured way and gradually made changes. I do not want to throw us off balance, but I would like to apologize for all the harassment of her clothes or at the very least stop it. <br/>\n<br/>\nThank you for the advice.<br/>\nTiffani</div>","specialLinks":[]}],"prevTopicId":67115,"nextTopicId":67126}}