{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] unschooling moment","postDate":"1057365797","msgId":76202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwOC4yNGFhOTFlNi4yYzM3NzkyNUBhb2wuY29tPg=="},"prevInTopic":76167,"nextInTopic":0,"prevInTime":76201,"nextInTime":76203,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/4/03 1:24:58 PM Eastern Daylight Time, ... That is great.  What is his web site?  We love reptiles.  Where does he get his, locally or","messageBody":"<div id=\"ygrps-yiv-976176969\">In a message dated 7/4/03 1:24:58 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:milgrom8660@...\">milgrom8660@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; he has built a web site and writes about his reptiles and his trips<br/>\n<br/>\n </span></blockquote>That is great.  What is his web site?  We love reptiles.  Where does he get <br/>\nhis, locally or online?<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling moment/writing online","postDate":"1057343193","msgId":76167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJlNGdzcCttOXAxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNGMDVCOUYxLjIwMTAwMDlAdm9sLmNvbT4="},"prevInTopic":76161,"nextInTopic":76202,"prevInTime":76166,"nextInTime":76168,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"... other than I found out he was doing this when he asked me to proofread some of his stuff) he has built a web site and writes about his reptiles and his","messageBody":"<div id=\"ygrps-yiv-1722331316\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Now three years later (on his own with no input from me - <br/>\n </span></blockquote>other than I found out he was doing this when he asked me to <br/>\nproofread some of his stuff) he has built a web site and writes <br/>\nabout his reptiles and his trips.  He answers questions online <br/>\nevery day from people who want help with their pets. He writes to <br/>\nother people with his own questions etc.  So...<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n<br/>\n </span></blockquote>The most incredible thing has happened in the last ten years. <br/>\nWe have kids who are dying to write... they just don&#39;t want to write <br/>\nfor school. There is a ready-made audience of literally multiplied <br/>\nmillions online wiating to hear from our kids.<br/>\n<br/>\nLast month, my son&#39;s visual basic friends who gather on a forum <br/>\nwere discussing the merits of The Matrix Reloaded and debating <br/>\nsome of the finer points in the script. My son was so thrilled with <br/>\nthe dialog, he spent quite a bit of time refuting one person&#39;s point <br/>\nof view and then asked me to listen to it before posting to be <br/>\nsure he&#39;d expressed himself well enough. This is my oldest who <br/>\n&quot;doesn&#39;t&quot; like to write. Of course, he keeps a journal for <br/>\n&quot;significant events&quot; so he won&#39;t forget them, but he doesn&#39;t like to <br/>\nwrite. He discovered &quot;Live Journal&quot; online and has been <br/>\nrecording all his feelings, thoughts, ideas there, but he doesn&#39;t <br/>\nlike to write. He read the story of Gilgamesh online, saw a <br/>\nscreenplay emerge in his head, wrote it out (32 pages) but, <br/>\ndoesn&#39;t like to write. The Internet has been key to his interest in <br/>\nwriting.<br/>\n<br/>\nMy daughter is involved in fanfix, posts regularly to an internet <br/>\nboard and is on IM most days (apparently writing poetry and <br/>\nstories to each other, besides sorting out teen angst and <br/>\ngossip).<br/>\n<br/>\nMy next in line (11) subscribes to a discussion group for <br/>\nastronomy and reads there regularly. He asks questions of sites <br/>\nwhen he has them. He definitely doesn&#39;t like to write. &lt;g&gt;<br/>\n<br/>\nI just joined Harry Potter for grown-ups and discovered that there <br/>\nare literally hundreds of discussion boards and groups for kids.<br/>\n<br/>\nNow this is real writing! This is the kind of writing that makes you <br/>\nhone your arguments, gives you real life feedback and creates <br/>\nthe writing impulse. Thank God for the Internet!<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] unschooling moment","postDate":"1057339889","msgId":76161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGMDVCOUYxLjIwMTAwMDlAdm9sLmNvbT4=","referencesHeader":"PDAwMzYwMWMzNDI1MCQ2ZGY3NWIxMCRjYzBkNjcxOEBDUjQ2ODU0N0E+"},"prevInTopic":76157,"nextInTopic":76167,"prevInTime":76160,"nextInTime":76162,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"If it s OK with him, will you please post the url? My daughter has become interested in frogs and would like one as a pet. I have no clue.","messageBody":"<div id=\"ygrps-yiv-433849837\">If it&#39;s OK with him, will you please post the url? My daughter has <br/>\nbecome interested in frogs and would like one as a pet. I have no clue.<br/>\n<br/>\n:-) Diane<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Just had to share this.  First a little background.  My 15yob started homeschooling 3 years ago and unschooling shortly thereafter.  I&#39;ve written before that one of &quot;my&quot; goals was to encourage more reading.  Well that and more writing.  I bought books on writing - I bought a whole curriculum on writing - I bought him a journal (still blank 2 years later) - I bought him gel pens and black paper - no results.  Now three years later (on his own with no input from me - other than I found out he was doing this when he asked me to proofread some of his stuff) he has built a web site and writes about his reptiles and his trips.  He answers questions online every day from people who want help with their pets. He writes to other people with his own questions etc.  So...<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":89402294,"authorName":"milgrom family","from":"&quot;milgrom family&quot; &lt;milgrom8660@...&gt;","profile":"milgrom8660","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling moment","postDate":"1057339170","msgId":76157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzYwMWMzNDI1MCQ2ZGY3NWIxMCRjYzBkNjcxOEBDUjQ2ODU0N0E+"},"prevInTopic":69007,"nextInTopic":76161,"prevInTime":76156,"nextInTime":76158,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone Just had to share this.  First a little background.  My 15yob started homeschooling 3 years ago and unschooling shortly thereafter.  I ve written","messageBody":"<div id=\"ygrps-yiv-2083147649\">Hi Everyone    <br/>\n<br/>\nJust had to share this.  First a little background.  My 15yob started homeschooling 3 years ago and unschooling shortly thereafter.  I&#39;ve written before that one of &quot;my&quot; goals was to encourage more reading.  Well that and more writing.  I bought books on writing - I bought a whole curriculum on writing - I bought him a journal (still blank 2 years later) - I bought him gel pens and black paper - no results.  Now three years later (on his own with no input from me - other than I found out he was doing this when he asked me to proofread some of his stuff) he has built a web site and writes about his reptiles and his trips.  He answers questions online every day from people who want help with their pets. He writes to other people with his own questions etc.  So...<br/>\n<br/>\nLast night he convinced my husband to help him purchase some vine snakes.  He has told me that not a lot is known about them and he wants to study them.  My husband asked him &quot;If I invest in the vine snakes what&#39;s in it for me?&quot;  Jordan replied &quot;When I write a book about them you can share in the profit&quot; !  <br/>\n<br/>\nStella<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":93802122,"authorName":"Tim and Maureen","from":"Tim and Maureen &lt;tmthomas@...&gt;","profile":"wisdom0007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling moment","postDate":"1052884801","msgId":69007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTkwMWMzMTljZCQ0YmJlZWU2MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg==","referencesHeader":"PEJBWTQtRjIwckJRWHBYcnlJVVkwMDAwMjFiZUBob3RtYWlsLmNvbT4="},"prevInTopic":68997,"nextInTopic":76157,"prevInTime":69006,"nextInTime":69008,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"Jennifer, Thank you for your kind thoughts and suggestions.I have been struggling with this for so long that that is why I am tired. Her symptoms are subtle","messageBody":"<div id=\"ygrps-yiv-387524450\">Jennifer,<br/>\n<br/>\nThank you for your kind thoughts and suggestions.I have been struggling with this for so long that that is why I am tired. Her symptoms are subtle and one place says yes there is something and then the doctors brush me off. The seizure stuff is just a guess but given family history (5 cousins) and observing some spaced out, not remembering what we talked about, sleep walking, night terrors, lethargy and tremoring on those days and anxiety which is worse when these other things happen as well leaves me thinking I should be exploring it more. <br/>\nAnyway she has been referred to a neuropsychiatrist by a psychiatrist who was seeing her for her severe panic,anxiety attacks but now I don&#39;t know if I want to even explore it.We have been working with a homeopath for 5 years with little help in this area and we have seen naturopaths, biokinesiologist and are doing vitamin therapy. I think one thing that gets in the way is the whole idea that maybe I am not accepting her the way she is  and that the whole medical institution goes against anything natural and accepting and the first question always brings up homeschooling which I feel has influenced not being taken seriously.<br/>\n<br/>\nAnyway thank you and I am sure this to will pass.<br/>\n<br/>\nMaureen<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: jmcseals SEALS <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Tuesday, May 13, 2003 4:07 PM<br/>\n  Subject: Re: [Unschooling-dotcom] unschooling moment<br/>\n<br/>\n<br/>\n  **My daughter is 12 and has some motor delays and possible seizure <br/>\n  activity**<br/>\n<br/>\n  Have you considered taking her to another specialist?  A motor delay should <br/>\n  not cause pain, as in her fingers while writing.  I&#39;d also be concerned <br/>\n  about he possible seizure activity.  Is this something you have observed or <br/>\n  suspect might be happening and resulting in motor delays?  It doesn&#39;t sound <br/>\n  like you were pleased with how the dotor handled the assessment/diagnosis.  <br/>\n  If that were my experience, I would want to give up, too.  I&#39;m not <br/>\n  suggesting you are wrong to do so, by any means.  From reading what you <br/>\n  wrote, it does sound like you have reason to be concerned and your daughter <br/>\n  seems to be asking for help.<br/>\n<br/>\n  When my son was about 2 weeks old, he began having terrible green water <br/>\n  bowel movements.  My doctor and every book I read said it was normal, but <br/>\n  Ethan was lethargic and losing weight.  I tried to make doctor&#39;s <br/>\n  appointments but they wouldn&#39;t allow him to come in with diarrhea, yet all <br/>\n  the while they were telling me it was normal!?!  Huh?  She even delayed his <br/>\n  well baby because of it.  How is that normal?  One day, I took him to the <br/>\n  hospital to be weighed in the breastfeeding support center.  They made me <br/>\n  rush him over to my docor office and take a sample stool to show her.  She <br/>\n  suggested I stop breastfeeding and immediately start supplementing, which <br/>\n  felt wrong, but I did it.  He continued to have the diarrea.<br/>\n<br/>\n  I called everyday for two weeks and was told the same thing until finally, <br/>\n  Ethan began projectile vomiting and wouldn&#39;t even turn his head away from <br/>\n  it.  My husband told me to call the doctor but I no longer had faith nor any <br/>\n  trust in her.  When I took Ethan in, he was about 6 weeks old, weighed 6 <br/>\n  pounds 9 ounces and had weighed 7 pounds 12 ounces at birth.  He wasn&#39;t <br/>\n  moving or reacting to anything.  The nurses were so kind.  I was terrified.  <br/>\n  They told me had I not brought him in, he wouldn&#39;t have made it through the <br/>\n  night.  They allowed me to hold him while they put lines in his tiny head <br/>\n  because they couldn&#39;t get a good vein anywhere else.  He had bruises over <br/>\n  the greater portion of his body.  He ended up staying in the hospital for <br/>\n  almost two weeks.  They thought he had rotovirus but never gave me a <br/>\n  conclusive diagnosis.<br/>\n<br/>\n  I later found out through the LLL that what we experienced was due to Ethan <br/>\n  getting too much lactose from my foremilk.  I wasn&#39;t breastfeeding long <br/>\n  enough on one side and he never got the chance to get my hindmilk.  Instead <br/>\n  of listening to my son and my insticts, I was placing all my faith in my <br/>\n  Ped.  I wish I would have just taken him in right from the start, whether <br/>\n  she wanted me to or not.<br/>\n<br/>\n  I realize this is quite different from what you are experiencing but I share <br/>\n  it because it sounds like you and your daughter are seeing something the <br/>\n  Neuro isn&#39;t.  I realize what you wrote isn&#39;t the entire story, but I can <br/>\n  well relate to feeling like I&#39;m not being lsitened to and wanting to give up <br/>\n  on doctors.  We haven&#39;t been to a doctor in almost three years.  Since Ethan <br/>\n  got out of the hospital, other than for stitches about half a dozen times.  <br/>\n  It is amazing what happens when you take a proactive stance in your childs <br/>\n  healthcare.  Rather than relying on faith in someone else, you learn to <br/>\n  listen to your children.  It sounds like she is asking for help.  Have you <br/>\n  researched her symptoms and found anything on your own?  Have you looked <br/>\n  into any homeopathic alternatives?  When I had carpel tunnel problems, I was <br/>\n  given excellent advice and found the pain dissappeared immediately.<br/>\n<br/>\n  Anyway, I&#39;m babbling again. :)  I wish you the best.  Just keep listening to <br/>\n  your daughter.  Keep a journal of her symptoms and complaints and what <br/>\n  happens around those times.  You may find that to be very revealing and <br/>\n  begin to see connections and find your own solutions.  Best of luck!<br/>\n<br/>\n  Jennifer<br/>\n<br/>\n  _________________________________________________________________<br/>\n  Add photos to your e-mail with MSN 8. Get 2 months FREE*.  <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/featuredemail\">http://join.msn.com/?page=features/featuredemail</a><br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n            Choose your car now! <br/>\n                                - Make -AcuraAM GeneralAston Martin <br/>\n                               <br/>\n<br/>\n                          ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n                          If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n                          To unsubscribe from this group, click on the following link or address an email to:<br/>\n                          <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n                          Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n                          Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n                         <br/>\n                   <br/>\n             <br/>\n       <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":8378727,"authorName":"zenmomma2kids","from":"&quot;zenmomma2kids&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling moment","postDate":"1052882063","msgId":68997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5c2NhZisxMDhkcUBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDAwMTMwMWMzMTk5OSRiOTFiYmY4MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":68973,"nextInTopic":69007,"prevInTime":68996,"nextInTime":68998,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"... keep practising until she has it the way she wants it. She said she knows it takes her a whole bunch longer to do these motor things but she will just do","messageBody":"<div id=\"ygrps-yiv-1615481375\"><blockquote><span title=\"ireply\">&gt;&gt; She told me that when she needs to write and print she will just <br/>\n </span></blockquote>keep practising until she has it the way she wants it. She said she <br/>\nknows it takes her a whole bunch longer to do these motor things but <br/>\nshe will just do it when she wants to.&gt;&gt;<br/>\n<br/>\nYou might tell her that sometimes it helps to do some big motor <br/>\nthings before she has to write. Something that uses the big muscle <br/>\ngroups. My son Conor also found that chewing on something helps him <br/>\nwrite easier. He chews on ice a lot.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; That is unschooling. I am so glad I am learning to trust my <br/>\n </span></blockquote>children and let them be all they can.&gt;&gt;<br/>\n<br/>\nBeautiful.<br/>\n<br/>\nLife is good.<br/>\n~Mary</div>","specialLinks":[]},{"userId":132991755,"authorName":"Sheila Terry","from":"&quot;Sheila Terry&quot; &lt;shera70@...&gt;","profile":"sheilat111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling moment","postDate":"1052876555","msgId":68973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZWYwMWMzMTliYSQ5NjNjNmRlMCQ2NTAxYThjMEBTSEVJTEE+","referencesHeader":"PDAwMTMwMWMzMTk5OSRiOTFiYmY4MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":68953,"nextInTopic":68997,"prevInTime":68972,"nextInTime":68974,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"One of the things that happens for her is she cannot print easily and without a lot of fingerpain.She holds the pencil very atypical and has been unable to","messageBody":"<div id=\"ygrps-yiv-811697537\">One of the things that happens for her is she cannot print easily and without a lot of fingerpain.She holds the pencil very atypical and has been unable to change that.<br/>\n<br/>\nI&#39;m reading the Myth of Laziness by Mel Levine and he discusses that EXACT thing. I just started reading the book so instead of misquoting anything I would suggest checking it out yourself.<br/>\nSheila Terry<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shera70@...\">shera70@...</a><br/>\n<br/>\n&quot;Every child is born a genius. <br/>\n9,999 out of every 10,000 are swiftly, <br/>\ninadvertently, de-geniused by grown-ups.&quot; <br/>\n<br/>\n- R. Buckminster Fuller<br/>\n<br/>\n<br/>\n  One of the things that happens for her is she cannot print easily and without a lot of fingerpain.She holds the pencil very atypical and has been unable to change that. The neurologist asked her why she did that and told her that was dysfunctional. I told him we knew that and obviously had tried to alter this as had the local therapists, etc...<br/>\n  She told me that when she needs to write and print she will just keep practising until she has it the way she wants it. She said she knows it takes her a whole bunch longer to do these motor things but she will just do it when she wants to. That is unschooling. I am so glad I am learning to trust my children and let them be all they can.<br/>\n<br/>\n  Tim and Maureen Thomas<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.stillwaters.ca\">http://www.stillwaters.ca</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":40256956,"authorName":"jmcseals SEALS","from":"&quot;jmcseals SEALS&quot; &lt;jmcseals@...&gt;","profile":"sevenhavei","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling moment","postDate":"1052867232","msgId":68953,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtRjIwckJRWHBYcnlJVVkwMDAwMjFiZUBob3RtYWlsLmNvbT4="},"prevInTopic":68945,"nextInTopic":68973,"prevInTime":68952,"nextInTime":68954,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"**My daughter is 12 and has some motor delays and possible seizure activity** Have you considered taking her to another specialist?  A motor delay should not","messageBody":"<div id=\"ygrps-yiv-700575884\">**My daughter is 12 and has some motor delays and possible seizure <br/>\nactivity**<br/>\n<br/>\nHave you considered taking her to another specialist?  A motor delay should <br/>\nnot cause pain, as in her fingers while writing.  I&#39;d also be concerned <br/>\nabout he possible seizure activity.  Is this something you have observed or <br/>\nsuspect might be happening and resulting in motor delays?  It doesn&#39;t sound <br/>\nlike you were pleased with how the dotor handled the assessment/diagnosis.  <br/>\nIf that were my experience, I would want to give up, too.  I&#39;m not <br/>\nsuggesting you are wrong to do so, by any means.  From reading what you <br/>\nwrote, it does sound like you have reason to be concerned and your daughter <br/>\nseems to be asking for help.<br/>\n<br/>\nWhen my son was about 2 weeks old, he began having terrible green water <br/>\nbowel movements.  My doctor and every book I read said it was normal, but <br/>\nEthan was lethargic and losing weight.  I tried to make doctor&#39;s <br/>\nappointments but they wouldn&#39;t allow him to come in with diarrhea, yet all <br/>\nthe while they were telling me it was normal!?!  Huh?  She even delayed his <br/>\nwell baby because of it.  How is that normal?  One day, I took him to the <br/>\nhospital to be weighed in the breastfeeding support center.  They made me <br/>\nrush him over to my docor office and take a sample stool to show her.  She <br/>\nsuggested I stop breastfeeding and immediately start supplementing, which <br/>\nfelt wrong, but I did it.  He continued to have the diarrea.<br/>\n<br/>\nI called everyday for two weeks and was told the same thing until finally, <br/>\nEthan began projectile vomiting and wouldn&#39;t even turn his head away from <br/>\nit.  My husband told me to call the doctor but I no longer had faith nor any <br/>\ntrust in her.  When I took Ethan in, he was about 6 weeks old, weighed 6 <br/>\npounds 9 ounces and had weighed 7 pounds 12 ounces at birth.  He wasn&#39;t <br/>\nmoving or reacting to anything.  The nurses were so kind.  I was terrified.  <br/>\nThey told me had I not brought him in, he wouldn&#39;t have made it through the <br/>\nnight.  They allowed me to hold him while they put lines in his tiny head <br/>\nbecause they couldn&#39;t get a good vein anywhere else.  He had bruises over <br/>\nthe greater portion of his body.  He ended up staying in the hospital for <br/>\nalmost two weeks.  They thought he had rotovirus but never gave me a <br/>\nconclusive diagnosis.<br/>\n<br/>\nI later found out through the LLL that what we experienced was due to Ethan <br/>\ngetting too much lactose from my foremilk.  I wasn&#39;t breastfeeding long <br/>\nenough on one side and he never got the chance to get my hindmilk.  Instead <br/>\nof listening to my son and my insticts, I was placing all my faith in my <br/>\nPed.  I wish I would have just taken him in right from the start, whether <br/>\nshe wanted me to or not.<br/>\n<br/>\nI realize this is quite different from what you are experiencing but I share <br/>\nit because it sounds like you and your daughter are seeing something the <br/>\nNeuro isn&#39;t.  I realize what you wrote isn&#39;t the entire story, but I can <br/>\nwell relate to feeling like I&#39;m not being lsitened to and wanting to give up <br/>\non doctors.  We haven&#39;t been to a doctor in almost three years.  Since Ethan <br/>\ngot out of the hospital, other than for stitches about half a dozen times.  <br/>\nIt is amazing what happens when you take a proactive stance in your childs <br/>\nhealthcare.  Rather than relying on faith in someone else, you learn to <br/>\nlisten to your children.  It sounds like she is asking for help.  Have you <br/>\nresearched her symptoms and found anything on your own?  Have you looked <br/>\ninto any homeopathic alternatives?  When I had carpel tunnel problems, I was <br/>\ngiven excellent advice and found the pain dissappeared immediately.<br/>\n<br/>\nAnyway, I&#39;m babbling again. :)  I wish you the best.  Just keep listening to <br/>\nyour daughter.  Keep a journal of her symptoms and complaints and what <br/>\nhappens around those times.  You may find that to be very revealing and <br/>\nbegin to see connections and find your own solutions.  Best of luck!<br/>\n<br/>\nJennifer<br/>\n<br/>\n_________________________________________________________________<br/>\nAdd photos to your e-mail with MSN 8. Get 2 months FREE*.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/featuredemail\">http://join.msn.com/?page=features/featuredemail</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":93802122,"authorName":"Tim and Maureen","from":"Tim and Maureen &lt;tmthomas@...&gt;","profile":"wisdom0007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling moment","postDate":"1052862651","msgId":68945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTMwMWMzMTk5OSRiOTFiYmY4MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":63679,"nextInTopic":68953,"prevInTime":68944,"nextInTime":68946,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"My daughter is 12 and has some motor delays and possible seizure activity.We went to a neurologist yesterday(I won t make that mistake again) and in the end he","messageBody":"<div id=\"ygrps-yiv-1368508399\">My daughter is 12 and has some motor delays and possible seizure activity.We went to a neurologist yesterday(I won&#39;t make that mistake again) and in the end he said nothing was wrong. He based this judgement on checking her reflexes, asking me 2 or 3 questions and two out of 5 EEG test results in front of him. My daughter was very frustrated as she says she knows something is going on in her brain that makes things harder, fuzzier, and her muscles to not work when she wants them to. I told her that I was done with this whole doctor thing and that i now just wanted to focus on her strengths and accept the other areas as something that was part of her. <br/>\nOne of the things that happens for her is she cannot print easily and without a lot of fingerpain.She holds the pencil very atypical and has been unable to change that. The neurologist asked her why she did that and told her that was dysfunctional. I told him we knew that and obviously had tried to alter this as had the local therapists, etc...<br/>\nShe told me that when she needs to write and print she will just keep practising until she has it the way she wants it. She said she knows it takes her a whole bunch longer to do these motor things but she will just do it when she wants to. That is unschooling. I am so glad I am learning to trust my children and let them be all they can.<br/>\n<br/>\nTim and Maureen Thomas<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.stillwaters.ca\">http://www.stillwaters.ca</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling moment","postDate":"1049830964","msgId":63679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0RDJFOTQ1LTY5RkEtMTFENy04QzBDLTAwMDM5M0FGNUEyRUBtYWMuY29tPg==","inReplyToHeader":"PDAwMDkwMWMyZmUwMyQ1NTFiM2E4MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":63674,"nextInTopic":68945,"prevInTime":63678,"nextInTime":63680,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"And - you can sing in French - Alouette and Frere Jaques -  (I m sure I ve spelled those badly - but you ll know what I mean). You can sing WHILE they jump on","messageBody":"<div id=\"ygrps-yiv-1831725301\">And - you can sing in French - Alouette and Frere Jaques -  (I&#39;m sure <br/>\nI&#39;ve spelled those badly - but you&#39;ll know what I mean). You can sing <br/>\nWHILE they jump on the trampoline. You can sing in rounds and THAT is <br/>\nmath (but don&#39;t tell them).<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tuesday, April 8, 2003, at 12:16 PM, Tim and Maureen wrote:<br/>\n<br/>\n&gt; So who needs a closed in lecture French class when you can do math <br/>\n&gt; physics phys ed and communication and still play!!! Yahoo to <br/>\n&gt; unschooling<br/>\n&gt; Tim and Maureen Thomas </span></blockquote></div>","specialLinks":[]},{"userId":93802122,"authorName":"Tim and Maureen","from":"Tim and Maureen &lt;tmthomas@...&gt;","profile":"wisdom0007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling moment","postDate":"1049829377","msgId":63674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDkwMWMyZmUwMyQ1NTFiM2E4MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":26647,"nextInTopic":63679,"prevInTime":63673,"nextInTime":63675,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"Hi, Just had a moment that I had to share. I belong to a homeschooling group that advocates learning in the traditional way but occasionally have an event that","messageBody":"<div id=\"ygrps-yiv-974722778\">Hi, Just had a moment that I had to share. I belong to a homeschooling group that advocates learning in the traditional way but occasionally have an event that we like. French lessons were offered and my seven year old was really interested. Of course had no idea what the style of teaching would be.When I asked it was going to be done in a classroom style by a teacher. His energy is big and seldom works for a lecture type environment.I was struggling with his desire versus what i know about him and whether i wanted to put out the money. I had no problem with him learning about this himself but had trouble with my commitment time and money wise.Any way i opted out of it. As I&#39;m wondering if this was not providing him with an experience we had another experience that reinforced unschooling.They wanted the trampoline put up. Normally i wait for two adults as this can be muscle taxing. The kids helped even when we had all the springs in wrong and had to undo it all again. he sun was shining, the wind was blowing, everyonehad a job and a suggestion and boy was there excitement when it was done all by ourselves.So who needs a closed in lecture French class when you can do math physics phys ed and communication and still play!!! Yahoo to unschooling<br/>\nTim and Maureen Thomas<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.stillwaters.ca\">http://www.stillwaters.ca</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","replyTo":"LIST","senderId":"TH1x86k2rOav9XdzHv3MWtu8lX6nuOAXoY14zGT22vDmLKBEI-ou9JnHQ4pECRu8Vg2SeFETdretgZxfZ5Yy7j3RdtK6sHP_HXwqdA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling moment","postDate":"1002116300","msgId":26647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMDAzMTMzODIwLjczNjA4LnFtYWlsQHdlYjE0MzA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEJHRUlJSVBPS0hORk5LRUtOSU1ISUVKTUNIQUEuc2hlcmlAbWFpbmUucnIuY29tPg=="},"prevInTopic":26646,"nextInTopic":63674,"prevInTime":26646,"nextInTime":26648,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":". To think I have been so worried ... Did you write the above ^ quote? It s pretty good. ... __________________________________________________ Do You Yahoo!? ","messageBody":"<div id=\"ygrps-yiv-931639517\">. To think I have been so worried<br/>\n<blockquote><span title=\"ireply\"> &gt; and it is coming<br/>\n&gt; together. &gt; ~Sheri<br/>\n&gt; <br/>\n&gt; The only thing I like about all those Dr. Laura&#39;s<br/>\n&gt; and Jerry Springer&#39;s of<br/>\n&gt; the world is that it is a living example of our<br/>\n&gt; freedoms. To quiet an<br/>\n&gt; oppossing (or just plain irritating) voice would<br/>\n&gt; ultimately be to quiet our<br/>\n&gt; own....<br/>\n&gt; <br/>\n&gt; Thanks Sheri.....unschooling moments help SO much.<br/>\n </span></blockquote>Did you write the above ^ quote? It&#39;s pretty good.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nListen to your Yahoo! Mail messages from any phone.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://phone.yahoo.com\">http://phone.yahoo.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"Sheri Piersol","from":"&quot;Sheri Piersol&quot; &lt;sheri@...&gt;","replyTo":"LIST","senderId":"_U59UGXGyKb59ZWU6vU_LYM_KAOyGCFzeHASE0DNHUpJ7rt-jWYf_JbGlQOU3Vj-_l-u4jI602ePKv8JuubSpcvSNIoNNLHg6M6h","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling moment","postDate":"1002115195","msgId":26646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJHRUlJSVBPS0hORk5LRUtOSU1ISUVKTUNIQUEuc2hlcmlAbWFpbmUucnIuY29tPg==","inReplyToHeader":"PDEwMDIxMDY1NTcuMjYzLjMwNTM5Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":26647,"prevInTime":26645,"nextInTime":26647,"topicId":26646,"numMessagesInTopic":0,"msgSnippet":"My 13 yo ds found the internet a couple months back. We have always used it, but he found that he can meet other teens (thru approved sites) and found ","messageBody":"<div id=\"ygrps-yiv-854887395\">My 13 yo ds found the internet a couple months back. We have always used it,<br/>\nbut he found that he can meet other teens (thru approved sites) and found<br/>\ninteractive games. He is now on YIM whenever he finds the time. At first, he<br/>\nwas always asking me to read a word or spell simple things. Yesterday he was<br/>\non for hours and I realized that he didn&#39;t ask for my help even once! So, I<br/>\nmeandered over to the computer and looked over his shoulder to find that his<br/>\nspelling was good. To think I have been so worried and it is coming<br/>\ntogether. It can be hard to wait for your childs timing, especially when my<br/>\n9 yo ds is a quick learner. :)<br/>\n<br/>\nNow if I could just figure out my 5 yo!! LOL<br/>\n<br/>\n~Sheri<br/>\n<br/>\nThe only thing I like about all those Dr. Laura&#39;s and Jerry Springer&#39;s of<br/>\nthe world is that it is a living example of our freedoms. To quiet an<br/>\noppossing (or just plain irritating) voice would ultimately be to quiet our<br/>\nown....</div>","specialLinks":[]}],"prevTopicId":76201,"nextTopicId":76156}}