{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"uebinger robyn","from":"&quot;uebinger robyn&quot; &lt;emersonsage@...&gt;","replyTo":"LIST","senderId":"y0jaVUMjq0_Uh3TY5EPU7T5g2LzWH7gAbgt3C8son_gZ9m6cpUYtg6Jmd3sBe2-kGt6ldv5wVJ0RlqaEgJR72uCtHZPApJib5rIi5zzfvR5J","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Homeschooling and social handicaps (long)","postDate":"980205475","msgId":15302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMDVWMlJRSHRRbEdwZjgzc24wMDAwNDgxN0Bob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":15301,"nextInTime":15303,"topicId":15302,"numMessagesInTopic":0,"msgSnippet":"Thanks Bobbie for sharing your story. It was truly generous of you to let us learn from your experience. ... ","messageBody":"<div id=\"ygrps-yiv-801109548\">Thanks Bobbie for sharing your story. It was truly generous of you to let us <br/>\nlearn from your experience.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Bobbie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:insomniaaks@...\">insomniaaks@...</a>&gt;<br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a><br/>\n&gt;Subject: [Unschooling-dotcom] Re: Homeschooling and social handicaps (long)<br/>\n&gt;Date: Mon, 22 Jan 2001 14:34:34 -0800 (PST)<br/>\n&gt;<br/>\n&gt;  The only time my son is singled<br/>\n&gt; &gt; out,<br/>\n&gt; &gt; its by adults , ignorant, rude adults. When hes<br/>\n&gt; &gt; grown,<br/>\n&gt; &gt; in whatever job he chooses, I sincerely doubt that<br/>\n&gt; &gt; his<br/>\n&gt; &gt; coworkers will know, or care if he was homeschooled.<br/>\n&gt; &gt; The big picture for me is his happiness and<br/>\n&gt; &gt; security,<br/>\n&gt; &gt; 2 things he never felt during the 2 years I allowed<br/>\n&gt; &gt; ps<br/>\n&gt; &gt; to undermine everything I believe in. Never again.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;I have to reply here, cuz that is so true about adults<br/>\n&gt;and their close mindedness. I am the 5th of 6<br/>\n&gt;children, the first four are 12-17 yrs older than me<br/>\n&gt;(quite a gap), and of them ONE graduated from ps. (Of<br/>\n&gt;her own choice). The rest my dad had to fight to be<br/>\n&gt;able to &quot;homeschool&quot; (which ended up being<br/>\n&gt;unschooling) them, and so by the time I was old enough<br/>\n&gt;to put in school, he knew he didn&#39;t really want to,<br/>\n&gt;but he had had so much negative thoughts on<br/>\n&gt;homeschooling thrown his way (that his kids wouldnt&#39;<br/>\n&gt;learn as much, that they would be socially and<br/>\n&gt;academically handicapped, that their lives would be<br/>\n&gt;too sheltered, etc, etc, AND that the kids actually<br/>\n&gt;LIKED school and he was depriving them)<br/>\n&gt;that I remember after I had turned 5, he, very<br/>\n&gt;reluctantly sighed and asked me &quot;do you WANT to go to<br/>\n&gt;school? If you WANT to I guess you can.&quot; and I<br/>\n&gt;remember thinking, I am soooo cool. I can decide<br/>\n&gt;whether or not to go to school. and I said no, (to his<br/>\n&gt;delight)and stayed at home all that year, learning at<br/>\n&gt;home in absolutely no structured way, just my mom<br/>\n&gt;creatively teaching me in play that my friends never<br/>\n&gt;dreamt of having, both my parents and older siblings<br/>\n&gt;reading to me several times a day and ALWAYS before<br/>\n&gt;bed. Then the next year my &quot;best friend&quot; started first<br/>\n&gt;grade and all the other kids that I knew from my<br/>\n&gt;religion were starting school too, so I decided I<br/>\n&gt;wanted to go. And to tell the truth in first grade I<br/>\n&gt;had a blast. But only becuz I happened to have a<br/>\n&gt;smaller class and the coolest teacher there, who<br/>\n&gt;didn&#39;t believe in traditional school methods and<br/>\n&gt;pacing. and thought if we wanted to learn cursive in<br/>\n&gt;first grade then she would teach us, if I wanted to<br/>\n&gt;use three pages and three days worth of story in my<br/>\n&gt;squiggle book, as opposed to the assigned one<br/>\n&gt;page/day, then &#39;go for it, you&#39;ll be a great writer&#39;,<br/>\n&gt;and if we still needed to count on our fingers to<br/>\n&gt;figure things out, then we were allowed to. And here&#39;s<br/>\n&gt;the cool part. I was further advanced in reading than<br/>\n&gt;the other kids who had faithfully gone to kindergarten<br/>\n&gt;to learn their abc&#39;s like good little &quot;normal&quot; kids,<br/>\n&gt;so I got to go a different grade and classroom for a<br/>\n&gt;special reading time and sometimes read to the younger<br/>\n&gt;kids. I stayed in ps thru 3rd grade, (in 2nd, I saw my<br/>\n&gt;actual teacher about a third of the year cuz of<br/>\n&gt;horrible health problems, and we had substitutes for<br/>\n&gt;most of the year and a huge class, so needless to say<br/>\n&gt;I was pretty bored, and just went to see my friends<br/>\n&gt;and play for those blessed 15 minute recesses of<br/>\n&gt;playing freedom), in 3rd grade, the only thing I<br/>\n&gt;really enjoyed was going to &quot;gifted class&quot;, where we<br/>\n&gt;were encouraged to do our own thing and learn at our<br/>\n&gt;own pace. Oh, and since I was raised as a Jehovah&#39;s<br/>\n&gt;Witness and didn&#39;t celebrate a lot of the holidays, I<br/>\n&gt;was sent to the Library while the rest of the enormous<br/>\n&gt;class did holiday activities, which was just fine with<br/>\n&gt;me, cuz reading was what I really enjoyed, --other<br/>\n&gt;than daydreaming, which was considered something &quot;bad&quot;<br/>\n&gt;(ex: &quot;Bobbie&#39;s a really great student, has lots and<br/>\n&gt;lots of potential, BUT daydreams a bit too much&quot;),--<br/>\n&gt;and that way I didn&#39;t have to stay and be made to feel<br/>\n&gt;bad about my beliefs by the TEACHER, who wanted sooo<br/>\n&gt;bad to prove that I really truly did WANT so bad to<br/>\n&gt;celebrate them and my parents were just being mean to<br/>\n&gt;me. The kids, being naturally unbiased and open minded<br/>\n&gt;never said a thing more to me about it than asking<br/>\n&gt;questions cuz it was something different to them. On<br/>\n&gt;the other end of it, I obviously wasn&#39;t getting math,<br/>\n&gt;I NEVER did my math or social studies types of<br/>\n&gt;homework and would therefore end up having to stay in<br/>\n&gt;during recess and write &quot;I will do my math homework. I<br/>\n&gt;will do my math homework. I will do my math homework.&quot;<br/>\n&gt;and THEN if I didn&#39;t finish that (due to daydreaming,<br/>\n&gt;most likely) I had to write more sentences. And in my<br/>\n&gt;school, at 3rd grade there was already horrible social<br/>\n&gt;circles and cliques to try and fit into. I was in<br/>\n&gt;neither the cool nor nerd group, cuz my cool friends<br/>\n&gt;liked me but didn&#39;t like that I also liked and hung<br/>\n&gt;out with weird and nerdy kids, and my weird and nerdy<br/>\n&gt;friends thought I must be kinda stuck up to hang out<br/>\n&gt;and like the cool kids. I lived in constant fear of<br/>\n&gt;going to the principal&#39;s office for anything and was<br/>\n&gt;so scared riding the bus, cuz I lived in a rural area<br/>\n&gt;and was dropped off at the end of my &quot;driveway&quot;, which<br/>\n&gt;was really a dirt road that seemed millions of miles<br/>\n&gt;long to a little easily frightened girl. In the middle<br/>\n&gt;of third grade, our house burned down, and my dad&#39;s<br/>\n&gt;brother was living in Phoenix, where he had heard of<br/>\n&gt;this &quot;private school&quot; (which was what I like to call a<br/>\n&gt;&quot;homemade school&quot;, just started by a few like-minded<br/>\n&gt;parents who wanted to be in charge of their kids and<br/>\n&gt;their learning activities and associations and still<br/>\n&gt;let them have a &quot;school&quot; with friends to go to.) So me<br/>\n&gt;and my little sister (2yrs younger) went there, and my<br/>\n&gt;mom and oldest sister became teachers there, and I had<br/>\n&gt;a great time. I went thru 5th, (my mom taught<br/>\n&gt;5th..there was only one class per grade) and I loved<br/>\n&gt;it, but mostly becuz it was sooo unstructured, and<br/>\n&gt;huge amounts of personal attention. The teachers were<br/>\n&gt;like extended family, who respected your strengths and<br/>\n&gt;weaknesses and beliefs and my dad was almost the<br/>\n&gt;principal at one point. Then we decided to move back<br/>\n&gt;to New Mexico and I said there was no way on God&#39;s<br/>\n&gt;green earth I was going to go to middle school. So I<br/>\n&gt;took Calvert homeschool. Or at least ordered the<br/>\n&gt;course and did some work out of it every once and<br/>\n&gt;awhile. Then ordered American school, and still like<br/>\n&gt;to study in those just for the sake of refreshing my<br/>\n&gt;brain cells sometimes. All of my friends have always<br/>\n&gt;been older than me. Not becuz I was socially<br/>\n&gt;handicapped with kids my age, but becuz frankly, they<br/>\n&gt;bored me. And irritated me with their pettiness in<br/>\n&gt;always trying to be &quot;cool&quot; and fit in. My best friend<br/>\n&gt;for a long time was 6 years older than me and people<br/>\n&gt;always thought she must be babysitting me. :) My<br/>\n&gt;point? oh yeah. (I promise there is one)<br/>\n&gt;Homeschooling kids ARE different. They haven&#39;t been<br/>\n&gt;corrupted with the need to conform in every way of<br/>\n&gt;their being, right down to the way they think and how<br/>\n&gt;long they think on each subject, and HEAVEN FORBID<br/>\n&gt;they use their imaginations to their full potential.<br/>\n&gt;And the reason I got started on this whole tangent<br/>\n&gt;(THANKYOU BOBBIE PLEEEEZE FINISH UP HERE) is that as<br/>\n&gt;an adult, by nature, I suppose, I deal with a lot of<br/>\n&gt;social phobia (in myself) and there was a point in my<br/>\n&gt;life where it was really bad, and in general have<br/>\n&gt;dealt with phobias and stuff like that my whole life.<br/>\n&gt;I don&#39;t like dealing with public figures and dread<br/>\n&gt;having confrontations of any sort sometimes. My POINT<br/>\n&gt;though, is, that when other ADULTS hear this about me,<br/>\n&gt;they have the nerve to say &quot;Oh yeah, weren&#39;t you<br/>\n&gt;homeschooled?&quot; And I have heard the argument soooooo<br/>\n&gt;many times that the homeschooled kids they know either<br/>\n&gt;grow up to be way dumber than most kids or way<br/>\n&gt;smarter, but either way are socially handicapped and<br/>\n&gt;don&#39;t know how to interact with others at all in their<br/>\n&gt;adult life. I maintain that PUBLIC School started<br/>\n&gt;planting the seeds of social phobia and handicapping<br/>\n&gt;in me, cuz I was &quot;different&quot; and didn&#39;t fit the mold<br/>\n&gt;of a &quot;normal&quot; all American apple pie sort of girl, so<br/>\n&gt;I was made to feel as though I needed to change.<br/>\n&gt;Fortunately, thanks to my parents teaching me at home<br/>\n&gt;BEFORE first grade, I had that one thing going for me,<br/>\n&gt;that I loved to read, and was at a middle school level<br/>\n&gt;in 3rd grade, and the &quot;gifted class&quot; teachers loved<br/>\n&gt;that. But kids who are just thrown into school feet<br/>\n&gt;first and aren&#39;t considered &quot;gifted&quot; don&#39;t even have<br/>\n&gt;THAT advantage. One ounce of &quot;different&quot; and they are<br/>\n&gt;either in need of Ritalin or &quot;poor students&quot;. I think<br/>\n&gt;unschooling PREVENTS social handicaps and helps heal<br/>\n&gt;already planted ones, especially if we do expose our<br/>\n&gt;children to other people and situations. My son is the<br/>\n&gt;only kid at McDonald&#39;s playlands and parks who<br/>\n&gt;actually takes the initiative and says in his most<br/>\n&gt;friendly voice &quot;Hi. I&#39;m my name is Satori. Wanna play<br/>\n&gt;with me?&quot; Sometimes he meets no answer at all, cuz,<br/>\n&gt;following in the footsteps of his mom he is by no<br/>\n&gt;means &quot;normal&quot; and sadly a lot of these kids are<br/>\n&gt;already behaving like biased adults. THAT, to me, is a<br/>\n&gt;social handicap.<br/>\n&gt;-Bobbie<br/>\n&gt;<br/>\n&gt;__________________________________________________<br/>\n&gt;Do You Yahoo!?<br/>\n&gt;Yahoo! Auctions - Buy the things you want at great prices.<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a><br/>\n<br/>\n </span></blockquote>_________________________________________________________________<br/>\nGet your FREE download of MSN Explorer at <a rel=\"nofollow\" target=\"_blank\" href=\"http://explorer.msn.com\">http://explorer.msn.com</a></div>","specialLinks":[]}],"prevTopicId":15300,"nextTopicId":15161}}