{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":363518215,"authorName":"claire.horsley08","from":"&quot;claire.horsley08&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Finding calm","postDate":"1254182558","msgId":47695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5cmlxdSs3MnA4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY5RjkxQjY5LUU2M0MtNDFGNC05OUIwLTBCNjQ4QkMyRjFFMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":47681,"nextInTopic":0,"prevInTime":47694,"nextInTime":47696,"topicId":47656,"numMessagesInTopic":0,"msgSnippet":"I d like to address a couple of points.  First, I don t think it takes a certain type of person to unschool.  I do think that to unschool, a parent has to let","messageBody":"<div id=\"ygrps-yiv-1978261890\">I&#39;d like to address a couple of points.  First, I don&#39;t think it takes a certain type of person to unschool.  I do think that to unschool, a parent has to let go of automatic reactions and mainstream expectations around children&#39;s obedience.  And the key here is that this letting go is a process, one that takes a lot of time and effort, and doesn&#39;t always go forward smoothly.  I still react with anger sometimes, but I also know that those times are becoming much less frequent, and that I am more aware of my anger, and so more able to let it go before speaking or acting.  I like the John Holt principle that you should not say anything to your child that you would not say to a treasured friend.  This helps to curb the nastiness that springs out when I&#39;m angry.<br/>\n<br/>\nFor unschooling to really work, the &quot;&#39;why can&#39;t I control my kids?&#39; mode of thinking&quot; has to be thrown out.  Partly because control is counter-productive to a loving, trusting relationship, but also because often this mode of thinking is based on the parent&#39;s fear of others&#39; disapproval. What unschooling has given me is the clarity to see that people&#39;s judgements based on mainstream expectations mean much less to me than quickly and calmly addressing my children&#39;s needs. When I do this I find it very empowering.<br/>\n<br/>\nThe OP wrote: &quot;\tI expressed my utmost disappointment at Mia and her inability to sooth the situation by allowing Jude the lead.  I let her know that I expected her to help me out; not make the situation harder for me.&quot;<br/>\n<br/>\nI too have felt the frustration of an older child refusing to acquiesce to the demands of a younger sibling.  But I absolutely do not want my kids to become rivals, or for one to feel resentful, so I am really mindful of not asking too much or being unfair to my older child.<br/>\n<br/>\nLastly, the OP wrote: &quot;Something inside is stubbornly refusing to<br/>\nbudge, and I can&#39;t seem to completely immerse myself and see the whole.&quot;<br/>\n<br/>\nWhat if that something is an unhealed wound inside you, something from your childhood, or a perception of yourself that is still unexamined?  I found that to really go deep into unschooling, I had to go deep inside myself, and look at what kind of parent, and ultimately what kind of person I want to be.  Affirmations and so forth are useful, but the only place you will really find calm is inside yourself.<br/>\n<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Finding calm","postDate":"1254161162","msgId":47681,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5RjkxQjY5LUU2M0MtNDFGNC05OUIwLTBCNjQ4QkMyRjFFMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU5OTc3OS40OTgzMi5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPiA8NTk5Nzc5LjQ5ODMyLnFtQHdlYjExMDQwOC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":47680,"nextInTopic":47695,"prevInTime":47680,"nextInTime":47682,"topicId":47656,"numMessagesInTopic":0,"msgSnippet":"-=-Think, kids first. If they are the forefront of all you interaction, then others, not even authority figures can get inbetween. You are a team, you and your","messageBody":"<div id=\"ygrps-yiv-1791087469\">-=-Think, kids first. If they are the forefront of all you  <br/>\ninteraction, then others, not even authority figures can get  <br/>\ninbetween. You are a team, you and your kids, you, the mom get to be a  <br/>\nteam leader sometimes, and sometimes just a regular old member.-=-<br/>\n<br/>\nI agree that &quot;kids first&quot; is a good thought, but in that instance, I  <br/>\nthink &quot;dog first&quot; might&#39;ve been a good thought.<br/>\n<br/>\nI liked the suggestion of asking for help to get the dog to the car.   <br/>\nThen neither kid was helping the dog or holding the leash, and each  <br/>\ncould hold one of mom&#39;s hands while she said &quot;I&#39;m so glad he&#39;s okay,  <br/>\naren&#39;t you?&quot; and focus on gratitude and the dog.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Finding calm","postDate":"1254160561","msgId":47680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5OTc3OS40OTgzMi5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg=="},"prevInTopic":47671,"nextInTopic":47681,"prevInTime":47679,"nextInTime":47681,"topicId":47656,"numMessagesInTopic":0,"msgSnippet":"... This was the pivotal moment.  You were talking to the nurse and wouldn t interrupt her.  I ve been there, done that.  I think it s a hold over of schoolish","messageBody":"<div id=\"ygrps-yiv-699341975\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Mia (7) and Jude (4) got in a heated argument about who could hold the dog&#39;s lead whilst I was trying to take in the information the nurse was giving me about post-op. care. &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>This was the pivotal moment.  You were talking to the nurse and wouldn&#39;t interrupt her.  I&#39;ve been there, done that.  I think it&#39;s a hold over of schoolish authority figure respect.  That would have been the perfect time to stop and say, &quot;excuse me a moment&quot; to the nurse and turn and gently talk to your children, by kneeling down.  Most people would rather wait a moment than have to talk over noisy bickering kids.  You could have turned it into a &quot;we need to listen really carefully to the nurse&quot; rather than a &quot;you need to be quiet so I can listen to the nurse&quot;.   Then after listening to the nurse and paying the bill, you could have found a way to have everyone help with the dog getting back out to the car.<br/>\nThink, kids first.  If they are the forefront of all you interaction, then others, not even authority figures can get inbetween.  You are a team, you and your kids, you, the mom get to be a team leader sometimes, and sometimes just a regular old member.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Finding calm","postDate":"1254143863","msgId":47671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3ODQzNC4yOTUyLnFtQHdlYjUzOTA2Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg=="},"prevInTopic":47661,"nextInTopic":47680,"prevInTime":47670,"nextInTime":47672,"topicId":47656,"numMessagesInTopic":0,"msgSnippet":"You could have stopped paying the bill and dealt with the situation.  This week I took the boys to the eye doctor.  I had to fill out 2 sheets for each of","messageBody":"<div id=\"ygrps-yiv-1016683066\">You could have stopped paying the bill and dealt with the situation.  <br/>\n<br/>\nThis week I took the boys to the eye doctor.  I had to fill out 2 sheets for each of them before they could see the doctor.  (Why can&#39;t they mail or e-mail them!)  The boys immediately started fighting over the magazines.  I offered a few suggestions (We had brought some of our own and the dr had some) while I was still filling out the forms.  When it became apparent distance parenting would not work, I had to stop filling out the forms.  It was a bit nerve racking as the dr was sitting there waiting.  But really it did not take too long to get them each settled with a magazine and I finished the forms and they were then able to see the dr.<br/>\n<br/>\nI know I often feel I must finish what I am doing before dealing with the kids, but really it ought to be the other way around.  The people at the vet could wait.  Let them do whatever they would be doing if you were not there, wait on someone else, etc.  They could also have mailed you the bill.  <br/>\n<br/>\nAmanda<br/>\nEli 8, Samuel 6<br/>\n<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Finding calm","postDate":"1254132740","msgId":47661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMzM0NC42Njk5OS5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg=="},"prevInTopic":47660,"nextInTopic":47671,"prevInTime":47660,"nextInTime":47662,"topicId":47656,"numMessagesInTopic":0,"msgSnippet":"I get in this state of, `oh bugger it – you ve lost it – you may as well REALLY lose it, and just accept it. As soon as you feel yourself down this","messageBody":"<div id=\"ygrps-yiv-1448970910\">&quot;I get in this state of, `oh bugger it – you&#39;ve lost it – you may as well REALLY lose it, and just accept it.&#39;&quot;<br/>\n<br/>\nAs soon as you feel yourself down this spiral through the 7 circles of screaming. Stop. Breathe. Apologise. Don&#39;t ever invest more in losing it, don&#39;t see it as something you can relax into. Having done that I can promise you it never feels better to keep screaming than it does to Stop, Breath, Apologise. <br/>\n<br/>\nThe other day I snapped at Simon. He was so hurt and he wouldn&#39;t talk to me. And I felt awful. Just awful. When I told him why I&#39;d snapped, when I gave the details of how I felt in that moment, he understood. And he forgave me for my taking out a moment of tension with a snap at him. <br/>\n<br/>\nI used to scream and shout and feel like I had a right to express my emotions. I still lose it occassionally. But the time between my eruptions is growing greater and greater. Knowing that I was hurting Simon and Linnaea and David. Knowing that every time I lost it I was damaging my relationship with these people who mean the most to me. That knowledge motivated me more than anything else to figure out why I was so angry and to move on from it. That and the knowledge that my screaming didn&#39;t help anything. I don&#39;t imagine that your yelling at your kids helped your dog to feel better or get home more quickly or heal faster. I don&#39;t imagine that it will keep your kids from fighting over access to the lead at a future moment. And I bet it didn&#39;t make you feel any better about your ability to handle tough situations. <br/>\n<br/>\nIn a public place it can be embarrassing to have a child not behave in the manner that you&#39;d hoped. You wanted to seem together and with it and able to deal with all the balls in the air. And you weren&#39;t. You weren&#39;t prepared for a battle over the lead, you weren&#39;t prepared for children to want for themselves rather than caring for the dog. But the dog was the one in the greatest need in that moment. And there were more ways than freaking out and then yelling after the fact in the car to deal with it. You could have asked for the staff member to help you get your dog out to the car and taken a couple of minutes to talk to Mia and Jude about how the dog needed care in that moment and then gone outside to the car, not angry, but calm, not worried about how you appeared, but worried about your dog&#39;s aftercare. You could have sat down, held the dog and talked to Mia and Jude about what needed to happen and how this time they couldn&#39;t help the dog out because<br/>\n the dog was dazed from the surgery. There were probably quite a few different approaches that you could have taken. And you didn&#39;t. You took the approach of having a picture of how it was going to go in your head and then being furious when it didn&#39;t develop in the way you&#39;d hoped. <br/>\n<br/>\nI think it is good to prepare your kids for what is coming up. I think it&#39;s good to be prepared for changes to your image of how things are going to play out. Knowing what has happened in the past, knowing that Mia and Jude may want to do the same thing while you have a 1 year old to take care of as well may help you to mentally plan ways to respond and the better you get at adapting to the changes in your plans the easier it will be to not lose it in the car afterward. The other thing that is really good to plan in is increased time to do any activity. The one thing I remember from Dr. Spock is that if you plan to walk somewhere with a toddler, plan to take as long as it takes. Anytime you go somewhere with a 7 year old and a 4 year old and a 1 year old, plan for it to take far longer than you planned for it to take. Don&#39;t do a bunch in an outing. Take snacks and drinks with you so that any of you can have something to eat when you need it. Be aware of<br/>\n your own hunger. If you are breast-feeding still hunger can play a huge part in your ability to deal with tough situations. Buffer yourself as much as you can. And when you screw up apologise and be honest and move forward. Try to be better than you were. Little steps forward. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Kathryn &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kathryndubay@...\">kathryndubay@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Monday, 28 September, 2009 2:59:01 AM<br/>\nSubject: [AlwaysLearning] Finding calm<br/>\n<br/>\nI need some clarity here on so many levels, that I&#39;m just going to spew out my thoughts and hope it is received with some element of sense!  Often when I read - and I do read a LOT – of responses/recommended readings from seasoned unschoolers, I wonder if it takes a sort of `person&#39; to unschool effectively.  I SO much want to be able to think logically, rationally and thoughtfully during times of chaos.  With three young children (7, 4 & 1) I just can&#39;t seem to muster clarity when inappropriate behaviour arises.  I always seem to slip into, `why can&#39;t I control my kids?&#39; mode of thinking.  For example, a couple of days ago our dog was desexed.  The kids came along with me to collect him from the vet, as they were keen to see him.  Mia (7) and Jude (4) got in a heated argument about who could hold the dog&#39;s lead whilst I was trying to take in the information the nurse was giving me about post-op. care.  Neither Mia nor Jude showed any behavioural<br/>\n appropriateness, and a staff member expressed her concern for our dog after he slammed his face in a door due to all the confusion and his physical state combined.  My head was spinning!  I was getting really annoyed, because our dog needed us to be calm, quiet and responsive to his needs.  I did suggest to Mia that Jude have a turn leading the dog, but she wouldn&#39;t have a bar of it.  I attempted to take the lead, but both got even more heated about the whole thing.  I felt at a complete loss, so I did what needed to be done (paid the bill, etc) as quickly as possible and we headed to the car, tears and tantrums in tow.  When we got in the car, I got ugly.  Without a doubt, I expressed my utmost disappointment at Mia and her inability to sooth the situation by allowing Jude the lead.  I let her know that I expected her to help me out; not make the situation harder for me.  I YELLED and pounded the steering wheel.  It was ugly.  But underneath it all, I<br/>\n was SUPER frustrated with myself.  Firstly, BECAUSE of my expectations and subsequent blame on her to be able to respond appropriately, and secondly, my inability to keep a cool head and respond appropriately myself!  I get in this state of, `oh bugger it – you&#39;ve lost it – you may as well REALLY lose it, and just accept it.&#39;  I know this is wrong on so many levels, but I NEED this situation to be pulled apart, analysed and regurgitated back to me in the hope that some shift will take place deep within!  I have some fantastic quotes from unschoolers printed and stuck on my walls that have made profound impacts on how I see my family and the way I communicate.  But I need more!  Something inside is stubbornly refusing to budge, and I can&#39;t seem to completely immerse myself and see the whole.  <br/>\n<br/>\nThanks in advance<br/>\n<br/>\nKathryn D<br/>\nx  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Finding calm","postDate":"1254131696","msgId":47660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRGNEM5QjExLUNGMDQtNEJBRC04NjRCLUQ0NUM4NTQwRTcyN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDRBQzAyRDQ4LjgwMDA2MDdAbWFjLmNvbT4=","referencesHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPiA8NEFDMDJENDguODAwMDYwN0BtYWMuY29tPg=="},"prevInTopic":47658,"nextInTopic":47661,"prevInTime":47659,"nextInTime":47661,"topicId":47656,"numMessagesInTopic":0,"msgSnippet":"... It should be emphasized that that s the first step. There was one poor woman who thought planning ahead was the one and only solution and if something went","messageBody":"<div id=\"ygrps-yiv-1184016063\"><blockquote><span title=\"ireply\">&gt; So - maybe focus a lot more on planning ahead to set things up to run<br/>\n&gt; smoothly.<br/>\n<br/>\n </span></blockquote>It should be emphasized that that&#39;s the first step. There was one  <br/>\npoor woman who thought planning ahead was the one and only solution  <br/>\nand if something went wrong it was her fault for not anticipating it!<br/>\n<br/>\nThe more you can prevent by playing out scenarios in your head and  <br/>\nplanning for them, the more you deal with repeating problems before  <br/>\nthey play out, the less you have to deal with. So you&#39;ll be less  <br/>\nstressed, the kids will be less stressed and when problems do come  <br/>\nup, you won&#39;t feel as frazzled and have more energy and peace to deal  <br/>\nwith them.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Finding calm","postDate":"1254108488","msgId":47658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBQzAyRDQ4LjgwMDA2MDdAbWFjLmNvbT4=","inReplyToHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg=="},"prevInTopic":47657,"nextInTopic":47660,"prevInTime":47657,"nextInTime":47659,"topicId":47656,"numMessagesInTopic":0,"msgSnippet":"I d like to hear some more examples, but based on what you wrote, you have a planning ahead problem. Did you sort of play out in your head, in advance, any","messageBody":"<div id=\"ygrps-yiv-1946939186\">I&#39;d like to hear some more examples, but based on what you wrote, you <br/>\nhave a &quot;planning ahead&quot; problem. Did you sort of play out in your head, <br/>\nin advance, any scenarios of how taking young children to a vet&#39;s office <br/>\nto pick up a recovering animal might go? Did you feel like you had to <br/>\ntake them? Seems like a bad idea from the outset, to me.<br/>\n<br/>\nSo - maybe focus a lot more on planning ahead to set things up to run <br/>\nsmoothly. Do less, plan more, maybe?<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 9/27/2009 6:59 PM, Kathryn wrote:<br/>\n&gt; I need some clarity here on so many levels, that I&#39;m just going to spew out my thoughts and hope it is received with some element of sense! </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Finding calm","postDate":"1254106450","msgId":47657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2RDA0OEVGLUM3QkQtNEExNS1CMkE3LUVDMDIxQUZBMzcwOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg==","referencesHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg=="},"prevInTopic":47656,"nextInTopic":47658,"prevInTime":47656,"nextInTime":47658,"topicId":47656,"numMessagesInTopic":0,"msgSnippet":"-=-. The kids came along with me to collect him from the vet, as they were keen to see him. Mia (7) and Jude (4) got in a heated argument about who could hold","messageBody":"<div id=\"ygrps-yiv-1907489832\">-=-. The kids came along with me to collect him from the vet, as they  <br/>\nwere keen to see him. Mia (7) and Jude (4) got in a heated argument  <br/>\nabout who could hold the dog&#39;s lead whilst I was trying to take in the  <br/>\ninformation the nurse was giving me about post-op. care. Neither Mia  <br/>\nnor Jude showed any behavioural appropriateness, and a staff member  <br/>\nexpressed her concern for our dog after he slammed his face in a door  <br/>\ndue to all the confusion and his physical state combined.=-<br/>\n<br/>\nI would have been concerned for the dog even without him geting hurt  <br/>\nby the door.   YOU should have held the leash.  The principle of  <br/>\npicking up a scared and pained dog should have been &quot;let&#39;s go and get  <br/>\nthe dog very gently and bring him home quietly.?  If the younger child  <br/>\nwas too young to understand that, it wasn&#39;t a good trip to take him/ <br/>\nher on.  The purpose of the trip to the vet was to bring the dog home,  <br/>\nnot to give the kids an opportunity to go to a vet&#39;s office.<br/>\n<br/>\nEvery situation has a different purpose and focus.<br/>\n<br/>\n-=- I did suggest to Mia that Jude have a turn leading the dog, but  <br/>\nshe wouldn&#39;t have a bar of it. I attempted to take the lead, but both  <br/>\ngot even more heated about the whole thing.-=-<br/>\n<br/>\nThis time&#39;s past, but the next time you could talk in advance about  <br/>\nwhat&#39;s expected and needed and let them decide whether they still want  <br/>\nto go, or ask their help to figure out ways to make it fun, quiet,  <br/>\nquick, safe, for everyone (especially the dog, if it&#39;s a vet pickup).<br/>\n<br/>\n-=- I felt at a complete loss, so I did what needed to be done (paid  <br/>\nthe bill, etc) as quickly as possible and we headed to the car, tears  <br/>\nand tantrums in tow. When we got in the car, I got ugly.-=-<br/>\n<br/>\nWhere was the dog?   Poor dog.<br/>\n<br/>\nSome possible answers to &quot;finding calm&quot; are here, my best advice  <br/>\ncollected over the years.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\nand<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<br/>\nThere&#39;s a free soundfile on that first one that you might want to  <br/>\nlisten to twice.  You can go to the link there and download it and put  <br/>\nit on iTunes or transfer to a CD and put it in the car or something,  <br/>\nmaybe, and find your favorite parts.  It might seem like it will take  <br/>\ntoo much time and energy, because you have little kids, but if it  <br/>\nsaves one guilty yelling fit it will be good!<br/>\n<br/>\nYou can only add so many crazy scary memories to your kids&#39; collection  <br/>\nbefore it&#39;s too much.  Save them for special occasions. &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Finding calm","postDate":"1254103141","msgId":47656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg5cDU5NStla3ZlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47657,"prevInTime":47655,"nextInTime":47657,"topicId":47656,"numMessagesInTopic":0,"msgSnippet":"I need some clarity here on so many levels, that I m just going to spew out my thoughts and hope it is received with some element of sense!  Often when I read","messageBody":"<div id=\"ygrps-yiv-138268105\">I need some clarity here on so many levels, that I&#39;m just going to spew out my thoughts and hope it is received with some element of sense!  Often when I read - and I do read a LOT  of responses/recommended readings from seasoned unschoolers, I wonder if it takes a sort of `person&#39; to unschool effectively.  I SO much want to be able to think logically, rationally and thoughtfully during times of chaos.  With three young children (7, 4 & 1) I just can&#39;t seem to muster clarity when inappropriate behaviour arises.  I always seem to slip into, `why can&#39;t I control my kids?&#39; mode of thinking.  For example, a couple of days ago our dog was desexed.  The kids came along with me to collect him from the vet, as they were keen to see him.  Mia (7) and Jude (4) got in a heated argument about who could hold the dog&#39;s lead whilst I was trying to take in the information the nurse was giving me about post-op. care.  Neither Mia nor Jude showed any behavioural appropriateness, and a staff member expressed her concern for our dog after he slammed his face in a door due to all the confusion and his physical state combined.  My head was spinning!  I was getting really annoyed, because our dog needed us to be calm, quiet and responsive to his needs.  I did suggest to Mia that Jude have a turn leading the dog, but she wouldn&#39;t have a bar of it.  I attempted to take the lead, but both got even more heated about the whole thing.  I felt at a complete loss, so I did what needed to be done (paid the bill, etc) as quickly as possible and we headed to the car, tears and tantrums in tow.  When we got in the car, I got ugly.  Without a doubt, I expressed my utmost disappointment at Mia and her inability to sooth the situation by allowing Jude the lead.  I let her know that I expected her to help me out; not make the situation harder for me.  I YELLED and pounded the steering wheel.  It was ugly.  But underneath it all, I was SUPER frustrated with myself.  Firstly, BECAUSE of my expectations and subsequent blame on her to be able to respond appropriately, and secondly, my inability to keep a cool head and respond appropriately myself!  I get in this state of, `oh bugger it  you&#39;ve lost it  you may as well REALLY lose it, and just accept it.&#39;  I know this is wrong on so many levels, but I NEED this situation to be pulled apart, analysed and regurgitated back to me in the hope that some shift will take place deep within!  I have some fantastic quotes from unschoolers printed and stuck on my walls that have made profound impacts on how I see my family and the way I communicate.  But I need more!  Something inside is stubbornly refusing to budge, and I can&#39;t seem to completely immerse myself and see the whole.  <br/>\n<br/>\nThanks in advance<br/>\n<br/>\nKathryn D<br/>\nx</div>","specialLinks":[]}],"prevTopicId":47221,"nextTopicId":47699}}