{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...","replyTo":"LIST","senderId":"YQvGVfSUUaxTed7P-DN_SQ9dfEhrZkNs38C_SUKSVYmEOcQowia5fzkuvzjejB7AcAOrHPiG5qFhvYlq8SQ6EdorWGOOP7fCfCeopnLBxB_k6N4MBESFqbk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Involved Parents","postDate":"928698605","msgId":654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41OS42NTQuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":653,"nextInTime":655,"topicId":654,"numMessagesInTopic":0,"msgSnippet":"Villifying our parents and grandparents isn t the way to go here. I wasn t villifying my family or the system, simply stating that the model for todays ps","messageBody":"<div id=\"ygrps-yiv-1038059412\">Villifying our parents and grandparents isn&#39;t the way to go here.  <br/>\n<br/>\nI wasn&#39;t villifying my family or the system, simply stating that the model<br/>\nfor todays ps isn&#39;t one which is in place to teach real life skills. But my<br/>\nfamily (as far back as you&#39;d like to go) was never involved in making<br/>\ndecisions about schools.<br/>\n<br/>\nLois<br/>\n<br/>\n<br/>\nI just wanted to add a little story of my own on this subject.  My father<br/>\nis a politically active Deomocrat and a firm believer in the power of John<br/>\nQ. Public to change the world, at least in OUR political system.  I cannot<br/>\ncount the number of times that I heard the story about him being president<br/>\nof the school board when the oldest 4 kids in our family were in their<br/>\nprimary grades.  He is a firm believer in the whole idea of the ps system<br/>\nand an education for everyone.  Equality and the &quot;chicken in every pot&quot;<br/>\nAmerican dream.<br/>\n<br/>\nHowever, by the time I reached the public school system in the 80&#39;s (I am<br/>\ndating myself here) there were a lot more, and serious, problems with ps<br/>\nbesides the flaws inherent in the system that we all see as Unschoolers.  I<br/>\nalso grew up in a big city (San Francisco) and frankly ps was dangerous for<br/>\nme.  It wasn&#39;t the threat of violence, it was ACTUAL violence, performed on<br/>\nme, not around me although there was that too.  Of course there were LOTS<br/>\nof other problems too.  I was an avid reader and have always been a self<br/>\nmotivated learner, but I just did not do well in the ps.  <br/>\n<br/>\nMy father, however, being more of a concearned citizen than a father IMHO,<br/>\nkept my brother and I in ps NO MATTER WHAT, to satisfy his lofty<br/>\nprinciples, to pay homage to the IDEAL at the cost of his own youngest two<br/>\nchildren.  How is that for a parent SO involved in the education of their<br/>\nchildren (or at least in the education &quot;system&quot;) that they are not at all<br/>\ninvolved with the CHILDREN themselves, or in their lives?  To this day we<br/>\ndo not communicate well and he still has no idea who I really am, what I<br/>\nreally know or believe.  He is one of those parents that attributes every<br/>\nintelligent thing that comes out of your mouth to themselves (&quot;I wonder<br/>\nwhere you learned that?&quot; wink and nod to friends...&quot;)    <br/>\n<br/>\nNanci K. in Idaho</div>","specialLinks":[]}],"prevTopicId":624,"nextTopicId":475}}