{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":55779858,"authorName":"eagleacademymn","from":"&quot;eagleacademymn&quot; &lt;ForsythesEmail@...&gt;","profile":"eagleacademymn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT- Another reason to homeschool?","postDate":"1038949974","msgId":50892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFzajZvbSs4M2ZmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":50891,"nextInTime":50893,"topicId":50892,"numMessagesInTopic":0,"msgSnippet":"Seems like this info could easily get into the wrong hands... BOSTON - A little-noticed provision in a new federal education law is requiring high schools to","messageBody":"<div id=\"ygrps-yiv-187572487\">Seems like this info could easily get into the wrong hands...<br/>\n<br/>\nBOSTON - A little-noticed provision in a new federal education law is <br/>\nrequiring high schools to hand over to military recruiters some key <br/>\ninformation about its juniors and seniors:<br/>\nname, address and phone number.<br/>\n<br/>\nThe Pentagon says the information will help it recruit young people <br/>\nto defend their country. But the new law disturbs parents and <br/>\nadministrators in some liberal communities that aren&#39;t exactly gung-<br/>\nho about the armed forces.<br/>\n<br/>\nSome say the law violates students&#39; privacy and creates a moral <br/>\ndilemma over the military&#39;s &#39;&#39;don&#39;t ask, don&#39;t tell&#39;&#39; policy on gays.<br/>\n<br/>\n&#39;&#39;I find it appalling that the school is sending out letters to do <br/>\nthe job of the military,&#39;&#39; said Amy Lang, the parent of a student at <br/>\nCambridge Rindge and Latin School, where Coke was once banned in a <br/>\nprotest against the soda giant&#39;s investments in apartheid South <br/>\nAfrica. &#39;&#39;It&#39;s clearly an invasion of my daughter&#39;s privacy.&#39;&#39;<br/>\n<br/>\nThe No Child Left Behind law, signed last January, pumps billions <br/>\ninto education but also gives military recruiters access to the <br/>\nnames, addresses and phone numbers of students in 22,000 schools. The <br/>\nlaw also says that schools must give the military the same access to <br/>\ntheir campuses that businesses and college recruiters enjoy.<br/>\n<br/>\nSchool systems that fail to comply could lose federal money. The <br/>\nmeasure also applies to private schools receiving federal funding. <br/>\nBut Quaker schools and others that have a religious objection to <br/>\nmilitary service can get out of the requirement.<br/>\n<br/>\nStudents and parents who oppose the law can keep their information <br/>\nfrom being turned over to the military, but they must sign and return <br/>\nan &#39;&#39;opt-out&#39;&#39; form.<br/>\n<br/>\nThe Boston school system, which has 7,500 juniors and seniors, <br/>\nincluded the opt-out notice in a take-home student handbook, but <br/>\nfewer than a dozen parents opted out.<br/>\n<br/>\nSo far, 95 percent of the nation&#39;s schools are in compliance, said <br/>\nPentagon spokeswoman Maj. Sandra Troeber. She would not identify the <br/>\nother schools. But Education Department spokesman Dan Langan said <br/>\nthat the current focus is on cooperation and that no schools have <br/>\nbeen sanctioned.<br/>\n<br/>\nFederal law already requires men to register with the Selective <br/>\nService within 30 days of turning 18. The new law, however, enables <br/>\nthe Pentagon to reach potential recruits when they are 15 or 16.<br/>\n<br/>\nIn New York City, Daniel Alterman was taken aback when his 15-year-<br/>\nold son, a junior at Stuyvesant High, received a recruitment letter.<br/>\n<br/>\n&#39;&#39;Parents are in the dark,&#39;&#39; Alterman said. &#39;&#39;It freaked me out. I <br/>\ndidn&#39;t sign up to support the military effort.&#39;&#39;<br/>\n<br/>\nAlterman said after he opted out, his son received another letter, <br/>\nthis one promoting scholarships. &#39;&#39;It was very seductive. They didn&#39;t <br/>\nsay anything about risk to personal safety,&#39;&#39; Alterman said.<br/>\n<br/>\nAmong those objecting to the new requirements is the New York City <br/>\nchapter of the American Civil Liberties Union. Executive director <br/>\nDonna Lieberman said that the opt-out provision is inadequate and <br/>\nthat schools should be doing more to protect students&#39; privacy.<br/>\n<br/>\nIn a letter last month, Defense Secretary Donald Rumsfeld and <br/>\nEducation Secretary Rod Paige reminded high school administrators of <br/>\ntheir duty, and cited &#39;&#39;the excellent educational opportunities the <br/>\nmilitary affords, as well as an environment that encourages the <br/>\ndevelopment of strong character and leadership skills.&#39;&#39;<br/>\n<br/>\nThe Pentagon said better access to students could also hold down the <br/>\nrising costs of recruitment. Over the past decade, the cost per <br/>\nrecruit has nearly doubled from $6,500 to $11,600.<br/>\n<br/>\nBefore the law, military recruiters could meet with students in <br/>\nCambridge and Northampton on campus only if the student sought them <br/>\nout, and then only at a meeting attended by a guidance counselor. But <br/>\nCambridge held a military career fair at the high school a month ago.<br/>\n<br/>\n&#39;&#39;It&#39;s a vast departure from the way we&#39;ve done business,&#39;&#39; said <br/>\nDonna Harlan, an associate superintendent in the Northampton school <br/>\nsystem. &#39;&#39;We are not in the business of giving lists of names of kids <br/>\nto anybody. That was tough. The issue was if we were to receive <br/>\nfederal or state money, we had to comply with the law.&#39;&#39;<br/>\n<br/>\nThe law also spelled the end of a 6-year ban on military recruiting <br/>\non campus in Portland, Ore. After contending that the &#39;&#39;don&#39;t ask, <br/>\ndon&#39;t tell&#39;&#39; policy discriminates against gays, the school system now <br/>\ngives recruiters a shot at its 16,000 students.<br/>\n<br/>\nIn Massachusetts, Framingham High senior April Middleton decided over <br/>\nlunch recently that maybe the military is in her future after talking <br/>\nwith Army National Guard Sgt. Louis Perrin, a recruiter who visited <br/>\nthe cafeteria.<br/>\n<br/>\nMiddleton, 18, said she plans to enlist after she graduates, and the <br/>\nprospect of war has not scared her off. &#39;&#39;Sometimes you&#39;ve got to <br/>\nmake sacrifices,&#39;&#39; she said.<br/>\n<br/>\nSometimes, however, recruiters battle hostility.<br/>\n<br/>\n&#39;&#39;One teacher said we were trying to brainwash kids. All we were <br/>\ndoing was handing out pencils,&#39;&#39; Perrin said. &#39;&#39;We&#39;re not trying to <br/>\ninvade anybody&#39;s privacy. We&#39;re just trying to protect their <br/>\nfreedoms.&#39;&#39;<br/>\n<br/>\n AP-NY-12-02-02 1413EST</div>","specialLinks":[]}],"prevTopicId":50887,"nextTopicId":50870}}