{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":55326806,"authorName":"rumpleteasermom","from":"&quot;rumpleteasermom&quot; &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: gel candles safety tip","postDate":"1011883426","msgId":31284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEycDZqMitwOXYyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNkLjE4MTZhNDE4LjI5ODBiZjBiQGFvbC5jb20+"},"prevInTopic":31247,"nextInTopic":0,"prevInTime":31283,"nextInTime":31285,"topicId":31247,"numMessagesInTopic":0,"msgSnippet":"Yes Gel Candles can pose a greater fire risk than wax candles but . . . they do not explode. Claim:   Gel candles can explode, posing a greater-than-usual fire","messageBody":"<div id=\"ygrps-yiv-849994510\">Yes Gel Candles can pose a greater fire risk than wax candles <br/>\nbut . . . they do not explode.<br/>\n<br/>\n<br/>\nClaim:   Gel candles can explode, posing a greater-than-usual fire <br/>\nand injury hazard. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.snopes.com/toxins/gel.htm\">http://www.snopes.com/toxins/gel.htm</a> <br/>\n<br/>\nOrigins:   Yes, gel candles do pose fire and injury hazards beyond <br/>\nthose presented by ordinary wax candles, so they should be accorded <br/>\nan extra bit of caution if you&#39;re thinking of bringing them into your <br/>\nhome. However, as with so many e-mailed warnings, the  explanation <br/>\nprovided about what goes on is sadly in error and leaves those who <br/>\nare &quot;educated&quot; by it in the dark about what they should really be <br/>\npaying attention to as they are instead misled into worrying about <br/>\nthe mysterious (and non-existent) explosive properties of the gel. <br/>\n<br/>\nContrary to what this e-mailed warning would have you believe, gel <br/>\ncandles do not &quot;build up a gas&quot; that causes them to explode. <br/>\nThe &quot;gel&quot; in gel candles is composed of substances that burn slowly <br/>\nand non-combustively. Akin to the wax of traditional candles, the <br/>\nmysterious substance&#39;s purpose is to slowly feed the wick an <br/>\ncontinuous supply of fuel, thus keeping the candle burning bright for <br/>\na long time. Even if it were safe to use, a combustive substance <br/>\nwould expend itself far too quickly for any candle manufacturer to <br/>\nput it to this use. <br/>\n<br/>\nThere is a special danger inherent to gel candles, but it has to do <br/>\nwith the effect of heat on the containers that house them, not with <br/>\nthe gel itself. If the material used to contain the goo is not <br/>\nsufficiently resilient, it can shatter (i.e., &quot;explode&quot;) as the <br/>\nconcentrated heat of the candle&#39;s flame compromises it. The glass <br/>\ncontainers used to hold these popular fragrance candles are sometimes <br/>\nnot made strong enough to withstand the heat they are called upon to <br/>\ncontain. Heat makes things expand, and in this case it can cause the <br/>\nglass that houses the gel candles to shatter. There&#39;s no mysterious <br/>\ngas that builds up, no strange chemical reaction brought on by <br/>\ndangerous unnamed substances reacting to God-knows-what, just <br/>\nordinary expansion due to heat. Leave a coffee mug sitting on a hot <br/>\nburner long enough, and you&#39;ll see the same thing. <br/>\n<br/>\nIn this manner, a gel candle can explode in someone&#39;s hands, <br/>\nresulting in dire burns as the hot gel flows out to coat the victim&#39;s <br/>\nextremities. For this reason, it&#39;s important not to move either a lit <br/>\ngel candle or one that has recently been extinguished. Extinguish the <br/>\ncandle and let it cool, then move it. <br/>\n<br/>\nAdditionally, some lit gel candles have been observed to flare up, <br/>\nproducing flames shooting a few inches into the air, but these <br/>\ncandles were quickly recalled by their manufacturers (e.g., the 1998 <br/>\nrecall of 1.7 million Glade gel candles that produced flames 3 inches <br/>\nabove the top of 2.5 inch containers). Should you encounter a gel <br/>\ncandle that flares like this, extinguish it promptly, don&#39;t use it <br/>\nagain, and contact the manufacturer for a refund. <br/>\n<br/>\nAs for a fire started by a gel candle being &quot;so hot it melted the <br/>\nsmoke alarm,&quot; such a result wouldn&#39;t have anything to do with <br/>\nwhatever the candle was made from, but rather with the contents of <br/>\nthe home that became fuel for the growing conflagration. Also, that a <br/>\nfire can (and often does) become hot enough to melt a smoke detector <br/>\ndoes not, as the e-mail states, mean the melting occurs seconds after <br/>\nthe blaze starts, and therefore no warning is issued. Smoke detectors <br/>\nare routinely found melted into blobs the aftermath of house fires, <br/>\nbut these are the same smoke detectors that went off as soon as smoke <br/>\nwas sensed, alerting residents to the fire. <br/>\n<br/>\nThat gel candles will explode due to heat expansion shattering their <br/>\nglass containers outward is fact; that they&#39;re made of a mysterious <br/>\nchemical that touches off for no reason, with the uncontrolled <br/>\nburning of this substance resulting in immediate flash fires that <br/>\nmelt everything in their path in a scant matter of seconds, is pure <br/>\ninvention. <br/>\n<br/>\nBecause the heat expansion effect on the glass housings of gel <br/>\ncandles poses a real danger, this form of romantic lighting should <br/>\nnot be left lit for more than an hour or two. In common with all <br/>\ncandles, they should not be allowed to burn unattended (which <br/>\nincludes not leaving them lit while you drift off to sleep) or left <br/>\nin reach of a child, even for half a moment. Unattended candles of <br/>\nall stripes have started fires in which lives have been lost, so <br/>\ndon&#39;t take that caution lightly. As for kids and lit candles, it only <br/>\ntakes half a second to cause a lifetime&#39;s worth of scars. <br/>\n<br/>\nIf there&#39;s a power outage, be careful with the candles you use. Don&#39;t <br/>\nuse a lit candle to check inside a cupboard or closet (this is a <br/>\nlight source that also sets things on fire, remember, such as items <br/>\nhanging in a closet), and certainly never take a lit candle with you <br/>\nto check on what you think might be a fuel leak. <br/>\n<br/>\nCandles: Use them responsibly, be they gel or wax. <br/>\n<br/>\nBarbara &quot;waxing poetic&quot; Mikkelson</div>","specialLinks":[]},{"userId":21712089,"authorName":"staclarspr@aol.com","from":"staclarspr@...","profile":"lasvegashillgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"gel candles safety tip","postDate":"1011836171","msgId":31247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNkLjE4MTZhNDE4LjI5ODBiZjBiQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":31284,"prevInTime":31246,"nextInTime":31248,"topicId":31247,"numMessagesInTopic":0,"msgSnippet":"I thought you might find this something to look out for, I recieved this and want to pass it on FYI. ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-947857376\">I thought you might find this something to look out for, I recieved this and <br/>\nwant<br/>\nto pass it on FYI.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My former secretary had a terrible thing happen to her and her family last <br/>\n&gt; week, and I wanted to share it with all of you so that you could be warned <br/>\n&gt; and warn your friends and family as well. She had a gel candle burning in <br/>\n&gt; her bathroom ...it exploded and caught her house on fire. The house burned <br/>\n&gt; down and they lost everything. The fire marshal told her that this is not <br/>\n&gt; the first incident where a gel candle has exploded and caused a fire. He <br/>\n&gt; said that the gel builds up a gas and often times it explodes and sets fire <br/>\n&gt; to the room it is in, which is what happened to her. The fire was so hot it <br/>\n&gt; melted the smoke alarm, and they didn&#39;t discover the fire until there was <br/>\n&gt; an explosion, which was her toilet blowing up, and by then it was too <br/>\n&gt; late...the entire upstairs was engulfed in flames. Smoke damage and water <br/>\n&gt; damage have destroyed what wasn&#39;t destroyed by fire. Please pass  this <br/>\n&gt; along to anyone you care about. I wouldn&#39;t want this to happen to anyone <br/>\n&gt; else. Her family is devastated. All their mementos and everything of value <br/>\n&gt; and meaning are gone<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":31260,"nextTopicId":31285}}