{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","senderId":"lBJL93VHUK4FUph0ALgaXEZuKUfe61Bbj4_L4GQxwWjEIbqE-0pwM4TKp0kPGTqfgnyaZTFgGAo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Children & Advertising LONG","postDate":"1005595390","msgId":27609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTEyLjEzMDMxNi4tMTA0NjA3LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27607,"nextInTopic":0,"prevInTime":27608,"nextInTime":27610,"topicId":27603,"numMessagesInTopic":0,"msgSnippet":"... That was the Hot Wheels Volcano Blow Out set at our house.  Quite an eye opener at six for $55.00 saved from Christmas and birthday. ... My son especially","messageBody":"<div id=\"ygrps-yiv-1811733783\"><blockquote><span title=\"ireply\">&gt; My kids have figured out advertising too.  Sometimes from saving <br/>\n&gt; their money <br/>\n&gt; to buy something they ended up not liking.<br/>\n <br/>\n </span></blockquote>That was the Hot Wheels Volcano Blow Out set at our house.  Quite an eye<br/>\nopener at six for $55.00 saved from Christmas and birthday.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d rather help them see it clearly and then ignore it than try to <br/>\n&gt; hide it <br/>\n&gt; from them or them from it.<br/>\n<br/>\n </span></blockquote>My son especially likes the super wonder cleaner,  cleans everything, so<br/>\npowerful and concentrated you&#39;ll never need to use any other cleaner<br/>\nagain.  But wait, if you act now you&#39;ll get this window cleaner and floor<br/>\ncleaner absolutely free!  <br/>\nKids aren&#39;t stupid.<br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"IZauLMyFDST2M9Nsfurd0XeZQ5uwi6oOcRXd3g-jw_6OaIwSRkn6DAS5x8x6UBHy1hOoozi31gDO","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Children & Advertising LONG","postDate":"1005588866","msgId":27607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2MS4zYzgwZjExLjI5MjE2YjgyQGFvbC5jb20+"},"prevInTopic":27603,"nextInTopic":27609,"prevInTime":27606,"nextInTime":27608,"topicId":27603,"numMessagesInTopic":0,"msgSnippet":" My kids have figured out advertising too.  Sometimes from saving their money to buy something","messageBody":"<div id=\"ygrps-yiv-1303211244\">&lt;&lt;  By the end<br/>\nof her first day she saw the truth for herself. &gt;&gt;<br/>\n<br/>\nMy kids have figured out advertising too.  Sometimes from saving their money <br/>\nto buy something they ended up not liking.<br/>\n<br/>\nWe&#39;ve always discussed what&#39;s being sold and how (often without being <br/>\nclinical about it, sometimes obliquely or sarcastically, like &quot;Oooh!  If I <br/>\nbuy those genes I&#39;ll be 18 and have those guys around me!!&quot;)  They were <br/>\nreally very young when they applied critical thinking to the message on TV.  <br/>\nThe loving families, the beautiful scenery, the extra-nice houses.  They <br/>\nknow.   <br/>\n<br/>\nThere is lots of input from parodies in their lives too.  They&#39;ve heard Weird <br/>\nAl since they were little and he skewers TV constantly (and has also watched <br/>\nit a lot, or he couldn&#39;t make such elegant humor of it).<br/>\n<br/>\nI&#39;d rather help them see it clearly and then ignore it than try to hide it <br/>\nfrom them or them from it.<br/>\n<br/>\nWhen I was a kid and had friends and relatives whose parents did NOT want <br/>\ntheir children exposed to sex education or evolution, I saw that those kids <br/>\nthought about sex and evolution WAY more than I did, because their lives were <br/>\nbased, in part, on sex and evolution (avoidance thereof), and no doubt when <br/>\nthey were old enough they snuck out and read Darwin (which I certainly never <br/>\nread).<br/>\n<br/>\nWe don&#39;t have cable.  Not that cable saves you from advertising as it once <br/>\npromised it would do, but we have broadcast.  And it&#39;s free for the price of <br/>\nplugging in a free-from-friends TV.  The cost of it is enduring (or ignoring) <br/>\nthe commercials put there by the people who provided it for us free.<br/>\n<br/>\nWe have a close friend who works at an ad agency.  She&#39;s brought magazines <br/>\nfor the kids, and brought a video they used at a conference, and she&#39;s talked <br/>\nto them about how things unfold, who pays for what.  Two of their current <br/>\naccounts are with state tourism and the highway commission.  Tourism gets all <br/>\ndreamy sun-shots and mushy music.  Highway safety gets seatbelt scares.  <br/>\nThey&#39;re selling behavioral changes!  (Although most of the state tourism <br/>\nstuff is shown in other states, hoping to lure tourists here.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n&quot;Everything counts.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDoddArticles\">http://expage.com/SandraDoddArticles</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDodd\">http://expage.com/SandraDodd</a></div>","specialLinks":[]},{"userId":0,"authorName":"Cleopatra Rojas","from":"&quot;Cleopatra Rojas&quot; &lt;cleopatra@...&gt;","profile":"cleopatra2day","replyTo":"LIST","senderId":"exl08xUbzQplrqA6XDBfLns7XuIXbsTJEWlox8OiJiG35r57lT7OMA2mLyOyHskuItA9OlSh6B1lcWGR4yPNma4boNz5cq_Vhx28NFwysCr-KZWVLb9ZGAv6Lyc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Children & Advertising LONG","postDate":"1005588112","msgId":27603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTEyMTMwMTUyMDY4MC4wMEE4OEU4OUBtYWlsLjE4MDAtd29yay1mcm9tLWhvbWUuY29tPg==","inReplyToHeader":"PDEwMDU0Nzg5ODUuODg4LjY1OTM3Lm0xMkB5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDEwMDU0Nzg5ODUuODg4LjY1OTM3Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":27607,"prevInTime":27602,"nextInTime":27604,"topicId":27603,"numMessagesInTopic":0,"msgSnippet":"Hi guys, Jacli here :) Okay, get ready, outspoken comments to follow. I ve been following this video/deschooling/media thread with some interest. The question","messageBody":"<div id=\"ygrps-yiv-929205126\">Hi guys, Jacli here :)<br/>\nOkay, get ready, outspoken comments to follow.<br/>\nI&#39;ve been following this video/deschooling/media thread<br/>\nwith some interest.<br/>\nThe question was asked do we simply allow our children to<br/>\nbe fed <br/>\nadvertising.  This is a fairly important question in our<br/>\nhouse, for a few<br/>\nreasons:<br/>\n1) as devoted parents we are naturally concerned about the <br/>\npossible mind-washing commercials & ads can have<br/>\n2) Both my daughter and I are actresses.<br/>\n3) My husband is a computer program designer and I program<br/>\ngames<br/>\nas a hubby.<br/>\n<br/>\nWhere is the line?  When have we stepped over from<br/>\nresponsible to <br/>\ndictator?  I believe that someone else mentioned that they<br/>\ndo <br/>\nnot want to dictate to their kids how and when and what to<br/>\nwatch.<br/>\n<br/>\nHmm.  Personally I have to agree with Sandra and disagree<br/>\nwith the notion that all video games are harmful or evil.<br/>\nThat said I also disagree with letting<br/>\nkids be exposed to all sorts of advertising AND I disagree<br/>\nwith allowing them <br/>\nto pick and choose what they watch.<br/>\n<br/>\nThe fact is that my daughter enjoyed a huge amount of motor<br/>\nskill improvement directly because of video games.  They<br/>\nrequire a certain<br/>\namount of eye hand co-ordination that simply can&#39;t be<br/>\nattained by<br/>\nthe normal activities of childhood.  Her neurologist was<br/>\nthe one who <br/>\nsuggested I let her play the super nintendo.  It was one of<br/>\nthe few suggestions<br/>\nfrom that woman that worked. <br/>\n<br/>\nIt improved her ability to concentrate and pay attention<br/>\nand follow directions as well.<br/>\nShe was four at the time and obviously I wasn&#39;t letting her<br/>\nplay street fighter.<br/>\nThere are literally thousands of video games available.  If<br/>\nyou are seriously considering allowing your child to play<br/>\nthem You have to be willing to invest a little time and<br/>\ncheck them all out.  That&#39;s what I did.  I called Nintendo<br/>\nand they were very cooperative.  At the time they had only<br/>\nNintendo and Super Nintendo.  SNES was still new and they<br/>\nONLY had 400 titles available.  So they sent me a detailed<br/>\nlisting and description booklet.  It lists every single<br/>\ntitle, full description for each game as well as age<br/>\nrecommendations.  It is free and they still do this.  Just<br/>\ncall and ask.  So we got her Thomas the tank engine and<br/>\nstuff like that.  <br/>\n<br/>\nNow she is twelve years old and enjoys a whole slew of<br/>\nother games, at my discretion for the amount of time I<br/>\nspecify.  I do not feel it has had any adverse<br/>\neffect.  Are there times when she &quot;zones out&quot; and fails to<br/>\nhear or react to anything at all?  Sure.  But guess what?<br/>\nThe same thing happens when she reads Harry Potter or The<br/>\nHobbit.  I don&#39;t get too upset then so I don&#39;t get too<br/>\nupset when it happens during Legend of Zelda.<br/>\n<br/>\nAs for advertising, both she and I are actresses and<br/>\ncommercials are our bread and butter (but so is voice over<br/>\nreading for books btw).  But that doesn&#39;t stop me from not<br/>\nallowing her to watch the commercials.  It has been a rule<br/>\nin our house from the beginning.  She is not allowed to<br/>\nwatch commercials.  For the most part whenever possible we<br/>\nactually tape whatever she is going to watch and edit out<br/>\nthe ads.<br/>\n<br/>\nEither way there are still times when commercials come on<br/>\nand she catches one or two.  If its a funny one we laugh<br/>\nover it.  If it is a toy ad there are times when she buys<br/>\ninto it.  But I just remind her of the reality of tv.<br/>\nCommercials are made to sell.  Period.  Propaganda at its<br/>\ncapitalistic best.  These ads demonstrate the way our<br/>\neconomy works.  She understands that, but not only because<br/>\nwe took the time to explain it to her.  She has done<br/>\ncommercials and box covers for Hasbro toys.  For example<br/>\nThere is a certain toy that is designed to be made into<br/>\ndifferent things, space ships or crowns or little toy<br/>\nvillages or whatever.  When she first got called in to do<br/>\nthe new commercial and new line of boxes she was so excited<br/>\nshe was gonna get to play with this stuff en masse (it is<br/>\nvery expensive and she has only a limited supply at home)<br/>\nand learn how to make all the cool stuff on the boxes.  But<br/>\nthe reality was that the first thing they did was to<br/>\nexplain that there would be no playing.  It took two adult<br/>\nprofessional designers to make those creations.  Two adults<br/>\nwith nails, glue guns, wiring and invis-thread.  By the end<br/>\nof her first day she saw the truth for herself.<br/>\n<br/>\nI guess what I&#39;m saying is that I believe it is healthy to<br/>\nallow kids a limited amount of exposure to the<br/>\ncommercial/media process, just don&#39;t let them bathe in it.<br/>\n<br/>\nWell, that&#39;s my uninvited 2 cents worth.  Hope it helps.<br/>\nTake care, Jacli :)<br/>\n*********** REPLY SEPARATOR  ***********<br/>\n<br/>\nIn a message dated 11/10/01 9:24:27 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fuerst@...\">fuerst@...</a><br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The media producers and advertisers are majorly<br/>\n&gt;&gt;invested in us/our children spending as much time in<br/>\n </span></blockquote>front of their<br/>\n&lt;&lt;adverstisements as possible.   Do we simply allow our<br/>\nchildren to be fed<br/>\n&lt;&lt;this stuff? &gt;&gt;<br/>\n<br/>\n&lt;My kid aren&#39;t deciding what they want to do based on its<br/>\nadvertising.  Some <br/>\n&lt;toys are played with one day, even though the advertising<br/>\nwas great!   Mine <br/>\n&lt;still play original nintendo even though it hasn&#39;t been<br/>\nmarketted for ten <br/>\n&lt;years or so.  Who told them to do that?  They did it<br/>\nbecause it was fun.  And <br/>\n&lt;they did it even though they have flashier, newer &quot;cooler&quot;<br/>\nstuff in the house.&gt;<br/>\n&lt;I wonder what brain wave state dancers and jocks are in?<br/>\nIt&#39;s not possible <br/>\n&lt;to check them with today&#39;s equipment, because they&#39;re<br/>\nmoving during that <br/>\n&lt;activity, and this culture with it&#39;s work ethic values<br/>\nmovement over being <br/>\n&lt;still.<br/>\n&lt;Sandra&gt;</div>","specialLinks":[]}],"prevTopicId":27608,"nextTopicId":27614}}