{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":140240070,"authorName":"eriksmama2001","from":"&quot;eriksmama2001&quot; &lt;scubamama@...&gt;","profile":"eriksmama2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Night shift","postDate":"1091221194","msgId":97106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlZWNzYStxNnViQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":97105,"nextInTime":97107,"topicId":97106,"numMessagesInTopic":0,"msgSnippet":"I don t know. I do facilitate my son sleeping and waking on a day/night pattern that I can function on too. I do not make him sleep when he doesn t want to,","messageBody":"<div id=\"ygrps-yiv-1535872238\">I don&#39;t know. I do facilitate my son sleeping and waking on a <br/>\nday/night pattern that I can function on too. I do not make him sleep <br/>\nwhen he doesn&#39;t want to, but I do make the environment conducive <br/>\n(like riding in the car, rocking, quiet videos, lullabyes, etc.). I <br/>\nexplain when I perceive that his self-control behaviors are <br/>\ndeteriorating (voice getting very loud and unable or unwilling to <br/>\nconsider it&#39;s effect on others in the house, hitting or jumping on <br/>\nfurniture and being unable to be redirected to other hitting and <br/>\njumping activities.). I share my perception that he appears to be <br/>\ngetting tired or hungary. I know that you and I are both wanting our <br/>\nchildren to learn how to self-regulate meeting their sleep needs <br/>\nwithout impacting others, and without interfering with their learning <br/>\nby not making them sleep or wake according to our needs. <br/>\n<br/>\nIt is a very fine line. My need to function does not supersede his <br/>\nneed to learn unobstructed. Nor does his need to learn unobstructed <br/>\nsupersede my need to function with enough sleep. I use many tools to <br/>\nmeet my sleep needs irrelevant of my son&#39;s sleep patterns. (napping, <br/>\nresting while he is engaged elsewhere, others playing so I can rest, <br/>\nsleeping in or going to bed earlier when relief is available, etc.). <br/>\n<br/>\nBUT, and this is a BIG BUT, I do communicate how his sleep (or lack <br/>\nof sleep) pattern affects me WHEN his behavior impacts me due to him <br/>\nbeing tired or hungary. I let him know that he appears to be tired or <br/>\nhungary and I describe what I see and that I think we need to do xyz <br/>\nwind down activities. I do not MAKE him, but I do emphatically <br/>\nsuggest repeatedly that he appears to need some rest or to eat. <br/>\nSimilarly, if he is disturbing me while I am resting (rare now), I <br/>\nlet him know that I do not have the energy for some activities and <br/>\ntend to be grouchy if I do not get enough rest, just like he does. If <br/>\nhe insists he needs me, I do choose to meet his needs if no other <br/>\nsolution is available or agreeable. <br/>\n<br/>\nOn the other hand, I do rouse him from a nap to shorten it if it <br/>\nappears that a long nap will cause us to all be up until 1 or 2 am <br/>\nwithout enough sleep. Usually, I can just sleep when he sleeps and <br/>\nthis works for us. Or my husband and I take turns if we are on a late <br/>\npattern. BUT, and again this is a BIG BUT, I do not MAKE him wake up. <br/>\nExcitedly attempt to engage him to awaken, yes, but if he is clearly <br/>\ncommunicating that he doesn&#39;t want to get up, I don&#39;t MAKE him <br/>\nmiserable. In my sleep deprived state, such as you are describing, I <br/>\ndid try that out of desperation, but it was so against my principles <br/>\nthat I knew it wasn&#39;t a solution we could live with. I knew that we <br/>\ncould creatively solve the problem without coercion. <br/>\n<br/>\nIs initiating waking him from a nap or telling him he needs rest <br/>\ncoercion? I don&#39;t think so, if I don&#39;t force it against his will. The <br/>\nkey is trying to persuade, listening and both of us having the <br/>\nopportunity to change our mind when etiher person says &quot;No, I don&#39;t <br/>\nwant to&quot;. My son doesn&#39;t have coercion used to make him do things he <br/>\ndoesn&#39;t want to do. I believe this is a key to his flexibility in <br/>\nchoosing to accomodate others&#39; desires. Not always, of course. <br/>\n<br/>\nFlexibility of all parties involved can be compromise or even <br/>\ndemocracy. However, in compromise and even in democracy someone <br/>\nconcedes something. A dictatorship assumes someone dictates or <br/>\ndecides, no matter if it is benevolent. Common preference means <br/>\nchoosen by agreement of the parties involved, no one concedes or <br/>\ndecides for the others involved.<br/>\n<br/>\nA whole new way of interacting? For many adults and for most <br/>\nchildren, yes. It IS respecting (attention to, consideration of, <br/>\nreguard for) others, but it is more than benevolence (kindness), it <br/>\nis honoring another&#39;s right to self-determination.<br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In UnschoolingDiscussion@yahoogroups.com, &quot;Robyn Coburn&quot; <br/>\n&lt;dezigna@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;little mirror for me to learn about myself. He is so acutely in <br/>\n </span></blockquote>tune <br/>\n<blockquote><span title=\"ireply\"> &gt; a little bit. I am amazed at his ability to read me. He is <br/>\n&gt; NOT &quot;acting out&quot;; he is calling out for the calm mama. He will even <br/>\n&gt; start saying &quot;little baby needs his mama&quot;.&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; I am so happy to read this - I had forgotten this about Jayn. <br/>\n </span></blockquote>Exhaustion and<br/>\n<blockquote><span title=\"ireply\"> &gt; grumpiness really are contagious, aren&#39;t they? Just as much as joy <br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; calmness.<br/>\n&gt; <br/>\n&gt; Over the past few nights I have been very tired and crabby. Early <br/>\n </span></blockquote>in the<br/>\n<blockquote><span title=\"ireply\"> &gt; week Jayn suddenly switched to her up-all-night mode, instead of <br/>\n </span></blockquote>slowly<br/>\n<blockquote><span title=\"ireply\"> &gt; moving to it over a period of weeks. I was playing catch-up and felt<br/>\n&gt; desperate for sleep. Two nights ago she seemed to be crazier and <br/>\n </span></blockquote>wilder the<br/>\n<blockquote><span title=\"ireply\"> &gt; closer to morning it got (the tireder I got), including kicking me <br/>\n </span></blockquote>in the<br/>\n<blockquote><span title=\"ireply\"> &gt; head and laughing about it when I sat down near her. <br/>\n&gt; <br/>\n&gt; I find it very hard to stop her from hitting and kicking out. <br/>\n </span></blockquote>Sometimes I am<br/>\n<blockquote><span title=\"ireply\"> &gt; literally just batting her hands away from my face, or desperately <br/>\n </span></blockquote>holding<br/>\n<blockquote><span title=\"ireply\"> &gt; her arms down, while keeping her body far enough away that she <br/>\n </span></blockquote>can&#39;t bite<br/>\n<blockquote><span title=\"ireply\"> &gt; me. I am reluctant to hold her until she is calm, after reading Jan <br/>\n </span></blockquote>Hunt&#39;s<br/>\n<blockquote><span title=\"ireply\"> &gt; article &quot;The Dangers of Holding Therapy&quot; ( www.naturalchild.org ) <br/>\n </span></blockquote>although<br/>\n<blockquote><span title=\"ireply\"> &gt; it is tough to know what to do instead. I do tell her to take deep <br/>\n </span></blockquote>breaths<br/>\n<blockquote><span title=\"ireply\"> &gt; and that helps her. <br/>\n&gt; <br/>\n&gt; It is clear to me that the best solution generally is to avoid <br/>\n </span></blockquote>things<br/>\n<blockquote><span title=\"ireply\"> &gt; escalating to the point where she is acting crazy. In the daytime <br/>\n </span></blockquote>if there<br/>\n<blockquote><span title=\"ireply\"> &gt; is restlessness we can run outside to the pool, go to the park, or <br/>\n </span></blockquote>just run<br/>\n<blockquote><span title=\"ireply\"> &gt; about the neighborhood. At four in the morning these options are <br/>\n </span></blockquote>denied us,<br/>\n<blockquote><span title=\"ireply\"> &gt; if only in consideration of the other apartment dwellers across the<br/>\n&gt; courtyard. Nor can she do too much big jumping and running in our <br/>\n </span></blockquote>second<br/>\n<blockquote><span title=\"ireply\"> &gt; floor apartment. Also my brain is not usually mush when I am less <br/>\n </span></blockquote>tired.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The first thing I did differently the following night was make sure <br/>\n </span></blockquote>she had<br/>\n<blockquote><span title=\"ireply\"> &gt; more food more regularly. My internal appetite/clock is so out of <br/>\n </span></blockquote>whack that<br/>\n<blockquote><span title=\"ireply\"> &gt; I just am not feeling hungry, so I had been waiting for her to let <br/>\n </span></blockquote>me know<br/>\n<blockquote><span title=\"ireply\"> &gt; that she was hungry. It made a lot of difference to just put out a <br/>\n </span></blockquote>bowl of<br/>\n<blockquote><span title=\"ireply\"> &gt; cut fruit and some eggs and bacon at appropriate (relative to hours <br/>\n </span></blockquote>awake<br/>\n<blockquote><span title=\"ireply\"> &gt; rather than the clock) times.<br/>\n&gt; <br/>\n&gt; The second thing was rather than squabble over the television (we <br/>\n </span></blockquote>were<br/>\n<blockquote><span title=\"ireply\"> &gt; arguing over who was going to watch the big tv for goodness sake) I <br/>\n </span></blockquote>decided<br/>\n<blockquote><span title=\"ireply\"> &gt; to use her little tv/dvd combo to catch up on some dvd&#39;s that I <br/>\n </span></blockquote>have wanted<br/>\n<blockquote><span title=\"ireply\"> &gt; to see, using the headphones for quiet. To my pleased amazement, <br/>\n </span></blockquote>Jayn has<br/>\n<blockquote><span title=\"ireply\"> &gt; spent the last two nights letting me do quite a lot of this quiet <br/>\n </span></blockquote>watching,<br/>\n<blockquote><span title=\"ireply\"> &gt; which is easy to pause when she needs something, while playing <br/>\n </span></blockquote>nearby. She<br/>\n<blockquote><span title=\"ireply\"> &gt; gets to watch her stuff, or have the big set off. We have also done <br/>\n </span></blockquote>more<br/>\n<blockquote><span title=\"ireply\"> &gt; reading, and she has been playing with her musical instruments. The <br/>\n </span></blockquote>main<br/>\n<blockquote><span title=\"ireply\"> &gt; plus is that I don&#39;t have to listen to yet another rerun of &quot;Max <br/>\n </span></blockquote>and Ruby&quot;.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The third thing has been that she has spent some time in the <br/>\n </span></blockquote>evening (her<br/>\n<blockquote><span title=\"ireply\"> &gt; morning) playing with dh, a crucial break for both of us. He had <br/>\n </span></blockquote>been out of<br/>\n<blockquote><span title=\"ireply\"> &gt; the house for the first couple of &quot;angry&quot; nights, by coincidence, <br/>\n </span></blockquote>and pretty<br/>\n<blockquote><span title=\"ireply\"> &gt; much going directly to bed when he got home. Not having to be her <br/>\n </span></blockquote>sole<br/>\n<blockquote><span title=\"ireply\"> &gt; source of interaction has made me feel less pressured.<br/>\n&gt; <br/>\n&gt; The slow march back to daytime continues. Today she went to sleep a <br/>\n </span></blockquote>little<br/>\n<blockquote><span title=\"ireply\"> &gt; earlier than I would have liked at about 9.10am. Unless this is <br/>\n </span></blockquote>just a nap,<br/>\n<blockquote><span title=\"ireply\"> &gt; she will awaken at about 6.30 - 7pm. I&#39;m about to go to bed now. <br/>\n </span></blockquote>I&#39;m going<br/>\n<blockquote><span title=\"qreply\"> &gt; to keep the idea of her as a mirror in the forefront of my mind. <br/>\n&gt; <br/>\n&gt; Great post, Pat. I&#39;ve saved it in my Unschooling Keepers folder.<br/>\n&gt; <br/>\n&gt; Robyn L. Coburn<br/>\n&gt; <br/>\n&gt; ---<br/>\n&gt; Outgoing mail is certified Virus Free.<br/>\n&gt; Checked by AVG anti-virus system (http://www.grisoft.com).<br/>\n&gt; Version: 6.0.732 / Virus Database: 486 - Release Date: 7/29/2004 </span></blockquote></div>","specialLinks":[]}],"prevTopicId":97082,"nextTopicId":97064}}