{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":417372321,"authorName":"newwaysofteaching","from":"&quot;newwaysofteaching&quot; &lt;newwaysofteaching@...&gt;","profile":"newwaysofteaching","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son impulse control/ innappropriate/unhappy/hitting/pushing","postDate":"1255714915","msgId":48023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhiYWI5Mys4cjg1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5MTYzNS40MzUyMy5xbUB3ZWI0NTEwMi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":47905,"nextInTopic":0,"prevInTime":48022,"nextInTime":48024,"topicId":47864,"numMessagesInTopic":0,"msgSnippet":"Hello Kelli, I am brand new to this board and wanted to reach out to you because I too lost a house last year, my father suffered a stroke and heart attack","messageBody":"<div id=\"ygrps-yiv-1655540440\">Hello Kelli,<br/>\nI am brand new to this board and wanted to reach out to you because I too lost a house last year, my father suffered a stroke and heart attack that left him immoble and completely dependent on care and a danger to himself. My father in law has been battling cancer and my husband was laid off numerous times. I had to find homes for my 2 large dogs who had been with us for a decade and said goodbye to them forever. We moved from the west coast to the east coast for work and have just finally settled into a regular paycheck again.<br/>\n<br/>\nI so understand how chaotic life is in the midst of that. I felt that my now 4 and 14 year old, were not getting all of me because I was pushed to my brink, worrying about the unknown and just in survival mode.<br/>\n<br/>\nI had guilt because I moved my older child around and I did have him in school. I felt guilt that my energy was used to support my mom, who was falling apart with my dad&#39;s new condition, instead of being focused on my own family. Even though my toddler was by my side she was not getting all I could give. I felt guilty leaving my mother for work across the country, but couldn&#39;t find a way to survive where we were at. <br/>\n<br/>\nAfter moving, I was overwhelmed for months even though I was able to focus on my family again and stop worrying about my husband&#39;s work and a roof over our heads. It took time to process all the stuff I had been through.<br/>\n<br/>\nI just hope to tell you to be kind to yourself, when you are in the midst of so much stress and pressure, it is okay to fall apart a little. My advice is to keep dreaming, keep making plans for a way out and give what you can, but don&#39;t dwell too much in the negative. Try to remember that life ebbs and flows, you are in an ebb now but will flow again.<br/>\n<br/>\nI am still rebuilding our lives here, new to an area with no friends or family. I am going to school, so that keeps my mind in more positive places.<br/>\n<br/>\nI am no expert in autism, but I can tell you that learning about all of the different educational theories, most of our ideas of education are built upon- including unschooling- really helps me tremendously to feel empowered to parent better. I can recognize things developmentally or cognitively in them that before I might have struggled with and felt like I am doing something wrong. Learning that children have their own time developmentally and learning ways to bring out the gifts each of our children has, by following their lead, has opened new doors for me.<br/>\n<br/>\nTHings will get better, that is the nature of life-up and down- so don&#39;t lose sight of that. Thanks for sharing.<br/>\n<br/>\nDelilah<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Kelli Johnston &lt;kaipelesmom@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all, I am very reluctant to post this because I feel like with all the information out there and all the times I have read responses, I should be able to figure this out. I am also aware of ways my husband and I are exasperating the situation if not creating it but I am still completely overwhelmed and stuck. <br/>\n&gt; <br/>\n&gt; The underlying back story is that our lives are in a constant state of stress and scramble because of a horrific year. We are losing our house for one and in the process of trying to find a new job for my husband possibly across the country or internationally. We need the jobto change  as we can&#39;t afford to rent where we currently live. My father in law was in a tragic drowning accident a few months ago in the ocean of Nicaragua. We are extremely close to my inlaws and they are neighbors so the loss was devestating. My mother inlaw requires a lot of support at this time and is also losing her house. We had to put our dog down. I just had my second, 2nd trimester miscarriage in 2 years. I threw up all day long for 3 months with both pregnancies and wasn&#39;t able to be the Parent I wanted to be.  My step father&#39;s cancer has metastized (we found this out a couple weeks ago). As u can see stress is our life right now.<br/>\n&gt; <br/>\n&gt; My husband and I try to be kind to our son and offer support and participation in the ways that make him happy. During the times when things are completely going his way, he is happy and kind. The moment he has to negociate his agenda (whether it be for safety or because of conflict with others) he blows up and often resorts to namecalling and hitting). I feel like we are very accomodating and give him a lot of freedom but because of all the challenges we are facing, it has become difficult. <br/>\n&gt; <br/>\n&gt; I haven&#39;t been as present because of the pregnancies and sickness. I do admit that at some point after he is hitting me or others continually that I am not very supportive and feel really vulnerable because he is 7 and very strong. He also disregards people in public situations, pushing them out of the way and often calls people or children &quot;stupid&quot;, &quot;idiot&quot; or tells them to shut up mainly because they are interfering with his agenda in some way. I often have to wait till we are alone to talk to him because he becomes violet and it escalates if I try in the moment- plus he is fast. I do a lot of prepation talking so that he knows the appropriate way to be in situations but his impulse control gets in the way. Once we are alone sometimes he agrees he should act differently and other tiMes he still insists that his agenda (even if it is just that he believes he should be able to walk where he wants) is more important than being kind. He really doesn&#39;t seem<br/>\n&gt;  to  care for others feelings unless he believes it will help him get something he wants.<br/>\n&gt; <br/>\n&gt; On top of this I have a 5 year old that needs a lot of social interaction and she is often making it difficult for me to predict ways to ensure my son has the support or facilitation he needs. I am sure in a way it is a reaction to a lifetime of feeling like he gets all the attention so she resorts to crying and screaming almost constantly to assert he existance. So times when I should be right there with my son helping him, my daughter has chosen that time to scream and cry and demand something.  <br/>\n&gt; <br/>\n&gt; In any case, all of this is of course hurting unschooling in our home. My son was previously diagnosed with autism and was in school from 2-5 years. I admit that our relationship is disconnected to say the very least. His school experience was mostly negative which is why I took him out. He is very bright- teaching himself how to read. He likes to play one-on one with certain children but isn&#39;t interested in most social situations and believes strangers to be enemies until proven otherwise.  He hates authority figures, will quit anything unless it is perfect or he is a winner. I know that socially he is probably delayed and his lack of enpathy is related to the autism diagnosis but basically i dont think about the label anymore. I have basically been by his side facilitating his play and social interaction since he was a baby. I do admit that I avoid leaving the house sometimes because it seems that negative experiences outway the good and I am<br/>\n&gt;  exhausted. Meanwhile my daughter would be happier in those social situations my son can&#39;t handle.  <br/>\n&gt; <br/>\n&gt; At this point I am sad because I dont have any joy as a parent and everything seems to be falling apart. My husband feels the same way, if not worse as he is gettig pressure from family that the kids need harsh discipline. I feel that it won&#39;t help to treat them that way but how we are parenting isn&#39;t leading our children to be kind happy people either. I want to turn this around and I am so sad that most people in my son&#39;s life don&#39;t like him or want to be around him.  Please help! <br/>\n&gt; -Kelli<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":346626599,"authorName":"Tina Boster","from":"&quot;Tina Boster&quot; &lt;tinaboster@...&gt;","profile":"guideforthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Son impulse control/ innappropriate/unhappy/hitting/pushing","postDate":"1255358475","msgId":47905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFRThGNjFGRUE3NDRDQ0RBQTQyRDQwMzRCQUU5RkI0QFRpbmFQQz4="},"prevInTopic":47868,"nextInTopic":48023,"prevInTime":47904,"nextInTime":47906,"topicId":47864,"numMessagesInTopic":0,"msgSnippet":"While I don t have any of the extenuating circumstances of the OP, I do/did have a similar dynamic with my children.  My son (Trevor 9) was labeled with an","messageBody":"<div id=\"ygrps-yiv-606032631\">While I don&#39;t have any of the extenuating circumstances of the OP, I do/did<br/>\nhave a similar dynamic with my children.  My son (Trevor 9) was labeled with<br/>\nan autism spectrum disorder when he was in school, and he has many of the<br/>\nsame issues mentioned in the OP including the lack of empathy, poor social<br/>\nskills, perfectionistic tendencies, and a low ability to deal with losing.<br/>\nMy daughter (Abby 4) does not cry and such, but she does tend to do things<br/>\nto draw attention to herself in negative ways - mainly by doing things to<br/>\naggravate her siblings.  In addition, I have an older son (Toby 12) who sits<br/>\nback in quiet resignation until he has had enough annoying from his sister<br/>\nor lack of attention from me - at which time he becomes incredibly<br/>\nunhelpful.<br/>\n<br/>\n <br/>\n<br/>\nThe situation and our family dynamic has improved over time - partly due to<br/>\nthe improved level of maturity on the part of all family members, including<br/>\nmyself, and also in part due to my increased ability to pay attention to my<br/>\nchildren&#39;s cues and act appropriately.<br/>\n<br/>\n <br/>\n<br/>\nAs far as the daughter in the OP is concerned, I also doubt very seriously<br/>\nthat she is intentionally picking those specific times to behave in the<br/>\ndescribed manor.  I know that I tend to notice my other children&#39;s behavior<br/>\nmore when I am working on Trevor&#39;s problems than I would otherwise.  <br/>\n<br/>\n <br/>\n<br/>\nThe Social Skills Picture Book by Jed Baker has been an amazing tool for our<br/>\nfamily.  I have been using this book with Trevor since he was five.  The<br/>\nbook uses photos to tell a story with two different outcomes - one positive,<br/>\nand one negative.  We have taken our signal phrases from this book.  For<br/>\nexample, we use the phrase &quot;loose a game, win a friend&quot; to deal with losing.<br/>\nProvided we review the story on a regular basis, this little phrase gives<br/>\nTrevor enough time to collect himself before he reacts.<br/>\n<br/>\n <br/>\n<br/>\nI intentionally avoid taking Trevor into any situation that I know will be<br/>\ndifficult for him.  This piece of advice has already been passed out in this<br/>\nthread, but it really can&#39;t be stressed enough for any child.  It&#39;s one of<br/>\nthose things that should be said many times by many people:  Don&#39;t put your<br/>\nkids into situations they can&#39;t or won&#39;t handle well.  <br/>\n<br/>\n <br/>\n<br/>\nIt is so very important to have people who can help out when my children<br/>\nhave conflicting needs.  Abby has friends she can go places with while I<br/>\nstay with Trevor.  Many times, someone else will stay with Trevor while I<br/>\ntake another child somewhere.  I also have to be proactive with the<br/>\nattention I provide my children.  Over time I have learned to read their<br/>\ncues, and I have learned how best to meet their different needs for<br/>\nattention.  It has taken a lot of time and practice, but splitting them up<br/>\non a regular basis helps tremendously.<br/>\n<br/>\n <br/>\n<br/>\nI can&#39;t do much about how people outside my family perceive my children -<br/>\nespecially Trevor.  It does hurt to know that people don&#39;t like him.  It is<br/>\nirritating when people believe he is the way he is because of the way I<br/>\nparent him - especially since the exact reverse is true.  I have found that<br/>\nas far as extended family goes, talking to them about autism and providing<br/>\nthem with literature has gone a long way to soften their perceptions of him.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nTina<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son impulse control/ innappropriate/unhappy/hitting/pushing","postDate":"1255110840","msgId":47868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVEOTgyMDkxRDUwNzQ4Mzg4NEEyODQyQkZFM0Q4NDFCQExZTEFMQVAyPg==","inReplyToHeader":"PENCNTFEM0YxNUE0RjRGMUI4MzE0ODYyNzM3RThDRDczQExZTEFMQVAyPg==","referencesHeader":"PDE5MTYzNS40MzUyMy5xbUB3ZWI0NTEwMi5tYWlsLnNwMS55YWhvby5jb20+IDxDQjUxRDNGMTVBNEY0RjFCODMxNDg2MjczN0U4Q0Q3M0BMWUxBTEFQMj4="},"prevInTopic":47867,"nextInTopic":47905,"prevInTime":47867,"nextInTime":47869,"topicId":47864,"numMessagesInTopic":0,"msgSnippet":"i meant to also add, make sure not to marginalize your daughter s feelings, needs and reactions, or let them be overshadowed by your son s intense needs.  this","messageBody":"<div id=\"ygrps-yiv-1757803701\">i meant to also add, make sure not to marginalize your daughter&#39;s feelings, needs and reactions, or let them be overshadowed by your son&#39;s intense needs.  this is easy to do when one child is less intense, or seems more capable of  managing everyday situations.  it can breed sibling resentment and a lot more disharmony in the family.  <br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son impulse control/ innappropriate/unhappy/hitting/pushing","postDate":"1255107921","msgId":47867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCNTFEM0YxNUE0RjRGMUI4MzE0ODYyNzM3RThDRDczQExZTEFMQVAyPg==","inReplyToHeader":"PDE5MTYzNS40MzUyMy5xbUB3ZWI0NTEwMi5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PDE5MTYzNS40MzUyMy5xbUB3ZWI0NTEwMi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":47866,"nextInTopic":47868,"prevInTime":47866,"nextInTime":47868,"topicId":47864,"numMessagesInTopic":0,"msgSnippet":"... haven t been as present because of the pregnancies and sickness. I do admit that at some point after he is hitting me or others continually that I am not","messageBody":"<div id=\"ygrps-yiv-385035339\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n </span></blockquote> haven&#39;t been as present because of the pregnancies and sickness. I do admit that at some point after he is hitting me or others continually that I am not very supportive and feel really vulnerable because he is 7 and very strong. He also disregards people in public situations, pushing them out of the way and often calls people or children &quot;stupid&quot;, &quot;idiot&quot; or tells them to shut up mainly because they are interfering with his agenda in some way. I often have to wait till we are alone to talk to him because he becomes violet and it escalates if I try in the moment- plus he is fast. I do a lot of prepation talking so that he knows the appropriate way to be in situations but his impulse control gets in the way. Once we are alone sometimes he agrees he should act differently and other tiMes he still insists that his agenda (even if it is just that he believes he should be able to walk where he wants) is more important than being kind. He really doesn&#39;t seem<br/>\nto care for others feelings unless he believes it will help him get something he wants.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>i really feel your struggle, and have certainly been there, although not with all the other stressors you describe in your life.  this section above really described my son around that age  - and even more so at 8-9.  i would urge you (with the word urge beying the root of *urgent*) to pull WAY back on public, social, and other stressful activities - and by stressful i mean *stressful for your son*.  if he is reacting that way he is clearly stressed by the situation - even if other kids his age aren&#39;t, even if he *says* he agrees with you on how he &quot;should&quot; respond.  he needs to be protected from his own lack of impulse control, his own strong feelings and tendencies to act out.  if he is repeatedly put into situations where he reacts &quot;wrongly&quot;, that can be so erosive to his self esteem in the long run.  he will start to think of himself as the &quot;bad one&quot;, the &quot;mean one&quot; and the one who doesn&#39;t care about others.<br/>\n<br/>\n  pull back, figure out how to get your daughter&#39;s needs met in other ways, be creative and flexible with what you think you have to do, and when, and spend some time meeting your son *where he is at* intead of pushing him to be somewhere else developmentally.  really.  truly.  it&#39;s urgent.  because if you think your lives are stressful now, imagine if things were worse with your son - imagine if he never agreed that there was a different way to be.  imagine if he reacted with anger and negativitiy even when he DID have choices.   imagine all the ways  in which he&#39;s much more functional than he could be, and then let go of what he could be - in both directions, positive and negative, and embrace what is.  :)<br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son impulse control/ innappropriate/unhappy/hitting/pushing","postDate":"1255098797","msgId":47866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCOUEyMDIwLTg0MzYtNDdGRS04QUU0LTJFMTBDODg5QTQ4OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE5MTYzNS40MzUyMy5xbUB3ZWI0NTEwMi5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PDE5MTYzNS40MzUyMy5xbUB3ZWI0NTEwMi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":47865,"nextInTopic":47867,"prevInTime":47865,"nextInTime":47867,"topicId":47864,"numMessagesInTopic":0,"msgSnippet":"-=The underlying back story is that our lives are in a constant state of stress and scramble because of a horrific year. -=- Would it have been easier or","messageBody":"<div id=\"ygrps-yiv-2032097972\">-=The underlying back story is that our lives are in a constant state  <br/>\nof stress and scramble because of a horrific year. -=-<br/>\n<br/>\nWould it have been easier or different if the kids had been in school?<br/>\nIf so, maybe school would be better than chaos and loss and  <br/>\ndepression.  It&#39;s possible.<br/>\nIf not, then that&#39;s another confirmation that you do want to unschool.<br/>\n<br/>\nDid your son want to stay home, or was he liking school?   If he  <br/>\ndidn&#39;t choose to come home, that might be a factor.<br/>\n<br/>\nDo you know other unschoolers in person who might be able to talk to  <br/>\nyou about what you might do differently?  People who have seen your  <br/>\nfamily operating normally both before and during the emergency  <br/>\nsituations?<br/>\n<br/>\n-= I feel like we are very accomodating and give him a lot of freedom  <br/>\nbut because of all the challenges we are facing, it has become  <br/>\ndifficult. -=-<br/>\n<br/>\nInstead of &quot;freedom&quot; could you think &quot;choices&quot;?  Freedom carries a  <br/>\nwild connotation that isn&#39;t true or realistic in a world where other  <br/>\npeople also have &quot;freedom.&quot;  He might be feeling bigger than he is (in  <br/>\nterms of space that&#39;s &quot;his&quot;).  Some people are that way by nature, but  <br/>\nsome have it thrust upon them by parents who communicate some version  <br/>\nof &quot;Don&#39;t worry about what those other people think; so what you want  <br/>\nto do.&quot;   If he has choices within the bounds of what&#39;s courteous and  <br/>\nlegal and sensible, that might not be as much problem (even in your  <br/>\nown thinking) as the idea of &quot;freedom.&quot;<br/>\n<br/>\n-=-I haven&#39;t been as present because of the pregnancies and sickness.  <br/>\nI do admit that at some point after he is hitting me or others  <br/>\ncontinually that I am not very supportive and feel really vulnerable  <br/>\nbecause he is 7 and very strong-=-<br/>\n<br/>\nMaybe he needs you too much for there to be other pregnancies.  I&#39;m  <br/>\nsorry you&#39;ve had rough pregnancies and heartbreaking losses.  It&#39;s  <br/>\nawful.  But your son is already there and might need more than some  <br/>\nother seven year olds need.<br/>\n<br/>\n-=- He also disregards people in public situations, pushing them out  <br/>\nof the way and often calls people or children &quot;stupid&quot;, &quot;idiot&quot; or  <br/>\ntells them to shut up mainly because they are interfering with his  <br/>\nagenda in some way. I often have to wait till we are alone to talk to  <br/>\nhim because he becomes violet and it escalates if I try in the moment-- <br/>\n=-<br/>\n<br/>\nSo if he calls someone &quot;Stupid&quot; or tells someone to &quot;shut up,&quot; you  <br/>\ndon&#39;t say anything apologetic to them?  You don&#39;t have any code  <br/>\nphrases for &quot;be nice&quot;? or any reminders for him to calm down?<br/>\n<br/>\nIf he could learn (in calm times) to breathe slowly that might help.<br/>\nWhat about martial arts for him?  Not a streetfighting kind of wild  <br/>\nschool, but a traditional Shoryn Ryu or a school that&#39;s not about  <br/>\ntournaments but it&#39;s about the purity of the art, and  learning to  <br/>\ncontrol strengths?<br/>\n<br/>\n-=-I do a lot of prepation talking so that he knows the appropriate  <br/>\nway to be in situations but his impulse control gets in the way. -=-<br/>\n<br/>\nRethink what you  mean by &quot;knows.&quot;<br/>\nIf he agrees (at the age of seven, and maybe not a maturely reasoning  <br/>\nseven) with you by nodding or saying &quot;okay,&quot; that doesn&#39;t mean  <br/>\n&quot;knows.&quot;   And &quot;Knowing&quot; should involve understanding and the ability  <br/>\nto make decisions within that knowledge.  I think you&#39;re wrong to  <br/>\nthink &quot;he knows the appropriate way to be.&quot;<br/>\n<br/>\nHe&#39;s young.  He&#39;s beset by crying, puking adults and a dead dog.  His  <br/>\nlife isn&#39;t good right now.  He does NOT know the appropriate way to be.<br/>\n<br/>\n-=On top of this I have a 5 year old that needs a lot of social  <br/>\ninteraction and she is often making it difficult for me to predict  <br/>\nways to ensure my son has the support or facilitation he needs.-=-<br/>\n<br/>\nToo many words, not enough picture.   Separate the kids more so that  <br/>\none is with you and the other is with another adult, and let her have  <br/>\na life that doesn&#39;t involve her brother every day, or she could end up  <br/>\nfrustrated and angry too.<br/>\n<br/>\n-=-So times when I should be right there with my son helping him, my  <br/>\ndaughter has chosen that time to scream and cry and demand something.-=-<br/>\n<br/>\nDo you think of it that way?  That a five year old deliberately  <br/>\ndecided to wait until you&#39;re busy with your son to scream and cry and  <br/>\ndemand?<br/>\n<br/>\nChildren have real needs.  Parents who put children off are asking for  <br/>\nthe blow-up.  If you meet their needs before they even ask, things  <br/>\nwill be calmer.  If you wait until they ask and say &quot;later,&quot; the bad  <br/>\nsituation is parent-created.<br/>\n<br/>\n-=- He hates authority figures, will quit anything unless it is  <br/>\nperfect or he is a winner.-=-<br/>\n<br/>\nSo  keep him away from &quot;authority&quot; situations for a while, and always  <br/>\nhave something new for him to do when he quits the thing he&#39;s doing  <br/>\nnow.  Have a series of &quot;next things&quot; ready.  Expect him to quit; count  <br/>\non it.  Don&#39;t shame him about it.  He&#39;ll get older and wiser, with  <br/>\ntime and help.<br/>\n<br/>\n-=- want to turn this around and I am so sad that most people in my  <br/>\nson&#39;s life don&#39;t like him or want to be around him. Please help! -=-<br/>\n<br/>\n&quot;Turn it around&quot; is an extreme thought.<br/>\nThink of making this moment better.  Then the next moment better.  Not  <br/>\nperfect, just better.   Not &quot;have a good day,&quot; but have a good moment.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337265206,"authorName":"bradj","from":"&quot;bradj&quot; &lt;bhmjones@...&gt;","profile":"bhmjones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son impulse control/ innappropriate/unhappy/hitting/pushing","postDate":"1255097787","msgId":47865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhbmdqcis5cTV2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5MTYzNS40MzUyMy5xbUB3ZWI0NTEwMi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":47864,"nextInTopic":47866,"prevInTime":47864,"nextInTime":47866,"topicId":47864,"numMessagesInTopic":0,"msgSnippet":"... Kelli, I personally feel you are taking on too much responsibility. Perhaps your husband is as well. I feel your responsibilities and focus should","messageBody":"<div id=\"ygrps-yiv-1118264465\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Kelli Johnston &lt;kaipelesmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Please help! <br/>\n&gt; -Kelli<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Kelli, I personally feel you are taking on too much responsibility. Perhaps your husband is as well. I feel your responsibilities and focus should immediately be redirected to just you and your immediate family, i.e., you, your husband, and your two children. I feel you should immediately clear your calender of all but the most essential commitments. It simply sounds as if you need to unload some of the weight off your shoulders so that you and your child/ren can focus more on each other. People, including children, are mostly products of their environments. If it is a chaotic environment, so will they/we be. If it is a peaceful happy environment, so will they/we be.</div>","specialLinks":[]},{"userId":280305582,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;kaipelesmom@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Son impulse control/ innappropriate/unhappy/hitting/pushing","postDate":"1255095814","msgId":47864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MTYzNS40MzUyMy5xbUB3ZWI0NTEwMi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":47865,"prevInTime":47863,"nextInTime":47865,"topicId":47864,"numMessagesInTopic":0,"msgSnippet":"Hi all, I am very reluctant to post this because I feel like with all the information out there and all the times I have read responses, I should be able to","messageBody":"<div id=\"ygrps-yiv-940931946\">Hi all, I am very reluctant to post this because I feel like with all the information out there and all the times I have read responses, I should be able to figure this out. I am also aware of ways my husband and I are exasperating the situation if not creating it but I am still completely overwhelmed and stuck. <br/>\n<br/>\nThe underlying back story is that our lives are in a constant state of stress and scramble because of a horrific year. We are losing our house for one and in the process of trying to find a new job for my husband possibly across the country or internationally. We need the jobto change  as we can&#39;t afford to rent where we currently live. My father in law was in a tragic drowning accident a few months ago in the ocean of Nicaragua. We are extremely close to my inlaws and they are neighbors so the loss was devestating. My mother inlaw requires a lot of support at this time and is also losing her house. We had to put our dog down. I just had my second, 2nd trimester miscarriage in 2 years. I threw up all day long for 3 months with both pregnancies and wasn&#39;t able to be the Parent I wanted to be.  My step father&#39;s cancer has metastized (we found this out a couple weeks ago). As u can see stress is our life right now.<br/>\n<br/>\nMy husband and I try to be kind to our son and offer support and participation in the ways that make him happy. During the times when things are completely going his way, he is happy and kind. The moment he has to negociate his agenda (whether it be for safety or because of conflict with others) he blows up and often resorts to namecalling and hitting). I feel like we are very accomodating and give him a lot of freedom but because of all the challenges we are facing, it has become difficult. <br/>\n<br/>\nI haven&#39;t been as present because of the pregnancies and sickness. I do admit that at some point after he is hitting me or others continually that I am not very supportive and feel really vulnerable because he is 7 and very strong. He also disregards people in public situations, pushing them out of the way and often calls people or children &quot;stupid&quot;, &quot;idiot&quot; or tells them to shut up mainly because they are interfering with his agenda in some way. I often have to wait till we are alone to talk to him because he becomes violet and it escalates if I try in the moment- plus he is fast. I do a lot of prepation talking so that he knows the appropriate way to be in situations but his impulse control gets in the way. Once we are alone sometimes he agrees he should act differently and other tiMes he still insists that his agenda (even if it is just that he believes he should be able to walk where he wants) is more important than being kind. He really doesn&#39;t seem<br/>\n to  care for others feelings unless he believes it will help him get something he wants.<br/>\n<br/>\nOn top of this I have a 5 year old that needs a lot of social interaction and she is often making it difficult for me to predict ways to ensure my son has the support or facilitation he needs. I am sure in a way it is a reaction to a lifetime of feeling like he gets all the attention so she resorts to crying and screaming almost constantly to assert he existance. So times when I should be right there with my son helping him, my daughter has chosen that time to scream and cry and demand something.  <br/>\n<br/>\nIn any case, all of this is of course hurting unschooling in our home. My son was previously diagnosed with autism and was in school from 2-5 years. I admit that our relationship is disconnected to say the very least. His school experience was mostly negative which is why I took him out. He is very bright- teaching himself how to read. He likes to play one-on one with certain children but isn&#39;t interested in most social situations and believes strangers to be enemies until proven otherwise.  He hates authority figures, will quit anything unless it is perfect or he is a winner. I know that socially he is probably delayed and his lack of enpathy is related to the autism diagnosis but basically i dont think about the label anymore. I have basically been by his side facilitating his play and social interaction since he was a baby. I do admit that I avoid leaving the house sometimes because it seems that negative experiences outway the good and I am<br/>\n exhausted. Meanwhile my daughter would be happier in those social situations my son can&#39;t handle.  <br/>\n<br/>\nAt this point I am sad because I dont have any joy as a parent and everything seems to be falling apart. My husband feels the same way, if not worse as he is gettig pressure from family that the kids need harsh discipline. I feel that it won&#39;t help to treat them that way but how we are parenting isn&#39;t leading our children to be kind happy people either. I want to turn this around and I am so sad that most people in my son&#39;s life don&#39;t like him or want to be around him.  Please help! <br/>\n-Kelli</div>","specialLinks":[]}],"prevTopicId":48021,"nextTopicId":47993}}