{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"A","from":"A &lt;mumsienc@...&gt;","replyTo":"LIST","senderId":"DAJ8hfGxX_vfLXEOhMj2RWyXyor1ey08_lpBwr3Qm71qVoVykqrAzjPWiyOgpAmTpC1YIzSK_WQ1M3fzE3PKcg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]My Moccasins","postDate":"989282740","msgId":20784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBRjc0MUI0LjE1OTM5ODFDQGFsbHRlbC5uZXQ+","referencesHeader":"PDIwMDEwNTA3MjA1MDM2LjQ1Njg3LnFtYWlsQHdlYjEwMjA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":20759,"nextInTopic":0,"prevInTime":20783,"nextInTime":20785,"topicId":20755,"numMessagesInTopic":0,"msgSnippet":"Eileen, People like you always really help me with my life.  I am so in awe of people who can turn hardship into positive.  I am very bad at that, but try hard","messageBody":"<div id=\"ygrps-yiv-718915275\">Eileen,<br/>\nPeople like you always really help me with my life.  I am so in awe of people<br/>\nwho can turn hardship into positive.  I am very bad at that, but try hard to<br/>\ndo it.<br/>\nA positive attitude is EVERYTHING!  Thanks for reminding me once again.<br/>\nYour son is very lucky, as probably you are too....<br/>\nThanks for sharing.<br/>\nAnn</div>","specialLinks":[]},{"userId":0,"authorName":"scrunchy","from":"scrunchy &lt;scrunchy@...&gt;","replyTo":"LIST","senderId":"Y1Kav6JlLUMssNq97AH1ZZOZt4Z6xnmw4ggCoOXm5r7ZWfMlbm8xEJYi_exKMYyezlw5GHb3t19_tSi-3_qHIUhwrcM4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]My Moccasins","postDate":"989272595","msgId":20759,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBRjcxQTEzLjcwRjM4NzJCQHN3YmVsbC5uZXQ+","referencesHeader":"PDIwMDEwNTA3MjA1MDM2LjQ1Njg3LnFtYWlsQHdlYjEwMjA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":20755,"nextInTopic":20784,"prevInTime":20758,"nextInTime":20760,"topicId":20755,"numMessagesInTopic":0,"msgSnippet":"Eileen, Thank you for sharing your story. After reading this, I am convinced that you have more courage than most people I have ever met. Please stay here.","messageBody":"<div id=\"ygrps-yiv-1671727607\">Eileen,<br/>\n<br/>\n    Thank you for sharing your story. After reading this, I am convinced<br/>\nthat you have more courage than most people I have ever met. Please stay<br/>\nhere. Your perspective is different than mine, because you are you.  You<br/>\nand your son are miracles. I  appreciate  and respect your comments very<br/>\nmuch.<br/>\nNorma<br/>\n<br/>\n&quot;Eileen M.&quot; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Your child was not my child.  And you were not me.<br/>\n&gt;<br/>\n&gt; But if you use your imagination, I think you *can*<br/>\n&gt; think of just such a situation.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Eileen M.","from":"&quot;Eileen M.&quot; &lt;ravensegg@...&gt;","replyTo":"LIST","senderId":"Q8M_pPhR6GgPF4eLe83Fr0SZzXvXkR6-mhpBVJRCV_cELRJGB1qvhw0WitTYPIX75thlq40EenMGHjfQmR_rU64p39UWKOVF","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[Unschooling-dotcom]My Moccasins","postDate":"989268636","msgId":20755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTA3MjA1MDM2LjQ1Njg3LnFtYWlsQHdlYjEwMjA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":20759,"prevInTime":20754,"nextInTime":20756,"topicId":20755,"numMessagesInTopic":0,"msgSnippet":"... I can t ... Your child was not my child.  And you were not me. But if you use your imagination, I think you *can* think of just such a situation. Think of","messageBody":"<div id=\"ygrps-yiv-1147250396\">--- Jon and Rue Kream &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:skreams@...\">skreams@...</a>&gt; wrote:<br/>\n<br/>\nI can&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; think of a situation in<br/>\n&gt; which carrying my child would not &quot;hold him&quot;.<br/>\n<br/>\n </span></blockquote>Your child was not my child.  And you were not me. <br/>\n<br/>\nBut if you use your imagination, I think you *can*<br/>\nthink of just such a situation.  <br/>\n<br/>\nThink of a situation in which you are recovering from<br/>\ncancer which you avoided treating for seven months,<br/>\nagainst doctor&#39;s recommendations,  because you wanted<br/>\nto give your baby the best chance possible rather than<br/>\naborting him.  Imagine that after he was born he was<br/>\nthe most beautiful thing you&#39;d ever seen, that you<br/>\nloved him with all of your heart... and that twenty<br/>\nminutes later his heart stopped beating and he stopped<br/>\nbreathing, and that the doctors rushed in and snatched<br/>\nhim from your arms, and that for nearly an hour you<br/>\nthought he was dead.<br/>\n<br/>\nThink of a situation in which your child&#39;s immune<br/>\nsystem was not normal, so that he could not be cared<br/>\nfor by someone else or go to a public place without<br/>\nfear that he would be killed or damaged by a simple<br/>\ncold or flu virus.  Imagine he had seizures, so that<br/>\nyou had to watch him and worry about him all the time.<br/>\n<br/>\nImagine that his blood sugar would not regulate, that<br/>\nyou had to poke him with needles to check his blood<br/>\nevery two hours until his tiny toes were like<br/>\npincushions.  <br/>\n<br/>\nThink of a situation in which you have degenerative<br/>\nspinal discs and &#39;benign tremors&#39; (think of<br/>\nParkinsons, except that the weakness and tremors<br/>\nhappen when you are trying to use your muscles rather<br/>\nthan when you are at rest); imagine that these<br/>\nconditions existed relatively unnoticed and<br/>\nundiagnosed until the trauma of your pregnancy,<br/>\ncancer, and the birth of your child started a chain<br/>\nreaction that severely worsened the symptoms.  Imagine<br/>\nthat you had watched your grandfather become entirely<br/>\ncrippled, unable to even feed himself, with this same<br/>\ncondition, and that now your doctors told you that<br/>\nthis was a likely fate for you sometime in your<br/>\nfuture.  Imagine that you had been an artist, but now<br/>\nwere unable to control your hands enough to do your<br/>\nwork.  Imagine you were dealing with this change in<br/>\nyour life at the same time that you are dealing with<br/>\nall these other things.<br/>\n<br/>\nThink of a situation in which your husband was working<br/>\ntwo full time jobs in order to pay for your and your<br/>\nchild&#39;s medical bills, so that you are acting in<br/>\neffect as a single mom.  Think of living with the<br/>\nknowledge that one more serious illness on either of<br/>\nyour parts would leave you homeless.  <br/>\n<br/>\nThink of a situation in which your life seemed to be<br/>\njust one long round of doctor visits, and that the<br/>\ndoctors couldn&#39;t tell you if your child would ever<br/>\nlove you, or talk, or look at your face, or sit on<br/>\nyour lap without struggling and screaming.  Imagine<br/>\nthat in the scant moments during which your son slept,<br/>\nyou spent every waking moment searching for something<br/>\nto help him.  Think of finding something after two<br/>\nyears of searching, and doing it even though your<br/>\ntoddler screamed as though he were being boiled alive<br/>\nfor the entire duration of each treatment, and the<br/>\ndoctors told you that it wasn&#39;t likely do any good at<br/>\nall; imagine that it was agonizingly painful to you<br/>\nand left you with crippling chronic back pain and more<br/>\ndamaged discs.  <br/>\n<br/>\nThink of a situation in which you felt horrendously<br/>\nguilty the whole time you were applying this<br/>\ntreatment, because your child so obviously felt that<br/>\nyou were torturing him for no reason, and you weren&#39;t<br/>\nso sure he wasn&#39;t right.  Imagine that the horrible<br/>\nthing you were doing primarily consisted of simply<br/>\nholding him in your arms (with a little eye contact<br/>\nthrown in for good measure)... and that he would<br/>\nscream and struggle like a trapped animal for two<br/>\nhours straight, so long and hard that he would fall<br/>\nasleep every twenty minutes or so, and then wake up<br/>\nscreaming again... Imagine that for a stretch of time<br/>\n(seems like forever) you did this for several hours a<br/>\nday.<br/>\n<br/>\nThink of a situation in which those conditions might<br/>\nconspire to make it difficult to always perfectly hold<br/>\non to a wildly struggling and fast-moving child,<br/>\nespecially while also trying to walk across a crowded<br/>\nclinic parking lot. <br/>\n<br/>\nI don&#39;t have to think of it.  I lived it.  My son and<br/>\nhusband lived it.  Our extended family lived it.  We<br/>\nstill live much of it, to some degree or other.  But<br/>\nsome things are now much, much better.<br/>\n<br/>\nI&#39;ve had enough drama to last a lifetime.  I&#39;ve<br/>\nlearned to stop making decisions based on what &#39;most<br/>\npeople&#39; think... most people thought my child would<br/>\nnever be capable of demonstrative affection, or<br/>\n&#39;normal&#39; mental functioning.  He&#39;s not *average*, but<br/>\nhe is the most affectionate, demonstrative,<br/>\nsweet-tempered, sensitive eleven year old male I have<br/>\never met.  He has trouble interpreting people&#39;s<br/>\nexpressions and body language, and some social cues...<br/>\nbut he helps others who are in trouble, is generous,<br/>\nand is a gifted writer.  He is the light of my life. <br/>\nAnd he is extremely demonstrative, even in public,<br/>\nwith his old mom.  He knows it isn&#39;t Cool.  He doesn&#39;t<br/>\ncare.  The people who have known him from birth know<br/>\nhe&#39;s a miracle.<br/>\n<br/>\nSo does he.<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Auctions - buy the things you want at great prices<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a></div>","specialLinks":[]}],"prevTopicId":20729,"nextTopicId":20647}}