{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Tooth saga update.","postDate":"1122696708","msgId":107608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRjZXVtNCs2b3NkQGVHcm91cHMuY29tPg=="},"prevInTopic":107531,"nextInTopic":0,"prevInTime":107607,"nextInTime":107609,"topicId":107531,"numMessagesInTopic":0,"msgSnippet":"Robyn, Thanks for sharing your story.  My boys have told me that they don t like our dentist and would like me to look for another, so reading your story was","messageBody":"<div id=\"ygrps-yiv-2071875333\">Robyn,<br/>\n<br/>\nThanks for sharing your story.  My boys have told me that they don&#39;t <br/>\nlike our dentist and would like me to look for another, so reading your <br/>\nstory was very helpful to me.  <br/>\n<br/>\nI missed the arnica suggestion, but I did want to let you know that <br/>\narnica pellets are sugar pellets.  The arnica is sprayed onto the sugar <br/>\npellets but you can&#39;t taste it.  So it&#39;s like eating sugar. :) <br/>\n<br/>\nSheila<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In response to the arnica suggestion, Jayn would not take a pellet <br/>\n </span></blockquote>once a<br/>\n<blockquote><span title=\"ireply\"> &gt; day, let alone every hour. Any palliative or healing herbal medicines <br/>\n </span></blockquote>would<br/>\n<blockquote><span title=\"ireply\"> &gt; have to be dissolved in liquid and either tasteless or tasty. She has <br/>\n </span></blockquote>one<br/>\n<blockquote><span title=\"ireply\"> &gt; more week of antibiotics, just to be sure, and she is taking a bit of<br/>\n&gt; acidophilus powder dissolved. I open the capsules and sprinkle. She <br/>\n </span></blockquote>finds<br/>\n<blockquote><span title=\"qreply\"> &gt; the liquid supplements too sour, but is eating yoghurt.<br/>\n&gt; <br/>\n&gt; Robyn L. Coburn </span></blockquote></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Tooth saga update.","postDate":"1122443668","msgId":107531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGRjNWF1OSsxdWViQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":107608,"prevInTime":107530,"nextInTime":107532,"topicId":107531,"numMessagesInTopic":0,"msgSnippet":"Jayn had the work done on her teeth, including several fillings and the one extraction, yesterday. It went very smoothly after a couple of tiny hiccups, and","messageBody":"<div id=\"ygrps-yiv-860227285\">Jayn had the work done on her teeth, including several fillings and the one<br/>\nextraction, yesterday. It went very smoothly after a couple of tiny hiccups,<br/>\nand she is recovering extremely quickly and enjoying the sensation of having<br/>\na gap in her mouth.<br/>\n<br/>\nWe talked over the procedure beforehand and Jayn was not keen on having a<br/>\npinch. But we arrived a little early and were prepared to wait for her<br/>\nwillingness. <br/>\n<br/>\nWhen we got to the dental surgery, the only person out front was the<br/>\nanesthesiologist, a stranger to Jayn. She introduced herself and was very<br/>\nnice, gave us the paperwork, but the dentist was not around. I had a kind of<br/>\nintuition that she wasn&#39;t intending to come out, and I also noticed that<br/>\nJayn was beginning to get anxious, not seeing her. So Jayn and I went back<br/>\nin search of her, at which time Jayn got a big relieved smile and told her<br/>\nthe story about the sky falling as usual. <br/>\n<br/>\nShe was waiting in her office, and later she explained that she usually<br/>\ndoesn&#39;t come out, but leaves this first part to the anesthetist. That would<br/>\nprobably be fine in the case of children who had been coming there for<br/>\nyears, but I could tell that Jayn was not happy with that arrangement. After<br/>\nall the whole point was to find a DENTIST Jayn liked, not an office<br/>\nenvironment she liked.<br/>\n<br/>\nJayn went up into the tree house and repeated that she didn&#39;t want a pinch.<br/>\nI said that the pinch was to help her sleep so that it wouldn&#39;t hurt, and<br/>\nsaid &quot;I know you don&#39;t want it&quot; sympathetically a few times, and asked her<br/>\nto tell me what she was scared of...I also told her that we would wait until<br/>\nshe is ready. After a remarkably few minutes she agreed to have the pinch<br/>\nand chose which leg, and then came down from the tree to sit in my arms. <br/>\n<br/>\nThe injection was over in a moment, with the an&#39;ist telling Jayn everything<br/>\nshe was doing, and then she chose her prize (a colored slinky) from the<br/>\nmagic tree, and after a few moments started fading and staggering. I put her<br/>\non my lap wrapped in her own blanket. I was asked to sing her a little song,<br/>\nor tell a story, so that she would stop fighting it, and then she was quite<br/>\nliterally gone. I carried her back to the chair, and stayed with her until<br/>\nthe IV was in, and they put some paper tape to keep her eyes closed. Then<br/>\nJames and I waited in the waiting room reading magazines and listening to<br/>\nthe drilling - feeling grateful that Jayn was not &quot;hearing&quot; that stuff. He<br/>\ntiptoed back once to check it out, and was given an update, and I did too. <br/>\n<br/>\nWhat was most reassuring to me, was the lengthy conversation that James and<br/>\nthe an&#39;ist had about her new high tech portable monitors and the detailed<br/>\nexplanation of the different drugs that were being used in a cocktail for<br/>\nJayn&#39;s comfort. It was entirely worth the extra money to have the<br/>\nspecialist, just for my peace of mind. It was all over in two hours, and we<br/>\njust had to wait for Jayn to become sufficiently alert to leave. I was<br/>\nbeside her as she started to come to, and I carried her to the waiting room<br/>\nto wait on my lap again - almost as if we had never moved.<br/>\n<br/>\nOnce she was muttering and responding to our questions somewhat we put her<br/>\nin the car and left. I just about melted with love when the first full clear<br/>\nsentence she said was, &quot;Thank you for sitting in the back with me Mommy&quot;.<br/>\n<br/>\nJayn woke up somewhat, vomited once (just water) and then went to sleep for<br/>\nwhat might have been an early night, except that she woke up after about 5<br/>\nhours, hungry and energetic, and stayed awake until 6.30am - so no<br/>\ninterruption to her own schedule!<br/>\n <br/>\nShe got up today, Tuesday, full of beans at 2pm, ready to go to the<br/>\nAquarium. There has been none of the drowsiness or wooziness that we were<br/>\nwarned of. No swelling or bleeding. Her sense of taste seems to have<br/>\nreturned, and she has had no pain at all. She is chafing at one restriction<br/>\n- no popcorn - but uncaring of the other - no straws. Her one resentment is<br/>\nthat she didn&#39;t get to see her tooth coming out, as she has reproached me<br/>\nfor. She also remembers getting the pinch and choosing her slinky, which is<br/>\nunusual. Apparently most kids don&#39;t recall the injection.<br/>\n<br/>\nNow she just will get a spacer inserted in two weeks. <br/>\n<br/>\nIn response to the arnica suggestion, Jayn would not take a pellet once a<br/>\nday, let alone every hour. Any palliative or healing herbal medicines would<br/>\nhave to be dissolved in liquid and either tasteless or tasty. She has one<br/>\nmore week of antibiotics, just to be sure, and she is taking a bit of<br/>\nacidophilus powder dissolved. I open the capsules and sprinkle. She finds<br/>\nthe liquid supplements too sour, but is eating yoghurt.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.338 / Virus Database: 267.9.5/58 - Release Date: 7/25/2005</div>","specialLinks":[]}],"prevTopicId":107593,"nextTopicId":107615}}