{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":109501676,"authorName":"Retta Fontana","from":"Retta Fontana &lt;rettafontana@...&gt;","profile":"rettafontana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: I don&#39;t like to play either","postDate":"1065187531","msgId":16495,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDAzMTMyNTMxLjU2MDkyLnFtYWlsQHdlYjE0MjA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":16490,"nextInTopic":0,"prevInTime":16494,"nextInTime":16496,"topicId":16490,"numMessagesInTopic":0,"msgSnippet":"I always thought I was the only one who didn t like to play!!  Now I know that I only wanna play what I wanna play.  Participating in a game is what I","messageBody":"<div id=\"ygrps-yiv-1360653957\">I always thought I was the only one who didn&#39;t like to play!!  Now I know that I &#39;only wanna play what I wanna play.&#39;  Participating in a game is what I sometimes do, but that to me, isn&#39;t  the purest form of &#39;playing.&#39;  I like the play definition of &quot;frolic.&quot;   I love to experiment with clay (hand building or wheel throwing) - but it&#39;s serious for me.  I like to play with words too.  That&#39;s probably as close as I come to frolicking.   My repressive, abusive upbringing seriously damaged my ability to frolic really freely (not to mention my nervous system.)  Sadly, we somewhat repressed our firstborn, a 15yo, but not as severely as his Dad and me got.  I feel pretty badly about that, but he&#39;s more than making up for it now.  Our 10yo is really free though.<br/>\n <br/>\nMy teacher told me that I&#39;m not responsible for teaching the kids anything.  I&#39;m responsible for following my own joy, then they&#39;ll understand that it&#39;s ok to follow theirs.  I offer them as much support as possible.  Sometimes the 10you will play with my clay or pastels, or dough, whatever I&#39;m playing with at the moment.  We do lots of things together, but only what is joyful for both of us.  Torture is useless - I had to write this on the fridge as a litmus test for unschooling for months.  I was really in bad shape.  I&#39;m a Recovering Schooler.<br/>\n <br/>\nI just read a great unschooler book, &quot;And the children played&quot; by Patricia Joudry.  Her kids did nothing but play until they were 12, then they were insatiable for information.  This helped me relax all over again.  Funny book, good writer - 10yo loved it.  That&#39;s one of our favorite ways of playing, reading funny books together.  Atleast it feels like play to me, maybe because I was never read to.<br/>\n <br/>\nI don&#39;t think there&#39;s much hope of me loosening up much more, but I keep investigating things that might inspire...<br/>\n <br/>\nRetta<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nThe New Yahoo! Shopping - with improved product search<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":145247851,"authorName":"Noemi Hiraishi","from":"&quot;Noemi Hiraishi&quot; &lt;noeminh@...&gt;","profile":"diafelizus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I don&#39;t like to play either","postDate":"1065145618","msgId":16490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMWIwMWMzODk1MSQzZmU4OTdmMCQwMjAzYThjMEB5b3VyeTQ4NjgwanY5aT4="},"prevInTopic":0,"nextInTopic":16495,"prevInTime":16489,"nextInTime":16491,"topicId":16490,"numMessagesInTopic":0,"msgSnippet":"Hi, I am too, unschooler s mother of 9yo.  I too, am not good at games and don t enjoy playing them.  But I have found that there is one game that I like to ","messageBody":"<div id=\"ygrps-yiv-436325742\">Hi,<br/>\n<br/>\nI am too, unschooler&#39;s mother of 9yo.  I too, am not good at games and don&#39;t<br/>\nenjoy playing them.  But I have found that there is one game that I like to<br/>\nplay.  And when dd asks me to play a board game with her, we play that one.<br/>\n<br/>\nBut ever since I decided to become a full time mother, when dd turned 3, I<br/>\ndecided at that time that playing was the most important aspect of<br/>\nchildrenhood. So I did my best to go outside when she demanded it.  And when<br/>\noutside I had, have set that I will be there.  I would have fun.  (I am a<br/>\nfirm believer of what O. Fred Donaldson &quot;Playing by Heart&quot; writes in this<br/>\nbook.)<br/>\n<br/>\nWe are the only hs of our area but I am glad that I was lucky to find always<br/>\nplaymates for dd; I invited children to play at my place, I offered mothers<br/>\nto look after their children, I opened my home to children.<br/>\n<br/>\nTo this day, playing is what dd does all day long, and that is what she<br/>\nlikes the most. She is healthy and I have nothing to complain about her.<br/>\n(If I could wish, I wished that she read and wrote a little bit more...).<br/>\nAs she plays all day long, she leaves me time to my own reading!<br/>\n<br/>\nI believe that one does not have to like playing with its children to become<br/>\na unschooler; one needs to believe that children are a learning machine and<br/>\nbe honest all the time.<br/>\n<br/>\nlove and peace, noemi fm Tokyo.</div>","specialLinks":[]}],"prevTopicId":16491,"nextTopicId":16498}}