{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":152560627,"authorName":"tumile@comcast.net","from":"tumile@...","profile":"tumile1123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"News: State Allows Growing Trend of Home Cooking","postDate":"1088386964","msgId":95959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MjgyMDA0MDE0Mi4xMjUwNC40MERGNzc5MzAwMEVGRTQ1MDAwMDMwRDgyMjAwNzYxNDM4MEEwNDA3MDM5QTlCQGNvbWNhc3QubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":95958,"nextInTime":95960,"topicId":95959,"numMessagesInTopic":0,"msgSnippet":"News Report State Allows Growing Trend of Home Cooking September 2, 2099 After much heated debate on the House floor, legislation was passed today to allow a","messageBody":"<div id=\"ygrps-yiv-1876239835\">News Report<br/>\nState Allows Growing Trend of Home Cooking<br/>\nSeptember 2, 2099<br/>\n<br/>\n       After much heated debate on the House floor, legislation was passed today to allow a growing number of families to cook meals for their families in their homes.  The children must have annual physical examinations to assure proper growth and weight gain.  Attempts to require weekly meal plans and monthly kitchen inspections were voted down.<br/>\n       A spokesperson from the National Dietetic Association (NDA) condemns this decision.  &quot;These children are being denied the rich socialization and diversity that is an essential part of the public food experience.  Without the proper nutritional background, it is impossible for the average person to feed their own children.  We, as professionals, see this as a step backwards and speak out for the sake of the children who cannot speak for themselves.&quot;<br/>\n       Homecooking parents say the benefits of eating at home include increased family unity and the ability to tailor a diet to a particular need.  Elizabeth Crocker, a home cooking mother, states, &quot;We started cooking and eating at home when we realized that our son had a severe allergy to certain foods.  The public kitchens required him to take numerous medications that had serious side effects in order to control his allergy.  We found that eliminating those foods was a simpler method and our son has thrived since we began doing so.&quot;   <br/>\n       After this experience, the Crockers decided to home cook for all of their children, and converted their study into a dining room.  Elizabeth says, &quot;We have experienced so much closeness as we have explored recipes and spent time cooking together and eating together.  We have a dining co-op with other families where we share ideas and meals together.&quot;<br/>\n       The Crocker children have done well physically under their mother&#39;s care, weighing in at optimum weights for their ages and having health records far above average.  It should be noted that Mrs. Crocker, while not a professional nutritionist, has a family history rich with nutritionists and home economists.  &quot;Surely the success of the Crocker children is due to the background of their mother,&quot; responded the spokesperson from the the NDA.  &quot;The results they have achieved should not be viewed as normative.&quot;<br/>\n       Mrs. Crocker counters that her background was actually a hindrance to the nutritioonal principles she follows.  &quot;Our paternal great-grandmother was a home economist, but she prepared most meals from pre-made mixes.  In our homecooking we try not duplicate public-kitchen meals, but to tailor our meals to the needs and preferences of our children.&quot;<br/>\n       In a related issue, legislation is in committee that would provide oversight for the emerging homecooking movement.  Says the Home Cooking Legal Defense Association (HCLDA):  &quot;We want to provide umbrella kitchens to aid parents in the complicated tasks of feeding their children.  Many families lack the expertise of the Crocker family, yet desire to eat at home.  As we have seen, the umbrella kitchens meet the needs of all concerned.  We are happy to provide this service.&quot;</div>","specialLinks":[]}],"prevTopicId":95931,"nextTopicId":95961}}