{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"brendaclaspell@aol.com","from":"brendaclaspell@...","replyTo":"LIST","senderId":"ugTUVgvJpECy1tepQKe1IuoqvIoIeOykICgjB0LIu8ngQt2z8X2kYsJTSWDktZZWTDUlpCj_SK25ezLNTQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Happy vs Not so happy","postDate":"1000179097","msgId":25170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzLjFiYThhNTgyLjI4Y2VkZjk5QGFvbC5jb20+"},"prevInTopic":24814,"nextInTopic":0,"prevInTime":25169,"nextInTime":25171,"topicId":24814,"numMessagesInTopic":0,"msgSnippet":"Bravo Sandra! I printed that one out. Brenda [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1948852197\">Bravo Sandra! I printed that one out.<br/>\n<br/>\nBrenda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"CfjuXpQ0UMlkIQmfaUr4EU7HufLrkS4MAhTNLXgNqZDbHuogPPOd9tAzem1YqVoBqfeVfUgeEkTz","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Happy vs Not so happy","postDate":"1000047636","msgId":24814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZmLjFhNmNjZGFhLjI4Y2NkZTE0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":25170,"prevInTime":24813,"nextInTime":24815,"topicId":24814,"numMessagesInTopic":0,"msgSnippet":"Before I read any of the day s (okay the overnight s) posts, I want to pinpoint something we ve been making big gestures about, but that is really smaller and","messageBody":"<div id=\"ygrps-yiv-960835615\">Before I read any of the day&#39;s (okay the overnight&#39;s) posts, I want to <br/>\npinpoint something we&#39;ve been making big gestures about, but that is really <br/>\nsmaller and much more profound than the big &quot;whats&quot; and &quot;hows.&quot;<br/>\n<br/>\nUnschooling needs positive regard.  It needs sweetness and light.  It needs <br/>\nmore &quot;yes!&quot; than &quot;NO!&quot;<br/>\n<br/>\nIt needs a lot more of &quot;This is so cool&quot; than &quot;This is stupid.&quot;<br/>\n<br/>\nOne of the worst traits, for me and for my kids, of the schooled kids who <br/>\ncome over, is the studied negativity and rejection of things--activities, <br/>\ntoys, games, music--because they&#39;re not &quot;cool.&quot;   Some people move in a cloud <br/>\nof disdain, it seems, and not much is going to make them perk up and smile.  <br/>\nThey don&#39;t want to try new things and they&#39;ve rejected so many things as <br/>\n&quot;stupid&quot; that they have precious few options left in the world that they can <br/>\nget to without going back on something they&#39;ve declared in the past.<br/>\n<br/>\nI&#39;ve seen a few homeschooled kids that way.  I&#39;ll tell you what the family <br/>\nsymptoms are, and I admit it&#39;s a small sample and there could be other <br/>\nfactors:  They had a mom or a dad who were (in every case I&#39;ve seen) young <br/>\nand who still had a big cloud of that negativity themselves.  They hadn&#39;t <br/>\nopened up to the infinite possibilities of the universe in any way <br/>\nwhatsoever.  They were self-conscious about what their friends would think if <br/>\ntheir kids were reading this or that, or wanted their house to look cool with <br/>\nall primary-color toys, and so that purple and orange action figure was <br/>\n&quot;stupid&quot; (because it didn&#39;t match or because they didn&#39;t want to watch X-men <br/>\nor whatever, with their kids, because it was &quot;Stupid&quot;).<br/>\n<br/>\nTo paraphrase Hamlet, there is nothing stupid but thinking makes it so.<br/>\n<br/>\nIf you tell a child something he likes is stupid, you have just started <br/>\ndigging a chasm between you.  Either he will believe you and have less faith <br/>\nin himself, or he will not believe you and have less faith in you.  If it is <br/>\nrepeated ten or twenty times, he might just stop listening to you.  If it is <br/>\nrepeated a hundred times, he won&#39;t be able to hear you anymore, or if there <br/>\nare physical restraints added, he might purposely look for things you REALLY <br/>\nthink are stupid, out of spite.<br/>\n<br/>\nIf you don&#39;t simply condemn your children and their interests (however minor <br/>\nthey seems to you) as stupid, there is solid ground between you and you can <br/>\nactually communicate your fears and your own prejudices, IF you do it <br/>\nrespectfully and in full sentences as you would with another adult, <br/>\ncommunications stay open.  And the parent is in a position to learn WHY the <br/>\nchild really likes that art with the scary-looking dwarf warriors.<br/>\n<br/>\nWhen I find myself reacting too flippantly or with an &quot;eeyew!&quot; to something <br/>\nnew the kids are interested in, I try to get back to them in a day or a few <br/>\nwith a calm, intelligent question showing that I was paying attention to them <br/>\nand requesting more exchange.<br/>\n<br/>\nMarty has two CDs by a group called Gorrilaz.  It&#39;s foreign and irritating to <br/>\nme, and he uses headphones, but sometimes I purposely try to listen calmly <br/>\nbecause it would be better for me to get used to it than for me to reject it. <br/>\n My parents could have totally rejected having any rock&#39;n&#39;roll in the house.  <br/>\nThey could have told me the Beatles, the Rolling Stones, and Eric Clapton <br/>\nwere all stupid, but it would only have served to make me think my parents <br/>\nwere stupid and narrow minded.   I&#39;m glad they didn&#39;t do that.  So I&#39;ve asked <br/>\nMarty questions to draw him out to say what he likes about them, but real <br/>\nquestions like how many are in the group, and when is another CD coming out, <br/>\nand do they have videos.  <br/>\n<br/>\nSo I went on too long into real life examples, but the main suggestion is to <br/>\nsee whether you can improve the &quot;cool&quot; to &quot;dumb&quot; ratio at your house.<br/>\n<br/>\nSandra<br/>\n--------------------------------</div>","specialLinks":[]}],"prevTopicId":25169,"nextTopicId":25171}}