{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Jenni Dreams","from":"Jenni Dreams &lt;mamaskeeper@...&gt;","replyTo":"LIST","senderId":"rhyW30em18WPg2trArVPsn28Sdkx3Qoe1Oo3Bk2WGIXP-UOD2h4s0KafqW2XQyN5NzkZ9lhWUWBdmsnQOfNDI8WvNSUnNISG0Jcg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Long response to 6 Kids in Idaho","postDate":"991755201","msgId":22442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNjA1MTUzMzIxLjg1MDQ1LnFtYWlsQHdlYjE0NDA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwYjYwMWMwZWQ4NSQyNzA4ZGYyMCQzZDVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":22427,"nextInTopic":0,"prevInTime":22441,"nextInTime":22443,"topicId":22426,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-570816449\">&lt;&lt;I for one do not ask for help from the goverment,(my<br/>\nlife is none of thier <br/>\nbusiness,and if you try to get aide then it would be<br/>\nthier business!) I <br/>\ndon&#39;t vote,( I know shame on my name :) ), its not a<br/>\npride thing either, I <br/>\nfeel I have enough knowledge, experience etc. that if<br/>\nI/ we need <br/>\nit(welfare,etc.) I can find the monies by working or<br/>\ntrading :) I am very <br/>\nindependent and thankfully if something is needed it<br/>\ncomes along as needed, <br/>\njust the way I am and I and my family have done well<br/>\nliving this way all my <br/>\nlife so I am ok with it.<br/>\n<br/>\nThank you Lynda for saying, (typing), what I too felt!<br/>\nToo much media <br/>\ncoverage and OH MY GOODNESS that poor Mom and her<br/>\nkiddies!<br/>\n<br/>\nIndiana Tami<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>And the book, Into the Forest, is about two girls who<br/>\nfind themselves without parents and how they survive<br/>\nin the family owned remote cabin.  It&#39;s about that<br/>\nkind of lifestyle (in case any of you wonder why<br/>\nsomeone would choose to live like that) and it may<br/>\nhelp explain where the arrested mom is &#39;coming from&#39;.<br/>\n<br/>\nI agree with you, Lynda. That family is being<br/>\nrailroaded by some $$ development company.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>=====<br/>\nJenniD.</div>","specialLinks":[]},{"userId":0,"authorName":"Tami Labig-Duquette","from":"&quot;Tami Labig-Duquette&quot; &lt;labigduquette@...&gt;","replyTo":"LIST","senderId":"nYG_QBapQAMwtMwcM-1faX33IpHrdhr38hjIOfNfqpx0z6FkanDSJ1wJgYjqoIdfUGM7VvLO2JveNR-lipD0ZfYyga4wUPp5aEEJtEN1BhY8UOSaAAR1gQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Long response to 6 Kids in Idaho","postDate":"991725986","msgId":22427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMjR3MzkwRVZyUVFlaHJPQkQwMDAwNzQ0OUBob3RtYWlsLmNvbT4="},"prevInTopic":22426,"nextInTopic":22442,"prevInTime":22426,"nextInTime":22428,"topicId":22426,"numMessagesInTopic":0,"msgSnippet":"... I for one, (and only my thoughts), I feel badly for the family! I can see this happening anywhere and possibly everywhere. It does huh? Injustice for those","messageBody":"<div id=\"ygrps-yiv-616179844\"><blockquote><span title=\"ireply\">&gt;From: &quot;Lynda&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lurine@...\">lurine@...</a>&gt;<br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;To: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\n&gt;Subject: Re: [Unschooling-dotcom] Long response to 6 Kids in Idaho<br/>\n&gt;Date: Mon, 4 Jun 2001 22:42:49 -0700<br/>\n&gt;<br/>\n&gt;Oh for crying out loud.  These kids weren&#39;t surviving by eating pond water<br/>\n&gt;or lilly pad soup.  It is so iritating when folks only &quot;smell the bad<br/>\n&gt;smells&quot; and believe any little thing they see in the newspaper.<br/>\n<br/>\n </span></blockquote>I for one, (and only my thoughts), I feel badly for the family! I can see <br/>\nthis happening anywhere and possibly everywhere. It does huh? Injustice for <br/>\nthose of us who REFUSE to be mainstream or whatever other title you choose <br/>\nto label it.<br/>\n<br/>\n  Do the math, property appraised at $500,000 is seized for $5,000 in<br/>\n<blockquote><span title=\"ireply\"> &gt;back taxes and sold for $50,000.  Nice return on the dollar, if you ask me!<br/>\n </span></blockquote>I read,( and might I add, that i only know of what I have read, so take it <br/>\nwith a grain or two of salt). that they owed 8,000 in property taxes and the <br/>\nhouse and land was sold at auction for 50,000. Wonder if the family got the <br/>\nextra monies?<br/>\n<blockquote><span title=\"ireply\"> &gt;I hope no one on the list ever has the audacity to refuse to go on aide <br/>\n&gt;from<br/>\n&gt;the county they live in.  Particularly if they are homeschooling which is<br/>\n&gt;the other &quot;sin&quot; named by CPS!<br/>\n<br/>\n </span></blockquote>I for one do not ask for help from the goverment,(my life is none of thier <br/>\nbusiness,and if you try to get aide then it would be thier business!) I <br/>\ndon&#39;t vote,( I know shame on my name :) ), its not a pride thing either, I <br/>\nfeel I have enough knowledge, experience etc. that if I/ we need <br/>\nit(welfare,etc.) I can find the monies by working or trading :) I am very <br/>\nindependent and thankfully if something is needed it comes along as needed, <br/>\njust the way I am and I and my family have done well living this way all my <br/>\nlife so I am ok with it.<br/>\n<br/>\nThank you Lynda for saying, (typing), what I too felt! Too much media <br/>\ncoverage and OH MY GOODNESS that poor Mom and her kiddies!<br/>\n<br/>\nIndiana Tami<br/>\n_________________________________________________________________<br/>\nGet your FREE download of MSN Explorer at <a rel=\"nofollow\" target=\"_blank\" href=\"http://explorer.msn.com\">http://explorer.msn.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"F83fb5S2UN14VqK93V6ME-vDyoLlH-BH8Kj2QsuMBaIacL51pPLqdbeOPZMsXCs7wfIaToQNpC8DmLpSd1xPT4viHA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Long response to 6 Kids in Idaho","postDate":"991719769","msgId":22426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYjYwMWMwZWQ4NSQyNzA4ZGYyMCQzZDVkZDFkMUBsZGlvbm5vPg==","referencesHeader":"PDIwMDEwNjA1MDAwNDMyLjY1NTU2LnFtYWlsQHdlYjEzNzAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":22427,"prevInTime":22425,"nextInTime":22427,"topicId":22426,"numMessagesInTopic":0,"msgSnippet":"Oh for crying out loud.  These kids weren t surviving by eating pond water or lilly pad soup.  It is so iritating when folks only smell the bad smells and","messageBody":"<div id=\"ygrps-yiv-1403286014\">Oh for crying out loud.  These kids weren&#39;t surviving by eating pond water<br/>\nor lilly pad soup.  It is so iritating when folks only &quot;smell the bad<br/>\nsmells&quot; and believe any little thing they see in the newspaper.  And,<br/>\nbesides which, it is a lake, not a pond.<br/>\n<br/>\nUsing the same logic, ie. it appeared in a newspaper and a government<br/>\nofficial may or may not have said it, then all homeschoolers are radical<br/>\nreligious nuts who beat their kids.  I mean, I&#39;ve read it in a newspaper and<br/>\nfolks that work with CPS have said so.  And family members have helped CPS<br/>\nremove children from those homes.  So, it must be true.<br/>\n<br/>\nNow, how about reading what some folks who know what they are talking about<br/>\nhave said.  Including the *fact* that she had every reason to be paranoid<br/>\nAND the *fact* that county officials were involved in trying to steal her<br/>\nhome AND they have succeeded.<br/>\n<br/>\nThey were trying to be self-sustaining and not live off county aide.  They<br/>\nhad wanted to live &quot;off the grid&quot; when the husband became ill and could not<br/>\ncontinue with their plans to &quot;homestead&quot; their property.<br/>\n<br/>\nThe facts are that they were not doing without power and the local power<br/>\ncompany has acknowledged that.  It was an excuse used by the county to sway<br/>\npublic opinion to their cause.<br/>\n<br/>\nTheir house is not without heat.  They have wood and a wood stove as does<br/>\nalmost every other house in that part of the country.<br/>\n<br/>\nThe facts are that they were receiving boxes of food and had received a 200<br/>\npound box of food the Friday before all this happened.  Another lie the<br/>\ncounty used to excuse what they are doing.<br/>\n<br/>\nThe facts are that they had several dogs which may or maynot have pulled<br/>\ndown a moose and the *facts* are it doesn&#39;t take a ferrel dog or the wolf<br/>\nhybrids that they have to do this.  We&#39;ve shot FiFi and Fido because they<br/>\ngot together with some of their buddies in the neighborhood and we ended up<br/>\nhaving to put ONE HUNDRED AND TWENTY SEVEN stitches in one of our broodmares<br/>\nthat they attacked.  Go ask any rancher with sheep who causes the most<br/>\ndamages and they will tell you someone&#39;s pet that isn&#39;t locked up and gets<br/>\ntogether with other roaming pets.<br/>\n<br/>\nAs Mary pointed out on HEM, &quot;if you look on the map where Sagle is, it&#39;s<br/>\nright next to Pend Oreille Lake, near Sandpoint, where developers have been<br/>\nhaving a field day making money on real estate. Great site for a luxury<br/>\ncondominium project.&quot;  Someone wants their land and now they have it.  That<br/>\nisn&#39;t paranoia, that is reality.  This whole thing was about getting them<br/>\noff the land anyway it took.<br/>\n<br/>\nAnd precisely how do you know these kids were raised to hate and fear<br/>\nauthority? Because some newspaper said so?  I&#39;m not thinking any child would<br/>\nbe too enamored of a county that had *kidnapped* their mother!  And I&#39;m not<br/>\nthinking that some woman would be too fond of a county that was stealing her<br/>\nhome!  Do the math, property appraised at $500,000 is seized for $5,000 in<br/>\nback taxes and sold for $50,000.  Nice return on the dollar, if you ask me!<br/>\n<br/>\nAnd their mother wasn&#39;t taken in because of mental anything!  Those people<br/>\nhave handed out several stories--alcohol, mental illness, child abuse.  And<br/>\nthey deteriorated in one week?<br/>\n<br/>\nI hope no one on the list ever has the audacity to refuse to go on aide from<br/>\nthe county they live in.  Particularly if they are homeschooling which is<br/>\nthe other &quot;sin&quot; named by CPS!<br/>\n<br/>\nBTW, the daugher had gone through a teenage thing and left the house in a<br/>\nhuff a year or two ago.  If conditions were so bad, why did they wait YEARS<br/>\nand then swoop down on them right after the father died?<br/>\n<br/>\nAnd, don&#39;t take my word for it, read it from someone who lives there.<br/>\n<br/>\nLynda<br/>\n<br/>\nFrom: Ingri Cassel &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vaclib@...\">vaclib@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liuzzo1@...\">liuzzo1@...</a>&gt;<br/>\nSent: Sunday, June 03, 2001 2:09 PM<br/>\nSubject: McGuckin Family - THE REAL STORY<br/>\n<br/>\nMcGuckin Family photo<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.msnbc.com/local/KHQ/Images/saglefamily.jpg\">http://www.msnbc.com/local/KHQ/Images/saglefamily.jpg</a><br/>\n<br/>\nTo all:<br/>\n<br/>\nThe bulk of this release has been composed over the last two days. As<br/>\nyou will see, it is our contention that this is a land grab, and the<br/>\nthe children and the international media attention got in the way.<br/>\n<br/>\nWell, we just moments ago learned that we were more right than we<br/>\nthought and certain members of Bonner County government are<br/>\nintimately involved in the foreclosure, seizure and disposal of the<br/>\nMcGuckin property to pave the way for a real estate development.<br/>\n<br/>\nApparently, the McGuckins, who the media reported had no water, are<br/>\nsitting on the best source of clean water in the area and that source<br/>\nis sufficient enough supply several sites with water. We will not<br/>\ncomment further on this aspect of the story until we have more<br/>\ninformation. But, what we will be reporting soon is the real story<br/>\nhere and it may be explosive enough to really damage some very big<br/>\nplayers in Bonner County government.<br/>\nStay tuned.<br/>\n<br/>\nThe McGuckin story<br/>\nBy Don Harkins<br/>\n<br/>\nThe McGuckin story, which, as I will explain, epitomizes both the<br/>\narrogance of county government and the power of network dominant<br/>\nmedia. The story, which on the surface seems like a simple state-<br/>\nconcern-for-the-welfare-of-children case, is incredibly complex. I<br/>\nbelieve that it boils down to a four (or more) year persecution of an<br/>\nunfortunate family that has a really neat, and possibly strategic, 40-<br/>\nacre piece of property with a pristine lake. This entire travesty<br/>\nwould never have made more than a few lines of the local evening news<br/>\nif it had not been for one thing: The McGuckin children sicced their<br/>\ndogs on the &quot;authorities&quot; and made a stand.<br/>\n<br/>\nSince the Idaho Observer keeps its office within 17 miles of the<br/>\n&quot;standoff&quot; and, since no other media in the area has the editorial<br/>\nlicense to tell the truth and, since millions of people all over the<br/>\nworld are fixated on understanding the truth behind this surreal<br/>\nscenario, I will place things into proper perspective. My wife Ingri<br/>\nand I were able to gain the proper perspective by riding with Joann<br/>\nMcGuckin&#39;s (former) attorney Edgar Steele while he delivered a letter<br/>\nthat withdrew his representation from this case and when we<br/>\ndiscovered that a bond reduction hearing that had been scheduled for<br/>\n4 p.m. had been postponed until Monday, June 4, 2001 amid strange<br/>\ncircumstances.<br/>\n<br/>\nRather than turn this into a series of newsstories, this is just<br/>\ngoing to be Don talking. There will be a mixture of facts that can be<br/>\nverified by documentation and my own interpretation of events based<br/>\nupon my knowledge of the characters involved and other stories that I<br/>\nhave covered which are connected or related. I will, however, break<br/>\neach segment down under a headline to make things easier to explain.<br/>\n<br/>\nTo fully understand the McGuckin story, it would be best to obtain<br/>\ncopies of the November and May editions of The Idaho Observer wherein<br/>\nwe reported the christening of the Cutthroat (a 110 foot unmanned<br/>\nsubmarine that is now being used for research in Lake Pend Oreille)<br/>\nand the Parkison story wherein another Bonner county family was<br/>\nsqueezed for several years until they lost their property. I also<br/>\nsuggest that you obtain a copy of the September, 2000 edition of The<br/>\nSpectrum newspaper (1-877-280-2866) wherein some interesting clues<br/>\nregarding this region&#39;s importance to sophisticated technology<br/>\nresearch are found.<br/>\n<br/>\nIt appears that the veneer of propriety on the part of the state is<br/>\nextremely thin in this case. Now that the &quot;standoff&quot; has ended, it<br/>\nwill be a matter of simple investigation to prove that the McGuckin&#39;s<br/>\nland was stolen from them illegally and that the charges of child<br/>\nneglect alleged by Bonner County Prosecutor Phil Robinson were<br/>\nfabrications that are not supported by evidence.<br/>\n<br/>\nBreaking News: &quot;Standoff&quot; has ended<br/>\n<br/>\nBy the evening of June 2, 2001, the standoff ended peacefully and the<br/>\nfive remaining children have been taken to Bonner General Hospital<br/>\nwhere they were to spend the night. Three persons, including a family<br/>\nfriend and neighbor whom the children trusted, made contact with the<br/>\nchildren and it was that contact which ultimately led to their<br/>\ndecision to come out. Bonner County Sheriff Phil Jarvis claims that<br/>\nhe sent word to the children that they would not be separated if he<br/>\nhas anything to say about it. The three mediators also gave the kids<br/>\na note from their mother in jail. It is reported that the note<br/>\nallegedly from mom was what compelled them to go with &quot;authorities.&quot;<br/>\nJarvis&#39; promise that they would not be separated may not be his to<br/>\nkeep as the children are now in thecustody of state child welfare<br/>\nworkers who have made no such promises to the children.<br/>\n<br/>\nBy all reports the children were all in fine shape physically and<br/>\nmentally were in good spirits when they left their home.<br/>\nThe children were taken to the hospital where they would all be given<br/>\nphysicals. It is also likely that the hospital staff was be ordered<br/>\nto administer vaccines to make them current with state recommended<br/>\nvaccination regimen. If the children are healthy now and then begin<br/>\nto experience adverse reactions to vaccines, I am concerned that the<br/>\nmother will somehow be blamed for the delayed reaction of ill health<br/>\nand that the introduction of toxic substances directly into their<br/>\nblood streams will not be considered as the cause. I am also<br/>\nconcerned that the &quot;authorities&quot; will, in their attempts to pacify<br/>\nthe children&#39;s emotional needs, start feeding them a bunch of junk<br/>\nfood which will exascerbate vaccine-related health complications and<br/>\ncompromise their psychological equanimnity.<br/>\nThere is still no word on when Joann McGuckin will be released from<br/>\njail though it appears there is no reason to continue holding her<br/>\nbecause her children are obviously not the victims of neglect as<br/>\nalleged in the complaint filed by Bonner County Prosecutor Phil<br/>\nRobinson May 29, 2001.<br/>\n<br/>\nMyths and fabrications:<br/>\n<br/>\n1.  The children have no food and are eating lilly pad soup. This is<br/>\nnot true as more than one person reports that the children have<br/>\nplenty of food.<br/>\n<br/>\n2.  The children have no heat. This is north Idaho. They have wood and<br/>\na wood stove.<br/>\n<br/>\n3.  The children have no electricity. The house has electricity that<br/>\nis hooked up and paid for.<br/>\n<br/>\n4.  The family has 27 vicious and hungry dogs running wild and hunting<br/>\nin a pack. The number is probably closer to 15 dogs that are more<br/>\nprotective than they are vicious.<br/>\n<br/>\n5.  The children are victims of neglect. Though they may not live in a<br/>\nfamily like yours, these kids are not behaving like neglected kids.<br/>\nThese kids love each other, their deceased father, their mother and<br/>\ntheir home.<br/>\n<br/>\n6.  Joann McGuckin spends her money on alcohol. There is no evidence<br/>\nof this.<br/>\n<br/>\n7.  The children are armed. Benjamin said &quot;go get the guns&quot; to start<br/>\nthis standoff. Since that time nobody has seen them brandishing any<br/>\nweapons. Benjamin, however, has allegedly admitted that there were<br/>\nfive guns in the house.<br/>\n<br/>\n8.  Joann McGuckin has mental problems and does not trust the<br/>\ngovernment. Joann has lost her husband, she has been slipping into<br/>\npoverty for the last several years as her husband&#39;s health<br/>\ndeteriorated and has been in full knowledge that the loss of her home<br/>\nwas imminent. Intrusive government has not attempted to help her, it<br/>\nhas been attempted to remove her from the property by a variety of<br/>\nmeans. Then, charges of child neglect are fabricated, she is tricked<br/>\nby police into being arrested, she is thrown in  jail and her kids<br/>\ndecide to defend their home. How would you feel?<br/>\n<br/>\n9.  The children must be taken into custody for their own protection<br/>\nbecause there is no place else for them to go. A family friend of ten<br/>\nyears whom the children trust and like, who lives 30 minutes away on<br/>\na 140 acre ranch has offered to take the children in but the state<br/>\nwill not allow them to because they are not &quot;licensed.&quot;<br/>\n<br/>\n10. Benjamin &quot;gave himself up to authorities.&quot; Benjamin had<br/>\napparently left the house on a recon mission two days previously. He<br/>\nwas unable to cross the police line and his coming into police<br/>\ncustody more closely resembles capture than a voluntary surrender.<br/>\nSince he was taken into custody, nobody but &quot;authorities&quot; have had<br/>\naccess to him.<br/>\n<br/>\n11. The bond reduction hearing was canceled because of a power outage<br/>\nin the courthouse. The hearing was to take place at Bonner County<br/>\nJail, not at the courthouse. There was a TV setup at the courthouse<br/>\nfor media members who were going to watch the hearing from that<br/>\nlocation. There had been no power outage at the courthouse as of 4:20<br/>\np.m. when Ingri and I left. At 3:55 p.m. we learned that Judge Heise<br/>\nwas still in the building and that Dublic Defender Bryce Powell was<br/>\nnowhere to be found.<br/>\n<br/>\n12. Ed Steele had his license to practice law in Idaho suspended. Ed<br/>\nnever mentioned such a thing and it does not stand to reason that he<br/>\nwould volunteer to represent McGuckin in this high profile manner if<br/>\nhe was going to be prevented from representing her in court. Steele<br/>\nsaid that he has not been informed that he is not longer licensed to<br/>\npractice law in Idaho.<br/>\n<br/>\n13. The children are unhealthy and malnourished. There is no evidence<br/>\nto suggest this is true. The children appear to be healthy, vibrant<br/>\nand intelligent. Benjamin was given a physical after being taken into<br/>\ncustody and is reportedly in excellent health. Benjamin reported that<br/>\nthere is plenty of food and water in the house.<br/>\n<br/>\n14. The children have been home schooled and taught to be suspicious<br/>\nof the government. Both of these things might be true, however the<br/>\nmedia spin is negative where I see nothing but positives. The<br/>\nchildren were smart enough to not be taken into custody by police who<br/>\nhad tricked their mother into going to jail and had sold their<br/>\nproperty at auction when it appears that the foreclosure, seizure and<br/>\nsale of the property was conducted illegally. It would appear that<br/>\nbeing suspicious of government is a survival skill that all children<br/>\nshould be taught. They are survivors, they are close-knit and they<br/>\nhave proven to be more capable than most children who attend public<br/>\nschool.<br/>\n<br/>\n15. The father died of malnutrition and dehydration. This may be<br/>\npartially true, but persons who suffer for years from the ravages of<br/>\ndegenerative disease may not feel like eating or drinking the last<br/>\nfew days or weeks of their lives. It would be absurd to conclude that<br/>\nthe last four years of his declining health was because he decided to<br/>\nstarve himself and not drink water.<br/>\n<br/>\nSteele withdraws from McGuckin case-for now:<br/>\n<br/>\nSANDPOINT, June 1, 2001-At 2:30 p.m. today Attorney Edgar Steele hand<br/>\ndelivered a letter to public defender Bryce Powell and Joann McGuckin<br/>\nthat announced his withdrawal from the case. Steele, who I must say<br/>\nis a personal friend of mine, has stated to me that he would rather<br/>\nnot practice law in the courts of north Idaho because it has been his<br/>\nexperience that law is not the most important part of the judicial<br/>\nequation here. The fact that he decided to try to help this woman and<br/>\nher six children was, in my estimation, a purely selfless and noble<br/>\ngesture on his part.<br/>\n<br/>\nSteele had an excellent visit with McGuckin May 31. McGuckin thanked<br/>\nSteele for representing her without charge and definitely, according<br/>\nto Steele, wanted him to represent her and the children in matters<br/>\nnot related to Robinson&#39;s criminal complaint. He learned a lot and<br/>\nfound that there were several areas that he could be of service to<br/>\nher because she and her family had been given a raw deal with regard<br/>\nto the loss of the property. Powell was representing her on the<br/>\nabsurd criminal charges of felonious injury to children. Steele was<br/>\nup until midnight researching and studying documents pertaining to<br/>\nthe case and working out a strategy. The following morning he was<br/>\nunable to talk to her; she only wanted to communicate with Steele<br/>\nthrough written memoranda and a couple of people friendly to McGuckin<br/>\nwere suddenly noncommunicative. Steele said that he cannot adequately<br/>\nrepresent her under these conditions. He did tell Ingri and I that he<br/>\nleft the door open for her, though, and that if she was able to get<br/>\nher thoughts together when things calm down, he would be glad to<br/>\nreconsider.<br/>\n<br/>\nBased upon what we can infer from the characters involved, the fact<br/>\nthat Powell is a young attorney trying to make a living in a tightly<br/>\ncontrolled small town legal environment, that he is very likely in<br/>\nway over his head in this case and that he must listen to the local<br/>\npower clique to have a future practicing law in Bonner county, it<br/>\nwould appear that Powell convinced McGuckin to dissuade Steele, an<br/>\nextremely competant attorney who cannot be controlled by the local<br/>\npower clique, from digging into the injustices that have been done to<br/>\nthe McGuckins.<br/>\n<br/>\nAfter delivering the letter to McGuckin through her jailers, Steele<br/>\nwas stopped by the news media to give on  camera interviews. In<br/>\nanticipation of the bond reduction hearing scheduled to begin at 4<br/>\np.m. (it was at this time 3 p.m.) there were several local and<br/>\nnational news teams and two satelite trucks waiting around in the<br/>\nBonner County Sheriff&#39;s Department parking lot. Steele very<br/>\neloquently and accurately said several things to the news media that<br/>\nwould have made all concerned Americans very proud. When asked what<br/>\nhe thought would be the best resolution of this matter, Steele said<br/>\nthat McGuckin should be let out of jail immediately so she can go<br/>\nhome to her kids and the police should go home to their families. He<br/>\nalso indicated that it was his belief that Bonner County Prosecutor<br/>\nPhil Robinson&#39;s charges of child abuse were unfounded and<br/>\ndemonstrably false.<br/>\n<br/>\nBond reduction hearing delayed:<br/>\n<br/>\nSANDPOINT, June 1, 2001-A bond reduction hearing for Joann McGuckin<br/>\nthat had been scheduled to take place at the Bonner County Jail at 4<br/>\np.m. here today in the court of Magistrate Judge Heise has been<br/>\npostponed until Monday, June 4 because public defender Bryce Powell<br/>\nwas nowhere to be found. McGuckin, 45, was arrested through deception<br/>\nby the Bonner County Sheriff&#39;s Department Tuesday after Bonner County<br/>\nProsecutor Phil Robinson filed a complaint against McGuckin for<br/>\nfelonious injury to children. McGuckin is being held on $100,000 bond<br/>\nthough most of the charges Robinson alleged against McGuckin have<br/>\nbeen demonstrated to be false.<br/>\n<br/>\nBond is a mechanism that is used to protect the community from the<br/>\naccused if they are at risk for fleeing prosecution or pose a danger<br/>\nto the community. McGuckin is not a danger to the community and the<br/>\nlikelihood that she would flee the area and leave her children behind<br/>\nis so remote as to be absurd to contemplate. Therefore it would<br/>\nappear that $100,000 bond is excessive and put in place to keep her<br/>\nin jail so that she does not have the opportunity to speak to the<br/>\npress, have unmonitored access to legal counsel or have contact with<br/>\nher children.<br/>\n<br/>\nLocal and national media with satellite uplinks were positioned at the<br/>\njail and Court room 2 at the Bonner County Courthouse in anticipation<br/>\nof the hearing. Ingri and I were with several other reporters in the<br/>\ncourthouse at 3:30 p.m. when it was learned that Judge Heise was<br/>\nstill on site because Powell was nowhere to be found though he was<br/>\nwell aware of the hearing time, date and location. It was learned<br/>\nlater that he had been out attempting to talk the children into<br/>\ngiving themselves up. I believe that he was there doing that, but<br/>\nthat it was an excuse to not be present at the bond reduction hearing<br/>\nat the jail. I believe that his controllers, the county that<br/>\nappointed him to represent McGuckin in this case, arranged his not<br/>\nbeing present for the hearing so that they could continue the hearing<br/>\nto Monday. I think they wanted a couple days to think, hoping that<br/>\nsomething magical would bring the standoff to an end before Monday.<br/>\nThe more conspiratorial side of me is concerned that she will be<br/>\npsychologically manipulated into saying things that will compromise<br/>\npublic perception of her in a negative way.<br/>\n<br/>\nThe kids:<br/>\nKathryn, 16, Banjamin, 14, Mary, 13, James, 11, Fred, 9 and Jane, 8<br/>\nI have heard several people say that the kids, though sometimes a<br/>\nlittle dirty, are nice, a little shy, but polite, intelligent and<br/>\nwell spoken. It sounds like these children should be used as poster<br/>\nchildren for the benefits of home schooling rather than being labeled<br/>\nas outcasts unfit to function in polite society. I for one, am proud<br/>\nof the McGuckin children and hope to meet them some day and tell them<br/>\nso.<br/>\n<br/>\nConclusions to date:<br/>\n<br/>\nThis is a land grab case not a child abuse case. The kids are fine<br/>\nexcept that their father is dead and the police tricked their mom<br/>\ninto being arrested on charges of felonious injury to children that<br/>\nare either bold faced lies or baseless accusations. In either event<br/>\nthere is no evidence to support the charges against Joann McGuckin,<br/>\nthere is no reason for her to be in jail and there is no justification of<br/>\n$100,000 bond as she is not s flight risk or a danger to society.<br/>\n<br/>\nThe McGuckin property, which has a homestead exemption and is worth<br/>\nnearly $500,000, was seized for $5,000 in back taxes and sold at<br/>\nauction for $50,000. It appears that the McGuckins have been under<br/>\nattack for at least four years and the intent was to steal their<br/>\nproperty. I personally believe the attack was subtle, and conducted<br/>\nwith the use of sophisticated technologies that to most people are<br/>\nthe stuff of science fiction. They became increasingly reclusive, I<br/>\nthink, because nobody would believe them if they told them what was<br/>\ngoing on and they were afraid that people would think they were<br/>\ncrazy.<br/>\n<br/>\nSo, the two components of this surrealistic scene is the provably<br/>\nillegal seizure and disposal of their property and the provably<br/>\nfabricated charges of child abuse and neglect. The veneer is so thin<br/>\nthat when this thing begins to unravel, the corruption and arrogance<br/>\nbehind this property theft will become obvious.<br/>\nI was a disappointed that though there are millions of people talking<br/>\nabout this, the public was not represented at the jail or the<br/>\ncourthouse. The only people on hand were media types. I guess people<br/>\nwish to be angered by the events by understanding the issue through<br/>\nthe eyes of the dominant media.<br/>\n<br/>\nCopies of the complaint of child neglect filed by Bonner County<br/>\nProsecutor Phil Robinson (CR-01-01116) can be obtained by calling the<br/>\nBonner County Courthouse at: (208) 265-1432. The Idaho Observer will<br/>\nFAX a copy. Call (208) 255-2307.<br/>\n<br/>\nThe Bonner County Prosecutor, Phil Robinson, can also be reached at<br/>\nthe above number.<br/>\n<br/>\nDon Harkins is the editor of The Idaho Observer, a monthy tabloid-<br/>\nsized, 24-page newspaper that seeks to report the truth of events<br/>\nthat are shaping the socio/political, spiritual and economic demise<br/>\nof our our once free nation. For back issues or subscription<br/>\ninformation, contact The Idaho Observer at: (208) 255-2307 or by<br/>\nvisiting the website at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.proliberty.com/observer\">http://www.proliberty.com/observer</a><br/>\n<br/>\nThe Idaho Observer<br/>\nPO Box 457<br/>\nSpirit Lake, Idaho 83869<br/>\n(208) 255-2307<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:observer@...\">observer@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.proliberty.com/observer\">http://www.proliberty.com/observer</a></div>","specialLinks":[]}],"prevTopicId":22441,"nextTopicId":22368}}