{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Either off topic or right in the middle","postDate":"1153766663","msgId":26372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1QjAxNDAxLTdDNjUtNEIyOC1BMTQwLTMxOTM1RDU2ODE0OUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":26371,"nextInTime":26373,"topicId":26372,"numMessagesInTopic":0,"msgSnippet":"http://www.thefathersbooks.com/Grades%20K-6.htm Once in a while I have a big shiver at ever having been pressed to support all homeschoolers, as we re all","messageBody":"<div id=\"ygrps-yiv-610623633\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thefathersbooks.com/Grades%20K-6.htm\">http://www.thefathersbooks.com/Grades%20K-6.htm</a><br/>\n<br/>\nOnce in a while I have a big shiver at ever having been pressed to  <br/>\nsupport all homeschoolers, as we&#39;re all doing the same thing and need  <br/>\nto remember we&#39;re all in this together.<br/>\n<br/>\nWell, I was working on my webpages, making sure pages are linked to  <br/>\nat least three or five other places, and got to poking around a site  <br/>\nI&#39;ve had linked for a couple of years.<br/>\n<br/>\nOn the curriculum pages, every grade first through fifth has one book  <br/>\nlisted for literature/English.  Same book every year.  It&#39;s an anti- <br/>\nHalloween novel.  I&#39;m definitely ordering one.  It&#39;s on sale now.   <br/>\nSo  The first five years are Bible study and anti-Halloween, and  <br/>\nafter that the girls start studying quiltmaking.<br/>\n<br/>\nThey have a page on chores.  Here&#39;s how they recommend you reward  <br/>\nkids for chores:<br/>\n<br/>\n1. For a young student in grades K-6, award your successful worker  <br/>\nwith stickers or points that can be tallied. When a goal set by you  <br/>\nis reached, give your hard worker a small treat (fruit, snack, piece  <br/>\nof gum, etc.) Award this treat once a week for this age group.<br/>\n<br/>\n2. For an older student in grades 7-12, most families pay their  <br/>\nworkers a certain monetary amount for each chore completed. You will  <br/>\nhave to decide what that amount may be, based on your family budget.  <br/>\nThen pay your diligent worker once a month.<br/>\n<br/>\n<br/>\n<br/>\nSometimes maybe it helps to see what I&#39;m not doing as an unschooler,  <br/>\nand to remind myself why I really don&#39;t want to relax my stance on  <br/>\nfundamentalist school at home.<br/>\n<br/>\nOh, and not to defend witchcraft or anything, but one of the two  <br/>\narticles on the site confuses witchcraft and crime with evolution, it  <br/>\nseems:<br/>\n<br/>\n<br/>\n<br/>\n-=-DISCERNING EVOLUTION IN CURRICULA<br/>\n<br/>\n=Have you ever enjoyed the pictures in a book so much that you missed  <br/>\nthe fact that the book was for evolution? Have you ever enjoyed the  <br/>\nstory in a book so much that you missed the fact that it used a dark  <br/>\nside of life like crime to entertain you? Have you ever liked the  <br/>\ncover of a book so much that you bought it and gave it to your child,  <br/>\nnot ever knowing that the content contained witchcraft ideas with the  <br/>\nintent of subtly indoctrinating your child into these practices?<br/>\n<br/>\n-=-These examples sound a bit extreme and you may say, no never me.  <br/>\nBut in fact, concepts that are pro-evolution, divorce, witchcraft,  <br/>\ncrime, etc., are often woven into a book in ways that you may not be  <br/>\ndetecting. These concepts may be placed in books on purpose to subtly  <br/>\nindoctrinate, or they may be there because the culture that is  <br/>\npreparing the books has been compromised by sin without even knowing  <br/>\nthey have been...-=-   (and it continues)  http:// <br/>\nwww.thefathersbooks.com/Articles.htm<br/>\n<br/>\nand goes on to say some exceedingly strange things.  It says  <br/>\nevolution sets animals above men, as the original parents of men, and  <br/>\nthat books or TV shows that have talking animals support evolution.   <br/>\nI guess that would include Mickey Mouse and all those puppets on  <br/>\nSesame Street.  &quot;These books, curricula, and shows purposely or  <br/>\nsubtly use animals to indoctrinate the public into accepting,  <br/>\nsupporting, and living under and within the concept of evolution.&quot;<br/>\n<br/>\nWhat they&#39;re doing is NOT what I&#39;m doing.  I would way rather my kids  <br/>\ngo to public school than    I would like to defend that kind of  <br/>\nhomeschooling.  I&#39;m betting they would rather their kids go to public  <br/>\nschool than to treat them the ways that our family treats ours.<br/>\n<br/>\nSaturday night Holly left the house at 11:00 and came home at 4:30  <br/>\na.m.  Kirby knew she had left, but she didn&#39;t leave me a note, and  <br/>\napologized profusely the next day, because she realized after she was  <br/>\ngone that if I woke up after Kirby went to sleep I wouldn&#39;t know  <br/>\nwhere she was.  She was with Marty (her brother), Sadie and Brett  <br/>\n(two now-grown unschoolers of our long acquaintance.  They played  <br/>\nminiature golf and then went to Sadie&#39;s house and played and talked.<br/>\n<br/>\nWe&#39;re not living a small, fearful lives.<br/>\n<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":26334,"nextTopicId":26371}}