{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":257127,"authorName":"Deb","from":"Deb &lt;herbtea@...&gt;","profile":"live_oak2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"the end of teaching vs learning","postDate":"1028676118","msgId":40032,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENTA1QTE2Ljc1OTNBMDUzQGd0ZS5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":40031,"nextInTime":40033,"topicId":40032,"numMessagesInTopic":0,"msgSnippet":"From: PSoroosh@aol.com Subject: Re: Digest Number 2195 Thanks, Pam for your reply. ... nobody was ever saying that. Sandra, for example, has talked at length ","messageBody":"<div id=\"ygrps-yiv-2145259934\">From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:PSoroosh@...\">PSoroosh@...</a><br/>\nSubject: Re: Digest Number 2195<br/>\n<br/>\nThanks, Pam for your reply.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;But I do think that from the examples given, that it has been clear that <br/>\n </span></blockquote>nobody was ever saying that. Sandra, for example, has talked at length<br/>\nabout <br/>\nhelping her kids learn all kinds of things. I&#39;ve recently posted some<br/>\nways to <br/>\nhelp kids learn some math stuff. I think that anybody reading for more<br/>\nthan a <br/>\nfew days would realize that the point of not using the word &quot;teach&quot; is<br/>\nto <br/>\nretrain old patterns of thinking - to help people break away from<br/>\nthinking <br/>\nthat kids only learn what teachers teach.&lt;&lt;&lt;<br/>\n<br/>\nWhen I first joined the list I read some posts where people demonstrated<br/>\nwhat they as caring involved parents were doing with their kids, but<br/>\nthere was also a large discussion of teaching vs learning. That&#39;s where<br/>\nI came in. And when I added my thoughts on that matter someone ripped my<br/>\nface off by insisting &quot;teach&quot; was a dirty word, no matter what<br/>\nconnotations anyone else had for it. The effect was to shut me up and I<br/>\ndidn&#39;t want to post for a while. Then when someone else complained and<br/>\nmade a point of not liking the rudeness, so I felt better and I decided<br/>\nto get back into the discussions and just ignore anyone whose intent is<br/>\nto shut others down. It is valuable to discuss things back and forth and<br/>\nexpand one&#39;s understanding. After the other person spke up with her<br/>\ncomplaint, I realized there are others who want free discussion of ideas<br/>\nand the list was not just limited  to one set view and rule of<br/>\nacceptability.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It is actually too close to what many have done by leaving their kids<br/>\n&gt; off at a school. <br/>\n<br/>\n<br/>\n&gt;THIS makes sense - sort of. I mean - I can imagine it, even though I can&#39;t <br/>\n&gt;say I&#39;ve EVER seen it in practice. Except that people who don&#39;t want to <br/>\n&gt;interact and support their kids&#39; learning would just leave them IN school -- <br/>\n&gt;at least that&#39;s what makes sense to me.<br/>\n<br/>\n </span></blockquote>You mean you haven&#39;t ever had your kids in school at all? Lucky and<br/>\nbrave person to have started off homeschooling! I figured out that was<br/>\nwhat I wanted to do after my youngest child&#39;s 1st grade year in a <br/>\nprivate school. I didn&#39;t know there were such things as support groups<br/>\nor anyone else doing it, I had read my first book on the subject &quot;Teach<br/>\nYour Own&quot; by John Holt. So I did it. (Note the title of the book by the<br/>\noriginal unschooling guru - &quot;*Teach* Your Own&quot;- gasp!)<br/>\n<br/>\nYou would be surprised to know that many parents these days take their<br/>\nkids out of school because their kids are in trouble or having trouble,<br/>\nbut they themselves don&#39;t know how to or even want to do anything to<br/>\nsolve the problem except take them away from the problem. Not really<br/>\nknowing how to fix anything or what to do - just want o get them away<br/>\nfrom the scary or annoying place of authority. Really, people call me<br/>\nevery month telling me they want to homeschool their kids and would I do<br/>\nit for them.... they think homschooling means in somebody&#39;s home, not<br/>\nnecessarily theirs! A real irresponsibility stance, believe me. ON the<br/>\nother hand I know many other parents who love to have their kids home,<br/>\nand do fine unschooling. Others, have their kids home and have trouble<br/>\nrelating to their kids and it can degenerate down into &quot;do what I say or<br/>\nelseyou go back to school!&quot;. Still others have good intentions but not a<br/>\nclue what to do and any new fad or thing to buy becomes the thing that<br/>\n&quot;they should do.&quot;<br/>\n<br/>\nSo you see I really appreciate all the conversations going on here on<br/>\nthis list. It gives me insight into how to relate to people&#39;s questions<br/>\nand difficulties on various levels. Great ideas of ways to explain with<br/>\nrealistic situations and insightfulthings to say - how you could<br/>\nunderstand and help your kids, how to go about unschooling or living<br/>\nwith your kids. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Don&#39;t interfere - learning will happen.... Nobody grows&gt;  or changes if the <br/>\n&gt; kids are just left to be by themselves and don&#39;t have<br/>\n&gt; a loving parent there to interact when needed. <br/>\n<br/>\n&gt;We had this discussion on this list a month or so ago - people were posting <br/>\n&gt;about this exact thing - and were attacked for supposedly saying that kids <br/>\n&gt;needed to be &quot;entertained all the time.&quot; Just can&#39;t win, can we? &lt;G&gt; But - <br/>\n&gt;yes I agree with this point. I just don&#39;t think it is a big issue. I haven&#39;t <br/>\n </span></blockquote>&lt;seen unschooling parents who didn&#39;t work hard to enrich their kids&#39;<br/>\nlives.<br/>\n<br/>\nWell, I knew when I wrote this that it would sound categorical,  And I<br/>\ndo believe there is instead a gradient of &quot;left alone&quot; to &quot;constantly<br/>\ninvolved with parents&quot;. At any one time for any particular kid and<br/>\nfamily, it might be &quot;more left to figure out what to do and create&quot; is<br/>\nbetter - and for other times and families &quot;more help and mutual action&quot;<br/>\nis good. Probably need a mix of both. IT is good to see what others have<br/>\nmade of a gradient of this that you never thought of. Like playing a<br/>\npiano, you can go louder and softer, faster and slower  for different<br/>\neffects.<br/>\nI have seen though kids left to figure what to do by themselves and<br/>\nbeing lonely, just went to watch TV&gt; MY own daughter when she was about<br/>\n7 and I was working on legislative issues for 3 weeks straight during a<br/>\nlegislative session of our state - she found the 24 hour Cartoon CHannel<br/>\n- and that IS what she did! When I came off the computer very late one<br/>\nnight I found her watching cartoons as 3 in the morning. Boy, when that<br/>\nlegistative session was over, I put the TV in the garge (storage) and<br/>\ntold my group that I couldn&#39;t be the one to work 24 hours for 3 weeks on<br/>\nemrgencies anymore. My child meant more to me, and I ahd to get her<br/>\nweaned into doing things again. Whew!<br/>\n<br/>\nI&#39;ve seen planty of kids taken out of school and left to play with an<br/>\never mounting array of video games so they wouldn&#39;t bug their parents<br/>\nwhen they were bored. The parents weren&#39;t bad, uneducated; they were<br/>\nrich and spoiled and so their kids became. The philosphy of caring<br/>\nunschooling must be preserved and I am thankful for the support here and<br/>\nmagazines with articles, other internet support sites, because beleive<br/>\nnot everyone naturally gravitates to it.<br/>\n<br/>\nAnyway, I don&#39;t mean to bring people down with this aspect of reality.<br/>\nBut with the speed at which our school system is self-destructing, an<br/>\nincreasing number of people are coming to homeschooling without the<br/>\ncommitment of earlier times. IT is vital we help those who turn this way<br/>\nand share our successful model.  I&#39;d like to get off this topic and into<br/>\nthe inspiring aspects of unschooling.  I&#39;ll finish answering this post<br/>\nand get to brighter, happier stuff.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; New homeschoolers often<br/>\n&gt; have to make a real effort to BE with their kids when they have so<br/>\n&gt; conveniently been without them for so long.<br/>\n&gt; <br/>\n<br/>\n&gt;I think they do - yes. Sometimes they have to make an effort to observe them <br/>\n&gt;carefully - and not to DIRECT them all the time, too.&gt;<br/>\n<br/>\n </span></blockquote>Very true- this is an art in itself. TO observe and watch with love but<br/>\nnot interefering. It is amazing what you can see when you expect your<br/>\nchild to know things all by himself and figure out new things to do that<br/>\nI wouldn&#39;t have come up with in a million years. Hurrah, a universe and<br/>\nfuture is being created! I think all kids have the potential to create<br/>\ntheir own universe given the opportunity and without interfence. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think a discussion of the different aspects of learning vs teaching<br/>\n&gt; is very helpful .... up to a point. All people do both, I think, teach<br/>\n&gt; and learn in the natural scheme of life. Learning that there is a<br/>\n&gt; give-and-take in these things is very valuable.  <br/>\n<br/>\n<br/>\n&gt;&gt;&gt;Some of the same people saying that &quot;you don&#39;t need to &quot;teach&quot;&quot; and &quot;you <br/>\n </span></blockquote>don&#39;t need to become their &quot;teacher&quot;&quot; are also those of us who post <br/>\nb&#39;zillions of ideas and anecdotes about our unschooling lives. So - yeah<br/>\n- I <br/>\nagree with you and do it all the time.&gt;&gt;&gt;&gt;<br/>\n<br/>\nThank you, it&#39;s nice to acknowledge that we are on the same page.<br/>\n<br/>\n<br/>\nDebbie Radstrom<br/>\n-- <br/>\nDirector, Live Oak Academy<br/>\nVisit our website <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newhealth.net/liveoak/\">http://www.newhealth.net/liveoak/</a></div>","specialLinks":[]}],"prevTopicId":40028,"nextTopicId":40031}}