{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041792444","msgId":53169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYWUwMWMyYjRlYiRiNDg0OWZlMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDE1Ni4xOWRhMjIyYy4yYjQ5MTYwY0Bhb2wuY29tPg=="},"prevInTopic":53156,"nextInTopic":0,"prevInTime":53168,"nextInTime":53170,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"... My ... next ... Sounds like she s ahead of Lars in her film work.  I know they use a Mac in the class.  Does I Movie sound right?  (He s asleep, so I can t","messageBody":"<div id=\"ygrps-yiv-761734159\"><blockquote><span title=\"ireply\">&gt; &gt; She brought in<br/>\n&gt; &gt; another teacher to work with him on editing<br/>\n&gt;<br/>\n&gt; What type of computers and programing were they using to do the editing.<br/>\n </span></blockquote>My<br/>\n<blockquote><span title=\"ireply\"> &gt; daughter also does this.  I am hoping to find an advanced class for her<br/>\n </span></blockquote>next<br/>\n<blockquote><span title=\"ireply\"> &gt; year she is teaching other people right now and doing a promo video for a<br/>\n&gt; gymnastic center.<br/>\n<br/>\n </span></blockquote>Sounds like she&#39;s ahead of Lars in her film work.  I know they use a Mac in<br/>\nthe class.  Does I Movie sound right?  (He&#39;s asleep, so I can&#39;t ask him.)<br/>\nWe&#39;ve got Adobe Premiere, but he hasn&#39;t learned how to use it yet.<br/>\n<br/>\nOn the same topic . . . The local hs teen group did 2 or 3 years of learning<br/>\nto make videos with a hs dad who was a camera man.  One of the boys went on<br/>\nand took a short course at the Gulf Islands Film and Television School,<br/>\nafter which he was hired on by a brand new TV station here in Victoria.  He<br/>\nlater got downsized, which I found out is common with new stations.  The<br/>\nexperienced people don&#39;t want to do the grunt work of working out the kinks<br/>\nat a new station, so they hire inexperienced people to start, then let them<br/>\ngo and hire the experienced people.  At any rate, Sam got some good<br/>\nexperience out of it and then took another more advanced class at GIFTS.<br/>\nHe&#39;s off any day now for England on some kind of work exchange program.<br/>\nHe&#39;s hoping to find something in film there.<br/>\nTia</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Ben Franklin, my annoyance and unschooling","postDate":"1041783876","msgId":53156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMTg1QzQ0LkFCNTZDNzU5QGVhcnRobGluay5uZXQ+","referencesHeader":"PGF2OGhoaStsNXFpQGVHcm91cHMuY29tPg=="},"prevInTopic":53141,"nextInTopic":53169,"prevInTime":53155,"nextInTime":53157,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"**Yesterday, ds-5 had me write things on signs for a club the kids were having in the livingroom.  One of them said You can do anything in this room at","messageBody":"<div id=\"ygrps-yiv-522649321\">**Yesterday, ds-5 had me write things on signs for a &quot;club&quot; the kids <br/>\nwere having in the livingroom.  One of them said &quot;You can do anything <br/>\nin this room at 7:00.&quot;  I have NO idea why he had me write that!  **<br/>\n<br/>\nWell, so many signs forbid things (Keep OFF the Grass) that it&#39;s nice to<br/>\nhave a sign that does the reverse and gives permission.<br/>\n<br/>\nI read a cute library book called The Signmaker&#39;s Apprentice.  A kid who<br/>\nworks with a signmaker gets a chance to enjoy the power of making and<br/>\nposting his own signs.  Of course the first sign he makes says &quot;No<br/>\nSchool Today&quot;.  (Yay!  That makes it an un-schooling book.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85 &lt;sheran@ptd.net&gt;","from":"&quot;kayb85 &lt;sheran@...&gt;&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Ben Franklin, my annoyance and unschooling","postDate":"1041746290","msgId":53141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF2OGhoaStsNXFpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzOC4xOTY4NTMzOC4yYjQ5MGY4ZUBhb2wuY29tPg=="},"prevInTopic":53136,"nextInTopic":53156,"prevInTime":53140,"nextInTime":53142,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"... Here was our day.  I m leaving the kids names out since I m not sure if it s safe to post them on the web or not.  ds-5 means my 5 year old son and ds-3","messageBody":"<div id=\"ygrps-yiv-663124727\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 1/4/03 8:54:58 PM, leschke@s... writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt; What interesting things have your kids been up to lately<br/>\n<br/>\n </span></blockquote>Here was our day.  I&#39;m leaving the kids&#39; names out since I&#39;m not sure <br/>\nif it&#39;s safe to post them on the web or not.  ds-5 means my 5 year <br/>\nold son and ds-3 means my 3 year old son.  Dd is 9. <br/>\n<br/>\nDd went to a friend&#39;s house today to go sleigh riding.  While getting <br/>\nready to leave the house, ds-5 was putting his socks on and he <br/>\nmentioned the &quot;M&#39;s&quot; on his socks.  I told him that they aren&#39;t M&#39;s, <br/>\nthey&#39;re W&#39;s.  I explained the difference.  <br/>\n<br/>\nBefore I took dd to her friend&#39;s house, I stopped at the library to <br/>\npick up some interlibrary loan books I had requested.  On the way to <br/>\nthe library, dd was asking me questions about snow, so I picked her <br/>\nup a book about Snowflake Bentley.  I also picked up a silly book <br/>\nabout a sheep who was having a hard time falling asleep, since she&#39;s <br/>\nbeen having some problems falling asleep on her own.  She read the <br/>\nbooks on the way to her friend&#39;s house and liked them.  <br/>\n<br/>\nOn the way home from dropping dd off, ds-3 was hungry for nuggets, so <br/>\nI went through McDonald&#39;s drive through and got him a kids&#39; meal.  <br/>\nThen we  went to Wal-mart to pick up a few groceries.  <br/>\n<br/>\nYesterday, ds-5 had me write things on signs for a &quot;club&quot; the kids <br/>\nwere having in the livingroom.  One of them said &quot;You can do anything <br/>\nin this room at 7:00.&quot;  I have NO idea why he had me write that!  <br/>\nToday he was looking at that sign and was asking me how he would know <br/>\nwhen it was 7:00.  I showed him the microwave numbers and showed him <br/>\nthat instead of a 2 being there for the hour, a 7 would be there.  <br/>\nThen I changed the time on the microwave clock for 7:00 to show him <br/>\nwhat it would look like.  He and ds-3 had a blast changing the clock <br/>\ntime on the microwave.  When he couldn&#39;t put a time on the clock <br/>\n(something like 9:87), he asked why and I explained that there are <br/>\nonly 60 minutes in an hour, and that once you hit :59, it changes <br/>\nover to the next hour.  Therefore, you can&#39;t have a number higher <br/>\nthan a 5 in the second spot.  I don&#39;t know if he got that completely, <br/>\nbut I&#39;m sure that what he needed to know at the moment was able to <br/>\nsink in.  A child&#39;s mind is beautiful. :)  <br/>\n<br/>\nWhile I went to pick dd up, dh and ds-5 started playing the Rush Hour <br/>\ngame.  We were pleasantly surprised at how well he did on the game!  <br/>\nHe spent 15 minutes concentrating and studying one of the puzzles <br/>\nbefore he figured it out.  Who says little boys don&#39;t have big <br/>\nattention spans!  They just need to be concentrating on something <br/>\nthat they care about!  <br/>\n<br/>\nDd spent some time working on Cluefinder&#39;s Toy Store computer game.  <br/>\nIt involved a lot of math problems, and she struggled a lot with <br/>\nthem.  I was in the middle of a project and couldn&#39;t really help her <br/>\nmuch, except for little suggestions here and there.  She worked <br/>\nthrough a lot of the problems on her own with minimal help, even <br/>\nthough she was frustrated.  When she had challenged herself just <br/>\nenough, she quit the game.  <br/>\n<br/>\nI played &quot;Reindeer&quot; with ds-3.  This game usually involves him <br/>\nputting a Santa hat on himself and a reindeer antler headband on me.  <br/>\nHe holds on to the back of my pants and tells me to fly.  When he <br/>\nwants me to stop, he gives me a wedgie. I can&#39;t complain though, <br/>\nbecause &quot;Reindeer don&#39;t talk&quot;.  He goes into the foyer, climbs down <br/>\nthe chimney (climbs over the couch into the livingroom), and puts a <br/>\npresent under the tree.  Then he climbs back over the couch and tells <br/>\nme to fly to the playroom for more toys.   The game didn&#39;t last very <br/>\nlong today without the Christmas tree.  He says that he misses it. <br/>\n<br/>\nDs-5 and I spent some time on his bunk bed writing tickets for his <br/>\nclub.  He had me write, &quot;***&#39;s Club&quot; on a piece of paper.  He wrote <br/>\nMOM above it.  That is my ticket.  Then he asked me how to <br/>\nspell, &quot;****(the name of his sister) is not allowed&quot; and he wrote it <br/>\non a piece of paper.  I am amazed at how well he writes letters <br/>\nconsidering how little time we&#39;ve spent on it!  When he asked what a <br/>\nW looked like, I reminded him about the W&#39;s on his socks this <br/>\nmorning.  Dd got very upset that she wasn&#39;t allowed in his club and <br/>\nshe tore up the paper.  ds-5 started crying about it.  I think what <br/>\nhe was really upset about is that he had spent so much time writing <br/>\nit for it to get ripped up so soon.  But let&#39;s face it--his <br/>\nmotivation in writing that was to antagonize his sister, and he can&#39;t <br/>\nexpect to write something like that and not get it ripped up.  Dd <br/>\nasked me why I spelled allowed the way I did.  She thought it was <br/>\nspelled aloud.  I explained the difference to her.  What an <br/>\ninteresting spelling lesson!  While this was going on in the top <br/>\nbunk, ds-3 was having his own little Santa Clause Club in the lower <br/>\nbed.  When ds-5 kicked her out of his club, ds-3 invited dd to his <br/>\nSanta club.  I wonder how long this Santa obsession will last!  <br/>\n<br/>\nDs-3 helped me make peanut butter cookies this evening.  His big job <br/>\nwas pressing the buttons on the microwave.  He loves it and that is <br/>\nhow he is learning his numbers!  Ds-5 also warmed up his supper by <br/>\nasking me which buttons to press on the microwave.  <br/>\n<br/>\nThe kids just watched a movie together.  Ds-5 colored a paper plate <br/>\nfor me with a heart on one side and on the other side &quot;Mom&quot;. He says <br/>\nit is a frisbee.  He is asking me to help him find his new Thomas <br/>\ncomputer game that he got for Christmas.  After I search for that for <br/>\na few minutes, we&#39;re off to bed!</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041743292","msgId":53136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMTdCREJCLjNFRTAxQTY2QGVhcnRobGluay5uZXQ+","referencesHeader":"PDEzOC4xOTY4NTMzOC4yYjQ5MGY4ZUBhb2wuY29tPg=="},"prevInTopic":53135,"nextInTopic":53141,"prevInTime":53135,"nextInTime":53137,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"**I spent an hour and a half talking to an old friend (who s a former boyfriend from early days, Jr. High) about another old friend (former college boyfriend)","messageBody":"<div id=\"ygrps-yiv-2059767199\">**I spent an hour and a half talking to an old friend (who&#39;s a former<br/>\nboyfriend <br/>\nfrom early days, Jr. High) about another old friend (former college <br/>\nboyfriend) who is listed in the footnotes of a book the former is<br/>\nworking on, <br/>\nand he&#39;s needing to call him and talk to him after not having seen him<br/>\nfor 27 <br/>\nyears or so.  So I was briefing him on some things he might say and<br/>\nmight <br/>\nwant not say in that conversation, and I ended up crying.  It was<br/>\ncathartic <br/>\nbut I hadn&#39;t scheduled any catharsis this evening.  It&#39;s wonderful to<br/>\nhave a <br/>\nfriend who knows me so well that when I tell a story that stretches from<br/>\n1973 <br/>\nto 1981, he knows all the other characters, can picture each of the four <br/>\nhouses involved in the sequence, and can remind me of things I&#39;m<br/>\nforgetting, <br/>\nbecause he was there too.  **<br/>\n<br/>\n<br/>\nI&#39;ve been doing the nostalgia thing, too.  Yesterday I helped my brother<br/>\nmove.  It was chaotic, because he is a total pack rat, but it was great<br/>\nbecause he has things that were my grandmother&#39;s and things from our<br/>\nchildhood that I haven&#39;t seen in ages.  He also has a huge and eclectic<br/>\ncollection of books.  So on some future day that&#39;s less hectic, I&#39;m<br/>\ngonna rent my own moving van &lt;g&gt; and drive over and visit him and borrow<br/>\na HUGE pile of books.  (Something to look forward to during the wet months.)<br/>\n<br/>\nMy other upcoming project is terracing the steep slope in the corner of<br/>\nour new backyard.  Anyone have any expertise in building retaining walls<br/>\nthat they&#39;d care to pass on?<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":107520860,"authorName":"hmsclmyboy@aol.com","from":"hmsclmyboy@...","profile":"hmsclmyboy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041742860","msgId":53135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ni4xOWRhMjIyYy4yYjQ5MTYwY0Bhb2wuY29tPg=="},"prevInTopic":53134,"nextInTopic":53136,"prevInTime":53134,"nextInTime":53136,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/4/03 8:58:17 PM Pacific Standard Time, leschke@shaw.ca ... What type of computers and programing were they using to do the editing.  My ","messageBody":"<div id=\"ygrps-yiv-1227205659\">In a message dated 1/4/03 8:58:17 PM Pacific Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a> <br/>\nwrites:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She brought in<br/>\n&gt; another teacher to work with him on editing <br/>\n<br/>\n </span></blockquote>What type of computers and programing were they using to do the editing.  My <br/>\ndaughter also does this.  I am hoping to find an advanced class for her next <br/>\nyear she is teaching other people right now and doing a promo video for a <br/>\ngymnastic center.  <br/>\n<br/>\nHeidi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041742638","msgId":53134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjAwMWMyYjQ3NyQxM2ViNzBhMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDEzOC4xOTY4NTMzOC4yYjQ5MGY4ZUBhb2wuY29tPg=="},"prevInTopic":53132,"nextInTopic":53135,"prevInTime":53133,"nextInTime":53135,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"... really ... Yeah, he s really interested in camera work and editing.  He just finished taking a class, and the teacher said he s a natural. Is the fulltime","messageBody":"<div id=\"ygrps-yiv-572540398\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; &lt;&lt; What interesting things have your kids been up to lately?  Mine is<br/>\n </span></blockquote>really<br/>\n<blockquote><span title=\"ireply\"> &gt; into film, and he&#39;s going to be working full time for a couple of weeks<br/>\n&gt; starting this week. &gt;&gt;<br/>\n&gt;<br/>\n&gt; Into film meaning film making?<br/>\n<br/>\n </span></blockquote>Yeah, he&#39;s really interested in camera work and editing.  He just finished<br/>\ntaking a class, and the teacher said he&#39;s a natural.<br/>\n<br/>\nIs the fulltime work film related?<br/>\n<br/>\nNo, he&#39;s working for his dad putting cones on baby trees.  Those are the<br/>\nflexible plastic protectors they put on newly planted conifers to keep the<br/>\ndeer from eating them.  It&#39;s good money - piecework - so the harder he<br/>\nworks, the more he makes.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Holly got a camcorder for Christmas and has made two little plays-on-video<br/>\n&gt; with some friends of hers.  They have a list of proposed other scenarios,<br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; they&#39;ve voted and rated them in order.  Monday I think they&#39;re doing one<br/>\n </span></blockquote>with<br/>\n<blockquote><span title=\"ireply\"> &gt; stuffed animals moved puppet-like, and they&#39;re doing something like Family<br/>\n&gt; Feud.  They write their little scripts (not on paper, they just plan them<br/>\n </span></blockquote>in<br/>\n<blockquote><span title=\"ireply\"> &gt; the air, but they rehearse and have some specific dialog, and some ad<br/>\n </span></blockquote>lib).<br/>\n<br/>\nInteresting.  That was the part of the class that Lars did *not* like.  In<br/>\nfact, he spoke to the teacher and told her his interests.  She brought in<br/>\nanother teacher to work with him on editing while the rest of the group<br/>\nworked on story.<br/>\nTia</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041741198","msgId":53132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzOC4xOTY4NTMzOC4yYjQ5MGY4ZUBhb2wuY29tPg=="},"prevInTopic":53128,"nextInTopic":53134,"prevInTime":53131,"nextInTime":53133,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/4/03 8:54:58 PM, leschke@shaw.ca writes: ","messageBody":"<div id=\"ygrps-yiv-1986281325\">In a message dated 1/4/03 8:54:58 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a> writes:<br/>\n<br/>\n&lt;&lt; What interesting things have your kids been up to lately?  Mine is really<br/>\ninto film, and he&#39;s going to be working full time for a couple of weeks<br/>\nstarting this week. &gt;&gt;<br/>\n<br/>\nInto film meaning film making?  Is the fulltime work film related?<br/>\n<br/>\nKirby has been working extra much, because of inventory and another employee <br/>\nleaving.  His armor is nearly finished.   I need to make a pair of pants to <br/>\ngo over his leg armor, which is articulated kydex (black plastic stuff), and <br/>\nhe needs gauntlets.<br/>\n<br/>\nMarty and I have had a lot of interaction lately over online sharings (games, <br/>\nsites), watching Kevin Smith question and answer stuff (a two-DVD set we <br/>\nrented of Kevin Smith speaking at various universities, all edited up so it <br/>\nkinda flows--very interesting), and he&#39;s been extra talkative lately.<br/>\n<br/>\nHolly got a camcorder for Christmas and has made two little plays-on-video <br/>\nwith some friends of hers.  They have a list of proposed other scenarios, and <br/>\nthey&#39;ve voted and rated them in order.  Monday I think they&#39;re doing one with <br/>\nstuffed animals moved puppet-like, and they&#39;re doing something like Family <br/>\nFeud.  They write their little scripts (not on paper, they just plan them in <br/>\nthe air, but they rehearse and have some specific dialog, and some ad lib).  <br/>\n<br/>\nFor a year they&#39;ve done these as plays, and once they did some as a radio <br/>\ntalk show on audio tape.<br/>\n<br/>\nThursday night Keith, Marty and Kirby had a manly outing to &quot;Smackdown,&quot; the <br/>\nlocal live visitation of the WWE gladiatorial soap opera.  <br/>\n<br/>\nFriday night, Keith, Kirby, Holly and I went to a folksinging party.  They&#39;re <br/>\nmonthly, but we hadn&#39;t been since last Spring for various reasons.  I had a <br/>\nGREAT time.  When we left I thought it was about midnight and Kirby thought <br/>\nit was about 11:00.  It was 1:00.  That means I had a good time and Kirby had <br/>\nan even better time.  There was a teenaged girl there he&#39;s known since they <br/>\nwere both little.  She&#39;s leaving for college in fall, and Kirby&#39;s usually <br/>\nbusy on Friday nights.  She lives in Los Alamos, and so is only in town for <br/>\nsinging parties.  They were in the room for some of the singing, but part of <br/>\nthe time they were taking dogs for walks and other outside activities.  The <br/>\nhouse we go to was a farm, long ago, and the outbuildings are all still <br/>\nthere.  There are big stables (a cow barn) and chicken coops and Kirby said <br/>\nthey talked about past years when they played here and there, and hid from <br/>\nthe younger kids, and they went and peeked through the places they had used <br/>\nfor hiding places with lookouts.  I asked if they had to squat down to peek <br/>\nthrough, and he said yes.  She&#39;s still pretty short, but Kirby&#39;s 5&#39;10&quot; or <br/>\n-11&quot;.<br/>\n<br/>\nMarty  hadn&#39;t wanted to go to that.  He stayed here with his friend Joey.<br/>\n<br/>\nAt the moment, Holly is in the kitchen setting up for a snack for me and her, <br/>\nKeith is in the back watching football, and Kirby and Marty are at a D&D <br/>\ngame.   <br/>\n<br/>\nI spent an hour and a half talking to an old friend (who&#39;s a former boyfriend <br/>\nfrom early days, Jr. High) about another old friend (former college <br/>\nboyfriend) who is listed in the footnotes of a book the former is working on, <br/>\nand he&#39;s needing to call him and talk to him after not having seen him for 27 <br/>\nyears or so.  So I was briefing him on some things he might say and might <br/>\nwant not say in that conversation, and I ended up crying.  It was cathartic <br/>\nbut I hadn&#39;t scheduled any catharsis this evening.  It&#39;s wonderful to have a <br/>\nfriend who knows me so well that when I tell a story that stretches from 1973 <br/>\nto 1981, he knows all the other characters, can picture each of the four <br/>\nhouses involved in the sequence, and can remind me of things I&#39;m forgetting, <br/>\nbecause he was there too.  <br/>\n<br/>\nEarlier today I was helping another homeschooling mom take notes and do some <br/>\nresearch for a trip to a lawyer Monday.  She might be leaving her husband.  <br/>\nThat was stress and might have been the seed for the later emotion.  <br/>\n<br/>\nI notice that discussing unschooling doesn&#39;t limit itself to kids.  They&#39;re <br/>\nlearning by example from what we do.  Kirby&#39;s seeing that his friendship with <br/>\nRowan could be for life, as mine with Frank&#39;s is.  Holly&#39;s seeing Keith <br/>\nresting after working on armor and tents today, and me not bugging him to do <br/>\nsomething with me instead of watching football; that&#39;s useful!  (Last night <br/>\nhe drove us the 25 miles to that party, and sang, and waited patiently until <br/>\nwe were all ready to come home.)   Holly&#39;s seeing the stages people can go <br/>\nthrough coming to marital and family decisions, in knowing the family in <br/>\ncrisis.<br/>\n<br/>\nPretty busy day, all in all.<br/>\n<br/>\nAbout that humility lecture &quot;someone&quot; got (I think it was me, but I&#39;d hate to <br/>\nbe accused of arrogance again)...<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://SandraDodd.com/humility/formality7.html\">http://SandraDodd.com/humility/formality7.html</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041738917","msgId":53128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYjAwMWMyYjQ2ZSQ1NzQ3N2JlMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDFhZC5lMmQ1NjBjLjJiNDhlNDQ4QGFvbC5jb20+IDwzRTE3OTBERC4yMDU1N0IyNkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":53125,"nextInTopic":53132,"prevInTime":53127,"nextInTime":53129,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"... Hey pot! What interesting things have your kids been up to lately?  Mine is really into film, and he s going to be working full time for a couple of weeks ","messageBody":"<div id=\"ygrps-yiv-757129043\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; ** Talk about the pot calling the kettle black**<br/>\n&gt;<br/>\n&gt; It would be nice if the pot and the kettle would talk about unschooling<br/>\n&gt; instead of each other.<br/>\n<br/>\n </span></blockquote>Hey pot!<br/>\nWhat interesting things have your kids been up to lately?  Mine is really<br/>\ninto film, and he&#39;s going to be working full time for a couple of weeks<br/>\nstarting this week.<br/>\nSincerely,<br/>\nKettle</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041738244","msgId":53125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYWQwMWMyYjQ2ZSQ1MTVhYzJhMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDIwMDMwMTA0LjE3NDYzMC4yNTIwLjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":53120,"nextInTopic":53128,"prevInTime":53124,"nextInTime":53126,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"... Oops. Tia","messageBody":"<div id=\"ygrps-yiv-43500107\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; No, it was from me, Tia.  Not a moderator, just obnoxious. &lt;g&gt;<br/>\n<br/>\n </span></blockquote>Oops.<br/>\nTia</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041736645","msgId":53120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MS42ZTMyZjZjLjJiNDhmZGM1QGFvbC5jb20+"},"prevInTopic":53118,"nextInTopic":53125,"prevInTime":53119,"nextInTime":53121,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/4/03 6:29:58 PM, grlynbl@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-598361995\">In a message dated 1/4/03 6:29:58 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> writes:<br/>\n<br/>\n&lt;&lt; Why dont you take your own advice.  So many folks on here say,, If you <br/>\ndont <br/>\nlike it delete it. as they respond to something they dont agree with..Talk <br/>\nabout the pot calling the kettle black &gt;&gt;<br/>\n<br/>\nNo, let&#39;s DON&#39;T talk about the pot calling the kettle black.<br/>\nLet&#39;s talk about unschooling.</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041731805","msgId":53118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMTc5MERELjIwNTU3QjI2QGVhcnRobGluay5uZXQ+","referencesHeader":"PDFhZC5lMmQ1NjBjLjJiNDhlNDQ4QGFvbC5jb20+"},"prevInTopic":53117,"nextInTopic":53120,"prevInTime":53117,"nextInTime":53119,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"** Talk about the pot calling the kettle black** It would be nice if the pot and the kettle would talk about unschooling instead of each other. Betsy","messageBody":"<div id=\"ygrps-yiv-762017233\">** Talk about the pot calling the kettle black**<br/>\n<br/>\nIt would be nice if the pot and the kettle would talk about unschooling<br/>\ninstead of each other.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041730120","msgId":53117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhZC5lMmQ1NjBjLjJiNDhlNDQ4QGFvbC5jb20+"},"prevInTopic":53113,"nextInTopic":53118,"prevInTime":53116,"nextInTime":53118,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/4/03 4:40:19 PM Eastern Standard Time, ddzimlew@juno.com ... Why dont you take your own advice.  So many folks on here say,, If you dont ","messageBody":"<div id=\"ygrps-yiv-161804647\">In a message dated 1/4/03 4:40:19 PM Eastern Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; like reading Ben Franklin, but what I think I&#39;m reading from you is<br/>\n&gt; getting on my nerves.<br/>\n&gt; Let&#39;s just talk about unschooling and IDEAS and let it be.<br/>\n&gt; If you don&#39;t like a post, delete.   If you don&#39;t like a style, delete.  <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Why dont you take your own advice.  So many folks on here say,, If you dont <br/>\nlike it delete it. as they respond to something they dont agree with..Talk <br/>\nabout the pot calling the kettle black<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041727590","msgId":53113,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMTA0LjE3NDYzMC4yNTIwLjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":53111,"nextInTopic":53117,"prevInTime":53112,"nextInTime":53114,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"... No, it was from me, Tia.  Not a moderator, just obnoxious.  Deb L","messageBody":"<div id=\"ygrps-yiv-1243470317\">On Sat, 04 Jan 2003 16:34:31 -0800 Tia Leschke &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a>&gt; writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That post was from the moderator.<br/>\n<br/>\n </span></blockquote>No, it was from me, Tia.  Not a moderator, just obnoxious. &lt;g&gt;<br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041726871","msgId":53111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjAwMWMyYjQ1MiQ3NjQ0NDllMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDEwNDE3MjMzOTkuMTI2Ny42NjkyNS5tM0B5YWhvb2dyb3Vwcy5jb20+IDwzRTE3Nzk0RC42MDAwMzA1QGF0dC5uZXQ+"},"prevInTopic":53109,"nextInTopic":53113,"prevInTime":53110,"nextInTime":53112,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"... delete.   If you don t like a style, delete. That post was from the moderator. Tia","messageBody":"<div id=\"ygrps-yiv-1245691386\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I like reading Ben Franklin, but what I think I&#39;m reading from you is<br/>\n&gt; getting on my nerves.<br/>\n&gt; Let&#39;s just talk about unschooling and IDEAS and let it be.<br/>\n&gt; If you don&#39;t like a post, delete.   If you don&#39;t like a style, delete. &gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I can say exactly the same thing to you here...If you don&#39;t like a post,<br/>\n </span></blockquote>delete.   If you don&#39;t like a style, delete.<br/>\n<br/>\nThat post was from the moderator.<br/>\nTia</div>","specialLinks":[]},{"userId":129256077,"authorName":"bluelotus","from":"bluelotus &lt;bluelotus@...&gt;","profile":"yolswandass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Ben Franklin, my annoyance and unschooling","postDate":"1041725773","msgId":53109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMTc3OTRELjYwMDAzMDVAYXR0Lm5ldD4=","referencesHeader":"PDEwNDE3MjMzOTkuMTI2Ny42NjkyNS5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":53093,"nextInTopic":53111,"prevInTime":53108,"nextInTime":53110,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-400392564\">&lt;&lt;***I thought a piece of a post I got on another list may be appropriate <br/>\nhere. It&#39;s from Benjamin Franklin&#39;s Biography:***<br/>\n<br/>\nI like reading Ben Franklin, but what I think I&#39;m reading from you is<br/>\ngetting on my nerves.<br/>\nLet&#39;s just talk about unschooling and IDEAS and let it be.<br/>\nIf you don&#39;t like a post, delete.   If you don&#39;t like a style, delete. &gt;&gt;<br/>\n<br/>\n<br/>\nI can say exactly the same thing to you here...If you don&#39;t like a post, delete.   If you don&#39;t like a style, delete.<br/>\n<br/>\nYol <br/>\n<br/>\n-- <br/>\n<br/>\nBlue Lotus Therapeutics -<br/>\nAyurveda, Homeopathy, Yoga & Therapeutic Massage<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bluelotustherapeutics.com\">http://www.bluelotustherapeutics.com</a><br/>\n<br/>\nDhyanyoga Center of NC -<br/>\nMeditation - Kundalini Maha Yoga<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dyc-nc.org\">http://www.dyc-nc.org</a><br/>\n<br/>\n**********************************<br/>\nWhen nothing is done, nothing is left undone. The world is ruled by <br/>\nletting things take their course. It cannot be ruled by interfering.<br/>\n-- Tao Te Ching<br/>\n**********************************</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Ben Franklin, my annoyance and unschooling","postDate":"1041716313","msgId":53093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMTA0LjE0MzgzNC4yNTIwLjQuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":53109,"prevInTime":53092,"nextInTime":53094,"topicId":53093,"numMessagesInTopic":0,"msgSnippet":"On Sat, 04 Jan 2003 14:28:29 -0500 bluelotus  writes: ***I thought a piece of a post I got on another list may be appropriate here. It s","messageBody":"<div id=\"ygrps-yiv-2052208042\">On Sat, 04 Jan 2003 14:28:29 -0500 bluelotus &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a>&gt; writes:<br/>\n<br/>\n***I thought a piece of a post I got on another list may be appropriate <br/>\nhere. It&#39;s from Benjamin Franklin&#39;s Biography:***<br/>\n<br/>\nI like reading Ben Franklin, but what I think I&#39;m reading from you is<br/>\ngetting on my nerves.<br/>\nLet&#39;s just talk about unschooling and IDEAS and let it be.<br/>\nIf you don&#39;t like a post, delete.   If you don&#39;t like a style, delete.  <br/>\n<br/>\nNow, on to unschooling.<br/>\nWe were at the video store today.   We&#39;re always at the video store. <br/>\nRecently they&#39;ve been remodeling and they&#39;ve done a nice job.   The<br/>\nowners are neighbors of ours across the ally and creek.   I used to pull<br/>\ntheir little kid out of the water when he&#39;d escape from the yard. <br/>\nAnyway, they put in a nice new front door, looks great, and while I was<br/>\ntalking with the lady there, Dylan was looking around, just looking<br/>\naround at the ceiling and the door.   Finally he says,  &quot;you know, if<br/>\nthere was a fire and part of the ceiling fell right here you couldn&#39;t get<br/>\nthe door open to get out.&quot;   Silence.    The door opens inward.  <br/>\nHer husband walks through and notices the blank look on his wife&#39;s face, <br/>\n &quot;What?&quot;   Dylan, ten year old annoying person, repeats what he just told<br/>\nMrs. Video.    Mrs. Video says something about isn&#39;t there a fire code<br/>\nand did he check it and, and, and...   I&#39;m trying to sneak out but he&#39;s<br/>\nstanding in front of the door (that opens inward.)   We finally did get<br/>\nout of there and I asked Dylan where he learned about fire codes and he<br/>\nsays &quot;What&#39;s a fire code?&quot;   &lt;g&gt;    We came home and looked up Montana<br/>\nfire codes.   <br/>\nAll that learning and on a Saturday, too!  <br/>\n<br/>\nDeb L</div>","specialLinks":[]}],"prevTopicId":53019,"nextTopicId":53131}}