{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"HEM-Online-Newsletter  by way of Home Ed","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  January 2002","postDate":"1009908534","msgId":30530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkyN2I4NTdhYmFjZjIxM0BbMjA4LjI2LjIzNS4xNDVdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":30529,"nextInTime":30531,"topicId":30530,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS January 2002 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Happy New Year and welcome to HEM S","messageBody":"<div id=\"ygrps-yiv-1748278370\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nJanuary 2002<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHappy New Year and welcome to HEM&#39;S ONLINE NEWS, a free monthly <br/>\nnewsletter published by Home Education Magazine and full of the best <br/>\ninternet resources, homeschooling news, announcements and article <br/>\nexcerpts. For more information on Home Education Magazine, see the <br/>\nend of this newsletter or visit our web site at <br/>\nhttp://home-ed-magazine.com. For subscription information for the <br/>\nnewsletter, scroll to the end, reading everything in between. Send <br/>\nyour comments and questions to editor Carol Narigon at <br/>\nHEM-Newsletter@....<br/>\n<br/>\nIn the January issue:<br/>\n<br/>\n~ Standardistas ~<br/>\n~ HEM Back Issue Sale ~<br/>\n~ Ask Carol~<br/>\n~ Unschooling ~<br/>\n~ Top 10 Websites ~<br/>\n~ Top 5 Product Reviews ~<br/>\n~ NASA Student Program ~<br/>\n~ AHA Quarterly Journal ~<br/>\n~ Call for Success Stories ~<br/>\n~ The Final Word-Mr. Pointy Nose ~<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nLove the earth and sun and animals,<br/>\nDespise riches, give alms to everyone that asks,<br/>\nStand up for the stupid and crazy,<br/>\nDevote your income and labor to others...<br/>\nAnd your very flesh shall be a great poem.<br/>\n~~ Walt Whitman ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nSTANDARDISTAS<br/>\nhttp://www.home-ed-magazine.com/HEM/191.html<br/>\n<br/>\n&quot;They want to get rid of cilia!&quot; exclaimed Aliyah, a frown deepening <br/>\nacross her 13-year-old face as she speed-read the article.<br/>\n<br/>\n&quot;Cilia, too,&quot; I repeated, putting down the sports section.<br/>\n<br/>\n&quot;Well, cilia are the whole reason for paramecium. How is anyone going <br/>\nto talk with a scientist? What are we going to say -- &#39;little wavy <br/>\nthings?&#39;&quot;<br/>\n<br/>\n&quot;How about flagella?&quot; I suggested, then remembering -- stupid me -- <br/>\nthat those are found among a different class of critters entirely.<br/>\n<br/>\n&quot;No, they are getting rid of flagella, too!&quot;<br/>\n<br/>\nAli was reading a May 2001 article on a new, highly publicized guide <br/>\nDesigns for Science Literacy, published and promoted by the American <br/>\nAssociation for the Advancement of Science. The recommendations, <br/>\nbeing sent to every school board, school administrator, and school <br/>\nsuperintendent in the United States, are designed, according to <br/>\nAndrew Ahlgren, project associate director, &quot;to assist education <br/>\nleaders, teachers, publishers, and developers in assembling <br/>\ninstructional materials for kindergarten through twelfth grade that <br/>\nare coherent and relevant.&quot; The goal, says Ahlgren, is to change the <br/>\ncurriculum so that even basic science education &quot;is challenging and <br/>\nmeets global standards.&quot;<br/>\n<br/>\n&quot;No right-angle trigonometry?&quot; She was now really steamed. &quot;How will <br/>\nwe build anything? And, look, they removed the periodic table, and <br/>\nacids and bases. How is anyone going to understand acid rain? And no <br/>\nmore oxidation, respiration, aerobic or anaerobic...&quot;<br/>\n<br/>\n&quot;Well, I guess we&#39;ll simply have to talk about breathing.&quot;<br/>\n<br/>\n&quot;And they are getting rid of mitochondria. How can you study <br/>\nevolution without mitochondria?&quot;<br/>\n<br/>\n&quot;Hey, Ali, this is not my idea,&quot; I reminded my daughter, intending to <br/>\ncool down the conversation. &quot;Why don&#39;t you write them a letter?&quot;<br/>\n<br/>\n&quot;How is anyone going to talk with a scientist?&quot; was the question that <br/>\nstuck in my craw. I might have added, &quot;How could one understand fully <br/>\nthe public controversy about the teaching of evolution, or how could <br/>\none act as a responsible citizen to curb air pollution?&quot;<br/>\n~~ Excerpt from David H. Albert&#39;s column in the Jan/Feb issue of Home <br/>\nEducation Magazine ~~<br/>\n<br/>\nYou can read the rest of this article, as well as more articles and <br/>\ncolumns from the Jan/Feb issue at <br/>\nhttp://www.home-ed-magazine.com/HEM/191.html. But you&#39;ll have to get <br/>\nthe magazine-the one you hold in your hands--to read them all! See <br/>\nsubscription information at the end of this newsletter or visit your <br/>\nlocal bookseller and get your copy today!<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S ANNUAL BACK ISSUE SALE<br/>\n<br/>\nHome Education Magazine is again offering an opportunity to stock up <br/>\non some great homeschool reading for the winter with our popular <br/>\nAnnual Back Issue Sale. Our office manager has selected our most <br/>\npopular theme packages for this sale. Whether you are interested in <br/>\nGetting Started or Unschooling you will find these packages full of <br/>\nuseful homeschooling insights.<br/>\n<br/>\nDon&#39;t see a package that fits your needs? Then create your own custom <br/>\nset of any 3 issues from the available issues.<br/>\n<br/>\nIssues are available in sets of three for $11.25 per package (postpaid!).<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nASK CAROL<br/>\n<br/>\nI wear two hats for HEM-one is the editor hat for this newsletter; <br/>\nthe other is a columnist hat for Home Education Magazine, the <br/>\noriginal print version that&#39;s been supporting homeschoolers for over <br/>\n20 years.<br/>\n<br/>\nEvery other month, I ask people to send me questions and I promise to <br/>\nanswer as many as I can in future columns. Although I don&#39;t answer <br/>\nthem in this newsletter, where the space is just too tiny for my BIG <br/>\nadvice, I do answer them in every issue of Home Education Magazine, <br/>\nand for your convenience, I&#39;ve put subscription information at the <br/>\nend of the newsletter. A couple of them are online <br/>\n(http://www.home-ed-magazine.com/HEM/issue_index.html), but most of <br/>\nthem you have to read in the magazine.<br/>\n<br/>\nI really like to get your questions-any questions at all, even if you <br/>\nthink your question is stupid and you&#39;re the only one who has your <br/>\nparticular problem (it&#39;s probably not true). If you don&#39;t have a <br/>\nquestion, send me something funny in the form of a question. Somebody <br/>\nonce asked me if she could homeschool if she has a tattoo and rides a <br/>\nHarley. Her answer got more than half the column.<br/>\n<br/>\nSo, help me out with that other hat, and send me your questions. I <br/>\neven have a special email address: askcarol@... . Of <br/>\ncourse, I don&#39;t promise I can answer every question (especially if <br/>\nyou don&#39;t send one!), but I try to respond to each one, whether I use <br/>\nit for a column or not. What are you waiting for?<br/>\n(~ CN ~)<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\nhttp://www.unschooling.com<br/>\n<br/>\nI think ideas are easier to wrangle with if we can nail them down, <br/>\nget at the essence of them, put them into a box. Trying to get at the <br/>\nessence of unschooling is like trying to get at the essence of life.<br/>\n<br/>\nFor us, unschooling *is* life. Our lives are a balance of needs and <br/>\ndesires, hopes and fears, love and tears, peace and upheaval - you <br/>\nname it, and it&#39;s there. Learning is a part of all of it, not <br/>\nseparate from it.<br/>\n<br/>\nWhen I require something of my children, it is usually because there <br/>\nis an immediate and very real *need* for it - to keep them healthy <br/>\nand safe, to keep the family functioning, to respect someone else&#39;s <br/>\nneeds or feelings, etc. Certainly there are things I think would be <br/>\nuseful, even essential for them to know in order to function <br/>\nindependently as adults. These things are so obviously practical and <br/>\nuseful in our everyday lives that I can&#39;t fathom them not seeing a <br/>\nneed to learn them at some point.<br/>\n<br/>\nThere are many, many more things that I hope they will explore, and <br/>\nthese I will certainly open doors to for them. But I believe that by <br/>\nfar the most valuable things for them to know are what they <br/>\nthemselves find interesting and useful. I trust them to choose and <br/>\npursue what they will, and I trust that they will become competent, <br/>\ncapable and knowledgeable adults in the process.<br/>\n<br/>\nI respect their needs, feelings and desires. I believe that young <br/>\nchildren&#39;s needs include being shielded from the responsibility of <br/>\nmaking decisions they do not yet have the knowledge and experience to <br/>\nmake - things for which they should not have to bear the consequences <br/>\n- and this is my job as a parent. It is a tricky to job to balance <br/>\nour children&#39;s needs with their desires, especially when they can&#39;t <br/>\nyet see that they are sometimes different, or when they are <br/>\ndiametrically opposed. I don&#39;t see it as coercion or conditional <br/>\nfreedom, but rather as a real-life lesson in making decisions, <br/>\nguidance, parenting. From the time that they are able to understand <br/>\nthe choices, they are part of the process.<br/>\n<br/>\nFreedom and responsibility go hand in hand. What responsibility I <br/>\ntake for my children limits their own, and thus limits their freedom. <br/>\nThey are *dependent* upon me. As an example, before they can cook, I <br/>\nprepare their food, and they eat from what I prepare. Their choices <br/>\nare limited to what I supply, *though I always do my best to meet <br/>\nboth their needs and likes*. I in turn am limited by the household <br/>\nbudget, and bound by my responsibility to look after their health. <br/>\nWhen I do choose contrary to what they *desire*, I explain my choice, <br/>\nand I respect their feelings about it, no matter how unpleasant.<br/>\n<br/>\nAs children are ready for more responsibility, they gain more <br/>\nfreedom. They are maturing, growing up, learning to make good <br/>\ndecisions. This is life. It is a process, a work in progress. <br/>\nUnschooling.<br/>\n~~ Laura Derrick ~~<br/>\n<br/>\nUnschooling.com offers message boards, weekly essays, an email list <br/>\nand more just for unschoolers. Check it out!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nTOP 10 WEBSITES for 2001<br/>\n<br/>\nOut of the millions out there on the Internet, I try to choose only <br/>\nthe best websites for each newsletter. Here is my top 10 list of <br/>\nfavorite websites from 2001.<br/>\n<br/>\n1. K-12 Teaching and Learning Center at http://www.k12tlc.org<br/>\n<br/>\n2. Autodidactic Press at http://www.autodidactic.com<br/>\n<br/>\n3. Math lessons at http://math.rice.edu/%7Elanius/Lessons<br/>\n<br/>\n4. Kids Konnect at http://www.kidskonnect.com<br/>\n<br/>\n5. The Green Frog News at http://www.thegreenfrognews.com<br/>\n<br/>\n6. sodaplay at http://www.sodaplay.com/index.htm<br/>\n<br/>\n7. One World-Nations Online at http://www.nationsonline.org/oneworld<br/>\n<br/>\n8. Absurd Math at http://www.hrmvideo.com/abmath<br/>\n<br/>\n9. Enchanted Learning at http://www.enchantedlearning.com<br/>\n<br/>\n10. How Stuff Works at http://www.howstuffworks.com<br/>\n<br/>\n  &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S NETWORKING AND DISCUSSION BOARDS<br/>\nhttp://www.home-ed-magazine.com/wlcm_brds.html<br/>\n<br/>\nJoin us in discussions on topics of interest to homeschoolers at the <br/>\nHEM Networking and Discussion message boards. Some of the topics <br/>\ninclude: For New Homeschoolers, Homeschooling News and Important <br/>\nInformation, State Laws and Regulations, Support Groups and <br/>\nOrganizations, Homeschooling Dads, Homeschooling Teens and Older <br/>\nKids, Curriculum Discussions, Homeschooling with Special Needs, <br/>\nGeneral Discussions About Almost Anything. For information contact <br/>\nHEM-Boards@....<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nTOP 5 PRODUCT REVIEWS for 2001<br/>\n<br/>\nIn most issues of HEM&#39;s Online News, I review a new product, video or <br/>\nbook. This month, I&#39;ve made a list of my top 5 favorite products from <br/>\n2001. If you&#39;d like to read the original reviews for these products, <br/>\nyou&#39;ll find all of the newsletters from the past 2 years indexed on <br/>\nour website at<br/>\nhttp://www.home-ed-magazine.com/hemnews/main_index.html .<br/>\n<br/>\n1. Gardening books, &quot;Sunflower Houses: Garden Discoveries for <br/>\nChildren of All Ages&quot;; &quot;Hollyhock Days: Garden Adventures for the <br/>\nYoung at Heart&quot;; and &quot;Roots, Shoots, Buckets and Boots&quot; by Sharon <br/>\nLovejoy.<br/>\nhttp://www.sharonlovejoy.com<br/>\n<br/>\n2. Slam poetry video, &quot;Poetic License.&quot; (language warning)<br/>\nhttp://www.poeticlicense.org<br/>\n<br/>\n3. Sign language video for young children, &quot;Baby See &#39;n Sign.&quot; <br/>\nwww.babyseensign.com<br/>\n<br/>\n4. Portable electronic writing tool, Alphasmart 3000.<br/>\nhttp://www.alphasmart.com<br/>\n<br/>\n5. Video series, Families of the World.<br/>\nhttp://www.familiesoftheworld.com<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBOOKS!<br/>\n<br/>\nCheck out HEM&#39;s online book catalog, with titles by respected <br/>\nhomeschooling authors like Linda Dobson, David Albert, Larry and <br/>\nSusan Kaseman, Jean Reed and others. Visit our new HEM Online Catalog <br/>\nat the HEM website:<br/>\nhttp://www.home-ed-magazine.com/books<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nNASA STUDENT PROGRAM TAKES OFF!<br/>\n<br/>\nSomething for everybody seems to be the theme for the 2001-2002 NASA <br/>\nStudent Involvement Program (NSIP). This year&#39;s expanded national <br/>\nstudent competition was announced today with the release of materials <br/>\ndescribing six competitions for students from kindergarten through <br/>\ngrade twelve.<br/>\n<br/>\n&quot;This year, we really are trying to engage students of all ages, <br/>\nbackgrounds, and interests,&quot; says Lynn Marra, the NSIP Program <br/>\nManager. &quot;NSIP offers a variety of ways that students--entire <br/>\nclassrooms, teams or individuals--can be part of the NASA team and <br/>\nconduct hands-on research using some of today&#39;s most exciting <br/>\ntechnology.&quot;<br/>\n<br/>\nCompetitions include:<br/>\n<br/>\nMy Planet, Earth (Grades K-4)--Like NASA scientists, students explore <br/>\ntheir ever-changing neighborhoods.<br/>\n<br/>\nWatching Earth Change (Grades 5-8)--Students play the role of <br/>\nscientist and apply space technology to better understand the dynamic <br/>\nplanet Earth.<br/>\n<br/>\nScience and Technology Journalism (Grades K-12)--Students apply their <br/>\ncommunication skills to deliver NASA news and information.<br/>\n<br/>\nDesign a Mission to Mars (Grades 5-12)--Students consider how they <br/>\nmight explore the red planet.<br/>\n<br/>\nAerospace Technology Engineering Challenge (Grades 5-8)--Students are <br/>\nintroduced to challenges of aerospace technology by building an <br/>\naerospace structure.<br/>\n<br/>\nSpace Flight Opportunities (Grades 9-12)--High School students are <br/>\nprovided with the unique opportunity to design and fly space <br/>\nexperiments.<br/>\n<br/>\nMarra stresses that NSIP is more than a competition, providing an <br/>\ninquiry-based approach to science, mathematics, technology, and <br/>\ngeography education. &quot;We recognize that teachers are a critical link <br/>\nin this program...We have worked closely with them to make sure that <br/>\nNSIP enriches existing curriculum.&quot;<br/>\n<br/>\nResource guides are available for educators at no cost. All NSIP <br/>\nparticipants receive NASA certificates. Exceptional awards include <br/>\nSpace Camp scholarships, the opportunity to fly experiments on the <br/>\nSpace Shuttle or NASA sounding rockets, school presentations, <br/>\nparticipation at the national student symposium or student flight <br/>\nweeks, and an independently funded scholarship.<br/>\n<br/>\nFor more information on NISP, visit http://education.nasa.gov or call <br/>\n1-800-848-8429.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nAHA Quarterly Journal<br/>\nhttp://www.americanhomeschoolassociation.org<br/>\n<br/>\nThe American Homeschool Association&#39;s quarterly online journal is <br/>\nproduced the first of January, April, July, and October. For the <br/>\nfirst issue of 2002 send a blank emailing to <br/>\nAHA-Newsletter-subscribe@yahoogroups.com or visit the AHA website: <br/>\nhttp://www.americanhomeschoolassociation.org<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nCALL FOR SUCCESS STORIES<br/>\nhttp://www.deebest.com/getpublished.html<br/>\n<br/>\nAuthor Dee Best writes: &quot;Have you accomplished something you dreamed <br/>\nabout, overcome adversity, put a great idea into action, or <br/>\nexperienced personal growth and happiness as a result of hard work? <br/>\nWould you like to share your experience and insight to inspire <br/>\nthousands of preteen and teen girls?<br/>\n<br/>\nDue out in fall 2003 from Little, Brown and Company, &quot;The Girls&#39; Book <br/>\nof Success&quot; will be part of the award-winning series that includes <br/>\n&quot;The Girls&#39; Book of Wisdom, The Girls&#39; Book of Friendship&quot;, and &quot;The <br/>\nGirls&#39; Book of Love&quot; (coming in 2002).<br/>\n<br/>\nIf you are a girl or woman with a true story of success, please <br/>\ne-mail it to cate@... or send it to Dee Best Communications, <br/>\nP.O. Box 7035, Redwood City, CA 94063 (keep a copy for your records). <br/>\nNeed ideas for what to write about? See the list of questions below. <br/>\nStories should be 200 to 400 words each and written in the first <br/>\nperson (e.g., &quot;I did such and such.&quot;). Poems (10 lines or less are <br/>\nbest) are also welcome. The deadline for submissions is February 1, <br/>\n2002.&quot;<br/>\n<br/>\nDetails for girls or women interested in submitting a story (or poem) <br/>\nare at the website above.<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\nHEM-Newsletter@....<br/>\n<br/>\n________<br/>\n<br/>\nUSBORNE -- Love kids, love books?<br/>\nUsborneAmerica.com<br/>\n<br/>\nWin $50 in books by registering at our online shop -- free monthly <br/>\ndrawing! 50 new titles for spring -- see our gorgeous Encyclopedias <br/>\nof World Geography, Ancient Rome, and Ancient Greece. Art Books, <br/>\nscience, cool new phonics, and website design how-tos. Earn free and <br/>\ndiscounted books with purchases and online eshows. Introduce these <br/>\nbooks to your community and earn books and income. SharonVE@... <br/>\nor call 888-474-8499 toll free. Sharon Vander Ende, Independent <br/>\nExecutive Supervisor.<br/>\n<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\nGnarlymath.com<br/>\n<br/>\nCROSS-EYED, BROCCOLI-EATING ELEPHANTS are featured in our free <br/>\nhilarious math newsletter, the Gnarly Gnews. The new issue also tells <br/>\nhow 10-year-old Karl Gauss immediately computed the sum of the <br/>\nnumbers from 1 to 100. Subscribe at http://www.gnarlymath.com, and <br/>\ndownload free examples of our CD-ROM Solid Gold Gnarly Math. If you&#39;d <br/>\nlike a refresher course in Algebra, Geometry, Trig, or Probability, <br/>\nor if you want to give your kids a fresh and exciting outlook on <br/>\nmath, try our moneyback-guaranteed CD today.<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nAttention unschoolers and eclectic homeschoolers! The Resourceful <br/>\nHomeschooler carries great books, science materials and kits, <br/>\nlearning games, and the most interesting software. Gift certificates; <br/>\nsearch service. AND here is your opportunity to clear some shelf <br/>\nspace! List or consign your surplus or used homeschooling materials. <br/>\nStore credit available for consignments. Visit <br/>\nhttp://www.resourcefulhomeschooler.com or call (877) 523-0494. Great <br/>\nmaterials for independent learners of all ages.<br/>\n<br/>\n_________<br/>\n<br/>\nLEARNING SKILLS FOR LIFE<br/>\niKnowthat.com<br/>\n<br/>\nWhat does your child need to succeed? Lifelong learning skills. <br/>\nExperts say that&#39;s what our children will need to keep up in <br/>\ntomorrow&#39;s rapidly changing world. Now there&#39;s a powerful new <br/>\nweb-based community that can help your child develop such <br/>\nmeta-learning skills. Try it risk-free at: <br/>\nhttp://www.iknowthat.com/com?CO=01HEM01<br/>\n_________<br/>\n<br/>\nGIVE YOUR CHILD THE HEADSPROUT READING ADVANTAGE<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that will give your child a real advantage by systematically <br/>\nteaching essential skills and strategies ensuring reading success and <br/>\nconfidence. Your child will really enjoy our fun, animated, <br/>\ninteractive episodes.  After just five 20-minute episodes, children <br/>\nread their first Headsprout books. Act quickly.  For a limited time, <br/>\nHeadsprout Reading is available free at: http://www.headsprout.com. <br/>\nPlease enter the promotional code: HENA2<br/>\n_________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\nhttp://www.home-ed-magazine.com<br/>\n<br/>\nWith the January/February 2002 issue of Home Education Magazine, we <br/>\nwelcome A to Z Home&#39;s Cool Homeschooling&#39;s Ann Zeise <br/>\n(www.gomilpitas.com/homeschooling) as one of our columnists. Ann has <br/>\ngiven generously of her time and expertise over the years, and I know <br/>\nyou&#39;ll enjoy her column titled &quot;Do You Yahoo?&quot;<br/>\n<br/>\nThe January/February issue also features articles on Grapes in the <br/>\nFreezer, Chocolate chips and Blue M&Ms, Sub-VERSE-ive Poetry, an <br/>\nultimate field trip, an epiphany and more.  From the columnists: the <br/>\nKaseman&#39;s review &quot;Kingdom of Children: Culture and Controversy in the <br/>\nHomeschooling Movement&quot;; Becky Rupp solves mysteries; David Albert <br/>\nspeculates about Standaristas; Sandra Dodd slays the Math Monster; <br/>\nand Carol Narigon (that&#39;s me) gives advice on the learning to read. <br/>\nOther columnists include Barbara Theisen, Peter Kowalke, Linda <br/>\nDobson, and Laura Weldon.<br/>\n<br/>\nSubscriptions to Home Education Magazine are $32.00 for one year/6 <br/>\nissues; single issue $6.50. Home Education Magazine, PO Box 1083, <br/>\nTonasket WA 98855; for orders: toll-free 1-800-236-3278; email <br/>\norders@.... MC/Visa cards accepted. DON&#39;T MISS IT!<br/>\n<br/>\n_________<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nA great homeschool story from your choice of websites!<br/>\n<br/>\nhttp://www.homestead.com/barbooch/MrPointyNose.html<br/>\n<br/>\nhttp://www.homeschoolchristian.com/Position/Drennan.html<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\nhttp://www.home-ed-magazine.com/wlcm_hemnewsltr.html or send an email <br/>\nto majordomo@... with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\nmajordomo@... with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\nHEM-Newsletter@...<br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":30518,"nextTopicId":30531}}