{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...","replyTo":"LIST","senderId":"nVqHlnAncrLaJcKwroNXmCxe9l5th6WSsGxtqLSVVmE89gfcrB60TBJcBNNWqM6oubTJGtMfQACGWbh03chiZm1hcuYDtm1Gof5hqNYQjyEDLNEw5wQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Reading and Writing","postDate":"930859382","msgId":1384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xMDMuMTM4NC45NTkyNjk3NDBAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":1385,"prevInTime":1383,"nextInTime":1385,"topicId":1384,"numMessagesInTopic":0,"msgSnippet":"... Not really. I was pretty much unschooled myself, so I already knew it worked. ... No. The only time we really tried to teach any of the kids anything was ","messageBody":"<div id=\"ygrps-yiv-1957392683\">At 2:08 PM -0400 7/1/99, A.Y. wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;From: &quot;A.Y.&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hooperck@...\">hooperck@...</a>&gt;<br/>\n&gt;<br/>\n&gt;Helen,<br/>\n&gt;I wish you were closer!  I&#39;d love to spend an afternoon listening to how your<br/>\n&gt;days were and are.<br/>\n&gt;How did you combat doubts?  Did you have doubts?<br/>\n<br/>\n </span></blockquote>Not really. I was pretty much unschooled myself, so I already knew it worked.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I have millions of questions.... your the only true unschoolers I&#39;ve ever<br/>\n&gt;heard<br/>\n&gt;of.<br/>\n&gt;I&#39;ll pace some of the questions though.<br/>\n&gt;Did you worry about reading, or try to teach it?  Or writing ect??<br/>\n<br/>\n </span></blockquote>No. The only time we really tried to teach any of the kids anything was<br/>\nwhen our two oldest sons were small. We enrolled our oldest son, John (now<br/>\n25, married, with two little girls), in the Alaska State Correspondence<br/>\nCourse for first grade. The state sent us huge boxes of books, workbooks,<br/>\npencils, crayons, just scads schoolish stuff. We worked with a teacher<br/>\nbased at the local public school who reviewed John&#39;s workbooks once a<br/>\nmonth, suggested art projects and books and tapes we could check out of the<br/>\nschool library, and otherwise left us alone. It didn&#39;t take us long to<br/>\nfigure out that the workbooks didn&#39;t need to be all finished, the teacher<br/>\njust skimmed them and relied more on talking to John about what he&#39;d<br/>\nlearned about letters, numbers, etc. He was (still is) a very bright kid,<br/>\nand she was always quite pleased with his progress. The last two months we<br/>\ndidn&#39;t even bother with the workbooks, but just kinda winged it on our own.<br/>\nOf course John passed with flying colors. &lt;s&gt;<br/>\n<br/>\nThe next year we moved to Washington state, and when we didn&#39;t find<br/>\nanything like the Alaska Correspondence Program we enrolled John in second<br/>\ngrade and his brother, Jim, in kindergarten at the local public school.<br/>\nAfter about three weeks it was clear that the boys weren&#39;t happy being in<br/>\nschool (mostly older kids being mean) and we took them both out of school.<br/>\nMy mother had introduced us to John Holt&#39;s Growing Without Schooling about<br/>\nthat time (I think his Plowboy Interview had just come out in The Mother<br/>\nEarth News) and we decided homeschooling was the route for us.<br/>\n<br/>\nAs far as teaching them, we played around with correspondence-school type<br/>\nstuff for that first winter, making up notebooks with alphabet letters to<br/>\ncolor or copy, some very simple number games (if Jim has six cookies and<br/>\nwants to give you half, how many would you receive?&quot; &quot;WHAT? Jim share his<br/>\ncookies evenly? Are you kidding?&quot;) After a while we found more interesting<br/>\nthings to do than play with schoolish stuff, and abandoned the notebooks<br/>\naltogether. I still have them though. They&#39;re pretty cute. Lots of pictures<br/>\nof cars and horses and knights in shining armor battling dragons in the<br/>\nmargins... One of these days I&#39;ll give the books to them for Christmas or<br/>\nsomething. &lt;g&gt;<br/>\n<br/>\nBut that was it as far as trying to teach any of our kids anything. We<br/>\ndidn&#39;t just totally leave them to their own devices, of course. We wrote<br/>\nquite a bit in Home Education Magazine over the years about how we<br/>\napproached learning as just part of everyday life (some of those writings<br/>\ncan be found at our website). If the kids had questions, we answered them.<br/>\nIf the kids got interested in something, we bought books and movies and<br/>\nother stuff on the subject. We learned right along with them, and are still<br/>\nlearning, every day. In the last month I&#39;ve learned about rock climbing and<br/>\nrock climbing gear and although I&#39;m still much happier with my own feet<br/>\nplanted on terra firma, it&#39;s a thrill to watch these kids of mine scramble<br/>\nup a cliff and to see the sheer joy on their faces as they rappel back down<br/>\nagain. We&#39;re learning together, as usual.<br/>\n<br/>\nAs far as how successful we&#39;ve been - well, we&#39;re fine on the reading, but<br/>\nthe jury&#39;s still out as far as writing goes. Every one of our kids reads as<br/>\nwell as I do - it&#39;s just something they do all the time because we run a<br/>\npublishing company and we&#39;re a very book and magazine oriented family. Our<br/>\nhouse has more bookshelves than cupboards or closets in it, and magazines<br/>\nof all kinds are always all over the place. We read more than we watch TV<br/>\n(though we all loved watching an old John Wayne/Dean Martin western last<br/>\nnight). I guess I&#39;d have to say overall, books are our first love, with<br/>\nmovies a very close second. We very often buy the book version of a movie -<br/>\nright now I think we&#39;ve got a dozen or more books on the latest Star Wars<br/>\nrelease (my favorite is Dorling-Kindersley&#39;s Star Wars Episode I Visual<br/>\nDictionary). &lt;s&gt;<br/>\n<br/>\nBut writing has been more touch and go. Our daughter, Jody (19) is an<br/>\naccomplished writer. She&#39;s always loved it, writes constantly, and her<br/>\nhandwriting is much more legible than either mine or her dad&#39;s (especially<br/>\nher dad&#39;s - Mark has a doctorish scribble that often isn&#39;t even<br/>\ndecipherable). But the boys have avoided writing for the most part. Their<br/>\nwriting is obviously a struggle, but they all know that it&#39;s only because<br/>\nthey&#39;re just not interested in pursuing it as seriously as Jody has. The<br/>\ntwo older boys write pretty well now because they need to for their<br/>\nrespective jobs, but they&#39;ve both said it was a damned nuisance to learn to<br/>\nspell and to write legibly. But it didn&#39;t take either of them long to get<br/>\nup to speed, and they&#39;ve both said it wasn&#39;t really all that hard to pick<br/>\nup. The two younger boys are still avoiding writing whenever possible, but<br/>\nI know they&#39;ll pick up on it when  they need to, when they find a use for<br/>\nwriting skills.<br/>\n<br/>\nI need to get back to work, but I&#39;m enjoying the breaks to answer your<br/>\nquestions, Ann.<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":0,"authorName":"A.Y.","from":"&quot;A.Y.&quot; &lt;hooperck@...","replyTo":"LIST","senderId":"mXQ30lSXyvvHhN_MNr_SYvBlTxj7L1Sau7C3er5YKxJPlthSFze8zp3K815_q9FxEvVc0q0HuBgX92Nf6g1YermnBmXk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Reading and Writing","postDate":"930857099","msgId":1385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xMDMuMTM4NS45NTkyNjk3NDBAZUdyb3Vwcy5jb20+"},"prevInTopic":1384,"nextInTopic":0,"prevInTime":1384,"nextInTime":1386,"topicId":1384,"numMessagesInTopic":0,"msgSnippet":"I m sending you a huge hug of thanks..... I needed that!  :) Our three kids (6, 4 and 3) are always busy, busy busy, but never want to do anything like","messageBody":"<div id=\"ygrps-yiv-888022677\">I&#39;m sending you a huge hug of thanks.....<br/>\nI needed that!  :)<br/>\n<br/>\nOur three kids (6, 4 and 3) are always busy, busy busy, but never want to do<br/>\nanything like learning to write or read ect...  They don&#39;t even care much about<br/>\ndrawing or coloring.  we live on a farm, and are very busy outside doing &quot;stuff&quot;.<br/>\nToday we have hatched two peacocks, what a thrill.  We are waiting for the third<br/>\negg to start.<br/>\nThey know lots about chickens, chicks, ducks, horses, ponies, dogs, cats, and now<br/>\npeacocks, but aren&#39;t&#39; very bookish.  Though they&#39;d let me read to them all day.<br/>\nI guess its mostly my battle with comparisons and doubts.<br/>\nThanks for all your sharing.  I know unschooling is the way to go for us.  The<br/>\nfreedom and fun.  It really helps me though to hear about families like yours.<br/>\nBig hugs to all your family for sharing life with us all!<br/>\nAnn</div>","specialLinks":[]}],"prevTopicId":1294,"nextTopicId":1387}}