{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 7 year old unschooler going to school","postDate":"1348924902","msgId":69174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEREREU5NzUyLUQ2RkEtNEIyNi04NTEzLTRCQjAyNDVEQ0FBM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGs0Nm9wYStyZnRjQGVHcm91cHMuY29tPg==","referencesHeader":"PGs0Nm9wYStyZnRjQGVHcm91cHMuY29tPg=="},"prevInTopic":69173,"nextInTopic":0,"prevInTime":69173,"nextInTime":69175,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"... Everyone except your son, though. He s seeing the hypocrisy and is upset that he doesn t count as an everyone . The goal would be to meet her needs AND","messageBody":"<div id=\"ygrps-yiv-607932731\">On Sep 29, 2012, at 8:15 AM, erikaehrenkaufer wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have discussed how as a family we need to support the needs of everyone<br/>\n<br/>\n </span></blockquote>Everyone except your son, though. He&#39;s seeing the hypocrisy and is upset that he doesn&#39;t count as an &quot;everyone&quot;.<br/>\n<br/>\nThe goal would be to meet her needs AND his.<br/>\n<br/>\nCan the computer be moved to another room?<br/>\n<br/>\nCan you create an enclosure of bookshelves around it?<br/>\n<br/>\nCan he use headphones?<br/>\n<br/>\nCan your daughter sleep in a different room. Yours? Another room that isn&#39;t a bedroom? People don&#39;t need to sleep in &quot;their&quot; space. They can bed down wherever it&#39;s convenient.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 7 year old unschooler going to school","postDate":"1348923163","msgId":69173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4RjEzOUZCLTYzOTQtNDRCNy1BMDUxLUE5MTk4N0UxMTg2M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs0Nm9wYStyZnRjQGVHcm91cHMuY29tPg==","referencesHeader":"PGs0Nm9wYStyZnRjQGVHcm91cHMuY29tPg=="},"prevInTopic":69172,"nextInTopic":69174,"prevInTime":69172,"nextInTime":69174,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"-=-We have been working on helping her get to bed earlier. But this is still a challenge. Mostly because my 11 year old does not want to get off the computer","messageBody":"<div id=\"ygrps-yiv-744765375\">-=-We have been working on helping her get to bed earlier. But this is still a challenge. Mostly because my 11 year old does not want to get off the computer and go to bed early. His sleep schedule has really been shifting lately to staying up really late and sleeping late. I would like some insight on how to get people settled down so she can go to bed. We have discussed how as a family we need to support the needs of everyone and that my daughter needs a quiet environment so that she can get to sleep by a reasonable time to get up in the morning. My son realy feels like he is being forced to get off the computer and get ready for bed before he is ready. I should point out that we have a small house and the kids share a room and actually choose to sleep on couches in the living room instead of in the beds in their room. Any thoughts?-=-<br/>\n<br/>\nIf he has no choice, then he is being forced.  If he&#39;s not ready to get off the computer, put the computer in the bedroom where nobody is sleeping.  Or tell your daughter that she needs to go to sleep in the bedroom so her brother can stay on the computer.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":412826878,"authorName":"erikaehrenkaufer","from":"&quot;erikaehrenkaufer&quot; &lt;angelfish7798@...&gt;","profile":"erikaehrenkaufer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: 7 year old unschooler going to school","postDate":"1348920938","msgId":69172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs0Nm9wYStyZnRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPg=="},"prevInTopic":69112,"nextInTopic":69173,"prevInTime":69171,"nextInTime":69173,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"... An update... Thank you so much for all the thoughts.  I have been reading and re-reading them all week.  Some things I realized...In trying to be unpushy","messageBody":"<div id=\"ygrps-yiv-874258168\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;erikaehrenkaufer&quot; &lt;angelfish7798@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Our family has been homeschooling  for 3 years and on the unschooling path for about 2 years now.  In the last few months we have been really letting go and applying the principles to all areas of our life (i.e. letting go of bedtimes, food control, media, etc.)<br/>\n&gt; <br/>\n&gt; My daughter is 7 and decided that she wanted to go to school this year. She has been almost completely unschooled and learned on her own to write at 4 and to read this past summer. She has been attending public  school for 3 weeks.  My 11 year old and 4 year old are still home and unschooling. My daughter knows that she can come home at anytime.  I want to make sure that in all aspects of this experience she feels she has a choice.<br/>\n&gt; <br/>\n&gt; So I need some help with how to deal with a few issues that have come up or that might come up in the future...<br/>\n&gt; <br/>\n&gt; 1) Homework- She is assigned reading nightly and worksheets several nights a week.  I ask her if she wants to do them and she will say yes that she wants to do them later. I don&#39;t care if she does them and have told her that whether or not she does them is totally up to her.  But here is my dilemma.  She says she wants to do them but then gets busy doing other things and forgets.  I really feel like maybe it is important to her but she hasn&#39;t really had to manage her time before now since her days were free flowing and she went to bed and got up whenever she chose. Do I remind her or do I just tell her that I&#39;m not going to remind her and that its up to her if she wants to do it?  And what if she decides she wants to do it at 10:30 at night when we are both too tired?<br/>\n&gt; <br/>\n&gt; 2)  Bedtime-  We have no bedtimes so she is staying up until 10:30- 11:00 and having a hard time getting up at 7:15 the next morning.  We discussed how along with the choice of going to school she does have a schedule now and if she stays up late it might be hard to get up in the morning.   Again I don&#39;t want to keep reminding her, but but I feel like it&#39;s setting her up to have a rough day if she doesn&#39;t get enough sleep.  So do i just let her figure it out on her own?<br/>\n&gt; <br/>\n&gt; 3) Communication with school- With everything being her choice to do homework, go or don&#39;t go, being on time, etc.  How do i present this to the school/teacher when it comes up and I&#39;m sure it will..  And how do I explain the boundaries to her like if grades are important to you you will have to do homework.  If you stay home too many days we can get in trouble.  I am afraid that if she chooses not to do homework  and gets a &quot;bad&quot; grade she will feel bad. Or if she has excessive absences/tardies that there will be negative interactions with the school.  <br/>\n&gt; <br/>\n&gt; I am just really trying to make sure that this experience can mesh with the unschooling principles that we are trying follow. And that Kylie still feels in control of her own learning and feels respected.  Thanks so much for any input you have.<br/>\n<br/>\n<br/>\n </span></blockquote>An update...<br/>\n<br/>\nThank you so much for all the thoughts.  I have been reading and re-reading them all week.  Some things I realized...In trying to be &quot;unpushy&quot; in regards to school, I have been being too hands off. Also I think I have had a bit of a negative attitude because I don&#39;t want her to go to school. But it is important to her and it is her choice so I need to support it fully. So this week I have been being more involved.  With homework I have been saying &quot;Let&#39;s do this&quot; instead of &quot;do you want to?&quot;.  This is working well.  She is happy to do it and it is getting done on time. In regards to attendance we have talked about how many days we can miss and how tardies add up to absences. Most of my earlier concerns are evening themselves out as I relax and don&#39;t worry so much about doing things &quot;right&quot;. <br/>\n<br/>\nWe have been working on helping her get to bed earlier. But this is still a challenge.  Mostly because my 11 year old does not want to get off the computer and go to bed early.  His sleep schedule has really been shifting lately to staying up really late and sleeping late.  I would like some insight on how to get people settled down so she can go to bed.  We have discussed how as a family we need to support the needs of everyone and that my daughter needs a quiet environment so that she can get to sleep by a reasonable time to get up in the morning.  My son realy feels like he is being forced to get off the computer and get ready for bed before he is ready. I should point out that we have a small house and the kids share a room and actually choose to sleep on couches in the living room instead of in the beds in their room. Any thoughts?</div>","specialLinks":[]},{"userId":187853867,"authorName":"Andrea Q","from":"&quot;Andrea Q&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: 7 year old unschooler going to school","postDate":"1348241039","msgId":69112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGszaTBxZis3dTFzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPg=="},"prevInTopic":69107,"nextInTopic":69172,"prevInTime":69111,"nextInTime":69113,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"Another way to think about it: If my child chose to play a sport with intense time requirements, I d support them however necessary--driving them to practice,","messageBody":"<div id=\"ygrps-yiv-2021888497\">Another way to think about it:<br/>\n<br/>\nIf my child chose to play a sport with intense time requirements, I&#39;d support them however necessary--driving them to practice, making sure they had the equipment they needed, helping them get enough sleep, providing high-energy foods, watching their games, talking to their coaches, signing paperwork, dealing with injuries or illness, etc. <br/>\n<br/>\nIf my child chose to go to school, I would support them in the same way.<br/>\n<br/>\n<br/>\nAndrea Q</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 7 year old unschooler going to school","postDate":"1348163231","msgId":69107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGszZmtxdis3MDRoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPg=="},"prevInTopic":69104,"nextInTopic":69112,"prevInTime":69106,"nextInTime":69108,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"... ************* In addition to what Sandra said on the subject, know that failure to do homework is one of the signs teachers look for to indicate neglect at","messageBody":"<div id=\"ygrps-yiv-672130964\">&quot;erikaehrenkaufer&quot; &lt;angelfish7798@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t care if she does them and have told her that whether or not she does them is totally up to her. <br/>\n </span></blockquote>*************<br/>\n<br/>\nIn addition to what Sandra said on the subject, know that failure to do homework is one of the signs teachers look for to indicate neglect at home. In some places, they&#39;re even required to report kids who regularly fail to complete homework to child services. Not doing homework plus frequent absences combine to look very, very bad to people concerned about the wellbeing of children. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; how do I explain the boundaries to her like if grades are important to you you will have to do homework.<br/>\n </span></blockquote>************<br/>\n<br/>\nIs she interested in grades? If so, help her keep track. Break it down into small enough chunks that she can see how homework and absences contribute to her grades. How much homework can she miss and still get a D? an A? Depending on why she&#39;s in school, she might be fine just squeaking by - but it&#39;s still important to know what that line is, and what the consequences are if she fails (summer school? repeat the grade? a visit from child services?).<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 7 year old unschooler going to school","postDate":"1348149419","msgId":69104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDgxNDk0MTkuNjUyOTIuWWFob29NYWlsTmVvQHdlYjgxNTA2Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDdGQjkxQkM1LUQyNDMtNDc2Mi1BNzBDLTYxM0IyNkUyMEMwMEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPiA8N0ZCOTFCQzUtRDI0My00NzYyLUE3MEMtNjEzQjI2RTIwQzAwQHZlcml6b24ubmV0Pg=="},"prevInTopic":69103,"nextInTopic":69107,"prevInTime":69103,"nextInTime":69105,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"I know the reason your daughter decided to go to school have not been presented but I have been talking to several homschoolers and I find that some little","messageBody":"<div id=\"ygrps-yiv-2111927818\">I know the reason your daughter decided to go to school have not been presented<br/>\nbut I have been talking to several homschoolers and I find that some little girls<br/>\nhave a big need to have friends and friends almost everyday.<br/>\n<br/>\nWas that the reason you daughter decided to go to school? to be surrounded by friends?<br/>\n<br/>\nIf she ever decides to come home make sure you are finding her friends and she is getting together<br/>\nwith them several times a week! For many girls that  have this big need to be with friends.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 7 year old unschooler going to school","postDate":"1348137265","msgId":69103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJEMTYzNTZCLTgyNjctNEQwQS1BNkRFLTgxRDQ4QUZEQzQ2MkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEY4ODQ4OThBLTAwNEMtNDI5My1BNkMxLTVFOEUyOTZDNDNDQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPiA8Rjg4NDg5OEEtMDA0Qy00MjkzLUE2QzEtNUU4RTI5NkM0M0NBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":69102,"nextInTopic":69104,"prevInTime":69102,"nextInTime":69104,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"... All that Sandra said, much better than mine. Do hers instead :-) Joyce [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1979624456\">On Sep 20, 2012, at 6:25 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Have you tried doing them with her, talking through them, making it fun?<br/>\n&gt; Don&#39;t ask &quot;Do you want to do this?&quot; Say &quot;Let&#39;s do this, so we can make dinner,&quot;<br/>\n&gt; and if she says she doesn&#39;t want to, don&#39;t press her, maybe.<br/>\n<br/>\n </span></blockquote>All that Sandra said, much better than mine. Do hers instead :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 7 year old unschooler going to school","postDate":"1348136920","msgId":69102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGQjkxQkM1LUQyNDMtNDc2Mi1BNzBDLTYxM0IyNkUyMEMwMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPg==","referencesHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPg=="},"prevInTopic":69101,"nextInTopic":69103,"prevInTime":69101,"nextInTime":69103,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"... If it s something she *really* wants to do, like watch TV or draw, does she need to manage her time to get it done? If she wants her homework done, it s","messageBody":"<div id=\"ygrps-yiv-1970757739\">On Sep 20, 2012, at 12:13 AM, erikaehrenkaufer wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She says she wants to do them but then gets busy doing other things and forgets. <br/>\n&gt; I really feel like maybe it is important to her but she hasn&#39;t really had to manage <br/>\n&gt; her time before now since her days were free flowing<br/>\n<br/>\n </span></blockquote>If it&#39;s something she *really* wants to do, like watch TV or draw, does she need to manage her time to get it done?<br/>\n<br/>\nIf she wants her homework done, it&#39;s because she wants to jump to the end point, not because she wants the journey between. ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am just really trying to make sure that this experience<br/>\n&gt; can mesh with the unschooling principles that we are trying follow<br/>\n<br/>\n </span></blockquote>I think you&#39;re overly focused on getting her to do what you think is the right approach rather than swirling some skills and information around her.<br/>\n<br/>\nI suspect when you see her not doing her homework, not planning, it fills you with the desire to pour in the right way to do it. Maybe take her out this weekend to lunch. Say you&#39;ve noticed she&#39;s having problems getting things done she says she wants to do. Draw out her feelings and thoughts. Really listen without the desire to fix her. Give her some tips on things that have helped you. Let her know if she wants any other help, you&#39;re there for her. Then let it go.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We discussed how along with the choice of going to school she <br/>\n&gt; does have a schedule now and if she stays up late it might be hard to get up in the morning.<br/>\n<br/>\n </span></blockquote>Just because she&#39;s not doing it, doesn&#39;t mean she doesn&#39;t understand. It&#39;s not that hard of a concept to grasp!<br/>\n<br/>\nStopping something she&#39;s interested in to do something boring like sleep is what&#39;s in her way. Right now she&#39;s weighing the pluses and minuses of school. Right now the minus of tiredness is worth the plus of staying up. At some point maybe the tiredness won&#39;t be worth it and she&#39;ll go to bed. Or she&#39;ll decide school is interfering with her life. It&#39;s how we make decisions by putting up with the bad for the good, then when the good is no longer outweighing the bad, it&#39;s time for something else.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; With everything being her choice to do homework, go or don&#39;t go, being on time, etc<br/>\n&gt; ... If you stay home too many days we can get in trouble<br/>\n<br/>\n </span></blockquote>Those are real life limitations. Perhaps you&#39;ve been filling her head full of things she &quot;has to&quot; do without regard to the seriousness of the consequences. Find out how many absences she&#39;s allowed and what happens. Find out what happens if she&#39;s late too often and what the consequences are. <br/>\n<br/>\nBut also tell her it&#39;s not polite for her to show up whenever she wants. It makes the teachers job more difficult if she&#39;s frequently wandering in late. It makes life more difficult for the other kids to see her coming in late when they aren&#39;t allowed to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do i present this to the school/teacher when it comes up and I&#39;m sure it will..<br/>\n<br/>\n<br/>\n </span></blockquote>You say it&#39;s her choice to be there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And how do I explain the boundaries to her like if grades are important to you <br/>\n<br/>\n<br/>\n </span></blockquote>Why would grades be important to her? You have 20+ years of positive and negative baggage -- shame and praise -- about grades. She doesn&#39;t.<br/>\n<br/>\nIf she&#39;s a people pleaser, it&#39;s possible she&#39;ll buy into the grades because As will make her teacher happy.<br/>\n<br/>\nYou may forearm her with the information that in school kids get sorted by grades as if they were eggs. The A students are treated better, are seen as better people. The C and D and F students are seen as not worth as much. That it isn&#39;t something you agree with at all and is one of the reasons you like homeschooling better. But it is something she&#39;ll find people believe in school and it&#39;s how they&#39;ll treat kids.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 7 year old unschooler going to school","postDate":"1348136714","msgId":69101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4ODQ4OThBLTAwNEMtNDI5My1BNkMxLTVFOEUyOTZDNDNDQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPg==","referencesHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPg=="},"prevInTopic":69100,"nextInTopic":69102,"prevInTime":69100,"nextInTime":69102,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"-=- In the last few months we have been really letting go and applying the principles to all areas of our life (i.e. letting go of bedtimes, food control,","messageBody":"<div id=\"ygrps-yiv-1239231974\">-=- In the last few months we have been really letting go and applying the principles to all areas of our life (i.e. letting go of bedtimes, food control, media, etc.)-=-<br/>\n<br/>\nLetting go of arbitrary rules makes sense.<br/>\nNot having a bedtime when a child is in school doesn&#39;t make sense.<br/>\n<br/>\nOnly do things that make sense.<br/>\n<br/>\n-=-Do I remind her or do I just tell her that I&#39;m not going to remind her and that its up to her if she wants to do it? And what if she decides she wants to do it at 10:30 at night when we are both too tired?-=-<br/>\n<br/>\nHave you tried doing them with her, talking through them, making it fun?   Don&#39;t ask &quot;Do you want to do this?&quot;  Say &quot;Let&#39;s do this, so we can make dinner,&quot; and if she says she doesn&#39;t want to, don&#39;t press her, maybe.<br/>\n<br/>\nIt doesn&#39;t sound like you&#39;re helping her out.<br/>\n<br/>\n-=-2) Bedtime- We have no bedtimes so she is staying up until 10:30- 11:00 and having a hard time getting up at 7:15 the next morning. We discussed how along with the choice of going to school she does have a schedule now and if she stays up late it might be hard to get up in the morning. Again I don&#39;t want to keep reminding her, but but I feel like it&#39;s setting her up to have a rough day if she doesn&#39;t get enough sleep. So do i just let her figure it out on her own?-=-<br/>\n<br/>\nShe shouldn&#39;t need to figure it out on her own.  You&#39;re her more experienced partner.  She wants to go to school.  Help her out.    Plan back and have a bedtime that is NOT arbitrary, that is based on what&#39;s happening the next day.  Do that whether it&#39;s about school or not.  Only days when nothing&#39;s happening should be preceded by nights where people stay up indefinitely.<br/>\n<br/>\n-=-With everything being her choice to do homework, go or don&#39;t go, being on time, etc. How do i present this to the school/teacher when it comes up and I&#39;m sure it will.. And how do I explain the boundaries to her like if grades are important to you you will have to do homework. If you stay home too many days we can get in trouble. I am afraid that if she chooses not to do homework and gets a &quot;bad&quot; grade she will feel bad. Or if she has excessive absences/tardies that there will be negative interactions with the school. -=-<br/>\n<br/>\nSchool isn&#39;t unschooling.  You can give her the option to leave school and be unschooled, but she can&#39;t have the option to go or not go every single day, because you&#39;ve enrolled her in a situation with requirements.<br/>\n<br/>\n-=-I am afraid that if she chooses not to do homework and gets a &quot;bad&quot; grade she will feel bad-=-<br/>\n<br/>\nThen what?<br/>\nWould she choose to do more homework?<br/>\nOr not to go to school?<br/>\n<br/>\n-=-I am just really trying to make sure that this experience can mesh with the unschooling principles that we are trying follow. And that Kylie still feels in control of her own learning and feels respected. -=-<br/>\n<br/>\nYou can&#39;t demand that the school treat her as an unschooler.  It will be different for her there, and probably much better, because she&#39;s there by choice and you&#39;re not pressing to control and shame her.  You&#39;re not aiding and abetting the school&#39;s worst potential.   But on the other hand, she&#39;s said she&#39;d like to go to school, and so she&#39;s NOT unschooling, and you should support what will help her feel that she really is in school, and not just visiting.<br/>\n<br/>\nDon&#39;t sabotage her. Partners shouldn&#39;t do that.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":412826878,"authorName":"erikaehrenkaufer","from":"&quot;erikaehrenkaufer&quot; &lt;angelfish7798@...&gt;","profile":"erikaehrenkaufer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"7 year old unschooler going to school","postDate":"1348114409","msgId":69100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGszZTU1OStjamx1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":69101,"prevInTime":69099,"nextInTime":69101,"topicId":69100,"numMessagesInTopic":0,"msgSnippet":"Our family has been homeschooling  for 3 years and on the unschooling path for about 2 years now.  In the last few months we have been really letting go and","messageBody":"<div id=\"ygrps-yiv-1408496993\">Our family has been homeschooling  for 3 years and on the unschooling path for about 2 years now.  In the last few months we have been really letting go and applying the principles to all areas of our life (i.e. letting go of bedtimes, food control, media, etc.)<br/>\n<br/>\nMy daughter is 7 and decided that she wanted to go to school this year. She has been almost completely unschooled and learned on her own to write at 4 and to read this past summer. She has been attending public  school for 3 weeks.  My 11 year old and 4 year old are still home and unschooling. My daughter knows that she can come home at anytime.  I want to make sure that in all aspects of this experience she feels she has a choice.<br/>\n<br/>\nSo I need some help with how to deal with a few issues that have come up or that might come up in the future...<br/>\n<br/>\n1) Homework- She is assigned reading nightly and worksheets several nights a week.  I ask her if she wants to do them and she will say yes that she wants to do them later. I don&#39;t care if she does them and have told her that whether or not she does them is totally up to her.  But here is my dilemma.  She says she wants to do them but then gets busy doing other things and forgets.  I really feel like maybe it is important to her but she hasn&#39;t really had to manage her time before now since her days were free flowing and she went to bed and got up whenever she chose. Do I remind her or do I just tell her that I&#39;m not going to remind her and that its up to her if she wants to do it?  And what if she decides she wants to do it at 10:30 at night when we are both too tired?<br/>\n<br/>\n2)  Bedtime-  We have no bedtimes so she is staying up until 10:30- 11:00 and having a hard time getting up at 7:15 the next morning.  We discussed how along with the choice of going to school she does have a schedule now and if she stays up late it might be hard to get up in the morning.   Again I don&#39;t want to keep reminding her, but but I feel like it&#39;s setting her up to have a rough day if she doesn&#39;t get enough sleep.  So do i just let her figure it out on her own?<br/>\n<br/>\n3) Communication with school- With everything being her choice to do homework, go or don&#39;t go, being on time, etc.  How do i present this to the school/teacher when it comes up and I&#39;m sure it will..  And how do I explain the boundaries to her like if grades are important to you you will have to do homework.  If you stay home too many days we can get in trouble.  I am afraid that if she chooses not to do homework  and gets a &quot;bad&quot; grade she will feel bad. Or if she has excessive absences/tardies that there will be negative interactions with the school.  <br/>\n<br/>\nI am just really trying to make sure that this experience can mesh with the unschooling principles that we are trying follow. And that Kylie still feels in control of her own learning and feels respected.  Thanks so much for any input you have.</div>","specialLinks":[]}],"prevTopicId":43034,"nextTopicId":69181}}