{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: meeting everyones needs","postDate":"1280246900","msgId":56396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2NkJCMjc3LTg1QTItNERGQy1BNkIwLTYxREVEQTkwNjE3REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkyaTFhYittYWFkQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyaTFhYittYWFkQGVHcm91cHMuY29tPg=="},"prevInTopic":56392,"nextInTopic":0,"prevInTime":56395,"nextInTime":56397,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"-=- is this something they (government, media...etc.) have come up with to ease the guilt of working mums and dads?... **************** -=-The idea that","messageBody":"<div id=\"ygrps-yiv-764143063\">-=-&gt;is this something &quot;they&quot; (government, media...etc.) have come up  <br/>\nwith to ease the guilt of working mums and dads?...<br/>\n****************<br/>\n-=-The idea that &quot;Family&quot; is important is quite a bit older than that,  <br/>\n-=-<br/>\n<br/>\nSure, but the standing advice that sit-down-together dinner and  <br/>\n&quot;family time&quot; are crucial are recent repairs made to cultures taken  <br/>\napart by factory work and school, I think.<br/>\n<br/>\nIf the only time families CAN be in the same place at the same time  <br/>\nall of them awake at the same time is dinner, then that becomes  <br/>\n&quot;crucial.&quot;  If the only time a parent can be with children is on the  <br/>\none day off from work, and if there&#39;s only rarely a time when both  <br/>\nparents and all the kids are home and awake at the same time, then  <br/>\nthat becomes paramount.<br/>\n<br/>\nBut in an unschooling situation with flexible schedules and relaxed  <br/>\nrelationships, all the time is about the family, and eating together  <br/>\nis about   sustenance, comfort, learning, and sharing, not about the  <br/>\nformality of eating by the clock and by the rules.<br/>\n<br/>\nI was just reading this morning about the different view of &quot;family&quot;  <br/>\nin India than &quot;western&quot; countries they deal with, and especially now  <br/>\nthat more Indians are living and working abroad, their families might  <br/>\nbe in four or five different countries, but they still have social and  <br/>\nmaybe financial obligations to that large, extended family.   The term  <br/>\n&quot;the nuclear family&quot; isn&#39;t so old (20th century, which it would kind  <br/>\nof need to be...)<br/>\n<br/>\nFound this.  It&#39;s interesting:<br/>\n<br/>\nMerriam-Webster dates the term back to 1947, whilst theOxford English  <br/>\nDictionary has a reference to the term from1924; thus it is relatively  <br/>\nnew, although nuclear family structures themselves date back thousands  <br/>\nof years.[5][6]The term &quot;nuclear&quot; is used in its general meaning  <br/>\nreferring to a central entity or &quot;nucleus&quot; around which others collect.<br/>\nIn its most common usage, the term &quot;nuclear family&quot; refers to a  <br/>\nhousehold consisting of a father, a mother and theirchildren all in  <br/>\none household dwelling (siblings).[7] George Murdock also describes  <br/>\nthe term in this way:<br/>\nThe family is a social group characterized by common residence,  <br/>\neconomic cooperation and reproduction. It contains adults of both  <br/>\nsexes, at least two of whom maintain a socially approved sexual  <br/>\nrelationship, and one or more children, own or adopted, of the  <br/>\nsexually cohabiting adults.<br/>\nSome commentators also use the term to describe single-parent  <br/>\nhouseholds and families in which the parents are a cohabiting,  <br/>\nunmarried couple, though these individuals are overwhelmingly liberal.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Nuclear_family\">http://en.wikipedia.org/wiki/Nuclear_family</a><br/>\n<br/>\nThat&#39;s not the whole or end of any answer, it&#39;s just some more  <br/>\nmaterial for consideration when people think about &quot;family time&quot; and  <br/>\nwhat or whether and when and why.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: meeting everyones needs","postDate":"1280087650","msgId":56370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0QkIzQzkzNTVGOTQwRDU5RDM0RUIzOENEM0EzMkQyQENvbm5pZVBDPg==","inReplyToHeader":"PGkyaHZyYit0NjlnQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyaHZyYit0NjlnQGVHcm91cHMuY29tPg=="},"prevInTopic":56369,"nextInTopic":56392,"prevInTime":56369,"nextInTime":56371,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"... I have changed my perspective of what it means to do stuff as a family . Sometimes, we stay home as a family but we are each doing our own thing. Changing","messageBody":"<div id=\"ygrps-yiv-1590514250\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Step away from the idea of &quot;as a family&quot;. I have two kids, eight years apart, and its uncommon that we all find things we want to do together. The interests of a teenage male are waaaaay too different from those of a little girl most of the time. When they happen to coincide, its a gift, not something any of us have planned, and those are marvelous gifts! Wonderful moments of connection happen without anyone trying to make a memory - cherish those as they come up, between pairs and trios and don&#39;t fuss about &quot;the whole family&quot;.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I have changed my perspective of what it means to do stuff &quot;as a family&quot;. Sometimes, we stay home as a family but we are each doing our own thing. Changing my idea of what family time means has been a big help in not getting caught up in having to do everything together. I have four kids under the age of ten so I don&#39;t really have the option of letting any of the kids stay home by themselves yet. The kids can stay home if one of my older nieces or nephews are around. Or, they occasionally have the option of going to grandma&#39;s house. My husband and I like to go shopping but that is too much to expect from the younger ones. <br/>\n<br/>\nWhen we go out as a family, I try to build in a lot of flexibility. My 6 year old has a backpack that she takes everywhere with her because it has her Nintendo DS, her snacks and some other stuff that she likes to have around. I always try to make sure that we have extra clothes and toys in the car for my youngest two. We always have a blanket and beach/park toys in the back of our van in case we decide to make an impromptu trip to the beach or the park. I think we even have some kites stashed under the seat. Actually, I am not sure what all we have stashed in our van. We like to be prepared to do whatever our imagination decides on any given day. Our family outings usually consist of us getting in the car in the morning and setting out to have fun. We all have input into what we are going to do for the day. I find that it doesn&#39;t always work to have a plan beforehand because I never know when a place is going to be too packed to take the two little ones or if parking is going to be a problem. We also try to find fun ways to combine activities. If somebody wants to go in a store, then some of us can go in while everyone else sits in the car and listens to the radio, eats, or plays a game. We always stop and get take out on our days out so that everyone has a full tummy. Our girls have gotten to where they will beg for us to go out as a family because it is always fun and we try to find ways to do a little bit of everything.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;A little bit of that isn&#39;t a terrible thing - sometimes there aren&#39;t other good options for just one child who wants to stay behind - but more than a little can build resentment, even if the kids make the best of things and have a good time, they&#39;ll resent being &quot;made to go&quot; and come to resent the idea of family - which is probably the opposite of what you have in mind.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>That is precisely why we have a lot of family days at home. If we can&#39;t find ways to make everyone happy going out, then it is sometimes best to let it go and change gears. Being able to quickly change gears and come up with alternatives has been a great way to make family time possible. With large groups, I think it is almost impossible to find things that everyone likes to do. When you do find something that everyone likes, then go with it. All of my girls have recently discovered Pokemon so we have been making lots of trips to toy stores. That seems to be something that everyone enjoys. My teen niece and her friends are into Pokemon too so it is doubly awesome because they can come with us and help with the younger ones. Something else that we have recently discovered is MadLibs. All of my kids and my nieces and nephews LOVE them. We get them and leave them around the house. Every now and then one of the kids will run across them and suggest that we do them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;It seems like &quot;family time&quot; is important to you. Recognize that it may not be important to all of your kids, and that&#39;s Okay. Not everyone will value &quot;family&quot; or &quot;family time&quot; especially with a large group. Its more in the nature of some people to prefer the specialness of one-on-one connection, with parents or friends or one sibling at a time. That&#39;s not some kind of failure on your part! Its the way some people are, naturally.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Growing up, I had a sister that hated going places. Everybody had a lot more fun when she was allowed to stay home. Our best memories as a whole family are those that were spent at home. Most of my family memories of us going out as a family were negative because it seemed like there was always one person that had a problem with what was going on. Even now, the best memories are those that are created as a result of being home with everybody doing their own thing and just hanging out.<br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: meeting everyones needs","postDate":"1280084107","msgId":56392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyaTFhYittYWFkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyaDI3ZCttb2dqQGVHcm91cHMuY29tPg=="},"prevInTopic":56370,"nextInTopic":56396,"prevInTime":56391,"nextInTime":56393,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"... **************** The idea that Family is important is quite a bit older than that, as is the idea that families should do things all together to build","messageBody":"<div id=\"ygrps-yiv-569120326\">&quot;m_aduhene&quot; &lt;m_aduhene@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;is this something &quot;they&quot; (government, media...etc.) have come up with to ease the guilt of working mums and dads?...<br/>\n </span></blockquote>****************<br/>\n<br/>\nThe idea that &quot;Family&quot; is important is quite a bit older than that, as is the idea that families &quot;should&quot; do things all together to build loyalty to the group. Loyalty to the group is important if you end up at odds with another group, another family. In the part of rural TN where I live, there are still generation-old feuds (not so much the killing kind any more, thank goodness) and folks say &quot;going to visit my people&quot; to mean make a round of local cemetaries where ancestors and other kinfolk are buried. Families get together for occasions and events and you can still hear &quot;he ain&#39;t right... but he&#39;s ours&quot; as a way of accepting/forgiving pretty much anything from a relative. <br/>\n<br/>\nThere&#39;s a lot of... I&#39;m tempted to say &quot;cultural&quot; importance to family, except that it extends beyond any particular culture. Humans have a need to connect and find/build community, and for some that translates into a love of family. The &quot;family&quot; aspect has been apothesized though, has become a kind of rule for how connection and community &quot;should&quot; happen. What&#39;s under the &quot;rule&quot; is the important thing - people need people - but how that happens best is an individual thing. We don&#39;t all need the same things from each other. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: meeting everyones needs","postDate":"1280082603","msgId":56369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyaHZyYit0NjlnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyY3YwNitudWYwQGVHcm91cHMuY29tPg=="},"prevInTopic":56367,"nextInTopic":56370,"prevInTime":56368,"nextInTime":56370,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"... That can be the worst set-up for hurt feelings on the part of parents - and kids too! Don t worry about making memories. Focus on connecting with each","messageBody":"<div id=\"ygrps-yiv-313754526\">&quot;thebabywoman&quot; &lt;shelldan@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I want to spend some fun time making memories with my children<br/>\n<br/>\n </span></blockquote>That can be the worst set-up for hurt feelings on the part of parents - and kids too! Don&#39;t worry about making memories. Focus on connecting with each child, on promoting more joy and comfort in your home, on helping people find options when those seem to be lacking. Doing that will give you plenty of fond memories. If you&#39;re having an icky moment, stop and look lovingly at a child, take a mental snapshot for later and turn the moment around at the same time. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;How on earth, with a spread from 19 years old to 5 years old, can you do anything as a family with everyone happy?<br/>\n </span></blockquote>*************<br/>\n<br/>\nStep away from the idea of &quot;as a family&quot;. I have two kids, eight years apart, and its uncommon that we all find things we want to do together. The interests of a teenage male are waaaaay too different from those of a little girl most of the time. When they happen to coincide, its a gift, not something any of us have planned, and those are marvelous gifts! Wonderful moments of connection happen without anyone trying to make a memory - cherish those as they come up, between pairs and trios and don&#39;t fuss about &quot;the whole family&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Many times, we have done a family event, in which one or two weren&#39;t particularily thrilled with the choice, but they came along and were happy they did. <br/>\n </span></blockquote>***************<br/>\n<br/>\nA little bit of that isn&#39;t a terrible thing - sometimes there aren&#39;t other good options for just one child who wants to stay behind - but more than a little can build resentment, even if the kids make the best of things and have a good time, they&#39;ll resent being &quot;made to go&quot; and come to resent the idea of family - which is probably the opposite of what you have in mind. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;how can anyone have any family time together otherwise?<br/>\n<br/>\n </span></blockquote>It seems like &quot;family time&quot; is important to you. Recognize that it may not be important to all of your kids, and that&#39;s Okay. Not everyone will value &quot;family&quot; or &quot;family time&quot; especially with a large group. Its more in the nature of some people to prefer the specialness of one-on-one connection, with parents or friends or one sibling at a time. That&#39;s not some kind of failure on your part! Its the way some people are, naturally. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] meeting everyones needs","postDate":"1280071462","msgId":56367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5RDYyMzBFLTM5MkMtNDUxRC05MUY0LTY5NDkxRDQ2RTYyMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDUxM0M0MjBFLUNCNDItNEY2Mi04MjM4LTE5Q0E1RDkxRjU2N0B2ZXJpem9uLm5ldD4=","referencesHeader":"PGkyY3YwNitudWYwQGVHcm91cHMuY29tPiA8NTEzQzQyMEUtQ0I0Mi00RjYyLTgyMzgtMTlDQTVEOTFGNTY3QHZlcml6b24ubmV0Pg=="},"prevInTopic":56365,"nextInTopic":56369,"prevInTime":56366,"nextInTime":56368,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"... To clarify, you have two goals. Sometimes you can meet both. But sometimes a choice will mean moving closer to one and further from the other. You need to","messageBody":"<div id=\"ygrps-yiv-648930528\">On Jul 25, 2010, at 9:44 AM, Joyce Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you want them to have good memories or do you want them to be all<br/>\n&gt; together?<br/>\n<br/>\n </span></blockquote>To clarify, you have two goals. Sometimes you can meet both. But  <br/>\nsometimes a choice will mean moving closer to one and further from the  <br/>\nother. You need to decide which is the more important goal. Which you  <br/>\nwill move toward when push comes to shove. No amount of determination  <br/>\nand desire will make them both doable all the time.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] meeting everyones needs","postDate":"1280065474","msgId":56365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxM0M0MjBFLUNCNDItNEY2Mi04MjM4LTE5Q0E1RDkxRjU2N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGkyY3YwNitudWYwQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyY3YwNitudWYwQGVHcm91cHMuY29tPg=="},"prevInTopic":56364,"nextInTopic":56367,"prevInTime":56364,"nextInTime":56366,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"... Which probably ramped up your expectations that the day would fix that. The kids shouldn t be responsible for your emotional well being. ... It will help","messageBody":"<div id=\"ygrps-yiv-934926358\">On Jul 23, 2010, at 4:44 PM, thebabywoman wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am very emotional<br/>\n<br/>\n </span></blockquote>Which probably ramped up your expectations that the day would fix  <br/>\nthat. The kids shouldn&#39;t be responsible for your emotional well being.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and I realize I wanted today, to do something away from the house,  <br/>\n&gt; something fun and different partly as a result of how I am feeling.  <br/>\n&gt; I want to spend some fun time making memories with my children, as  <br/>\n&gt; they are precious and life with them is so short.<br/>\n<br/>\n </span></blockquote>It will help not to set your goals so high that imperfections will  <br/>\nmake you miss your goal. Don&#39;t expect too much from a day with  <br/>\neveryone. Do make plans, but realize that the more people involved in  <br/>\nthe plans, the more likely something won&#39;t run smoothly.<br/>\n<br/>\nI was just discussing this with my daughter Kathryn. I got it in my  <br/>\nmind that I wanted to see Iron Man 2 but the only theater playing it  <br/>\nwas an hour away in Seekonk. (Fortunately that part worked out!)  <br/>\nSeekonk has been overrun by chain stores so there isn&#39;t much there and  <br/>\nour expectations of doing anything else fun was low. But we had a  <br/>\ngreat meal at a Japanese restaurant we stumbled across, wandered past  <br/>\na comic book shop while looking for the theater that we went back to  <br/>\nwhich also had used records, CDs, videos all neatly organized and it  <br/>\nturned out to be a great day.<br/>\n<br/>\nThen when Kathryn&#39;s birthday came a week later, the expectations were  <br/>\nhigh and I realized my birthday had gone great because the  <br/>\nexpectations of its greatness were so low. So we planned a few sure  <br/>\nfire things and stumbled across a neat latte place, a local history  <br/>\nmuseum and again it turned out great.<br/>\n<br/>\nEnjoy the time that you get to spend with your kids (one at a time or  <br/>\nin any combination). Everyone is healthy and alive.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I told her we could buy a treat on the way home from the park. she  <br/>\n&gt; asked what slushies cost. I told her she had enough for a small  <br/>\n&gt; slushie. Then she started whining/almost crying that she was so  <br/>\n&gt; hungry.<br/>\n<br/>\n </span></blockquote>Hungry and tired trump other wants. Part of successful unschooling is  <br/>\nanticipating and keeping tabs on hunger and tiredness so you can  <br/>\nrespond before emotions deteriorate.<br/>\n<br/>\nYour daughter shouldn&#39;t be responsible for paying for a slushie if  <br/>\nshe&#39;s hungry. If your rule is that treats are their responsibility,  <br/>\nthat puts you in a bind when she&#39;s hungry and really wants a slushie.  <br/>\nThat&#39;s the problem with rules. The rule got in the way of helping her  <br/>\nreturn to peacefulness so any bumps in the day didn&#39;t feel like craters.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel like I shouldn&#39;t have forced them to come, that it wasn&#39;t  <br/>\n&gt; right, but at the same time, how can anyone have any family time  <br/>\n&gt; together otherwise?<br/>\n<br/>\n<br/>\n </span></blockquote>Do you want them to have good memories or do you want them to be all  <br/>\ntogether? The memories I have of the whole family doing something  <br/>\ntogether is about the activity we were doing. The best memories I have  <br/>\nof my family is doing things one on one with my sister or one parent.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":342163414,"authorName":"Chris S.","from":"&quot;Chris S.&quot; &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: meeting everyones needs","postDate":"1280064012","msgId":56364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwRTBFMDE0LTZENTEtNDIwQS1CODU4LUZBNDY3NzAzNTA4MEBnbWFpbC5jb20+","inReplyToHeader":"PGkyaDI3ZCttb2dqQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyaDI3ZCttb2dqQGVHcm91cHMuY29tPg=="},"prevInTopic":56362,"nextInTopic":56365,"prevInTime":56363,"nextInTime":56365,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"... Zach was away at a friend s house last night and Zoe, Rick, and I had gone out for dinner -- to her favorite Mexican restaurant.  We find ourselves doing","messageBody":"<div id=\"ygrps-yiv-50149865\"><blockquote><span title=\"ireply\">&gt; &quot;Family memories&quot;?<br/>\n&gt; Go for individual happy memories, and the peace of individuals. If<br/>\n&gt; you try for &quot;family peace,&quot; instead of individual peace, it will not<br/>\n&gt; be peaceful for everyone very often.<br/>\n<br/>\n<br/>\n </span></blockquote>Zach was away at a friend&#39;s house last night and Zoe, Rick, and I had  <br/>\ngone out for dinner -- to her favorite Mexican restaurant.  We find  <br/>\nourselves doing things, just the three of us, a lot more these days as  <br/>\nZach&#39;s interests take him away from home and family more and more.<br/>\n<br/>\n  Zoe&#39;s emotions have been more powerful of late, she&#39;s almost 13 and  <br/>\nI think she&#39;s in the midst of lots of exciting and volatile hormonal  <br/>\nand developmental changes. She was feeling sad after dinner, thinking  <br/>\nabout her best friend who moved away two years ago and whose birthday  <br/>\nis today.  Zoe was missing her something terrible. Rick and I hung out  <br/>\nwith her in the car, in the driveway, listening to her recount her  <br/>\nmemories of good times with her friend. She was oscillating between  <br/>\ncrying and laughing and she did not want to get out of the car --  <br/>\nmaybe because she had our undivided attention.<br/>\n<br/>\nAfter awhile, she&#39;d stopped crying and we talked her into coming  <br/>\ninside the house.  We were trying to think of something to do all  <br/>\ntogether -- I suggested watching a movie of her choosing (we use  <br/>\nNetflix Instant Watch a lot so there&#39;s thousands of movies to choose  <br/>\nfrom at our fingertips) but Zoe didn&#39;t feel like watching a movie. Zoe  <br/>\nsuggested that we all play World of Warcraft together -- but we only  <br/>\nhave two accounts  -- so that wasn&#39;t something we could do all  <br/>\ntogether (besides, Rick doesn&#39;t enjoy WoW and he was reluctant.)  It  <br/>\nwas important to Zoe, that whatever we did, it included all three of  <br/>\nus - so she suggested we play Little Big Planet -- which is a video  <br/>\ngame in which you create your own avatar, and you can build your own  <br/>\nplatforms or play through other&#39;s platforms.  I&#39;ve watched Zoe play  <br/>\nLBP a lot but have never tried my hand at it so this was going to be a  <br/>\nnew experience for me! We agreed to take turns, as we only had two  <br/>\nPlaystation controllers.<br/>\n<br/>\nWe ended up having a blast - especially me.  I laughed so hard at my  <br/>\nown ineptitude.  Zoe really enjoyed talking me through how to create  <br/>\nmy avatar and learning how to control it. Rick wasn&#39;t a lot more apt  <br/>\nat it than me so when it was the two of us running through a platform,  <br/>\nit was like an episode of Laurel and Hardy the way our avatars kept  <br/>\ngetting knocked down and succumbing to the deadly obstacles.  We  <br/>\nreally all had such a wonderful time together and I&#39;m sure our memory  <br/>\nof last night will go down as a very happy family memory -- all  <br/>\nbecause Rick and I were striving to make Zoe&#39;s life more peaceful and  <br/>\nhappy.<br/>\n<br/>\nAfter we finished playing LBP (when I was so tired my eyes couldn&#39;t  <br/>\nsee the TV screen clearly anymore) we retired to our bedroom where we  <br/>\nwatched Leave it to Beaver on my iPad (up close for my tired eyes.)  <br/>\nI&#39;d asked for TV show suggestion on this list awhile back, and Leave  <br/>\nit to Beaver has become a part of Zoe&#39;s and my nightly routine --  <br/>\nright before I go to sleep we snuggle up in my bed and watch an  <br/>\nepisode or two (except I usually end up sleeping through part of a  <br/>\nsecond episode.)  What a lovely show that is! Zoe loves to analyze the  <br/>\nparenting and I&#39;m watching Ward and June&#39;s behavior from a totally  <br/>\ndifferent perspective than I did when I was a kid watching that show.  <br/>\nSome nights Rick joins us and some nights Zach watches with us.   <br/>\nRarely, but on an occasion or two -- all four of us have crowded onto  <br/>\nour king-sized bed to watch Leave it to Beaver on my little iPad screen!<br/>\n<br/>\nHappy memories of both the family and individual kind all coming out  <br/>\nof striving for individual peace.<br/>\n<br/>\nChris in IA</div>","specialLinks":[]},{"userId":227835915,"authorName":"m_aduhene","from":"&quot;m_aduhene&quot; &lt;m_aduhene@...&gt;","profile":"m_aduhene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: meeting everyones needs","postDate":"1280052269","msgId":56362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyaDI3ZCttb2dqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBDNzFBOTc2LUIzNTgtNDM1RC1CRDlGLTAwNTAxREJENzU4QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":56361,"nextInTopic":56364,"prevInTime":56361,"nextInTime":56363,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"... and i just wanted to ask, is this something they (government, media...etc.) have come up with to ease the guilt of working mums and dads?...ie. spend","messageBody":"<div id=\"ygrps-yiv-1657906366\">Sandra wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Family memories&quot;?<br/>\n<br/>\n </span></blockquote>and i just wanted to ask, is this something &quot;they&quot; (government, media...etc.) have come up with to ease the guilt of working mums and dads?...ie. &#39;spend quality family time together at the weekend and it will make up for not being together all week&#39;......or &#39;have 20 mins family time a day&#39;  and those kind of examples.<br/>\nAs unschooling families we have the benefit of most of us being together most of the time anyway so we don&#39;t have to create these kind of &quot;false&quot; family times.  Just asking, because (and i only have 3 children), sometimes I get these strong feelings that we should all do something &quot;as as a family&quot;, say a board game or trip out, sometimes it works and sometimes one or another won&#39;t be that bothered by joining in.....and then I feel annoyed and can&#39;t understand why they don&#39;t want to do &quot;family things&quot;.  But it&#39;s often because they are happily doing their own thing.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Go for individual happy memories, and the peace of individuals.   If  you try for &quot;family peace,&quot; instead of individual peace, it will not be peaceful for everyone very often.<br/>\n<br/>\n </span></blockquote>Thanks Sandra this eases the pressure as to how I view things for the future :-)<br/>\n<br/>\nblessings<br/>\nmichelle</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] meeting everyones needs","postDate":"1280018153","msgId":56361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBDNzFBOTc2LUIzNTgtNDM1RC1CRDlGLTAwNTAxREJENzU4QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkyY3YwNitudWYwQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyY3YwNitudWYwQGVHcm91cHMuY29tPg=="},"prevInTopic":56360,"nextInTopic":56362,"prevInTime":56360,"nextInTime":56362,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"-=- I am very emotional and ...-=- Not every day, or every week, will involve the funeral of a child. Don t judge what normal days should be like by unusual","messageBody":"<div id=\"ygrps-yiv-82490199\">-=- I am very emotional and ...-=-<br/>\n<br/>\nNot every day, or every week, will involve the funeral of a child.   <br/>\nDon&#39;t judge what normal days should be like by unusual and stressful  <br/>\ndays when you&#39;re still new to unschooling.<br/>\n<br/>\n-=- At some point I just fell apart and said I was taking everyone  <br/>\nhome, because there was no way to make everyone happy. ( I came home  <br/>\nand bawled in my room.-=-<br/>\n<br/>\nAh...<br/>\nWhen there&#39;s stress and emotion and hunger and thirst, it&#39;s pretty  <br/>\nmuch a guarantee to make everyone UNhappy.<br/>\n<br/>\n-=-How on earth, with a spread from 19 years old to 5 years old, can  <br/>\nyou do anything as a family with everyone happy?-=-<br/>\n<br/>\nYou don&#39;t try to do things with everyone all at once.  Go with  <br/>\nsubgroups.<br/>\n<br/>\n-=- How can you have any family memories if you always wait till  <br/>\neveryone wants to go do the same thing?-=-<br/>\n<br/>\n&quot;Family memories&quot;?<br/>\nGo for individual happy memories, and the peace of individuals.   If  <br/>\nyou try for &quot;family peace,&quot; instead of individual peace, it will not  <br/>\nbe peaceful for everyone very often.<br/>\n<br/>\n-=-I have been reading, thinking, watching my reactions towards my  <br/>\nchildren, etc. for awhile now. I am deschooling basically, and I feel  <br/>\nlike I am coming along surely, but slowly on some issues more than  <br/>\nothers. -=-<br/>\n<br/>\nI&#39;m guessing you have years of schoolishness and rules to overcome.   <br/>\nIt won&#39;t be the same as a family that added one more person at a time  <br/>\nto an already unschooling group.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":133263247,"authorName":"thebabywoman","from":"&quot;thebabywoman&quot; &lt;shelldan@...&gt;","profile":"thebabywoman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"meeting everyones needs","postDate":"1279917894","msgId":56360,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyY3YwNitudWYwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":56361,"prevInTime":56359,"nextInTime":56361,"topicId":56360,"numMessagesInTopic":0,"msgSnippet":"I have been reading, thinking, watching my reactions towards my children, etc.  for awhile now.  I am deschooling basically, and I feel like I am coming along","messageBody":"<div id=\"ygrps-yiv-1745045251\">I have been reading, thinking, watching my reactions towards my children, etc.  for awhile now.  I am deschooling basically, and I feel like I am coming along surely, but slowly on some issues more than others. <br/>\n<br/>\nWhat I cannot wrap my head around is how to meet the needs of EVERYONE and still do things together.  I am so frustrated.  Yesterday I went to a funeral for an almost 2 yo little boy (he drowned), from a homeschooling family I have known for many years.  I am very emotional and I realize I wanted today, to do something away from the house, something fun and different partly as a result of how I am feeling.  I want to spend some fun time making memories with my children, as they are precious and life with them is so short.  <br/>\n<br/>\nI asked them where they&#39;d like to go, and gave a few suggestions, they suggested a few.  We narrowed it down to the Forks (market, with nature trails, shopping, buskers).  When we got there, I drove around and around trying to find parking, then got turned around.  My 15yo said, Why don&#39;t we just go to the park (one of the suggestions) instead.  The parking is so limited, and it will take awhile to find a spot.<br/>\n<br/>\nI looked at my watch, and said, yah, that might be a good idea.  What do you guys think.  Three agreed, two didn&#39;t.  One said she was too tired to go to the park (9yo)  7yo said she didn&#39;t know what she wanted to do.  The 5 yo agreed, but was disappointed, as she wanted to spend money at The Forks.  I told her we could buy a treat on the way home from the park.  she asked what slushies cost.  I told her she had enough for a small slushie.  Then she started whining/almost crying that she was so hungry.  My o15 yo, who had suggested the park a minute ago, now said she wished she had brought a ball for her and her 17yo sister to use, because what were they to do while the other younger three played at the play structure.  At some point I just fell apart and said I was taking everyone home, because there was no way to make everyone happy.  ( I came home and bawled in my room.  I did something stupid first...my 9yo asked to play outside, and I said no, if you are too tired to go to the park, then you&#39;re too tired to play outside. I realize now how I was mad and over reacting, and without realizing it, maybe even trying to punish her, because I believed she wasn&#39;t actually tired at all)<br/>\n<br/>\nI have 6 daughters, 5 homeschooling, one at home, but she&#39;s working full time.  How on earth, with a spread from 19 years old to 5 years old, can you do anything as a family with everyone happy?  How can you have any family memories if you always wait till everyone wants to go do the same thing?  Many times, we have done a family event, in which one or two weren&#39;t particularily thrilled with the choice, but they came along and were happy they did.  Many funny and wonderful times have come out of us being together.  Now that I&#39;m reading on this list and unschooling sites, I feel like I shouldn&#39;t have forced them to come, that it wasn&#39;t right, but at the same time, how can anyone have any family time together otherwise?  <br/>\n<br/>\nI just can&#39;t figure that out.  Help!</div>","specialLinks":[]}],"prevTopicId":55837,"nextTopicId":56353}}