{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Lots of Bad Moments","postDate":"1332357155","msgId":66306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprZDk3Mys0ODA3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI0RUE5NzUzLTI2MzUtNDU2OC1BQkVFLTMyMEE5MDM1RkE1NEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66293,"nextInTopic":0,"prevInTime":66305,"nextInTime":66307,"topicId":66289,"numMessagesInTopic":0,"msgSnippet":"**If some of them were in school, would your day be calmer or better?** NO WAY!  :-)  Thankful home is where they want to be! **Maybe do more, and think less.","messageBody":"<div id=\"ygrps-yiv-1451603466\">**If some of them were in school, would your day be calmer or better?**<br/>\n<br/>\nNO WAY!  :-)  Thankful home is where they want to be!    <br/>\n<br/>\n**Maybe do more, and think less.    It sounds from what you wrote that you&#39;re all spun up with words in your head.**<br/>\n<br/>\nRight on!  Thanks for the links.  Yesterday and today have been so much better.  We&#39;ve begun doing what you and the others have suggested. Feeling much more relaxed and there has been a lot more laughter.  Played video games with the kids.  We made playdough for Zoe...Darius and Izzy played too.  :-)  We&#39;ve gone for a couple walks together and spent time just coloring or watching a movie.  Now, I&#39;m resting while Zoe naps next to me as Peter Pan plays and an empty popcorn bowl rests on the floor.  Darius made two loaves of banana bread and later we plan on putting together his bird-feeder.  It&#39;s just with glue, (very easy), and then we get to paint it.  I&#39;ll be sitting on my arse.  Maybe some reading from Alice in Wonderland this evening.  More bubbles.  More chalk art.  It&#39;s amazing how full the days are and how many opportunities for great moments there are, when I really &quot;look&quot; at &quot;what is&quot; instead of some ideal in my head.  <br/>\n<br/>\nThanks!<br/>\nChristina.</div>","specialLinks":[]},{"userId":250343173,"authorName":"Tam","from":"Tam &lt;wifejuliefish@...&gt;","profile":"wifejuliefish","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lots of Bad Moments","postDate":"1332267139","msgId":66293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5QURCQTkyLTM5MzAtNEFERS05RjFELTI2QUVGM0JFNDFERUB5YWhvby5jby51az4=","inReplyToHeader":"PGprOXBicytvZW5oQGVHcm91cHMuY29tPg==","referencesHeader":"PGprOXBicytvZW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":66292,"nextInTopic":66306,"prevInTime":66292,"nextInTime":66294,"topicId":66289,"numMessagesInTopic":0,"msgSnippet":"*Tired. Overwhelmed. I had wanted to make these last days as sparkly as possible since I will soon be so busy with a new LO* One thing that helped me when I","messageBody":"<div id=\"ygrps-yiv-290559657\">*Tired. Overwhelmed. I had wanted to make these last days as &quot;sparkly&quot; as possible since I will soon be so busy with a new LO*<br/>\n<br/>\nOne thing that helped me when I was heavily pregnant was spending ten minutes some nights making up little bags of things to do right where I was so that I could pull out a fun activity to suggest without spending all day dragging my giant tired belly up and down out of the chair. For example I had at one point a couple of bags of craft bits and pieces/glue, a bag with some big cardboard tubes and toy cars for racing down them, a bag with a couple of pillowcases for sack races, a bag with a tub and some things to play with water with, a bag with refrigerator cake ingredients/cake tin, and a bag with some popcorn and a couple of DVDs in it. You could also do this sort of thing with the little one in the vicinity of the older two playing their video games if they want to carry on doing that. <br/>\n<br/>\nDrive throughs also helped, as they meant I could suggest a trip out for ice cream, for example, without it being too draining for me.<br/>\n<br/>\nTam<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 20 Mar 2012, at 11:23, &quot;Christina&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:daharryrc@...\">daharryrc@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Tired. Overwhelmed. I had wanted to make these last days as &quot;sparkly&quot; as possible since I will soon be so busy with a new LO </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Lots of Bad Moments","postDate":"1332263247","msgId":66292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprYWRnZitjaW5sQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprOXBicytvZW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":66291,"nextInTopic":66293,"prevInTime":66291,"nextInTime":66293,"topicId":66289,"numMessagesInTopic":0,"msgSnippet":"... ************** When I was pregnant with Mo, I had visions of holding and cuddling her a lot... and I did some, but she wasn t a particularly cuddly baby.","messageBody":"<div id=\"ygrps-yiv-1382069145\">&quot;Christina&quot; &lt;daharryrc@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I had visions of us spending lots of time together and some days have been like that, but mostly, Darius and Izzy have been playing video games while Zoe (2 yo) consumes most of my time and energy.<br/>\n </span></blockquote>**************<br/>\n<br/>\nWhen I was pregnant with Mo, I had visions of holding and cuddling her a lot... and I did some, but she wasn&#39;t a particularly cuddly baby. She liked to look and look and look and I wasn&#39;t the most exciting thing in the world to her - she was happier if I held or propped her so she could look around. As she got older I hung on to visions of reading to her, cuddling down to sleep, but Mo&#39;s preferred night-time wind-down routine involved racing back and forth for an hour or more, not sitting and cuddling, and she rarely wanted me to read anything at all to her. Life with kids isn&#39;t always what you imagine it will be. <br/>\n<br/>\nIs it possible for you to do more with the 2yo close to where the others are playing video games? Set up a big washtub on the floor and fill it with something - water or rice or sand or whatever - so the 2yo has something exciting to do and you can rest a bit, sitting on the floor close to all of your children. Another thought is to to get a bunch of movies the older kids like so all of you can do something relaxing together - again, it might go better with some kind of activity for the 2yo, something to keep her interested where you are, so you can rest a little and catch up with your other kids a little. <br/>\n<br/>\nLooking for activities which let you rest helps everyone! Do the older kids like to throw things? Will they play &quot;fetch&quot; with the 2yo? Fetch - like with a dog - is a game a lot of toddlers enjoy, and it&#39;s Easy. You stand in one spot and throw things and they do all the rest. It&#39;s easy to combine with another catch game, as well - you can play catch - or the other kids can play catch - while also playing fetch with the little one. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lots of Bad Moments","postDate":"1332258751","msgId":66291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0RUE5NzUzLTI2MzUtNDU2OC1BQkVFLTMyMEE5MDM1RkE1NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGprOXBicytvZW5oQGVHcm91cHMuY29tPg==","referencesHeader":"PGprOXBicytvZW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":66289,"nextInTopic":66292,"prevInTime":66290,"nextInTime":66292,"topicId":66289,"numMessagesInTopic":0,"msgSnippet":"-=-My fear is that I m running out of time to get it right and some days it causes me to be spiral downward. How do I overcome these fears and just focus on","messageBody":"<div id=\"ygrps-yiv-1860247456\">-=-My fear is that I&#39;m running out of time to &quot;get it right&quot; and some days it causes me to be spiral downward. How do I overcome these fears and just focus on the present moment? I&#39;m not even sure if that&#39;s my question. I can&#39;t even seem to &quot;find&quot; my question so sorry if this doesn&#39;t make sense, but I&#39;m hoping some of you that have traveled this road can see something I can&#39;t in my rambling.-=-<br/>\n<br/>\nBy making more positive choices when you make a choice, and by practicing making choices.<br/>\n<br/>\nThere&#39;s not another way I know of.<br/>\n<br/>\n-=-Do I just need to accept this season and quit looking for it to &quot;look&quot; differently?-=-<br/>\nWhat are your options, really?<br/>\n<br/>\n-=-mostly, Darius and Izzy have been playing video games while Zoe (2 yo) consumes most of my time and energy. -=-<br/>\n<br/>\nIf some of them were in school, would your day be calmer or better?<br/>\n<br/>\nDon&#39;t compare it to a fantasy ideal.  Compare it to your real options.  Would school have helped?  Would a curriculum have helped?<br/>\n<br/>\nMaybe do more, and think less.    It sounds from what you wrote that you&#39;re all spun up with words in your head.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n<br/>\nMaybe breathe and observe without words.  Even without words in your head, if you can, for a few seconds at a time until you can do it for longer.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Lots of Bad Moments","postDate":"1332242620","msgId":66289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprOXBicytvZW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":66291,"prevInTime":66288,"nextInTime":66290,"topicId":66289,"numMessagesInTopic":0,"msgSnippet":"I spent enough bad moments yesterday to consider it a bad day .  I m nearly 38 weeks pregnant and full of fear.  We ve been deschooling for about a month.","messageBody":"<div id=\"ygrps-yiv-670585289\">I spent enough &quot;bad moments&quot; yesterday to consider it a &quot;bad day&quot;.  I&#39;m nearly 38 weeks pregnant and full of fear.  We&#39;ve been deschooling for about a month.  I had visions of us spending lots of time together and some days have been like that, but mostly, Darius and Izzy have been playing video games while Zoe (2 yo) consumes most of my time and energy.  I also do most all of the household tasks with the occasional help from Darius and Izzy.  They are great helpers, have wonderful attitudes about it, but I rarely ask.  I&#39;m anemic.  Tired. Overwhelmed.  I had wanted to make these last days as &quot;sparkly&quot; as possible since I will soon be so busy with a new LO, but I&#39;m not sleeping well at night and end up laying down with Zoe when she takes her nap.  Yesterday, I had an awful day where I let my fears of losing my kids = (them not wanting me around or wanting to do things with me anymore)get to me and was a total grump all day.  This fear comes from the awful relationship I had with my mom and at some point, I just hid out in my room to avoid her.  Reading a link Sandra shared eventually ended me up to this one...  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/zeneverything.\">http://sandradodd.com/zeneverything.</a>  Tears filled my eyes.  It&#39;s strangely comforting to know that even Sandra has had these moments.  Even though I didn&#39;t hit physically, I did with my awful attitude and snide remarks.  My fear is that I&#39;m running out of time to &quot;get it right&quot; and some days it causes me to be spiral downward.  How do I overcome these fears and just focus on the present moment?  I&#39;m not even sure if that&#39;s my question.  I can&#39;t even seem to &quot;find&quot; my question so sorry if this doesn&#39;t make sense, but I&#39;m hoping some of you that have traveled this road can see something I can&#39;t in my rambling.  Today, Izzy is getting stitches taken out of her foot.  It will be just her and I and I&#39;m hoping to get a little quality time...maybe breakfast out with just her.  Darius usually joins me on my morning walk.  Are these few moments &quot;enough&quot;?  Do I just need to accept this season and quit looking for it to &quot;look&quot; differently?  Ugh.  <br/>\n<br/>\nThanks,<br/>\nChristina.</div>","specialLinks":[]}],"prevTopicId":66260,"nextTopicId":66316}}