{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"UNSCHOOLING.COM ONLINE NEWS Mid July 2002","postDate":"1026750351","msgId":39202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5YS41NDE1MmMwLjJhNjQ1MThmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":39201,"nextInTime":39203,"topicId":39202,"numMessagesInTopic":0,"msgSnippet":"... UNSCHOOLING.COM ONLINE NEWS Mid-July 2002 ... In this Issue: John Holt on Enthusiasm Collections How to nurture your child s urge to collect  Disposable","messageBody":"<div id=\"ygrps-yiv-1719686053\">::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS<br/>\nMid-July 2002<br/>\n<br/>\n::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nIn this Issue:<br/>\n<br/>\nJohn Holt on Enthusiasm<br/>\nCollections<br/>\nHow to nurture your child&#39;s urge to collect <br/>\nDisposable Checklists for Unschoolers <br/>\nQuo Vadis Magazine <br/>\nHow to beat the heat<br/>\nCool Comfort<br/>\nFundamentalist Unschooling?<br/>\nUnschool Friendly Conferences<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n&quot;Children... do much of their learning in great bursts of passion and <br/>\nenthusiasm. Except for those physical skills which can&#39;t be learned any other <br/>\nway, children rarely learn on the slow, steady schedules that schools make <br/>\nfor them. They are more likely to be insatiably curious for a while about <br/>\nsome particular interest, and to read, write, talk, and ask questions about <br/>\nit for hours a day and for days on end. Then suddenly they may drop that <br/>\ninterest and turn to something comepletely different, or even for a while <br/>\nseem to have no interests at all. This usually means that for the time being <br/>\nthey have all the information on that subject that they can digest, and need <br/>\nto explore the world in a different way, or perhaps simply get a firmer grip <br/>\non what they already know.&quot;<br/>\n<br/>\nJohn Holt in How Children Learn (revised edition)<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nCollections<br/>\n<br/>\nWe&#39;re five and six high in egg cartons of rocks. &lt;g&gt;  Not painted rocks but <br/>\nfound crystals and minerals and we&#39;re going collecting again on Saturday.  We <br/>\nhave a lot of rocks on our table for easy viewing under the microscope but <br/>\nthey&#39;re spreading out now to the bookshelves and coffee table and my kitchen <br/>\nwindow sill.   We just made a find at our little city park, of petrified wood <br/>\nalong the upper creek bank.  We didn&#39;t have anything to dig with but our <br/>\nhands and came away with thirty or so good pieces, some with fossils.  We&#39;ll <br/>\nhave to go back with our shovel and see what else is there.<br/>\n<br/>\nDeb L. in a discussion about rock collections on the HEM-Unschooling email <br/>\nlist<br/>\n<br/>\nTo join visit the group website at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/HEM-Unschooling/\">http://groups.yahoo.com/group/HEM-Unschooling/</a><br/>\nor send a blank email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Unschooling-subscribe@yahoogroups.com\">HEM-Unschooling-subscribe@yahoogroups.com</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nAaron&#39;s Treasures<br/>\nHow to nurture your child&#39;s urge to collect (without letting it drive you <br/>\nnuts) <br/>\nby Eric D. Gyllenhaal   <br/>\n<br/>\nIt started early last spring as the snow finally melted, revealing the sparse <br/>\ngrass of our neighbors&#39; yards. Aaron&#39;s sharp, 4-year-old eyes soon discovered <br/>\nwonderful things littered on the sticky ground. He searched, selected and <br/>\ncollected the best of them--bottle caps, broken bits of toys, lost barrettes, <br/>\neven a few coins--and stuffed them in the mesh pocket of his backpack. Then <br/>\nhe brought them home and joyfully displayed them to his family. <br/>\n<br/>\n&quot;Treasures,&quot; he proclaimed, and so they were. Aaron&#39;s treasures became the <br/>\nlatest passion in our collection-packed home. <br/>\n<br/>\nAaron accumulated a large cardboard box of treasures before the end of May. <br/>\nFive-year-old Ethan joined in the adventure, collecting seeds, rocks and bugs <br/>\ninstead of human litter, but he&#39;d always been a naturalist at heart. <br/>\n<br/>\nI empathized. I understood their need to constantly scan the ground. I&#39;m also <br/>\na born naturalist and collector, having been raised in a nature center, <br/>\ntrained in geology, and often employed in museums. I carried zippered plastic <br/>\nbags in my pockets and held them open so the boys could save their finds. My <br/>\nwife sighed, stuffed a few plastic bags in her pockets, and played along. <br/>\n<br/>\nWe&#39;d been through this before. We first learned what kind of family we&#39;d <br/>\nbecome when Ethan, at the age of 1, developed a passion for turtles. We <br/>\nvisited live turtles at the zoo, searched for mounted turtles in natural <br/>\nhistory museums, borrowed turtle books from the library, and scanned videos <br/>\nand nature shows for brief glimpses of his favorite turtle, the &quot;great big <br/>\nAlligator Snap.&quot; Soon there was a collection at the center of his passion. <br/>\nEthan collected plastic turtles by the dozen, begging us to buy him more. <br/>\nPlastic turtles marched across Ethan&#39;s floor, ate whatever plastic worms he <br/>\nhad to offer, and sloshed about in his bath. <br/>\n<br/>\nEthan has lived his way through many passions since then: dinosaurs, seeds, <br/>\ntrains, shells, insects, Pokémon, rocks--then dinosaurs, insects, trains and <br/>\nPokémon again. Each passion lasts four months or so, sometimes overlapping <br/>\nwith the previous one, and each involves a collection: plastic dinosaurs, <br/>\ndried seeds, wooden trains, real shells, live and dead insects, Pokémon toys <br/>\nand cards, and boxes full of rocks. Ethan&#39;s bedroom looks like a museum <br/>\nstoreroom because he never lets anything go.&quot; <br/>\n<br/>\nRead the rest of this fascinating article at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://saltthesandbox.org/ChicagoParentArticle1.htm\">http://saltthesandbox.org/ChicagoParentArticle1.htm</a><br/>\n<br/>\nMr. Gyllenhaal includes suggestions for organizing and growing collections, <br/>\nalong with compelling arguments for assisting your child in his collecting <br/>\npassion or at least not getting in the way.<br/>\n<br/>\nThis article appeared in the July, 2002, issue of Chicago Parent<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nDisposable Checklists for Unschoolers <br/>\n<br/>\nBeginning homeschoolers are often afraid. Sometimes they homeschool for a <br/>\nwhile, and a curriculum keeps the fear to a manageable level. Sometimes a <br/>\ncurriculum is a workable alternative to school for a family. For some it is <br/>\nnot. Some of those give up and the kids go back to school. Some give up the <br/>\ncurriculum and move toward unschooling.<br/>\n <br/>\nBeginning unschoolers are often afraid. Without the touchstone of a schedule <br/>\nand a list, they don&#39;t know how they will see progress, or how they will <br/>\nrecognize &quot;sufficient effort&quot; on the part of children or parents. <br/>\n<br/>\nFor some people, treating their first months of unschooling as summer <br/>\nvacation, or a month or two of Saturdays is sufficient, but some people <br/>\nschedule even their Saturdays and vacations. &quot;Just hang out with your kids&quot; <br/>\nsounds torturous to them, and may be more frightening than abandoning public <br/>\nschool was. <br/>\n<br/>\nHere, then, are some possible replacement checklists and scheduling aids for <br/>\nthose who truly want to unschool but who can&#39;t breathe well or sleep soundly <br/>\nwithout a plan. <br/>\n<br/>\nSink-Like-a-Stone Method: Instead of skimming the surface of a subject or <br/>\ninterest, drop anchor there for a while. If someone is interested in chess, <br/>\nmess with chess. Not just the game, but the structure and history of <br/>\ntournaments. How do chess clocks work? What is the history of the names and <br/>\nshapes of the playing pieces? What other board games are also traditional and <br/>\nwhich are older than chess? If you&#39;re near a games shop or a fancy gift shop, <br/>\nwander by and look at different chess sets on display. It will be like a <br/>\nteeny chess museum. The interest will either increase or burn out - don&#39;t <br/>\npush it past the child&#39;s interest. <br/>\n<br/>\nWhen someone understands the depth and breadth of one subject, he will know <br/>\nthat any other subject has breadth and depth. <br/>\n<br/>\nSandra Dodd in the July/August issue of Home Education Magazine<br/>\nFind the rest of Sandra&#39;s column (and the rest of the checklists!) at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/194/jaunschooling.html\">http://www.home-ed-magazine.com/HEM/194/jaunschooling.html</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nQuo Vadis Magazine <br/>\n<br/>\nI recently received this announcement for Quo Vadis, described as a Magazine <br/>\nby and for self-educating people of all varieties. <br/>\n<br/>\n&quot;This magazine will contain articles, stories, poetry, announcements, <br/>\nshameless self-promotion, etc., written by you, to fascinate, entertain, and <br/>\ninspire. <br/>\n<br/>\nAs a brief introduction, my name is Zack Shuman, and I live in Olympia WA?. <br/>\nI&#39;ve home/unschooled my whole life and I&#39;ve been part of the Not Back To <br/>\nSchool Camp (NBTSC) community since it began in 1996. My goal with this <br/>\nmagazine is to help foster a community of people who see self-education and <br/>\nlearning as a philosophy for a lifetime, not simply and alternative for 6-18 <br/>\nyear olds, to the mainstream American schooling systems. If you are a <br/>\nhome/unschooling parent, start thinking of yourself as an autodidact with <br/>\nkids. If you are a home/unschooler, start thinking of yourself as a person <br/>\nwith a passion for life, and for learning, who happens to be young. And if <br/>\nyou have no prior connection to the home/unschooling movement, or the NBTSC <br/>\ncommunity, welcome, it&#39;s your love of life and learning that make you a part <br/>\nof this community, not your educational history. <br/>\n<br/>\nWant to be a part of this? Good! ...cause I&#39;m not writing all the content <br/>\nmyself!&quot;<br/>\n<br/>\nFor more information, visit <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nbtsc.org/wiki/QVMagazine\">http://www.nbtsc.org/wiki/QVMagazine</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nHow to beat the heat<br/>\n<br/>\n&quot;It was hot in Montana today.  We get hot here but not humid so mostly folks <br/>\ncan stand it.  We stand it by playing in the pool.  *The pool* is a ten foot <br/>\ninflatable rim, 36&quot; deep vinyl kids pool, but oh, is it lovely in the heat.<br/>\n<br/>\nHowever fun they are vinyl pools need to be cleaned sometimes and today it <br/>\njust wasn&#39;t going to wait anymore.  So I drained it and floundered around in <br/>\nthere scrubbing and being hot and thinking almost anything would be better <br/>\nthan what I was doing.  It was an all day thing, draining, cleaning and <br/>\nrefilling and then mowing the lawn and what not.<br/>\n  <br/>\nBut when I came in Dylan had made ice cream.  Not ice cream really, non dairy <br/>\nfrozen desert.  Last week or so we borrowed my moms old, (really old) ice <br/>\ncream maker.  It&#39;s the &quot;Dolly Madison Home Ice Cream Freezer&quot;, and says <br/>\n*HUSKY* on the label, and my mom got it  when my brother was little, about <br/>\nfifty four years ago.  We made a batch the first day and it was fun, but we <br/>\nhadn&#39;t tried it again.  While I was squishing around in the pool he was <br/>\nsecretly picking strawberries, and cracking ice and measuring soy milk and <br/>\nsugar and vanilla and making me the happiest mom in Deer Lodge, Montana.  <br/>\nYessiree.<br/>\n <br/>\nI&#39;ll remember forever how good it tasted and how pleased he looked and how <br/>\nlucky I felt. How it felt to sit in our little kitchen and look out into the <br/>\nback yard, with the grass freshly cut and the bright blue pool filling up <br/>\nwith water and see Dylan&#39;s happy face across the table.   And I won&#39;t be <br/>\ngrumpy next time I have to clean the pool either, because however yucky the <br/>\npool is, the kid who likes the pool is awesome. &quot;<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nVisit the Unschooling.com message boards at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/discus/messages/board-topics.html\">http://www.unschooling.com/discus/messages/board-topics.html</a><br/>\n<br/>\nTo subscribe to the Unschooling-dotcom email list send a blank email to: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-subscribe@yahoogroups.com\">Unschooling-dotcom-subscribe@yahoogroups.com</a><br/>\nOr visit the email list website at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a> <br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nCool Comfort<br/>\n<br/>\nRecently my father said to me that he thought TV and video games are <br/>\nunhealthy because they lure children inside during the summer. I told him I <br/>\nthink the blame lies with air conditioning. On pleasant days my children bang <br/>\noutside at first light and don&#39;t return until hunger strikes. Hot days are <br/>\nanother matter, however. When even the big shade tree in our front yard <br/>\noffers little relief from the heat, the neighborhood children all vanish into <br/>\ntheir houses, with the blinds drawn against the glare and the air <br/>\nconditioning pouring out liquid cool. When I was their age, neither our house <br/>\nnor those of our neighbors was air conditioned. When heat waves struck we&#39;d <br/>\nflee the stifling air inside to spend the day roaming in search of shade and <br/>\ncooling breezes, begging for sprinklers and Popsicles. <br/>\n<br/>\nThis month marks the 100th anniversary of air-conditioning (depending on <br/>\nwhose history you read). Celebrate by checking out a new book exploring &quot;how <br/>\nthe idea of &quot;cooling&quot; became firmly embedded in the social perceptions and <br/>\nexpectations of Americans, transforming our definition of comfort and the way <br/>\nwe live, work, and play.&quot;<br/>\n<br/>\nCool Comfort by MARSHA E. ACKERMANN<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sipress.si.edu/books/titles_books/1-58834-040-6.html\">http://www.sipress.si.edu/books/titles_books/1-58834-040-6.html</a><br/>\n<br/>\nOr check out the web exhibit at the National Building Museum<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nbm.org/Exhibits/past/2000_1996/Stay_Cool!\">http://www.nbm.org/Exhibits/past/2000_1996/Stay_Cool!</a>.html<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFundamentalist Unschooling?<br/>\n<br/>\n&quot;....people assume unschoolers are not going to be bound by some sort of <br/>\ndogma or fundamentalism.&quot;  <br/>\n<br/>\nUnschooling is &quot;something&quot; though - it isn&#39;t &quot;anything goes.&quot; It does <br/>\ncomprise beliefs about how people learn and it is a philosophy of education. <br/>\n<br/>\nUnschoolers are not bound by any dogma - there is no authority who lays it <br/>\nout, not even John Holt really did that - his thought was always a work in <br/>\nprogress, his ideas and insights were always developing. <br/>\n<br/>\nBut, there is something to the idea of &quot;fundamental&quot; that strikes me as <br/>\nimportant. I realize that &quot;fundamentalism&quot; was probably meant as an insult, <br/>\nbut getting people to look at what is really &quot;fundamental&quot; does seem to me to <br/>\nbe very appropriate unschooling advice. <br/>\n<br/>\nSomething is fundamental when it is one of the basic constituents without <br/>\nwhich a thing or system would not be what it is. So, for example, we could <br/>\nprobably all agree that it is fundamental to unschooling that a parent gives <br/>\nup preplanning a systematic progressive curriculum of study for their child. <br/>\nLots of what people ask about or seem to be confused or disagree about does <br/>\nhave to do with what is fundamental to unschooling.<br/>\n<br/>\nPam Sorooshian in a discussion on the HEM-Unschooling email list<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/HEM-Unschooling/\">http://groups.yahoo.com/group/HEM-Unschooling/</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUnschool Friendly Conferences<br/>\n<br/>\nFeeling like a fish out of water after attending a large curriculum oriented <br/>\nhomeschool convention?  The following conferences have unschooling presenters <br/>\nand participants, some including many regular posters at the unschooling.com <br/>\nwebsite and email discussion list. <br/>\n<br/>\nTrusting the Children, Trusting Ourselves<br/>\nKeynote speakers - Jane Healy, Frank Smith<br/>\nAugust 16-18, 2002<br/>\nRadisson Hotel Sacramento, CA<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://conference.hsc.org/default.html\">http://conference.hsc.org/default.html</a><br/>\n<br/>\nDiversity in Education<br/>\nKEYNOTE SPEAKER - LINDA DOBSON<br/>\nSeptember 14, 2002<br/>\nIroquois Ridge High School, Oakville, Ontario<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ontariohomeschool.org/2002conferenceframeset.html\">http://www.ontariohomeschool.org/2002conferenceframeset.html</a><br/>\n<br/>\nTexas Family Learning Conference<br/>\nOctober 4 & 5, 2002<br/>\nSheraton Brookhollow in Houston, Texas<br/>\nKeynote Speakers - David Albert, Sandra Dodd<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.angelfire.com/tx/wlr/conference.html\">http://www.angelfire.com/tx/wlr/conference.html</a><br/>\n<br/>\nLive and Learn Unschool Conference<br/>\nOctober 11 - 13, 2002<br/>\nColumbia, SC<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.schoolsoutsupport.org/index.html\">http://www.schoolsoutsupport.org/index.html</a><br/>\n<br/>\nIf you have information on other unschooling friendly conferences please <br/>\nemail the editor at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a> <br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n________________________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nwww.resourcefulhomeschooler.com<br/>\n<br/>\nWhat do you call your family? Unschoolers...Interest-Based <br/>\nLearners...Life-Long Learners...Eclectic Homeschoolers...Learner-Led <br/>\nSchoolers...Relaxed Homeschoolers...Whatever you call yourselves, The <br/>\nResourceful Homeschooler carries great books, science materials and kits, <br/>\nlearning games, and the most interesting software. <br/>\nVisit us at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.resourcefulhomeschooler.com\">http://www.resourcefulhomeschooler.com</a><br/>\nMaterials to involve, inspire and support independent learners of all ages!<br/>\n________________________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\nIn the July/August issue of Home Education Magazine, you&#39;ll enjoy articles on <br/>\nlearning to write without school, German, single-parent homeschooling, a <br/>\nfamily learning center and more. Columns include: Peter Kowalke wonders if <br/>\ncollege and homeschool fit; Linda Dobson celebrates independence; Laura <br/>\nWeldon offers advice on animal husbandry and science; Ann Zeise stays <br/>\non-topic in email conversations; and Barbara Theisen goes to infinity and <br/>\nbeyond. Other columnists include Larry and Susan Kaseman, Sandra Dodd, Becky <br/>\nRupp, David Albert and Carol Narigon. HEM also offers a special essay by <br/>\npublisher Helen Hegener, classified ads, letters and discussion, pen pals and <br/>\nnetworking, and more.<br/>\n<br/>\nSubscriptions to Home Education Magazine are currently $26 (regularly $32.00) <br/>\nfor one year/6 issues; $48 (regularly $64) for 2 years; single issue $6.50. <br/>\nHome Education Magazine, PO Box 1083, Tonasket WA <br/>\n98855; for orders: toll-free 1-800-236-3278; email <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a>. MC/Visa cards accepted.<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFinal Thought<br/>\n<br/>\n&quot;How did it come to pass that I was the one to develop the theory of <br/>\nrelativity? The reason, I think, is that a normal adult never stops to think <br/>\nabout problems of space and time. These are things which he has thought of as <br/>\na child. But my intellectual development was retarded, as a result of which I <br/>\nbegan to wonder about space and time only when I had already grown up. <br/>\nNaturally I could go deeper into the problem than a child with normal <br/>\nabilities.&quot;<br/>\n<br/>\nAlbert Einstein<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThanks for reading the Unschooling.com newsletter! Feel free to forward this <br/>\nnewsletter to all your friends, your local support group, and your <br/>\nmother-in-law!<br/>\n<br/>\nTo subscribe, visit our web site at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> or send an <br/>\nemail to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words subscribe <br/>\nunschooling-newsletter followed by your name@your address.com in the body of <br/>\nthe email. (e.g. subscribe unschooling-newsletter youremailaddress). <br/>\n<br/>\nTo unsubscribe, send an email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words <br/>\nunsubscribe unschooling-newsletter followed by your <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:name@...\">name@...</a> in <br/>\nthe body of the email. (e.g. unsubscribe unschooling-newsletter <br/>\nyouremailaddress). <br/>\n<br/>\nTo change the address at which you receive the newsletter, unsubscribe your <br/>\nold address and then subscribe with your new one.<br/>\n<br/>\nThe next edition of this newsletter will be distributed on August 18th. See <br/>\nyou then!<br/>\n<br/>\nDeborah A Cunefare, Newsletter Editor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\nwww.unschooling.com<br/>\n<br/>\nUnschooling.com is a service of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":39200,"nextTopicId":39205}}