{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":39,"messages":[{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Walk to the store","postDate":"1312800672","msgId":62252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxb2YzMCtnazM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxbnVlaCtuam9tQGVHcm91cHMuY29tPg=="},"prevInTopic":62251,"nextInTopic":62253,"prevInTime":62251,"nextInTime":62253,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... Learn to adapt life to your children s rhythms, as much as possible. We travel a lot and when Noor was younger, this is how things played out at our house","messageBody":"<div id=\"ygrps-yiv-647798098\">-----we have been away from home for two big trips this summer for family reunions; and since returning from the second one, my kids have not wanted to go out for anything, ....---<br/>\n<br/>\nLearn to adapt life to your children&#39;s rhythms, as much as possible. <br/>\n<br/>\nWe travel a lot and when Noor was younger, this is how things played out at our house too.  I finally realized that I needed to plan on a few weeks of quiet time at home (now it is a few days) after our return.  Knowing/expecting that downtime was really helpful for me and for Noor because I&#39;d set things up to work that way, as much as was possible.<br/>\n<br/>\n<br/>\n----.......other than a trip to the lake.  Which actually just made me realize I could try suggesting we go shopping after an outing at the lake.-------<br/>\n<br/>\nWhy not just stop at the store on the way home from the lake? Some kids really need to know all the plans ahead of time, but not all are like that.  If yours are, you could let them know that you&#39;re going to the lake and then to the store, where they can get ice cream, or whatever.  But don&#39;t &quot;suggest.&quot;  It sounds like you&#39;re putting too much pressure on them that way, like there is too much invested in their response. And if there is a history of store=stress, I&#39;d maybe forego the build up, especially if they enjoy shopping once they are there.<br/>\n<br/>\n------- mostly I would say something like &quot;Let&#39;s walk down to BTC and get some more fruit&quot; or &quot;we&#39;re going walk to the store today, do you want to push your doll strollers or ride in the wagon?&quot;  or some variation of fun choices.  But they haven&#39;t wanted to take me up on it once.  Just offering the choices now leads to meltdowns; the exception being when Daddy is home and they have the choice to come along or stay home. ---------<br/>\n<br/>\nStaying home with dad is a *real* choice, though! Choosing to push the stroller or the wagon isn&#39;t the same kind of choice because they are still having to go to the store.  I read a lot of suggestions to parents about letting kids make choices: green or pink cup? What if the child isn&#39;t thirsty?  Pink or green shirt? What if the child wants to be naked?  It is great to offer as many choices as your children are comfortable with, but be honest with yourself about the offerings.  A shirt is still a shirt, no matter the color. <br/>\n<br/>\nI&#39;m not saying that you&#39;re doing this, but I think parents often offer the kinds of choices I described above and think that they&#39;re doing a great job of letting their kids feel powerful and make decisions.  It is nice to get to decide which shirt you want to wear, but it isn&#39;t the same as deciding if you want to get dressed or not.<br/>\n <br/>\n------ If they don&#39;t want to come along and I decide we are going anyway, there is usually a great deal of struggle in getting them dressed and out the door, with lots of tears and running away from me, attempts to take off clothes and pull-ups, etc. -------<br/>\n<br/>\nSomething to consider is that there is likely a rhythm to your children&#39;s day.  For us, leaving the house first thing in the morning worked better than other times during the day, because I didn&#39;t have to interrupt Noor once she was engaged in something else.  I&#39;d pack food and clothing and we&#39;d leave almost as soon as she woke up. She&#39;d eat and change in the car.<br/>\n<br/>\nMornings may not be the best time for your kids, but maybe after nap? Or after lunch? Or what about everyone going out in the evening, together, after Benjamin gets home?<br/>\n<br/>\n----- Last week I asked a neighbor to stay with my daughter and just took my son shopping.  That worked well.  And I have gone early in the morning or while they are napping at times when my husband is home. ------<br/>\n<br/>\nYup, that&#39;s being flexible! And that&#39;s one of the keys to keeping your own cup full while meeting your children&#39;s needs.  Brainstorm.  There are almost always more than two ways of doing something!<br/>\n<br/>\n----- It seems like if I back off for awhile then maybe I can try again later and they won&#39;t be gearing up for a struggle automatically.-------<br/>\n<br/>\nBacking off when something isn&#39;t working, or is stressful is a great idea. Let happy peaceful feelings return and then try again, maybe with a new perspective.<br/>\n<br/>\n<br/>\n------Something I have been struggling with is how to respond to them not wanting to go somewhere so vehemently when it is something we have an obligation to do.------<br/>\n<br/>\nA few thoughts: it can be helpful to examine what you consider an &quot;obligation.&quot; (like you did w/story time). It probably goes without saying that your first obligation is to your family. Everything else is second to that. So, if your first obligation is to providing a peaceful home to your children, that comes before meeting friends for story time.  It may be helpful to let the people closest to you know that you guys are a bit sketchy right now. Let folks know that you may show up, and you may not.  It&#39;s okay, your kids have years and years ahead of them to learn about and practice commitments. Right now, at their ages, it isn&#39;t fair to expect them to put others before themselves.<br/>\n<br/>\nThe other thing to consider is that sometimes, kids will struggle.  Sometimes, there will be meltdowns.  It is all part and parcel of life. Sometimes you will need to leave the house and they won&#39;t want to go. Try to keep these occurrences to a minimum and also practice ways to stay calm and loving even when things aren&#39;t going smoothly.  Breath.  See you children as the babies they still are.  Know that their stress is real; it isn&#39;t just an act to inconvenience you.<br/>\n<br/>\n<br/>\n--------If my daughter is watching Blue&#39;s Clues and I tell her two more episodes and then we are leaving, she will say ok; and then when they are over she will scream she doesn&#39;t want to go.-----------<br/>\n<br/>\nYup, pretty common for a two or three year old, and even for an older child.  Kids don&#39;t have a real sense of time so it isn&#39;t fair to expect her to keep a promise or a commitment for what will happen later, even 20 minutes from now.  If she is engrossed in something, a transition to something in the future that she&#39;s not sure of is going to oftentimes be a difficult leap of faith.<br/>\n<br/>\n*You* know that she&#39;ll have fun when she gets where you&#39;re going, but she&#39;s stuck in the RightNow of focused pleasure.  Try to see how scary/difficult leaving Joy NOW for some unknown can be.<br/>\n<br/>\n--------I know she is probably just agreeing to get me to leave her alone and doesn&#39;t really intend to leave.--------<br/>\n<br/>\nI don&#39;t think that she is being deliberately malicious or deceitful.  She may well be saying &quot;okay&quot; to get you to leave her alone, but again, she&#39;s too young yet to really understand the passage of time. Assume positive intent!  She&#39;s agreeable because she is still doing what she&#39;s engaged with, and she hasn&#39;t had to stop yet! Once you bring that activity to an end, she&#39;s not sure the next thing will be as fun, so she resists.<br/>\n<br/>\nIf stopping movies is a big hurdle in not wanting to leave the house, you may want to consider getting a portable DVD player, or an iPod, or iPad or other traveling device so they can take the movie with them.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":330565882,"authorName":"LydiaK","from":"&quot;LydiaK&quot; &lt;princessjasmine05@...&gt;","profile":"lidjalynne05","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Walk to the store","postDate":"1312783633","msgId":62251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxbnVlaCtuam9tQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxanU4ZytzOWE0QGVHcm91cHMuY29tPg=="},"prevInTopic":62250,"nextInTopic":62252,"prevInTime":62250,"nextInTime":62252,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... I am the mom in the OP, Benjamin is my husband.  :)  I think what has happened in our situation is that we have been away from home for two big trips this","messageBody":"<div id=\"ygrps-yiv-1123495964\"><blockquote><span title=\"ireply\">&gt; I&#39;m sure it also depends a lot on the child/children.  If their mother hasn&#39;t found enough ways to make it fun yet, then brainstorming fun ideas could really help.  But there are some kids (like my son) who would be really distraught if they were expected to go out grocery shopping every day, no matter how entertaining the adults made it.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I am the mom in the OP, Benjamin is my husband.  :)  I think what has happened in our situation is that we have been away from home for two big trips this summer for family reunions; and since returning from the second one, my kids have not wanted to go out for anything, other than a trip to the lake.  Which actually just made me realize I could try suggesting we go shopping after an outing at the lake.  <br/>\n<br/>\nBefore the big trips, we did go out a lot.  We weren&#39;t ever going to the store everyday, but we had been walking to the grocery store at least once or twice a week and going to story time at the library once a week, which both kids loved.  Up until the past couple of weeks, I had been mentioning going to the store everyday, and when they didn&#39;t want to go we didn&#39;t go, so I would ask the next day.  Sometimes I asked, but mostly I would say something like &quot;Let&#39;s walk down to BTC and get some more fruit&quot; or &quot;we&#39;re going walk to the store today, do you want to push your doll strollers or ride in the wagon?&quot;  or some variation of fun choices.  But they haven&#39;t wanted to take me up on it once.  Just offering the choices now leads to meltdowns; the exception being when Daddy is home and they have the choice to come along or stay home.  <br/>\n<br/>\nI think they have missed their toys and being in their own space, and they are still in that place of wanting to be home and doing whatever they are doing.  I have come up with lots of creative ideas to make the trip fun, but they haven&#39;t been interested.  If they don&#39;t want to come along and I decide we are going anyway, there is usually a great deal of struggle in getting them dressed and out the door, with lots of tears and running away from me, attempts to take off clothes and pull-ups, etc.  <br/>\n<br/>\nLately I have been putting off going to the store as long as possible.  I decided to stop asking them or telling them we were going out, but I hadn&#39;t come up with a new idea.  Just in the past couple of weeks I realized my husband was getting frustrated with being asked to pick things up so often.  So now I am working on making an exhaustive grocery list/checklist and strategizing how I can do the shopping without needing him to pick things up multiple times a week.  Last week I asked a neighbor to stay with my daughter and just took my son shopping.  That worked well.  And I have gone early in the morning or while they are napping at times when my husband is home.  <br/>\n<br/>\nI think part of our problem is also that I like going out and doing things.  Walking down to the store is a brief social interaction and a bit of exercise for me, and I wasn&#39;t willing to accept that the kids weren&#39;t into it.  I made too many suggestions to go out and caused a lot of daily stress and frustration.  Now no matter how enticing my fun ideas are or how well they worked in the past, they balk at any mention of going to the store (or most anywhere).  So I am trying to back off and find new ways to make sure we are getting what we need without needing to bring them along every time.  It seems like if I back off for awhile then maybe I can try again later and they won&#39;t be gearing up for a struggle automatically.<br/>\n<br/>\nSomething I have been struggling with is how to respond to them not wanting to go somewhere so vehemently when it is something we have an obligation to do.  Sandra said something about them being too young to stay home alone and so shouldn&#39;t be given the option of keeping adults from doing errands.  I understand this in theory, but in the moment when it is time to go and they are fighting me to stay home, I am unsure how to react. It&#39;s especially difficult for me to stay peaceful and present if I have decided we are going despite their preference to stay home, and sometimes I choose to stay home to avoid the conflict.  If my daughter is watching Blue&#39;s Clues and I tell her two more episodes and then we are leaving, she will say ok; and then when they are over she will scream she doesn&#39;t want to go and even tell me she is getting to be a big girl and can stay home by herself.  I know she is probably just agreeing to get me to leave her alone and doesn&#39;t really intend to leave.  Lots of times she has fun when we go somewhere and doesn&#39;t want to leave that place either, but it is rare right now for any of my efforts to ease transitions to really help her.  We haven&#39;t been to storytime at the library for over a month now, and I stopped making plans to go over to visit her friends&#39; house because she is so resistant to leaving home.  I have just been asking them to come visit us here at our house or meet at the lake to swim.  Storytime isn&#39;t an obligation; but if I make plans with her friends, whom she adores, I don&#39;t want to break off our plans because Nisa doesn&#39;t want to leave home.  Tomorrow we have a doctor&#39;s appointment which I am pretty sure they are not going to want to go to.  So I am not looking forward to that.  If we have errands to run that can&#39;t be put off any longer without causing problems for all of us, and they don&#39;t want to go along, should I just calmly and as gently as possible prepare them to go, even while they are fighting me?    <br/>\n<br/>\nThanks for all the feedback so far, it has been very helpful to us and probably many others as well.<br/>\n<br/>\nLydia Koltai</div>","specialLinks":[]},{"userId":325777836,"authorName":"VanessaL","from":"&quot;VanessaL&quot; &lt;fancyness07@...&gt;","profile":"fancyness07","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Walk to the store","postDate":"1312773980","msgId":62250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxbmwwcytwZG44QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJENEUyNDBDLTlGMjktNDBCNy04QjZCLTQyRjlDM0VFNjY2RkB2ZXJpem9uLm5ldD4="},"prevInTopic":62245,"nextInTopic":62251,"prevInTime":62249,"nextInTime":62251,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"Could be off topic but I hope this post is okay. Thank you Joyce (and Schuyler) for this post. I d love for this part of the topic to keep going. This is","messageBody":"<div id=\"ygrps-yiv-860137061\">Could be off topic but I hope this post is okay.<br/>\n<br/>\nThank you Joyce (and Schuyler) for this post. I&#39;d love for this part of the topic to keep going. This is something I&#39;ve been wanting to ask questions about for awhile but just wasn&#39;t sure how to word it and after a few months since I&#39;ve joined it showed up! Multiple times actually, but in a really clear way today. In fact many questions I have had get answered the longer I stick around and lurk :)<br/>\n<br/>\nMy personal struggle was/is feeling like my own cup is low and not knowing how to replenish it. I feel like there are many messages out there are about recharging but away from your children. This just hasn&#39;t been an option for me. I suppose I could have physically left the house but it just went against my own instincts. It caused me more stress and I believe my kids stress too.  My kids are 3 1/2 and 16 months and every portion of most days was just too important to step away from. Even a trip to the store sometimes has me bringing both kids along even with dad home because they haven&#39;t been anywhere for a couple days and they need a change in scenery too!(We are a one car family for now) They really need me. A lot. I&#39;m sick of reading all those articles floating around encouraging moms to head out alone for a mani pedi. I see my children growing up sooo fast. It felt so bitter sweet to have such amazing kids that require so much of my own energy. It&#39;s been hard to find a balance and I have felt an urgency to figure out how to appreciate them fully, before they grow up! So it&#39;s surprised me that it really is as simple as changing a perspective, re framing a thought. I&#39;m still working on it but in the last month things have changed dramatically for me. Anger that was creeping in because the baby was so tired but not sleeping has been replaced with quality time snuggling and squishing my baby&#39;s soft feet. Examining his curls, enjoying his babbles. Connecting with him. Nothing else is different. Same routine, same lullabies on the cd player. Just my entire outlook on bed time. And like Schuyler mentioned, it fills you up!<br/>\n<br/>\nThis single line Schuyler wrote really spelled a key part out for me:<br/>\n<br/>\n&quot; And it took a real recognition that when I got &quot;my time&quot; it didn&#39;t satiate my needs, it didn&#39;t even begin to meet them.&quot;<br/>\n<br/>\nAnd this made me cry because it recently happened to me:<br/>\n<br/>\n&quot;We were playing a game on the floor and I just sat and watched and listened and my cup ran over.&quot;<br/>\n<br/>\nSo I guess I still haven&#39;t asked a question but thank you for sharing an alternative for how to get your needs met without resorting to &quot;putting my needs ahead&quot; and martyrdom. I wanted to add to the discussion that sometimes getting mom&#39;s needs met isn&#39;t as simple as saying &quot;I&#39;m going out and doing something alone.&quot; Or even getting time alone at home. Especially with young kids. At least it wasn&#39;t for me. Now I&#39;m doing yoga once a week at night but even two months ago leaving dad to do bedtime just wasn&#39;t an option. Not because he wouldn&#39;t. Not because the kids can&#39;t handle it. Sure they would all have survived with me gone but it just wasn&#39;t the right time then. And it&#39;s been worth the wait.<br/>\n<br/>\n And I couldn&#39;t help but write in how touched I am by things people here write. Even when I feel defensive or attacked or initially disagree while reading things. In fact I have found things that catch me off guard especially thought provoking. Thank you. <br/>\n<br/>\nVanessa<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On Aug 6, 2011, at 8:37 AM, Lisa wrote:<br/>\n&gt; <br/>\n&gt; &gt; I&#39;ve found a place where I am comfortable putting my needs ahead of  <br/>\n&gt; &gt; my children&#39;s wants, if that is necessary.<br/>\n&gt; <br/>\n&gt; &quot;Necessary&quot; is where many people get their thinking stuck, though.  <br/>\n&gt; They get stuck on what&#39;s &quot;usually done&quot; as being necessary. They get  <br/>\n&gt; stuck on the obvious solution (that&#39;s usually done) being the only  <br/>\n&gt; solution. And then see their kids as the problem when their kids say no.<br/>\n&gt; <br/>\n&gt; &gt; Needs, after all, are essential for survival.<br/>\n&gt; <br/>\n&gt; Yes, but it helps more peaceful relations not to separate needs and  <br/>\n&gt; wants. To kids their wants and needs are much the same. They will grow  <br/>\n&gt; into having more of a spectrum. They will face times when one person&#39;s  <br/>\n&gt; need/want is way more important than another person&#39;s. But it&#39;s not  <br/>\n&gt; something that they need taught.<br/>\n&gt; <br/>\n&gt; &gt; Parents, especially those who are with their children most of the  <br/>\n&gt; &gt; day, can easily become deprived of their needs<br/>\n&gt; <br/>\n&gt; Who&#39;s depriving the mom?<br/>\n&gt; <br/>\n&gt; The moms choose to set aside their wants and needs.<br/>\n&gt; <br/>\n&gt; Much better for everyone&#39;s peace to see everyone&#39;s needs as important.  <br/>\n&gt; The big difference between mom&#39;s needs and the kids&#39; needs is that the  <br/>\n&gt; mom has the power to adjust the day&#39;s schedule to take everyone and  <br/>\n&gt; their needs into account. She has the power to arrange things so one  <br/>\n&gt; person doesn&#39;t feel like their needs are secondary to another&#39;s.<br/>\n&gt; <br/>\n&gt; In many cases, mom will be putting her needs at a lower priority  <br/>\n&gt; because she has more experience with delaying gratification and more  <br/>\n&gt; experience with the world and in coming up with ways to meet her  <br/>\n&gt; needs. Her kids don&#39;t have her experience or her power.<br/>\n&gt; <br/>\n&gt; &gt; Going to the park, having food to eat, and even having time to  <br/>\n&gt; &gt; oneself are needs that should be met, even if it is inconvenient for  <br/>\n&gt; &gt; the children.<br/>\n&gt; <br/>\n&gt; Going to the park, having time to oneself is essential to life?<br/>\n&gt; <br/>\n&gt; I like what several unschoolers -- Schuyler I remember in particular  <br/>\n&gt; -- have said about finding fulfillment in their kids rather than  <br/>\n&gt; looking outward for replenishment. There was a good thread -- or piece  <br/>\n&gt; of one renamed &quot;putting mom&#39;s needs last&quot;:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/message/45909\">http://groups.yahoo.com/group/unschoolingbasics/message/45909</a><br/>\n&gt; <br/>\n&gt; Here&#39;s a piece of it:<br/>\n&gt; ====<br/>\n&gt; Schuyler: &quot;I don&#39;t know what did it, but I can almost pinpoint the  <br/>\n&gt; minute when I turned<br/>\n&gt; from feeling a need to have my own needs met in a separate but equal  <br/>\n&gt; kind of way<br/>\n&gt; to seeing how being with Simon and Linnaea was meeting my needs in the  <br/>\n&gt; most<br/>\n&gt; involved and deep way. We were playing a game on the floor and I just  <br/>\n&gt; sat and<br/>\n&gt; watched and listened and my cup ran over. Before then, there were  <br/>\n&gt; moments, there<br/>\n&gt; were flitting bits of fulfilment, but somehow, in that moment all  <br/>\n&gt; those moments<br/>\n&gt; cumulated and showed me, viscerally, the way to meet my own needs by  <br/>\n&gt; meeting<br/>\n&gt; theirs.<br/>\n&gt; <br/>\n&gt; &quot;Does that sound like martyrdom? Maybe. What did it take? It took  <br/>\n&gt; being in Toys R<br/>\n&gt; Us one day and getting really hungry and getting really unhappy and  <br/>\n&gt; recognising<br/>\n&gt; that the two things were linked. It took making sure that I wasn&#39;t  <br/>\n&gt; hungry. It<br/>\n&gt; took smelling their heads when I was making lists of things that  <br/>\n&gt; needed to be<br/>\n&gt; done away from them, a sort of biofeedback that pulled me back into  <br/>\n&gt; them and<br/>\n&gt; turned my head from the chores that I was lining up to go and do. It  <br/>\n&gt; took a<br/>\n&gt; growing awareness that they were at least as engaging and interesting  <br/>\n&gt; as the<br/>\n&gt; things I was thinking of doing or that I was thinking would fill me  <br/>\n&gt; up. And it<br/>\n&gt; took a real recognition that when I got &quot;my time&quot; it didn&#39;t satiate my  <br/>\n&gt; needs, it<br/>\n&gt; didn&#39;t even begin to meet them.<br/>\n&gt; <br/>\n&gt; &quot;For me, it was very clearly incremental, it was a step by step  <br/>\n&gt; building from<br/>\n&gt; small changes to a point where I was in a position to find personal  <br/>\n&gt; fulfilment<br/>\n&gt; in being with my children. It wasn&#39;t martyrdom, or it didn&#39;t feel as  <br/>\n&gt; though I&#39;d<br/>\n&gt; sacrificed myself for their joy. It did help to get the almost kinetic  <br/>\n&gt; memory of<br/>\n&gt; being kind to them, of meeting them where they were instead of  <br/>\n&gt; expecting them to<br/>\n&gt; meet me where I was. &quot;<br/>\n&gt; ====<br/>\n&gt; <br/>\n&gt; &gt; even if it is inconvenient for the children.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; The more *people* feel inconvenienced by someone else meeting their  <br/>\n&gt; needs, the less connected they feel, the less willing they are to  <br/>\n&gt; choose to set aside their needs for the other.<br/>\n&gt; <br/>\n&gt; We as adults have the power to show kids how to respect others needs  <br/>\n&gt; while meeting our own needs. We can ask them if they wouldn&#39;t mind if  <br/>\n&gt; we stopped and did such and such. We can appreciate that we&#39;re using  <br/>\n&gt; their time to run our errands and treat that time with respect by  <br/>\n&gt; giving them something in return. As we would do to anyone whose  <br/>\n&gt; relationship we cared about.<br/>\n&gt; <br/>\n&gt; &gt; In the book, &quot;The Continuum Concept&quot;, I gained appreciation for the  <br/>\n&gt; &gt; idea that children should be the satellites of their parents, that  <br/>\n&gt; &gt; they should learn to fit into the rhythm of their parents&#39; lives,  <br/>\n&gt; &gt; learn from it, and as a result, they naturally become considerate  <br/>\n&gt; &gt; and functional members of their community.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &quot;Should&quot; for what goal, though?<br/>\n&gt; <br/>\n&gt; If I&#39;m not mistaken, those kids would pretty much doing what their  <br/>\n&gt; parents were doing when they grew up. And what their parents were  <br/>\n&gt; doing was spending a good portion of their waking hours doing what  <br/>\n&gt; they needed to stay alive. Much of what they did was directed at what  <br/>\n&gt; is &quot;essential to life&quot;.<br/>\n&gt; <br/>\n&gt; What I did throughout the day when my daughter was with me were often  <br/>\n&gt; useful life skills, but they didn&#39;t take that much exposure to learn.  <br/>\n&gt; Being my satellite would have been boring for Kat! ;-)<br/>\n&gt; <br/>\n&gt; Closer for unschooling would would be some combination of partner,  <br/>\n&gt; cruise director, mentor.<br/>\n&gt; <br/>\n&gt; &gt; I also realized that children learn from their parents how to treat  <br/>\n&gt; &gt; themselves and others. If children always get exactly what they want  <br/>\n&gt; &gt; at the expense of others, what will they learn? If children watch  <br/>\n&gt; &gt; their parents neglecting their desires or needs, what will they  <br/>\n&gt; &gt; learn? I thought they might learn to not value their own needs, and  <br/>\n&gt; &gt; I didn&#39;t want that for them.<br/>\n&gt; <br/>\n&gt; They learn the most from how they&#39;re treated.<br/>\n&gt; <br/>\n&gt; They also learn from how mom takes others into account when coming up  <br/>\n&gt; with ways to meet the child&#39;s needs and wants.<br/>\n&gt; <br/>\n&gt; They also learn from how mom takes them into account when coming up  <br/>\n&gt; with ways to meet her own needs.<br/>\n&gt; <br/>\n&gt; They also learn from how we treat others who are interacting with the  <br/>\n&gt; child. (For instance when we say &quot;Thank you,&quot; for something given to  <br/>\n&gt; the child.)<br/>\n&gt; <br/>\n&gt; They also learn from how they&#39;re drawn into treating others. (I&#39;m  <br/>\n&gt; thinking of things like &quot;Let&#39;s get Dad some of that double fudge ice  <br/>\n&gt; cream he loves for dessert tonight.&quot; and &quot;It&#39;s Sonata&#39;s birthday next  <br/>\n&gt; week. What would make her day extra special?&quot;<br/>\n&gt; <br/>\n&gt; They learn somewhat from how we treat others who aren&#39;t interacting  <br/>\n&gt; with the child. Those interactions get absorbed into the child&#39;s  <br/>\n&gt; unconscious growing awareness of how the world works. But that kind of  <br/>\n&gt; learning is slow since the child isn&#39;t directly connected to the  <br/>\n&gt; situation, doesn&#39;t really know the whats and why things are being done  <br/>\n&gt; such and such a way.<br/>\n&gt; <br/>\n&gt; &gt; If children always get exactly what they want at the expense of  <br/>\n&gt; &gt; others, what will they learn?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; How would that be possible?<br/>\n&gt; <br/>\n&gt; And has anyone suggested anyone should try? (The &quot;realized&quot; part  <br/>\n&gt; implies that idea is out there being promoted.)<br/>\n&gt; <br/>\n&gt; And how would kids know their wants were being granted at the expense  <br/>\n&gt; of others? Unless someone complains and mom shrugs off the complaints,  <br/>\n&gt; the child isn&#39;t likely to be aware of others&#39; needs.<br/>\n&gt; <br/>\n&gt; &gt;  If children watch their parents neglecting their desires or needs,  <br/>\n&gt; &gt; what will they learn?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; It&#39;s really hard to see someone neglecting their desires and needs  <br/>\n&gt; because we can&#39;t see what they really want. It looks like people  <br/>\n&gt; making the choices they want to.<br/>\n&gt; <br/>\n&gt; That&#39;s important for parents to realize. Every time you set aside what  <br/>\n&gt; you really want, it looks to others like you&#39;re choosing what you  <br/>\n&gt; want! You get no brownie points from your kids for always putting  <br/>\n&gt; aside your wants and needs for others.<br/>\n&gt; <br/>\n&gt; I can remember feeling clearly that my parents were always doing what  <br/>\n&gt; they wanted to. Whether it was going to the grocery store or to work  <br/>\n&gt; or to play bridge or to mow the lawn or play golf. *They* didn&#39;t see  <br/>\n&gt; it that way, I&#39;m guessing. I&#39;m sure it felt like setting their lives  <br/>\n&gt; aside for what they &quot;had to&quot; do and occasionally &quot;getting&quot; to do what  <br/>\n&gt; they enjoyed. But what uber-parent was making them make those choices?<br/>\n&gt; <br/>\n&gt; What *does* often happen with people who always put their needs second  <br/>\n&gt; is that others lose respect for them. It&#39;s hard to respect someone who  <br/>\n&gt; obviously has no respect for themselves.<br/>\n&gt; <br/>\n&gt; I&#39;m guessing most people have known mothers (especially) who grow  <br/>\n&gt; bitter because their kids never appreciate all the stuff they do and  <br/>\n&gt; did for them :-/<br/>\n&gt; <br/>\n&gt; &gt; So I&#39;ve become comfortable with giving my children as much freedom  <br/>\n&gt; &gt; as possible without sacrificing the family&#39;s or my own needs<br/>\n&gt; <br/>\n&gt; Thinking in terms of sacrifice isn&#39;t a good mental place to unschool  <br/>\n&gt; from.<br/>\n&gt; <br/>\n&gt; Treating everyone&#39;s needs as important and finding ways to meet those  <br/>\n&gt; needs will help unschooling.<br/>\n&gt; <br/>\n&gt; &gt; If I need to go somewhere, they might gripe--but the come out of  <br/>\n&gt; &gt; respect for me and it works out just fine.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; If your husband had a need and his way of meeting it made you gripe,  <br/>\n&gt; would it work out just fine and improve your relationship if he  <br/>\n&gt; ignored what was bothering you?<br/>\n&gt; <br/>\n&gt; How does treating others with disrespect to meet your needs make life  <br/>\n&gt; more joyful for others or improve relationships?<br/>\n&gt; <br/>\n&gt; What it models for kids is ignoring other people&#39;s needs for your own.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312762230","msgId":62245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTI3NjIyMzAuMjk2NzYuWWFob29NYWlsTmVvQHdlYjExMDQxMi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PEI2MUMyMTY0LTZCMkUtNEU0RC1CRTQ4LTYzNjlEMDEwODdFQ0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDJENEUyNDBDLTlGMjktNDBCNy04QjZCLTQyRjlDM0VFNjY2RkB2ZXJpem9uLm5ldD4gPGoxbThnOCtqbWdoQGVHcm91cHMuY29tPiA8MTMxMjc1MjUwMS43NzY4Mi5ZYWhvb01haWxOZW9Ad2ViMTEwNDA3Lm1haWwuZ3ExLnlhaG9vLmNvbT4gPDEzOENGQTgyLUFFQUItNEI5NS1CQTg0LTVCRDY3N0NBNDNDOEBTYW5kcmFkb2RkLmNvbT4gPDEzMTI3NTQ4NDQuNDAwMDcuWWFob29NYWlsTmVvQHdlYjExMDQxMC5tYWlsLmdxMS55YWhvby5jb20+IDxCNjFDMjE2NC02QjJFLTRFNEQtQkU0OC02MzY5RDAxMDg3RUNAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":62244,"nextInTopic":62250,"prevInTime":62244,"nextInTime":62246,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"***I ve seen what you describe in other families, too, but I was hoping you would rephrase the quoted line. Did you mean against or not take ? *** Oh!","messageBody":"<div id=\"ygrps-yiv-1695464621\">***I&#39;ve seen what you describe in other families, too, but I was hoping you would rephrase the quoted line. Did you mean &quot;against&quot; or &quot;not take&quot;? ***<br/>\n<br/>\n<br/>\nOh!  Right!  I totally didn&#39;t see that!  Thanks!  I was cautioning others to NOT do family meetings!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312761039","msgId":62244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2MUMyMTY0LTZCMkUtNEU0RC1CRTQ4LTYzNjlEMDEwODdFQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTI3NTQ4NDQuNDAwMDcuWWFob29NYWlsTmVvQHdlYjExMDQxMC5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDJENEUyNDBDLTlGMjktNDBCNy04QjZCLTQyRjlDM0VFNjY2RkB2ZXJpem9uLm5ldD4gPGoxbThnOCtqbWdoQGVHcm91cHMuY29tPiA8MTMxMjc1MjUwMS43NzY4Mi5ZYWhvb01haWxOZW9Ad2ViMTEwNDA3Lm1haWwuZ3ExLnlhaG9vLmNvbT4gPDEzOENGQTgyLUFFQUItNEI5NS1CQTg0LTVCRDY3N0NBNDNDOEBTYW5kcmFkb2RkLmNvbT4gPDEzMTI3NTQ4NDQuNDAwMDcuWWFob29NYWlsTmVvQHdlYjExMDQxMC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":62243,"nextInTopic":62245,"prevInTime":62243,"nextInTime":62245,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"I ve seen what you describe in other families, too, but I was hoping you would rephrase the quoted line.  Did you mean against or not take ? ... -=- I m","messageBody":"<div id=\"ygrps-yiv-609107128\">I&#39;ve seen what you describe in other families, too, but I was hoping you would rephrase the quoted line.  Did you mean &quot;against&quot; or &quot;not take&quot;? <br/>\n<br/>\n-----------------------------<br/>\n-=- I&#39;m cautioning others to take the advice of family meetings.-=-<br/>\n<br/>\n***Clarify, please.***<br/>\n<br/>\nIf there is a chance that mom feels family meetings are great and the kids really really dislike them, then it seems like just one more way of not really getting, or seeing, or understanding the child&#39;s perspective.  I&#39;ve known several kids that will nod in agreement in situations like family meetings, just to get the mom to stop talking already and be done with the meeting.  Mom walks away happy, believing that all is well and that the kids are quite happy with the arrangement, but meanwhile the kids walk away glad to be rid of the meeting and mom&#39;s whim of the moment.<br/>\n<br/>\nI&#39;ve had plenty of informal talks to resolve issues with other family members, or to work out how to make something happen, but family meetings are often designed to make mom or dad feel good and accomplish little else.<br/>\n-----------------------------<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312754844","msgId":62243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTI3NTQ4NDQuNDAwMDcuWWFob29NYWlsTmVvQHdlYjExMDQxMC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDEzOENGQTgyLUFFQUItNEI5NS1CQTg0LTVCRDY3N0NBNDNDOEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDJENEUyNDBDLTlGMjktNDBCNy04QjZCLTQyRjlDM0VFNjY2RkB2ZXJpem9uLm5ldD4gPGoxbThnOCtqbWdoQGVHcm91cHMuY29tPiA8MTMxMjc1MjUwMS43NzY4Mi5ZYWhvb01haWxOZW9Ad2ViMTEwNDA3Lm1haWwuZ3ExLnlhaG9vLmNvbT4gPDEzOENGQTgyLUFFQUItNEI5NS1CQTg0LTVCRDY3N0NBNDNDOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62242,"nextInTopic":62244,"prevInTime":62242,"nextInTime":62244,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"-=- I m cautioning others to take the advice of family meetings.-=- ***Clarify, please.*** If there is a chance that mom feels family meetings are great and","messageBody":"<div id=\"ygrps-yiv-983922257\">-=- I&#39;m cautioning others to take the advice of family meetings.-=-<br/>\n<br/>\n***Clarify, please.***<br/>\n<br/>\n<br/>\nIf there is a chance that mom feels family meetings are great and the kids really really dislike them, then it seems like just one more way of not really getting, or seeing, or understanding the child&#39;s perspective.  I&#39;ve known several kids that will nod in agreement in situations like family meetings, just to get the mom to stop talking already and be done with the meeting.  Mom walks away happy, believing that all is well and that the kids are quite happy with the arrangement, but meanwhile the kids walk away glad to be rid of the meeting and mom&#39;s whim of the moment.<br/>\n<br/>\nI&#39;ve had plenty of informal talks to resolve issues with other family members, or to work out how to make something happen, but family meetings are often designed to make mom or dad feel good and accomplish little else.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312753877","msgId":62242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzOENGQTgyLUFFQUItNEI5NS1CQTg0LTVCRDY3N0NBNDNDOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTI3NTI1MDEuNzc2ODIuWWFob29NYWlsTmVvQHdlYjExMDQwNy5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDJENEUyNDBDLTlGMjktNDBCNy04QjZCLTQyRjlDM0VFNjY2RkB2ZXJpem9uLm5ldD4gPGoxbThnOCtqbWdoQGVHcm91cHMuY29tPiA8MTMxMjc1MjUwMS43NzY4Mi5ZYWhvb01haWxOZW9Ad2ViMTEwNDA3Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":62241,"nextInTopic":62243,"prevInTime":62241,"nextInTime":62243,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"-=- I m cautioning others to take the advice of family meetings.-=- Clarify, please. My experience with the downfall of family meetings is that they re often","messageBody":"<div id=\"ygrps-yiv-347359753\">-=- I&#39;m cautioning others to take the advice of family meetings.-=-<br/>\n<br/>\nClarify, please.<br/>\n<br/>\nMy experience with the downfall of family meetings is that they&#39;re often ways for mothers to obtain a &quot;democratic&quot; confirmation of the rules she wants to make.  That way she can spread the blame.<br/>\n<br/>\nIf a family isn&#39;t wanting to listen to kids on a daily basis, then a weekly meeting might be better than nothing.  If parents can go beyond weekly to paying attention to kids not just daily, but in the moment, family meetings will seem WAY to impersonal and contrived.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/moment\">http://sandradodd.com/moment</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners\">http://sandradodd.com/partners</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312752501","msgId":62241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTI3NTI1MDEuNzc2ODIuWWFob29NYWlsTmVvQHdlYjExMDQwNy5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGoxbThnOCtqbWdoQGVHcm91cHMuY29tPg==","referencesHeader":"PDJENEUyNDBDLTlGMjktNDBCNy04QjZCLTQyRjlDM0VFNjY2RkB2ZXJpem9uLm5ldD4gPGoxbThnOCtqbWdoQGVHcm91cHMuY29tPg=="},"prevInTopic":62240,"nextInTopic":62242,"prevInTime":62240,"nextInTime":62242,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"***We have family meetings each week to help achieve each persons needs and desires being met. Each person can say whatever they need to say, and it s heard","messageBody":"<div id=\"ygrps-yiv-664369965\">***We have family meetings each week to help achieve each persons&#39; needs and desires being met. Each person can say whatever they need to say, and it&#39;s heard and validated. Our family meetings have brought even more peace and community into our family.***<br/>\n<br/>\n<br/>\nMy experience with family meetings generally comes from the kid&#39;s perspective.  I have known a couple of moms who said exactly the same thing about family meetings as you just did.  I thought it was great until I overheard their kids in private completely downing the family meetings and dreading them, but not saying so as to not displease or disrupt the peace of mom.  Mom continued to go along with the family meetings thinking that all was well and that they were a great idea that brought cohesiveness to the family, but what it really did, was divide the family and create dissension.<br/>\n<br/>\nI&#39;m not saying that your family meetings do this.  I&#39;m cautioning others to take the advice of family meetings.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312752068","msgId":62240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTI3NTIwNjguNTMyODkuWWFob29NYWlsTmVvQHdlYjExMDQwMi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGoxbTdtdStvZjMyQGVHcm91cHMuY29tPg==","referencesHeader":"PDlFREE1NkE3LTk0QTYtNDI1Qy1CNEVCLUZBOEFDRURDQUZENkBTYW5kcmFkb2RkLmNvbT4gPGoxbTdtdStvZjMyQGVHcm91cHMuY29tPg=="},"prevInTopic":62235,"nextInTopic":62241,"prevInTime":62239,"nextInTime":62241,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"***In every area of belief systems, I ve noticed there is a tendency to become dogmatic and rigid. We can t believe so heavily in something that we lose our","messageBody":"<div id=\"ygrps-yiv-1644488598\">***In every area of belief systems, I&#39;ve noticed there is a tendency to become dogmatic and rigid. We can&#39;t believe so heavily in something that we lose our right to meet a family&#39;s basic needs and lose balance. Children should not dictate our lives; we should each respect and blend with each other.***<br/>\n<br/>\n<br/>\nIt is not a belief system to know that treating others with respect and kindness is better than not doing so.  Parents have all the say in a family.  That&#39;s a lot of power.  To use that power to control and manipulate kids into doing things they don&#39;t want to do, isn&#39;t respectful or kind.  Kids can and do, do things their parents want without controlling or manipulating them.<br/>\n<br/>\n***I think that letting kids always get exactly what they want is unrealistic and unachievable in most families.***<br/>\n<br/>\n<br/>\nThis is the biggest hangup in your own thinking.  If kids aren&#39;t getting what they want, it implies that someone else is.  It sets your family up to have parents on one side, getting what they want and kids on another side, not getting what they want.  It is that kind of thinking that causes families to not get unschooling working well.  If life is such that someone loses so that someone else wins, and you are a family unit, then you all lose.<br/>\n<br/>\n***I should clarify that when I tell my daughter that we will be going to the store today, she usually sighs a bit, then will cheerfully transition into a cheerful &quot;ok!&quot; We talk about how the trip will be quick and talk about what she wants to do when we return. It turns out just fine and she learned how compromise is a normal part of life.***<br/>\n<br/>\n<br/>\nSometimes my kids go along with something they don&#39;t want to do, for my benefit.  They don&#39;t sigh and transition, they do it because they love me and want to do something helpful to me.  Too much of the above and you might have kids that balk at any hint of suggestion from mom.  That eye rolling, omg, what does she want now?  <br/>\n<br/>\nWhen kids have no choice but to sigh and transition because mom wants a compromise, they don&#39;t grow up generously giving of themselves, back to you, simply because they are choosing to do so.  Kids who grow up compromising might weigh and measure every act of kindness, to see what and how it will benefit them.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Walk to the stores","postDate":"1312738831","msgId":62235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxbWltZitudGtrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxbTdtdStvZjMyQGVHcm91cHMuY29tPg=="},"prevInTopic":62234,"nextInTopic":62240,"prevInTime":62234,"nextInTime":62236,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... ******************* The idea that it s somehow possible for kids to Always get Exactly what they want (which was the original statement) is a fallacy.","messageBody":"<div id=\"ygrps-yiv-523599308\">&quot;Lisa&quot; &lt;lisa_landen@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that letting kids always get exactly what they want is unrealistic and unachievable in most families.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nThe idea that it&#39;s somehow possible for kids to Always get Exactly what they want (which was the original statement) is a fallacy. Happy, joyful days come to an end no matter how hard a child wishes they would go on. It rains on parades. It&#39;s not possible to fly to the moon on a silver spoon. Feet grow too big for favorite shoes and best loved toys get worn to the point of breaking. Children can never be immune to disappointment. That&#39;s no reason to Add to those disappointments when there are other options available. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  If I didn&#39;t get the groceries, there would be no food to eat.<br/>\n<br/>\n </span></blockquote>See more options than that - there are Lots more options than &quot;go to the grocery now&quot; and &quot;starve to death&quot;! There are gobs of ways to be more thoughtful, more creative, more proactive, more kind. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Life has to be a give and take...<br/>\n<br/>\n </span></blockquote>No, it doesn&#39;t. You can gain from giving, but it takes a shift in perception. It takes valuing giving and graciousness. It takes stepping away from the fear of being exploited and seeing how graciousness and care spread. If you&#39;re convinced your children will eat you alive if you give to much, you&#39;ll convince them too - and they may well live up to your expectations. But you don&#39;t have to set up that kind of dynamic. You can be generous out of a desire to be generous and see your children give back to you in their own, unique and precious ways. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I denied my own needs for the first 7 years of my experience as a parent<br/>\n </span></blockquote>****************<br/>\n<br/>\nI guessed that might be the case - there&#39;s a kind of gap in communication between mom&#39;s who&#39;ve gone off the deep end of martyrdom and come back to something more balanced and moms who have a good sense of their own needs and value from the start and learn to give from that place of security. It&#39;s good that you&#39;ve found a More balanced approach than martyrdom! But you&#39;re still describing things in very black-and-white terms. <br/>\n<br/>\nMy mother came back from martyrdom and used to say &quot;better a bitch than a doormat&quot; - but life isn&#39;t divided into bitches and doormats. It&#39;s not anything like that extreme. It&#39;s not just give and take.<br/>\n<br/>\nIt helps me to see that my principles apply to everyone - myself as well as my kids. I value kindness, so I&#39;m kind to myself And my kids. I value generosity, so I&#39;m generous to myself And the people I love. Some times its better to be kind to my kids first - its quicker, maybe, or it fills me up in some other way. Some times its better to <br/>\nfind a balance where everyone can feel good at once. Sometimes I *do* come first so that I don&#39;t fall totally to pieces (which wouldn&#39;t be good for anyone!). It&#39;s not all one way or all another, and there&#39;s no rule who comes first when. It&#39;s a process of thoughtful decision making in the moment. <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I should clarify that when I tell my daughter that we will be going to the store today, she usually sighs a bit, then will cheerfully transition into a cheerful &quot;ok!&quot;<br/>\n </span></blockquote>********************<br/>\n<br/>\nConsider your past and the fact that you&#39;ve modeled martyrdom for her. Perhaps she&#39;s learned how to be a good little martyr and set her needs aside and do it with a smile. After all, that&#39;s what women are supposed to do, right? <br/>\n<br/>\nStop at the sigh and see what she&#39;s doing, what&#39;s going on in her world, what&#39;s special and important to her. Look for other options. Maybe there&#39;s a better time for her. Maybe you can plan better, with her help or at least with her days in mind. Maybe you can go to the store as a side-shoot of doing something she&#39;d like to do. Let her know she doesn&#39;t have to be a martyr and give up what she wants for what you want. Be the one to compromise first - not abase yourself to some imaginary ideal of motherhood, but find options that are good for everyone. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In every area of belief systems, I&#39;ve noticed there is a tendency to become dogmatic and rigid.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI&#39;ve noticed, in my years on unschooling discussion lists, that when people come into a discussion with very black and white ideas of giving and taking they see dogmatism when others are saying &quot;its okay, you Don&#39;t Have To be so hard.&quot; <br/>\n<br/>\nSaying Yes to children doesn&#39;t mean automatically saying No to yourself or that your children will automatically exploit you for all you&#39;re worth. It&#39;s Okay. You don&#39;t have to work so hard at protecting yourself from your children.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312738258","msgId":62234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCQjM5MDY4LTYyMDAtNDI2RC1BN0UyLUY2OTAxMjg5QTM5OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGoxbTdtdStvZjMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxbTdtdStvZjMyQGVHcm91cHMuY29tPg=="},"prevInTopic":62230,"nextInTopic":62235,"prevInTime":62233,"nextInTime":62235,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... You re the only one who suggested that as an idea. If you think you read it here from someone else, it suggests you need to read more carefully. The ideas","messageBody":"<div id=\"ygrps-yiv-495064733\">On Aug 7, 2011, at 10:33 AM, Lisa wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that letting kids always get exactly what they want is  <br/>\n&gt; unrealistic and unachievable in most families.<br/>\n<br/>\n </span></blockquote>You&#39;re the only one who suggested that as an idea.<br/>\n<br/>\nIf you think you read it here from someone else, it suggests you need  <br/>\nto read more carefully.<br/>\n<br/>\nThe ideas about how to relate to kids presented here *sound* like  <br/>\nideas people have heard before, but for the most part they aren&#39;t. If  <br/>\nyou think you&#39;ve read something here that sounds unrealistic, then  <br/>\nread again. If it&#39;s still sounds unrealistic, ask questions rather  <br/>\nthan attacking the idea as unrealistic.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I didn&#39;t get the groceries, there would be no food to eat. If I  <br/>\n&gt; didn&#39;t go to my medical appointments, I would not feel well.<br/>\n<br/>\n </span></blockquote>Where was it suggested that people go without food and medical  <br/>\nappointments?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Life has to be a give and take and there must be room for every  <br/>\n&gt; person to have his or her needs met. We are a family, and we all  <br/>\n&gt; matter. In some families, there is only one parent, and sometimes  <br/>\n&gt; this parent has to work away from the home.<br/>\n&gt;<br/>\n&gt; I should clarify<br/>\n<br/>\n </span></blockquote>What the list is for is clarifying the principles and practical ways  <br/>\nto apply them rather than what list members do.<br/>\n<br/>\nThis is not a list for trading &quot;what works for our family.&quot; The  <br/>\npurpose of the list is to explain how to put radical unschooling as  <br/>\ndefined on this list into practice. No one&#39;s required to believe in  <br/>\norder to be a member. But people are asked to stick to writing about  <br/>\nthe philosophy as defined here and practical ways they have found that  <br/>\nwork to put the principles into practice.<br/>\n<br/>\nIf members practice many of the ideas discussed here but have chore  <br/>\ncharts, for instance, they&#39;re asked not to share the charts because  <br/>\nthat idea doesn&#39;t help joyful living, learning and relationships.  <br/>\nThere are much better ideas, better ways of viewing tasks around the  <br/>\nhouse that will grow relationships and joyful living and learning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In every area of belief systems, I&#39;ve noticed there is a tendency to  <br/>\n&gt; become dogmatic and rigid.<br/>\n<br/>\n </span></blockquote>When a philosophy is more thought based than practical action based,  <br/>\nthat&#39;s bound to happen.<br/>\n<br/>\nWhile the radical unschooling philosophy can sound a bit pie in the  <br/>\nsky, everything discussed here is about taking care of the real  <br/>\nproblems of a family while making more joyful and more relationship  <br/>\nbuilding choices.<br/>\n<br/>\nNone of the long time radical unschoolers here have let their families  <br/>\nstarve or went without medical attention because the kids didn&#39;t want  <br/>\nto go. And the long time radical unschoolers have found ways to do  <br/>\nthose without treating the child&#39;s feelings as less important than  <br/>\nwhat the mom feels she needs to do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  she usually sighs a bit, then will cheerfully transition into a  <br/>\n&gt; cheerful &quot;ok!&quot;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>And if she didn&#39;t? Many kids don&#39;t. Many kids really dislike leaving  <br/>\nthe house.<br/>\n<br/>\nThat&#39;s why trading &quot;what works for us&quot; doesn&#39;t work so well. Usually  <br/>\nthe ideas work because of the personalities involved not because of  <br/>\nthe principles.<br/>\n<br/>\nThat&#39;s why the list discusses the whys behind the principles, and  <br/>\npulls ideas apart to see what makes them work (towards more joyful  <br/>\nliving and learning and growing better relationships) and what doesn&#39;t.<br/>\n<br/>\nPutting a child&#39;s feelings second to get to the store may get the  <br/>\nstore done but in the long run will damage the relationship.<br/>\n<br/>\nFinding other times to go to the store, finding ways to make the trip  <br/>\nenjoyable for the child will do both.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We can&#39;t believe so heavily in something that we lose our right to  <br/>\n&gt; meet a family&#39;s basic needs and lose balance. Children should not  <br/>\n&gt; dictate our lives; we should each respect and blend with each other.<br/>\n<br/>\n </span></blockquote>Where did you read anyone suggesting family needs not be met or  <br/>\nchildren dictate the family?<br/>\n<br/>\nBecause the list discusses a way of life that doesn&#39;t have something  <br/>\nto compare it to, people new to the ideas will frame what&#39;s said by  <br/>\nwhat they already know and understand. What people are writing may  <br/>\nsound like children dictating, may sound like family&#39;s not meeting  <br/>\nneeds in deference to children but no one has said that.<br/>\n<br/>\nWhat people have said is to see the world through the understanding of  <br/>\nchildren and work with that rather than against that.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312734761","msgId":62230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQzRFRjg4LTBDOTUtNERFQS04MTFCLTAzN0JDRTdDQTVEMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxbThnOCtqbWdoQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxbThnOCtqbWdoQGVHcm91cHMuY29tPg=="},"prevInTopic":62229,"nextInTopic":62234,"prevInTime":62229,"nextInTime":62231,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"-=-The way I see it, denying one s own needs on a consistent basis is martyrdom. I denied my own needs for the first 7 years of my experience as a parent, and","messageBody":"<div id=\"ygrps-yiv-877466702\">-=-The way I see it, denying one&#39;s own needs on a consistent basis is martyrdom. I denied my own needs for the first 7 years of my experience as a parent, and as a result I faced severe depression and feelings of being trapped for two years, unable to be the person/spouse/parent that I wanted to be.-=-<br/>\n<br/>\nDenying your own needs without a philosophy or a direction that can help does sound like a problem.  That&#39;s not what we&#39;re proposing.<br/>\n<br/>\n-=-Each person has his/her own set of needs in order to be a happy person. One person really can&#39;t determine how the next person should feel about this; we are all unique.-=-<br/>\n<br/>\nIf you&#39;re unique and happy, then how can this list help you?   If you&#39;re here and you believe no one can know what others might need, how will you be helpful in the discussion?<br/>\n<br/>\n-=-My needs to be happy and whole are very minimal: good food, time outdoors, freedom to live how I want, intimate relationships, a little quiet meditation time by myself each day.-=-<br/>\n<br/>\nNot everyone has the possibility of all those.  I read the list to my husband and he suggested I say anyone who needs all that every day needs to have her tubes tied.  I said there are already children.<br/>\n<br/>\nPerhaps your children would like to have freedom to live the way they want.  Perhaps they would like to have a relationship with you that allows them to say they would like your attention without waiting for the next week&#39;s family meeting.<br/>\n<br/>\nThis doesn&#39;t match weekly family meetings very well, nor some of your other statements:  -=-Open communication, respect for each person in the family, room for each person just as they are, no scripts or expectations for how people &quot;should&quot; be.-=-<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312733840","msgId":62229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhBRDM2REQ2LUE1Q0MtNEI0Ni04M0QyLTRCNEVCODlFOTJDMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxbTdtdStvZjMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxbTdtdStvZjMyQGVHcm91cHMuY29tPg=="},"prevInTopic":62227,"nextInTopic":62230,"prevInTime":62228,"nextInTime":62230,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"This was addressed to me, but posts to the list should be addressing the list at large.   It s a discussion of issues, and shouldn t be a dialog with one","messageBody":"<div id=\"ygrps-yiv-945244552\">This was addressed to me, but posts to the list should be addressing the list at large.   It&#39;s a discussion of issues, and shouldn&#39;t be a dialog with one person.<br/>\n<br/>\n<br/>\n-=-Sandra,<br/>\n<br/>\n-=-I think that letting kids always get exactly what they want is unrealistic and unachievable in most families.-=-<br/>\n<br/>\nIt&#39;s unachievable in any family, and no one here advocated that.  So the statement is a straw horse fallacy.  You win an argument you made up yourself.<br/>\n<br/>\n-=-. If I didn&#39;t get the groceries, there would be no food to eat. If I didn&#39;t go to my medical appointments, I would not feel well. -=-<br/>\n<br/>\nThere&#39;s no one here who doesn&#39;t buy groceries and have medical/health experience.  So if there are hundreds of people who have figured out how to get food into the house and to maintain health without disregarding their children&#39;s preferences, it might be worth considering what they&#39;re sharing rather than belittling it. <br/>\n<br/>\nThere are many people here who have been active on this list for nearly ten years, and on other shared sites before that, whose kids are now grown or nearly so, who have been examining and living with these ideas for a decade or two.   When someone has been on the list a week or two, it&#39;s probably not a great idea to suggest that those sharing what they have done and seen, basing their writing one what they have also seen fail in other families, have not really thought about the idea that kids cannot always get exactly what they want.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/confidence\">http://sandradodd.com/confidence</a><br/>\n<br/>\n-=-I should clarify that when I tell my daughter that we will be going to the store today, she usually sighs a bit, then will cheerfully transition into a cheerful &quot;ok!&quot;-=-<br/>\n<br/>\nHow old is she?<br/>\n<br/>\nMy kids used to go to the store without sighing, because I managed to make it fun and interesting from the time they were babies.  One of my greatest regrets is a particular time that Kirby wanted to go to the store with me and I didn&#39;t want him to go.  I think he was two.  It makes me very sad, still, to think of that moment.  He doesn&#39;t remember it. :-)  <br/>\n<br/>\nHolly has gone with me to the store three times in the past week, just to go with me, and she offered to drive.   Once we walked.  I could have gone by myelf, but she wanted to go.  When something becomes a shared part of a loving relationship over the years, it can really last past childhood.   When children are made to do things they don&#39;t want to do, that builds up, and they seek to get away from that.  My husband was in a Presbyterian church last night voluntarily for the first time since his mother&#39;s funeral, and before that it had been many, MANY years.  30 years.  He went last night because Holly&#39;s thinking of joining a choir, and it was their annual concert.   Holly, who&#39;s been skeptical about religion since she was very young, asked me if I would go with her to a regular service there sometime soon, because she really likes the building and wants to see it &quot;in action.&quot;  I said sure.  I was never forced to go to church.  It was always my choice.  Keith was ALWAYS forced to go to church, until he was a teenager and vowed never to go again.     Our next-door neighbor who died in his 80&#39;s had been forced to cut, split and bring in firewood when he was a boy in Pinos Altos, New Mexico, and vowed never to ever cut wood when he was grown, and he didn&#39;t.  One of Keith&#39;s favorite pastimes is gathering, splitting, stacking and rearranging wood for our fireplace and hot tub.<br/>\n<br/>\nThese things are real.  People live, as adults, with resolutions formed from their childhoods.  People made decisions as teens, sometimes in reaction to their parents/home, that can ruin not only their own lives, but their children&#39;s and all of their relatives.  More rules and regulations don&#39;t prevent those things.  This isn&#39;t even about unschooling.  I bet anyone here could tell stories of people who married to spite their parents, or left home early with the first person who promised them a ride in any direction away from home, and a place to spend the night.<br/>\n<br/>\n-=-In every area of belief systems, I&#39;ve noticed there is a tendency to become dogmatic and rigid. We can&#39;t believe so heavily in something that we lose our right to meet a family&#39;s basic needs and lose balance. Children should not dictate our lives; we should each respect and blend with each other.-=-<br/>\n<br/>\nIf this list says &quot;good idea!&quot; or &quot;whatever&quot; about suggestions made when the purpose of the list is to discuss what will help people unschool, we might as well delete the list from yahoo entirely.   <br/>\n<br/>\n-=-We can&#39;t believe so heavily in something that we lose our right to meet a family&#39;s basic needs and lose balance. -=-<br/>\n<br/>\nNo one has asked you to lose your rights or to lose balance.  <br/>\nAs far as I know, no one here believes heavily in anything that would keep them from believing in their children&#39;s whole humanity.  <br/>\n<br/>\nI agree with this:  &quot; Children should not dictate our lives; we should each respect and blend with each other.&quot;<br/>\nI think your idea of &quot;respect and blend&quot; is that parents should dictate to the children until the children are older, and that&#39;s problematical within what will help you understand unschooling.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/confidence\">http://sandradodd.com/confidence</a><br/>\n(Same link as up above, for those who might have read on, and might forget to look at it.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125356544,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa_landen@...&gt;","profile":"lisa_landen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Walk to the store","postDate":"1312728392","msgId":62227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxbThnOCtqbWdoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJENEUyNDBDLTlGMjktNDBCNy04QjZCLTQyRjlDM0VFNjY2RkB2ZXJpem9uLm5ldD4="},"prevInTopic":62226,"nextInTopic":62229,"prevInTime":62226,"nextInTime":62228,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"The way I see it, denying one s own needs on a consistent basis is martyrdom. I denied my own needs for the first 7 years of my experience as a parent, and as","messageBody":"<div id=\"ygrps-yiv-2039087483\">The way I see it, denying one&#39;s own needs on a consistent basis is martyrdom. I denied my own needs for the first 7 years of my experience as a parent, and as a result I faced severe depression and feelings of being trapped for two years, unable to be the person/spouse/parent that I wanted to be.<br/>\n<br/>\nEach person has his/her own set of needs in order to be a happy person.  One person really can&#39;t determine how the next person should feel about this; we are all unique.<br/>\n<br/>\nMy needs to be happy and whole are very minimal: good food, time outdoors, freedom to live how I want, intimate relationships, a little quiet meditation time by myself each day.<br/>\n<br/>\nWhen I take care of my own needs and am open with my children about them, our relationship deepens.  They talk about their needs in the same way and we nurture each other this way--we genuinely care about each others&#39; needs and desires and work to make room for everyone each day.  My kids have genuine empathy for my needs, and as long as I am open with them with the reasons we do things, etc they almost always agree with what we&#39;re doing.  If they are opposed to something, often times we will not do it.  We will come up with solutions that are realistic, such as doing it at another time or whatever, depending on what the situation is.<br/>\n<br/>\nWe have family meetings each week to help achieve each persons&#39; needs and desires being met.  Each person can say whatever they need to say, and it&#39;s heard and validated. Our family meetings have brought even more peace and community into our family.<br/>\n<br/>\nOpen communication, respect for each person in the family, room for each person just as they are, no scripts or expectations for how people &quot;should&quot; be.  That&#39;s how I interpret our unschooling lifestyle, and it works very well for us.<br/>\n<br/>\nLisa</div>","specialLinks":[]},{"userId":125356544,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa_landen@...&gt;","profile":"lisa_landen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Walk to the store","postDate":"1312727582","msgId":62226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxbTdtdStvZjMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlFREE1NkE3LTk0QTYtNDI1Qy1CNEVCLUZBOEFDRURDQUZENkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62220,"nextInTopic":62227,"prevInTime":62225,"nextInTime":62227,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"Sandra, I think that letting kids always get exactly what they want is unrealistic and unachievable in most families.  If I didn t get the groceries, there","messageBody":"<div id=\"ygrps-yiv-847785697\">Sandra,<br/>\n<br/>\nI think that letting kids always get exactly what they want is unrealistic and unachievable in most families.  If I didn&#39;t get the groceries, there would be no food to eat.  If I didn&#39;t go to my medical appointments, I would not feel well.  Life has to be a give and take and there must be room for every person to have his or her needs met.  We are a family, and we all matter.  In some families, there is only one parent, and sometimes this parent has to work away from the home.<br/>\n<br/>\nI should clarify that when I tell my daughter that we will be going to the store today, she usually sighs a bit, then will cheerfully transition into a cheerful &quot;ok!&quot;  We talk about how the trip will be quick and talk about what she wants to do when we return. It turns out just fine and she learned how compromise is a normal part of life.<br/>\n<br/>\nIn every area of belief systems, I&#39;ve noticed there is a tendency to become dogmatic and rigid.  We can&#39;t believe so heavily in something that we lose our right to meet a family&#39;s basic needs and lose balance.  Children should not dictate our lives; we should each respect and blend with each other.<br/>\n<br/>\nLisa</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Walk to the store","postDate":"1312658994","msgId":62220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxazRuaSticDIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxamNoZStsdDhxQGVHcm91cHMuY29tPg=="},"prevInTopic":62219,"nextInTopic":62226,"prevInTime":62219,"nextInTime":62221,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... **************** Drawing a line between needs and wants can get very arbitrary very quickly. Is a sense of security a need or a want? Self esteem?","messageBody":"<div id=\"ygrps-yiv-1585754523\">&quot;Lisa&quot; &lt;lisa_landen@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;ve found a place where I am comfortable putting my needs ahead of my children&#39;s wants, if that is necessary.<br/>\n </span></blockquote>****************<br/>\n<br/>\nDrawing a line between &quot;needs&quot; and &quot;wants&quot; can get very arbitrary very quickly. Is a sense of security a need or a want? Self esteem? Bodily integrity? People *live* without all those things, so they can&#39;t possibly be needs - see how fast that gets ugly?<br/>\n<br/>\nStep away from that line and see needs and desires, wishes and dreams as all valuable. Sometimes a dream can be bigger than a &quot;need&quot; - I&#39;ve ignored hunger and the need to pee for the sake of my artwork. Not all desires can be met at the exact same moment, for sure, but drawing those kinds of lines can build up resentment and one-upmanship over time. Being gentle with the wants and dreams of the people you love makes for a kinder home, a home in which people - even children - will say &quot;its okay, you go first&quot; out of mutual care. Young children can&#39;t always do that in ways that are convenient to adults, but they Do it - they&#39;ll give you their special bug to hold out of kindness, or a sticky kiss to let you know you&#39;re special. It helps to See those kinds of actions as having value - kids trying to give back to parents in the only ways they understand yet.<br/>\n<br/>\nMoms&#39; needs and wants, wishes and dreams are as valuable as kids&#39; - and moms absolutely should take care of themselves, but parents have resources kids don&#39;t have. They can delay gratification, they can plan, they can see a bigger picture and from others&#39; perspectives. All those adult resources are important in terms of moms taking care of themselves well enough to be able to take care of kids, too. <br/>\n<br/>\nIt&#39;s just as important for moms to recognize that One of their needs is to take care of their children. That&#39;s important! Seeing that you&#39;re meeting one of your needs can help you get by for a time until you can meet others - like sleep. That kind of broader perspective that can make a surprising difference. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In the book, &quot;The Continuum Concept&quot;, I gained appreciation for the idea that children should be the satellites of their parents...<br/>\n </span></blockquote>********************<br/>\n<br/>\nContinuum Concept theories are appealing to many people - they were to me, once, but they aren&#39;t necessarily compatible with unschooling, and that statement is a good example. My kids aren&#39;t interested in being my satellites, they&#39;re interested in their own interests. <br/>\n<br/>\nIf your kids are happy to revolve around you and your interests, then Continuum Concept can seem reasonable and sensible, but if they *aren&#39;t* content only with your interests, then you&#39;re essentially building a kind of curriculum out of your values and preferences. I&#39;m not saying that&#39;s a Bad thing, but that the results are similar to other curricula, which is that it frequently becomes something kids endure and set aside at the earliest opportunity. <br/>\n<br/>\nAnd that&#39;s what happens in a lot of small communities, in small towns and on farms - kids have interests which aren&#39;t encompassed by their parents&#39; lives so they get out. Not all kids - because some Do share enough interests with their parents to find the continuation of that lifestyle appealing, but its a personality thing. The Continuum Concept only &quot;works&quot; if your kids have the right kind of personality.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I liked that idea, and I especially liked that it was a concept that native cultures had lived (and succeeded with) for hundreds of years.<br/>\n </span></blockquote>******************<br/>\n<br/>\nThat&#39;s a debatable point in and of itself, but the bigger issue in terms of unschooling is that our kids don&#39;t live in small, isolated societies with limited contact with the rest of the world - and that&#39;s important! What seems to work in an isolated environment will play out very differently when people have lots and lots of options. Generally speaking, parents find that Continuum Concept ideas work when kids are small (sometimes!) but start to break down as they learn more about the world and develop interests and passions different from their parents.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If children always get exactly what they want at the expense of others, what will they learn? <br/>\n </span></blockquote>***************<br/>\n<br/>\nYou don&#39;t have to see your relationship with your kids in adversarial terms like that! If you see what you do for them as a gift, given openly and graciously rather than &quot;at your expense&quot; than kids see generosity and graciousness and value those things - and valuing those things will seek to extend them to others. That&#39;s not a guess, its what happens when parents are gracious and thoughtful and kind without fussing over the &quot;expense&quot; of all that care. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Walk to the store","postDate":"1312655286","msgId":62219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxazEzbSsxMGFobUBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PENBQkNpVlY9TnNZTTVwaWcwV0xySmhYVXhDaThlVzBiVFpDNGE9SEZhaHVaQmZ3M2ljd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62218,"nextInTopic":62220,"prevInTime":62218,"nextInTime":62220,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... *************** There s an implication in that statement that they re resistant for unimportant reasons, that children s desires and values aren t as","messageBody":"<div id=\"ygrps-yiv-1549298528\">Brenda Hoffman &lt;wahmbrendamarie@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I wouldn&#39;t put off what needs to be done just because they are resistant.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThere&#39;s an implication in that statement that they&#39;re &quot;resistant&quot; for unimportant reasons, that children&#39;s desires and values aren&#39;t as important as adult desires and values. It&#39;s worth thinking about that. Kids&#39; feelings are intense and immediate and very important to them. Having those reasons poo-pooed as &quot;resistance&quot; doesn&#39;t help build communication between kids and parents - its more likely a set-up for kids throwing out more &quot;resistance&quot; because that&#39;s the only way they&#39;re feelings are taken seriously. <br/>\n<br/>\nIt&#39;s more useful to consider *why* the child in question is being &quot;resistant&quot;. Is the timing lousy? Maybe mom needs to pay more attention to the ups and downs of the day and time her requests better. I know not to suggest going out to my 9yo if she&#39;s in the middle of a project, I look for the pauses and times when she&#39;s trying to decide what to do next to suggest an outting.<br/>\n<br/>\nIt&#39;s possible, too, that mom&#39;s setting herself up by how she&#39;s phrasing things - Joyce mentioned that, and mentioned making a statement rather than asking a question and I think its being misconstrued. There&#39;s a big difference between &quot;do you want to come do this dull errand with me?&quot; and &quot;let&#39;s go get some ice-cream sandwiches!&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Life must go on even though you&#39;re unschooling.<br/>\n<br/>\n </span></blockquote>Huh? <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; I completely agree with Joyce when she said &quot;How about not asking? ;-) Say<br/>\n&gt; at a time between activities, &quot;Hey, I<br/>\n&gt; need some juice. Let&#39;s walk down to the store.&quot; Include a treat or<br/>\n&gt; something they enjoy in the offer if the walk isn&#39;t enough. Just like<br/>\n&gt; she&#39;d offer any other activity.&quot;<br/>\n&gt; <br/>\n&gt; I wouldn&#39;t put off what needs to be done just because they are resistant.<br/>\n&gt; Life must go on even though you&#39;re unschooling.  You can always offer to let<br/>\n&gt; them choose the treat.  I&#39;d say &quot;We&#39;re going to the store in 10 minutes.<br/>\n&gt; While there you can choose a lollipop or a piece of fruit&quot;  Of course, it&#39;d<br/>\n&gt; be up to you what the 2 treats are but it&#39;d be up to them to choose the<br/>\n&gt; treat they&#39;re going there to get.  I&#39;d also try to do it near snack time so<br/>\n&gt; that you could even go so far as to say that for snack time you are going to<br/>\n&gt; the store where they get that choice.<br/>\n&gt; <br/>\n&gt; -- <br/>\n&gt; =^..^= BrendaMarie<br/>\n&gt; Proud Christian Unschooler... Growing by God&#39;s<br/>\n&gt; grace&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thechristianunschool.com\">http://www.thechristianunschool.com</a>&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312652673","msgId":62218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJENEUyNDBDLTlGMjktNDBCNy04QjZCLTQyRjlDM0VFNjY2RkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGoxamNoZStsdDhxQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxamNoZStsdDhxQGVHcm91cHMuY29tPg=="},"prevInTopic":62217,"nextInTopic":62219,"prevInTime":62217,"nextInTime":62219,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... Necessary is where many people get their thinking stuck, though. They get stuck on what s usually done as being necessary. They get stuck on the","messageBody":"<div id=\"ygrps-yiv-159864305\">On Aug 6, 2011, at 8:37 AM, Lisa wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve found a place where I am comfortable putting my needs ahead of  <br/>\n&gt; my children&#39;s wants, if that is necessary.<br/>\n<br/>\n </span></blockquote>&quot;Necessary&quot; is where many people get their thinking stuck, though.  <br/>\nThey get stuck on what&#39;s &quot;usually done&quot; as being necessary. They get  <br/>\nstuck on the obvious solution (that&#39;s usually done) being the only  <br/>\nsolution. And then see their kids as the problem when their kids say no.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Needs, after all, are essential for survival.<br/>\n<br/>\n </span></blockquote>Yes, but it helps more peaceful relations not to separate needs and  <br/>\nwants. To kids their wants and needs are much the same. They will grow  <br/>\ninto having more of a spectrum. They will face times when one person&#39;s  <br/>\nneed/want is way more important than another person&#39;s. But it&#39;s not  <br/>\nsomething that they need taught.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Parents, especially those who are with their children most of the  <br/>\n&gt; day, can easily become deprived of their needs<br/>\n<br/>\n </span></blockquote>Who&#39;s depriving the mom?<br/>\n<br/>\nThe moms choose to set aside their wants and needs.<br/>\n<br/>\nMuch better for everyone&#39;s peace to see everyone&#39;s needs as important.  <br/>\nThe big difference between mom&#39;s needs and the kids&#39; needs is that the  <br/>\nmom has the power to adjust the day&#39;s schedule to take everyone and  <br/>\ntheir needs into account. She has the power to arrange things so one  <br/>\nperson doesn&#39;t feel like their needs are secondary to another&#39;s.<br/>\n<br/>\nIn many cases, mom will be putting her needs at a lower priority  <br/>\nbecause she has more experience with delaying gratification and more  <br/>\nexperience with the world and in coming up with ways to meet her  <br/>\nneeds. Her kids don&#39;t have her experience or her power.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Going to the park, having food to eat, and even having time to  <br/>\n&gt; oneself are needs that should be met, even if it is inconvenient for  <br/>\n&gt; the children.<br/>\n<br/>\n </span></blockquote>Going to the park, having time to oneself is essential to life?<br/>\n<br/>\nI like what several unschoolers -- Schuyler I remember in particular  <br/>\n-- have said about finding fulfillment in their kids rather than  <br/>\nlooking outward for replenishment. There was a good thread -- or piece  <br/>\nof one renamed &quot;putting mom&#39;s needs last&quot;:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/message/45909\">http://groups.yahoo.com/group/unschoolingbasics/message/45909</a><br/>\n<br/>\nHere&#39;s a piece of it:<br/>\n====<br/>\nSchuyler: &quot;I don&#39;t know what did it, but I can almost pinpoint the  <br/>\nminute when I turned<br/>\nfrom feeling a need to have my own needs met in a separate but equal  <br/>\nkind of way<br/>\nto seeing how being with Simon and Linnaea was meeting my needs in the  <br/>\nmost<br/>\ninvolved and deep way. We were playing a game on the floor and I just  <br/>\nsat and<br/>\nwatched and listened and my cup ran over. Before then, there were  <br/>\nmoments, there<br/>\nwere flitting bits of fulfilment, but somehow, in that moment all  <br/>\nthose moments<br/>\ncumulated and showed me, viscerally, the way to meet my own needs by  <br/>\nmeeting<br/>\ntheirs.<br/>\n<br/>\n&quot;Does that sound like martyrdom? Maybe. What did it take? It took  <br/>\nbeing in Toys R<br/>\nUs one day and getting really hungry and getting really unhappy and  <br/>\nrecognising<br/>\nthat the two things were linked. It took making sure that I wasn&#39;t  <br/>\nhungry. It<br/>\ntook smelling their heads when I was making lists of things that  <br/>\nneeded to be<br/>\ndone away from them, a sort of biofeedback that pulled me back into  <br/>\nthem and<br/>\nturned my head from the chores that I was lining up to go and do. It  <br/>\ntook a<br/>\ngrowing awareness that they were at least as engaging and interesting  <br/>\nas the<br/>\nthings I was thinking of doing or that I was thinking would fill me  <br/>\nup. And it<br/>\ntook a real recognition that when I got &quot;my time&quot; it didn&#39;t satiate my  <br/>\nneeds, it<br/>\ndidn&#39;t even begin to meet them.<br/>\n<br/>\n&quot;For me, it was very clearly incremental, it was a step by step  <br/>\nbuilding from<br/>\nsmall changes to a point where I was in a position to find personal  <br/>\nfulfilment<br/>\nin being with my children. It wasn&#39;t martyrdom, or it didn&#39;t feel as  <br/>\nthough I&#39;d<br/>\nsacrificed myself for their joy. It did help to get the almost kinetic  <br/>\nmemory of<br/>\nbeing kind to them, of meeting them where they were instead of  <br/>\nexpecting them to<br/>\nmeet me where I was. &quot;<br/>\n====<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; even if it is inconvenient for the children.<br/>\n<br/>\n<br/>\n </span></blockquote>The more *people* feel inconvenienced by someone else meeting their  <br/>\nneeds, the less connected they feel, the less willing they are to  <br/>\nchoose to set aside their needs for the other.<br/>\n<br/>\nWe as adults have the power to show kids how to respect others needs  <br/>\nwhile meeting our own needs. We can ask them if they wouldn&#39;t mind if  <br/>\nwe stopped and did such and such. We can appreciate that we&#39;re using  <br/>\ntheir time to run our errands and treat that time with respect by  <br/>\ngiving them something in return. As we would do to anyone whose  <br/>\nrelationship we cared about.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In the book, &quot;The Continuum Concept&quot;, I gained appreciation for the  <br/>\n&gt; idea that children should be the satellites of their parents, that  <br/>\n&gt; they should learn to fit into the rhythm of their parents&#39; lives,  <br/>\n&gt; learn from it, and as a result, they naturally become considerate  <br/>\n&gt; and functional members of their community.<br/>\n<br/>\n<br/>\n </span></blockquote>&quot;Should&quot; for what goal, though?<br/>\n<br/>\nIf I&#39;m not mistaken, those kids would pretty much doing what their  <br/>\nparents were doing when they grew up. And what their parents were  <br/>\ndoing was spending a good portion of their waking hours doing what  <br/>\nthey needed to stay alive. Much of what they did was directed at what  <br/>\nis &quot;essential to life&quot;.<br/>\n<br/>\nWhat I did throughout the day when my daughter was with me were often  <br/>\nuseful life skills, but they didn&#39;t take that much exposure to learn.  <br/>\nBeing my satellite would have been boring for Kat! ;-)<br/>\n<br/>\nCloser for unschooling would would be some combination of partner,  <br/>\ncruise director, mentor.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also realized that children learn from their parents how to treat  <br/>\n&gt; themselves and others. If children always get exactly what they want  <br/>\n&gt; at the expense of others, what will they learn? If children watch  <br/>\n&gt; their parents neglecting their desires or needs, what will they  <br/>\n&gt; learn? I thought they might learn to not value their own needs, and  <br/>\n&gt; I didn&#39;t want that for them.<br/>\n<br/>\n </span></blockquote>They learn the most from how they&#39;re treated.<br/>\n<br/>\nThey also learn from how mom takes others into account when coming up  <br/>\nwith ways to meet the child&#39;s needs and wants.<br/>\n<br/>\nThey also learn from how mom takes them into account when coming up  <br/>\nwith ways to meet her own needs.<br/>\n<br/>\nThey also learn from how we treat others who are interacting with the  <br/>\nchild. (For instance when we say &quot;Thank you,&quot; for something given to  <br/>\nthe child.)<br/>\n<br/>\nThey also learn from how they&#39;re drawn into treating others. (I&#39;m  <br/>\nthinking of things like &quot;Let&#39;s get Dad some of that double fudge ice  <br/>\ncream he loves for dessert tonight.&quot; and &quot;It&#39;s Sonata&#39;s birthday next  <br/>\nweek. What would make her day extra special?&quot;<br/>\n<br/>\nThey learn somewhat from how we treat others who aren&#39;t interacting  <br/>\nwith the child. Those interactions get absorbed into the child&#39;s  <br/>\nunconscious growing awareness of how the world works. But that kind of  <br/>\nlearning is slow since the child isn&#39;t directly connected to the  <br/>\nsituation, doesn&#39;t really know the whats and why things are being done  <br/>\nsuch and such a way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If children always get exactly what they want at the expense of  <br/>\n&gt; others, what will they learn?<br/>\n<br/>\n<br/>\n </span></blockquote>How would that be possible?<br/>\n<br/>\nAnd has anyone suggested anyone should try? (The &quot;realized&quot; part  <br/>\nimplies that idea is out there being promoted.)<br/>\n<br/>\nAnd how would kids know their wants were being granted at the expense  <br/>\nof others? Unless someone complains and mom shrugs off the complaints,  <br/>\nthe child isn&#39;t likely to be aware of others&#39; needs.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  If children watch their parents neglecting their desires or needs,  <br/>\n&gt; what will they learn?<br/>\n<br/>\n<br/>\n </span></blockquote>It&#39;s really hard to see someone neglecting their desires and needs  <br/>\nbecause we can&#39;t see what they really want. It looks like people  <br/>\nmaking the choices they want to.<br/>\n<br/>\nThat&#39;s important for parents to realize. Every time you set aside what  <br/>\nyou really want, it looks to others like you&#39;re choosing what you  <br/>\nwant! You get no brownie points from your kids for always putting  <br/>\naside your wants and needs for others.<br/>\n<br/>\nI can remember feeling clearly that my parents were always doing what  <br/>\nthey wanted to. Whether it was going to the grocery store or to work  <br/>\nor to play bridge or to mow the lawn or play golf. *They* didn&#39;t see  <br/>\nit that way, I&#39;m guessing. I&#39;m sure it felt like setting their lives  <br/>\naside for what they &quot;had to&quot; do and occasionally &quot;getting&quot; to do what  <br/>\nthey enjoyed. But what uber-parent was making them make those choices?<br/>\n<br/>\nWhat *does* often happen with people who always put their needs second  <br/>\nis that others lose respect for them. It&#39;s hard to respect someone who  <br/>\nobviously has no respect for themselves.<br/>\n<br/>\nI&#39;m guessing most people have known mothers (especially) who grow  <br/>\nbitter because their kids never appreciate all the stuff they do and  <br/>\ndid for them :-/<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I&#39;ve become comfortable with giving my children as much freedom  <br/>\n&gt; as possible without sacrificing the family&#39;s or my own needs<br/>\n<br/>\n </span></blockquote>Thinking in terms of sacrifice isn&#39;t a good mental place to unschool  <br/>\nfrom.<br/>\n<br/>\nTreating everyone&#39;s needs as important and finding ways to meet those  <br/>\nneeds will help unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I need to go somewhere, they might gripe--but the come out of  <br/>\n&gt; respect for me and it works out just fine.<br/>\n<br/>\n<br/>\n </span></blockquote>If your husband had a need and his way of meeting it made you gripe,  <br/>\nwould it work out just fine and improve your relationship if he  <br/>\nignored what was bothering you?<br/>\n<br/>\nHow does treating others with disrespect to meet your needs make life  <br/>\nmore joyful for others or improve relationships?<br/>\n<br/>\nWhat it models for kids is ignoring other people&#39;s needs for your own.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Walk to the store","postDate":"1312652368","msgId":62217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxanU4ZytzOWE0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlGMjAyMjY5LUYyRjUtNDYyMS05MzdDLTAzRkY5RUFEOUNBMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62216,"nextInTopic":62218,"prevInTime":62216,"nextInTime":62218,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... They re too young to stay alone, and so it shouldn t be an option for them to keep adults from doing errands.  The adults can try to find ways to make the","messageBody":"<div id=\"ygrps-yiv-1847921443\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\nThey&#39;re too young to stay alone, and so it shouldn&#39;t be an option for them to keep adults from doing errands.  The adults can try to find ways to make the errands fun.  <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI agree.  Just wanted to clarify...  For our situation, it usually works out fine for me to do errands in the evening rather than during the day, especially grocery shopping.  For us, it usually doesn&#39;t &quot;have to&quot; be done during the day. On the rare occasion that I need to get someplace that&#39;s only open during the day, we do it and make it fun.<br/>\n<br/>\nI&#39;m sure it also depends a lot on the child/children.  If their mother hasn&#39;t found enough ways to make it fun yet, then brainstorming fun ideas could really help.  But there are some kids (like my son) who would be really distraught if they were expected to go out grocery shopping every day, no matter how entertaining the adults made it. </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312651320","msgId":62216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFREE1NkE3LTk0QTYtNDI1Qy1CNEVCLUZBOEFDRURDQUZENkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBQkNpVlY9TnNZTTVwaWcwV0xySmhYVXhDaThlVzBiVFpDNGE9SEZhaHVaQmZ3M2ljd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQkNpVlY9TnNZTTVwaWcwV0xySmhYVXhDaThlVzBiVFpDNGE9SEZhaHVaQmZ3M2ljd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62214,"nextInTopic":62217,"prevInTime":62215,"nextInTime":62217,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"These are responses to statements from more than one post, and not messages to individual people. -=-I wouldn t put off what needs to be done just because they","messageBody":"<div id=\"ygrps-yiv-712765453\">These are responses to statements from more than one post, and not messages to individual people.<br/>\n<br/>\n-=-I wouldn&#39;t put off what needs to be done just because they are resistant.<br/>\nLife must go on even though you&#39;re unschooling. -=-<br/>\n<br/>\n#1, be careful with &quot;life must go on.&quot;  <br/>\n<br/>\nI was at a funeral yesterday, of a 16 year old suicide.  I&#39;ve known his mom for 30 years.  He&#39;s the third of three kids.  Shot himself in the head last Monday.  His life did not go on.   <br/>\n<br/>\nThey weren&#39;t unschoolers, but that&#39;s not the point.  <br/>\n<br/>\nIf parents consider their plans &quot;needs&quot; and their children&#39;s objections &quot;resistance,&quot; THAT does not lead to better unschooling.  Unschooling is built on relationships and only happens in happy, hopeful families.<br/>\n<br/>\n<br/>\n-=-You can always offer to let<br/>\nthem choose the treat. I&#39;d say &quot;We&#39;re going to the store in 10 minutes.<br/>\nWhile there you can choose a lollipop or a piece of fruit&quot; Of course, it&#39;d<br/>\nbe up to you what the 2 treats are but it&#39;d be up to them to choose the<br/>\ntreat they&#39;re going there to get. I&#39;d also try to do it near snack time so<br/>\nthat you could even go so far as to say that for snack time you are going to<br/>\nthe store where they get that choice.-=-<br/>\n<br/>\nWhy limit it to a lollipop or fruit?<br/>\nWhy &quot;snack time&quot;?  <br/>\n<br/>\nWe never had &quot;snack time&quot; at our house, but if it had been a while since a child thought to eat or drink, I would put something where he could reach it.<br/>\n<br/>\nThis seems arbitrary:<br/>\n<br/>\n-=-it&#39;d be up to you what the 2 treats are but it&#39;d be up to them to choose the<br/>\ntreat they&#39;re going there to get-=-<br/>\n<br/>\n-=-I&#39;ve found a place where I am comfortable putting my needs ahead of my children&#39;s wants, if that is necessary. Needs, after all, are essential for survival. Parents, especially those who are with their children most of the day, can easily become deprived of their needs. Going to the park, having food to eat, and even having time to oneself are needs that should be met, even if it is inconvenient for the children.-=-<br/>\n<br/>\nTime to oneself is not &quot;a need.&quot;   Going to the park is SURELY not &quot;a need,&quot; as many people in the world don&#39;t live anywhere near a park.  Having food to eat doesn&#39;t involve a daily walk to the store, as other posters have said.  <br/>\n<br/>\nIf you think of parenting in terms of being &quot;easily deprived of...needs,&quot; that negativity will ooze out into your home and your relationships.<br/>\nIf you learn to see your time with children as loving and giving, rather than as deprivation in the face of those &quot;children&#39;s want,&quot; all lives involve will improve right then.<br/>\n<br/>\n-=- If children watch their parents neglecting their desires or needs, what will they learn? I thought they might learn to not value their own needs, and I didn&#39;t want that for them.-=-<br/>\n<br/>\nThis is mainstream thought that&#39;s available all over the internet, especially in discussions about divorce and daycare.<br/>\nThere are other ways to live.<br/>\n<br/>\n-=- If I need to go somewhere, they might gripe--but the come out of respect for me and it works out just fine. We come back home and they can get back to their business, and we are all happy.-=-<br/>\n<br/>\nIf they&#39;re griping and you&#39;re ignoring it, that &quot;respect&quot; is not going to last.  <br/>\n<br/>\nThere&#39;s a graph here that&#39;s worth considering:  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/howto/\">http://sandradodd.com/howto/</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Walk to the store","postDate":"1312647204","msgId":62213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGMjAyMjY5LUYyRjUtNDYyMS05MzdDLTAzRkY5RUFEOUNBMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxaTd1Zitnc20yQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxaTd1Zitnc20yQGVHcm91cHMuY29tPg=="},"prevInTopic":62212,"nextInTopic":62214,"prevInTime":62212,"nextInTime":62214,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"-=-The children frequently (daily) choose not to leave the house and my wife regularly asks me to stop and pick up groceries in the bigger town, so as not to","messageBody":"<div id=\"ygrps-yiv-2127953352\">-=-The children frequently (daily) choose not to leave the house and my wife regularly asks me to stop and pick up groceries in the bigger town, so as not to force the children to leave against their wishes. This causes me a stress to meet this need and my wife a stress when I don&#39;t meet the need.<br/>\n<br/>\n-=-She will walk to the store when I am home and (almost) every time, both children stop what they&#39;re doing to go with her. Whenever she explains that she is going to the store, and that they can stay with me, they always choose to go.-=-<br/>\n<br/>\nI&#39;m guessing, and could be wrong, that part of this is your fear that the children like to be home with their mom, but not with you.  And that&#39;s not about the store, and it will very likely change over the years.   Our oldest boy and my husband weren&#39;t very friendly the first twelve years of Kirby&#39;s life, relative to the relationships Keith had with the younger two, but when Kirby was a teen he because impatient with me and preferred to talk to his dad about some kinds of things.  When he moved out, I think I became the go-to parent (if it&#39;s not about insurance or taxes).  So you might expect that to fluctuate.<br/>\n<br/>\nMy husband does our big shopping at costco, and likes to. He shares a membership with his best friend Bob, so I don&#39;t even have a card. :-)  Sometimes I go with him and often I don&#39;t, but for Keith he sees it as a money-saving strategy game of sorts, to buy things there instead of at the regular store.  Perhaps that would make you feel better, if you tallied up the savings of the bigger store, and saw it as time for you to be alone in air-conditioned comfort with a wheeled cart to lean on, and time to think--about work, or about family, or about something altogether different.   <br/>\n<br/>\nThis might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/gift\">http://sandradodd.com/chores/gift</a><br/>\n<br/>\nThe above was presented in the spirit of suggesting it&#39;s easier and better to change our own point of view than to be frustrated that we can&#39;t change others.<br/>\n<br/>\nBelow is a more immediate suggestion:<br/>\n<br/>\nYour wife could stop asking whether the kids feel like going to the store and say &quot;We need to go to the store.  When&#39;s a good time?&quot;  Engaging the kids in finding a solution would be good.    They&#39;re too young to stay alone, and so it shouldn&#39;t be an option for them to keep adults from doing errands.  The adults can try to find ways to make the errands fun.  <br/>\n<br/>\nMaybe one kid could ride in one cart, pushed, and the older one in the big basket of the other one, pulled.  That helped us a lot, when I had three under 6.<br/>\n<br/>\nNeither of those plans should be the always-and-forever plan, but some and some.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":262318461,"authorName":"Sara Evans","from":"Sara Evans &lt;sunrayemomi@...&gt;","profile":"sunrayemomi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312646116","msgId":62214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBK2FrTlJocGt2MTRjam40am54amtXOV9vYVpfWWlyZmFUcTBqckM5eD1raFo3dzJNZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzMTI2NDQyMTQuMzQ3Mi5ZYWhvb01haWxSQ0B3ZWI4MzUwMS5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PGoxamFuMSs5ODRkQGVHcm91cHMuY29tPgk8MTMxMjY0NDIxNC4zNDcyLllhaG9vTWFpbFJDQHdlYjgzNTAxLm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":62213,"nextInTopic":62216,"prevInTime":62213,"nextInTime":62215,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"I buy all our dry goods and some others from a delivery service like Frontier, Amazon, United and Country Life (MI). I get things like shampoo soap cleaning","messageBody":"<div id=\"ygrps-yiv-312151361\">I buy all our dry goods and some others from a delivery service like<br/>\nFrontier, Amazon, United and Country Life (MI).<br/>\nI get things like<br/>\n<br/>\nshampoo<br/>\nsoap<br/>\ncleaning supplies<br/>\nflours<br/>\ngrains<br/>\ndetergents<br/>\npaper products<br/>\nvitamins<br/>\nsupplements<br/>\nhygiene products<br/>\ndog treats<br/>\nbooks/toys/fun stuff<br/>\netc etc etc<br/>\n<br/>\ndelivered right to my door.  May be worth checking into for certain things.<br/>\n<br/>\nI also live with extended family so often have a way to leave kids home but<br/>\nthat doesn&#39;t apply to your situation.  I do take the kids shopping about<br/>\ntwice a month or so, and when I talk about it for a few days leading up to<br/>\nthe trip, maybe putting it on the calendar even, it helps them anticipate<br/>\nthe trip.  Even my ten year old can&#39;t stand shopping but she and her sister<br/>\nget a list to shop with, which also makes the trip more fun.  The older can<br/>\ntake her list and her own cart off by herself, and the younger will stay<br/>\nwith me.  It can still be a chore actually getting them interested in<br/>\ngetting ready and heading out though!  If I only need one or two items, my<br/>\nhubby has no problem stopping on his way home from work or coming home and<br/>\nletting me head out (my kids are older and usually don&#39;t mind letting me go<br/>\nalone but when they were younger they&#39;d do as yours do).<br/>\n<br/>\nAlso what about giving them a shopping allowance in addition to having them<br/>\nhelp with groceries?  $1 or 2 for &quot;whatever they want&quot; from the snack<br/>\nsection.<br/>\n<br/>\n-- <br/>\nSara<br/>\nMomi to RayeAnne (&#39;01) and Arwen Vada (&#39;06)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":233098946,"authorName":"Lisa E Biesemeyer","from":"Lisa E Biesemeyer &lt;l.biesemeyer@...&gt;","profile":"l.biesemeyer@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Walk to the store","postDate":"1312644214","msgId":62210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTI2NDQyMTQuMzQ3Mi5ZYWhvb01haWxSQ0B3ZWI4MzUwMS5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGoxamFuMSs5ODRkQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxamFuMSs5ODRkQGVHcm91cHMuY29tPg=="},"prevInTopic":62209,"nextInTopic":62211,"prevInTime":62209,"nextInTime":62211,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"-=The children frequently (daily) choose not to leave the house and my wife regularly asks me to stop and pick up groceries in the bigger town, so as not to ","messageBody":"<div id=\"ygrps-yiv-710087345\">-=The children frequently (daily) choose not to leave the house and my wife <br/>\nregularly asks me to stop and pick up groceries in the bigger town, so as not to <br/>\nforce the children to leave against their wishes. This causes me a stress to <br/>\nmeet this need and my wife a stress when I don&#39;t meet the need.=-<br/>\n<br/>\nThere are some large grocery stores that do home delivery now. They may also do <br/>\noffice delivery. There are also some that have &quot;personal shoppers&quot; who will do <br/>\nthe shopping for you, and you need only to swing by and pick the groceries up on <br/>\nyour way home. These options could save everyone the stress. I know that both <br/>\noptions have worked very well for my young family.<br/>\n<br/>\nThere are also CSA style organizations like Planet Organics that allow you to <br/>\nshop online and deliver it to your home or office.<br/>\n<br/>\nLisa B (mama to Rowan, 5yo, Liam, 20.5mo, and Finnian, 20.5mo)<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Walk to the store","postDate":"1312634578","msgId":62209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxamNzaStvOG5sQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxaTd1Zitnc20yQGVHcm91cHMuY29tPg=="},"prevInTopic":62208,"nextInTopic":62210,"prevInTime":62208,"nextInTime":62210,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... My son was this way at two and three years old, and even occasionally at four and now at five.  Most of the time now, though, he will tell me he d rather I","messageBody":"<div id=\"ygrps-yiv-1520216812\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; <br/>\n&gt; She will walk to the store when I am home and (almost) every time, both children stop what they&#39;re doing to go with her.  Whenever she explains that she is going to the store, and that they can stay with me, they always choose to go.  When I am not home, she can&#39;t offer them a choice to stay.  Their choices are for everyone to stay home or everyone to go, and they always choose to stay home.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>My son was this way at two and three years old, and even occasionally at four and now at five.  Most of the time now, though, he will tell me he&#39;d rather I go do the errand while he stays home with daddy, and I will wait til evening when my husband is home.  My husband was patient, and did not want to try to make my son be with him against his will, and it payed off.  They spent more and more time doing fun things together when I was there, and now they are great buddies and have lots of fun playing. <br/>\n<br/>\nI know at first when this would happen when my son was younger, we would sometimes privately roll our eyes to eachother---it seems like, &#39;ugh, if he was going to go WITH me, I could have gone earlier when it was more convenient for ME.&#39;  But then, we got used to it, came to expect it, and just planned around it.  The kids want to be with their mother.  How can you work with that so it&#39;s least stressful for everyone?  Maybe you can ALL go together once you get home.  Maybe you  can sometimes go for your wife.  It&#39;s not going to necessarily be the same answer every time.  Maybe once you get home, you&#39;d like to take a walk yourself to the store?  Maybe that would be less stressful for you than going in the big town?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt; <br/>\n&gt; I&#39;m looking for a solution that can allow my wife to choose to walk to the store (which has a playground!) while I am at work.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>You could possibly say, flat out, &quot;I&#39;m not available to ever go to the store for you, so you&#39;re going to have to do it.&quot;  If that is true, then your wife will find ways to deal with it.  <br/>\n<br/>\nBut, it sounds like it may not be that you are never available, just that you are being asked too often.  And it sounds like you are annoyed that your children are choosing to be with their mother at the store over being with you at home and/or that you believe your wife is just not trying hard enough to convince them earler in the day.  Speaking from experience, it definitely is possible to have a child/children who absolutely would prefer to play at home than to go to a store (even if it &quot;has a playground!&quot;). But if the choice is to be with mama or without mama, MANY two and three year olds would drop what they&#39;re doing and go.  It&#39;s a different choice.  They are choosing not to be without their mama.  <br/>\n<br/>\nOverall, planning ahead so I don&#39;t run out of things, expecting that my son doesn&#39;t want to do errands often during the day, and (mostly when he was younger) expecting that he would want to go with me even if he could stay with his dad, has helped keep the stress surrounding groceries lower for all of us.  <br/>\n<br/>\nMaryann<br/>\nDS 5<br/>\nDD 21 mos</div>","specialLinks":[]},{"userId":125356544,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa_landen@...&gt;","profile":"lisa_landen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Walk to the store","postDate":"1312634222","msgId":62212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxamNoZStsdDhxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxaTd1Zitnc20yQGVHcm91cHMuY29tPg=="},"prevInTopic":62211,"nextInTopic":62213,"prevInTime":62211,"nextInTime":62213,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"Hi Benjamin! I have had similar struggles in my time as an unschooling parent--trying to find a balance between my needs and the needs of my children.  It took","messageBody":"<div id=\"ygrps-yiv-595693992\">Hi Benjamin!<br/>\n<br/>\nI have had similar struggles in my time as an unschooling parent--trying to find a balance between my needs and the needs of my children.  It took me a while, but I think I&#39;ve found it.<br/>\n<br/>\nI&#39;ve found a place where I am comfortable putting my needs ahead of my children&#39;s wants, if that is necessary.  Needs, after all, are essential for survival.  Parents, especially those who are with their children most of the day, can easily become deprived of their needs.  Going to the park, having food to eat, and even having time to oneself are needs that should be met, even if it is inconvenient for the children.<br/>\n<br/>\nIn the book, &quot;The Continuum Concept&quot;, I gained appreciation for the idea that children should be the satellites of their parents, that they should learn to fit into the rhythm of their parents&#39; lives, learn from it, and as a result, they naturally become considerate and functional members of their community.  I liked that idea, and I especially liked that it was a concept that native cultures had lived (and succeeded with) for hundreds of years.<br/>\n<br/>\nI also realized that children learn from their parents how to treat themselves and others.  If children always get exactly what they want at the expense of others, what will they learn? If children watch their parents neglecting their desires or needs, what will they learn? I thought they might learn to not value their own needs, and I didn&#39;t want that for them.<br/>\n<br/>\nSo I&#39;ve become comfortable with giving my children as much freedom as possible without sacrificing the family&#39;s or my own needs; it&#39;s a give and take.  If I need to go somewhere, they might gripe--but the come out of respect for me and it works out just fine.  We come back home and they can get back to their business, and we are all happy.<br/>\n<br/>\nSo my suggestion is this: compromise :)<br/>\nBest wishes,<br/>\nLisa</div>","specialLinks":[]},{"userId":458451437,"authorName":"Brenda Hoffman","from":"Brenda Hoffman &lt;wahmbrendamarie@...&gt;","profile":"couponlovinmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Walk to the store","postDate":"1312632479","msgId":62211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQkNpVlY9TnNZTTVwaWcwV0xySmhYVXhDaThlVzBiVFpDNGE9SEZhaHVaQmZ3M2ljd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62210,"nextInTopic":62212,"prevInTime":62210,"nextInTime":62212,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"I completely agree with Joyce when she said How about not asking? ;-) Say at a time between activities, Hey, I need some juice. Let s walk down to the","messageBody":"<div id=\"ygrps-yiv-2013918995\">I completely agree with Joyce when she said &quot;How about not asking? ;-) Say<br/>\nat a time between activities, &quot;Hey, I<br/>\nneed some juice. Let&#39;s walk down to the store.&quot; Include a treat or<br/>\nsomething they enjoy in the offer if the walk isn&#39;t enough. Just like<br/>\nshe&#39;d offer any other activity.&quot;<br/>\n<br/>\nI wouldn&#39;t put off what needs to be done just because they are resistant.<br/>\nLife must go on even though you&#39;re unschooling.  You can always offer to let<br/>\nthem choose the treat.  I&#39;d say &quot;We&#39;re going to the store in 10 minutes.<br/>\nWhile there you can choose a lollipop or a piece of fruit&quot;  Of course, it&#39;d<br/>\nbe up to you what the 2 treats are but it&#39;d be up to them to choose the<br/>\ntreat they&#39;re going there to get.  I&#39;d also try to do it near snack time so<br/>\nthat you could even go so far as to say that for snack time you are going to<br/>\nthe store where they get that choice.<br/>\n<br/>\n-- <br/>\n=^..^= BrendaMarie<br/>\nProud Christian Unschooler... Growing by God&#39;s<br/>\ngrace&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thechristianunschool.com\">http://www.thechristianunschool.com</a>&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Walk to the store","postDate":"1312632353","msgId":62208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxamFuMSs5ODRkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxaTd1Zitnc20yQGVHcm91cHMuY29tPg=="},"prevInTopic":62207,"nextInTopic":62209,"prevInTime":62207,"nextInTime":62209,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"Hi Benjamin, I have a 5 year old and 21 month old, and we have dealt with the same issues.  I can tell you a few things based on what you ve written.","messageBody":"<div id=\"ygrps-yiv-293272088\">Hi Benjamin,<br/>\n<br/>\nI have a 5 year old and 21 month old, and we have dealt with the same issues.  I can tell you a few things based on what you&#39;ve written.  Hopefully it helps.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; <br/>\n&gt; My name is Benjamin and I am the father of two children, two and three years old.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>This is VERY young.  Many small children resist being away from their mothers at these ages, especially when they are very attached to them (which is a good thing! :)  Many attached children these ages are still nursing, even.  My first child was.  It&#39;s very typical for two year olds and three year olds to want to be with their mama ALL the time, no matter how wonderful daddy or grandma really are.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;<br/>\n </span></blockquote>We have a small grocery store just a block down the street with local and organic food that can serve most of our grocery needs.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The children frequently (daily) choose not to leave the house and my wife regularly asks me to stop and pick up groceries in the bigger town, so as not to force the children to leave against their wishes.  This causes me a stress to meet this need and my wife a stress when I don&#39;t meet the need.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>My son, now 5, also frequently prefers to play at home rather than do errands with me.  I know this about him, and I have been working around it for about two years.  If it&#39;s possible for your wife to plan ahead so that she doesn&#39;t need something from the store daily, that could help alot.  If one of you make a big list and get what you think you will need in a weekly trip, that could lower the daily stress on everyone.<br/>\n<br/>\nAround here, I make a big trip every week or two.  Sometimes in between there, I realize I need a particular item at the store, and there are a few different things I might do.  First, I think about if I REALLY need the item, or if we could make due without it.  If it&#39;s an emergency, (which it RARELY EVER has been) like maybe if we were out of toilet paper, then I would make it as smooth and easy as possible getting us ready to go, explaining in a matter-of-fact way how badly we really needed toilet paper and how fast we would get out of there.  <br/>\n<br/>\nI&#39;d also take a snack and/or plan with them a snack or something we could buy or do at the store or afterward to help make the trip worth their while.  If your family is in walking distance, maybe they could choose if they ride in the wagon or stroller or ride bikes or blow bubbles along the way or eat popsicles or whatever they like doing, so it&#39;s still fun and not just a chore.<br/>\n<br/>\nBut, if their mother is asking them &quot;daily&quot; to go the store when they &quot;daily&quot; don&#39;t want to, I would say that is the main problem.  I have learned that my son is MUCH more willing to accommodate my &quot;emergencies&quot; if they really are rare occurrences. And, all those enticing things won&#39;t be enticing if they are used nearly every day.  <br/>\n<br/>\nSecond, most of the time that I &quot;need&quot; something, if I really think about it, I could do without or wait.  If I forgot a key ingredient for dinner tonight, I try to think of something different to make for which I have all the ingredients.  <br/>\n<br/>\nI don&#39;t like to cause my husband stress or ask him to do alot more than what he&#39;s already doing for us by going to work every day.  But, if I really need something, or if I think he may not mind or that he would be happy to have the thing, I ASK him.  I would text him and say, &#39;I was going to cook A tonight, but we would need this one ingredient--would you rather pick up the ingredient or have B instead?&#39;     He usually happily picks it up, or tells me he&#39;s already going to be late and asks if I still would want it late.  This happens, I don&#39;t know, maybe twice a month or less.  <br/>\n<br/>\nI will put more ideas in another post, since brevity is not a strength of mine....</div>","specialLinks":[]},{"userId":311108332,"authorName":"Eva","from":"&quot;Eva&quot; &lt;evawitsel@...&gt;","profile":"evawitsel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Walk to the store","postDate":"1312627767","msgId":62207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxajY3bitzZzQzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxaTd1Zitnc20yQGVHcm91cHMuY29tPg=="},"prevInTopic":62206,"nextInTopic":62208,"prevInTime":62206,"nextInTime":62208,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... My son is exactly the same. He wants to stay at home because he likes it there. And he wants to stay with me, because he likes that too :-) When he was","messageBody":"<div id=\"ygrps-yiv-497145225\">---The children frequently (daily) choose not to leave the house---<br/>\n---She will walk to the store when I am home and (almost) every time, both children stop what they&#39;re doing to go with her.---<br/>\n<br/>\nMy son is exactly the same. He wants to stay at home because he likes it there. And he wants to stay with me, because he likes that too :-)<br/>\n<br/>\nWhen he was 3-4-5 yo and I was alone at home with him and would ask him to come with me to the stores, he often would say no because he preferred to stay home. When my husband got home from work and I would go to the store by myself, he wanted to join me because he wanted to stay with me!<br/>\n<br/>\nOur solution for grocery shopping is to plan meals ahead so we only go twice a week. I go on saturdays and my husband goes on tuesday evening. Sometimes one of our children will join us, but they don&#39;t need to because on saturdays and tuesday evenings, there is always another parent at home.<br/>\n<br/>\nMy son is now 6 yo and a lot easier with going places. So that&#39;s another thing to consider, they will not stay this way forever!<br/>\n<br/>\nEva<br/>\nBerend (6) & Fiene (4)<br/>\nfrom the Netherlands</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Walk to the store","postDate":"1312623089","msgId":62206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFRDQ1RkE1LTMzOEEtNEFGNi1BOEMxLTE5MzU0RDZCMjgzNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGoxaTd1Zitnc20yQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxaTd1Zitnc20yQGVHcm91cHMuY29tPg=="},"prevInTopic":62205,"nextInTopic":62207,"prevInTime":62205,"nextInTime":62207,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"... If they re going it sounds like they enjoy it so if they re saying no it suggests their resistance is in how she s saying it during the day as opposed to","messageBody":"<div id=\"ygrps-yiv-226364241\">On Aug 5, 2011, at 10:12 PM, bkoltai9 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m looking for a solution that can allow my wife to choose to walk  <br/>\n&gt; to the store (which has a playground!) while I am at work.<br/>\n<br/>\n<br/>\n </span></blockquote>If they&#39;re going it sounds like they enjoy it so if they&#39;re saying no  <br/>\nit suggests their resistance is in how she&#39;s saying it during the day  <br/>\nas opposed to the evening. There may be tension in her voice, assuming  <br/>\nthey&#39;ll say no and dreading it. Or she&#39;s asking at the wrong time when  <br/>\nthey&#39;re involved in something. Or something!<br/>\n<br/>\nHow about not asking? ;-) Say at a time between activities, &quot;Hey, I  <br/>\nneed some juice. Let&#39;s walk down to the store.&quot; Include a treat or  <br/>\nsomething they enjoy in the offer if the walk isn&#39;t enough. Just like  <br/>\nshe&#39;d offer any other activity.<br/>\n<br/>\nJust because it&#39;s not offered as a choice doesn&#39;t mean they can&#39;t say  <br/>\nno. :-) And if she starts early enough in the day she can offer a few  <br/>\ntimes.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235357066,"authorName":"bkoltai9","from":"&quot;bkoltai9&quot; &lt;bkoltai9@...&gt;","profile":"bkoltai9","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Walk to the store","postDate":"1312596751","msgId":62205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxaTd1Zitnc20yQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62206,"prevInTime":62204,"nextInTime":62206,"topicId":62205,"numMessagesInTopic":0,"msgSnippet":"Greetings, My name is Benjamin and I am the father of two children, two and three years old. My wife discovered radical unschooling over two years ago and we","messageBody":"<div id=\"ygrps-yiv-1020636821\">Greetings,<br/>\n<br/>\nMy name is Benjamin and I am the father of two children, two and three years old.<br/>\n<br/>\nMy wife discovered radical unschooling over two years ago and we have slowly adjusted our lifestyle to accommodate our recognition of the value of their needs and choices.<br/>\n<br/>\nI run my own business and I usually work during the day in a nearby bigger town, while my wife stays home with the children in our small town.  We have a small grocery store just a block down the street with local and organic food that can serve most of our grocery needs.<br/>\n<br/>\nThe children frequently (daily) choose not to leave the house and my wife regularly asks me to stop and pick up groceries in the bigger town, so as not to force the children to leave against their wishes.  This causes me a stress to meet this need and my wife a stress when I don&#39;t meet the need.<br/>\n<br/>\nShe will walk to the store when I am home and (almost) every time, both children stop what they&#39;re doing to go with her.  Whenever she explains that she is going to the store, and that they can stay with me, they always choose to go.  When I am not home, she can&#39;t offer them a choice to stay.  Their choices are for everyone to stay home or everyone to go, and they always choose to stay home.<br/>\n<br/>\nI&#39;m looking for a solution that can allow my wife to choose to walk to the store (which has a playground!) while I am at work.<br/>\n<br/>\nThanks everyone.<br/>\n<br/>\n-Benjamin</div>","specialLinks":[]}],"prevTopicId":62215,"nextTopicId":62263}}