{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":39,"messages":[{"userId":129521018,"authorName":"Mary Draper","from":"Mary Draper &lt;ruffmo@...&gt;","profile":"secondmocat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [SPAM] [AlwaysLearning] Re: off topic,first dentist soon","postDate":"1183049991","msgId":29640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTgwMWM3YjlhNSRiZjdkZTVmMCQwMjAxYThjMEBtYXJ5ZGVsbGxhcHRvPg==","inReplyToHeader":"PGY2MGptaCs0Zjg0QGVHcm91cHMuY29tPg=="},"prevInTopic":29639,"nextInTopic":29641,"prevInTime":29639,"nextInTime":29641,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"-=-I think if orthodontia didn t exist, I d likely be a vegan, and still have tremendous headaches.-=- I had braces.  Years later, I chose to be vegan.  I","messageBody":"<div id=\"ygrps-yiv-1151510672\">-=-I think if orthodontia didn&#39;t exist, I&#39;d likely be a vegan, and still<br/>\nhave tremendous headaches.-=-<br/>\n<br/>\n<br/>\n<br/>\nI had braces.  Years later, I chose to be vegan.  I don&#39;t understand why you<br/>\nmentioned the likelihood of being vegan if orthodontia didn&#39;t exist.  Are<br/>\nyou suggesting vegans don&#39;t eat a variety of foods that require chewing?<br/>\n<br/>\n <br/>\n<br/>\nMary<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125182846,"authorName":"alexandriapalonia","from":"&quot;alexandriapalonia&quot; &lt;alexandriapalonia@...&gt;","profile":"alexandriapalonia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1183044113","msgId":29639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2MGptaCs0Zjg0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU4MDIxMy4yODIzNS5xbUB3ZWI4MzYxMC5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":29633,"nextInTopic":29640,"prevInTime":29638,"nextInTime":29640,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I think many people were like me: I was unable to eat an orange before orthodontics.  When I bit down, only two of my teeth touched, and they weren t two that","messageBody":"<div id=\"ygrps-yiv-2019146642\">I think many people were like me: I was unable to eat an orange before<br/>\northodontics.  When I bit down, only two of my teeth touched, and they<br/>\nweren&#39;t two that were supposed to.<br/>\nBecause of the way I was chewing (to get the teeth to connect--and<br/>\nstill, I remember sitting at the table for HOURS after everyone else<br/>\nhad finished, chewing and chewing and chewing on something simple like<br/>\na chicken leg), because of that, I had huge problems with TMJ, and<br/>\nchronic headaches.<br/>\n<br/>\nThe problem with orthodontics of that time period is that the work<br/>\nthat was done dramatically reduced the lengh of the roots of the<br/>\nteeth, so many of us are at risk for other problems.  I had an<br/>\nextremely progressive orthodontist, who didn&#39;t do extractions (which<br/>\nhas always puzzled me, until the hygenist pointed out the other day<br/>\nthat it&#39;s now considered generally unethical), and who capitalized on<br/>\nmy 14yo vanity by showing before-and-after shots of what teeth that<br/>\naren&#39;t cared for look like.<br/>\n<br/>\nConsequently, I am able to eat chicken and oranges, have a nice smile,<br/>\nand very few cavities (all pre-orthodontics).<br/>\nI think if orthodontia didn&#39;t exist, I&#39;d likely be a vegan, and still<br/>\nhave tremendous headaches.<br/>\n<br/>\nIt is my opinion that establishing good dental habits very early in<br/>\nlife is an extraordinary gift to give your child(ren).  Even if they<br/>\nchoose to let it slide later, you can contribute to a joyful and<br/>\npeaceful childhood by helping assure that dental visits are pain and<br/>\nanxiety free.<br/>\n<br/>\nAndrea<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The world of orthodontics is a curious one to me. What did people do<br/>\n </span></blockquote>before&gt; it existed? Did their mouths cave in? I have a hard time<br/>\nbelieving that&gt; there is as much *need* (as in health would<br/>\ndeteriorate without it) for&gt; orthodontic work as there are braces on<br/>\nkids. It seems like in many cases&gt; orthodontic work is more a choice<br/>\n(or should be) than helping a serious&gt; health issue. And at the same<br/>\ntime, I&#39;m sure there is SOME useful need for&gt; it.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My youngest (13) has very crooked teeth. I&#39;ve asked him if he was<br/>\n </span></blockquote>interested&gt; in braces. So far he&#39;s said no. Many of his friends have<br/>\nbeen to the&gt; orthodontist and have been made to wear braces. Some of<br/>\nthem didn&#39;t seem to&gt; even have crooked teeth. And most of them don&#39;t<br/>\nfollow the recommendations&gt; for keeping the braces clean and in good<br/>\nshape.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Jacki, who may find out from this post that there is a world of<br/>\n </span></blockquote>serious&gt; health issues she didn&#39;t know about...<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":243658648,"authorName":"tyra beaulieu","from":"tyra beaulieu &lt;tyralyn14@...&gt;","profile":"tyralyn14","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: off topic,first dentist soon","postDate":"1183001323","msgId":29633,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3NTY0OS4yNzk4NC5xbUB3ZWI4MzYxMC5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PEQwQUExNDA1QjYwOTRCQjE5M0JFRTMyRUI1RjY2MkZGQFJvYnluUEM+"},"prevInTopic":29632,"nextInTopic":29639,"prevInTime":29632,"nextInTime":29634,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"good for you. that is exactly what i would have done!!!! I sat in on every class when my son wanted to take tap class. he didn t want me to leave so i sat","messageBody":"<div id=\"ygrps-yiv-1057232524\">good for you. that is exactly what i would have done!!!! I sat in on every class when my son wanted to take tap class. he didn&#39;t want me to leave so i sat quietly on the floor in the back of the room. i think its important to reassure your kids that you will be there for them when<br/>\n  they need you no matter what the issue is.<br/>\n  tyra<br/>\n<br/>\n&quot;Robyn L. Coburn&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a>&gt; wrote:<br/>\n          &lt;&lt;&lt; I&#39;m sure she would&#39;ve done just fine without me, but the fact is she<br/>\n<blockquote><span title=\"ireply\"> &gt; would&#39;ve kept it all to herself, but really it wouldn&#39;t have changed<br/>\n&gt; the fact that she needed me there. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>When Jayn first began dancing at 3.5 she was too scared to dance without me <br/>\nthere. The teacher normally doesn&#39;t allow spectators - to keep a <br/>\nnon-judgmental atmosphere - but encourages parents to tip toe and peek every <br/>\nnow and then. However she let that go for Jayn&#39;s comfort.<br/>\n<br/>\nShe and crying Jayn appeared at her front door, to find me lurking very <br/>\nnervously outside - I had a feeling Jayn wouldn&#39;t last. Then I sat on the <br/>\nfloor of the dance class for the first year. Jayn would run over several <br/>\ntimes during the class to get a kissy. Over the course of the seven months <br/>\nof classes I moved from the floor of the class to the stairwell. I would <br/>\nbring a book with me.<br/>\n<br/>\nThe second year, again relaxing her usual rule, I waited downstairs in the <br/>\nteacher&#39;s living room during the class (a huge improvement in my comfort).<br/>\n<br/>\nNow having just completed her fourth year of dancing, Jayn is completely <br/>\ncomfortable, and I can even go off on errands during the class.<br/>\n<br/>\nWhen one of the dental surgeons we visited threatened Jayn that she would <br/>\nsend dh and I out if Jayn didn&#39;t open her mouth and sit quietly, James and I <br/>\nwere horrified. The ds clearly assumed that we would back up that play, but <br/>\nJayn was terrified, and we all left instead. Lucky for us she is not one to <br/>\nsuppress her own feelings!<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":243658648,"authorName":"tyra beaulieu","from":"tyra beaulieu &lt;tyralyn14@...&gt;","profile":"tyralyn14","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] off topic,first dentist soon","postDate":"1183001068","msgId":29632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4MDIxMy4yODIzNS5xbUB3ZWI4MzYxMC5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVBSEhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":29630,"nextInTopic":29633,"prevInTime":29631,"nextInTime":29633,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"wow people are really having a hard time with my email about when to go to the dentist. I worked in a pedi/adult dental office for about 4 years and i saw some","messageBody":"<div id=\"ygrps-yiv-1410959611\">wow people are really having a hard time with my email about when to go to the dentist. I worked in a pedi/adult dental office for about 4 years and i saw some horrible stuff in peoples mouths, especially kids. the standards for A LOT of things have changed even since my 7 year old was a baby. it is very important to keep updated on all health care related issuse that may affect your children.  As far as what is wrong with my sons teeth? if i let it go he would have a mouth like a pug dog, bottom teeth jutting out under his top teeth. this of course could lead to jaw problems making it hard to chew and possibly eroding the jaw bone itself over the long road.most orthodontic work is not purely for &quot;crooked teeth&quot;. a lot of the time it is for a bite problem. i had a similar problem and nothing was done until i made the descision to get braces in my 20&#39;s. now my jaw bone is flat on one side and chewing anything for too long really hurts i.e gum, caramel etc.  As far as what<br/>\n did people do before.....they were probably in pain just like MANY of the people back when a lot of medical/dental help was in its infancy. many people just walked around with no teeth because they fell out and if you were lucky enough to get them fixed and had the money what did you get...wood, animal bone, cadaver teeth. the internet is a great place to find out what happens to people when they don&#39;t take care of their teeth. just look at the pics. they are really gross and it is more common thatn you think.<br/>\n<br/>\nGold Standard &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jacki@...\">jacki@...</a>&gt; wrote:          &gt;&gt;It is super important that they see the dentist for the first time no<br/>\nlater than 2 years of age.&lt;&lt;<br/>\n<br/>\nSays who?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It will only be a quick tooth count and simple cleaning but&lt;&lt;<br/>\n<br/>\n </span></blockquote>I&#39;ve been to many different dentist offices, and no one of them seem to be<br/>\non the same schedule. I think this is pretty individual, though I know that<br/>\nin general most of them are following the latest doctrine of the American<br/>\nDental Association, which has changed its recommendations many times over<br/>\nthe years.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;it is sooooo important that their baby teeth are healthy before their<br/>\n </span></blockquote>permanent teeth come in.&lt;&lt;<br/>\n<br/>\nThe exact opposite of what the standard recommendation was when my kids were<br/>\nthat age. I was told that their baby teeth would fall out and that their<br/>\nbaby teeth would not influence their second teeth at all. There was not as<br/>\nmuch emphasis on dental care for babies at that time, and I don&#39;t see any<br/>\nnegative result from that with these kids who are now teenagers and adults.<br/>\n<br/>\nThese recommendations are a good example of blanket &quot;rules&quot; in medicine that<br/>\ndon&#39;t individualize for our kids and our situations. Examples of the need to<br/>\nresearch and find real and true information. I trust that many intelligent<br/>\nparents would be able to take good measures for their kids&#39; teeth without a<br/>\nlot of dentist intervention.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My oldest son has a bite misalignment but i<br/>\n&gt;&gt;would not have known how serious it was had i not brought him in. he has<br/>\n </span></blockquote>to see an orthodontist and he&#39;s only 7.&lt;&lt;<br/>\n<br/>\nHow serious is it? What would supposedly happen if you didn&#39;t know and<br/>\ndidn&#39;t do anything?<br/>\n<br/>\nThe world of orthodontics is a curious one to me. What did people do before<br/>\nit existed? Did their mouths cave in? I have a hard time believing that<br/>\nthere is as much *need* (as in health would deteriorate without it) for<br/>\northodontic work as there are braces on kids. It seems like in many cases<br/>\northodontic work is more a choice (or should be) than helping a serious<br/>\nhealth issue. And at the same time, I&#39;m sure there is SOME useful need for<br/>\nit.<br/>\n<br/>\nMy youngest (13) has very crooked teeth. I&#39;ve asked him if he was interested<br/>\nin braces. So far he&#39;s said no. Many of his friends have been to the<br/>\northodontist and have been made to wear braces. Some of them didn&#39;t seem to<br/>\neven have crooked teeth. And most of them don&#39;t follow the recommendations<br/>\nfor keeping the braces clean and in good shape.<br/>\n<br/>\nJacki, who may find out from this post that there is a world of serious<br/>\nhealth issues she didn&#39;t know about...<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":243658648,"authorName":"tyra beaulieu","from":"tyra beaulieu &lt;tyralyn14@...&gt;","profile":"tyralyn14","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: off topic,first dentist soon","postDate":"1182999918","msgId":29630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMTU0My4yMDQ5Mi5xbUB3ZWI4MzYxMC5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGY1dTVhYSsxcm84QGVHcm91cHMuY29tPg=="},"prevInTopic":29628,"nextInTopic":29632,"prevInTime":29629,"nextInTime":29631,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"i stated that and that is what is recommended. my kids have been going since 1 and they have no cavities, no fear of the dentists and my DENTAL INSURANCE pays","messageBody":"<div id=\"ygrps-yiv-392646160\">i stated that and that is what is recommended. my kids have been going since 1 and they have no cavities, no fear of the dentists and my DENTAL INSURANCE pays for it..in full. plus you can&#39;t always see interproximal caries, cavities between teeth, and walking around with a mouth full of decay not only tatses bad, but it hurts, can lead to severe cavities that require root canals, pulpotomies on baby teeth, and even abcesses which are infections!!!! and that REALLY hurts. i want my kids to know how important it is to keep their own teeth not caps, bridges, veneers or God forbid dentures.<br/>\n<br/>\njenstarc4 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenstarc4@...\">jenstarc4@...</a>&gt; wrote:           --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Gold Standard&quot; &lt;jacki@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;It is super important that they see the dentist for the first <br/>\n </span></blockquote>time no<br/>\n<blockquote><span title=\"ireply\"> &gt; later than 2 years of age.&lt;&lt;<br/>\n&gt; <br/>\n&gt; Says who?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I wonder that too. My oldest daughter didn&#39;t see a dentist until she <br/>\nwas 6 or 7. She had a couple of cavities that they filled and a <br/>\ncouple they left to wait until they fell out and were replaced with <br/>\ngood healthy adult teeth. That encompassed 2 visits to the dentist, <br/>\none to check and clean, and another to fill the cavities.<br/>\n<br/>\nFastforward to now, she just went to the dentist about a month ago, <br/>\nthis would be her third trip to the dentist. No cavities, clean <br/>\nteeth, probably genetic. She has a couple of teeth that need to come <br/>\nout because her adult teeth are trying to come in under them. She <br/>\nsaid &quot;no way&quot;, even though they highly recommended it and I later <br/>\nexplained why they recommended it. She still says &quot;no way&quot;. I put <br/>\nup a sticky note in the bathroom to remind her to wiggle her teeth, <br/>\nso they can come out soon, before they force her adult teeth to come <br/>\nin, in places they shouldn&#39;t and hopefully avoid braces.<br/>\n<br/>\nChamille is 13 and has had a total of 4 cavities, 2 of them were <br/>\nfilled, with a total number of 3 trips to the dentist. I really <br/>\ndon&#39;t see how taking her at the age of 1 or 2 would have done <br/>\nanything but cost me money I didn&#39;t have! She hardly had any teeth <br/>\nat that age anyway.<br/>\n<br/>\nMy 5 yr old has cavities, you can see them. It&#39;s from extended <br/>\nnursing. Sometimes they hurt and sometimes they don&#39;t. She doesn&#39;t <br/>\nwant to go to the dentist. If they start hurting so much that it <br/>\ninterferes with living happily and eating what she wants, we will go <br/>\nto the dentist. She absolutely never would&#39;ve tolerated a dentist at <br/>\nthe age of 2!<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125182846,"authorName":"alexandriapalonia","from":"&quot;alexandriapalonia&quot; &lt;alexandriapalonia@...&gt;","profile":"alexandriapalonia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1182997466","msgId":29628,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1djY0cStwb28xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY1cnQ1biszMTNpQGVHcm91cHMuY29tPg=="},"prevInTopic":29623,"nextInTopic":29630,"prevInTime":29627,"nextInTime":29629,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"We didn t bother with a pediatric dentist, just took eldest dd along to ours starting at 2yo. We had the world s grumpiest dentist with zero bedside manner. He","messageBody":"<div id=\"ygrps-yiv-2013684417\">We didn&#39;t bother with a pediatric dentist, just took eldest dd along<br/>\nto ours starting at 2yo.  <br/>\n<br/>\nWe had the world&#39;s grumpiest dentist with zero bedside manner.  <br/>\nHe had the best hygenists.<br/>\n<br/>\nShe loved it there.<br/>\nI think she was the only child patient he had.<br/>\n<br/>\nI imagine going for the first time at 6 would be far more traumatic<br/>\nthan hitting the double-digit visit at that point.  I&#39;ve always been<br/>\nwelcome to hang out near by, though in recent years, we&#39;ve just<br/>\nstarted double-booking, because, as a pre-teen, she doesn&#39;t feel the<br/>\nneed for me to be there every minute.<br/>\n<br/>\nI might check into a regular dentist, if only to have the contrast<br/>\nwith office policies.  <br/>\n<br/>\nAndrea<br/>\n19W24</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] off topic,first dentist soon","postDate":"1182992070","msgId":29623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1ZmFhYjg4NWVlNDQ4NzQ0MDRjMTAxNGM3N2Y2NjI3QGNveC5uZXQ+","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHR0VBTEhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHR0VBTEhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":29620,"nextInTopic":29628,"prevInTime":29622,"nextInTime":29624,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... Now you have to check out this YouTube clip from the Simpsons, of The Big Book of British Smiles http://www.youtube.com/watch?v=DGjhEM-lkZI I have very","messageBody":"<div id=\"ygrps-yiv-763775714\">On Jun 27, 2007, at 3:12 PM, Gold Standard wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; American&#39;s are such a mishmosh of different<br/>\n&gt;&gt;&gt; ethnic groups. In their native land, Italians had Italian sized teeth<br/>\n&gt;&gt;&gt; that fit Italian sized jaws. Romanians had Romanian sized teeth that<br/>\n&gt;&gt;&gt; fit Romanian sized jaws. But Americans have mixed the teeth and jaws<br/>\n&gt;&gt;&gt; so they&#39;re less likely to fit.&lt;&lt;<br/>\n&gt;<br/>\n&gt; Holy Incisors!! That&#39;s amazing! I&#39;ve never heard of it before!<br/>\n&gt;<br/>\n&gt; Thanks Joyce! It is a starting point for my new research subject :o)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Now you have to check out this YouTube clip from the Simpsons, of The <br/>\nBig Book of British Smiles<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=DGjhEM-lkZI\">http://www.youtube.com/watch?v=DGjhEM-lkZI</a><br/>\n<br/>\nI have very large teeth (mom) and a relatively small jaw (English via <br/>\nAmerican South dad) and would have had one of these smiles had it not <br/>\nbeen for orthodontia and 8 extractions to fit &#39;em all.<br/>\n<br/>\nNancy  :-D</div>","specialLinks":[{"url":"http://www.youtube.com/embed/DGjhEM-lkZI?wmode=opaque","type":"VIDEO"}]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] off topic,first dentist soon","postDate":"1182982345","msgId":29620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHR0VBTEhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PEQ0ODlDRjk3LThFNTUtNEREMC04MTEzLTY2OTM1MDVGNjA1M0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":29619,"nextInTopic":29623,"prevInTime":29619,"nextInTime":29621,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... Holy Incisors!! That s amazing! I ve never heard of it before! Thanks Joyce! It is a starting point for my new research subject :o) Jacki","messageBody":"<div id=\"ygrps-yiv-1945636461\"><blockquote><span title=\"ireply\">&gt;&gt; American&#39;s are such a mishmosh of different <br/>\n&gt;&gt;ethnic groups. In their native land, Italians had Italian sized teeth <br/>\n&gt;&gt;that fit Italian sized jaws. Romanians had Romanian sized teeth that <br/>\n&gt;&gt;fit Romanian sized jaws. But Americans have mixed the teeth and jaws <br/>\n&gt;&gt;so they&#39;re less likely to fit.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Holy Incisors!! That&#39;s amazing! I&#39;ve never heard of it before! <br/>\n<br/>\nThanks Joyce! It is a starting point for my new research subject :o)<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] off topic,first dentist soon","postDate":"1182976321","msgId":29619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0ODlDRjk3LThFNTUtNEREMC04MTEzLTY2OTM1MDVGNjA1M0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVBSEhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVBSEhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":29617,"nextInTopic":29620,"prevInTime":29618,"nextInTime":29620,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... What I heard is that it s mostly an American thing -- though that s changing a bit -- because American s are such a mishmosh of different ethnic groups. In","messageBody":"<div id=\"ygrps-yiv-61349336\">On Jun 27, 2007, at 11:46 AM, Gold Standard wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The world of orthodontics is a curious one to me. What did people  <br/>\n&gt; do before<br/>\n&gt; it existed?<br/>\n<br/>\n </span></blockquote>What I heard is that it&#39;s mostly an American thing -- though that&#39;s  <br/>\nchanging a bit -- because American&#39;s are such a mishmosh of different  <br/>\nethnic groups. In their native land, Italians had Italian sized teeth  <br/>\nthat fit Italian sized jaws. Romanians had Romanian sized teeth that  <br/>\nfit Romanian sized jaws. But Americans have mixed the teeth and jaws  <br/>\nso they&#39;re less likely to fit.<br/>\n<br/>\nDon&#39;t know if it&#39;s true but it sounds right.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1182963850","msgId":29617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1dTVhYSsxcm84QGVHcm91cHMuY29tPg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVBSEhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":29616,"nextInTopic":29619,"prevInTime":29616,"nextInTime":29618,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... time no ... I wonder that too.  My oldest daughter didn t see a dentist until she was 6 or 7.  She had a couple of cavities that they filled and a couple","messageBody":"<div id=\"ygrps-yiv-1254334003\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Gold Standard&quot; &lt;jacki@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;It is super important that they see the dentist for the first <br/>\n </span></blockquote>time no<br/>\n<blockquote><span title=\"ireply\"> &gt; later than 2 years of age.&lt;&lt;<br/>\n&gt; <br/>\n&gt; Says who?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I wonder that too.  My oldest daughter didn&#39;t see a dentist until she <br/>\nwas 6 or 7.  She had a couple of cavities that they filled and a <br/>\ncouple they left to wait until they fell out and were replaced with <br/>\ngood healthy adult teeth.  That encompassed 2 visits to the dentist, <br/>\none to check and clean, and another to fill the cavities.<br/>\n<br/>\nFastforward to now, she just went to the dentist about a month ago, <br/>\nthis would be her third trip to the dentist.  No cavities, clean <br/>\nteeth, probably genetic.  She has a couple of teeth that need to come <br/>\nout because her adult teeth are trying to come in under them.  She <br/>\nsaid &quot;no way&quot;, even though they highly recommended it and I later <br/>\nexplained why they recommended it.  She still says &quot;no way&quot;.  I put <br/>\nup a sticky note in the bathroom to remind her to wiggle her teeth, <br/>\nso they can come out soon, before they force her adult teeth to come <br/>\nin, in places they shouldn&#39;t and hopefully avoid braces.<br/>\n<br/>\nChamille is 13 and has had a total of 4 cavities, 2 of them were <br/>\nfilled, with a total number of 3 trips to the dentist.  I really <br/>\ndon&#39;t see how taking her at the age of 1 or 2 would have done <br/>\nanything but cost me money I didn&#39;t have!  She hardly had any teeth <br/>\nat that age anyway.<br/>\n<br/>\nMy 5 yr old has cavities, you can see them.  It&#39;s from extended <br/>\nnursing.  Sometimes they hurt and sometimes they don&#39;t.  She doesn&#39;t <br/>\nwant to go to the dentist.  If they start hurting so much that it <br/>\ninterferes with living happily and eating what she wants, we will go <br/>\nto the dentist.  She absolutely never would&#39;ve tolerated a dentist at <br/>\nthe age of 2!</div>","specialLinks":[]},{"userId":212831948,"authorName":"halfshadow1","from":"&quot;halfshadow1&quot; &lt;halfshadow1@...&gt;","profile":"halfshadow1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1182963513","msgId":29616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1dTR2cCs3ZHN2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVBSEhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":29615,"nextInTopic":29617,"prevInTime":29615,"nextInTime":29617,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"-I have been beating myself up with...why the hell didn t i take him sooner and ...will these people think i m a bad mom because he s 5 and hasn t been to a","messageBody":"<div id=\"ygrps-yiv-1774553880\">-I have been beating myself up with...why the hell didn&#39;t i take him<br/>\nsooner and ...will these people think i&#39;m a bad mom because he&#39;s 5 and<br/>\nhasn&#39;t been to a dentist...So, i was worried a little posting this<br/>\nquestion. It had to do with money, so many co-pays made us broke and<br/>\nmy ds doesn&#39;t make alot. plus, i just knew my son would never had sit<br/>\nin an office when he was younger but now it might happen...i know my<br/>\nson. so, thanks for writing this.-- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>,<br/>\n&quot;Gold Standard&quot; &lt;jacki@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;It is super important that they see the dentist for the first time no<br/>\n&gt; later than 2 years of age.&lt;&lt;<br/>\n&gt; <br/>\n&gt; Says who?<br/>\n&gt; <br/>\n&gt; &gt;&gt;It will only be a quick tooth count and simple cleaning but&lt;&lt;<br/>\n&gt; <br/>\n&gt; I&#39;ve been to many different dentist offices, and no one of them seem<br/>\n </span></blockquote>to be<br/>\n<blockquote><span title=\"ireply\"> &gt; on the same schedule. I think this is pretty individual, though I<br/>\n </span></blockquote>know that<br/>\n<blockquote><span title=\"ireply\"> &gt; in general most of them are following the latest doctrine of the<br/>\n </span></blockquote>American<br/>\n<blockquote><span title=\"ireply\"> &gt; Dental Association, which has changed its recommendations many times<br/>\n </span></blockquote>over<br/>\n<blockquote><span title=\"ireply\"> &gt; the years.<br/>\n&gt; <br/>\n&gt; &gt;&gt;it is sooooo important that their baby teeth are healthy before their<br/>\n&gt; permanent teeth come in.&lt;&lt;<br/>\n&gt; <br/>\n&gt; The exact opposite of what the standard recommendation was when my<br/>\n </span></blockquote>kids were<br/>\n<blockquote><span title=\"ireply\"> &gt; that age. I was told that their baby teeth would fall out and that their<br/>\n&gt; baby teeth would not influence their second teeth at all. There was<br/>\n </span></blockquote>not as<br/>\n<blockquote><span title=\"ireply\"> &gt; much emphasis on dental care for babies at that time, and I don&#39;t<br/>\n </span></blockquote>see any<br/>\n<blockquote><span title=\"ireply\"> &gt; negative result from that with these kids who are now teenagers and<br/>\n </span></blockquote>adults.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; These recommendations are a good example of blanket &quot;rules&quot; in<br/>\n </span></blockquote>medicine that<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t individualize for our kids and our situations. Examples of the<br/>\n </span></blockquote>need to<br/>\n<blockquote><span title=\"ireply\"> &gt; research and find real and true information. I trust that many<br/>\n </span></blockquote>intelligent<br/>\n<blockquote><span title=\"ireply\"> &gt; parents would be able to take good measures for their kids&#39; teeth<br/>\n </span></blockquote>without a<br/>\n<blockquote><span title=\"ireply\"> &gt; lot of dentist intervention.<br/>\n&gt; <br/>\n&gt; &gt;&gt;My oldest son has a bite misalignment but i<br/>\n&gt; &gt;&gt;would not have known how serious it was had i not brought him in.<br/>\n </span></blockquote>he has<br/>\n<blockquote><span title=\"ireply\"> &gt; to see an orthodontist and he&#39;s only 7.&lt;&lt;<br/>\n&gt; <br/>\n&gt; How serious is it? What would supposedly happen if you didn&#39;t know and<br/>\n&gt; didn&#39;t do anything?<br/>\n&gt; <br/>\n&gt; The world of orthodontics is a curious one to me. What did people do<br/>\n </span></blockquote>before<br/>\n<blockquote><span title=\"ireply\"> &gt; it existed? Did their mouths cave in? I have a hard time believing that<br/>\n&gt; there is as much *need* (as in health would deteriorate without it) for<br/>\n&gt; orthodontic work as there are braces on kids. It seems like in many<br/>\n </span></blockquote>cases<br/>\n<blockquote><span title=\"ireply\"> &gt; orthodontic work is more a choice (or should be) than helping a serious<br/>\n&gt; health issue. And at the same time, I&#39;m sure there is SOME useful<br/>\n </span></blockquote>need for<br/>\n<blockquote><span title=\"ireply\"> &gt; it.<br/>\n&gt; <br/>\n&gt; My youngest (13) has very crooked teeth. I&#39;ve asked him if he was<br/>\n </span></blockquote>interested<br/>\n<blockquote><span title=\"ireply\"> &gt; in braces. So far he&#39;s said no. Many of his friends have been to the<br/>\n&gt; orthodontist and have been made to wear braces. Some of them didn&#39;t<br/>\n </span></blockquote>seem to<br/>\n<blockquote><span title=\"ireply\"> &gt; even have crooked teeth. And most of them don&#39;t follow the<br/>\n </span></blockquote>recommendations<br/>\n<blockquote><span title=\"qreply\"> &gt; for keeping the braces clean and in good shape.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Jacki, who may find out from this post that there is a world of serious<br/>\n&gt; health issues she didn&#39;t know about...<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] off topic,first dentist soon","postDate":"1182959204","msgId":29615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVBSEhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PDQ5NTM5Ny40NDg4OS5xbUB3ZWI4MzYwNy5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":29614,"nextInTopic":29616,"prevInTime":29614,"nextInTime":29616,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... later than 2 years of age.","messageBody":"<div id=\"ygrps-yiv-2054043671\"><blockquote><span title=\"ireply\">&gt;&gt;It is super important that they see the dentist for the first time no<br/>\n </span></blockquote>later than 2 years of age.&lt;&lt;<br/>\n<br/>\nSays who?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It will only be a quick tooth count and simple cleaning but&lt;&lt;<br/>\n<br/>\n </span></blockquote>I&#39;ve been to many different dentist offices, and no one of them seem to be<br/>\non the same schedule. I think this is pretty individual, though I know that<br/>\nin general most of them are following the latest doctrine of the American<br/>\nDental Association, which has changed its recommendations many times over<br/>\nthe years.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;it is sooooo important that their baby teeth are healthy before their<br/>\n </span></blockquote>permanent teeth come in.&lt;&lt;<br/>\n<br/>\nThe exact opposite of what the standard recommendation was when my kids were<br/>\nthat age. I was told that their baby teeth would fall out and that their<br/>\nbaby teeth would not influence their second teeth at all. There was not as<br/>\nmuch emphasis on dental care for babies at that time, and I don&#39;t see any<br/>\nnegative result from that with these kids who are now teenagers and adults.<br/>\n<br/>\nThese recommendations are a good example of blanket &quot;rules&quot; in medicine that<br/>\ndon&#39;t individualize for our kids and our situations. Examples of the need to<br/>\nresearch and find real and true information. I trust that many intelligent<br/>\nparents would be able to take good measures for their kids&#39; teeth without a<br/>\nlot of dentist intervention.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My oldest son has a bite misalignment but i<br/>\n&gt;&gt;would not have known how serious it was had i not brought him in. he has<br/>\n </span></blockquote>to see an orthodontist and he&#39;s only 7.&lt;&lt;<br/>\n<br/>\nHow serious is it? What would supposedly happen if you didn&#39;t know and<br/>\ndidn&#39;t do anything?<br/>\n<br/>\nThe world of orthodontics is a curious one to me. What did people do before<br/>\nit existed? Did their mouths cave in? I have a hard time believing that<br/>\nthere is as much *need* (as in health would deteriorate without it) for<br/>\northodontic work as there are braces on kids. It seems like in many cases<br/>\northodontic work is more a choice (or should be) than helping a serious<br/>\nhealth issue. And at the same time, I&#39;m sure there is SOME useful need for<br/>\nit.<br/>\n<br/>\nMy youngest (13) has very crooked teeth. I&#39;ve asked him if he was interested<br/>\nin braces. So far he&#39;s said no. Many of his friends have been to the<br/>\northodontist and have been made to wear braces. Some of them didn&#39;t seem to<br/>\neven have crooked teeth. And most of them don&#39;t follow the recommendations<br/>\nfor keeping the braces clean and in good shape.<br/>\n<br/>\n<br/>\nJacki, who may find out from this post that there is a world of serious<br/>\nhealth issues she didn&#39;t know about...</div>","specialLinks":[]},{"userId":243658648,"authorName":"tyra beaulieu","from":"tyra beaulieu &lt;tyralyn14@...&gt;","profile":"tyralyn14","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] off topic,first dentist soon","postDate":"1182956775","msgId":29614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5NTM5Ny40NDg4OS5xbUB3ZWI4MzYwNy5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGY1cGxhbitlYTNpQGVHcm91cHMuY29tPg=="},"prevInTopic":29613,"nextInTopic":29615,"prevInTime":29613,"nextInTime":29615,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I don t know where you live but here in CT that is NOT the way children are seen. I worked for a pediatric /adult dentist for almost 4 years and the parents","messageBody":"<div id=\"ygrps-yiv-922457402\">I don&#39;t know where you live but here in CT that is NOT the way children are seen. I worked for a pediatric /adult dentist for almost 4 years and the parents were and still are always allowed back. As a matter of fact they were even allowed in the operating room when the kids had severe teeth problems and needed to be anesthetized. They would stay till their kid fell asleep. This dentist and his office is totally out of line. they work for you not the other way around. if it wasn&#39;t for you they would be out of business. on another note please don&#39;t wait any longer to bring your son to the dentist or if you have any other kids. It is super important that they see the dentist for the first time no later than 2 years of age. It will only be a quick tooth count and simple cleaning but it is sooooo important that their baby teeth are healthy before their permanent teeth come in. my kids starting seeing the DMD when they turned 1year. My oldest son has a bite misalignment but i<br/>\n would not have known how serious it was had i not brought him in. he has to see an orthodontist and he&#39;s only 7. Good luck with your endeavor and remember YOU are your child&#39;s only advocate and the Dr. is NOT always right. Your son has no one else to stand up for him except you. i would hate for him to be scared of the DMD for the rest of his life because one DMD is a schmo.<br/>\n  tyra<br/>\n<br/>\nhalfshadow1 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:halfshadow1@...\">halfshadow1@...</a>&gt; wrote:<br/>\n          I wanted some opinions here and i will post on veryyoungkidsteeth.<br/>\nI called a *childrens* dentist office today and inquired about how<br/>\nthey do things with children for the first visit.<br/>\nI asked her what it would be like for my son(6yo. in Oct.) she said<br/>\nthey give out a pre-school package and go over proper<br/>\nsnacks,brushing,flossing with the mom(I&#39;m thinking...oh geez!)<br/>\nshe said said they take the child to the back,parents are not allowed<br/>\nand they clean,take x-rays,and an exam.<br/>\nI asked her why can&#39;t parents be with the child and she said It&#39;s<br/>\ntheir policy,that kids do better without the parents.<br/>\nDoes this sound red flaggish or am i paranoid???<br/>\nI then said I thought it wouldn&#39;t be all that done for the first<br/>\ntime,i thought it was more of an orientation type visit,she said,they<br/>\ntry to get it done.<br/>\nI asked..well,what if my child doesn&#39;t want x-rays? and she<br/>\nsaid...they talk them thru it.<br/>\nI didn&#39;t dare ask if they ask the child if they can...i knew they<br/>\naren&#39;t respectful<br/>\nMy problem is i want your thoughts because it&#39;s very hard..so far..to<br/>\nfind a kids dentist that takes our insurance(tri-care)<br/>\nshe said when they turn 6yo. they can have appt.s in the afternoon but<br/>\nuntil that age ,it&#39;s made in the morning....what&#39;s up with that? Is<br/>\nthis a normal dentist way of doing things?<br/>\nthanks,Heather<br/>\np.s. I would particularly like to know if there are any other<br/>\nquestions i should ask and how you handled the visits.My son barely<br/>\nlets me look in his mouth.<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: off topic,first dentist soon","postDate":"1182952637","msgId":29613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwQUExNDA1QjYwOTRCQjE5M0JFRTMyRUI1RjY2MkZGQFJvYnluUEM+","inReplyToHeader":"PGY1cms2ZitkOHI3QGVHcm91cHMuY29tPg==","referencesHeader":"PGY1cms2ZitkOHI3QGVHcm91cHMuY29tPg=="},"prevInTopic":29609,"nextInTopic":29614,"prevInTime":29612,"nextInTime":29614,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... When Jayn first began dancing at 3.5 she was too scared to dance without me there. The teacher normally doesn t allow spectators - to keep a non-judgmental","messageBody":"<div id=\"ygrps-yiv-547187646\">&lt;&lt;&lt;  I&#39;m sure she would&#39;ve done just fine without me, but the fact is she<br/>\n<blockquote><span title=\"ireply\"> &gt; would&#39;ve kept it all to herself, but really it wouldn&#39;t have changed<br/>\n&gt; the fact that she needed me there. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>When Jayn first began dancing at 3.5 she was too scared to dance without me <br/>\nthere. The teacher normally doesn&#39;t allow spectators - to keep a <br/>\nnon-judgmental atmosphere - but encourages parents to tip toe and peek every <br/>\nnow and then. However she let that go for Jayn&#39;s comfort.<br/>\n<br/>\nShe and crying Jayn appeared at her front door, to find me lurking very <br/>\nnervously outside - I had a feeling Jayn wouldn&#39;t last. Then I sat on the <br/>\nfloor of the dance class for the first year. Jayn would run over several <br/>\ntimes during the class to get a kissy. Over the course of the seven months <br/>\nof classes I moved from the floor of the class to the stairwell. I would <br/>\nbring a book with me.<br/>\n<br/>\nThe second year, again relaxing her usual rule, I waited downstairs in the <br/>\nteacher&#39;s living room during the class (a huge improvement in my comfort).<br/>\n<br/>\nNow having just completed her fourth year of dancing, Jayn is completely <br/>\ncomfortable, and I can even go off on errands during the class.<br/>\n<br/>\nWhen one of the dental surgeons we visited threatened Jayn that she would <br/>\nsend dh and I out if Jayn didn&#39;t open her mouth and sit quietly, James and I <br/>\nwere horrified. The ds clearly assumed that we would back up that play, but <br/>\nJayn was terrified, and we all left instead. Lucky for us she is not one to <br/>\nsuppress her own feelings!<br/>\n<br/>\nRobyn L. Coburn</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: off topic,first dentist soon","postDate":"1182920675","msgId":29609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VBQkhFQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PGY1c25iZitjbjYwQGVHcm91cHMuY29tPg=="},"prevInTopic":29608,"nextInTopic":29613,"prevInTime":29608,"nextInTime":29610,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... Yeah, our guy nursed until he was 3 1/2, and outside his physical problems, was pretty healthy. One related story about listening to our children in the","messageBody":"<div id=\"ygrps-yiv-1550860214\"><blockquote><span title=\"ireply\">&gt;&gt;He has only been sick twice for only a<br/>\n&gt;&gt;day each time...maybe because he nursed until he was four?&lt;&lt;<br/>\n<br/>\n </span></blockquote>Yeah, our guy nursed until he was 3 1/2, and outside his physical problems,<br/>\nwas pretty healthy.<br/>\n<br/>\nOne related story about listening to our children in the presence of<br/>\n&quot;authority&quot; or &quot;professionals&quot;...<br/>\n<br/>\nAndrew was 5 months old the first time he had open-heart surgery for a<br/>\ncomplicated congenital heart defect.<br/>\n<br/>\nAfter the surgery, he was in the ICU, tubes coming out of most orifices.<br/>\nThey took out the breathing tube after a while, and the nurse said that when<br/>\nhe woke up, they&#39;d start to feed him a bottle.<br/>\n<br/>\nI said that he had never had a bottle in his life, and I didn&#39;t intend to<br/>\nstart him on one now. The nurse rolled her eyes and said, &quot;He needs to learn<br/>\nsometime.&quot;<br/>\n<br/>\n?????<br/>\n<br/>\nI said, &quot;Aaaa, no he doesn&#39;t.&quot; She went on to say that his intake needed to<br/>\nbe measured exactly, and that couldn&#39;t be done with breastfeeding. I said<br/>\nthat I knew how much milk was in each breast, as I had been pumping for<br/>\ndays, and that we would have a close estimate. She said that wasn&#39;t an<br/>\noption. I told her that knowing the exact amount of how much goes in and how<br/>\nmuch comes out wasn&#39;t necessary, we&#39;d know if his kidneys weren&#39;t working<br/>\nwith close estimates. She said she would only bottle feed him. I told her<br/>\nthat she was not to touch my son for feeding, and if she needed me to talk<br/>\nto her superior, I would be glad to. I never left his bedside.<br/>\n<br/>\nShe clocked out soon after. I said nothing but pleasantries to the new<br/>\nnurse, and when Andrew woke up, I picked him up and offered him the breast.<br/>\nHe hadn&#39;t had anything in his stomach for a day and a half. He nursed away<br/>\nand I know that this helped with his emotional and physical healing at that<br/>\ntime.<br/>\n<br/>\nI told the new nurse that Andrew had just breastfed, and that he emptied one<br/>\nbreast, which I knew from pumping, equaled about 4 ounces. She looked quite<br/>\npleased and marked it in his record. We continued this way for the rest of<br/>\nhis recovery.<br/>\n<br/>\nIt can take bravery to really protect our children, and to do what is best<br/>\nfor them, especially if we are in a realm that we are not familiar with.<br/>\nThere may be times when we don&#39;t have all the answers, or know the &quot;right&quot;<br/>\nthing to do (like in the case of medical care), but we can read up and learn<br/>\nand stay as informed as we can to help navigate the way for our children.<br/>\nThere are SO many &quot;rules&quot; in places (schools, hospitals, dentist offices)<br/>\nthat are put there for purposes that have nothing to do with what&#39;s best for<br/>\nour kids. It&#39;s really helpful to try to figure these things out as best as<br/>\nwe can beforehand, and to question anything that doesn&#39;t seem best for our<br/>\nkids.<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":212831948,"authorName":"halfshadow1","from":"&quot;halfshadow1&quot; &lt;halfshadow1@...&gt;","profile":"halfshadow1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1182916783","msgId":29608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1c25iZitjbjYwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VQSEhEQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":29600,"nextInTopic":29609,"prevInTime":29607,"nextInTime":29609,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"your son had 3 open hearts done? I totally feel for you. My son had one done when he was two yo. He was born with v.s.d.,tricuspid regurg, and a little","messageBody":"<div id=\"ygrps-yiv-1360748662\">your son had 3 open hearts done? I totally feel for you. My son had<br/>\none done when he was two yo. He was born with v.s.d.,tricuspid regurg,<br/>\nand a little pulmenary stenosis. The v.s.d was closed and he does not<br/>\nneed any further surgeries.I can not give my son any medicine no<br/>\nmatter how it is hidden because his heart doc&#39;s asst. gave him<br/>\nsomething to calm him for one of his heart echo&#39;s and he threw up.so,<br/>\never since that he will not take any medicine. Luckily he has always<br/>\nbeen so active and healthy. He was so spirited before his surgery that<br/>\nyou never would have guessed that he had something wrong with his<br/>\nheart. Expect for his thinness.He has only been sick twice for only a<br/>\nday each time...maybe because he nursed until he was four?He has never<br/>\nbeen to a dentist and hardly lets me look in his mouth, i don&#39;t know<br/>\nhow this dentist thing is going to go over with him,lol!!thanks for<br/>\nyours and everyone&#39;s advice.--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>,<br/>\n&quot;Gold Standard&quot; &lt;jacki@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I would never leave my child in a dentist&#39;s chair, or anywhere,<br/>\n </span></blockquote>without them<br/>\n<blockquote><span title=\"ireply\"> &gt; telling me that that is what they wanted. I don&#39;t care what the<br/>\n&gt; &quot;professionals&quot; say...they don&#39;t know what MY child needs...they<br/>\n </span></blockquote>know what<br/>\n<blockquote><span title=\"ireply\"> &gt; THEY want...a compliant (scared?) child to do what they are told. And<br/>\n&gt; schools are like that too.<br/>\n&gt; <br/>\n&gt; We had a pediatric dentist who had a chair for the parent in the<br/>\n </span></blockquote>room. He<br/>\n<blockquote><span title=\"ireply\"> &gt; was very respectful, and if the child became upset, he had some<br/>\n </span></blockquote>strategies<br/>\n<blockquote><span title=\"ireply\"> &gt; for helping, but if they didn&#39;t work, he would say that this doesn&#39;t<br/>\n </span></blockquote>seem to<br/>\n<blockquote><span title=\"ireply\"> &gt; be the time for this dental work. I was always so impressed with<br/>\n </span></blockquote>that, but<br/>\n<blockquote><span title=\"ireply\"> &gt; heard other parents complain about him.<br/>\n&gt; <br/>\n&gt; He was very sensitive himself, and I know that he was just right<br/>\n </span></blockquote>there with<br/>\n<blockquote><span title=\"ireply\"> &gt; the child. I heard him refer parents to other dentists who he knew<br/>\n </span></blockquote>would do<br/>\n<blockquote><span title=\"ireply\"> &gt; the work regardless of the child&#39;s feelings, if the parents pushed,<br/>\n </span></blockquote>but he<br/>\n<blockquote><span title=\"ireply\"> &gt; didn&#39;t like doing that.<br/>\n&gt; <br/>\n&gt; He also referred out for sedated work, which he didn&#39;t do, for<br/>\n </span></blockquote>children who<br/>\n<blockquote><span title=\"ireply\"> &gt; needed immediate dental work but weren&#39;t relaxed enough yet with the<br/>\n </span></blockquote>dentist<br/>\n<blockquote><span title=\"ireply\"> &gt; to do it.<br/>\n&gt; <br/>\n&gt; My oldest has had excruciating medical procedures that had to be<br/>\n </span></blockquote>done for<br/>\n<blockquote><span title=\"ireply\"> &gt; him to live. There was no choice. He has had three open-heart<br/>\n </span></blockquote>surgeries so<br/>\n<blockquote><span title=\"ireply\"> &gt; far...each one more physically and emotionally damaging than the<br/>\n </span></blockquote>last. On<br/>\n<blockquote><span title=\"ireply\"> &gt; top of that, he is VERY sensitive, as in, has a heightened sense of<br/>\n </span></blockquote>light,<br/>\n<blockquote><span title=\"ireply\"> &gt; sound, taste, touch, etc...he has lived with great anxiety most of<br/>\n </span></blockquote>his life,<br/>\n<blockquote><span title=\"ireply\"> &gt; was not been able to navigate the world outside our home too<br/>\n </span></blockquote>easily...didn&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; understand people and their cues and reactions, etc. So it was<br/>\n </span></blockquote>crucial for<br/>\n<blockquote><span title=\"ireply\"> &gt; us to find doctors and staff who would let him be as in control as<br/>\n </span></blockquote>possible.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Because of these medical issues, he has hardly ever been to the<br/>\n </span></blockquote>dentist. It<br/>\n<blockquote><span title=\"ireply\"> &gt; was always on a back burner. It was just too much for him to deal<br/>\n </span></blockquote>with (lots<br/>\n<blockquote><span title=\"ireply\"> &gt; of anxiety of anything being done to his body, as well as needles).<br/>\n </span></blockquote>When we<br/>\n<blockquote><span title=\"ireply\"> &gt; did go, he could only open his mouth about 1/2 and inch. He thought<br/>\n </span></blockquote>he was<br/>\n<blockquote><span title=\"ireply\"> &gt; opening it very wide like requested. He is now 18 and is asking to<br/>\n </span></blockquote>go to the<br/>\n<blockquote><span title=\"ireply\"> &gt; dentist.<br/>\n&gt; <br/>\n&gt; I called a local pediatric dentist that was recommended, even though<br/>\n </span></blockquote>he is<br/>\n<blockquote><span title=\"ireply\"> &gt; 18, because I was told they have a real special and relaxed way with<br/>\n </span></blockquote>kids.<br/>\n<blockquote><span title=\"ireply\"> &gt; That office recommended a dentist that works with &quot;special needs&quot;<br/>\n </span></blockquote>adults as<br/>\n<blockquote><span title=\"ireply\"> &gt; well as general dentistry. I&#39;m not sure what I think about that, but my<br/>\n&gt; experience has been that &quot;special needs&quot; professionals (less the school<br/>\n&gt; system who tries to box people and mold them) tend to be more<br/>\n </span></blockquote>understanding,<br/>\n<blockquote><span title=\"ireply\"> &gt; respectful, patient, etc., so we&#39;re going to check them out tomorrow.<br/>\n&gt; <br/>\n&gt; I know some people have recommended not going to pediatric dentists,<br/>\n </span></blockquote>but we<br/>\n<blockquote><span title=\"ireply\"> &gt; have had such fabulous experiences with Children&#39;s Hospitals (3<br/>\n </span></blockquote>different<br/>\n<blockquote><span title=\"ireply\"> &gt; ones in 3 different parts of the country) and sometimes Children&#39;s<br/>\n </span></blockquote>Hospitals<br/>\n<blockquote><span title=\"ireply\"> &gt; have dentists offices associated with them, ones where the kids are in<br/>\n&gt; charge and are very respected. It may be worth checking out if there<br/>\n </span></blockquote>is a<br/>\n<blockquote><span title=\"qreply\"> &gt; Children&#39;s Hospital near you, and if they have a dental clinic.<br/>\n&gt; <br/>\n&gt; Jacki<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":229396800,"authorName":"Cathy","from":"&quot;Cathy&quot; &lt;cathy@...&gt;","profile":"cathykoetsier","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: off topic,first dentist soon","postDate":"1182892251","msgId":29600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNzAwMWM3YjgzNiQ3YThjMDU1MCQwNTAyYThjMEBDcmFpZz4=","inReplyToHeader":"PEMzMjA1NTg3LTc5QzAtNDRFNS04RUM3LUM1MTI2NjJDODgxMEBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGY1cW91cytoOGkwQGVHcm91cHMuY29tPiA8MEVBMjJFMjktQzZDOS00NUQ1LUE2NjYtMzVGRTBGNjQwOTI1QGVhcnRobGluay5uZXQ+IDxDMzIwNTU4Ny03OUMwLTQ0RTUtOEVDNy1DNTEyNjYyQzg4MTBAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":29596,"nextInTopic":29608,"prevInTime":29599,"nextInTime":29601,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I would not allow a dentist near my children without my presence, especially not for a first visit! I was terrified of dentists, so much so that I have a skew","messageBody":"<div id=\"ygrps-yiv-1003330810\">I would not allow a dentist near my children without my presence, especially<br/>\nnot for a first visit! <br/>\n<br/>\nI was terrified of dentists, so much so that I have a skew front tooth to<br/>\nthis day, because I couldn&#39;t force myself to go into the orthodontist&#39;s<br/>\noffice on my own (my mother thought that at the age of 15 I was big enough<br/>\nto go on my own). I don&#39;t want my children to be at risk of this kind of<br/>\nparalyzing fear - it took me years, and the patient and understanding<br/>\nministrations of a trusted dentist, to overcome it. <br/>\n<br/>\nMy children like going to the dentist, it is an adventure. And I am right<br/>\nthere if they need me. <br/>\n<br/>\nIf I was in your shoes I would look for a dentist who is more accepting of<br/>\nmy role in my children&#39;s lives.<br/>\n<br/>\nRegards<br/>\n<br/>\nCathy <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":207473833,"authorName":"Emily","from":"&quot;Emily&quot; &lt;emily_d_hill@...&gt;","profile":"emilykohlbacher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1182889975","msgId":29596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1cnQ1biszMTNpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY1cGxhbitlYTNpQGVHcm91cHMuY29tPg=="},"prevInTopic":29587,"nextInTopic":29600,"prevInTime":29595,"nextInTime":29597,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I started my son with a pediatric dentist.  They said I could go back with him for the first appointment but not after that.  This did not sit well with me,","messageBody":"<div id=\"ygrps-yiv-1908380171\">I started my son with a pediatric dentist.  They said I could go back <br/>\nwith him for the first appointment but not after that.  This did not <br/>\nsit well with me, but I figured I&#39;d worry about that for the second <br/>\nappointment.  They also made me sign something about me refusing x-rays <br/>\nand how I understood that all decay couldn&#39;t be spotted without them.  <br/>\nHe was 3!  I switched to a family dentist and have been thrilled.  The <br/>\ndental hygentist is actually better than the other place.  It costs a <br/>\nlot less.  They encourage parents to stay with their kids.</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: off topic,first dentist soon","postDate":"1182882672","msgId":29587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VQSEhEQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PGY1cW91cytoOGkwQGVHcm91cHMuY29tPg=="},"prevInTopic":29585,"nextInTopic":29596,"prevInTime":29586,"nextInTime":29588,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I would never leave my child in a dentist s chair, or anywhere, without them telling me that that is what they wanted. I don t care what the professionals","messageBody":"<div id=\"ygrps-yiv-1085018100\">I would never leave my child in a dentist&#39;s chair, or anywhere, without them<br/>\ntelling me that that is what they wanted. I don&#39;t care what the<br/>\n&quot;professionals&quot; say...they don&#39;t know what MY child needs...they know what<br/>\nTHEY want...a compliant (scared?) child to do what they are told. And<br/>\nschools are like that too.<br/>\n<br/>\nWe had a pediatric dentist who had a chair for the parent in the room. He<br/>\nwas very respectful, and if the child became upset, he had some strategies<br/>\nfor helping, but if they didn&#39;t work, he would say that this doesn&#39;t seem to<br/>\nbe the time for this dental work. I was always so impressed with that, but<br/>\nheard other parents complain about him.<br/>\n<br/>\nHe was very sensitive himself, and I know that he was just right there with<br/>\nthe child. I heard him refer parents to other dentists who he knew would do<br/>\nthe work regardless of the child&#39;s feelings, if the parents pushed, but he<br/>\ndidn&#39;t like doing that.<br/>\n<br/>\nHe also referred out for sedated work, which he didn&#39;t do, for children who<br/>\nneeded immediate dental work but weren&#39;t relaxed enough yet with the dentist<br/>\nto do it.<br/>\n<br/>\nMy oldest has had excruciating medical procedures that had to be done for<br/>\nhim to live. There was no choice. He has had three open-heart surgeries so<br/>\nfar...each one more physically and emotionally damaging than the last. On<br/>\ntop of that, he is VERY sensitive, as in, has a heightened sense of light,<br/>\nsound, taste, touch, etc...he has lived with great anxiety most of his life,<br/>\nwas not been able to navigate the world outside our home too easily...didn&#39;t<br/>\nunderstand people and their cues and reactions, etc. So it was crucial for<br/>\nus to find doctors and staff who would let him be as in control as possible.<br/>\n<br/>\nBecause of these medical issues, he has hardly ever been to the dentist. It<br/>\nwas always on a back burner. It was just too much for him to deal with (lots<br/>\nof anxiety of anything being done to his body, as well as needles). When we<br/>\ndid go, he could only open his mouth about 1/2 and inch. He thought he was<br/>\nopening it very wide like requested. He is now 18 and is asking to go to the<br/>\ndentist.<br/>\n<br/>\nI called a local pediatric dentist that was recommended, even though he is<br/>\n18, because I was told they have a real special and relaxed way with kids.<br/>\nThat office recommended a dentist that works with &quot;special needs&quot; adults as<br/>\nwell as general dentistry. I&#39;m not sure what I think about that, but my<br/>\nexperience has been that &quot;special needs&quot; professionals (less the school<br/>\nsystem who tries to box people and mold them) tend to be more understanding,<br/>\nrespectful, patient, etc., so we&#39;re going to check them out tomorrow.<br/>\n<br/>\nI know some people have recommended not going to pediatric dentists, but we<br/>\nhave had such fabulous experiences with Children&#39;s Hospitals (3 different<br/>\nones in 3 different parts of the country) and sometimes Children&#39;s Hospitals<br/>\nhave dentists offices associated with them, ones where the kids are in<br/>\ncharge and are very respected. It may be worth checking out if there is a<br/>\nChildren&#39;s Hospital near you, and if they have a dental clinic.<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1182880783","msgId":29585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1cms2ZitkOHI3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBFQTIyRTI5LUM2QzktNDVENS1BNjY2LTM1RkUwRjY0MDkyNUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":29580,"nextInTopic":29587,"prevInTime":29584,"nextInTime":29586,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... That can be applied to almost any situation too.  Just yesterday, I stayed with Chamille (13) to help her help out at a daycamp.  I had actually stayed for","messageBody":"<div id=\"ygrps-yiv-1554503164\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; I think my girls would have appeared calm, because they&#39;d have been  <br/>\n&gt; very very very quiet and compliant. But, inside, they&#39;d have been  <br/>\n&gt; freaked out, scared, felt abandoned and upset and angry. They would  <br/>\n&gt; very likely have behaved extremely well, the dentist would have said  <br/>\n&gt; what &quot;good girls&quot; they were, I&#39;m sure.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>That can be applied to almost any situation too.  Just yesterday, I <br/>\nstayed with Chamille (13) to help her help out at a daycamp.  I had <br/>\nactually stayed for a few minutes because I thought Margaux (5) <br/>\nwouldn&#39;t do well without me.  Turns out she didn&#39;t really care wether I <br/>\nstayed or not, but it&#39;s a good thing I did, because Chamille just about <br/>\nthrew up because she was so nervous about helping, something I didn&#39;t <br/>\nexpect at all!<br/>\n<br/>\nI&#39;m sure she would&#39;ve done just fine without me, but the fact is she <br/>\nwould&#39;ve kept it all to herself, but really it wouldn&#39;t have changed <br/>\nthe fact that she needed me there.  Today, she was fine with me leaving <br/>\nher there.  I asked her and she told me with honesty, not just to put <br/>\non a brave face for her mom.  A lot of parents don&#39;t get that, they <br/>\njust don&#39;t do that for their kids, they expect them to behave a certain <br/>\nway and push them into that, especially when they are &quot;old enough&quot;.  <br/>\nBoth of my kids KNOW without a doubt that I would never ever push them <br/>\ninto a situation that they are uncomfortable with, so they can tell me <br/>\nhonestly when they are un/comfortable.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: off topic,first dentist soon","postDate":"1182876066","msgId":29580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzMjA1NTg3LTc5QzAtNDRFNS04RUM3LUM1MTI2NjJDODgxMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDBFQTIyRTI5LUM2QzktNDVENS1BNjY2LTM1RkUwRjY0MDkyNUBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PGY1cW91cytoOGkwQGVHcm91cHMuY29tPiA8MEVBMjJFMjktQzZDOS00NUQ1LUE2NjYtMzVGRTBGNjQwOTI1QGVhcnRobGluay5uZXQ+"},"prevInTopic":29577,"nextInTopic":29585,"prevInTime":29579,"nextInTime":29581,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"-=-I think my girls would have appeared calm, because they d have been very very very quiet and compliant. But, inside, they d have been freaked out, scared,","messageBody":"<div id=\"ygrps-yiv-1587537936\">-=-I think my girls would have appeared calm, because they&#39;d have been<br/>\nvery very very quiet and compliant. But, inside, they&#39;d have been<br/>\nfreaked out, scared, felt abandoned and upset and angry.-=-<br/>\n<br/>\nLike school.<br/>\n<br/>\nSchools say &quot;no problem&quot; because most of the kids just go with it,  <br/>\nbut if you ask adults, years later, how they felt, you hear a  <br/>\ndifferent story.  And some kids (most?) get through it by telling  <br/>\nthemselves it&#39;s better to be independent, and their moms don&#39;t like  <br/>\nthem all that much anyway, to leave them in scary situations, and  <br/>\nafter a few years of those internal justifications, they no longer  <br/>\ntrust nor really want to be with their moms as much as they might&#39;ve  <br/>\notherwise.<br/>\n<br/>\nIt&#39;s a slippery slope.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: off topic,first dentist soon","postDate":"1182875197","msgId":29577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBFQTIyRTI5LUM2QzktNDVENS1BNjY2LTM1RkUwRjY0MDkyNUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGY1cW91cytoOGkwQGVHcm91cHMuY29tPg==","referencesHeader":"PGY1cW91cytoOGkwQGVHcm91cHMuY29tPg=="},"prevInTopic":29567,"nextInTopic":29580,"prevInTime":29576,"nextInTime":29578,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... I think my girls would have appeared calm, because they d have been very very very quiet and compliant. But, inside, they d have been freaked out, scared,","messageBody":"<div id=\"ygrps-yiv-2009437057\">On Jun 26, 2007, at 3:14 AM, tootskds wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think children are much calmer without their parents there.<br/>\n<br/>\n </span></blockquote>I think my girls would have appeared calm, because they&#39;d have been  <br/>\nvery very very quiet and compliant. But, inside, they&#39;d have been  <br/>\nfreaked out, scared, felt abandoned and upset and angry. They would  <br/>\nvery likely have behaved extremely well, the dentist would have said  <br/>\nwhat &quot;good girls&quot; they were, I&#39;m sure.<br/>\n<br/>\nSo, if the goal is to get the kids through the visit with as little  <br/>\nwork as possible for the dentist/staff, then sending mine in alone  <br/>\nand telling them to just do what they were told, would have worked. I  <br/>\nthink there are MANY kids like mine who will behave well (better)  <br/>\nwithout the parent there. But, that doesn&#39;t mean it is the best thing  <br/>\nfor the child. If the child is acting &quot;fine,&quot; but starts to cry or  <br/>\nact scared when the parent shows up, then those feelings were already  <br/>\nthere, just well hidden.<br/>\n<br/>\nEven when my kids were older, I&#39;d wander in and out of the room -  <br/>\njust stand in the doorway sometimes. I was very casual and acted like  <br/>\nit was the most normal thing in the world for mom to sort of wander  <br/>\nin and see how things are going. A few times someone asked me, &quot;Can I  <br/>\nhelp you?&quot; with a sense that I was not where I was supposed to be,  <br/>\nbut I just said, calmly &lt;g&gt;, &quot;Oh, no, I&#39;m fine.&quot; (No explanations - I  <br/>\nam the mother, I don&#39;t have to explain why I&#39;m wanting to be near my  <br/>\nown child.)<br/>\n<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":295274109,"authorName":"Annie","from":"Annie &lt;amgreejoyjoyblue@...&gt;","profile":"amgreejoyjoyblue","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] off topic,first dentist soon","postDate":"1182859842","msgId":29564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3ODM5Ny40MjczNy5xbUB3ZWI1ODgxMS5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PDI0OTU1MS4zNzAyOC5xbUB3ZWI1ODgwNi5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":29562,"nextInTopic":29566,"prevInTime":29563,"nextInTime":29565,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I should have also mentioned that if you get a strange or not good feeling about the office- forget about going there. I m sure you probably know that already.","messageBody":"<div id=\"ygrps-yiv-33271718\">I should have also mentioned that if you get a strange or not good feeling about the office- forget about going there. I&#39;m sure you probably know that already.<br/>\n  Like I said previously- I&#39;m a hygienist and I&#39;ve seen all different types of philosophies and attitudes.  Many are just plain out for the $, but there are good ones out there. Unfortunately this happens in this field, just  like others.<br/>\n  Since you live in Florida I can&#39;t help you with that, but ask around the people that you know and seem to have good judgement.  Most dentists  also agree that you need to go through word of mouth and never just pick one from the phone book.  You can get lucky, but please ask other people and do go to just meet them.  If they don&#39;t allow that -you  probably DO NOT want to take your son there:(  I also agree with the person who said you don&#39;t need a pediatric office.  It&#39;s probably smart to go to a good general dentist that will do most procedures, so that he doesn&#39;t have to be referred elsewhere for any extractions, etc.<br/>\n  I used to be the most fearful patient- I&#39;m great now. My daughter was just like me at 6-7 years old.  I took her to a pediatric dentist who didn&#39;t allow me in the room for the fillings.  She did not respond well to that.  I found another dentist and she became so cooperative and has no fear of going to the dentist now.  It&#39;s awful how many adults still are phobic when going to the dentist even for a cleaning.   The personality of the hygienist and dentist are soooo important.<br/>\n  I don&#39;t know if you live near a Dr. Ira Ginsberg.  If you do he would probably be able to refer you to a great dentist.  I grew up with him and he is very honest and I&#39;m sure his referral would be good.<br/>\n  Hope this has been of help to you!<br/>\n  Good luck in searching for a dentist!<br/>\n  Annie<br/>\n  <br/>\n<br/>\nAnnie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amgreejoyjoyblue@...\">amgreejoyjoyblue@...</a>&gt; wrote:<br/>\n          Hi,<br/>\nI&#39;m a dental hygienist and used to work in a pediatric dental office.<br/>\nYes, a lot of times dentists prefer to see the child alone, they do usually do better without the parents.<br/>\nI totally understand where you are coming from.<br/>\nWhy not ask them if you can come in the room, and then if your son doesn&#39;t cooperate they can tell him that you need to leave the room if he doesn&#39;t cooperate. That usually works for most kids. Some just need their parent in the room.<br/>\nGood luck,<br/>\nAnn<br/>\n<br/>\nhalfshadow1 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:halfshadow1@...\">halfshadow1@...</a>&gt; wrote:<br/>\nI wanted some opinions here and i will post on veryyoungkidsteeth.<br/>\nI called a *childrens* dentist office today and inquired about how<br/>\nthey do things with children for the first visit.<br/>\nI asked her what it would be like for my son(6yo. in Oct.) she said<br/>\nthey give out a pre-school package and go over proper<br/>\nsnacks,brushing,flossing with the mom(I&#39;m thinking...oh geez!)<br/>\nshe said said they take the child to the back,parents are not allowed<br/>\nand they clean,take x-rays,and an exam.<br/>\nI asked her why can&#39;t parents be with the child and she said It&#39;s<br/>\ntheir policy,that kids do better without the parents.<br/>\nDoes this sound red flaggish or am i paranoid???<br/>\nI then said I thought it wouldn&#39;t be all that done for the first<br/>\ntime,i thought it was more of an orientation type visit,she said,they<br/>\ntry to get it done.<br/>\nI asked..well,what if my child doesn&#39;t want x-rays? and she<br/>\nsaid...they talk them thru it.<br/>\nI didn&#39;t dare ask if they ask the child if they can...i knew they<br/>\naren&#39;t respectful<br/>\nMy problem is i want your thoughts because it&#39;s very hard..so far..to<br/>\nfind a kids dentist that takes our insurance(tri-care)<br/>\nshe said when they turn 6yo. they can have appt.s in the afternoon but<br/>\nuntil that age ,it&#39;s made in the morning....what&#39;s up with that? Is<br/>\nthis a normal dentist way of doing things?<br/>\nthanks,Heather<br/>\np.s. I would particularly like to know if there are any other<br/>\nquestions i should ask and how you handled the visits.My son barely<br/>\nlets me look in his mouth.<br/>\n<br/>\n---------------------------------<br/>\nBuilding a website is a piece of cake. <br/>\nYahoo! Small Business gives you all the tools to get online.<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n <br/>\n---------------------------------<br/>\nExpecting? Get great news right away with email Auto-Check.<br/>\nTry the Yahoo! Mail Beta.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":219835654,"authorName":"tootskds","from":"&quot;tootskds&quot; &lt;kdself@...&gt;","profile":"tootskds","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1182852892","msgId":29567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1cW91cytoOGkwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY1cGxhbitlYTNpQGVHcm91cHMuY29tPg=="},"prevInTopic":29566,"nextInTopic":29577,"prevInTime":29566,"nextInTime":29568,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I think children are much calmer without their parents there.  I have experienced this with my boys when they were small.  I think they handled it well.  The","messageBody":"<div id=\"ygrps-yiv-1261337574\">I think children are much calmer without their parents there.  I have<br/>\nexperienced this with my boys when they were small.  I think they<br/>\nhandled it well.  The dentist office that they visited had video games<br/>\nand a ton of activities to ease their minds.  It worked!  They always<br/>\nhad a blast.<br/>\n<br/>\nKaren<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;halfshadow1&quot; &lt;halfshadow1@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; I wanted some opinions here and i will post on veryyoungkidsteeth.<br/>\n&gt; I called a *childrens* dentist office today and inquired about how<br/>\n&gt; they do things with children for the first visit.<br/>\n&gt; I asked her what it would be like for my son(6yo. in Oct.) she said<br/>\n&gt; they give out a pre-school package and go over proper<br/>\n&gt; snacks,brushing,flossing with the mom(I&#39;m thinking...oh geez!)<br/>\n&gt; she said said they take the child to the back,parents are not allowed<br/>\n&gt; and they clean,take x-rays,and an exam.<br/>\n&gt; I asked her why can&#39;t parents be with the child and she said It&#39;s<br/>\n&gt; their policy,that kids do better without the parents.<br/>\n&gt; Does this sound red flaggish or am i paranoid???<br/>\n&gt; I then said I thought it wouldn&#39;t be all that done for the first<br/>\n&gt; time,i thought it was more of an orientation type visit,she said,they<br/>\n&gt; try to get it done.<br/>\n&gt; I asked..well,what if my child doesn&#39;t want x-rays? and she<br/>\n&gt; said...they talk them thru it.<br/>\n&gt; I didn&#39;t dare ask if they ask the child if they can...i knew they<br/>\n&gt; aren&#39;t respectful<br/>\n&gt; My problem is i want your thoughts because it&#39;s very hard..so far..to<br/>\n&gt; find a kids dentist that takes our insurance(tri-care)<br/>\n&gt; she said when they turn 6yo. they can have appt.s in the afternoon but<br/>\n&gt; until that age ,it&#39;s made in the morning....what&#39;s up with that? Is<br/>\n&gt; this a normal dentist way of doing things?<br/>\n&gt; thanks,Heather<br/>\n&gt; p.s. I would particularly like to know if there are any other<br/>\n&gt; questions i should ask and how you handled the visits.My son barely<br/>\n&gt; lets me look in his mouth.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1182833797","msgId":29566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1cTZhNSt1MW1oQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI0OTU1MS4zNzAyOC5xbUB3ZWI1ODgwNi5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":29564,"nextInTopic":29567,"prevInTime":29565,"nextInTime":29567,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I don t see how it would be a good idea to use fear in order to get cooperation.  To me, that s the same as a parent threatening to leave a child in order to","messageBody":"<div id=\"ygrps-yiv-1339360596\">I don&#39;t see how it would be a good idea to use fear in order to get <br/>\ncooperation.  To me, that&#39;s the same as a parent threatening to <br/>\nleave a child in order to get them to come along!<br/>\n<br/>\nIf the child is scared/doesn&#39;t want to be there/feels <br/>\nuncomfortable/is unable to hold the x-ray thing in his mouth, then <br/>\nhe should be able to tell the dentist or his parent and know that he <br/>\nwill be taken seriously.  <br/>\n<br/>\nWhen it comes to the dentist, if something doesn&#39;t work for my <br/>\nchild, then it doesn&#39;t really matter what works for most children.<br/>\n<br/>\nThe worst experiences we have had with dentists have been with <br/>\npediatric dentists.  We&#39;ve had much better communication with <br/>\ngeneral dentists.  They have been more willing to listen and less <br/>\nrigid in their &quot;rules&quot;.<br/>\n<br/>\n-Christy<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi,<br/>\n&gt;   I&#39;m a dental hygienist and used to work in a pediatric dental <br/>\n </span></blockquote>office.<br/>\n<blockquote><span title=\"ireply\"> &gt;   Yes, a lot of times dentists prefer to see the child alone, they <br/>\n </span></blockquote>do usually do better without the parents.<br/>\n<blockquote><span title=\"ireply\"> &gt;   I totally understand where you are coming from.<br/>\n&gt;   Why not ask them if you can come in the room, and then if your <br/>\n </span></blockquote>son doesn&#39;t cooperate they can tell him that you need to leave the <br/>\nroom if he doesn&#39;t cooperate.  That usually works for most kids.  <br/>\nSome just need their parent in the room.<br/>\n<blockquote><span title=\"ireply\"> &gt;   Good luck,<br/>\n&gt;   Ann<br/>\n&gt; <br/>\n&gt; halfshadow1 &lt;halfshadow1@...&gt; wrote:<br/>\n&gt;           I wanted some opinions here and i will post on <br/>\n </span></blockquote>veryyoungkidsteeth.<br/>\n<blockquote><span title=\"ireply\"> &gt; I called a *childrens* dentist office today and inquired about how<br/>\n&gt; they do things with children for the first visit.<br/>\n&gt; I asked her what it would be like for my son(6yo. in Oct.) she said<br/>\n&gt; they give out a pre-school package and go over proper<br/>\n&gt; snacks,brushing,flossing with the mom(I&#39;m thinking...oh geez!)<br/>\n&gt; she said said they take the child to the back,parents are not <br/>\n </span></blockquote>allowed<br/>\n<blockquote><span title=\"ireply\"> &gt; and they clean,take x-rays,and an exam.<br/>\n&gt; I asked her why can&#39;t parents be with the child and she said It&#39;s<br/>\n&gt; their policy,that kids do better without the parents.<br/>\n&gt; Does this sound red flaggish or am i paranoid???<br/>\n&gt; I then said I thought it wouldn&#39;t be all that done for the first<br/>\n&gt; time,i thought it was more of an orientation type visit,she <br/>\n </span></blockquote>said,they<br/>\n<blockquote><span title=\"ireply\"> &gt; try to get it done.<br/>\n&gt; I asked..well,what if my child doesn&#39;t want x-rays? and she<br/>\n&gt; said...they talk them thru it.<br/>\n&gt; I didn&#39;t dare ask if they ask the child if they can...i knew they<br/>\n&gt; aren&#39;t respectful<br/>\n&gt; My problem is i want your thoughts because it&#39;s very hard..so <br/>\n </span></blockquote>far..to<br/>\n<blockquote><span title=\"ireply\"> &gt; find a kids dentist that takes our insurance(tri-care)<br/>\n&gt; she said when they turn 6yo. they can have appt.s in the afternoon <br/>\n </span></blockquote>but<br/>\n<blockquote><span title=\"qreply\"> &gt; until that age ,it&#39;s made in the morning....what&#39;s up with that? Is<br/>\n&gt; this a normal dentist way of doing things?<br/>\n&gt; thanks,Heather<br/>\n&gt; p.s. I would particularly like to know if there are any other<br/>\n&gt; questions i should ask and how you handled the visits.My son barely<br/>\n&gt; lets me look in his mouth.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;          <br/>\n&gt; <br/>\n&gt;        <br/>\n&gt; ---------------------------------<br/>\n&gt; Building a website is a piece of cake. <br/>\n&gt; Yahoo! Small Business gives you all the tools to get online.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":212831948,"authorName":"halfshadow1","from":"&quot;halfshadow1&quot; &lt;halfshadow1@...&gt;","profile":"halfshadow1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: off topic,first dentist soon","postDate":"1182825298","msgId":29562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1cHUwaitqOTU5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg4N0EzOUVGODI3QTQ3MUZBQzQwNUNDOTk1NTdGM0EzQFJvYnluUEM+"},"prevInTopic":29561,"nextInTopic":29564,"prevInTime":29561,"nextInTime":29563,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I live in Scottsmoor,fl. but the closet town is Titusville. I love the idea about getting some dental toys and playing dentist. Please do send me the article","messageBody":"<div id=\"ygrps-yiv-1180675049\">I live in Scottsmoor,fl. but the closet town is Titusville. I love the<br/>\nidea about getting some dental toys and playing dentist. Please do<br/>\nsend me the article off list,thanks!--- In<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;&lt;&lt;&gt; I asked her what it would be like for my son(6yo. in Oct.) she<br/>\n </span></blockquote>said<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; they give out a pre-school package and go over proper<br/>\n&gt; &gt; snacks,brushing,flossing with the mom(I&#39;m thinking...oh geez!)<br/>\n&gt; &gt; she said said they take the child to the back,parents are not allowed<br/>\n&gt; &gt; and they clean,take x-rays,and an exam.<br/>\n&gt; &gt; I asked her why can&#39;t parents be with the child and she said It&#39;s<br/>\n&gt; &gt; their policy,that kids do better without the parents.<br/>\n&gt; &gt; Does this sound red flaggish or am i paranoid??? &gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; Well it was a red flag for me because it is very easy for medical <br/>\n&gt; professionals to believe that they are in charge, and expect the<br/>\n </span></blockquote>parents to <br/>\n<blockquote><span title=\"ireply\"> &gt; back up their authoritarian plays.<br/>\n&gt; <br/>\n&gt; A couple of years ago Jayn had an emergency dental situation, and I<br/>\n </span></blockquote>posted <br/>\n<blockquote><span title=\"ireply\"> &gt; the whole long story as well as wrote an article for Live Free,<br/>\n </span></blockquote>Learn Free <br/>\n<blockquote><span title=\"ireply\"> &gt; magazine. The story should be in the archives of Unschooling<br/>\n </span></blockquote>Discussion if <br/>\n<blockquote><span title=\"ireply\"> &gt; that helps. Would you like me to send you the article off list?<br/>\n&gt; <br/>\n&gt; The best advice I have as a result of that situation is that it is<br/>\n </span></blockquote>worth <br/>\n<blockquote><span title=\"ireply\"> &gt; taking the time to find a good, full service and child-repectful<br/>\n </span></blockquote>dentist. <br/>\n<blockquote><span title=\"ireply\"> &gt; They do exist. By full service I mean that they do any surgery<br/>\n </span></blockquote>there, where <br/>\n<blockquote><span title=\"ireply\"> &gt; a rapport and relationship has hopefully been established. Believe<br/>\n </span></blockquote>me, if <br/>\n<blockquote><span title=\"ireply\"> &gt; you think some dentists are disrespectful wait until you have to find a <br/>\n&gt; dental surgeon who is willing to take things at the child&#39;s pace. It<br/>\n </span></blockquote>is also <br/>\n<blockquote><span title=\"ireply\"> &gt; worth the peace of mind to have an anesthetist for any surgery,<br/>\n </span></blockquote>rather than <br/>\n<blockquote><span title=\"ireply\"> &gt; just the dentist.<br/>\n&gt; <br/>\n&gt; I eventually found someone who was kind, gentle, respectful and slow<br/>\n </span></blockquote>(ie at <br/>\n<blockquote><span title=\"ireply\"> &gt; Jayn&#39;s pace), and didn&#39;t make threats to force compliance. She always <br/>\n&gt; explains to Jayn what she is going to do, and asks if she is ready.<br/>\n&gt; <br/>\n&gt; &lt;&lt;&lt;&lt; I then said I thought it wouldn&#39;t be all that done for the first<br/>\n&gt; &gt; time,i thought it was more of an orientation type visit,she said,they<br/>\n&gt; &gt; try to get it done. &gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; You have to be careful because they have different meanings for the<br/>\n </span></blockquote>same <br/>\n<blockquote><span title=\"ireply\"> &gt; words, as I found out the hard way. When you say, or Jayn says,<br/>\n </span></blockquote>&quot;just saying <br/>\n<blockquote><span title=\"ireply\"> &gt; hello&quot; or &quot;just meeting&quot; we mean literally meeting the dentist and<br/>\n </span></blockquote>staff, <br/>\n<blockquote><span title=\"ireply\"> &gt; looking over the office maybe, asking questions about procedures.<br/>\n </span></blockquote>They mean <br/>\n<blockquote><span title=\"ireply\"> &gt; the child sits in the chair and opens her mouth, gets a cleaning<br/>\n </span></blockquote>probably <br/>\n<blockquote><span title=\"ireply\"> &gt; and x-rays, but no *major* work is done.<br/>\n&gt; <br/>\n&gt; What city are you in? I have a fabulous, non-judgemental dentist<br/>\n </span></blockquote>now. Jayn <br/>\n<blockquote><span title=\"ireply\"> &gt; is always delighted to go there, makes drawings for her, and calls<br/>\n </span></blockquote>when she <br/>\n<blockquote><span title=\"ireply\"> &gt; loses a tooth.<br/>\n&gt; <br/>\n&gt; &lt;&lt;&lt;&lt; she said when they turn 6yo. they can have appt.s in the<br/>\n </span></blockquote>afternoon but<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; until that age ,it&#39;s made in the morning....what&#39;s up with that? Is<br/>\n&gt; &gt; this a normal dentist way of doing things? &gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; Jayn&#39;s dentist schedules around us, with the caveat that she does<br/>\n </span></blockquote>have one <br/>\n<blockquote><span title=\"ireply\"> &gt; day every month (or maybe every two weeks) set aside for surgery<br/>\n </span></blockquote>when she <br/>\n<blockquote><span title=\"ireply\"> &gt; sees no other patients. It is normal in that they assume that a 6yo<br/>\n </span></blockquote>is in <br/>\n<blockquote><span title=\"ireply\"> &gt; school so they fill the mornings with pre-school age kids.<br/>\n&gt; <br/>\n&gt; One thing that is sometimes helpful is to pick up some plastic<br/>\n </span></blockquote>dentist tools <br/>\n<blockquote><span title=\"ireply\"> &gt; and play act the procedures - he &quot;does&quot; you, his teddy and Daddy,<br/>\n </span></blockquote>then you <br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;do&quot; him to the extent he will let you. This is something that I<br/>\n </span></blockquote>heard about <br/>\n<blockquote><span title=\"ireply\"> &gt; on veryyoungkidsteeth, although it was not something that we needed<br/>\n </span></blockquote>to do as <br/>\n<blockquote><span title=\"qreply\"> &gt; it turned out.<br/>\n&gt; <br/>\n&gt; Robyn L. Coburn<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; thanks,Heather<br/>\n&gt; &gt; p.s. I would particularly like to know if there are any other<br/>\n&gt; &gt; questions i should ask and how you handled the visits.My son barely<br/>\n&gt; &gt; lets me look in his mouth.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yahoo! Groups Links<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] off topic,first dentist soon","postDate":"1182824762","msgId":29561,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4N0EzOUVGODI3QTQ3MUZBQzQwNUNDOTk1NTdGM0EzQFJvYnluUEM+","inReplyToHeader":"PGY1cGxhbitlYTNpQGVHcm91cHMuY29tPg==","referencesHeader":"PGY1cGxhbitlYTNpQGVHcm91cHMuY29tPg=="},"prevInTopic":29560,"nextInTopic":29562,"prevInTime":29560,"nextInTime":29562,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"... Well it was a red flag for me because it is very easy for medical professionals to believe that they are in charge, and expect the parents to back up their","messageBody":"<div id=\"ygrps-yiv-1362138866\">&lt;&lt;&lt;&lt;&gt; I asked her what it would be like for my son(6yo. in Oct.) she said<br/>\n<blockquote><span title=\"ireply\"> &gt; they give out a pre-school package and go over proper<br/>\n&gt; snacks,brushing,flossing with the mom(I&#39;m thinking...oh geez!)<br/>\n&gt; she said said they take the child to the back,parents are not allowed<br/>\n&gt; and they clean,take x-rays,and an exam.<br/>\n&gt; I asked her why can&#39;t parents be with the child and she said It&#39;s<br/>\n&gt; their policy,that kids do better without the parents.<br/>\n&gt; Does this sound red flaggish or am i paranoid??? &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Well it was a red flag for me because it is very easy for medical <br/>\nprofessionals to believe that they are in charge, and expect the parents to <br/>\nback up their authoritarian plays.<br/>\n<br/>\nA couple of years ago Jayn had an emergency dental situation, and I posted <br/>\nthe whole long story as well as wrote an article for Live Free, Learn Free <br/>\nmagazine. The story should be in the archives of Unschooling Discussion if <br/>\nthat helps. Would you like me to send you the article off list?<br/>\n<br/>\nThe best advice I have as a result of that situation is that it is worth <br/>\ntaking the time to find a good, full service and child-repectful dentist. <br/>\nThey do exist. By full service I mean that they do any surgery there, where <br/>\na rapport and relationship has hopefully been established. Believe me, if <br/>\nyou think some dentists are disrespectful wait until you have to find a <br/>\ndental surgeon who is willing to take things at the child&#39;s pace. It is also <br/>\nworth the peace of mind to have an anesthetist for any surgery, rather than <br/>\njust the dentist.<br/>\n<br/>\nI eventually found someone who was kind, gentle, respectful and slow (ie at <br/>\nJayn&#39;s pace), and didn&#39;t make threats to force compliance. She always <br/>\nexplains to Jayn what she is going to do, and asks if she is ready.<br/>\n<br/>\n&lt;&lt;&lt;&lt; I then said I thought it wouldn&#39;t be all that done for the first<br/>\n<blockquote><span title=\"ireply\"> &gt; time,i thought it was more of an orientation type visit,she said,they<br/>\n&gt; try to get it done. &gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>You have to be careful because they have different meanings for the same <br/>\nwords, as I found out the hard way. When you say, or Jayn says, &quot;just saying <br/>\nhello&quot; or &quot;just meeting&quot; we mean literally meeting the dentist and staff, <br/>\nlooking over the office maybe, asking questions about procedures. They mean <br/>\nthe child sits in the chair and opens her mouth, gets a cleaning probably <br/>\nand x-rays, but no *major* work is done.<br/>\n<br/>\nWhat city are you in? I have a fabulous, non-judgemental dentist now. Jayn <br/>\nis always delighted to go there, makes drawings for her, and calls when she <br/>\nloses a tooth.<br/>\n<br/>\n&lt;&lt;&lt;&lt; she said when they turn 6yo. they can have appt.s in the afternoon but<br/>\n<blockquote><span title=\"ireply\"> &gt; until that age ,it&#39;s made in the morning....what&#39;s up with that? Is<br/>\n&gt; this a normal dentist way of doing things? &gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Jayn&#39;s dentist schedules around us, with the caveat that she does have one <br/>\nday every month (or maybe every two weeks) set aside for surgery when she <br/>\nsees no other patients. It is normal in that they assume that a 6yo is in <br/>\nschool so they fill the mornings with pre-school age kids.<br/>\n<br/>\nOne thing that is sometimes helpful is to pick up some plastic dentist tools <br/>\nand play act the procedures - he &quot;does&quot; you, his teddy and Daddy, then you <br/>\n&quot;do&quot; him to the extent he will let you. This is something that I heard about <br/>\non veryyoungkidsteeth, although it was not something that we needed to do as <br/>\nit turned out.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; thanks,Heather<br/>\n&gt; p.s. I would particularly like to know if there are any other<br/>\n&gt; questions i should ask and how you handled the visits.My son barely<br/>\n&gt; lets me look in his mouth.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] off topic,first dentist soon","postDate":"1182821277","msgId":29560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxQ0QzQTM2LTcxMzQtNDI4Qy1BNjUzLTIzMkE1QUQ1REJEQUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGY1cGxhbitlYTNpQGVHcm91cHMuY29tPg==","referencesHeader":"PGY1cGxhbitlYTNpQGVHcm91cHMuY29tPg=="},"prevInTopic":29559,"nextInTopic":29561,"prevInTime":29559,"nextInTime":29561,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"We ve been to two different dentists, one when my older two were little and then a new one (the first had retired to go be a stay-at- home mom - she d had 3","messageBody":"<div id=\"ygrps-yiv-825078584\">We&#39;ve been to two different dentists, one when my older two were  <br/>\nlittle and then a new one (the first had retired to go be a stay-at- <br/>\nhome mom - she&#39;d had 3 kids during the years we were her patients)  <br/>\nwhen my youngest was little.  For a first visit, I went for a regular  <br/>\nappointment, myself, and, at the end, my kids sat in the chair, on my  <br/>\nlap. The dentist just looked inside their mouth, didn&#39;t even touch  <br/>\nthem. He said super nice things like, &quot;Wow, great teeth.&quot; That was  <br/>\nabout it. Maybe 3 minutes, total. We goofed with the chair a little  <br/>\nand turned the big light off and on.<br/>\n<br/>\nA week or two later, we went back and the dentist said hi to the  <br/>\nchild and told her that the hygienist was going to brush her teeth  <br/>\nwith special brushes. He showed the child how it worked. The  <br/>\nhygienist did it very very very gently - first with a regular  <br/>\ntoothbrush and then polished with the electric polishing tool. No  <br/>\nscraping. Then she showed the child some x-rays of teeth and said  <br/>\nthat next time they&#39;d take that kind of special pictures. So we made  <br/>\nyet another appointment for a week or so later and then went in for x- <br/>\nrays only.<br/>\n<br/>\nI never liked pediatric dentists (I&#39;ve taken my nieces and nephews to  <br/>\nthem, on occasion)  because there was an atmosphere of &quot;herding&quot; lots  <br/>\nof little, recalcitrant children. Also, the assumption that they&#39;ve  <br/>\ngot to be bribed/rewarded for a dentist visit (choose a little gift  <br/>\nat the end, get stickers, etc.) makes a negative statement. We go to  <br/>\none-person offices where we are all treated as individuals, children  <br/>\nand adults. My kids don&#39;t get all the gimmicks that pediatric  <br/>\ndentists use (bubble gum flavored rinse or whatever), but they are  <br/>\ntreated respectfully, just like any adult would be.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 25, 2007, at 5:06 PM, halfshadow1 wrote:<br/>\n<br/>\n&gt; I asked her what it would be like for my son(6yo. in Oct.) she said<br/>\n&gt; they give out a pre-school package and go over proper<br/>\n&gt; snacks,brushing,flossing with the mom(I&#39;m thinking...oh geez!)<br/>\n&gt; she said said they take the child to the back,p<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":295274109,"authorName":"Annie","from":"Annie &lt;amgreejoyjoyblue@...&gt;","profile":"amgreejoyjoyblue","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] off topic,first dentist soon","postDate":"1182817161","msgId":29559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0OTU1MS4zNzAyOC5xbUB3ZWI1ODgwNi5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PGY1cGxhbitlYTNpQGVHcm91cHMuY29tPg=="},"prevInTopic":29555,"nextInTopic":29560,"prevInTime":29558,"nextInTime":29560,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"Hi, I m a dental hygienist and used to work in a pediatric dental office. Yes, a lot of times dentists prefer to see the child alone, they do usually do better","messageBody":"<div id=\"ygrps-yiv-2077891961\">Hi,<br/>\n  I&#39;m a dental hygienist and used to work in a pediatric dental office.<br/>\n  Yes, a lot of times dentists prefer to see the child alone, they do usually do better without the parents.<br/>\n  I totally understand where you are coming from.<br/>\n  Why not ask them if you can come in the room, and then if your son doesn&#39;t cooperate they can tell him that you need to leave the room if he doesn&#39;t cooperate.  That usually works for most kids.  Some just need their parent in the room.<br/>\n  Good luck,<br/>\n  Ann<br/>\n<br/>\nhalfshadow1 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:halfshadow1@...\">halfshadow1@...</a>&gt; wrote:<br/>\n          I wanted some opinions here and i will post on veryyoungkidsteeth.<br/>\nI called a *childrens* dentist office today and inquired about how<br/>\nthey do things with children for the first visit.<br/>\nI asked her what it would be like for my son(6yo. in Oct.) she said<br/>\nthey give out a pre-school package and go over proper<br/>\nsnacks,brushing,flossing with the mom(I&#39;m thinking...oh geez!)<br/>\nshe said said they take the child to the back,parents are not allowed<br/>\nand they clean,take x-rays,and an exam.<br/>\nI asked her why can&#39;t parents be with the child and she said It&#39;s<br/>\ntheir policy,that kids do better without the parents.<br/>\nDoes this sound red flaggish or am i paranoid???<br/>\nI then said I thought it wouldn&#39;t be all that done for the first<br/>\ntime,i thought it was more of an orientation type visit,she said,they<br/>\ntry to get it done.<br/>\nI asked..well,what if my child doesn&#39;t want x-rays? and she<br/>\nsaid...they talk them thru it.<br/>\nI didn&#39;t dare ask if they ask the child if they can...i knew they<br/>\naren&#39;t respectful<br/>\nMy problem is i want your thoughts because it&#39;s very hard..so far..to<br/>\nfind a kids dentist that takes our insurance(tri-care)<br/>\nshe said when they turn 6yo. they can have appt.s in the afternoon but<br/>\nuntil that age ,it&#39;s made in the morning....what&#39;s up with that? Is<br/>\nthis a normal dentist way of doing things?<br/>\nthanks,Heather<br/>\np.s. I would particularly like to know if there are any other<br/>\nquestions i should ask and how you handled the visits.My son barely<br/>\nlets me look in his mouth.<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBuilding a website is a piece of cake. <br/>\nYahoo! Small Business gives you all the tools to get online.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212831948,"authorName":"halfshadow1","from":"&quot;halfshadow1&quot; &lt;halfshadow1@...&gt;","profile":"halfshadow1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"off topic,first dentist soon","postDate":"1182816407","msgId":29555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1cGxhbitlYTNpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":29559,"prevInTime":29554,"nextInTime":29556,"topicId":29555,"numMessagesInTopic":0,"msgSnippet":"I wanted some opinions here and i will post on veryyoungkidsteeth. I called a *childrens* dentist office today and inquired about how they do things with","messageBody":"<div id=\"ygrps-yiv-26242396\">I wanted some opinions here and i will post on veryyoungkidsteeth.<br/>\nI called a *childrens* dentist office today and inquired about how<br/>\nthey do things with children for the first visit.<br/>\nI asked her what it would be like for my son(6yo. in Oct.) she said<br/>\nthey give out a pre-school package and go over proper<br/>\nsnacks,brushing,flossing with the mom(I&#39;m thinking...oh geez!)<br/>\nshe said said they take the child to the back,parents are not allowed<br/>\nand they clean,take x-rays,and an exam.<br/>\nI asked her why can&#39;t parents be with the child and she said It&#39;s<br/>\ntheir policy,that kids do better without the parents.<br/>\nDoes this sound red flaggish or am i paranoid???<br/>\nI then said I thought it wouldn&#39;t be all that done for the first<br/>\ntime,i thought it was more of an orientation type visit,she said,they<br/>\ntry to get it done.<br/>\nI asked..well,what if my child doesn&#39;t want x-rays? and she<br/>\nsaid...they talk them thru it.<br/>\nI didn&#39;t dare ask if they ask the child if they can...i knew they<br/>\naren&#39;t respectful<br/>\nMy problem is i want your thoughts because it&#39;s very hard..so far..to<br/>\nfind a kids dentist that takes our insurance(tri-care)<br/>\nshe said when they turn 6yo. they can have appt.s in the afternoon but<br/>\nuntil that age ,it&#39;s made in the morning....what&#39;s up with that? Is<br/>\nthis a normal dentist way of doing things?<br/>\nthanks,Heather<br/>\np.s. I would particularly like to know if there are any other<br/>\nquestions i should ask and how you handled the visits.My son barely<br/>\nlets me look in his mouth.</div>","specialLinks":[]}],"prevTopicId":29649,"nextTopicId":29658}}