{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"cmas100@hotmail.com","from":"cmas100@...","replyTo":"LIST","senderId":"67WXVi1P0zWQGlsVg-OAFV42cc-aTDbKOqM5W3V51_ZI058qLtaXjUdo4JxFenR5ouGToISNE5PBmw","spamInfo":{"isSpam":false,"reason":"0"},"postDate":"980972404","msgId":15623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1OXMxaytpcmRmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":15622,"nextInTime":15624,"topicId":15623,"numMessagesInTopic":0,"msgSnippet":"Dawn, I, too, sometimes have self-doubt about what my children know or don t know.  My 8yo son just last week announced that he wanted to go to 3rd grade ps.","messageBody":"<div id=\"ygrps-yiv-1591604413\">Dawn,<br/>\n<br/>\nI, too, sometimes have self-doubt about what my children know or<br/>\ndon&#39;t know.  My 8yo son just last week announced that he wanted to go<br/>\nto 3rd grade ps.  I was shocked to here this (but kept it to myself)<br/>\nand went on to discuss with him why he wants to go.  He stated a<br/>\ncouple of things like, &quot;I&#39;m not sure I&#39;m learning what I&#39;m supposed<br/>\nto.&quot; and &quot;The teachers at school make you do your work and don&#39;t help<br/>\nyou; you try to help me.&quot;<br/>\n<br/>\nWe talked about what he does know, how he&#39;s learned it, compared that<br/>\nto grade levels and the pace of a classroom and he walked away<br/>\napparently convinced that he&#39;s doing well.  His love for math sounds<br/>\nmuch like your son&#39;s and he continuously astounds us at his growing<br/>\nknowledge (I believe he was 5 when he started saying things like, &quot;9<br/>\nnine times is 81&quot; or when he asks to be &quot;challenged&quot; by me into<br/>\nfiguring out &quot;the biggest math problems I can think of&quot;.  He is also<br/>\na self-taught reader and has the freedom to read what he wants when<br/>\nhe wants (oh my, Pokemon has a huge role in his love of reading and<br/>\nthis really isn&#39;t open for comments!!).<br/>\n<br/>\nI watch a 10yo 4th grader after school a couple days a week and<br/>\noccassionally, I find myself looking in her workbooks to see what she<br/>\nis working on.  Not only do I find that simple things like the 3 R&#39;s<br/>\nare made into very complicated subjects, but that through our<br/>\neveryday life and the natural loves & curiousities of my children,<br/>\nthey are getting everything they need academically.<br/>\n<br/>\nMy 6-1/2yo daughter is learning how to read and often wants my help.<br/>\nI can see with her what a challenge 1st grade would of been and<br/>\nprobably would have diminished her desire to read.  We have to step<br/>\nback from certain parts of it to avoid aggrevation on both of our<br/>\nparts.  I have found that, given a couple of weeks, she always<br/>\nrevisits the stuff that originally stumped her.  Then she comes to me<br/>\nand shows me (because she wants to) that she gets it now and we can<br/>\ngo on to other parts of reading or spelling.<br/>\n<br/>\nMy 3-1/2 yo is being asked by everyone we know if he&#39;s going to pre-<br/>\nschool in the fall.  What a question!  I&#39;m not sure, my 8yo didn&#39;t<br/>\nand my 6yo did, and the baby is due in March.  I&#39;m not sure that I<br/>\nwant to put him into preschool or that I can even afford it.  He&#39;s<br/>\nalso a little math whiz and he has the benefit of older siblings who<br/>\nengage and challenge him all day long, so I&#39;m not sure that preschool<br/>\nwould be beneficial.  I also dread all of the illness that comes from<br/>\npreschool and exposing the baby and the older children to that.<br/>\n<br/>\nLast week the subject of Jesus came up here and I had remarked that<br/>\nmaybe there was a better place for these discussions.  Most people<br/>\nseemed to reply to the fact that unschooling covers all aspects of<br/>\nour lives and we should have a free message board.  Then the dogs and<br/>\nabortion came up.  Personally, I am pleased to see the diversity of<br/>\nthis unschooling group and do agree that unschooling pretty much<br/>\ncovers all aspects of life.  I was very hurt and disappointed when<br/>\npersonal attacks were started because we don&#39;t all believe in the<br/>\nsame things.  It seems as though, with a new day started, that the<br/>\nopinions and comments keep coming in but that the attacks have<br/>\nstopped, which I am grateful for.<br/>\n<br/>\nTo those who have expressed pro-life support and to those who have<br/>\nexpressed pro-choice support, I applaud and respect you all, our<br/>\nbeliefs shape every aspect of our lives.  To those who responded with<br/>\nthe intent to offend, I hope, that in the future, we can express our<br/>\nopinions and leave out the hurtful attacks to those who don&#39;t share<br/>\nthe same belief as you.<br/>\n<br/>\nPeace to you and all...<br/>\n<br/>\nChris<br/>\nMommy to Jason (8), Angela (6-1/2), Daniel (3-1/2) and baby due in<br/>\nMarch!!!</div>","specialLinks":[]}],"prevTopicId":15596,"nextTopicId":15628}}