{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":218241818,"authorName":"Tracy","from":"&quot;Tracy&quot; &lt;scott.hutchins@...&gt;","profile":"twohundredacres","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: muscle&lt;&gt;brain nerve connections","postDate":"1118749222","msgId":106581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4bWZuNithcDJnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEwMi1GMzRDMDkxNjI0OUVGREQxNDBFRjcxQ0MwRjEwQHBoeC5nYmw+"},"prevInTopic":106545,"nextInTopic":0,"prevInTime":106580,"nextInTime":106582,"topicId":106545,"numMessagesInTopic":0,"msgSnippet":"***the physiological connections will come. I think my daughter s years of speech therapy were...I hate to say wasted, but...wasted time and money, which also","messageBody":"<div id=\"ygrps-yiv-88820865\">***the physiological connections will come. I<br/>\nthink my daughter&#39;s years of speech therapy were...I hate to say <br/>\nwasted,<br/>\nbut...wasted time and money, which also put her through a bit of <br/>\nsadness<br/>\nabout herself, as young as four years of age, thinking she must be <br/>\nstupid to<br/>\nneed lessons to talk. If I could do it again, I would not put her <br/>\nthrough<br/>\nthat.***<br/>\n<br/>\nYou see Heidi,...this is why I came *here* to discuss these things. <br/>\nTHANK YOU. You write what my gut tells me every single day. I don&#39;t <br/>\nknow if there are different degrees of Apraxia...I need to do some <br/>\nresearch on it - perhaps that is all that it is. <br/>\n<br/>\nI have felt all along that sending her to speech therapy would be <br/>\ninappropriate for her personality. I know this child and I know that <br/>\nshe would feel horribly isolated going to a school or office, to a <br/>\nspecial room, to learn to talk &quot;properly&quot;. I have suggested it to her <br/>\na couple times and really wish that I could take it back. At first she <br/>\nthought it meant going to school (which she was all-for BTW...she is <br/>\none child that thinks she&#39;s missing out on &quot;something&quot; not going to <br/>\nschool...) until I explained that there would not be playmates there. <br/>\nOf course she changed her mind. But I think that even that suggestion <br/>\n(once or twice) may have impacted her to some degree.<br/>\n<br/>\nOne time, when she was 3 1/2 I took her to the YMCA and let her stay <br/>\nin the babysitting room while I went swimming. When I picked her up <br/>\nshe was irritable and bothered (much like she was after I would pick <br/>\nher up after preschool those 6 weeks that she attended). I aksed her <br/>\nwhat was wrong and she said that the kids kept asking her what her <br/>\nname was, &quot;they wouldn&#39;t hear me!&quot; she kept saying. I felt so bad <br/>\nbecause I knew it was that they couldn&#39;t understand her name <br/>\n(&quot;Jocelyn&quot; isn&#39;t entirely common anyway). So we talked about it and I <br/>\ntold her that she should just say that &quot;people call me Joc&quot; since it <br/>\nwas easier to say. After that I became very aware of the whole, *whats <br/>\nyour name* moments and she&#39;d look to me for back up. I tried to always <br/>\nonly respond if she wanted me to.<br/>\n<br/>\nWe just watched home videos from that time period yesterday. In 2.5 <br/>\nyears she&#39;s come a very, very long way. So it will only get better.</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi Crane","from":"&quot;Heidi Crane&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"muscle&lt;&gt;brain nerve connections","postDate":"1118592032","msgId":106545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwMi1GMzRDMDkxNjI0OUVGREQxNDBFRjcxQ0MwRjEwQHBoeC5nYmw+","inReplyToHeader":"PDExMTg1Njg0MTguNjE3LjQzMTg2Lm0xN0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":106581,"prevInTime":106544,"nextInTime":106546,"topicId":106545,"numMessagesInTopic":0,"msgSnippet":"Tracy, If you are right,(and if you didn t already know this! :-) there is such a thing, where the neurons connecting the brain centers of speech to the ","messageBody":"<div id=\"ygrps-yiv-941141903\">Tracy,<br/>\n<br/>\nIf you are right,(and if you didn&#39;t already know this! :-) there is such a <br/>\nthing, where the neurons connecting the brain centers of speech to the <br/>\nmuscles of speech, aren&#39;t strong. A person with this weak neuronal <br/>\nconnection might also have trouble whistling, puckering up, blowing bubble <br/>\ngum bubbles, sipping through a straw, etc. and their speech will be <br/>\ndifficult to understand. My husband has it, and so does my 10 year old. It <br/>\nis called Speech Apraxia, and my belief (after several years of speech <br/>\ntherapy) is that, with time, the physiological connections will come. I <br/>\nthink my daughter&#39;s years of speech therapy were...I hate to say wasted, <br/>\nbut...wasted time and money, which also put her through a bit of sadness <br/>\nabout herself, as young as four years of age, thinking she must be stupid to <br/>\nneed lessons to talk. If I could do it again, I would not put her through <br/>\nthat.<br/>\n<br/>\nHer speech did get clearer, and her grammar cleared up, too. All around the <br/>\nsame time, after two years of twice weekly therapy sessions...and the <br/>\ngrammar cleared up AFTER we quit therapy, without one single &quot;grammar <br/>\nlesson.&quot; Of course, I can&#39;t know this for sure, but I know that her grammar <br/>\ncorrected itself without anyone teaching her, and I wonder (and I think I&#39;m <br/>\nright) if her speech wouldn&#39;t have come around eventually without the <br/>\ntherapy, if I hadn&#39;t got into a panic about it, when she was three. My mil <br/>\ntold me, she had my hubby in speech therapy when he was a kid, but they <br/>\npulled him out and it corrected itself. Except...he is still sometimes hard <br/>\nto understand. My little girl has some speech habits that are &quot;different&quot; <br/>\nwhich have actually gotten comments from people wanting to know what accent <br/>\nshe has. But she is understandable.<br/>\n<br/>\nAnd, she&#39;s 10 and her reading is coming quite slowly, but it IS coming <br/>\nalong. My hubby was a late reader, too. Your daughter being six is nothing, <br/>\nbelieve me. Expect her to read when her neurons have connected and she&#39;s <br/>\nready, not when the schools say she should be.<br/>\n<br/>\nBlessings, HeidiC who has been a panicked mother regarding verbal skills.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;I have always felt that the muscles in her mouth/brain connection<br/>\n&gt;don&#39;t jive. Because when she concentrates she can say the difficult<br/>\n&gt;sounds. It takes practice though, and she gets better<br/>\n&gt;with &quot;exercising&quot; the mouth with that sound.<br/>\n&gt;<br/>\n&gt;Tracy </span></blockquote></div>","specialLinks":[]}],"prevTopicId":106567,"nextTopicId":106542}}