{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Beth  Oberle","from":"&quot;Beth  Oberle&quot; &lt;baosjo@...","replyTo":"LIST","senderId":"Yse3yK8inPq9icoIVVlFj_R-V0OgXaOX8ywQJIh_noiLLlNgmfsotD-bbrR30BvNVx2HXyqzTaEEX3h_ejxXt8jsowMC6Dk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Digest Number 147","postDate":"934473075","msgId":1925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNDguMTkyNS45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":1924,"nextInTime":1926,"topicId":1925,"numMessagesInTopic":0,"msgSnippet":"I ve been lurking too much and decided I d better post something! On the subject of unschooling/potty training;  We are in the midst of it right now in our","messageBody":"<div id=\"ygrps-yiv-1342356214\">I&#39;ve been lurking too much and decided I&#39;d better post something!<br/>\n<br/>\nOn the subject of unschooling/potty training;  We are in the midst of it<br/>\nright now in our house.  Emma has taken it upon herself this week to start<br/>\nusing the potty.  With her sister I fell into the trap of &quot;it is time&quot; and<br/>\n&quot;trained&quot; her and as a result endured a lot of accidents and tears etc.  I<br/>\nwasn&#39;t even going to bring the topic up for many more months when little<br/>\nEmma asked one day to sit on the potty and did her thing!  She has spent<br/>\nmost of her at home time running around naked and has a stool in front of<br/>\nthe toilet so she can reach and she just goes in when she needs to.  No<br/>\naccidents yesterday.  Now she&#39;s claimed ownership of that bathroom and<br/>\nwhenever her sister or I go in to use it she says, &quot;no! my poopa!&quot;  Lucky we<br/>\nhave two others!LOL<br/>\n<br/>\nOn the subject of reading:  I got the &quot;Teach Your Child to Read in 100 Easy<br/>\nLessons&quot; last spring for Sarah because she was asking to learn to read.  We<br/>\ndid a few lessons and quite frankly, she was bored by it.  Lately I&#39;ve<br/>\nnoticed she is picking up words and figuring out how to sound out things on<br/>\nher own.  We read a lot to her.  She just finished the &quot;Read to Me&quot; summer<br/>\nreading program at the library and we read over 100 books to her since June.<br/>\nThose are just the library books, we read a lot of our own too!<br/>\n<br/>\nOn raising Spirited Children:  Sarah and I are definately Spirited.  When I<br/>\nread that book when she was about 2 I had a big light bulb go on over my<br/>\nhead!!!  She is more extroverted whereas I am introverted.  This is<br/>\ndefinately tiring some days.  Fortunately we&#39;ve recently had some girls her<br/>\nage move into the neighborhood and she has been having daily playdates with<br/>\nthem.  She comes home though so wound up and full of energy it takes a while<br/>\nto cool her down and regroup!  If she were in school she would probably be<br/>\ngiven many labels; gifted in art and language, maybe ADD (she had about 14<br/>\nof the traits listed) and who knows what else.  I agree about teaching your<br/>\nchildren to respect others.  That has been our #1 lesson since she was born.<br/>\nRecently I&#39;ve had older woman at church (the toughest critics!LOL) come up<br/>\nto me and comment on how polite and friendly Sarah is and how considerate<br/>\nshe is of others.  This makes me happier than someone saying how &quot;gifted&quot;<br/>\nshe is etc.<br/>\n<br/>\nWell gee, when I come out of lurking I do it up don&#39;t I??!!!  Sorry for the<br/>\nlong post!<br/>\n<br/>\nBeth O.</div>","specialLinks":[]}],"prevTopicId":1924,"nextTopicId":1927}}