{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Bragging was Re: [AlwaysLearning] Re: Giving information","postDate":"1170010300","msgId":27860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZDIwMWM3NDMwZCQ1OTVjZmE5MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGVwaGxqNCtxYmFlQGVHcm91cHMuY29tPiA8NUJBRENBOTktOEJEQS00RUM5LTlGNTAtOTQyMjdBREEyQTA5QHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":27859,"nextInTime":27861,"topicId":27860,"numMessagesInTopic":0,"msgSnippet":"From someone who doesn t have end product children/almost adults I can say that this unschooling life has given my two, my 9 and 6 year old, some of the most","messageBody":"<div id=\"ygrps-yiv-140615402\">From someone who doesn&#39;t have end product children/almost adults I can say <br/>\nthat this unschooling life has given my two, my 9 and 6 year old, some of <br/>\nthe most amazing abilities. Linnaea just asked me for some pomegranate <br/>\nseeds, but she couldn&#39;t remember what they were. So, she asked me for the <br/>\nfruit seeds, y&#39;know, the ones the woman ate when she shouldn&#39;t and she only <br/>\nhad 6. And I didn&#39;t get it for a few minutes, but she took me patiently to <br/>\nthe fridge and we looked until it clicked, the lovely fruit seeds, the many <br/>\nfruit seeds, the 6 that Persephone ate and shouldn&#39;t have, so she had to <br/>\nswap between Hades and Mt. Olympus and we have seasons.<br/>\n<br/>\nYesterday Simon wanted to go out to walk the dog. He wanted to go out to <br/>\nwalk the dog because he has been playing Pokemon Fire Red lately and he had <br/>\nsome plans for catching Pokemon down by a pond that I walk past when I walk <br/>\nthe dog. He was pretty sure there would be some Lotads down that way, and he <br/>\nneeded to add them to his pokemon collection. Simon doesn&#39;t go on walks <br/>\neasily. But, because he wanted to, because it was his choice, he went on <br/>\nthis walk well. Actually, he didn&#39;t. Linnaea irritated him before we left, <br/>\nso he didn&#39;t go when Linnaea and David left. He and I stayed while he worked <br/>\nthrough whatever he needed to work through and we left about 5 minutes <br/>\nbehind them. On the walk we saw a Fallow deer, which became a Stantler, and <br/>\nan old horse, a Rapidash, and lots of birds, Pidgeots and Taillows and <br/>\nWingulls and Spearows, and then there were the things that were there in his <br/>\nand Linnaea&#39;s shared imaginings. Linnaea found a Nidoran that loved her soon <br/>\nafter the capture. And there was a Rattatta site in the hay bales.<br/>\n<br/>\nLast night Linnaea composed songs. She had me transcribe her words as she <br/>\nsang them. She found a bunch of our instruments and assigned them to David <br/>\nand me (Simon played electric guitar briefly, but bowed out early) and she <br/>\nwrote out the notation, her own notation, for each instrument so that we <br/>\nwould know what to play and when. And we sang and played the two songs she <br/>\nwrote.<br/>\n<br/>\nLate at night, after David has gone to bed, they cook these amazing <br/>\ncreations. Linnaea made bread rolls the other night of flour and water and <br/>\ncoke and knew to add baking soda as a rising agent. We baked them and they <br/>\nweren&#39;t bad at all. Simon has been making egg in the hole concoctions. <br/>\nThings with cheese and home beaten applesauce and a pinch of salt and a <br/>\nsmidgen of pepper and they are tasty and playful in a way that I have never <br/>\nbeen with cooking.<br/>\n<br/>\nI don&#39;t know who they would be without unschooling. But the friends they <br/>\nhave who are in school or who are schooled are harder and sadder and need <br/>\nfar more support being who they want to be than either of my two radically <br/>\nunschooled beings do. And I don&#39;t know who or what they will be when they <br/>\nare grown up/almost adults, but I can&#39;t believe that they will be anything <br/>\nbut exactly who they are, and I hope that they can carry with them the power <br/>\nand happiness that they possess right now.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Thanks.  I&#39;ll share this with them.  They really  have been poster<br/>\n&gt; children for another way of being.<br/>\n&gt;<br/>\n&gt; Marty went to a school dance last night.<br/>\n&gt;<br/>\n&gt; Kirby&#39;s about to start training on a job that said you have to have a<br/>\n&gt; high school diploma or a GED; he has neither.  He&#39;s the only one who<br/>\n&gt; passed all the &quot;tests&quot; (informal)  and interviews to do the World of<br/>\n&gt; Warcraft customer support.  The rest of them who applied when he did<br/>\n&gt; will be doing support for other companies than Blizzard.<br/>\n&gt;<br/>\n&gt; Holly was participating in a weekly discussion of medieval virtues,<br/>\n&gt; and though she would only say two or three things in a two hour<br/>\n&gt; session, her comments were better than most of those others present.<br/>\n&gt; When the young (22 year old) wife of one of the participants wanted<br/>\n&gt; to start coming, I was talking about it with one of my best regulars<br/>\n&gt; and said &quot;I&#39;d like to say she&#39;s too young or new to the group, but<br/>\n&gt; Holly&#39;s there.&quot;  He said &quot;Yeah, but Holly&#39;s like 30.&quot;  (She&#39;s 15.  He<br/>\n&gt; knows.  He meant to say she&#39;s as mature in that type of discussion as<br/>\n&gt; if she were 30, which is too flattering, but still...  she does<br/>\n&gt; understand the subject matter better than the 22 year old graduate<br/>\n&gt; student does sometimes.)  But now Holly has a Wednesday night<br/>\n&gt; babysitting job, so she&#39;s unable to come to the discussions, which is<br/>\n&gt; fine because she was going to quit when Lost starts back up in a<br/>\n&gt; couple of weeks.<br/>\n&gt;<br/>\n&gt; These kids are just not &quot;at their spot&quot; on the conveyor belt.<br/>\n&gt; They&#39;re &quot;ahead&quot; some and &quot;behind&quot; some and &quot;beyond&quot; some and<br/>\n&gt; &quot;oblivious&quot; some (to traditions concerning school dances, for<br/>\n&gt; instance &lt;g&gt;).<br/>\n&gt;<br/>\n&gt; But in every case, they have had the information they&#39;ve requested or<br/>\n&gt; that came up naturally in the course of their wanting to know things,<br/>\n&gt; or coming across a new activity or topic, or choosing to pursue<br/>\n&gt; something or other.<br/>\n&gt;<br/>\n&gt; I didn&#39;t invite Holly to that philosophy discussion.  We meet in a<br/>\n&gt; restaurant that&#39;s walking distance, and one night she was hungry and<br/>\n&gt; wanted to go eat and then go home.  She stayed.  She came back.   She<br/>\n&gt; was curious about what we were doing, and she likes some of the<br/>\n&gt; people there.  Marty goes now too.  Marty&#39;s friend Brett started<br/>\n&gt; going.  He first planned to come for the first hour and then go to<br/>\n&gt; our house for Kirby&#39;s D&D game.  As it turned out, he goes to the D&D<br/>\n&gt; game late.<br/>\n&gt;<br/>\n&gt; Had I suggested to any of these kids that they should attend a<br/>\n&gt; philosophy discussion that I run, or MADE them go, their being there<br/>\n&gt; wouldn&#39;t be nearly the same.<br/>\n&gt;<br/>\n&gt; I&#39;ve rambled away from the original question, but I&#39;m still in the<br/>\n&gt; realm of the quality and value of information that is shared when<br/>\n&gt; the listener is interested or  needs to know, and when the listener<br/>\n&gt; is free to stay or go, free to change the subject or to ask about<br/>\n&gt; something altogether different.<br/>\n&gt;<br/>\n&gt; It&#39;s cool to say that all my kids have jobs.  Except for campus work-<br/>\n&gt; study jobs (filing cards for the bursar, and working in the<br/>\n&gt; cafeteria) I didn&#39;t have a job until I was 20 years old.   Kirby has<br/>\n&gt; worked since he was 14, and Marty since he was 15.  Holly&#39;s 15 and<br/>\n&gt; got a very good babysitting job, regular through May.  (Whether it<br/>\n&gt; will continue after that isn&#39;t important to her.)  People are happy<br/>\n&gt; with their work and their presence.   We didn&#39;t &quot;make&quot; them get jobs<br/>\n&gt; or even suggest it, in any of those cases.  (I did let Holly know<br/>\n&gt; about the babysitting job, but I didn&#39;t say &quot;Look for a babysitting<br/>\n&gt; job.&quot;)<br/>\n&gt;<br/>\n&gt; Now I&#39;m ramblng, but there are some more ideas for the collection.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":27836,"nextTopicId":27853}}