{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to expand their world? or something...","postDate":"1324102454","msgId":64513,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPUXlkYWNCdG5kcm5KZzE0UFJrWG5kVk9UeFE3OHRjSkVVSkI0b3lDU0w4UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEVENzI0N0M4LTI2QjktNEJENC04QkU3LTJFNDUzRUU0QURGOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4JPEVENzI0N0M4LTI2QjktNEJENC04QkU3LTJFNDUzRUU0QURGOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64509,"nextInTopic":0,"prevInTime":64512,"nextInTime":64514,"topicId":64483,"numMessagesInTopic":0,"msgSnippet":"... them anything since we stopped schooling at home (meaning I haven t put on my teacher hat), but I have been available to answer questions. -=- Deschool =","messageBody":"<div id=\"ygrps-yiv-906382915\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;-=-I did so much damage prior to unschooling. I haven&#39;t tried to teach<br/>\n </span></blockquote>them anything since we stopped schooling at home (meaning I haven&#39;t put on<br/>\nmy teacher hat), but I have been available to answer questions. -=-<br/>\n<br/>\nDeschool = find the fun in life.<br/>\n<br/>\nAfter you have all thoroughly deschooled, you will be able to think about<br/>\n&quot;learning&quot; without the school-baggage that you and your kids have now.<br/>\n<br/>\nAs long as the kids are still reactive to anything that reminds them of<br/>\nschooling, they still need deschooling.  As long as you are looking through<br/>\nschool-glasses (thinking in terms of school grades, curriculum levels,<br/>\nsubjects, etc.), then you still need to deschool, too.<br/>\n<br/>\nDeschooling takes time and it seems to be fragile and easily disrupted when<br/>\nparents revert (even momentarily) to pushing anything that seems school<br/>\nlike.<br/>\n<br/>\nPretend you are on a vacation - for a year or more. Seriously - be on one<br/>\nof those &quot;staycations&quot; - an extended staycation. Here is a site with a ton<br/>\nof ideas: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.staycationidea.com/\">http://www.staycationidea.com/</a>&gt;. But, mainly, it means building<br/>\nrelationships.<br/>\n<br/>\nYou listed a LOT of things your kids don&#39;t like. So, what are they actually<br/>\ndoing? I&#39;m sure they aren&#39;t just sitting on the floor, twiddling their<br/>\nthumbs (but if they are, get down there and do some fun twiddling along<br/>\nwith them).<br/>\n<br/>\nSupport them as they really are right now. Don&#39;t pay attention to what they<br/>\nare not - how they aren&#39;t living up to your wishful thinking. Just let that<br/>\ngo.<br/>\n<br/>\nDon&#39;t think about what the kids are learning, JUST think about enjoying<br/>\nlife together. Do this for a full year. Every time you slip up and start<br/>\nacting schoolishly, the year starts over.<br/>\n<br/>\nSlowly, you will start to see them relaxing into a more natural curiosity<br/>\nabout the world. Let it BE..don&#39;t push it.<br/>\n<br/>\nI can imagine how sad it seems to you to see the kids be so jaded at such a<br/>\nyoung age. But long-time unschoolers have seen seemingly miraculous<br/>\nrecoveries.<br/>\n<br/>\nSmile a LOT. Give a lot of loving! Look into their eyes. Touch them gently<br/>\nas you pass by. Make special foods for them. Snuggle up and watch whatever<br/>\nthey want to watch on tv. Have a fire in the fireplace. Bake cookies and<br/>\ndecorate them. Play with the kids in whatever way they want. Buy little fun<br/>\nthings as surprises for them. Tell silly jokes. Be calm and cheerful.  Look<br/>\nfor and cherish little special moments of contentment and happiness.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to expand their world?  or something...","postDate":"1324083479","msgId":64509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVENzI0N0M4LTI2QjktNEJENC04QkU3LTJFNDUzRUU0QURGOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64508,"nextInTopic":64513,"prevInTime":64508,"nextInTime":64510,"topicId":64483,"numMessagesInTopic":0,"msgSnippet":"-=-I did so much damage prior to unschooling. I haven t tried to teach them anything since we stopped schooling at home (meaning I haven t put on my teacher","messageBody":"<div id=\"ygrps-yiv-745472774\">-=-I did so much damage prior to unschooling. I haven&#39;t tried to teach them anything since we stopped schooling at home (meaning I haven&#39;t put on my teacher hat), but I have been available to answer questions. -=-<br/>\n<br/>\nYou still have your teacher hat, though.<br/>\nSo they know you have one, but you have taken it off.<br/>\nYou need to get rid of that. :-)<br/>\n<br/>\nBeing available to answer questions isn&#39;t all there is to unschooling.  <br/>\n<br/>\n-=-They have shut themselves down to almost everything. I&#39;d like to open the world back up to them but feel helpless to do it.-=-<br/>\n<br/>\nOpen the world up to you.<br/>\n<br/>\n-=-Dh is getting nervous because they don&#39;t know &quot;grade level&quot; school subjects, and they aren&#39;t taking an interest in something. -=-<br/>\n<br/>\nFirst part, how does he know?  <br/>\nAnd does he think every kid in fifth grade (or whatever) knows all the subjects?  <br/>\n<br/>\nSecond part, very serious question:<br/>\nWhere did he get this idea that unschooling involves &quot;taking an interest in something&quot;?<br/>\nLike what?  What does he do with them to enrich and enliven their lives.<br/>\nEven bigger question:  What is he interested in? <br/>\nWhat was he interested in before you had children?<br/>\nWhat was he interested in when you met him?<br/>\nWhat was he interested in when he was your kids&#39; ages?<br/>\n<br/>\nYou don&#39;t need to answer that here at all (keep on being anonymous).  But for yourself, and perhaps in a conversation with your husband, the answers to those questions might shed light on your lives today.<br/>\n<br/>\n-=- I&#39;m just so confused and feeling like I&#39;m failing my children with unschooling because if they don&#39;t get to the point of being interested in the world and want to learn about it how can I make learning the focus. -=-<br/>\n<br/>\nThat&#39;s not only carts before horses, that&#39;s you waiting for them to build a cart over a century after people aren&#39;t even using carts or horses anymore. :-)<br/>\n<br/>\nYou are failing your children with unschooling if you&#39;re waiting for them to get to the point of being interested in the world if you and your husband aren&#39;t interested in the world.   You will need to become an unschooling mom.<br/>\n<br/>\n-=-In one of the posts it was mentioned that the focus shouldn&#39;t be on fun but on learning, but I can&#39;t seem to get us past the point of &quot;if it&#39;s not for fun I don&#39;t want to do/see/try it.&quot;-=-<br/>\n<br/>\nYou should never get past that point.  What you should do, gradually but surely, is find the fun in all the parts of the world that will touch on all the other parts of the world. If you can&#39;t do it yourself you 1) can&#39;t expect your kids to do it, and 2) wouldn&#39;t recognize it if they did.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to expand their world?  or something...","postDate":"1324083054","msgId":64508,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBRTNFNUEzLTYzRTctNDJCMy05RUQ5LTBGQTVEQkM4Rjg0RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64505,"nextInTopic":64509,"prevInTime":64507,"nextInTime":64509,"topicId":64483,"numMessagesInTopic":0,"msgSnippet":"-=-I ve been reading the thread on focusing on learning. I m too chicken to post this to the group myself and not sure if it would help enough people to be","messageBody":"<div id=\"ygrps-yiv-875856619\">-=-I&#39;ve been reading the thread on focusing on learning. I&#39;m too chicken to post this to the group myself and not sure if it would help enough people to be worth a group discussion, but...-=-<br/>\n<br/>\nLots of things help people enough to be worth a group discussion!<br/>\n<br/>\n-=-What am I doing wrong if that time isn&#39;t coming? I thought lately that it was my depression that was making things difficult because I can&#39;t find sparkle in life, but reading this thread has me wondering if it isn&#39;t more. -=-<br/>\n<br/>\nDepression is enough.  Get help.  If you can&#39;t afford counselling, dedicate yourself to  becoming a more sparkly, joyful unschooling mom.  It might be enough (depends how serious the depression is).   Don&#39;t try to take anti-depressants without also working on changing the way you see the world, the way you respond to the world, the way you think about the world, and the way you respond to your own thoughts.<br/>\n<br/>\nThis book might help, and you can find it used and cheap:<br/>\nSlowing Down to the Speed of Life<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Slowing-Down-Speed-Life-Peaceful/dp/0062514547\">http://www.amazon.com/Slowing-Down-Speed-Life-Peaceful/dp/0062514547</a><br/>\n<br/>\n-=-We stopped schooling at home in Feb of 2010. My children still balk at anything that may have a &quot;school&quot; type feeling associated with it-=-<br/>\n<br/>\nDo you still balk to?<br/>\nOr do you glorify it?<br/>\n<br/>\nYou were schooling at home.  It&#39;s harder to deschool when one continues to live at the school that was so oppressive. Give it more time.  Use the time to deschool your own self.<br/>\n<br/>\nBefore you had children, did you and your husband (or when he was your boyfriend) go to museums or zoos together? Plays/concerts/musicals?<br/>\n<br/>\n-=- We live in a small town so there isn&#39;t much to get into, but I try to find new things to visit, usually restaurants, stores, etc. They don&#39;t like computer games or internet. They don&#39;t like books or playing board games.-=-<br/>\n<br/>\nBefore you had children, did you and your husband play video games?  Do you read books much?  Does your husband?  Do you have any good board games, by Ravensburger or Rio Grande Games?  Have you played Five Crowns?  Do your kids know poker or rummy?  Before you and your husband had kids, did you play cards?<br/>\n<br/>\n-=- I&#39;m not sure how to make the focus on learning if they balk at most of what I try because they think &quot;learning&quot; might be involved. -=-<br/>\n<br/>\nYOU focus on learning. <br/>\nLearn about learning.<br/>\nLearn about unschooling.<br/>\n<br/>\nBut more than that, learn about other things.  YOU look around the internet.  Here&#39;s some stuff I&#39;ve collected:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thinkingsticks.blogspot.com\">http://thinkingsticks.blogspot.com</a> and those lead out to other things, and those things to others.   <br/>\n<br/>\nAny starting place can lead to everything else, if you&#39;re willing to connect the dots.<br/>\n<br/>\n-=-I don&#39;t know how to expand our world so that they may find things they are interested in if they are too afraid to look at things with an open mind that it may be interesting and I&#39;m not trying to shove it down their throats. -=-<br/>\n<br/>\nStop looking at them and start looking at the world.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to expand their world?  or something...","postDate":"1324075419","msgId":64505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjQwNzU0MTkuOTM1NTUuWWFob29NYWlsTmVvQHdlYjEyMjUwOC5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64492,"nextInTopic":64508,"prevInTime":64504,"nextInTime":64506,"topicId":64483,"numMessagesInTopic":0,"msgSnippet":"***My dh just commented to me the other day that I thought unschooling kids would pick an interest to get into. *** I don t think that unschooling kids pick","messageBody":"<div id=\"ygrps-yiv-504220421\">***My dh just commented to me the other day that &quot;I thought unschooling kids would pick an interest to get into.&quot;***<br/>\n<br/>\n<br/>\nI don&#39;t think that unschooling kids pick an interest to get into.  An unschooled kid might have an interest, it might be an intense one and it might be passing.  What I find is that unschooled kids are interestED and interestING.  If a kid can learn from the whole world, then presumably, they&#39;d need to find that the whole world could be interesting and that they could become specifically interested in anything in the whole wide world.<br/>\n<br/>\n***They don&#39;t like computer games or internet.***<br/>\n<br/>\nSaying that someone doesn&#39;t like the internet is like saying kids don&#39;t like toys.  My guess is that &quot;the internet&quot; has become associated with drudgery, dullness, schoolishness.  Have you ever just browsed on Stumbleupon?  It is impossible to browse and not find something interesting!  If you are using the internet as an encyclopedia tool, then yes, I could see a kid having and aversion to it, but there are videos and music and pictures and jokes and places to buy interesting things and chat rooms and maps and virtual worlds and.... the list goes on and on!<br/>\n<br/>\nThere are so many computer games that I find it hard to believe that a kid wouldn&#39;t find something interesting.  Forget computer games for a minute, what about video games?  One of my kids is a gamer and the other one isn&#39;t as much, but even she enjoys a good game!  I&#39;m not much of a gamer either, but I&#39;ve enjoyed some great games over the years!  The xbox kinect is really really awesome and just about any lego game is really great too!  Even if a kid still doesn&#39;t like games, it seems an overkill reaction to outright dislike ALL games.  Some of the very best games, we&#39;ve played as a family and we have great memories of those games. <br/>\n<br/>\n ***They have shut themselves down to almost everything. I&#39;d like to open the world back up to them but feel helpless to do it.***<br/>\n<br/>\nThe only way that I can see that happening is if you can stop separating the world into educational or not educational.  Perhaps their world is just as open as they want it to be and they are learning just as much as they want to learn right now doing exactly what they are doing right now.  If you are the one who opens and closes the door for them, how will they ever realize they can open the door themselves?  They need to be able to keep their door shut for as long as they feel comfortable doing so, no strings attached, so that they can open it themselves without mom hovering, holding her breath, finally feeling relieved that they&#39;ve done so.  Kids feel that.  Some kids might keep that door closed just to keep mom holding her breath, and wait until mom has finally stopped looking and paying close attention.<br/>\n<br/>\nStop making it an issue.  Find something interesting to do for yourself, share what you find in the same way you would a friend or your husband.  Eventually you&#39;ll stop holding your breath and figure out how to breath without it being attached to what your kids are doing or not doing.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to expand their world?  or something...","postDate":"1324064247","msgId":64492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdEREJCN0UyLTUyMTEtNDlBNi04RDRELTgzOTgzQ0U3RTBFOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDhCMDcwOENELTI2ODUtNDRDMi1BNEQxLTUxRkNCNkY1NDlGN0BnbWFpbC5jb20+","referencesHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4gPDhCMDcwOENELTI2ODUtNDRDMi1BNEQxLTUxRkNCNkY1NDlGN0BnbWFpbC5jb20+"},"prevInTopic":64491,"nextInTopic":64505,"prevInTime":64491,"nextInTime":64493,"topicId":64483,"numMessagesInTopic":0,"msgSnippet":"-=-. That part of our lives was more about healing and trusting me again and probably didn t look like much learning was happening. It was essential in laying","messageBody":"<div id=\"ygrps-yiv-1183342960\">-=-. That part of our lives was more about healing and trusting me again and probably didn&#39;t look like much learning was happening. It was essential in laying down a foundation for all the learning that happens now.-=-<br/>\n<br/>\nI don&#39;t think you&#39;re recommending that everyone needs a sudden bout of depressing and the subsequent recovery. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: How to expand their world?  or something...","postDate":"1324064113","msgId":64491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCOTEyMkY5LUE3MjgtNDcwNS04RDI3LTAyOUY4Q0JCQUY3MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpjZzJzbStucDJ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpjZzJzbStucDJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":64488,"nextInTopic":64492,"prevInTime":64490,"nextInTime":64492,"topicId":64483,"numMessagesInTopic":0,"msgSnippet":"-=- There are more zoos in cities because there are less wild animals.-=- I think there are more zoos in cities because it s very expensive to have a zoo, and","messageBody":"<div id=\"ygrps-yiv-666788048\">-=- There are more zoos in cities because there are less wild animals.-=-<br/>\n<br/>\nI think there are more zoos in cities because it&#39;s very expensive to have a zoo, and they need financial support from visits and government funding.<br/>\n<br/>\n-=-Not that museums and zoos don&#39;t have their own charm, but as long as You see them as somehow important, your kids are going to be able to tell you have a secret agenda. You&#39;re not just going for the fun of it. Go for the fun of it! -=-<br/>\n<br/>\nBut fun is important.  So don&#39;t think of them as UNimportant.<br/>\nI don&#39;t think it should be a secret agenda.  I think you should say &quot;unschooling should involve doing lots of varied things, so let&#39;s make a list of varied things and do them.&quot;   <br/>\n<br/>\nI disagree with people who think all learning has to be stealth and that parents should never bring out a map-based board game to help their kids know where they are on their own continent.    There&#39;s a wide world of reality between wanting a kid to memorize the boundaries of states or provinces, and in working jigsaw puzzles or playing a game about train routes between cities that will absolutely help them learn a little or a lot (depends on the kid and what he already knows or cares about) about the very same information.<br/>\n<br/>\n-=-There&#39;s very little real science to be learned in a science center. -=-<br/>\n<br/>\nIf you ever are in Albuquerque, spend at least half a day at Explora.  You won&#39;t play with everything in that time, but you will learn a TON about music, air pressure, water dynamics, gravity and the Rio Grande River.<br/>\n<br/>\nI totally agree with this:  <br/>\n<br/>\n-=-How are you thinking those are different than &quot;a field trip&quot;? Because they&#39;re alive and real rather than marked with careful plaques and sign boards? Go fun places. Do fun things. Live life. That&#39;s better than &quot;a field trip&quot; anywhere. -=-<br/>\n<br/>\nForget the idea of &quot;field trips.&quot;  If you&#39;re living in the world, that IS &quot;your field.&quot;  You don&#39;t leave the school to go &quot;into the field&quot; if you don&#39;t have a school to leave.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to expand their world?  or something...","postDate":"1324061572","msgId":64488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhCMDcwOENELTI2ODUtNDRDMi1BNEQxLTUxRkNCNkY1NDlGN0BnbWFpbC5jb20+","inReplyToHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64487,"nextInTopic":64491,"prevInTime":64487,"nextInTime":64489,"topicId":64483,"numMessagesInTopic":0,"msgSnippet":"-=- I thought lately that it was my depression that was making things difficult because I can t find sparkle in life, but reading this thread has me wondering","messageBody":"<div id=\"ygrps-yiv-959491464\">-=- I thought lately that it was my depression that was making things difficult because I can&#39;t find sparkle in life, but reading this thread has me wondering if it isn&#39;t more. -=-<br/>\n<br/>\nMaybe it has something to do with your depression? A couple of years ago I was quite depressed, too chicken to post on the list and so I sent Sandra a side email for help sorting me out ; )<br/>\n<br/>\nWhat I discovered was that my depression took the sparkle out of my children. They needed a lot of recovery time to trust that I was going to be okay. They didn&#39;t dare to ask for too much in case they would overwhelm me and I would collapse again. They were so little - only 4 and 2, yet really careful in how they approached me. What helped me regain their confidence in me again was lots of time spent *being* together in a soft, gentle way - we would spend days in our pj&#39;s talking about our dreams the night before and our dreams for the future, we spent a lot of time talking in an imaginary language that my 2 year old invented, we took lots of baths together, we went on walks around the neighbourhood, we made cookies, we told each other silly stories and jokes.<br/>\n<br/>\nMy depression was quite sudden and didn&#39;t last long, a few months. Mostly because I was actively doing my best to get better - going to a therapist and doing anything I could think of to find my balance. Gianluca and Gisele were with me every day while I was slowly recovering and getting better. The stronger I got, the more more lightness, laughter and happiness I kept adding to all our lives. That part of our lives was more about healing and trusting me again and probably didn&#39;t look like much learning was happening. It was essential in laying down a foundation for all the learning that happens now.<br/>\n<br/>\nRippy<br/>\n(Gianluca 7, Gisele 5)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to expand their world?  or something...","postDate":"1324060374","msgId":64487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjZzJzbStucDJ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64483,"nextInTopic":64488,"prevInTime":64486,"nextInTime":64488,"topicId":64483,"numMessagesInTopic":0,"msgSnippet":"... ***************** Do they enjoy those things? I think you re expecting learning to look differently than it does - you re thinking museums but your kids","messageBody":"<div id=\"ygrps-yiv-1743283710\"><blockquote><span title=\"ireply\">&gt;&gt; Our days include lots of TV (some Discovery type shows, mostly Disney type), play outside, volunteer at animal shelter, and time at the stables. We live in a small town so there isn&#39;t much to get into, but I try to find new things to visit, usually restaurants, stores, etc.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nDo they enjoy those things? I think you&#39;re expecting learning to look differently than it does - you&#39;re thinking &quot;museums&quot; but your kids are in a stable and animal shelter! They&#39;re seeing real animals in real life and you&#39;re fretting that they won&#39;t look at animals behind glass. It may help to think of museums as being for people who don&#39;t have access to the &quot;real&quot; thing. There are more zoos in cities because there are less wild animals. Museum curators actively look for things which are novel, which come from elsewhere - but you don&#39;t need a museum to learn new things about the world. You can travel and watch movies and tv, read and dream.<br/>\n<br/>\nNot that museums and zoos don&#39;t have their own charm, but as long as You see them as somehow important, your kids are going to be able to tell you have a secret agenda. You&#39;re not just going for the fun of it. Go for the fun of it! And if you&#39;re not jumping in your seat excited about the idea of the latest exhibit, why should your kids have any interest at all? (and if you&#39;re excited and they&#39;re not, go yourself and have a blast)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;no science centers...<br/>\n<br/>\n </span></blockquote>Do they cook? Look up at the sky? Play in water sometimes? Jump and run? They&#39;re learning science. Science centers can be fun, but in a day-trip, look-at-the-cool-stuff kind of way - window shopping without the pressure of buying (until you get to the gift shop). There&#39;s very little real science to be learned in a science center. The big pendulums are cool, but a tire-swing contains all the same physical properties and you can climb on it. I&#39;ve learned far more science and watching fiction (and not just science-fiction) than from science centers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;no field trip type things...<br/>\n<br/>\n </span></blockquote>None? But you also wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I do travel and see as much as we can afford<br/>\n<br/>\n </span></blockquote>and<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I try to find new things to visit, usually restaurants, stores, etc.<br/>\n<br/>\n </span></blockquote>How are you thinking those are different than &quot;a field trip&quot;? Because they&#39;re alive and real rather than marked with careful plaques and sign boards? Go fun places. Do fun things. Live life. That&#39;s better than &quot;a field trip&quot; anywhere. It&#39;s likely more full of learning than a field trip anywhere. I remember... almost no field trips. I remember sight-seeing with my family - whole days with my dad! that was a treat for me, listening to him gush about lighting and lie on the floor with his camera, and then ooooh and ahhhh over architectural details. I learned more from his giddiness than from any dull tour of... whatever it was we toured in school. I&#39;m drawing a total blank other than the trip to the London theater and that was just waaaaaaay too cool for me to categorize as &quot;a field trip&quot;. Oh, wait... we went to some art museum once, but it was less memorable than a day of sight-seeing down gallery row, cutting school with friends and having a blast.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m not sure how to make the focus on learning if they balk at most of what I try because they think &quot;learning&quot; might be involved.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nYou&#39;re looking too narrowly at learning and only seeing things which look schooly. Your kids know better than you they don&#39;t need any of that. Take more time to learn about learning, yourself, so you can open your eyes and mind wider and not get so bogged down. Here&#39;s a good place to start:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/\">http://sandradodd.com/connections/</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"How to expand their world?  or something...","postDate":"1324056649","msgId":64483,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY5OTFFODYxLUIzQUMtNDM2OS05OTVCLUY4NzUxODFFODkxNEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":64487,"prevInTime":64482,"nextInTime":64484,"topicId":64483,"numMessagesInTopic":0,"msgSnippet":"What s below came by e-mail.  I took out a couple of details that might have identified the family.  There are two kids, not pre-school, not yet teens. If","messageBody":"<div id=\"ygrps-yiv-1373078949\">What&#39;s below came by e-mail.  I took out a couple of details that might have identified the family.  There are two kids, not &quot;pre-school,&quot; not yet teens.     <br/>\n<br/>\nIf you respond to it, change your auto-quote (if any) so it doesn&#39;t say &quot;Sandra Dodd wrote...&quot;  because that will make the archives very confusing. :-)<br/>\n<br/>\nI&#39;ll respond in a separate post.<br/>\n<br/>\nSandra<br/>\n----------------------------<br/>\n<br/>\nI&#39;ve been reading the thread on focusing on learning. I&#39;m too chicken to post this to the group myself and not sure if it would help enough people to be worth a group discussion, but...<br/>\n<br/>\nWhat am I doing wrong if that time isn&#39;t coming?  I thought lately that it was my depression that was making things difficult because I can&#39;t find sparkle in life, but reading this thread has me wondering if it isn&#39;t more. We stopped schooling at home in Feb of 2010. My children still balk at anything that may have a &quot;school&quot; type feeling associated with it; no museums, no science centers, no field trip type things. I do travel and see as much as we can afford. My dh just commented to me the other day that &quot;I thought unschooling kids would pick an interest to get into.&quot;<br/>\n<br/>\nOur days include lots of TV (some Discovery type shows, mostly Disney type), play outside, volunteer at animal shelter, and time at the stables. We live in a small town so there isn&#39;t much to get into, but I try to find new things to visit, usually restaurants, stores, etc. They don&#39;t like computer games or internet. They don&#39;t like books or playing board games. I&#39;m not sure how to make the focus on learning if they balk at most of what I try because they think &quot;learning&quot; might be involved. While I know that by the &quot;learning&quot; I mean they think I might try to teach them something they aren&#39;t interested in knowing.<br/>\n<br/>\nI don&#39;t know how to expand our world so that they may find things they are interested in if they are too afraid to look at things with an open mind that it may be interesting and I&#39;m not trying to shove it down their throats. I did so much damage prior to unschooling. I haven&#39;t tried to teach them anything since we stopped schooling at home (meaning I haven&#39;t put on my teacher hat), but I have been available to answer questions. They have shut themselves down to almost everything. I&#39;d like to open the world back up to them but feel helpless to do it. Dh is getting nervous because they don&#39;t know &quot;grade level&quot; school subjects, and they aren&#39;t taking an interest in something. I&#39;m just so confused and feeling like I&#39;m failing my children with unschooling because if they don&#39;t get to the point of being interested in the world and want to learn about it how can I make learning the focus. In one of the posts it was mentioned that the focus shouldn&#39;t be on fun but on learning, but I can&#39;t seem to get us past the point of &quot;if it&#39;s not for fun I don&#39;t want to do/see/try it.&quot;<br/>\n<br/>\n-------------------------------------<br/>\nend of quoted e-mail from a mom I&#39;d like to keep anonymous.</div>","specialLinks":[]}],"prevTopicId":64428,"nextTopicId":64193}}