{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dealing with Grandma","postDate":"1262895742","msgId":49471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpNWZwdStuZDBhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhpM3M0ays2Z2hoQGVHcm91cHMuY29tPg=="},"prevInTopic":49469,"nextInTopic":0,"prevInTime":49470,"nextInTime":49472,"topicId":49454,"numMessagesInTopic":0,"msgSnippet":"He has a friend who s a year older than him, and a leader in their games. He hasn t wanted to see him since mid-November because he feels like his friend","messageBody":"<div id=\"ygrps-yiv-1957439565\">&quot;He has a friend who&#39;s a year older than him, and a leader in their games. He hasn&#39;t wanted to see him since mid-November because he feels like his friend doesn&#39;t let him talk enough, or let him choose the game.&quot;<br/>\n<br/>\nKids will be in different relationships that call forth different qualities.  Sure, they have tendencies towards being leaders, followers, reconcilers, idea kids, tech kids, etc., but they also have flexibility when playing with individual kids.  If you put two leaders together, they&#39;ll either fight all the time, or one will naturally step down in that context.  It&#39;s not going to change who they fundamentally are, though.  Although it might help expand their ideas of who they are. <br/>\n<br/>\nThis is one of the huge positives of playing in multi age groups.  I have appreciated it when my kids have had the opportunity to play with kids older than themselves, and then younger, because they will tend to get to have both experiences as leaders/followers, etc.<br/>\n<br/>\n If your son has said that he wants to take some time off from this friend, then he is already aware of who he &quot;is,&quot; and is uncomfortable maybe with the extremes of the friendship.  Perhaps if he had time with another friend, maybe younger, he would have a chance to find his leadership qualities.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Grandma","postDate":"1262881646","msgId":49469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDYwQjZFLjkwMjAzMDVAbWFjLmNvbT4=","inReplyToHeader":"PGhpM3M0ays2Z2hoQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpM3M0ays2Z2hoQGVHcm91cHMuY29tPg=="},"prevInTopic":49465,"nextInTopic":49471,"prevInTime":49468,"nextInTime":49470,"topicId":49454,"numMessagesInTopic":0,"msgSnippet":"... We should change our behavior to accommodate those we love, to some degree. Who he IS? Just agreeing not to play some games would change who is is? Isn t","messageBody":"<div id=\"ygrps-yiv-741059627\">On 1/6/2010 9:40 PM, tmissinne wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My concern is that he will feel he has to change who he is in order to get Grandma&#39;s approval.<br/>\n </span></blockquote>We should change our behavior to accommodate those we love, to some <br/>\ndegree. Who he IS? Just agreeing not to play some games would change who <br/>\nis is? Isn&#39;t he the kid who plays other games with her, too?<br/>\n<br/>\nSorry - at the symposium - will write more on this later.....<br/>\n<br/>\n-pam sorooshian</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Grandma","postDate":"1262878669","msgId":49465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMTAwMTA3MDczN2c3ODNiZmY0ZWhhM2Y3NDU4MTRmYzM0MmRkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhpM3Nzcytta2cyQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpMmZqcytzNzdzQGVHcm91cHMuY29tPiA8aGkzc3NzK21rZzJAZUdyb3Vwcy5jb20+"},"prevInTopic":49464,"nextInTopic":49469,"prevInTime":49464,"nextInTime":49466,"topicId":49454,"numMessagesInTopic":0,"msgSnippet":"Grandma s worried about all the real violence in the world.  That is probably something you are protecting your son from at the moment.  She can t imagine","messageBody":"<div id=\"ygrps-yiv-32767588\">Grandma&#39;s worried about all the real violence in the world.  That is<br/>\nprobably something you are protecting your son from at the moment.  She<br/>\ncan&#39;t imagine violence as a game.  But that&#39;s okay.  Many people find this a<br/>\nstumbling block.<br/>\n<br/>\nI remember hanging out in drop in centres and playgroups and parks trying to<br/>\nget a handle on real parents and kids with my firstborn happily nursing in a<br/>\nbaby carrier.<br/>\n<br/>\nViolence was a real issue for many mothers.  Many parents &quot;banned&quot; war toys,<br/>\nwater spurting toys(guns and others) and were quite smarmy about it.  I<br/>\nobserved their kids were sometimes, not always, secretive and would make<br/>\ntheir own toy guns out of sticks, even barbies bent at the waist and pointed<br/>\nwere &quot;guns&quot;.  Still other parents to my shock were spanking and screaming<br/>\nand shaming their kids in public places.  I supplemented my observations<br/>\nwith books on anthropology, child development and history.  In the end I<br/>\nfollowed my own instincts.<br/>\n<br/>\nI still remember when one mother commented on how lucky I was that Rowan was<br/>\nsuch a good boy.  I replied I didn&#39;t believe in that kind of label--good or<br/>\nbad kids.  As far as I was concerned that label was a euphemism for how well<br/>\nparents used their own life experience to help negoitiate a successful<br/>\ncompromise when their agenda did not coincide with the priorities of their<br/>\nchild.  I was just trying to explain why my two year old seemed to be so<br/>\n&quot;well-behaved&quot;.  It wasn&#39;t that he was convienently willing to obey me, but<br/>\nthat I thought of him as my partner in situations rather than an<br/>\nunpredicatble factor that needed subduing.  To me what some parents jokingly<br/>\ncall &quot;child wrangling&quot; is violence.  Grabbing, berating and coraling a child<br/>\ninto a stroller using force is real violence.  A child pretending to fire<br/>\nlasers is pretending.  I could never fully convince others that they may<br/>\nwant to think about the meaning of the word &quot;violence&quot;, and I still find it<br/>\nsad.<br/>\n<br/>\nI thought being honest about violence, preventing real violence and being<br/>\ninvolved with children&#39;s play was very important.  What I observed was that<br/>\nplay fights can led to real violence, but toys with guns or swords led to<br/>\nabstract choreographed &quot;violence&quot;.   Many parents were very alarmed at the<br/>\nsight of kids firing laser &quot;guns&quot; at one another, but seemed less alarmed by<br/>\nkids whacking each other or pushing each other off playground equipment.<br/>\n<br/>\nOne thing I investigate is when kids are &quot;playing&quot; but one is constantly<br/>\nhurting the other.  Often the hurt child will want the &quot;game&quot; to continue<br/>\nand the dynamic to continue.  I have said to other people&#39;s kids(never mine,<br/>\noddly enough) nobody can give you permission to hurt them and dangerous<br/>\ngames that can lead to stitches or injury should be stopped.<br/>\n<br/>\nWith physical play a little observation is sometimes necessary to find out<br/>\nif the play is consensual, if there is a power imbalance and if children are<br/>\nusing a game to hurt someone.  I remember my cousin Linda and I playing<br/>\nsuperheroes with her older sister.  Linda was batgirl and I was hawkgirl or<br/>\nsome other bird of prey made up heroine.  Her sister Lorrie was the<br/>\nvillain.  We pounced on Lorrie and I remember backing off once she was in<br/>\npain, but her younger sister kept pounding her.  As the youngest of course<br/>\nshe wasn&#39;t the object of discipline once the moms heard the screaming and<br/>\nleft the kitchen to find out what we were up to however.  What they say was<br/>\ncrying and the older child hitting back.  As women they are best friends<br/>\nthough as children there was a lot of violence in their relationship and it<br/>\nseemed to go undetected by their parents.<br/>\n<br/>\nYour mom may not want to draw the line between pretend and real violence,<br/>\nbut if she is a loving grandmother your children have hit the grandma<br/>\njackpot and that should be celebrated.  Use your life experience to plan<br/>\nactivities your mother and children enjoy.  Have fun snacks, lego and maybe<br/>\nhelp your kids gift your mom with a theme party every time she visits.  Make<br/>\na pinata and break it open...maybe grandma friendly creams or lip balms<br/>\ncould be included as prizes.<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125182846,"authorName":"alexandriapalonia","from":"&quot;alexandriapalonia&quot; &lt;alexandriapalonia@...&gt;","profile":"alexandriapalonia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dealing with Grandma","postDate":"1262843612","msgId":49464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpM3Nzcytta2cyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhpMmZqcytzNzdzQGVHcm91cHMuY29tPg=="},"prevInTopic":49463,"nextInTopic":49465,"prevInTime":49463,"nextInTime":49465,"topicId":49454,"numMessagesInTopic":0,"msgSnippet":"Why not encourage both of them (all three of them?) to play games they all enjoy? We ve explained since our kids were very little, that different people like","messageBody":"<div id=\"ygrps-yiv-1723917265\">Why not encourage both of them (all three of them?) to play games they all enjoy?  <br/>\n<br/>\nWe&#39;ve explained since our kids were very little, that different people like different things, and that many people don&#39;t like (guns/sports/Harry Potter/dolls/tea/house), and that we have fun with people we care for by meeting them on some more neutral ground and playing something we (and they) both like.<br/>\n<br/>\nSo one set of grandparents we don&#39;t discuss Harry Potter with, and the other set makes wands and robes.  We play blocks and trains and cars and house and tea and board games with all the grandparents.<br/>\nIt&#39;s a tight line to walk sometimes, and my fifth child got herself in and interesting situation one day when she went with her grandmother to her grandmother&#39;s church for a social group, and got into a conversation with the pastor&#39;s wife and forgot not to mention Harry Potter as a book she really likes (when asked what she likes to read).  <br/>\n<br/>\nShe got quite an earful from the pastor&#39;s wife, but took it with aplomb, though she confided to me later that she really had a few choice words go through her head as she listened politely to the woman&#39;s opinions on Rowling&#39;s work.  <br/>\n<br/>\nWe often talk about how different people view the world, and how it&#39;s often quite different from the way we view it, and how to negotiate the world with those folks in it, and when we have one of those interactions, try to deal with it as calmly and tactfully as we can.  (I confess this daughter in particular is better at holding her tongue than I am -- though the things she tells me she didn&#39;t say are a real hoot).<br/>\n<br/>\nAnd for those we know and hold dear, we focus on our commonalities and put aside the things we like that we know make them uncomfortable.<br/>\n<br/>\nAndrea<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; I&#39;m looking for advice on helping my son Deacon, who is five, deal with his Grandma&#39;s views on violence. First off, they absolutely adore each other and have since he was born. Often the first thing he says in the morning is asking whether he&#39;s going to see Grandma that day. His younger brother Evan, who is three, feels the same way. She gets down on the floor and plays with them, and ignores any adults who happen to be in the vicinity.<br/>\n&gt; <br/>\n&gt; However, she has very specific views on violence which she has been expressing more regularly. They like to play Star Wars, and Indiana Jones, any game that involves sword, blasters, bazookas, magic (which, being a fundamentalist Christian, she also has problems with), etc. Recently she told them that she wouldn&#39;t play games involving violence with them -- even knights. Deacon asked me to tell her that it made him really sad, which I did. This led to her sending me an email basically saying that I&#39;m damaging my kids and preparing them to be violent and go to war as adults. She has made comments in front of them like &#39;I miss my innocent little boys.&#39; -- I let her know how hurtful that was.<br/>\n&gt; <br/>\n&gt; I&#39;ve forwarded her links to Sandra&#39;s page on video games, to Joyce&#39;s page on  violent video games, and a couple of other links I&#39;ve found. She&#39;s generally supportive of unschooling (I was homeschooling until I was ten, so she&#39;s very supportive of that), although I don&#39;t think she&#39;s read enough to really &#39;get it&#39;.<br/>\n&gt; <br/>\n&gt; What I need advice on is helping Deacon deal with his feelings about it. He&#39;s very concerned about other people&#39;s feelings --he&#39;s been worried since last night that I wouldn&#39;t have fun this afternoon at the amusement park because I was a little sick. I can see the conflict he feels, knowing that he loves something that Grandma disapproves of. I&#39;d love any suggestions on how to help him deal with this.<br/>\n&gt; <br/>\n&gt; Thanks<br/>\n&gt; Trisha<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":222072602,"authorName":"tmissinne","from":"&quot;tmissinne&quot; &lt;tmissinne@...&gt;","profile":"tmissinne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dealing with Grandma","postDate":"1262842836","msgId":49463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpM3M0ays2Z2hoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNDU0OTFBLjkwNzAzMDVAbWFjLmNvbT4="},"prevInTopic":49459,"nextInTopic":49464,"prevInTime":49462,"nextInTime":49464,"topicId":49454,"numMessagesInTopic":0,"msgSnippet":"My concern is that he will feel he has to change who he is in order to get Grandma s approval. Considering the background she came from -- strict Mennonite,","messageBody":"<div id=\"ygrps-yiv-1502137928\">My concern is that he will feel he has to change who he is in order to get Grandma&#39;s approval. Considering the background she came from -- strict Mennonite, parents punished and she didn&#39;t even know why, regularly shamed etc. -- she&#39;s been amazingly willing to listen to what I&#39;ve had to say (that&#39;s why I forwarded her the articles, attempting to help her feel more comfortable), and been so wonderful with my sons, which I let her know regularly.<br/>\n<br/>\nI&#39;m more worried about Deacon. I want him to be able to be himself -- it&#39;s one thing to avoid violent games around Grandma, but I can see his hesitation even when she&#39;s not here. Not because he doesn&#39;t enjoy them, but because he&#39;s worried about her. <br/>\n<br/>\nI guess this is part of the larger picture of his personality. He&#39;s very concerned with others -- very sweet and considerate. I&#39;m concerned that he will lose himself.  He has a friend who&#39;s a year older than him, and a leader in their games. He hasn&#39;t wanted to see him since mid-November because he feels like his friend doesn&#39;t let him talk enough, or let him choose the game. I told him that if he didn&#39;t want to play what his friend comes up with, we could talk about it and find something they both enjoy. That he doesn&#39;t have to always do what his friend says. He said that he feels like he has to because he&#39;s is his friend. How do I help him walk that line between being considerate, and being true to himself?<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I think it is fine for grandma to have different likes and dislikes and <br/>\n&gt; to have different standards than yours. Kids can understand that those <br/>\n&gt; are games they don&#39;t play with grandma. Just tell them Grandma doesn&#39;t <br/>\n&gt; like violent games and help them think of all the games she does like to <br/>\n&gt; play with them<br/>\n&gt; <br/>\n&gt; To have a good Grandma is such a wonderful thing in a child&#39;s life - <br/>\n&gt; don&#39;t mess it up by insisting she be you - let her be herself and help <br/>\n&gt; the kids accept who she really is.<br/>\n&gt; <br/>\n&gt; I think it tends to be a sign of maturity and confidence that we stop <br/>\n&gt; feeling like we have to engineer our kids lives so that other people <br/>\n&gt; treat them or interact with them exactly the way we wish they would. <br/>\n&gt; That&#39;s not really necessary. Your kids will learn more and become kinder <br/>\n&gt; and gentler people if you help them be understanding of grandma&#39;s <br/>\n&gt; personal preferences. Just smile lovingly and say, &quot;Yeah, I know, but <br/>\n&gt; that&#39;s just part of who grandma is and we do love her anyway.&quot;<br/>\n&gt; <br/>\n&gt; -pam </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dealing with Grandma","postDate":"1262831898","msgId":49459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDU0OTFBLjkwNzAzMDVAbWFjLmNvbT4=","inReplyToHeader":"PGhpMmZqcytzNzdzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpMmZqcytzNzdzQGVHcm91cHMuY29tPg=="},"prevInTopic":49454,"nextInTopic":49463,"prevInTime":49458,"nextInTime":49460,"topicId":49454,"numMessagesInTopic":0,"msgSnippet":"I think it is fine for grandma to have different likes and dislikes and to have different standards than yours. Kids can understand that those are games they","messageBody":"<div id=\"ygrps-yiv-159439290\">I think it is fine for grandma to have different likes and dislikes and <br/>\nto have different standards than yours. Kids can understand that those <br/>\nare games they don&#39;t play with grandma. Just tell them Grandma doesn&#39;t <br/>\nlike violent games and help them think of all the games she does like to <br/>\nplay with them<br/>\n<br/>\nTo have a good Grandma is such a wonderful thing in a child&#39;s life - <br/>\ndon&#39;t mess it up by insisting she be you - let her be herself and help <br/>\nthe kids accept who she really is.<br/>\n<br/>\nI think it tends to be a sign of maturity and confidence that we stop <br/>\nfeeling like we have to engineer our kids lives so that other people <br/>\ntreat them or interact with them exactly the way we wish they would. <br/>\nThat&#39;s not really necessary. Your kids will learn more and become kinder <br/>\nand gentler people if you help them be understanding of grandma&#39;s <br/>\npersonal preferences. Just smile lovingly and say, &quot;Yeah, I know, but <br/>\nthat&#39;s just part of who grandma is and we do love her anyway.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 1/6/2010 9:00 AM, tmissinne wrote:<br/>\n&gt; However, she has very specific views on violence which she has been expressing more regularly. They like to play Star Wars, and Indiana Jones, any game that involves sword, blasters, bazookas, magic (which, being a fundamentalist Christian, she also has problems with), etc. Recently she told them that she wouldn&#39;t play games involving violence with them -- even knights. Deacon asked me to tell her that it made him really sad, which I did. This led to her sending me an email basically saying that I&#39;m damaging my kids and preparing them to be violent and go to war as adults. She has made comments in front of them like &#39;I miss my innocent little boys.&#39; -- I let her know how hurtful that was.<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":222072602,"authorName":"tmissinne","from":"&quot;tmissinne&quot; &lt;tmissinne@...&gt;","profile":"tmissinne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Dealing with Grandma","postDate":"1262797243","msgId":49454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpMmZqcytzNzdzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49459,"prevInTime":49453,"nextInTime":49455,"topicId":49454,"numMessagesInTopic":0,"msgSnippet":"I m looking for advice on helping my son Deacon, who is five, deal with his Grandma s views on violence. First off, they absolutely adore each other and have","messageBody":"<div id=\"ygrps-yiv-1478416923\">I&#39;m looking for advice on helping my son Deacon, who is five, deal with his Grandma&#39;s views on violence. First off, they absolutely adore each other and have since he was born. Often the first thing he says in the morning is asking whether he&#39;s going to see Grandma that day. His younger brother Evan, who is three, feels the same way. She gets down on the floor and plays with them, and ignores any adults who happen to be in the vicinity.<br/>\n<br/>\nHowever, she has very specific views on violence which she has been expressing more regularly. They like to play Star Wars, and Indiana Jones, any game that involves sword, blasters, bazookas, magic (which, being a fundamentalist Christian, she also has problems with), etc. Recently she told them that she wouldn&#39;t play games involving violence with them -- even knights. Deacon asked me to tell her that it made him really sad, which I did. This led to her sending me an email basically saying that I&#39;m damaging my kids and preparing them to be violent and go to war as adults. She has made comments in front of them like &#39;I miss my innocent little boys.&#39; -- I let her know how hurtful that was.<br/>\n<br/>\nI&#39;ve forwarded her links to Sandra&#39;s page on video games, to Joyce&#39;s page on  violent video games, and a couple of other links I&#39;ve found. She&#39;s generally supportive of unschooling (I was homeschooling until I was ten, so she&#39;s very supportive of that), although I don&#39;t think she&#39;s read enough to really &#39;get it&#39;.<br/>\n<br/>\nWhat I need advice on is helping Deacon deal with his feelings about it. He&#39;s very concerned about other people&#39;s feelings --he&#39;s been worried since last night that I wouldn&#39;t have fun this afternoon at the amusement park because I was a little sick. I can see the conflict he feels, knowing that he loves something that Grandma disapproves of. I&#39;d love any suggestions on how to help him deal with this.<br/>\n<br/>\nThanks<br/>\nTrisha</div>","specialLinks":[]}],"prevTopicId":10480,"nextTopicId":49495}}