{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Beth Burnham","from":"&quot;Beth Burnham&quot; &lt;beth2002@...&gt;","replyTo":"LIST","senderId":"XgKPw75ic7ldlGFw8cyNcZVDNym63XepxAlF83zIO6yDERdk3VIPjyAjJmDgrJtlLmBAonFHHUHlY_M8Ue7YKxcyJ0Pqkwj09Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Lynda/ Here is where I am/ PS religion and Buddhism","postDate":"950627001","msgId":6529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MjAuNjUyOS45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":6528,"nextInTime":6530,"topicId":6529,"numMessagesInTopic":0,"msgSnippet":"... Lynda, Here is Northern NH but I have also seen religion in the ps in Phoenix. Of course it isn t the same as prayer like you see in parochial schools. I","messageBody":"<div id=\"ygrps-yiv-735409968\"><blockquote><span title=\"ireply\">&gt; Where is &quot;here?&quot;  <br/>\n<br/>\n </span></blockquote>Lynda,<br/>\nHere is Northern NH but I have also seen &quot;religion&quot; in the ps in Phoenix. Of course it isn&#39;t the same as prayer like you see in parochial schools. I do not speak of textbook prescribed history of religion as taught in a PS high school. I never was exposed to history of religion in HS but I was speaking of the type of accepted religious observance that are cultural as in celebrating the birth of Christ usually done as a Holiday show and parties which includes the entire school community. So that if your child wasn&#39;t Christian s/he would spend the day in the library if you complained about it as a parent. Ironically this is also where the Jehovah Witness kids go when it is time for ps kids to have any &quot;fun&quot;. (Basically they are sent to the library as a social pariah) and it happens in the US in more schools than not except where the population won&#39;t allow any observance of any real nature so all kids can have a nice shallow celebration of winter vacation or whatever they call it but that is mostly in NY City area and places where the majority of people are not just Christian. Lately the &quot;multicultural thing to do&quot; is to add Kwanza to the mix. Years ago, I did work at a Boston Sufi school in comparison which celebrated a different world religion every Friday by the entire school. That was amazing as the kids had <br/>\nto learn songs and prayers of well known and lesser known spiritual traditions around the world. Sorry there were no pagans! Again they had to learn these things and had no choice about participating which is what I think my post was about. How impossible it is to please everyone in an institution no matter how hard they try. m Albeit most don&#39;t try that hard but the  better ones do. <br/>\nI plan to take my kids as an unschooler to the MFA in Boston to see the Buddahs there. They are awesome. I am not a Buddhist but appreciate the wisdoms and teachings. My husband was an NSA Buddhist for 20 years. Any other web sites or places to learn about this of interest to kids would be great. I don&#39;t plan to force religious observance on them but do intend to open them up to all that exists not just the Christian world. I am also interested in hearing what others do with their kids in this respect. I hope people will feel safe sharing this information. Thanks</div>","specialLinks":[]}],"prevTopicId":6488,"nextTopicId":6522}}