{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":24983553,"authorName":"schuyler_waynforth","from":"&quot;schuyler_waynforth&quot; &lt;dwaynf@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: discrimination","postDate":"1020918617","msgId":6787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFiY3UwcCtiZ2o2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI4RkYyQTI2Ljg3RkUlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+"},"prevInTopic":6775,"nextInTopic":0,"prevInTime":6786,"nextInTime":6788,"topicId":6729,"numMessagesInTopic":0,"msgSnippet":"Hello Noemi, I really enjoyed your posting.  Reading about the bullies at the apartment playground reminded me of our stay in Kyoto.  We used to walk down to","messageBody":"<div id=\"ygrps-yiv-1863925691\">Hello Noemi, <br/>\n<br/>\nI really enjoyed your posting.  Reading about the bullies at the <br/>\napartment playground reminded me of our stay in Kyoto.  We used to <br/>\nwalk down to Takashimaya via a little apartment playground.  And <br/>\nonce, I got to be the non-Japanese speaking, overbearing American to <br/>\na bunch of young boys.  There was a clear bully action going on <br/>\nwherein some big boys took a collection of little boys Pokemon <br/>\ncards.  I stepped in and gave them back to the little boys.  I had <br/>\nnever dealt with such direct bullying in front of an adult, before.  <br/>\nIt was a huge adrenalin rush.  It is good to know that there are <br/>\nbodyguards scattered about the playgrounds of Tokyo, as well.<br/>\n<br/>\nSchuyler</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] discrimination","postDate":"1020899814","msgId":6775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4RkYyQTI2Ljg3RkUlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDAwYzkwMWMxZjY1YyRlNDI4ZmM4MCRhNTRkZDhjYkBub2VtaW5oLmdvbC5jb20+"},"prevInTopic":6756,"nextInTopic":6787,"prevInTime":6774,"nextInTime":6776,"topicId":6729,"numMessagesInTopic":0,"msgSnippet":"Welcome Noemi! There are so many fascinating things about the Japanese culture. And some not wonderful things. :-( The not wonderful things are probably true","messageBody":"<div id=\"ygrps-yiv-1202564548\">Welcome Noemi!<br/>\n<br/>\nThere are so many fascinating things about the Japanese culture. And some<br/>\nnot wonderful things. :-( The not wonderful things are probably true of any<br/>\nclosed culture the way Japan was and is. Zenmama&#39;s experiences in Utah might<br/>\nbe very similar!<br/>\n<br/>\nI&#39;ve heard that homeschooling is very difficult in Japan. Have you found<br/>\nthat to be true?<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] discrimination","postDate":"1020886221","msgId":6756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBHVlQwMDFYVjRVTDdNQG10YTYuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":6729,"nextInTopic":6775,"prevInTime":6755,"nextInTime":6757,"topicId":6729,"numMessagesInTopic":0,"msgSnippet":"This is my first post to the list.  I am second generation Japanese-Brazilian, my husband is Japanese and  we unschool our 7yo dd in Tokyo, Japan. ... Welcome","messageBody":"<div id=\"ygrps-yiv-369883066\">This is my first post to the list.  I am second generation<br/>\nJapanese-Brazilian, my husband is Japanese and  we unschool our<br/>\n7yo dd in Tokyo, Japan.<br/>\n----------<br/>\n<br/>\n<br/>\nWelcome to the list! I love to read about unschooling experiences in other<br/>\ncountries.<br/>\n<br/>\nPam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4071615,"authorName":"noemi hiraishi","from":"&quot;noemi hiraishi&quot; &lt;noeminh@...&gt;","profile":"diafelizus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"discrimination","postDate":"1020839640","msgId":6729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzkwMWMxZjY1YyRlNDI4ZmM4MCRhNTRkZDhjYkBub2VtaW5oLmdvbC5jb20+"},"prevInTopic":0,"nextInTopic":6756,"prevInTime":6728,"nextInTime":6730,"topicId":6729,"numMessagesInTopic":0,"msgSnippet":"Dear members of the list. This is my first post to the list.  I am second generation Japanese-Brazilian, my husband is Japanese and  we unschool our 7yo dd in","messageBody":"<div id=\"ygrps-yiv-176566960\">Dear members of the list.<br/>\n<br/>\nThis is my first post to the list.  I am second generation<br/>\nJapanese-Brazilian, my husband is Japanese and  we unschool our<br/>\n7yo dd in Tokyo, Japan. So far<br/>\nit seems to us that we are the only HS of the neighborhood. We<br/>\nare lucky that we can join a weekly outing with a multicultured<br/>\nhs group. Anyone can find us playing in one of the parks<br/>\nsurrounding Tokyo during weekdays.<br/>\n<br/>\nMy dd and I are much darker than most of the people of our area<br/>\nin a country that is the best one consumer of whitening products.<br/>\nWe have been enjoying  the summer of both north and south<br/>\nhemisphere for the past 3 years. We have just come back fm Sao<br/>\nPaulo, Brazil, where my mother and sister live.<br/>\n<br/>\nDd says that  T., 6yo is her best friend. Until last year dd used<br/>\nto say that T. was American. T. is blond.  Her daddy walks and<br/>\nwork on bear foot and finger prints when he has to &quot;sign&quot; the<br/>\nreceipt for my sister for his monthly salary. T&#39;s mother uses pen<br/>\nwhen she gets her own pay-check for looking after my sister&#39;s<br/>\nranch house and garden.<br/>\n<br/>\nLast year, T&#39;s mother and T. walked 8 km to and from the public<br/>\npre-school.  This year they are walking to the building next<br/>\ndoor. We spend most of our days in Brazil at my sister&#39;s ranch<br/>\nthat is one and half hour fm Sao Paulo city and 20 min. to the<br/>\nbeach. Dd wakes up and before having her break fast, runs to T,<br/>\nplace to see if she had already taken her breakfast.  T&#39;s mother<br/>\ndoes not allow T. to call dd to play. Dd has to go there all the<br/>\ntime.  T, is also not allowed to go inside my sister house unless<br/>\ninvited.  These are the rules of the area. My sister tells dd<br/>\nthat these are the rules there.  T. and dd are friends, but T.<br/>\nfamilies and my sister are employer and employee too.  Dd knows<br/>\nthat each family operates within its own rules and each family<br/>\nhave their our requirements of manners. From having been to many<br/>\nhomes, dd knows that families have different table manners, eat<br/>\ndistinct foods and speak in languages not yet familiar to her. Dd<br/>\ndaughter also knows that she knows it all because her parents<br/>\nlike to travel, meet  people, share soul and table food and<br/>\nhomeschool.<br/>\n<br/>\nWhen we left Brazil, I gave T. most of the pencils, colored<br/>\npencils, crayons and white papers.  Once T&#39;s mother said that T.<br/>\ndid not do her homework because T. has not told her that she did<br/>\nnot have colored pencils. It happened last summer.<br/>\n<br/>\nNow that we are back to Tokyo dd is speaking Portuguese more the<br/>\nway I do. Dd is not using T. and T&#39;s family Portuguese classified<br/>\nby the experts as &quot;Portuguese spoken by the unlearned&quot;.  I follow<br/>\nHolt&#39;s teaching and I do not correct, neither dd  Portuguese nor<br/>\nher English (mostly yet passive). I am thankful to T&#39;s family for<br/>\nallowing their daughter to play freely with dd fm 7 AM to 8 PM.<br/>\nThanks to them, dd began speaking Portuguese. (Last year I have<br/>\nposted at unschooling.com under trilingual unschooling)<br/>\n<br/>\nRight now dd is playing with her friend M.  M&#39;s father is fm<br/>\nPakistan and her mother is Japanese. M.  has big dar eyes and is<br/>\nhairly. On her way home fm ps, M. daily stops at our apartment<br/>\nand calls dd to play with her. Dd is set next to the apartment&#39;s<br/>\nwindow  30 min. before that call.<br/>\n<br/>\nToday it is rainning but on sunny days 5 to 6 children with one<br/>\nor both parents that do not speak Japanese fluently gather at the<br/>\npark in front of our apartment. We live in public housing for low<br/>\nincomers. There is a quite large Chinese comunity here.<br/>\n<br/>\nThis gathering is unusual.  Children here in Japan is said that<br/>\nonly play  with their own classmates. The ps policy is to teach<br/>\ncomformity and strong group spirity (&quot;wa&quot;).  But the children at<br/>\nthis park are fm different ages. I know all of them because dd<br/>\nand I are at the park on most sunny days.  I am one of the few<br/>\nadults that frequents the park. I see the group as &quot;ostracized<br/>\nchildren of the neighborhood&quot;. I am grateful that they gather at<br/>\nthis park.  And I make sure that they enjoy their time here.<br/>\n<br/>\nI can see and hear the talks at the park fm my apartment&#39;s<br/>\nwindow.  If I see that if bully come, I am there to impose adult<br/>\nauthority. By just being there.<br/>\n.......<br/>\nI have been unschooling for a year already but have not yet found<br/>\nany hsing family that does it in Portuguese.  When people here<br/>\napproach me their first question is from which country I am from.<br/>\nThe following question is always if I speak English. Thanks to<br/>\nthis hability, I do feel discriminated here.  Neither I feel that<br/>\ndd does.  But my brother, 5 cousins and 3 nieces that are here in<br/>\nJapan as laborer hold hurt. None of them speaks English neither<br/>\ndo they read and write Japanese, although they all have more than<br/>\n16 years of Brazilian school  education.  250.000 Brazilians are<br/>\nin Japan &quot;learning&quot;  about discrimination, a subject that most of<br/>\nthese Brazilians say it is over in Brazil.<br/>\n<br/>\nWorld soccer 2002 will be hosted by Korea and Japan.  Before<br/>\nWWII, Japan made Koreans speak only Japanese.  So far, it seems<br/>\nthat soccer has brought Koreans and Japanese closer.<br/>\nDiscrimination / racism will be a hot subject again in the<br/>\nfollowing months; for the ones that have not been confronted by<br/>\nit.<br/>\n<br/>\nThank you Joylyn for your sharing.  And thank you for reading<br/>\nthis far.<br/>\n<br/>\nnoemi. my humble contribution. love and peace</div>","specialLinks":[]}],"prevTopicId":6784,"nextTopicId":6790}}