{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how do you get stuff done?","postDate":"1094685287","msgId":99386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwOTA4MjMxNDQ3LjU3NTA5LnFtYWlsQHdlYjQwMTA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQwOTA4MjEwNDEzLjc5MTI2LnFtYWlsQHdlYjg2MjAxLm1haWwudWtsLnlhaG9vLmNvbT4="},"prevInTopic":99379,"nextInTopic":0,"prevInTime":99385,"nextInTime":99387,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":"**My current laundry plan includes the BBC Pride and Prejudice with Colin Firth, and that makes laundry fun.** I do the same thing,  just throw it all in a","messageBody":"<div id=\"ygrps-yiv-1068373982\">**My current <br/>\nlaundry plan includes the BBC Pride and Prejudice with Colin Firth, and that makes <br/>\nlaundry fun.**<br/>\n<br/>\n <br/>\n<br/>\n I do the same thing,  just throw it all in a clump on the couch and fold and fold and fold.  For a long time it was the LOTR Extended versions.   I now have to go and rent Pride and Prejudice, I haven&#39;t seen that in a long time.  :)<br/>\n<br/>\n <br/>\n<br/>\nI also do this with my son when he&#39;s playing video games.  I can be with him, talk with him and at the same time accomplish the mundane task of folding clothes.<br/>\n<br/>\n <br/>\n<br/>\nOh,  I thought of you two today, Shyley and Sandra,  I was at a Claire&#39;s boutique where I saw wristbands that had &quot; I love Colin&quot; stitched on them.    I wondered which Colin it was, but thought you guys would like them. &lt;g&gt;  I wanted the Mrs. Bloom handbag.   I&#39;m sooo adolescent.  &lt;G&gt;<br/>\n<br/>\n <br/>\n<br/>\nKelli~<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - Send 10MB messages!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":182360290,"authorName":"SHYRLEY WILLIAMS","from":"=?iso-8859-1?q?SHYRLEY=20WILLIAMS?= &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how do you get stuff done?","postDate":"1094677453","msgId":99379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwOTA4MjEwNDEzLjc5MTI2LnFtYWlsQHdlYjg2MjAxLm1haWwudWtsLnlhaG9vLmNvbT4=","inReplyToHeader":"PDFlYS4yYTBhYzM5NC4yZTcwYTZmMUBhb2wuY29tPg=="},"prevInTopic":99365,"nextInTopic":99386,"prevInTime":99378,"nextInTime":99380,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":"SandraDodd@aol.com wrote: In a message dated 9/8/04 1:07:56 AM, dezigna@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-709247957\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\nIn a message dated 9/8/04 1:07:56 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n&lt;&lt; What I have to do is have a laundry day - or I am washing<br/>\nall week long.  &gt;&gt;<br/>\n<br/>\nBecause we have a washer and dryer right in the middle of the house, I can <br/>\nrun laundry as a background program. &lt;g&gt;  There are usually things dry in the <br/>\ndryer, and they come out when someone needs an item or when someone else needs <br/>\nthe dryer.  That gets dumped on the couch, and part of my &quot;job&quot; is watching <br/>\nmovies so that I will sort what&#39;s on the couch (what hasn&#39;t already been picked <br/>\nup by people looking for their favorite things, or towels).   My current <br/>\nlaundry plan includes the BBC Pride and Prejudice with Colin Firth, and that makes <br/>\nlaundry fun.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\nOoooooooo, the lake scene :-)<br/>\n<br/>\nThats what I miss about America. A dryer. And a dishwasher. We cant afford either on a Brit salary and there aren&#39;t places in the kitchen to put them if we could. I loved my dishwasher in the US :-(<br/>\n<br/>\nWaaaah.<br/>\n<br/>\nShyrley<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\n ALL-NEW Yahoo! Messenger - all new features - even more fun!  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how do you get stuff done?","postDate":"1094667505","msgId":99365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYS4yYTBhYzM5NC4yZTcwYTZmMUBhb2wuY29tPg=="},"prevInTopic":99362,"nextInTopic":99379,"prevInTime":99364,"nextInTime":99366,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/8/04 1:07:56 AM, dezigna@comcast.net writes:  Because we","messageBody":"<div id=\"ygrps-yiv-1006504688\">In a message dated 9/8/04 1:07:56 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n&lt;&lt; What I have to do is have a laundry day - or I am washing<br/>\nall week long.  &gt;&gt;<br/>\n<br/>\nBecause we have a washer and dryer right in the middle of the house, I can <br/>\nrun laundry as a background program. &lt;g&gt;  There are usually things dry in the <br/>\ndryer, and they come out when someone needs an item or when someone else needs <br/>\nthe dryer.  That gets dumped on the couch, and part of my &quot;job&quot; is watching <br/>\nmovies so that I will sort what&#39;s on the couch (what hasn&#39;t already been picked <br/>\nup by people looking for their favorite things, or towels).   My current <br/>\nlaundry plan includes the BBC Pride and Prejudice with Colin Firth, and that makes <br/>\nlaundry fun.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how do you get stuff done?","postDate":"1094666886","msgId":99362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2LjU3ZGQzNjU2LjJlNzBhNDg2QGFvbC5jb20+"},"prevInTopic":99352,"nextInTopic":99365,"prevInTime":99361,"nextInTime":99363,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":" Bedtime is a good thing, if it s time to go to bed because the house has gotten quiet and the","messageBody":"<div id=\"ygrps-yiv-2051282217\">&lt;&lt; I have tried to let go of the whole bedtime thing.  &gt;&gt;<br/>\n<br/>\nBedtime is a good thing, if it&#39;s time to go to bed because the house has <br/>\ngotten quiet and the children are sleepy.    <br/>\n<br/>\nArbitrary bedtime by the clock might be a thing to reconsider, but not to let <br/>\ngo of entirely all at once.   <br/>\n<br/>\nGradually saying &quot;yes&quot; more and &quot;okay&quot; more, and being willing to do things <br/>\nin new and different and more peaceful ways is healing.   Getting rid of whole <br/>\nthings can be disturbing.<br/>\n<br/>\n-=-Anyway, I find my daughter tends to &quot;bug&quot; me 50 times over.  -=-<br/>\n<br/>\nIf you look at the individual moments instead of the overall, you can sort <br/>\nout the threads of what she needs and what she wants, and if you&#39;re willing to <br/>\nrearrange your life so that different priorities and needs are foremost, it <br/>\nwill dissolve itself into the new fabric, I think.<br/>\n<br/>\n-=-I feel like I sit down, then I jump up, then I sit down, then I jump up, <br/>\nor I&#39;m the evil mom saying &quot;make yourself a sandwich or heat up something&quot;, or <br/>\n&quot;it&#39;s my turn for the computer&quot;, or &quot;bathroom time should be private <br/>\ntime/PUHLEASE just do your thing and get it over&quot; etc...  How do you do it? -=-<br/>\n<br/>\nBy making sandwiches, letting them use the computer until they&#39;re through and <br/>\nletting them talk to me while I&#39;m on the pot if they want to.   But we <br/>\nstarted that from the beginning, and didn&#39;t jump to it all at once.<br/>\n<br/>\n-=-When I get home, I must make dinner.  Sometimes that&#39;s something simple <br/>\nlike sandwiches.  Otherwise, it takes time to prepare. -=-<br/>\n<br/>\nDo you want us to help you brainstorm options?  Crockpot from the morning?  <br/>\nTake something out of the freezer you made twice as much of another day?<br/>\n<br/>\n-=-and because I don&#39;t like<br/>\n maggots I clean the plates and take out garbage. -=-<br/>\n<br/>\nThis kind of visualizing and justification is harsh on your own soul.  Who <br/>\ntold you you&#39;ll get maggots if you don&#39;t clean the plates and take out the <br/>\ngarbage?  Do you even have flies?  (In the Middle Ages, there was a belief that <br/>\nmaggots appeared on their own somehow because of the sun, but really--flies have <br/>\nto lay eggs, and it takes a while for them to develop into maggots.  More than <br/>\na week, I think.)  If you take the trash out every few days and you swat the <br/>\nflies, you won&#39;t have maggots.  And maggots only grow on rotting meat and <br/>\nsuch, not on plastic bags and paper.<br/>\n<br/>\nDon&#39;t have boogy-men in your life that aren&#39;t realistic.  Don&#39;t act in <br/>\nresponse to boogy-men (or boogy-maggots).<br/>\n<br/>\n-=-Also, since i&#39;m so tight on time I dont&#39; shop that often and run out <br/>\nsometimes - or plain forget to get new when I do go shopping.  How do you do it?-=-<br/>\n<br/>\nBreathing to calm myself always helps.   <br/>\nKeeping lists (magnet to the fridge) and never going to the store without the <br/>\nlist helps.<br/>\nPutting things on the list before I run out helps.  If I know when I get to <br/>\nthe store that we don&#39;t REALLY need it yet (butter is on my list, but we have a <br/>\npound still), I&#39;ll put it back on the new list when I get back, having chosen <br/>\nto wait another time.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: how do you get stuff done?","postDate":"1094660035","msgId":99352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNobmI0MytxYmUwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMGYwMWM0OTVhMiQ3ZGJmNWJmMCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":99318,"nextInTopic":99362,"prevInTime":99351,"nextInTime":99353,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":"I agree with Julie. Most of the time, when DS (6 yrs old) gets pestery (is that a word? lol) it s because he needs focused attention and isn t getting it -","messageBody":"<div id=\"ygrps-yiv-1011048165\">I agree with Julie. Most of the time, when DS (6 yrs old) <br/>\ngets &quot;pestery&quot; (is that a word? lol) it&#39;s because he needs focused <br/>\nattention and isn&#39;t getting it - even if it seems like I&#39;m there but <br/>\nI&#39;m mentally elsewhere. I have worked from home on occasion (and <br/>\nhope to make several days per week at home the norm) and DH worked <br/>\nfrom home (part time) for a few years. We found that even 15 minutes <br/>\nof focused being there time WHEN DS wanted it alleviated hours of <br/>\npestering and &quot;Are you done yet?!&quot; frustration. We also include DS <br/>\nin the laundry, the dishes, the bill paying, the shopping, etc. as <br/>\nmuch as he chooses to be involved. Laundry has always been a once a <br/>\nweek thing - back when DS was little and we lived in a bitty campus <br/>\napartment, after we moved and could use MIL&#39;s washer and dryer <br/>\n(which meant a 30 minute drive each way), and now when we have a <br/>\nhouse with a washer and dryer right there in the basement. That&#39;s <br/>\nthe way DH prefers it (he&#39;s the at home parent) so that&#39;s how it <br/>\ngoes. And, DS has his own computer - purchased very inexpensively at <br/>\na used/refurbished computer place but with enough power to go online <br/>\nto play and such. He sits with me sometimes when I&#39;m doing bills and <br/>\ndoes his own &quot;bills&quot; - he&#39;ll draw or scribble or write on small bits <br/>\nof paper (3x5 size) and use old envelopes and those freebie address <br/>\nlabels and assorted stickers. He keeps me company while I talk about <br/>\nwhat bills I&#39;m paying and all. We also used a grocery delivery <br/>\nservice for a while when DH was working because it was taking too <br/>\nmuch of our time away to manage the drive to the store, shopping, <br/>\ndriving back, putting it away, etc. By timing the delivery to a time <br/>\nwhen DH was home anyhow (like on laundry day) both things could get <br/>\naccomplished without eating up more of the day. Also, things like <br/>\ndeveloping menus and keeping staples on hand helped with dinner - DH <br/>\nand I can tag-team dinner if we both know what is happening.<br/>\n<br/>\nAs far as the original post, what struck me right off is being away <br/>\n10 hours per day and then get home and &quot;must&quot; make dinner because <br/>\nwhen I thought about it, I&#39;m gone 10 hrs per day too (didn&#39;t realize <br/>\nit was that many hours because I&#39;m so close to home). Something that <br/>\nreally helps is that dinner can wait for 15 or 20 minutes while DS <br/>\nand I reconnect - whether I sit and watch part of whatever he&#39;s <br/>\nwatching or we sit and look at a book or something together or draw <br/>\non the table (yes, -on- we have big rolls of brown paper we use as a <br/>\ntable covering and keep containers of markers, pens, and crayons <br/>\nwhere most people have the lazy susan with salt and pepper). I also <br/>\nmake sure I am available to talk to him once or twice during the <br/>\nday - I call home or he calls me here at work and we chat.  We even <br/>\nhave what might seem a silly bit: one day when he was particularly <br/>\nsad about me leaving for work, I told him about the &quot;purple part&quot; <br/>\nthat grows in every mommy&#39;s brain when they have a baby. That part <br/>\n(and I pointed to a specific part of my head) spends the whole day, <br/>\nno matter what, just thinking on that baby. He has decided he has a <br/>\npurple part too. So I kiss his purple part (his moves around his <br/>\nhead sometimes) and he kisses mine (it&#39;s roughly behind my right <br/>\near) and I give an extra hug and kiss to a small purple teddy bear <br/>\nwho holds onto it for him in case he needs and extra hug and kiss <br/>\nduring the day. Simple enough routine, takes all of 5 minutes maybe <br/>\nIF he&#39;s awake before I leave. If he&#39;s asleep I write a note for him <br/>\nby his seat at the table. When he was a pre-reader, I wrote the same <br/>\nthing over and over. Those were the first words he could recognize <br/>\non sight in other contexts. It&#39;s all about developing the routines <br/>\nand habits that promote staying connected because that&#39;s what all <br/>\nthe pestering is about to start with - connecting.</div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how do you get stuff done?","postDate":"1094647855","msgId":99318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGYwMWM0OTVhMiQ3ZGJmNWJmMCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDIwMDQwOTA4MDMxNzA3LjIwNy5xbWFpbEB3ZWIyMDcwNS5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":99312,"nextInTopic":99352,"prevInTime":99317,"nextInTime":99319,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1370673576\">&lt;&lt;&lt;&lt;&lt;Anyway, I find my daughter tends to &quot;bug&quot; me 50 times over.  She wants<br/>\nthe computer, she wants me to make her something to eat, she wants me to<br/>\ncome talk to her while she&#39;s on the toilet, &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIt may help to consider that she doesn&#39;t mean to &quot;bug&quot; you, she is trying to<br/>\nlove you, albeit in a rather &quot;annoying&quot; way.<br/>\n<br/>\nShe thinks you&#39;re awesome and wants to spend time with you.  You need to get<br/>\nsome stuff done and then have some down time.  Here is what I would suggest.<br/>\n<br/>\nInvite her to help you.....really help you.  If you are paying bills,<br/>\nexplain to her what you are doing as you go along, let her do the math part<br/>\non the calculator, let her stuff the envelope, etc..<br/>\n<br/>\nThen make her a yummy snack, a library book or a video and let her know that<br/>\nyou are needing to recharge and that you will be available in 20 minutes.<br/>\nYou might think about asking her to get the next project organized that you<br/>\ncan do together when you are finished relaxing.  She is going to interrupt<br/>\nseveral times.  Be nice, gentle but let her know you will be out soon.  Then<br/>\nbe sure to be right there physically and emotionally as soon as the time is<br/>\nup.<br/>\n<br/>\nJulie S.<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Ali Kat&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sweetgypsiedncer@...\">sweetgypsiedncer@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, September 07, 2004 10:17 PM<br/>\nSubject: [UnschoolingDiscussion] how do you get stuff done?<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; I have tried to let go of the whole bedtime thing.  DD (8) tends to go to<br/>\nbed now after I have.  I have traditionally used the evening time to get<br/>\ndone all the mundane but important things that I try to avoid when I&#39;m with<br/>\ndd so that I can focus my attention and time on her.  i.e. refilling Rx,<br/>\nsending out bill payments, writing letters/emails, organizing paperwork and<br/>\nmedical stuff, etc...  I also use the time for school work (i&#39;m taking<br/>\nonline courses).  I know I can drop these.  Other than the fact that when<br/>\ndone with school I can earn more money (which is attractive because I am a<br/>\nsingle mom), I realize it&#39;s not an ultimate priority.  At the same time, it<br/>\ntakes about 1 hour a night that I would otherwise devote to television or<br/>\nreading for pleasure.<br/>\n&gt;<br/>\n&gt; Anyway, I find my daughter tends to &quot;bug&quot; me 50 times over.  She wants the<br/>\ncomputer, she wants me to make her something to eat, she wants me to come<br/>\ntalk to her while she&#39;s on the toilet, she wants to know exactly how far<br/>\naway her birthday is, and so on...  I feel like I sit down, then I jump up,<br/>\nthen I sit down, then I jump up, or I&#39;m the evil mom saying &quot;make yourself a<br/>\nsandwich or heat up something&quot;, or &quot;it&#39;s my turn for the computer&quot;, or<br/>\n&quot;bathroom time should be private time/PUHLEASE just do your thing and get it<br/>\nover&quot; etc...  How do you do it?  I do as much school/email stuff as possible<br/>\nwhile I&#39;m at lunch or on break at work.  I am away from the house for 10<br/>\nhours a day for work/travel time.  When I get home, I must make dinner.<br/>\nSometimes that&#39;s something simple like sandwiches.  Otherwise, it takes time<br/>\nto prepare.  Eating out is not financially feasible on a daily or even<br/>\nweekly basis.  Additionally, since I do work I do need to do laundry<br/>\nsometimes, and because I don&#39;t like<br/>\n&gt;  maggots I clean the plates and take out garbage.  I don&#39;t always wash the<br/>\ndishes, but if I don&#39;t do it right away then it&#39;s twice as long next time.<br/>\nI try to use paper as much as possible but that feels like throwing away<br/>\nmoney.  Also, since i&#39;m so tight on time I dont&#39; shop that often and run out<br/>\nsometimes - or plain forget to get new when I do go shopping.  How do you do<br/>\nit?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ---------------------------------<br/>\n&gt; Do you Yahoo!?<br/>\n&gt; Yahoo! Mail is new and improved - Check it out!<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":182360290,"authorName":"SHYRLEY WILLIAMS","from":"=?iso-8859-1?q?SHYRLEY=20WILLIAMS?= &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how do you get stuff done?","postDate":"1094630724","msgId":99312,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwOTA4MDgwNTI0Ljg2Mzg5LnFtYWlsQHdlYjg2MjAyLm1haWwudWtsLnlhaG9vLmNvbT4=","inReplyToHeader":"PDIwMDQwOTA4MDc1NjM1LjI2MTcucW1haWxAd2ViODYyMTEubWFpbC51a2wueWFob28uY29tPg=="},"prevInTopic":99310,"nextInTopic":99318,"prevInTime":99311,"nextInTime":99313,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":"That tongue in cheek thing was meant to be a funny although on reflection I suddenly thought some people might take offence so, no offence meant. My sense of","messageBody":"<div id=\"ygrps-yiv-565785304\">That tongue in cheek thing was meant to be a funny although on reflection I suddenly thought some people might take offence so, no offence meant. My sense of humour and that of americans is often different.<br/>\n<br/>\nSHYRLEY WILLIAMS &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shyrley.williams@...\">shyrley.williams@...</a>&gt; wrote:&lt;warning, tongue in cheek alert...&gt;<br/>\nBorrow 3 or 4 more kids of various ages for a month. Then go back to having one. You will be amazed at how much time you have ;-)<br/>\n<br/>\n&lt;tongue back out of cheek&gt;<br/>\n<br/>\nI include my in activitues like doing the dishes or cleaning. They either help or find something to do instantly. At 8 I would say your daughter was old enough to understand about &#39;me&#39; time. If she&#39;s bugging you all the time its possible that you are giving her part-time harried attention all the time. Sit down with her and explain you&#39;ll do something for an hour where she has your whole attention then you want to do some chores. She can either help or read or something. Then more &#39;her&#39; time. Then &#39;you&#39; time. Because she would have had some undivided attention then she will feel more content and less bugging.<br/>\nIt takes a while to change this but I do it with 4 kids. They all get undivided attention to do something special for them (sort off, as I have to hold the baby all day) but it does stop that all day fight for attention cos they know that they &#39;special&#39; project will get done without siblings joining in.<br/>\nAnyway, thats what worked for me. There are still days when I&#39;m washing the dishes at 11pm and gritting my teeth or I forget to put he garbage out and it only gets collected once a fortnight or we&#39;re at the hospital all day with the baby so everybody is whining and competeing for mummy-time.<br/>\nBut on the whole the children &#39;join in&#39; We talk when we walk to the shops -an every day chore. Or we chat on the bus on the way to the hospital - also every day at the moment. They also enjoy playing Runescape online so will play for hours which is a great time for me to get the chores done and have a cup of tea.<br/>\n<br/>\nShyrley<br/>\n<br/>\nAli Kat &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sweetgypsiedncer@...\">sweetgypsiedncer@...</a>&gt; wrote:<br/>\n<br/>\nI have tried to let go of the whole bedtime thing.  DD (8) tends to go to bed now after I have.  I have traditionally used the evening time to get done all the mundane but important things that I try to avoid when I&#39;m with dd so that I can focus my attention and time on her.  i.e. refilling Rx, sending out bill payments, writing letters/emails, organizing paperwork and medical stuff, etc...  I also use the time for school work (i&#39;m taking online courses).  I know I can drop these.  Other than the fact that when done with school I can earn more money (which is attractive because I am a single mom), I realize it&#39;s not an ultimate priority.  At the same time, it takes about 1 hour a night that I would otherwise devote to television or reading for pleasure.  <br/>\n<br/>\nAnyway, I find my daughter tends to &quot;bug&quot; me 50 times over.  She wants the computer, she wants me to make her something to eat, she wants me to come talk to her while she&#39;s on the toilet, she wants to know exactly how far away her birthday is, and so on...  I feel like I sit down, then I jump up, then I sit down, then I jump up, or I&#39;m the evil mom saying &quot;make yourself a sandwich or heat up something&quot;, or &quot;it&#39;s my turn for the computer&quot;, or &quot;bathroom time should be private time/PUHLEASE just do your thing and get it over&quot; etc...  How do you do it?  I do as much school/email stuff as possible while I&#39;m at lunch or on break at work.  I am away from the house for 10 hours a day for work/travel time.  When I get home, I must make dinner.  Sometimes that&#39;s something simple like sandwiches.  Otherwise, it takes time to prepare.  Eating out is not financially feasible on a daily or even weekly basis.  Additionally, since I do work I do need to do laundry sometimes, and because I don&#39;t like<br/>\nmaggots I clean the plates and take out garbage.  I don&#39;t always wash the dishes, but if I don&#39;t do it right away then it&#39;s twice as long next time.  I try to use paper as much as possible but that feels like throwing away money.  Also, since i&#39;m so tight on time I dont&#39; shop that often and run out sometimes - or plain forget to get new when I do go shopping.  How do you do it?<br/>\n<br/>\n            <br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail is new and improved - Check it out!<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n            <br/>\n---------------------------------<br/>\nALL-NEW Yahoo! Messenger - all new features - even more fun!  <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\n ALL-NEW Yahoo! Messenger - all new features - even more fun!  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":182360290,"authorName":"SHYRLEY WILLIAMS","from":"=?iso-8859-1?q?SHYRLEY=20WILLIAMS?= &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how do you get stuff done?","postDate":"1094630195","msgId":99310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwOTA4MDc1NjM1LjI2MTcucW1haWxAd2ViODYyMTEubWFpbC51a2wueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQwOTA4MDMxNzA3LjIwNy5xbWFpbEB3ZWIyMDcwNS5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":99304,"nextInTopic":99312,"prevInTime":99309,"nextInTime":99311,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":" Borrow 3 or 4 more kids of various ages for a month. Then go back to having one. You will be amazed at how much time you","messageBody":"<div id=\"ygrps-yiv-196623802\">&lt;warning, tongue in cheek alert...&gt;<br/>\nBorrow 3 or 4 more kids of various ages for a month. Then go back to having one. You will be amazed at how much time you have ;-)<br/>\n <br/>\n&lt;tongue back out of cheek&gt;<br/>\n <br/>\nI include my in activitues like doing the dishes or cleaning. They either help or find something to do instantly. At 8 I would say your daughter was old enough to understand about &#39;me&#39; time. If she&#39;s bugging you all the time its possible that you are giving her part-time harried attention all the time. Sit down with her and explain you&#39;ll do something for an hour where she has your whole attention then you want to do some chores. She can either help or read or something. Then more &#39;her&#39; time. Then &#39;you&#39; time. Because she would have had some undivided attention then she will feel more content and less bugging.<br/>\nIt takes a while to change this but I do it with 4 kids. They all get undivided attention to do something special for them (sort off, as I have to hold the baby all day) but it does stop that all day fight for attention cos they know that they &#39;special&#39; project will get done without siblings joining in.<br/>\nAnyway, thats what worked for me. There are still days when I&#39;m washing the dishes at 11pm and gritting my teeth or I forget to put he garbage out and it only gets collected once a fortnight or we&#39;re at the hospital all day with the baby so everybody is whining and competeing for mummy-time.<br/>\nBut on the whole the children &#39;join in&#39; We talk when we walk to the shops -an every day chore. Or we chat on the bus on the way to the hospital - also every day at the moment. They also enjoy playing Runescape online so will play for hours which is a great time for me to get the chores done and have a cup of tea.<br/>\n <br/>\nShyrley<br/>\n<br/>\nAli Kat &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sweetgypsiedncer@...\">sweetgypsiedncer@...</a>&gt; wrote:<br/>\n<br/>\nI have tried to let go of the whole bedtime thing.  DD (8) tends to go to bed now after I have.  I have traditionally used the evening time to get done all the mundane but important things that I try to avoid when I&#39;m with dd so that I can focus my attention and time on her.  i.e. refilling Rx, sending out bill payments, writing letters/emails, organizing paperwork and medical stuff, etc...  I also use the time for school work (i&#39;m taking online courses).  I know I can drop these.  Other than the fact that when done with school I can earn more money (which is attractive because I am a single mom), I realize it&#39;s not an ultimate priority.  At the same time, it takes about 1 hour a night that I would otherwise devote to television or reading for pleasure.  <br/>\n<br/>\nAnyway, I find my daughter tends to &quot;bug&quot; me 50 times over.  She wants the computer, she wants me to make her something to eat, she wants me to come talk to her while she&#39;s on the toilet, she wants to know exactly how far away her birthday is, and so on...  I feel like I sit down, then I jump up, then I sit down, then I jump up, or I&#39;m the evil mom saying &quot;make yourself a sandwich or heat up something&quot;, or &quot;it&#39;s my turn for the computer&quot;, or &quot;bathroom time should be private time/PUHLEASE just do your thing and get it over&quot; etc...  How do you do it?  I do as much school/email stuff as possible while I&#39;m at lunch or on break at work.  I am away from the house for 10 hours a day for work/travel time.  When I get home, I must make dinner.  Sometimes that&#39;s something simple like sandwiches.  Otherwise, it takes time to prepare.  Eating out is not financially feasible on a daily or even weekly basis.  Additionally, since I do work I do need to do laundry sometimes, and because I don&#39;t like<br/>\nmaggots I clean the plates and take out garbage.  I don&#39;t always wash the dishes, but if I don&#39;t do it right away then it&#39;s twice as long next time.  I try to use paper as much as possible but that feels like throwing away money.  Also, since i&#39;m so tight on time I dont&#39; shop that often and run out sometimes - or plain forget to get new when I do go shopping.  How do you do it?<br/>\n<br/>\n            <br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail is new and improved - Check it out!<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\n ALL-NEW Yahoo! Messenger - all new features - even more fun!  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] how do you get stuff done?","postDate":"1094624078","msgId":99304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDQwOTA4MDMxNzA3LjIwNy5xbWFpbEB3ZWIyMDcwNS5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":99300,"nextInTopic":99310,"prevInTime":99303,"nextInTime":99305,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1229828445\">&lt;&lt;&lt;Anyway, I find my daughter tends to &quot;bug&quot; me 50 times over.  She wants<br/>\nthe computer, she wants me to make her something to eat, she wants me to<br/>\ncome talk to her while she&#39;s on the toilet, she wants to know exactly how<br/>\nfar away her birthday is, and so on...  I feel like I sit down, then I jump<br/>\nup, then I sit down, then I jump up, or I&#39;m the evil mom saying &quot;make<br/>\nyourself a sandwich or heat up something&quot;, or &quot;it&#39;s my turn for the<br/>\ncomputer&quot;, or &quot;bathroom time should be private time/PUHLEASE just do your<br/>\nthing and get it over&quot; etc.. How do you do it?  I do as much school/email<br/>\nstuff as possible while I&#39;m at lunch or on break at work. I am away from the<br/>\nhouse for 10 hours a day for work/travel time. &gt;&gt;&gt;<br/>\n<br/>\nWell here&#39;s your answer as to why your dd is bugging you so much. She is<br/>\ntrying to cram the same hours of your attention [that those of us who don&#39;t<br/>\nneed to do outside work are so fortunately able to give to our kids all day]<br/>\ninto the few short hours between this other stuff you are doing and your<br/>\nneed to get to bed. I don&#39;t pretend to have a solution, but it sure is<br/>\nunderstandable seen in that light.<br/>\n<br/>\nJayn(4.75) will say anything, and do any kind of disruptive or annoying<br/>\nbehavior directed at her Dad, to get his attention when he has been at work<br/>\nall the long filmmakers&#39; day - a fairly new phenomenon for her to deal with,<br/>\nas he is just recently off disability. He was baffled. It was obvious to me.<br/>\nThey got together and talked it over, and he made a commitment to her that<br/>\nthey would spend time playing together when he got home, instead of him<br/>\nimmediately getting onto his computer, or phoning his producer buddy to talk<br/>\nthe day over at length. <br/>\n<br/>\nHe has also agreed to make us the priority on the weekend for as long as<br/>\nthis show lasts, instead of helping his buddies do some other thing as had<br/>\nbeen his habit while not working during the week. Having Jayn as a priority<br/>\nin his head doesn&#39;t mean as much to her as him taking action to make her his<br/>\npriority.<br/>\n<br/>\n&lt;&lt;&lt; When I get home, I must make dinner.  Sometimes that&#39;s something simple<br/>\nlike sandwiches.  Otherwise, it takes time to prepare.  Eating out is not<br/>\nfinancially feasible on a daily or even weekly basis.  Additionally, since I<br/>\ndo work I do need to do laundry sometimes, and because I don&#39;t like<br/>\n maggots I clean the plates and take out garbage.  I don&#39;t always wash the<br/>\ndishes, but if I don&#39;t do it right away then it&#39;s twice as long next time.<br/>\nI try to use paper as much as possible but that feels like throwing away<br/>\nmoney.  Also, since i&#39;m so tight on time I dont&#39; shop that often and run out<br/>\nsometimes - or plain forget to get new when I do go shopping.  How do you do<br/>\nit?&gt;&gt;&gt;<br/>\n<br/>\nI have some practical ideas, that may be useful or not to you. I won&#39;t be<br/>\noffended if you reject all of them. However the spiritual advice I have is<br/>\nto return your daughter to the forefront of your priorities in the brief<br/>\ntime you have to spend with her in the evenings.<br/>\n<br/>\nFlylady has a whole focus on working mothers - slightly different routines<br/>\netc. <br/>\n<br/>\nFill the sink with hot, sudsy water before you start to cook dinner.<br/>\nEverything goes into it at once. Washing up is faster.<br/>\n<br/>\nPut the garbage bag by your front door night before, and carry it down with<br/>\nyou in the morning. A smaller bin is actually easier to empty more often<br/>\nthan a larger one.<br/>\n<br/>\nI clean only one wall of the shower recess at a time when I take a shower -<br/>\nunless Jayn gets to it first in a cleaning game.<br/>\n<br/>\nDo you have an internet grocer that will make deliveries in your area? This<br/>\nwas the most fantastic saving of my time and energy while pregnant - then<br/>\nthat particular service collapsed unfortunately. It did not cost<br/>\nsignificantly more, especially once you factor in gas.<br/>\n<br/>\nSomeone once posted a website that was about daily menus and shopping lists<br/>\nfor them - it removed the how to decide/dither factor from preparing meals. <br/>\n<br/>\nI buy paper goods in bulk from a warehouse store - one of Jayn&#39;s favorite<br/>\noutings.<br/>\n<br/>\nI&#39;m often tired and lazy-feeling at night. If I prepare the dinner in the<br/>\nmorning when I have energy - like put the veges into the steamer basket in<br/>\nthe fridge, fill the pot with water as needed, and rub the chicken with<br/>\nspices - or even just plan it onto paper (ie the menu) - I get a much better<br/>\nmeal made in the evening.<br/>\n<br/>\nWhen you can afford it, I urge you to get a second computer, especially a<br/>\nlaptop. You may then be able to take some of your work or reading to where<br/>\nyour dd is, and you remove the competition for the use of the computer.<br/>\nNothing like sitting side by side playing computer games together.<br/>\n<br/>\nAh the laundry. What I have to do is have a laundry day - or I am washing<br/>\nall week long. The only reason that is a problem is because I have to haul<br/>\nthe stuff downstairs to the apartment complex laundry room, pay a heap of<br/>\nquarters, and share the time with the other tenants. Sometimes we go to the<br/>\nlocal Laundromat for a change - Jayn enjoys going to get a donut at the same<br/>\ntime. If I had a washer/dryer combo in my apartment (my big wish for my<br/>\nfuture house) I would do one small load a day. In your case (assuming you<br/>\nhave this in your apt) I would suggest turning on the dryer last thing<br/>\nbefore you head out the door, having as much non-iron knitwear as possible,<br/>\nand hanging blouses to dry to reduce ironing. One day your dd will surprise<br/>\nyou by folding the laundry for you. Eventually she will be doing her own<br/>\nlaundry.<br/>\n<br/>\nGood luck finding a balance.<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.752 / Virus Database: 503 - Release Date: 9/3/2004</div>","specialLinks":[]},{"userId":184936771,"authorName":"Ali Kat","from":"Ali Kat &lt;sweetgypsiedncer@...&gt;","profile":"sweetgypsiedncer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"how do you get stuff done?","postDate":"1094613427","msgId":99300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwOTA4MDMxNzA3LjIwNy5xbWFpbEB3ZWIyMDcwNS5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEwOTQ1ODk5OTMuMjQ3OC4xMjIubTIxQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":99304,"prevInTime":99299,"nextInTime":99301,"topicId":99300,"numMessagesInTopic":0,"msgSnippet":"I have tried to let go of the whole bedtime thing.  DD (8) tends to go to bed now after I have.  I have traditionally used the evening time to get done all the","messageBody":"<div id=\"ygrps-yiv-1646337034\">I have tried to let go of the whole bedtime thing.  DD (8) tends to go to bed now after I have.  I have traditionally used the evening time to get done all the mundane but important things that I try to avoid when I&#39;m with dd so that I can focus my attention and time on her.  i.e. refilling Rx, sending out bill payments, writing letters/emails, organizing paperwork and medical stuff, etc...  I also use the time for school work (i&#39;m taking online courses).  I know I can drop these.  Other than the fact that when done with school I can earn more money (which is attractive because I am a single mom), I realize it&#39;s not an ultimate priority.  At the same time, it takes about 1 hour a night that I would otherwise devote to television or reading for pleasure.  <br/>\n<br/>\nAnyway, I find my daughter tends to &quot;bug&quot; me 50 times over.  She wants the computer, she wants me to make her something to eat, she wants me to come talk to her while she&#39;s on the toilet, she wants to know exactly how far away her birthday is, and so on...  I feel like I sit down, then I jump up, then I sit down, then I jump up, or I&#39;m the evil mom saying &quot;make yourself a sandwich or heat up something&quot;, or &quot;it&#39;s my turn for the computer&quot;, or &quot;bathroom time should be private time/PUHLEASE just do your thing and get it over&quot; etc...  How do you do it?  I do as much school/email stuff as possible while I&#39;m at lunch or on break at work.  I am away from the house for 10 hours a day for work/travel time.  When I get home, I must make dinner.  Sometimes that&#39;s something simple like sandwiches.  Otherwise, it takes time to prepare.  Eating out is not financially feasible on a daily or even weekly basis.  Additionally, since I do work I do need to do laundry sometimes, and because I don&#39;t like<br/>\n maggots I clean the plates and take out garbage.  I don&#39;t always wash the dishes, but if I don&#39;t do it right away then it&#39;s twice as long next time.  I try to use paper as much as possible but that feels like throwing away money.  Also, since i&#39;m so tight on time I dont&#39; shop that often and run out sometimes - or plain forget to get new when I do go shopping.  How do you do it?<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail is new and improved - Check it out!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":99211,"nextTopicId":99328}}