{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":396473338,"authorName":"ellinghamsandwich","from":"&quot;ellinghamsandwich&quot; &lt;ellinghamsandwich@...&gt;","profile":"ellinghamsandwich","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping friends","postDate":"1250057098","msgId":46693,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1dG0yYStzcjZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc4NzIxRDQ0LTc3MjMtNDU1Ri1CNTFCLUU0NjBGNUMyODdCM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46680,"nextInTopic":0,"prevInTime":46692,"nextInTime":46694,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"true & i have considered my daughter s feelings, don t get me wrong. i doubt that D or her grandma wants to apologize. but maybe so... i will ask my daughter","messageBody":"<div id=\"ygrps-yiv-2029847826\">true & i have considered my daughter&#39;s feelings, don&#39;t get me wrong. i doubt that D or her grandma wants to apologize. but maybe so... i will ask my daughter if she wishes to get together w/ D & go from there...you are right about my withholding...it doesn&#39;t feel natural for me as i&#39;m not that way. thanks for reminding me of my truth.<br/>\nlis<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-i think i will just keep moving forward and avoid this family. i  <br/>\n&gt; feel used...maybe H wasn&#39;t available so they decided to call upon D&#39;s  <br/>\n&gt; &#39;ol best friend M for some playtime. well screw that.-=-<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; But what about your daughter&#39;s feelings?<br/>\n&gt; Maybe the little girl wants to apologize.<br/>\n&gt; <br/>\n&gt; How would you feel if you knew your mom had withheld an invitation, or  <br/>\n&gt; a message or a letter from you at any point in your life?<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping friends","postDate":"1250037874","msgId":46680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMDkwODExMTc0NHAyM2ExMTIxN25kMjk3OTAxZWJlNTMxNWMwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDEyRThGMTQwLTlGQjAtNEJFOC05OTM5LUM0QUNFODRCQTM3NUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGg1c2IxditkM25pQGVHcm91cHMuY29tPgkgPDEyRThGMTQwLTlGQjAtNEJFOC05OTM5LUM0QUNFODRCQTM3NUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46675,"nextInTopic":46693,"prevInTime":46679,"nextInTime":46681,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"... life. ... I know you put naughty in quotations because you don t believe it.  But it sounds as if Emma s family values and your family s world don t","messageBody":"<div id=\"ygrps-yiv-741699486\"><blockquote><span title=\"ireply\">&gt;&gt;Emma&#39;s friends look at me as a way to get all the &quot;naughty&quot; things in<br/>\n </span></blockquote>life.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Maybe that leads to being the person they come to later?<br/>\n<br/>\n </span></blockquote>I know you put &quot;naughty&quot; in quotations because you don&#39;t believe it.  But it<br/>\nsounds as if Emma&#39;s family values and your family&#39;s world don&#39;t quite mesh.<br/>\nI have a similar experience with my son&#39;s friend.<br/>\n<br/>\nRecently we went to our cottage with a friend of my son&#39;s in tow.  I have<br/>\nstruggled with their friendship.  This kid is &quot;Eddie Haskell&quot; from *Leave it<br/>\nto Beaver*.  Polite to your face but scheming.<br/>\n<br/>\n&quot;Eddie&quot; was very upset my son chose to go to bed at 9pm because he knows at<br/>\nhome Rowan stays up late.  But at the cottage Rowan enjoys swimming in<br/>\ndaylight, and being outdoors.  Nights are buggy so he would rather not be<br/>\noutside.<br/>\n<br/>\nRowan has no need for unlimited Wii time--he always self regulates.  This<br/>\nled to &quot;Eddie&quot; whining:  name calling after Rowan decided to read his<br/>\nSherlock Holmes book.  &quot;Eddie&quot; then encouraged Crispin(aged six) to sing a<br/>\nChipmunks song which Rowan found annoying.<br/>\n<br/>\nI could see Rowan moving away.  &quot;Eddie&quot; grinned, and whispered to Crispin.<br/>\nCrispin found the attention alluring and continued the song--following Rowan<br/>\naround, with &quot;Eddie&quot; at a &quot;discreet distance&quot;.  Before I pounced on the<br/>\nsituation it turned ugly though and Rowan started screaming at Crispin to<br/>\n&quot;shut up&quot;.<br/>\n<br/>\n                                               For years I did not leave my<br/>\nguys alone with Eddie for a moment. I confronted Eddie, who insisted he was<br/>\ntrying to stop Crispin, though moments later Eddie was softly humming the<br/>\ntune when he thought I was in another room and giggling.  I asked him to be<br/>\nrespectful of Rowan and let him read. He feigned innocence but when I become<br/>\n&quot;authority&quot; he obeys and he left the room promptly.<br/>\n<br/>\nWhenever my son Rowan, Eddie and another child played in the past it<br/>\ninevitably ended with the third child in tears.  Always, after Eddie spoke<br/>\nin whispers. Many parents told me they were perplexed by their child&#39;s<br/>\ninsistence Eddie upset them, but could not explain how.<br/>\n<br/>\n                                                                     But as<br/>\nthey got older things changed.  One occasion when the kids were about aged<br/>\nten at a park Eddie, two girls, a boy and Rowan were playing tag.  Eddie was<br/>\naccused of cheating.  He asked Rowan it stand up for him repeatedly, until<br/>\nfeeling pressed Rowan said, &quot;Eddie we all know you cheat but we like you<br/>\nanyway.&quot;  Eddie left the game and stopped speaking to the group for a week.<br/>\nThis was the first time my son had not lapsed into silence or diplomacy when<br/>\nasked to for an opinion by Eddie during a dispute.  We discussed these<br/>\nsituations over the years, but Rowan didn&#39;t want his friend to be<br/>\nembarrassed so he chose not to comment.<br/>\n<br/>\nAs the kids grew older power balances changed; though for years Eddie seemed<br/>\nto manipulate social situations to his advantage.  All Rowan&#39;s other friend<br/>\nhad at one time left a playground in tears telling baffled parents &quot;Eddie&quot;<br/>\nwas the cause but unable to explain why.  We don&#39;t see this child for weeks<br/>\nat a time, though he lives two doors away.  He gets into a cycle where he<br/>\nchooses to do things like lie or manipulate, when in fact honestly stating<br/>\nhis desire would go much further.  My son will not speak to him when this<br/>\nhappens, until Eddie comes by, and his behavior changes for a while.<br/>\n<br/>\nI should add that at various times Eddie&#39;s folks have tried to get my<br/>\nhusband to lie to Eddie when it was inconvenient for him to go to the<br/>\nplayground with us or come to our house, saving them the bother of being<br/>\ntruthful or saying &quot;no&quot;.  We don&#39;t have a friendship, but are on civil<br/>\nterms.<br/>\n<br/>\nOnce Eddie&#39;s mother came to our house complaining that Eddie had cried for<br/>\nan hour after visiting our home because my son had a gameboy. She wanted us<br/>\nto restrict Eddie&#39;s media time and to have the boys play physical outdoor<br/>\ngames only.   She told us that if his whining continued she would stop the<br/>\nfriendship.  They had been friends for five years at this point.  This<br/>\nbaffled dh to no end.  He continues to feel sorry for Eddie, who he says is<br/>\nsuffering from &quot;creche mentality&quot;, having been in daycare since infancy and<br/>\nhaving parents who are very controlling and manipulative.<br/>\n<br/>\nI find I always have to stay on top of &quot;Eddie&#39;s&quot; behavior, but if I call him<br/>\non it and give him a graceful way out he will be quite nice.  It is hard<br/>\nwork however, that I do for my son.  Generally &quot;Eddie&quot; is very nice<br/>\nto Rowan.  In fact Eddie really lights up when Rowan pays attention to him.<br/>\nDH thinks it is a shame that Eddie can&#39;t understand Rowan will be his friend<br/>\nand he doesn&#39;t have to keep his attention focused on him constantly to<br/>\nmaintain that friendship because the behavior Eddie engages in to keep Rowan<br/>\nfocused on him is damaging to their friendship and causes Rowan to retreat.<br/>\n<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n-- <br/>\nRent our cottage:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://davehoward.ca/cottage/\">http://davehoward.ca/cottage/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping friends","postDate":"1250018246","msgId":46675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyRThGMTQwLTlGQjAtNEJFOC05OTM5LUM0QUNFODRCQTM3NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg1c2IxditkM25pQGVHcm91cHMuY29tPg==","referencesHeader":"PGg1c2IxditkM25pQGVHcm91cHMuY29tPg=="},"prevInTopic":46674,"nextInTopic":46680,"prevInTime":46674,"nextInTime":46676,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"-=-Kids that know you are nice and talk sweet and nice will listen if you suddenly talk in great seriousness with a hint of threat. Not that I like to threaten","messageBody":"<div id=\"ygrps-yiv-902571345\">-=-Kids that know you are nice and talk sweet and nice will<br/>\nlisten if you suddenly talk in great seriousness with a hint of threat.<br/>\nNot that I like to threaten kids at all, but sometimes with other<br/>\npeople&#39;s kids I do exactly that, not mean, but simple statement of<br/>\nfacts.-=-<br/>\n<br/>\nMe too.  But if someone is being hateful to my child, or trying to  <br/>\npersuade my child to do something dangerous or sneaky, I have no  <br/>\nhesitation in being threatening.  The threat was usually more like &quot;If  <br/>\nyou want to stay here, stop.&quot;<br/>\n<br/>\nI&#39;ve also used wide eyed humor sometimes and said &quot;If you guys want to  <br/>\nbe sneaky and play with matches, could you go and do it at Logan&#39;s  <br/>\nhouse instead?&quot;  or &quot;If you can&#39;t be quieter (video gamers at 2:00  <br/>\na.m.), could I take you over to Brett&#39;s house to finish the game?&quot;   <br/>\nThose comments were practically hilarious, because they KNEW if they  <br/>\nwere at the other houses they&#39;d&#39;ve been doing nothing fun at all,  <br/>\nwould be subject to 93 rules and limits.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping friends","postDate":"1250013997","msgId":46674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1c2J2ZCtmY2U3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1czJtNCs4dHU2QGVHcm91cHMuY29tPg=="},"prevInTopic":46673,"nextInTopic":46675,"prevInTime":46673,"nextInTime":46675,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"... would like to play with my daughter today. wtf!? yeah. RIGHT, i m thinking. NOT! so i didn t call her back. i debated running it by my daughter but then","messageBody":"<div id=\"ygrps-yiv-1380891663\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; yesterday i get a call in my voicemail from D&#39;s mother saying D<br/>\n </span></blockquote>would like to play with my daughter today. wtf!? yeah. RIGHT, i&#39;m<br/>\nthinking. NOT! so i didn&#39;t call her back. i debated running it by my<br/>\ndaughter but then decided it would only hurt her by hearing my feelings<br/>\non the whole situation and/or that it would encourage her to rekindle<br/>\nthis relationship with this girl. another reason of mine that i wish to<br/>\njust let sleeping dogs lie and MOVE ON. &gt;&gt;&gt;<br/>\n<br/>\nSometimes it&#39;s really not helpful at all to get reactionary like this<br/>\nabout peripheral friendships.  Perhaps they were out of town or very<br/>\nbusy.  If your dd really does want to see this other child, even for<br/>\nclosure, it might be a good idea.  It might not be hurtful at all, or it<br/>\ncould be, but you won&#39;t know unless you give your dd the choice.  The<br/>\nlast feelings she had about this kid were painful, but still in the<br/>\ncategory of wanting friendship.  Maybe you could go to a movie and the<br/>\npark for a few hours on one day and have a reason to go home and not<br/>\nhave a huge extended playtime.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping friends","postDate":"1250013055","msgId":46673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1c2IxditkM25pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1cWxvditrNTdrQGVHcm91cHMuY29tPg=="},"prevInTopic":46672,"nextInTopic":46674,"prevInTime":46672,"nextInTime":46674,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"... comfortable being the person in charge with this girl. She does not believe she needs to listen to any one. Also, she is very controlled and I won t do","messageBody":"<div id=\"ygrps-yiv-1509425930\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; This would be ideal! I might give it a try. I&#39;m not totally<br/>\n </span></blockquote>comfortable being the person in charge with this girl. She does not<br/>\nbelieve she needs to listen to any one. Also, she is very controlled and<br/>\nI won&#39;t do that. On the one hand I would like to give her some relief<br/>\nfrom that - then there are two other hands - it would make her Mom mad<br/>\nand we wouldn&#39;t be able to take her with us, and it seems like most of<br/>\nEmma&#39;s friends look at me as a way to get all the &quot;naughty&quot; things in<br/>\nlife. Maybe that leads to being the person they come to later? &gt;&gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I can ask my kids politely not to do things, but sometimes with other<br/>\nkids that are used to being controlled, I have to be very blunt, as in,<br/>\n&quot;stop it right now&quot;, and, &quot;perhaps I need to call your mom and ask her<br/>\nwhat she thinks about what&#39;s happening right now&quot;, or, &quot;if you behave<br/>\nlike this, I will need to send you home because I will not tolerate it<br/>\nin my house&quot;.  Kids that know you are nice and talk sweet and nice will<br/>\nlisten if you suddenly talk in great seriousness with a hint of threat. <br/>\nNot that I like to threaten kids at all, but sometimes with other<br/>\npeople&#39;s kids I do exactly that, not mean, but simple statement of<br/>\nfacts.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping friends","postDate":"1250012439","msgId":46672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1c2FlbiszOGZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1b2VmbStmc3V2QGVHcm91cHMuY29tPg=="},"prevInTopic":46671,"nextInTopic":46673,"prevInTime":46671,"nextInTime":46673,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"... When Chamille was little like your dd, she made all kinds of friends and led all the play.  Most of the kids ended up at our house.  Mostly these were","messageBody":"<div id=\"ygrps-yiv-1341281049\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I need some help.  My daughter has a friend she likes a lot.  I have tried to be friends with the family, but I would rather not hang out with them.  I do not like how they talk to each other or other people.  They come across as mean, controlling and like bullies.  They are a Mom, Dad, and daughter.  <br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>When Chamille was little like your dd, she made all kinds of friends and led all the play.  Most of the kids ended up at our house.  Mostly these were neighbor kids.  Since she led the play and the activities, things went in the general direction of the positive for her.<br/>\n<br/>\nMargaux is a whole different person.  For starters, she doesn&#39;t seem to be the kind of person that can rally a whole crew of kids together and get them all playing peacefully.  She has had a few friends here and there in the neighborhood that have been, in my opinion, really terrible friends, but people that she considers friends.  She has a small handful of unschooling friends that all require effort on my part to meet up with, and we do when we can.<br/>\n<br/>\nIf your daughter likes this kid and there aren&#39;t any better options at the moment, then I&#39;d invite the kid over for play at your house and at parks and such.  The other parents don&#39;t need to be involved.  Each individual person, including a 6 yr old, will figure out how to negotiate other people, even kids that can be mean.  What I&#39;ve found is that kids sometimes don&#39;t see the meanness quite as glaring as we do, they see the positive aspects of the friendship and take the bad with the good for as long as the good outweighs the bad.<br/>\n<br/>\nI&#39;ve seen both my girls dump friendships where the bad parts started outweighing the good parts.  It doesn&#39;t make it any easier to deal with mean people, just awareness and help from mindful parents. <br/>\n<br/>\nAs kids get older, you&#39;ll likely find that more often than not, you won&#39;t have relationships with the parents of your kid&#39;s friends.  I wish it always worked out that the people that I find as amazing parents and friends had kids that my kids also found amazing friendships with, but that isn&#39;t always how it works.  It&#39;s great when it does happen, so don&#39;t stop seeking that out!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping friends","postDate":"1250005801","msgId":46671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4NzIxRDQ0LTc3MjMtNDU1Ri1CNTFCLUU0NjBGNUMyODdCM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg1czJtNCs4dHU2QGVHcm91cHMuY29tPg==","referencesHeader":"PGg1czJtNCs4dHU2QGVHcm91cHMuY29tPg=="},"prevInTopic":46670,"nextInTopic":46672,"prevInTime":46670,"nextInTime":46672,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"-=-i think i will just keep moving forward and avoid this family. i feel used...maybe H wasn t available so they decided to call upon D s ol best friend M for","messageBody":"<div id=\"ygrps-yiv-1218607415\">-=-i think i will just keep moving forward and avoid this family. i  <br/>\nfeel used...maybe H wasn&#39;t available so they decided to call upon D&#39;s  <br/>\n&#39;ol best friend M for some playtime. well screw that.-=-<br/>\n<br/>\n<br/>\nBut what about your daughter&#39;s feelings?<br/>\nMaybe the little girl wants to apologize.<br/>\n<br/>\nHow would you feel if you knew your mom had withheld an invitation, or  <br/>\na message or a letter from you at any point in your life?<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":396473338,"authorName":"ellinghamsandwich","from":"&quot;ellinghamsandwich&quot; &lt;ellinghamsandwich@...&gt;","profile":"ellinghamsandwich","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping friends","postDate":"1250004484","msgId":46670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1czJtNCs4dHU2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1b2VmbStmc3V2QGVHcm91cHMuY29tPg=="},"prevInTopic":46667,"nextInTopic":46671,"prevInTime":46669,"nextInTime":46671,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"hi amy, hi all, i have been lurking here for months. i had to respond to this one. i am going thru a similar dilemma myself in regards to my daughter M s (she","messageBody":"<div id=\"ygrps-yiv-249873126\">hi amy, hi all, <br/>\ni have been lurking here for months. i had to respond to this one. i am going thru a similar dilemma myself in regards to my daughter M&#39;s (she will be 7 in november)friend, D, from her old schooled days at the local waldorf school. <br/>\n<br/>\nthe girls were in mixed age kindergarden together last year. D lives with her mother & grandmother (who is very controlling and i can tell she does not care for my daughter&#39;s presence should the girls start bickering-which they do a LOT of). <br/>\n<br/>\nin the last few weeks of school a new girl joined in. D befriended her & she & H were inseparable. quite sad for me to witness for my daughter. what was once a best friendship between them (not really THE best but to THEM it was because they chose one another...)became displaced & my daughter was pretty much dissed once school ended for the summer. D&#39;s grandmother called us about a week after asking if they can come to our community pool here where we live. sure, i said. the girls played & apparently my daughter avoided D & played more w/ other kids. i wasn&#39;t there so i&#39;m not sure exactly what went down. since then, we have not heard a PEEP all summer long. its been over 2 months.<br/>\n<br/>\nyesterday i get a call in my voicemail from D&#39;s mother saying D would like to play with my daughter today. wtf!? yeah. RIGHT, i&#39;m thinking. NOT! so i didn&#39;t call her back. i debated running it by my daughter but then decided it would only hurt her by hearing my feelings on the whole situation and/or that it would encourage her to rekindle this relationship with this girl. another reason of mine that i wish to just let sleeping dogs lie and MOVE ON. this family is a part of the waldorf community. if the girl dosen&#39;t go there, she&#39;d be in public schools. i don&#39;t really care to be associated with this school my daughter went to  anymore. i fear it may tempt her to go back because of these &#39;friendships&#39; which truly are not true. plus, D is quite the martyr in that she is very passive & acts like SHE is always the victim. she&#39;s a tattler. its so annoying. poor D...M is so mean. M is so rude. M has no manners. well one can be quietly mean, rude & hurtful just the same.<br/>\n<br/>\nmy daughter doesn&#39;t pussyfoot or beat around any bushes. she is straight forward and very different from this girl who i see as quite manipulative and annoying. her grandma&#39;s energy is ick. she won&#39;t connect w/ me via body language or with her eyes (well i guess that falls into the body language category) & i just don&#39;t care for her much. i&#39;ve tried. she is an ex-school teacher who taught in a one room schoolhouse. she&#39;s an artist yet very set in her ways as far as learning goes for kids.<br/>\n<br/>\nso. i can really relate with you on this. i think i will just keep moving forward and avoid this family. i feel used...maybe H wasn&#39;t available so they decided to call upon D&#39;s &#39;ol best friend M for some playtime. well screw that.<br/>\nlove,<br/>\nlis in oregon<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Amy&quot; &lt;amylizkid1@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I need some help.  My daughter has a friend she likes a lot.  I have tried to be friends with the family, but I would rather not hang out with them.  I do not like how they talk to each other or other people.  They come across as mean, controlling and like bullies.  They are a Mom, Dad, and daughter.  <br/>\n&gt;  <br/>\n&gt; I want my daughter to have the friends she wants, but it&#39;s getting foggy about what&#39;s fair and reasonable.  What I want to say to Emma (who is 6) is that we can meet her friend at places (like the park or a play or whatever), stay as long as we can, but not go over to their house, and not have them over.  <br/>\n&gt;  <br/>\n&gt; It seems like this would work for me, it is reasonable to me.  But I know she won&#39;t love the idea.  I don&#39;t know if it&#39;s reasonable for her.  <br/>\n&gt;  <br/>\n&gt; What I&#39;d really like to say to her is that I don&#39;t want that kind of negativity in my life and I would rather not see any of them again.  <br/>\n&gt;  <br/>\n&gt; Having the friend over doesn&#39;t seem like it would work.  There are a lot of rules involved with her and not following them would end the playdates rather quickly.  <br/>\n&gt; <br/>\n&gt; I&#39;m sure this type of situation has come up before, but I can&#39;t seem to find any of those threads.  <br/>\n&gt; <br/>\n&gt; Any thoughts or links?<br/>\n&gt; <br/>\n&gt; Thank you.<br/>\n&gt; <br/>\n&gt; Amy K.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping friends","postDate":"1250001175","msgId":46667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGOTU1N0JBLUUyMjgtNENBOS05REIwLTg5MDY5MzZFRjg1MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg1cm5mdCtpOXRsQGVHcm91cHMuY29tPg==","referencesHeader":"PGg1cm5mdCtpOXRsQGVHcm91cHMuY29tPg=="},"prevInTopic":46665,"nextInTopic":46670,"prevInTime":46666,"nextInTime":46668,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"-=If it s going to be short-term, or we won t see each other regularly, then I ve learned to assert my boundaries (shorter than they would be with my own kids)","messageBody":"<div id=\"ygrps-yiv-1290952080\">-=If it&#39;s going to be short-term, or we won&#39;t see each other  <br/>\nregularly, then I&#39;ve learned to assert my boundaries (shorter than  <br/>\nthey would be with my own kids) early on, and clearly. It goes against  <br/>\nhow I want to parent, but I&#39;m only parent to my own kids.-=-<br/>\n<br/>\nWhen I was a teacher, my classes tended toward being loud and rowdy.   <br/>\nSome kids appreciated it.  Some took advantage of it to act like  <br/>\ndoofuses (doofi?  Frank or some other Latin grammarian?)  Some would  <br/>\ncome and ask me PLEASE to get those other kids to keep it down, so  <br/>\nthey could think.<br/>\n<br/>\nWith a drum party or a funeral or a dinner party or a hike, someone  <br/>\nshould be in charge, or no one is in charge.  If no one is the host,  <br/>\nthe sponsor, the responsible leader-with-a-vision, the activity is  <br/>\nlikely to be crap for at least some of the participants.  If someone  <br/>\nIS the host/sponsor/leader and has a great vision and some people  <br/>\nstill aren&#39;t having fun, then those bummed out folk can go and do  <br/>\nsomething better, if they have the capability to do so.  (From years  <br/>\nof SCA activity, I know for sure that there are many people who will  <br/>\nbitch and moan about anything and everything, but can&#39;t even invite  <br/>\npeople over to their house without running out of toilet paper and  <br/>\nice.  Still, they will harangue the air about how stupid this was, or  <br/>\ndisorganized that was.)<br/>\n<br/>\nWhen I&#39;m doing a talk or have organized a game or am introducing a  <br/>\nfriend to another friend over lunch, I have parameters in mind.  Not a  <br/>\nsmall expectation and a certain script, but a mental picture of what  <br/>\nwill make the activity better or what would ruin it, and I nudge and  <br/>\nherd and adjust to keep things within that range in subtle ways.  Very  <br/>\nrarely do I have to make a big noise, but I totally get this:<br/>\n<br/>\n-=-I learned this the hard way by doing drum circle stuff in schools  <br/>\nand other places. If I went in expecting that the kids would listen  <br/>\nand &quot;behave&quot;, but I didn&#39;t assert myself, I&#39;d get walked over and  <br/>\nbasically ignored until I would do something really LOUD to get their  <br/>\nattention. -=-<br/>\n<br/>\nAnd the more interested and considerate the audience or guests are,  <br/>\nthe more carefully chosen, the less likely I&#39;ll need to say &quot;HEY, get  <br/>\nback to the topic,&quot; or &quot;Don&#39;t bend the cards,&quot; or &quot;Could someone see  <br/>\nif those babies are okay?<br/>\n<br/>\nThe less considerate, the more controlled at home, the less free and  <br/>\nthoughtful, the more likely will be random hooting noise and vandalism  <br/>\nand disruption.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping friends","postDate":"1249993021","msgId":46664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1cm5mdCtpOXRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1cWxvditrNTdrQGVHcm91cHMuY29tPg=="},"prevInTopic":46660,"nextInTopic":46665,"prevInTime":46663,"nextInTime":46665,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"-=-I m not totally comfortable being the person in charge with this girl.  She does not believe she needs to listen to any one. Also, she is very controlled","messageBody":"<div id=\"ygrps-yiv-1896261384\">-=-I&#39;m not totally comfortable being the person in charge with this girl.  She does not believe she needs to listen to any one. Also, she is very controlled and I won&#39;t do that.  On the one hand I would like to give her some relief from that - then there are two other hands - it would make her Mom mad and we wouldn&#39;t be able to take her with us, and it seems like most of Emma&#39;s friends look at me as a way to get all the &quot;naughty&quot; things in life.-=-<br/>\n<br/>\nKids who are super-controlled are MUCH more likely to &quot;act out&quot; when given a little freedom - make poor choices, go way way out to try to find exactly where the boundary is, go a little wild.<br/>\n<br/>\nIf I know we&#39;ll be seeing each other regularly for a period of time, then I know we can work through all of that, peaceably.<br/>\n<br/>\nIf it&#39;s going to be short-term, or we won&#39;t see each other regularly, then I&#39;ve learned to assert my boundaries (shorter than they would be with my own kids) early on, and clearly. It goes against how I want to parent, but I&#39;m only parent to my own kids.<br/>\n<br/>\nI learned this the hard way by doing drum circle stuff in schools and other places. If I went in expecting that the kids would listen and &quot;behave&quot;, but I didn&#39;t assert myself, I&#39;d get walked over and basically ignored until I would do something really LOUD to get their attention. I&#39;ve learned to go in, state the boundaries and consequences VERY clearly, and follow through. It felt mean at first, but I think it&#39;s scary for kids who are regularly controlled and punished to suddenly be wholly in charge of themselves.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping friends","postDate":"1249990611","msgId":46665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1cmw0aitkODliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1cXZoNCsyZThtQGVHcm91cHMuY29tPg=="},"prevInTopic":46664,"nextInTopic":46667,"prevInTime":46664,"nextInTime":46666,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"... You could have Emma focus on the hosting part and less on the food part.  Could Emma understand that since her friend cannot eat certain foods or types of","messageBody":"<div id=\"ygrps-yiv-1598568958\"><blockquote><span title=\"ireply\">&gt; I guess I&#39;m always thinking how sweet it is that she likes to be a<br/>\n&gt; good host.  She doesn&#39;t even care about most of the food we buy, she<br/>\n&gt; just likes to have on hand what she knows her friends like.<br/>\n<br/>\n </span></blockquote>You could have Emma focus on the hosting part and less on the food part.  Could Emma understand that since her friend cannot eat certain foods or types of foods, that she can still plan a fun visit?  Maybe she can use a fun tablecloth and fun dishes to serve food when it&#39;s time to eat.  I&#39;m not sure what foods this child is allowed to have, but maybe you and Emma could find a way to present it differently.  For example, if she is allowed to have a peanut butter sandwich, cut them into fun shapes.  A fancy way of serving could be laying food on a fun napkin on top of a plate.  She can also decorate with little things on the table.  When my daughter was about that age, she would make craft type things all the time.  We had signs with labels, place cards for the table, homemade pictures on the wall, napkin holders for paper towels.  She was quite creative.  I kept a box full of lots of arts and crafts materials for her to use.  :)<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping friends","postDate":"1249987030","msgId":46660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0MkM2QTBELTVFNjktNDc1MC1BMzY0LTFGNUVEQzJGODMzNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg1cXZoNCsyZThtQGVHcm91cHMuY29tPg==","referencesHeader":"PGg1cXZoNCsyZThtQGVHcm91cHMuY29tPg=="},"prevInTopic":46659,"nextInTopic":46664,"prevInTime":46659,"nextInTime":46661,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"-=-I said something similar to the above, but it always feels like I m going from nice person to bully in seconds flat. I think the trick is to say it, mean,","messageBody":"<div id=\"ygrps-yiv-1768504689\">-=-I said something similar to the above, but it always feels like I&#39;m  <br/>\ngoing from nice person to bully in seconds flat. I think the trick is  <br/>\nto say it, mean, and let it go.-=-<br/>\n<br/>\nBut it&#39;s not about being a different person, unless you&#39;re faking the  <br/>\nniceness.<br/>\n<br/>\nHere&#39;s a perfect example of why it&#39;s crucial to live by principles  <br/>\ninstead of by rules.  If you have a rule that you will be nice to  <br/>\nguests, that can be inviting a snake into the next.  Even baby snakes  <br/>\ncan be poison.<br/>\n<br/>\nIf you live by the principle that your house will be thoughtful and  <br/>\npeaceful, then you can defend that peace and that principle in all  <br/>\nkinds of situations without having specific rules to cover them.<br/>\n<br/>\nYou can tell her without any bullying whatsoever that if she adds to  <br/>\nthe peace of your house, she&#39;s welcome to be there, but you wouldn&#39;t  <br/>\nlet strangers come in and yell and demand, and you won&#39;t let friends  <br/>\ndo it either.<br/>\n<br/>\n-=-I never think I&#39;m setting anyone up for a go-crazy day, but I might  <br/>\nbe. Have to watch that. With this friend, I am probably less worried  <br/>\nabout that happening than I am about her bullying me-=-<br/>\n<br/>\nThink about peace and cooperation and joy, and that should prevent  <br/>\nbullying.  If you set the day up in ways that it&#39;s clear to the girls  <br/>\nwhat fun  thing you&#39;ve planned and when and where the food will be and  <br/>\nwhat their many options are, that&#39;s better than &quot;anything on earth  <br/>\nthat will make you happy, you can have.&quot;  That&#39;s beyond your power.   <br/>\nIt it were also beyond your principles, you&#39;d be closer to balance.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\n-=- I do have a hot temper, which I used to believe was just part of  <br/>\nmy personality. I have learned that I really can change parts of me  <br/>\nthat I am not happy with.-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\n-=Anyway, I think I will offer to take Emma and her friend somewhere  <br/>\nand see how it goes. I&#39;ll just play out the possibilities in my head  <br/>\nfor a day before I do. (If she says this, I&#39;ll do this. If she does  <br/>\nthat, I&#39;ll do ____.) -=-<br/>\n<br/>\nYou could tell her you will take her if she will help make the day  <br/>\npeaceful and happy.  You could say &quot;Do you have a more peaceful way to  <br/>\nsay that?&quot; if she seems bullying, or some very-short reminder of your  <br/>\ndeal.  Or you could not respond directly to whiney begging, but say  <br/>\n&quot;Let&#39;s go to the slides!&quot; and head there happily yourself.  Emotions  <br/>\ncan be contagious, moreso for some people than others I think, but if  <br/>\nyou be the way you want her to be, it will be easier for her to move  <br/>\ntoward that than if you seriously discuss happiness instead of being  <br/>\nhappy.<br/>\n<br/>\nStill, if she crosses the line three or four times, it might be time  <br/>\nto cut the day short, or to go back to the house and watch a quietish  <br/>\nvideo, or to put some loud music on and dance--something that switches  <br/>\nfrom conversation or acquisition mode to focus on something non-verbal  <br/>\nand that isn&#39;t &quot;to keep&quot; anyway--like a movie, or dancing.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211875477,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amylizkid1@...&gt;","profile":"amylizkid1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping friends","postDate":"1249968484","msgId":46659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1cXZoNCsyZThtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENFODFBQzRBLUY5MTQtNDcxOC04NThELUJGQ0E5QzgyODYwNkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46658,"nextInTopic":46660,"prevInTime":46658,"nextInTime":46660,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"... Yes, actually the thought of buying her the toy never occured to me until I was writing about the incident and felt sorry for her.  That tantruming and","messageBody":"<div id=\"ygrps-yiv-1477622953\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=- Poor kid, maybe I should have bought her the toy. -=-<br/>\n&gt; <br/>\n&gt; I don&#39;t think so.  I think I would have gotten her attention eye to  <br/>\n&gt; eye and say if she wanted to stay at your house she needed to stop  <br/>\n&gt; begging, and ask if she&#39;d rather get a ride home or stop begging and  <br/>\n&gt; stay.<br/>\n<br/>\n </span></blockquote>Yes, actually the thought of buying her the toy never occured to me until I was writing about the incident and felt sorry for her.  That tantruming and begging really irritates me.  I said something similar to the above, but it always feels like I&#39;m going from nice person to bully in seconds flat.  I think the trick is to say it, mean, and let it go.  It&#39;s been slow learning to not say things like that in anger (and hold on to the anger), but rather as a matter of fact and then move on.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; About the food restrictions, you could plan food to take that wouldn&#39;t  <br/>\n&gt; break the rules and would still be plentiful.  If your daughter can&#39;t  <br/>\n&gt; go a few hours with pre-planned food limited by the amount you have on  <br/>\n&gt; hand, then she might not be old enough to help you with this situation.<br/>\n<br/>\n </span></blockquote>That&#39;s a good way to look at it.  Emma would be fine with it.  I guess I&#39;m always thinking how sweet it is that she likes to be a good host.  She doesn&#39;t even care about most of the food we buy, she just likes to have on hand what she knows her friends like.  <br/>\nThis is great, because there is more to being a good host than having all the yummiest things - like if we had a friend with allergies, we wouldn&#39;t put those foods out.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Unschooling doesn&#39;t require you to be bullied by other people&#39;s kids  <br/>\n&gt; (nor by your own).  There&#39;s  no advantage to you, your family or the  <br/>\n&gt; other child or her family for you to give her a go-crazy day.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Yes, okay, thanks for that. I never think I&#39;m setting anyone up for a go-crazy day, but I might be.  Have to watch that.  With this friend, I am probably less worried about that happening than I am about her bullying me.  I do have a hot temper, which I used to believe was just part of my personality.  I have learned that I really can change parts of me that I am not happy with.  However, I can still get pretty bitchy when I&#39;m on the defensive.  <br/>\n<br/>\nAnyway, I think I will offer to take Emma and her friend somewhere and see how it goes.  I&#39;ll just play out the possibilities in my head for a day before I do.  (If she says this, I&#39;ll do this.  If she does that, I&#39;ll do ____.) <br/>\n<br/>\nAmy K</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping friends","postDate":"1249964525","msgId":46658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENFODFBQzRBLUY5MTQtNDcxOC04NThELUJGQ0E5QzgyODYwNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg1cWxvditrNTdrQGVHcm91cHMuY29tPg==","referencesHeader":"PGg1cWxvditrNTdrQGVHcm91cHMuY29tPg=="},"prevInTopic":46656,"nextInTopic":46659,"prevInTime":46657,"nextInTime":46659,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"-=- Poor kid, maybe I should have bought her the toy. -=- I don t think so.  I think I would have gotten her attention eye to eye and say if she wanted to stay","messageBody":"<div id=\"ygrps-yiv-2147081574\">-=- Poor kid, maybe I should have bought her the toy. -=-<br/>\n<br/>\nI don&#39;t think so.  I think I would have gotten her attention eye to  <br/>\neye and say if she wanted to stay at your house she needed to stop  <br/>\nbegging, and ask if she&#39;d rather get a ride home or stop begging and  <br/>\nstay.<br/>\n<br/>\nAbout the food restrictions, you could plan food to take that wouldn&#39;t  <br/>\nbreak the rules and would still be plentiful.  If your daughter can&#39;t  <br/>\ngo a few hours with pre-planned food limited by the amount you have on  <br/>\nhand, then she might not be old enough to help you with this situation.<br/>\n<br/>\nUnschooling doesn&#39;t require you to be bullied by other people&#39;s kids  <br/>\n(nor by your own).  There&#39;s  no advantage to you, your family or the  <br/>\nother child or her family for you to give her a go-crazy day.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211875477,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amylizkid1@...&gt;","profile":"amylizkid1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping friends","postDate":"1249958495","msgId":46656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1cWxvditrNTdrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdFRUM4MkQzLUU2MTktNEZDNC1BNURBLTEyQkM0REJEOURGOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46648,"nextInTopic":46658,"prevInTime":46655,"nextInTime":46657,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"-=- Sometimes moms need to say no.-=- But I just got good at saying yes!    Seriously though, it might be one of those times. -=- The other family seems","messageBody":"<div id=\"ygrps-yiv-1845260737\">-=- Sometimes moms need to say no.-=-<br/>\n<br/>\nBut I just got good at saying yes!  &lt;grin&gt;  Seriously though, it might be one of those times.<br/>\n<br/>\n-=- The other family seems already to be saying no.-=-<br/>\n<br/>\nI don&#39;t know.  They like to get together, but the Mom will occasionally talk to me (yell at me) like I&#39;m the stupidest person on earth,  particularly when there&#39;s some kind of misunderstanding.  I don&#39;t want that crap in my life.  <br/>\n<br/>\n-=- Meeting at public places is better than you just cutting off the whole deal right now.-=-<br/>\n<br/>\nI think it&#39;s the best I can do right now.  <br/>\n<br/>\n-=- If that family will let you take the daughter with you to places like movies or the zoo, would that be helpful?  At movies and the zoo  you&#39;re following other people&#39;s rules anyway.-=-<br/>\n<br/>\nThis would be ideal!  I might give it a try.  I&#39;m not totally comfortable being the person in charge with this girl.  She does not believe she needs to listen to any one. Also, she is very controlled and I won&#39;t do that.  On the one hand I would like to give her some relief from that - then there are two other hands - it would make her Mom mad and we wouldn&#39;t be able to take her with us, and it seems like most of Emma&#39;s friends look at me as a way to get all the &quot;naughty&quot; things in life.  Maybe that leads to being the person they come to later? <br/>\n<br/>\nI don&#39;t go out of my way to give them everything they never get, but they know I&#39;m not going to force them to eat &quot;real&quot; food and I&#39;m not going to put weird limits on unreal(?) food. I&#39;m not going to tell them what to do or how to be (as long as they&#39;re not mean).  If we&#39;re having guests Emma likes for us to go to the store and buy all their favorite foods; might be candy, ice-cream, bacon, strawberries.  (I love that!)  It&#39;s great to a point, but last time one of Emma&#39;s other friends stayed with us she had a tantrum because I wouldn&#39;t take her to the store to buy her a toy.  I&#39;d never taken her to the store to buy her a toy before, I think she just thought I was her best bet to get the things she wants.  Poor kid, maybe I should have bought her the toy. That&#39;s not to say that this other friend would do the same.  Oh!  I am afraid of the surprises!  I get it!  Prepare for surprises.  I can do that!<br/>\n<br/>\nI could have erased that thought process, but I get so excited when my brain works!<br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s possible you could make the transition to taking their daughter  <br/>\n&gt; places without any obvious show-down.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>Thank you, yes, talking about it has made me think it could be possible.  <br/>\n<br/>\nAmy K</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping friends","postDate":"1249901235","msgId":46648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdFRUM4MkQzLUU2MTktNEZDNC1BNURBLTEyQkM0REJEOURGOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg1b2VmbStmc3V2QGVHcm91cHMuY29tPg==","referencesHeader":"PGg1b2VmbStmc3V2QGVHcm91cHMuY29tPg=="},"prevInTopic":46647,"nextInTopic":46656,"prevInTime":46647,"nextInTime":46649,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"-=-What I want to say to Emma (who is 6) is that we can meet her friend at places (like the park or a play or whatever), stay as long as we can, but not go","messageBody":"<div id=\"ygrps-yiv-2123093372\">-=-What I want to say to Emma (who is 6) is that we can meet her  <br/>\nfriend at places (like the park or a play or whatever), stay as long  <br/>\nas we can, but not go over to their house, and not have them over.<br/>\n<br/>\nIt seems like this would work for me, it is reasonable to me. But I  <br/>\nknow she won&#39;t love the idea. I don&#39;t know if it&#39;s reasonable for her.<br/>\n<br/>\nWhat I&#39;d really like to say to her is that I don&#39;t want that kind of  <br/>\nnegativity in my life and I would rather not see any of them again. -=-<br/>\n<br/>\n<br/>\nSometimes moms need to say no.<br/>\nThe other family seems already to be saying no.<br/>\nMeeting at public places is better than you just cutting off the whole  <br/>\ndeal right now.<br/>\n<br/>\nIf that family will let you take the daughter with you to places like  <br/>\nmovies or the zoo, would that be helpful?  At movies and the zoo  <br/>\nyou&#39;re following other people&#39;s rules anyway.<br/>\n<br/>\nWhen Kirby and Marty were little there were a few boys we would take  <br/>\nwith us places like that.  I would assure the parents that it was fine  <br/>\nand was more fun for my boys to have another friend, that they got  <br/>\nalong better when there were three than two.  It was true.  And some  <br/>\nof the families did reciprocate, but I didn&#39;t want or need them to,  <br/>\nand some of them couldn&#39;t or didn&#39;t have a many-kid-friendly house.<br/>\n<br/>\nIt&#39;s possible you could make the transition to taking their daughter  <br/>\nplaces without any obvious show-down.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211875477,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amylizkid1@...&gt;","profile":"amylizkid1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"keeping friends","postDate":"1249885494","msgId":46647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1b2VmbStmc3V2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46648,"prevInTime":46646,"nextInTime":46648,"topicId":46647,"numMessagesInTopic":0,"msgSnippet":"I need some help.  My daughter has a friend she likes a lot.  I have tried to be friends with the family, but I would rather not hang out with them.  I do not","messageBody":"<div id=\"ygrps-yiv-1159632323\">I need some help.  My daughter has a friend she likes a lot.  I have tried to be friends with the family, but I would rather not hang out with them.  I do not like how they talk to each other or other people.  They come across as mean, controlling and like bullies.  They are a Mom, Dad, and daughter.  <br/>\n <br/>\nI want my daughter to have the friends she wants, but it&#39;s getting foggy about what&#39;s fair and reasonable.  What I want to say to Emma (who is 6) is that we can meet her friend at places (like the park or a play or whatever), stay as long as we can, but not go over to their house, and not have them over.  <br/>\n <br/>\nIt seems like this would work for me, it is reasonable to me.  But I know she won&#39;t love the idea.  I don&#39;t know if it&#39;s reasonable for her.  <br/>\n <br/>\nWhat I&#39;d really like to say to her is that I don&#39;t want that kind of negativity in my life and I would rather not see any of them again.  <br/>\n <br/>\nHaving the friend over doesn&#39;t seem like it would work.  There are a lot of rules involved with her and not following them would end the playdates rather quickly.  <br/>\n<br/>\nI&#39;m sure this type of situation has come up before, but I can&#39;t seem to find any of those threads.  <br/>\n<br/>\nAny thoughts or links?<br/>\n<br/>\nThank you.<br/>\n<br/>\nAmy K.</div>","specialLinks":[]}],"prevTopicId":46685,"nextTopicId":46697}}