{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":234387,"authorName":"Andrea","from":"Andrea &lt;andrea@...&gt;","profile":"runmum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] what is going on .. What works for  you.. what was fun..","postDate":"1056589666","msgId":75553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4xLjUuMS4yMDAzMDYyNTIyMDI1Mi4wMGE4MmVjMEBwb3AxLm5zLnN5bXBhdGljby5jYT4=","inReplyToHeader":"PDRlLjFlNWEwY2RlLjJjMmI1NWM1QGFvbC5jb20+"},"prevInTopic":75525,"nextInTopic":0,"prevInTime":75552,"nextInTime":75554,"topicId":75504,"numMessagesInTopic":0,"msgSnippet":"We used a whole litre (quart) of bubble stuff today. We didn t spill it or make big bubbles, this was a whole litre used up in dip and blow :-) Mostly I blew","messageBody":"<div id=\"ygrps-yiv-1690300226\">We used a whole litre (quart) of bubble stuff today. We didn&#39;t spill it or <br/>\nmake big bubbles, this was a whole litre used up in dip and blow :-) Mostly <br/>\nI blew and the boys chased, then they progressed to trying to bite them. <br/>\nMuch more fun.<br/>\n<br/>\nI think we spent a total of two hours on this throughout the day and all <br/>\nages (4 to 38) had fun. We did lots of other stuff, too, but this was a <br/>\nreally good dampish day for bubbles.<br/>\n<br/>\nDonna Andrea in foggy Nova Scotia</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: what is going on .. Pokemon Foosball","postDate":"1056577435","msgId":75525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJkZDUycitoMHU1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRlLjFlNWEwY2RlLjJjMmI1NWM1QGFvbC5jb20+"},"prevInTopic":75504,"nextInTopic":75553,"prevInTime":75524,"nextInTime":75526,"topicId":75504,"numMessagesInTopic":0,"msgSnippet":"This is what is going on around our place the last few days. we have a handmedown foosball table in the front room, and we are evolving a game using both","messageBody":"<div id=\"ygrps-yiv-599904204\">This is what is going on around our place the last few days.<br/>\n<br/>\nwe have a handmedown foosball table in the front room, and we are <br/>\nevolving a game using both pokemon and foosball elements<br/>\n<br/>\nPokemon Foosball!!!<br/>\n<br/>\nYou play a round of foosball first. Actually, no, you select nine <br/>\ncards first, at total random from an upside down jumble on the table. <br/>\nThen you play a round of foosball. Whoever scores, gets to look at his <br/>\nor her cards and select by sight. The other person must choose a card <br/>\nfrom his hand without looking. Whichever card wins (and I am <br/>\ncompletely reliant upon my kids to know what THAT is! L good thing I <br/>\ntrust them, eh?) that person gets to shoot the ball, while the person <br/>\nwhose card was weaker, has to be still for the value of the card&#39;s <br/>\ndefense number, divided by 10. IOW, if it&#39;s a defense value of 20, the <br/>\n&quot;loser&quot; of the pokemon draw has to hold off for a count of two.<br/>\n<br/>\nAlso, we start the ball on the foosball table by propping the ball <br/>\nbetween the feet of two opposing players who have been turned up, so <br/>\ntheir feet form this little...tripod-ish thing. When you do that, and <br/>\nboth spin the rods simultaneously, the ball goes FLYING! That can be <br/>\npretty funny.<br/>\n<br/>\nBecause the players on one team have yellow in their uniforms, they <br/>\nhave &quot;electricity&quot; powers, and the other team has red, so they have <br/>\n&quot;fire&quot; energy. This helps when a card is drawn that has one of those <br/>\nenergies as a defense, or helps the other side, if that energy is a <br/>\nweakness :)<br/>\n<br/>\nIsn&#39;t this fun? We&#39;re making up some more rules. This is katie&#39;s and <br/>\nmy game. We&#39;re going to play some more tonight. <br/>\n<br/>\nMy achin back.<br/>\n<br/>\nLOL<br/>\n<br/>\nHeidiC</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"what is going on .. What works for you.. what was fun..","postDate":"1056570309","msgId":75504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRlLjFlNWEwY2RlLjJjMmI1NWM1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":75525,"prevInTime":75503,"nextInTime":75505,"topicId":75504,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/25/03 11:43:20 AM, crazymoma67@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-359845389\">In a message dated 6/25/03 11:43:20 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crazymoma67@...\">crazymoma67@...</a> writes:<br/>\n<br/>\n&lt;&lt; If I need to go run an errand and the kid wants to sit home and watch TV <br/>\n<br/>\nor play a game.. I have to insist they turn the TV off and get in the <br/>\n<br/>\ncar.  &gt;&gt;<br/>\n<br/>\nFor most people, I think it depends how old they are, and whether the errand <br/>\nis crucial.<br/>\n<br/>\nIt&#39;s 1:36.<br/>\nI started waking kids up at 11:00 so Kirby could go to work, Holly could go <br/>\nto free lunch, and Marty because he was to go and pick up the video they made <br/>\nof the Junior Police Academy.<br/>\n<br/>\nI needed to send a money order for a Ninja Turtle Sword I&#39;m getting Kirby for <br/>\nhis birthday.  (SECRET!!)  <br/>\n<br/>\nI made pancakes from scratch and all but Holly sat and ate some.  (She was <br/>\nsaving herself for free lunch.)<br/>\n<br/>\nMarty asked me to get him a copy of Attack of the Clones, and so after Kirby <br/>\nwas at work and Holly had gone to the park, Marty went on errands with me.  <br/>\nHastings (got the DVD and a Futurama comic for Holly), grocery store (money <br/>\norder and marinade stuff for a party tomorrow night), talked about Marty signing <br/>\nup for kick boxing or regular boxing or wrestling, and drove by a kick boxing <br/>\nstudio that&#39;s roller-blading distance from our house to check hours and phone <br/>\nnumber.  Went to the  post office.  Passed by the park where Holly was, stopped <br/>\nto see if she wanted a ride, chatted, Marty stayed to eat the free lunch as <br/>\nit was one of his favorites, and hung out with Holly and her friend.<br/>\n<br/>\nWe were rarely far from the house, and Marty was in possession of a new DVD.  <br/>\nI could have dropped him off.  He CHOSE to hang out with me and Holly for an <br/>\nhour and a half.  We were having a really nice time.<br/>\n<br/>\nIf I had very often felt like I had to insist he do what I say on MY schedule <br/>\nwithout regard for his own feelings, I don&#39;t think he would, as a fourteen <br/>\nyear old boy, choose to go on errands with me.  He didn&#39;t really need to be <br/>\nthere to get his video.  I could have and was willing, but he wanted to go.<br/>\n<br/>\nYes, parents DO have the legal right to turn TV shows off partway through, <br/>\nand to tell their kids what to do.  And YES they can be unschooling without it.  <br/>\nBut when people come and say &quot;I want my unschooling to work like yours does,&quot; <br/>\nand they don&#39;t really want to honestly consider WHY it works well when it <br/>\nworks well, it&#39;s frustrating.<br/>\n<br/>\nBack to chocolate chip cookies, my friend Barb LOVES mine and says they&#39;re <br/>\nthe best ever.  When she wanted the recipe and I got to &quot;use real butter&quot; she <br/>\nsaid, &quot;I&#39;m not going to use butter, I&#39;ll use margarine, but go on.&quot;<br/>\n<br/>\nShe can&#39;t make cookies like I make them if she insists on margarine.  They&#39;ll <br/>\nbe cookies, but her request was for me to give her the recipe for the cookies <br/>\nshe had just eaten.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":75377,"nextTopicId":75287}}