{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":135098343,"authorName":"Peggy","from":"Peggy &lt;durrell@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"NEWS - Manga Sales Just Keep Rising","postDate":"1047965004","msgId":13002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNzZBRDRDLjYwNDAyMDRAYWl0YWNjZXNzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13001,"nextInTime":13003,"topicId":13002,"numMessagesInTopic":0,"msgSnippet":"Thought some here might find this interesting. Peggy ++++++++++++++++++++++ ","messageBody":"<div id=\"ygrps-yiv-1567064940\">Thought some here might find this interesting. Peggy<br/>\n<br/>\n<br/>\n++++++++++++++++++++++<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://publishersweekly.reviewsnews.com/index.asp?layout=article&articleid=CA284758&display=breakingNews\">http://publishersweekly.reviewsnews.com/index.asp?layout=article&articleid=CA284758&display=breakingNews</a><br/>\n<br/>\nManga Sales Just Keep Rising by Heidi MacDonald -- 3/17/2003<br/>\nNews &gt;<br/>\n<br/>\nManga publishers scramble to meet a steady rise in demand<br/>\n<br/>\nManga continues to be one of the hottest categories in bookstores, and <br/>\npublishers are responding to the demand with both new product<br/>\nand new marketing tools. Manga, like Japanese anime before it, is <br/>\ngradually evolving from a hard-core cult obsession to the kind of<br/>\nmainstream phenomenon that teens and young adults adopt as their own.<br/>\n<br/>\nThe strength of manga&#39;s appeal becomes apparent when you consider that <br/>\nmost of the top-selling books are printed in the original<br/>\nJapanese right-to-left format. Not only do readers have to relearn how <br/>\nto read comics, they have to relearn how to read a book. But<br/>\nthe audience has not been intimidated, and more publishers are going to <br/>\nwhat is being called the &quot;authentic Japanese&quot; format, which<br/>\nhas been aggressively championed by Tokyopop.<br/>\n<br/>\nDark Horse, a longtime American publisher of manga, has traditionally <br/>\nreversed film in order to offer Western-style left-to-right<br/>\neditions. Dark Horse v-p of sales and marketing Michael Martens confirms <br/>\nthe company&#39;s change to the right-to-left format, although<br/>\nseries already started in the left-to-right format will stay that way.<br/>\n<br/>\nAlthough relatively new, Tokyopop manga titles are dominating the weekly <br/>\nBookscan charts. Steve Kleckner, v-p of sales and marketing<br/>\nat Tokyopop, reports that sales doubled last year, and he expect them to <br/>\ndouble again this year as title output increases from 300<br/>\nto 500. Dark Horse enjoys steady sales from a line of proven classics, <br/>\nsuch as Astro Boy, Akira, Ghost in the Shell and Lone Wolf<br/>\nand Cub, which has over half a million copies of its 20 volumes in print.<br/>\n<br/>\nViz, which pioneered manga in the American market, recently underwent a <br/>\nreorganization after being acquired by Shueisha, publisher<br/>\nof Shonen Jump, the biggest manga magazine in Japan. The American <br/>\nversion of Shonen Jump was launched ambitiously last year, and has<br/>\nsold well on newsstands.<br/>\n<br/>\nViz v-p of marketing Liza Coppola points out that the audience is often <br/>\nhighly educated about products that haven&#39;t even made it to<br/>\nAmerica yet. She noted, &quot;These are fans that know exactly what they <br/>\nwant. As soon as the property is announced, they know when it&#39;s<br/>\ncoming.&quot; Viz&#39;s plan for the coming year include a line of Shonen Jump <br/>\ngraphic novels, spun off from the magazine and featuring such<br/>\nfranchise characters as Yu-Gi-Oh and Dragonball Z. This summer, Viz will <br/>\nlaunch the cult favorite Excel Saga. Overall, Viz is<br/>\nde-emphasizing monthly periodical comics in favor of graphic novels and <br/>\nthe house has reduced the prices on its graphic novels to<br/>\n$7.95, to be more competitive with Tokyopop. (Dark Horse is also <br/>\nbringing down prices, although not much below $13.95.)<br/>\n<br/>\nRaijin launched last year with a weekly comics magazine featuring more <br/>\nboy-oriented fare. While sales to specialty stores for Raijin<br/>\nmagazine remain modest, the revamped graphic novel treatment of Fist of <br/>\nthe Northstar , which is serialized in the magazine, has<br/>\nfound success in bookstores and more graphic novels are planned. Success <br/>\nbreeds imitation. Marvel, Image and DC have also jumped<br/>\ninto the fray with projects ranging from Marvel&#39;s recently announced <br/>\nTsunami line (News, Feb. 3) to DC&#39;s American manga edition of<br/>\nKia Asamiya&#39;s Batman: Child of Dreams.<br/>\n<br/>\nThis year, manga publishers are moving in all sorts of directions. Dark <br/>\nHorse just launched Man-Machine Interface, the eagerly<br/>\nawaited sequel to the bestselling 1995 Ghost in the Shell. DH is <br/>\nintroducing Metropolis, Lost World and Future World by Osamu<br/>\nTezuka, the legendary manga artist known as the &quot;Walt Disney of Japan.&quot; <br/>\nBeyond that, DH has several new licenses about to be signed,<br/>\nmany of them already well known in the United States from either video <br/>\nanime releases or live-action films. DH is also developing<br/>\nmanga versions of American comics, according to Martens.<br/>\n<br/>\nKleckner ascribes the success of Tokyopop&#39;s manga line to strong <br/>\nlicenses, which include top sellers Chobits and Love Hina. &quot;I am<br/>\nstill amazed every week at how well the books are performing across the <br/>\nboard, not just with women but with males as well, and a lot<br/>\nof that is the CLAMP stuff,&quot; he said.<br/>\n<br/>\nCLAMP is a collective of women artists and writers who are responsible <br/>\nfor such hits on both sides of the Pacific as Chobits and<br/>\nCardcaptor Sakura. Later this year, Tokyo Pop will release CLAMP School <br/>\nDetectives, Duklyon: CLAMP School Defenders and The Man of<br/>\nMany Faces, all with various school settings. Tokyopop is also <br/>\npublishing Battle Royale, a Lord of the Flies–like tale about<br/>\nstudents competing to survive on an island; it&#39;s already created a <br/>\nsensation in Japan.<br/>\n<br/>\nTokyopop&#39;s young-reader-friendly Cine-manga line of storyboard-style <br/>\n(books made from images from the animated films) licensed books<br/>\nrecently added Disney&#39;s Kim Possible and Lizzie McGuire, and <br/>\nNickelodeon&#39;s Sponge Bob Square Pants and Jimmy Neutron to the lineup.<br/>\nKim Possible is already doing very well in bookstores, &quot;without any <br/>\ndisplay and without any promotions. It&#39;s just on the shelves,&quot;<br/>\nKleckner points out.<br/>\n<br/>\nThe Cine-manga books are also being launched into Target and Wal-Mart <br/>\n(one manga title, the epic fantasy Rave Master , is also being<br/>\nintroduced into Target); Kleckner views the move as experimental. And <br/>\nTokyopop is looking at other nontraditional outlets, said<br/>\nKleckner, &quot;retail places that never carried books before, but that <br/>\nappeal to young customers, like video game dealers.&quot;<br/>\n<br/>\nAlthough manga is a hot category, it still hasn&#39;t reached mass market <br/>\nnumbers. &quot;We&#39;re not going to scare John Grisham, but the<br/>\nnumbers are really solid,&quot; said one marketing executive. But returns <br/>\ncontinue to be phenomenally low. &quot;Our sell-through has been<br/>\nreally good,&quot; said Martens at Dark Horse. Tokyopop&#39;s returns are about <br/>\n8%, which suggests there may not be enough product on the<br/>\nshelves. &quot;My goal,&quot; said Kleckner, &quot;is double-digits in returns.&quot; &quot;We <br/>\nneed to demystify the category,&quot; said Martens. &quot;It&#39;s a format,<br/>\nnot a genre.&quot;<br/>\n<br/>\nAnd while librarians have been very receptive, Martens noted, he and <br/>\nKleckner emphasized that are still some doubters. &quot;I still run<br/>\ninto a lot of people in the book business who are convinced this is just <br/>\na fad and it&#39;s gong to go away in a year or so. How wrong<br/>\nthey are,&quot; said Kleckner, whose background includes many years in <br/>\nelectronics retail and the video game industry. He points to such<br/>\nkids&#39; properties as Pokémon and Yu-Gi-Oh and noted that when one fad <br/>\nfades, another takes its place. &quot;It&#39;s like video games—do you<br/>\nthink there isn&#39;t going to be a another hot racing game in a year? This <br/>\nis not going away.&quot;</div>","specialLinks":[]}],"prevTopicId":12919,"nextTopicId":13004}}