{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":10309988,"authorName":"Nisha","from":"&quot;Nisha&quot; &lt;nishamartin@...&gt;","profile":"nishamartin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Thank You Notes","postDate":"1104830866","msgId":102252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNyZG5paStzZ25yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdkLjVmZTQ3MjM3LjJmMGIyODIwQGFvbC5jb20+"},"prevInTopic":102232,"nextInTopic":0,"prevInTime":102251,"nextInTime":102253,"topicId":102232,"numMessagesInTopic":0,"msgSnippet":"I usually travel with a little box of blank note cards so I can write out thank you notes if we are staying with people, or I can write someone a short hello","messageBody":"<div id=\"ygrps-yiv-2031828992\">I usually travel with a little box of blank note cards so I can <br/>\nwrite out thank you notes if we are staying with people, or I can <br/>\nwrite someone a short hello while we are traveling. <br/>\nI almost always leave a thank you note tacked up on the fridge or in <br/>\ntheir mail box on the way out. Most people seem to appreciate them.<br/>\n<br/>\nSomething else that is fun to do as a thank you, is to take photos <br/>\nwhile you are staying with someone, and then, when you get home, <br/>\nsend them one or a few in a frame(some frames have multiple slots). <br/>\nI&#39;ve only done that a couple of times, but I got the idea from <br/>\nsomeone doing it for me. I REALLY appreciated it, so did the people <br/>\nI did it for. Especially since I was able to get a couple of shots <br/>\nof the mom with the kids. It seems like it&#39;s usually the moms that <br/>\nare HOLDING the camera, so they don&#39;t get too many photos of <br/>\nthemselves with their kids. :)<br/>\nNisha<br/>\n<br/>\n<br/>\n<br/>\n-- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, kbcdlovejo@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Pam Sorooshian stayed with me a couple of nights after the second <br/>\n </span></blockquote>Live and  <br/>\n<blockquote><span title=\"ireply\"> &gt; Learn Unschooling Conference. She was a delightful guest: easy <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; agreeable----no trouble at all!  After this discussion, wrote me <br/>\n </span></blockquote>this note. <br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Thank You Notes","postDate":"1104793120","msgId":102232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjVmZTQ3MjM3LjJmMGIyODIwQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":102252,"prevInTime":102231,"nextInTime":102233,"topicId":102232,"numMessagesInTopic":0,"msgSnippet":"Pam Sorooshian stayed with me a couple of nights after the second Live and Learn Unschooling Conference. She was a delightful guest: easy and agreeable----no","messageBody":"<div id=\"ygrps-yiv-1661599343\">Pam Sorooshian stayed with me a couple of nights after the second Live and  <br/>\nLearn Unschooling Conference. She was a delightful guest: easy and  <br/>\nagreeable----no trouble at all!  After this discussion, wrote me this note. <br/>\n <br/>\nIt feels a little tacky (to me) to be posting this on a public list, but I  <br/>\nwanted to show how good a note like this can make someone feel. I asked whether <br/>\n I could post it here so that others could see what a nice thank you would <br/>\nlook  like.<br/>\n <br/>\nIt certainly made my day. <br/>\n <br/>\n~Kelly<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I think it depends on the cultural differences too. I&#39;m from the  <br/>\n&gt; South.  It&#39;s<br/>\n&gt; probably a bit more &quot;expected&quot; down  here----we&#39;re kind of old-fashioned<br/>\n&gt; compared to the rest of the country!  &lt;G&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Well - in that case -- I owe you one!<br/>\n<br/>\nKelly you are  the best hostess I&#39;ve ever met - I LOVED staying at your <br/>\nhouse and I REALLy  appreciated you taking me all over the place and <br/>\nletting me learn all about  your absolutely wonderful state. I had a <br/>\nblast and want to go back. A lot.  It was so interesting and new and <br/>\ndifferent and I liked every single thing  about it. I really liked <br/>\nmeeting your family and really LIKED your family a  lot. And thank you <br/>\nso much for introducing me to Christian  and taking  me to his house <br/>\nbecause that was the chance of a LIFETIME and I still think  about it <br/>\nall the time - just found the business card he gave me, in a pocket  of <br/>\nmy suitcase, and I got all happy just thinking about his house and his  <br/>\nwork!  I enjoyed the library and the state museum. I really liked  <br/>\ndriving all over and seeing different neighborhoods and different kinds  <br/>\nof landscape. I had fun sitting in your kitchen playing cards. I had <br/>\nfun  sitting in the other room with Cameron on the computer and me <br/>\nreading a book  and just having a little bit of chat with him. I loved <br/>\ngetting to go to  where he was working. I had fun watching Ben with <br/>\nDuncan and seeing the  shining light in your adorable little and big <br/>\nboys&#39; eyes.<br/>\n<br/>\nOh - did I  mention that I liked the food too? The barbeque at your <br/>\nhouse was especially  awesome.<br/>\n<br/>\nYou have a real knack for making people feel comfortable and at  home <br/>\nand treated like a queen at the same time!!!  And you did all that  <br/>\nAFTER you&#39;d just put on a fabulous conference and you must have been  <br/>\ncompletely exhausted.<br/>\n<br/>\nSo - thank you so much!!!<br/>\n<br/>\nI&#39;m not a  thank you note writer - never have been. If I have to FIND <br/>\ncards and pens  and postage and get it all addressed and mailed - it&#39;ll <br/>\nnever get  done.<br/>\n<br/>\nBut I just thought, maybe I never really told you how much I TRULY  <br/>\nenjoyed myself that week and how much I appreciate it!!<br/>\n<br/>\nCome to  California - let me reciprocate,  okay?<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":102227,"nextTopicId":102262}}