{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Truancy Police in Oklahoma (sorry, it&#39;s long)","postDate":"1084390929","msgId":93946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5OC4yOTc5MDc1ZS4yZGQzZDgxMUBhb2wuY29tPg=="},"prevInTopic":93944,"nextInTopic":0,"prevInTime":93945,"nextInTime":93947,"topicId":93936,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/12/04 1:00:33 PM, hsingntruant@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1779853452\">In a message dated 5/12/04 1:00:33 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hsingntruant@...\">hsingntruant@...</a> writes:<br/>\n<br/>\n&lt;&lt;  The grade listed on the form was completed last year, all four quarters, <br/>\nat a local private school.  The school listed on the form is not the one he <br/>\nwould be attending if he were in school here.  Also, it lists us as truant from <br/>\nthe first of the year until present.  We weren&#39;t even in this town until the <br/>\nend of November.  It doesn&#39;t look like they attempted to verify the <br/>\nunsubstantiated allegations from their unnamed source. &gt;&gt;<br/>\n<br/>\nMaybe put all that in a &quot;To Whom It May Concern&quot; letter and send copies to <br/>\nthe police station, the judge who signed the order, the state education people <br/>\nand your mother.  Save half a dozen other copies.  Put a copy of state law or <br/>\npolicies in with that.   Just a brief report to show them that you know more <br/>\nthan they do and that they&#39;re violating the peace of your homeschooling home.<br/>\n<br/>\n-=-I have offered to show curriculum provided that they tell me what they <br/>\nwant, standards they would use to review, and who would review it.  It appears <br/>\nthey don&#39;t want it.  I also asked for them to let me know what law authorizes <br/>\nthe request of curriculum info.  -=-<br/>\n<br/>\nOklahoma is Bible Belt.  Maybe HSLDA would want to help you.<br/>\nThey&#39;ll feel good if they think they&#39;re helping Baptists secondarily.<br/>\n<br/>\n-=-Also, are there any good websites or books for examples of how to put <br/>\nunschooling into a &quot;school curriculum&quot; format?-=<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum\">http://sandradodd.com/unschoolingcurriculum</a> <br/>\nand there are links at the bottom to other things.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Truancy Police in Oklahoma (sorry, it&#39;s long)","postDate":"1084390481","msgId":93944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5RjE5MkY3LUE0NEItMTFEOC1BQzNGLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDIwMDQwNTEyMDYxNzE4LjY4ODEwLnFtYWlsQHdlYjUwMDAyLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDQwNTEyMDYxNzE4LjY4ODEwLnFtYWlsQHdlYjUwMDAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":93936,"nextInTopic":93946,"prevInTime":93943,"nextInTime":93945,"topicId":93936,"numMessagesInTopic":0,"msgSnippet":"Ann -- I m sending you a Course of Study that is workable for unschoolers - and you can modify that to suit your needs. I ll send that to the list, because I","messageBody":"<div id=\"ygrps-yiv-2144367460\">Ann --<br/>\n<br/>\n  I&#39;m sending you a &quot;Course of Study&quot; that is workable for unschoolers - <br/>\nand you can modify that to suit your needs. I&#39;ll send that to the list, <br/>\nbecause I can&#39;t seem to make the files area of our list work right now <br/>\nand if anybody else wants it, they can use it too. Carol Narigon wrote <br/>\nthe original and I modified it and expanded it with materials from my <br/>\nstate&#39;s &quot;Standards of Learning.&quot;<br/>\n<br/>\nI&#39;ll send that in a separate email, because it is long (apologies to <br/>\nthose on digest).<br/>\n<br/>\nThe inclusive statewide organization in Oklahoma is:<br/>\nHome Educators Resource Organization (HERO) of Oklahoma<br/>\n&lt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.OklahomaHomeschooling.org\">http://www.OklahomaHomeschooling.org</a> &gt;<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hero@...\">hero@...</a><br/>\n<br/>\nI got that information from the National Home Education Network&#39;s <br/>\ndatabase (which is available to all), but if you don&#39;t reach anybody <br/>\nthat way, let me know and I&#39;ll find you somebody else to contact.<br/>\n<br/>\nTypically, in cases like this, things DO go to the district attorney, <br/>\nbecause the school district and local police just want to pass it along <br/>\nand not deal with it themselves. The DA is the one who makes the <br/>\ndetermination if charges should be filed, etc. So it is the DA who <br/>\nneeds to know the law. A letter from an attorney can put a stop to any <br/>\nfurther proceedings very quickly - they don&#39;t want to waste their time <br/>\nprosecuting someone for no good reason. I don&#39;t know any attorneys in <br/>\nOK, but the people in HERO might. Also, there is an organization called <br/>\nNHELD - National Home Education Legal Defense - which says they provide <br/>\n&quot;Legal Assistance by an attorney licensed to practice in your state <br/>\nworking jointly with NHELD licensed attorneys.&quot;<br/>\n<br/>\nNHELD is different than HSLDA, which is a Christian organization made <br/>\nup of homeschooling attorneys. I have to say, you might actually get <br/>\nsome help from HSLDA - they say, these days, that they are willing to <br/>\nhelp unschoolers so that might be worth a try, you don&#39;t have to be a <br/>\nmember to ask for help, anyway. I&#39;d be interested in knowing if they <br/>\nwere willing to help you, as an unschooler.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":185745463,"authorName":"Anne Bryant","from":"Anne Bryant &lt;hsingntruant@...&gt;","profile":"hsingntruant","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Truancy Police in Oklahoma (sorry, it&#39;s long)","postDate":"1084342638","msgId":93936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTEyMDYxNzE4LjY4ODEwLnFtYWlsQHdlYjUwMDAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":93944,"prevInTime":93935,"nextInTime":93937,"topicId":93936,"numMessagesInTopic":0,"msgSnippet":"I need some help with figuring out what to do next.  Any suggestions will be greatly appreciated.  Before I start, let me give you some information on the law","messageBody":"<div id=\"ygrps-yiv-48308686\">I need some help with figuring out what to do next.  Any suggestions will be greatly appreciated.  Before I start, let me give you some information on the law in OK.  There is a constitutional provision for hsing -- compel to attend &quot;...unless other means of education are provided...&quot;  There is also a statute saying the same thing.  In OK certified teachers and state-approved curricula are NOT required.  You&#39;re not required to contact, register with or get approved by the state or local school.  No testing or record keeping requirements.  Nothing, no requirements, except teaching an equal number of days (175) school is in session.<br/>\n <br/>\nMy mother does not like the fact that my son age 14 is homeschooled.  A new wrinkle to her plotting against it is calling the local school and telling them (according to her) that he is not in school, and in her opinion, he is not being homeschooled.  I have no idea, and no way of finding out at this time, what she actually said.<br/>\n <br/>\nAbout 3 weeks ago I woke up when a police officer rang the doorbell at 7am!  He wanted to know what &quot;accredited&quot; curriculum I was using.  He informed me that if I was not using an &quot;accredited&quot; curriculum, I was breaking the law.  I asked him what law required this.  His response, I don&#39;t know, but there is one!  He also demanded to know who &quot;approved&quot; or &quot;authorized&quot; homeschooling for my son.  He said he had to check it out.  I refused to give him information.  I did send him a letter later that morning suggesting he contact the St. Ed. Dept. for homeschooling info.  He never responded.<br/>\n <br/>\nFast forward to yesterday.  I received a truancy notice in the mail.  It quoted a police report which I&#39;m told I can&#39;t get a copy of without a subpeona.  No subpeona without a court case, no court case at this time.  The officer, not the same one as before, told me she wasn&#39;t going to give me any information; furthermore, she wanted no information regarding our hsing from me.  I asked her what law authorized the police or the school to request information from me, she responded Judge X, from the Truancy Court.  She did relent and tell me that someone (my darling Mom) had called in and reported that I was not homeschooling.  She said that was all they needed.  She said the notice would be forwarded to the district attorney in five days if J was not enrolled in XYZ school.<br/>\n <br/>\nThe notice says, &quot;mother states he is homeschooled -- no proof of ciriculum (sic) can be verified.&quot;  (I had refused to give the original officer information, because he was so far off base.)  I even placed a call to the St. Ed. Dept. myself.  They told me that if hsing J receives zero credit for that time should he ever wish to attend a public school, as the state does not regulate curriculum used by homeschoolers.  J has never attended public school -- some private, a hs co-op, and hsing.  <br/>\n <br/>\nThe notice received contained inaccuracies.  I am not sure how critical this is.  The grade listed on the form was completed last year, all four quarters, at a local private school.  The school listed on the form is not the one he would be attending if he were in school here.  Also, it lists us as truant from the first of the year until present.  We weren&#39;t even in this town until the end of November.  It doesn&#39;t look like they attempted to verify the unsubstantiated allegations from their unnamed source.<br/>\n <br/>\nI have offered to show curriculum provided that they tell me what they want, standards they would use to review, and who would review it.  It appears they don&#39;t want it.  I also asked for them to let me know what law authorizes the request of curriculum info.  <br/>\n <br/>\nThe only advice I have received, and this was from a lawyer, was to move -- out of state!  This seems absurd to me considering the law and hsing in OK.  Although if I don&#39;t do this, I may eventually regret it.  <br/>\n <br/>\nAny suggestions would be greatly appreciated.  Also, are there any good websites or books for examples of how to put unschooling into a &quot;school curriculum&quot; format?<br/>\n <br/>\nThanks for any help.<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Movies - Buy advance tickets for &#39;Shrek 2&#39; <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":93945,"nextTopicId":93950}}