{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: can they talk to kids their own age (a rant)","postDate":"1052344815","msgId":68020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5YnZsZis5N2s3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFQjk1RENDLjdEQkQ2NkM4QGVhcnRobGluay5uZXQ+"},"prevInTopic":68019,"nextInTopic":0,"prevInTime":68019,"nextInTime":68021,"topicId":67964,"numMessagesInTopic":0,"msgSnippet":"... who was ... taxidermy on ... Once I bought a cartload of salt because we were attempting to mummify a chicken! lol Sheila","messageBody":"<div id=\"ygrps-yiv-478568385\"><blockquote><span title=\"ireply\">&gt; On one memorable occasion, in college, the person in front of us <br/>\n </span></blockquote>who was<br/>\n<blockquote><span title=\"ireply\"> &gt; buying an entire cartload of salt claimed it was to perform <br/>\n </span></blockquote>taxidermy on<br/>\n<blockquote><span title=\"ireply\"> &gt; a gorilla.  That was startling!<br/>\n&gt; <br/>\n&gt; (Maybe I&#39;m ridiculously gullible.  Any taxidermists on this list?)<br/>\n&gt; <br/>\n&gt; Betsy<br/>\n<br/>\n </span></blockquote>Once I bought a cartload of salt because we were attempting to <br/>\nmummify a chicken! lol <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] can they talk to kids their own age (a rant)","postDate":"1052344626","msgId":68019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZiLjEwN2ExNzMyLjJiZWFkYjMyQGFvbC5jb20+"},"prevInTopic":67990,"nextInTopic":68020,"prevInTime":68018,"nextInTime":68020,"topicId":67964,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/7/03 1:23:53 PM, ecsamhill@earthlink.net writes:  The clerk who was cutting. ","messageBody":"<div id=\"ygrps-yiv-1973531037\">In a message dated 5/7/03 1:23:53 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt; Was she the clerk, or the person behind you in line? &gt;&gt;<br/>\n<br/>\nThe clerk who was cutting.<br/>\n<br/>\nI&#39;ve had some great long conversations with people about costuming and other <br/>\nuses for swimsuit material and corn bags and all kinds of stuff, but her tone <br/>\nof voice and demeanor were more like I was clueless and she was bored with <br/>\nhaving to deal with the clueless cloth-buying public.<br/>\n<br/>\n&lt;&lt;On one memorable occasion, in college, the person in front of us who was<br/>\nbuying an entire cartload of salt claimed it was to perform taxidermy on<br/>\na gorilla.  That was startling!&gt;&gt;<br/>\n<br/>\nMaybe I could adapt that line next time I&#39;m buying a bunch of cloth.  <br/>\n&quot;Do you have salt and a coathanger too?  I&#39;m going to mummify a gorilla.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] can they talk to kids their own age (a rant)","postDate":"1052335563","msgId":67990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFQjk1RENDLjdEQkQ2NkM4QGVhcnRobGluay5uZXQ+","referencesHeader":"PDFkYS45MzRlZTI0LjJiZWE5OGNkQGFvbC5jb20+"},"prevInTopic":67985,"nextInTopic":68019,"prevInTime":67989,"nextInTime":67991,"topicId":67964,"numMessagesInTopic":0,"msgSnippet":"**Maybe, including what are you going to make with that?  that s a lot of cloth which I was asked at the cutting table at the fabric store, and because I","messageBody":"<div id=\"ygrps-yiv-1419266384\">**Maybe, including &quot;what are you going to make <br/>\nwith that?  that&#39;s a lot of cloth&quot; which I was asked at the cutting<br/>\ntable at the fabric store, and because I didn&#39;t like the tone, which<br/>\nimplied I was an idiot to want 12 yards of something, I just looked at<br/>\nthe girl until she looked and then looked away. **<br/>\n<br/>\nWas she the clerk, or the person behind you in line?<br/>\nSometimes standing in line is boring and the chatty among us want to<br/>\ntalk, or (in my case) amuse ourselves by speculating about what the<br/>\nperson in front of us is buying.<br/>\n<br/>\nOn one memorable occasion, in college, the person in front of us who was<br/>\nbuying an entire cartload of salt claimed it was to perform taxidermy on<br/>\na gorilla.  That was startling!<br/>\n<br/>\n(Maybe I&#39;m ridiculously gullible.  Any taxidermists on this list?)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":5047879,"authorName":"Susan Fuerst","from":"&quot;Susan Fuerst&quot; &lt;fuerst@...&gt;","profile":"jsf491","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] can they talk to kids their own age (a rant)","postDate":"1052334608","msgId":67985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDMwMWMzMTRjYyQ0OTViNGNmMCQ2NDAwYThjMEB5b3Vyam9ua3c2OHRseT4=","inReplyToHeader":"PDFkYS45MzRlZTI0LjJiZWE5OGNkQGFvbC5jb20+"},"prevInTopic":67964,"nextInTopic":67990,"prevInTime":67984,"nextInTime":67986,"topicId":67964,"numMessagesInTopic":0,"msgSnippet":"Sometimes it s like being on another plane of existence. Sandra My children are still in the younger category. (Oldest is Katy, 11)  But another plane of","messageBody":"<div id=\"ygrps-yiv-2050091680\">Sometimes it&#39;s like being on another plane of existence.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\nMy children are still in the younger category. (Oldest is Katy, 11)  But<br/>\n&quot;another plane of existence&quot; is something zI say frequently to describe<br/>\nhow I feel about the way my family lives.  I have to try to remember<br/>\nwhen and find ways to interact with the different planes&quot;...or maybe<br/>\nI&#39;ll just keep being who I am and growing how we are and maybe somebody<br/>\naround here (meaning geographically) will want to join us!<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"can they talk to kids their own age (a rant)","postDate":"1052327629","msgId":67964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYS45MzRlZTI0LjJiZWE5OGNkQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":67985,"prevInTime":67963,"nextInTime":67965,"topicId":67964,"numMessagesInTopic":0,"msgSnippet":"Oooooooh.... Cold, but not even a stretch. ","messageBody":"<div id=\"ygrps-yiv-437413422\">Oooooooh....   <br/>\nCold, but not even a stretch.<br/>\n<br/>\n&lt;&lt; The other has three girls, all in public school.   When she would start<br/>\nwith the &quot;aren&#39;t you afraid he won&#39;t know how to talk to kids his own<br/>\nage&quot;  stuff I would say, in a most sympathetic and concerned way, that<br/>\nI&#39;d just seen where two kids killed a classmate and a teacher was<br/>\narrested for sexual abuse of a student and a school had slime mold<br/>\ncontamination and how about that head lice out break and how sad her<br/>\nmiddle daughter was being teased for being heavy and that must make her<br/>\nfeel sad as a parent, sending her off to school to be tortured and<br/>\nhumiliated everyday... and now I don&#39;t hear so much about what Dylan is<br/>\nmissing in public school.   Now I hear about what a happy kid I have and<br/>\nhow curious he is and how interested he seems in everything. &gt;&gt;<br/>\n<br/>\nI hope her girls are given some slack and freedom to some degree because of <br/>\nDylan&#39;s example.<br/>\n<br/>\nLast night was Holly&#39;s last night at her modelling school.   I went in to <br/>\npick her up after their little party.  I wasn&#39;t sure what room they were in, <br/>\nas it&#39;s a little warren of hallways and rooms, but I heard people saying <br/>\n&quot;Bye, Holly!    Bye, Holly!&quot; and followed their voices. <br/>\n<br/>\nWhen I got in there she was engrossed in a conversation with the teacher and <br/>\nwasn&#39;t even hearing people say bye, so I nudged her and indicated she was <br/>\nignoring people (irritating mom behavior) and she said bye.<br/>\n<br/>\nThe teacher gushed and gushed (as usual, but with more feeling) and I told <br/>\nher Holly would really like to babysit sometime or even just get to hang out <br/>\nwith her kid (who&#39;s just two) and she lit up,  which made Holly feel great, <br/>\nbecause she likes that teacher and loves to be around kids, and she had <br/>\nforgotten to ask for  a babysitting consideration (though she had told me she <br/>\nwas going to).<br/>\n<br/>\nHolly had made little business cards, by hand, on the halves of cardboard <br/>\nbacking that come from vending machine stickers.  She bought more stickers <br/>\njust to get more cardboard.  So she had given out her webpage, e-mail address <br/>\nand phone number to every kid in class, and the teacher.    That was entirely <br/>\nher idea.  And she had taken one of my business cards to give the teacher, <br/>\nwho has expressed an interest in homeschooling, just because of Holly, and <br/>\nbecause of materials I gave them to read when Holly was first there and they <br/>\nsaid and did some things I wasn&#39;t comfortable with, when Holly wasn&#39;t reading <br/>\nwell and didn&#39;t have school experiences the other kids had.<br/>\n<br/>\nShe almost forgot about her cards, she said, but they were doing a game in <br/>\nwhich each kid said something nice about each other kid, and when one boy <br/>\ntold a girl that he liked her because she had given him her phone number and <br/>\nnow he could tell the boys at school that he had a girl&#39;s phone number (!!), <br/>\nHolly said &quot;Oh!  A girl&#39;s phone number?  Here, have mine too&quot; and passed them <br/>\nout all around.<br/>\n<br/>\nBut here&#39;s the bad thing that happened that night.  I heard it from Holly and <br/>\nthe teacher separately so I have a more 3-d picture than Holly has, though <br/>\nHolly experienced it directly.  <br/>\n<br/>\nThe manager of the site (school and agency) saw Holly&#39;s wild sculpted haircut <br/>\n(which now has the front right corner shaved to the skin--Holly&#39;s doing), and <br/>\nwas NOT nice about it.  Asked Holly WHAT she had done to her HAIR and told <br/>\nher that if she wanted them to get her work she couldn&#39;t do things like that <br/>\nto her hair, and to let it grow out.  To the teacher she had said that they <br/>\ncouldn&#39;t place Holly unless she had natural little girl hair, and she needed <br/>\nto get a good haircut, a headshot, and then KEEP her hair that way.<br/>\n<br/>\nI&#39;m not even NEARLY going to tell Holly to keep her hair to suit the cranky <br/>\nmanager of a pissant modelling agency which has more disorganization in one <br/>\nday than Holly sees in a month at home, which did NOT have any interest (as a <br/>\nschool) in bending anything to suit a homeschooler, and blah blah, I&#39;ll quit.<br/>\n<br/>\nHolly wasn&#39;t upset.  She was amused and confident.<br/>\n<br/>\nSo how can someone REALLY think that being in a classroom where there are <br/>\nsmall, lame right answers and where kids aren&#39;t even allowed to &quot;socialize&quot; <br/>\nwith kids one grade up or down from them would have an easier time &quot;talking <br/>\nto kids their own age&quot;?  Those are the only kids they ever GET to talk to, <br/>\nand WHEN they&#39;re allowed to talk, much of what they say isn&#39;t very nice <br/>\nbecause they&#39;re cooped up together agains their will with no escape.<br/>\n<br/>\nMeanwhile Holly and thousands of unschoolers are interacting with people who <br/>\nare younger, and older, who go to school, who don&#39;t, who are clueless and <br/>\nnot, and so talking to kids who happen to be their own age is a snap, AND <br/>\nthey actually have something to talk about besides &quot;what grade are you in?&quot; <br/>\nand &quot;what math are you doing?&quot;<br/>\n<br/>\nShe can stand up to being criticized by a shrill and twitchy talent agent, <br/>\nand come away smiling and shaking her head at how little an adult can really <br/>\nunderstand.<br/>\n<br/>\nMarty stood calmly while a twitchy two-year military vet criticized him for <br/>\nwearing camouflage pants, in a thrift store.  Came away smiling and shaking <br/>\nhis head.<br/>\n<br/>\nThese kids are FINE.  They are more than fine.  They&#39;re real and they&#39;re <br/>\nconfident.  They&#39;re living outside the little box, with its fifteen <br/>\nchit-chatty dialogs (fifteen?  Maybe, including &quot;what are you going to make <br/>\nwith that?  that&#39;s a lot of cloth&quot; which I was asked at the cutting table at <br/>\nthe fabric store, and because I didn&#39;t like the tone, which implied I was an <br/>\nidiot to want 12 yards of something, I just looked at the girl until she <br/>\nlooked and then looked away.  Sometimes I&#39;m glad to tell someone what I&#39;m <br/>\ngoing to make, but I&#39;m not answerable to her.  What I said was &quot;Is there 18 <br/>\nyards?&quot;  (I had asked for all that was left on a sale bolt.)  <br/>\n<br/>\n&quot;No, 12 and a half.&quot;<br/>\n<br/>\n&quot;Well I wish it were 18, but I can use it anyway.&quot;<br/>\n<br/>\nWe&#39;re making tents.  But she was unworthy to know that. &lt;bwg&gt;  She can&#39;t get <br/>\nfrom the box she&#39;s in to where our tents are, or WHY we care how those tents <br/>\nare constructed.  <br/>\n<br/>\nIf Holly had been with me, she would probably have chattered away about <br/>\ncenter-pole tents and Viking tents with two oars and ropes.   And the woman <br/>\nwould have gazed at her as though she were uttering Czechoslovakian recipes, <br/>\nin Czech.<br/>\n<br/>\nSometimes it&#39;s like being on another plane of existence.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":67971,"nextTopicId":67930}}