{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":162668711,"authorName":"kristinmoke","from":"&quot;kristinmoke&quot; &lt;kmoke@...&gt;","profile":"kristinmoke","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Anticipating school questions","postDate":"1201236106","msgId":31876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZuYnBhYStrbXNqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":31875,"nextInTime":31877,"topicId":31876,"numMessagesInTopic":0,"msgSnippet":"A little background: Over a year ago, when we were still waffling about homeschooling and before learning about unschooling, ds (now 4 1/2) attended a semester","messageBody":"<div id=\"ygrps-yiv-851935414\">A little background: Over a year ago, when we were still waffling <br/>\nabout homeschooling and before learning about unschooling, ds (now 4 <br/>\n1/2) attended a semester of preschool. As best we could discern, he <br/>\nseemed ok with being taken out- though he didn&#39;t hate school by any <br/>\nstretch and had in fact had just started warming up to the structure <br/>\nof it and participating a lot more when he quit- which I didn&#39;t <br/>\nnecessarily see as a positive thing.<br/>\n<br/>\nWell, several months after stopping he started saying pretty often <br/>\nthat he wanted to go back to his preschool. I muddled through a bunch <br/>\nof excuses and reasons why we couldn&#39;t do that and we eventually <br/>\nsettled on trying a new &quot;school&quot; which was a once a week homeschool <br/>\nco-op where he does a mixed age Spanish class and then <br/>\nplay/craft/game/activity time- all pretty unstructured. This seems to <br/>\nhave satisfied his need and he seems to like the idea of having <br/>\na &quot;school&quot; and a &quot;teacher.&quot; Except for the first few weeks with the <br/>\nco-op last fall and very briefly the other day when he saw his old <br/>\nschool backpack, he hasn&#39;t mentioned any desire to go back to the <br/>\npreschool.<br/>\n<br/>\nThe other thing I should add is that ds is very perceptive and seems <br/>\nto strongly sense we do things pretty differently than all of our <br/>\nfamily and most of our friends. He doesn&#39;t take our word for much- <br/>\nhas great curiosity about the things &quot;everyone else&quot; does and seems <br/>\nto almost have a &quot;grass is greener&quot; mentality toward many things. <br/>\n<br/>\nI feel like we&#39;ve made great strides in re-establishing trust after a <br/>\nrocky beginning coming from traditional parenting and in really <br/>\ntrying to help him explore the world and making fun, play and freedom <br/>\nour way of being.<br/>\n<br/>\nIn light of all the above, these are the things I&#39;m trying to work <br/>\nthrough:<br/>\n<br/>\n<br/>\n* Now that he has experienced school in these ways- for better or <br/>\nworse- how to best frame it in an unschooling way? It feels <br/>\ninconsistent when people ask if he&#39;s in school and I say we&#39;re <br/>\nhomeschooling, but then we refer to the co-op as his school. I wish I <br/>\ncould do away with the labels altogether, but I&#39;d settle for <br/>\nsomething uncomplicated that helps him feel most like a &quot;normal&quot; kid.<br/>\n<br/>\n* When/if to bring up the subject of &quot;regular&quot; school- wait for him <br/>\nto bring it up? Continue to treat his coop school as such until he <br/>\nexpresses a need otherwise? It makes me a little sick to my stomach <br/>\nto think about asking him this summer if he wants to go to <br/>\nkindergarten...I feel like I need more time to get better at <br/>\nunschooling and to just plain keep my baby home a little longer.<br/>\n<br/>\n* What to say when the questions about &quot;regular&quot; school come-  How to <br/>\npostively frame my beliefs about school and preference for <br/>\nunschooling in a way most likely to be attractive to my guy? Is is ok <br/>\nto play a little dirty and really drive home all the bad stuff about <br/>\nschool, lol?<br/>\n<br/>\n* My primary purpose and experience with unschooling so far has been <br/>\nto do it for the joy of it...yet I find part of me feeling pressure <br/>\nand a motive to do it and do it really well so that the contrast will <br/>\nbe sharp and real when/if he decides to go to school. Is this a bad <br/>\nthing? <br/>\n<br/>\nMany thanks for your feedback,<br/>\nKristin</div>","specialLinks":[]}],"prevTopicId":31860,"nextTopicId":31792}}