{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"M & J Welch","from":"&quot;M & J Welch&quot; &lt;seamus@...&gt;","replyTo":"LIST","senderId":"m81j0_iEKHkL29D5x3Cm92oGAuBD0H9oBNKwVhBFZLoK5TkjFRRr1sdRQRUtSNgOwdG-RO2k88bTNdlaDg2_JZKcdXSWajFWPH_gFfo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] how we &#39;morphed&#39; to unschooling","postDate":"964097946","msgId":11398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PExQQkJJTURNUEdKQU9MS0JKSUlFSUVCRENCQUEuc2VhbXVzQHBvcnR1cC5jb20+","inReplyToHeader":"PDNmLjdjMjM2ZmQuMjZhODEzZjhAYW9sLmNvbT4="},"prevInTopic":11384,"nextInTopic":0,"prevInTime":11397,"nextInTime":11399,"topicId":11384,"numMessagesInTopic":0,"msgSnippet":"... Especially the reading....Math also stimulates music, logic, science, art and general thought processes...","messageBody":"<div id=\"ygrps-yiv-1310430961\">From Eiraul:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The only basics I want to make certain we cover are reading and math.<br/>\n </span></blockquote>Especially the reading....Math also stimulates music, logic, science, art<br/>\nand general thought processes...&lt;&lt;<br/>\n<br/>\nThis is my whole schtick with my husband.  He gets nervous about our 7 yob<br/>\nnot doing busy work.  He likes to see proof, but just the other day I heard<br/>\nhim talking to his mom (she&#39;s been against us from the start but is too<br/>\npolite to lecture us. She hides her disagreement in the form of questions<br/>\n&quot;So, how&#39;s Seamus doing? What did he do today? Have you started _______(fill<br/>\nin blank)yet?&quot;) My husband told his mom &quot;Oh we&#39;re going to teach him the<br/>\nbasics, and he&#39;ll have the tools he needs to learn independently. Then we&#39;ll<br/>\njust encourage him when he needs it.&quot;. I felt really happy to hear my<br/>\nhusband &quot;preaching&quot; about this. Pretty cool. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;As far as I&#39;m concerned, even more important than these &#39;disciplines&#39; are<br/>\n </span></blockquote>the<br/>\nabilities to be compassionate, polite and considerate to other people while<br/>\nbeing true to his own ideals...&lt;&lt;<br/>\n<br/>\nThis is so true.  Children are being sent to school at younger and younger<br/>\nages, before they even know what family means, before they even know who<br/>\nthey are.  If I could change only one thing about compulsory education, I<br/>\nwould change the age children are required to begin school from 6 or 7 to 12<br/>\nor 13. Then they would have a better chance at figuring out who *they are*<br/>\nbefore the system decides for them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The longer I practice at unschooling, the more excited I become about the<br/>\n </span></blockquote>process!  It truly amazes me the things we discuss and learn when &#39;nothing&#39;<br/>\nis going on.&lt;&lt;<br/>\n<br/>\nAgreed-this is a huge motivator for me. I love that feeling I get when my<br/>\nson, Seamus, and I are talking about a subject (we don&#39;t even discuss-we<br/>\njust gab ;-) and I see that little lightbulb click on over his head-then he<br/>\nstarts yakking nonstop about it and I am quickly overwhelmed. I can<br/>\npractically see the grey matter in his head making new folds-the neuro<br/>\ntransmitters lighting up like holiday lights or the 4th of July.<br/>\n<br/>\nWhen you shared this about your son:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;...we removed him from ps mid-8th grade because he had figured out how to<br/>\n </span></blockquote>be lazy and use the<br/>\nsystem...wait until mom got a failing notice at mid-term, turn in all<br/>\nhomework, getting straight &#39;A&#39;s on everything for 3 weeks and never turn in<br/>\nany work again  would get him a &#39;C&#39; grade.  He was satisfied with that.  It<br/>\nmeant he didn&#39;t have to repeat the class and that&#39;s all he cared about.  He<br/>\nsaw no reason to prove to the teacher that he knew the material nor any<br/>\nreason to wait around for the rest of the class to catch up to information<br/>\nhe<br/>\nhad down already...&lt;&lt;<br/>\n<br/>\n--I knew you have sharp witted and insightful young man on your hands.<br/>\nLearning to consciously &quot;work the system&quot; at this early age is a great<br/>\nindicator of a depth of intelligence and personality.  A lot of folks don&#39;t<br/>\nlearn this useful skill until they are forced to due to misfortune. Don&#39;t<br/>\nworry about encouraging the &quot;beat-the-system&quot; attitude-it&#39;s a necessity of<br/>\nlife to know how to get what you need when you need it.  Having this skill<br/>\nbefore being faced with a crisis is invaluable.<br/>\n<br/>\nThanks for telling us about your experiences-it does really help. My 3 month<br/>\nold is HUNGRY, or I would swap stories right now. What you wrote is very<br/>\nencouraging. Thanks!<br/>\n<br/>\nLee</div>","specialLinks":[]},{"userId":0,"authorName":"braunville@aol.com","from":"braunville@...","replyTo":"LIST","senderId":"o13cjKYARbCjPp9zASwFgXM4tSrWxJfsmREdKlALL7ftFHa1QwRR0sNVBF9V5-OHhfaP3WFKeR1k","spamInfo":{"isSpam":false,"reason":"0"},"subject":"how we &#39;morphed&#39; to unschooling","postDate":"964082168","msgId":11384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNmLjdjMjM2ZmQuMjZhODEzZjhAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":11398,"prevInTime":11383,"nextInTime":11385,"topicId":11384,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/19/2000 4:47:46 PM Pacific Daylight Time, ... Relaxing enough to trust that we will learn enough !  I m figuring out that IT doesn t","messageBody":"<div id=\"ygrps-yiv-2068566175\">In a message dated 7/19/2000 4:47:46 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:seamus@...\">seamus@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;  I&#39;d like to know from people who began as homeschoolers and &quot;morphed&quot; into<br/>\n&gt;  unschoolers: what was the toughest thing about changing?<br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>Relaxing enough to trust that we will learn &#39;enough&#39;!  I&#39;m figuring out that <br/>\n&quot;IT&quot; doesn&#39;t all have to be learned in 8 years or 12 years or 20 years.  <br/>\nWhatever we don&#39;t cover while my children are in my care, they will learn on <br/>\ntheir own in years to come.  I&#39;m still learning about the world around me and <br/>\nhave every reason to expect they will do the same.<br/>\n<br/>\nYou said it yourself...the lessons your son remembers best involve his asking <br/>\nlots of questions and getting lots of answers.  If you didn&#39;t know the <br/>\nanswer, you looked for them together.  Sounds perfect.<br/>\n<br/>\nThe only basics I want to make certain we cover are reading and math.  <br/>\nEspecially the reading.  If he has the ability and desire to read, he can <br/>\nfind a resource and learn about anything that interests him.  I figure if he <br/>\nhas a good foundation in these two areas, he can find out anything else he <br/>\nneeds to learn when he needs it.  <br/>\n<br/>\nMath also stimulates music, logic, science, art and general thought processes <br/>\nin addition to helping him figure out taxes, change at the store, or whatever <br/>\nother math/numbers solutions he&#39;ll need in life.  <br/>\n<br/>\nAs far as I&#39;m concerned, even more important than these &#39;disciplines&#39; are the <br/>\nabilities to be compassionate, polite and considerate to other people while <br/>\nbeing true to his own ideals.  My job is to help him find those ideals and <br/>\nlearn to put them into honest practice in his own life.<br/>\n<br/>\nThe longer I practice at unschooling, the more excited I become about the <br/>\nprocess!  It truly amazes me the things we discuss and learn when &#39;nothing&#39; <br/>\nis going on.<br/>\n<br/>\nBTW, my unschooling experiences started with a stubborn teenager who refused <br/>\nto cooperate with any formal schooling...at home or in a ps setting.  At that <br/>\npoint I figured my choices were to protect our relationship and wait for him <br/>\nto become &#39;human&#39; again, while giving him opportunities to read, read, read <br/>\nand explore areas that interested him, or I could beat the living daylights <br/>\nout of him and &#39;force him to learn&#39;.  Let&#39;s just say it quickly became <br/>\nobvious that &#39;forced learning&#39; was going to get us no where!  (and, just for <br/>\nthe record, I never did get around to the beatings!)  <br/>\n<br/>\nThat started when he would have been in 9th grade (we removed him from ps <br/>\nmid-8th grade because he had figured out how to be lazy and use the <br/>\nsystem...wait until mom got a failing notice at mid-term, turn in all <br/>\nhomework, getting straight &#39;A&#39;s on everything for 3 weeks and never turn in <br/>\nany work again  would get him a &#39;C&#39; grade.  He was satisfied with that.  It <br/>\nmeant he didn&#39;t have to repeat the class and that&#39;s all he cared about.  He <br/>\nsaw no reason to prove to the teacher that he knew the material nor any <br/>\nreason to wait around for the rest of the class to catch up to information he <br/>\nhad down already.  <br/>\n<br/>\nI did not want to encourage a beat-the-system attitude, so we withdrew him <br/>\nfrom school.  Well, that coupled with the fact that the school district and I <br/>\ndidn&#39;t see eye to eye on appropriate reasons for him to miss school...ie his <br/>\nfather worked out of town all week, home every other weekend and I wanted to <br/>\ntake the children to visit for a 3 day weekend.  The school disapproved and <br/>\nrefused to &#39;allow&#39; the absence which meant automatic failing marks on any <br/>\nmissed work and no opportunity to make it up or do it in advance.  I don&#39;t <br/>\nthink it&#39;s the school principal&#39;s place to decide my family&#39;s lifestyle or <br/>\nwhat the needs of my children are.<br/>\n<br/>\nSo, for several years, he read, asked questions and explored the world while <br/>\nI felt I was neglecting his education but could find no way to convince him <br/>\nthat studying would be a good idea.  We tried to enroll him in the local <br/>\ncommunity college at age 16...he was excited and ready.  But, the cc insisted <br/>\nwe had to have a letter from the school district stating that he was released <br/>\nfrom their education jurisdiction.  The school district refused to do any <br/>\nsuch thing since he had never been under their umbrella.  So, we waited until <br/>\nhe was 18 and he enrolled in community classes, passing all the required <br/>\nentrance/placement exams with no problems.  He took a couple of classes, just <br/>\nfor the heck of it, but still had some authority issues to work out.<br/>\n<br/>\nEventually, (age 19) he decided it was time to get married and he wanted to <br/>\nbe an electrician&#39;s apprentice.  That meant he had to get a GED.  Other than <br/>\nthe college classes where he would not crack a book, but would listen to the <br/>\nlectures, he had done no formal training for several years...5, or so, I <br/>\nthink.  I strongly suggested he study before taking the GED test so he would <br/>\nbe prepared.  Again, he was not interested.  The end result...the stinker <br/>\npassed with flying colors the first try with no advance preparation!<br/>\n<br/>\nThat started me feeling a little more confident that unschooling would work.  <br/>\nso, with our second child (10 years younger), I&#39;ve been much more relaxed and <br/>\nhe finds his way to subjects when he&#39;s ready or has a need.  Some areas it <br/>\nwould seem he is &#39;behind&#39; peers his age.  For instance, today was the first <br/>\nday he felt confident to declare he was going to go ride his 2 wheel bike on <br/>\nhis own...he&#39;s 11 1/2.  Works for me.  He decided he was ready and set about <br/>\nthe struggle to get the job done.  Not at all coordinated about it yet, but <br/>\nvery pleased with himself.  I strongly suspect he&#39;ll be using his bike quite <br/>\na bit in the next few weeks and who knows what will happen from there. <br/>\n<br/>\nOTOH he has an inate ability to figure out math, science and logic without my <br/>\npresenting the information to him in a formal way.  Out of the blue he will <br/>\ntell me he has figured out such and so...After listening to some of his <br/>\ntheories and what led to his conclusions, I may give him the formal name of <br/>\nwhat it is he&#39;s telling me and we talk about it, learning as we go.  It is <br/>\nusually on the algebra, geography, physics or science level.  Sometimes he&#39;s <br/>\non the right track, sometimes not.  But by listening to his theories first, <br/>\nhe&#39;s ready to listen to what I have to say.  When I point out that we are <br/>\ndiscussing subjects that I didn&#39;t learn about until college, he feels quite <br/>\npleased with himself.  It is very stimulating to both of us.<br/>\n<br/>\nAnother big factor to our using an unschooling approach (and another reason <br/>\nfor us to avoid ps) is my health.  I have a rather dibilating case of <br/>\nfibromyalgia.  Many days are pretty bad.  It&#39;s not like I need him to take <br/>\ncare of me, but if I had to stick to a ps schedule and their requirements, it <br/>\nwould be very bad on my health.  I simply do not know from day to day how I <br/>\nwill be feeling.  It is VERY difficult for me to make a commitment to an <br/>\nappointment and be confident I can keep it.  Takes days of advance planning <br/>\nand reserving my energy when I know I have something coming up that I MUST <br/>\ndo.  So, on good days we do things together, on poor days I help him <br/>\nself-direct his energies.  We couldn&#39;t do that with a ps experience.<br/>\n<br/>\nThat&#39;s a bit of my experiences.  Hope it helps a little.  As I see it each <br/>\nfamily has a different path and different things work for them.   There are <br/>\nlots of inspiring stories of families out and about doing things every day or <br/>\nseveral times a week, learning as they go.  I&#39;m jealous of the $$, time and <br/>\nenergy they have to be able to do that.  But, no sense dwelling on what <br/>\nsomeone else is doing.  This is working very well for us.  The hard part can <br/>\nbe trying to explain it to others who are really wary or concerned that I&#39;m <br/>\nneglecting his education.  Especially my SIL who is a city cop AND on the <br/>\nschool board.  Basically I simply tell them we evaluate him on a regular <br/>\nbasis and he is making satisfactory/excellent progress.  That sort of phrase <br/>\nseems to be enough of a techno-phrase to satisfy most people.  (except my <br/>\nmother, but that&#39;s another story!)  <br/>\n<br/>\nHe always has a thick book in his hand and his nose in it; doesn&#39;t sit still <br/>\nand do nothing for any length of time at all.  He may be watching TV or <br/>\nplaying &#39;tendo or &#39;playing&#39; &#39;puter games, or jumping ont he trampoline or <br/>\nwrestling with his dad or cousins, but then there is lots of discussion about <br/>\nwhat has happened.  (he&#39;s very verbal!)  Which leads to more discussion.  <br/>\nHe&#39;s learning to train the dogs, which leads to learning about pack behavior <br/>\nand other animal charactistics which leads to environmental awareness, <br/>\necogoly, weather patterns/systems, astronomy, you name it.  It&#39;s a cycle we <br/>\nsimply cannot avoid.  Good thing, I suppose...BG  <br/>\n<br/>\nOne thing I try to do is keep up with what he is reading.  He reads on a <br/>\ncollege level, which sometimes leaves him interested in books I don&#39;t think <br/>\nhe&#39;s quite ready for.  OTOH sometimes he is reading adult level books I can&#39;t <br/>\ncomprehend and he understands profoundly!  LOL  I learn along the way and it <br/>\nhelps me stay in touch with his interests as well.<br/>\n<br/>\nFWIW,<br/>\nEiraul</div>","specialLinks":[]}],"prevTopicId":11387,"nextTopicId":11401}}