{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":131255249,"authorName":"Cornerstone Community Farm","from":"Cornerstone Community Farm &lt;joyfullife@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Intro HS Dad","postDate":"1093467149","msgId":98874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI1MTU1Mi4yOTUyNS5qb3lmdWxsaWZlQG13dC5uZXQ+","inReplyToHeader":"PDIwMDQwODI1MjAwMi5pN1BLMmRtSjAwMTIxN0B3ZXN0YnlzZXJ2ZXIubXd0Lm5ldD4=","referencesHeader":"PDIwMDQwODI1MjAwMi5pN1BLMmRtSjAwMTIxN0B3ZXN0YnlzZXJ2ZXIubXd0Lm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":98873,"nextInTime":98875,"topicId":98874,"numMessagesInTopic":0,"msgSnippet":"Hi everyone.  I ve been lurking (and occasional writing) on this list quite a while, maybe nearly a year.  Thought it bout time to say hello and a little more","messageBody":"<div id=\"ygrps-yiv-1146521746\">Hi everyone.  I&#39;ve been lurking (and occasional writing) on this list <br/>\nquite a while, maybe nearly a year.  Thought it bout time to say hello <br/>\nand a little more about myself.<br/>\n<br/>\nI&#39;m a single dad, been single 8 1/2 half years.  First heard about <br/>\nhomeschooling in a culture (world view) course at my church.<br/>\nLater took a seminar in 1993 by Professor and author Larry Woiwode. <br/>\n<br/>\nThe past three years I&#39;ve been teaching a seminar on Home schooling at <br/>\nCornerstone Festival of music and art. (Over 300 bands, the likes of <br/>\nPOD, Sixpence none the richer, and Switchfoot became famous thru <br/>\nCornerstone) I teach general HS, but with a strong emphasis on <br/>\nUnschooling.  I go over the various trains of thought within home <br/>\nschooling, and emphasize that all parents must have elements of <br/>\nunschooling in their methodology, or they will fail to teach their <br/>\nchildren to love education...<br/>\n<br/>\nWe just set up a contract to lease/land contract our own land in a <br/>\nrugged hilly portion of SW WI.  We will continue growing organic <br/>\nproduce and organic milk and a few beef steers every year.  We use <br/>\nrotational grazing, a LOW labor/capital input type of farming.  No <br/>\ntractors.  All work by hand or draft horses.<br/>\n<br/>\nWe will next summer set up cabins and tent sites where customers can <br/>\ncome and see how their food is produced (and help for a reduced price <br/>\non food), learn about healthy eating and living in a Biblical <br/>\nworldview.<br/>\n<br/>\nAlice was only a baby then, but I was excited about the prospects of <br/>\nhomeschooling.  I felt right from the start, that education began at <br/>\nbirth.  Alice was played with and read to quite a bit, long before she <br/>\nknew what reading was about.  She pretty much learned to read on her <br/>\nown, reading Chronicles of Narnia on my lap.<br/>\n<br/>\nAlice loved home schooling, and thrived at it.  She pretty much taught <br/>\nherself math with Saxon math, and read extensively, on her own.  Her <br/>\nmom originally agreed to homeschooling, but began to object.  Alice <br/>\ntested (court ordered) well above school kids.  I think the real issue <br/>\nwas not Alice was not thriving, but she missed the tax-free child <br/>\nsupport payments.  Mom earns twice what I do, and I did NOT make her <br/>\npay child support when I had her homeschooling and 90% custody.<br/>\nAnyway, a crooked judged decided that 2 grades ahead of other kids was <br/>\nnot good enough.  I&#39;m appealing now, and should hear back with a few <br/>\nmonths.  <br/>\n<br/>\nOther interests include Linux computer systems (building my own), <br/>\nreading, music, writing, Cornerstone Festival.com, guitar, hiking, <br/>\nhunting, fishing, camping, homemade bread, scratch foods, gardening, <br/>\nhorses, dogs, cats, and just about any other kind of animal.<br/>\n<br/>\nI read with great curiosity the discussions questioning how one could <br/>\nboth unschool and be a Christian.  I was raised in a church, but later <br/>\nbecame a Christian while serving in the military, so I understand the <br/>\nconfusion some may have. <br/>\n<br/>\nFeel free to send any questions about our homeschooling or our farm or <br/>\nworld view.  <br/>\nKeith</div>","specialLinks":[]}],"prevTopicId":98857,"nextTopicId":98782}}