{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"RSYOZ8E05WwavV4x1vb2VVSK3IcJscEaQYmxJVlM0vbJCqMblLimTYMNto2n44z8cPFZFHNwgcUA2olBhMPMBDqyyE9EQ8M","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Another Japanese news story","postDate":"960045356","msgId":8868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNjAzMTUwNy5BQUEyODI3NkBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":8867,"nextInTime":8869,"topicId":8868,"numMessagesInTopic":0,"msgSnippet":"Hi folks -- Not to belabor the point, but here s another story that came out today, indicating where public education in Japan seems to be heading. To help put","messageBody":"<div id=\"ygrps-yiv-1509847581\">Hi folks --<br/>\n<br/>\nNot to belabor the point, but here&#39;s another story that came out today, <br/>\nindicating where public education in Japan seems to be heading.<br/>\n<br/>\nTo help put all this in context, it may help to keep in mind that the <br/>\n&quot;Kimi-ga-yo&quot; national anthem and &quot;Hi-no-maru&quot; national flag in Japan are <br/>\nnot &quot;official&quot; at all, never having been legally sanctioned or voted on <br/>\nby the public. But that hasn&#39;t stopped the Education Ministry from <br/>\nadopting them anyway.<br/>\n<br/>\nAnd of course, for many people both in and outside Japan, these two <br/>\ncontroversial symbols of the anthem and flag (representing the Japanese <br/>\nemperor as a &quot;deity&quot; and Japan as a &quot;divine nation&quot;) still stand today as <br/>\nreminders of past Japanese war atrocities in the Pacific and Far East.<br/>\n<br/>\nMy wife tells me that private schools too in Japan are now feeling the <br/>\npressure to go along with the Education Ministry&#39;s mandate to recognize <br/>\nthe &quot;divine symbols&quot; of the flag and anthem -- including a private <br/>\nChristian school that is not too far from where we live.<br/>\n<br/>\nIf even the private Christian schools in Japan are giving in to the <br/>\nEducation Ministry&#39;s Shinto-based commandments, what&#39;s next?<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n-------------------------------------<br/>\n<br/>\n[Asahi Evening News - 3 June 2000]<br/>\n<br/>\n<br/>\nMOST SCHOOLS SINGING ALONG WITH KIMIGAYO, FLAG<br/>\n<br/>\n*In Tokyo high schools, 99 percent sang the government tune<br/>\nin ceremonies this year, up from only 5.9 percent in 1999.* <br/>\n<br/>\n<br/>\nAsahi Shimbun <br/>\n<br/>\nIn this spring&#39;s school ceremonies, more than 90 percent of public <br/>\nschools around the country led their students in singing Kimigayo, the <br/>\nsong legally designated the national anthem last August, the Education <br/>\nMinistry said Friday. <br/>\n<br/>\nIn the Tokyo and Osaka areas especially, high schools adding the song to <br/>\ntheir ceremonies rose overwhelmingly. <br/>\n<br/>\nThe ministry surveyed boards of education in all prefectures and major <br/>\ncities around the country and found that elementary and junior and senior <br/>\nhigh schools that had not previously included the song in ceremonies did <br/>\nso after the law was passed. <br/>\n<br/>\nAfter the legislation passed, the Education Ministry stepped up pressure <br/>\non schools to include the song and hoist the flag at school ceremonies. <br/>\n<br/>\nOn Friday, the ministry issued a notice to education boards across Japan <br/>\nto ensure that &quot;all schools sing the song and hoist the flag.&quot; <br/>\n<br/>\nThe survey found that most schools routinely hoist the flag at their <br/>\nceremonies. <br/>\n<br/>\nFor instance, 99.6 percent of elementary schools and 99.4 percent of <br/>\njunior high schools and 99.8 percent of senior high schools hoisted the <br/>\nflag at entrance ceremonies in April. Last year&#39;s corresponding <br/>\npercentages for elementary schools and high schools were both 99 percent, <br/>\nwhile the figure for junior high schools stood at 98.6 percent. Similar <br/>\npercentages were reported for graduation ceremonies. <br/>\n<br/>\nMeanwhile, 94.7 percent of elementary schools led their students in <br/>\nsinging Kimigayo at their entrance ceremonies this year, up from 89.2 <br/>\npercent last year. With senior high schools, the percentage was 98.1 <br/>\npercent for this year, up significantly from 85.2 percent last year, the <br/>\nsurvey showed. <br/>\n<br/>\nSimilar percentages were reported concerning graduation ceremonies. <br/>\n<br/>\nIn Tokyo, only 5.9 percent of senior high schools included the song at <br/>\nentrance ceremonies last year, while the percentage rose to 99 percent <br/>\nthis year. In Kanagawa Prefecture, the percentage rose from 26.6 percent <br/>\nlast year to 98.8 percent this year. <br/>\n<br/>\nSenior high schools in Osaka and Kobe did not include the singing of <br/>\nKimigayo in their entrance ceremonies until last year, but all schools in <br/>\nthe two cities sang the song at ceremonies this year, the survey found. <br/>\n<br/>\nIn meetings in September and early this year, the Education Ministry <br/>\ninstructed officials from 13 education boards in regions where schools <br/>\nhave had a low rate of adopting the song to offer what it called <br/>\n&quot;appropriate guidance&quot; on the issue.<br/>\n<br/>\n<br/>\n[copyright 2000 - Asahi Shimbun]</div>","specialLinks":[]}],"prevTopicId":8867,"nextTopicId":8870}}