{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"LASaliger@xxx.xxx","from":"LASaliger@...","replyTo":"LIST","senderId":"iJt6ozFT_h6yc6kASIWlg4GU4VGqh9eMhbVlHIUj_R9V2aULkzUvKLoEVp21qntg2OB3r-he5HQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: Finding Role Models","postDate":"943299360","msgId":4761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTAuNDc2MS45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":4741,"nextInTopic":0,"prevInTime":4760,"nextInTime":4762,"topicId":4741,"numMessagesInTopic":0,"msgSnippet":"Tracy, I ve never read books by Adele Faber or Eileen Mazlish but they sound like something I would like and benefit from.  I understand what you mean when you","messageBody":"<div id=\"ygrps-yiv-1744782008\">Tracy,<br/>\n    I&#39;ve never read books by Adele Faber or Eileen Mazlish but they sound <br/>\nlike something I would like and benefit from.  I understand what you mean <br/>\nwhen you say that they won&#39;t change someone who feels very differently but <br/>\nthey can help a person put into practice the ideals they have.  <br/>\n   Family members and old friends who believe differently and treat our kids <br/>\ndifferently can be trying.  I am always torn between getting involved and <br/>\nlistening quietly while my children handle situations themselves.  My <br/>\ninstinct is to jump in and say something but sometimes I stop myself because <br/>\nmy kids are pretty adept at presenting their sides of things (or at least the <br/>\nolder ones are) and so I think that maybe I&#39;m being overly protective.  But <br/>\nit does make it hard.  If I do say something, even though it is tactful, it <br/>\nseems like there is this awkward tension.<br/>\n   I think being a role model for others would be such a meaningful <br/>\ncontribution and I guess that&#39;s another reason why I want to feel like I&#39;m <br/>\nmoving beyond the &quot;how can I really be this way&quot; stage.  But the biggest <br/>\nreason is just to feel like I&#39;m giving my kids this solid foundation to draw <br/>\nupon through their lives and so that they can be this way with their kids and <br/>\nhave it come much more naturally (role modeling again).<br/>\n   Thanks for your thoughts and for the author recommendations.<br/>\n<br/>\n    Lucy</div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;Tracy@...","replyTo":"LIST","senderId":"cixFOY5J9QHTWtvGCg2TTpOQY4mRw37CXLaY2VCl9S9cAuuLRqtCcfdHB0Q53u2t-YPZq1a0oJ02qPNIw3-hIwFgjODN5UEj5X4WMtkudSNOmvU1B85iMeO6","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Finding Role Models","postDate":"943224663","msgId":4741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMDkuNDc0MS45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":4761,"prevInTime":4740,"nextInTime":4742,"topicId":4741,"numMessagesInTopic":0,"msgSnippet":"Lucy, I know I m behind here, but I know EXACTLY what you mean!  On a different issue, I have read the books by Adele Faber and Eileen Mazlish, and while they","messageBody":"<div id=\"ygrps-yiv-70759947\">Lucy, I know I&#39;m behind here, but I know EXACTLY what you mean!  On a<br/>\ndifferent issue, I have read the books by Adele Faber and Eileen Mazlish,<br/>\nand while they are, in their way, &#39;how-to&#39; books, they do dwell more on<br/>\nchanging the way we deal with things to reflect the respect and love we feel<br/>\nfor our children, than changing our children.  While reading such a book may<br/>\nnot change someone&#39;s idea about how they see their children, for those who<br/>\nalready know that they are not comfortable with the way their parents dealt<br/>\nwith things they do present an alternative way of behaving, and as Joel<br/>\nsays, this would not work (much like dieting!) if it&#39;s not believed in.<br/>\n<br/>\nMy nearest LLL group has been a source of such people, but it&#39;s a long way<br/>\nfrom me, and I haven&#39;t formed &#39;drop-in&#39; relationships with anyone else who<br/>\nbelieves the things I do and makes an effort to do something about them.<br/>\nSince September, my children have spent increasing amounts of time with my<br/>\nmother, m-i-l and dh, and it&#39;s showing in their behaviour and what they say,<br/>\nlike labelling themselves as &#39;good&#39; or &#39;naughty.&#39;  I&#39;m considering<br/>\n&#39;accidentally&#39; leaving some suitable literature at my mother&#39;s, see if it<br/>\nmakes a breakthrough!  My role models are Mother Bear from Little Bear, and<br/>\nthe &#39;factional&#39; mother in the Faber and Mazlish books, and I try to<br/>\nintroduce others to my path, in hope of having a travelling companion!  Like<br/>\nyou, Lucy, I keep this list for this reason as well as the intersesting<br/>\ndebates!  I&#39;m also on a couple of other lists where I follow some and seem<br/>\nto lead others, which is just as it should be!  (anyone who&#39;s also on those<br/>\nlists, I hope that doesn&#39;t sound pompous!)<br/>\n<br/>\nBest of luck in finding a real-live role model, and keep heart by knowing<br/>\nthat we can become those role-models for other mothers, and our own<br/>\nchildren.<br/>\n<br/>\nTracy<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LASaliger@...\">LASaliger@...</a><br/>\n&gt; Subject:  Finding role models<br/>\n&gt;<br/>\n&gt;    I believe that it is so much better to treat children with respect and<br/>\n&gt; care, to take the time to talk out a situation with them rather than just<br/>\n&gt; using quick penalties/punishments, etc.  However one of the things that I<br/>\n&gt; find hardest is that I don&#39;t know where to see that kind of<br/>\n&gt; parenting/treatment of children modeled.  I believe in it but I feel like<br/>\n&gt; it&#39;s so hard to live up to my ideals because I wasn&#39;t raised that way and<br/>\n </span></blockquote>I<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t see it in the people I know.  I know there are people out there,<br/>\n </span></blockquote>like<br/>\n<blockquote><span title=\"ireply\"> &gt; many of you on this list, and that&#39;s why this group is so much help to me<br/>\n </span></blockquote>but<br/>\n<blockquote><span title=\"ireply\"> &gt; I wish that I could really see it in practice.<br/>\n&gt;    I find myself instead looking to a few fictional characters, like the<br/>\n </span></blockquote>mom<br/>\n<blockquote><span title=\"ireply\"> &gt; (Marmy) in Little Women.  My kids know that she&#39;s one of my ideals and so<br/>\n&gt; when I lose my patience and yell or whatever, they joke with me, &quot;That<br/>\n </span></blockquote>wasn&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; very Marmy-like.&quot;  Anyway, just wondered if you struggle with this also<br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; what any of you may have done to find role models or learn new ways of<br/>\n </span></blockquote>being<br/>\n<blockquote><span title=\"qreply\"> &gt; and have them stick.<br/>\n&gt;<br/>\n&gt;      Lucy in Calif. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":4760,"nextTopicId":4765}}