{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":39,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258735343","msgId":48731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzRERGNzNFLUYzRDUtNEU1OC04NzgxLUFFMDczNTkzQjRDN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhlNmYyaytsOHIyQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlNmYyaytsOHIyQGVHcm91cHMuY29tPg=="},"prevInTopic":48729,"nextInTopic":48741,"prevInTime":48730,"nextInTime":48732,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"-=-I know that part of the reason was because I thought the 3-D puzzle was something we could do together, whereas the other puzzle is something she would play","messageBody":"<div id=\"ygrps-yiv-458984923\">-=-I know that part of the reason was because I thought the 3-D puzzle  <br/>\nwas something we could do together, whereas the other puzzle is  <br/>\nsomething she would play with by herself. But is that fair or  <br/>\nconsistent? It seems to me I need some kind of guiding principle for  <br/>\nspending money on these types of things.-=-<br/>\n<br/>\nConsistency sounds like rules, in a situation like this.  If one time  <br/>\nyou veer off your chosen route and take the kids skinny-dipping, have  <br/>\nyou set a precedent for all time?   If one time you buy everyone a  <br/>\ncostume when it&#39;s not even Halloween, would it be &quot;unfair&quot; or  <br/>\ninconsistent if you didn&#39;t do the same thing every  year or anytime  <br/>\nanyone asked?<br/>\n<br/>\n-=-For one, my husband feels she was being extravagant and didn&#39;t want  <br/>\nto support that. For example, he is a true golf nut and works daily to  <br/>\nimprove his game, but he won&#39;t ever spend money on expensive new  <br/>\nclubs. I don&#39;t spend much money on myself, either. That&#39;s why we give  <br/>\nthe kids allowances--so that they have some money to spend any which  <br/>\nway they want, whether we think it&#39;s a good idea or not.-=-<br/>\n<br/>\nThat&#39;s how we treated our children&#39;s allowances.  They could spend it  <br/>\nthe moment they got it, or save it.  We would save it for them, if  <br/>\nthey wanted.  So instead of getting cash, they could write it on the  <br/>\ncalendar, and it was in &quot;the bank of dad.&quot;  They could claim it  <br/>\nanytime they wanted it.   Kirby went a whole year just adding it up on  <br/>\nthe calendar once, because he had a job, so the allowance was his  <br/>\nsavings.  So each Sunday he would add the $12.75 or whatever it was  <br/>\nand put the new balance.<br/>\n<br/>\nThe allowance wasn&#39;t intended to press them to provide for  <br/>\nthemselves.   And if they wanted something I figured would provide  <br/>\nmore-than-average learning, I was more likely to buy it, because it  <br/>\nseemed justifiable from an unschooling/homeschooling perspective.  It  <br/>\nmade our unschooling nest richer, especially if it was something  <br/>\nreuseable for years or that the kids would do together.<br/>\n<br/>\nThings having to do with health or exercise were easy to decide, too.   <br/>\nThey didn&#39;t have to provide those things for themselves.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258733624","msgId":48725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNDYyQjI0LTZDMEMtNENCMi1BOEI3LTE5QUE4NjYxNTU4Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhlNTllcCt2MDJqQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlNTllcCt2MDJqQGVHcm91cHMuY29tPg=="},"prevInTopic":48723,"nextInTopic":48729,"prevInTime":48724,"nextInTime":48726,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"Some people say no first and think later, or they say no and never do think. There are some things I would be unwilling to buy into (literally). Keith hates","messageBody":"<div id=\"ygrps-yiv-159115416\">Some people say no first and think later, or they say no and never do  <br/>\nthink.<br/>\n<br/>\nThere are some things I would be unwilling to &quot;buy into&quot; (literally).   <br/>\nKeith hates the idea of tattoos.  I wouldn&#39;t want to pay for a tattoo  <br/>\nfor any of my kids.  None of them has one, but Holly&#39;s seriously  <br/>\nplanning some.<br/>\n<br/>\nYesterday Holly bought a mask that cost over $100.  It&#39;s beautiful.   <br/>\nIt&#39;s fragile.  So I pressed her to create a box or case for it so it  <br/>\nwill be safe here with me and cats and such.  She bought it from a  <br/>\ncostume shop we&#39;ve been in before.  The last time she asked about  <br/>\nthose masks, the one she wanted was $60.  She had $60 of her own  <br/>\nmoney, but she figured there was no pressing need for it.<br/>\n<br/>\nTomorrow night, she and Marty and his girlfriend Ashlee are going to a  <br/>\nmasked ball, with Renaissance dancing.  It&#39;s an SCA event at the  <br/>\nUniversity of New Mexico.  It&#39;s a Toys for Tots event, too, so the  <br/>\nentry fee is the donation of a toy, for the Marines, to provide for  <br/>\npoorer children at Christmas.<br/>\n<br/>\nSo Holly is going to wear my wedding dress and she bought a mask to  <br/>\nmatch it.   It wasn&#39;t a hasty decision at all.  It&#39;s money she earned  <br/>\nworking last winter and Spring, and that she still had in savings.<br/>\n<br/>\nAs to handmade beads, perhaps you could look on etsy shops for some.   <br/>\nShe could even order her own colors.   Maybe she could even find a  <br/>\nbeadmaker and go and see them work.  Possibly she could find a  <br/>\nbeadmaker to let her try it.  I&#39;ve been in and around beadmaking  <br/>\nworkshops, also in the SCA.  The beginners&#39; beads are lumpy. &lt;g&gt;  But  <br/>\nwith practice the best artists can do some very cool things.  It  <br/>\ninvolves turning a ball of glass over a flame, and adding bits of  <br/>\nother colors.   (The style I&#39;ve seen does, anyway.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":241447822,"authorName":"thecugals","from":"&quot;thecugals&quot; &lt;thecugals@...&gt;","profile":"thecugals","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258733460","msgId":48729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlNmYyaytsOHIyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdBNUEwM0FCQzM0ODQ5NkFBNTE2NjBDMUNBNDAxN0RGQFJvYnluUEM+"},"prevInTopic":48725,"nextInTopic":48731,"prevInTime":48728,"nextInTime":48730,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... situation I might offer to split the cost with her. We ve done this in the past with both our kiddos, but there are two issues that held us back on this","messageBody":"<div id=\"ygrps-yiv-1848283656\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I think if Jayn had an allowance, and I could afford the money, in this <br/>\n </span></blockquote>situation I might offer to split the cost with her.<br/>\n<br/>\nWe&#39;ve done this in the past with both our kiddos, but there are two issues that held us back on this one.  For one, my husband feels she was being extravagant and didn&#39;t want to support that.  For example, he is a true golf nut and works daily to improve his game, but he won&#39;t ever spend money on expensive new clubs.  I don&#39;t spend much money on myself, either.  That&#39;s why we give the kids allowances--so that they have some money to spend any which way they want, whether we think it&#39;s a good idea or not.  The other issue is whimsy.  At one point my daughter said, &quot;Maybe I&#39;ll be able to stop thinking about it tomorrow.&quot;  So then I had to ask her whether it was worth paying $25 for something she could possibly forget about the next day.  But then I&#39;m finding my own spending decisions to be somewhat whimsical, too.  In the past week, my daughter has wanted a fill-in-the-blanks journal (bought it), a knitting kit (bought it), a $2 cookie (bought it), a 3-D puzzle (looked for it at Target and didn&#39;t find it), and a Rubik&#39;s puzzle of some kind (didn&#39;t buy it).  Why was I willing to buy the 3-D puzzle and not the Rubik&#39;s puzzle?  I know that part of the reason was because I thought the 3-D puzzle was something we could do together, whereas the other puzzle is something she would play with by herself.  But is that fair or consistent?  It seems to me I need some kind of guiding principle for spending money on these types of things.<br/>\n<br/>\nBeth C.</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258724540","msgId":48723,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdBNUEwM0FCQzM0ODQ5NkFBNTE2NjBDMUNBNDAxN0RGQFJvYnluUEM+","inReplyToHeader":"PGhlNTllcCt2MDJqQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlNTllcCt2MDJqQGVHcm91cHMuY29tPg=="},"prevInTopic":48722,"nextInTopic":48725,"prevInTime":48722,"nextInTime":48724,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2007148693\">&lt;&lt;&lt;&lt; She never did agree with our point of view, so I ended up telling her <br/>\nthat we were not willing to buy it for her, but she could save up her own <br/>\nmoney and buy it herself.&quot; (She has an allowance.) Would love your opinions <br/>\nabout this. &gt;&gt;&gt;&gt;<br/>\n<br/>\nSome of Jayn&#39;s greatest learning experiences have been with her purchasing <br/>\nitems of dubious quality, and then coming to the realization herself that <br/>\nthis brand or type is not worth the money. Other times, I&#39;ve thought things <br/>\nwere overly expensive, but the level of joy that owning the object gives her <br/>\nseems worth the price.<br/>\n<br/>\nIf $25 was what I had budgeted for this shopping trip, and this was what she <br/>\nwanted to spend it on, I would have bought it for her, with the <br/>\nunderstanding that this was all we were spending today. We usually go into <br/>\nshops with a maximum budget - she has that amount and she chooses how it is <br/>\nspent.<br/>\n<br/>\nI think if Jayn had an allowance, and I could afford the money, in this <br/>\nsituation I might offer to split the cost with her.<br/>\n<br/>\nHowever, in this very specific instance I want to talk to you about handmade <br/>\nitems in general and glass beads in particular.<br/>\n<br/>\nIf you are shopping in a small, local craft/art store hand crafted things <br/>\nare going to be more expensive. As an artisan myself, it is very hard to <br/>\ncompete on price points with mass produced, even hand made mass produced, <br/>\nitems being made by workers in foreign lands whose wages are pennies per <br/>\nhour.  A $25 dollar bead probably represents an investment of time and care <br/>\nby a local artisan plus what could easily be a 50% or more mark up by the <br/>\nretailer.<br/>\n<br/>\nI want to suggest that you can support your daughter&#39;s interest in beads and <br/>\nher appreciation of the beauty of the handmade in several ways that might <br/>\nmake you feel that it is more worth it. If you take that same $25 to one of <br/>\nthe genuine hand crafts fairs that are abundant at this time of year or a <br/>\nbead expo, you will probably find lampwork artists there selling beads and <br/>\nbe able to actually talk to the artist about his or her process. Most <br/>\nartists love talking to kids especially. There is some amazing work out <br/>\nthere. And you will probably be able to get more for your money.<br/>\n<br/>\nThe tv show &quot;That&#39;s Clever&quot; (HGTV) often features glass artists and the time <br/>\nconsuming nature of lampwork is very evident. It&#39;s quite fascinating. I <br/>\ncould see myself really getting into it if I ever got started.<br/>\n<br/>\nThere are many hand made lampwork glass beads on Etsy under the supplies <br/>\ntab. It can be a feast for the eyes.<br/>\nwww.etsy.com<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":241447822,"authorName":"thecugals","from":"&quot;thecugals&quot; &lt;thecugals@...&gt;","profile":"thecugals","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258694937","msgId":48722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlNTllcCt2MDJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCMDFENzU3LjMwNjA4MDRAbWFjLmNvbT4="},"prevInTopic":48674,"nextInTopic":48723,"prevInTime":48721,"nextInTime":48723,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... But, yes, this sounds good - it sounds like trying to find a way to honestly say yes more, as opposed to someone who, for example, says, No way, I m not","messageBody":"<div id=\"ygrps-yiv-311951723\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>But, yes, this sounds good - it sounds<br/>\nlike trying to find a way to honestly say yes more, as opposed to<br/>\nsomeone who, for example, says, &quot;No way, I&#39;m not spending that much<br/>\nmoney on that.&quot;<br/>\n<br/>\nBut is it never appropriate to say that?  Tonight my 8yo daughter and I were in a local shop, where she found a handmade glass bead for $25.  I said, &quot;That&#39;s a lot of money for one bead!&quot;  And she said, &quot;But it&#39;s handmade.&quot;  Long story short, she persisted in wanting this bead, but my husband and I didn&#39;t want to spend that much money on that.  We had $25 to spend, and if WE thought it worthwhile to spend the money in that way we would have.  But we didn&#39;t.  So we tried explaining in different ways why, in our opinion, $25 for one bead was not a good value.  She never did agree with our point of view, so I ended up telling her that we were not willing to buy it for her, but she could save up her own money and buy it herself.&quot; (She has an allowance.) Would love your opinions about this.<br/>\n<br/>\nBeth C.</div>","specialLinks":[]},{"userId":337736493,"authorName":"Anne Mills","from":"Anne Mills &lt;anne-mills@...&gt;","profile":"aberruyermills","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] ...restrictions...","postDate":"1258492253","msgId":48674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwOC1XMzg0NDAwODZDRUQxRUZBNDUwOUI5NUU0QTQwQHBoeC5nYmw+","inReplyToHeader":"PDQ5OEJENUE5LUFBNzItNERFQS1BNjc5LTJDQjI4M0YwNUM3MUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4gPDM3ODE2RDNDLUQ2MkQtNEQ1NS1CNURDLUE5OEVCRDMyNEU0MEBTYW5kcmFkb2RkLmNvbT4gPDA1NDMwMWNhNjczNSQyY2FjMDhjMCQ2NTBhYTlhOUBHb256bz4gPDc5OTBDRTA3NTg5RDQyRkU4ODgyNjBFODU1ODA5RjQxQEZBTUlMWVJPT00+LDw0OThCRDVBOS1BQTcyLTRERUEtQTY3OS0yQ0IyODNGMDVDNzFAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":48667,"nextInTopic":48722,"prevInTime":48673,"nextInTime":48675,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"do you know that you can decaffein you tea quite a bit by pouring the hot water on the bag and get rid of the first few seconds of brewed water.You then make","messageBody":"<div id=\"ygrps-yiv-1288720813\">do you know that you can decaffein you tea quite a bit by pouring the hot water on the bag and get rid of the first few seconds of brewed water.You then make your tea with that tea bag. Tastes the same and is much decaffeined this way.<br/>\nI learned that for breasfeeding purposes. Anne  <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a><br/>\nDate: Tue, 17 Nov 2009 10:39:02 -0700<br/>\nSubject: Re: [AlwaysLearning] ...restrictions...<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      -=-. The mom always marvels at my relationship with my girls (18 &<br/>\n<br/>\n15). She wants the same sort of relationship with her own daughter, but<br/>\n<br/>\nshe&#39;s not willing to do the work to make that happen. You can&#39;t help<br/>\n<br/>\nsomeone who doesn&#39;t want help badly enough to step out of her comfort  <br/>\n<br/>\nzone.-=-<br/>\n<br/>\n<br/>\n<br/>\nI was reading an article saying that people who wake up at 3:00 every  <br/>\n<br/>\nnight might have liver problems (Chinese-medicine recommendation, not  <br/>\n<br/>\nmainstream medicine, which has a pill for that waking-up problem), or  <br/>\n<br/>\nsomething.   And I do, and I have had liver issues before, and I  <br/>\n<br/>\nthought &quot;Good!  I can deal with my liver and sleep longer!&quot;  but the  <br/>\n<br/>\nfirst item was to cut out all caffein, and I love my tea...  So I  <br/>\n<br/>\nimmediately decided I would rather drink tea and wake up at 3:00 every  <br/>\n<br/>\nnight than to go without caffein.<br/>\n<br/>\n<br/>\n<br/>\nSome parents would rather continue to press kids to clean their rooms  <br/>\n<br/>\nand go to school and follow arbitrary rules.  They also want the kind  <br/>\n<br/>\nof relationship I have with my kids.  They can&#39;t have both.<br/>\n<br/>\n<br/>\n<br/>\nThere have been some unschoolers who clung to one or another  <br/>\n<br/>\nmainstream &quot;rule&quot; and a couple have assured me that their families are  <br/>\n<br/>\njust as happy as mine, but my kids know their kids, and their kids  <br/>\n<br/>\npost things in public, and it seems not to be quite as happy as mine,  <br/>\n<br/>\nand it seems clearly to do with the parental rules.  Antagonism and  <br/>\n<br/>\n&quot;us vs. you&quot; within a family cannot breed soft, peaceful, relaxed  <br/>\n<br/>\nrelationships.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   \t\t \t   \t\t  <br/>\n_________________________________________________________________<br/>\nTchattez en direct en en vid�o avec vos amis !  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.windowslive.fr/messenger/\">http://www.windowslive.fr/messenger/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] ...restrictions...","postDate":"1258479542","msgId":48667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5OEJENUE5LUFBNzItNERFQS1BNjc5LTJDQjI4M0YwNUM3MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5OTBDRTA3NTg5RDQyRkU4ODgyNjBFODU1ODA5RjQxQEZBTUlMWVJPT00+","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4gPDM3ODE2RDNDLUQ2MkQtNEQ1NS1CNURDLUE5OEVCRDMyNEU0MEBTYW5kcmFkb2RkLmNvbT4gPDA1NDMwMWNhNjczNSQyY2FjMDhjMCQ2NTBhYTlhOUBHb256bz4gPDc5OTBDRTA3NTg5RDQyRkU4ODgyNjBFODU1ODA5RjQxQEZBTUlMWVJPT00+"},"prevInTopic":48658,"nextInTopic":48674,"prevInTime":48666,"nextInTime":48668,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"-=-. The mom always marvels at my relationship with my girls (18 & 15). She wants the same sort of relationship with her own daughter, but she s not willing to","messageBody":"<div id=\"ygrps-yiv-1010694114\">-=-. The mom always marvels at my relationship with my girls (18 &<br/>\n15). She wants the same sort of relationship with her own daughter, but<br/>\nshe&#39;s not willing to do the work to make that happen. You can&#39;t help<br/>\nsomeone who doesn&#39;t want help badly enough to step out of her comfort  <br/>\nzone.-=-<br/>\n<br/>\nI was reading an article saying that people who wake up at 3:00 every  <br/>\nnight might have liver problems (Chinese-medicine recommendation, not  <br/>\nmainstream medicine, which has a pill for that waking-up problem), or  <br/>\nsomething.   And I do, and I have had liver issues before, and I  <br/>\nthought &quot;Good!  I can deal with my liver and sleep longer!&quot;  but the  <br/>\nfirst item was to cut out all caffein, and I love my tea...  So I  <br/>\nimmediately decided I would rather drink tea and wake up at 3:00 every  <br/>\nnight than to go without caffein.<br/>\n<br/>\nSome parents would rather continue to press kids to clean their rooms  <br/>\nand go to school and follow arbitrary rules.  They also want the kind  <br/>\nof relationship I have with my kids.  They can&#39;t have both.<br/>\n<br/>\nThere have been some unschoolers who clung to one or another  <br/>\nmainstream &quot;rule&quot; and a couple have assured me that their families are  <br/>\njust as happy as mine, but my kids know their kids, and their kids  <br/>\npost things in public, and it seems not to be quite as happy as mine,  <br/>\nand it seems clearly to do with the parental rules.  Antagonism and  <br/>\n&quot;us vs. you&quot; within a family cannot breed soft, peaceful, relaxed  <br/>\nrelationships.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: ...restrictions... Now ...Alternatives to taking  down the door :-)","postDate":"1258466900","msgId":48647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTdEMkQzNkQ1MjQwNzQ4QzNEOEE2NzBCODVCQURFQFJvYnluUEM+","inReplyToHeader":"PGhkdG5hYiszY2F0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhkdG5hYiszY2F0QGVHcm91cHMuY29tPg=="},"prevInTopic":48644,"nextInTopic":48658,"prevInTime":48646,"nextInTime":48648,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"I agree with the idea of cool down time. Silent waiting has been better than feeding a negative situation with more negative energy around here. I couldn t put","messageBody":"<div id=\"ygrps-yiv-192853597\">I agree with the idea of cool down time. Silent waiting has been better than <br/>\nfeeding a negative situation with more negative energy around here. I <br/>\ncouldn&#39;t put a time to it though - it seems like only a few minutes but I&#39;m <br/>\nsure it varies.<br/>\n<br/>\nBut is this true?<br/>\n&lt;&lt;&lt;&lt;There is literally nothing you can do that will help a child with these <br/>\ntendencies get unstuck... nothing!  &gt;&gt;&gt;<br/>\n<br/>\nWhat Jayn has asked me to do specifically is hug her, and hug her tight. She <br/>\nsometimes flails for a tiny moment, but then hugs back. This is an almost <br/>\ninstant unsticker for her. The hugging is especially important to her even <br/>\nwhen I least feel like doing it - when she has hit me or shouted angrily. <br/>\nThe change in her state  is to immediate remorse and pleasantness - and <br/>\nwillingness to talk about what happened.<br/>\n<br/>\nIn the past there has been times when a physcial knock has been the sudden <br/>\ncatalyst for crying which also unsticks. I don&#39;t mean hitting her - I mean <br/>\nshe might be throwing herself around and accidentally bang her hand on the <br/>\nback of the sofa or stub her toe and it acted like a reset button.<br/>\n<br/>\nJayn&#39;s volatility has died down noticeably in recent times - a combination <br/>\nof maturity and consistently hugging in the stressful moments. I know not <br/>\nall kids would want this.<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":128237955,"authorName":"Beth","from":"&quot;Beth&quot; &lt;saremca@...&gt;","profile":"saremca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] ...restrictions...","postDate":"1258465410","msgId":48658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5OTBDRTA3NTg5RDQyRkU4ODgyNjBFODU1ODA5RjQxQEZBTUlMWVJPT00+","inReplyToHeader":"PDA1NDMwMWNhNjczNSQyY2FjMDhjMCQ2NTBhYTlhOUBHb256bz4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4gPDM3ODE2RDNDLUQ2MkQtNEQ1NS1CNURDLUE5OEVCRDMyNEU0MEBTYW5kcmFkb2RkLmNvbT4gPDA1NDMwMWNhNjczNSQyY2FjMDhjMCQ2NTBhYTlhOUBHb256bz4="},"prevInTopic":48647,"nextInTopic":48667,"prevInTime":48657,"nextInTime":48659,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"= =I have a friend with a 12yr old boy and 4yr old girl. She is having so much trouble with the boy and nothing seems to work. He is failing school and resents","messageBody":"<div id=\"ygrps-yiv-206706906\">=&#92;=I have a friend with a 12yr old boy and 4yr old girl. She is having so<br/>\nmuch<br/>\ntrouble with the boy and nothing seems to work. He is failing school and<br/>\nresents his sister. Mom has taken away access to TV, phone, internet, etc,<br/>\nand was threatening to take the door off his room!!! I don&#39;t know what to<br/>\nsay to her, but I asked how her approach was working and she knows it&#39;s NOT<br/>\nworking. I talked to her, but it&#39;s tough. I don&#39;t know if she listens to me<br/>\nsince I don&#39;t have a teenager, I only know what I&#39;ve read and observed, but<br/>\nI think that&#39;s a lot. =&#92;=<br/>\n<br/>\nI think the best you can do is offer advice and make recommendations like<br/>\nyou have been.  You really don&#39;t have any control over whether or not she<br/>\nchooses to take your suggestions into consideration.<br/>\n<br/>\nJust this morning I had a conversation with a mom whose daughter is 17, a<br/>\nyear younger than my oldest.  She was telling me that over the weekend her<br/>\nhusband marched into her daughter&#39;s room, gathered all of her things that<br/>\nwere lying on her bedroom floor, and piled them on top of her bed to force<br/>\nher to put things away and clean up her mess.  She was very proud of her<br/>\nhusband, and said to me &quot;We&#39;ve tried absolutely everything to get that girl<br/>\nto clean her room, but nothing has worked!&quot;  I asked her if she had tried<br/>\nclosing the bedroom door so they didn&#39;t have to look at the mess if it<br/>\nbothered them that much.  She kind of sat there and didn&#39;t say anything for<br/>\na few minutes, then continued with &quot;Well it is her room, but it&#39;s OUR<br/>\nhouse...blah, blah, blah.&quot;<br/>\n<br/>\nI was tempted to ask her what she would do if her husband went into her<br/>\noffice (which is pretty darned messy) and gathered all of her things up and<br/>\npiled them in the middle of her desk, but I didn&#39;t.  I didn&#39;t think she<br/>\nwould see that as the same thing because she views adults and children as<br/>\ntwo different classes of people.<br/>\n<br/>\nThis woman&#39;s daughter is a good kid.  She gets good grades, plays varsity<br/>\nsoftball, has a part-time job, etc, but she clashes with her parents<br/>\nconstantly.  The mom always marvels at my relationship with my girls (18 &<br/>\n15).  She wants the same sort of relationship with her own daughter, but<br/>\nshe&#39;s not willing to do the work to make that happen.  You can&#39;t help<br/>\nsomeone who doesn&#39;t want help badly enough to step out of her comfort zone.<br/>\n<br/>\nBeth D.</div>","specialLinks":[]},{"userId":210051631,"authorName":"whatsreal12","from":"&quot;whatsreal12&quot; &lt;whatsreal12@...&gt;","profile":"whatsreal12","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: ...restrictions... Now ...Alternatives to taking  down the door :-)","postDate":"1258446987","msgId":48644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkdG5hYiszY2F0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA1NDMwMWNhNjczNSQyY2FjMDhjMCQ2NTBhYTlhOUBHb256bz4="},"prevInTopic":48642,"nextInTopic":48647,"prevInTime":48643,"nextInTime":48645,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"Your post was very inspirational, you must be very proud of how far you have come.  I wanted to offer your friend the one tool that worked for my family in","messageBody":"<div id=\"ygrps-yiv-560887232\">Your post was very inspirational, you must be very proud of how far you have come.  I wanted to offer your friend the one tool that worked for my family in case it might help.<br/>\n<br/>\nIt makes me crazy when I can&#39;t remember the title of a book, so now I have to give you my version and perhaps someone else can supply the book title!<br/>\n<br/>\nBasically this book talks about dealing with a child labeled &#39;difficult&#39; or &#39;hard to handle&#39; (ie independent and strong willed) and mentions that with some of these children, the parent/child interaction becomes a battle of wills, only as the parent attempts to wrest control they come up with more and more outlandish ante to up and the child never does back down.  The parent is thinking &quot;of course, the child will back down if I say I am taking away all of their toys&quot; (that is honestly some of the mainstream advice out there, designed I suppose to &quot;show them who&#39;s boss).  I recognized it when you said she threatened to take his door down, because that advice was given to us!  <br/>\n<br/>\nInstead of these ridiculous and exponentially increasing &quot;punishments&quot; the book suggests a simple cool down period for both parties - ours was 20 minutes.  The author acknowledges traditional parents&#39; reluctance to let a &quot;wrong&quot; go uncorrected, but makes the point that at the point of conflict, the child is &#39;stuck&#39;.  There is literally nothing you can do that will help a child with these tendencies get unstuck... nothing!  He then makes a very useful analogy to say that that being stuck is exactly like a diesel engine with an air bubble in the line... nothing but time is going to release that air bubble. You can press the gas all you like, you can hit the steering wheel, but only time will clear the line.<br/>\n<br/>\nThis method worked like a charm for us (not to say perfectly every time) but gradually the volatility died down to nearly nothing.  <br/>\nI should say that we incorporated this with respectful parenting, listening to his concerns after the cool down and not assigning blame, just discussing the events/situation that led to the conflict.  As a result, I could not ask for a more loving, mutually respectful and joyous relationship with my teenage son.<br/>\n<br/>\nSo, if anyone knows the name of that book..please remind me!  and Kim, I think your friend is lucky to have you, and to be like you would not be a bad thing at all... it seems we all have our journey.<br/>\nCynthia in AZ<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt; wrote:<br/>\n&gt; I have a friend with a 12yr old boy and 4yr old girl. She is having so much<br/>\n&gt; trouble with the boy and nothing seems to work. He is failing school and<br/>\n&gt; resents his sister. Mom has taken away access to TV, phone, internet, etc,<br/>\n&gt; and was threatening to take the door off his room!!! I don&#39;t know what to<br/>\n&gt; say to her, but I asked how her approach was working and she knows it&#39;s NOT<br/>\n&gt; working. I talked to her, but it&#39;s tough. I don&#39;t know if she listens to me<br/>\n&gt; since I don&#39;t have a teenager, I only know what I&#39;ve read and observed, but<br/>\n&gt; I think that&#39;s a lot. I don&#39;t want them to end up like me! I know she loves<br/>\n&gt; her son, and would be devastated if he left and never looked back! I loaned<br/>\n&gt; her a video (Hold Onto Your Kids) and suggested a book she might read. (I<br/>\n&gt; loaned her the HOYK book months ago but she hasn&#39;t read it!)<br/>\n&gt;  <br/>\n&gt; Oops! This comparison turned into a post asking for advice! I guess I needed<br/>\n&gt; to put that out there. If anyone has any advice on what I can do to help or<br/>\n&gt; how to talk to this friend, let me know.<br/>\n&gt;  <br/>\n&gt; Thanks,<br/>\n&gt; Kim in Oregon<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] ...restrictions...","postDate":"1258428140","msgId":48642,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1NDMwMWNhNjczNSQyY2FjMDhjMCQ2NTBhYTlhOUBHb256bz4=","inReplyToHeader":"PDM3ODE2RDNDLUQ2MkQtNEQ1NS1CNURDLUE5OEVCRDMyNEU0MEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4gPDM3ODE2RDNDLUQ2MkQtNEQ1NS1CNURDLUE5OEVCRDMyNEU0MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48641,"nextInTopic":48644,"prevInTime":48641,"nextInTime":48643,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1484779594\">&lt;&lt;You don&#39;t have to give your children a say in ANYthing, ever. Never.<br/>\nThe result of that would probably be that you had children who lied <br/>\nand stole from you, or ran away, or killed themselves, or who decided <br/>\nto roll over and go with it, and then would become controlling of <br/>\ntheir own children (and friends, and neighbors, and strangers). <br/>\nThat&#39;s what I think, anyway. That&#39;s what I&#39;ve seen in my life. &gt;&gt;<br/>\n <br/>\n <br/>\nMy parents never taught me how to make ANY choices let alone GOOD choices.<br/>\nWhen we went out to dinner, my dad would order for us. Once when I was a<br/>\nteenager he asked me what I wanted and I had no clue! I didn&#39;t know what I<br/>\nwanted! Could choose anything off the menu? Would they be mad if it cost too<br/>\nmuch? What if I didn&#39;t like it?! etc. I asked him what I liked and he<br/>\nordered for me! (I was still a wreck like this when I met my husband in<br/>\ncollege! He thought it was too weird that I would let him order for me.)<br/>\n <br/>\nMy dad beat me until I was 13 and my mom has been emotionally and verbally<br/>\nabusive my whole life. I never lied or stole from my parents or broke their<br/>\nrules while I was living with them (mainly out of fear of what my dad would<br/>\ndo to me, NOT because I had learned how to make good choices!), but I<br/>\nrebelled once I moved out and went to college. There were SO many choices<br/>\nout in the world! I had no idea how to even know what to choose!!! I made<br/>\nsome bad choices (that seemed good at the time) and could not balance my<br/>\nlife, so I dropped out of school. BUT I did not move back in with THEM, I<br/>\nmoved with my boyfriend (now husband) and never looked back.<br/>\n <br/>\nI used to think about suicide all the time (from 12-18), but never tried it<br/>\nbecause I figured that would be giving them the easy way out. They&#39;d get<br/>\nwhat they always wanted, me out of their lives! Plus if it didn&#39;t work, I&quot;d<br/>\nbe in HUGE trouble! <br/>\n <br/>\nAfter I dropped out of college, I swore to myself that I would NEVER go<br/>\ncrawling back to my parents for any kind of support or money or anything.<br/>\nTheir help would come with strings. And verbal abuse. I had hoped it would<br/>\nwork out with my college boyfriend (whew, it did!) but if we had broken up<br/>\nand I had no money or anything, I still would not have called my parents. <br/>\n <br/>\nNow I don&#39;t even talk to my parents. For me, this has been a very healthy<br/>\nchoice!!! I tried for years to communicate with my mom and I needed to know<br/>\nwhy she did some of the things she did, but she preferred to ignore the past<br/>\nand &quot;let&#39;s just move forward&quot; which I couldn&#39;t do without an explaination.<br/>\nEventually I stopped asking for what she couldn&#39;t give me and let it go. I<br/>\nsaw them last Christmas at my sister&#39;s but really have not talked to my mom<br/>\nsince then. It has alienated me from my sisters who talk to my mom daily and<br/>\nare still stuck in their world and one is raising her kids like we were<br/>\nraised. The other has no kids and is an alcoholic (but married to a doctor<br/>\nso they have money to have fun with instead of kids). <br/>\n <br/>\nDo you think this is what they wanted for me?! I&quot;m sure they&#39;d love to have<br/>\nme in their lives now, if not to continue controlling, at least to KNOW and<br/>\nbe able to know my son, their grandson.<br/>\n <br/>\nI have a friend with a 12yr old boy and 4yr old girl. She is having so much<br/>\ntrouble with the boy and nothing seems to work. He is failing school and<br/>\nresents his sister. Mom has taken away access to TV, phone, internet, etc,<br/>\nand was threatening to take the door off his room!!! I don&#39;t know what to<br/>\nsay to her, but I asked how her approach was working and she knows it&#39;s NOT<br/>\nworking. I talked to her, but it&#39;s tough. I don&#39;t know if she listens to me<br/>\nsince I don&#39;t have a teenager, I only know what I&#39;ve read and observed, but<br/>\nI think that&#39;s a lot. I don&#39;t want them to end up like me! I know she loves<br/>\nher son, and would be devastated if he left and never looked back! I loaned<br/>\nher a video (Hold Onto Your Kids) and suggested a book she might read. (I<br/>\nloaned her the HOYK book months ago but she hasn&#39;t read it!)<br/>\n <br/>\nOops! This comparison turned into a post asking for advice! I guess I needed<br/>\nto put that out there. If anyone has any advice on what I can do to help or<br/>\nhow to talk to this friend, let me know.<br/>\n <br/>\nThanks,<br/>\nKim in Oregon<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258415819","msgId":48640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGRDI3OEI4MzY2NDQ3NUVCQjk2QTQ3RDdENjNCRjZCQFJvYnluUEM+","inReplyToHeader":"PDRCMDFENzU3LjMwNjA4MDRAbWFjLmNvbT4=","referencesHeader":"PGhkcWxsNitsNWYzQGVHcm91cHMuY29tPiA8NEIwMUQ3NTcuMzA2MDgwNEBtYWMuY29tPg=="},"prevInTopic":48639,"nextInTopic":48641,"prevInTime":48639,"nextInTime":48641,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... I didn t get that the poster misunderstood the advice. I thought she meant that she has heard other folks - critics of unschooling - twisting the advice","messageBody":"<div id=\"ygrps-yiv-1718032979\"><blockquote><span title=\"ireply\">&gt; You&#39;ve misunderstood the advice. The advice is to say yes as often as<br/>\n&gt; you can - not to arbitrarily say no. But if a kid is asking to buy<br/>\n&gt; something, how is &quot;I will as soon as possible&quot; the same as &quot;no?&quot;  Say it<br/>\n&gt; out loud - &quot;No, I will as soon as possible&quot; doesn&#39;t even make sense.<br/>\n&gt; &quot;Yes, I will as soon as possible,&quot; does make sense.<br/>\n<br/>\n </span></blockquote>I didn&#39;t get that the poster misunderstood the advice. I thought she meant <br/>\nthat she has heard other folks - critics of unschooling - twisting the <br/>\nadvice into a criticism with that awful triumphant &quot;neener&quot; attitude of <br/>\nscoring a point.<br/>\n<br/>\nPeople who are determined to poo-poo unschooling will come up with these <br/>\ntwisted interpretations of the recommendations. Right up there with: &quot;It&#39;s <br/>\nfreedom instead of education&quot;.<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":414609447,"authorName":"flhomeschooling","from":"&quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt;","profile":"flhomeschooling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258413433","msgId":48641,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkc21ocCtqYnUwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCMDFENzU3LjMwNjA4MDRAbWFjLmNvbT4="},"prevInTopic":48640,"nextInTopic":48642,"prevInTime":48640,"nextInTime":48642,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... My kid knows and loves Craigslist, FreeCycle and eBay for this very reason. ... No, I ve not misunderstood anything. You misread what I wrote. I was","messageBody":"<div id=\"ygrps-yiv-1072470242\"><blockquote><span title=\"ireply\">&gt; Very true. And, if you do mean it, you&#39;ll also mean that you&#39;re open to <br/>\n&gt; his input and ideas of ways to get it or to accomplish the same thing <br/>\n&gt; without the big expense. It promises creativity in trying to figure out <br/>\n&gt; ways to get him what he wants, too.<br/>\n<br/>\n </span></blockquote>My kid knows and loves Craigslist, FreeCycle and eBay for this very reason.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I have read elsewhere that the unschooling idea of &quot;saying something like yes&quot; aka &quot;but I will as soon as possible&quot; instead of yes is a clever way of saying no which &quot;proves&quot; parents have to say no sometimes.<br/>\n&gt; <br/>\n&gt; You&#39;ve misunderstood the advice. <br/>\n<br/>\n </span></blockquote>No, I&#39;ve not misunderstood anything. You misread what I wrote.<br/>\n<br/>\nI was responding to the woman who was asking if unschooling meant everything the child wants has to be given immediately and if the money she earns can&#39;t be kept for her own needs and wants over the child&#39;s. <br/>\n<br/>\nI said that it is possible to always &quot;say yes or something like yes&quot; even if you&#39;re poor, and that WHILE some people argue that this is a way of saying no, I disagree with that statement.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; if a kid is asking to buy <br/>\n&gt; something, how is &quot;I will as soon as possible&quot; the same as &quot;no?&quot;<br/>\n<br/>\n </span></blockquote>If the child wants something RIGHT NOW, then &quot;I will as soon as possible&quot; is tantamount to &quot;No, you can&#39;t have it right now.&quot; It is a no in the *short-term*. But if it also comes with &quot;Yes, I will as soon as I can,&quot; then it&#39;s a yes in the *long-term*. If you mean it, if you really are making an effort to give the kid the yes ASAP, it will add to a trusting, peaceful relationship with a kid even with the &quot;short-term no.&quot;<br/>\n<br/>\nI see all of this as an ongoing narrative between the parent and the child. The child asks, &quot;Will you meet my needs? Are you willing to?&quot; And the parent can respond in ways that say, &quot;Yes, I am paying attention to your needs, and I am willing to do everything I can to meet your needs.&quot; Or the parent can respond in ways that communicate, &quot;Your needs are a nuisance to me. I am unwilling to meet them. I prioritize other things above them.&quot;<br/>\n<br/>\nIf a parent honestly says, &quot;I don&#39;t have the money for that right now, but I would love to get that for you ASAP, let&#39;s figure out how to make that happen,&quot; then what is being communicated there is &quot;Yes, I am willing to meet your needs&quot; even with the &quot;short term no.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unless - you thought the advice was, &quot;Say yes IMMEDIATELY to everything <br/>\n&gt; a child asks for the minute they ask for it even if you have to spend <br/>\n&gt; your rent money so you&#39;ll end up homeless because of it.&quot;<br/>\n&gt; <br/>\n&gt; Seriously - do you think we&#39;re stupid? &lt;G&gt;<br/>\n<br/>\n </span></blockquote>Respectfully, I think you may have gotten me confused with the original poster.  :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Seems like it bothers you that you can&#39;t give your kid everything he wants the instant he wants it<br/>\n<br/>\n </span></blockquote>I didn&#39;t say or imply anything like that, but wouldn&#39;t we all love to give our kids everything they want the instant they want it if we were able to? I don&#39;t think that desire is a bad thing.<br/>\n<br/>\nThe email was a response to a person bemoaning that they were very poor. I&#39;m officially poor according to the US poverty guidelines, but the point about always saying yes or something like it, as I understand it, is not to buy them everything in the universe and to hell with paying bills, but to establish a relationship where the child trusts that you don&#39;t say no arbitrarily. Through this lens, &quot;limited means&quot; isn&#39;t ever going to be an obstacle to peaceful parenting.<br/>\n<br/>\nAndrea in Miami</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258412404","msgId":48639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0FEN0M0LTdGRUUtNDE4Qy1CMDlELTRDNDA5ODMwMTcwREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCMDFENzU3LjMwNjA4MDRAbWFjLmNvbT4=","referencesHeader":"PGhkcWxsNitsNWYzQGVHcm91cHMuY29tPiA8NEIwMUQ3NTcuMzA2MDgwNEBtYWMuY29tPg=="},"prevInTopic":48638,"nextInTopic":48640,"prevInTime":48638,"nextInTime":48640,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"-=- I have read elsewhere that the unschooling idea of saying something like yes aka but I will as soon as possible instead of yes is a clever way of","messageBody":"<div id=\"ygrps-yiv-337517356\">-=-&gt; I have read elsewhere that the unschooling idea of &quot;saying  <br/>\nsomething like yes&quot; aka &quot;but I will as soon as possible&quot; instead of  <br/>\nyes is a clever way of saying no which &quot;proves&quot; parents have to say no  <br/>\nsometimes.<br/>\n<br/>\n-=-You&#39;ve misunderstood the advice. -=-<br/>\n<br/>\nShe was saying she read somewhere else that others claimed that  <br/>\nunschooelers were cleverly saying no.<br/>\nOther people do think we&#39;re stupid, yes. &lt;G&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258411863","msgId":48638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMDFENzU3LjMwNjA4MDRAbWFjLmNvbT4=","inReplyToHeader":"PGhkcWxsNitsNWYzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhkcWxsNitsNWYzQGVHcm91cHMuY29tPg=="},"prevInTopic":48636,"nextInTopic":48639,"prevInTime":48637,"nextInTime":48639,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... enjoy that seems to resonate much stronger than the part that says but I can t right this second - though I promise I will, as soon as I can. I think","messageBody":"<div id=\"ygrps-yiv-1838741337\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;The sentiment of &quot;I would love to fulfill your wish so you could <br/>\n </span></blockquote>enjoy that&quot; seems to resonate much stronger than the part that says &quot;but <br/>\nI can&#39;t right this second - though I promise I will, as soon as I can.&quot; <br/>\nI think maybe because the validation of his needs/wants as important is <br/>\nat least as important to him as getting the thing he&#39;s wanting at the <br/>\nmoment. &lt;&lt;&lt;<br/>\n<br/>\nI think this is true - as far as it goes. Can&#39;t tell from what you <br/>\nwrote, but there might be more interaction in terms of figuring out <br/>\ntogether whether there is something else he&#39;d like to give up in order <br/>\nto save more quickly for this.  But, yes, this sounds good - it sounds <br/>\nlike trying to find a way to honestly say yes more, as opposed to <br/>\nsomeone who, for example, says, &quot;No way, I&#39;m not spending that much <br/>\nmoney on that.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In my experience, though, this comes with a caveat. You can&#39;t say this and not mean it wholeheartedly. You can&#39;t say this and then go buy xyz luxury for yourself or someone else (even the kid in question), that costs as much as what the kid wanted.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Very true. And, if you do mean it, you&#39;ll also mean that you&#39;re open to <br/>\nhis input and ideas of ways to get it or to accomplish the same thing <br/>\nwithout the big expense. It promises creativity in trying to figure out <br/>\nways to get him what he wants, too.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have read elsewhere that the unschooling idea of &quot;saying something like yes&quot; aka &quot;but I will as soon as possible&quot; instead of yes is a clever way of saying no which &quot;proves&quot; parents have to say no sometimes.<br/>\n<br/>\n </span></blockquote>You&#39;ve misunderstood the advice. The advice is to say yes as often as <br/>\nyou can - not to arbitrarily say no. But if a kid is asking to buy <br/>\nsomething, how is &quot;I will as soon as possible&quot; the same as &quot;no?&quot;  Say it <br/>\nout loud - &quot;No, I will as soon as possible&quot; doesn&#39;t even make sense. <br/>\n&quot;Yes, I will as soon as possible,&quot; does make sense.<br/>\n<br/>\nUnless - you thought the advice was, &quot;Say yes IMMEDIATELY to everything <br/>\na child asks for the minute they ask for it even if you have to spend <br/>\nyour rent money so you&#39;ll end up homeless because of it.&quot;<br/>\n<br/>\nSeriously - do you think we&#39;re stupid? &lt;G&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I think that is a myopic view of the parent-child relationship. It&#39;s &quot;no&quot; only in the ver short-term - even toddlers can grasp that when said sincerely, it&#39;s a yes in the long term.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Toddlers will grow into children who trust their parents IF the parents <br/>\ncarry through on what they say.<br/>\n<br/>\nBut, stand in the grocery store and watch parents at the check stand <br/>\nwith their kids. You will see them  slap their kids hands away from the <br/>\ncandy that costs less than a dollar, or say, &quot;No, and stop asking!&quot; and <br/>\nyou&#39;ll see things like a case of beer in their cart (which I&#39;m pretty <br/>\nsure is for them, not their kids).<br/>\n<br/>\nNot sure why, but you sound like you&#39;re arguing against our advice and <br/>\nthen giving the same advice, but with a slightly more negative spin on <br/>\nit. Seems like it bothers you that you can&#39;t give your kid everything he <br/>\nwants the instant he wants it --- but that isn&#39;t what we&#39;re <br/>\nrecommending, that would be silly, very few people live without any <br/>\nbudget constraint and, as far as I know, Bill and Linda Gates are not <br/>\nreading this list &lt;G&gt;.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258403724","msgId":48636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFQUQ0NTMwLUZCMTYtNDkzRC05MzFGLTlDNTk1OThGRjM3RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhkcWxsNitsNWYzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhkcWxsNitsNWYzQGVHcm91cHMuY29tPg=="},"prevInTopic":48632,"nextInTopic":48638,"prevInTime":48635,"nextInTime":48637,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"-=-I have read elsewhere that the unschooling idea of saying something like yes aka but I will as soon as possible instead of yes is a clever way of saying","messageBody":"<div id=\"ygrps-yiv-546089927\">-=-I have read elsewhere that the unschooling idea of &quot;saying  <br/>\nsomething like yes&quot; aka &quot;but I will as soon as possible&quot; instead of  <br/>\nyes is a clever way of saying no which &quot;proves&quot; parents have to say no  <br/>\nsometimes.-=-<br/>\n<br/>\nPeople will find ways to complain about what unschoolers advise no  <br/>\nmatter what, it seems.<br/>\nSome people will cling to their cynicism no matter how many others  <br/>\naround them discover the poison that cynicism is to relationships and  <br/>\njoy.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414609447,"authorName":"flhomeschooling","from":"&quot;flhomeschooling&quot; &lt;andreavlarosa@...&gt;","profile":"flhomeschooling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258346982","msgId":48632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkcWxsNitsNWYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU3NjQ3REFBMTcwRTQ0NzE4MDNFMEU0NzAzNzRCMTc3QEVkUEM+"},"prevInTopic":48630,"nextInTopic":48636,"prevInTime":48631,"nextInTime":48633,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"I m a single parent who lives on a relatively strict fixed budget. We get enough child support for rent and utilities and that s it. I work part time for","messageBody":"<div id=\"ygrps-yiv-1552318708\">I&#39;m a single parent who lives on a relatively strict fixed budget. We get enough child support for rent and utilities and that&#39;s it. I work part time for everything else. We live in a tiny 1BR apartment in a bad neighborhood (working on upgrading this but for now...) and we can&#39;t afford a lot of &quot;luxuries.&quot; In fact, technically, my income is below the poverty line in the US.<br/>\n<br/>\nMy kid is heavy into technology and the things he wants are seriously expensive - he wants to learn digital filmmaking, for example. I don&#39;t usually have a lot of money to spend on vacations, outings, possessions. He knows we&#39;re not rich, but he has no idea we&#39;re everyone&#39;s idea of poor.<br/>\n<br/>\nThe fact is, even very young children can understand the concept of &quot;I would love to buy that for you RIGHT NOW, but it&#39;s going to have to wait until payday/ Christmas/ your birthday/ you ask grandma/ whatever.&quot; My son is about to turn 12 and he has always seemed to appreciate the sentiment that Mom would love to buy what he wants, too, but she has finite amounts of money and sometimes there is a delay. The sentiment of &quot;I would love to fulfill your wish so you could enjoy that&quot; seems to resonate much stronger than the part that says &quot;but I can&#39;t right this second - though I promise I will, as soon as I can.&quot; I think maybe because the validation of his needs/wants as important is at least as important to him as getting the thing he&#39;s wanting at the moment. <br/>\n<br/>\nIn my experience, though, this comes with a caveat. You can&#39;t say this and not mean it wholeheartedly. You can&#39;t say this and then go buy xyz luxury for yourself or someone else (even the kid in question), that costs as much as what the kid wanted. This makes &quot;I would LOVE to!&quot; a lie. You would not love to, you would prefer to get yourself a really nice haircut or the family a new TV or a vacation to Disneyworld or whatever instead. Children notice this discrepancy, and it will damage your relationship and trust with your child. <br/>\n<br/>\nWhat else is my money for if not for enabling happiness, security and good times for my family? This doesn&#39;t mean we live like millionaires. We live extremely humble lives. We pay our bills and then whatever&#39;s leftover the two of us spend in ways that make us happy. And what makes him happy makes me happy. I work hard at letting my kid know that if he wants something, he can tell me, and we can see what we can do about getting it for him somehow or another. I see that he trusts with absolute certainty that &quot;I can&#39;t right now but I will ASAP&quot; coming from me is true. <br/>\n<br/>\nI have read elsewhere that the unschooling idea of &quot;saying something like yes&quot; aka &quot;but I will as soon as possible&quot; instead of yes is a clever way of saying no which &quot;proves&quot; parents have to say no sometimes. But I think that is a myopic view of the parent-child relationship. It&#39;s &quot;no&quot; only in the ver short-term - even toddlers can grasp that when said sincerely, it&#39;s a yes in the long term. <br/>\n<br/>\nAndrea in Miami</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258315848","msgId":48630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NjQ3REFBMTcwRTQ0NzE4MDNFMEU0NzAzNzRCMTc3QEVkUEM+","inReplyToHeader":"PGhkcGVhbStxc3VtQGVHcm91cHMuY29tPg==","referencesHeader":"PGhkcGVhbStxc3VtQGVHcm91cHMuY29tPg=="},"prevInTopic":48628,"nextInTopic":48632,"prevInTime":48629,"nextInTime":48631,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"Probably the most / best something there is in life. Lately Zac (15) has taken it on to saving his favorite Looney Toons cartoons that he finds on-line while","messageBody":"<div id=\"ygrps-yiv-260117047\">Probably the most / best something there is in life.  <br/>\n<br/>\nLately Zac (15) has taken it on to saving his favorite Looney Toons cartoons that he finds on-line while I&#39;m not available (either at work or asleep) and then will show them to me here and there.  It&#39;s a connection - he has come up with a way (another way) to connect with me.  We&#39;ve had some good connections and laughs over the past couple of weeks.  I remember his first exposure to opera was through Looney Toons when he was about 3 or 5.  Looney Toons has fun with parodies of opera, classical piano, and various movies of old.  We watched a Loony Toons parody of Casablanca the other day.<br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: lalow66 <br/>\n<br/>\n  But they have also spent many hours bonding and laughing with each other and my husband and I. And I think that is something.<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258306710","msgId":48628,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkcGVhbStxc3VtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk0OTBCRTlDMEZGMjQzMTc4RjNFRDlFQUI4MUMzNjRGQEVkUEM+"},"prevInTopic":48626,"nextInTopic":48630,"prevInTime":48627,"nextInTime":48629,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... The other week while the kids were playing dodgeball at a homeschool get together I listened for several minutes to another mother talk  about her views on","messageBody":"<div id=\"ygrps-yiv-1585951703\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; TV / media has opened the world up to more people - people that don&#39;t read so well or do not enjoy reading.  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>The other week while the kids were playing dodgeball at a homeschool get together I listened for several minutes to another mother talk  about her views on the &quot;junk&quot; on t.v (SpongeBob in particular) She was saying when their tv broke they would not be replacing it. since the switchover to digital they dont even get PBS anymore anyway.  But as she talked I started thinking about Spongebob and how much joy that silly sponge has brought our family and for that reason ALONE he isnt junk.  Honestly, I think my kids have learned alot about loyalty, friendship, humor, sea creatures, etc.. etc.. from SpongeBob.  But they have also spent many hours bonding and laughing with each other and my husband and I.  And I think that is something.</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258304569","msgId":48626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0OTBCRTlDMEZGMjQzMTc4RjNFRDlFQUI4MUMzNjRGQEVkUEM+","inReplyToHeader":"PDBCNUE5NEI4LTgzOTgtNDE4Ni1BQzc4LUU3NDhGRjRDQkQ0MkB2ZXJpem9uLm5ldD4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4gPDIxMjIxMC42MDAxMi5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPiA8NEFGRjM4MDQuMTA5MDUwNUBtYWMuY29tPiA8MEI1QTk0QjgtODM5OC00MTg2LUFDNzgtRTc0OEZGNENCRDQyQHZlcml6b24ubmV0Pg=="},"prevInTopic":48625,"nextInTopic":48628,"prevInTime":48625,"nextInTime":48627,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"on TV and books and entertainment I love to read, however I read various types of books / materials.  Same as with TV / media.  Sometimes I am interested in","messageBody":"<div id=\"ygrps-yiv-1640112128\">on TV and books and entertainment<br/>\n<br/>\n<br/>\nI love to read, however I read various types of books / materials.  Same as with TV / media.  Sometimes I am interested in learning and sometimes it is pure entertainment/relaxation.<br/>\n<br/>\nPeople used to sit on their front porches in a swing at the end of a long day - pure relaxation - I remember those days.  Many people glorify those days, but how is relaxing in a swing any better than relaxing in front of a TV?  We lived on a farm so we did not greet people as they passed by.<br/>\n<br/>\nTV / media has opened the world up to more people - people that don&#39;t read so well or do not enjoy reading.  <br/>\n<br/>\nI have two sisters that do not enjoy reading books, they read just fine, they just do not enjoy reading books.  One is an RN and the other is an Architect - my brother only reads books that will help him in his business.  I read a wide variety of books from romance novels to Smithsonian magazine and informational books - I&#39;ll read just about anything.  Reading is my escape mechanisim.<br/>\n<br/>\nZac is 15 and does not read huge thick books, magazines, nor the news paper (he does enjoy manga books) BUT he will watch TV / media sources and has learned an enormous amount of information - a variety of information about the world he lives in through TV and the internet.<br/>\n<br/>\nOn any given day he might watch The History Channel, The Military Channel, The Comedy Channel, National Geographic, NICK, Disney, SciFi channel, well just about anything to be honest.  Lately he has been watching stuff on-line.  He has found old TV shows like ALF, Hogan&#39;s Heroes, MASH, old Looney Toons - which by the way has a ton of history in them,   We have had some great discussions about social history / history due to these old shows. In fact, much of what he knows cannot be learned from a still life book - but can be learned from film - moving pictures - recorded movements and voices.<br/>\n<br/>\nFor example: seeing and hearing Martin Luther King Jr give his speech is much more powerful than reading about it.  Seeing Bugs Bunny in an old WWII cartoon is much more informational than reading about it - or looking at the stills.  Watching old news reels is great for learning history.  I&#39;m not bashing books as I love love love books myself BUT film is so important to our learning and living in the world.<br/>\n<br/>\nWe have Cable TV because of where we live.  We live near a radio tower so it interferes with our reception - we receive no channels at all, no radio either.  Cable TV is worth the investment - same for our internet.<br/>\n<br/>\nWhen we purchased our vehicle last spring it came with XM radio - at the time I thought &quot;now why would anyone pay for satellite radio when you can get local stations for free?&quot;  however - our free subscription is almost up and now I&#39;m thinking I&#39;ll renew it and here&#39;s why:  Zac has been learning all about various types of music.  Right now he is into 40&#39;s swing music.  He never would have come across it if it had not been for an XM station that plays nothing but 40&#39;s - there are stations for each decade and he loves trying them out.  This is a natural flowing of learning / living for him.  The XM radio stations have expanded his world/history/enjoyment/etc.<br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258296665","msgId":48625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBCNUE5NEI4LTgzOTgtNDE4Ni1BQzc4LUU3NDhGRjRDQkQ0MkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDRBRkYzODA0LjEwOTA1MDVAbWFjLmNvbT4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4gPDIxMjIxMC42MDAxMi5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPiA8NEFGRjM4MDQuMTA5MDUwNUBtYWMuY29tPg=="},"prevInTopic":48616,"nextInTopic":48626,"prevInTime":48624,"nextInTime":48626,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... It s like saying books are stupid or music is stupid because someone doesn t find chunks of it appealing. TV is as varied as Pride and Prejudice (with or","messageBody":"<div id=\"ygrps-yiv-1584417381\">On Nov 14, 2009, at 6:06 PM, Pam Sorooshian wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just don&#39;t buy that &quot;TV is stupid&quot; and I&#39;m tempted to say that  <br/>\n&gt; people<br/>\n&gt; who think TV is stupid are themselves, well...my ending is as<br/>\n&gt; predictable as &quot;The Office&quot; is not. &lt;g&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s like saying books are stupid or music is stupid because someone  <br/>\ndoesn&#39;t find chunks of it appealing.<br/>\n<br/>\nTV is as varied as Pride and Prejudice (with or without Zombies!),  <br/>\nCaptain Underpants, The Joy of Cooking and The Bible; as varied a  <br/>\nBeethoven&#39;s Symphony No. 7, Butthole Surfers, Robert Johnson&#39;s blues  <br/>\nand the soundtrack from Rent.<br/>\n<br/>\nAnd a mother who condemns books based on a few or even several dozen  <br/>\nshe finds poorly written is going to whittle away her relationship  <br/>\nwith her kids if she uses that as reasoning why her kids won&#39;t find  <br/>\nHarry Potter books worthwhile.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258254706","msgId":48616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyNDY1NUY4LTRBQjYtNEY5OC04NjFGLTE3Q0I4OUI2RjQxM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUwMjgzNS40MjM1OS5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4gPDIxMjIxMC42MDAxMi5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPiA8NEFGRjM4MDQuMTA5MDUwNUBtYWMuY29tPiA8NTAyODM1LjQyMzU5LnFtQHdlYjExMDQwNi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":48614,"nextInTopic":48625,"prevInTime":48615,"nextInTime":48617,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"My whole week has been nearly TV-free.  I did watch CBS Sunday Morning.  I missed House and The Big Bang Theory on Monday, because Hema, Ravi & family were","messageBody":"<div id=\"ygrps-yiv-918277474\">My whole week has been nearly TV-free.  I did watch CBS Sunday  <br/>\nMorning.  I missed House and The Big Bang Theory on Monday, because  <br/>\nHema, Ravi & family were here.   Then we had three days of monkey- <br/>\nplatter and company.  One night Raghu watched Mary Poppins, so I saw a  <br/>\nlittle of that in passing.  I watched the weather one night because  <br/>\nKeith had gone to talk to Holly and I paid attention to the weather so  <br/>\nI could tell him what they said.<br/>\n<br/>\nThat&#39;s it.  It&#39;s Saturday.   I hope I can find those two I missed, but  <br/>\nI have company until midday Monday (Hema&#39;s family is in Santa Fe, but  <br/>\nthey&#39;ll be back at noon tomorrow and we have more people coming over  <br/>\nat 1:00).<br/>\n<br/>\nI love this week but it&#39;s been exhausting.  Photos are being gathered  <br/>\nhere:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://monkeyplatterfestival.blogspot.com/\">http://monkeyplatterfestival.blogspot.com/</a><br/>\n<br/>\nSome weeks running around with people is the greatest possible thing;  <br/>\nsometimes sitting in front of a fire, wrapped in a blanket, watching  <br/>\nTV, is perfect.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258245713","msgId":48614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkbmlvaCtsMWp1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48612,"nextInTopic":48616,"prevInTime":48613,"nextInTime":48615,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... I see this as a very important statement.  Why is it our money?  Because the parents earned it?  On that technicality, are my opinions not important","messageBody":"<div id=\"ygrps-yiv-670716887\"><blockquote><span title=\"ireply\">&gt; Do we get to choose how to spend our money?  Or do the children<br/>\n&gt; get a say in it? <br/>\n<br/>\n </span></blockquote>I see this as a very important statement.  Why is it &quot;our&quot; money?  Because the parents earned it?  On that technicality, are my opinions not important because my husband has the money-earning job and I don&#39;t earn a salary?  Is it the attitude that only an adult knows how to spend money wisely?  (My 11 yr. old daughter has more money in her wallet than I do in mine!)<br/>\n<br/>\nI can see a certain amount of money is needed for important obligations such as mortgage/rent, utilities and food.  Even my children understand that.  I don&#39;t see why other money can&#39;t be used for everyone in the family rather than just the parents.  It reminds me of the seagulls in the movie Finding Nemo that squawk Mine, Mine, Mine!<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258241443","msgId":48612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMjgzNS40MjM1OS5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRBRkYzODA0LjEwOTA1MDVAbWFjLmNvbT4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4gPDIxMjIxMC42MDAxMi5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPiA8NEFGRjM4MDQuMTA5MDUwNUBtYWMuY29tPg=="},"prevInTopic":48611,"nextInTopic":48614,"prevInTime":48611,"nextInTime":48613,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"...   Wait!  I didn t say that!  I love tv!  ***There is WAY too much fantastic stuff on tv for us to find time to watch as much as we d like.***   This","messageBody":"<div id=\"ygrps-yiv-2042636599\">***On 11/14/2009 12:10 PM, Jenny Cyphers wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have started to get sick of the stupid plots that never end,***<br/>\n </span></blockquote> <br/>\nWait!  I didn&#39;t say that!  I love tv!  <br/>\n<br/>\n***There is WAY too much fantastic <br/>\nstuff on tv for us to find time to watch as much as we&#39;d like.***<br/>\n <br/>\nThis is how I feel when adding things to my netflix queue.  I don&#39;t think I&#39;ll ever get caught up with my queue, if I ever do.  I love that I have an abundance of cool stuff waiting for me to see.  Margaux has been watching lots of things via netflix.  <br/>\n <br/>\nYesterday though, she watched regular tv.  She watched a show about giant squid and whales and one about sharks, then she watched a bunch of Cash Cab, which is a great trivia show, then some South Park.  Today she&#39;s been in the tub for a couple of hours reliving giant squid, whales and sharks, and you can tell that she learned a huge amount about ocean life because of the things she&#39;s saying in her play.  She&#39;s discovering all kinds of things about life in her very very long bath.  It&#39;s been a very tv inspired bath!<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258240004","msgId":48611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBRkYzODA0LjEwOTA1MDVAbWFjLmNvbT4=","inReplyToHeader":"PDIxMjIxMC42MDAxMi5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4gPDIxMjIxMC42MDAxMi5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":48610,"nextInTopic":48612,"prevInTime":48610,"nextInTime":48612,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... The Office, Project Runway, Nova, Mad Men, Colbert Report, Daily Show, the Simpsons, West Wing, How I Met Your Mother, Lost, Dexter -- all shows we ve","messageBody":"<div id=\"ygrps-yiv-2050781826\">On 11/14/2009 12:10 PM, Jenny Cyphers wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have started to get sick of the stupid plots that never end,<br/>\n<br/>\n </span></blockquote>The Office, Project Runway, Nova, Mad Men, Colbert Report, Daily Show, <br/>\nthe Simpsons, West Wing, How I Met Your Mother, Lost, Dexter -- all <br/>\nshows we&#39;ve watched in the last couple of weeks (some on DVD of course). <br/>\nI cannot for the life of me imagine how anybody with half a brain can <br/>\nsay tv is nothing but stupid plots. There is WAY too much fantastic <br/>\nstuff on tv for us to find time to watch as much as we&#39;d like.<br/>\n<br/>\nI just don&#39;t buy that &quot;TV is stupid&quot; and I&#39;m tempted to say that people <br/>\nwho think TV is stupid are themselves, well...my ending is as <br/>\npredictable as &quot;The Office&quot; is not. &lt;g&gt;</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258239591","msgId":48610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBRkYzNjY3LjUwNTA0MDNAbWFjLmNvbT4=","inReplyToHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48609,"nextInTopic":48611,"prevInTime":48609,"nextInTime":48611,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... My friend, who had known my family for many years, asked me: I just don t see how you afford to buy every videogame that comes out.  I didn t even know","messageBody":"<div id=\"ygrps-yiv-289578306\">On 11/14/2009 11:07 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; -I think my question is, as a radical unschooler, allowing children<br/>\n&gt; to make their own choices - are parents then obligated to provide<br/>\n&gt; access to everything a child might want?<br/>\n<br/>\n </span></blockquote>My friend, who had known my family for many years, asked me: &quot;I just <br/>\ndon&#39;t see how you afford to buy every videogame that comes out.&quot;  I <br/>\ndidn&#39;t even know how to answer - except, &quot;Huh?&quot;  Finally, &quot;I don&#39;t know <br/>\nwhat you mean, we don&#39;t buy every video game that comes out.&quot;<br/>\n<br/>\nAfter we talked a bit, it became apparent that &quot;unlimited video games&quot; <br/>\nhad translated into spending terms in her mind - she thought it meant <br/>\nthat we always bought every video game the kids took even a passing <br/>\nfancy to - immediately.<br/>\n<br/>\nRosie was with me during this conversation and she understood what my <br/>\nfriend meant - before I did. She said, &quot;I buy most of my own games with <br/>\nmy own money.&quot; My friend looked over and said, accusingly, &quot;But you <br/>\nalways say you allow unlimited video games.&quot; I said, &quot;We don&#39;t restrict <br/>\nvideo games.&quot; There was some more conversation and she finally got it. <br/>\nBut, for YEARS she had thought that I mean that we immediately went out <br/>\nand purchased every new game that any of the kids had the slightest <br/>\ndesire for.<br/>\n<br/>\nProvide access to as much of the world as you can. See your children&#39;s <br/>\ninterests as being as important as the parents. If a parent &quot;needs&quot; <br/>\ncoffee and donuts in the morning, then maybe a child &quot;needs&quot; candy in <br/>\nthe same way.<br/>\n<br/>\nFind ways to provide as much to your children as you can - material <br/>\ngoods are cool, and so are experiences including fun family times and <br/>\ndeep conversations and getting out into nature and visiting cities and <br/>\non and on.<br/>\n<br/>\nAnybody who is into giving excuses about why they can&#39;t provide what <br/>\ntheir children want is missing the point of unschooling. None of us can <br/>\nprovide everything, human wants are unlimited. We sent our daughter to <br/>\nParis for 3 months - she&#39;d have liked our whole family to have gone and <br/>\nspent a whole year. It doesn&#39;t matter how much you spend, people can <br/>\nfind even more cool things on which to spend more and more. Unschooling <br/>\nparents will do what they can with what they have. When my kids were <br/>\nlittle and we had a lot less money, we&#39;d just go for a walk and see <br/>\ninteresting things. We&#39;d watch the workers at a construction site and <br/>\npick up leaves and splash in puddles. We spent long long days at the <br/>\nbeach or at a park. If we wanted to buy something that we didn&#39;t have <br/>\nthe money for, we&#39;d save together, as a family.<br/>\n<br/>\nWe should be honest about what we can afford - honest with ourselves and <br/>\nour kids. It is hypocritical to say we can&#39;t afford candy if we&#39;re <br/>\nbuying coffee and donuts. But we don&#39;t need a lot of money to be really <br/>\ngreat unschoolers - we just need to be interested in the world, see it <br/>\nas a big giant museum of everything.<br/>\n<br/>\n<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258238640","msgId":48609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBRkYzMkIwLjkwNzA3QG1hYy5jb20+","inReplyToHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48608,"nextInTopic":48610,"prevInTime":48608,"nextInTime":48610,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"... If that was true, then there wouldn t even be a question about it. I don t have to say, We don t like sushi around, we don t like it, because it is TRUE","messageBody":"<div id=\"ygrps-yiv-123133335\">On 11/14/2009 11:07 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; We don&#39;t want television around, we don&#39;t like it. -=-<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>If that was true, then there wouldn&#39;t even be a question about it. I <br/>\ndon&#39;t have to say, &quot;We don&#39;t like sushi around, we don&#39;t like it,&quot; <br/>\nbecause it is TRUE that nobody here likes it so it simply isn&#39;t a <br/>\nquestion we need to consider.<br/>\n<br/>\nIf nobody liked tv and nobody wanted it around - a tv would just sit <br/>\nthee, unused and ignored.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258231687","msgId":48608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3ODE2RDNDLUQ2MkQtNEQ1NS1CNURDLUE5OEVCRDMyNEU0MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48607,"nextInTopic":48609,"prevInTime":48607,"nextInTime":48609,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"-=-I think my question is, as a radical unschooler, allowing children to make their own choices - are parents then obligated to provide access to everything a","messageBody":"<div id=\"ygrps-yiv-1269397772\">-=-I think my question is, as a radical unschooler, allowing children  <br/>\nto make their own choices - are parents then obligated to provide  <br/>\naccess to everything a child might want?  Television, video games,  <br/>\njunk food, toys, branded clothing?  Do we get to choose how to spend  <br/>\nour money?  Or do the children get a say in it?  At what age do what  <br/>\nchoices apply?  When financial reality means wearing hand-me-downs,  <br/>\nthrift store finds, choosing the most nutrition for the least bucks,  <br/>\nforgoing all except the essential utilities (electric, heat, water,  <br/>\nbut no cell phones, cable tv, etc although we do have internet).-=-<br/>\n<br/>\nIt&#39;s not about providing &quot;access to everything a child might want.&quot;   <br/>\nNo one can do that.  It&#39;s about finding ways to respect what your  <br/>\nchildren want.<br/>\nhttp://sandradodd/gradualchange<br/>\nhttp://sandradodd.com/yes<br/>\n<br/>\nA question like this sounds to me like a challenge, or an insult, to  <br/>\nunschoolers:  &quot;Do we get to choose how to spend our money? &quot;<br/>\n<br/>\nYes.  You can choose to spend your money on drugs or health food or  <br/>\nbooks that tell you you and your children were reincarnated from  <br/>\nwhatever tickles your fancy.<br/>\n<br/>\n-=-Or do the children get a say in it? -=-<br/>\n<br/>\nWe&#39;re not telling you how to raise your kids.<br/>\nWe&#39;re telling you how we&#39;re raising our kids.<br/>\nI&#39;m telling people who have met my kids (now 18, 20 and 23) what I&#39;ve  <br/>\ndone for the past 23 years which led to them being the way they are  <br/>\nnow, and how they&#39;ve been all their lives.<br/>\n<br/>\nYou don&#39;t have to give your children a say in ANYthing, ever.  Never.<br/>\nThe result of that would probably be that you had children who lied  <br/>\nand stole from you, or ran away, or killed themselves, or who decided  <br/>\nto roll over and go with it, and then would become controlling of  <br/>\ntheir own children (and friends, and neighbors, and strangers).   <br/>\nThat&#39;s what I think, anyway.  That&#39;s what I&#39;ve seen in my life.<br/>\n<br/>\nWill it hurt me if someone comes by and says &quot;I don&#39;t care what you&#39;ve  <br/>\nseen in your life&quot;?   Not at all.<br/>\nWill it hurt someone&#39;s children for her to come to unschoolers to  <br/>\nchallenge and reject them?  Very likely.<br/>\n<br/>\nI was told the other day that on another list someone has come who was  <br/>\nin years past very critical of me by name, and of my suggestions in  <br/>\nparticular.  Dismissive.  Now she&#39;s having trouble with her teens.   I  <br/>\ndon&#39;t have trouble with my teens.  Did her dismissiveness hurt my  <br/>\nfamily?  Not at all.<br/>\n<br/>\n-=-  At what age do what choices apply? -=-<br/>\n<br/>\nWhen Kirby was born I would put him down if he seemed uncomfortable.   <br/>\nI would pick him up if he cried.  I would nurse him if he seemed  <br/>\nhungry.  I wouldn&#39;t try to get him to nurse if he turned away or  <br/>\npushed away.<br/>\n<br/>\nYesterday he called to ask what online site I use to book flights.  We  <br/>\ntalked about recipes and money.   I reminded him to see whether his  <br/>\nsuit needed to be cleaned before the company party.  He said he loaned  <br/>\nhis roommate money to go to a family reunion in New York (from Texas)  <br/>\nbecause the roommate had spent $1000 when the dog was bitten by a  <br/>\nsnake.   Even though he&#39;s in a position to make his own choices  <br/>\nentirely now, he still trusts me to advise him, and I trust him to  <br/>\nhave enough money to lend to his roommate and fly his girlfriend in  <br/>\nfor a party.   That relationship started when I picked him up when he  <br/>\ncried.<br/>\n<br/>\nTo ask &quot;At what age to what choices apply&quot; seems to request a number,  <br/>\nlike &quot;6&quot; or &quot;12.&quot;  It&#39;s not at all about &quot;what age,&quot; or &quot;what  <br/>\nchoices.&quot;  It&#39;s about a relationship built on an every-building  <br/>\npartnership of acceptance and respect.<br/>\n<br/>\n-=-When financial reality means wearing hand-me-downs, thrift store  <br/>\nfinds, choosing the most nutrition for the least bucks, forgoing all  <br/>\nexcept the essential utilities (electric, heat, water, but no cell  <br/>\nphones, cable tv, etc although we do have internet).-=-<br/>\n<br/>\nMy kids LOVE thrift store clothes and toys; always have.  Most of our  <br/>\ntowels and bedding and dishes and cookware are from thrift stores.  We  <br/>\ngot cell phones in the past three years.  Kirby had one longer  <br/>\n(through a friend who worked for T-Mobile).  Keith still doesn&#39;t have  <br/>\none.  It was a choice for each person separately.  Marty helped us pay  <br/>\nfor his, at first,  and recently when he expressed surprise that Holly  <br/>\nwasn&#39;t paying for hers and he was, Keith stopped charging Marty  <br/>\nanymore.  We&#39;ve never had cable TV.<br/>\n<br/>\nWhen Kirby was young we were pretty poor.  Now that they&#39;re  <br/>\npractically all grown, we have enough money to have three kids  <br/>\ncomfortably. :-)  But when we didn&#39;t have much money, we tried to  <br/>\nprovide first for the child who was neediest or whose next desire was  <br/>\nmost expensive.  That&#39;s hard to describe.  But because it happened so  <br/>\nnaturally and freely, all the kids knew that maybe on Marty&#39;s birthday  <br/>\nhe was going to get a big gift, because there was something he needed  <br/>\nespecially.   Hockey equipment, once.  And now he gave it to the  <br/>\nthrift store the other day (11 years later).   On the Christmas that  <br/>\nMarty and Holly got laptops, Kirby got trinkets and homemade cookies.   <br/>\nOn a Christmas when Kirby got a Gamecube and a bunch of extra  <br/>\ncontrollers and games, Marty and Holly didn&#39;t get such glorious gifts,  <br/>\nbut they knew they would get to play the Gamecube, and they knew that  <br/>\none of the next few times it would be one of them getting the big gift.<br/>\n<br/>\nIt&#39;s possible to bring children into the parents lives so wholly that  <br/>\nthose decisions can be made generously, and not resentfully, and  <br/>\naccepted gratefully and not jealously, by all the children.<br/>\n<br/>\nWe got along when we only had one computer, and when we had two, and  <br/>\nnow that we have more computers than family members, we still get  <br/>\nalong well.<br/>\n<br/>\nIf a family insisted on only having one computer or one TV (or none)  <br/>\nor one gaming system or one bicycle even though they could afford  <br/>\nmore, or their children would be happier with more (and they had the  <br/>\noption to provide), I think that would be a &quot;getting cold&quot; decision,  <br/>\nnot a &quot;getting warm&quot; decision as regards unschooling.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258229440","msgId":48607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxMjIxMC42MDAxMi5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48606,"nextInTopic":48608,"prevInTime":48606,"nextInTime":48608,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"-=-I have started to get sick of the stupid plots that never end, so I guess the gorge until you are sick of it and then find balance is slowly applying to me.","messageBody":"<div id=\"ygrps-yiv-1335102990\">-=-I have started to get sick of the stupid plots that never end, so I <br/>\nguess the gorge until you are sick of it and then find balance is <br/>\nslowly applying to me. But, we just don&#39;t want to have a television; <br/>\nspend money on one, have one around, etc. The same is for junk food. - <br/>\n=-<br/>\n<br/>\nTV&#39;s can be had for very cheap.  It doesn&#39;t cost a lot, unless you live very remotely and need a dish to get channels, and even those aren&#39;t super expensive anymore.  There are also things like netflix, which has been one of the best investments for our family.  We can watch a ton of things instantly through our computer and we get a few discs in the mail.  We have a computer set up connected to the tv to watch that way.<br/>\n<br/>\n-=- I want to buy food that is good for us and makes us feel full and <br/>\nsatisfied, and we have limited funds to buy that food. And also, <br/>\nwhenever she eats candy, my daughter&#39;s eczema flairs up and she gets a <br/>\nrash, so I&#39;ve said that she&#39;s allergic to it. -=-<br/>\n<br/>\nWe have limited funds too, everyone does.  Within that limitation we get to choose what to spend our limited funs on.  With my limited funds yesterday, I bought chocolate chips and butterscotch chips for making cookies.  Not having tons of money to buy food doesn&#39;t mean you have to completely go without.  I make sure that I have candy here for my daughter that really loves it.  If I have to choose between buying candy or my expensive gluten free waffles, my breakfast of choice, I&#39;ll buy the candy and go without my favorite breakfast.  If I can justify buying something expensive and not necessary, then I can&#39;t justify saying that I can&#39;t afford candy.  <br/>\n<br/>\n-=-I think my question is, as a radical unschooler, allowing children <br/>\nto make their own choices - are parents then obligated to provide <br/>\naccess to everything a child might want? Television, video games, <br/>\njunk food, toys, branded clothing? Do we get to choose how to spend <br/>\nour money? Or do the children get a say in it? At what age do what <br/>\nchoices apply? When financial reality means wearing hand-me-downs, <br/>\nthrift store finds, choosing the most nutrition for the least bucks, <br/>\nforgoing all except the essential utilities (electric, heat, water, <br/>\nbut no cell phones, cable tv, etc although we do have internet).-= -<br/>\n<br/>\nWhat&#39;s essential to one family is going to look different from what&#39;s essential to another family.  Our cell phones are essential.  We don&#39;t have a land line, and haven&#39;t had one for almost 10 yrs.  My husband is out and about a lot and needs to receive business calls.  Internet is essential in our house.  It is the single most important tool we use for unschooling and living in general.  Almost everything we own is second hand, even our tvs and computers.<br/>\n<br/>\nSomething that I choose to spend money on right now, is gas.  My oldest daughter has a boyfriend who she has limited access to, so I do whatever I can for them to see each other, even if that means picking him up from school.  I don&#39;t know any other parent, aside from other unschooling parents, that would go out of their way like that.  Unschooling means that a parent needs to extend themselves in every way possible to help create more opportunities, not less.  By placing limits on your life, you&#39;ll feel limited and your kids will feel limited.  That&#39;s not very life expanding.  Even in the face of difficulties, like little money, I want to feel as if I have enough and I want my kids to feel like they have more than enough.  As my husband says, it&#39;s the difference between living life in abundance or living life in lack.  We get to choose how we view the world and present it to our kids.<br/>\n<br/>\nIf your kids were in school there would time commitments and monetary ones.  School supplies, back packs, lunches, fund raisers, volunteer time.  Where we live, high school students have to pay for a lot of their classes per term and some of them are required to graduate.  Depending on what variety of classes you choose, it could reach up to $600 per term.  It could also be as little as $100.  That&#39;s not cheap.  Nor does it include things like football games, athletics, uniforms, yearbooks, annual pictures, or any other extra curricular activity a child may have.  Lunches are $2.50 each day.  <br/>\n<br/>\nRaising kids costs money.  There is no way around that.  The thing is, you get to make choices in how and what to spend that money on.  If your kids don&#39;t go to school, you have more flexibility in those choices.  <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Question on unschooling, restrictions, financial constraints, etc.","postDate":"1258225659","msgId":48606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1RDNGMzM5LThEMjktNDI2NS1BRjJBLTEyRTUxQjQ5QTk5QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":48607,"prevInTime":48605,"nextInTime":48607,"topicId":48606,"numMessagesInTopic":0,"msgSnippet":"This was a response to an e-mail. I m not quoting the whole original, just a few bits. ===================== -=-.But, I also see other piece of our particular","messageBody":"<div id=\"ygrps-yiv-1399285572\">This was a response to an e-mail. I&#39;m not quoting the whole original,  <br/>\njust a few bits.<br/>\n=====================<br/>\n<br/>\n-=-.But, I also see other piece of our particular family&#39;s reality.   <br/>\nWe don&#39;t want television around, we don&#39;t like it. -=-<br/>\n<br/>\nBe careful to acknowledge your children as individuals and not as part  <br/>\nof the &quot;we.&quot;<br/>\n<br/>\n-=-I have started to get sick of the stupid plots that never end, so I  <br/>\nguess the gorge until you are sick of it and then find balance is  <br/>\nslowly applying to me.  But, we just don&#39;t want to have a television;  <br/>\nspend money on one, have one around, etc.  The same is for junk food. - <br/>\n=-<br/>\n<br/>\nIf you define things as &quot;stupid&quot; and &quot;junk&quot; it will make it harder for  <br/>\nyou to think clearly.<br/>\nIf you tell your children what is &quot;stupid&quot; and &quot;junk&quot; it will make it  <br/>\nharder for them to think clearly, too.<br/>\n<br/>\n-=- I want to buy food that is good for us and makes us feel full and  <br/>\nsatisfied, and we have limited funds to buy that food.  And also,  <br/>\nwhenever she eats candy, my daughter&#39;s eczema flairs up and she gets a  <br/>\nrash, so I&#39;ve said that she&#39;s allergic to it. -=-<br/>\n<br/>\nThe more honest you are, the better for your relationships and your  <br/>\nintegrity.  If you lie about one thing, it&#39;s harder for your children  <br/>\n(or others) to trust your advice or your assertions.<br/>\n<br/>\n-=- We could sacrifice some of our own &#39;perks&#39; and give the kids  <br/>\ntheirs... I could never buy a coffee and donut, and then buy bags of  <br/>\ncandy with that money... but that doesn&#39;t feel right either. -=-<br/>\n<br/>\nMaybe spend some time thinking about that  What *are* your kids  <br/>\n&quot;perqs&quot;?  Are they appendages who do what you say and have what you  <br/>\ngive them?  At three years old, maybe so, mostly.  When are they  <br/>\nindividual people?  How is candy worse than a donut and coffee?    <br/>\n(Don&#39;t write and tell me; think about it yourself.)<br/>\n<br/>\n-=-I hope you don&#39;t mind this email, and have a bit of time to  <br/>\nrespond.-=-<br/>\n<br/>\nIf I write to one person, it doesn&#39;t help anyone else.  If I write to  <br/>\na list, it helps hundreds of people.  Because of that I&#39;m going to  <br/>\ntake this to the Always Learning list.  You can join and see responses  <br/>\nor not, but I don&#39;t want this writing to go into one single place.   <br/>\nIt&#39;s not a good use of my time.<br/>\n<br/>\nThis paragraph is big and important and I think if you read more of  <br/>\nwhat&#39;s already available you&#39;ll find ideas to help you think of them:<br/>\n<br/>\n-=-I think my question is, as a radical unschooler, allowing children  <br/>\nto make their own choices - are parents then obligated to provide  <br/>\naccess to everything a child might want?  Television, video games,  <br/>\njunk food, toys, branded clothing?  Do we get to choose how to spend  <br/>\nour money?  Or do the children get a say in it?  At what age do what  <br/>\nchoices apply?  When financial reality means wearing hand-me-downs,  <br/>\nthrift store finds, choosing the most nutrition for the least bucks,  <br/>\nforgoing all except the essential utilities (electric, heat, water,  <br/>\nbut no cell phones, cable tv, etc although we do have internet).-=-<br/>\nI&#39;ll respond to that on Always Learning, and send you a copy of my  <br/>\nresponse.<br/>\n<br/>\nIf you don&#39;t have time to read about unschooling, you&#39;ll probably come  <br/>\nto a point where you&#39;re not unschooling anymore.  If you had a kid in  <br/>\nschool there would be real time requirements, transportation,  <br/>\nclothing, lunches, fees...  So if you have a child at home you can&#39;t  <br/>\nexpect to invest NO time or money or effort and still succeed.<br/>\n<br/>\nI have a new book, and one older one.  They can&#39;t be ordered together  <br/>\nbecause I&#39;m using flat rate priority mail and the new book is too big  <br/>\nfor both to fit, but this might be helpful to you if you decide you  <br/>\ncan&#39;t invest time learning online:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bigbook\">http://sandradodd.com/bigbook</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/puddle\">http://sandradodd.com/puddle</a><br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":48749,"nextTopicId":48760}}