{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":168437188,"authorName":"Andy Holly Clarke","from":"&quot;Andy Holly Clarke&quot; &lt;ahclarke@...&gt;","profile":"hcac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"planning and living","postDate":"1084896838","msgId":94237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNDEwMWM0M2NmMyQyMDZkYzIwMCQ2NDAxYThjMEB3b3d3YXkuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":94236,"nextInTime":94238,"topicId":94237,"numMessagesInTopic":0,"msgSnippet":"thanks cat for all the good ideas i do have a couple of memberships and one that i need to renew when i can. it does really help to think of the donut.","messageBody":"<div id=\"ygrps-yiv-1548636237\">thanks cat for all the good ideas<br/>\n<br/>\ni do have a couple of memberships and one that i need to renew when i can.<br/>\n<br/>\nit does really help to think of the donut.  especially since that is often how i try to look at &quot;dieting&quot;. i would rather pay more per ounce (or whatever) for a smaller portion so that i don&#39;t consume the extra calories.  <br/>\n<br/>\nany suggestions for travelling?  or just chalk up the spent money as learning whether or not we liked that new experience.  <br/>\n<br/>\ni am really trying to just enjoy being more adventurous.  i guess i just need to give myself time<br/>\n<br/>\nalso, we do just go to the cheap theater now. or try to rent the movie.  <br/>\nrenting is what works best so far, though even with that sometimes it will take a couple of times renting a movie before my kids decide they want to see it all the way through.<br/>\n<br/>\nholly<br/>\n<br/>\nMessage: 10<br/>\n   Date: Mon, 17 May 2004 09:29:50 -0400<br/>\n   From: &quot;catherine aceto&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aceto3@...\">aceto3@...</a>&gt;<br/>\nSubject: Re: planning ; more practically than spirituality<br/>\n<br/>\nHolly writes:  i find i get really stressed out about taking the kids somewhere that you have to pay to go (movies, museums, etc.) and then because they are tired or decide that they aren&#39;t having fun - they want to leave 5min after arriving. <br/>\n<br/>\nMe:<br/>\nCan you get memberships?  Maybe as gifts from family?  Maybe the organization has sliding fees (some institutions do this even though they don&#39;t really advertise it).  Perhaps get memberships to one or two in your area and then go primarily to them. <br/>\n<br/>\nWe have memberships to the local museums and go to the local cheap theater ($1/person).  We do it precisely because it is then so easy to move on to something else if no one is having fun and you don&#39;t feel like you just blew $30 on the 15 minutes that you have been there.  <br/>\n<br/>\nBut without a membership, then I think it&#39;s like the donut example - better in the trash than eaten unwanted.  Cheerfully move on from the experience, or the $30 (already spent) will have been spent to make children&#39;s lives worse instead of better.  Which isn&#39;t to say that I would always, without fail, be able to do that -- but it is my goal, and thinking of it like the donuts helps. <br/>\n<br/>\nAlso the museums around here often have a free day a week or free week once a year.  Or go with a local group at group rates. <br/>\n<br/>\n-Cat <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":94177,"nextTopicId":94239}}