{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":50009731,"authorName":"Heidi Wordhouse-Dykema","from":"Heidi Wordhouse-Dykema &lt;heidi@...&gt;","profile":"heidi_wd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Re: underground/cabins was: Re:  Home-schooling standoff","postDate":"1056556968","msgId":75524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMzA2MjUwODMxMzUuMDIyODgzNDBAbWFpbC5keWtlbWEubmV0Pg==","inReplyToHeader":"PDE0OS4xM2UzYjJlYy4yYzI2MGM5NkBhb2wuY29tPg=="},"prevInTopic":75095,"nextInTopic":0,"prevInTime":75523,"nextInTime":75525,"topicId":75095,"numMessagesInTopic":0,"msgSnippet":"... Yeah!  It can be really pretty.  Our yurt is on a sloping hill and I m about to build the deck to surround it (a big circle around the yurt, of course) and","messageBody":"<div id=\"ygrps-yiv-667065391\"><blockquote><span title=\"ireply\">&gt;(snipped) but DH has been stuck for<br/>\n&gt;years on cord wood. We couldn&#39;t do the stained glass effect on the cabin as<br/>\n&gt;you can&#39;t cut into the logs but for the cord wood you can cut into it and <br/>\n&gt;take<br/>\n&gt;two colored glass bottles end to end, wrap them in aluminum sheeting like a<br/>\n&gt;cylinder and cement them in like log. It&#39;s pretty neat and economical and <br/>\n&gt;looks<br/>\n&gt;like a stained glass window and not glass end bottles!<br/>\n<br/>\n </span></blockquote>Yeah!  It can be really pretty.  Our yurt is on a sloping hill and I&#39;m <br/>\nabout to build the deck to surround it (a big circle around the yurt, of <br/>\ncourse) and then a bathhouse support (coming off the deck on the downhill <br/>\nside).  This means we&#39;ll have maybe 5 feet or so of open space under the <br/>\ndeck on the downhill side at least.  So, I&#39;m going to cordwood and <br/>\nnative-clay-mud-cement under the deck and bathhouse to make an enclosure, <br/>\ncreate a sturdy door with hinges on the inside (for security - backwoods <br/>\nvandals are more common than one would hope for) and store stuff inside, <br/>\nunder the deck.   I&#39;m not sure I&#39;m brave enough to go cutting glass bottles <br/>\nout there to make picture windows, as pretty as it would be.  Do you have <br/>\nan easy way to cut glass bottles?<br/>\n<br/>\nAnyway, there&#39;s a way you could have your yurt and he could have his <br/>\ncordwood!  Yurt up top, cordwood enclosure below.<br/>\n<br/>\nI&#39;m vascillating on whether the bathhouse walls should be strawbale or <br/>\ncordwood.  Cordwood&#39;s cheaper (we have lots of winter deadfall and a brand <br/>\nnew chainsaw!) and would leave slightly more interior space but is also <br/>\nmore work.  Strawbale would be warmer/cooler in winter/summer and it&#39;s less <br/>\nwork, but we&#39;d have to buy the straw and it&#39;d make for a slightly smaller <br/>\ninterior space...   That said, the next two or three years will be spent <br/>\nplanning and then building a strawbale house, so maybe I should get some <br/>\npractice in now.  I&#39;d love your opinions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Once I get a picture, I&#39;ll<br/>\n&gt;pass it on to you.<br/>\n<br/>\n </span></blockquote>Great!  Thanks!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;d say taking all the bark off the logs was the worse!<br/>\n<br/>\n </span></blockquote>I was down at Bailey&#39;s the other day (tree-chopping-industry catalog <br/>\ncompany) and they had this gizmo that had a set of small chains on a rotary <br/>\ncenter, kind of like a small rolling pin with rows of 4 inch chains that <br/>\nattaches to some sort of powersource (chainsaw?  power drill?) and whacks <br/>\nthe bark off of downed trees, supposedly quickly.  How did you remove the <br/>\nbark?  (&#39;cause I&#39;m going to have to remove a lot of bark when I do the <br/>\ncordwood enclosure.)  A hatchet?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We did have a tree<br/>\n&gt;service company come in and take one tree down as it was about 70 feet <br/>\n&gt;tall up<br/>\n&gt;against our power lines, wasn&#39;t having DH climb that one! We made boards out<br/>\n&gt;of that tree with an Alaskan Saw Mill that took forever. DH purchased <br/>\n&gt;building<br/>\n&gt;plans for a larger saw mill that you build yourself and he is almost complete<br/>\n&gt;with that. That will be used for the 6 other 60 feet trees that are down and<br/>\n&gt;drying now. So, yes it is a lot of work which is one of the reasons I like <br/>\n&gt;the<br/>\n&gt;Yurt. I know that is a lot off work also but it takes way less time and less<br/>\n&gt;of a mess to clean up.<br/>\n<br/>\n </span></blockquote>Oh, honey, a yurt&#39;s NOTHING like the work involved in felling, ripping and <br/>\ndrying wood for a wood cabin!  With good weather, we could have gone front <br/>\nto end, build the base, attached the SIP panels, install the flooring and <br/>\ntile and erect the yurt in 5 constant, but relaxed days.   5 days for yurt <br/>\nor 5 years for wood?  (of course, your cabin is likely to have a longer <br/>\nhalf-life, so there&#39;s that to evaluate.  I figure every 10 years I&#39;m going <br/>\nto have to write off for a new roof at least.)  Plus, it&#39;s kind of hard to <br/>\nsplit off the interior of the yurt for &#39;alone space&#39;.  I&#39;m probably going <br/>\nto have to make a &#39;hermit hut&#39; for myself in a few months or so, just to <br/>\nhave alone space for a little while now and then.<br/>\n<br/>\nHave you (or anyone) used a one-man auger?  I hurt my back (doing something <br/>\nstupid!) and ds wants to auger the holes for the deck, so we were thinking <br/>\nhe could use a one-man auger, but dh said he heard they were more <br/>\nfrustrating than anything else and we&#39;d not get anything done.  Any thoughts?<br/>\n<br/>\nHeidiWD<br/>\n<br/>\n&quot;Self-reliance is the antidote to institutional stupidity.&quot; JTGatto, <br/>\nMonarch Notes guide to One Flew Over the Cuckoo&#39;s Nest.</div>","specialLinks":[]},{"userId":138320127,"authorName":"HOMESCHOOL4GOOD@aol.com","from":"HOMESCHOOL4GOOD@...","profile":"homeschool4good","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: underground/cabins was: Re: Home-schooling standoff","postDate":"1056223894","msgId":75095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OS4xM2UzYjJlYy4yYzI2MGM5NkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":75524,"prevInTime":75094,"nextInTime":75096,"topicId":75095,"numMessagesInTopic":0,"msgSnippet":" Yes, they are.","messageBody":"<div id=\"ygrps-yiv-701229573\">&lt;&lt; If you&#39;re really looking at yurts, we liked Pacific Yurts and Nesting Bird <br/>\n<br/>\nYurts the best.  I&#39;ve heard Pacific yurts are pretty nice tho. &gt;&gt;<br/>\n<br/>\nYes, they are. We just received Pacific Yurts information packet in the mail. <br/>\nThey are quite nice. I&#39;m leaning more towards that but DH has been stuck for <br/>\nyears on cord wood. We couldn&#39;t do the stained glass effect on the cabin as <br/>\nyou can&#39;t cut into the logs but for the cord wood you can cut into it and take <br/>\ntwo colored glass bottles end to end, wrap them in aluminum sheeting like a <br/>\ncylinder and cement them in like log. It&#39;s pretty neat and economical and looks <br/>\nlike a stained glass window and not glass end bottles!<br/>\n<br/>\n<br/>\n&lt;&lt; I&#39;d love to see a pic of your log cabin!  That&#39;s a lot of work!  Did you <br/>\n<br/>\nreally log and notch all the logs yourself?<br/>\n<br/>\nHeidiWD &gt;&gt;<br/>\n<br/>\nI don&#39;t have any pictures of it yet. We only took a video. With all 3 of us <br/>\nworking on it, nobody even thought of the camera. Once I get a picture, I&#39;ll <br/>\npass it on to you. It is a lot of work but well worth it! All the logs were cut <br/>\ndown, dried and notched by us. Notching was done mostly by an ax and chain <br/>\nsaw. I&#39;d say taking all the bark off the logs was the worse! We did have a tree <br/>\nservice company come in and take one tree down as it was about 70 feet tall up <br/>\nagainst our power lines, wasn&#39;t having DH climb that one! We made boards out <br/>\nof that tree with an Alaskan Saw Mill that took forever. DH purchased building <br/>\nplans for a larger saw mill that you build yourself and he is almost complete <br/>\nwith that. That will be used for the 6 other 60 feet trees that are down and <br/>\ndrying now. So, yes it is a lot of work which is one of the reasons I like the <br/>\nYurt. I know that is a lot off work also but it takes way less time and less <br/>\nof a mess to clean up. The cabin and garage has taken us 5 years so far, not to <br/>\nmention the 5 years it took to clean up the woods, put in a driveway, etc. I <br/>\nthink things will go a lot faster now that we&#39;ll be there full time. That is <br/>\nif DH will go with a Yurt instead of cord wood. I hope!<br/>\n<br/>\nKim</div>","specialLinks":[]}],"prevTopicId":75517,"nextTopicId":75526}}