{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The be all and end all of lists.","postDate":"1035576671","msgId":48041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5LjJhYTk0MTEyLjJhZWFmZjVmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":48040,"nextInTime":48042,"topicId":48041,"numMessagesInTopic":0,"msgSnippet":"The be all and end all of lists:   this isn t it. Neither is any other list. ","messageBody":"<div id=\"ygrps-yiv-1406589506\">The be all and end all of lists:   this isn&#39;t it.  <br/>\nNeither is any other list.<br/>\n<br/>\n<br/>\n&lt;&lt; &lt;&lt; This list has, to me, appeared to be more of a general parenting <br/>\n list.  The volume of posts is remarkable, but few of them have <br/>\n anything to do with unschooling.  Maybe the name of the group should <br/>\n be changed. &gt;&gt; &gt;&gt;<br/>\n<br/>\nIf you expect to get all you unschooling information from one place, that <br/>\nwould be about like expecting your child to learn all of history from one <br/>\nbook, or all of  math from one book.  <br/>\n<br/>\nFirst order of business with unschooling is that you follow your interests.<br/>\n<br/>\nSO!  If you&#39;re interested in unschooling and this list is insufficient (as it <br/>\nshould be for anyone finding out about unschooling) you go to <br/>\nwww.unschooling.com and read the library and whatever of the archives seems <br/>\nof interest.   You can go to www.google.com and put in your favorite <br/>\nbuzzwords.  You can go to <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a> and follow the <br/>\nlinks.  Just that would take weeks, I think, if you read each other file and <br/>\nfollowed THEIR links.<br/>\n<br/>\nSince people are being testy and blunt anyway, I wish to say that I don&#39;t <br/>\nlike it at all when people come and ask to be spoonfed unschooling.  If it <br/>\ntruly is the first day they&#39;ve ever heard of it, that&#39;s differerent, but if <br/>\nthey&#39;ve been reading some and then want people to make housecalls (or at <br/>\nleast to send them everything they need to know by e-mail), that doesn&#39;t seem <br/>\nto me to be a good candidate for an unschooling parent.<br/>\n<br/>\nI guess I could call the library and ask them to pile up whatever they have <br/>\non calligraphy and bring it over to me, and hey, could you stop by the art <br/>\nstore and get me some pens and ink and paper?  Perhaps for a very steep price <br/>\nsome cab driver would do that for me, meter running all the time.<br/>\n<br/>\nBut people can come FOR FREE and get more information in one day than we <br/>\ncould get ten  years ago in a YEAR about unschooling.  And yet they complain <br/>\nthat it&#39;s just what they expected, not the right color for them, too ithcy, <br/>\ntoo direct, too vague, too general, too particular.  <br/>\n<br/>\nOne source is plagiarism and three sources is research.  That&#39;s an old school <br/>\nsaying.<br/>\n<br/>\nI think three sources is kinda weak research!  Ten sources read thoroughly <br/>\nand carefully considered in light of all your own experience starts to be <br/>\nreal knowledge.<br/>\n<br/>\nSo there&#39;s no reason to change the name of this e-mail list.  It&#39;s a function <br/>\nand service of www.unschooling.com, which is sponsored by Home Education <br/>\nMagazine.  It does its job better than most lists I&#39;ve been on.   And it&#39;s <br/>\nnot the only unschooling list there, but I&#39;m not willing to go to yahoo, <br/>\nsearch for them and send them to anyone by e-mail.<br/>\n<br/>\nOne of the first things unschoolers with a computer need to find out how to <br/>\ndo is to go to a website and search.  Maybe the first website can be <br/>\nwww.google.com .<br/>\n<br/>\nMy rant is ended.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":47770,"nextTopicId":48045}}