{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":151819905,"authorName":"barbaramatessa","from":"&quot;barbaramatessa&quot; &lt;bjelwell@...&gt;","profile":"barbaramatessa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376778944","msgId":71981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt1b3RzMCt0OGlxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71977,"nextInTopic":0,"prevInTime":71980,"nextInTime":71982,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... - I ve read elsewhere about letting go of the whole family at the dinner table idea in unschooling and have a hard time with it. I can also see that","messageBody":"<div id=\"ygrps-yiv-1487902233\">===<br/>\n<blockquote><span title=\"ireply\"> &gt; On one hand, I can see that if I could just be with them as they are in<br/>\n&gt; that moment, I might be able to enjoy their brother connection fun time<br/>\n&gt; with them.  On the other hand, as I am now, I&#39;m just getting angry every<br/>\n&gt; night.<br/>\n<br/>\n </span></blockquote>- I&#39;ve read elsewhere about letting go of the &quot;whole family at the dinner<br/>\ntable idea&quot; in unschooling and have a hard time with it. I can also see<br/>\nthat eating together is likely an adult need, not a kid need. I always ate<br/>\ndinner with my family growing up, so eating separately or while doing<br/>\nsomething else seems wrong to me somehow. I get that that&#39;s made up, but<br/>\nam not sure how to have that idea loosen its grip on me.<br/>\n===<br/>\n<br/>\nI can relate to your desire to see the situation differently, and join your kids in the moment, but having a hard time letting go of what you&#39;ve determined to be &quot;right&quot;, and possibly &quot;for their own good&quot;.  In the U.S. we have a lot of idealism surrounding the family dinner, from the Norman Rockwell painting, the Leave it to Beaver TV Show, countless other family sitcoms, and scores of experts telling us we need to be sitting and talking together over the dinner table as a family every night.<br/>\n<br/>\nFor me, the family dinner was a fairly easy notion to let go of, because of my own childhood memories.  I have no memories of being a young child at the table (did I block them out?), but I do have miserable memories of being a sullen pre-teen and teen forced to sit at the table.  Inevitably, I&#39;d get into an argument with my father, and he&#39;d banish me to my room.  There I would scream and cry hot angry tears into my pillow.  I hated my Dad and felt so misunderstood and devalued.  <br/>\n<br/>\nSo with my own kids, I&#39;ve taken a relaxed attitude about dinner.  Usually the kids will eat earlier, because they are hungry, and then I&#39;ll make a separate meal when my husband comes home.  Sometimes my husband and I will sit at the table and eat together, and talk.  Our toddler will climb on and off of our laps, and perhaps try our food.  My eight year old might come in and out to talk with us, but he&#39;s usually happily engaged with TV or a computer game.  Sometimes I bring my food into the family room with him and join him there.  Occasionally we&#39;ll eat together as a whole family outside on our picnic table, or even go out to dinner, but we&#39;re happy to end the meal when the kids are ready.  We&#39;d all just  be miserable if we forced that togetherness.<br/>\n<br/>\nMy hunch is that a lot of mainstream families don&#39;t practice the traditional family dinner, either, but they don&#39;t feel good about that choice. They may even feel that they don&#39;t have a choice. Perhaps they feel too busy.  In contrast, unschooling families often have their own traditions that differ from the norm AND they feel really happy and peaceful about their choices, because they know from experience that those choices work for their family.  And they know that those family traditions are fluid; rituals can change with the needs of the family members.<br/>\n<br/>\nThe connection between you and your kids is what&#39;s important, and that can probably be more easily nurtured at other times than dinner.  It&#39;s an experiment you can try--table the idea of the family table, and try wrestling after dinner instead.  Or talk at bedtime.<br/>\n<br/>\nMy husband and son have a late bed time ritual.  Between 9:30 and 10:00ish, they will lay down in bed and my husband will start to read aloud.  Andy (8) will interject the reading with all kinds of thoughts, connections, and questions.  They end up talking much more than reading.  And my husband listens much more than he talks.  Rather than finding out the sequence and events of Andy&#39;s day, he&#39;ll listen to our son&#39;s growing understanding of the world and his place in it.  I don&#39;t think this level of conversation could happen over dinner.<br/>\n<br/>\n<br/>\nIn response to Pam&#39;s suggestion about a whoopie cushion...I still think farts are funny, probably because as a child I was punished for my laughter about &quot;potty talk&quot;.  I never outgrew it.  Ironically,  my son can&#39;t stand to talk about anything crude while eating, because it grosses him out. He will remind us if our conversation drifts to the subject of our toddler&#39;s diaper, and so I respect his sensitivity and end that topic. :-)   My son isn&#39;t humorless, though, and he will laugh at a good fart joke as long as he&#39;s not eating, but since the subject is not taboo around here, he quickly moves on to other topics.   <br/>\n<br/>\nTed, thanks for asking the question.  I&#39;ve pondered the idea of the family dinner for days now, and have had such interesting conversations in my head about it.  <br/>\n<br/>\nHere are some words from the Buddhist monk Pema Chodron, that seem relevant to the discussion of letting go:<br/>\n<br/>\n&quot;When you begin to touch your heart or let your heart be touched, you begin to discover that it&#39;s bottomless, that it doesn&#39;t have any resolution, that this heart is huge, vast and limitless.  In the beginning it might feel like sadness or a shaky feeling, accompanied by a lot of fear, but your willingness to feel the fear, to make fear your companion, is growing.  You&#39;re willing to get to know yourself at this deep level.  After awhile, this same feeling begins to turn into a longing to raze all the walls, a longing to be fully human and to live in your world without always having to shut down and close off when certain things come along,&quot; --Start Where You Are<br/>\n<br/>\nBarb in CA</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376697775","msgId":71977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt1bWVqZitzZzg0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSlRpWi1iQXRVd21WcVUtNmJLSGlpM2N5N3ltREdEQXVqQUp3blNmdWpRRHMtVmJCQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71976,"nextInTopic":71981,"prevInTime":71976,"nextInTime":71978,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... I might hold the world record for places to get stuck in unschooling.  ;-)   So, I understand that feeling where your expectations cloud your ability to","messageBody":"<div id=\"ygrps-yiv-1398508748\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;I get that that&#39;s made up, but am not sure how to have that idea loosen its grip on me.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I might hold the world record for places to get stuck in unschooling.  ;-)   So, I understand that feeling where your expectations cloud your ability to see other, better options--where you are so attached to the notion of how things *should* go, you can&#39;t conceive of another  way that could be wonderfully unique to your own family experience.  <br/>\n<br/>\nI was thinking of this thread tonight as Ethan, Doug and I ate dinner and danced to movie theme songs.  Pink Panther was playing at the time when I thought of how far we have come from my own idea of what constituted a proper dinner get together.   The quiche I was making wasn&#39;t ready yet.  The salad I had already made was waiting in a bowl on the counter.  Ethan wanted to go ahead and eat the salad first.  In the past I would have insisted we wait for the quiche to be done.  Tonight, we all went ahead and enjoyed the salad ahead of time.  As we listened to music, Ethan ate a bit of food, swung on the pull up bar over the kitchen doorway, came back, ate a bit more,  looked in the oven,  talked about a new mod on Minecraft, and ate some more food.  Doug talked about a game he&#39;s been playing.  I danced and reminisced about rollerskating to disco music.  When the salad was nearly all devoured, the quiche was finally ready, cooled and served.  We all continued to eat while we danced and swung some more.  Then, a few theme songs later, Ethan ran next door to call on his friend for an evening of play.<br/>\n<br/>\nThat does not look at all like the stoic dinners of my youth, and I am so deeply grateful for the fun we can all have together over some decent food.  As I&#39;ve said, some nights we play games.  Last night we played UNO.  Some nights we watch tv.  We all love the Regular Show and Adventure Time.  Some evenings we each eat on our own at our computers, though that is fairly rare because we all really enjoy each other&#39;s company during this time of the day.  <br/>\n<br/>\nThink about how you can possibly start your own tradition.  In the end it might not resemble a traditional dinner time at all.  But it will be yours and your family&#39;s, and it will, hopefully, be joyful and memorable.  Focus on coming together in a meaningful way any time the opportunity presents itself.  Try not to focus on perpetuating a past that isn&#39;t relevant to the present.  You&#39;ll surprise yourself.  I certainly did!  <br/>\n<br/>\nKaren.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376674371","msgId":71976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFRkQyRTI4LTg3MDgtNEQ5QS1BNzc5LTZGREZBQTg4NDNDRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGt1a3ZrcCs4aDlpQGVHcm91cHMuY29tPg==","referencesHeader":"PGt1a3ZrcCs4aDlpQGVHcm91cHMuY29tPg=="},"prevInTopic":71974,"nextInTopic":71977,"prevInTime":71975,"nextInTime":71977,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"Eva, this is a great observation:  they want to make *you* part of their day! They want to spend their time with you doing fun things, not with you as the","messageBody":"<div id=\"ygrps-yiv-2140178451\">Eva, this is a great observation:  &quot;they want to make *you* part of their day! They want to spend their time with you doing fun things, not with you as the *observer* of their day, but as someone who *joins* in on the fun :-)&quot;<br/>\n<br/>\nThe original question reminded me of a parent who wants to quiz children on what they know, or to have them report their learning.  It makes me wonder whether the parents aren&#39;t in agreement about unschooling.  If not, and if the children are the pivot point, and the dad is actually checking up on the mom, that&#39;s not good.  I hope it&#39;s nothing like that.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":311108332,"authorName":"Eva","from":"&quot;Eva&quot; &lt;evawitsel@...&gt;","profile":"evawitsel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376649689","msgId":71974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt1a3ZrcCs4aDlpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSlRpWi1iQXRVd21WcVUtNmJLSGlpM2N5N3ltREdEQXVqQUp3blNmdWpRRHMtVmJCQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71973,"nextInTopic":71976,"prevInTime":71973,"nextInTime":71975,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... I assume you want to know about their day because you like to connect with them after a day apart. But what they are offering you might be far better! ","messageBody":"<div id=\"ygrps-yiv-1905592578\">--- I want to actually hear what they were up to that day, if I wasn&#39;t with them. ---<br/>\n<br/>\nI assume you want to know about their day because you like to connect with them after a day apart. But what they are offering you might be far better!<br/>\n<br/>\nInstead of telling you about things they did with other people at other times, they want to make *you* part of their day! They want to spend their time with you doing fun things, not with you as the *observer* of their day, but as someone who *joins* in on the fun :-)<br/>\n<br/>\nYou could be The Best Audience Ever to all of their silliness. You could be Chief Facillitator of Silliness :-) You are older, wiser and have more experience than they have, so use that to light up their eyes with silliness :-) Make it your personal goal to think of things your kids will love. Eat your dinner under the table, eat like cats, eat from the pot instead of plates, have a picknick in your backyard, tell silly jokes, you know best what your children will like.<br/>\n<br/>\nWouldn&#39;t it be better if when you bring them to bed and tuck them in, you can talk about things *you* did with them that evening instead of what they did with other people? That&#39;s what they are offering you, to be part of their lives. That&#39;s what their lives are at the moment, playful silliness :-)<br/>\n<br/>\nEva<br/>\nBerend (8) & Fiene (6)</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376628010","msgId":71973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt1a2FmYSttZXNmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSlRpWi1iQXRVd21WcVUtNmJLSGlpM2N5N3ltREdEQXVqQUp3blNmdWpRRHMtVmJCQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71969,"nextInTopic":71974,"prevInTime":71972,"nextInTime":71974,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... You don t have to be at the table to do that! When my husband comes home from work, at least one of the kids usually is excited that he is home and runs to","messageBody":"<div id=\"ygrps-yiv-808261926\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Ted Sarvata &lt;ted@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I want to actually hear what they were up<br/>\n&gt; to that day, if I wasn&#39;t with them.  <br/>\n<br/>\n </span></blockquote>You don&#39;t have to be at the table to do that!  <br/>\n<br/>\nWhen my husband comes home from work, at least one of the kids usually is excited that he is home and runs to the door and starts talking.  If not, my husband eventually goes to where the kids are to say hello and connect with them for a little while.  <br/>\n<br/>\nOften they eat and laugh while watching a show together in the evening. If the kids have already eaten, they might have a snack while Jim eats his dinner. Either way, they enjoy each other&#39;s company and a show.  <br/>\n<br/>\nSometimes only one of the kids hangs with Daddy and the others are still on the computer or doing something else.  No one is forced or pressured to hang out with him or talk, yet often they like to. <br/>\n<br/>\nThere have been times when they had a lot to tell or ask and or wanted Daddy to come see this and that (sometimes at the same time!).  Other times they are busy doing their own thing.  <br/>\n<br/>\nAnother way he gets to talk with them is when he takes only one person with him for a walk or to do an errand.    <br/>\n<br/>\nWhy do you think you don&#39;t want to be around the kids sometimes? <br/>\n<br/>\nDo you feel it would help you to enjoy being with the kids more if you had some time to relax or exercise or do something important to you before coming home, even once in a while?  Do you get time on your drive home to decompress and shift from being in employee mode to being in dad mode? <br/>\n<br/>\nRegarding dinner...If you can, try to enjoy your kids now, because they will grow up so fast and you will have many opportunities for eating dinner the way you want to later (though you might miss the giggles and the kids!).  They are only small once!<br/>\n<br/>\nI would not have any expectations, but an idea that might be fun for your kids once in a while and also might give you a few minutes eating with your wife at the table might be to put a little table in the living room with a special movie on for the kids (something you know they&#39;d be interested in) and put out snacks, pizza, or their own dinner (something that would be special to them) and then you and your wife might get some time to eat at the dining room table and talk for a bit.  Try to be pleased no matter how it goes - If you get some time to talk with your wife, great!  If the kids come to you, welcome them or pick up your plates and go sit with them to finish watching their movie. :) However it goes, go with the flow and enjoy it.  <br/>\n<br/>\nThink of how you would like to have been treated as a child.  Try to do some of those things for your kids.  Let yourself enjoy them!  <br/>\n<br/>\nLaurie :)</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376609337","msgId":71969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt1am83cCs3bjRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSlRpWi1iQXRVd21WcVUtNmJLSGlpM2N5N3ltREdEQXVqQUp3blNmdWpRRHMtVmJCQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71968,"nextInTopic":71973,"prevInTime":71968,"nextInTime":71970,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... I have a couple thoughts about this. One is that using it as a dinner-time conversation starter doesn t work well With Kids because settling down for","messageBody":"<div id=\"ygrps-yiv-53203972\">Ted Sarvata &lt;ted@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to actually hear what they were up<br/>\n&gt; to that day, if I wasn&#39;t with them.<br/>\n<br/>\n </span></blockquote>I have a couple thoughts about this. One is that using it as a dinner-time conversation starter doesn&#39;t work well With Kids because settling down for dinner is a pretty complex transition. So you&#39;re dealing with kids in transition mode rather than polite conversation mode. So it could help you to think about the ways you can enter conversations with them in a friendly casual way - those are the moments when you can ask about their day. <br/>\n<br/>\nThe other thought I have is that this might be something you could talk about with your spouse. Maybe she (she?) can take photos or keep a blog to help you stay connected to your family while you&#39;re at work. Maybe she can &quot;prime&quot; the kids a little with things to tell you or show you when you get home. Keep the focus on &quot;I want to hear about your day because I love you and miss you&quot; and finding solutions to That without necessarily making everyone feel like there needs to be a daily &quot;report&quot; ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I always ate<br/>\n&gt; dinner with my family growing up, so eating separately or while doing<br/>\n&gt; something else seems wrong to me somehow.  I get that that&#39;s made up, but<br/>\n&gt; am not sure how to have that idea loosen its grip on me.<br/>\n<br/>\n </span></blockquote>It might help to think about the feelings you associate with &quot;dinner time&quot;. If they&#39;re good feelings, what might be other ways to achieve the same good feelings? After all, you&#39;re Not getting those good feelings right now, are you? Staying with the same plan regardless of the fact that it&#39;s not working isn&#39;t going to get you what you want.<br/>\n<br/>\nWhat other ideas are attached to &quot;dinner time&quot; in your mind? You don&#39;t have to answer that here, but dig down into your assumptions and even fantasies about that. It may be that you have a lovely fantasy of &quot;dinner time&quot; in your mind - personally, I had a lovely fantasy of &quot;bed time&quot; and it didn&#39;t work for my daughter at all! It helped to acknowledge the fantasy and the feelings tied up in it, to say good-bye and even grieve a little for the fantasy of snuggling up with a book and a sweet, sleepy-headed child. That wasn&#39;t my child! But until I said goodbye to that fantasy, I had a hard time Seeing my child and appreciating the sweet moments we did have. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Seems I either have to let go of the<br/>\n&gt; family dinner<br/>\n<br/>\n </span></blockquote>You don&#39;t have to let it go forever! Right now, it doesn&#39;t seem like it&#39;s working for y&#39;all - but your kids won&#39;t be little forever. Instead of &quot;letting it go&quot; put that idea up on a shelf for now, the way you might put up grandma&#39;s china dishes for safekeeping for a few years. You don&#39;t need to get rid of all the lovely things in your life - but do recognize that little kids have different needs and priorities. If you can honor them for who they are Now, you&#39;ll have a better chance of getting those warm-fuzzy family dinners later.<br/>\n<br/>\nI have a new video game I&#39;ve been playing in the evenings and my now-12yo daughter has been coming up and snuggling with me while I play - sort of... it&#39;s awkward to snuggle when you&#39;re playing a video game! But she doesn&#39;t seem to mind the awkwardness and it&#39;s very, very sweet. Sometimes she watches and sometimes she brings a book or game of her own. When I&#39;d imagined reading to her, that was the heart of what I&#39;d imagined - doing something together, cuddled close and loving. I didn&#39;t get it the way I thought I would, but I do get to snuggle up and enjoy her company.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376577586","msgId":71968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzY1Nzc1ODYuOTE2ODIuWWFob29NYWlsTmVvQHdlYjE4MjIwNi5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PEFFRDg1M0VGLTA5MjItNDFCNy1BODMxLUUwRkM0QkQ0MjQ2QkB2ZXJpem9uLm5ldD4=","referencesHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4gPGt1Nm5jMyszcWdlQGVHcm91cHMuY29tPiA8Q0FKVGlaLWJBdFV3bVZxVS02YktIaWkzY3k3eW1ER0RBdWpBSnduU2Z1alFEcy1WYkJBQG1haWwuZ21haWwuY29tPiA8QUVEODUzRUYtMDkyMi00MUI3LUE4MzEtRTBGQzRCRDQyNDZCQHZlcml6b24ubmV0Pg=="},"prevInTopic":71967,"nextInTopic":71969,"prevInTime":71967,"nextInTime":71969,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... -=-=-=-=-=- Growing up we did not HAVE TO sit and have meals with our parents. I grew up in Brazil and most of the time we had at least a cook for 6 days","messageBody":"<div id=\"ygrps-yiv-1766771839\">On Aug 14, 2013, at 4:12 PM, Ted Sarvata wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I want to actually hear what they were up<br/>\n&gt; to that day, if I wasn&#39;t with them.<br/>\n </span></blockquote>-=-=-=-=-=-<br/>\n<br/>\nGrowing up we did not &quot;HAVE TO&quot; sit and have meals with our parents. I grew up in Brazil and most of the time we had at least a cook for 6 days a week so meals were served either in the dinning room or in the kitchen table.<br/>\nBut we all love to join them in  even if we had already eaten because our meals were fun! My dad is funny and gosh my little brother would say things that would have us spitting out our food. <br/>\nWe did not have to sit there or come when it was time. Sure they asked us but  it was OK if we did not. Because meals ended up having a lot of jokes and telling of funny stories we wanted to sit there with them and when we were done we could just excuse ourselves and go do our own things.<br/>\n That was a much more loving way to connect than making us come and sit there and be serious.  Unless there was some serious issue going one with our family joking was what we did. Well sometimes even to lighten up something serious we joked.<br/>\nI have videos of our Sunday night light dinners where lots of neighbors used to join us because they loved the fun of it. IT was more like a big tea party with lots of different baked goods and some breakfast like food with tea and coffee. We came home for that sometimes because we all enjoyed.<br/>\nWe were never made to sit with them and be there. We chose to.<br/>\nJoking was always welcome , unless it was in a mean spirited way. I think because my parents joked a lot but were not mean we were never  mean jokesters :)<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376569826","msgId":71967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFRDg1M0VGLTA5MjItNDFCNy1BODMxLUUwRkM0QkQ0MjQ2QkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBSlRpWi1iQXRVd21WcVUtNmJLSGlpM2N5N3ltREdEQXVqQUp3blNmdWpRRHMtVmJCQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4gPGt1Nm5jMyszcWdlQGVHcm91cHMuY29tPiA8Q0FKVGlaLWJBdFV3bVZxVS02YktIaWkzY3k3eW1ER0RBdWpBSnduU2Z1alFEcy1WYkJBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":71965,"nextInTopic":71968,"prevInTime":71966,"nextInTime":71968,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... But that isn t something they want. Their priority right now is joking and having fun while they eat. Which means you and your sons have conflicting","messageBody":"<div id=\"ygrps-yiv-286722510\">On Aug 14, 2013, at 4:12 PM, Ted Sarvata wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I want to actually hear what they were up<br/>\n&gt; to that day, if I wasn&#39;t with them.<br/>\n<br/>\n </span></blockquote>But that isn&#39;t something they want. Their priority right now is joking and having fun while they eat.<br/>\n<br/>\nWhich means you and your sons have conflicting desires. And right now you&#39;re showing them that in 30+ years on the planet the best way you&#39;ve learned to handle two conflicting desires is to be bigger and stronger and make the other person do what you want.<br/>\n<br/>\n*Is* that how you want to see *them* handling conflicting needs? Do you want them to use that with each other, their friends, their spouses, their employees?<br/>\n<br/>\nHow *do* you want them to handle it?<br/>\n<br/>\nHonestly I think that&#39;s where most people get stuck. Most people haven&#39;t grown up seeing *good* examples -- at least not relationship building ones -- of what to do when you want something and the other person doesn&#39;t. They&#39;ve seen bullying. They&#39;ve seen pleading. They&#39;ve seen emotional manipulation. They&#39;ve seen bribery. They&#39;ve seen get someone with more authority. They&#39;ve seen giving up. All of which, except the last, have an element of force. Which isn&#39;t good for relationships.<br/>\n<br/>\nOne mental shift that can help you make relationship-building choices is to assume the other person is doing the best they can. And that you&#39;re asking for something that doesn&#39;t interest them or is beyond their ability.<br/>\n<br/>\nYou can help them. Speaking in general here: You can change the situation so it&#39;s something they can do. You can make the situation more appealing to remove or smooth over the parts that they&#39;re objecting to. (Those don&#39;t really apply to this situation but might be useful to future situations.) You can find someone else to get you what you want. (Might your wife be willing to take pictures occasionally throughout the day and send them to a blog or Facebook (both of which can be set to private if that&#39;s a concern). Or you can focus on seeing the bigger picture: One picture is that you&#39;re being angry and unfun and someone they will want to get away from as soon as they can. Will that get you what you want? Even when they&#39;re old enough to  be able to tell you stories of their day, they&#39;re not going to want to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I always ate<br/>\n&gt; dinner with my family growing up, so eating separately or while doing<br/>\n&gt; something else seems wrong to me somehow.  I get that that&#39;s made up, but<br/>\n&gt; am not sure how to have that idea loosen its grip on me.<br/>\n<br/>\n </span></blockquote>Often I think what people subconsciously think about customary practices is: &quot;This is done this way for a reason, in response to some problem. I don&#39;t know what that problem was but there must be *some* reason for doing this. So doing it a different way is going to cause that unknown problem to happen. Better not to muck with it.&quot;<br/>\n<br/>\nWhat do you fear will happen if you do something else while eating? Are those fears real that you&#39;ve experienced? Or just things people say will happen? You don&#39;t need to tell us. Just pull that thought apart. <br/>\n<br/>\nWhen my husband and I first got married we tried eating dinner at the table. But neither of us is a big talker so it wasn&#39;t a lot of fun ;-) So we started watching TV during dinner. Despite the images of couples (supposedly) disconnected as they stare side by side at a screen, it was actually bonding. We were sharing something we both enjoyed. <br/>\n<br/>\nWhen our daughter came along, we continued. Now we as a family have this massive shared body of experiences  to reference. It&#39;s connecting. If we connect something current to an episode in Buffy the Vampire Slayer it not only connects us in the moment with something we all relate to, but connects us to our shared past of happy memories watching together. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - I&#39;m silly with them lots of times.  Sometimes I don&#39;t want to be silly<br/>\n&gt; (or be with them, for that matter).  Seems I either have to let go of the<br/>\n&gt; family dinner or let go of my desire not to be silly during those moments,<br/>\n&gt; or both.<br/>\n<br/>\n </span></blockquote>If one son was adamantly set on his brother doing something that his brother didn&#39;t want to do, how would you want him to handle it?  Would you want him to grip tight to those feelings? Would you want him to stuff them down?<br/>\n<br/>\nAs an adult you have power in this world to create opportunities that don&#39;t involve making someone do something they don&#39;t want to. Kids have less power to manipulate the world, have fewer skills, have seen fewer options. Rather than telling them what to do,  we can *be* that better way. We do better, help them shift gears. (A suggestion would be for you to suggest the two of you doing something together that&#39;s even better :-))<br/>\n<br/>\nYou don&#39;t have a Dad to help you shift gears ;-) But maybe something said here will help you shift your own gears.<br/>\n<br/>\nYou</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376534861","msgId":71965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0MDAyRjdBLTNBRTgtNDMyRi04Qjc2LTBCQURDQ0M0NzdFN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGt1aGQwNytudjNrQGVHcm91cHMuY29tPg==","referencesHeader":"PGt1aGQwNytudjNrQGVHcm91cHMuY29tPg=="},"prevInTopic":71964,"nextInTopic":71967,"prevInTime":71964,"nextInTime":71966,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"Looking for something on my website, I found something else. :-) It seems useful to the idea of parental expectations getting in the way. It s me, answering","messageBody":"<div id=\"ygrps-yiv-2051407261\">Looking for something on my website, I found something else. :-)<br/>\n<br/>\nIt seems useful to the idea of parental expectations getting in the way.<br/>\n<br/>\nIt&#39;s me, answering questions for an interview in 2009.<br/>\n<br/>\n<br/>\nQ:  What type of families/students struggle with the unschool approach?<br/>\n<br/>\nA:  When a family is more concerned with obedience than with learning, sometimes they struggle mightily to achieve either, and the children are unhappy. If the parents love the idea of predicting and controlling and deciding what their children will know and do and be, unschooling will not be easy.<br/>\n<br/>\nUnschooling is easy for children, once parents relax into it and come to understand it. It&#39;s a way of living with children in a life based on sharing a joyous exploration of the world.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376532295","msgId":71964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt1aGQwNytudjNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSlRpWi1iQXRVd21WcVUtNmJLSGlpM2N5N3ltREdEQXVqQUp3blNmdWpRRHMtVmJCQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71962,"nextInTopic":71965,"prevInTime":71963,"nextInTime":71965,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... *********** Sandra and Pam wrote about learning to make the better choice in any given situation.  You can find their writings here: ","messageBody":"<div id=\"ygrps-yiv-851850489\"><blockquote><span title=\"ireply\">&gt; Sometimes I don&#39;t want to be silly<br/>\n&gt; (or be with them, for that matter).  Seems I either have to let go of the<br/>\n&gt; family dinner or let go of my desire not to be silly during those moments,<br/>\n&gt; or both.<br/>\n </span></blockquote>***********<br/>\n<br/>\nSandra and Pam wrote about learning to make the better choice in any given situation.  You can find their writings here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/betterchoice.html\">http://sandradodd.com/betterchoice.html</a><br/>\n<br/>\nMaybe try practicing making a choice between two options at the dinner table.  Say, for example, the first choice is to go with what normally happens--the kids are silly, and you get annoyed.  Now think of another option.  Maybe, that option will be that the kids are silly, so you put on some fun music, or pull our a deck of kid talk cards. <br/>\n<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Kid-Talk-Conversation-Entire-Tabletalk/dp/1572813741/ref=sr_1_1?ie=UTF8&qid=1376531995&sr=8-1&keywords=table+talk+for+kids)\">http://www.amazon.com/Kid-Talk-Conversation-Entire-Tabletalk/dp/1572813741/ref=sr_1_1?ie=UTF8&qid=1376531995&sr=8-1&keywords=table+talk+for+kids)</a>.  <br/>\n<br/>\nSee what happens.  If it&#39;s better for all of you--yourself included--keep building from there, making choices from two mindfully chosen options.  <br/>\n<br/>\nIf that change made things worse, or didn&#39;t move the dynamic in a more peaceful direction, try thinking of another choice next time.  Be proactive.  Be engaged.  Be an example to your sons of how to facilitate a peaceful and joyful environment in any given situation.  In the long run, that example will be more influential than insisting everyone participate in dinners a certain way, and will likely lead to more meaningfully connected dinner gatherings when your sons are old enough to really enjoy them.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376532058","msgId":71962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0NDk5Q0YyLUU5NkEtNDk2RC1CNUZFLTlBRjBCOTE5QzNGN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBSlRpWi1iQXRVd21WcVUtNmJLSGlpM2N5N3ltREdEQXVqQUp3blNmdWpRRHMtVmJCQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4gPGt1Nm5jMyszcWdlQGVHcm91cHMuY29tPiA8Q0FKVGlaLWJBdFV3bVZxVS02YktIaWkzY3k3eW1ER0RBdWpBSnduU2Z1alFEcy1WYkJBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":71959,"nextInTopic":71964,"prevInTime":71961,"nextInTime":71963,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"-=- I get that that s made up, but am not sure how to have that idea loosen its grip on me.-=- Logic and priorities. What is the purpose of food? WHY do people","messageBody":"<div id=\"ygrps-yiv-1619042877\">-=- I get that that&#39;s made up, but<br/>\nam not sure how to have that idea loosen its grip on me.-=-<br/>\n<br/>\nLogic and priorities.<br/>\n<br/>\nWhat is the purpose of food?<br/>\n<br/>\nWHY do people eat together?  Think English great houses, servants, formal protocol—when the master of the house is fed, his family and guests eat.  When he&#39;s done, they&#39;re done until the next day.<br/>\n<br/>\nAll of the reasons for that are far away and long ago.  Save it for Thanksgiving.  <br/>\n<br/>\nThe reason some families (and psychologists) press for family dinner is because kids have been in school, the bonds are being broken, the families could easily go two or three days without being all in one place if they didn&#39;t consciously plan a gathering.  <br/>\n<br/>\nHomeschooled kids can be with one or both of their parents WAY more than any schoolkid can be.  Hearing what people are thinking or doing should happen when and where they&#39;re thinking and doing.  Why should they need to make a formal report?  <br/>\n<br/>\n-=-- I&#39;m silly with them lots of times.  Sometimes I don&#39;t want to be silly (or be with them, for that matter). -=-<br/>\n<br/>\nIf you cling to that, it will cost you.<br/>\nHow long before they don&#39;t think you&#39;re funny anymore, and they don&#39;t want to be with you?<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":551756142,"authorName":"Ted Sarvata","from":"Ted Sarvata &lt;ted@...&gt;","profile":"humaniam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376511159","msgId":71959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSlRpWi1iQXRVd21WcVUtNmJLSGlpM2N5N3ltREdEQXVqQUp3blNmdWpRRHMtVmJCQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGt1Nm5jMyszcWdlQGVHcm91cHMuY29tPg==","referencesHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4gPGt1Nm5jMyszcWdlQGVHcm91cHMuY29tPg=="},"prevInTopic":71920,"nextInTopic":71962,"prevInTime":71958,"nextInTime":71960,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"Thanks everyone for your suggestions and points of view. Further thoughts: - For me this isn t about learning to be little adults, but I can see how my anger","messageBody":"<div id=\"ygrps-yiv-990241115\">Thanks everyone for your suggestions and points of view.<br/>\n<br/>\nFurther thoughts:<br/>\n- For me this isn&#39;t about learning to be little adults, but I can see how<br/>\nmy anger comes across that way.  I want to actually hear what they were up<br/>\nto that day, if I wasn&#39;t with them.  Those of you that point out that this<br/>\nisn&#39;t age (or developmentally) appropriate are correct, of course.<br/>\n- I&#39;ve read elsewhere about letting go of the &quot;whole family at the dinner<br/>\ntable idea&quot; in unschooling and have a hard time with it.  I can also see<br/>\nthat eating together is likely an adult need, not a kid need.  I always ate<br/>\ndinner with my family growing up, so eating separately or while doing<br/>\nsomething else seems wrong to me somehow.  I get that that&#39;s made up, but<br/>\nam not sure how to have that idea loosen its grip on me.<br/>\n- I&#39;m silly with them lots of times.  Sometimes I don&#39;t want to be silly<br/>\n(or be with them, for that matter).  Seems I either have to let go of the<br/>\nfamily dinner or let go of my desire not to be silly during those moments,<br/>\nor both.<br/>\n<br/>\nI&#39;ll try some more and will be back to write more about it after more<br/>\nthinking.<br/>\nThank you!<br/>\nTed<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Aug 10, 2013 at 5:54 PM, Karen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:semajrak@...\">semajrak@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; On one hand, I can see that if I could just be with them as they are in<br/>\n&gt; &gt; that moment, I might be able to enjoy their brother connection fun time<br/>\n&gt; &gt; with them. On the other hand, as I am now, I&#39;m just getting angry every<br/>\n&gt; &gt; night.<br/>\n&gt; **********<br/>\n&gt;<br/>\n&gt; May I suggest you bring some games to the table with you. We do this<br/>\n&gt; often. Cards, dice games, charades, dinner games. Talk in silly voices.<br/>\n&gt; Make interesting shapes with your food. Light a few candles. Play some loud<br/>\n&gt; music. Get up and dance. Laugh between bites. Look at this time as your<br/>\n&gt; son&#39;s so obviously do--as a fun time to come together to share some<br/>\n&gt; nourishment that is bigger than protein and potatoes. ;-) Those memories,<br/>\n&gt; and that rich, joyful attitude, will likely last their lifetimes!<br/>\n&gt;<br/>\n&gt; When my mom was a girl, she used to get poked in the back by the long<br/>\n&gt; harsh finger of her dad for not sitting up straight. She told me she was to<br/>\n&gt; be seen and not heard at the dinner table. While my own experience as a<br/>\n&gt; child was not what I would call relaxed, it was not nearly so harsh. Now, I<br/>\n&gt; get to pass on my own improved version of sharing a meal. And...You do too!<br/>\n&gt; Make it good!<br/>\n&gt;<br/>\n&gt; Karen.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<br/>\nBusiness Growth Advisor | Consultant to Fast-Growth Companies | Restoring<br/>\nYour Sanity &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://tedsarvata.com/\">http://tedsarvata.com/</a>&gt;<br/>\n503-877-9214 | 248 566-6166 | 312-371-6625 (cell)<br/>\n<br/>\nOne-Day Workshop for Growth Company Executive Teams<br/>\nRockefeller Habits / Four Decisions<br/>\nNov 7, 2013 in Portland,<br/>\nOR&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://mrhworkshopportland-tedfoot.eventbrite.com/\">http://mrhworkshopportland-tedfoot.eventbrite.com/</a>&gt; (video<br/>\ninvitation) &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/l77cFIVh-Q0\">http://youtu.be/l77cFIVh-Q0</a>&gt;<br/>\nDec 4, 2013 in Detroit, MI<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://mrhworkshopdetroit-emailfooter.eventbrite.com\">http://mrhworkshopdetroit-emailfooter.eventbrite.com</a>&gt;(video<br/>\ninvitation) &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/kdq_2gHZ8cI\">http://youtu.be/kdq_2gHZ8cI</a>&gt;<br/>\n<br/>\n*�We attended a Gazelles workshop that Ted presented at and it was an<br/>\ninvaluable experience. As a small business owner, we&#39;re always looking for<br/>\nways to improve our business and our own skill set as an entrepreneur. Ted<br/>\nis an amazing coach who will challenge you look at things a little<br/>\ndifferent and implement these changes into your business.�*<br/>\n<br/>\nJohn Acree, President at Premier Window Coverings<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://gicoaches.com/bio/?id=86\">http://gicoaches.com/bio/?id=86</a>&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376182467","msgId":71920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt1Nm5jMyszcWdlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71899,"nextInTopic":71959,"prevInTime":71919,"nextInTime":71921,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... ********** May I suggest you bring some games to the table with you.  We do this often.  Cards, dice games, charades, dinner games.  Talk in silly voices.","messageBody":"<div id=\"ygrps-yiv-341987444\"><blockquote><span title=\"ireply\">&gt; On one hand, I can see that if I could just be with them as they are in<br/>\n&gt; that moment, I might be able to enjoy their brother connection fun time<br/>\n&gt; with them.  On the other hand, as I am now, I&#39;m just getting angry every<br/>\n&gt; night.<br/>\n </span></blockquote>**********<br/>\n<br/>\nMay I suggest you bring some games to the table with you.  We do this often.  Cards, dice games, charades, dinner games.  Talk in silly voices.  Make interesting shapes with your food.  Light a few candles.  Play some loud music.  Get up and dance.  Laugh between bites.  Look at this time as your son&#39;s so obviously do--as a fun time to come together to share some nourishment that is bigger than protein and potatoes.  ;-)   Those memories, and that rich, joyful attitude, will likely last their lifetimes!<br/>\n<br/>\nWhen my mom was a girl, she used to get poked in the back by the long harsh finger of her dad for not sitting up straight.  She told me she was to be seen and not heard at the dinner table.  While my own experience as a child was not what I would call relaxed, it was not nearly so harsh.  Now, I get to pass on my own improved version of sharing a meal.  And...You do too!  Make it good!  <br/>\n<br/>\nKaren.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] seeking advice (silliness at dinner table is driving me crazy)","postDate":"1376053695","msgId":71899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzNkY5QjI1LTA5MjctNDVBQS04RkIyLTM2MDMzNUFCMTJBMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71896,"nextInTopic":71920,"prevInTime":71898,"nextInTime":71900,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"-=-Be so grateful for them that you cannot help but smile at them with deep love. I am 100 percent serious that what you need is way more gratitude. Work on","messageBody":"<div id=\"ygrps-yiv-1237877208\">-=-Be so grateful for them that you cannot help but smile at them with<br/>\ndeep love. I am 100 percent serious that what you need is way more<br/>\ngratitude. Work on that in yourself.-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gratitude\">http://sandradodd.com/gratitude</a><br/>\n<br/>\nJo Isaac wrote <br/>\n<br/>\n-=-I would just try and relax and<br/>\ngive up this idea of &#39;dinner/family time&#39;. It sounds like you are putting a lot<br/>\nof unnecessary stress around both the table and around food that won&#39;t be good<br/>\nfor unschooling or family relationships.-=-<br/>\n<br/>\nNor will it be good for peaceful consumption of food.<br/>\n<br/>\nIf food isn&#39;t eaten for its own sake, because one is hungry and needs sustenance, various other problems can arise.  <br/>\n<br/>\nThe better your relationship with your kids is, the more they will enjoy sitting and eating with you, but they&#39;re too young right now for what you&#39;re imagining.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2011/03/how-important-is-your-child.html\">http://justaddlightandstir.blogspot.com/2011/03/how-important-is-your-child.html</a><br/>\nIf your child is more important than your vision of your child, life becomes easier.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/priorities\">http://sandradodd.com/priorities</a><br/>\n<br/>\nThere are years&#39; worth of collected good parts of discussions about food and unschooling here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food.html\">http://sandradodd.com/food.html</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: seeking advice (silliness at dinner table is driving me crazy)","postDate":"1375925920","msgId":71896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0dXNyMCtlZWpvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71895,"nextInTopic":71899,"prevInTime":71895,"nextInTime":71897,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"... **************** There are several different parts to sitting down to dinner and it can help to kind of parse them out in your mind and see how you can","messageBody":"<div id=\"ygrps-yiv-1514434471\">Ted Sarvata &lt;ted@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Almost every night, when we site down to dinner, the boys are joking with<br/>\n&gt; one another in a nonsense way that at other times would be fun for me.  At<br/>\n&gt; the dinner table, however, I&#39;d like to have family time where we talk with<br/>\n&gt; one another and actually eat our dinners, rather than a lot of giggling and<br/>\n&gt; nonsense words between the two of them with little or no interaction with<br/>\n&gt; the rest of us, and very little dinner being eaten.<br/>\n </span></blockquote>****************<br/>\n<br/>\nThere are several different parts to &quot;sitting down to dinner&quot; and it can help to kind of parse them out in your mind and see how you can resolve separate issues differently. <br/>\n<br/>\nOne is plain old eating - which doesn&#39;t have to be a significant part of dinner! Eating can happen when the kids are hungry, rather than at specifically designated times. <br/>\n<br/>\nAnother is the idea you stated, of a family socializing together... but you have two little kids! Socializing for them Means giggling and nonsense words and squirming around. It&#39;s what they do. When my stepson was little he would sometimes call his best friend on the phone and they&#39;d make animal noises at each other. Over the phone. And because I&#39;d been raised with this idea that one Talked over the phone, I was shocked and offended at first... but really that was something the did when they were together, too. It was part of how they enjoyed one another&#39;s company. Enjoy your silly little kids - they won&#39;t stay that way forever ;)<br/>\n<br/>\nAt the same time, if what you&#39;re craving is some adult conversation, look for other ways to get that... which could be you and the wife having dinner while the kids watch a movie in the other room. <br/>\n<br/>\nBut tied up in that idea of a family socializing (which doesn&#39;t need a table, much less food to do) is the idea of Socialization - teaching kids to behave properly in specific social situations. Dinner time is traditionally used for a certain kind of socialization, one that takes a very dim view of &quot;childish behavior&quot;. So it may help you to know that the whole &quot;sitting down at the table&quot; dinner ritual isn&#39;t a nightly necessity for kids to learn table deportment. Really, it&#39;s something kids can learn on the fly, when there are special events, trips out to eat, weddings, family reunions... They don&#39;t need a daily scolding. <br/>\n<br/>\nIf you want dinner to be pleasant, be pleasant to your kids. If you want them to feel welcome As They Are at your table, make it inviting to them. That might mean having something besides sitting around making dull conversation to do at the table - a puzzle, a game, arts and crafts. It may mean stepping away from expectations about who should eat how much of what for dinner.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":403767111,"authorName":"Jo Isaac","from":"Jo Isaac &lt;joanneisaac@...&gt;","profile":"joanne.isaac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] seeking advice (silliness at dinner table is driving me crazy)","postDate":"1375920786","msgId":71895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERVQjExMS1XMkJERkZCQTIzRDIwRkJDREQzQjY3Qjc1RjBAcGh4LmdibD4=","inReplyToHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71894,"nextInTopic":71896,"prevInTime":71894,"nextInTime":71896,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"==At the dinner table, however, I d like to have family time where we talk with one another and actually eat our dinners== I would be questioning the","messageBody":"<div id=\"ygrps-yiv-2141237058\">==At the dinner table, however, I&#39;d like to<br/>\nhave family time where we talk with one another and actually eat our dinners==<br/>\n<br/>\n<br/>\nI would be questioning the preconceived idea that dinner needs to be about &#39;family time&#39; and needs to be at the table at all.  The notion of &#39;family time at dinner&#39; is one with<br/>\nit&#39;s root in everyone being apart for the whole day, at school and work, and dinner being the one time where everyone sits down and talks about their day. <br/>\nFor unschooling families though, we are together throughout the day and always talking with one another   -  &#39;family time&#39; doesn&#39;t need to be falsely constructed around the dinner table.<br/>\n<br/>\n<br/>\nWhy do they need<br/>\nto eat at the table? Perhaps being forced to sit at the table when they&#39;d<br/>\nrather be elsewhere, doing other things, means they are just trying to make the most fun out of a<br/>\nstressful situation? And it does sound stressful - my father used to make me sit at the table when I visited him - it was all &#39;elbows off the table&#39;, &#39;eat all your broccoli&#39;...I detested and dreaded dinner times at my Dad&#39;s - with my Mum on the other hand, I ate my dinner on my lap watching TV :) <br/>\nWe very rarely eat at the table all together - only when we have visitors. We<br/>\neat continuing to do what we were doing - Kai often eats on his bed watching a<br/>\nDVD, or at his computer gaming. He also often is hungry before &#39;dinner time&#39; so<br/>\neats then, and so he eats when he&#39;s hungry, not when &#39;dinner time&#39; dictates it.<br/>\n<br/>\n <br/>\n<br/>\nI would just try and relax and<br/>\ngive up this idea of &#39;dinner/family time&#39;. It sounds like you are putting a lot<br/>\nof unnecessary stress around both the table and around food that won&#39;t be good<br/>\nfor unschooling or family relationships.<br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ted@...\">ted@...</a><br/>\n&gt; Date: Wed, 7 Aug 2013 15:40:57 -0700<br/>\n&gt; Subject: [AlwaysLearning] seeking advice (silliness at dinner table is driving me crazy)<br/>\n&gt; <br/>\n&gt; We have two boys, turning 5 tomorrow!  We took them out of preschool at the<br/>\n&gt; end of May after reading some about unschooling.  We&#39;re planning a &quot;year of<br/>\n&gt; play&quot; or something, for the coming year.  We&#39;re not at all worried about<br/>\n&gt; what they might be missing if they&#39;re not in school, but my wife and I are<br/>\n&gt; both questioning whether we have what it takes to makes this work for our<br/>\n&gt; two boys.<br/>\n&gt; <br/>\n&gt; Here&#39;s the situation I&#39;m looking for advice on:<br/>\n&gt; <br/>\n&gt; Almost every night, when we site down to dinner, the boys are joking with<br/>\n&gt; one another in a nonsense way that at other times would be fun for me.  At<br/>\n&gt; the dinner table, however, I&#39;d like to have family time where we talk with<br/>\n&gt; one another and actually eat our dinners, rather than a lot of giggling and<br/>\n&gt; nonsense words between the two of them with little or no interaction with<br/>\n&gt; the rest of us, and very little dinner being eaten.<br/>\n&gt; <br/>\n&gt; On one hand, I can see that if I could just be with them as they are in<br/>\n&gt; that moment, I might be able to enjoy their brother connection fun time<br/>\n&gt; with them.  On the other hand, as I am now, I&#39;m just getting angry every<br/>\n&gt; night.<br/>\n&gt; <br/>\n&gt; Suggestions for new ways to look at this, things for me to do, etc?<br/>\n&gt; <br/>\n&gt; Thank you!<br/>\n&gt; Ted<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -- <br/>\n&gt; <br/>\n&gt; Business Growth Advisor | Consultant to Fast-Growth Companies | Restoring<br/>\n&gt; Your Sanity &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://tedsarvata.com/\">http://tedsarvata.com/</a>&gt;<br/>\n&gt; 503-877-9214 | 248 566-6166 | 312-371-6625 (cell)<br/>\n&gt; <br/>\n&gt; One-Day Workshop for Growth Company Executive Teams<br/>\n&gt; Rockefeller Habits / Four Decisions<br/>\n&gt; Nov 7, 2013 in Portland,<br/>\n&gt; OR&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://mrhworkshopportland-tedfoot.eventbrite.com/\">http://mrhworkshopportland-tedfoot.eventbrite.com/</a>&gt; (video<br/>\n&gt; invitation) &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/l77cFIVh-Q0\">http://youtu.be/l77cFIVh-Q0</a>&gt;<br/>\n&gt; Dec 4, 2013 in Detroit, MI<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://mrhworkshopdetroit-emailfooter.eventbrite.com\">http://mrhworkshopdetroit-emailfooter.eventbrite.com</a>&gt;(video<br/>\n&gt; invitation) &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/kdq_2gHZ8cI\">http://youtu.be/kdq_2gHZ8cI</a>&gt;<br/>\n&gt; <br/>\n&gt; *�We attended a Gazelles workshop that Ted presented at and it was an<br/>\n&gt; invaluable experience. As a small business owner, we&#39;re always looking for<br/>\n&gt; ways to improve our business and our own skill set as an entrepreneur. Ted<br/>\n&gt; is an amazing coach who will challenge you look at things a little<br/>\n&gt; different and implement these changes into your business.�*<br/>\n&gt; <br/>\n&gt; John Acree, President at Premier Window Coverings<br/>\n&gt; <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://gicoaches.com/bio/?id=86\">http://gicoaches.com/bio/?id=86</a>&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------------------<br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n \t\t \t   \t\t  <br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/l77cFIVh-Q0?wmode=opaque","type":"VIDEO"},{"url":"http://www.youtube.com/embed/kdq_2gHZ8cI?wmode=opaque","type":"VIDEO"}]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] seeking advice (silliness at dinner table is driving me crazy)","postDate":"1375916463","msgId":71894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPZDU3ZWIrU3dxOTRVS1ltVDl3YjlvRG9GT05GNWdHT21icG15UjBzK1E1UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71893,"nextInTopic":71895,"prevInTime":71893,"nextInTime":71895,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"Oh my heart really goes out to you. You have a long time ahead of learning to let go of those idealistic expectations in order to live a wondrous real life","messageBody":"<div id=\"ygrps-yiv-71697064\">Oh my heart really goes out to you. You have a long time ahead of learning<br/>\nto let go of those idealistic expectations in order to live a wondrous real<br/>\nlife with your real kids.<br/>\n<br/>\nSeriously and deeply think about what you want from life with kids. What<br/>\nwill lead to that life? Enjoy them. Look right at them with clear-eyed<br/>\nwonder that they exist and they are healthy and they are joking and goofing<br/>\naround. Be so grateful for them that you cannot help but smile at them with<br/>\ndeep love. I am 100 percent serious that what you need is way more<br/>\ngratitude. Work on that in yourself.<br/>\n<br/>\nIf you keep on like this, you will burden them for their entire lives with<br/>\nthe feeling that they cannot live up to their father&#39;s expectations. That<br/>\nis a terrible thing to pass on to your offspring!<br/>\n<br/>\nInstead, be with them as they really are. Enjoy every minute. Support their<br/>\ngoofy silly nature. There will be plenty of times for serious discussion<br/>\nbut right now that&#39;s not them. Find ways to add goofiness to your life,<br/>\ntoo. Enjoy it with them. Share it with them. Bring whoopie cushions to the<br/>\ndinner table. In case you think I&#39;m not serious, I am suggesting you order<br/>\n&quot;the Big Cheesy&quot; from Oriental Trading Company.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.orientaltrading.com/\">http://www.orientaltrading.com/</a><br/>\n<br/>\nLighten up. Lighten up. Seriously lighten up. My father was like you - had<br/>\nexpectations about behaving certain ways (adult ways) at the dinner table<br/>\nand in other situations. He missed out and we all missed out on a lot of<br/>\npotential joy. Be that dad who has fun with his kids. Face your fears - I<br/>\nknow you think they&#39;ll grow up uncouth. But they won&#39;t - it isn&#39;t true.<br/>\nThey&#39;ll take after you, they&#39;ll learn how to act in various social<br/>\nsituations. They will learn.<br/>\n<br/>\nIf you&#39;re a selfish adult who wants children to behave like little adults<br/>\nso that the adults can have things their own grown-up way, then you<br/>\nprobably wouldn&#39;t be writing on this list. So I doubt that&#39;s you. But just<br/>\nin case, remember that you chose to bring children into your life - make<br/>\nthat your life and don&#39;t try to make the children fit in to the adult life<br/>\nyou&#39;d have lived if you&#39;d had no kids. Get your adult time apart from the<br/>\nkids, don&#39;t make them have to suffer so you can get your adult needs met.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Aug 7, 2013 at 3:40 PM, Ted Sarvata &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ted@...\">ted@...</a>&gt; wrote:<br/>\n<br/>\n&gt; We have two boys, turning 5 tomorrow!  We took them out of preschool at the<br/>\n&gt; end of May after reading some about unschooling.  We&#39;re planning a &quot;year of<br/>\n&gt; play&quot; or something, for the coming year.  We&#39;re not at all worried about<br/>\n&gt; what they might be missing if they&#39;re not in school, but my wife and I are<br/>\n&gt; both questioning whether we have what it takes to makes this work for our<br/>\n&gt; two boys.<br/>\n&gt;<br/>\n&gt; Here&#39;s the situation I&#39;m looking for advice on:<br/>\n&gt;<br/>\n&gt; Almost every night, when we site down to dinner, the boys are joking with<br/>\n&gt; one another in a nonsense way that at other times would be fun for me.  At<br/>\n&gt; the dinner table, however, I&#39;d like to have family time where we talk with<br/>\n&gt; one another and actually eat our dinners, rather than a lot of giggling and<br/>\n&gt; nonsense words between the two of them with little or no interaction with<br/>\n&gt; the rest of us, and very little dinner being eaten.<br/>\n&gt;<br/>\n&gt; On one hand, I can see that if I could just be with them as they are in<br/>\n&gt; that moment, I might be able to enjoy their brother connection fun time<br/>\n&gt; with them.  On the other hand, as I am now, I&#39;m just getting angry every<br/>\n&gt; night.<br/>\n&gt;<br/>\n&gt; Suggestions for new ways to look at this, things for me to do, etc?<br/>\n&gt;<br/>\n&gt; Thank you!<br/>\n&gt; Ted<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt;<br/>\n&gt; Business Growth Advisor | Consultant to Fast-Growth Companies | Restoring<br/>\n&gt; Your Sanity &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://tedsarvata.com/\">http://tedsarvata.com/</a>&gt;<br/>\n&gt; 503-877-9214 | 248 566-6166 | 312-371-6625 (cell)<br/>\n&gt;<br/>\n&gt; One-Day Workshop for Growth Company Executive Teams<br/>\n&gt; Rockefeller Habits / Four Decisions<br/>\n&gt; Nov 7, 2013 in Portland,<br/>\n&gt; OR&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://mrhworkshopportland-tedfoot.eventbrite.com/\">http://mrhworkshopportland-tedfoot.eventbrite.com/</a>&gt; (video<br/>\n&gt; invitation) &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/l77cFIVh-Q0\">http://youtu.be/l77cFIVh-Q0</a>&gt;<br/>\n&gt; Dec 4, 2013 in Detroit, MI<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://mrhworkshopdetroit-emailfooter.eventbrite.com\">http://mrhworkshopdetroit-emailfooter.eventbrite.com</a>&gt;(video<br/>\n&gt; invitation) &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/kdq_2gHZ8cI\">http://youtu.be/kdq_2gHZ8cI</a>&gt;<br/>\n&gt;<br/>\n&gt; *�We attended a Gazelles workshop that Ted presented at and it was an<br/>\n&gt; invaluable experience. As a small business owner, we&#39;re always looking for<br/>\n&gt; ways to improve our business and our own skill set as an entrepreneur. Ted<br/>\n&gt; is an amazing coach who will challenge you look at things a little<br/>\n&gt; different and implement these changes into your business.�*<br/>\n&gt;<br/>\n&gt; John Acree, President at Premier Window Coverings<br/>\n&gt;<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://gicoaches.com/bio/?id=86\">http://gicoaches.com/bio/?id=86</a>&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":551756142,"authorName":"Ted Sarvata","from":"Ted Sarvata &lt;ted@...&gt;","profile":"humaniam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"seeking advice (silliness at dinner table is driving me crazy)","postDate":"1375915257","msgId":71893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSlRpWi1hMUpfWXAzRmR1RV92aFVjRzBVOS1TT2d6NGlmPXFGYVNzSzE3X1J6MkZ2UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":71894,"prevInTime":71892,"nextInTime":71894,"topicId":71893,"numMessagesInTopic":0,"msgSnippet":"We have two boys, turning 5 tomorrow!  We took them out of preschool at the end of May after reading some about unschooling.  We re planning a year of play","messageBody":"<div id=\"ygrps-yiv-1119076775\">We have two boys, turning 5 tomorrow!  We took them out of preschool at the<br/>\nend of May after reading some about unschooling.  We&#39;re planning a &quot;year of<br/>\nplay&quot; or something, for the coming year.  We&#39;re not at all worried about<br/>\nwhat they might be missing if they&#39;re not in school, but my wife and I are<br/>\nboth questioning whether we have what it takes to makes this work for our<br/>\ntwo boys.<br/>\n<br/>\nHere&#39;s the situation I&#39;m looking for advice on:<br/>\n<br/>\nAlmost every night, when we site down to dinner, the boys are joking with<br/>\none another in a nonsense way that at other times would be fun for me.  At<br/>\nthe dinner table, however, I&#39;d like to have family time where we talk with<br/>\none another and actually eat our dinners, rather than a lot of giggling and<br/>\nnonsense words between the two of them with little or no interaction with<br/>\nthe rest of us, and very little dinner being eaten.<br/>\n<br/>\nOn one hand, I can see that if I could just be with them as they are in<br/>\nthat moment, I might be able to enjoy their brother connection fun time<br/>\nwith them.  On the other hand, as I am now, I&#39;m just getting angry every<br/>\nnight.<br/>\n<br/>\nSuggestions for new ways to look at this, things for me to do, etc?<br/>\n<br/>\nThank you!<br/>\nTed<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<br/>\nBusiness Growth Advisor | Consultant to Fast-Growth Companies | Restoring<br/>\nYour Sanity &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://tedsarvata.com/\">http://tedsarvata.com/</a>&gt;<br/>\n503-877-9214 | 248 566-6166 | 312-371-6625 (cell)<br/>\n<br/>\nOne-Day Workshop for Growth Company Executive Teams<br/>\nRockefeller Habits / Four Decisions<br/>\nNov 7, 2013 in Portland,<br/>\nOR&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://mrhworkshopportland-tedfoot.eventbrite.com/\">http://mrhworkshopportland-tedfoot.eventbrite.com/</a>&gt; (video<br/>\ninvitation) &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/l77cFIVh-Q0\">http://youtu.be/l77cFIVh-Q0</a>&gt;<br/>\nDec 4, 2013 in Detroit, MI<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://mrhworkshopdetroit-emailfooter.eventbrite.com\">http://mrhworkshopdetroit-emailfooter.eventbrite.com</a>&gt;(video<br/>\ninvitation) &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/kdq_2gHZ8cI\">http://youtu.be/kdq_2gHZ8cI</a>&gt;<br/>\n<br/>\n*�We attended a Gazelles workshop that Ted presented at and it was an<br/>\ninvaluable experience. As a small business owner, we&#39;re always looking for<br/>\nways to improve our business and our own skill set as an entrepreneur. Ted<br/>\nis an amazing coach who will challenge you look at things a little<br/>\ndifferent and implement these changes into your business.�*<br/>\n<br/>\nJohn Acree, President at Premier Window Coverings<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://gicoaches.com/bio/?id=86\">http://gicoaches.com/bio/?id=86</a>&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/l77cFIVh-Q0?wmode=opaque","type":"VIDEO"},{"url":"http://www.youtube.com/embed/kdq_2gHZ8cI?wmode=opaque","type":"VIDEO"}]}],"prevTopicId":71932,"nextTopicId":71992}}