{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and longer still...","postDate":"1044212687","msgId":57630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlLjM0ZTJjOWRlLjJiNmVjNWNmQGFvbC5jb20+"},"prevInTopic":57552,"nextInTopic":0,"prevInTime":57629,"nextInTime":57631,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/31/03 5:31:33 PM, genant2@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-933955450\">In a message dated 1/31/03 5:31:33 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> writes:<br/>\n<br/>\n&lt;&lt; Occasionally (like this week, most recently!) I feel really<br/>\nuncomfortable with the speed at which people are introduced to the most <br/>\nradical vision<br/>\nof living respectfully with their children--***<br/>\n<br/>\n&lt;&lt;I don&#39;t get this statement.  Are there different visions of living <br/>\nrespectfully with  children?  I believe it is either living respectfully or <br/>\nnot.  &gt;&gt;<br/>\n<br/>\nI&#39;m just about to catch up with the e-mail I was so behind on.  Sorry to be <br/>\nlate.  This one was directly to me, and although I think Joyce or others have <br/>\nanswered (I was reading in swirly-fashion, some new and some old every day), <br/>\nhere&#39;s my own attempt to defend my statement.<br/>\n<br/>\n-=-I don&#39;t get this statement.  Are there different visions of living <br/>\nrespectfully with  children? -=-<br/>\n<br/>\nMy mom used to tell me she spanked me because she loved me.<br/>\n<br/>\nIf someone &quot;respects a child&#39;s privacy&quot; to the point of not noticing they <br/>\nhave ants in their bedroom and socks behind the toilet which COULD be washed, <br/>\nis that respect, really?<br/>\n<br/>\nWords ALWAYS have multiple shadings and meanings.  And when philosophy and <br/>\nbehavior become factors, a word which is about an attitude and a mindset is <br/>\nabsolutely going to be about as broad as the world.<br/>\n<br/>\nDoes &quot;respect for the environment&quot; mean never stepping on grass? Or never <br/>\nbuilding a sidewalk to avoid stepping on grass?   <br/>\n<br/>\nOften when someone says &quot;I respect your opinion,&quot; they really mean &quot;I <br/>\nacknowledge that you have the right to an opinion and I&#39;m glad you&#39;re brave <br/>\nenough to have expressed your opinion.&quot;  That&#39;s long to say and involves a <br/>\nlot of thought, though, so they say &quot;I respect your opinion,&quot; even when they <br/>\nthink the opinion is proof of idiocy and dumb-assedness.<br/>\n<br/>\nIf someone who believes unsaved souls will burn unquenched for eternity says <br/>\n&quot;I respect my child&#39;s choices&quot; it will mean something entirely different, and <br/>\nCOMPLETELY different, than if the same words are thought, uttered or written <br/>\nby someone who is an atheist or who believes in reincarnation.  If I believed <br/>\nin hell and though Jesus was coming back &#39;might be today,&#39;  my &quot;respect&quot; for <br/>\nmy child could not include being lax about reminding him to accept Jesus as <br/>\nhis Savior.  It would be the utmost in neglectful DISrespect for me to say <br/>\n&quot;Yeah, whatever about you.  *I*&#39;m going to heaven.&quot;<br/>\n<br/>\n<br/>\nSo with unschooling, there is this starting place about natural learning.  <br/>\nAnd with that starting place, that people can learn from whatever interests <br/>\nthem, in ways that are interesting and workable for them, then we begin to <br/>\nsee that we  need to respect our children&#39;s interests and styles of learning <br/>\nand being.<br/>\n<br/>\nFrom that little grain of a start, understanding that one loves Lego and <br/>\nsilence while another loves books and soft cushions and the third loves loud <br/>\nmusic and roller blades, we wonder maybe whether it&#39;s okay if one doesn&#39;t <br/>\nlike vegetarian food, or one wants to feng-shui-ify the rec room.  And from <br/>\nthere it  just all unravels into a whole new world of respect for each child <br/>\nas the full human he has always been, instead of the kid we sometimes imagine <br/>\nwe built and own.<br/>\n<br/>\nIt&#39;s not easy to describe or discuss.  If it were easy, we&#39;d have nothing <br/>\nmuch to discuss here.<br/>\n<br/>\nIf anyone wants more attempt at explanation, say so.  Ask other questions.  <br/>\nOr just let it soak in a year.   It&#39;s okay if you think &quot;I respect your <br/>\nopinion&quot; even if you think more deeply &quot;What idiocy and dumb-assedness.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":135098343,"authorName":"Peggy","from":"Peggy &lt;durrell@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New kid freedoms (a long ramble) and longer still...","postDate":"1044132852","msgId":57552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFM0MzM0Y0LjgwODAxMDlAYWl0YWNjZXNzLmNvbT4=","inReplyToHeader":"PDEwNDQwNzI2MzkuMTMzNS4zNDI1Ni5tN0B5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDEwNDQwNzI2MzkuMTMzNS4zNDI1Ni5tN0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":57537,"nextInTopic":57630,"prevInTime":57551,"nextInTime":57553,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"From: ed hodgins  ... Thank you for writing this, it is so true. It sure is hard to find the strength to give our children the","messageBody":"<div id=\"ygrps-yiv-688662508\">From: &quot;ed hodgins&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ed.hodgins@...\">ed.hodgins@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;This almost made me cry! I guess it is hard to respect your children when<br/>\n&gt; <br/>\n&gt; as child I wasnt respected. I am struggling with this. Lately i find the<br/>\n&gt; more time i spend doing things with them getting right involved with what<br/>\n&gt; there doing. The more I respect them at treat them as equals. It should come<br/>\n&gt; natural and if we raise our chilren with respect they will pass it on to<br/>\n&gt; their children. I fine the more I respect my daughter the more she respects<br/>\n&gt; me. They learn by the example we set.<br/>\n<br/>\n </span></blockquote>Thank you for writing this, it is so true. It sure is hard to find the <br/>\nstrength to give our children the respect that we weren&#39;t given as <br/>\nchildren.  And it is even harder, as a parent, to admit we might not <br/>\nhave given our own children the respect they needed and that their <br/>\nactions might have something to do with that lack of respect.<br/>\n<br/>\nIt is much easier to blame someone else, anything else, even a email <br/>\nlist and play all kinds of games to distract oneself from that reality. <br/>\nIt is however, a colossal waste of one&#39;s own time and everyone else <br/>\nreading that denial. So, to those that would blame unschooling rather <br/>\nthan take responsibility for their own actions, why? No one here said <br/>\nthis is the easy way to go. There are places all over the net to hang <br/>\nout where the parent&#39;s feelings are ALWAYS protected and no one would <br/>\neven suggest that a parent had any responsibility for a lack of <br/>\nsensitivity or echoing respect in their children. Why not hang out in an <br/>\neasy place like that instead of endlessly bitching and moaning about <br/>\nthis place and sucking up *any* attention and never mind that it&#39;s <br/>\nnegative. Wait, I answered my own question. ;)<br/>\n<br/>\nPeggy, feeling cranky this morning.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: New kid freedoms (a long ramble) and longer still...","postDate":"1044119835","msgId":57537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4LjMyZWQ1OWM2LjJiNmQ1YjFiQGFvbC5jb20+"},"prevInTopic":57533,"nextInTopic":57552,"prevInTime":57536,"nextInTime":57538,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/03 9:26:00 AM, bunsofaluminum60@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-880320317\">In a message dated 2/1/03 9:26:00 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bunsofaluminum60@...\">bunsofaluminum60@...</a> writes:<br/>\n<br/>\n&lt;&lt; What if there&#39;s a big-time misuse of <br/>\nthese &quot;training&quot; passages? &gt;&gt;<br/>\n<br/>\nI have trained morning glories and pea plants to grow up on a fence.<br/>\nHitting them doesn&#39;t help. &lt;g&gt;<br/>\n<br/>\nOnly gently putting the end of the vine near something it can wrap itself <br/>\naround helps.<br/>\n<br/>\n&lt;&lt;What if &quot;in the way in which he should go&quot; <br/>\nhas to do with knowing your kids well enough to see which direction <br/>\nthey are heading, and then guiding them in that way? &gt;&gt;<br/>\n<br/>\nKinda like that.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi &lt;bunsofaluminum60@hotmail.com&gt;","from":"&quot;Heidi &lt;bunsofaluminum60@...&gt;&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New kid freedoms (a long ramble) and longer still...","postDate":"1044116691","msgId":57533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxZ3NjaitiOTYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGIxZXRsZitidjEwQGVHcm91cHMuY29tPg=="},"prevInTopic":57530,"nextInTopic":57537,"prevInTime":57532,"nextInTime":57534,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"Hi Julie! ... Okay, I ve been wracking my brains and looking into the Bible, and comparing what I ve read here, with things I ve read elsewhere. Is this","messageBody":"<div id=\"ygrps-yiv-323226250\">Hi Julie! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And I believe we&#39;ve been more successful at it than some. But <br/>\n&gt; we&#39;ve also bee inundated with Christian parenting strategies <br/>\n&gt; and homeschooling talks. I find myself ambivalent at times abut <br/>\n&gt; what to expect and why.<br/>\n<br/>\n </span></blockquote>Okay, I&#39;ve been wracking my brains and looking into the Bible, and <br/>\ncomparing what I&#39;ve read here, with things I&#39;ve read elsewhere. &quot;Is <br/>\nthis unschooling thing Biblical?&quot; I asked myself. The Bible has a lot <br/>\nto say about training children, and the rod, and fatherly oversight <br/>\nof their children. <br/>\nI&#39;ve read Michael and Debi Pearl&#39;s writings, and agree with some, and <br/>\ndisagree with some. In fact, would you be surprised, you unschoolers, <br/>\nto read Michael Pearl&#39;s advice about math and kids? He says &quot;Don&#39;t <br/>\nmake them sit down and do math problems. Bring them into contact with <br/>\nmath in their lives, and they&#39;ll pick up what they need to know about <br/>\nmath.&quot; That&#39;s a paraphrase, but it&#39;s a paraphrase of Michael Pearl. <br/>\nWhen I read, here on this board, about kids picking up math via <br/>\nliving, I am reminded of Pearls, more than any other author I&#39;ve read.<br/>\n<br/>\nBefore you jump my case, let me say, much of the Pearls&#39; advice about <br/>\nthe rod is one area where I do differ with them. I don&#39;t want to talk <br/>\nabout spanking.<br/>\n<br/>\nAs I have researched and thought about it, yes training is something <br/>\nmentioned in the Bible. Parental training of children. But you know <br/>\nwhat it says &quot;Train up a child in the way he should go, and when he <br/>\nis old, he will not depart from it.&quot; Well, how many kids, <br/>\nrigidly &quot;trained&quot; in &quot;Christianity&quot; have grown up to be solid <br/>\nChristians? Um, I know more who have abandoned the faith, than have <br/>\nstayed with the faith. What if there&#39;s a big-time misuse of <br/>\nthese &quot;training&quot; passages? What if &quot;in the way in which he should go&quot; <br/>\nhas to do with knowing your kids well enough to see which direction <br/>\nthey are heading, and then guiding them in that way? And in a <br/>\nChristian life, letting God saturate that way? What if Christian <br/>\nparents developed and maintained fellowship with their kids (another <br/>\nPearlism) and lived with them together in joy, rather than making <br/>\nthem always tow the line without a deviation? and the ensuing <br/>\nfrustration and anger at the kids when they DIDN&#39;T tow the line!<br/>\n<br/>\nI know that much of evangelicalism is more rigid, but my opinion is <br/>\nthat much of evangelicalism is NOT Biblical living. There&#39;s a lot of <br/>\nstuff out there, coming from Christian leadership, which isn&#39;t <br/>\nBiblical parenting. Believe it or not, the writings of some <br/>\nconservative Christian leaders are closer to unschooling than to the <br/>\ncurrent trends, and I&#39;ve read them. Closer to this &quot;in the way in <br/>\nwhich they should go,&quot; this, &quot;know them and see where their talents <br/>\nand interests lie, and let them go in that direction.&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This radical unschooling philosophy has taken all my thoughts <br/>\n&gt; to an entirely new level and I feel FREE! I told my dh today: the <br/>\n&gt; old sense of being the home regulator and rule enforcer is gone. <br/>\n&gt; Life feels so much easier! And everyone&#39;s so much nicer to each <br/>\n&gt; other.<br/>\n<br/>\n </span></blockquote>I am just exactly at this point, too, Julie. And my husband, who has <br/>\nan innate rigidity, who had a hard time accepting that you can put <br/>\nRanch salad dressing on potatoes and broccoli...I&#39;ve been watching <br/>\nhim just open up with the kids MAJORLY these past couple of weeks. <br/>\nMr. &quot;No Computer Today At All, You&#39;ve Had Enough&quot; actually stayed up <br/>\nlast night playing computer games with Robby until the wee hours of <br/>\nthe morning. And just day before yesterday, when someone (Julie B?) <br/>\nmentioned her hubby and son playing computer all night, I gave a <br/>\nlittle *snork* and said &quot;That&#39;s not going to happen around here&quot; L my <br/>\nnon-playful husband, playing. wow.<br/>\n<br/>\nEverything about our home feels easier and more joyful. Where <br/>\nfrustration over &quot;those disobedient, mischievous kids&quot; was, there is <br/>\nnow playfulness, as we parents join them in THEIR games and THEIR <br/>\nexplorations. It&#39;s very cool. I&#39;m liking it a LOT.<br/>\n<br/>\npeace, Heidi</div>","specialLinks":[]},{"userId":1658973,"authorName":"Barb Eaton","from":"Barb Eaton &lt;homemama@...&gt;","profile":"homesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and\tlonger still...","postDate":"1044115994","msgId":57530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNjE1QzRBLjE1REM1JWhvbWVtYW1hQGluZmluZXQuY29tPg==","inReplyToHeader":"PGE3LjJkYzZhZGE0LjJiNmQzMmU5QGFvbC5jb20+"},"prevInTopic":57523,"nextInTopic":57533,"prevInTime":57529,"nextInTime":57531,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"This is what I m trying to do with my boys. The only thing is is what do you do when they don t want to talk and share with you? I ve been trying my best to","messageBody":"<div id=\"ygrps-yiv-1200436482\">This is what I&#39;m trying to do with my boys. The only thing is is what do<br/>\nyou do when they don&#39;t want to talk and share with you? I&#39;ve been trying my<br/>\nbest to build our relationship up. My oldest is just not a talker. At least<br/>\nnot to me. It makes me sad and I&#39;ve told him that. I hope he comes around<br/>\nsomeday. When I suggest to do something together he&#39;s just not interested.<br/>\nI&#39;ve done my best not to push or pressure. I really feel I&#39;ve been relaxed<br/>\nin my approach. Any suggestions to help it along?<br/>\n<br/>\n<br/>\nBarb E<br/>\n&quot;The function of the child is to live his own life - not the life that his<br/>\nanxious parents think he should live.&quot;<br/>\nA S Neill<br/>\n<br/>\n<br/>\n<br/>\n<br/>\non 2/1/03 9:25 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; &quot;What do I wish <br/>\n&gt; my mom had done?&quot;  And as I did that thing--whether pick him up, or talk<br/>\n&gt; nicely to him, or swing him longer than I had planned to, or play with him on<br/>\n&gt; the floor, whatever it was--I thought of how much nicer it would have been<br/>\n&gt; for me, and how much nicer for my mom and our relationship if she had found<br/>\n&gt; some way to be more patient with me, and more generous with energy and<br/>\n&gt; attention.<br/>\n&gt; <br/>\n&gt; So while I was becoming the mom I wished I had had, Kirby was getting a<br/>\n&gt; better mom than  he would have had otherwise.<br/>\n&gt; <br/>\n&gt; Sandra </span></blockquote></div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and longer still...","postDate":"1044114068","msgId":57523,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNkLjJiNTJlMjdmLjJiNmQ0NDk0QGFvbC5jb20+"},"prevInTopic":57507,"nextInTopic":57530,"prevInTime":57522,"nextInTime":57524,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/03 9:27:10 AM Eastern Standard Time, ... Oh yes....it can be so healing Pam G. [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-9310133\">In a message dated 2/1/03 9:27:10 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As to treating our children better than we were treated, it can be really <br/>\n&gt; healing.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Oh yes....it can be so healing <br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and longer still...","postDate":"1044109545","msgId":57507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE3LjJkYzZhZGE0LjJiNmQzMmU5QGFvbC5jb20+"},"prevInTopic":57505,"nextInTopic":57523,"prevInTime":57506,"nextInTime":57508,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/31/03 7:40:55 PM, ed.hodgins@sympatico.ca writes: ","messageBody":"<div id=\"ygrps-yiv-15338103\">In a message dated 1/31/03 7:40:55 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ed.hodgins@...\">ed.hodgins@...</a> writes:<br/>\n<br/>\n&lt;&lt; This almost made me cry! I guess it is hard to respect your children when<br/>\nas child I wasnt respected. I am struggling with this. Lately i find the<br/>\nmore time i spend doing things with them getting right involved with what<br/>\nthere doing. The more I respect them at treat them as equals. It should come<br/>\nnatural and if we raise our chilren with respect they will pass it on to<br/>\ntheir children. I fine the more I respect my daughter the more she respects<br/>\nme. They learn by the example we set.&gt;&gt;<br/>\n<br/>\nI&#39;m thinking some people might have missed this, since it was posted at the <br/>\nbottom of a fully quoted post, footers and all.   ed.hodgins, please delete <br/>\nthe post you&#39;re responding to (or most of it) or at least put your comment up <br/>\ntop, because I&#39;m afraid people will scroll down, see the yahoogroups &quot;closing <br/>\ncomment&quot; and not find your own writing.<br/>\n<br/>\nAs to treating our children better than we were treated, it can be really <br/>\nhealing.<br/>\n<br/>\nIf you see it as healing your own inner child (much was written of that <br/>\nfifteen years ago, and you can probably find it on the internet, under <br/>\nrecovery from dysfunction or similar topics, using www.google.com) it might <br/>\nbe easier.   It changed my life profoundly when I was involved in Adult <br/>\nChildren of Alcoholics meetings during the pregnancies and births of my first <br/>\ntwo children.<br/>\n<br/>\nWhen I made a decision about what to do with Kirby I thought &quot;What do I wish <br/>\nmy mom had done?&quot;  And as I did that thing--whether pick him up, or talk <br/>\nnicely to him, or swing him longer than I had planned to, or play with him on <br/>\nthe floor, whatever it was--I thought of how much nicer it would have been <br/>\nfor me, and how much nicer for my mom and our relationship if she had found <br/>\nsome way to be more patient with me, and more generous with energy and <br/>\nattention.<br/>\n<br/>\nSo while I was becoming the mom I wished I had had, Kirby was getting a <br/>\nbetter mom than  he would have had otherwise.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart &lt;julie@bravewriter.com&gt;","from":"&quot;Julie Bogart &lt;julie@...&gt;&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New kid freedoms (a long ramble) and longer still...","postDate":"1044108984","msgId":57505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxZ2tybythYzVuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBNjEzQUU5LjEzNDk2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":57503,"nextInTopic":57507,"prevInTime":57504,"nextInTime":57506,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"... respectfully or ... standard parenting ... being ... do. (And it ... you want ... Oh this is so true!!! (It was me who used the yard work/.husband ","messageBody":"<div id=\"ygrps-yiv-1831182786\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, Fetteroll <br/>\n&lt;fetteroll@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; on 1/31/03 7:28 PM, genant2@a... at genant2@a... wrote:<br/>\n&gt; <br/>\n&gt; &gt; I don&#39;t get this statement.  Are there different visions of living<br/>\n&gt; &gt; respectfully with  children?  I believe it is either living <br/>\n </span></blockquote>respectfully or<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; not.  <br/>\n&gt; <br/>\n&gt; Depends how you define respect. To people familiar with <br/>\n </span></blockquote>standard parenting<br/>\n<blockquote><span title=\"ireply\"> &gt; practices, it means something closer to fair, I think. It means <br/>\n </span></blockquote>being<br/>\n<blockquote><span title=\"ireply\"> &gt; reasonable when getting kids to do what you think they need to <br/>\n </span></blockquote>do. (And it<br/>\n<blockquote><span title=\"ireply\"> &gt; ticks people off when it&#39;s phrased as &quot;getting kids to do what <br/>\n </span></blockquote>you want&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; because that isn&#39;t, they think, what they mean at all.)<br/>\n<br/>\n </span></blockquote>Oh this is so true!!! (It was me who used the yard work/.husband <br/>\nexample, btw). Last night my husband and I tried to figure out if <br/>\nther is anything we feel we can say to our kids about their <br/>\nchoices and how they spend their time.<br/>\n<br/>\nI realized that in the old paradigm, parents are constantly <br/>\njustifying their decisions this way:<br/>\n<br/>\nI want her to learn to value her clothes so I won&#39;t let her leave <br/>\nthem in a heap on the floor. If she doesn&#39;t pick them up, then... <br/>\nFill in the blank<br/>\n<br/>\nOr<br/>\n<br/>\nIf I can&#39;t trust my kids to obey in the little things, how will I be able <br/>\nto trus tthem in the big ones like driving a car?<br/>\n<br/>\nBut the expectations and regulations keep piling up on each <br/>\nother. And by the time these kids are teens (when almost all <br/>\nthese parents said their kids would have *more* freedom, not <br/>\nless), they feel paralyzed to actually give them that freedom.<br/>\n<br/>\nit occured to me last night that it&#39;s because they haven&#39;t got <br/>\nevidence for themselves that their kids *can* function reliably, <br/>\nwith good sense and integrity for them *without* parental <br/>\nintervention, coercion or supervision.<br/>\n<br/>\n<br/>\n It&#39;s often treating<br/>\n<blockquote><span title=\"ireply\"> &gt; kids as though they have adult needs and understandings as <br/>\n </span></blockquote>a way of<br/>\n<blockquote><span title=\"ireply\"> &gt; instilling those adult needs and understandings.<br/>\n<br/>\n </span></blockquote>Yes. I agree with this.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Like being calm and firm in insisting a child must stick with <br/>\n </span></blockquote>soccer until<br/>\n<blockquote><span title=\"ireply\"> &gt; the end of the season because there was a long discussion <br/>\n </span></blockquote>about<br/>\n<blockquote><span title=\"ireply\"> &gt; responsibility before the child signed up.<br/>\n&gt; <br/>\n&gt; Like setting a curfew with clear reasonable-feeling <br/>\n </span></blockquote>consequences for<br/>\n<blockquote><span title=\"ireply\"> &gt; breaking it and then enforcing them calmly and firmly.<br/>\n<br/>\n </span></blockquote>Well put.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and\tlonger still...","postDate":"1044107449","msgId":57503,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNjEzQUU5LjEzNDk2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDc4LjM3MDM1NDg0LjJiNmM2ZWM2QGFvbC5jb20+"},"prevInTopic":57474,"nextInTopic":57505,"prevInTime":57502,"nextInTime":57504,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"... Depends how you define respect. To people familiar with standard parenting practices, it means something closer to fair, I think. It means being reasonable","messageBody":"<div id=\"ygrps-yiv-1406342902\">on 1/31/03 7:28 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t get this statement.  Are there different visions of living<br/>\n&gt; respectfully with  children?  I believe it is either living respectfully or<br/>\n&gt; not.  <br/>\n<br/>\n </span></blockquote>Depends how you define respect. To people familiar with standard parenting<br/>\npractices, it means something closer to fair, I think. It means being<br/>\nreasonable when getting kids to do what you think they need to do. (And it<br/>\nticks people off when it&#39;s phrased as &quot;getting kids to do what you want&quot;<br/>\nbecause that isn&#39;t, they think, what they mean at all.) It&#39;s often treating<br/>\nkids as though they have adult needs and understandings as a way of<br/>\ninstilling those adult needs and understandings.<br/>\n<br/>\nLike being calm and firm in insisting a child must stick with soccer until<br/>\nthe end of the season because there was a long discussion about<br/>\nresponsibility before the child signed up.<br/>\n<br/>\nLike setting a curfew with clear reasonable-feeling consequences for<br/>\nbreaking it and then enforcing them calmly and firmly.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":134954462,"authorName":"ed hodgins","from":"&quot;ed hodgins&quot; &lt;ed.hodgins@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and longer still...","postDate":"1044067177","msgId":57465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGYwMWMyYzk5YiQyYTBiYjc4MCRhZjYzZTQ0MEB5b3VydXM2N3BpNmx1dj4=","referencesHeader":"PDIwMDMwMTMxLjE0MTcxNy4yMDcyLjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":57454,"nextInTopic":57474,"prevInTime":57464,"nextInTime":57466,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"... From: Deborah Lewis  To:  Sent: Friday, January 31, 2003 4:17 PM Subject: Re: [Unschooling-dotcom]","messageBody":"<div id=\"ygrps-yiv-934560313\"><blockquote><span title=\"qreply\">----- Original Message -----<br/>\nFrom: &quot;Deborah Lewis&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Friday, January 31, 2003 4:17 PM<br/>\nSubject: Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and<br/>\nlonger still...<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; On Fri, 31 Jan 2003 12:05:15 EST <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n&gt;<br/>\n&gt; ***Occasionally (like this week, most recently!) I feel really<br/>\n&gt; uncomfortable<br/>\n&gt; with the speed at which people are introduced to the most radical vision<br/>\n&gt; of<br/>\n&gt; living respectfully with their children--***<br/>\n&gt;<br/>\n&gt; Yes.   It must be like going from darkness to light in an instant and<br/>\n&gt; you&#39;re left stunned and blinking there in the glare until you can adjust<br/>\n&gt; your vision.<br/>\n&gt;<br/>\n&gt; What I am so uncomfortable with is the starting places are all different.<br/>\n&gt;   I sort of tend to assume everyone is starting at the same place and<br/>\n&gt; they&#39;re not.<br/>\n&gt;<br/>\n&gt; I&#39;m not a smart person.  I&#39;m just average in everything, but I *get*<br/>\n&gt; unschooling.  I *get* living respectfully with children and if I can get<br/>\n&gt; it it seems anyone can.    I don&#39;t have the unfailing patience Joyce has<br/>\n&gt; nor the steadfast  dedication to helping others that Sandra has.    I&#39;m<br/>\n&gt; ashamed that I get frustrated sometimes with new people, because I really<br/>\n&gt; DO respect people who are trying to get this.  I really DO admire people<br/>\n&gt; who are trying to make life better for their kids.   Maybe I&#39;m just not<br/>\n&gt; good at helping someone else get there.<br/>\n&gt;<br/>\n&gt; I don&#39;t understand why respecting children isn&#39;t simply the natural<br/>\n&gt; starting point for mothers.   I know about religious teaching that say<br/>\n&gt; children are born with sin and I know about the long history of parenting<br/>\n&gt; practices and I know what society says about children.   I just don&#39;t<br/>\n&gt; know why all of that isn&#39;t simply washed away the instant a new mother<br/>\n&gt; holds that new baby.   THAT&#39;s what I don&#39;t get.   And if this seems harsh<br/>\n&gt; or snarky please believe I don&#39;t mean it that way.    I&#39;m passionate<br/>\n&gt; about unschooling.  I believe it can change the world.  I want everyone<br/>\n&gt; to get there.<br/>\n&gt;<br/>\n&gt; Maybe because pregnancies before Dylan didn&#39;t culminate with a warm,<br/>\n&gt; sweet baby in my arms, or maybe because I was afraid of loosing him or<br/>\n&gt; maybe because I knew he was the only child I would have I  cherished him<br/>\n&gt; from the start.    I didn&#39;t think for a minute that my job as a parent<br/>\n&gt; was to make him obey or to teach him respect.   So, like Sandra we<br/>\n&gt; started from a place of really noticing he was a capable person, right<br/>\n&gt; from the start.   This is hard, because I seem to get the impression<br/>\n&gt; often that other parents think their kids are a project.  Something they<br/>\n&gt; have to build and perfect and finish.   The starting place is different.<br/>\n&gt;<br/>\n&gt; I want my son to be happy and fulfilled.   I live with him the way I<br/>\n&gt; would live with a loved and respected friend or partner and I talk to him<br/>\n&gt; the way I hope others have the kindness to talk to me.   I don&#39;t assume<br/>\n&gt; his desires are less than mine because he&#39;s small I don&#39;t assume his<br/>\n&gt; needs are not as important as mine or his problems are not as troubling<br/>\n&gt; as mine because he&#39;s a child.    I knew he&#39;d need help getting where he<br/>\n&gt; wanted to go, literally and figuratively.   I knew he&#39;d need protection<br/>\n&gt; from harm until he could identify things that could hurt him and until he<br/>\n&gt; could protect himself.   I didn&#39;t have him because I wanted help with<br/>\n&gt; housework, and I didn&#39;t assume I was a better judge of what kind of<br/>\n&gt; person he should.<br/>\n&gt;<br/>\n&gt; If any newbies have read this far, you can see you are not the only ones<br/>\n&gt; who feel like you&#39;re wandering in a strange land.  Because when I hear<br/>\n&gt; moms complain their kids won&#39;t do anything around the house or just want<br/>\n&gt; to watch TV or are lazy or mean or uncooperative I feel like I&#39;m talking<br/>\n&gt; to someone from another planet.    I get super annoyed with folks who<br/>\n&gt; insult Sandra, because she devotes so much time to helping others<br/>\n&gt; understand.   Every minute she&#39;s here answering questions and clarifying<br/>\n&gt; ideas and giving examples is time spent away from her family and she&#39;s<br/>\n&gt; not soliciting funds from anyone.   She has the determination to help<br/>\n&gt; others get it that very few people have.   She&#39;s gone on and on helping<br/>\n&gt; despite having answered questions a million times and despite being<br/>\n&gt; abused and insulted.   She&#39;s a hero, in my opinion and if any new person<br/>\n&gt; thinks getting unschooling is a difficult task helping people get it is<br/>\n&gt; infinitely more difficult.    She made a choice to help others and she<br/>\n&gt; makes it over and over again.   But people who come to learn about<br/>\n&gt; unschooling have made a choice too.  No one is helpless here, if new<br/>\n&gt; people need more help or clarification then it&#39;s their responsibility to<br/>\n&gt; say so.   New people don&#39;t have the right to blame anyone here if they<br/>\n&gt; don&#39;t understand.  It&#39;s up to the seeker to find understanding.   No one<br/>\n&gt; here is putting barriers in the way.<br/>\n&gt;<br/>\n&gt; For new people, try treating your children they way you would like to be<br/>\n&gt; treated.   If you spilled milk on the floor, would you want someone<br/>\n&gt; yelling at you about it, telling you to be more careful?   Wouldn&#39;t it be<br/>\n&gt; nicer to have someone say, &quot;I&#39;m sorry, let me help you.&quot; ?<br/>\n&gt; What is so difficult about treating children with respect?<br/>\n&gt;<br/>\n&gt; Really, newbies are not the only ones dealing with frustrations here.<br/>\n&gt;<br/>\n&gt; Deb L<br/>\n&gt;<br/>\n&gt; ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt; If you have questions, concerns or problems with this list, please email<br/>\nthe moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner,<br/>\nHelen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, click on the following link or address an<br/>\nemail to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This almost made me cry! I guess it is hard to respect your children when<br/>\nas child I wasnt respected. I am struggling with this. Lately i find the<br/>\nmore time i spend doing things with them getting right involved with what<br/>\nthere doing. The more I respect them at treat them as equals. It should come<br/>\nnatural and if we raise our chilren with respect they will pass it on to<br/>\ntheir children. I fine the more I respect my daughter the more she respects<br/>\nme. They learn by the example we set. </span></blockquote></div>","specialLinks":[]},{"userId":105774918,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] New kid freedoms (a long ramble) and longer still...","postDate":"1044066872","msgId":57474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWMyYzk5YSQ3OGEzYzMyMCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDIwMDMwMTMxLjE0MTcxNy4yMDcyLjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":57465,"nextInTopic":57503,"prevInTime":57473,"nextInTime":57475,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1124615054\">&lt;&lt;I don&#39;t have the unfailing patience Joyce has<br/>\nnor the steadfast  dedication to helping others that Sandra has.  <br/>\n<br/>\n(snip)<br/>\n<br/>\n  I get super annoyed with folks who<br/>\ninsult Sandra, because she devotes so much time to helping others<br/>\nunderstand&gt;&gt; <br/>\n<br/>\n <br/>\n<br/>\nHere! Here!<br/>\n<br/>\n <br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and longer still...","postDate":"1044059334","msgId":57454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4LjM3MDM1NDg0LjJiNmM2ZWM2QGFvbC5jb20+"},"prevInTopic":57450,"nextInTopic":57465,"prevInTime":57453,"nextInTime":57455,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"Occasionally (like this week, most recently!) I feel really uncomfortable with the speed at which people are introduced to the most radical vision of living","messageBody":"<div id=\"ygrps-yiv-1464508570\">Occasionally (like this week, most recently!) I feel really<br/>\nuncomfortable <br/>\nwith the speed at which people are introduced to the most radical vision<br/>\nof <br/>\nliving respectfully with their children--***<br/>\n<br/>\n<br/>\n<br/>\nI don&#39;t get this statement.  Are there different visions of living <br/>\nrespectfully with  children?  I believe it is either living respectfully or <br/>\nnot.  <br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":106031689,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"jonkream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Re: New kid freedoms (a long ramble) and longer still...","postDate":"1044057138","msgId":57450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PCF+IVVFTkVSa1ZDTURrQUFRQUNBQUFBQUFBQUFBQUFBQUFBQUJnQUFBQUFBQUFBb3RjOXlYdVBJRXV3MzdFd2ZJRzhMTUtBQUFBUUFBQUF4M1g1NTYwcFNrSzczdVFkVlErZTh3RUFBQUFBQGF0dGJpLmNvbT4=","inReplyToHeader":"PGIxZXRsZitidjEwQGVHcm91cHMuY29tPg=="},"prevInTopic":57440,"nextInTopic":57454,"prevInTime":57449,"nextInTime":57451,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"w e are discussing some of these ideas on my website www.trapdoorsociety.com  Hi Julie - I visited your site and I think you re doing a good job of ","messageBody":"<div id=\"ygrps-yiv-2014093284\">&quot;w e are discussing some of these <br/>\nideas on my website www.trapdoorsociety.com &quot;<br/>\n <br/>\nHi Julie - I visited your site and I think you&#39;re doing a good job of<br/>\nexplaining yourself.  I also read the &#39;Discipline Suggestion: The<br/>\nPractice Academy&#39; thread, and I can see that it could be difficult to<br/>\nexplain your new outlook to some people :0(.   ~Rue<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: New kid freedoms (a long ramble) and longer still...","postDate":"1044053769","msgId":57440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1MS4xYjI1NWVmOS4yYjZjNTkwOUBhb2wuY29tPg=="},"prevInTopic":57435,"nextInTopic":57450,"prevInTime":57439,"nextInTime":57441,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/31/03 3:35:24 PM, julie@bravewriter.com writes: ","messageBody":"<div id=\"ygrps-yiv-724781283\">In a message dated 1/31/03 3:35:24 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a> writes:<br/>\n<br/>\n&lt;&lt; This radical unschooling philosophy has taken all my thoughts <br/>\nto an entirely new level and I feel FREE! I told my dh today: the <br/>\nold sense of being the home regulator and rule enforcer is gone. <br/>\nLife feels so much easier! And everyone&#39;s so much nicer to each <br/>\nother.&gt;&gt;<br/>\n<br/>\nIt IS easy, when it comes to work.  It seems easy to me, anyway.  <br/>\nI liked your account.<br/>\n<br/>\nWhen I tell people how easy and sweet it is with my kids sometimes, they look <br/>\nentirely aghast or suspicious or disgusted.  Partly they don&#39;t want to <br/>\nbelieve me.  Partly, if it IS easy then they&#39;re wasting their own time and <br/>\nwasting their relationship with their children on something unnecessary.<br/>\n<br/>\nSomething like that was said to me on the New Mexico homeschooling list last <br/>\nweek, but a  mom who didn&#39;t want me bragging up unschooling as though it were <br/>\nthe only option.  (I hadn&#39;t been.)  The quote is:  <br/>\n<br/>\n&quot;it has been bothering me for a long <br/>\ntime, ever since I first joined here asking questions about how to <br/>\nget started. I recall feeling more confused then anything else at <br/>\ntimes, and sometimes felt *jumped on* for things I felt I needed to <br/>\ndo that others felt was.. well.. unnecessary, etc...&quot;<br/>\n<br/>\nSo do I &quot;feel&quot; that teaching a child to read is unnecessary?  Or do I *KNOW* <br/>\nit to unnecessary?<br/>\n<br/>\nI didn&#39;t argue that point there.  It&#39;s not an unschooling list.<br/>\n<br/>\nDo I feel that spanking is unnecessary?  Yes.  And not only unnecessary, but <br/>\nharmful.<br/>\n<br/>\nBut if my children&#39;s lives are fun and sweet and they go to bed smiling, <br/>\npeople whose children&#39;s lives are not fun, and not sweet, who go to bed sad <br/>\nand frustrated, are likely to be angry with me from the get go.<br/>\n<br/>\nI don&#39;t think this will work with every one.  I don&#39;t think every parent is <br/>\ncapable of doing it.  Does that mean that out of &quot;fairness&quot; none of us <br/>\nshould?  <br/>\n<br/>\nThat&#39;s a serious question, not just rhetorical.  Are we being elitist on <br/>\nbeyond posh private schools to give our kids freedom and peace at home?<br/>\n<br/>\nSandra, still rambling</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and longer still...","postDate":"1044052765","msgId":57435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMy4xZTU1ZTQ2ZC4yYjZjNTUxZEBhb2wuY29tPg=="},"prevInTopic":57434,"nextInTopic":57440,"prevInTime":57434,"nextInTime":57436,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/31/03 2:20:53 PM, ddzimlew@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-203933352\">In a message dated 1/31/03 2:20:53 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\nMaybe because pregnancies before Dylan didn&#39;t culminate with a warm,<br/>\nsweet baby in my arms, or maybe because I was afraid of loosing him or<br/>\nmaybe because I knew he was the only child I would have I  cherished him<br/>\nfrom the start.   &gt;&gt;<br/>\n<br/>\nThis is sweet and sad and also strong and wonderful.<br/>\n<br/>\nI wish I could have traded some of my easy fertility for someone&#39;s swimming <br/>\nability and maybe a little math.  Life&#39;s not fair, and I wish we could make <br/>\ndeals like that.<br/>\n<br/>\nEverything that transfers from one person to another, though, goes by <br/>\nexamples and words and gifts of time or stuff or books or ideas.<br/>\n<br/>\nThanks for the kind words, Deb.<br/>\nYour posts are making a big difference in people&#39;s lives.  I love your <br/>\nwriting.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart &lt;julie@bravewriter.com&gt;","from":"&quot;Julie Bogart &lt;julie@...&gt;&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New kid freedoms (a long ramble) and longer still...","postDate":"1044052463","msgId":57434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxZXRsZitidjEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMwMTMxLjE0MTcxNy4yMDcyLjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":57433,"nextInTopic":57435,"prevInTime":57433,"nextInTime":57435,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"...  wrote: Awesome post. The whole thing. I feel so sad sometimes that I left the track I started on when I had a new baby and was in love. I","messageBody":"<div id=\"ygrps-yiv-1677308542\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, Deborah Lewis <br/>\n&lt;ddzimlew@j...&gt; wrote:<br/>\n<br/>\nAwesome post. The whole thing.<br/>\n<br/>\nI feel so sad sometimes that I left the track I started on when I <br/>\nhad a new baby and was in love. I have tried really hard to live a <br/>\nlife that respects children&#39;s emotional needs on par with their <br/>\nphysical ones.<br/>\n<br/>\nAnd I believe we&#39;ve been more successful at it than some. But <br/>\nwe&#39;ve also bee inundated with Christian parenting strategies <br/>\nand homeschooling talks. I find myself ambivalent at times abut <br/>\nwhat to expect and why.<br/>\n<br/>\nThis radical unschooling philosophy has taken all my thoughts <br/>\nto an entirely new level and I feel FREE! I told my dh today: the <br/>\nold sense of being the home regulator and rule enforcer is gone. <br/>\nLife feels so much easier! And everyone&#39;s so much nicer to each <br/>\nother.<br/>\n<br/>\nAnd just to empathize more, we are discussing some of these <br/>\nideas on my website www.trapdoorsociety.com and I am feeling <br/>\nthe kinds of frustrations you must feel. Women get pretty feisty <br/>\nabout protecting their rights to make children obey. Geesh. I&#39;m <br/>\ntrying to offer some of the principles to them since we&#39;ve had <br/>\nheart-rending discussions about raising teens. Not working. The <br/>\nfear of giving up parental authority is huge!<br/>\n<br/>\nIt occured to me: when do these mothers ever stop regulating <br/>\neverything their kids think and do? There are a hundred <br/>\njustifications for requiring... everything from how to eat and <br/>\nwhere, to when to pick up clothes and how to fold them in <br/>\ndrawers.<br/>\n<br/>\nNo wonder we go bonkers in college!<br/>\n<br/>\nI feel I&#39;ve had a huge Aha here and am grateful for the patience of <br/>\nthose of you who are trying to offer your insights when it feels like <br/>\nold hat to you and we sound insane! :)<br/>\n<br/>\nOh, and my kids thank you profusely too. :)<br/>\n<br/>\nJulie B<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; On Fri, 31 Jan 2003 12:05:15 EST SandraDodd@a... writes:<br/>\n&gt; <br/>\n&gt; ***Occasionally (like this week, most recently!) I feel really<br/>\n&gt; uncomfortable <br/>\n&gt; with the speed at which people are introduced to the most <br/>\n </span></blockquote>radical vision<br/>\n<blockquote><span title=\"ireply\"> &gt; of <br/>\n&gt; living respectfully with their children--***<br/>\n&gt; <br/>\n&gt; Yes.   It must be like going from darkness to light in an instant <br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; you&#39;re left stunned and blinking there in the glare until you can <br/>\n </span></blockquote>adjust<br/>\n<blockquote><span title=\"ireply\"> &gt; your vision. <br/>\n&gt; <br/>\n&gt; What I am so uncomfortable with is the starting places are all <br/>\n </span></blockquote>different.<br/>\n<blockquote><span title=\"ireply\"> &gt;   I sort of tend to assume everyone is starting at the same <br/>\n </span></blockquote>place and<br/>\n<blockquote><span title=\"ireply\"> &gt; they&#39;re not. <br/>\n&gt; <br/>\n&gt; I&#39;m not a smart person.  I&#39;m just average in everything, but I <br/>\n </span></blockquote>*get*<br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling.  I *get* living respectfully with children and if I can <br/>\n </span></blockquote>get<br/>\n<blockquote><span title=\"ireply\"> &gt; it it seems anyone can.    I don&#39;t have the unfailing patience <br/>\n </span></blockquote>Joyce has<br/>\n<blockquote><span title=\"ireply\"> &gt; nor the steadfast  dedication to helping others that Sandra has.    <br/>\n </span></blockquote>I&#39;m<br/>\n<blockquote><span title=\"ireply\"> &gt; ashamed that I get frustrated sometimes with new people, <br/>\n </span></blockquote>because I really<br/>\n<blockquote><span title=\"ireply\"> &gt; DO respect people who are trying to get this.  I really DO <br/>\n </span></blockquote>admire people<br/>\n<blockquote><span title=\"ireply\"> &gt; who are trying to make life better for their kids.   Maybe I&#39;m just <br/>\n </span></blockquote>not<br/>\n<blockquote><span title=\"ireply\"> &gt; good at helping someone else get there.<br/>\n&gt; <br/>\n&gt; I don&#39;t understand why respecting children isn&#39;t simply the <br/>\n </span></blockquote>natural<br/>\n<blockquote><span title=\"ireply\"> &gt; starting point for mothers.   I know about religious teaching that <br/>\n </span></blockquote>say<br/>\n<blockquote><span title=\"ireply\"> &gt; children are born with sin and I know about the long history of <br/>\n </span></blockquote>parenting<br/>\n<blockquote><span title=\"ireply\"> &gt; practices and I know what society says about children.   I just <br/>\n </span></blockquote>don&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; know why all of that isn&#39;t simply washed away the instant a new <br/>\n </span></blockquote>mother<br/>\n<blockquote><span title=\"ireply\"> &gt; holds that new baby.   THAT&#39;s what I don&#39;t get.   And if this <br/>\n </span></blockquote>seems harsh<br/>\n<blockquote><span title=\"ireply\"> &gt; or snarky please believe I don&#39;t mean it that way.    I&#39;m <br/>\n </span></blockquote>passionate<br/>\n<blockquote><span title=\"ireply\"> &gt; about unschooling.  I believe it can change the world.  I want <br/>\n </span></blockquote>everyone<br/>\n<blockquote><span title=\"ireply\"> &gt; to get there.   <br/>\n&gt; <br/>\n&gt; Maybe because pregnancies before Dylan didn&#39;t culminate <br/>\n </span></blockquote>with a warm,<br/>\n<blockquote><span title=\"ireply\"> &gt; sweet baby in my arms, or maybe because I was afraid of <br/>\n </span></blockquote>loosing him or<br/>\n<blockquote><span title=\"ireply\"> &gt; maybe because I knew he was the only child I would have I  <br/>\n </span></blockquote>cherished him<br/>\n<blockquote><span title=\"ireply\"> &gt; from the start.    I didn&#39;t think for a minute that my job as a <br/>\n </span></blockquote>parent<br/>\n<blockquote><span title=\"ireply\"> &gt; was to make him obey or to teach him respect.   So, like <br/>\n </span></blockquote>Sandra we<br/>\n<blockquote><span title=\"ireply\"> &gt; started from a place of really noticing he was a capable <br/>\n </span></blockquote>person, right<br/>\n<blockquote><span title=\"ireply\"> &gt; from the start.   This is hard, because I seem to get the <br/>\n </span></blockquote>impression<br/>\n<blockquote><span title=\"ireply\"> &gt; often that other parents think their kids are a project.  <br/>\n </span></blockquote>Something they<br/>\n<blockquote><span title=\"ireply\"> &gt; have to build and perfect and finish.   The starting place is <br/>\n </span></blockquote>different.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I want my son to be happy and fulfilled.   I live with him the way I<br/>\n&gt; would live with a loved and respected friend or partner and I <br/>\n </span></blockquote>talk to him<br/>\n<blockquote><span title=\"ireply\"> &gt; the way I hope others have the kindness to talk to me.   I don&#39;t <br/>\n </span></blockquote>assume<br/>\n<blockquote><span title=\"ireply\"> &gt; his desires are less than mine because he&#39;s small I don&#39;t <br/>\n </span></blockquote>assume his<br/>\n<blockquote><span title=\"ireply\"> &gt; needs are not as important as mine or his problems are not <br/>\n </span></blockquote>as troubling<br/>\n<blockquote><span title=\"ireply\"> &gt; as mine because he&#39;s a child.    I knew he&#39;d need help getting <br/>\n </span></blockquote>where he<br/>\n<blockquote><span title=\"ireply\"> &gt; wanted to go, literally and figuratively.   I knew he&#39;d need <br/>\n </span></blockquote>protection<br/>\n<blockquote><span title=\"ireply\"> &gt; from harm until he could identify things that could hurt him and <br/>\n </span></blockquote>until he<br/>\n<blockquote><span title=\"ireply\"> &gt; could protect himself.   I didn&#39;t have him because I wanted help <br/>\n </span></blockquote>with<br/>\n<blockquote><span title=\"ireply\"> &gt; housework, and I didn&#39;t assume I was a better judge of what <br/>\n </span></blockquote>kind of<br/>\n<blockquote><span title=\"ireply\"> &gt; person he should.<br/>\n&gt; <br/>\n&gt; If any newbies have read this far, you can see you are not the <br/>\n </span></blockquote>only ones<br/>\n<blockquote><span title=\"ireply\"> &gt; who feel like you&#39;re wandering in a strange land.  Because <br/>\n </span></blockquote>when I hear<br/>\n<blockquote><span title=\"ireply\"> &gt; moms complain their kids won&#39;t do anything around the house <br/>\n </span></blockquote>or just want<br/>\n<blockquote><span title=\"ireply\"> &gt; to watch TV or are lazy or mean or uncooperative I feel like I&#39;m <br/>\n </span></blockquote>talking<br/>\n<blockquote><span title=\"ireply\"> &gt; to someone from another planet.    I get super annoyed with <br/>\n </span></blockquote>folks who<br/>\n<blockquote><span title=\"ireply\"> &gt; insult Sandra, because she devotes so much time to helping <br/>\n </span></blockquote>others<br/>\n<blockquote><span title=\"ireply\"> &gt; understand.   Every minute she&#39;s here answering questions <br/>\n </span></blockquote>and clarifying<br/>\n<blockquote><span title=\"ireply\"> &gt; ideas and giving examples is time spent away from her family <br/>\n </span></blockquote>and she&#39;s<br/>\n<blockquote><span title=\"ireply\"> &gt; not soliciting funds from anyone.   She has the determination <br/>\n </span></blockquote>to help<br/>\n<blockquote><span title=\"ireply\"> &gt; others get it that very few people have.   She&#39;s gone on and on <br/>\n </span></blockquote>helping<br/>\n<blockquote><span title=\"ireply\"> &gt; despite having answered questions a million times and <br/>\n </span></blockquote>despite being<br/>\n<blockquote><span title=\"ireply\"> &gt; abused and insulted.   She&#39;s a hero, in my opinion and if any <br/>\n </span></blockquote>new person<br/>\n<blockquote><span title=\"ireply\"> &gt; thinks getting unschooling is a difficult task helping people get <br/>\n </span></blockquote>it is<br/>\n<blockquote><span title=\"ireply\"> &gt; infinitely more difficult.    She made a choice to help others and <br/>\n </span></blockquote>she<br/>\n<blockquote><span title=\"ireply\"> &gt; makes it over and over again.   But people who come to learn <br/>\n </span></blockquote>about<br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling have made a choice too.  No one is helpless <br/>\n </span></blockquote>here, if new<br/>\n<blockquote><span title=\"ireply\"> &gt; people need more help or clarification then it&#39;s their <br/>\n </span></blockquote>responsibility to<br/>\n<blockquote><span title=\"ireply\"> &gt; say so.   New people don&#39;t have the right to blame anyone here <br/>\n </span></blockquote>if they<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t understand.  It&#39;s up to the seeker to find understanding.   <br/>\n </span></blockquote>No one<br/>\n<blockquote><span title=\"ireply\"> &gt; here is putting barriers in the way.<br/>\n&gt; <br/>\n&gt; For new people, try treating your children they way you would <br/>\n </span></blockquote>like to be<br/>\n<blockquote><span title=\"ireply\"> &gt; treated.   If you spilled milk on the floor, would you want <br/>\n </span></blockquote>someone<br/>\n<blockquote><span title=\"ireply\"> &gt; yelling at you about it, telling you to be more careful?   Wouldn&#39;t <br/>\n </span></blockquote>it be<br/>\n<blockquote><span title=\"ireply\"> &gt; nicer to have someone say, &quot;I&#39;m sorry, let me help you.&quot; ?    <br/>\n&gt; What is so difficult about treating children with respect?   <br/>\n&gt; <br/>\n&gt; Really, newbies are not the only ones dealing with frustrations <br/>\n </span></blockquote>here.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Deb L </span></blockquote></div>","specialLinks":[]},{"userId":82912732,"authorName":"cindyjsowers &lt;cindyjsowers@yahoo.com&gt;","from":"&quot;cindyjsowers &lt;cindyjsowers@...&gt;&quot; &lt;cindyjsowers@...&gt;","profile":"cindyjsowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New kid freedoms (a long ramble) and longer still...","postDate":"1044051552","msgId":57433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxZXNwMCtmZ2cwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMwMTMxLjE0MTcxNy4yMDcyLjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":57428,"nextInTopic":57434,"prevInTime":57432,"nextInTime":57434,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"... only ones ... hear ... just want ... talking ... who ... clarifying ... she s ... help ... helping ... person ... it is ... she ... new ... responsibility","messageBody":"<div id=\"ygrps-yiv-1340925215\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, Deborah Lewis <br/>\n&lt;ddzimlew@j...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; If any newbies have read this far, you can see you are not the <br/>\n </span></blockquote>only ones<br/>\n<blockquote><span title=\"ireply\"> &gt; who feel like you&#39;re wandering in a strange land.  Because when I <br/>\n </span></blockquote>hear<br/>\n<blockquote><span title=\"ireply\"> &gt; moms complain their kids won&#39;t do anything around the house or <br/>\n </span></blockquote>just want<br/>\n<blockquote><span title=\"ireply\"> &gt; to watch TV or are lazy or mean or uncooperative I feel like I&#39;m <br/>\n </span></blockquote>talking<br/>\n<blockquote><span title=\"ireply\"> &gt; to someone from another planet.    I get super annoyed with folks <br/>\n </span></blockquote>who<br/>\n<blockquote><span title=\"ireply\"> &gt; insult Sandra, because she devotes so much time to helping others<br/>\n&gt; understand.   Every minute she&#39;s here answering questions and <br/>\n </span></blockquote>clarifying<br/>\n<blockquote><span title=\"ireply\"> &gt; ideas and giving examples is time spent away from her family and <br/>\n </span></blockquote>she&#39;s<br/>\n<blockquote><span title=\"ireply\"> &gt; not soliciting funds from anyone.   She has the determination to <br/>\n </span></blockquote>help<br/>\n<blockquote><span title=\"ireply\"> &gt; others get it that very few people have.   She&#39;s gone on and on <br/>\n </span></blockquote>helping<br/>\n<blockquote><span title=\"ireply\"> &gt; despite having answered questions a million times and despite being<br/>\n&gt; abused and insulted.   She&#39;s a hero, in my opinion and if any new <br/>\n </span></blockquote>person<br/>\n<blockquote><span title=\"ireply\"> &gt; thinks getting unschooling is a difficult task helping people get <br/>\n </span></blockquote>it is<br/>\n<blockquote><span title=\"ireply\"> &gt; infinitely more difficult.    She made a choice to help others and <br/>\n </span></blockquote>she<br/>\n<blockquote><span title=\"ireply\"> &gt; makes it over and over again.   But people who come to learn about<br/>\n&gt; unschooling have made a choice too.  No one is helpless here, if <br/>\n </span></blockquote>new<br/>\n<blockquote><span title=\"ireply\"> &gt; people need more help or clarification then it&#39;s their <br/>\n </span></blockquote>responsibility to<br/>\n<blockquote><span title=\"ireply\"> &gt; say so.   New people don&#39;t have the right to blame anyone here if <br/>\n </span></blockquote>they<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t understand.  <br/>\n<br/>\n </span></blockquote>I think that that&#39;s a very good point.  I don&#39;t know Sandra, or <br/>\nanyone on the list personally at all.  I am a homebody for the most <br/>\npart and don&#39;t go out to conferences to meet other unschoolers or <br/>\nanything like that.  I have been reading from this list for awhile, <br/>\nand have interjected a few comments here and there, but I am <br/>\nbasically new to this list.  I joined it to get ideas really, and I <br/>\nhave gotten a lot of good ideas just by reading.  I don&#39;t agree with <br/>\nevery single thing every single person says, but I can take what I <br/>\nneed and don&#39;t really feel the need to argue.  <br/>\n<br/>\nI just wanted to say in response to the above, that I think that <br/>\npeople don&#39;t &quot;get&quot; that people who are already happily going about <br/>\ntheir business of unschooling, and it is working for them, don&#39;t <br/>\nreally need to discuss back and forth that much -- that they are <br/>\nprobably just putting in extra time to try to shed some light on the <br/>\ntopic for people who are just trying all this out.  It&#39;s like if you <br/>\nare good at something, you can tell other people what you are up to <br/>\nand maybe they can learn something from you.  So, in some ways, it&#39;s <br/>\na service they have been generous enough to offer to people who are <br/>\nlooking for information and ideas.  I don&#39;t think people look at it <br/>\nthat way.  <br/>\n<br/>\nAnyway, I think it&#39;s very generous of people to offer what they <br/>\nhave.  I appreciate it.<br/>\n<br/>\nCindy</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New kid freedoms (a long ramble) and longer still...","postDate":"1044047837","msgId":57428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMTMxLjE0MTcxNy4yMDcyLjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":57433,"prevInTime":57427,"nextInTime":57429,"topicId":57428,"numMessagesInTopic":0,"msgSnippet":"On Fri, 31 Jan 2003 12:05:15 EST SandraDodd@aol.com writes: ***Occasionally (like this week, most recently!) I feel really uncomfortable with the speed at","messageBody":"<div id=\"ygrps-yiv-1487454795\">On Fri, 31 Jan 2003 12:05:15 EST <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n***Occasionally (like this week, most recently!) I feel really<br/>\nuncomfortable <br/>\nwith the speed at which people are introduced to the most radical vision<br/>\nof <br/>\nliving respectfully with their children--***<br/>\n<br/>\nYes.   It must be like going from darkness to light in an instant and<br/>\nyou&#39;re left stunned and blinking there in the glare until you can adjust<br/>\nyour vision. <br/>\n<br/>\nWhat I am so uncomfortable with is the starting places are all different.<br/>\n  I sort of tend to assume everyone is starting at the same place and<br/>\nthey&#39;re not. <br/>\n<br/>\nI&#39;m not a smart person.  I&#39;m just average in everything, but I *get*<br/>\nunschooling.  I *get* living respectfully with children and if I can get<br/>\nit it seems anyone can.    I don&#39;t have the unfailing patience Joyce has<br/>\nnor the steadfast  dedication to helping others that Sandra has.    I&#39;m<br/>\nashamed that I get frustrated sometimes with new people, because I really<br/>\nDO respect people who are trying to get this.  I really DO admire people<br/>\nwho are trying to make life better for their kids.   Maybe I&#39;m just not<br/>\ngood at helping someone else get there.<br/>\n<br/>\nI don&#39;t understand why respecting children isn&#39;t simply the natural<br/>\nstarting point for mothers.   I know about religious teaching that say<br/>\nchildren are born with sin and I know about the long history of parenting<br/>\npractices and I know what society says about children.   I just don&#39;t<br/>\nknow why all of that isn&#39;t simply washed away the instant a new mother<br/>\nholds that new baby.   THAT&#39;s what I don&#39;t get.   And if this seems harsh<br/>\nor snarky please believe I don&#39;t mean it that way.    I&#39;m passionate<br/>\nabout unschooling.  I believe it can change the world.  I want everyone<br/>\nto get there.   <br/>\n<br/>\nMaybe because pregnancies before Dylan didn&#39;t culminate with a warm,<br/>\nsweet baby in my arms, or maybe because I was afraid of loosing him or<br/>\nmaybe because I knew he was the only child I would have I  cherished him<br/>\nfrom the start.    I didn&#39;t think for a minute that my job as a parent<br/>\nwas to make him obey or to teach him respect.   So, like Sandra we<br/>\nstarted from a place of really noticing he was a capable person, right<br/>\nfrom the start.   This is hard, because I seem to get the impression<br/>\noften that other parents think their kids are a project.  Something they<br/>\nhave to build and perfect and finish.   The starting place is different.<br/>\n<br/>\nI want my son to be happy and fulfilled.   I live with him the way I<br/>\nwould live with a loved and respected friend or partner and I talk to him<br/>\nthe way I hope others have the kindness to talk to me.   I don&#39;t assume<br/>\nhis desires are less than mine because he&#39;s small I don&#39;t assume his<br/>\nneeds are not as important as mine or his problems are not as troubling<br/>\nas mine because he&#39;s a child.    I knew he&#39;d need help getting where he<br/>\nwanted to go, literally and figuratively.   I knew he&#39;d need protection<br/>\nfrom harm until he could identify things that could hurt him and until he<br/>\ncould protect himself.   I didn&#39;t have him because I wanted help with<br/>\nhousework, and I didn&#39;t assume I was a better judge of what kind of<br/>\nperson he should.<br/>\n<br/>\nIf any newbies have read this far, you can see you are not the only ones<br/>\nwho feel like you&#39;re wandering in a strange land.  Because when I hear<br/>\nmoms complain their kids won&#39;t do anything around the house or just want<br/>\nto watch TV or are lazy or mean or uncooperative I feel like I&#39;m talking<br/>\nto someone from another planet.    I get super annoyed with folks who<br/>\ninsult Sandra, because she devotes so much time to helping others<br/>\nunderstand.   Every minute she&#39;s here answering questions and clarifying<br/>\nideas and giving examples is time spent away from her family and she&#39;s<br/>\nnot soliciting funds from anyone.   She has the determination to help<br/>\nothers get it that very few people have.   She&#39;s gone on and on helping<br/>\ndespite having answered questions a million times and despite being<br/>\nabused and insulted.   She&#39;s a hero, in my opinion and if any new person<br/>\nthinks getting unschooling is a difficult task helping people get it is<br/>\ninfinitely more difficult.    She made a choice to help others and she<br/>\nmakes it over and over again.   But people who come to learn about<br/>\nunschooling have made a choice too.  No one is helpless here, if new<br/>\npeople need more help or clarification then it&#39;s their responsibility to<br/>\nsay so.   New people don&#39;t have the right to blame anyone here if they<br/>\ndon&#39;t understand.  It&#39;s up to the seeker to find understanding.   No one<br/>\nhere is putting barriers in the way.<br/>\n<br/>\nFor new people, try treating your children they way you would like to be<br/>\ntreated.   If you spilled milk on the floor, would you want someone<br/>\nyelling at you about it, telling you to be more careful?   Wouldn&#39;t it be<br/>\nnicer to have someone say, &quot;I&#39;m sorry, let me help you.&quot; ?    <br/>\nWhat is so difficult about treating children with respect?   <br/>\n<br/>\nReally, newbies are not the only ones dealing with frustrations here.<br/>\n<br/>\nDeb L</div>","specialLinks":[]}],"prevTopicId":57391,"nextTopicId":57212}}