{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"ecsamhill@aol.com","from":"ecsamhill@...","replyTo":"LIST","senderId":"HaiYhUKzGJqJCmSg8BE1AZMgracif3ucQrEXiWPVdyBrtNggmbS6gqJoa_uKzx3rNgXSUe1tSzo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]hitting/spanking","postDate":"967995726","msgId":12514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2LjJiNTA4Y2UuMjZlM2NiNGVAYW9sLmNvbT4="},"prevInTopic":12509,"nextInTopic":0,"prevInTime":12513,"nextInTime":12515,"topicId":12501,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/3/2000 2:39:39 PM, hape2day@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-972022355\">In a message dated 9/3/2000 2:39:39 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hape2day@...\">hape2day@...</a> writes:<br/>\n<br/>\n&lt;&lt;Anyway, like I said before the problem I have with <br/>\nreplies to my inicial post is the accuations that seem to be implied <br/>\nnot the opinions themselves.&gt;&gt;<br/>\n<br/>\nFor the record, every spanking debate I have ever seen includes people <br/>\ncriticizing spanking as a method and people who spank (even occasionally) <br/>\nfeeling upset, as if they were personally reviled.  In the heat of the <br/>\nmoment, it&#39;s hard to be aware of subtleties, like the actual pronouns used in <br/>\na sentence.<br/>\n<br/>\n(And sometimes people do say &quot;You spank?  That&#39;s terrible&quot;.  But I don&#39;t <br/>\nthink THIS debate has dipped down to that personal level yet.  I can&#39;t speak <br/>\nfor any private flames that might have been mailed.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":0,"authorName":"Corallyn","from":"&quot;Corallyn &quot; &lt;hape2day@...&gt;","replyTo":"LIST","senderId":"mXl9aqDVvhvPksDPR9kEk8Fb2dT3Kf55nyCBqeuU3L7HqOL0x0wlG1NOtua6Q-pB_ks357EQM9-vhgzKN9XRyOZPDfouJNc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]hitting/spanking","postDate":"967991171","msgId":12509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhvdG4yMytnY2tmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk2LjkyZjE5ZWMuMjZlM2E4OGRAY3MuY29tPg=="},"prevInTopic":12501,"nextInTopic":12514,"prevInTime":12508,"nextInTime":12510,"topicId":12501,"numMessagesInTopic":0,"msgSnippet":"Julie, thank you for your open and honest opinion. I can understand your veiwpoint and on some levels I agree. There were a million different ways that I could","messageBody":"<div id=\"ygrps-yiv-772119224\">Julie, thank you for your open and honest opinion. I can understand <br/>\nyour veiwpoint and on some levels I agree. There were a million <br/>\ndifferent ways that I could have handled the situation and this is <br/>\nthe way I chose to handle it. Due to the place I was in at that of my <br/>\nlife and what I knew of my child at that time this is the way I felt <br/>\nhe would best understand the importance of the situation. I am not <br/>\nsaying that every person needs to handle this situation the same. <br/>\nEvery parent has the right to decide what is best for thier child. To <br/>\nbe honest if I were in the same exact situation knowing what I knew <br/>\nthen I would make the same decission again. However, every child is <br/>\ndifferent and thus every situation is different and people&#39;s <br/>\nknowledge changes over time. Put in the situation today I might <br/>\nhandle it differently. I can&#39;t really say. We don&#39;t spend much time <br/>\nin the mall these days due to the inconvenience not the scare of him <br/>\nrunning off. It isn&#39;t as big a concern of mine now knowing that my <br/>\nchildren know not to run off and are pretty well behaved and <br/>\nextremely helpful when it comes to doing the shopping. And when I say <br/>\nthey don&#39;t runn off I mean that they don&#39;t disappear for almost 30 <br/>\nmins in a packed store with no thought as to where their mother is. <br/>\nThey do tend to wander on down the isle of Walmart and look at the <br/>\nmerchandise. This is completely different from what he did in the <br/>\nmall that day. Anyway, like I said before the problem I have with <br/>\nreplies to my inicial post is the accuations that seem to be implied <br/>\nnot the opinions themselves. Corallyn<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a>, Jaam1224@c... wrote:<br/>\n&gt; Okay, I have been lurking on this thread for since the <br/>\nbeginning....because I did not want to be the one starting a flaming <br/>\nwar...however, now that it is in progress, I will jump right in <br/>\ntoo....THESE ARE MY OPINIONS! <br/>\n&gt; <br/>\n&gt; Carollyn,<br/>\n&gt; I am not saying you are abusing your child.  What a terrify <br/>\nsituation for you!  In that moment, I would of had to really restrain <br/>\nmyself from using spanking/hitting to show how very dangerous that <br/>\nsituation was..... Having said that, I feel that children do not <br/>\nthink like adults in many ways.  As healthy well adjusted big people, <br/>\nif someone hits us then we feel we have been wronged.  Even if it was <br/>\nbecause we did something that put ourselves in danger.  I would feel <br/>\nthere were more appropiate ways to express the severity of the <br/>\nsituation. I have the knowledge of life to think this way. <br/>\nUnfortuately, children do not have that advantage of experience, yet.<br/>\n As children, parents are the &quot;almighty&quot;.  Parents, are who children <br/>\nwant to become like....if my parents hit then hitting is okay <br/>\n(doesn&#39;t matter the logic behind it), if my parents swear then <br/>\nswearing is okay (no matter what the situation is), if my parent <br/>\nexplain very scary situations (using the flood of emotions that we <br/>\nparents feel, (like anger, fear, relief accompanied with tears of <br/>\nfear and strong severe tone of voice) when our children do these <br/>\nthings ) then that is appropiate too.  I don&#39;t feel they like they <br/>\nsay &quot;oooh, I must have DONE something very bad because Mommy <br/>\nhit/spanked me&quot;  The way children turn things around (because of <br/>\ntheir lack of life experiences) they say &quot;I am very bad because I <br/>\nwanted to do _______.  Mommy saids so.  So I deserve to be hit&quot;  No <br/>\nmatter how many times, I explain after the facts that led up to the <br/>\nhitting/spanking, this is still what children believe, even though <br/>\nthis is not the case....the seed is still planted for later in life <br/>\nincidents... Has my daughter been hit/spanked? sadly yes....does that <br/>\nmake it right?.....NO WAY, no matter what the situtions were.....my <br/>\ndh and I are working towards new parenting tools to use (ecspecially <br/>\nin these type of scary and important situations that require severity <br/>\nof some sort)  We explain to Ali that &quot;NO one has the right to hurt <br/>\nyour body, and that includes mommy spanking/hitting.  Please forgive <br/>\nme.&quot; then we go on to talk about the situation leading to the <br/>\nspanking/hitting and more appropiate ways to express our feelings and <br/>\nreally let the emotions flow, including me saying &quot;I feel so angry, I <br/>\nwant to hit you.  I need to be away from you for awhile.&quot;  I have <br/>\nseen my dd(3) tell her little brother and daddy, these very words. I <br/>\nhave also heard her tell Matthew (1), &quot;you don&#39;t have the right to <br/>\nhurt my body.  I am going away from you&quot; One way that children react <br/>\nlike adults is they get angry and focus on the hitting rather than <br/>\nthe situation that lead up to it....anyway, hope this helps.  This is <br/>\nwhat works in our family...<br/>\n&gt; Julie </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Jaam1224@cs.com","from":"Jaam1224@...","replyTo":"LIST","senderId":"sr42oPE0y7amDIpOtgJHT8eVHBJsv7RF39vzcsKlD2YLgYGYNdDY4PECnO9D9uU_lVPlQVmY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]hitting/spanking","postDate":"967986829","msgId":12501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2LjkyZjE5ZWMuMjZlM2E4OGRAY3MuY29tPg=="},"prevInTopic":0,"nextInTopic":12509,"prevInTime":12500,"nextInTime":12502,"topicId":12501,"numMessagesInTopic":0,"msgSnippet":"Okay, I have been lurking on this thread for since the beginning....because I did not want to be the one starting a flaming war...however, now that it is in","messageBody":"<div id=\"ygrps-yiv-1419192199\">Okay, I have been lurking on this thread for since the beginning....because I <br/>\ndid not want to be the one starting a flaming war...however, now that it is <br/>\nin progress, I will jump right in too....THESE ARE MY OPINIONS! <br/>\n<br/>\nCarollyn,<br/>\nI am not saying you are abusing your child.  What a terrify situation for <br/>\nyou!  In that moment, I would of had to really restrain myself from using <br/>\nspanking/hitting to show how very dangerous that situation was.....<br/>\n<br/>\nHaving said that, I feel that children do not think like adults in many ways. <br/>\n As healthy well adjusted big people, if someone hits us then we feel we have <br/>\nbeen wronged.  Even if it was because we did something that put ourselves in <br/>\ndanger.  I would feel there were more appropiate ways to express the severity <br/>\nof the situation. I have the knowledge of life to think this way.  <br/>\nUnfortuately, children do not have that advantage of experience, yet.<br/>\n<br/>\nAs children, parents are the &quot;almighty&quot;.  Parents, are who children want to <br/>\nbecome like....if my parents hit then hitting is okay (doesn&#39;t matter the <br/>\nlogic behind it), if my parents swear then swearing is okay (no matter what <br/>\nthe situation is), if my parent explain very scary situations (using the <br/>\nflood of emotions that we parents feel, (like anger, fear, relief accompanied <br/>\nwith tears of fear and strong severe tone of voice) when our children do <br/>\nthese things ) then that is appropiate too.  I don&#39;t feel they like they say <br/>\n&quot;oooh, I must have DONE something very bad because Mommy hit/spanked me&quot;  The <br/>\nway children turn things around (because of their lack of life experiences) <br/>\nthey say &quot;I am very bad because I wanted to do _______.  Mommy saids so.  So <br/>\nI deserve to be hit&quot;  No matter how many times, I explain after the facts <br/>\nthat led up to the hitting/spanking, this is still what children believe, <br/>\neven though this is not the case....the seed is still planted for later in <br/>\nlife incidents...<br/>\n<br/>\nHas my daughter been hit/spanked? sadly yes....does that make it <br/>\nright?.....NO WAY, no matter what the situtions were.....my dh and I are <br/>\nworking towards new parenting tools to use (ecspecially in these type of <br/>\nscary and important situations that require severity of some sort)  We <br/>\nexplain to Ali that &quot;NO one has the right to hurt your body, and that <br/>\nincludes mommy spanking/hitting.  Please forgive me.&quot; then we go on to talk <br/>\nabout the situation leading to the spanking/hitting and more appropiate ways <br/>\nto express our feelings and really let the emotions flow, including me saying <br/>\n&quot;I feel so angry, I want to hit you.  I need to be away from you for awhile.&quot; <br/>\n I have seen my dd(3) tell her little brother and daddy, these very words.  I <br/>\nhave also heard her tell Matthew (1), &quot;you don&#39;t have the right to hurt my <br/>\nbody.  I am going away from you&quot;<br/>\n<br/>\nOne way that children react like adults is they get angry and focus on the <br/>\nhitting rather than the situation that lead up to it....<br/>\n<br/>\nanyway, hope this helps.  This is what works in our family...<br/>\nJulie</div>","specialLinks":[]}],"prevTopicId":12442,"nextTopicId":12516}}