{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschooled Teen Questioning Preparedness","postDate":"1315398513","msgId":62815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2QjU2OTg5LUM5NUYtNDUwQi04NzI0LUI3QzhFODM3M0I5N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo0N2xmditrdGdpQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0N2xmditrdGdpQGVHcm91cHMuY29tPg=="},"prevInTopic":62807,"nextInTopic":0,"prevInTime":62814,"nextInTime":62816,"topicId":62801,"numMessagesInTopic":0,"msgSnippet":"-=- I think it was more of them asking why, if she was homeschooled, why she hadn t been taught these things, and her not really having the answer to that.","messageBody":"<div id=\"ygrps-yiv-722717317\">-=- I think it was more of them asking why, if she was homeschooled, why she hadn&#39;t been &#39;taught&#39; these things, and her not really having the answer to that. And these were people she cares about, and they care for her, so I guess that concerned her.-=-<br/>\n<br/>\nMaybe she would like to poke around in this stuff;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math\">http://sandradodd.com/math</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":342942830,"authorName":"jay.ford79","from":"&quot;jay.ford79&quot; &lt;jay.ford79@...&gt;","profile":"jay.ford79","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooled Teen Questioning Preparedness","postDate":"1315395903","msgId":62807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0N2xmditrdGdpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRFNjY5NzRFLjcwMzA3MDZAZWFydGhsaW5rLm5ldD4="},"prevInTopic":62804,"nextInTopic":62815,"prevInTime":62806,"nextInTime":62808,"topicId":62801,"numMessagesInTopic":0,"msgSnippet":"... LOL, Pam, that is what I told her.  That any time I tried to show her anything schooly, or bring out workbooks, etc in the early days, her eyes glazed","messageBody":"<div id=\"ygrps-yiv-1671785670\"><blockquote><span title=\"ireply\">&gt; Is that really her question? Because the answer is that making her do <br/>\n&gt; those things would have been a big waste of time, right?<br/>\n&gt; <br/>\n&gt; -pam<br/>\n<br/>\n </span></blockquote>LOL, Pam, that is what I told her.  That any time I tried to show her anything schooly, or bring out workbooks, etc in the early days, her eyes glazed over, and she didn&#39;t really want to know unless, well, she wanted to know.  :)<br/>\n<br/>\nShe has discussed &#39;learning math&#39; over the last year, but has resisted any offers and attempts to show her things (notation and such), other than asking for the GED work books. And I have given her the link to Khan academy online.  Now that she really wants to know, it should be easy because now she wants to know.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My boys both went to community college classes without knowing mathematical notation. Not without knowing anything about math. They were fine with math. They just had never seen school math.&lt;&lt;<br/>\n<br/>\n </span></blockquote>I think that&#39;s pretty much it with her.  They (her friends) showed her all of this school stuff and school math they had to do, and suddenly she was feeling inadequate because she started thinkng she didn&#39;t know how to do those things because a) she hadn&#39;t been to school and b) nobody made her do them.  I think it was more of them asking why, if she was homeschooled, why she hadn&#39;t been &#39;taught&#39; these things, and her not really having the answer to that.  And these were people she cares about, and they care for her, so I guess that concerned her.<br/>\n<br/>\nI am confident in her abilities, and I know that school would have crushed her, especially when she was younger.  I have no doubts unschooling has been right for our family.<br/>\n<br/>\nThanks for the links.<br/>\n<br/>\n<br/>\nJon</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooled Teen Questioning Preparedness","postDate":"1315347523","msgId":62804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlDOTgwOUVCLThBQzItNEU1OC04M0M2LUFDNDJCNjFBQzk4MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo0NjNybis4MjBjQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0NjNybis4MjBjQGVHcm91cHMuY29tPg=="},"prevInTopic":62803,"nextInTopic":62807,"prevInTime":62803,"nextInTime":62805,"topicId":62801,"numMessagesInTopic":0,"msgSnippet":"In a discussion a bit similar, on facebook, a local friend of mine just wrote Two of my college friends married each other after graduating with $100k","messageBody":"<div id=\"ygrps-yiv-306558602\">In a discussion a bit similar, on facebook, a local friend of mine just wrote &quot;&quot;Two of my college friends married each other after graduating with $100k degrees in English and Art respectively. Last time I was in touch with them, they were answering phones at an auto insurance company call center. Education really doesn&#39;t predict occupation at all.&quot; &quot;<br/>\n<br/>\nI bet they did great in math!  They probably use math at work now, and they probably use math to calculate how long it will take to pay back their college loans with interest.<br/>\n<br/>\nMy boys both went to community college classes without knowing mathematical notation.  Not without knowing anything about math.  They were fine with math.  They just had never seen school math.<br/>\n<br/>\nThey took the accuplacer test and didn&#39;t test into the lowest math class, or the second lowest either one.  They didn&#39;t do well enough to take 121, the first for-college-credit math class, either.   Each was in a full classroom of kids who had taken school math for 12 years, more or less.  Each of my boys got an A, and not all of those schooled-in-math kids did.<br/>\n<br/>\nMarty is taking macroeconomics and said there&#39;s more math than the intro to economics he took last semester.  He said they were all told that if someone&#39;s in that class and can&#39;t cut it or doesn&#39;t like it at all, they should probably not pursue or continue in an economics degree.  He said many are business students required to take that for their degree.  He was helping the guys to either side of him today with variables and graphs.<br/>\n<br/>\nMarty might or might not &quot;do something&quot; (for money, I mean) with math.  He&#39;s interested in engineering, overall.  His dad and granddad are/were engineers, and it&#39;s a natural, easy interest for them.<br/>\n<br/>\nHere&#39;s something I wrote for a German magazine.  I can&#39;t read it in German, but if you can there&#39;s a link there to the way it was published.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/unerzogen\">http://sandradodd.com/math/unerzogen</a><br/>\n<br/>\nIt was three years ago.  The Marty stuff above hadn&#39;t happened yet.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooled Teen Questioning Preparedness","postDate":"1315346304","msgId":62803,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwM0Y0MkM2LTQ4QTMtNDBGNi1BQ0E0LTNDNkExRTI3Q0MzQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo0NjNybis4MjBjQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0NjNybis4MjBjQGVHcm91cHMuY29tPg=="},"prevInTopic":62802,"nextInTopic":62804,"prevInTime":62802,"nextInTime":62804,"topicId":62801,"numMessagesInTopic":0,"msgSnippet":"If the moms involved in either of these examples read this, don t say Oh, that was me.  It doesn t matter.  I m bringing them for the ideas and not for the","messageBody":"<div id=\"ygrps-yiv-629470157\">If the moms involved in either of these examples read this, don&#39;t say &quot;Oh, that was me.&quot;  It doesn&#39;t matter.  I&#39;m bringing them for the ideas and not for the families or situations.<br/>\n<br/>\nBy e-mail I wrote this the first paragraph.<br/>\nThe quoted paragraph was a mom&#39;s response.  <br/>\nUnder that is a story.  The &quot;recently&quot; was in a Q&A section of a conference presentation I gave this summer.   It was the mom saying the dad wasn&#39;t there, but really wanted to know how he could cause the daughter to commit to music lessons and regular practice times.<br/>\n=============================================<br/>\n<br/>\nMartial arts classes can help, IF they are traditionally based, and not just street-fighting things.  Yoga can help.  Things that have to do with physical strength and prowess and breathing.   They could help your husband.  They could probably help your whole family.   I don&#39;t do that though; I&#39;m all words and music.   My oldest was the hot-headed kid but it&#39;s hard to remember, and hard for outsiders to believe, because he went to karate for years and years and is very calm because of that, and of us coaching him to breathe and help make situations better, not worse.<br/>\n<br/>\n-=-I think it would be so beneficial to him in so many ways but any ideas how to get him there regularly without him feeling pushed into it?-=-<br/>\n<br/>\nPull, don&#39;t push.  You go, too.  Find a mixed-ages class and let it be a parent/child activity, you or your husband.<br/>\n<br/>\nRecently someone asked me how to make a kid practice an instrument or persuade her it was important.  I asked what instruments the parents played.  None.  None?  Then clearly it is NOT important.<br/>\n<br/>\nSandra<br/>\n======================<br/>\n<br/>\nSo if a teen can&#39;t do math, the parents should show her the math THEY do.  Tax forms.   Banking.  Car repair?  Tent-making or sewing?  Building a deck? Quantity cooking?  (Those last few are things that have happened here that involved math.  Well the first two were, too.)  Recently Holly and I ordered magnets to sell at the Good Vibrations Conference (and later by mail, but not yet), and part of the discussion was how many to order, and how much to sell them for.  <br/>\n<br/>\nAs to reports, ask her what she would be reporting.  School reports are not real reports.  They&#39;re not real writing.  They&#39;re practice, play-like pretend.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/myths\">http://sandradodd.com/myths</a><br/>\n<br/>\nA real report is writing something you know about for someone who wants to know it.<br/>\n<br/>\nIf parents don&#39;t do it, should kids?  <br/>\nI write reports on conferences, on what I&#39;ve seen (travel blogs, quite a big last summer in the UK and last fall in India), I build webpages with related ideas and links at the bottom, and then I announce that I&#39;ve done that.<br/>\n<br/>\nHere&#39;s one that needs an addition; it&#39;s on my list to update and then announce again.  It has one new thing that Pam just wrote the other day.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/writing\">http://sandradodd.com/writing</a><br/>\n<br/>\nOnline reviews of books and music are reports.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooled Teen Questioning Preparedness","postDate":"1315346254","msgId":62802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFNjY5NzRFLjcwMzA3MDZAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGo0NjNybis4MjBjQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0NjNybis4MjBjQGVHcm91cHMuY29tPg=="},"prevInTopic":62801,"nextInTopic":62803,"prevInTime":62801,"nextInTime":62803,"topicId":62801,"numMessagesInTopic":0,"msgSnippet":"... Is that really her question? Because the answer is that making her do those things would have been a big waste of time, right? -pam","messageBody":"<div id=\"ygrps-yiv-1634090876\">On 9/6/2011 2:37 PM, jay.ford79 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; She is asking why I never made her do these things.<br/>\n<br/>\n </span></blockquote>Is that really her question? Because the answer is that making her do <br/>\nthose things would have been a big waste of time, right?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":342942830,"authorName":"jay.ford79","from":"&quot;jay.ford79&quot; &lt;jay.ford79@...&gt;","profile":"jay.ford79","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooled Teen Questioning Preparedness","postDate":"1315345079","msgId":62801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0NjNybis4MjBjQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62802,"prevInTime":62800,"nextInTime":62802,"topicId":62801,"numMessagesInTopic":0,"msgSnippet":"Always unschooled teen recently spent a big chunk of time with teens that are traditionally schooled.  Now she is thinking she is very far behind, because she","messageBody":"<div id=\"ygrps-yiv-1454163487\">Always unschooled teen recently spent a big chunk of time with teens that are traditionally schooled.  Now she is thinking she is very far behind, because she &#39;can&#39;t do math&#39; and believes she couldn&#39;t write a school report.  She is asking why I never made her do these things.  I have no doubt she is fully capable of doing these things.  She has written HTML code, headed up role-play sites, writes a lot online, is well traveled (including internationally), etc. <br/>\n<br/>\nWe are going to sit down and go over math notation (after I gave her a few random real life problems which she figured out immediately).  What can you say to show her she really does know more than she thinks?  She has taken some GED practice tests in other subjects and found them easy.  Thoughts?<br/>\n<br/>\n<br/>\nJon</div>","specialLinks":[]}],"prevTopicId":62730,"nextTopicId":62806}}