{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What We Did","postDate":"1053125977","msgId":69438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJhM3FncCszMnFyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":69437,"nextInTime":69439,"topicId":69438,"numMessagesInTopic":0,"msgSnippet":"Hi people Just thought I d post a What Our Day Was Like post, only it ll cover a few days. How s that? We have about a dozen batches of glop around the","messageBody":"<div id=\"ygrps-yiv-640275033\">Hi people<br/>\n<br/>\nJust thought I&#39;d post a &quot;What Our Day Was Like&quot; post, only it&#39;ll <br/>\ncover a few days. How&#39;s that?<br/>\n<br/>\nWe have about a dozen batches of glop around the place. That gooey <br/>\nstuff recipe is SO simple, and really easy to clean up after, that <br/>\nthe kids have used up pretty much all the glue in the house, making <br/>\ndifferent colors of glop. Purple, that Katie and a friend made and <br/>\ndivvied up; reddish brown so it looked like guts; brownish green so <br/>\nit looked like stomach fluid (according to Robby, who made those <br/>\nbatches); teal that Abbie made, and a batch of black to look like <br/>\ntar. <br/>\n<br/>\nKatie has been very busy with a daily &quot;shop&quot; out front: lemonade and <br/>\ncookies so far, but we&#39;ll bake a batch of bagels for her to offer the <br/>\npublic ;) She designed a sign for it on the computer, and then <br/>\nexecuted her plan on a big piece of plywood, and has that propped <br/>\nagainst the legs. She sold a bunch of lemonade to the migrant workers <br/>\nacross the road, on her first day, and a farmer advised us not to try <br/>\nand retire on the proceeds from her shop! L &quot;Don&#39;t quit yer day job!&quot; <br/>\nShe made $1.60 that day, and today nothing, though not for lack of <br/>\neffort. That&#39;s been keeping her busy for a few days. <br/>\n<br/>\nOn Wednesday afternoon, she and a friend went up in the treehouse and <br/>\npainted, and they&#39;re heading up there again right now to do some <br/>\nmore. On Weds, my hubby also hung hummingbird feeders and I made a <br/>\ndecision about sugar water instead of honey water :( but honey is SO <br/>\nexpensive. $20 a gallon, and that&#39;s before prices started soaring.<br/>\n<br/>\nWeds night and all day Thursday, I went to SLC with a girlfriend who <br/>\nmakes glass beads, to a wholesale show/shopping expo. She wanted <br/>\ncompany for the drive down, and I wanted a chance to see my <br/>\ngrandbaby, so we did that. Wonderful, beautiful Aidan the Perfect! <br/>\n<br/>\nOh, I bought a strand of round stone beads, of various stones at the <br/>\nbead show. Lots of potential, in all those different types of beads. <br/>\nEarrings, possibly a simple necklace.<br/>\n<br/>\nGot home really late on Thursday night, and spent the morning <br/>\nreading. Kids slept in, from waiting up for me. And Robby has been <br/>\ngone all day on an odd job with his dad, while the girls and I have <br/>\nbeen home. Abbie&#39;s re-reading Harry Potter IV and I&#39;m reading some <br/>\nModern Fiction (which I haven&#39;t done in AGES: read for pleasure? not <br/>\nin a LONG time). <br/>\n<br/>\nToday, while Abbie was at Drama, Katie and I played in the park. You <br/>\nknow, this group has been good for me, because I&#39;m seeing &quot;say yes to <br/>\nyour kids&quot;   &quot;spend time with your kids&quot;   &quot;be there beside your kids <br/>\nworking and playing and talking&quot;   I am reading a pretty good novel <br/>\n(Sea Glass by Anita Shreve) and would have been content to sit and <br/>\nread while Katie played. And, while the school group of little kids <br/>\nwas there, that&#39;s what I did. But then the school group left, and I <br/>\nlistened to the Unschooling Yahoo Group in My Head. Got up and slid <br/>\ndown the slide with her! It&#39;s a very fast, spiral slide, and we did a <br/>\ntrain SO FAST that we ended up in a pile on the ground. Then we found <br/>\na plastic dome thingy (like, for a fast food salad or something?) and <br/>\ndug down to find the moist sand, and built mountains. If you put dry <br/>\nsand in the middle of a packed moist sand mountain, you get a cave! <br/>\nand a cave in...<br/>\n<br/>\nThat sand felt so good on my hands. Cool and heavy. I wouldn&#39;t have <br/>\ndone that if You All weren&#39;t there telling me &quot;Play with your kids!&quot; <br/>\nThanks for doing that!<br/>\n<br/>\npeace, HeidiC</div>","specialLinks":[]}],"prevTopicId":68694,"nextTopicId":69452}}