{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":118475879,"authorName":"Rebeca Zavaleta","from":"&quot;Rebeca Zavaleta&quot; &lt;rzavaleta@...&gt;","profile":"energmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling from birth, was Can unschooling be unschooled?","postDate":"1086763817","msgId":95534,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PCF+IVVFTkVSa1ZDTURrQUFRQUNBQUFBQUFBQUFBQUFBQUFBQUJnQUFBQUFBQUFBL2R6UWdCZTNjazZ1Tmdtbm40WFV1TUtBQUFBUUFBQUF1VUEzbXdSemxrK3F5VkljOXhuK01BRUFBQUFBQHNvY2FsLnJyLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":95533,"nextInTime":95535,"topicId":95534,"numMessagesInTopic":0,"msgSnippet":"There s the above reason, but there s also a sense of the continuity of trusting a child to learn and providing a warm, supportive atmosphere that doesn t","messageBody":"<div id=\"ygrps-yiv-608075740\">&quot;There&#39;s the above reason, but there&#39;s also a sense of the continuity of<br/>\ntrusting a child to learn and providing a warm, supportive atmosphere that<br/>\ndoesn&#39;t stop just because children reach compulsory school age. So often<br/>\nwe&#39;ll say to new unschoolers or those thinking about it, &quot;how did your child<br/>\nlearn to walk, to talk, etc.&quot;. In that sense most of us do unschool our<br/>\nchildren from birth--some just lose that sense of trust and give in to the<br/>\nanxiety-producing rhetoric of experts.&quot;<br/>\n<br/>\n <br/>\n<br/>\n--Danielle<br/>\n<br/>\n <br/>\n<br/>\nI&#39;ve been thinking about your post and how it relates to my family&#39;s<br/>\nevolution as unschoolers.  My daughter was in the public school system from<br/>\nage 3.  She was &quot;labeled&quot; with a neurological disorder.  That label did help<br/>\nme find information and learn why she experienced the world differently.<br/>\nWhen you&#39;re in a situation like that you are so hungry for info.  I believed<br/>\nthe &quot;experts&quot; in the medical and school community.  I became the &quot;expert&quot;<br/>\nfor my daughter.  I fought school officials to make sure that she was well<br/>\ncared for (and they complied, but it was always a fight).  2 years ago I<br/>\ndecided that I knew what was best, and that a radical change was needed<br/>\nbecause she was so unhappy.  If I had known about homeschooling earlier, it<br/>\nwould have been a blessing.  She needed her family 24 hours a day.  She<br/>\nneeded to be close to us to help her.  She told me that in a variety of ways<br/>\nand the answers I found were never enough.  She needed me, her mom, all day<br/>\nlong.  <br/>\n<br/>\n <br/>\n<br/>\nI homeschooled her (schooled her at home) and found that amazingly all her<br/>\ncoping problems and learning disabilities shrunk away.  After a year and a<br/>\nhalf we discovered that she could learn at her own pace, on her own with<br/>\nminimal support.  She had to be given permission, in a way, to think for<br/>\nherself and believe in herself.  While we were doing a reading comprehension<br/>\nexercise in the beginning days she said &quot;Mommy can I look around the room?&quot;<br/>\nOf course, this is your house, what are you talking about?  &quot;Because I was<br/>\nnever allowed to look around at school.  They would get upset with me.  I<br/>\nwasn&#39;t allowed.&quot; <br/>\n<br/>\n <br/>\n<br/>\nHer brother was in Kindergarten and VERY bored with it.  He was a model<br/>\nstudent, but told me it was KILLING him.  He could see me taking a radical<br/>\nnew approach with his sister, so he decided that school was not for him on<br/>\nhis own.  He was able to articulate why school was dampening his spirit -<br/>\nfor instance, he would say that if he wanted to stand and eat lunch, he<br/>\nwasn&#39;t allowed to.  If he didn&#39;t want to eat, it didn&#39;t matter, he still had<br/>\nto.  But he noticed that if you are sneaky and throw your unwanted lunch out<br/>\nunnoticed, then you could play.  These things and many more bothered him.<br/>\n<br/>\n <br/>\n<br/>\nUntil I started unschooling, I knew NOONE who did it.  I was totally alone.<br/>\nTrusting your gut is SO important.  Acting on your convictions is even MORE<br/>\nimportant.  I&#39;m so glad that I am able to pass along what I&#39;ve recently<br/>\nlearned as an adult to my young children.  It is so heartwarming to hear of<br/>\nothers who can see situations clearly, through the rhetoric.  Children are<br/>\nnot small adults, pets or furniture.  They are treasures.  They belong at<br/>\nhome with their families, learning and laughing.<br/>\n<br/>\n <br/>\n<br/>\nDanielle, you&#39;re right, unschooling does begin at birth.  And it can be<br/>\nunschooled.  My family is proof.<br/>\n<br/>\n <br/>\n<br/>\nRebeca Z.  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":93301,"nextTopicId":95465}}