{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":52,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337990430","msgId":67303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJENjRFQzk0LUI4QUItNDBGQy05MUVFLTlBRUI4M0M1MzgzNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpwb2I5bitsamM0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwb2I5bitsamM0QGVHcm91cHMuY29tPg=="},"prevInTopic":67300,"nextInTopic":67311,"prevInTime":67302,"nextInTime":67304,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"-=-There is alot of research on the health importance of this and if you want more detials please feel free to email me directly. -=- The purpose of this group","messageBody":"<div id=\"ygrps-yiv-821780737\">-=-There is alot of research on the health importance of this and if you want more detials please feel free to email me directly. -=-<br/>\n<br/>\nThe purpose of this group is to discuss unschooling.  People want ideas from experienced unschoolers.<br/>\nIt&#39;s not a place to solicit people for personal services or businesses.<br/>\n<br/>\n-=-I would also like to point out that more than 30 minutes of TV can be way overwhelming to a child&#39;s brain. The lights are so stimulating that eventually the brain shuts down and can&#39;t learn anymore, so I would limit that. -=-<br/>\n<br/>\nThere are places where people will appreciate this kind of suggestion, but the Always Learning discussion list isn&#39;t one of them.<br/>\n<br/>\nI let this post through, even though I don&#39;t think it will help people understand unschooling.  <br/>\n<br/>\n-=-Sure they are lots of educational videos that are great and there is a time and place for a fun family movie, but letting your kids watch hours of TV is not going to stimulate their minds. -=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/movies\">http://sandradodd.com/movies</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\n-=-. If they are reverting to the TV all day they are probably just bored and need your help guiding them into more engaging activities. -=-<br/>\n<br/>\nFew unschoolers watch TV all day.  If unschooling is working well, they&#39;re unlikely to be bored. If they&#39;re choosing TV from among choices, it&#39;s a legitimate choice.<br/>\n<br/>\n-=- them in and be interesting to them. If they are reverting to the TV all day they are probably just bored and need your help guiding them into more engaging activities. Draw them into the things you are doing...&quot;why don&#39;t you stack the plates and your sister can stack the bowls from the dishwasher, let&#39;s count them, now what would half the plates equal, what if we dropped 2, then how many would we have?&quot; -=-<br/>\n<br/>\nIs that what you were doing? Counting your dishes?  You don&#39;t need to have a math class about &quot;what if.&quot;  Let your children learn naturally without quizzing.<br/>\n<br/>\n-=- You can educate them with the simple things in life-=-<br/>\n<br/>\nYou don&#39;t need to educate children.  Unschooling is about learning and they will learn.<br/>\n<br/>\n-=- ...and involve them in the household rather than letting the TV try to engage them. Little things like that will build your relationship with your kids as you do life together. -=-<br/>\n<br/>\nMy children never went to school.  They were unschooled throughout.  I never &quot;did life&quot; with any of them.  We lived together.  They lived full lives in their own homes with their parents, lovingly.  I didn&#39;t need to &quot;involve them in the household.&quot;  They WERE part of our household.  I didn&#39;t need to build a relationship with them.  It was never eroded.<br/>\n<br/>\nThese ideas are important.<br/>\n<br/>\n-=-Unschooling means you educate your children with their passions as a guiding force-=-<br/>\n<br/>\nThe way it&#39;s discussed on this list (and has been for ten and a half years) is that unschooling means learning together as a family, in joy, with a sense of wonder and gratitude.  Not separately.   It&#39;s about learning, not about &quot;education.&quot;<br/>\n<br/>\n-=- As the parents, we still have to set healthy boundaries, entice them to explore new things and turn every situation into an opportunity for learning-=-<br/>\n<br/>\n&quot;Have to&quot; is a problem in these discussion. You can choose lots of things, but you don&#39;t &quot;have to.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nIf life is full of learning, every situation does NOT need to be turned into an opportunity for learning.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337988024","msgId":67300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzc5ODgwMjQuNTA3OTQuWWFob29NYWlsTmVvQHdlYjgxNTA2Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpwb2I5bitsamM0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwZzk4bitqbWhrQGVHcm91cHMuY29tPiA8anBvYjluK2xqYzRAZUdyb3Vwcy5jb20+"},"prevInTopic":67299,"nextInTopic":67303,"prevInTime":67299,"nextInTime":67301,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-503240933\">&lt;&lt;&lt;&lt;&quot;Children really need to go to bed between 7 - 9 pm depending on the age and if it&#39;s daylight savings time etc. Just watch the sun and when it goes down try to let the kids wind down by dimming the lights, turning off the TV (way too stimulating at night), playing soft music, warm baths, massage, story time etc. - whatever works for your family. There is alot of research on the health importance of this and if you want more detials please feel free to email me directly. &quot;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI think it is a good idea to create an environment that is conducive to sleeping for kids so they can relax and it helps them fall asleep.<br/>\nWhat kids really need is enough sleep. Some kids will naturally go to sleep earlier. Some  like to stay up later just like adults.<br/>\nI know kids that choose to go to bed early and kids that stay up late or even all night.<br/>\nIt may work for the parents to get their kids to sleep  at a certain time but going to bed does not mean they will be sleeping at all.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/sleeping%c2%a0\">http://sandradodd.com/sleeping%c2%a0</a><br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&quot;Moving bedtime up won&#39;t happen overnight, but I would make that my first priority if I were in your shoes. You will benefit from having some quiet time in the evenings and they will benefit by having more sleep or at least the deeper sleep that comes before midnight even if they still get the same number of hours.&quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI do not sleep deep before midnight!!!! i sleep better between 6 and 8 AM.  It has always been like that for me.  Getting kids in bed early  is not the only way mom can get some quiet time. She can get up a little earlier and get that time too. She can send them to school and get some quiet time !<br/>\n <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&quot;If I let her sleep in my bed she would never go to sleep either because the stimulation of having other people around would keep her awake (food for thought).&quot;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifilet%c2%a0\">http://sandradodd.com/ifilet%c2%a0</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&quot;I would also like to point out that more than 30 minutes of TV can be way overwhelming to a child&#39;s brain. The lights are so stimulating that eventually the brain shuts down and can&#39;t learn anymore, so I would limit that. Sure they are lots of educational videos that are great and there is a time and place for a fun family movie, but letting your kids watch hours of TV is not going to stimulate their minds. Try setting up stations in your house to explore like a craft station, a little gardening area outside with child sized safe tools, a cozy reading corner, a music station with books on tape and a CD player and/or some fun instruments...whatever you think will draw them in and be interesting to them. If they are reverting to the TV all day they are probably just bored and need your help guiding them into more engaging activities. Draw them into the things you are doing...&quot;why don&#39;t you stack the plates and your sister can stack the bowls from the<br/>\n dishwasher, let&#39;s count them, now what would half the plates equal, what if we dropped 2, then how many would we have?&quot; You can educate them with the simple things in life and involve them in the household rather than letting the TV try to engage them. Little things like that will build your relationship with your kids as you do life together. &quot;&gt;&gt;&gt;&gt;&gt;<br/>\n A couple times a year someone comes to this list and goes on about how TV will damage your child&#39;s brains and that you should limit and on. |IF you are new to this list please read here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv%c2%a0\">http://sandradodd.com/tv%c2%a0</a><br/>\n<br/>\n<br/>\nTV has been an invaluable resource in our home. Just one more of the many. We love TV and my kids are very smart, healthy and happy. I am happy that I just got another bigger TV for my daughter free on Craigslist yesterday. She likes to watch a video in bed , I usually read and she watched and we go to sleep. It helps her relax.While the same child is out most of the day helping her dad with chores in the farm she could be in the house watching on of our ( now) 5 TV;s connected to satelite and hundreds of channels  and Netflix!!!!!!<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":523283422,"authorName":"beingfree4meand3@att.net","from":"&quot;beingfree4meand3@...&quot; &lt;beingfree4meand3@...&gt;","profile":"beingfree4meand3@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: sleep habits & my outbursts","postDate":"1337963393","msgId":67296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwb2MyMStxNDNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwZ2o0OCtvOGZqQGVHcm91cHMuY29tPg=="},"prevInTopic":67292,"nextInTopic":67299,"prevInTime":67295,"nextInTime":67297,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"-=-I don t why you need to be inside for them to watch - is it that they need more attention from you?-=- I m not really sure what you mean by being inside for","messageBody":"<div id=\"ygrps-yiv-1676025640\">-=-I don&#39;t why you need to be inside for them to watch - is it that they need more attention from you?-=-<br/>\n<br/>\nI&#39;m not really sure what you mean by being inside for them to watch unless you mean to take the computer (which is our &quot;tv&quot; we physically don&#39;t have tv/cable) outside & watch, which we could do.  Yes, it is that they need more attention from me.  I&#39;m not always in the same room or engaging in any type of conversation with them.  <br/>\n<br/>\n<br/>\n-=-Here&#39;s a question - are you saying &quot;do you want to go?&quot; over and over, or getting everything ready and saying &quot;time to go!&quot; in a cheerful, fun voice? Sometimes offering a choice at the wrong moment backfires - they don&#39;t want to rethink, they want to Do. So assume they still want to go and help that happen. Don&#39;t make it a battle, though, make it a case of you being their pal, helping them get moving to do something they want to do.-=<br/>\n<br/>\nYes I am saying it over & over again, but didn&#39;t realize it until you prompted the question.  And I can see, now, where I do that in more areas of our lives - nag.  However at the same time, when I am getting us ready to do something, I get help requests, which I fulfill, or they want me to play with them, so I do, and then one or another will ask when we can GO while one or another still wants me to play & then that&#39;s when frustration, crying, anger comes in for all of us because we are no closer to &quot;going&quot; than we were before.  Upon reading this over I&#39;m guessing that it might stem from lack of attention.<br/>\n<br/>\n-=-&quot;Your one on one time&quot; isn&#39;t a worthy goal, then. If you were doing things with them throughout the day (things they are already doing; join in) you wouldn&#39;t need one on one time, and wouldn&#39;t need to schedule it.   &quot;Let&#39;s do some time!&quot; sounds like prison.  Parents and children should not be &quot;doing time.&quot;-=-<br/>\n<br/>\nI didn&#39;t (& don&#39;t) know how to balance my time with 3 little ones, and because I&#39;m alone with them most of the day & night, it was suggested doing the one-on-one.  But over time that has back-fired because now it&#39;s like keeping tabs on how much time is being spent with me.  One will say that I never do anything with him/her because I&#39;m always doing something with another, which it usually is the twins referring to my youngest, or it&#39;s my son referring to the girls.  Or, if my youngest is sitting on my lap & one of the twins asks me for something, she will not let me go to help them.  I can carry her with me to help the other, but sometimes it&#39;s a bit more than that & not possible.  I do tell her that I will be back & she can sit on my lap again, but she still resists & cries, etc.  So, you can see there is this huge insecurity/lack of attention, and, yes, I do take full responsibility for there &quot;behaviors.&quot;  But I see that, like you said,  JOIN IN & BE with them, and maybe that will help with the insecurity in them.  And then when one or two, etc says or motions do to something with me, it won&#39;t be a big deal (for them) to see me doing something with someone else because they (the other) will know that I will be there for them as well and do something with them too.  By no means am I hoping to do &quot;this&quot; in order to get &quot;this&quot; result - I just want them to know (by me showing) that I do love them & want to be with them too.   <br/>\n<br/>\n<br/>\n-=-If you shift your own sleep schedule to match theirs, it will help to look for things that happen later in the day. They will be different things than morning things - you get to stretch your thinking a little and discover something new.-=-<br/>\n<br/>\nI have shifted my sleep schedule to theirs, and although I still wake up earlier, I do so naturally, and am not so tired at night & am able to watch a movie in bed with them before lights go out.  It&#39;s much more peaceful.  And, yes, I get to stretch my thinking!:-)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;beingfree4meand3@&quot; &lt;beingfree4meand3@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; -=-Do you offer more enticing things than  <br/>\n&gt; &gt; DVD&#39;s and YouTube?-=- <br/>\n&gt; &gt; Yes & No.  I tell them I&#39;m going outside - to clean out the pool & refill it, to hang out, to do the gardening, to look in the garage - sometimes they come for a bit, but usually they scream to have me come back inside (so they can keep watching).<br/>\n&gt; *****************<br/>\n&gt; <br/>\n&gt; I don&#39;t why you need to be inside for them to watch - is it that they need more attention from you? <br/>\n&gt; <br/>\n&gt; Rather than just saying &quot;I&#39;m going to do x&quot; invite them - come up with fun ideas of things to do outside and invite them alone. They&#39;ll still say no some of the time, especially if tv has been limited in the past and/or if  you&#39;ve been in the habit of creating &quot;teachable moments&quot;. <br/>\n&gt; <br/>\n&gt; &gt;&gt;  I took them to the zoo, but then again it was after they watched for most of the morning - it wasn&#39;t until I mentioned that the zoo will be closing in 3 hours then 2 1/2 hrs - then we went.<br/>\n&gt; ****************<br/>\n&gt; <br/>\n&gt; Drop the negative &quot;it wasn&#39;t until&quot; dialog. You went to the zoo And they got to watch tv. Hooray! <br/>\n&gt; <br/>\n&gt; Here&#39;s a question - are you saying &quot;do you want to go?&quot; over and over, or getting everything ready and saying &quot;time to go!&quot; in a cheerful, fun voice? Sometimes offering a choice at the wrong moment backfires - they don&#39;t want to rethink, they want to Do. So assume they still want to go and help that happen. Don&#39;t make it a battle, though, make it a case of you being their pal, helping them get moving to do something they want to do. <br/>\n&gt; <br/>\n&gt; &gt; Also, what does one do while watching shows together??<br/>\n&gt; <br/>\n&gt; Things that don&#39;t involve talking. Puzzles. Knitting. Sorting things. Folding laundry. Art/craft stuff. Play-dough. Menu planning. Mending. Tidy up the room. If you&#39;re not interested in the show, read a book or magazine, or look at catalogs. If they&#39;re all watching tv, that&#39;s a good time to use the computer - especially if its in the same room. <br/>\n&gt; <br/>\n&gt; &gt;They say they want to go, but when I try to wake them up, I can&#39;t.  Then they cry & blame me for not getting them up earlier.<br/>\n&gt; *****************<br/>\n&gt; <br/>\n&gt; If you shift your own sleep schedule to match theirs, it will help to look for things that happen later in the day. They will be different things than morning things - you get to stretch your thinking a little and discover something new. If the farmers market doesn&#39;t work so well, look at joining a CSA so you can pick up your produce later in the day. Or look for other markets which run later - sometimes Asian food stores have fresher and more interesting produce than grocery stores And they&#39;re open past noon. Have some adventures. <br/>\n&gt; <br/>\n&gt; Getting them up earlier should be a now-and-then thing, not a regular thing. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":321883861,"authorName":"CarolynR","from":"&quot;CarolynR&quot; &lt;drcarolynnd@...&gt;","profile":"drcarolynnd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: sleep habits & my outbursts","postDate":"1337962615","msgId":67299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwb2I5bitsamM0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwZzk4bitqbWhrQGVHcm91cHMuY29tPg=="},"prevInTopic":67296,"nextInTopic":67300,"prevInTime":67298,"nextInTime":67300,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"Marlo, I just have to chime in here and say that I can understand where you are coming from having grown up in a house with alot of anger and yelling, but you","messageBody":"<div id=\"ygrps-yiv-1153372410\">Marlo, <br/>\n<br/>\nI just have to chime in here and say that I can understand where you are coming from having grown up in a house with alot of anger and yelling, but you CAN stop the cycle with you. Forgiveness is HUGE in this process so I would encourage you to forgive your mom (maybe to her face/maybe just in a journal of your own) for everything she did and didn&#39;t do that hurt you. Next ask your children to forgive you for the times you have yelled and said things you shouldn&#39;t or scared them. Let them talk about their feelings related to those times and then tell them you are committed to change. Kids are so forgiving and this will show them by example what to do when they mess up. <br/>\n<br/>\nThe next thing I want to share is that I think you might be setting yourself up for failure by letting them watch too much TV and staying up too late. If I stayed up until 2am I would throw a fit the next day too and I&#39;m an adult! You just can&#39;t expect yourself or your children to be calm and happy with that little sleep. It is important for all of us to sleep and wake with the natural rythm of the sun as much as possible. Of course adults can stay up a bit later and probably should to get caught up on chores, plan the next day in peace, and spend time with our spouses. Children really need to go to bed between 7 - 9 pm depending on the age and if it&#39;s daylight savings time etc. Just watch the sun and when it goes down try to let the kids wind down by dimming the lights, turning off the TV (way too stimulating at night), playing soft music, warm baths, massage, story time etc. - whatever works for your family. There is alot of research on the health importance of this and if you want more detials please feel free to email me directly. <br/>\n<br/>\nMoving bedtime up won&#39;t happen overnight, but I would make that my first priority if I were in your shoes. You will benefit from having some quiet time in the evenings and they will benefit by having more sleep or at least the deeper sleep that comes before midnight even if they still get the same number of hours. I know it is not easy but if I can get my middle child to go to sleep, you can do it! She was so tough in that department when she was little, I even had a behavioral therapist work with her and give up! No joke! But I was persistant because I knew her health (and my sanity) depended on it and now she tells me she is tired and gets in bed with a sweet &quot;night, night mommy&quot; and she is asleep with no arguments (the vast majority of the time). If I let her stay up too late however, it can still be a struggle. If I let her sleep in my bed she would never go to sleep either because the stimulation of having other people around would keep her awake (food for thought).<br/>\n<br/>\nI would also like to point out that more than 30 minutes of TV can be way overwhelming to a child&#39;s brain. The lights are so stimulating that eventually the brain shuts down and can&#39;t learn anymore, so I would limit that. Sure they are lots of educational videos that are great and there is a time and place for a fun family movie, but letting your kids watch hours of TV is not going to stimulate their minds. Try setting up stations in your house to explore like a craft station, a little gardening area outside with child sized safe tools, a cozy reading corner, a music station with books on tape and a CD player and/or some fun instruments...whatever you think will draw them in and be interesting to them. If they are reverting to the TV all day they are probably just bored and need your help guiding them into more engaging activities. Draw them into the things you are doing...&quot;why don&#39;t you stack the plates and your sister can stack the bowls from the dishwasher, let&#39;s count them, now what would half the plates equal, what if we dropped 2, then how many would we have?&quot; You can educate them with the simple things in life and involve them in the household rather than letting the TV try to engage them. Little things like that will build your relationship with your kids as you do life together. <br/>\n<br/>\nUnschooling means you educate your children with their passions as a guiding force, it does not mean you let your children call all the shots or wait for them to tell you what they want to learn. As the parents, we still have to set healthy boundaries, entice them to explore new things and turn every situation into an opportunity for learning. Sorry for the long post, you have just been on my heart since reading your original post and I had to chime in as a mom who has been there and a Naturopath who perhaps sees things from a different perspective after years of working with children&#39;s health issues. <br/>\n<br/>\nBlessings to you, <br/>\nCarolyn<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:DrCarolynND@...\">DrCarolynND@...</a><br/>\nwww.health-restoration.net</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: sleep habits & my outbursts","postDate":"1337916180","msgId":67292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwbXR1aytqdjA0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBMzk2QUM3LUZGRjgtNDA2OC1CQzFFLTc0RTZGRkVBM0ZCNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67290,"nextInTopic":67296,"prevInTime":67291,"nextInTime":67293,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... I keep a couple of plastic ziplock bags of O s in the car to help the experience of riding in the car be pleasurable to my three year old.  Often if I say","messageBody":"<div id=\"ygrps-yiv-376347993\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Try putting her in the car first.  Lure her to the car with something she likes--food, a story on CD, a toy she hasn&#39;t seen for a while. THEN &gt;tell the other kids to get in the car.<br/>\n<br/>\n </span></blockquote>I keep a couple of plastic ziplock bags of O&#39;s in the car to help the experience of riding in the car be pleasurable to my three year old.  Often if I say something like, &quot;Would you like to have your O&#39;s when we get in the car?&quot; he&#39;ll say yes and out we go, easily.  I also keep a some extra bags in the car in case he is extra hungry, drops one or in case one of the other kids want one.  Laurie</div>","specialLinks":[]},{"userId":291337950,"authorName":"alma","from":"&quot;alma&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: sleep habits & my outbursts","postDate":"1337878327","msgId":67290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwbG92bitldXJtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwZ2NsaythNW90QGVHcm91cHMuY29tPg=="},"prevInTopic":67288,"nextInTopic":67292,"prevInTime":67289,"nextInTime":67291,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... I know you ve already had good replies to this but I want to add that the beauty of watching with your kids is also what it opens up at other times. So,","messageBody":"<div id=\"ygrps-yiv-496809845\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;beingfree4meand3@...&quot; &lt;beingfree4meand3@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Also, what does one do while watching shows together??  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I know you&#39;ve already had good replies to this but I want to add that the beauty of watching with your kids is also what it opens up at other times. So, for me, watching with them sometimes means we&#39;re all tangled up together on the sofa but sometimes means we&#39;re all in the room together listening/watching but I&#39;m also knitting or reading emails and they&#39;re bouncing, playing or whatever. But the best bit of doing that together is afterwards. I can hold my own in reciting Star Wars sketches (I can do a pretty good C3PO!), I can crouch on the floor and ask my son to be &quot;Little Pinkfoot&quot; (the cute baby elephant on Planet Earth Live who, at the first sign of danger runs under her mother&#39;s tummy), I can see when the boys are re-enacting a Tom and Jerry scene rather than just clobbering the living daylights out of each other, and so on and so on. Watching together creates lots of oppurtunities to engage with the kids in play, conversation and all manner of connection After as well as During.<br/>\n<br/>\nAlison<br/>\nDS1(9) and DS2(7)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337798773","msgId":67288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzNEMzMTFBLTI4RDctNEIwQi04RDRBLTAwOENCNTBFRjAyMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMzc3OTE1NzkuMzMxOTkuWWFob29NYWlsUkNAd2ViMTg0NDE2Lm1haWwuYmYxLnlhaG9vLmNvbT4=","referencesHeader":"PGpwaWxscys0a2lnQGVHcm91cHMuY29tPiA8MTMzNzc5MTU3OS4zMzE5OS5ZYWhvb01haWxSQ0B3ZWIxODQ0MTYubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":67284,"nextInTopic":67290,"prevInTime":67286,"nextInTime":67289,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"I really like this response from Kim: -=-Your healing will come through the love you pour out onto your children. Don t worry or think about the unschooling","messageBody":"<div id=\"ygrps-yiv-903577460\">I really like this response from Kim:<br/>\n-=-Your healing will come through the love you pour out onto your children. Don&#39;t <br/>\nworry or think about the unschooling part of your life right now. The learning <br/>\nwith come naturally over time by living the life you wish you had as a child. <br/>\nBecome &quot;that&quot; parent first.-=-<br/>\n<br/>\nIt&#39;s okay (and might be necessary) to tell your kids that you made a mistake letting go of all &quot;rules,&quot; and that you need to start back and go more slowly.  The sweeter you are to them, the sweeter their lives will be.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":338201201,"authorName":"Kimberly Sims","from":"Kimberly Sims &lt;dkjsv05@...&gt;","profile":"dkjsv05@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337791579","msgId":67284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzc3OTE1NzkuMzMxOTkuWWFob29NYWlsUkNAd2ViMTg0NDE2Lm1haWwuYmYxLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpwaWxscys0a2lnQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwaWxscys0a2lnQGVHcm91cHMuY29tPg=="},"prevInTopic":67282,"nextInTopic":67288,"prevInTime":67283,"nextInTime":67285,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"~ I don t think I always know how to show love (I think I m a cold person). ~ I could have written this statement myself before finding this group. When ","messageBody":"<div id=\"ygrps-yiv-1810586027\">~ &quot;I don&#39;t think I always know how to show love (I think I&#39;m a cold person).&quot;~<br/>\n<br/>\nI could have written this statement myself before finding this group. When <br/>\nwe, now parents, haven&#39;t been given the best examples of parenthood from our own <br/>\nparents there is nothing for us to relate to except what we were shown as <br/>\nchildren (even though we *know* that it doesn&#39;t work).<br/>\n<br/>\n I myself too had a very hard time expressing my emotions with my husband and <br/>\nchildren. My own parents had SO much drama going on in their life that they <br/>\nthemselves couldn&#39;t give my sister and I that love we very much needed. Today I <br/>\nstill am the only one to give kisses, hugs and to say I love you to them but <br/>\nonly after going through the steps of getting angry at them and then realizing I <br/>\nwas the one who had to break my families tedious cycle and forgiving them in my <br/>\nheart(only you need to know). Realizing they were not given good examples of <br/>\nparenthood either (and it will take time to get to that place).<br/>\n<br/>\nI did however meet and have had people in my life that did set wonderful <br/>\nexamples of unconditional love as well as members on this list sharing their <br/>\npersonal wisdom and experience (I am SO very thankful for this list). I used <br/>\nthem as my mentors of the parent *I* wanted to be. I drew from their experiences <br/>\nto help lay my parenthood foundation. I learned to love unconditionally through <br/>\ntheir examples. <br/>\n<br/>\n<br/>\nDo you know what kind of parent you want to be (you don&#39;t need to answer these <br/>\nquestions here but ask yourself)? Do you have anyone you could use to be that <br/>\nexample( and I am not just talking about people you know, Gandhi was someone I <br/>\nalso used as my mentor too)?<br/>\n<br/>\n If so start *being* that parent. Start being the parent *you* wished you had <br/>\ngrowing up. Do things that you wished you could have done as a child. If you can <br/>\nafford Disneyland then go, or start saving for it. If you wished you could have <br/>\nhad a certain Barbie or Doll growing up find it on E-bay or at Goodwill and play <br/>\nwith your children. Spend time going down the toy isles finding outfits for your <br/>\n(and your children&#39;s) dolls. Maybe learn how to sew or design your own clothing <br/>\ntogether. My girls(11 and 6) are very into Monster High right now. I would have <br/>\nloved these as a child and I have my own dolls to play right along with them. <br/>\n<br/>\nYour healing will come through the love you pour out onto your children. Don&#39;t <br/>\nworry or think about the unschooling part of your life right now. The learning <br/>\nwith come naturally over time by living the life you wish you had as a child. <br/>\nBecome &quot;that&quot; parent first.<br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Christina &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:daharryrc@...\">daharryrc@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wed, May 23, 2012 9:36:26 AM<br/>\nSubject: [AlwaysLearning] Re: sleep habits & my outbursts<br/>\n<br/>\n  <br/>\n<br/>\n-=We&#39;ve had some rough times over these past 6 yrs, and I don&#39;t think I always <br/>\nknow how to show love (I think I&#39;m a cold person), and even though this will be <br/>\na challenge because showing love doesn&#39;t come easy (it used to when the twins <br/>\nwere babies but a lot has changed in our family that for some reason I&#39;m always <br/>\nin the self protective state), but I want to find that love again=-<br/>\n<br/>\nWe are 3 months into deschooling and when we first started, I was very much in a <br/>\nstate of not knowing how to reconnect with my kids.On this list I was given <br/>\nwonderful advice about being with my children. Watching them do what they do and <br/>\nnoticing the little things, what makes them laugh, really paying attention to <br/>\nwhat interests them and grabs their curiosity, spontaneous conversations <br/>\nthroughout the day, and so many more ways of being with them, have helped me <br/>\nbegin to get to know who they really are again and fall in love with them all <br/>\nover again. I get to see them for who they are and am letting go of who I <br/>\nthought they should be or thought I wanted them to be. I am liking who they <br/>\nreally are much more anyway. Sometimes I have assumed and have witnessed others <br/>\nassume that because the children and I are in the same space most all day, <br/>\neveryday, that means we are always connected. That isn&#39;t true unless I choose to <br/>\nbe intentional about connection. Sharing a living space does not mean we are <br/>\nnecessarily connected. Mothering has become for me a practice of mindfulness. <br/>\nChoosing to be present in this moment. <br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/mindfulness/danielle\">http://sandradodd.com/mindfulness/danielle</a> <br/>\n<br/>\nThere&#39;s obviously a lot more going on behind the screen. There usually is. You <br/>\nare aware of this self-protecting behavior in yourself so the next time you find <br/>\nthat you are protecting yourself in an interaction with your children and are <br/>\ngoing to make a choice from that, think of another choice. Sharing affectionate <br/>\ntouches or words is increasing gradually with my older two. It&#39;s beginning to <br/>\ncome more naturally, but sometimes I feel hesitant and in that moment, I can <br/>\nchoose to show that love anyway or keep a &quot;tough front&quot;. Sometimes I behave <br/>\nautomatically, but those times are lessening and I&#39;m noticing the space that I <br/>\nget to choose whether to stay closed or open up. When I notice the space and use <br/>\nthat space to pause for a moment and give myself another option, it&#39;s much <br/>\neasier to make a better choice. Each moment, making better choices, adds up and <br/>\ncreates new patterns and ways of being. Also, when you realize you&#39;ve behaved <br/>\nautomatically or have made a self-protective choice, you can choose a do-over. <br/>\nSometimes, I say &quot;No.&quot; and then wake up and &quot;WHY did I just say that!&quot; comes to <br/>\nmy mind and I will fess up to my child and say something like, &quot;That was silly. <br/>\nYes. You sure can.&quot; or &quot;I wasn&#39;t thinking...or listening...can we try this <br/>\nagain?&quot; <br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/betterchoice.html\">http://sandradodd.com/betterchoice.html</a><br/>\n<br/>\nchristina.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sleep habits & my outbursts","postDate":"1337783073","msgId":67281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwRjk4NzA3LTlFMzQtNEZBNS04RjQ1LTgzNTE3QjhERURCMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDg3MEM0NkY5LTRGQjItNDU0QS1CQTVGLUJGNUMzNzQzOTEzNEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpwZ2NsaythNW90QGVHcm91cHMuY29tPiA8ODcwQzQ2RjktNEZCMi00NTRBLUJBNUYtQkY1QzM3NDM5MTM0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":67278,"nextInTopic":67282,"prevInTime":67280,"nextInTime":67282,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... When you make comments are they prompted by the hope they ll hold the same opinions as you re expressing about the subject? Are they comments you would","messageBody":"<div id=\"ygrps-yiv-940897801\"><blockquote><span title=\"ireply\">&gt; I&#39;ve made comments (I don&#39;t think critical, but then again not sure)<br/>\n<br/>\n </span></blockquote>When you make comments are they prompted by the hope they&#39;ll hold the same opinions as you&#39;re expressing about the subject?<br/>\n<br/>\nAre they comments you would share with a friend? With your husband?<br/>\n<br/>\nThere&#39;s a big difference between &quot;That makes me uncomfortable,&quot; and &quot;That&#39;s a bad thing,&quot; when sharing opinions, especially about entertainment.<br/>\n<br/>\n&quot;That&#39;s bad,&quot; is a universal judgement. If the other person disagrees, it can imply they&#39;re bad or have bad taste.<br/>\n<br/>\n&quot;That makes me uncomfortable,&quot; can be heard either of two ways depending on your relationship. If you&#39;ve been critical, if you want them to believe as you do, it can sound exactly like &quot;That&#39;s bad.&quot; If the others feel free to hold very different opinions, it will feel like it&#39;s just about you.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sleep habits & my outbursts","postDate":"1337780990","msgId":67278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0MEMwRjRCLTI1QzItNDc0OC1BRTc2LTA0QjZBQTU0MDVDQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg=="},"prevInTopic":67276,"nextInTopic":67281,"prevInTime":67277,"nextInTime":67279,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... The more conscious effort you put into minimizing how much you inconvenience them as you meet your needs, the more accommodating they will be when they re","messageBody":"<div id=\"ygrps-yiv-779408206\">On May 20, 2012, at 11:08 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:beingfree4meand3@...\">beingfree4meand3@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I get up EARLY (sometimes by an alarm clock)<br/>\n<br/>\n </span></blockquote>The more conscious effort you put into minimizing how much you inconvenience them as you meet your needs, the more accommodating they will be when they&#39;re developmentally able.<br/>\n<br/>\nIf you meeting your needs causes them misery, they&#39;ll be less sympathetic to your needs. <br/>\n<br/>\nDon&#39;t take them into account because you fear their reactions. Do it because it&#39;s polite. Do it because it&#39;s how you would like them to treat other people. (Don&#39;t expect them to follow your example. But they will -- when they&#39;re developmentally able -- if your example makes them feel good.)<br/>\n<br/>\nI suspect *how* you&#39;re handling their needs and responses may be where you&#39;re getting off kilter. It&#39;s likely you&#39;re reacting to their intense reactions with intense reactions. See their emotions not as a demand for you to fix things but as feedback that a solution needs tweaked. Remain in your calm center so they have a calm place to come back to. If their fireworks set off your fireworks then the whole factory&#39;s exploding.<br/>\n<br/>\nBut calm doesn&#39;t mean uncaring. When kids get upset they might need a hug or a sympathetic word to know you understand why they&#39;re upset. Some kids need to go off to cool down. It will depend on your kids. Care without letting their drama set off your drama. Be patient. Be centered. Breathe. Be the wellspring of peace that they can draw from to calm their sparks rather than the tinder their emotions will light with their sparks.<br/>\n<br/>\n(The books and websites I suggested should be helpful.)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have a history of screaming at & frightening, manipulating, etc (all the bad shit) my children.<br/>\n<br/>\n </span></blockquote>Probably because you&#39;re trying to control what isn&#39;t controllable: them. But that doesn&#39;t mean give up and let them do whatever. It means focus on what you can control. You can control the rhythm of the day. You can limit their choices to what&#39;s reasonable and workable and safe for the moment so it isn&#39;t &quot;Anything at anytime&quot;.<br/>\n<br/>\nIf you come up with solutions or draw them into offering suggestions, don&#39;t see those as all or nothing solutions. They will be flawed. Try things. See what parts are working and what isn&#39;t. Talk about it out loud. Say, &quot;When we do x, then y happens.&quot; Or &quot;This isn&#39;t working out. Let&#39;s try this instead.&quot; Or you can draw them in to offering solutions with &quot;Here&#39;s the part that&#39;s not working. Let&#39;s think about that.&quot; (Not all kids enjoy participating. It feels too big to them. But they can benefit from hearing you verbally work through a problem and potential solutions.)They may offer ideas. See that as a new problem to solve. If there&#39;s too much to tweak, throw it out and try the next on the list.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sleep habits & my outbursts","postDate":"1337780986","msgId":67282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGNzlDQUM4LTYwRUYtNEJFNS1BQjY4LTMxNjcyNzNDODRFQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpwZzk4bitqbWhrQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwZzk4bitqbWhrQGVHcm91cHMuY29tPg=="},"prevInTopic":67281,"nextInTopic":67284,"prevInTime":67281,"nextInTime":67283,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... Shift your perspective. Making fear based choices I suspect is a big part of the chaos the kids are feeling and reacting to in the family atmosphere. They","messageBody":"<div id=\"ygrps-yiv-549097143\">On May 22, 2012, at 10:53 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:beingfree4meand3@...\">beingfree4meand3@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I fear their crying/tantrums/anger. I fear that if I don&#39;t give<br/>\n&gt; them what they want and then they cry that they will think that I don&#39;t love them<br/>\n<br/>\n<br/>\n </span></blockquote>Shift your perspective. Making fear based choices I suspect is a big part of the chaos the kids are feeling and reacting to in the family atmosphere. They aren&#39;t feeling loved or nurtured by your choices. They&#39;re feeling like mom believes life is on the precipice and she&#39;s making choices to keep everyone from imminent disaster. And they&#39;re reacting with extra neediness. You need to move away from the edge. You need to feel more centered, less afraid. You need to project a sense that you can handle what life&#39;s throwing at you.<br/>\n<br/>\nMake choices to create peace in the kids and in the home. Rather than responding to requests like fires to be stomped on, keep an eye on the bigger picture of how to create more peace (and keep the fires from popping up). One way is meeting their needs before they&#39;ve gotten big enough for the kids to notice. At that point, the need is often too big for the kid to handle well.<br/>\n<br/>\nIt seems they&#39;ve learned that crying and anger is what makes you act to meet their needs. So they&#39;ve learned to reach for those tools early in the game.<br/>\n<br/>\nHave you read Ross Greene&#39;s The Explosive Child?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/JCilMW\">http://amzn.to/JCilMW</a><br/>\n<br/>\nThere may also be some tips in Raising Your Spirited Child Rev Ed: A Guide for Parents Whose Child Is More Intense, Sensitive, Perceptive, Persistent, and Energetic by Mary Sheedy Kurcinka<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/IKBN4R\">http://amzn.to/IKBN4R</a><br/>\n<br/>\nAnother thing that might help is Scott Noelle&#39;s Daily Groove. Each day is a small mental shift to put into practice.<br/>\n<br/>\nwww.enjoyparenting.com/dailygroove<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: sleep habits & my outbursts","postDate":"1337776636","msgId":67276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwaWxscys0a2lnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwZzltcytuYmI4QGVHcm91cHMuY29tPg=="},"prevInTopic":67271,"nextInTopic":67278,"prevInTime":67275,"nextInTime":67277,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"-=We ve had some rough times over these past 6 yrs, and I don t think I always know how to show love (I think I m a cold person), and even though this will be","messageBody":"<div id=\"ygrps-yiv-48513164\">-=We&#39;ve had some rough times over these past 6 yrs, and I don&#39;t think I always know how to show love (I think I&#39;m a cold person), and even though this will be a challenge because showing love doesn&#39;t come easy (it used to when the twins were babies but a lot has changed in our family that for some reason I&#39;m always in the self protective state), but I want to find that love again=-<br/>\n<br/>\nWe are 3 months into deschooling and when we first started, I was very much in a state of not knowing how to reconnect with my kids.On this list I was given wonderful advice about being with my children.  Watching them do what they do and noticing the little things, what makes them laugh, really paying attention to what interests them and grabs their curiosity, spontaneous conversations throughout the day, and so many more ways of being with them, have helped me begin to get to know who they really are again and fall in love with them all over again.  I get to see them for who they are and am letting go of who I thought they should be or thought I wanted them to be.  I am liking who they really are much more anyway. Sometimes I have assumed and have witnessed others assume that because the children and I are in the same space most all day, everyday, that means we are always connected.  That isn&#39;t true unless I choose to be intentional about connection.  Sharing a living space does not mean we are necessarily connected.  Mothering has become for me a practice of mindfulness.  Choosing to be present in this moment. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/mindfulness/danielle\">http://sandradodd.com/mindfulness/danielle</a>    <br/>\n<br/>\nThere&#39;s obviously a lot more going on behind the screen.  There usually is.  You are aware of this self-protecting behavior in yourself so the next time you find that you are protecting yourself in an interaction with your children and are going to make a choice from that, think of another choice.  Sharing affectionate touches or words is increasing gradually with my older two.  It&#39;s beginning to come more naturally, but sometimes I feel hesitant and in that moment, I can choose to show that love anyway or keep a &quot;tough front&quot;.  Sometimes I behave automatically, but those times are lessening and I&#39;m noticing the space that I get to choose whether to stay closed or open up.  When I notice the space and use that space to pause for a moment and give myself another option, it&#39;s much easier to make a better choice.  Each moment, making better choices, adds up and creates new patterns and ways of being.  Also, when you realize you&#39;ve behaved automatically or have made a self-protective choice, you can choose a do-over.  Sometimes, I say &quot;No.&quot; and then wake up and &quot;WHY did I just say that!&quot; comes to my mind and I will fess up to my child and say something like, &quot;That was silly.  Yes. You sure can.&quot; or &quot;I wasn&#39;t thinking...or listening...can we try this again?&quot;  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/betterchoice.html\">http://sandradodd.com/betterchoice.html</a><br/>\n<br/>\nchristina.</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337726948","msgId":67271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOUDh3ODM4WlBvPVpiZHd0X1dQOXZMN0ttX3NHRUFkTGczTVI0bmhuaE1EUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzMzc3MTYxOTAuNTg1NDkuWWFob29NYWlsTmVvQHdlYjEyMjUwMS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDcwMUQyNjRDLTYwREMtNDg3QS1CRDJGLTU3MjA3OUVEOEREQ0BTYW5kcmFkb2RkLmNvbT4JPGpwZzk4bitqbWhrQGVHcm91cHMuY29tPgk8MTMzNzcxNjE5MC41ODU0OS5ZYWhvb01haWxOZW9Ad2ViMTIyNTAxLm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":67270,"nextInTopic":67276,"prevInTime":67270,"nextInTime":67273,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... You re trying to be totally noncoercive - am I right? But, in the process of not coercing one kid, you re coercing the others by not letting them get on","messageBody":"<div id=\"ygrps-yiv-1190405551\"><blockquote><span title=\"ireply\">&gt; *** so we sit there until SHE is ready to go (& this creates another<br/>\n&gt; problem for my other two - so now they automatically give her what she<br/>\n&gt; wants so that she will stop crying & let them get on with their activity***<br/>\n<br/>\n<br/>\n </span></blockquote>You&#39;re trying to be totally noncoercive - am I right?<br/>\n<br/>\nBut, in the process of not coercing one kid, you&#39;re coercing the others by<br/>\nnot letting them get on with what they want to do.<br/>\n<br/>\nNot saying do not try to find common ground and compromise. But why should<br/>\none kid get to control everybody else?<br/>\n<br/>\nTry to find mutually agreeable options - the more you practice that, the<br/>\nmore it will happen naturally. Try to plan ahead. Try to set the stage for<br/>\nall them them to be successful in doing what they want to do. Try to do all<br/>\nof this as much as possible. And realize your competency at all this won&#39;t<br/>\nbe perfect right away and you might need to step in as the person-in-charge<br/>\nat times to say things like, &quot;Today we&#39;re going to the zoo and tomorrow you<br/>\ncan be on the computer ALL day.&quot;<br/>\n<br/>\nTrying not to make coercion your first reaction is great. NEVER standing up<br/>\nfor what the other kids want to do is not great at all.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337726556","msgId":67270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQMG9jRjFnYlZrLXNNZjBOTzFYMUdUMjd1Sk1uZUJfUj1VcHU0YmUzcGpNZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzMzc3MTU1MDcuMjc4NDQuWWFob29NYWlsTmVvQHdlYjEyMjUwNC5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDQwMDk1QzQxLThDMDItNDUyMS04MDA4LTYwNjNCMENEQzgzM0Bjb21jYXN0Lm5ldD4JPGpwZ2NsaythNW90QGVHcm91cHMuY29tPgk8MTMzNzcxNTUwNy4yNzg0NC5ZYWhvb01haWxOZW9Ad2ViMTIyNTA0Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":67269,"nextInTopic":67271,"prevInTime":67269,"nextInTime":67271,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... Do you really say that? Instead, say, I m ready to make an apple pie, come join me, or Hey, come out and play in the sprinklers with me, or Look, I","messageBody":"<div id=\"ygrps-yiv-976604851\"><blockquote><span title=\"ireply\">&gt; when I say, &quot;hey, let&#39;s do some time! :-)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Do you really say that?<br/>\n<br/>\nInstead, say, &quot;I&#39;m ready to make an apple pie, come join me,&quot; or &quot;Hey, come<br/>\nout and play in the sprinklers with me,&quot; or &quot;Look, I made playdough with<br/>\npineapple flavoring.&quot;<br/>\n<br/>\nAlso - I wanted to say that I spent a LOT of time with my kids with the tv<br/>\non - I&#39;d put a puzzle on the table or bring their big dollhouse out on the<br/>\nfloor right in front of the tv. I&#39;d sit down and half watch the show and<br/>\nhalf play....if the show was really good, we&#39;d watch it more and if the<br/>\nplay was more fun, the show might be forgotten. If it got to the point the<br/>\ntv sound was interfering with our play, I&#39;d turn the volume down (not<br/>\nabruptly off because that might get someone objecting to not having the<br/>\nchoice to watch anymore).<br/>\n<br/>\nWe have a good-sized coffee table for sitting at and watching tv while<br/>\npainting or coloring or building with lego or anything else.<br/>\n<br/>\nEvery day for years I brought stuff out to the living room to play with in<br/>\nfront of the tv. We&#39;d pause the tv, go back to watch something, mute it for<br/>\na few minutes - turn it up for a few minutes when it was exciting.<br/>\nSometimes the &quot;play&quot; part was really interaction with the tv show - a kid<br/>\nwould be making something show-related out of playdough, for example.<br/>\n<br/>\nMy point really is that tv-watching doesn&#39;t have to be all or nothing -<br/>\nlots of other stuff can go on and lots of interaction and lots of play and<br/>\nconversation and creativity - it can all ebb and flow IF you&#39;re sensitive<br/>\nand right there involved with them, especially.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"CarenKH","from":"&quot;CarenKH&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: sleep habits & my outbursts","postDate":"1337719494","msgId":67269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwZ3RzNis4ZjFsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwZ2NsaythNW90QGVHcm91cHMuY29tPg=="},"prevInTopic":67268,"nextInTopic":67270,"prevInTime":67268,"nextInTime":67270,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"=-=I ve also said to them that (regarding something like the farmers market), they can sleep in while I go & that Gramma will be here while I m gone.=-= I know","messageBody":"<div id=\"ygrps-yiv-1687668824\">=-=I&#39;ve also said to them that (regarding something like the farmers market), they can sleep in while I go & that Gramma will be here while I&#39;m gone.=-=<br/>\n<br/>\nI know you have a lot on your plate, and I hesitate to mention this - but is this Gramma the same person who thinks it&#39;s OK if you scream at the kids? Do your kids feel safe (loved, listened to, respected) with her?<br/>\n<br/>\nIt&#39;s possible, if this is the same person, your willingness to leave them in her care is also eroding any trust you are building with your kids. <br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337716190","msgId":67268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzc3MTYxOTAuNTg1NDkuWWFob29NYWlsTmVvQHdlYjEyMjUwMS5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGpwZzk4bitqbWhrQGVHcm91cHMuY29tPg==","referencesHeader":"PDcwMUQyNjRDLTYwREMtNDg3QS1CRDJGLTU3MjA3OUVEOEREQ0BTYW5kcmFkb2RkLmNvbT4gPGpwZzk4bitqbWhrQGVHcm91cHMuY29tPg=="},"prevInTopic":67267,"nextInTopic":67269,"prevInTime":67267,"nextInTime":67269,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"***Also, to get on the computer - we have one, and if I don t get on it while they are asleep, they scream & cry if I ask to use it while they are on it even","messageBody":"<div id=\"ygrps-yiv-1878573727\">***Also, to get on the computer - we have one, and if I don&#39;t get on it while they are asleep, they scream & cry if I ask to use it while they are on it even though they may have already been on it for 3-4 hours. ***<br/>\n<br/>\nYou should seriously consider getting another computer or at the very least a TV and DVD player.  TV and DVD players are cheap at thrift stores or garage sales.  We have 5 TV&#39;s and 8 or so computers for a family of 4, some laptops and some desktops.  We&#39;ve gotten every single one used or second hand or for cheap like $50 for a used PC.<br/>\n<br/>\n*** so we sit there until SHE is ready to go (& this creates another problem for my other two - so now they automatically give her what she wants so that she will stop crying & let them get on with their activity***<br/>\n<br/>\n<br/>\nThe more generous you are with each of your kids and the more generous they are with each other, the more your youngest will become more generous too.  It takes time.  Some kids are more intense than others in getting what they want.  It will help to see it as a skill that can be honed.  People that find ways to get what they want can be super powerful people.  It&#39;s a power that can be hugely misused and abused.  Right now she&#39;s little and using the best skill she has to get what she wants and it&#39;s mean and manipulative.  Help her find other better ways to get what she wants.  In the long term, there is greater power in being kind while getting what you want.  Keep that in mind when you are in the midst of it all.  Try to remember that she&#39;s getting her needs met and that you can help her do that better.<br/>\n<br/>\nMy youngest daughter is very much like this and used to do very similar things, but at 10, she&#39;s generous and awesome and she gets her needs met the way she wants them met.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337715507","msgId":67267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzc3MTU1MDcuMjc4NDQuWWFob29NYWlsTmVvQHdlYjEyMjUwNC5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGpwZ2NsaythNW90QGVHcm91cHMuY29tPg==","referencesHeader":"PDQwMDk1QzQxLThDMDItNDUyMS04MDA4LTYwNjNCMENEQzgzM0Bjb21jYXN0Lm5ldD4gPGpwZ2NsaythNW90QGVHcm91cHMuY29tPg=="},"prevInTopic":67266,"nextInTopic":67268,"prevInTime":67266,"nextInTime":67268,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"***I took them to the zoo, but then again it was after they watched for most of the morning - it wasn t until I mentioned that the zoo will be closing in 3","messageBody":"<div id=\"ygrps-yiv-1719782863\">***I took them to the zoo, but then again it was after they watched for most of the morning - it wasn&#39;t until I mentioned that the zoo will be closing in 3 hours then 2 1/2 hrs - then we went. They&#39;ve always LOVED the zoo.***<br/>\n<br/>\nIf you guys had plans to go to the zoo then why are the kids setting the hrs in which you all go?  It is the parent&#39;s job to make sure that kids get places in time.  Kids often have zero concept of time.  If you know they will enjoy it, then let them know that you will leave in half an hr and get snacks and everything ready to go in that time and then help them transition to the car. <br/>\n<br/>\n<br/>\n***They all say they want to have our one on one time, and when I say, &quot;hey, let&#39;s do some time! :-) they say after this show, then again, after this show, etc. Even after the show I say it again, but then again - can we just watch one more show??***<br/>\n<br/>\n<br/>\nAgain, this is a case of the parent taking the initiative to do the one on one or anything really.  If there&#39;s nothing better to do, then of course they will watch their shows that they are enjoying.  If you set up something fun, you will likely grab the attention of at least one kid.  You can&#39;t wait until they are ready because they will not be ready for the unknown.  The more you set up the unknown and make it known, the more variety they will know and the more they will do the same.<br/>\n<br/>\n***Also, what does one do while watching shows together??***<br/>\n<br/>\nWe play with barbies, build with legos, draw, tell jokes, comment on things in the show, clean house, build forts, play board games, play online games.  You can do all kinds of things while watching shows.  The way to do this is to not make watching TV such a big deal.  It&#39;s background entertainment, like listening to music.<br/>\n<br/>\n***They again say they want to come, so I work on waking them up, and then I miss out because I can&#39;t get them up or they get up and we move slow because they are cranky, and by then I&#39;m frustrated***<br/>\n<br/>\nIf it were me, I&#39;d go in and wake them up and then say loudly, &quot;If anyone wants to come with me, I&#39;ll be leaving in 20 min, so wake up and let&#39;s go!&quot;  If they aren&#39;t waking up, then be louder if you know they really want to go.  Since they like TV, maybe put on a favorite show to wake up to, turn the volume up, and then leave as soon as it&#39;s over. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: sleep habits & my outbursts","postDate":"1337708488","msgId":67266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwZ2o0OCtvOGZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwZ2NsaythNW90QGVHcm91cHMuY29tPg=="},"prevInTopic":67265,"nextInTopic":67267,"prevInTime":67265,"nextInTime":67267,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... ***************** I don t why you need to be inside for them to watch - is it that they need more attention from you? Rather than just saying I m going to","messageBody":"<div id=\"ygrps-yiv-1273176153\">&quot;beingfree4meand3@...&quot; &lt;beingfree4meand3@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-Do you offer more enticing things than  <br/>\n&gt; DVD&#39;s and YouTube?-=- <br/>\n&gt; Yes & No.  I tell them I&#39;m going outside - to clean out the pool & refill it, to hang out, to do the gardening, to look in the garage - sometimes they come for a bit, but usually they scream to have me come back inside (so they can keep watching).<br/>\n </span></blockquote>*****************<br/>\n<br/>\nI don&#39;t why you need to be inside for them to watch - is it that they need more attention from you? <br/>\n<br/>\nRather than just saying &quot;I&#39;m going to do x&quot; invite them - come up with fun ideas of things to do outside and invite them alone. They&#39;ll still say no some of the time, especially if tv has been limited in the past and/or if  you&#39;ve been in the habit of creating &quot;teachable moments&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  I took them to the zoo, but then again it was after they watched for most of the morning - it wasn&#39;t until I mentioned that the zoo will be closing in 3 hours then 2 1/2 hrs - then we went.<br/>\n </span></blockquote>****************<br/>\n<br/>\nDrop the negative &quot;it wasn&#39;t until&quot; dialog. You went to the zoo And they got to watch tv. Hooray! <br/>\n<br/>\nHere&#39;s a question - are you saying &quot;do you want to go?&quot; over and over, or getting everything ready and saying &quot;time to go!&quot; in a cheerful, fun voice? Sometimes offering a choice at the wrong moment backfires - they don&#39;t want to rethink, they want to Do. So assume they still want to go and help that happen. Don&#39;t make it a battle, though, make it a case of you being their pal, helping them get moving to do something they want to do. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, what does one do while watching shows together??<br/>\n<br/>\n </span></blockquote>Things that don&#39;t involve talking. Puzzles. Knitting. Sorting things. Folding laundry. Art/craft stuff. Play-dough. Menu planning. Mending. Tidy up the room. If you&#39;re not interested in the show, read a book or magazine, or look at catalogs. If they&#39;re all watching tv, that&#39;s a good time to use the computer - especially if its in the same room. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;They say they want to go, but when I try to wake them up, I can&#39;t.  Then they cry & blame me for not getting them up earlier.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIf you shift your own sleep schedule to match theirs, it will help to look for things that happen later in the day. They will be different things than morning things - you get to stretch your thinking a little and discover something new. If the farmers market doesn&#39;t work so well, look at joining a CSA so you can pick up your produce later in the day. Or look for other markets which run later - sometimes Asian food stores have fresher and more interesting produce than grocery stores And they&#39;re open past noon. Have some adventures. <br/>\n<br/>\nGetting them up earlier should be a now-and-then thing, not a regular thing. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: sleep habits & my outbursts","postDate":"1337707632","msgId":67265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwZ2k5ZytzdjUyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwZzk4bitqbWhrQGVHcm91cHMuY29tPg=="},"prevInTopic":67264,"nextInTopic":67266,"prevInTime":67264,"nextInTime":67266,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... *************** Is it worth the sleep deprivation? It might be better to rethink how you get those things done during the day - remember, if you re getting","messageBody":"<div id=\"ygrps-yiv-1284785896\">&quot;beingfree4meand3@...&quot; &lt;beingfree4meand3@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I get up early so that I can get things done around the house:  pick up messes, vacuum, dishes (all from the day before), laundry, etc.  Also, to get on the computer <br/>\n </span></blockquote>***************<br/>\n<br/>\nIs it worth the sleep deprivation? It might be better to rethink how you get those things done during the day - remember, if you&#39;re getting enough sleep, you&#39;ll have more energy, more patience, more thoughtfulness, and more creativity than if you&#39;re not getting enough sleep. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;to get on the computer - we have one, and if I don&#39;t get on it while they are asleep, they scream & cry if I ask to use it while they are on it even though they may have already been on it for 3-4 hours.  <br/>\n </span></blockquote>***************<br/>\n<br/>\nIt has helped me to break down all the various things family members do on the computer and have designated computers. We live way out in the country, so internet is limited and anything that can be done without the internet we shift to other computers - we have an older computer that still works well for a lot of things, a couple laptops, and a few gaming systems, most bought second-hand. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I fear that if I don&#39;t give them what they want and then they cry that they will think that I don&#39;t love them <br/>\n </span></blockquote>*****************<br/>\n<br/>\nThere&#39;s something in between cold-hearted indifference to tears and trying to keep kids from ever being unhappy. Neither of those extremes are helpful. To some extent, it&#39;s important to realize that kids Will be unhappy sometimes, they&#39;ll cry and even melt down sometimes. That&#39;s part of how they&#39;ll learn about the world! If you can relax into that understanding, it gets a lot easier to deal with the meltdowns you can&#39;t prevent - and frees up some of your energy and creativity to prevent others. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t know how to lovingly handle their emotions - they push me away, kick me, scream in my face - they don&#39;t trust me that I want to be there for them.<br/>\n </span></blockquote>***************<br/>\n<br/>\nSee their behavior as communication. If a child is pushing you away, he or she does not want to be touched or held. Not every person wants physical comfort when upset - my daughter doesn&#39;t. Even as an infant, she didn&#39;t want to be cuddled when she was upset, she wanted me to back off until she had calmed down a little on her own. So it may not be a matter of trust so much as that you&#39;re doing what you Think they need, and they really need something else. It&#39;s okay to experiment a little and discover what helps. Maybe it would help to back off and say soothing things - maybe just &quot;I&#39;m sorry&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I told her we could do it tomorrow & if she wanted to lay it on the night table so it would be there for her in the morning.  She got angry & started to cry, and when she does this she makes it hard for others to enjoy their time because she will do things to stop everything.<br/>\n </span></blockquote>****************<br/>\n<br/>\nDon&#39;t expect to use one single formula for all situations - each person will have different needs, and each situation will be a little different. Maybe one child needs more attention, more &quot;yes-right-now&quot; than others - that&#39;s okay! <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337705811","msgId":67264,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3MEM0NkY5LTRGQjItNDU0QS1CQTVGLUJGNUMzNzQzOTEzNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpwZ2NsaythNW90QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwZ2NsaythNW90QGVHcm91cHMuY29tPg=="},"prevInTopic":67263,"nextInTopic":67265,"prevInTime":67263,"nextInTime":67265,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"-=--=-Do you offer more enticing things than DVD s and YouTube?-=- -=-Yes & No. I tell them I m going outside - to clean out the pool & refill it, to hang out,","messageBody":"<div id=\"ygrps-yiv-1912937492\">-=--=-Do you offer more enticing things than <br/>\nDVD&#39;s and YouTube?-=- <br/>\n-=-Yes & No. I tell them I&#39;m going outside - to clean out the pool & refill it, to hang out, to do the gardening, to look in the garage - sometimes they come for a bit, but usually they scream to have me come back inside (so they can keep watching). -=-<br/>\n<br/>\nSERIOUSLY!? <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n<br/>\nIt seems you&#39;re punishing them for watching DVDs and YouTube.<br/>\n<br/>\n&quot;More enticing things&quot; doesn&#39;t mean &quot;go do some yardwork.&quot;<br/>\n<br/>\nIf you want them to play in the pool, you should clean it yourself and fill it, put towels out, maybe put a little portable slide into it if you have one, maybe put some pool toys or bubbles out.  That&#39;s what &quot;enticing&quot; means.<br/>\n<br/>\n-=- They all say they want to have our one on one time, and when I say, &quot;hey, let&#39;s do some time! :-) they say after this show, then again, after this show, etc. Even after the show I say it again, but then again - can we just watch one more show?? -=-<br/>\n<br/>\n&quot;Your one on one time&quot; isn&#39;t a worthy goal, then. If you were doing things with them throughout the day (things they are already doing; join in) you wouldn&#39;t need one on one time, and wouldn&#39;t need to schedule it.   &quot;Let&#39;s do some time!&quot; sounds like prison.  Parents and children should not be &quot;doing time.&quot;<br/>\n<br/>\nIf it&#39;s not more interesting to be with you than to watch YouTube, either give it up or become more interesting.<br/>\n<br/>\nIf my husband said &quot;Do you want to do some time with me?&quot; I would probably say no.  It doesn&#39;t sound very fun.  If he asked me to help in the yard, or go out to breakfast, or look at something very cool he&#39;s found you YouTube, THAT would sound good.<br/>\n<br/>\n-=-Also, what does one do while watching shows together?? I know I sound like the dumbest person in the world :-) but I&#39;m serious-=-<br/>\n<br/>\nWhat would you do while watching a show with a boyfriend, husband, friend, cousin?  I doubt you would act like a teacher.<br/>\n<br/>\n-=- I&#39;ve made comments (I don&#39;t think critical, but then again not sure), and they hush me or don&#39;t answer, so then we watch the movie/show in silence.-=-<br/>\n<br/>\nIf they want to watch the show, don&#39;t interrupt.  If they don&#39;t answer, that&#39;s communication.  Maybe what you said wasn&#39;t interesting, or they would rather just not talk right then.  Accept it as such.   <br/>\n<br/>\n-=-Then when I ask them at the end of the show if they liked it &/or what they liked, they say they don&#39;t know. Maybe they don&#39;t & that&#39;s okay.<br/>\n-=-<br/>\n<br/>\nI wouldn&#39;t ask a lame question like that.  If you can&#39;t tell whether they liked it by their body language or enthusiasm, or lack of enthusiasm, you&#39;re not paying much attention to them.  If I like a movie I usually say &quot;That was good!&quot; or that was fun, or I liked that, or other natural, normal communication.  If someone asked me &quot;Did you like it?  What did you like about it?&quot; I would feel I was being quizzed in a condescending kind of way, probably.  (But if they asked in a real, normal way, that would be different.)<br/>\n<br/>\n-=-I&#39;ve done that in the past, and it worked. Somethings though can&#39;t be postponed - like going to the farmers market. They close at noon.-=-<br/>\n<br/>\nIf the farmer&#39;s market closes at noon and your kids can&#39;t be persuaded to get up and go, then get vegetables at the grocery store.  Don&#39;t be so attached to one thing that it causes tears and yelling.  The time will come when you can shop early again, but it&#39;s not right now.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/priorities\">http://sandradodd.com/priorities</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sleep habits & my outbursts","postDate":"1337704323","msgId":67263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMzk2QUM3LUZGRjgtNDA2OC1CQzFFLTc0RTZGRkVBM0ZCNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpwZzk4bitqbWhrQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwZzk4bitqbWhrQGVHcm91cHMuY29tPg=="},"prevInTopic":67261,"nextInTopic":67264,"prevInTime":67262,"nextInTime":67264,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"-=-how do I change my name to a name instead of my email?-=- I think it happens from creating a yahoo profile.  It might be something inside your e-mail","messageBody":"<div id=\"ygrps-yiv-978427287\">-=-how do I change my name to a name instead of my email?-=-<br/>\n<br/>\nI think it happens from creating a yahoo profile.  It might be something inside your e-mail preferences.<br/>\n<br/>\n<br/>\n-=- Last night as we were winding down watching our last movie for the night & getting ready for books my 5yo dd unscrewed the finger nail clippers & then wanted the tool box that was out in the garage so she could fix it. I told her we could do it tomorrow & if she wanted to lay it on the night table so it would be there for her in the morning.-=-<br/>\n<br/>\nI wouldn&#39;t have had the nail clippers where a five year old could unscrew them.  If she likes to play with toys while watching a movie, be more proactive with what she&#39;s playing with.<br/>\n<br/>\nKeep the nail clippers up where they (the nail clippers AND the people) are safe and can be found.<br/>\n<br/>\nBut if something was taken apart, I would have put all the pieces in a bag or envelope and mark it and put it with the to-do list.  If you were already in bed, and she was disassembling nail clippers in the bed, that&#39;s a much worse problem.  Each piece of them is a danger.  And they&#39;re inexpensive enough it might have been better to throw the pieces away (which you could do in a bedside trashcan), tell her not to take any apart again because they cost money, and go to sleep.<br/>\n<br/>\nIf you put as much focus on broken nail clippers as on sleep, sleep will suffer.<br/>\nIf you had put more focus on keeping nail clippers up, sleep would have benefited.<br/>\n<br/>\nThat&#39;s not about nail clippers.  That&#39;s about anything, everything.<br/>\n<br/>\n-=- fear their crying/tantrums/anger. I fear that if I don&#39;t give them what they want and then they cry that they will think that I don&#39;t love them (like I did about my mother even though she said no a different way) or that I am a bad mother-=-<br/>\n<br/>\nThen play further ahead on how to keep them amused and content, rather than trying to appease them after they&#39;re crying.<br/>\n<br/>\n-=- I don&#39;t know how to lovingly handle their emotions - they push me away, kick me, scream in my face - they don&#39;t trust me that I want to be there for them.-=-<br/>\n<br/>\nI don&#39;t either.  You&#39;re waiting until they feel like pushing, kicking and screaming to expect them to trust that you&#39;re there for them.   Something happened BEFORE that, and something happened before THAT.  Look back and see what could have been better earlier.<br/>\n<br/>\n-=- wanted the tool box that was out in the garage so she could fix it. I told her we could do it tomorrow & if she wanted to lay it on the night table so it would be there for her in the morning. -=-<br/>\n<br/>\nToo many words.  Say &quot;not tonight.&quot; And say it with authority, not in a sing-songy maybe voice, and not in an &quot;Is it okay with you if we wait until tomorrow?&quot; way.<br/>\n<br/>\n-=-To give examples of what she has done in the past: she will put her hands over the computer, keep the books, push the table with her feet even though there are things on there that could fall & hurt her or spill, not get into her car seat (so we sit there until SHE is ready to go (& this creates another problem for my other two - so now they automatically give her what she wants so that she will stop crying & let them get on with their activity)), take the computer or push it so it might fall off the table, etc. Obviously this has been going on far longer than just these past couple of months.-=-<br/>\n<br/>\nDon&#39;t let her do that.  Say &quot;no.&quot;  Say it simply but without question.  Say &quot;stop.&quot;  <br/>\n<br/>\nBut also consider what was done just before she was doing those things.  Pay more attention to her.  Don&#39;t put the computer where it&#39;s near edges of tables until she&#39;s older.  <br/>\n<br/>\nTry putting her in the car first.  Lure her to the car with something she likes--food, a story on CD, a toy she hasn&#39;t seen for a while. THEN tell the other kids to get in the car.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":523283422,"authorName":"beingfree4meand3@att.net","from":"&quot;beingfree4meand3@...&quot; &lt;beingfree4meand3@...&gt;","profile":"beingfree4meand3@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: sleep habits & my outbursts","postDate":"1337701876","msgId":67261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwZ2NsaythNW90QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQwMDk1QzQxLThDMDItNDUyMS04MDA4LTYwNjNCMENEQzgzM0Bjb21jYXN0Lm5ldD4="},"prevInTopic":67260,"nextInTopic":67263,"prevInTime":67260,"nextInTime":67262,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"-=-Do you offer more enticing things than DVD s and YouTube?-=- Yes & No.  I tell them I m going outside - to clean out the pool & refill it, to hang out, to","messageBody":"<div id=\"ygrps-yiv-894145805\">-=-Do you offer more enticing things than  <br/>\nDVD&#39;s and YouTube?-=- <br/>\nYes & No.  I tell them I&#39;m going outside - to clean out the pool & refill it, to hang out, to do the gardening, to look in the garage - sometimes they come for a bit, but usually they scream to have me come back inside (so they can keep watching).  I took them to the zoo, but then again it was after they watched for most of the morning - it wasn&#39;t until I mentioned that the zoo will be closing in 3 hours then 2 1/2 hrs - then we went.  They&#39;ve always LOVED the zoo.<br/>\n<br/>\n-=-Are you watching together?-=-<br/>\n<br/>\n Again, yes & no.  I do when I can in the sense that I&#39;m getting food/monkey platter or getting something for someone or making a call (not for social reasons), or if by chance one of them wants me to do something for a SHORT while.  They all say they want to have our one on one time, and when I say, &quot;hey, let&#39;s do some time! :-) they say after this show, then again, after this show, etc.  Even after the show I say it again, but then again - can we just watch one more show??  <br/>\n<br/>\nAlso, what does one do while watching shows together??  I know I sound like the dumbest person in the world :-) but I&#39;m serious, as I wrote in another post that the last 6 yrs or so has really affected ME.  I&#39;ve made comments (I don&#39;t think critical, but then again not sure), and they hush me or don&#39;t answer, so then we watch the movie/show in silence.  Then when I ask them at the end of the show if they liked it &/or what they liked, they say they don&#39;t know.  Maybe they don&#39;t & that&#39;s okay.<br/>\n<br/>\n <br/>\n-=-&quot;Taking restrictions off&quot; worries me. &quot;Anything goes&quot; isn&#39;t the best alternative to control!-=-<br/>\n<br/>\nYah, & what does one do now?  How do you go back to reach a balanced middle?  Yikes. and I think my mind is screwed up...<br/>\n<br/>\n-=-Slow down.-=-<br/>\n<br/>\nI guess it&#39;s the same as above.  How??<br/>\n<br/>\n-=-I wonder why you didn&#39;t make appointments later in the day/arrange activities later in the day? That&#39;s one way for everyone to get the sleep they need *and* keep appointments/have fun.-=-<br/>\n<br/>\nI&#39;ve done that in the past, and it worked.  Somethings though can&#39;t be postponed - like going to the farmers market.  They close at noon.  They wake up between 11:30am & 2pm.  Yesterday my oldest dd (7 1/2 yrs) slept until 1:45pm.  I tell them about events/activities that are morning times not set by me, so they can make the choice of going or not.  They say they want to go, but when I try to wake them up, I can&#39;t.  Then they cry & blame me for not getting them up earlier.  I&#39;ve also said to them that (regarding something like the farmers market), they can sleep in while I go & that Gramma will be here while I&#39;m gone.  They again say they want to come, so I work on waking them up, and then I miss out because I can&#39;t get them up or they get up and we move slow because they are cranky, and by then I&#39;m frustrated.  Same with any other appt I make for myself (in the afternoon) - they say they want to come, and then at the last minute they say they don&#39;t, so then I have to make arrangements for gramma to come over which makes me late or I end of missing it.  If they do decide to come & we&#39;re there on time, they complain the whole time we&#39;re there & ask how long it&#39;s going to take, and that they want to leave NOW, etc.  I do let them know in advance what to expect at some of the appts.<br/>\n<br/>\nYah, I have lots of issues within ME.  All of this is due to me, I know.<br/>\n<br/>\nthanks,<br/>\nmarlo <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin Bentley &lt;robin.bentley@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; I&#39;m new to unschooling (learned about it in March of this year).   <br/>\n&gt; &gt; Right now one of my concerns is sleep habits.  I have 7 1/2 yo boy/ <br/>\n&gt; &gt; girl twins & a 5yo daughter, and we all (except dh) sleep together.<br/>\n&gt; &gt;<br/>\n&gt; &gt; We don&#39;t have a tv/cable yet (due to financial situations), so we  <br/>\n&gt; &gt; use the computer for DVDs & utube for watching &quot;tv.&quot;  Since I took  <br/>\n&gt; &gt; off restrictions on this, they watch it all day (unless they take  <br/>\n&gt; &gt; about 1 hour off to do something else) from the time they wake up to  <br/>\n&gt; &gt; the time they go to bed.  I&#39;m understanding this is because I took  <br/>\n&gt; &gt; the tv away 3 years ago, and they are just making up for it (right?).<br/>\n&gt; <br/>\n&gt; Partly that might be true. Do you offer more enticing things than  <br/>\n&gt; DVD&#39;s and YouTube? Are you watching together?<br/>\n&gt; <br/>\n&gt; &quot;Taking restrictions off&quot; worries me. &quot;Anything goes&quot; isn&#39;t the best  <br/>\n&gt; alternative to control!<br/>\n&gt; &gt;<br/>\n&gt; &gt; (For about 1 1/2 years the 4 of us used to go to bed late like this,  <br/>\n&gt; &gt; but it got to be too much for me (stress - missing appts due to  <br/>\n&gt; &gt; sleeping in late, missing out on activities, etc), and so I went  <br/>\n&gt; &gt; back to what I was used to, so they are still in the same mode of  <br/>\n&gt; &gt; late night sleeping.)<br/>\n&gt; <br/>\n&gt; I wonder why you didn&#39;t make appointments later in the day/arrange  <br/>\n&gt; activities later in the day? That&#39;s one way for everyone to get the  <br/>\n&gt; sleep they need *and* keep appointments/have fun.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I get up EARLY (sometimes by an alarm clock) and they sleep in  <br/>\n&gt; &gt; because they are going to bed anywhere from 1-2:30am.<br/>\n&gt; <br/>\n&gt; Get up with them, instead.<br/>\n&gt; <br/>\n&gt; &gt;  I&#39;ve repeatedly told them that this isn&#39;t working out for me, and  <br/>\n&gt; &gt; that I&#39;d like to get on a similar sleep schedule.<br/>\n&gt; <br/>\n&gt; You&#39;re making your sleep issues their problem.  You can get on a  <br/>\n&gt; similar sleep schedule if you don&#39;t get up early.<br/>\n&gt; <br/>\n&gt; &gt; They agreed probably due to fear because I&#39;ve gotten angry about it  <br/>\n&gt; &gt; - whipped covers off, screamed, gotten out of bed & turning all the  <br/>\n&gt; &gt; lights on- just freaking out on them.  I talked to them about 3  <br/>\n&gt; &gt; ideas of what we could do:  1) me wake them up earlier in hopes of  <br/>\n&gt; &gt; going to bed around the same time, 2) me going into another room to  <br/>\n&gt; &gt; sleep & them coming to get me when they are ready for bed, 3) them  <br/>\n&gt; &gt; going into the other room to watch & coming to bed with me when they  <br/>\n&gt; &gt; are ready.<br/>\n&gt; <br/>\n&gt; Too many choices and decisions for them to make so as to make life  <br/>\n&gt; better for *you*. Try it the opposite way - make life better for them  <br/>\n&gt; and it can work out well for all of you.<br/>\n&gt; <br/>\n&gt; &gt; They&#39;ve all opted to the first one because they are all too scared  <br/>\n&gt; &gt; to be alone due to some of the Scooby Doo they watch (now during  <br/>\n&gt; &gt; light hours only because of my oldest daughter being too scared at  <br/>\n&gt; &gt; night).<br/>\n&gt; <br/>\n&gt; Do you watch with them? If they&#39;re left alone to choose things that  <br/>\n&gt; scare them, maybe watching something with them that doesn&#39;t would be a  <br/>\n&gt; good transition to bed. And even if they do decide to watch Scooby- <br/>\n&gt; Doo, then you are there to comfort them to sleep.<br/>\n&gt; <br/>\n&gt; &gt; It feels right when I read articles/posts or when I talk about it,  <br/>\n&gt; &gt; but HOW DO I LIVE IT without abusing my children?????<br/>\n&gt; <br/>\n&gt; Slow down.<br/>\n&gt; <br/>\n&gt; &gt;  Isn&#39;t there someone out there who comes into the home like the  <br/>\n&gt; &gt; &quot;Nanny&quot; and helps people make the unschooling shift? :-)  Or someone  <br/>\n&gt; &gt; whom I can talk to because the therapists don&#39;t do therapy in  <br/>\n&gt; &gt; unschooling?<br/>\n&gt; <br/>\n&gt; Gah. Don&#39;t do that. You&#39;ll be doing what someone tells you to do, but  <br/>\n&gt; until you make your family&#39;s peace and happiness a priority, anything  <br/>\n&gt; a &quot;Nanny&quot; would tell you won&#39;t stick. Make that decision first.<br/>\n&gt; <br/>\n&gt; As far as you being parented in the same way, look at your mothering  <br/>\n&gt; as a way to give your kids what you never had. Be the mother you wish  <br/>\n&gt; *you* had.<br/>\n&gt; <br/>\n&gt; &gt; .  So my post turned into something else besides sleep habits for me.<br/>\n&gt; <br/>\n&gt; It usually is more than one thing....:-)<br/>\n&gt; <br/>\n&gt; Robin B.<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":523283422,"authorName":"beingfree4meand3@att.net","from":"&quot;beingfree4meand3@...&quot; &lt;beingfree4meand3@...&gt;","profile":"beingfree4meand3@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: sleep habits & my outbursts","postDate":"1337698844","msgId":67259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwZzltcytuYmI4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlCMTQ2MDM0LTNGQUQtNDY3Mi04NDY2LTZDRERGNUU1N0I2RUB5YWhvby5jby51az4="},"prevInTopic":67258,"nextInTopic":67260,"prevInTime":67258,"nextInTime":67260,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"-=-Can you experiment with a sequence of lovely things that leads up to sleep - for example, a favourite programme, a warm drink in bed together, a story (or","messageBody":"<div id=\"ygrps-yiv-430638290\">-=-Can you experiment with a sequence of lovely things that leads up to sleep - for example, a favourite programme, a warm drink in bed together, a story (or five :-) read by you, a chat about your day/whatever comes up (maybe in the dark), some sleepy words or a gentle song, some I love yous.... -=-<br/>\n<br/>\n-=-If each thing is followed by another lovely thing they might not mind moving on. The whole thing could easily take a couple of hours, but if you start it a bit earlier, could help to bring sleep on quite a bit earlier than currently for you all, in a lovely way.-=-<br/>\n<br/>\nI like this (even what Sandra said about omitting Scooby Doo), I think this will help all of us.  We&#39;ve had some rough times over these past 6 yrs, and I don&#39;t think I always know how to show love (I think I&#39;m a cold person), and even though this will be a challenge because showing love doesn&#39;t come easy (it used to when the twins were babies but a lot has changed in our family that for some reason I&#39;m always in the self protective state), but I want to find that love again, so I know this will be good for all of us.<br/>\n<br/>\nthanks,<br/>\nMarlo<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Jo &lt;jokirby2004@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On 20 May 2012, at 16:08, &quot;beingfree4meand3@...&quot; &lt;beingfree4meand3@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt; We don&#39;t have a tv/cable yet (due to financial situations), so we use the computer for DVDs & utube for watching &quot;tv.&quot;<br/>\n&gt; <br/>\n&gt; Just thinking practically - what about a 3way headphone set or splitter for them?<br/>\n&gt; <br/>\n&gt; However, if you want them to go to sleep earlier, perhaps you could get a bit more involved in the process.<br/>\n&gt; <br/>\n&gt; Can you experiment with a sequence of lovely things that leads up to sleep - for example, a favourite programme, a warm drink in bed together, a story (or five :-) read by you, a chat about your day/whatever comes up (maybe in the dark), some sleepy words or a gentle song, some I love yous.... <br/>\n&gt; <br/>\n&gt; If each thing is followed by another lovely thing they might not mind moving on. The whole thing could easily take a couple of hours, but if you start it a bit earlier, could help to bring sleep on quite a bit earlier than currently for you all, in a lovely way.<br/>\n&gt; <br/>\n&gt; Jo<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":523283422,"authorName":"beingfree4meand3@att.net","from":"&quot;beingfree4meand3@...&quot; &lt;beingfree4meand3@...&gt;","profile":"beingfree4meand3@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: sleep habits & my outbursts","postDate":"1337698391","msgId":67260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwZzk4bitqbWhrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcwMUQyNjRDLTYwREMtNDg3QS1CRDJGLTU3MjA3OUVEOEREQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67259,"nextInTopic":67261,"prevInTime":67259,"nextInTime":67261,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"-=-Why?  If you want to let them stay up late, why are you getting up early?  That might be part of the problem.-=- I get up early so that I can get things","messageBody":"<div id=\"ygrps-yiv-1268416182\">-=-Why?  If you want to let them stay up late, why are you getting up early?  That might be part of the problem.-=-<br/>\n<br/>\nI get up early so that I can get things done around the house:  pick up messes, vacuum, dishes (all from the day before), laundry, etc.  Also, to get on the computer - we have one, and if I don&#39;t get on it while they are asleep, they scream & cry if I ask to use it while they are on it even though they may have already been on it for 3-4 hours.  <br/>\n<br/>\n-=-If what you think is &quot;the unschooling&quot; thing is also the nonsensical-and-makes-mom-scream thing, then don&#39;t do it.  Don&#39;t do things you don&#39;t understand.  Don&#39;t do things that make you or your children unhappy.-=-<br/>\n-=-No unschooling advice has ever been intended to make people scream or to stress or to cry.-=-<br/>\n<br/>\nYes, I know it hasn&#39;t intended those things.  It&#39;s the fact that I fear their crying/tantrums/anger.  I fear that if I don&#39;t give them what they want and then they cry that they will think that I don&#39;t love them (like I did about my mother even though she said no a different way) or that I am a bad mother, so I give it to them when they cry, and that builds up resentment in me/rage & outburst.  I don&#39;t know how to lovingly handle their emotions - they push me away, kick me, scream in my face - they don&#39;t trust me that I want to be there for them.<br/>\n<br/>\nAnd yes, I am confused.  Last night as we were winding down watching our last movie for the night & getting ready for books my 5yo dd unscrewed the finger nail clippers & then wanted the tool box that was out in the garage so she could fix it.  I told her we could do it tomorrow & if she wanted to lay it on the night table so it would be there for her in the morning.  She got angry & started to cry, and when she does this she makes it hard for others to enjoy their time because she will do things to stop everything.  To give examples of what she has done in the past:  she will put her hands over the computer, keep the books, push the table with her feet even though there are things on there that could fall & hurt her or spill, not get into her car seat (so we sit there until SHE is ready to go (& this creates another problem for my other two - so now they automatically give her what she wants so that she will stop crying & let them get on with their activity)), take the computer or push it so it might fall off the table, etc.  Obviously this has been going on far longer than just these past couple of months.<br/>\n<br/>\nmarlo<br/>\n<br/>\nhow do I change my name to a name instead of my email??  <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-I&#39;m new to unschooling (learned about it in March of this year). Right now one of my concerns is sleep habits. I have 7 1/2 yo boy/girl twins & a 5yo daughter, and we all (except dh) sleep together.--=<br/>\n&gt; <br/>\n&gt; You went too quickly.<br/>\n&gt; Instead of saying yes various times for particular reasons, you said there were no more restrictions or limits, and that&#39;s what the problem is.<br/>\n&gt; <br/>\n&gt; Find ways to plan toward sleep--maybe one quiet movie, after which you all hold hands and go to sleep, or listen to a quiet story while you&#39;re going to sleep, or soft music.<br/>\n&gt; <br/>\n&gt; -=-I get up EARLY (sometimes by an alarm clock) -=-<br/>\n&gt; <br/>\n&gt; Why?<br/>\n&gt; <br/>\n&gt; IF you want to let them stay up late, why are you getting up early?  That might be part of the problem.<br/>\n&gt; <br/>\n&gt; -=-I&#39;ve repeatedly told them that this isn&#39;t working out for me, and that I&#39;d like to get on a similar sleep schedule.-=-<br/>\n&gt; <br/>\n&gt; But you&#39;re not willing to sleep until  you wake up naturally?<br/>\n&gt; <br/>\n&gt; -=-They&#39;ve all opted to the first one because they are all too scared to be alone due to some of the Scooby Doo they watch (now during light hours only because of my oldest daughter being too scared at night)-=-<br/>\n&gt; <br/>\n&gt; Find happier things for them to watch.  Tell them not to watch Scooby Doo because it keeps them from sleeping.<br/>\n&gt; <br/>\n&gt; -=-I feel guilty for telling them &quot;no,&quot; and to turn it off & go to bed because then they cry & then I think I did the not-so-unschooling thing. -=-<br/>\n&gt; <br/>\n&gt; If what you think is &quot;the unschooling&quot; thing is also the nonsensical-and-makes-mom-scream thing, then don&#39;t do it.  Don&#39;t do things you don&#39;t understand.  Don&#39;t do things that make you or your children unhappy.<br/>\n&gt; <br/>\n&gt; No unschooling advice has ever been intended to make people scream or to stress or to cry.<br/>\n&gt; <br/>\n&gt; -=-Isn&#39;t there someone out there who comes into the home like the &quot;Nanny&quot; and helps people make the unschooling shift? :-) -=-<br/>\n&gt; <br/>\n&gt; Not someone who knows more than you do.  Anyone who would leave her own young children home to take money to claim to help you with yours isn&#39;t a good person to hire.<br/>\n&gt; <br/>\n&gt; There is ample free advice available.  Read a little, try a little, wait a while, watch.  <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sleep habits & my outbursts","postDate":"1337679167","msgId":67258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGRjk4QTBGLUZEODUtNDdCRS04MTkwLUVFMEVDODVFOTcxNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQwMDk1QzQxLThDMDItNDUyMS04MDA4LTYwNjNCMENEQzgzM0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPiA8NDAwOTVDNDEtOEMwMi00NTIxLTgwMDgtNjA2M0IwQ0RDODMzQGNvbWNhc3QubmV0Pg=="},"prevInTopic":67235,"nextInTopic":67259,"prevInTime":67257,"nextInTime":67259,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"A post came that I returned, for having too much advice that wasn t aligned with unschooling principles.  I want to mention some and quote some of it, without","messageBody":"<div id=\"ygrps-yiv-911187315\">A post came that I returned, for having too much advice that wasn&#39;t aligned with unschooling principles.  I want to mention some and quote some of it, without attaching it to an individual.<br/>\n<br/>\nOf course, yes, there are things people can do and try, but for the Always Learning list I would like for the ideas to be from and by and for unschooling.  Yes, sometimes people might need side help for emotional problems, but that shouldn&#39;t be central to their relationship with their children.  <br/>\n<br/>\nSo someone recommended &quot; Emotional Freedom Technique, EFT or tapping &quot; and &quot;energy work.&quot;<br/>\nIf an unschooling mom waits to explore things like that without making changes, she can be ruining the relationship with her children in the meantime.  There are tools and methods in and among unschooling writing, and I would much prefer those be recommended first.  YES a om might need more help, and in that case she should go to another kind of discussion to find that.  <br/>\n<br/>\nThis is something whole from the post.  If I&#39;m going to criticize this, I didn&#39;t want to single out an individual.  I&#39;ve seen other families lately where the mom was talking too much to children who were too young, and this reminds me of that.  So my comments aren&#39;t to or about one person at all.  They&#39;re about the ideas.<br/>\n<br/>\n-=-I find that when I explain to my kids that if we work as a team the whole house is happier.  I tell them when they are stressed that I am on their side, lets work this out, what do they need and what can I contribute to getting their needs met.  This has helped my 5 year old daughter be away from me when she really did not want but I really needed it. I reversed it and said this was a time I needed her to help me by letting me go alone for a treatment.  I explained that I was not a happy mom, I was having really bad headaches, and I needed to go and do something for myself that she could not come to so that I could be happier.  She understood that so maybe if you cannot change your sleep schedule you could talk to them about slowly moving to an earlier schedule together and that would help you be happier.  Not in a &quot;Do this or I won&#39;t be happy&quot; kind of way though.  Just in a lets work together because this arrangement is not the best for everyone in the family kind of way.-=-<br/>\n<br/>\nTelling a child that she needs to do/be different so that the mom can go somewhere so she (the mom) can be hapier is EXACTLY a &quot;Do this or I won&#39;t be happy&quot; thing.<br/>\n<br/>\nIf a mother has created a bad, tacky sleep problem, she should NOT need to gradually move them to something that makes sense.  She should say &quot;Maybe tomorrow night you can stay up later, but tonight we all need to go to sleep.<br/>\n<br/>\nThis discussion list shouldn&#39;t need to spend hours and hours explaining to every mom who has gone too far too fast that nobody said &quot;stay awake as long as you want.&quot;  Advice against having a bunch of rules, including arbitrary bedtimes, is about **ARBITRARY** bedtimes, such as a bedtime of  7:00 by the clock because a child is five years old.    It&#39;s NOT and never was and never should be about telling a child &quot;you can go to bed when you want to now because we&#39;re unschoolers.&quot;  <br/>\n<br/>\n&quot;I&#39;m really tired and we all need to go to sleep,&quot; is not arbitrary.  And it doesn&#39;t need to be sudden, or mean.  It should NOT be, ideally, and that&#39;s the kind of advice we&#39;re trying to give.  Create a welcoming, quieter, peaceful environment when the house should be getting quieter.  Even a child who&#39;s staying up a little later, because the mom is being sweet and letting him or her play a while longer, or finish watching a movie, or play a video game, should be doing so very quietly, if anyone is already asleep, even the neighbors.<br/>\n<br/>\n-=- I tell them when they are stressed that I am on their side, lets work this out, what do they need and what can I contribute to getting their needs met.-=-<br/>\n<br/>\nWhen a young child is stressed out, the mother should do what she knows will contribute to getting their needs met. <br/>\nThe mother should not ask a very young child &quot;what can I do to contribute to your getting your needs met?&quot; <br/>\nShe should be a comforting, present, attentive mother who tries one thing and another, gently, and figures out and learns how to handle the situations better and better, as she becomes more experienced.  It&#39;s not the child&#39;s job to know what she needs and conversationally explain that to her mother.<br/>\n<br/>\nWith a seventeen year old, maybe ask and discuss.  With a five year old (or younger, certainly!!) just find ways to gradually move toward being a better mom.  Avoid bad decisions, and make better decisions.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nThose can help parents be calm and not scream.  Changing thoughts and approaches can help a mom not to scream. <br/>\n<br/>\nAvoid things like these:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/screwitup\">http://sandradodd.com/screwitup</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sleep habits & my outbursts","postDate":"1337584292","msgId":67235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzc1ODQyOTIuOTA5MTIuWWFob29NYWlsTmVvQHdlYjEyMjUwMS5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg=="},"prevInTopic":67233,"nextInTopic":67258,"prevInTime":67234,"nextInTime":67237,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"***I ve repeatedly told them that this isn t working out for me, and that I d like to get on a similar sleep schedule. They agreed probably due to fear because","messageBody":"<div id=\"ygrps-yiv-502390984\">***I&#39;ve repeatedly told them that this isn&#39;t working out for me, and that I&#39;d like to get on a similar sleep schedule. They agreed probably due to fear because I&#39;ve gotten angry about it - whipped covers off, screamed, gotten out of bed & turning all the lights on- just freaking out on them.***<br/>\n<br/>\nI know one thing for certain!  If you get so dramatic like this, your adrenaline will kick in and you will have a much much harder time falling back to peaceful sleep and so will your kids!  Maybe remember that every ounce of dramatic energy you expel, will be just more time awake and how counter productive that is!<br/>\n<br/>\nThere is nothing worse, for me than being sleep deprived late at night.  I get very grumpy even when I try very hard to be kind.  I have learned over the years that if I remind my family that I&#39;m tired and feel myself getting grumpy, that they have a heads up about how to proceed in their own doings!  I&#39;ve even said things like, &quot;Look, if you push me right now I&#39;m likely to get very snappy and possibly mean and none of us want that, so what can we do that is good for everyone?&quot;<br/>\n<br/>\nSnuggling down with a quiet movie is often the best thing ever for all of us!  I will often be the one who sets the tone, I get the beds ready and turn down the lights and pick the movie and invite my one kiddo that is still sleeping in the same room as me (she&#39;s 10).  Sometimes I let her pick what to watch, but I veto some things that I know are loud or bright or wild.  It works pretty well!  On the rare occasion that she&#39;s just not tired, my husband stays up with her, or sleeps near her ready to be woken and helped into bed when she&#39;s ready.  He&#39;s much better at dealing with interrupted sleep than I am.  <br/>\n<br/>\nIt used to be that I&#39;d get grumpy and mean without any warning and that was just not good for anyone.  Once I figured out how to give a warning about my tiredness creeping up, things got better.  It took a while to get a routine but it is rare that I get upset about lack of sleep now.  Although, if there are lots of teenagers being loud, late at night, I will tell them that if they wake me, it might be like waking the beast, very scary indeed!  We have a small house and sometimes there are lots of kids here and the teens tend to stay up all night.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sleep habits & my outbursts","postDate":"1337558676","msgId":67233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMDk1QzQxLThDMDItNDUyMS04MDA4LTYwNjNCMENEQzgzM0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg=="},"prevInTopic":67232,"nextInTopic":67235,"prevInTime":67232,"nextInTime":67234,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... Partly that might be true. Do you offer more enticing things than DVD s and YouTube? Are you watching together? Taking restrictions off worries me.","messageBody":"<div id=\"ygrps-yiv-897600223\"><blockquote><span title=\"ireply\">&gt; I&#39;m new to unschooling (learned about it in March of this year).   <br/>\n&gt; Right now one of my concerns is sleep habits.  I have 7 1/2 yo boy/ <br/>\n&gt; girl twins & a 5yo daughter, and we all (except dh) sleep together.<br/>\n&gt;<br/>\n&gt; We don&#39;t have a tv/cable yet (due to financial situations), so we  <br/>\n&gt; use the computer for DVDs & utube for watching &quot;tv.&quot;  Since I took  <br/>\n&gt; off restrictions on this, they watch it all day (unless they take  <br/>\n&gt; about 1 hour off to do something else) from the time they wake up to  <br/>\n&gt; the time they go to bed.  I&#39;m understanding this is because I took  <br/>\n&gt; the tv away 3 years ago, and they are just making up for it (right?).<br/>\n<br/>\n </span></blockquote>Partly that might be true. Do you offer more enticing things than  <br/>\nDVD&#39;s and YouTube? Are you watching together?<br/>\n<br/>\n&quot;Taking restrictions off&quot; worries me. &quot;Anything goes&quot; isn&#39;t the best  <br/>\nalternative to control!<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; (For about 1 1/2 years the 4 of us used to go to bed late like this,  <br/>\n&gt; but it got to be too much for me (stress - missing appts due to  <br/>\n&gt; sleeping in late, missing out on activities, etc), and so I went  <br/>\n&gt; back to what I was used to, so they are still in the same mode of  <br/>\n&gt; late night sleeping.)<br/>\n<br/>\n </span></blockquote>I wonder why you didn&#39;t make appointments later in the day/arrange  <br/>\nactivities later in the day? That&#39;s one way for everyone to get the  <br/>\nsleep they need *and* keep appointments/have fun.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I get up EARLY (sometimes by an alarm clock) and they sleep in  <br/>\n&gt; because they are going to bed anywhere from 1-2:30am.<br/>\n<br/>\n </span></blockquote>Get up with them, instead.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I&#39;ve repeatedly told them that this isn&#39;t working out for me, and  <br/>\n&gt; that I&#39;d like to get on a similar sleep schedule.<br/>\n<br/>\n </span></blockquote>You&#39;re making your sleep issues their problem.  You can get on a  <br/>\nsimilar sleep schedule if you don&#39;t get up early.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They agreed probably due to fear because I&#39;ve gotten angry about it  <br/>\n&gt; - whipped covers off, screamed, gotten out of bed & turning all the  <br/>\n&gt; lights on- just freaking out on them.  I talked to them about 3  <br/>\n&gt; ideas of what we could do:  1) me wake them up earlier in hopes of  <br/>\n&gt; going to bed around the same time, 2) me going into another room to  <br/>\n&gt; sleep & them coming to get me when they are ready for bed, 3) them  <br/>\n&gt; going into the other room to watch & coming to bed with me when they  <br/>\n&gt; are ready.<br/>\n<br/>\n </span></blockquote>Too many choices and decisions for them to make so as to make life  <br/>\nbetter for *you*. Try it the opposite way - make life better for them  <br/>\nand it can work out well for all of you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They&#39;ve all opted to the first one because they are all too scared  <br/>\n&gt; to be alone due to some of the Scooby Doo they watch (now during  <br/>\n&gt; light hours only because of my oldest daughter being too scared at  <br/>\n&gt; night).<br/>\n<br/>\n </span></blockquote>Do you watch with them? If they&#39;re left alone to choose things that  <br/>\nscare them, maybe watching something with them that doesn&#39;t would be a  <br/>\ngood transition to bed. And even if they do decide to watch Scooby- <br/>\nDoo, then you are there to comfort them to sleep.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It feels right when I read articles/posts or when I talk about it,  <br/>\n&gt; but HOW DO I LIVE IT without abusing my children?????<br/>\n<br/>\n </span></blockquote>Slow down.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Isn&#39;t there someone out there who comes into the home like the  <br/>\n&gt; &quot;Nanny&quot; and helps people make the unschooling shift? :-)  Or someone  <br/>\n&gt; whom I can talk to because the therapists don&#39;t do therapy in  <br/>\n&gt; unschooling?<br/>\n<br/>\n </span></blockquote>Gah. Don&#39;t do that. You&#39;ll be doing what someone tells you to do, but  <br/>\nuntil you make your family&#39;s peace and happiness a priority, anything  <br/>\na &quot;Nanny&quot; would tell you won&#39;t stick. Make that decision first.<br/>\n<br/>\nAs far as you being parented in the same way, look at your mothering  <br/>\nas a way to give your kids what you never had. Be the mother you wish  <br/>\n*you* had.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; .  So my post turned into something else besides sleep habits for me.<br/>\n<br/>\n </span></blockquote>It usually is more than one thing....:-)<br/>\n<br/>\nRobin B.<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":283914803,"authorName":"Jo","from":"Jo &lt;jokirby2004@...&gt;","profile":"jokirby2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sleep habits & my outbursts","postDate":"1337554439","msgId":67232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCMTQ2MDM0LTNGQUQtNDY3Mi04NDY2LTZDRERGNUU1N0I2RUB5YWhvby5jby51az4=","inReplyToHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg=="},"prevInTopic":67230,"nextInTopic":67233,"prevInTime":67231,"nextInTime":67233,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"... Just thinking practically - what about a 3way headphone set or splitter for them? However, if you want them to go to sleep earlier, perhaps you could get a","messageBody":"<div id=\"ygrps-yiv-430287772\">On 20 May 2012, at 16:08, &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:beingfree4meand3@...\">beingfree4meand3@...</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:beingfree4meand3@...\">beingfree4meand3@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We don&#39;t have a tv/cable yet (due to financial situations), so we use the computer for DVDs & utube for watching &quot;tv.&quot;<br/>\n<br/>\n </span></blockquote>Just thinking practically - what about a 3way headphone set or splitter for them?<br/>\n<br/>\nHowever, if you want them to go to sleep earlier, perhaps you could get a bit more involved in the process.<br/>\n<br/>\nCan you experiment with a sequence of lovely things that leads up to sleep - for example, a favourite programme, a warm drink in bed together, a story (or five :-) read by you, a chat about your day/whatever comes up (maybe in the dark), some sleepy words or a gentle song, some I love yous.... <br/>\n<br/>\nIf each thing is followed by another lovely thing they might not mind moving on. The whole thing could easily take a couple of hours, but if you start it a bit earlier, could help to bring sleep on quite a bit earlier than currently for you all, in a lovely way.<br/>\n<br/>\nJo</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sleep habits & my outbursts","postDate":"1337553063","msgId":67230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwMUQyNjRDLTYwREMtNDg3QS1CRDJGLTU3MjA3OUVEOEREQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg=="},"prevInTopic":67228,"nextInTopic":67232,"prevInTime":67229,"nextInTime":67231,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"-=-I m new to unschooling (learned about it in March of this year). Right now one of my concerns is sleep habits. I have 7 1/2 yo boy/girl twins & a 5yo","messageBody":"<div id=\"ygrps-yiv-1007534943\">-=-I&#39;m new to unschooling (learned about it in March of this year). Right now one of my concerns is sleep habits. I have 7 1/2 yo boy/girl twins & a 5yo daughter, and we all (except dh) sleep together.--=<br/>\n<br/>\nYou went too quickly.<br/>\nInstead of saying yes various times for particular reasons, you said there were no more restrictions or limits, and that&#39;s what the problem is.<br/>\n<br/>\nFind ways to plan toward sleep--maybe one quiet movie, after which you all hold hands and go to sleep, or listen to a quiet story while you&#39;re going to sleep, or soft music.<br/>\n<br/>\n-=-I get up EARLY (sometimes by an alarm clock) -=-<br/>\n<br/>\nWhy?<br/>\n<br/>\nIF you want to let them stay up late, why are you getting up early?  That might be part of the problem.<br/>\n<br/>\n-=-I&#39;ve repeatedly told them that this isn&#39;t working out for me, and that I&#39;d like to get on a similar sleep schedule.-=-<br/>\n<br/>\nBut you&#39;re not willing to sleep until  you wake up naturally?<br/>\n<br/>\n-=-They&#39;ve all opted to the first one because they are all too scared to be alone due to some of the Scooby Doo they watch (now during light hours only because of my oldest daughter being too scared at night)-=-<br/>\n<br/>\nFind happier things for them to watch.  Tell them not to watch Scooby Doo because it keeps them from sleeping.<br/>\n<br/>\n-=-I feel guilty for telling them &quot;no,&quot; and to turn it off & go to bed because then they cry & then I think I did the not-so-unschooling thing. -=-<br/>\n<br/>\nIf what you think is &quot;the unschooling&quot; thing is also the nonsensical-and-makes-mom-scream thing, then don&#39;t do it.  Don&#39;t do things you don&#39;t understand.  Don&#39;t do things that make you or your children unhappy.<br/>\n<br/>\nNo unschooling advice has ever been intended to make people scream or to stress or to cry.<br/>\n<br/>\n-=-Isn&#39;t there someone out there who comes into the home like the &quot;Nanny&quot; and helps people make the unschooling shift? :-) -=-<br/>\n<br/>\nNot someone who knows more than you do.  Anyone who would leave her own young children home to take money to claim to help you with yours isn&#39;t a good person to hire.<br/>\n<br/>\nThere is ample free advice available.  Read a little, try a little, wait a while, watch.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":523283422,"authorName":"beingfree4meand3@att.net","from":"&quot;beingfree4meand3@...&quot; &lt;beingfree4meand3@...&gt;","profile":"beingfree4meand3@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"sleep habits & my outbursts","postDate":"1337526535","msgId":67228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwYjFlNytrMzA1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67230,"prevInTime":67227,"nextInTime":67229,"topicId":67228,"numMessagesInTopic":0,"msgSnippet":"I m new to unschooling (learned about it in March of this year).  Right now one of my concerns is sleep habits.  I have 7 1/2 yo boy/girl twins & a 5yo","messageBody":"<div id=\"ygrps-yiv-1542693548\">I&#39;m new to unschooling (learned about it in March of this year).  Right now one of my concerns is sleep habits.  I have 7 1/2 yo boy/girl twins & a 5yo daughter, and we all (except dh) sleep together.<br/>\n<br/>\n We don&#39;t have a tv/cable yet (due to financial situations), so we use the computer for DVDs & utube for watching &quot;tv.&quot;  Since I took off restrictions on this, they watch it all day (unless they take about 1 hour off to do something else) from the time they wake up to the time they go to bed.  I&#39;m understanding this is because I took the tv away 3 years ago, and they are just making up for it (right?).<br/>\n<br/>\n(For about 1 1/2 years the 4 of us used to go to bed late like this, but it got to be too much for me (stress - missing appts due to sleeping in late, missing out on activities, etc), and so I went back to what I was used to, so they are still in the same mode of late night sleeping.)<br/>\n<br/>\nI get up EARLY (sometimes by an alarm clock) and they sleep in because they are going to bed anywhere from 1-2:30am.  Well, because I get up so early, I&#39;m falling asleep sitting on the couch around 9:30-10pm.  At that point I tell them that I&#39;m going to bed, and they bring up the computer & continue watching (with the volume down).  What is hard for me is that once we move our way up to bed I lay there & listen to it & can no longer fall back to sleep, my youngest wants to nurse on & off, which keeps me up also, and then when they have to go to the bathroom, they want me to go with them.  I&#39;ve repeatedly told them that this isn&#39;t working out for me, and that I&#39;d like to get on a similar sleep schedule.  They agreed probably due to fear because I&#39;ve gotten angry about it - whipped covers off, screamed, gotten out of bed & turning all the lights on- just freaking out on them.  I talked to them about 3 ideas of what we could do:  1) me wake them up earlier in hopes of going to bed around the same time, 2) me going into another room to sleep & them coming to get me when they are ready for bed, 3) them going into the other room to watch & coming to bed with me when they are ready.  They&#39;ve all opted to the first one because they are all too scared to be alone due to some of the Scooby Doo they watch (now during light hours only because of my oldest daughter being too scared at night).  Well, I&#39;ve been waking them up early for about 1 1/2 months now, but they still stay up this late.  I will say though, that at times I don&#39;t wake them up because I feel too guilty for doing it.  I want them to wake when their bodies are ready to wake.  It&#39;s the same as them watching tv late at night - I feel guilty for telling them &quot;no,&quot; and to turn it off & go to bed because then they cry & then I think I did the not-so-unschooling thing.   <br/>\n<br/>\nWell, last night I screamed so much that my voice went hoarse, and this is not the first time that I&#39;ve done this.  I have a history of screaming at & frightening, manipulating, etc (all the bad shit) my children.  They are very scared of me, and I hate that; I hate myself for the person I&#39;ve become; I want them to trust me, & I want to have the relationship with my children that I see all of you have with your children (from reading this post & most of the articles that Sandra, Pam, Joyce & others have written).  My mother sees nothing wrong with me screaming (probably because that&#39;s the way she raised me).  That is the part that scares/concerns me - my reactions.  I have gone to a therapist that deals with cognative behavior therapy & done The Work of Byron Katie, read Ekhart Tolle, etc, but I can&#39;t get past this junk in my head.  I understand the philosophy of unschooling, and it&#39;s the way of life that I want for my children/family and myself, but I don&#39;t know how to make the shift mentally/physically.   It feels right when I read articles/posts or when I talk about it, but HOW DO I LIVE IT without abusing my children?????  Isn&#39;t there someone out there who comes into the home like the &quot;Nanny&quot; and helps people make the unschooling shift? :-)  Or someone whom I can talk to because the therapists don&#39;t do therapy in unschooling?<br/>\n<br/>\nWell, I guess I&#39;ve said enough for now.  So my post turned into something else besides sleep habits for me.   Any thoughts will be much appreciated.<br/>\n<br/>\nMarlo</div>","specialLinks":[]}],"prevTopicId":67393,"nextTopicId":67297}}