{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Religion and food choices","postDate":"1326714434","msgId":65072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwM0UxQTQ4LTc4QzMtNEQ2NC1CNUQ3LTFCRDAzRDk3REY3REB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDU3NTU3MS45MzE5LmJtQHNtdHAxMDEubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDU3NTU3MS45MzE5LmJtQHNtdHAxMDEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":65051,"nextInTopic":0,"prevInTime":65071,"nextInTime":65073,"topicId":65040,"numMessagesInTopic":0,"msgSnippet":"... This is where many parents thinking gets stuck trying to wrap their minds around unschooling. Their focus is on kids learning and doing things the right","messageBody":"<div id=\"ygrps-yiv-333750118\">On Jan 15, 2012, at 11:38 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather10277903@...\">heather10277903@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My oldest makes her own choices about food, and what she chooses<br/>\n&gt; to believe in. We allow this because she is mature, responsible,<br/>\n&gt; and making positive choices. My younger two are not allowed<br/>\n&gt; to make choices like that yet. They are still learning why its i<br/>\n&gt; mportant to us and why we make choices that we make. <br/>\n<br/>\n </span></blockquote>This is where many parents&#39; thinking gets stuck trying to wrap their minds around unschooling. Their focus is on kids learning and doing things the right way. If they let go of controls, they&#39;re sure their kids won&#39;t make the &quot;right&quot; choices, e.g., the parents&#39; choices. And that will be true in many cases!<br/>\n<br/>\nThey won&#39;t be making the parents&#39; choices right away. They&#39;ll be trying things to explore the good parts and bad parts to discover what they find good and bad, right and wrong for them.<br/>\n<br/>\nThe focus of unschooling is choice, discovery, exploration and thought in a supportive, safe environment. (Which means until kids can make the right choice in dangerous situations like crossing the road, parents are there to partner with them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Religion and food choices","postDate":"1326662243","msgId":65051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJDRjg0QzlELTJBQjUtNEE2MS1BRjcyLUM1QUZEREYwNDhGMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpldjZ0NitiNW5iQGVHcm91cHMuY29tPg==","referencesHeader":"PGpldjZ0NitiNW5iQGVHcm91cHMuY29tPg=="},"prevInTopic":65048,"nextInTopic":65072,"prevInTime":65050,"nextInTime":65052,"topicId":65040,"numMessagesInTopic":0,"msgSnippet":"-=-Limiting the choices your kids get to make won t guarantee they ll make the choices you deem good when you no longer have the power to limit them. -=- True,","messageBody":"<div id=\"ygrps-yiv-740708979\">-=-Limiting the choices your kids get to make won&#39;t guarantee they&#39;ll make the choices you deem good when you no longer have the power to limit them. -=-<br/>\n<br/>\nTrue, but there are some parents who can&#39;t and don&#39;t allow some things.<br/>\nWhen Pam Sorooshian&#39;s daughter got married, it was first planned for her parents&#39; back yard.  It was moved to Roya&#39;s own back yard (over on the next street) because she and her fiancee wanted to have liquor for guests, and Pam and Cyrus&#39;s religion doesn&#39;t allow for liquor.  They didn&#39;t have a fight and boycott the wedding or anything at all.  They just weren&#39;t comfortable hosting it in their own home.<br/>\n<br/>\nI can&#39;t and don&#39;t condone dishonesty as a valid option.  I would never lie to cover for my kids.  If they were home, I wouldn&#39;t say &quot;he&#39;s not home.&quot;  When if they admitted to having been dishonest (in rare, long-ago, minor ways) I reacted to it as a bad option they could have done better on.<br/>\n<br/>\n-=-It&#39;s good to know what you want to prioritize, it&#39;s helpful in making decisions with clarity. Since this list prioritizes unschooling, I&#39;m going to respond to that topic.-=-<br/>\n<br/>\nThe overarching question, I think, is whether unschooling can be secondary to religion, in priorities.<br/>\nThere are ways to do that, or ways to see it so that it works as well as it can within the stated bounds, in many cases.<br/>\n<br/>\n-=That&#39;s one of the reasons unschoolers look for more options for kids - it&#39;s not some kind of airy fantasy of free children...-=-<br/>\n<br/>\nFor me it certainly wasn&#39;t an airy fantasy of free children, but for some families it does seem to be that.  Airy fairy delusion.  Perhaps I&#39;m changing the subject, or perhaps I can bring it back around and agree with Meredith that parents should look for the reasons behind religious restrictions, and the purposes of the rules and laws they&#39;re sharing with the kids, so that it doesn&#39;t seem to the kids that it&#39;s airy on the other side, too.<br/>\n<br/>\nKids can use a little bit of solid heartfelt information.  Somewhere between &quot;because I said so&quot; or &quot;so you won&#39;t go to hell&quot; and a 500 word explanation involving history and culture might be a just-right six or ten word answer that will make them feel loved and comfortable and happy to be where they are.<br/>\n<br/>\nEven restrictions can be applied without antagonism, if it&#39;s &quot;we&#39;re going to do this&quot; instead of YOU are going to do this.  Potentially.  Ideally.  (Irritating examples are springing to mind, but they&#39;re not about religion.)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Religion and food choices","postDate":"1326659282","msgId":65048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5MzM5OEQwLTRFNkEtNDFDMS04NENELUQ3NUVDN0ExQzY2Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU3NTU3MS45MzE5LmJtQHNtdHAxMDEubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDU3NTU3MS45MzE5LmJtQHNtdHAxMDEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":65045,"nextInTopic":65051,"prevInTime":65047,"nextInTime":65049,"topicId":65040,"numMessagesInTopic":0,"msgSnippet":"-=-My oldest makes her own choices about food, and what she chooses to believe in. We allow this because she is mature, responsible, and making positive","messageBody":"<div id=\"ygrps-yiv-2029699902\">-=-My oldest makes her own choices about food, and what she chooses to believe in. We allow this because she is mature, responsible, and making positive choices. My younger two are not allowed to make choices like that yet. They are still learning why its important to us and why we make choices that we make. -=-<br/>\n<br/>\nIf you allow her to make choices because she&#39;s making positive choices, then it seems in part that she&#39;s only making choices within your approved range.  That&#39;s not a bad thing.  She&#39;s fifteen.  She could, and can, do MANY things without your permission.  <br/>\n<br/>\n<br/>\nYou&#39;re really new to the list; joined a day and a half ago.  I wish you had waited a while before posting.<br/>\n<br/>\n-=-My husband and I are to be our child&#39;s best teacher & learning corridenator in all areas and for us that includes our beliefs and therefor any food restrictions that go with it. So I fell 8 need to teach them while there young why and how we make our choices.-=-<br/>\n<br/>\nPlease read this about teaching and learning:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teaching\">http://sandradodd.com/teaching</a><br/>\n<br/>\nUnschooling will not thrive in the presence of teaching.  It&#39;s only a small adjustment to seeing their learning without thinking it needs to come from teaching.<br/>\n<br/>\nIf that seems wrong to you, it won&#39;t surprise me.  Many people say &quot;just semantics&quot; or &quot;too picky&quot; about that.  If you feel that way, please do continue to read this list, though, and see if you feel differently after a while.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/semantics\">http://sandradodd.com/semantics</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Religion and food choices","postDate":"1326653158","msgId":65045,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpldjZ0NitiNW5iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU3NTU3MS45MzE5LmJtQHNtdHAxMDEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":65040,"nextInTopic":65048,"prevInTime":65044,"nextInTime":65046,"topicId":65040,"numMessagesInTopic":0,"msgSnippet":"... **************** It s good to know what you want to prioritize, it s helpful in making decisions with clarity. Since this list prioritizes unschooling, I m","messageBody":"<div id=\"ygrps-yiv-1948170469\">&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather10277903@...\">heather10277903@...</a>&quot; &lt;heather10277903@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;   In our family part of why we choose to homeschool is so we  can put our religion first.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt&#39;s good to know what you want to prioritize, it&#39;s helpful in making decisions with clarity. Since this list prioritizes unschooling, I&#39;m going to respond to that topic.<br/>\n<br/>\nPrioritizing &quot;religion&quot; in the sense of the rules and limitations of religion can get in the way of learning, just like prioritizing rules and limits in any other sense. So in order to help religious beliefs work well in the context of natural learning, it&#39;s a good idea to step back and thinking about the reasons for all those rules. Why do they exist? Why do they matter? If the reasons aren&#39;t important to you, then natural learning - unschooling - isn&#39;t going to work in your family.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We allow this because she is mature, responsible, and making positive choices. My younger two are not allowed to make choices like that yet. They are still learning why its important to us and why we make choices that we make.<br/>\n </span></blockquote>********************<br/>\n<br/>\nNone of which will guarantee they&#39;ll learn what you want them to learn. Learning isn&#39;t about teaching ;) Limiting the choices your kids get to make won&#39;t guarantee they&#39;ll make the choices you deem good when you no longer have the power to limit them. That&#39;s one of the reasons unschoolers look for more options for kids - it&#39;s not some kind of airy fantasy of free children, it&#39;s based on the solid repeated experience of how human being respond to limits. Some people eventually give up and accept them. But most either look for ways to break them or sneak around them. <br/>\n<br/>\nIt helps, if natural learning is important to you, to step back from the idea of teaching and instead work on living by the principles you find valuable. If you value peace, be peaceful to your loved ones. What are the principles behind dietary restrictions? That&#39;s going to depend on the religion and sometimes even a particular interpretation of the religion, so it&#39;s a good idea to have a good sense of which principles are important to you.  <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":186504653,"authorName":"heather10277903@yahoo.com","from":"&quot;=?utf-8?B?aGVhdGhlcjEwMjc3OTAzQHlhaG9vLmNvbQ==?=&quot; &lt;heather10277903@...&gt;","profile":"heather10277903","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Religion and food choices","postDate":"1326645495","msgId":65040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NTU3MS45MzE5LmJtQHNtdHAxMDEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":65045,"prevInTime":65039,"nextInTime":65041,"topicId":65040,"numMessagesInTopic":0,"msgSnippet":"Monika, In our family part of why we choose to homeschool is so we  can put our religion first. My kids are spread out in age, 15, 7, 8. My 2 oldest are girls","messageBody":"<div id=\"ygrps-yiv-1396037629\">Monika,<br/>\n  In our family part of why we choose to homeschool is so we  can put our religion first. My kids are spread out in age, 15, 7, 8. My 2 oldest are girls and my youngest is a boy. My oldest makes her own choices about food, and what she chooses to believe in. We allow this because she is mature, responsible, and making positive choices. My younger two are not allowed to make choices like that yet. They are still learning why its important to us and why we make choices that we make.<br/>\n<br/>\nWhen a choice we make is oppisite of what my kids want we discuss why we (the parents) made that choice so my kids understand the reasning. We dont use the &quot;because i said so&quot; statement in our house, we use everything possible as a learning experience. My husband and I are to be our child&#39;s best teacher & learning corridenator in all areas and for us that includes our beliefs and therefor any food restrictions that go with it. So I fell 8 need to teach them while there young why and how we make our choices.<br/>\n<br/>\nLastly in our house Dad has the final say, if he and I are divided. I want my kids to learn that he is the head of our household and we are all to look up to him for support and to lead us. I pray my girls will choose to marry a man who can fill this roll and that my son will grow to be a man who will lead his family in all areas of life with love while following our religion.<br/>\n<br/>\nGood Luck,<br/>\nHeather</div>","specialLinks":[]}],"prevTopicId":65030,"nextTopicId":65053}}