{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Is this unschooling?","postDate":"1339171701","msgId":67568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNkJBRDc0LURFQUEtNDVFRC04NUM1LUI5QUNBRDREQzExQUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4="},"prevInTopic":67564,"nextInTopic":0,"prevInTime":67567,"nextInTime":67569,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"... It struck me that perhaps these kids have been told many times I don t have enough time to myself to write which really meant you kids take up too much","messageBody":"<div id=\"ygrps-yiv-204397145\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; It is so cool when my 13 year old son says, &quot;Mom - you need more time<br/>\n&gt; to write. So, you should write when [name of younger child] is at the<br/>\n&gt; library in the morning, then when I come home - you should leave. Go<br/>\n&gt; to the cafe or the library, so you can focus and write.&quot;<br/>\n&gt;<br/>\n </span></blockquote>It struck me that perhaps these kids have been told many times &quot;I  <br/>\ndon&#39;t have enough time to myself to write&quot; which really meant &quot;you  <br/>\nkids take up too much of my time.&quot; Whether that was said or implied by  <br/>\nwhining or sighing or whatever, the kids got the message.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, digging deeper into unschooling made me look at myself and my<br/>\n&gt; husband as people with valid needs and desires, as well. After 12<br/>\n&gt; years of &quot;putting the kids first,&quot; it became &quot;putting all of us<br/>\n&gt; first.&quot; And, the kids like that better.<br/>\n<br/>\n<br/>\n </span></blockquote>Now that everyone gets &quot;put first&quot; (meaning &quot;mom&quot;) the kids are, of  <br/>\ncourse, going to be happier. Their mom isn&#39;t the victim of their  <br/>\nchildhood anymore. She&#39;s off their backs. It&#39;s the old saw: &quot;If mama  <br/>\nain&#39;t happy, ain&#39;t nobody happy.&quot;<br/>\n<br/>\nI&#39;d be happier if my mom was doing something she wanted to do instead  <br/>\nof trying to make me feel bad. I&#39;d be trying to get her to go to a  <br/>\ncafe, too.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Is this unschooling?","postDate":"1339160907","msgId":67564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzkxNjA5MDcuNDY0ODAuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEZGMkUzRTM0LUQ3M0EtNEM5OC05MzE2LUIwMTU5M0M4QTUyMEB2ZXJpem9uLm5ldD4=","referencesHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4gPDEzMzkwOTMyOTguNDQzNjcuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4gPEZGMkUzRTM0LUQ3M0EtNEM5OC05MzE2LUIwMTU5M0M4QTUyMEB2ZXJpem9uLm5ldD4="},"prevInTopic":67559,"nextInTopic":67568,"prevInTime":67563,"nextInTime":67565,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"Yes I love what Schuyler wrote. I love Schuyler period! I do enjoy time away. Like now my kids are sleeping and I am writing and then I will go water my","messageBody":"<div id=\"ygrps-yiv-631554823\">Yes I love what Schuyler wrote. I love Schuyler period!<br/>\n<br/>\nI do enjoy time away. Like now my kids are sleeping and I am writing and then I will go water my garden.<br/>\nI have fun when I go to the movies with girlfriends . I still miss them and think of them all the time and I rush home so happy to see them.<br/>\n The attitude of those parents was totally different.<br/>\n If you are not happy to come home to your children after you had some &quot;time off&quot; then maybe just send them to school.<br/>\nThey are not a burden.<br/>\n Brian and I always felt the same. When kids were little we never felt like getting away. We would just miss them too much and we still feel the same but  now that they are older we would be OK going to the movies or a gathering without the kids  but I know we would be happy to run back home to them when done!<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Is this unschooling?","postDate":"1339155052","msgId":67559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZGMkUzRTM0LUQ3M0EtNEM5OC05MzE2LUIwMTU5M0M4QTUyMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMzkwOTMyOTguNDQzNjcuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4gPDEzMzkwOTMyOTguNDQzNjcuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":67555,"nextInTopic":67564,"prevInTime":67558,"nextInTime":67560,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"... I suspect you re right about the parents who see connecting with kids as draining. But to put it in perspective, as a big introvert (and an older parent) I","messageBody":"<div id=\"ygrps-yiv-1742740622\">On Jun 7, 2012, at 2:21 PM, BRIAN POLIKOWSKY wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The others said they were happy to be away from the kids doing others stuff.<br/>\n&gt;  My thoughts, maybe they should not be homeschooling and I am glad they are not unschooling.<br/>\n<br/>\n<br/>\n </span></blockquote>I suspect you&#39;re right about the parents who see connecting with kids as draining.<br/>\n<br/>\nBut to put it in perspective, as a big introvert (and an older parent) I did enjoy my time when Kat was off with friends.<br/>\n<br/>\nThat didn&#39;t mean I preferred it. It&#39;s possible to enjoy both :-)<br/>\n<br/>\nThough I do enjoy how Schuyler and others describe working towards being fulfilled by fulfilling their kids&#39; needs. It&#39;s a big viewpoint shift that turns someone to being more (internally) peaceful.<br/>\n<br/>\n************************** begin Schuyler quote **************************<br/>\nI don&#39;t know what did it, but I can almost pinpoint the minute when I turned <br/>\nfrom feeling a need to have my own needs met in a separate but equal kind of way <br/>\nto seeing how being with Simon and Linnaea was meeting my needs in the most <br/>\ninvolved and deep way. We were playing a game on the floor and I just sat and <br/>\nwatched and listened and my cup ran over. Before then, there were moments, there <br/>\nwere flitting bits of fulfilment, but somehow, in that moment all those moments <br/>\ncumulated and showed me, viscerally, the way to meet my own needs by meeting <br/>\ntheirs. <br/>\n<br/>\nDoes that sound like martyrdom? Maybe. What did it take? It took being in Toys R <br/>\nUs one day and getting really hungry and getting really unhappy and recognising <br/>\nthat the two things were linked. It took making sure that I wasn&#39;t hungry. It <br/>\ntook smelling their heads when I was making lists of things that needed to be <br/>\ndone away from them, a sort of biofeedback that pulled me back into them and <br/>\nturned my head from the chores that I was lining up to go and do. It took a <br/>\ngrowing awareness that they were at least as engaging and interesting as the <br/>\nthings I was thinking of doing or that I was thinking would fill me up. And it <br/>\ntook a real recognition that when I got &quot;my time&quot; it didn&#39;t satiate my needs, it <br/>\ndidn&#39;t even begin to meet them. <br/>\n<br/>\nFor me, it was very clearly incremental, it was a step by step building from <br/>\nsmall changes to a point where I was in a position to find personal fulfilment <br/>\nin being with my children. It wasn&#39;t martyrdom, or it didn&#39;t feel as though I&#39;d <br/>\nsacrificed myself for their joy. It did help to get the almost kinetic memory of <br/>\nbeing kind to them, of meeting them where they were instead of expecting them to <br/>\nmeet me where I was. <br/>\n************************** end Schuyler quote **************************<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Is this unschooling?","postDate":"1339143900","msgId":67555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVCN0ZFQUJGLUYzQUQtNERENy05MzFELTAyRDUxOUFBQzU5QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMzkxMTg4NjkuMzYxNjQuWWFob29NYWlsTmVvQHdlYjEyMjUwNS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4gPDEzMzkxMTg4NjkuMzYxNjQuWWFob29NYWlsTmVvQHdlYjEyMjUwNS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":67554,"nextInTopic":67559,"prevInTime":67554,"nextInTime":67556,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"-=- There were moments when I found that I was involved with other kids in ways that I felt their parents should have been there instead.  Not big things, but","messageBody":"<div id=\"ygrps-yiv-1208025468\">-=- There were moments when I found that I was involved with other kids in ways that I felt their parents should have been there instead.  Not big things, but helping kids clean up messes that they made and picking up after their games or finding something or other or finding their parent. -=-<br/>\n<br/>\nI did some of that, but I didn&#39;t mind at all, because partly (in the case of picking up) it was because I didn&#39;t have kids with me and had extra time and patience. :-)<br/>\n<br/>\nAnd also, it was a case of it bothering me more than it was bothering others, so straightening up was selfish in that it made me feel better, and generous in that it was creating a space for future play.<br/>\n<br/>\nHad I thought that I was doing it because one mom was up in her room having a writing retreat at my expense, it would not have seemed so much like a generous gift anymore.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Is this unschooling?","postDate":"1339143612","msgId":67554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3QTgwQjIzLTRGNzUtNDJFNC05RkRBLTkyOUNCRDREN0QzOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpxcmN0NytqYWduQGVHcm91cHMuY29tPg==","referencesHeader":"PGpxcmN0NytqYWduQGVHcm91cHMuY29tPg=="},"prevInTopic":67550,"nextInTopic":67555,"prevInTime":67553,"nextInTime":67555,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"-=-Personally, I find it better to put kindness first. When kids are little, it s kinder to give their needs and desires prioritiy - and not just kinder to the","messageBody":"<div id=\"ygrps-yiv-820125775\">-=-Personally, I find it better to put kindness first. When kids are little, it&#39;s kinder to give their needs and desires prioritiy - and not just kinder to the kids. It feels good to offer kindness and sweetness to your kids. It meets parents needs, as parents, to see joyful children. -=-<br/>\n<br/>\nAnd it makes the parent kinder.<br/>\n<br/>\nI&#39;m hanging out with other unschooling families in Europe for a while here.  It&#39;s okay with my kids, because they&#39;re all past their teens. :-)<br/>\n<br/>\nBecause I gave them TONS of time and attention, they&#39;re now solid and capable and not needy or in danger of being in trouble without me there to watch them.   Putting all of us first would not have gotten us to the independent place we are now.  And Keith is an introvert, so time to himself is heaven.  He has endured my presence and my talkativeness for a long, long time. :-)  He doesn&#39;t mind a break.   I LOVE E-MAIL!!!!   We can keep in touch, and they can ask where things are if they can&#39;t find them. :-)<br/>\n<br/>\nIf everyone is generous to everyone else, they can create enough to feel abundant.  <br/>\nIf each person is measuring to make sure she gets her share, that creates suspicion and resentment and neediness.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Is this unschooling?","postDate":"1339118869","msgId":67550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzkxMTg4NjkuMzYxNjQuWWFob29NYWlsTmVvQHdlYjEyMjUwNS5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4="},"prevInTopic":67549,"nextInTopic":67554,"prevInTime":67549,"nextInTime":67551,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"***Predicting this would be the case, I planned a writing retreat for  myself. How often do I get 5 days in a row with no animal chores, in  an","messageBody":"<div id=\"ygrps-yiv-1578586081\">***Predicting this would be the case, I planned a &quot;writing retreat&quot; for <br/>\nmyself. How often do I get 5 days in a row with no animal chores, in <br/>\nan all-inclusive environment where my kids are surrounded by friends <br/>\nand helpful adults? I hope we all take the time to &quot;unschool&quot; <br/>\nourselves, as well as our kids. -=- ***<br/>\n<br/>\n<br/>\nI had one kid to keep track of and that was hard!  I&#39;m really glad I had the help of half a dozen teens!  There was only one time during the conference when I didn&#39;t know exactly where my kid was.  I knew who she was with though and kept myself visible in the lobby until I saw the parent of the kid who she was with.<br/>\n<br/>\nIn that one moment, he was a helpful adult who knew exactly where my daughter was when I wasn&#39;t exactly sure.  If I had been seriously concerned I would have set out a search and found her.<br/>\n<br/>\nThe point is that I knew where my daughter was and who she was with during the entire conference, aside from that one time.  I checked in with her frequently and missed speakers and chats to ensure that she was okay and had food and whatever else she needed.  I found myself tag teaming with a couple of parents of the kids that she was playing with.  <br/>\n<br/>\nI love conferences but I, in no way, consider them vacations.  They are fun and intense and require far more attention and involvement than any vacation!  I think that&#39;s probably true for any outing that involves lots of kids!<br/>\n<br/>\nI help out kids when I see that they need help.  There were moments when I found that I was involved with other kids in ways that I felt their parents should have been there instead.  Not big things, but helping kids clean up messes that they made and picking up after their games or finding something or other or finding their parent.  When my kids were young I was always RIGHT there.  My youngest is 10, almost 11, and she doesn&#39;t want me RIGHT there all the time.  <br/>\n<br/>\nWhen I was right there, I cleaned up after her and did things for her that she needed and kept her secure by knowing I was near.  To me, it&#39;s more than just a parenting thing, it&#39;s a personal responsibility thing.  For the same reason that I didn&#39;t send my babies to daycare so that I could work, I didn&#39;t have kids so that someone else would look after them and be with them and take care of them.  I&#39;m just a tiny bit selfish that way... I wanted my kids to be with ME! <br/>\n<br/>\nThat stuff came way before I ever decided to even keep my oldest out of school and it continued the same way when I kept her home.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Is this unschooling?","postDate":"1339111143","msgId":67549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpxcmN0NytqYWduQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4="},"prevInTopic":67543,"nextInTopic":67550,"prevInTime":67548,"nextInTime":67550,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"... ************** I can t help wondering if mom took putting the kids first to an extreme of not meeting her own needs, or rarely, so that the whole family","messageBody":"<div id=\"ygrps-yiv-134268224\"><blockquote><span title=\"ireply\">&gt;After 12  <br/>\n&gt; years of &quot;putting the kids first,&quot; it became &quot;putting all of us  <br/>\n&gt; first.&quot; And, the kids like that better.<br/>\n </span></blockquote>**************<br/>\n<br/>\nI can&#39;t help wondering if mom took &quot;putting the kids first&quot; to an extreme of not meeting her own needs, or rarely, so that the whole family suffered as a result. Sometimes moms make that mistake, thinking it&#39;s the right thing to do as a &quot;good&quot; mom or in response to personal baggage. <br/>\n<br/>\n&quot;Putting all of us first&quot; can be another kind of trap - an &quot;equal shares&quot; kind of trap. You had &quot;your time&quot; yesterday, so today its mine. Or &quot;all of us&quot; can be seen as a special kind of unit: you can&#39;t have/do/be something that&#39;s not compatible with &quot;all of us&quot;. Sometimes that&#39;s expressed as &quot;we&#39;re an x family&quot;. <br/>\n<br/>\nPersonally, I find it better to put kindness first. When kids are little, it&#39;s kinder to give their needs and desires prioritiy - and not just kinder to the kids. It feels good to offer kindness and sweetness to your kids. It meets parents needs, as parents, to see joyful children. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It is so cool when my 13 year old son says, &quot;Mom - you need more time  <br/>\n&gt; to write.<br/>\n<br/>\n </span></blockquote>That might be cool. Now and then my daugther will say &quot;you could go sew&quot; (or write, or knit) if I&#39;m kicking around the house looking for something to do. She says it the same way she&#39;d say &quot;you could play this game with me&quot; - a friendly suggestion. <br/>\n<br/>\nBut if mom&#39;s been a martyr in the past, &quot;putting the children first&quot; then it could be a relief to have her out of the way. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Is this unschooling?","postDate":"1339100634","msgId":67543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJEOUVCRjY1LUFBOUYtNDM4Ni05ODcyLUZDQjNEMzczQ0UxMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTXJSTzZKb0JMZ2c4Q05PTU9YRTNxWEU3a2pvZmZYVkpfUjBmYnhfU3I2NzVMal8xZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4gPENBT09UYVhNalpHcjhYTGg9PURyUT04SGdHSGhXZVVXTWdkX0NXd2NCMkMxaFk1WUhOUUBtYWlsLmdtYWlsLmNvbT4gPENBTXJSTzZKb0JMZ2c4Q05PTU9YRTNxWEU3a2pvZmZYVkpfUjBmYnhfU3I2NzVMal8xZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67541,"nextInTopic":67549,"prevInTime":67541,"nextInTime":67544,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"-=-To infer trustworthiness based on attendance of an unschooling conference is unwise.-=- The larger a group gets, the less safety is likely. Exactly as there","messageBody":"<div id=\"ygrps-yiv-1172826772\">-=-To infer trustworthiness based on attendance of an unschooling<br/>\nconference is unwise.-=-<br/>\n<br/>\nThe larger a group gets, the less safety is likely.<br/>\nExactly as there is more danger in a city than a town, a small meeting, gathering or social group can be extremely safe, but with the addition of each individual or family, the &quot;circle&quot; is larger, an eventually the cohesion is gone, the group is several small groups, and people can be there who are insufficiently assimilated or invested to have the qualities or the connections that each individual in a small group/village/family has.<br/>\n<br/>\nIn a group of five or ten, nobody is there who doesn&#39;t know someone.  Or if someone shows up who is unknown, EVERYone there knows that the person is new.  They are assimilated or not accepted. <br/>\n<br/>\nAt a large conference, there could easily be someone there for three or four days that no one else knew, but that everyone assumed others knew.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":229442577,"authorName":"Kris","from":"Kris &lt;kris1956@...&gt;","profile":"louisam1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Is this unschooling?","postDate":"1339099820","msgId":67541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXJSTzZKb0JMZ2c4Q05PTU9YRTNxWEU3a2pvZmZYVkpfUjBmYnhfU3I2NzVMal8xZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBT09UYVhNalpHcjhYTGg9PURyUT04SGdHSGhXZVVXTWdkX0NXd2NCMkMxaFk1WUhOUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4JPENBT09UYVhNalpHcjhYTGg9PURyUT04SGdHSGhXZVVXTWdkX0NXd2NCMkMxaFk1WUhOUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67535,"nextInTopic":67543,"prevInTime":67540,"nextInTime":67543,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"The idea is so foreign that I entirely missed what she was saying the first time through.  Beyond the selfish factor I question the assumption of safety.  To","messageBody":"<div id=\"ygrps-yiv-1376981661\">The idea is so foreign that I entirely missed what she was saying the first<br/>\ntime through.  Beyond the selfish factor I question the assumption of<br/>\nsafety.  To infer trustworthiness based on attendance of an unschooling<br/>\nconference is unwise.<br/>\n<br/>\nKris<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jun 7, 2012 at 11:33 AM, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;wrote:<br/>\n<br/>\n&gt; However, I resent the assumption that the rest of us are there to look<br/>\n&gt; after other people&#39;s kids. Self-centered, ego-centric thinking. Not good.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n�We all question our place in the future. The artist�s job is not to<br/>\nsuccumb to despair but to find an antidote for the emptiness of existence.<br/>\nYou have a clear and lively voice. Don�t be such a defeatist.�  Gertrude<br/>\nStein, Midnight In Paris<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Is this unschooling?","postDate":"1339094036","msgId":67535,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhNalpHcjhYTGg9PURyUT04SGdHSGhXZVVXTWdkX0NXd2NCMkMxaFk1WUhOUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4="},"prevInTopic":67534,"nextInTopic":67541,"prevInTime":67534,"nextInTime":67536,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"... Very often it seems to me that the very kids who actually do need their parent to be more attentive are those whose parents take advantage of all those","messageBody":"<div id=\"ygrps-yiv-303873638\">On Thu, Jun 7, 2012 at 11:01 AM, Robin Bentley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Predicting this would be the case, I planned a &quot;writing retreat&quot; for<br/>\n&gt; myself. How often do I get 5 days in a row with no animal chores, in<br/>\n&gt; an all-inclusive environment where my kids are surrounded by friends<br/>\n&gt; and helpful adults? I hope we all take the time to &quot;unschool&quot;<br/>\n&gt; ourselves, as well as our kids. -=-<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Very often it seems to me that the very kids who actually do need their<br/>\nparent to be more attentive are those whose parents take advantage of all<br/>\nthose other helpful adults to have their own &quot;retreat.&quot;<br/>\n<br/>\nThis topic came up at our park day yesterday, too - about campouts, not<br/>\nconferences, but the same issue of some parents thinking unschooling events<br/>\nare a great time to &quot;trust&quot; their kids to be on their own, knowing that<br/>\nother parents will watch out for them.<br/>\n<br/>\nI feel very strongly about this. I don&#39;t think ANY parent should be &quot;on<br/>\nretreat&quot; unless they have specifically arranged for another adult to BE<br/>\nthat child&#39;s helpful adult.<br/>\n<br/>\nI think parents should be responsible. Not shadow the kids constantly,<br/>\nalthough some kids need a watchful parent to head off problems. But to be<br/>\naware of where a child is, what&#39;s going on in the hotel (or conference<br/>\ngrounds or campout or wherever they are) to check in relatively often and<br/>\neven if just as a distant walk by to take stock of a child&#39;s body language<br/>\n- is he tired, does she look happy, is he getting too wound up and needs<br/>\njust a moment of distraction and calming, who is he hanging with, does she<br/>\nseem overwhelmed or lonely or at loose ends or getting frustrated?? On and<br/>\non - all the things an attentive parent checks out in their kids on a<br/>\nregular basis.<br/>\n<br/>\nI have many times helped a child - a crying, upset, hurt, scared, or very<br/>\nangry child or a child who was doing something inappropriate or dangerous.<br/>\nI think it is nice - that we do have a community of kind and generous<br/>\nadults who step up to help kids. I always help if I can.<br/>\n<br/>\nHowever, I resent the assumption that the rest of us are there to look<br/>\nafter other people&#39;s kids. Self-centered, ego-centric thinking. Not good.<br/>\n<br/>\nJust yesterday someone was talking about having nice long conversations at<br/>\nan event with another particular person. I was kind of floored because &quot;I&quot;<br/>\n(and others) had spent time at that same event helping out that particular<br/>\nperson&#39;s young children who were quite volatile, disruptive, and even<br/>\ndestructive. So I was being helpful and handling difficult situations with<br/>\nkids I didn&#39;t even know while their mom was having nice long conversations<br/>\nwith someone &quot;I&quot; would have loved to have been having a nice long<br/>\nconversation with. Not right.<br/>\n<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Is this unschooling?","postDate":"1339093298","msgId":67534,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzkwOTMyOTguNDQzNjcuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4="},"prevInTopic":67531,"nextInTopic":67535,"prevInTime":67533,"nextInTime":67535,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"My kids are younger at 9 ( will be 10 in a couple weeks) and 6.  I get to do a lot for me compared to even a year ago.  I still want to share everything with","messageBody":"<div id=\"ygrps-yiv-1468865791\">My kids are younger at 9 ( will be 10 in a couple weeks) and 6. <br/>\nI get to do a lot for me compared to even a year ago. <br/>\nI still want to share everything with my kids.<br/>\nRight now Gigi has her best friend over and she  is playing in the play room or her room.<br/>\nI miss her. She is within an ear shot.<br/>\nLast Monday at a homeschool party I mentioned that I miss my kids if I am away from them for more than an hour.<br/>\nOnly one other parent, a homeschool stay-at-home-dad said he did too.<br/>\nThe others said they were happy to be away from the kids doing others stuff.<br/>\n My thoughts, maybe they should not be homeschooling and I am glad they are not unschooling.<br/>\n<br/>\nMaybe it is easy to feel that way because I am an older parent that got to do a lot before kids and I <br/>\nI would not trade any of it for my kids.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Is this unschooling?","postDate":"1339092087","msgId":67531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhFRTFBQ0QzLUFENjEtNDM1OS1BQzlBLUFBNzkxODBFNzQ3Q0Bjb21jYXN0Lm5ldD4="},"prevInTopic":0,"nextInTopic":67534,"prevInTime":67530,"nextInTime":67532,"topicId":67531,"numMessagesInTopic":0,"msgSnippet":"Over at a conference Facebook page, there s a discussion going on about appropriate and legal behavior. It s been a good discussion, for the most part. One of","messageBody":"<div id=\"ygrps-yiv-200470460\">Over at a conference Facebook page, there&#39;s a discussion going on  <br/>\nabout appropriate and legal behavior. It&#39;s been a good discussion, for  <br/>\nthe most part.<br/>\n<br/>\nOne of the issues that came up was leaving underage kids at the pool  <br/>\n(the hotel rule is no kids 12 and under without an adult). Posters  <br/>\nbegan to talk about why they come to conferences and their  <br/>\nresponsibility to and for their kids while there. I mentioned  <br/>\nfacilitating Senna&#39;s experience, that I felt her needs came first, as  <br/>\nthe main reason we&#39;re there is for her to be with friends and share  <br/>\nher interests; what I get to do is a lovely bonus!<br/>\n<br/>\nThen this, from a new conference goer:<br/>\n<br/>\n<br/>\n-=- One of the things I like best about the Unschooling concept is  <br/>\nthat it really applies to all of us. Essentially, if any human is  <br/>\nallowed to pursue his/her passion - they will be happier than if not.<br/>\n<br/>\nSo, digging deeper into unschooling made me look at myself and my  <br/>\nhusband as people with valid needs and desires, as well. After 12  <br/>\nyears of &quot;putting the kids first,&quot; it became &quot;putting all of us  <br/>\nfirst.&quot; And, the kids like that better.<br/>\n<br/>\nIt is so cool when my 13 year old son says, &quot;Mom - you need more time  <br/>\nto write. So, you should write when [name of younger child] is at the  <br/>\nlibrary in the morning, then when I come home - you should leave. Go  <br/>\nto the cafe or the library, so you can focus and write.&quot;<br/>\n<br/>\nAnd, we all encourage Papa to go out walking and taking photos and  <br/>\nenjoy books, movies, etc. This year at [the conference], while I was  <br/>\nalways available to my kids (10 and 13), they mostly didn&#39;t need me -  <br/>\nlike [another mom] said - they see me all the time at home.<br/>\n<br/>\nPredicting this would be the case, I planned a &quot;writing retreat&quot; for  <br/>\nmyself. How often do I get 5 days in a row with no animal chores, in  <br/>\nan all-inclusive environment where my kids are surrounded by friends  <br/>\nand helpful adults? I hope we all take the time to &quot;unschool&quot;  <br/>\nourselves, as well as our kids. -=-<br/>\n<br/>\n<br/>\nThat page is not a place to debate philosophy, so I thought I&#39;d bring  <br/>\nthat post here for some dissection :-)<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":67556,"nextTopicId":67583}}