{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:&quot; Required Curriculum&quot;","postDate":"1026241611","msgId":39131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NTBBOENFLkUyNCVuZWR2YXJlQG50cGx4Lm5ldD4=","inReplyToHeader":"PDEwMjYyMTMwMDUuNDIxLjIwODY5Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":39130,"nextInTime":39132,"topicId":39131,"numMessagesInTopic":0,"msgSnippet":"Group:   (I sent this to NHEN-SpeakOut also) For homeschoolers/unschoolers who are required to present a curriculum or course of study  to be approved by a","messageBody":"<div id=\"ygrps-yiv-1358574309\">Group:   (I sent this to NHEN-SpeakOut also)<br/>\n<br/>\nFor homeschoolers/unschoolers who are required to present a curriculum or<br/>\n&quot;course of study&quot;  to be approved by a school employee:<br/>\n<br/>\nPreface:  In CT, filing a notice of intent to homeschool is optional, and<br/>\neven for those who choose to do so, the recommendation by leaders of our<br/>\nvarious HS groups has been, in spirit, as follows: Offer them as little as<br/>\nyou can. If you opt for a portfolio review, keep it as simple as possible.<br/>\nThe reasoning is that the portfolio review is not a good time to try to show<br/>\nthe state what a wonderful and thorough job you are doing and, more<br/>\nimportant, those who &quot;show off&quot; lots of work might raise the bar for others<br/>\nunnecessarily.<br/>\n<br/>\nMy own advice: <br/>\n1. Find out what the school wants or expects from homeschoolers. It should<br/>\nbe a written policy. Ask to see it. If it seems too demanding or full of<br/>\nbusywork or otherwise unreasonable, find out if ALL the school kids are<br/>\nrequired to do it all. (if not, they why should you?)<br/>\n<br/>\n2. The schools are usually required only to OFFER INSTRUCTION. They are not<br/>\nrequired to be sure that everyone (really anyone) actually learns anything.<br/>\nIf the school requires Passing Grades on tests, ask how many school kids<br/>\npassed and how many failed but were promoted anyway (social promotion). The<br/>\npoint here is that you or your child should not be asked to do any more than<br/>\nthe least of the school&#39;s students is asked to do.<br/>\n<br/>\n3. Armed with the above, you can now figure out what would be the least you<br/>\ncan offer them and still be OK. Offer them that...don&#39;t offer more or you<br/>\nmight be held to it. Even though you will be doing far more than what is<br/>\nrequired, don&#39;t include it as a requirement or an offering to them.<br/>\n<br/>\n4. Figure out ahead of time (at the beginning of the &quot;year&quot; how you will<br/>\nmake your presentation to them at the end. Ask homeschooling friends if they<br/>\nwill show you what they presented in order to find out how little you can<br/>\npresent. <br/>\n<br/>\nAll of this is part of the process of learning that living a normal life (as<br/>\nopposed to an artificial life of school/schooling) is an educational<br/>\nexperience. Example:  For a youth, going (walking) to a hardware store to<br/>\nbuy a part for a bicycle is an experience that&#39;s filled with learning. It<br/>\ncan, and should count in anyone&#39;s assessment of a child&#39;s achievement.<br/>\nAnother: Growing a garden of just one or two vegetables is connected to a<br/>\nwide variety of knowledge and skills.<br/>\n<br/>\nReal life is far more &quot;educational&quot; than school can hope to be.  That&#39;s why<br/>\nJohn Holt said things like, The little value that&#39;s contained in a year of<br/>\nschooling can be accomplished in a single morning. John Gatto also says that<br/>\neverything that&#39;s useful in an entire school career can be learned in about<br/>\nfifty hours.<br/>\n<br/>\nI would go further...everything of value that&#39;s taught in schools IS learned<br/>\nincidentally (without even thinking about it) by normally curious children<br/>\ngrowing up with normal access to the real world -- and it requires no<br/>\nschooling at all -- not a single moment of it.<br/>\n<br/>\nLet the children out to play. That&#39;s what they need most, and today it&#39;s<br/>\nwhat they get the least.<br/>\n<br/>\nNed Vare<br/>\nPS  We all know how absurd it is for people who have opted out of the public<br/>\nschools for many good and varied reasons to be required to be judged (or<br/>\neven &quot;reviewed&quot;) by the same people who run the schools we reject, distrust,<br/>\nand do not respect.  It is a classic case of dumb people somehow gaining<br/>\npower over smart people.<br/>\n<br/>\nIn our ongoing struggle for educational freedom, keep in mind that we are<br/>\nthe people who are educating our children best, and that the public school<br/>\nsystem is the only system that is failing. This is not a battle of<br/>\nhomeschoolers against public school employees. It is against bad laws and<br/>\nirrelevant and stupid regulations, and that battle is being fought in<br/>\nlegislatures, not schools.</div>","specialLinks":[]}],"prevTopicId":39112,"nextTopicId":39133}}