{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Brown","from":"Brown &lt;mjcmbrwn@...&gt;","replyTo":"LIST","senderId":"0buad44q2xfXR8BhLubFbNOLP50PnN8Wgb_KiuYB27vSuw0ugyB_uUEM53fbyLq_iPFvrA4gs9kOh15gKFCZy_ak","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Winona Farm Welcomes Unschooling Visitors","postDate":"958947520","msgId":8596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5Mjg2MEJGLkNFOEE4MzZFQGlodWcuY28ubno+","referencesHeader":"PDMuMC42LjMyLjIwMDAwNTIwMjEzMzQ4LjAwYWE1ODIwQHRyb3V0LmJyYW5keXdpbmUubmV0PiA8My4wLjYuMzIuMjAwMDA1MjEwODI1MjkuMDBhOWZlNDBAdHJvdXQuYnJhbmR5d2luZS5uZXQ+IDwzOTI4M0UwOS42MTA0MjFERUBpaHVnLmNvLm56PiA8MDRjNTAxYmZjMzZkJDUxYWM2ZjUwJDAxMDBhOGMwQGNuc2VydmVyPg=="},"prevInTopic":8594,"nextInTopic":0,"prevInTime":8595,"nextInTime":8597,"topicId":8588,"numMessagesInTopic":0,"msgSnippet":"Hey Karen - ring me on 825 7980 if you d like to come and visit - on a fine day, because it s a bit cramped in our shed on a wet day! We re only 1/2 an hour","messageBody":"<div id=\"ygrps-yiv-488478365\">Hey Karen - ring me on 825 7980 if you&#39;d like to come and visit - on a fine day,<br/>\nbecause it&#39;s a bit cramped in our shed on a wet day! We&#39;re only 1/2 an hour from<br/>\nDinsdale, at Te Mata, on the way to Raglan. Did you used to live in<br/>\nMorrinsville? If so I think you rang me once quite a while ago.<br/>\n<br/>\nCarol<br/>\n<br/>\nKaren Judson wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; We&#39;re in Hamilton now, in the suburbs but with a very large section and<br/>\n&gt; gully, and next to a reserve. Lots and lots of trees. </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Brown","from":"Brown &lt;mjcmbrwn@...&gt;","replyTo":"LIST","senderId":"q7yLd-_9yQN0miOt1MyO0qEIWheYmoQQ9UpBFBI7nOykT-EFcwn5q5owFVesavSyJhAojAasKBF2BP-PqMjEO_3n","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Winona Farm Welcomes Unschooling Visitors","postDate":"958938634","msgId":8594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5MjgzRTA5LjYxMDQyMURFQGlodWcuY28ubno+","referencesHeader":"PDMuMC42LjMyLjIwMDAwNTIwMjEzMzQ4LjAwYWE1ODIwQHRyb3V0LmJyYW5keXdpbmUubmV0PiA8My4wLjYuMzIuMjAwMDA1MjEwODI1MjkuMDBhOWZlNDBAdHJvdXQuYnJhbmR5d2luZS5uZXQ+"},"prevInTopic":8588,"nextInTopic":8596,"prevInTime":8593,"nextInTime":8595,"topicId":8588,"numMessagesInTopic":0,"msgSnippet":"It is so good to hear of other homeschoolers doing these things. We (dh and me, plus 4 sons aged 19, 16, 13 & 10) have just mooved to a 16 acre block of land, ","messageBody":"<div id=\"ygrps-yiv-656401694\">It is so good to hear of other homeschoolers doing these things. We (dh and me,<br/>\nplus 4 sons aged 19, 16, 13 & 10) have just mooved to a 16 acre block of land,<br/>\nwhich is about 12 - 13 acres native bush (forest? woodlands? - these don&#39;t<br/>\nreally describe it properly) with a stream running through the middle of it. We<br/>\nare living in the garage plus room that we built before we moved, and are now<br/>\ntrying to build the house, but the weather has been rain, rain, rain. (It is<br/>\nwinter here in New Zealand) The only animals we have so far are the 2 rabbits<br/>\nand cat we brought with us, and a delightful puppy ds #3 got for his 13th<br/>\nbirthday 2 weeks ago. As vegetarians, we aren&#39;t planning on animals beyond<br/>\npoultry for eggs, and a few goats to keep the gorse down. As Karen says, we<br/>\ndon&#39;t have much in the way of wild animals here in NZ but we are priveleged to<br/>\nhave a pair of keruru or native pigeon, living in our bush. These are very<br/>\nlarge and lovely birds, which are protected now, but are still poached by<br/>\npeople who find them good eating.<br/>\n<br/>\nWe are about to start planting trees and are looking forward to getting our<br/>\ngardens started come spring.<br/>\n<br/>\nCarol<br/>\n<br/>\nAnita Bower wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; We have 15.5 acres in southeastern Pennsylvania:  meadow, pasture, woods,<br/>\n&gt; pond, barn, house.  We currently have it classified as farmland.  Farms on<br/>\n&gt; all sides, including Amish across the road.  We, too, hope to keep it from<br/>\n&gt; being developed, but are putting off doing it until our son gets older and<br/>\n&gt; we have more time.  I am gradually introducing native wildflowers to the<br/>\n&gt; meadow, and eventually hope to do the same in the woods.<br/>\n&gt;<br/>\n&gt; We have 3 Scottish Black Face Sheep, 6 chikens, 2 dogs, 6 cats.  A pair of<br/>\n&gt; Canada Geese nest on the pond every year, and a Great Blue Heron fishes<br/>\n&gt; there regularly.  Something eats the goslings, though, which makes me very<br/>\n&gt; sad.  Could be a fox, which we have, or a snapping turtle, which we may or<br/>\n&gt; may not have.  Also, a possum frequents the barn and decimated our flock of<br/>\n&gt; banty hens.  We  now have them in a hen house, but, I think the banties<br/>\n&gt; aren ot happy being cooped up, even though they have a run.  Do you know<br/>\n&gt; anything about banties?<br/>\n&gt;<br/>\n&gt; Anita......who loves living in the country! </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Sue","from":"&quot;Sue&quot; &lt;sue.m.e@...&gt;","replyTo":"LIST","senderId":"5Kxa2NIJwuaLe_blidz4N0xZsVlPTxQibzFoAxcMNlJW_RYPVk9X-sh-fBzOxBQuzj7TcffXo8iyCDSO5Pgpf8DwwQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Winona Farm Welcomes Unschooling Visitors","postDate":"958829874","msgId":8588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":8594,"prevInTime":8587,"nextInTime":8589,"topicId":8588,"numMessagesInTopic":0,"msgSnippet":"I m Sue and I live in Winona MN, here on the farm we are trying to get a place for unschoolers to be able to visit and enjoy each others company while getting","messageBody":"<div id=\"ygrps-yiv-874338262\">I&#39;m Sue and I live in Winona MN, here on the farm we are trying to <br/>\nget a place for unschoolers to be able to visit and enjoy each <br/>\nothers company while getting a farm experience.  We have only <br/>\nhad 15 family groups and 3 single visitors and it would really good <br/>\nto have more unschoolers visit.   We only charge a very moderate <br/>\nfee for people to stay.   <br/>\n<br/>\nIt can be very difficult to meet other unschoolers and for some <br/>\ntrying to figure out if unschooling works it may be good to meet a <br/>\nfamily living unschooling.    It is also a great place for city kids to <br/>\nget a chance to roam freely and get in touch with nature.<br/>\n<br/>\nMy partner Dick Gallien bought the farm in 1956, he was a <br/>\nteacher in many experimental programes in the 60s and concluded <br/>\nthat the system just can&#39;t work.  My children Nathan[15], <br/>\nRhianon[11], Madeleine[6] and Stephanie[4]  and I came here from <br/>\nAustralia two years ago and now call Winona &quot;Home&quot;.    Here they <br/>\nare free to explore from the top of the hills right down to the trout <br/>\nstreams and beaver pond and all the interesting places in between. <br/>\nThey spend endless hours doing the things that generations of <br/>\nchildren enjoyed, until school imprisoned their minds and bodies for <br/>\ntwelve years or more.  They look, listen and touch, then think about <br/>\ntheir experiences and ask many questions about the things <br/>\nunfamiliar to them.  They learn without being taught, without <br/>\ncoercion, threats or bribes and they enjoy it.  <br/>\n<br/>\nThe farm is open to visitors all year round.   There is a self <br/>\ncontained apartment in the house,  for that we charge $2.50 a night <br/>\nfor adults & $1 a night for children.  We have lots of space for <br/>\ncamping, at a charge of $1 a night for adults & 50c for children. We <br/>\nhave two cabins, for home/unschoolers on Sunday through <br/>\nThursday nights [except public holidays] we charge $10 a night for <br/>\nadults & $5 a night for children [these cabins rent out to tourists for <br/>\nbetween $75 to $300 per night which is why we need to keep them <br/>\nopen on weekends].    The small amount of money we  make from <br/>\ncharging unschoolers goes into improving the accommodations and <br/>\nproviding amenities for campers.  <br/>\nMost visitors like to assist with tasks and their help is very <br/>\nwelcome.<br/>\n<br/>\nThe farm is 175 acres of diverse land, from the trout streams at the <br/>\nlowest point in the valley to 600&#39; hills.   Only 55 acres is tillable <br/>\nland, the rest is returning to a natural state and is a haven for a <br/>\nvariety of wildlife.<br/>\n<br/>\nWe have an assortment of animals, four beef cows, and their <br/>\ncalves, two of which are heifers that should be having their first <br/>\ncalves soon, 12 holstein steers ranging in age from 6 weeks to two <br/>\nyears... these are bottle reared by Nathan [15], 2 of the biggest <br/>\nsows in the world and 1 not so big boar [we hope for piglets <br/>\neventually if Ms Pig and Miss Piggy aren&#39;t too overweight to carry <br/>\nbabies], 24 sheep and 26 lambs, 9 saanen goats and their 7 kids, <br/>\n3 angora goats, & one little alpine buck who we bought to improve <br/>\nthe milking potential of the future generations, 3 jersey wooly <br/>\nrabbits, 1 just plain rabbit, 1 cat and her 3 kittens.   My girls milk <br/>\nonly one of the goats, but plan on milking more next year, they use <br/>\nthe milk to bottle feed three kids.  We also have 5 Canada geese <br/>\nwith 4 goslings so far but more due to hatch any day, 6 domestic <br/>\ngeese, 3 turkeys and 4 turkey poults, 6 ducks and 15 ducklings, <br/>\nand too many chickens and chicks to count. <br/>\n<br/>\nWe are also the local compost site and visiting locals feed their <br/>\ngrass clippings right to the cattle, and their brush to the sheep and <br/>\ngoats.   We also collect food waste from the local hospital and <br/>\nuniversity and a better class of food waste from a supermarket in <br/>\ntown.   The food waste from the hospital and university is at <br/>\npresent composted with ground up brush, grass clippings and <br/>\ncattle manure, however we are working on a way of cooking it at <br/>\n212 for 30 minutes so that it can be legally fed to animals.  The <br/>\noutdated produce, baked, frozen & dairy goods from the <br/>\nsupermarket are fed to the animals, we rear the calves on out <br/>\ndated milk and only buy chicken feed to get the chicks started.<br/>\n<br/>\nWe have three incubators that hold 288 eggs and a hatcher, so <br/>\nevery six days we fill an incubator, and every six days we start a <br/>\nnew hatch.  We have incubated ducks, geese, turkeys and <br/>\nthousands of chicks.   We sell eggs here on the farm and at the <br/>\nlocal co-op and sell chickens to the Hmongs.<br/>\n<br/>\nOur third compost pile is percolating now, it is about 60&#39;X20&#39;X10&#39; <br/>\nnot as big as the last two which are now mainly spread on the <br/>\nfields, with a little in the yard awaiting my vegetable garden.<br/>\n<br/>\n<br/>\nFor more information contact me by email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sue.m.e@...\">sue.m.e@...</a>   <br/>\nphone 507 454 3126<br/>\nor snail mail<br/>\nSue Gill  Rt 2 Box 279, Winona MN 55987 <br/>\nFarm website:    <a rel=\"nofollow\" target=\"_blank\" href=\"http://members.xoom.com/winfarm/\">http://members.xoom.com/winfarm/</a><br/>\nFarm newsletter: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/subscribe/Winonafarm\">http://www.egroups.com/subscribe/Winonafarm</a><br/>\n<br/>\n&quot;Whenever you find yourself on the side of the majority, <br/>\nit is time to pause and reflect.....&quot;    Mark Twain</div>","specialLinks":[]}],"prevTopicId":8590,"nextTopicId":8597}}