{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"purpose of learning","postDate":"1121626044","msgId":22745,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhYi4zYmE3MDlmNi4zMDBjMDFiY0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":22744,"nextInTime":22746,"topicId":22745,"numMessagesInTopic":0,"msgSnippet":"I just found this dated   July 1998 on what I m salvaging from two computers before this.   I remember writing it, but I don t think it was published.   I ","messageBody":"<div id=\"ygrps-yiv-1802795977\">I just found this dated   July 1998 on what I&#39;m salvaging from two computers <br/>\nbefore this.   I remember writing it, but I don&#39;t think it was published.   I <br/>\nthink it was on a discussion list or maybe at unschooling.com back in the day. <br/>\n   Someone, maybe Joyce Fetteroll, came up with the name of the story I half <br/>\nremembered right away, and I went and read it again.    <br/>\n<br/>\nI thought it had some good parts, but if it wasn&#39;t published, it shouldn&#39;t go <br/>\ninto the collection of published essays I&#39;m compiling.    Anyone remember it? <br/>\n  <br/>\n<br/>\nThanks,   Sandra<br/>\n<br/>\n=====================================<br/>\nINNIES AND OUTIES<br/>\n<br/>\n<br/>\n&lt;&lt;To push kids in all kinds of directions in order for them to be fluent at <br/>\ncocktail parties is a waste of time, imho. &gt;&gt;<br/>\n<br/>\nDepends whether the goal is for them to be fascinating and interesting to the <br/>\nbrightest people there, or just not to embarrass themselves in front of the <br/>\nother safe, quiet, dull folks.    Some people really, truly WANT to only <br/>\ndiscuss the weather, current local (yet safe) politics, current events (just the <br/>\ninnocuous stuff) and the decor in the house.   That way they can make some soft <br/>\nnoise for a couple of hours and not really SAY anything.   That&#39;s<br/>\ncocktail party stuff for you.   There seem to be whole friendships, <br/>\norganizations, marriages, based on this very surface, calm, don&#39;t-rock-the-boat <br/>\nbehavior.    <br/>\n<br/>\nPublic school discourages kids from coming up with off-the-wall responses.   <br/>\nNo bank shots, please.   Just go directly from the question to the first <br/>\nsufficient answer; nothing tricky or dramatic.   Nothing that makes you think, or <br/>\nmakes the teacher think.   If your answer isn&#39;t what&#39;s in the teacher&#39;s manual <br/>\nyour answer is wrong.   If you did extra thinking you wasted your time.<br/>\n<br/>\nIf you want your kids to be REALLY interesting at cocktail parties, leave <br/>\ntheir passions alone.    I would pay money to be at parties with REALLY <br/>\ninteresting people because I don&#39;t give a rat&#39;s patoot what the scores of yesterday&#39;s <br/>\nsports games were, or whether a new government contract is coming to town, or <br/>\nhow the weather was in southern California if I wasn&#39;t even there.    But if <br/>\nthose people want to talk about their own new job or a sport they were involved <br/>\nin or their response to seeing a tornado or a hurricane for the first time, <br/>\nTHAT I would like to hear.    If they saw the The Lion King stage show and have <br/>\nread everything there is to find about the designer, THAT I want to hear.   If <br/>\nthey got to touch the brigandine plate armor that was found near Four Corners <br/>\nYES!! TELL ME!!!   That stuff didn&#39;t come from school, or Newsweek, or the <br/>\nlocal paper.<br/>\n<br/>\nLife.   People can live lives, even little kids live lives, without <br/>\npreparation, learning on the job, as they go.   They can learn while doing real things <br/>\nwith real happiness and real success.    <br/>\n<br/>\nWhat&#39;s the Kurt Vonnegut story about the handicaps?   Where people are <br/>\n&quot;created equal&quot; by government handicaps?   Smart people hear a frightening/alarming <br/>\nsound every minute or two from the headphones they&#39;re allowed to wear.   <br/>\nStrong people have to wear weights.   Good looking people have to wear masks.    <br/>\nSchool tries to do that.   Even in the gifted programs, kids are often stuck in <br/>\na chair and asked to complete checklists of tasks, not to go off on their own <br/>\nat maximum speed and change directions when they feel the urge to.   <br/>\nHomeschoolers can do that, unless they&#39;re careful not to.   We&#39;re taught to sublimate <br/>\nurges, to prove we&#39;re mature by ignoring our urges and doing what we&#39;re told.   <br/>\n <br/>\n<br/>\nCreativity doesn&#39;t come from reading the chapter and answering the questions.<br/>\n<br/>\n     <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22719,"nextTopicId":22746}}