{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":194511224,"authorName":"Shana Ronayne Hickman","from":"&quot;Shana Ronayne Hickman&quot; &lt;folkypoet@...&gt;","profile":"livefreelearnfree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"An article for the doubters","postDate":"1110600279","msgId":104407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwdHBvbittMTNhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":104406,"nextInTime":104408,"topicId":104407,"numMessagesInTopic":0,"msgSnippet":"Found an article on MSN and traced it back to Scholastic s website. This is something you might be able to give to doubters.  It s obviously *not* unschooling,","messageBody":"<div id=\"ygrps-yiv-792682847\">Found an article on MSN and traced it back to Scholastic&#39;s website. <br/>\nThis is something you might be able to give to doubters.  It&#39;s<br/>\nobviously *not* unschooling, but it does have a few unschoolish bits<br/>\nabout reading (and unlike the title states, the basic premise applies<br/>\nto both genders, of course).  <br/>\n<br/>\nI&#39;m sending it along because I know there are some people (relatives,<br/>\nhusbands, friends, etc.) who might distrust pro-unschooling<br/>\nliterature.  This is from a schoolish site, a well-known company, and<br/>\nstill states that the best way to get kids to love reading is to let<br/>\nthem read what they want - what interests them - whether it&#39;s comics<br/>\nor gaming manuals, etc.  The author also points out that the parent<br/>\nshould not judge what the child chooses to read.  Who cares if it&#39;s<br/>\nhigh literature?  <br/>\n<br/>\nIt might be a starting place for someone.<br/>\n<br/>\n-Shana<br/>\nwww.livefreelearnfree.com<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scholastic.com/familymatters/read/reluctant/boys.htm\">http://www.scholastic.com/familymatters/read/reluctant/boys.htm</a><br/>\n<br/>\nIf Your Boy Won&#39;t Read<br/>\nChill out and get down with what he loves, starting with the comics.<br/>\nby Betty Holcomb<br/>\n<br/>\n<br/>\nIf you&#39;re the parent of one, like I am, it&#39;s no surprise to you that<br/>\ntween and teen boys read less, and tend to score lower on standardized<br/>\nreading tests than girls. You know that your son has things he finds<br/>\nfar more interesting than actually reading a book. There&#39;s the<br/>\ncountdown to &quot;Halo Tuesday,&quot; the red-letter day the latest version of<br/>\nthe popular video game &quot;Halo&quot; hits store shelves. When playing Halo<br/>\ngets old, there&#39;s instant messaging while he simultaneously flips<br/>\nbetween the Cartoon Network, the Sci-Fi channel, and Comedy Central.<br/>\nThat&#39;s life in the video age. When you shut that down, he turns to<br/>\nanything that involves action, from a neighborhood game of Capture the<br/>\nFlag to soccer, football, biking, or skateboarding.<br/>\n<br/>\nNot that you haven&#39;t fought a valiant battle on behalf of books.<br/>\nYou&#39;ve tried trips to the library and bookstore, and made sure that<br/>\nevery title on the school&#39;s summer reading list is in the house.<br/>\nYou&#39;ve limited video games and television, which turned into an<br/>\nendurance test for both of you, as your son whined, complained,<br/>\nwheeled, cajoled, and pleaded to win those privileges back. When<br/>\nforced, he skimmed through those classic books, making sure you<br/>\nunderstood what a bore they were. By now, you&#39;re even bored with your<br/>\nown lecture on the critical importance of reading as an essential<br/>\nlife-long skill, a source of pleasure and power, the key to academic<br/>\nsuccess.<br/>\n<br/>\nIn other words, he&#39;s still not engaged in reading. He never asks for a<br/>\nbook, and often complains bitterly about the ones assigned at school.<br/>\nIn fact, he tells you he&#39;d rather die than read classics like Little<br/>\nHouse on the Prairie or The Diary of Anne Frank.<br/>\n<br/>\nMake Reading Useful, Fun, and Funny<br/>\nDon&#39;t despair. A new generation of experts on boys and reading finally<br/>\nhas some cures. &quot;Any boy can and will get excited about reading, if<br/>\nyou make it useful, fun, and funny,&quot; says John Scieszka, author of The<br/>\nStinky Cheese Man and Other Fairly Stupid Tales and founder of the<br/>\npopular web site GuysRead.com. &quot;We have to give them more choices, and<br/>\nespecially more nonfiction. Boys like to read for a purpose, to find<br/>\nout how to do things, like how to build a dirt bike or skateboard.<br/>\nThat&#39;s just not encouraged enough.&quot;<br/>\n<br/>\nExactly right, says Jeff Wilhelm, associate professor of English<br/>\neducation at Boise State University and one of the nation&#39;s leading<br/>\nauthorities on boys and literacy. &quot;Boys like to read what&#39;s toolish,<br/>\nnot schoolish.&quot; By &quot;toolish,&quot; Wilhelm says, he means that boys eagerly<br/>\ndevour anything that connects to their daily life, interests, and<br/>\nimagination. &quot;Boys prefer reading things that have something they can<br/>\nimmediately use, talk about, argue about, or do something with,&quot; he<br/>\nsays. &quot;They are very, very impatient with the reading they do in<br/>\nschool, because it&#39;s not useful or interesting to them. Even worse,<br/>\nthey then have to take a test on it.&quot;<br/>\n<br/>\nWilhelm comes to these conclusions based on a major study of boys in<br/>\ngrades 6 to 12, who, he says, were not just disinterested in reading,<br/>\nbut downright cynical, based on their experience in school. &quot;These<br/>\nwere great kids, very smart. Some went on to places like Harvard and<br/>\nMIT. But they were all cynical about reading, as it was promoted at<br/>\nschool and by many adults in their lives,&quot; he says.<br/>\n<br/>\nOne of the big problems, Wilhelm says, is that much of the real<br/>\nreading the boys did wasn&#39;t recognized or supported by their schools<br/>\nor families. &quot;Teachers and parents often conceived of reading<br/>\nnarrowly, as &#39;literature&#39; only, and failed to see that there&#39;s all<br/>\nkinds of reading that boys do, like magazines and even formulaic<br/>\nnovels,&quot; he says. &quot;I tell parents and teachers to take a chill, expand<br/>\ntheir idea of what reading is. Even expert adult readers go through<br/>\nphases of reading pulp fiction or romance novels. It&#39;s something boys<br/>\noutgrow, but it helps develop skills.&quot;<br/>\n<br/>\nEven graphic novels, comic books, and video game guides? &quot;Reading is<br/>\nreading and the more practice kids get reading on their own, and the<br/>\nmore they hear books read aloud, the more skills they pick up,&quot; says<br/>\nLisa Von Drasek, head children&#39;s librarian at Bank Street College of<br/>\nEducation in New York City. &quot;They are hearing and seeing words,<br/>\nbuilding a vocabulary that they will recognize as they read, and that<br/>\nmakes reading easier. They know how words sound, what they mean and<br/>\nwhat they look like in print. It&#39;s all part of expanding literacy.&quot;<br/>\n<br/>\nStart with What He Loves<br/>\nSo if you have a kid who hates books, where do you begin? All three<br/>\nexperts agree that it&#39;s crucial to begin at the beginning, with what<br/>\nyour son loves. &quot;Kids will read when you focus on what they love. If a<br/>\nkid is a sports kid, I&#39;m going to do my darnedest to find a book about<br/>\na sport that kid loves,&quot; says Von Drasek. &quot;If he loves bikes, I&#39;m<br/>\ngoing to look for books about bikes, bicycling, anything that feeds<br/>\nthat interest.&quot;<br/>\n<br/>\nTry books that are about how a kid would love to be. &quot;Boys will read<br/>\nthemselves into a book about a character who allows them to be who<br/>\nthey&#39;d like to be. Even books that seem like wild fantasies are about<br/>\nreal stuff to the boys who are struggling with similar issues,&quot; says<br/>\nWilhelm. The wild success of the Harry Potter series is a case in<br/>\npoint. &quot;Even though the books are fantasy, many boys identified with<br/>\nHarry because he was struggling with the day-to-day problems of every<br/>\nyoung boy, how to make his way in the world,&quot; says Wilhelm.<br/>\n<br/>\nHumor is another winner with boys. &quot;Humor is underrated on school<br/>\nreading lists, but boys love it,&quot; says Sciezska, whose own hit, The<br/>\nStinky Cheese Man, is a playful book that pokes fun at classic<br/>\nfairytales. &quot;Calvin and Hobbes, Lemony Snicket, those books get them<br/>\nexcited about reading, because it&#39;s fun. It&#39;s important for parents<br/>\nand teachers to accept these things as reading, instead of acting like<br/>\nit&#39;s not &#39;real&#39; reading, like there&#39;s something wrong with them. Those<br/>\nbooks will get boys hooked on reading.&quot;<br/>\n<br/>\nOther ideas from the experts:<br/>\n<br/>\n    * Model reading. Studies show that when parents read and have<br/>\nbooks around, both boys and girls are more likely to be readers.<br/>\n<br/>\n    * Give your boy a book. &quot;It sounds like a small thing, but it can<br/>\nmake a big impression. Choose one that&#39;s related to a hobby, an<br/>\ninterest, or is just fun,&quot; says Wilhelm.<br/>\n<br/>\n    * Make reading social. &quot;Invite them to talk about something out of<br/>\nthe newspaper,&quot; says Wilhelm. &quot;For boys, the purpose of reading is<br/>\noften social, something they can use with their friends, something to<br/>\nconnect about, talk about.&quot;<br/>\n<br/>\n    * Don&#39;t give up. &quot;Sooner or later, using comics, magazines,<br/>\nanything that connects to an interest or a passion, you can hook any<br/>\nchild on reading. It&#39;s all a matter of patience,&quot; says Von Drasek.<br/>\n<br/>\n<br/>\nIndeed. Just last week, for example, I witnessed a band of boys at a<br/>\nlocal middle school talking about a book they&#39;d just read. The<br/>\nconversation was lively, heated, and engaged. The book? The latest<br/>\nedition of the Halo series, the fantasy novels that describe the world<br/>\nbehind the video game. And from Halo, it turns out, it&#39;s not such a<br/>\ngiant leap to mythology, science fiction, and a long and pleasurable<br/>\nreading list for many of these boys. &quot;The main thing to remember is<br/>\nnot to judge the reading,&quot; says Wilhelm. &quot;If boys are engaged and find<br/>\nit pleasurable, it will lead to more reading.&quot;</div>","specialLinks":[]}],"prevTopicId":5415,"nextTopicId":104406}}