{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":128904774,"authorName":"Debra &lt;debsusedbooks@aol.com&gt;","from":"&quot;Debra &lt;debsusedbooks@...&gt;&quot; &lt;debsusedbooks@...&gt;","profile":"homebusinessmoms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New Intro & ISO kids magazines","postDate":"1044094587","msgId":57499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxZzZwcitkOGJhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":57498,"nextInTime":57500,"topicId":57499,"numMessagesInTopic":0,"msgSnippet":"Hello everyone.  I am brand new here, joined tonight and just want to introduce myself.  I am planning on lurking a bit before I jump into any of the very","messageBody":"<div id=\"ygrps-yiv-1523646023\">Hello everyone.  I am brand new here, joined tonight and just want to <br/>\nintroduce myself.  I am planning on lurking a bit before I jump into <br/>\nany of the very interesting conversations I see going on or before <br/>\nasking too many questions.  <br/>\n<br/>\nBut to briefly tell you why I sought out this group I will just say <br/>\nwe have tried for so many years to bring school to our home with <br/>\nAbeka and Alpha Omega curriculum and honestly have had minimal <br/>\nsuccess.  I am just so unstructured in my own life and that makes it <br/>\nhard for me to &quot;hit the books&quot; everyday &quot;as scheduled&quot;.  So after <br/>\nsome struggles and thoughtful consideration, we are trying a <br/>\ndifferent approach.  <br/>\n<br/>\nI have no family support in this one-they are constantly on me <br/>\nto &quot;have school&quot; so my kids don&#39;t end up &quot;dumb&quot;.  Well, I guess I <br/>\nshouldn&#39;t even start that rant.  I could go on for hours about this <br/>\nwhole thing.  But to make it short, I think we may be able to find <br/>\nsome value in just making some materials available that will prompt <br/>\nour interacts in what will lead to learning.  <br/>\n<br/>\nWe are reading together The Little House in the Big Woods and we are <br/>\nall really enjoying that time together without the pressure.  My <br/>\noldest daughter asked me after we read about curing the meat with <br/>\nsalt, where salt came from and I had to tell her I wasn&#39;t sure <br/>\nexactly but that we could go on the internet and find out together.  <br/>\nAnd from that we decided we would like to make a giant crystal <br/>\nformation.  So that is on the agenda...  <br/>\n<br/>\nI am excited to have more interaction like this and less me screaming <br/>\nabout their school work not getting done and holding them prisoners <br/>\nuntil it is.  I am sure you can all relate.  <br/>\n<br/>\nAnyway, that leads me to my request for any used kids magazines you <br/>\nall might want to part with.  I actually saw it in someone&#39;s post, <br/>\nrecommending using these as a spring board so I am looking for some <br/>\nused ones since we are a single parent, work at home household and <br/>\nthe subscription rates to these things are just out of our budget.<br/>\n  <br/>\nI am looking for any used issues of titles like Cricket, Highlights, <br/>\nRanger Rick, My Big Backyard, Puzzlemania, Zillions, American Girl, <br/>\nKids Discover, Muse, National Geographic World, and more.  Please <br/>\njust make sure they are in good condition with all the pages intact, <br/>\nnothing you would put into the trash can.  <br/>\n<br/>\nI can send paypal. Please spam me directly at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debsusedbooks@...\">debsusedbooks@...</a>.  <br/>\nAnd thanks for allowing me to be a part of your group.<br/>\n<br/>\nDebra<br/>\nMom to <br/>\nLyndee (11)<br/>\nKelsey (8)<br/>\nDylan (9 mos)</div>","specialLinks":[]}],"prevTopicId":57495,"nextTopicId":57389}}