{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":79,"messages":[{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Foster care","postDate":"1138892274","msgId":111710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRydDZsaStqMm5rQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRyczFwNSt2bzF2QGVHcm91cHMuY29tPg=="},"prevInTopic":111709,"nextInTopic":111711,"prevInTime":111709,"nextInTime":111711,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... No, it isn t even horrible most of the time. :-) My youngest is living proof that removing a child early from an abusive birth home and NOT giving their","messageBody":"<div id=\"ygrps-yiv-1188906054\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Nisha&quot; <br/>\n&lt;nishamartin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Adoption isn&#39;t always horrible, &gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>No, it isn&#39;t even horrible most of the time. :-) <br/>\n<br/>\nMy youngest is living proof that removing a child early from an <br/>\nabusive birth home and NOT giving their abuser another chance to <br/>\nabuse them is in the best interest of the child. To many times the <br/>\nsystem puts the abuser first and the child second. Although she grew <br/>\nup in foster care, she was in a loving home, with loving people and <br/>\nshe grew up attached and secure. <br/>\nToday she is a seven year old that is a joy to be around and is the <br/>\nlight of my life. :-)<br/>\n<br/>\nMy middle child is living proof that trauma and hurt can be reversed <br/>\nand that a child can heal, once they decide they want it. She <br/>\nlearned to trust again and because of that, she learned to love and <br/>\nbe loved again.   <br/>\nToday my daughter is a loving ten year old that amazes me every day <br/>\nwith their strength of character. <br/>\n<br/>\nMy oldest is living proof that abusers must NOT be allowed to have <br/>\naccess to their victims and that children should have the same <br/>\nrights as adults when they&#39;ve been abused. Time and time again, he <br/>\nwas sent back to his hell, only to be abused again. His abuser was <br/>\ngiven many chances, he wasn&#39;t even given one. The very people that <br/>\nwere supposed to protect him, were the ones who caused the most <br/>\nsuffering. The system needs to put the children FIRST. <br/>\nToday my son is a 13 year old boy who hates himself. He feels <br/>\nworthless and unlovable, not because he is, but because that&#39;s what <br/>\nhe&#39;s been shown. He&#39;s come a long way since we adopted him and he&#39;s <br/>\ngot a long, tough road of healing ahead of him. <br/>\n<br/>\nMy brother, who we adopted in the 60&#39;s is living proof that back <br/>\nthen, they thought love healed all and they were wrong. My parents <br/>\nwere not prepared to help him, as I am with my children. They <br/>\ntreated him just as they treated me and it pushed him away. He <br/>\nneeded a different kind of parenting but there were no books or <br/>\nclasses available, like there is now. <br/>\n<br/>\nYes, there ARE horror stories but those cases are becoming less and <br/>\nless as we learn more and more about hurt and traumatized (sp?) <br/>\nchildren and what their needs are. Getting these kids out of abusers <br/>\nhands and into a loving foster home as quickly and as early as <br/>\npossible WORKS. Severing the parental rights of the abusers quickly <br/>\nand getting these kids adopted within a reasonable amount of time <br/>\nWORKS. Having parents who are prepared and educated on disorders <br/>\nlike RAD, works. <br/>\n<br/>\nWhen we stop putting the needs of abusers before the needs of their <br/>\nyoung victims, cases like my brother will become less and less and <br/>\ncases like my youngest daughter will become more and more.  <br/>\n<br/>\n~ Joanne ~<br/>\nMom to Jacqueline (7), Shawna (10) & Cimion (13)<br/>\nAdopted into our hearts October 30, 2003<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/\">http://anunschoolinglife.blogspot.com/</a></div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen and David Gehrke","from":"Kathleen and David Gehrke &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Adoption was fostercare","postDate":"1138891511","msgId":111709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMjAyMTQ0NTExLjExMjQ5LnFtYWlsQHdlYjM2OTEzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEUwRkIyQUJDLUI1OEItNENDNi1BRTBBLTkwNTYyQzM1QzA5MUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":111708,"nextInTopic":111710,"prevInTime":111708,"nextInTime":111710,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... I am amazed at how long this thread has gone on. I am also amazed at lots of the negativity. I have seven adopted and two birth sons. NEVER did I say WOW I","messageBody":"<div id=\"ygrps-yiv-744846225\">--- Pamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Things didn&#39;t turn out well and it was absolutely<br/>\n&gt; definitely not of  <br/>\n&gt; benefit to the boys for my sister to adopt another<br/>\n&gt; child. And she WAS  <br/>\n&gt; younger, by the way. They had a good friend with a<br/>\n&gt; really cool  <br/>\n&gt; younger sister who they liked a lot. They thought it<br/>\n&gt; would be like  <br/>\n&gt; that. It wasn&#39;t.<br/>\n&gt; <br/>\n </span></blockquote>I am amazed at how long this thread has gone on. I am<br/>\nalso amazed at lots of the negativity. I have seven<br/>\nadopted and two birth sons. NEVER did I say WOW I<br/>\nthink we will create this really large family. It<br/>\nhappened one kid at a time and a choice at a time. I<br/>\nwould have one son that hated change and would baulk<br/>\neach time and one that was all for it. Today they are<br/>\nboth grown men and they couldn&#39;t pick one sib that our<br/>\nfamily could do without. They both live in another<br/>\nstate. Are some of my best friends and despite being<br/>\nmarried and fathers and having their own lives call to<br/>\ntalk to their younger sibs. My eldest daughter  was<br/>\nrecently interviewed on tv. When she was asked about<br/>\nliving in such a large family her description was fun,<br/>\nbut loud. She is sixteen. Because we have so many<br/>\ngenetic packages we have kids of high intelligence and<br/>\nkids who in ps would spend lots of the day in special<br/>\ned. That is why unschooling is the perfect thing for<br/>\nus. It works so beautifully with each unique<br/>\nindividual in our family. When we stepped into the<br/>\nworld we live in we quit just being our genetic make<br/>\nup. We became this whole new package each time a child<br/>\njoined our family. My kids are best friends mostly. I<br/>\nhave several that have personality bump up against the<br/>\nother and I use many of the ideas that Sandra has<br/>\nshared for heading off conflict, especially with some<br/>\nof my stronger personalities. <br/>\nI need to clarify. Adoption is completely different<br/>\nfrom foster care. I did that. It was great work.<br/>\nAdoption is creating a forever family. A new family<br/>\nfrom the family you are changing by adopting. A family<br/>\nthat may be better or worse , but for certain will<br/>\nmake the family you had become a memory. Exactly like<br/>\nwhen you and your hubby had you first child and your<br/>\nlives changed forever.<br/>\nI also need to say adoption is in no way inferior to<br/>\nbirth. If any of my seven children had come from my<br/>\nbody I could not love them more. They are a much a<br/>\npart of me as my bio children. In their imperfection,<br/>\njust like mine, and their beauty they are not less. <br/>\nI once had foster daughters for  year. I was lucky<br/>\nenough to help them go home to their family. There was<br/>\none point that it appeared perhaps their mom would not<br/>\nbe able to get them home. I told my worker we would<br/>\nnot be able to adopt the  girls if they were<br/>\navailable. They were lovely girls. They would just<br/>\nnever be mine. Never get the status that every child<br/>\ndeserves being part of a forever family.<br/>\nOur unschooling lives have allowed me to free my<br/>\nchildren. To honor them for their uniqueness. My just<br/>\nturned ten year old daughter learned how to write her<br/>\nname is cursive yesterday. She wants to open a saving<br/>\naccount and someone told her she needed to sign her<br/>\nname. In about five minutes she wrote her name<br/>\nperfectly. Today we are opening an account.<br/>\nEnough of my rant.<br/>\nKathleen<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":10309988,"authorName":"Nisha","from":"&quot;Nisha&quot; &lt;nishamartin@...&gt;","profile":"nishamartin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Foster care","postDate":"1138854501","msgId":111708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRyczFwNSt2bzF2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMxNTQwMEJGLUMzQjgtNEQzQy1BRkMzLUIwNkZCMzQ1MDYzMEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":111706,"nextInTopic":111709,"prevInTime":111707,"nextInTime":111709,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... matter ... I ... Maybe a better way for me to have said that would ve been , There are always things you don t expect, no matter how you add a child to","messageBody":"<div id=\"ygrps-yiv-1255095136\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; &gt; &quot;You don&#39;t really have an idea of what you are going to get no <br/>\n </span></blockquote>matter<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; HOW you add a child to your family.&quot;<br/>\n<br/>\n<br/>\n <br/>\n&gt; When I had my children, I couldn&#39;t guarantee that they would be  <br/>\n&gt; healthy, but I knew who the father was and I chose him.  I knew who <br/>\n </span></blockquote>I  <br/>\n<blockquote><span title=\"ireply\"> &gt; was.<br/>\n<br/>\n </span></blockquote>Maybe a better way for me to have said that would&#39;ve been , There are <br/>\nalways things you don&#39;t expect, no matter how you add a child to your <br/>\nfamily. <br/>\n Adoption isn&#39;t always horrible, it&#39;s not always great, but the really <br/>\nbad ones are the ones that make the news or people tend to want to <br/>\nwant to pass along. Kind of like the stories that hit the news about <br/>\nabusers who call themselves homeschoolers, or the HORRIBLE birth <br/>\nstories people tend to tell pregnant women. Not that you don&#39;t need to <br/>\nbe prepared for any of it,not that there aren&#39;t bad things that <br/>\nhappen, but since there is so much that is unknown, you don&#39;t have to <br/>\nexpect the absolute worst either.<br/>\nNisha</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Foster care","postDate":"1138853349","msgId":111706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxNTQwMEJGLUMzQjgtNEQzQy1BRkMzLUIwNkZCMzQ1MDYzMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRycm8zbCtzbWliQGVHcm91cHMuY29tPg==","referencesHeader":"PGRycm8zbCtzbWliQGVHcm91cHMuY29tPg=="},"prevInTopic":111705,"nextInTopic":111708,"prevInTime":111705,"nextInTime":111707,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... That s not quite true.  It reminds me of the argument a month or two back that anyone s kids could run away, unschooling was no proof against running away.","messageBody":"<div id=\"ygrps-yiv-1112820782\"><blockquote><span title=\"ireply\">&gt; &quot;You don&#39;t really have an idea of what you are going to get no matter<br/>\n&gt; HOW you add a child to your family.&quot;<br/>\n<br/>\n </span></blockquote>That&#39;s not quite true.  It reminds me of the argument a month or two  <br/>\nback that anyone&#39;s kids could run away, unschooling was no proof  <br/>\nagainst running away.  It wasn&#39;t worded that elegantly, I don&#39;t  <br/>\nthink, but more like runaways could be anyone.  As though it were a  <br/>\nrandom occurrence with no cause.<br/>\n<br/>\nWhen I had my children, I couldn&#39;t guarantee that they would be  <br/>\nhealthy, but I knew who the father was and I chose him.  I knew who I  <br/>\nwas.<br/>\n<br/>\nThere are genetic tendencies still unidentified or unadmitted, and  <br/>\none seems to me to be a steadfastness and presence.  I think any  <br/>\nchild whose father just irresponsibly split and whose mother couldn&#39;t  <br/>\nget it together to want to take care of her child is going to be less  <br/>\nlikely (for reasons of both nature AND nurture, for starters) to  <br/>\ncalmly work at staying focussed and attentive within a family, to  <br/>\nWANT to stay there, and to become a really good mom herself.   I know  <br/>\nfor sure there are orphans whose parents would have been great; there  <br/>\nare babies whose mothers wanted to keep them but whose parents  <br/>\ncruelly chose for her, to give the baby away.  I&#39;m not talking about  <br/>\nthose babies, though the parents who adopt them don&#39;t then often know  <br/>\nhow the parents&#39; were.   I&#39;m talking worst case scenario, like my  <br/>\nhalf brother getting someone pregnant and bailing. (The only  <br/>\npregnancy of which I&#39;m aware did not come to term.)  He doesn&#39;t stay  <br/>\nand take responsibility; neither did HIS father.  Our mom wasn&#39;t all  <br/>\nthat great at that either, in the longrun.<br/>\n<br/>\nI was thinking about the bad adoption stories I know, and thought of  <br/>\ntwo cases in which the adopted child was the star of the family.  I  <br/>\nwas visiting one of Kirby&#39;s friend&#39;s families a few months back.  I  <br/>\nknow the boy, who&#39;s the middle of three boys and was adopted from  <br/>\ninside the family in some way (from a cousin or sibling of one of the  <br/>\nparents, Kirby thinks).  He&#39;s the star of the show in every family  <br/>\nphoto.  The brothers have been in serious trouble (attempted suicide  <br/>\nand alcoholism, and getting a girl pregnant); he&#39;s had no problems of  <br/>\nany sort.  (They&#39;re all in their 20&#39;s.)<br/>\n<br/>\nAnother family adopted one boy, an only child.  All they knew were  <br/>\nthe parents were musicians.  He is a stunning musician, a NICE guy,  <br/>\nmarried a woman from Asia, helped her with immigration to Canada;  <br/>\nhe&#39;s impressive all kinds of ways, and was unschooled for most of his  <br/>\nteen years, which gave him the chance to really focus on music.  (The  <br/>\nadoptive parents are not musical at all.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[UnschoolingDiscussion] Foster care","postDate":"1138852448","msgId":111705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlDQzUwQjg4LTY1ODItNDc0Mi1BMjczLThCODg5MUM4QUIwQUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":111703,"nextInTopic":111706,"prevInTime":111704,"nextInTime":111706,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"First fight I ever got into in my life, was when someone at church camp kept saying that she wasn t REALLY my sister. Ooh yeah...we used to have issues about","messageBody":"<div id=\"ygrps-yiv-735263680\">&quot;First fight I ever got into in my life, was when someone at church<br/>\ncamp kept saying that she wasn&#39;t REALLY my sister.&quot;<br/>\n<br/>\nOoh yeah...we used to have issues about people saying &quot;she&#39;s not your<br/>\nREAL sister right?&quot;  My two adopted sisters are Eskimo, so we look<br/>\nobviously different. My sister Dana and I are only a few months apart<br/>\nin age, so we were in the same grade for all of our school years.<br/>\nWe especially got crap from the kids when we lived in Hawaii!<br/>\n<br/>\nAfter explaining adoption and how she was Eskimo they would taunt and<br/>\ntease us because they thought we were lying. So we concocted a big old<br/>\nstory that our Dad was Hawaiian and our Mom was Haole and we were<br/>\ntwins that each look like one parent.<br/>\nThey bought that story just fine and left us alone. Sheesh.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nVisit the Unschooling website and message boards: &lt;http:// <br/>\nwww.unschooling.info&gt;<br/>\n<br/>\n<br/>\nYAHOO! GROUPS LINKS<br/>\n<br/>\n  Visit your group &quot;UnschoolingDiscussion&quot; on the web.<br/>\n<br/>\n  To unsubscribe from this group, send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Foster care","postDate":"1138844785","msgId":111703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRycm85aCtodnZoQGVHcm91cHMuY29tPg=="},"prevInTopic":111702,"nextInTopic":111705,"prevInTime":111702,"nextInTime":111704,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"First fight I ever got into in my life, was when someone at church camp kept saying that she wasn t REALLY my sister. Ooh yeah...we used to have issues about","messageBody":"<div id=\"ygrps-yiv-1866839365\">&quot;First fight I ever got into in my life, was when someone at church<br/>\ncamp kept saying that she wasn&#39;t REALLY my sister.&quot;<br/>\n<br/>\nOoh yeah...we used to have issues about people saying &quot;she&#39;s not your<br/>\nREAL sister right?&quot;  My two adopted sisters are Eskimo, so we look<br/>\nobviously different. My sister Dana and I are only a few months apart<br/>\nin age, so we were in the same grade for all of our school years.<br/>\nWe especially got crap from the kids when we lived in Hawaii!<br/>\n<br/>\nAfter explaining adoption and how she was Eskimo they would taunt and<br/>\ntease us because they thought we were lying. So we concocted a big old<br/>\nstory that our Dad was Hawaiian and our Mom was Haole and we were<br/>\ntwins that each look like one parent. <br/>\nThey bought that story just fine and left us alone. Sheesh.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Foster care","postDate":"1138844597","msgId":111702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRycm8zbCtzbWliQGVHcm91cHMuY29tPg=="},"prevInTopic":111701,"nextInTopic":111703,"prevInTime":111701,"nextInTime":111703,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"You don t really have an idea of what you are going to get no matter HOW you add a child to your family. You can guarantee they won t have FAS or drug","messageBody":"<div id=\"ygrps-yiv-611253956\">&quot;You don&#39;t really have an idea of what you are going to get no matter<br/>\nHOW you add a child to your family.&quot;<br/>\n<br/>\nYou can guarantee they won&#39;t have FAS or drug addiction. You can<br/>\nguarantee they won&#39;t be malnourished!  But it&#39;s true that you can have<br/>\nissues surface no matter the method of adding a child...it&#39;s still<br/>\ngood to be equipped with all the information about adoption, in which<br/>\nyou have zero control over the childs environment until they&#39;re in<br/>\nyour home.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":10309988,"authorName":"Nisha","from":"&quot;Nisha&quot; &lt;nishamartin@...&gt;","profile":"nishamartin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Foster care","postDate":"1138823889","msgId":111701,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRycjNzaCtzcjZuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRyb3BlbSt1aTk1QGVHcm91cHMuY29tPg=="},"prevInTopic":111700,"nextInTopic":111702,"prevInTime":111700,"nextInTime":111702,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"...  wrote: Social workers will NOT tell you every bit of detail about that ... themselves. ... That is absolutely true. I didn t know the","messageBody":"<div id=\"ygrps-yiv-338687039\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@c...&gt; wrote:<br/>\n Social workers will NOT tell you every bit of detail about that<br/>\n<blockquote><span title=\"ireply\"> &gt; child&#39;s history...heck, they might not even know all of it <br/>\n </span></blockquote>themselves.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>That is absolutely true. I didn&#39;t know the extent of my sister&#39;s abuse <br/>\nuntil a couple of years ago, and she&#39;s over 30. She joined out family <br/>\nat age 5. We are closer as adults than we were as little kids, but we <br/>\nstarted to really bond after about a year of her placement with us. <br/>\nFirst fight I ever got into in my life, was when someone at church <br/>\ncamp kept saying that she wasn&#39;t REALLY my sister. I gave them a <br/>\nbloody nose. <br/>\nnisha</div>","specialLinks":[]},{"userId":10309988,"authorName":"Nisha","from":"&quot;Nisha&quot; &lt;nishamartin@...&gt;","profile":"nishamartin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Foster care","postDate":"1138822983","msgId":111700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRycjMwNytxbmNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg2MjUyNjYyLTUwQkYtNDFDNC1CNzA1LUY1M0U2NDBENzMyRUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":111689,"nextInTopic":111701,"prevInTime":111699,"nextInTime":111701,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"**** True, but it s bad enough that adults don t have  realistic idea of   what they re getting into.  Kids have NO idea. You don t really have an idea of what","messageBody":"<div id=\"ygrps-yiv-16949088\">**** True, but it&#39;s bad enough that adults don&#39;t have  realistic <br/>\nidea of   what they&#39;re getting into.  Kids have NO idea.<br/>\n<br/>\n<br/>\nYou don&#39;t really have an idea of what you are going to get no matter <br/>\nHOW you add a child to your family. <br/>\n<br/>\n.***** . . But he absolutely does not<br/>\n<blockquote><span title=\"ireply\"> &gt; *want* to be an only <br/>\n<br/>\n<br/>\n </span></blockquote>I felt that way when I was a kid as well. We adopted my sister when <br/>\nI was 10 and she was 5. My advice is to make sure you include him in <br/>\nall the steps that you can. Right down to taking him to court with <br/>\nyou when the papers are done. Also, something my parents didn&#39;t <br/>\nknow, make sure the adopted child knows that they have the option of <br/>\nchanging their name if they choose to do so. My sister is still kind <br/>\nof  bitter about that one. :)<br/>\nThere are a lot of reasons why they tend to want you to adopt kids <br/>\nyounger than your born to you children. Birth order does matter in a <br/>\nlot of ways. It really does influence a lot of things in your <br/>\npersonality. There tend to be less problematic issues with kids who <br/>\nare younger than your birth children.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Are you sure he doesn&#39;t just want more friends?  Can you find 14 <br/>\n </span></blockquote>year   old friends (give or take a couple of years for extended <br/>\nvisits,   overnights, long weekends?  He might want his personal-<br/>\nfantasy   brother, but you won&#39;t find that person.<br/>\n<br/>\n<br/>\nThere will be adjustments, road bumps and friction. Even when you <br/>\nwant a sibling so bad you can taste it, the reality of it takes some <br/>\ngetting used to. But friends aren&#39;t going to cut it if he really <br/>\nwants a sibling. I&#39;ve been there. I hated being an only. HATED it.<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; You&#39;ll do what you do, but giving some serious thought to <br/>\n </span></blockquote>possible  longterm (LIFElongevery life involved) ramifications is <br/>\ngood.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n </span></blockquote>My sister and I are now very close. We weren&#39;t always, but I am very <br/>\nthankful to have her in my life. <br/>\n<br/>\nI was asked what I wanted from a sibling, whether I&#39;d prefer a <br/>\nbrother or sister, if I was aware it wasn&#39;t like a puppy, that we <br/>\nwouldn&#39;t be able to give them back. That I&#39;d have to share my mom <br/>\nand dad. The psychologist from the adoption agency talked to me <br/>\nalone as part of the screening process. There were several things I <br/>\ncould have done or said that would&#39;ve put a halt on the whole deal. <br/>\nIf I had said I didn&#39;t want a sibling, it would have been over.<br/>\nI did.<br/>\nWe went to Kansas CIty to meet ANg a couple of times before we all <br/>\ndecided to go for it. She had some major issues, and still does if <br/>\nI&#39;m honest. SHe was seriously mentally and physically abused, <br/>\nabandoned by both her birth mother, (to her father) and then by her <br/>\nfather for her stepmother and her kids. He drove her to child <br/>\nservices and just signed away rights to her and her two sibs. So she <br/>\nhas some abandonement issues to this day. This all happened before <br/>\nshe turned 5. <br/>\n I don&#39;t think my parents really were equipped to deal with her <br/>\nproblems in a way that helped her at all. A more openly loving, non <br/>\npunitive home probably would&#39;ve been better for Ang, but she&#39;d <br/>\nalready been in 6 foster homes in less than a year, and almost <br/>\nadopted, and then had the family change their mind after they&#39;d <br/>\nalready told her she was theirs forever and she&#39;d lived with them <br/>\nfor weeks. THey were looking at her as being unadoptable and about <br/>\nready to write her off completely. So she came to us.<br/>\n It was a rough road, but like I said, I&#39;m glad she&#39;s a big part of <br/>\nmy life. She has said she feels the same way. <br/>\n<br/>\nNisha</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Foster care","postDate":"1138747670","msgId":111689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRyb3BlbSt1aTk1QGVHcm91cHMuY29tPg=="},"prevInTopic":111686,"nextInTopic":111700,"prevInTime":111688,"nextInTime":111690,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"The more I think about adoption and foster care, the more I think wanting a sibling for your child is one of the WORST possible reasons for doing it. If you","messageBody":"<div id=\"ygrps-yiv-1905017268\">The more I think about adoption and foster care, the more I think<br/>\nwanting a sibling for your child is one of the WORST possible reasons<br/>\nfor doing it.<br/>\n<br/>\nIf you have the resources to really GIVE an adopted child a wonderful<br/>\nlife, and you want to make a difference in a child&#39;s life, that&#39;s a<br/>\ngood reason to adopt.  An instant sibling is NOT what you get most<br/>\ntimes, and is really a very selfish reason.<br/>\n<br/>\nThat adopted child (if older) WILL come with issues. You need to be<br/>\nprepared (as does your child) for dealing with those issues long term.<br/>\nSocial workers will NOT tell you every bit of detail about that<br/>\nchild&#39;s history...heck, they might not even know all of it themselves.<br/>\n<br/>\nThere is a chance that the child will heal, become a very bonded child<br/>\nand be wonderful friends with everyone in the family. But you need to<br/>\naccept the fact that it may very well never happen and if you want to<br/>\nadopt in spite of that fact, then you are in it for the right reasons.<br/>\n<br/>\nI am a big fan of adoption and long to adopt a child myself...so don&#39;t<br/>\nget me wrong, I&#39;m not against adoption at all. My dh was adopted and<br/>\nI&#39;ve been trying to find his birth mother for years....adoption has<br/>\nbeen a big part of my life.<br/>\n<br/>\nAdopt a child to love them, nourish them and give them opportunities<br/>\nthey may otherwise never have. Plan to love them and nourish them in<br/>\nspite of the fact that you may never get much back. If you can do it<br/>\nfor those reasons, you will be a great adoptive parent.<br/>\n<br/>\nIf you want a sibling for your existing child, there are other ways to<br/>\naddress that need. <br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Foster care","postDate":"1138736145","msgId":111686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwRkIyQUJDLUI1OEItNENDNi1BRTBBLTkwNTYyQzM1QzA5MUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGRybzRyaStlY25nQGVHcm91cHMuY29tPg==","referencesHeader":"PGRybzRyaStlY25nQGVHcm91cHMuY29tPg=="},"prevInTopic":111685,"nextInTopic":111689,"prevInTime":111685,"nextInTime":111687,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... My nephews thought having a little sister sounded great. Things didn t turn out well and it was absolutely definitely not of benefit to the boys for my","messageBody":"<div id=\"ygrps-yiv-1999876763\">On Jan 31, 2006, at 8:56 AM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; WE had all of that. we BEGGED our parents to adopt, more than once.  <br/>\n&gt; Children do NOT have<br/>\n&gt; the life experience nor understanding of what it&#39;s like once these<br/>\n&gt; children are part of your family forever.<br/>\n<br/>\n </span></blockquote>My nephews thought having a little sister sounded great.<br/>\n<br/>\nThings didn&#39;t turn out well and it was absolutely definitely not of  <br/>\nbenefit to the boys for my sister to adopt another child. And she WAS  <br/>\nyounger, by the way. They had a good friend with a really cool  <br/>\nyounger sister who they liked a lot. They thought it would be like  <br/>\nthat. It wasn&#39;t.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Foster care","postDate":"1138733564","msgId":111684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzREFENEJCLUZBOEMtNDUxRi1CQjA3LTE5MzE5NjAxOEY2NEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRybzRnaSticDB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGRybzRnaSticDB0QGVHcm91cHMuY29tPg=="},"prevInTopic":111678,"nextInTopic":111685,"prevInTime":111683,"nextInTime":111685,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"The new issue of Life Learning magazine has an article on adoption and unschooling by Laurie Couture, called Freeing Brycen.  Part One of a single mom s","messageBody":"<div id=\"ygrps-yiv-560658391\">The new issue of Life Learning magazine has an article on adoption  <br/>\nand unschooling by Laurie Couture, called &quot;Freeing Brycen.&quot;  &quot;Part  <br/>\nOne of a single mom&#39;s journey to adopt and unschool her young son.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Foster care","postDate":"1138730998","msgId":111685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzMEY2QkQzLUMxODgtNDgxQy1BREFFLUEyRUU0OUU0NjkzOEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRybzRyaStlY25nQGVHcm91cHMuY29tPg==","referencesHeader":"PGRybzRyaStlY25nQGVHcm91cHMuY29tPg=="},"prevInTopic":111684,"nextInTopic":111686,"prevInTime":111684,"nextInTime":111686,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... You might, but that would be a miracle, and you PROBABLY will not. ... Not only does the adopted child either come back to you for life for help and","messageBody":"<div id=\"ygrps-yiv-1409912856\">On Jan 31, 2006, at 9:56 AM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Don&#39;t go into this all roses and sunshine, thinking you&#39;re going to<br/>\n&gt; get a kid that is a great brother for your existing child. You might,<br/>\n&gt; and that would be wonderful, but you might not.<br/>\n<br/>\n<br/>\n </span></blockquote>You might, but that would be a miracle, and you PROBABLY will not.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Adoption should not be about providing an instant sibling. You need to<br/>\n&gt; be better prepared for the possibility that it won&#39;t happen, and that<br/>\n&gt; child still needs parents and love for the rest of their lives.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Not only does the adopted child either come back to you for life for  <br/>\nhelp and support (or he becomes an orphan once he leaves), but your  <br/>\nOWN child might want your resources, attention, private help, after  <br/>\nhe&#39;s grown.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Foster care","postDate":"1138726578","msgId":111677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRybzRyaStlY25nQGVHcm91cHMuY29tPg=="},"prevInTopic":111669,"nextInTopic":111678,"prevInTime":111676,"nextInTime":111678,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":" I think if the current kids in the family really *want* more siblings, are totally on board with it, thats got to be alot better than being forced to share","messageBody":"<div id=\"ygrps-yiv-318253145\">&quot; I think if the current kids in the family really *want*<br/>\nmore siblings, are totally on board with it, thats got to be alot<br/>\nbetter than being forced to share what you don&#39;t want to share by<br/>\nparents who don&#39;t care about your opinions or feelings.&quot;<br/>\n<br/>\nWE had all of that.<br/>\nwe BEGGED our parents to adopt, more than once. Children do NOT have<br/>\nthe life experience nor understanding of what it&#39;s like once these<br/>\nchildren are part of your family forever.<br/>\n<br/>\nIt sounds GREAT to have this new sibling, already your age (or older)<br/>\nto hang out with and have as a friend. The reality is, they don&#39;t<br/>\nalways bond the same way.<br/>\nI have a very surface relationship with all of my adopted sibs,<br/>\nnothing deep at ALL. That is a very real possibilty, one you need to<br/>\naccept if you&#39;re going to adopt.<br/>\nDon&#39;t go into this all roses and sunshine, thinking you&#39;re going to<br/>\nget a kid that is a great brother for your existing child. You might,<br/>\nand that would be wonderful, but you might not.<br/>\n<br/>\nAdoption should not be about providing an instant sibling. You need to<br/>\nbe better prepared for the possibility that it won&#39;t happen, and that<br/>\nchild still needs parents and love for the rest of their lives.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Foster care","postDate":"1138726226","msgId":111678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRybzRnaSticDB0QGVHcm91cHMuY29tPg=="},"prevInTopic":111677,"nextInTopic":111684,"prevInTime":111677,"nextInTime":111679,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"Were you involved in the process of the adoption, were you asked what you wanted in a sibling? Did you meet the girls ahead of time, and did they live with","messageBody":"<div id=\"ygrps-yiv-1181154495\">&quot;Were you involved in the process of the adoption, were you asked<br/>\nwhat you wanted in a sibling? Did you meet the girls ahead of time,<br/>\nand did they live with you for months before the adoption was<br/>\nfinalized?&quot;<br/>\n<br/>\nYes on both counts. I could not have understood the affect of messing<br/>\nwith the birth order at my age (9), nor the dynamics my sisters<br/>\nbrought into the household. Could my parents have anticipated? Sure,<br/>\nnow that they&#39;ve lived through raising three high needs, previously<br/>\nabused children.<br/>\n<br/>\nNo, she was not allowed to continue with the meanness unchecked, but<br/>\nwhat you&#39;re not understanding is how subtle it was. It was very<br/>\nsneaky....so my parents couldn&#39;t just go off accusing her without<br/>\nevidence that she&#39;d done it.<br/>\nShe lied of course. And that&#39;s the reason it would have been<br/>\nimpossible to understand whether they wanted to be adopted.For so long<br/>\nin their lives, they&#39;d been trained to say what elicited a certain<br/>\nresponse, they wouldn&#39;t tell you what they really felt.  <br/>\n<br/>\nWe had them as foster kids for a couple of months before adoption was<br/>\ndiscussed.  My parents had fallen in love with them by that time....as<br/>\nhad myself and my other sibs.  It&#39;s a lot more complicated than one<br/>\nwould believe.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":7527178,"authorName":"CelticFrau@aol.com","from":"CelticFrau@...","profile":"celticfrau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Foster care","postDate":"1138708924","msgId":111669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJkNS4yMDcyZDRiLjMxMTBhYmJjQGFvbC5jb20+"},"prevInTopic":111666,"nextInTopic":111677,"prevInTime":111668,"nextInTime":111670,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... old friends (give or take a couple of years for  extended visits, overnights, long weekends?  He might want his  personal-fantasy brother, but you won t","messageBody":"<div id=\"ygrps-yiv-1097563823\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Are you sure he doesn&#39;t just want more friends?  Can  you find 14 year  <br/>\n </span></blockquote>old friends (give or take a couple of years for  extended visits,  <br/>\novernights, long weekends?  He might want his  personal-fantasy  <br/>\nbrother, but you won&#39;t find that  person.<br/>\n<br/>\n<br/>\n<br/>\nIf you take in a 14 year old, I can almost guarantee you won&#39;t find that  <br/>\nperson.  I think if you are set on this, your hunch about a 6 or 7 year old  is a <br/>\nbetter idea.  If a 14 year old has been moved many places,  there&#39;s a reason. <br/>\n If a 14 yo HASN&#39;T been moved a lot and has been  with his foster family for <br/>\na long time, then that&#39;s probably the best place for  him to stay until he <br/>\nturns 18.<br/>\n <br/>\nYou will just have a better chance with a younger child.  We adopted  3, all <br/>\nyounger than our own.  The oldest (at the time he first came to live  with us) <br/>\nwas 9, he&#39;s 15 now, and he and my son are probably best friends (my son  is <br/>\nalmost 18).  They talk all the time about getting an apartment together  some <br/>\nday, or starting a business.  This boy had no history of FAS or RAD,  and other <br/>\nthan the emergency shelter, ours was the first foster home he and his  <br/>\nbrother had been in.  So it CAN work, though I always tend to emphasize the  bad <br/>\n(sorry) because I want everyone to know what they&#39;re getting into up  front. <br/>\n <br/>\nNancy B.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Foster care","postDate":"1138685764","msgId":111666,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2MjUyNjYyLTUwQkYtNDFDNC1CNzA1LUY1M0U2NDBENzMyRUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRybWhycituMWpvQGVHcm91cHMuY29tPg==","referencesHeader":"PGRybWhycituMWpvQGVHcm91cHMuY29tPg=="},"prevInTopic":111664,"nextInTopic":111669,"prevInTime":111665,"nextInTime":111667,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... ============== No I didn t. But no amount of mindfulness would have kept me as the oldest child if an older child had been brought in. I don t think a","messageBody":"<div id=\"ygrps-yiv-1480393346\">On Jan 30, 2006, at 7:26 PM, queenjane555 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But you didnt grow up in an unschooling home right? Nor with parents<br/>\n&gt; who parented &quot;mindfully&quot;?<br/>\n<br/>\n </span></blockquote>==============<br/>\n<br/>\nNo I didn&#39;t.<br/>\nBut no amount of mindfulness would have kept me as the oldest child  <br/>\nif an older child had been brought in.<br/>\n<br/>\nI don&#39;t think a mindful parent should minimize the potential impact  <br/>\non their children.<br/>\n<br/>\n-=-My child never feels that he is lacking in his own &quot;rights in<br/>\npriveledges&quot;, and i am not sure how adding a child who is two years<br/>\n*younger* as opposed to two years *older* will make much of a<br/>\ndifference. -=-<br/>\n<br/>\nYou don&#39;t TRULY know what your child feels he is lacking, and your  <br/>\nnot being sure how something could make a difference is no safety  <br/>\nagainst the difference being made.  And does it need to be &quot;much&quot;  <br/>\ndamage to be enough?<br/>\n<br/>\n-=-It doesnt sound like your situation wouldve been made much better if<br/>\nthe cousins were a bit younger and therefore not messing up &quot;the<br/>\nbirth order&quot; though. -=-<br/>\n<br/>\nYes, it would have been.  Not MUCH better, but better.  And better is  <br/>\nbetter.<br/>\n<br/>\n-=-&gt; And my sister went from being one of two to #4 of four.<br/>\n-=-Obviously i would not want to adopt a child that had any history of<br/>\nacting out sexually.-=-<br/>\n<br/>\nAt the age of seven, when Nadine came to our house, she had no  <br/>\nhistory of acting out sexually.<br/>\n<br/>\n-=-But in our unschooling home, where there is<br/>\nsuch an atmosphere of openness, ANY inappropriateness would most<br/>\nlikely be dealt with right away. -=-<br/>\n<br/>\nMuch more likely in your situation, yes.<br/>\n<br/>\n-=-Were the kids in your family consulted at all about taking in the<br/>\nextra family members?-=-<br/>\n<br/>\nWith the first, yes.  With the second, no.  She was rescued from a  <br/>\ncounty orphanage.  It was our house or Tarrant County social  <br/>\nservices.  Her mom (my mothers older sister) left her in a bar and  <br/>\ndidn&#39;t come back for her soon enough to suit the owners.  Because we  <br/>\nalready had her sister, it was just done.  Nadine didn&#39;t want it.   <br/>\nShe cried daily for a long time, and when she wasn&#39;t crying she was  <br/>\nlashing out at the other kids.  I felt sorry for her, but it was like  <br/>\nputting a mean dog in with the kittens.<br/>\n<br/>\n-=-My son is desperate for a brother, he said he<br/>\nwould give up his computer to have a brother (and that&#39;s saying<br/>\nsomething). I think if the current kids in the family really *want*<br/>\nmore siblings, are totally on board with it, thats got to be alot<br/>\nbetter than being forced to share what you don&#39;t want to share by<br/>\nparents who don&#39;t care about your opinions or feelings.-=-<br/>\n<br/>\nTrue, but it&#39;s bad enough that adults don&#39;t have  realistic idea of  <br/>\nwhat they&#39;re getting into.  Kids have NO idea.<br/>\n<br/>\n-=-I&#39;m just having a hard time wrapping my head around the idea of<br/>\nbirth order being important. . . . But he absolutely does not<br/>\n*want* to be an only child so i believe its worth it for us.-=-<br/>\n<br/>\nWere you an only?<br/>\nIf not, what was your position, numerically?  What of how many?<br/>\n<br/>\n-=-At this point i&#39;m thinking it might be easier with a<br/>\nyounger child (3-7 or so)because he could take the big brother role.<br/>\nBut he has stated he wants a brother closer to his age (he said &quot;I<br/>\nwant a 14 yr old brother!&quot; but i dont think i&#39;m up for that right<br/>\nnow)<br/>\n-=-<br/>\n<br/>\nAre you sure he doesn&#39;t just want more friends?  Can you find 14 year  <br/>\nold friends (give or take a couple of years for extended visits,  <br/>\novernights, long weekends?  He might want his personal-fantasy  <br/>\nbrother, but you won&#39;t find that person.<br/>\n<br/>\nYou&#39;ll do what you do, but giving some serious thought to possible  <br/>\nlongterm (LIFElong—every life involved) ramifications is good.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Foster care","postDate":"1138681407","msgId":111664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRybW9udis0OTZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI2Ny40ZTVmNzAzLjMxMTAyNjRiQGFvbC5jb20+"},"prevInTopic":111662,"nextInTopic":111666,"prevInTime":111663,"nextInTime":111665,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... issues, there has to be a lot of firm structure.  Not because it s good  parenting but because the child has to give up and give in and surrender their","messageBody":"<div id=\"ygrps-yiv-1120000699\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, CelticFrau@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;I think at first, especially if the child has attachment  <br/>\n </span></blockquote>issues, there has to be a lot of firm structure.  Not because <br/>\nit&#39;s &quot;good  parenting&quot; but because the child has to give up and give <br/>\nin and surrender their  control to the parents, so that bonding can <br/>\nbegin.  It sounds horrible, I  know.  But in the children&#39;s past, <br/>\ncontrolling their own situations  (through whatever means possible, <br/>\nusually negative ) was the only way they could  prevent themselves <br/>\nbeing hurt, rejected, and disappointed.  They can&#39;t  trust adults <br/>\nbecause everytime they have in the past, the adults have either  <br/>\nhurt them, or sent them away.  It&#39;s sort of a &quot;strike first&quot;  <br/>\nmentality.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nMy middle daughter Shawna used intimidation and manipulation to <br/>\nabuse her siblings. She was determined to show me (their anger is <br/>\nusually directed at the mother) that she controlled her siblings, <br/>\nnot me. She constantly tested me to see if I was strong enough to <br/>\nhandle her, to see if I could take what she dished out. <br/>\nAnd I was, and I did. <br/>\nMy mantra the whole first year to her was &quot;I will wear you down <br/>\nbefore you wear me down. Give me all you got.&quot; <br/>\nAnd she did. <br/>\nBut we survived and she&#39;s healing and learning to trust and loving <br/>\nlife every day. <br/>\nThis was a child who, on the first day I met her (and her siblings) <br/>\ntold me &quot;Don&#39;t lie to us&quot; when I asked thme if they wanted to get <br/>\ntogether again the following week.   <br/>\n<br/>\nI hope Cimion will be at that level one day. His RAD symptoms are <br/>\nmore deep rooted that Shawna&#39;s. His abuse was also longer and more <br/>\nsevere. This is a child who told me he loved me an hour after he met <br/>\nme.     <br/>\n     <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I think a lot of adoptive parents do hold onto those parenting <br/>\n </span></blockquote>styles forever, which I think is a mistake.  The children may <br/>\nappear &quot;obedient&quot;  and healed on the surface, but I have seen so <br/>\nmany stifled and not allowed to  grow. They usually explode <br/>\nlater.&gt;&gt;&gt;&gt;<br/>\n<br/>\nYes and this is where I&#39;m forever grateful to unschooling and the <br/>\nvoices who brought it to the front of my mind. As Shawna was making <br/>\nprogress and changes, I knew I had to change my parenting also. <br/>\nThat was VERY hard to do. It was at this point I found <br/>\nunschooling.com and soaked it all in. I started applyling some of <br/>\nthe ways I was reading about with Jacqueline and she just blossomed. <br/>\nI then started with Shawna, very slowly and started to really open <br/>\nup. It was like the vehicle she needed to grow as a person.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Have you read anything by Dr. Keck and Regina Kupecky?  <br/>\n </span></blockquote>(Adopting the  Hurt Child, Parenting the Hurt Child)  They are my <br/>\nfavorite &quot;adoption&quot;  authors and the books apply to foster care <br/>\ntoo.  They really  hit the nail on the head. Describes what does and <br/>\ndoesn&#39;t work with  healing adoptive children, I can&#39;t recommend <br/>\ntheir books enough.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThat is a great book. I also like Parenting the Hurt Child by them <br/>\nand Nancy Thomas&#39; &quot;Love is not enough&quot; although I found her <br/>\ntechnique worked more with Shawna than Cimion. <br/>\n<br/>\n~ Joanne ~<br/>\nMom to Jacqueline (7), Shawna (10) & Cimion (13)<br/>\nAdopted into our hearts October 30, 2003<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/\">http://anunschoolinglife.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://foreverparents.com\">http://foreverparents.com</a></div>","specialLinks":[]},{"userId":230706843,"authorName":"Betsy Hill","from":"Betsy Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Foster care","postDate":"1138678844","msgId":111662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzREVEQzNDLjIwODA4MDRAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PGRybWdzaSs3aDZ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGRybWdzaSs3aDZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":111661,"nextInTopic":111664,"prevInTime":111661,"nextInTime":111663,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"** So when i hear peoples stories about how it was really hard for them growing up, its difficult (for me)to discern whether thats an adoption issue, or a","messageBody":"<div id=\"ygrps-yiv-219795744\">** So when i hear peoples&#39; stories about how it was really hard for<br/>\nthem growing up, its difficult (for me)to discern whether thats an<br/>\nadoption issue, or a parenting issue. Thats why i specifically asked<br/>\nabout birth order.**<br/>\n<br/>\nMy dad got remarried when I was 14 and my brother 12.  The oldest of my <br/>\nstepsiblings (8) let us know that she didn&#39;t like being bumped out of <br/>\nher role as the oldest responsible kid.  That was the role she had <br/>\nplayed when her mom was a single parent, and she was pretty level <br/>\nheaded.  But no one was going to leave her in charge when they could <br/>\nnominate a 14 year old for that task.  From her comments, it&#39;s pretty <br/>\nclear that she felt she lost status, and I don&#39;t know how a parent could <br/>\nminimize that effect.  (It&#39;s not like I belittled or patronized her, um, <br/>\nat least not consciously.  Maybe IF I hadn&#39;t been schooled I wouldn&#39;t <br/>\nhave thought I was way more evolved than her.  I don&#39;t know.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":7527178,"authorName":"CelticFrau@aol.com","from":"CelticFrau@...","profile":"celticfrau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Foster care","postDate":"1138674763","msgId":111661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2Ny40ZTVmNzAzLjMxMTAyNjRiQGFvbC5jb20+"},"prevInTopic":111660,"nextInTopic":111662,"prevInTime":111660,"nextInTime":111662,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/30/2006 9:11:19 PM Eastern Standard Time, ... support for mindful parenting in adoption circles. I am on a couple  of lists, and the","messageBody":"<div id=\"ygrps-yiv-444466455\">In a message dated 1/30/2006 9:11:19 PM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:queenjane555@...\">queenjane555@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The reason that i ask is that it seems so hard to find  <br/>\n </span></blockquote>support for &quot;mindful parenting&quot; in adoption circles. I am on a <br/>\ncouple  of lists, and the parents mostly talk about diagnoses, <br/>\nmedication,  structure, time outs, etc etc. Its hard to know if thats <br/>\njust alot of  mainstream parenting BS, or if its &quot;necessary&quot; ya  know?&lt;&lt;<br/>\n <br/>\nKatherine - I think at first, especially if the child has attachment  issues, <br/>\nthere has to be a lot of firm structure.  Not because it&#39;s &quot;good  parenting&quot; <br/>\nbut because the child has to give up and give in and surrender their  control <br/>\nto the parents, so that bonding can begin.  It sounds horrible, I  know.  But <br/>\nin the children&#39;s past, controlling their own situations  (through whatever <br/>\nmeans possible, usually negative ) was the only way they could  prevent <br/>\nthemselves being hurt, rejected, and disappointed.  They can&#39;t  trust adults because <br/>\neverytime they have in the past, the adults have either  hurt them, or sent <br/>\nthem away.  It&#39;s sort of a &quot;strike first&quot;  mentality.<br/>\n <br/>\nThey have to see that there is someone whom they can completely  depend on, <br/>\nwho will take care of their needs, love them, protect them, and  especially who <br/>\nwon&#39;t abandon them.  And they will fight it every step of  the way..it&#39;s the <br/>\nonly way they have defended themselves in the past.  <br/>\n <br/>\nBut once our kids bonded with us, we were able to give their lives and  <br/>\ndecisions back to them.  I wouldn&#39;t say that we can give them as much  freedom as <br/>\nthe children we&#39;ve raised from birth, though 2 of our adopted sons  are very <br/>\nclose.  <br/>\n <br/>\nI think a lot of adoptive parents do hold onto those parenting styles  <br/>\nforever, which I think is a mistake.  The children may appear &quot;obedient&quot;  and healed <br/>\non the surface, but I have seen so many stifled and not allowed to  grow.  <br/>\nThey usually explode later.<br/>\n <br/>\nHave you read anything by Dr. Keck and Regina Kupecky?  (Adopting the  Hurt <br/>\nChild, Parenting the Hurt Child)  They are my favorite &quot;adoption&quot;  authors and <br/>\nthe books apply to foster care too.  They really  hit the nail on the head.  <br/>\nDescribes what does and doesn&#39;t work with  healing adoptive children, I can&#39;t <br/>\nrecommend their books enough.<br/>\n <br/>\nNancy B.<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Foster care","postDate":"1138674363","msgId":111660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRybWhycituMWpvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgwNThBNzc2LTc0QTMtNEM5OS1BRjBFLUEyNjQ3RTVCREI1REBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":111659,"nextInTopic":111661,"prevInTime":111659,"nextInTime":111661,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... But you didnt grow up in an unschooling home right? Nor with parents who parented mindfully ? My child never feels that he is lacking in his own rights","messageBody":"<div id=\"ygrps-yiv-313907425\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Sandra Dodd <br/>\n&lt;Sandra@S...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anything parents do to keep their own children from feeling their <br/>\n&gt;own   rights and privileges is bad.  Giving your own oldest child <br/>\n&gt;over to   the position of #2 in age sucks (and I know from personal <br/>\n&gt;experience).<br/>\n<br/>\n </span></blockquote>But you didnt grow up in an unschooling home right? Nor with parents <br/>\nwho parented &quot;mindfully&quot;?<br/>\n<br/>\nMy child never feels that he is lacking in his own &quot;rights in <br/>\npriveledges&quot;, and i am not sure how adding a child who is two years <br/>\n*younger* as opposed to two years *older* will make much of a <br/>\ndifference. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I&#39;m not sure the youngest would appreciate not being the baby  <br/>\n&gt; anymore, either, but having your children be bigger and stronger <br/>\n&gt;than stranger children would be a courtesy and a safety.<br/>\n<br/>\n </span></blockquote>But again, i am speaking about *age* specifically. At an adoption <br/>\nfestival last year we met a child who was a bit older than my son (a <br/>\nyear older i think)and yet was MUCH smaller physically...he couldve <br/>\nbeen a six year old just from looking at him. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My sister was sexually molested by the female cousin a year older  <br/>\n&gt; than she was.  (She didn&#39;t tell, because my mom had a no-tattling  <br/>\n&gt; policy.)<br/>\n&gt; <br/>\n&gt; And my sister went from being one of two to #4 of four.<br/>\n<br/>\n </span></blockquote>Obviously i would not want to adopt a child that had any history of <br/>\nacting out sexually. But in our unschooling home, where there is <br/>\nsuch an atmosphere of openness, ANY inappropriateness would most <br/>\nlikely be dealt with right away. <br/>\n<br/>\nWere the kids in your family consulted at all about taking in the <br/>\nextra family members? My son is desperate for a brother, he said he <br/>\nwould give up his computer to have a brother (and that&#39;s saying <br/>\nsomething). I think if the current kids in the family really *want* <br/>\nmore siblings, are totally on board with it, thats got to be alot <br/>\nbetter than being forced to share what you don&#39;t want to share by <br/>\nparents who don&#39;t care about your opinions or feelings.<br/>\n<br/>\nIt doesnt sound like your situation wouldve been made much better if <br/>\nthe cousins were a bit younger and therefore not messing up &quot;the <br/>\nbirth order&quot; though. <br/>\n<br/>\nI&#39;m just having a hard time wrapping my head around the idea of <br/>\nbirth order being important. I think any time you change the family <br/>\ndynamic in *any* way, there will need to be adjustment to that. My <br/>\nson has been an only child for 9 yrs. I know it will be hard to then <br/>\nhave a new sibling (and not a little lump of a newborn but a fully <br/>\nformed kid with likes and dislikes and fully formed personality), <br/>\nand it will change our family forever. But he absolutely does not <br/>\n*want* to be an only child so i believe its worth it for us. But <br/>\nwith regards to birth order, i&#39;m trying to figure how (for us)how a <br/>\nchild two years older would be a worse choice than one two years <br/>\nyounger. At this point i&#39;m thinking it might be easier with a <br/>\nyounger child (3-7 or so)because he could take the big brother role. <br/>\nBut he has stated he wants a brother closer to his age (he said &quot;I <br/>\nwant a 14 yr old brother!&quot; but i dont think i&#39;m up for that right <br/>\nnow) <br/>\n<br/>\nI know the most important thing (for us)in adopting would be to be <br/>\nmatched with a kid that has similar interests (i think a boy who&#39;s <br/>\nmain love was all things sports related, or NASCAR, or going to <br/>\nchurch would probably not be so comfortable here....the SuperBowl is <br/>\nhere this weekend and i dont even know who&#39;s <br/>\nplaying!...thats..uh...football right?!?), a kid without significant <br/>\nattachment issues or history of mental illness, and a child who will <br/>\nbe willing to try homeschooling. <br/>\n<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Foster care","postDate":"1138673362","msgId":111659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRybWdzaSs3aDZ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRyanNlYys0bzZnQGVHcm91cHMuY29tPg=="},"prevInTopic":111621,"nextInTopic":111660,"prevInTime":111658,"nextInTime":111660,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... Were you involved in the process of the adoption, were you asked what you wanted in a sibling? Did you meet the girls ahead of time, and did they live with","messageBody":"<div id=\"ygrps-yiv-165633380\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Cindy was two years older than I, Dana was just a few<br/>\n&gt; months older. I had been the oldest in my family. My family had a <br/>\n&gt;middle class existance, lots of love and nurture...I seemed to have <br/>\n&gt;everything in their eyes. Being the oldest, then bringing in <br/>\n&gt;someone older than me (these kids DON&#39;T have the advantage of being <br/>\n&gt;unschooled/non-age segregated before they get to your home btw) <br/>\n&gt;meant all of her anger and meanness got aimed at ME.<br/>\n<br/>\n </span></blockquote>Were you involved in the process of the adoption, were you asked <br/>\nwhat you wanted in a sibling? Did you meet the girls ahead of time, <br/>\nand did they live with you for months before the adoption was <br/>\nfinalized? The reason that i ask is that it seems so hard to find <br/>\nsupport for &quot;mindful parenting&quot; in adoption circles. I am on a <br/>\ncouple of lists, and the parents mostly talk about diagnoses, <br/>\nmedication, structure, time outs, etc etc. Its hard to know if thats <br/>\njust alot of mainstream parenting BS, or if its &quot;necessary&quot; ya know? <br/>\nSo when i hear peoples&#39; stories about how it was really hard for <br/>\nthem growing up, its difficult (for me)to discern whether thats an <br/>\nadoption issue, or a parenting issue. Thats why i specifically asked <br/>\nabout birth order. <br/>\n  <br/>\nDid your parents address the issues between you and your sister? Was <br/>\nshe allowed to get away with treating you badly because she was <br/>\nadopted? Did SHE want to be adopted into your family? I think it <br/>\nwould be a terrible idea to adopt a child if the current kids in the <br/>\nfamily didnt want to do it. <br/>\n<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Foster care","postDate":"1138589299","msgId":111620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0QUNFQjc4LTU3MkEtNDBDNy1BNEMwLTA3MzhBODE3NzY2QUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRyanNlYys0bzZnQGVHcm91cHMuY29tPg==","referencesHeader":"PGRyanNlYys0bzZnQGVHcm91cHMuY29tPg=="},"prevInTopic":111613,"nextInTopic":111621,"prevInTime":111619,"nextInTime":111621,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... Don t make your own children pay the price for a parent s desire to be a better parent by being a more diluted parent. I know a family with two children.","messageBody":"<div id=\"ygrps-yiv-373060428\">On Jan 29, 2006, at 7:08 PM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You owe  your birth children FIRST and foremost. If there&#39;s room in<br/>\n&gt; your family for adoption or fostering, I think that&#39;s awesome. Just<br/>\n&gt; don&#39;t make your own children pay the price for shit done to kids by<br/>\n&gt; crappy parents that you don&#39;t even know.<br/>\n<br/>\n<br/>\n </span></blockquote>Don&#39;t make your own children pay the price for a parent&#39;s desire to  <br/>\n&quot;be a better parent&quot; by being a more diluted parent.<br/>\n<br/>\nI know a family with two children.  They adopted three--one between  <br/>\nthe ages of their two, and two younger.  The mother&#39;s attention went  <br/>\nalmost exclusively to those three, because they had problems, because  <br/>\nthey needed attention.  She called them &quot;my Russian&quot; and &quot;my Korean&quot;  <br/>\nand such, but she wouldn&#39;t call her own children &quot;my own child&quot;  <br/>\nbecause that would have seemed to set them apart.<br/>\n<br/>\nIt wasn&#39;t long at all before her original two children ALSO needed  <br/>\nattention and had problems.<br/>\n<br/>\nShe had something to brag about at church, at first, though.  She  <br/>\nfelt like more of a mom.<br/>\n<br/>\nBut quantity isn&#39;t quality.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Foster care","postDate":"1138586892","msgId":111611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRyanNlYys0bzZnQGVHcm91cHMuY29tPg=="},"prevInTopic":111608,"nextInTopic":111613,"prevInTime":111610,"nextInTime":111612,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"I m curious to hear opinions about why being the oldest or youngest matters in an unschooling family that doesnt segregrate/discriminate etc by age? It","messageBody":"<div id=\"ygrps-yiv-735314204\">&quot;I&#39;m curious to<br/>\nhear opinions about why being &quot;the oldest&quot; or &quot;youngest&quot; matters in an<br/>\nunschooling family that doesnt segregrate/discriminate etc by age?&quot;<br/>\n<br/>\nIt has nothing to do with unschooling or age segregation...it has<br/>\neverything to do with sibling issues.<br/>\n<br/>\nHere&#39;s what happened in my life; We adopted two girls (birth sisters)<br/>\nthat had a history of abuse and an alcoholic Dad (the abuse mostly<br/>\ncame from him). Cindy was two years older than I, Dana was just a few<br/>\nmonths older.<br/>\nI had been the oldest in my family. My family had a middle class<br/>\nexistance, lots of love and nurture...I seemed to have everything in<br/>\ntheir eyes. Being the oldest, then bringing in someone older than me<br/>\n(these kids DON&#39;T have the advantage of being unschooled/non-age<br/>\nsegregated before they get to your home btw) meant all of her anger<br/>\nand meanness got aimed at ME.<br/>\nShe hated me.<br/>\nShe destroyed things I loved, she wrote horrible things about me...we<br/>\nalso were friends at times, but the pain of being hated was horrible.<br/>\n<br/>\nI knew logically, that her hatred was not about me, but I was a kid,<br/>\nwith kid experience and it was hard to understand.<br/>\n<br/>\nThe kids you get through foster care at older ages, usually have a<br/>\nHOST of issues to deal with. You don&#39;t want that anger and hatred of<br/>\nwhat happened before your family, getting taken out on your own<br/>\nchildren. Please consider that carefully.<br/>\n<br/>\nYou owe  your birth children FIRST and foremost. If there&#39;s room in<br/>\nyour family for adoption or fostering, I think that&#39;s awesome. Just<br/>\ndon&#39;t make your own children pay the price for shit done to kids by<br/>\ncrappy parents that you don&#39;t even know.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":7527178,"authorName":"CelticFrau@aol.com","from":"CelticFrau@...","profile":"celticfrau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Foster care","postDate":"1138578898","msgId":111608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0Ni41ZmZmNmIyLjMxMGVhZmQyQGFvbC5jb20+"},"prevInTopic":111604,"nextInTopic":111611,"prevInTime":111607,"nextInTime":111609,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/29/2006 5:50:56 PM Eastern Standard Time, ... or why its important in an unschooling environment? I m curious  to hear opinions about why","messageBody":"<div id=\"ygrps-yiv-1630617211\">In a message dated 1/29/2006 5:50:56 PM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:queenjane555@...\">queenjane555@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Why do you suppose this is? I&#39;m curious how &quot;birth order&quot;  plays out, <br/>\n </span></blockquote>or why its important in an unschooling environment? I&#39;m curious  to <br/>\nhear opinions about why being &quot;the oldest&quot; or &quot;youngest&quot; matters in an  <br/>\nunschooling family that doesnt segregrate/discriminate etc by age? I  <br/>\nthink i asked this before awhile back when the subject of adoption  <br/>\ncame up, but not sure if it was really  answered.&lt;&lt;&lt;<br/>\n <br/>\nWe may like to think it does not matter and maybe we&#39;ve never discriminated  <br/>\nor segregated by age.  But being born first or last is just not something  <br/>\nthat can be changed, and I believe it DOES matter very much to the  children.  <br/>\nNot adopting or fostering children older than your own, helps  prevent <br/>\nresentment and &quot;pecking order&quot; problems.  I just think it&#39;s also  respectful of your <br/>\nbiological kids...they were there first and it&#39;s just better  to keep the order <br/>\nthat way.  I wish I could explain it more.  I think  it helped my biological <br/>\nchildren to have a little more compassion for the foster  children...sort of <br/>\nlike the the way a big brother or big sister sticks up for  their younger <br/>\nsiblings.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  (i&#39;m not talking <br/>\n </span></blockquote>about how adopting/fostering a much bigger/older kid who  might <br/>\nperpetrate on a younger kid might be a  problem.)&lt;&lt;<br/>\n <br/>\nThis is a big concern, though, and important to be realistic about.   It <br/>\nwould NEVER be worth the risk to younger children.<br/>\n <br/>\nNancy B.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Foster care","postDate":"1138576435","msgId":111604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwNThBNzc2LTc0QTMtNEM5OS1BRjBFLUEyNjQ3RTVCREI1REBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRyamdkNStjaTNhQGVHcm91cHMuY29tPg==","referencesHeader":"PGRyamdkNStjaTNhQGVHcm91cHMuY29tPg=="},"prevInTopic":111599,"nextInTopic":111608,"prevInTime":111603,"nextInTime":111605,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... Anything parents do to keep their own children from feeling their own rights and privileges is bad.  Giving your own oldest child over to the position of","messageBody":"<div id=\"ygrps-yiv-1041223403\">On Jan 29, 2006, at 3:42 PM, queenjane555 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why do you suppose this is? I&#39;m curious how &quot;birth order&quot; plays out,<br/>\n&gt; or why its important in an unschooling environment? I&#39;m curious to<br/>\n&gt; hear opinions about why being &quot;the oldest&quot; or &quot;youngest&quot; matters in an<br/>\n&gt; unschooling family that doesnt segregrate/discriminate etc by age?<br/>\n<br/>\n </span></blockquote>Anything parents do to keep their own children from feeling their own  <br/>\nrights and privileges is bad.  Giving your own oldest child over to  <br/>\nthe position of #2 in age sucks (and I know from personal experience).<br/>\n<br/>\nI&#39;m not sure the youngest would appreciate not being the baby  <br/>\nanymore, either, but having your children be bigger and stronger than  <br/>\nstranger children would be a courtesy and a safety.<br/>\n<br/>\nMy sister was sexually molested by the female cousin a year older  <br/>\nthan she was.  (She didn&#39;t tell, because my mom had a no-tattling  <br/>\npolicy.)<br/>\n<br/>\nAnd my sister went from being one of two to #4 of four.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Foster care","postDate":"1138574565","msgId":111599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRyamdkNStjaTNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRyaXQ4MitkamRzQGVHcm91cHMuY29tPg=="},"prevInTopic":111584,"nextInTopic":111604,"prevInTime":111598,"nextInTime":111600,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"... Why do you suppose this is? I m curious how birth order plays out, or why its important in an unschooling environment? I m curious to hear opinions about","messageBody":"<div id=\"ygrps-yiv-2021822813\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; If I were going to choose foster care or adoption, I would be sure to<br/>\n&gt; only get children that were younger than my own children. Messing up<br/>\n&gt; the whole birth order thing ended up being really a difficult dynamic<br/>\n&gt; in our family.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>Why do you suppose this is? I&#39;m curious how &quot;birth order&quot; plays out, <br/>\nor why its important in an unschooling environment? I&#39;m curious to <br/>\nhear opinions about why being &quot;the oldest&quot; or &quot;youngest&quot; matters in an <br/>\nunschooling family that doesnt segregrate/discriminate etc by age? I <br/>\nthink i asked this before awhile back when the subject of adoption <br/>\ncame up, but not sure if it was really answered. (i&#39;m not talking <br/>\nabout how adopting/fostering a much bigger/older kid who might <br/>\nperpetrate on a younger kid might be a problem.)<br/>\n<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":153458693,"authorName":"Barb Lundgren","from":"Barb Lundgren &lt;barb.lundgren@...&gt;","profile":"barb_lundgren","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Foster care","postDate":"1138563582","msgId":111621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwMDI3NjFFLkVENjclYmFyYi5sdW5kZ3JlbkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGRyaXQ4MitkamRzQGVHcm91cHMuY29tPg=="},"prevInTopic":111620,"nextInTopic":111659,"prevInTime":111620,"nextInTime":111622,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"Of course.  Children are not born as empty slates and do not need adults to fill them up to make them whole.  They are born with inherent intelligence,","messageBody":"<div id=\"ygrps-yiv-1110075129\">Of course.  Children are not born as &quot;empty slates&quot; and do not need adults<br/>\nto fill them up to make them whole.  They are born with inherent<br/>\nintelligence, curiosity, need to love and be loved.  When the love they<br/>\nexpress is not returned, when their intelligence is dumbed down, when their<br/>\ncuriosity is thwarted as being mischievous or wrong in some way, then they<br/>\nare insulted, slapped, punished, etc. they learn to respond accordingly.<br/>\nThe longer a child has had to adapt to such influences, the greater the<br/>\nlikelihood he has come to believe he is unworthy, stupid and unlovable.<br/>\n<br/>\nAny organism will falter under less than ideal growing situations and the<br/>\nhuman is no different.  Anger, depression, illness, inflicting pain on<br/>\noneself and others are just some of the ways a human will learn to express<br/>\nthemselves under such circumstances.<br/>\n<br/>\nSome children and some adults may be unable to recover.  Many can however,<br/>\nespecially with the influence of tender, loving people who can give them the<br/>\ncourage and freedom to express themselves in a hundred different ways and<br/>\nbegin to explore the world on their own terms.<br/>\n<br/>\nIn the world of foster care, the system of &quot;care&quot; and &quot;treatment&quot; is<br/>\nbureaucratic and cold and harsh.  Kids are expected to go to school as soon<br/>\nas they are removed from their abusive homes, even though it may be a new<br/>\nschool miles from their former neighborhood, even though they are terrified,<br/>\nhurt, angry and confused.  The system believes they need &quot;structure&quot;.  When<br/>\nkids show how they feel by acting out, rebelling, etc. they system believes<br/>\nthey should be medicated into submission.  The list is long, and these are<br/>\njust two examples. <br/>\n<br/>\nIt&#39;s people who help people, not a system.  People respond to love, they<br/>\nrespond to freedom.  There are no other substitutes, and we are all capable<br/>\nof change, rehabilitation, making a difference.<br/>\n<br/>\nBarb<br/>\n<br/>\nE-mail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a><br/>\n<br/>\n&quot;Whatever you can do, or dream you can do, begin it.  Boldness<br/>\nhas genius, power, and magic in it.&quot;   Goethe<br/>\n<br/>\n<br/>\nFrom: &quot;Ren Allen&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nDate: Sun, 29 Jan 2006 17:15:46 -0000<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: [UnschoolingDiscussion] Foster care<br/>\n<br/>\n<br/>\n&quot;I have come to see that all children are born equal: full of<br/>\nvitality, enthusiasm, curiosity, love, intelligence. It is a world of<br/>\nabuse brought on by adults in the form of parents, school teachers and<br/>\nothers that neglect and thwart the child&#39;s bright spirit that makes<br/>\none dull, mediocre, depressed, helpless.&quot;<br/>\n<br/>\nI think what Barb meant (correct me if I&#39;m wrong Barb) is that all<br/>\npeople are not born with equal amounts of the positive, nor equal<br/>\ntraits, but ALL children have those wonderful qualities and a bad<br/>\nenvironment is what squashes those positive traits.<br/>\n<br/>\nBecause I doubt she really meant that all people are born with equal<br/>\nintelligence and such.  ?? They are equal in that they are AlL born<br/>\nwith those traits.  There&#39;s always the caveat of severe brain damage<br/>\nthough, and those children aren&#39;t born with all of the positive traits<br/>\nlisted.<br/>\n<br/>\n<br/>\nOne thing about foster care, is there has often been physical damage<br/>\nor other issues at play you might not know about. My brother had FAS,<br/>\nsomething that happens in the womb and sometimes no amount of nurture<br/>\ncan overcome that.<br/>\nI think RU has the best chance for helping those children heal though.<br/>\nMy brother got the whole Ritalyn, schooling crap and whether or not<br/>\nthat&#39;s a cause, it sure was a contributing factor in his life<br/>\ntoday...which is all about prison at this point.<br/>\n<br/>\nMy other two adopted sibs had abuse issues when they came to live with<br/>\nus, they live somewhat dysfuntional lives today...sadly. One more so<br/>\nthan the other.<br/>\n<br/>\nIf I were going to choose foster care or adoption, I would be sure to<br/>\nonly get children that were younger than my own children. Messing up<br/>\nthe whole birth order thing ended up being really a difficult dynamic<br/>\nin our family.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nVisit the Unschooling website and message boards:<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt;<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":7527178,"authorName":"CelticFrau@aol.com","from":"CelticFrau@...","profile":"celticfrau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Foster care","postDate":"1138557758","msgId":111613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5LjZlZTgzNTg1LjMxMGU1ZDNlQGFvbC5jb20+"},"prevInTopic":111611,"nextInTopic":111620,"prevInTime":111612,"nextInTime":111614,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/29/2006 12:17:48 PM Eastern Standard Time, ... or other issues at play you might not know about. My brother had  FAS, something that","messageBody":"<div id=\"ygrps-yiv-1484890034\">In a message dated 1/29/2006 12:17:48 PM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;One thing about foster care, is there has often been physical  damage<br/>\n </span></blockquote>or other issues at play you might not know about. My brother had  FAS,<br/>\nsomething that happens in the womb and sometimes no amount of  nurture<br/>\ncan overcome that.<br/>\nI think RU has the best chance for helping  those children heal though.<br/>\nMy brother got the whole Ritalyn, schooling  crap and whether or not<br/>\nthat&#39;s a cause, it sure was a contributing factor  in his life<br/>\ntoday...which is all about prison at this  point.&lt;&lt;<br/>\n <br/>\nWe are foster parents, and have adopted 3 of our foster kids, and are in  the <br/>\nprocess of getting full custody of our 10 yo foster daughter.  The  first boy <br/>\nwe adopted had/has FAS and RAD.  It was a big struggle at first,  but the one <br/>\nthing that probably made the BIGGEST difference was pulling him out  of <br/>\nschool as soon as the adoption was final.  It lifted this huge weight  off of him <br/>\nand us.  He just couldn&#39;t handle the stifling environment and  needed freedom.  <br/>\nHe was always in trouble at school, it was awful.  We  know he will never be <br/>\n&quot;normal&quot; but he has come so incredibly far.  He&#39;s a  very happy, busy kid.  <br/>\nHis biggest joy is untangling things, finding things  no one else can seem to <br/>\nlocate, and &quot;fixing&quot; things.  <br/>\n <br/>\nThe other two boys had &quot;learning disabilities.&quot;  Since we took them  out of <br/>\nschool, that has changed, though one still struggles to read.  They  blossomed <br/>\nonce taken out of school.  <br/>\n <br/>\nAt this time, our two foster children are not bothered that they have to go  <br/>\nto school and the others get to stay home.  They do their homework if the  <br/>\nwant to, wear what they want to, go to sleep when they&#39;re tired, and do a good  <br/>\njob ot if.  Our oldest foster son is about to turn 18, and will go to live  <br/>\nwith family.  So soon, we won&#39;t have to live by the school&#39;s schedule, as  when <br/>\nwe get full custody, we&#39;ll be able to take her out of school.  For the  <br/>\nmeantime, she&#39;s OK with it.  She has been in horrible situations, including  almost a <br/>\nyear in hospitalization, so live in our home has been the most stable  thing <br/>\nin her life, probably since she was born.<br/>\n <br/>\nI think a radical unschooling family can be wonderful for children who&#39;ve  <br/>\nbeen in foster care.  They&#39;ve lived with so many rules, so much &quot;system&quot;  that <br/>\ngiving them a lot of freedom to make mistakes and grow from them gives them  a <br/>\nchance to have a little control over their own world, something they&#39;ve not  <br/>\nhad in the past.  They were either controlled by abuse, or neglect, or the  <br/>\nsystem.<br/>\n <br/>\nSomething else:  I&#39;ve noticed through the years, that many of these  kids <br/>\ndon&#39;t &quot;make it&quot; in strict, Christian or Fundamentalist homes.  We go  to Church <br/>\n(Mass), but our kids have a lot of freedom, they can have their own  interests, <br/>\nwatch most movies, dress the way they want.  To look at our home  you would <br/>\nnever think we&#39;re religious.  In that way, the  unschooling/relaxed lifestyle <br/>\nhas helped these kids tremendously.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;If I were going to choose foster care or adoption, I would  be sure to<br/>\n </span></blockquote>only get children that were younger than my own children.  Messing up<br/>\nthe whole birth order thing ended up being really a difficult  dynamic<br/>\nin our family.&lt;&lt;&lt;&lt;<br/>\n <br/>\nI have to second this.  I would never recommend taking in a child  older than <br/>\nyour youngest.  The only reason we had the 17 yo is because we  had known him <br/>\na long time before he was in our home, and we knew his issues were  very <br/>\nminimal, and he still has a good relationship with his father.  Still,  it was <br/>\nprobably not the best choice, and I&#39;d never do it again.  I just  wouldn&#39;t bring <br/>\na teen into my home, you just never know.  <br/>\n <br/>\nI think Sandra did have a point.  To have a child for years and years  who <br/>\nhas to go to school while the rest of the family is having a ball,  could be <br/>\ncruel.  But with us, we were always open to adoption so there was  a light at the <br/>\nend of the tunnel for our kids.  After our 10 yo girl, we  don&#39;t plan on <br/>\nadopting any more, so we are not going to foster.  Sending  children from home to <br/>\nhome is the most damaging thing foster care does to kids,  so I really suggest <br/>\nonly doing it if you&#39;re in it for the long haul.<br/>\n <br/>\nNancy B.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Foster care","postDate":"1138554946","msgId":111584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRyaXQ4MitkamRzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":111599,"prevInTime":111583,"nextInTime":111585,"topicId":111584,"numMessagesInTopic":0,"msgSnippet":"I have come to see that all children are born equal: full of vitality, enthusiasm, curiosity, love, intelligence. It is a world of abuse brought on by adults","messageBody":"<div id=\"ygrps-yiv-1152878408\">&quot;I have come to see that all children are born equal: full of<br/>\nvitality, enthusiasm, curiosity, love, intelligence. It is a world of<br/>\nabuse brought on by adults in the form of parents, school teachers and<br/>\nothers that neglect and thwart the child&#39;s bright spirit that makes<br/>\none dull, mediocre, depressed, helpless.&quot;<br/>\n<br/>\nI think what Barb meant (correct me if I&#39;m wrong Barb) is that all<br/>\npeople are not born with equal amounts of the positive, nor equal<br/>\ntraits, but ALL children have those wonderful qualities and a bad<br/>\nenvironment is what squashes those positive traits.<br/>\n<br/>\nBecause I doubt she really meant that all people are born with equal<br/>\nintelligence and such.  ?? They are equal in that they are AlL born<br/>\nwith those traits.  There&#39;s always the caveat of severe brain damage<br/>\nthough, and those children aren&#39;t born with all of the positive traits<br/>\nlisted.<br/>\n<br/>\n<br/>\nOne thing about foster care, is there has often been physical damage<br/>\nor other issues at play you might not know about. My brother had FAS,<br/>\nsomething that happens in the womb and sometimes no amount of nurture<br/>\ncan overcome that.<br/>\nI think RU has the best chance for helping those children heal though.<br/>\nMy brother got the whole Ritalyn, schooling crap and whether or not<br/>\nthat&#39;s a cause, it sure was a contributing factor in his life<br/>\ntoday...which is all about prison at this point.<br/>\n<br/>\nMy other two adopted sibs had abuse issues when they came to live with<br/>\nus, they live somewhat dysfuntional lives today...sadly. One more so<br/>\nthan the other.<br/>\n<br/>\nIf I were going to choose foster care or adoption, I would be sure to<br/>\nonly get children that were younger than my own children. Messing up<br/>\nthe whole birth order thing ended up being really a difficult dynamic<br/>\nin our family.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]}],"prevTopicId":111922,"nextTopicId":111928}}