{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":3088570,"authorName":"Holly Shaltz","from":"Holly Shaltz &lt;holly@...&gt;","profile":"hollyshaltz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bigger than Konos; not just Konos  (wasRe:Konos)","postDate":"1064837930","msgId":81739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNzgyMzJBLjVGQUE3N0E4QHNoYWx0emZhcm0uY29tPg==","referencesHeader":"PDFlMy4xMDhlNmE1YS4yY2E1Y2YxMUBhb2wuY29tPiA8M0Y3NzE3M0UuNUZGRDhBM0FAc2hhbHR6ZmFybS5jb20+IDwwMTMyMDFjMzg1ZmQkMWE0NDI3MDAkMDkwMGE4YzBAd2VzdD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":81738,"nextInTime":81740,"topicId":81739,"numMessagesInTopic":0,"msgSnippet":"While I appreciate the distinction folks are making between homeschooler and Christian and Christian homeschooler and I m VERY aware of the political","messageBody":"<div id=\"ygrps-yiv-648996461\">While I appreciate the distinction folks are making between<br/>\n&#39;homeschooler and Christian&#39; and &#39;Christian homeschooler&#39; and I&#39;m VERY<br/>\naware of the political antics of HSLDA and their ilk and don&#39;t like<br/>\nwhere it&#39;s tending, I still feel the statement made, quotation marks or<br/>\nnot, is borderline.<br/>\n<br/>\nI&#39;ve known intolerant Christians, but one of my long-time favorite<br/>\npeople considered herself a Christian Homeschooler (no quotes), was a<br/>\nmember of HSLDA, didn&#39;t believe me when I told her their alerts were<br/>\nhogwash (I said it nicely :), and definitely did school at home.  But<br/>\nshe was also one of the most tolerant &#39;fundamentalist&#39; Christians I&#39;ve<br/>\never known.  I asked her about that--although my own beliefs were not as<br/>\nwell-developed then as now, it was clear they were tending away from<br/>\nChristianity more and more--how was it she didn&#39;t feel threatened,<br/>\ndidn&#39;t feel she had to convert me?  <br/>\n<br/>\nHer answer was it was up to the Holy Spirit to convert me, not her :)<br/>\n<br/>\nPainting any group of people with the same brush does a disservice to<br/>\nall of us, not just the group.  This woman meets all the criteria of<br/>\nbeing a &quot;Christian Homeschooler&quot; and would have identified herself as<br/>\nsuch--she even stopped homeschooling a couple years later just because<br/>\nher husband wanted her to &lt;sigh&gt;  But intolerance and racism and wacky<br/>\nnon-beliefs about world history isn&#39;t a requirement to be a Christian<br/>\nhomeschooler.<br/>\n<br/>\nLet&#39;s turn the table.  What about the term &quot;radical unschooler&quot;?  I<br/>\npersonally don&#39;t like it.  My views and values are, for the most part,<br/>\nvery counter-culture (a term I like much better :)  But they don&#39;t make<br/>\nme radical--at least, not in the sense in which I use that word, of<br/>\nwanting to overturn all of the &#39;establishment&#39;.  I was shocked when I<br/>\njoined an &#39;unschooling&#39; list that insisted that anyone who unschooled in<br/>\nthe way GWS (may it rest in peace--I wish they had done ANYTHING other<br/>\nthan throw in the towel) advocated was &#39;radical&#39; unschooling.<br/>\n<br/>\nMaybe it&#39;s just I don&#39;t have a great take on the word &#39;radical&#39;.  Maybe<br/>\nit&#39;s just the way I don&#39;t care for labels of any kind, anywhere.  But I<br/>\nwould no more call a group of people radical unschoolers than I would<br/>\ncall a group fundamentalist Christian or a group Christian<br/>\nhomeschoolers.<br/>\n<br/>\nLabels are a lot of what we leave school to escape.  They may be a<br/>\nshorthand way to talk--as in grouping kids who don&#39;t learn well in<br/>\nclassroom situations as ADHD--but they make a new reality every time<br/>\nthey&#39;re used.  Just as most of the women on this list would probably<br/>\nprefer that either female pronouns be used in non-specific writing, or<br/>\nthat constructions like his/her be used, because we KNOW that using male<br/>\npronouns almost exclusively creates a worldview which maintains the<br/>\nimportance of the male over the female.<br/>\n<br/>\nIs it the same?  I think so.  Labels are made to pigeon-hole people, to<br/>\navoid our having to see the individuality that lies beneath the facade. <br/>\nFirst we pigeon-hole, then we dehumanize, then we deprive rights,<br/>\nthen.....well, how did the Nazis end up able to slaughter so many<br/>\npeople?<br/>\n<br/>\nFundamentalist Christian homeschoolers are people, too, working within<br/>\ntheir own sets of values and worldviews.  If we label and avoid, we<br/>\ncontribute to the adversarial relationship that exists.  The greater the<br/>\ndivide, the more the folk that really ascribe to the stereotype will be<br/>\nthreatened and feel the need to control us &#39;radical unschoolers&#39;.  Is<br/>\nthis the road we want to take?<br/>\n<br/>\nI personally prefer to bring people together rather than divide or<br/>\nmaintain divisions.  Maybe it&#39;s a legacy of the years of military<br/>\nliving, in which folks of all different beliefs, income levels,<br/>\neducational backgrouns, races, religions, even countries of origin<br/>\nmanage to work together, respecting each other.  I dunno, but it&#39;s<br/>\nimportant to me to not label others.  &quot;It&#39;s the beginning of a very<br/>\nslippery slope.&quot;<br/>\n<br/>\nHolly</div>","specialLinks":[]}],"prevTopicId":81388,"nextTopicId":81530}}