{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":30,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Watching Family Guy","postDate":"1340393889","msgId":67847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzMmhqMStvYWdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpzMG8xdSsxc2FqQGVHcm91cHMuY29tPg=="},"prevInTopic":67814,"nextInTopic":0,"prevInTime":67846,"nextInTime":67848,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"... *************** If he likes the style of animation and the goofiness, he might like Futurama. It s not without sexual innuendo, but the other silliness is","messageBody":"<div id=\"ygrps-yiv-970339737\">&quot;athenagwis2&quot; &lt;athenagwis@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;he said he didn&#39;t really like Family Guy.  I asked why and he said it had too much about sex.  He said it was all about sex, sex, sex.  The first episodes were funny when Stewie was trying to take over the world, but then it was too much sex.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIf he likes the style of animation and the goofiness, he might like Futurama. It&#39;s not without sexual innuendo, but the other silliness is far more prevalant.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340368599","msgId":67812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDAzNjg1OTkuMzgwMDMuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDI3OTlEODlCLTdCOUQtNDhFNy04MjIzLTUwQjJGNTQxRUY5QkBtYWMuY29tPg==","referencesHeader":"PGpzMGRraSsxOTMyQGVHcm91cHMuY29tPiA8Mjc5OUQ4OUItN0I5RC00OEU3LTgyMjMtNTBCMkY1NDFFRjlCQG1hYy5jb20+"},"prevInTopic":67809,"nextInTopic":67814,"prevInTime":67811,"nextInTime":67813,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"- she s fascinated with all the different dog owners and their homes, not so interested in dog training!  ;) Them she may like the HGTV show House Hunters","messageBody":"<div id=\"ygrps-yiv-2056114901\">&quot;- she&#39;s fascinated with all the different dog owners and their homes, not so interested in dog training!  ;)&quot;<br/>\n<br/>\n<br/>\n<br/>\nThem she may like the HGTV show House Hunters and House Hunters International. I too love to see the homes in different places!<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340358851","msgId":67814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDNkUwOTlBLTQ2RTctNEFERS05RkEzLTVBRkMyREQxQTc5NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDI3OTlEODlCLTdCOUQtNDhFNy04MjIzLTUwQjJGNTQxRUY5QkBtYWMuY29tPg==","referencesHeader":"PGpzMGRraSsxOTMyQGVHcm91cHMuY29tPiA8Mjc5OUQ4OUItN0I5RC00OEU3LTgyMjMtNTBCMkY1NDFFRjlCQG1hYy5jb20+"},"prevInTopic":67812,"nextInTopic":67847,"prevInTime":67813,"nextInTime":67815,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"-=- I ve copied and pasted the recommendations into my notebook … I hope that s O.K.-=- I can t imagine why it wouldn t be. ;-) Keep the discussion to ideas","messageBody":"<div id=\"ygrps-yiv-1822761764\">-=- I&#39;ve copied and pasted the recommendations into my notebook … I hope that&#39;s O.K.-=-<br/>\n<br/>\nI can&#39;t imagine why it wouldn&#39;t be. ;-)<br/>\n<br/>\nKeep the discussion to ideas and not social chit-chat, whenever possible.  Asking even a small percentage of 3682 people whether something is okay with them is probably not the best use of a discussion group. :-)<br/>\n<br/>\n<br/>\n-=- Avatar: The Last Airbender and the following 2 series were just about on the cusp of what they felt they could handle scary wise.   We had a lot of switching off in the middle, and then turning it back on a day or so later ;)<br/>\n-=-<br/>\n<br/>\nTry muting. Sometimes the tension is held by the music.<br/>\nAlso try offering food during a scary part, or touching a child in a casual, comforting way (hand on the back, or lean gently against).  Not in a grabbing-out-of-fear way or an &quot;I-will-hold-your-hand-for-the-scary-part&quot; way. :-)<br/>\n<br/>\n-=-We&#39;ve recently watched War Horse, which I can tentatively recommend, although actually I haven&#39;t seen the ending because my youngest daughter wanted to stop watching and so I went upstairs with her to keep her company.   I thought war was portrayed well in it. -=-<br/>\n<br/>\nI don&#39;t plan to watch that myself.  Just knowing the outline of the story, I know it would be too sad for me.<br/>\nPortrayals of war don&#39;t appeal to me at all, and so whether it&#39;s done well or badly, I wouldn&#39;t personally invite it into my house.  I wouldn&#39;t keep my kids from watching it if they wanted to, though. <br/>\n<br/>\nA young-adult male friend babysat Kirby and Marty when they were 9 and 12 or so, and they all watched a movie (I think was) called &quot;Soldier,&quot; and they were all traumatized when I got back, including the babysitter who chose it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":343381924,"authorName":"Lucy&#39;s web","from":"Lucy&#39;s web &lt;lucy.web@...&gt;","profile":"lucylists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340349115","msgId":67804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3OTlEODlCLTdCOUQtNDhFNy04MjIzLTUwQjJGNTQxRUY5QkBtYWMuY29tPg==","inReplyToHeader":"PGpzMGRraSsxOTMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzMGRraSsxOTMyQGVHcm91cHMuY29tPg=="},"prevInTopic":67795,"nextInTopic":67809,"prevInTime":67803,"nextInTime":67805,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"There s loads of great recommendations for stuff to watch in this thread - thanks so much.  I ve copied and pasted the recommendations into my notebook … I","messageBody":"<div id=\"ygrps-yiv-1922598484\">There&#39;s loads of great recommendations for stuff to watch in this thread - thanks so much.  I&#39;ve copied and pasted the recommendations into my notebook … I hope that&#39;s O.K.<br/>\n<br/>\nThere are several things that we have already (e.g. Primeval and Dr Who) because my husband and I are somewhat obsessive collectors of dvd series!  ;)   <br/>\n<br/>\nI can&#39;t wait til my girls are old enough for Battlestar Galactica (the remake) - in my opinion there&#39;s some absolutely brilliant themes in that series to discuss, for older kids: politics, religion, ethics, morals. :)   At the moment my girls don&#39;t like anything too scary or violent.     Avatar: The Last Airbender and the following 2 series were just about on the cusp of what they felt they could handle scary wise.   We had a lot of switching off in the middle, and then turning it back on a day or so later ;)<br/>\n<br/>\nWe&#39;ve recently watched War Horse, which I can tentatively recommend, although actually I haven&#39;t seen the ending because my youngest daughter wanted to stop watching and so I went upstairs with her to keep her company.   I thought war was portrayed well in it.   They gave a sense of the scale of devastation (lots of dead horses and soldiers strewn across the battlefield) but without blood and gore.   There were two boys who were shot for desertion which led to some good discussions with my girls about the rights and wrongs of this.  Again, that was shown in a way that was just desperately sad, rather than violent or bloody.    The point at which my youngest (9) wanted to stop watching was when they shot exhausted horses pulling heavy artillery.   <br/>\n<br/>\nUnfortunately Netflix and Hulu aren&#39;t available in France, so I will stick with the dvds and You Tube for now.   We have a large projector screen, hooked up to a dvd player - so dvds are really the best way for us to view stuff as a family.   My girls like to watch solo on you tube or slip a dvd in their iMacs if its something only they are interested in.   At the moment my older daughter is making her way through Cesar Milan&#39;s Dog Whisperer series - she&#39;s fascinated with all the different dog owners and their homes, not so interested in dog training!  ;)<br/>\n<br/>\nThanks again<br/>\n<br/>\nLucy</div>","specialLinks":[]},{"userId":331638196,"authorName":"athenagwis2","from":"&quot;athenagwis2&quot; &lt;athenagwis@...&gt;","profile":"athenagwis2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Watching Family Guy","postDate":"1340334974","msgId":67809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzMG8xdSsxc2FqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg=="},"prevInTopic":67804,"nextInTopic":67812,"prevInTime":67808,"nextInTime":67810,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"I know that follow up is not necessary for this list, but since I saw such a quick result, I thought I would share for anyone reading this post later on down","messageBody":"<div id=\"ygrps-yiv-1612792182\">I know that follow up is not necessary for this list, but since I saw such a quick result, I thought I would share for anyone reading this post later on down the road.  <br/>\n<br/>\nUltimately the next time my son asked if he could watch Family Guy, I said yes and he proceeded to watch episode after episode starting with the first season.  After 12 or so episodes, he came to me and asked if he could watch American Dad.  I said yes to this right away (with no reservations like I had for Family Guy, I didn&#39;t want this show to become special too).  Since then my son has been watching every episode of American Dad (a show that does have some sex stuff, but not as vulgar as Family Guy).  I came down today and commented on how he seemed to be watching more American Dad than Family Guy and he said he didn&#39;t really like Family Guy.  I asked why and he said it had too much about sex.  He said it was all about sex, sex, sex.  The first episodes were funny when Stewie was trying to take over the world, but then it was too much sex.  He said American Dad had some sex stuff, but they didn&#39;t show as much, the camera moved away more than in Family Guy.<br/>\n<br/>\nSomeday he might come back to Family Guy, but our talk today shows me that I was way more worried than I needed to be.  He was able to decide on his own that he didn&#39;t enjoy this show, and my preventing him from watching made it way more special than it needed to be. <br/>\n<br/>\nI want to thank everyone for the great, honest advice that allowed me to see my own roadblock.  This bit of learning that I went through will help me make better choices in the future as well.<br/>\n<br/>\nRachel</div>","specialLinks":[]},{"userId":247112349,"authorName":"michelle_m29","from":"&quot;michelle_m29&quot; &lt;mmarr@...&gt;","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Watching Family Guy","postDate":"1340324306","msgId":67795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzMGRraSsxOTMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ1MDZEODJFLUQxNzQtNDdGMC04NEIwLUIyNzM1NDFENDlGNUB2ZXJpem9uLm5ldD4="},"prevInTopic":67789,"nextInTopic":67804,"prevInTime":67794,"nextInTime":67796,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"My 12 year old has been streaming Warehouse 13 on Netflix. There are lots and lots of historical and cultural references to explore (or not) later, which he","messageBody":"<div id=\"ygrps-yiv-427783809\">My 12 year old has been streaming Warehouse 13 on Netflix. There are lots and lots of historical and cultural references to explore (or not) later, which he seems to enjoy. (It does have some dark, potentially scary moments, but none of my kids seems to notice.) <br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":111495799,"authorName":"mightylittledude","from":"&quot;mightylittledude&quot; &lt;corneliablik@...&gt;","profile":"mightylittledude","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Watching Family Guy","postDate":"1340311002","msgId":67789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzMDBrcSsyMHY2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ1MDZEODJFLUQxNzQtNDdGMC04NEIwLUIyNzM1NDFENDlGNUB2ZXJpem9uLm5ldD4="},"prevInTopic":67775,"nextInTopic":67795,"prevInTime":67788,"nextInTime":67790,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"My question was open to the list, sorry for the confusion. To be honest, I wasn t exactly sure why I asked, just that I was interested in digging around and","messageBody":"<div id=\"ygrps-yiv-315115400\">My question was open to the list, sorry for the confusion.<br/>\n<br/>\nTo be honest, I wasn&#39;t exactly sure why I asked, just that I was interested in digging around and hearing what turned up.<br/>\nI sometimes ask questions without knowing exactly why, but wanting to gather more information about a topic. Sometimes I filter the information away, and keep it for another time. It&#39;s not always relevant to me or my family at that moment, but even that knowledge is useful. That&#39;s why I read several unschooling lists, and don&#39;t post often: I find it very helpful to read about other people&#39;s responses and experiences and ideas. There are lots of details which give me ideas and thoughts. <br/>\n<br/>\nIt was helpful to read about your son Kris, knowing that he didn&#39;t want to watch &#39;Weeping Angels&#39;. I learn by these little vignettes from other people&#39;s lives. They fill in a few holes in my parenting - not with direct rules or answers, but with ideas, suggestions and alternatives. I take this information and let it percolate, adding what I know and learn about my family and myself.  I am wondering how choosing that a tv show looks too creepy *looks*, and whether or not I learn the details, it gives me a lot of very helpful imagery of how one individual (seeming) confident and secure child made these decisions. Of course it doesn&#39;t take the place of my relationship with my children, but it is still helpful. I store it alongside other voices I have acquired along the way which are not so helpful, too.<br/>\n<br/>\nAlso, just because I find something really scary or unpleasant doesn&#39;t mean everyone does, so I was interested in hearing how other people reacted, especially kids. It helps me to analyze my responses somewhat too (what bothers me and why). This helps me figure out how to help my children figure out what they may like/dislike. Of course, I&#39;m not going to base my life around what other people like or don&#39;t, but it&#39;s still helpful.  I have never enjoyed Tarantino films, personally. Supernatural stuff (Dr Who, Buffy) I really enjoy, though my dad hates them too, because they are too violent, creepy and deathly for him. But how refreshing to me, that someone can see a film like Kill Bill like cartoon violence (because it seems so unreal). <br/>\n<br/>\nI learn in a rather non-linear and spider-web way. The kids-in-mind site looks very useful indeed. I&#39;m glad to have found that out.<br/>\nCornelia </div>","specialLinks":[]},{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Watching Family Guy","postDate":"1340285402","msgId":67775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDAyODU0MDIuMjg4NzEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxMjE3MDUubWFpbC5uZTEueWFob28uY29tPg==","inReplyToHeader":"PGpydTZlYyt2MG1yQGVHcm91cHMuY29tPg=="},"prevInTopic":67771,"nextInTopic":67789,"prevInTime":67774,"nextInTime":67776,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"We watch as a family usually (the new show), although my youngest sometimes doesn t (especially the episodes with the weeping angels). My older son and husband","messageBody":"<div id=\"ygrps-yiv-1861420485\">We watch as a family usually (the new show), although my youngest sometimes doesn&#39;t (especially the episodes with the weeping angels). My older son and husband are not into the older Who (the lousy special effects bother them) but it is more kid friendly. Luke and I like it. Usually, though, we watch the newer Dr. Who, and Luke opts out of the ones that &quot;look too creepy&quot;. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 6/21/12, mightylittledude &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:corneliablik@...\">corneliablik@...</a>&gt; wrote:<br/>\n<br/>\nFrom: mightylittledude &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:corneliablik@...\">corneliablik@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Re: Watching Family Guy<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Thursday, June 21, 2012, 12:03 AM<br/>\n<br/>\nThanks for the list!<br/>\nJust wondering, do you watch the *new* Dr Who? My husband and I watch and love it (though got a bit gutted when David Tennant left) - but it has seriously been totally terrifying at times. It&#39;s the best thing I&#39;ve seen for years (since the old days of Buffy and The Simpsons) but its scared me to bits. Do you watch it as a family, or are you talking about the Tom Baker years? <br/>\nCornelia<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340281323","msgId":67771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1MDZEODJFLUQxNzQtNDdGMC04NEIwLUIyNzM1NDFENDlGNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpydTZlYyt2MG1yQGVHcm91cHMuY29tPg==","referencesHeader":"PGpydTZlYyt2MG1yQGVHcm91cHMuY29tPg=="},"prevInTopic":67765,"nextInTopic":67775,"prevInTime":67770,"nextInTime":67772,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"... Who are you asking? One person? The whole list? Does it matter for unschooling what one family watches? Does it matter, if we were to take a poll, what the","messageBody":"<div id=\"ygrps-yiv-1651910448\">On Jun 21, 2012, at 12:03 AM, mightylittledude wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Just wondering, do you watch the *new* Dr Who?<br/>\n<br/>\n </span></blockquote>Who are you asking? One person? The whole list? Does it matter for unschooling what one family watches? Does it matter, if we were to take a poll, what the majority watches?<br/>\n<br/>\nWhat matters for unschooling in your family is how sensitive you are to what *your* kids want to see and not see. Different kids, different *people* will be terrified of or love different things. <br/>\n<br/>\nMeredith said her daughter was perfectly fine with the level of violence in Kill Bill. (Which, if you haven&#39;t seen it, is a lot. Though I agree that somehow it feels like a cartoon and less real.) But couldn&#39;t stand to watch parents shouting at their kids.<br/>\n<br/>\nMy daughter was fine with the violence of Buffy and Xena. But didn&#39;t like moving skeletons.<br/>\n<br/>\nAt least for movies you can become better informed to pass information onto your kids to help them find what they like and avoid what they don&#39;t like. And allow them to choose whether to test their boundaries. The Kids In Mind site breaks down movies scene by scene noting what might bother a child (or parent).<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kids-in-mind.com/\">http://www.kids-in-mind.com/</a><br/>\n<br/>\nThe following applies to shows as well as everything kids (people really) explore. (Which is what&#39;s great about a set of principles. :-) Kids can&#39;t know what they like and don&#39;t like until they see it. And they do want to see more of the world. Kids want to trust that their parents will expand their worlds based on what the child has liked in the past and, also by the parent tapping into their greater knowledge of the world, to connect them with what they might enjoy.<br/>\n<br/>\nAnd each time the kids find something the like or don&#39;t like, they learn more about themselves, about their comfort zone and discomfort zone, about what&#39;s right for them and what&#39;s wrong for them. What kids (people) want *isn&#39;t* a protector. What kids (people) want is a partner with greater information and skills who is willing to use those to help the child get what they like and avoid what they don&#39;t like with the understanding that both are constantly in flux. What kids (people) don&#39;t want is someone to use their greater information and skills to erect a cage around them. What kids *don&#39;t* want is  protection from what bothers the parent or what the parent doesn&#39;t want them to see.<br/>\n<br/>\nWhat kids (people) want is information so they can make more informed choices. Not &quot;the right&quot; choices. Information so they can have a better (not perfect) understanding of the how far into their discomfort zone they&#39;ll be in order to explore something that looks intriguing. What kids (people) want is support in their choice to tackle or avoid it. What kids (people) want is to trust that someone&#39;s (emotional and informational) support will be used to help them tackle any difficulties they encounter and to support them if they decide to bail.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you watch it as a family, or are you talking about the Tom Baker years? <br/>\n<br/>\n </span></blockquote>What&#39;s right for supporting your kids in exploring the parts of the world that intrigues them depends on what your kids want and need.<br/>\n<br/>\nWatching together creates a common bond of experience.<br/>\n<br/>\nWatching together means you&#39;re there to answer questions, converse, give them strategies of how to watch when they want to explore the edges of their discomfort zone (fast forwarding, watching during the day, turning it off until some future point, etc.)<br/>\n<br/>\nUse your own knowledge of the program and of your kids understanding of the world to decide whether they need you right there or whether the issues that come up are easy enough for them to mull over or bring questions to you.<br/>\n<br/>\nThe more you watch with them, the more trust you build that your goal is to support their explorations. And then you earn some free passes to say &quot;That&#39;s not my favorite.&quot; Then rather than always watching them play a video game or repeats of the same episode, you gather enough awareness of the show (or game) to listen and ask interested questions and understand what they&#39;re excited or irritated about.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":111495799,"authorName":"mightylittledude","from":"&quot;mightylittledude&quot; &lt;corneliablik@...&gt;","profile":"mightylittledude","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Watching Family Guy","postDate":"1340251404","msgId":67765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpydTZlYyt2MG1yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNDAyMzU0NTMuMTQwNjQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxMjE3MDUubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":67764,"nextInTopic":67771,"prevInTime":67764,"nextInTime":67766,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"Thanks for the list! Just wondering, do you watch the *new* Dr Who? My husband and I watch and love it (though got a bit gutted when David Tennant left) - but","messageBody":"<div id=\"ygrps-yiv-2023243667\">Thanks for the list!<br/>\nJust wondering, do you watch the *new* Dr Who? My husband and I watch and love it (though got a bit gutted when David Tennant left) - but it has seriously been totally terrifying at times. It&#39;s the best thing I&#39;ve seen for years (since the old days of Buffy and The Simpsons) but its scared me to bits. Do you watch it as a family, or are you talking about the Tom Baker years? <br/>\nCornelia</div>","specialLinks":[]},{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340241750","msgId":67764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDAyNDE3NTAuNzc1NTkuWWFob29NYWlsQ2xhc3NpY0B3ZWIxMjE3MDIubWFpbC5uZTEueWFob28uY29tPg==","inReplyToHeader":"PDEzNDAyMzU0NTMuMTQwNjQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxMjE3MDUubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":67756,"nextInTopic":67765,"prevInTime":67763,"nextInTime":67765,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"TV Shows we ve liked include Doctor WhoPrimeval... There should be a comma between Doctor Who and Primeval. If that seems unclear, you can add this","messageBody":"<div id=\"ygrps-yiv-1022455312\">&quot;TV Shows we&#39;ve liked include Doctor WhoPrimeval...&quot;<br/>\nThere should be a comma between Doctor Who and Primeval. If that seems unclear, you can add this clarifying post. They are both great streamable shows. <br/>\nWe also enjoyed watching Survivorman and Man Vs. Wild with my son.<br/>\n-Kris <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340235453","msgId":67756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDAyMzU0NTMuMTQwNjQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxMjE3MDUubWFpbC5uZTEueWFob28uY29tPg==","inReplyToHeader":"PEFEQ0UzMTg4LTRCM0MtNDcwQS04RTg0LTMzNTkwQjNBQzIxNkB2ZXJpem9uLm5ldD4="},"prevInTopic":67738,"nextInTopic":67764,"prevInTime":67755,"nextInTime":67757,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"Galaxy Quest and Robin Hood: Men in Tights are favorites of everyone in our family. Baby s Day Out is another favorite movie. TV Shows we ve liked","messageBody":"<div id=\"ygrps-yiv-1473702730\">Galaxy Quest and Robin Hood: Men in Tights are favorites of everyone in our family. Baby&#39;s Day Out is another favorite movie.<br/>\nTV Shows we&#39;ve liked include Doctor WhoPrimeval (though my son lost interest)Firefly (some violence and sexual innuendo, but we ALL loved it). Serenity (movie that follows Firefly) again, some violence and innuendo, but everyone in my family (ages 9 to 44) LOVE it. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 6/20/12, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nSubject: Re: [AlwaysLearning] Watching Family Guy<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Wednesday, June 20, 2012, 7:33 AM<br/>\n<br/>\n<br/>\nOn Jun 20, 2012, at 2:54 AM, Lucy&#39;s web wrote:<br/>\n<br/>\n&gt; Don&#39;t all gasp at once, but we don&#39;t have a TV<br/>\n<br/>\nSpeaking in general terms, no family will have everything. That&#39;s not a problem for unschooling. The world is so full of things that no one can explore it all.<br/>\n<br/>\nWhat does hamper kids exploring, learning and discovering what&#39;s right and wrong for them, is fearing or disliking something the kids enjoy and then limiting their access.<br/>\n<br/>\n&gt; I would love any recommendations for series or films that are enjoyable to watch as a family.<br/>\n<br/>\nAvatar: The Legend of Korra (sequel to The Last Airbender, should be on Fox&#39;s website)<br/>\nThe Real Adventures of Jonny Quest<br/>\nJonny Quest (the original from the &#39;60s)<br/>\n<br/>\nStar Trek<br/>\nStar Trek: The Next Generation<br/>\nStar Trek: Voyager<br/>\nStar Trek: The Animated Series<br/>\nStar Trek: Deep Space Nine (this one was darker, more complex plots so tends to be Trekkie&#39;s favorite or least favorite.)<br/>\nStargate SG-1<br/>\nStargate Atlantis (Stargate Universe was dark and depressing)<br/>\nSamurai Jack<br/>\nDexter&#39;s Laboratory<br/>\nHercules<br/>\nXena (though it got darker later in its run)<br/>\nKeen Eddie<br/>\nDoctor Who (you can start with any doctor)<br/>\nEureka<br/>\n<br/>\nMy Neighbor Totoro<br/>\nKiki&#39;s Delivery Service<br/>\nPrincess Mononoke<br/>\nSpirited Away<br/>\nHowl&#39;s Moving Castle<br/>\nPonyo<br/>\nLupin the 3rd: The Castle of Cagliostro<br/>\n<br/>\nThese all have violence so depends on your kids:<br/>\n<br/>\nSamurai Champloo<br/>\nFullmetal Alchemist<br/>\nFullmetal Alchemist: Brotherhood<br/>\n(The episodes of the first caught up with the comic at some point. The author trusted the producers enough to let them continue the story as they imagined it was going. The second, made after the comic was done, follows the story of the comic. So they start out the same but go in two different directions.)<br/>\nCowboy Bebop (may be a bit talky for younger kids but it&#39;s the best anime series of all time.)<br/>\nEscaflowne (though not the movie)<br/>\nRouroni Kenshin<br/>\n<br/>\n<br/>\nStar Trek: The Movie (aka Star Trek reboot, Star Trek 11)<br/>\nStar Trek (the odd numbered ones are the best ;-)<br/>\nMy Big Fat Greek Wedding<br/>\nBabe<br/>\nThe Sting<br/>\nThe Italian Job (2003)<br/>\nStar Wars<br/>\nHarry Potter<br/>\nGalaxy Quest<br/>\nLegally Blonde 1&2<br/>\nCharlie&#39;s Angels 1&2<br/>\nSpider-man 1&2<br/>\nIron Man 1&2<br/>\nIron Giant<br/>\nThe Princess Bride<br/>\nBack to the Future 1,2&3<br/>\nEver After: A Cinderella Story<br/>\nWhale Rider<br/>\nThe Incredibles<br/>\nRaiders of the Lots Ark 1&3<br/>\nFerris Bueller&#39;s Day Off<br/>\nWallace and Gromit series<br/>\nMonty Python and the Holy Grail<br/>\nSecret of NIMH<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340216648","msgId":67738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDAyMTY2NDguMzU5NjcuWWFob29NYWlsTmVvQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEFEQ0UzMTg4LTRCM0MtNDcwQS04RTg0LTMzNTkwQjNBQzIxNkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGpycjB0cSs0YTNhQGVHcm91cHMuY29tPiA8RDQyNkU5MDktQUUwNC00RUU2LUJFRkUtMkNBMEM0NDRCOTU2QG1hYy5jb20+IDxBRENFMzE4OC00QjNDLTQ3MEEtOEU4NC0zMzU5MEIzQUMyMTZAdmVyaXpvbi5uZXQ+"},"prevInTopic":67730,"nextInTopic":67756,"prevInTime":67737,"nextInTime":67739,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"To add to the awesome list: Dragon ball Z and all Dragon ball series! My little pony friendship is Magic ( big with boys too!-now called brownies!) Deltora","messageBody":"<div id=\"ygrps-yiv-1708609761\">To add to the awesome list:<br/>\n<br/>\nDragon ball Z and all Dragon ball series!<br/>\n<br/>\nMy little pony friendship is Magic ( big with boys too!-now called brownies!)<br/>\n<br/>\nDeltora Quest ( and the book series is awesome - I read them all for the kids and myself)<br/>\n<br/>\nSpice and Wolf<br/>\n<br/>\nAngel Beats<br/>\n<br/>\nSailor Moon<br/>\n<br/>\n Sponge Bob ( yes I love Sponge Bob!)<br/>\n<br/>\n Adventure Time <br/>\n<br/>\nRegular Show<br/>\n<br/>\nPheneas and Ferb<br/>\n<br/>\nFuturama ( my son&#39;s favorite)<br/>\n<br/>\nI am sure others may have more to add!<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Wednesday, June 20, 2012 6:33 AM<br/>\nSubject: Re: [AlwaysLearning] Watching Family Guy<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 20, 2012, at 2:54 AM, Lucy&#39;s web wrote:<br/>\n<br/>\n&gt; Don&#39;t all gasp at once, but we don&#39;t have a TV<br/>\n<br/>\nSpeaking in general terms, no family will have everything. That&#39;s not a problem for unschooling. The world is so full of things that no one can explore it all.<br/>\n<br/>\nWhat does hamper kids exploring, learning and discovering what&#39;s right and wrong for them, is fearing or disliking something the kids enjoy and then limiting their access.<br/>\n<br/>\n&gt; I would love any recommendations for series or films that are enjoyable to watch as a family.<br/>\n<br/>\nAvatar: The Legend of Korra (sequel to The Last Airbender, should be on Fox&#39;s website)<br/>\nThe Real Adventures of Jonny Quest<br/>\nJonny Quest (the original from the &#39;60s)<br/>\n<br/>\nStar Trek<br/>\nStar Trek: The Next Generation<br/>\nStar Trek: Voyager<br/>\nStar Trek: The Animated Series<br/>\nStar Trek: Deep Space Nine (this one was darker, more complex plots so tends to be Trekkie&#39;s favorite or least favorite.)<br/>\nStargate SG-1<br/>\nStargate Atlantis (Stargate Universe was dark and depressing)<br/>\nSamurai Jack<br/>\nDexter&#39;s Laboratory<br/>\nHercules<br/>\nXena (though it got darker later in its run)<br/>\nKeen Eddie<br/>\nDoctor Who (you can start with any doctor)<br/>\nEureka<br/>\n<br/>\nMy Neighbor Totoro<br/>\nKiki&#39;s Delivery Service<br/>\nPrincess Mononoke<br/>\nSpirited Away<br/>\nHowl&#39;s Moving Castle<br/>\nPonyo<br/>\nLupin the 3rd: The Castle of Cagliostro<br/>\n<br/>\nThese all have violence so depends on your kids:<br/>\n<br/>\nSamurai Champloo<br/>\nFullmetal Alchemist<br/>\nFullmetal Alchemist: Brotherhood<br/>\n(The episodes of the first caught up with the comic at some point. The author trusted the producers enough to let them continue the story as they imagined it was going. The second, made after the comic was done, follows the story of the comic. So they start out the same but go in two different directions.)<br/>\nCowboy Bebop (may be a bit talky for younger kids but it&#39;s the best anime series of all time.)<br/>\nEscaflowne (though not the movie)<br/>\nRouroni Kenshin<br/>\n<br/>\nStar Trek: The Movie (aka Star Trek reboot, Star Trek 11)<br/>\nStar Trek (the odd numbered ones are the best ;-)<br/>\nMy Big Fat Greek Wedding<br/>\nBabe<br/>\nThe Sting<br/>\nThe Italian Job (2003)<br/>\nStar Wars<br/>\nHarry Potter<br/>\nGalaxy Quest<br/>\nLegally Blonde 1&2<br/>\nCharlie&#39;s Angels 1&2<br/>\nSpider-man 1&2<br/>\nIron Man 1&2<br/>\nIron Giant<br/>\nThe Princess Bride<br/>\nBack to the Future 1,2&3<br/>\nEver After: A Cinderella Story<br/>\nWhale Rider<br/>\nThe Incredibles<br/>\nRaiders of the Lots Ark 1&3<br/>\nFerris Bueller&#39;s Day Off<br/>\nWallace and Gromit series<br/>\nMonty Python and the Holy Grail<br/>\nSecret of NIMH<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340212792","msgId":67730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5NUVEQzUzLTZBMzQtNERFOC1CMkQzLTZGQTUyMUY5QUU4RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTHA1eTRnZS1uLV90SEs2Z0NKU0Z5VE1qMVJtZGVDRENhdlI0UUp2dnJPTmZaPUZHQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTHA1eTRnZS1uLV90SEs2Z0NKU0Z5VE1qMVJtZGVDRENhdlI0UUp2dnJPTmZaPUZHQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67725,"nextInTopic":67738,"prevInTime":67729,"nextInTime":67731,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"-=-You can watch Netflix on any computer.-=- With a Roku box you can watch them on just nearly any TV, too. [Non-text portions of this message have been","messageBody":"<div id=\"ygrps-yiv-950503744\">-=-You can watch Netflix on any computer.-=-<br/>\n<br/>\nWith a Roku box you can watch them on just nearly any TV, too.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Other shows to watch together...was.. Watching Family Guy","postDate":"1340202778","msgId":67725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyc211cStqaTliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ0MjZFOTA5LUFFMDQtNEVFNi1CRUZFLTJDQTBDNDQ0Qjk1NkBtYWMuY29tPg=="},"prevInTopic":67724,"nextInTopic":67730,"prevInTime":67724,"nextInTime":67726,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"We don t have a working TV either, although we often run Netflix through the Wii to watch on the larger screen. To add to Joyce and Meredith s list: Merlin","messageBody":"<div id=\"ygrps-yiv-233674755\">We don&#39;t have a working TV either, although we often run Netflix through the Wii to watch on the larger screen.<br/>\n<br/>\nTo add to Joyce and Meredith&#39;s list:<br/>\n<br/>\nMerlin (the BBC series)<br/>\nPrimeval (also BBC) some scary dinosaurs and futuristic monsters. Set in modern-day London, time-space anomalies bring guests from the past/future<br/>\n<br/>\nMore anime:<br/>\nThe woman (yes, woman!!!) who did Fullmetal Alchamist, Hiromu Arakawa, has another show called &quot;Hero Tales,&quot; which is good and goes well with Avatar.<br/>\n<br/>\nNoein (about quantum physics/alternative world theory--a few scary bits)<br/>\n<br/>\nGurren Lagan<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340196533","msgId":67724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExQjZBNjlCLTY1OEMtNEVFNi1BM0RBLUNFMDA1M0RGREQ4NUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBTHA1eTRnZS1uLV90SEs2Z0NKU0Z5VE1qMVJtZGVDRENhdlI0UUp2dnJPTmZaPUZHQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTHA1eTRnZS1uLV90SEs2Z0NKU0Z5VE1qMVJtZGVDRENhdlI0UUp2dnJPTmZaPUZHQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67722,"nextInTopic":67725,"prevInTime":67723,"nextInTime":67725,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"... Actually $8 for just streaming. $8 for 1 DVD at a time. $16 for both. (Then various other plans for more DVDs at a time.) Joyce [Non-text portions of this","messageBody":"<div id=\"ygrps-yiv-1108192074\">On Jun 20, 2012, at 7:26 AM, Rachel wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Netflix streaming can be bought for about $15/mo.<br/>\n<br/>\n </span></blockquote>Actually $8 for just streaming. $8 for 1 DVD at a time. $16 for both. (Then various other plans for more DVDs at a time.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Watching Family Guy","postDate":"1340193285","msgId":67721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyc2RtNStpNXJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ0MjZFOTA5LUFFMDQtNEVFNi1CRUZFLTJDQTBDNDQ0Qjk1NkBtYWMuY29tPg=="},"prevInTopic":67720,"nextInTopic":67722,"prevInTime":67720,"nextInTime":67722,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"... *************** It depends on what you mean. The sexiness of sex and innuendo goes over their heads, but some kids will ask what does that mean? when","messageBody":"<div id=\"ygrps-yiv-647416432\">Lucy&#39;s web &lt;lucy.web@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;if a child doesn&#39;t have &quot;sex education&quot; enforced upon them, then they will only start noticing and asking questions about such things when their minds are mature enough to process that kind of information<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt depends on what you mean. The sexiness of sex and innuendo goes over their heads, but some kids will ask &quot;what does that mean?&quot; when they hear things which don&#39;t make sense, or &quot;what are they doing?&quot; if they see something out of their experience - but not if they&#39;ve been told &quot;nevermind, I&#39;ll tell you when you&#39;re older&quot; at every turn, then they&#39;re more likely to look for answers elsewhere. It&#39;s a matter of personality and how kids like to learn about the world. Kids are curious! But the &quot;adult&quot; scenes in tv shows and movies aren&#39;t always interesting to kids - people talking or wrestling in soft light? boooooring! Can we watch something else? That&#39;s why animated adult comedies are so scary for parents - they&#39;re full of material kids find interesting.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Don&#39;t all gasp at once, but we don&#39;t have a TV.   But we do have dvds and of course youtube and my children&#39;s access to these isn&#39;t limited. <br/>\n </span></blockquote>*****************<br/>\n<br/>\nWe&#39;ve had a painfully low budget the past few years and let go our satellite dish in favor of a Netflix subscription - do you have one of those? Lots of tv shows there and you can search through genres for things similar to what you already like. <br/>\n<br/>\nWhat sorts of things do your kids like? Going from &quot;Avatar&quot;... have y&#39;all seen any Hayao Miazaki films? If your kids don&#39;t like scary stuff, I&#39;d start with Kiki&#39;s Delivery Service, Ponyo, and My Neighbor Totoro before going on to heavier films like Howl&#39;s Moving Castle. <br/>\n<br/>\nIf y&#39;all like supernatural things in general, you might also check out the series &quot;Mushi-shi&quot; although it&#39;s sometimes a big spooky. If you like supernatural and super-cute, the Taruto series is as super-cute as it gets. <br/>\n<br/>\nOh, and there&#39;s Inuyasha - nice long series about a school girl who falls back through time and meets a demon boy with pointed wolf ears. Cute and scary by turns - some very creepy monsters.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Watching Family Guy","postDate":"1340192157","msgId":67720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyc2NpdCs2MGdnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg=="},"prevInTopic":67719,"nextInTopic":67721,"prevInTime":67719,"nextInTime":67721,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"Jayn has been watching Family Guy for years, probably starting from when she was about seven or eight, I m guessing, maybe younger. She has learnt so, so much","messageBody":"<div id=\"ygrps-yiv-1913951505\">Jayn has been watching Family Guy for years, probably starting from when she was about seven or eight, I&#39;m guessing, maybe younger. She has learnt so, so much from that show, including all kinds of safety things like not to have electronics near the bath tub, and all kinds of &quot;what not to do&quot; from Peter especially. She&#39;ll express some fact or idea and I&#39;ll ask where she learnt it, and she&#39;ll say &quot;Family Guy&quot;.<br/>\n<br/>\nShe used to just crack up constantly at how stupid Peter is, plus she was always entertained by Stewie and Brian. The sexual innuendo went right over her head, but she loved having pop culture references, to movies and so on, explained to her.<br/>\n<br/>\nEventually a couple of years later, when she was ready to learn about the mechanisms of sex, we had a couple of big talks. Finally I saw a huge light dawn moment and she said, &quot;Is this what Quagmire is always going on about?&quot; I said, &quot;Yep. You are going to get so many more of the jokes on Family Guy now.&quot; <br/>\n<br/>\nFor those who haven&#39;t seen it at all, the show does have some biting satire, and part of their schtick is that someone has to be offended somewhere or the show didn&#39;t work. They always go on just a little too long, just a little too far, and then somehow come back again. Jayn and I enjoy it very much, along with the other shows in the stable, American Dad (has a very self referential hilarious Patrick Stewart) and The Cleveland Show. But I do see that it&#39;s not for everyone. Jayn used to watch it all the time immersively, many repeats and DVR all the episodes through the week, but now she is just interested in seeing the new season episodes as they air. Now she is immersed in WoW.<br/>\n<br/>\nI strongly doubt that a 6 year old, unless he was super genius of Stewie caliber, would get the vast majority of the sexual or politico-cultural references and would be just taking the characters&#39; antics at face value. <br/>\n<br/>\nAnother animated thing that seems to be multi-leveled is the new My Little Pony: Friendship is Magic that Jayn watches on You Tube. Apparently a lot of adults are into it and tons of people are making wild fan art about it. Search MLP FiM on DeviantArt.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.etsy.com/shop/iggyjingles<br/>\nwww.cafepress.com/iggyjingles<br/>\nwww.robyncoburn.blogspot.com<br/>\n<br/>\n<br/>\n=== My son who just turned 9 has recently been asking to watch Family Guy.  One of his friends who is 6 says that he watches it, so now my son is also interested in it.  ===</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340192019","msgId":67719,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFEQ0UzMTg4LTRCM0MtNDcwQS04RTg0LTMzNTkwQjNBQzIxNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEQ0MjZFOTA5LUFFMDQtNEVFNi1CRUZFLTJDQTBDNDQ0Qjk1NkBtYWMuY29tPg==","referencesHeader":"PGpycjB0cSs0YTNhQGVHcm91cHMuY29tPiA8RDQyNkU5MDktQUUwNC00RUU2LUJFRkUtMkNBMEM0NDRCOTU2QG1hYy5jb20+"},"prevInTopic":67715,"nextInTopic":67720,"prevInTime":67718,"nextInTime":67720,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"... Speaking in general terms, no family will have everything. That s not a problem for unschooling. The world is so full of things that no one can explore it","messageBody":"<div id=\"ygrps-yiv-562608923\">On Jun 20, 2012, at 2:54 AM, Lucy&#39;s web wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Don&#39;t all gasp at once, but we don&#39;t have a TV<br/>\n<br/>\n </span></blockquote>Speaking in general terms, no family will have everything. That&#39;s not a problem for unschooling. The world is so full of things that no one can explore it all.<br/>\n<br/>\nWhat does hamper kids exploring, learning and discovering what&#39;s right and wrong for them, is fearing or disliking something the kids enjoy and then limiting their access.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would love any recommendations for series or films that are enjoyable to watch as a family.<br/>\n<br/>\n </span></blockquote>Avatar: The Legend of Korra (sequel to The Last Airbender, should be on Fox&#39;s website)<br/>\nThe Real Adventures of Jonny Quest<br/>\nJonny Quest (the original from the &#39;60s)<br/>\n<br/>\nStar Trek<br/>\nStar Trek: The Next Generation<br/>\nStar Trek: Voyager<br/>\nStar Trek: The Animated Series<br/>\nStar Trek: Deep Space Nine (this one was darker, more complex plots so tends to be Trekkie&#39;s favorite or least favorite.)<br/>\nStargate SG-1<br/>\nStargate Atlantis (Stargate Universe was dark and depressing)<br/>\nSamurai Jack<br/>\nDexter&#39;s Laboratory<br/>\nHercules<br/>\nXena (though it got darker later in its run)<br/>\nKeen Eddie<br/>\nDoctor Who (you can start with any doctor)<br/>\nEureka<br/>\n<br/>\nMy Neighbor Totoro<br/>\nKiki&#39;s Delivery Service<br/>\nPrincess Mononoke<br/>\nSpirited Away<br/>\nHowl&#39;s Moving Castle<br/>\nPonyo<br/>\nLupin the 3rd: The Castle of Cagliostro<br/>\n<br/>\nThese all have violence so depends on your kids:<br/>\n<br/>\nSamurai Champloo<br/>\nFullmetal Alchemist<br/>\nFullmetal Alchemist: Brotherhood<br/>\n(The episodes of the first caught up with the comic at some point. The author trusted the producers enough to let them continue the story as they imagined it was going. The second, made after the comic was done, follows the story of the comic. So they start out the same but go in two different directions.)<br/>\nCowboy Bebop (may be a bit talky for younger kids but it&#39;s the best anime series of all time.)<br/>\nEscaflowne (though not the movie)<br/>\nRouroni Kenshin<br/>\n<br/>\n<br/>\nStar Trek: The Movie (aka Star Trek reboot, Star Trek 11)<br/>\nStar Trek (the odd numbered ones are the best ;-)<br/>\nMy Big Fat Greek Wedding<br/>\nBabe<br/>\nThe Sting<br/>\nThe Italian Job (2003)<br/>\nStar Wars<br/>\nHarry Potter<br/>\nGalaxy Quest<br/>\nLegally Blonde 1&2<br/>\nCharlie&#39;s Angels 1&2<br/>\nSpider-man 1&2<br/>\nIron Man 1&2<br/>\nIron Giant<br/>\nThe Princess Bride<br/>\nBack to the Future 1,2&3<br/>\nEver After: A Cinderella Story<br/>\nWhale Rider<br/>\nThe Incredibles<br/>\nRaiders of the Lots Ark 1&3<br/>\nFerris Bueller&#39;s Day Off<br/>\nWallace and Gromit series<br/>\nMonty Python and the Holy Grail<br/>\nSecret of NIMH<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":331638196,"authorName":"Rachel","from":"Rachel &lt;athenagwis@...&gt;","profile":"athenagwis2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340191619","msgId":67722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTHA1eTRnZS1uLV90SEs2Z0NKU0Z5VE1qMVJtZGVDRENhdlI0UUp2dnJPTmZaPUZHQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67721,"nextInTopic":67724,"prevInTime":67721,"nextInTime":67723,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"=== Someone on this thread mentioned the cartoon Avatar: the last airbender . We ve all been watching that (many times) over the past while and my girls love","messageBody":"<div id=\"ygrps-yiv-1836830305\">=== Someone on this thread mentioned the cartoon &quot;Avatar: the last<br/>\nairbender&quot;. We&#39;ve all been watching that (many times) over the past while<br/>\nand my girls love it. Don&#39;t all gasp at once, but we don&#39;t have a TV. But<br/>\nwe do have dvds and of course youtube and my children&#39;s access to these<br/>\nisn&#39;t limited. However, because I&#39;ve been out of the &quot;TV loop&quot; for many<br/>\nmany years now, I would love any recommendations for series or films that<br/>\nare enjoyable to watch as a family.===<br/>\n<br/>\nWe have a physical TV, but we do not have cable or even rabbit ears, so we<br/>\ndo not watch any &quot;real time&quot; shows on our TV.  If you want to easily expand<br/>\nyour watching options, I would highly suggest Netflix and Hulu.com.<br/>\n<br/>\nNetflix streaming can be bought for about $15/mo.  There are no commercials<br/>\nwhen you watch the shows, which is really nice.  It has some movies (mostly<br/>\nolder ones), but we mostly watch it for the TV series.  It will have all<br/>\nepisodes of older series, and some channels even have more recent episodes<br/>\nas they become available (like Disney).  We have enjoyed watching Wizards<br/>\nof Waverly Place, Spongebob, Last Airbender, Phineas and Ferb, Merlin, Hey<br/>\nArnold, Rugrats, Pawn Stars, American Pickers, Fairly Odd Parents, Good<br/>\nLuck Charlie, America&#39;s Funniest Home Videos, Mythbusters, Overhaulin&#39;, and<br/>\nthat&#39;s to name just a few (seriously that&#39;s only scratching the surface of<br/>\nthe shows we have watched over the years).  They also have many shows from<br/>\nthe History channel and Discovery channel that we enjoy.  My husband and I<br/>\nalso have a list of shows that we enjoy that my son doesn&#39;t really care<br/>\nabout like Dawson&#39;s Creek or Bones.  You can watch Netflix on any computer.<br/>\n<br/>\nHulu.com is a free website that airs more recent shows.  There are a few<br/>\ncommercials when you watch the shows, but there are far fewer than regular<br/>\nTV.  I mostly use Hulu for my own shows, as the channels it works with are<br/>\nnot ones my son is usually interested in.  It&#39;s mostly ABC, NBC, FOX, etc<br/>\n.... and it&#39;s mostly their nighttime shows.  It does air Simpsons, so my<br/>\nson enjoys that.  (And it also airs the new Family Guy episodes, so he will<br/>\nenjoy that now too.  :))  I watch shows like So You Think You Can Dance,<br/>\nBones, Smash, Glee, Master Chef, Cougar Town, Modern Family, New Girl, Make<br/>\nIt or Break It, The Voice, and again that&#39;s just some of them.  I like Hulu<br/>\nbecause if you add a show to your favorites, when a new episode is added<br/>\n(usually 2-3 days after it airs on TV), it will add it to your queue and<br/>\nyou can go in an watch it.  There are more shows and episodes available if<br/>\nyou buy a subscription as well, but since I have been using Hulu for years<br/>\nand am pretty caught up on shows, the subscription isn&#39;t of much use to<br/>\nme.  It may be useful to you for a few months when you are new to it.<br/>\n<br/>\nI personally prefer these two methods of watching shows to Youtube because<br/>\nnot all episodes that are on Youtube are put there legally and sometimes<br/>\nthey are not of the best quality (though my son does utilize Youtube a lot,<br/>\nbut since we have these other two things it&#39;s mostly for how-to videos or<br/>\nreviews of toys).  Both of these options give you a wide variety of choices<br/>\nand are very easily accessible on a computer.<br/>\n<br/>\nI hope those suggestions help you!<br/>\nRachel<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":343381924,"authorName":"Lucy&#39;s web","from":"Lucy&#39;s web &lt;lucy.web@...&gt;","profile":"lucylists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340175299","msgId":67715,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0MjZFOTA5LUFFMDQtNEVFNi1CRUZFLTJDQTBDNDQ0Qjk1NkBtYWMuY29tPg==","inReplyToHeader":"PGpycjB0cSs0YTNhQGVHcm91cHMuY29tPg==","referencesHeader":"PGpycjB0cSs0YTNhQGVHcm91cHMuY29tPg=="},"prevInTopic":67714,"nextInTopic":67719,"prevInTime":67714,"nextInTime":67716,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"... I have read somewhere (if only I had a memory then I would remember where, but it might have been to do with Freud) that if a child doesn t have sex","messageBody":"<div id=\"ygrps-yiv-326246547\">On 20 Jun 2012, at 01:10, JustSayin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Relax, watch it together, have a good laugh, and be prepared for some frank discussion (or not, some kids just let it go and don&#39;t care to know the details). <br/>\n<br/>\n<br/>\n </span></blockquote>I have read somewhere (if only I had a memory then I would remember where, but it might have been to do with Freud) that if a child doesn&#39;t have &quot;sex education&quot; enforced upon them, then they will only start noticing and asking questions about such things when their minds are mature enough to process that kind of information.   Before then &#39;innuendo&#39; literally goes over their heads, apparently.<br/>\n<br/>\nSomeone on this thread mentioned the cartoon &quot;Avatar: the last airbender&quot;.   We&#39;ve all been watching that (many times) over the past while and my girls love it.   Don&#39;t all gasp at once, but we don&#39;t have a TV.   But we do have dvds and of course youtube and my children&#39;s access to these isn&#39;t limited.   However, because I&#39;ve been out of the &quot;TV loop&quot; for many many years now, I would love any recommendations for series or films that are enjoyable to watch as a family.<br/>\n<br/>\nI&#39;m sure there must be info on Sandra&#39;s site, but I haven&#39;t stumbled across it yet, in my meanderings there.<br/>\n<br/>\nLucy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Watching Family Guy","postDate":"1340150331","msgId":67713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpycjNucis0bGd2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpycjB0cSs0YTNhQGVHcm91cHMuY29tPg=="},"prevInTopic":67712,"nextInTopic":67714,"prevInTime":67712,"nextInTime":67714,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"... or medium or with friends, it s no big deal because they already know all about this stuff from the show and our conversations.----- That s a really good","messageBody":"<div id=\"ygrps-yiv-836150132\">----Another unexpected benefit to this is if something comes up in another context<br/>\nor medium or with friends, it&#39;s no big deal because they already know all about<br/>\nthis stuff from the show and our conversations.-----<br/>\n<br/>\nThat&#39;s a really good point, Melissa.  Michael said nearly the same thing not that long ago after we all watched a South Park episode that prompted some questions about sexual positions/terms.  Michael noted that he was about the same age as Noor when he learned those words, but he learned them from other kids, and the definitions were not only warped, but sexist and nasty and somewhat scary. <br/>\n<br/>\nBrie<br/>\n<br/>\n<br/>\n(a note to parents whose children don&#39;t like scary things, there is one episode of South Park, &quot;Hellen Keller&#39;s Musical&quot; that has a terrifying but very brief live-action (as in not-animated) montage; I&#39;d steer clear of that episode.)</div>","specialLinks":[]},{"userId":331638196,"authorName":"Rachel","from":"Rachel &lt;athenagwis@...&gt;","profile":"athenagwis2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Watching Family Guy","postDate":"1340148317","msgId":67714,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTHA1eTRnQ0xBMldZOUszVjJlQ2lVU2U4PXE4OGRvVERnenJQbSthc2hpS3BEVytrQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpycWY0dSttNDdzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPgk8anJxZjR1K200N3NAZUdyb3Vwcy5jb20+"},"prevInTopic":67713,"nextInTopic":67715,"prevInTime":67713,"nextInTime":67715,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"===I was hesitant to let Noor (8yo) watch Family Guy, but mostly because I didn t want other people (grandparents, friends) to know that we d let her. === This","messageBody":"<div id=\"ygrps-yiv-1114650862\">===I was hesitant to let Noor (8yo) watch Family Guy, but mostly because I<br/>\ndidn&#39;t want other people (grandparents, friends) to know that we&#39;d let her.<br/>\n===<br/>\n<br/>\nThis was also a part of it, we live in a condo complex with a lot of<br/>\nfamilies and I really don&#39;t want my son drawing attention to us by bragging<br/>\nabout his watching this show as other parents may not think kindly of it.<br/>\nBut I guess other kids are already doing this (the 6 yo) and no one knows<br/>\nif it&#39;s true or not.  :)<br/>\n<br/>\n<br/>\n=== I&#39;ve heard the kinds of questions you&#39;re asking about The Flintstones<br/>\nwhen I was a kid, and The Simpsons when my own children were young, and<br/>\nsince then of South Park and Family Guy.===<br/>\n<br/>\nSo true.  I have always thought of Family Guy as bad for him, but I<br/>\nremember that my mom wouldn&#39;t let me watch Simpsons and I have no problem<br/>\nwith my son watching it at all.  It&#39;s funny to me to watch it now and think<br/>\nthat my parents thought it was so bad!!<br/>\n<br/>\n<br/>\n===I&#39;d just have it on and be watching and laughing and let him either be<br/>\nthere or not as seems natural. I wouldn&#39;t even invite him to watch - I&#39;d<br/>\njust turn it on and start watching it yourself - let him wander in or out<br/>\nor whatever. You&#39;ve already made too big a deal about it - try to undo that<br/>\nby being totally natural and casual about it.===<br/>\n<br/>\nI wish I could do that, but since we have netflix, all the episodes are<br/>\navailable to us at once.  I know as soon as I say okay, he will watch every<br/>\nsingle episode back to back (as he has done with other series like Rugrats,<br/>\nHey Arnold, Phineas & Ferb, Spongebob, and even Futurama etc...), so it<br/>\nwill definitely not be something he will walk in or out of, especially<br/>\nsince he doesn&#39;t have a series he is watching right now.  We are total<br/>\nseries watchers.  We always watch an interesting series we find on netflix<br/>\nfrom start to finish, so I know he will for sure do this (with all 8<br/>\nseasons).  But I guess it&#39;s better to let him just do that then continue to<br/>\nmake it special by not allowing it.  This is why I am struggling though, if<br/>\nwe didn&#39;t have netflix with all the episodes available, I think he would<br/>\nget bored of it if we just watched it on Sunday nights once a week, but<br/>\nsince he can watch them all at once, he will.  I am not saying this to<br/>\nargue with your suggestion, it&#39;s just a real concern I have and part of the<br/>\nreason I have the concern about saying yes to this show, because from our<br/>\npast TV watching habits I know he will watch them all at once.<br/>\n<br/>\n<br/>\n===I have to say this same discussion (same show) got started on another<br/>\nlist years ago and someone on that list got me thinking about this in a new<br/>\nway that allowed me to move past my own baggage and fear, and I really<br/>\nappreciated that, so I hope this helps do the same for the OP or others who<br/>\nare worried about this. ===<br/>\n<br/>\nThank you for your post.  These replies back have made me think<br/>\ndifferently. We are still newish to whole life unschooling, so I still<br/>\ncarry some of this baggage with me, but it is so nice to hear others have<br/>\nhad the same issues and moved past them with such joy and it gives me hope<br/>\nthat we can do the same.<br/>\n<br/>\n<br/>\nAll the advice everyone has so kindly given though makes me think that I am<br/>\nonly making it more special by saying no.  Futurama isn&#39;t quite as bad, but<br/>\nit does have some parts that can get bad and I didn&#39;t give him a hard time<br/>\nabout that show.  He watched the whole series and now it&#39;s not even a blip<br/>\non his radar.  I guess I just have to accept that I have already made this<br/>\nshow special to him and accept what comes with that.<br/>\n<br/>\nRachel<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":283530155,"authorName":"JustSayin","from":"&quot;JustSayin&quot; &lt;mfcappella@...&gt;","profile":"mfcappella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Watching Family Guy","postDate":"1340147450","msgId":67712,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpycjB0cSs0YTNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQwQzc3OTFGLUE3RkEtNDc2MC04NEIyLTZDOUYxQjkwQkNBOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67711,"nextInTopic":67713,"prevInTime":67711,"nextInTime":67713,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"We had the exact same issue a few years ago. We got to a point where we would let my son watch it (he was probably about your son s age, maybe a little","messageBody":"<div id=\"ygrps-yiv-1512939494\">We had the exact same issue a few years ago. <br/>\n<br/>\nWe got to a point where we would let my son watch it (he was probably about your son&#39;s age, maybe a little younger), and when something sexual came on I would freak out and turn it off, which in hindsight is rather embarassing. <br/>\n<br/>\nI got myself over it and found that if my kids had questions they would just ask me later, and other than that they just enjoyed the show.  It became kind of a joke becasue I would get all flustered when they asked me questions based on what we had heard.  I just told them I get embarassed talking about stuff like that, and they look at me sympathetically and wait for an answer, which I would eventually give them.  My younger son is very literal so I have learned just to say it straight to avoid confusion.  He could never understand what I was so embarassed about. You should hear some of the questions they&#39;ve asked - never would I have thought we would be having these discussions - but I kind of love that we&#39;re having them!  We would never talk about &quot;such things&quot; when I was a kid, and it was all such a mystery.  Going through this has taught ME to be more relaxed around the subject (the sexual innuendo part, that is.  There isn&#39;t much violence, IMO, any more than a road runner cartoon would have.  Or I maybe I&#39;m just not bothered by cartoon violence).  Anyway to my boys all of it is just no big deal.<br/>\n<br/>\nFast forward a bit and we all just love Family Guy.  It is actually quite hilarious if your family likes that kind of humor.  We have running jokes around it, the guy who developed it is just a genius IMO (he does many of the voices, including Peter, Brian and Stewie, and we saw a &quot;making of&quot; type of show where he was actually going back and forth in conversation with himself using all these different voices, it was amazing), and we all (in our family) have a true appreciation for the talent that goes into it.<br/>\n<br/>\nMy husband can do pretty much all of the voices and both my sons quote bits from the show often for a laugh.  My older son also started writing his own scripts as a direct result of watching the show.  I remember laughing so hard I was crying when my older son did a pretty risque bit from the show in the car one day.  We would have experienced none of this if we had clung steadfastly to our &quot;you&#39;re too young to see this&quot; ideals.  <br/>\n<br/>\nAnother unexpected benefit to this is if something comes up in another context or medium or with friends, it&#39;s no big deal because they already know all about this stuff from the show and our conversations. <br/>\n<br/>\nI have to say this same discussion (same show) got started on another list years ago and someone on that list got me thinking about this in a new way that allowed me to move past my own baggage and fear, and I really appreciated that, so I hope this helps do the same for the OP or others who are worried about this. <br/>\n<br/>\nRelax, watch it together, have a good laugh, and be prepared for some frank discussion (or not, some kids just let it go and don&#39;t care to know the details).   <br/>\n<br/>\n--Melissa<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; I think the parents who relax are always happier than those who don&#39;t.<br/>\n&gt; <br/>\n&gt; In any case, don&#39;t keep on about not liking the show, or about its dangers or evils.  That won&#39;t help anyone.  And if your child discovers joys and LACK of danger and evil, he will think less of you and your opinion,which is a danger.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Watching Family Guy","postDate":"1340129245","msgId":67711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpycWY0dSttNDdzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg=="},"prevInTopic":67710,"nextInTopic":67712,"prevInTime":67710,"nextInTime":67712,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"I was hesitant to let Noor (8yo) watch Family Guy, but mostly because I didn t want other people (grandparents, friends) to know that we d let her. Initially,","messageBody":"<div id=\"ygrps-yiv-1494619983\">I was hesitant to let Noor (8yo) watch Family Guy, but mostly because I didn&#39;t want other people (grandparents, friends) to know that we&#39;d let her.  <br/>\n<br/>\nInitially, she saw the Star Wars parody on YouTube and asked if she could watch more. I put her off a bit and then finally agreed, but asked that she watch with either Michael or me. I wanted to know what she was seeing so I&#39;d be able to answer any questions, simply, and tailor the information in a way that would be useful to her.<br/>\n<br/>\nThere have been a few episodes where I&#39;ve cringed, or sat on the edge of my seat waiting for questions I never thought I&#39;d be answering from an 8yo.  So far, the majority of the sexual stuff either goes right over her head, or she asks and I answer, simply.  We&#39;ve had some amazing conversations as a result: &quot;does a woman get to decide if she wants to get pregnant?&quot; &quot;Why do children believe people who want to trick them?&quot; &quot;What do you do if a pervert tries to talk to you?&quot;.....<br/>\n<br/>\nThere&#39;ve also been a lot of interesting historical and cultural conversations: Jefferson and his ownership of slaves, Hitler, neo nazis, the Tea Party, Thomas Payne, Walt Whitman via a reference to the movie &quot;The Dead Poet&#39;s Society&quot; (we read &quot;O Captain! My Captain! and then talked about Lincoln).....really, these are just a few of Many threads of discovery that have woven through Noor&#39;s life as a result of watching Family Guy.<br/>\n<br/>\nDon&#39;t be afraid of learning or penis jokes.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Watching Family Guy","postDate":"1340127756","msgId":67710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpycWRtYytmcGg0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg=="},"prevInTopic":67709,"nextInTopic":67711,"prevInTime":67709,"nextInTime":67711,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"... **************** They probably weren t interesting to him, so he ignored them. There s a whole style of writing which you mostly see in cartoons (but","messageBody":"<div id=\"ygrps-yiv-1564174455\">&quot;athenagwis2&quot; &lt;athenagwis@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;We did sit down and watch one episode together when it happened to be on, and he didn&#39;t ask any questions about some of the sexual references, so I don&#39;t know if he just missed them or just absorbed them<br/>\n </span></blockquote>****************<br/>\n<br/>\nThey probably weren&#39;t interesting to him, so he ignored them. There&#39;s a whole style of writing which you mostly see in cartoons (but sometimes in other genres) where the hallmark of excellence is that kids and adults both enjoy material, but on different levels. It&#39;s not always comedy - my family used to cluster around the tv to watch Avatar: the last Airbender when it was first coming out; adults, a teenager, and a little kid all on the edges of our seats. That was a great show! I don&#39;t know if Family Guy is all that interesting to kids in general - the kids I know who have the freedom to choose what to watch prefer Futurama and older shows like the Simpsons. <br/>\n<br/>\nBut your son won&#39;t Know if he likes it or not until he&#39;s able to choose whether or not to watch it. Right now, it&#39;s a treat, something special, so he wants it for it&#39;s specialness. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;really violent things in it<br/>\n<br/>\n </span></blockquote>Does your son find the show upsetting? Kids&#39; ideas of what is scary or a portrayal of violence aren&#39;t always what parents expect. For awhile, my daughter didn&#39;t like to watch any kind of &quot;family drama&quot; with live actors. Mary Poppins, with the dad shouting at the children, had her in tears and she refused to have anything to do with Bridge to Terabithia. To Mo, that was &quot;violence&quot; - adults yelling at children. But she watched Kill Bill without seeing it as violent - it was just like a cartoon, she told me, but with people. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340125409","msgId":67709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQYlJ1emh4OW5PQnhfSzRETjBzNVBvd1lNVGpFUWpMWnlvRWhFck4wT1lOd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg==","referencesHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg=="},"prevInTopic":67708,"nextInTopic":67710,"prevInTime":67708,"nextInTime":67710,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"We did avoid exposing kids to scary stuff (especially visual stuff) that we thought would be upsetting to them. I never worried about the sexual stuff -","messageBody":"<div id=\"ygrps-yiv-697109644\">We did avoid exposing kids to scary stuff (especially visual stuff) that we<br/>\nthought would be upsetting to them.<br/>\n<br/>\nI never worried about the sexual stuff - figured sexual stuff permeates the<br/>\nworld - and it seemed better to me for them to see it in all KINDS of<br/>\ncontexts especially fun ones. Also, I really do think that comedy is<br/>\nself-selecting - they have to already know enough to get the joke or else<br/>\nit all goes over their heads.<br/>\n<br/>\nI&#39;d just have it on and be watching and laughing and let him either be<br/>\nthere or not as seems natural. I wouldn&#39;t even invite him to watch - I&#39;d<br/>\njust turn it on and start watching it yourself - let him wander in or out<br/>\nor whatever. You&#39;ve already made too big a deal about it - try to undo that<br/>\nby being totally natural and casual about it.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Jun 19, 2012 at 8:15 AM, athenagwis2 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:athenagwis@...\">athenagwis@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I am not sure of the best way to deal with this as it has now become the<br/>\n&gt; forbidden fruit as we have been avoiding sitting down and watching it<br/>\n&gt; (besides that one episode), so it keeps coming up, but I just feel he is<br/>\n&gt; really young to be exposed to some of the jokes they make on that show. I<br/>\n&gt; would appreciate any insight others can give me on this.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":403767111,"authorName":"Jo Isaac","from":"Jo Isaac &lt;joanneisaac@...&gt;","profile":"joanne.isaac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Watching Family Guy","postDate":"1340121258","msgId":67708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERVQjEwMS1XNDYzQkFCODIzNkIzNkM2RTBFRkQxOEI3RkYwQHBoeC5nYmw+","inReplyToHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg==","referencesHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg=="},"prevInTopic":67707,"nextInTopic":67709,"prevInTime":67707,"nextInTime":67709,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"My six year old watches Family Guy, often with his Dad, and they enjoy that time together and he thinks it s pretty funny. Much of the adult humour goes over","messageBody":"<div id=\"ygrps-yiv-598997083\">My six year old watches Family Guy, often with his Dad, and they enjoy that time together and he thinks it&#39;s pretty funny. Much of the adult humour goes over his head, but he still finds plenty to enjoy in the show and it makes him laugh a lot!<br/>\n <br/>\nPersonally I think I would just let him watch it on Netflix as much as he wants - he may watch lots and then decide it&#39;s not for him, or else he might still want to watch it, but I doubt he&#39;ll want to do marathon sessions after the restriction is lifted on the show.   <br/>\n <br/>\nJo <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Watching Family Guy","postDate":"1340120681","msgId":67707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQzc3OTFGLUE3RkEtNDc2MC04NEIyLTZDOUYxQjkwQkNBOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg==","referencesHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg=="},"prevInTopic":67706,"nextInTopic":67708,"prevInTime":67706,"nextInTime":67708,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"-=-We did sit down and watch one episode together when it happened to be on, and he didn t ask any questions about some of the sexual references, so I don t","messageBody":"<div id=\"ygrps-yiv-122098848\">-=-We did sit down and watch one episode together when it happened to be on, and he didn&#39;t ask any questions about some of the sexual references, so I don&#39;t know if he just missed them or just absorbed them.-=-<br/>\n<br/>\nHe probably ignored them.  Don&#39;t you remember watching movies or shows as a young child and just zoning out when there were no kids or dogs?<br/>\n<br/>\n-=-I tried talking to him about how he may not like the show as many of the jokes may not be funny to him as they might go over his head, but since his friend says he watches it, my son wants to too. -=-<br/>\n<br/>\nBugs Bunny  and other Warner Brothers cartoons have two levels of humor entirely.  There is slapstick and broad humor for kids, and then puns and more sophisticated literary references for the adults.   Just because kids might not think all the jokes are funny, and some go over their heads, it doesn&#39;t mean they don&#39;t like the shows.<br/>\n<br/>\nI&#39;ve heard the kinds of questions you&#39;re asking about The Flintstones when I was a kid, and The Simpsons when my own children were young, and since then of South Park and Family Guy.<br/>\n<br/>\nI think the parents who relax are always happier than those who don&#39;t.<br/>\n<br/>\nIn any case, don&#39;t keep on about not liking the show, or about its dangers or evils.  That won&#39;t help anyone.  And if your child discovers joys and LACK of danger and evil, he will think less of you and your opinion,which is a danger.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":331638196,"authorName":"athenagwis2","from":"&quot;athenagwis2&quot; &lt;athenagwis@...&gt;","profile":"athenagwis2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Watching Family Guy","postDate":"1340118919","msgId":67706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpycTUyNytlb3BrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67707,"prevInTime":67705,"nextInTime":67707,"topicId":67706,"numMessagesInTopic":0,"msgSnippet":"My son who just turned 9 has recently been asking to watch Family Guy.  One of his friends who is 6 says that he watches it, so now my son is also interested","messageBody":"<div id=\"ygrps-yiv-1769485384\">My son who just turned 9 has recently been asking to watch Family Guy.  One of his friends who is 6 says that he watches it, so now my son is also interested in it.  (As a note, I don&#39;t actually think the friend watches it, I think he was just showing off to my son.  He seems to do this a lot.)  We haven&#39;t really allowed him to watch it in the past, though he never specifically asked to watch it before, it was always more of an avoidance thing on our part.  We would watch it once he was asleep or doing other things.  The show has a lot of sexual and really violent things in it, and I am having a hard time being okay with him watching it.  We did sit down and watch one episode together when it happened to be on, and he didn&#39;t ask any questions about some of the sexual references, so I don&#39;t know if he just missed them or just absorbed them.  I tried talking to him about how he may not like the show as many of the jokes may not be funny to him as they might go over his head, but since his friend says he watches it, my son wants to too.  The show is on Netflix, so now he is wanting to sit down and have a marathon watching session of it.  I am not sure of the best way to deal with this as it has now become the forbidden fruit as we have been avoiding sitting down and watching it (besides that one episode), so it keeps coming up, but I just feel he is really young to be exposed to some of the jokes they make on that show.  I would appreciate any insight others can give me on this.<br/>\n<br/>\nThanks,<br/>\nRachel</div>","specialLinks":[]}],"prevTopicId":67679,"nextTopicId":67662}}