{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":137276194,"authorName":"elissa kroeger &lt;elissa_8@hotmail.com&gt;","from":"&quot;elissa kroeger &lt;elissa_8@...&gt;&quot; &lt;elissa_8@...&gt;","profile":"elissakroeger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction, The store owner story","postDate":"1046204938","msgId":59621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIzZ2ptYStsb2diQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":59620,"nextInTime":59622,"topicId":59621,"numMessagesInTopic":0,"msgSnippet":"Greetings! I couldn t help but notice that the store owner who didn t like homeschoolers shares my name (Elissa) too! I ve been homeschooling for well over 10","messageBody":"<div id=\"ygrps-yiv-110146395\">Greetings! I couldn&#39;t help but notice that the store owner who didn&#39;t <br/>\nlike homeschoolers shares my name (Elissa) too! <br/>\nI&#39;ve been homeschooling for well over 10 years, We&#39;ve got 4 boys and <br/>\ntwo girls ages, &lt;almost 18&gt; to 8 months. I&#39;ve always been an <br/>\nUnschooling wannabe, but it has only been in recent years that I&#39;ve <br/>\ngone public with it! I have so far had a late reader,age 9, a 5 year <br/>\nold reader, one who is just catching on at 10, one who sort of gets <br/>\nit at 7, a 3 year old who thinks he knows and a cute baby girl who <br/>\neats books. The seriously cool thing is that all of them love books! <br/>\nReading out loud is our life. I do it , my husband does it, the older <br/>\nchildren do it... The two oldest and I love sci-fi and fantasy and I <br/>\ntruly enjoy it when we all read the same book at about the same time. <br/>\nThe younger ones will learn in their own time!! I collect books as a <br/>\nhobby, I am trying to write one, and I draw. My Oldest son <br/>\nis &quot;Wilderness Man&quot;, his life is rock climbing and the outdoors, my <br/>\n14 year old daughter is into horses and the next three boys are LEGO <br/>\nmaniacs. <br/>\n    I often forgo &quot;field trips&quot; for many of the reasons the store <br/>\nowner described! I prefer to do cool activities with just our family. <br/>\nFor a number of years we were members of a structured support group, <br/>\none of my best friends is the leader, I was roped into being the art <br/>\nteacher, along with another unschooling mom (funny how artists are <br/>\nunschoolers) and we got burned out. Anyway, I hated group field trips <br/>\nas a child. I used to stay home those days and my mom took me to the <br/>\nsame place on the weekend. It wasn&#39;t very different as a <br/>\nhomeschooler. Too much confusion, not enough time to really enjoy the <br/>\ntrip, and I hate staying as a group. The group we belonged to adopted <br/>\na policy that children had to walk in straight lines by two&#39;s yuck! <br/>\nBut I understand why they did it! Being homeschoolers, we are not <br/>\ntaking time to teach our children &quot;groupthink&quot;.<br/>\n    Incidentally, has anyone read The Pillars of Creation by Terry <br/>\nGoodkind? It is a fantasy novel whose main character grows up <br/>\nisolated from society because of danger. On T.G.&#39;s website someone <br/>\nreferred to her as a homeschooled kid who did not have a clue about <br/>\nlife! I am often shocked that people do not understand our lifestyle! <br/>\nI probably shouldn&#39;t be, but I still am.   Have a great day!<br/>\n                       -ElissaK</div>","specialLinks":[]}],"prevTopicId":59611,"nextTopicId":59622}}