{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"UNSCHOOLING.COM ONLINE NEWS Mid April 2002","postDate":"1019056872","msgId":35166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVhLmEwN2QyNzQuMjllZWVjZThAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":35165,"nextInTime":35167,"topicId":35166,"numMessagesInTopic":0,"msgSnippet":"... UNSCHOOLING.COM ONLINE NEWS Mid-April 2002 ... In this Issue: John Holt on Questioning Children An Unschooling Day Web Resources for Skeleton Finders More","messageBody":"<div id=\"ygrps-yiv-696864668\">::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS<br/>\nMid-April 2002<br/>\n<br/>\n::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nIn this Issue:<br/>\n<br/>\nJohn Holt on Questioning Children<br/>\nAn Unschooling Day<br/>\nWeb Resources for Skeleton Finders<br/>\nMore Skeletons<br/>\nUnschooling-dotcom Email Discussion List<br/>\nBorders Bookstore Educators Days<br/>\nDizzy<br/>\nNow What?<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n&quot;Jerome Brunner once said, very aptly, that much of what we do and say in <br/>\nschool only makes children feel that they do not know things that, in fact, <br/>\nthey knew perfectly well before we began to talk about them. I have often <br/>\nseen this in mathematics, where fifth-graders, confused and frightened by <br/>\nrules and magic recipes, are unable to use either rules or common sense to do <br/>\nproblems that they could easily have done a few years before . And what is <br/>\ntrue of school, is often true of home. A child&#39;s understanding of the world <br/>\nis uncertain and tentative. If we question him too much or too sharply, we <br/>\nare more likely to weaken that understanding than strengthen it. His <br/>\nunderstanding will grow faster if we can make ourselves have faith in it and <br/>\nleave it alone.&quot;<br/>\n<br/>\nJohn Holt, from &quot;How Children Learn&quot; <br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nAn Unschooling Day<br/>\n<br/>\n&quot;My 8y.o. son and 4y.o. daughter found a skeletonized squirrel in the yard <br/>\nwhich really excited them. They came barreling in the house exclaiming &quot;this <br/>\nis really cool Mom you HAVE to come see this&quot;. They weren&#39;t sure what it was <br/>\nbut because some fur and skin were still holding it together they soon <br/>\nfigured it out. I came out and helped them salvage some of the skeleton for <br/>\nobservation. Now, I could have said &quot;oooh, that thing is disgusting. Get it <br/>\noff the driveway&quot;<br/>\n<br/>\nOr something to that effect.<br/>\n<br/>\nBut because I didn&#39;t here&#39;s what it led to.....<br/>\n<br/>\nWe picked out some bones and glued them to a piece of cardboard...they made <br/>\nguesses at what bone it was. Online they reconstructed an entire skeleton, <br/>\nthe website led us to owl pellets, then the Oakland zoo, green monkeys, <br/>\nMuntjacks (don&#39;t even ask how long we spent on the various species of <br/>\nMuntjacks), somehow in between all this we got hungry and made Potato Latkes <br/>\nwhich we ate with chopsticks that the kids were fascinated with at the <br/>\ngrocery store. Later, they read a book and watched a movie in which <br/>\nchopsticks were used (no, this was not planned...just serendipity). <br/>\n<br/>\nI can&#39;t tell you the things we learned or it would take up way too much room <br/>\nhere.<br/>\nOne thing just naturally led to another. One of my children popped in <br/>\noccasionally to see what we were up to and absorbed only a few tidbits while <br/>\nhappily roller blading the rest of the time.<br/>\n<br/>\nSo the moral of the story is it&#39;s us, the parents that must change. <br/>\nUnschooling works. It always works. But only if we can be as excited and <br/>\ninterested as our children.<br/>\n<br/>\nOr at least offer an avenue for them. Not everyone would be able to not get <br/>\nsqueamish at a dead squirrel...but &quot;hey, here are some gloves and a jar&quot; <br/>\nwould at least not slam the door of opportunity in their face.<br/>\n<br/>\nI don&#39;t worry anymore that my children won&#39;t learn everything they need to <br/>\nfor this life. I also see that joyful learning can only happen if we are open <br/>\nand totally willing to see every moment, every interest, everything as <br/>\nopportunity. We never know what a tidbit of information, or an experience <br/>\nmight lead to...and not knowing can bring a sense of mystery to this whole <br/>\nUnschooling life. If we keep that sense of mystery, that feeling that this <br/>\nCOULD lead to big things, (but if it doesn&#39;t that&#39;s ok too) we will so much <br/>\nbetter be able to serve our children well when supporting and encouraging <br/>\ntheir unique interests and pursuits. That&#39;s what it&#39;s all about for me.<br/>\n<br/>\nBeing an avenue instead of a closed door.<br/>\n<br/>\nRen&quot;<br/>\n<br/>\nFrom the Unschooling-dotcom Email list<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nShould you too happen to find an animal skeleton, here are a couple of great <br/>\nweb resources.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.d91.k12.id.us/www/skyline/teachers/robertsd/skulls.htm\">http://www.d91.k12.id.us/www/skyline/teachers/robertsd/skulls.htm</a><br/>\nThis site contains over 200 photos of an animal skull collection maintained <br/>\nby a high school science teacher in Idaho<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www-adm.pdx.edu/user/bio/articula/home.html\">http://www-adm.pdx.edu/user/bio/articula/home.html</a><br/>\nThe Articulation page - how to mount a complete animal skeleton.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/CapeCanaveral/Galaxy/8152/photolist.html\">http://www.geocities.com/CapeCanaveral/Galaxy/8152/photolist.html</a><br/>\nPhotos of fossil skeletons. You probably won&#39;t be putting one together <br/>\nyourself, but they sure are fun to look at!<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nMore Skeletons<br/>\n<br/>\n&quot;Speaking of road kill, unschooling led us down a path that sure wouldn&#39;t <br/>\nhave happened if we weren&#39;t an unschooling family!<br/>\n<br/>\nEldest son read some books about tanning hides and how early civilizations <br/>\nand First Nations didn&#39;t waste anything and would skin and tan the hides of <br/>\nanimals found dead. He then read about a man that collected ridicule and <br/>\ntanned the hides.<br/>\n<br/>\nYUCK!!! But, unless it is truly dangerous, in our family, there is no &quot;no.&quot; <br/>\nWe (mom, dad and kidlet) talked to our family doctor and our vet about <br/>\npotential problems. We went shopping and got him some masks which he <br/>\nsprinkled with cologne, some surgical gloves, disinfectant and gave him a <br/>\ncorner of the shed farthest from the house.<br/>\n<br/>\nHe knew more about anatomy and dissecting by the time he was ten than most <br/>\ncollege students that come out of a biology class with a lab! And he learned <br/>\nall kinds of tanning methods. And he did skeleton cards of each species he <br/>\nfound.<br/>\n<br/>\nAll in all, it was kewl!<br/>\nLynda&quot;<br/>\n<br/>\nFrom the Unschooling-dotcom Email list<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUnschooling-dotcom Email Discussion List<br/>\n<br/>\n&quot;It is a whole lot harder to talk about what unschooling looks like in <br/>\npractice, because it is totally absolutely and completely different for every <br/>\nfamily. And it isn&#39;t easily described by a list like schooling is - it isn&#39;t <br/>\nan alternative method of schooling like doing unit studies is, for example. <br/>\n<br/>\nIt takes time to read about unschooling and really &quot;grok&quot; it - it takes <br/>\nreading LOTS of people&#39;s anecdotes and reading their philosophies and how <br/>\nthey apply it in their lives and thinking about how that philosophy might <br/>\napply in your own family&#39;s life while understanding that it will LOOK really <br/>\ndifferent in your family, even if the underlying principles are the same.&quot;<br/>\n<br/>\nPam Sorooshian in a conversation on the Unschooling-dotcom Email list.<br/>\n<br/>\nThe Unschooling-dotcom Email list is affiliated with the Unschooling.com <br/>\nsite, and a source of lively discussion about unschooling. If the group <br/>\ndescription (below) intrigues you, come join the conversation! To subscribe <br/>\nsend a blank Email to:  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-subscribe@yahoogroups.com\">Unschooling-dotcom-subscribe@yahoogroups.com</a><br/>\n<br/>\nOr visit the Email list website at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom/\">http://groups.yahoo.com/group/Unschooling-dotcom/</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUnschooling-dotcom Email List Welcome and Group Description<br/>\n<br/>\nUnschooling is the confidence to trust that young people will learn what they <br/>\nneed from living their lives in freedom and joy. An unschooling parent is a <br/>\nfacilitator and cheerleader who embraces life and learning with curiosity and <br/>\nenthusiasm. An unschooled child is free to choose the what, when, where and <br/>\nhow of their learning -- from mud puddles to Shakespeare to Spongebob <br/>\nSquarepants! If this sounds like it&#39;s for you or you&#39;d like to find out more <br/>\nabout how video games and life in general are filled with learning, come join <br/>\nus!<br/>\n<br/>\nAs discussed on this list and at the Unschooling.com website, unschooling is <br/>\n*not* defined as the free learning kids do outside of parent-directed <br/>\nlearning nor is it done on a part time basis. We advise reading for a week or <br/>\ntwo before posting to get a &quot;feel&quot; for the list and its members, since many <br/>\nlistmembers love a lively debate and questioning beliefs to their <br/>\nfoundations. If you have questions about this list please feel free to <br/>\ncontact: Mary Broussard (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:livinginabundance@...\">livinginabundance@...</a>)  or Joyce Fetteroll  <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>)<br/>\n<br/>\nThe website this list developed from is an excellent source of information <br/>\nabout unschooling: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nThis list and the Unschooling.com site were created and are still supported <br/>\nby Home Education Magazine: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com;\">http://www.home-ed-magazine.com;</a> Helen Hegener <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>) is the list owner.<br/>\n<br/>\nThanks for joining us and enjoy the list!!!<br/>\n<br/>\nMary, Joyce, and Helen<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFrom the Borders Bookstores newsletter:<br/>\n<br/>\n&quot;Borders would like to acknowledge the gifts, talents, and dedication of our <br/>\nnation&#39;s educators with special Educator Appreciation events. We invite all <br/>\ncurrent and retired teachers, librarians, college faculty, educational <br/>\nadministrators, and home-schoolers to attend these great in-store happenings <br/>\nand to enjoy savings of 25% on almost everything in the store! <br/>\nEducators who visit their neighborhood Borders stores April 19-25 will find <br/>\nspecial discounts, door prizes, entertainment, and refreshments waiting. It&#39;s <br/>\nsure to be fun -- and educational.&quot; <br/>\n<br/>\nVisit the Store Locator at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bordersstores.com/locator/locator.jsp\">http://www.bordersstores.com/locator/locator.jsp</a> <br/>\nor call your local store for details.<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThis moment of childish wonder comes from my friend Jennifer:<br/>\n<br/>\n&quot;Eric has had an earache and hasn&#39;t been feeling that well until today.  He <br/>\nwas also nauseous over the weekend.  Mike told him how the inner ear affects <br/>\nbalance, and I suppose Jacy was listening. Just a few minutes ago she was <br/>\nspinning around in the kitchen, making herself dizzy.  I could see a light <br/>\nbulb had just gone off in her head and she said, &quot;Mom!  I bet I know why you <br/>\nget dizzy when you spin.  The fluid in your ear moves around and when you <br/>\nstop it&#39;s still sloshing around and that makes you feel dizzy.&quot;  I told her I <br/>\nhad never thought about it, but she was probably right.  We went to the <br/>\ninternet and found this site:  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faculty.washington.edu/chudler/bigear.html\">http://faculty.washington.edu/chudler/bigear.html</a><br/>\n<br/>\nSo, she was absolutely right.  Funny how I never even wondered why that <br/>\nhappened.&quot;<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nNow What?<br/>\n<br/>\nBy now we all know that yes, unschooled kids can get into college. But what <br/>\nabout those kids who don&#39;t want to go to college, or maybe just don&#39;t want to <br/>\ngo &quot;yet&quot;? How can we as parents support them in their entry into the adult <br/>\nworld? How can help them find the best path toward their own goals?<br/>\n<br/>\nMany families have found Herbert Kohl&#39;s book &quot;The Question is College&quot; to be <br/>\na valuable tool to help their teens define their goals and develop a guide <br/>\nfor their futures. It differs from other interest and talent inventory and <br/>\nmapping tools by not assuming that college is a necessary step in the process.<br/>\n<br/>\nAre your teens considering college, apprenticeship, full time work, travel, <br/>\nor something else? Come to the Unschooling.com message boards and share your <br/>\nstories! Let&#39;s talk about all the ways unschooled kids transition into the <br/>\nadult world.<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFinal Thoughts<br/>\n<br/>\n&quot;Do rewards motivate people? Absolutely. They motivate people to get rewards.&quot;<br/>\nAlfie Kohn in &quot;Punished by Rewards&quot;<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThanks for reading the Unschooling.com newsletter! Permission is herewith <br/>\ngranted to forward this newsletter to all your friends, your local support <br/>\ngroup, and your mother-in-law!<br/>\n<br/>\nTo subscribe, visit our web site at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> or send an <br/>\nemail to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words subscribe <br/>\nunschooling-newsletter followed by your name@your address.com in the body of <br/>\nthe email. (e.g. subscribe unschooling-newsletter youremailaddress). To <br/>\nunsubscribe, send an email to <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words unsubscribe unschooling-newsletter <br/>\nfollowed by your name@your address.com in the body of the email. (e.g. <br/>\nunsubscribe unschooling-newsletter youremailaddress). To change the address <br/>\nat which you receive the newsletter, unsubscribe your old address and then <br/>\nsubscribe with your new one.<br/>\n<br/>\nSee you in May!<br/>\n<br/>\nDeborah A Cunefare, Newsletter Editor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\nUnschooling.com is a service of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":35164,"nextTopicId":35176}}