{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"military (was Re: Yes, Ma&#39;am)","postDate":"1107029070","msgId":102863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5My4zODUxOTk5ZS4yZjJkNDY0ZUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":102862,"nextInTime":102864,"topicId":102863,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/29/05 12:32:09 PM, kbcdlovejo@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1383760017\">In a message dated 1/29/05 12:32:09 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\n&lt;&lt; Southerners made up the majority of officers in the Revolutionary War, the <br/>\nWar of 1812, and the War Between the States---because they had horses and <br/>\nmoney and could fund the war effort. They also brought many of their servants <br/>\n(not slaves) and farmworkers as aids and enlisted personnel because of trust and <br/>\nduty. Kind of &#39;feudal&#39;.<br/>\n<br/>\n<br/>\nI think Southerners have always felt a bit more of a sense of duty to country <br/>\nbecause so many of the &#39;big&#39; original settlers still held an allegiance to <br/>\nthe king---they were here not to escape tyranny, but to get MORE!&lt;g&gt; &gt;&gt;<br/>\n<br/>\nGood analysis.  Makes sense.  Thanks!<br/>\n<br/>\nI think you&#39;re right about the last resort take on the military in some <br/>\nplaces.  A family was interviewed on the news the other night.  The dad was in the <br/>\nmilitary years ago (not a lifer), and one son just got back from Iraq, and <br/>\nanother&#39;s about to leave.  He was expressing pride in them.  It didn&#39;t sound <br/>\nsmart to me, or honorable.  I didn&#39;t call him or say so or anything. &lt;g&gt;<br/>\n<br/>\nOne unschooled friend of ours really REALLY wants to join the marines.  His <br/>\ndad was a marine and he wants to be too, but he&#39;ll  need to get 15 college <br/>\ncredits.  He&#39;s working on it, but some of us (in our dishonorable state) are <br/>\nsecretly cheering for life to distract him and give him another idea.   But that&#39;s <br/>\nprobably cruel, in a way, because if he wants it he wants it.  And he could do <br/>\nwell, and live there for 20 years.  Or he could die doing what he freely <br/>\nchose to do and worked hard to obtain.<br/>\n<br/>\n-=-Southerners are also more comfortable with the chain of command and <br/>\ndeference to authority. BUT, because of the legacy of rank (granted by the king), I <br/>\nthink Southerners don&#39;thin the south, I think the heirarchy is still pretty <br/>\nclear, and there are lessers all around, who might be addressed as &quot;sir&quot; but <br/>\nit&#39;s a courtesy, and a condecension and a deigning, not an equal exchange of <br/>\n&quot;sirs.&quot;    And when little kids are called &quot;sir&quot; that&#39;s just cute.   It scares me, <br/>\nbut I&#39;m so far away that my fear is not a factor. &lt;g&gt;<br/>\n<br/>\n-=-It is truly considered *honorable* to serve in the military here, as <br/>\nopposed to in other regions of the country where it is often seen as a last <br/>\nresort.-=-<br/>\n<br/>\nMy dad had one honorable enlistment (WWII, war ended while he was on a troop <br/>\nship in the middle of the Atlantic, so he served in the occupation for a <br/>\ncouple of years) and one last resort enlistment (re-upped after he married my mom <br/>\nand couldn&#39;t find a job he liked; he was a sergeant teaching people to drive <br/>\ntrucks, and repairing stuff, in Camp Chaffee, Arkansas).<br/>\n<br/>\nThe class system out here was, in my parents&#39; childhoods and somewhat still, <br/>\nlandowners and hired hands.  Ranchers rank.  Farmers, iffier.  Sharecroppers <br/>\nare luckier than itinerate workers, which is what my mom&#39;s family did--pick <br/>\ncotton.<br/>\n<br/>\nKeith&#39;s dad (a Yankee, from Massachusetts) joined the navy in the late 30&#39;s <br/>\nand was training pilots in Pensacola when Pearl Harbor was bombed.  Keith <br/>\nthinks he joined because of the depression.  Last resort?  But he was cooler than <br/>\nmy dad, because he was college material and was a Captain.<br/>\n<br/>\nI&#39;m rambling, but for those connecting dots, who knows what ramble might be a <br/>\nmissing bit to their evolving model?<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":102795,"nextTopicId":102855}}