{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":433362453,"authorName":"","from":"deborahdonndelinger@...","profile":"deborahdonndelinger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Lists and learning","postDate":"1421375113","msgId":75396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG05OXNxOSsxbzdsOHZ2QFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PDU0QjgzNEQ1LjcwNjA4MDRAZ21haWwuY29tPg==","referencesHeader":"PDU0QjgzNEQ1LjcwNjA4MDRAZ21haWwuY29tPg=="},"prevInTopic":75395,"nextInTopic":0,"prevInTime":75395,"nextInTime":75397,"topicId":75394,"numMessagesInTopic":0,"msgSnippet":"One sentence got garbled when I was editing it.   Sorry about that.  I meant to write:  The point I am hoping to convey is that I learned from experience that","messageBody":"<div id=\"ygrps-yiv-1037830716\">One sentence got garbled when I was editing it. &nbsp; Sorry about that. &nbsp;I meant to write: &nbsp;&quot;<span style=\"color:rgb(63, 63, 63);\">The point I am hoping to convey is that I learned from experience </span><span style=\"color:rgb(63, 63, 63);\">that these discussions can be helpful but only if I use them to look at&nbsp;</span><span style=\"color:rgb(63, 63, 63);\">my own actions.&quot;</span></div>","specialLinks":[]},{"userId":360440773,"authorName":"Kirsty Harriman","from":"Kirsty Harriman &lt;kgharriman1@...&gt;","profile":"kirsty_harriman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Lists and learning","postDate":"1421367000","msgId":75395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG8xN3lxOTZiajlkcmJyaXRmZmk4eW4zbS4xNDIxMzY3MDAwNTc5QGVtYWlsLmFuZHJvaWQuY29tPg=="},"prevInTopic":75394,"nextInTopic":75396,"prevInTime":75394,"nextInTime":75396,"topicId":75394,"numMessagesInTopic":0,"msgSnippet":"I totally agree with Deborah post and could relate on a number of levels. I too came from a history of attachment parenting which led to homeschooling but the","messageBody":"<div id=\"ygrps-yiv-1211021738\"><html><head></head><div><div></div><div>I totally agree with Deborah post and could relate on a number of levels.</div><div><br></div><div>I too came from a history of attachment parenting which led to homeschooling but the Waldorf kind and I too tried oak meadow which totally didn&#39;t work without the misery of some kind of coercion to make lessons happen. Awful. I was also taken aback and felt huffy during some of my early experiences on this list a year ago but I chose to stay (luckily I wasn&#39;t asked to leave!) because of Sandra&#39;s and others&#39; authenticity, clarity, honesty and the lack of fluff which was a relief after being on many fluffy lists and forums (even though I like hugs, I am not sure they help much online!) In the end online fluff doesn&#39;t help much. All I chose to do was to get out of my own way and allow the words to sink in without being defensive or precious about the assumptions I had previously held to he true. So I too only hang out on this list now and reluctant to involve myself in other unschooling discussions because I have found this philosophy to be so easily misconstrued and misunderstood. I find this list and the picking apart of words/phrases to be very helpful in challenging my own thoughts.</div><div><br></div><div>&nbsp;I too don&#39;t understand many aspects and I despair when my eldest daughter claims to be bored and I wonder what I am doing wrong and why this doesn&#39;t seem to be working yet after removing many of our previously tight limits and how can I facilitate four individuals learning when they are all needing something different from me at the same time and in conflict with one another. ... I have a long long way to go to be able to come here and talk about how happily and freely learning we all are... but the point is that I choose to come and read this list alone and I am enormously grateful for it and the time Sandra and the moderators and experienced &nbsp;others who freely give their time to facilitate our learning.&nbsp;</div></div></html></div>","specialLinks":[]},{"userId":433362453,"authorName":"Deborah Donndelinger","from":"Deborah Donndelinger &lt;deborahdonndelinger@...&gt;","profile":"deborahdonndelinger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Lists and learning","postDate":"1421358293","msgId":75394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0QjgzNEQ1LjcwNjA4MDRAZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":75395,"prevInTime":75393,"nextInTime":75395,"topicId":75394,"numMessagesInTopic":0,"msgSnippet":"The recent discussions here (prompted by Nicole s post and Sandra s earlier Please Help:What I want for Christmas post) have me thinking about my experiences","messageBody":"<div id=\"ygrps-yiv-1059929842\">The recent discussions here (prompted by Nicole&#39;s post and Sandra&#39;s <br/>\nearlier Please Help:What I want for Christmas post) have me thinking <br/>\nabout my experiences on unschooling lists and what&#39;s been helpful to me <br/>\nand what hasn&#39;t.<br/>\n<br/>\nMy children are currently aged 16, 14, and 12.  I was introduced to the <br/>\nconcept of unschooling by Jan Hunt after talking with her about my <br/>\nstruggles with Oak Meadow, a Waldorf-like curriculum. I was trying to do <br/>\nthe first year of Oak Meadow with my son when he was five.  He really <br/>\nwasn&#39;t interested, I was making us both miserable with scheduled sit <br/>\ndown lessons on letters, and I wanted to find other options to this <br/>\nhomeschooling thing.  Hearing about unschooling was a relief and felt <br/>\nlike an approach that would give me the freedom to respond and relate to <br/>\nmy child on his terms, not an outside focus.   At the same time I had <br/>\nsome fears and concerns to work through.    As I write this, I realize <br/>\nthat I have been responding to my son since he was born but ran smack <br/>\ninto a whole bunch of unexamined assumptions. I never really had thought <br/>\nabout extended nursing or co-sleeping or sling wearing or homeschooling <br/>\nor unschooling.  But as I noticed what worked for him and me and what <br/>\ndidn&#39;t, I found those things and more.   For me, it&#39;s been a lot of <br/>\nletting go of mainsteam thoughts about children and relating to children <br/>\nas well as building my confidence in what I was doing.<br/>\n<br/>\nWhen I was worried about my son learning to read, other unschoolers told <br/>\nme that everyone reads at different ages.  However, it felt like a leap <br/>\nof faith to see what happened with my children.  I&#39;m not a fan of &quot;leaps <br/>\nof faith&quot;  - I like to feel confident in what I&#39;m doing and what&#39;s <br/>\nhappening.   I don&#39;t mind following doing things differently but I don&#39;t <br/>\nlike doubting myself.    I wasn&#39;t going to try to teach him or force him <br/>\nto read (as if I could), but I worried I was being negligent if he <br/>\ndidn&#39;t learn to read.   And yes, one day around the age of 12 he sat <br/>\ndown one week and read a Percy Jackson novel.   He asked questions that <br/>\nshowed me was absorbing the information at a level I completely missed <br/>\nmyself reading the book.   I really wish I hadn&#39;t worried as much.  <br/>\nHearing other people tell me not to worry wasn&#39;t helpful.   I do wonder <br/>\nif I had I engaged with Sandra and Joyce and others here,  I might have <br/>\nbeen able to work out that concern earlier.   I wish I had.  Instead I <br/>\nwas on other lists that weren&#39;t helpful.<br/>\n<br/>\nWhen I started going to unschooling conferences and meeting some people <br/>\nfrom two different unschooling lists I was on, I began to notice that <br/>\nsome people talked a good talk but when I met them in person and saw <br/>\nthem interacting with their children, I knew immediately I didn&#39;t want <br/>\nto learn from them.    Likewise, meeting Kelly Lovejoy and Sandra in <br/>\nperson at a New Jersey conference, interacting with them, and seeing <br/>\nthem interact with others there also made a huge impression on me.    In <br/>\nfact it was a five minute conversation between Sandra and her daughter <br/>\nthat impacted me the most.  And since then I&#39;ve selectively read <br/>\nSandra&#39;s list and facebook group with a deep respect for both her <br/>\nexperience and also her and the moderators&#39; questioning of the writers&#39; <br/>\nthinking and words.<br/>\n<br/>\n[As a side note and with a bit of a red-face,  let me share that when I <br/>\nfirst was on one of Sandra&#39;s lists years ago, I left in a huff when she <br/>\nchallenged me about &quot;magical thinking&quot;.    I&#39;m really glad that I grew <br/>\nto understand why that was a concern and that I made my way back to <br/>\nlearn some more.]<br/>\n<br/>\nI still don&#39;t understand all of the points made here.  I am still <br/>\ndeliberately making new choices that make our home a better place to <br/>\nbe.  For example, just this week I played Far Cry 4 after reading Alex&#39;s <br/>\npost about how different it is to play vs. watch her child playing.   <br/>\nShe&#39;s right - it was fun!   I even tried to take out a bear and had no <br/>\nproblem shooting the bad guys.  It was quite gratifying actually.  I own <br/>\nreal guns myself, used to target shoot, and have no desire to ever shot <br/>\nanything living.    Shooting a bear in a game won&#39;t change that.   And I <br/>\nhave a renewed appreciation for my son&#39;s skill at video games.  He <br/>\nblasted through a mission in five minutes that I was absolutely horrible <br/>\nat.<br/>\n<br/>\nI debated about sending this post - am I clear and does it add value?  I <br/>\nhope so.  The point I am convey is thatI learned from experience that <br/>\nthat these discussion can be helpful but only if I use them to look at <br/>\nmy own actions.  Hearing how others do things can help but only if I <br/>\nmake changes for myself.   And that just because someone writes <br/>\nsomething authoritatively doesn&#39;t mean they have the experience or <br/>\n&quot;success&quot; to back it up.<br/>\nAnd to admit I was wrong all those years ago when I left in a huff ... :-)<br/>\n<br/>\nThank you Sandra and Joyce and Pam and others for your incredible <br/>\npatience in dealing with folks who send you rude emails offline.  My <br/>\nfamily and I have benefited from your commitment to sharing and helping <br/>\nothers grow and learn about unschooling and I am really glad you keep <br/>\nthis list available.</div>","specialLinks":[]}],"prevTopicId":75373,"nextTopicId":75208}}