{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":225471692,"authorName":"iblington","from":"&quot;iblington&quot; &lt;iblington@...&gt;","profile":"iblington","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Giving","postDate":"1259495010","msgId":48827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhldG1wMis0N2FAZUdyb3Vwcy5jb20+","inReplyToHeader":"PDcwMTA4Ni41MDMwLnFtQHdlYjExMDQwOC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":48808,"nextInTopic":0,"prevInTime":48826,"nextInTime":48828,"topicId":48804,"numMessagesInTopic":0,"msgSnippet":"I was able to quickly glance at these replies yesterday morning and they helped me be clear in my mind. I would handle this differently in the future but yes,","messageBody":"<div id=\"ygrps-yiv-1870696960\">I was able to quickly glance at these replies yesterday morning and they helped me be clear in my mind. I would handle this differently in the future but yes, I did buy the books as gifts & wanted them to be given. BUT without my son getting upset and without me ending up angry.<br/>\n<br/>\nWe had left the books in a pile on the table, to decide in the morning (I posted here after he was asleep). I was very tired and could feel it wouldn&#39;t take much for me to get very cross with him, which I wanted to avoid as it was an understandable reaction on his part. I was actually pretty cross with myself for setting up the situation!<br/>\n<br/>\nWith birthday presents I always show my son the gift just before we wrap it, so he knows what he&#39;s giving, which in turn is just before we leave for the party - and any comments of &quot;I would really like that&quot; I reply along the lines of &quot;yes, it&#39;s great isn&#39;t it I thought (name) would really enjoy it&quot;. So I know it&#39;s hard for him to deal with seeing exciting new things that are to be given away, but I just didn&#39;t think about this that clearly beforehand.<br/>\n<br/>\nIn the end what happened was: 40 minutes before we left, I pointed towards the books & asked if he wanted to choose which was for each cousin or I could. He said it was too difficult so I suggested a game (holding them behind my back & I&#39;d bring one out when he said a name - so it was a surprise). He agreed but wanted to be the one to hold it behind his back, he sneaked a look and made his original choice. <br/>\n<br/>\nI tried to keep it fun by suggesting we wrap them to make them extra special - we did that, he chose the paper and ended spending some time decorating name labels for each parcel. He wanted to wrap his one too (he said he could pretend to be surprised). <br/>\n<br/>\nWhen he arrived he handed them over with no hesitation, opened his, they were all very excited and pleased, one of his cousins spent the whole morning working on his book, even wanting to bring it to the park to keep doing it there :-).<br/>\n<br/>\nThere have been no more suggestions that he wanted to keep them all or feels hard done by, a brief mention when we were talking about Xmas that he&#39;d like more activity books as presents. And later he told his dad with a lot of enthusiasm all about how much his cousins had LOVED the books and S had almost completely finished it by the time he left.<br/>\n<br/>\nSo thanks again for your replies, this turned out better than expected :-) I especially enjoyed his enthusiastic recounting of how happy his cousins were. A reminder for me to not get caught up in my own picture of how things will be (oh, I&#39;ll buy these presents, it&#39;ll be lovely!) but to step back & think about how my children will see it.<br/>\n<br/>\nMany thanks, Abi</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Giving","postDate":"1259367817","msgId":48808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwMTA4Ni41MDMwLnFtQHdlYjExMDQwOC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PEE1NkI5RjM2LUFFRUItNDQ0Qi04MjJCLTA0MjI2QjBGREMwREBjb21jYXN0Lm5ldD4=","referencesHeader":"PDE5NTA3MzM3NzMuNzYyNzMyMTI1OTM1NjE4NzMzNi5KYXZhTWFpbC5yb290QHN6MDAzOWEuZW1lcnl2aWxsZS5jYS5tYWlsLmNvbWNhc3QubmV0PiA8QTU2QjlGMzYtQUVFQi00NDRCLTgyMkItMDQyMjZCMEZEQzBEQGNvbWNhc3QubmV0Pg=="},"prevInTopic":48807,"nextInTopic":48827,"prevInTime":48807,"nextInTime":48809,"topicId":48804,"numMessagesInTopic":0,"msgSnippet":" *** I think the next time, I would buy separate books or whatever for the cousins and keep them aside. Showing all the tempting possibilities to a child and","messageBody":"<div id=\"ygrps-yiv-1261346135\"> *** I think the next time, I would buy separate books or whatever for the <br/>\ncousins and keep them aside. Showing all the tempting possibilities to <br/>\na child and telling him he can only have two of them might be a bit <br/>\ntoo much for some 5 year olds to get their head around.***<br/>\n<br/>\nThat was my thought too.  That, or, buying them all the same one.  Part of the problem, I&#39;m guessing, is that he liked all of the different options available.  If they&#39;d all been the same one, he probably wouldn&#39;t have cared as much.  I would let him pick which one he wanted to keep and give the other ones, since they were purchased as gifts.  Or if it were me and my child, I would say &quot;you may pick or I will, but either way, each of you will get one.&quot;  Then it&#39;s not even an option to keep all of them, but the choice here would be, which one, not how many.  He may still be upset about giving up these cool new things, but they weren&#39;t his to begin with, so, be sympathetic and let him know you will get more when you can, of the ones that he doesn&#39;t get to keep.  And next time, get all of the same, or don&#39;t let him know in advance, and surprise all of them at once.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Giving","postDate":"1259360500","msgId":48807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE1NkI5RjM2LUFFRUItNDQ0Qi04MjJCLTA0MjI2QjBGREMwREBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDE5NTA3MzM3NzMuNzYyNzMyMTI1OTM1NjE4NzMzNi5KYXZhTWFpbC5yb290QHN6MDAzOWEuZW1lcnl2aWxsZS5jYS5tYWlsLmNvbWNhc3QubmV0Pg==","referencesHeader":"PDE5NTA3MzM3NzMuNzYyNzMyMTI1OTM1NjE4NzMzNi5KYXZhTWFpbC5yb290QHN6MDAzOWEuZW1lcnl2aWxsZS5jYS5tYWlsLmNvbWNhc3QubmV0Pg=="},"prevInTopic":48806,"nextInTopic":48808,"prevInTime":48806,"nextInTime":48808,"topicId":48804,"numMessagesInTopic":0,"msgSnippet":"I think the next time, I would buy separate books or whatever for the cousins and keep them aside. Showing all the tempting possibilities to a child and","messageBody":"<div id=\"ygrps-yiv-461243411\">I think the next time, I would buy separate books or whatever for the  <br/>\ncousins and keep them aside. Showing all the tempting possibilities to  <br/>\na child and telling him he can only have two of them might be a bit  <br/>\ntoo much for some 5 year olds to get their head around. Some things  <br/>\nneed maturity to understand, not explaining. It seems like there was a  <br/>\nlot of discussing and maybe some expectations that he understand it all.<br/>\n<br/>\nI remember expecting a lot more of my 5 year old than she was capable  <br/>\nof really understanding. It came with age and maturity, but long after  <br/>\nI had thought it would. I tried to show by example (after making the  <br/>\nmistake of taking her to task for selfishness, which seemed to make  <br/>\nthings worse).<br/>\n<br/>\nIt was working with her specific needs and outlook, exposing her to  <br/>\nsociety&#39;s good practices, showing her the best ways that I knew to  <br/>\nact, and preparing for likelihoods (as in bringing a coat if I knew it  <br/>\nmight get cold and she wasn&#39;t cold when we left to go somewhere), that  <br/>\nhave made a difference. And the realistic expectation that she would  <br/>\nlearn and understand as she was ready (as I learned and understood to  <br/>\nbe patient) instead of the unrealistic expectations I began with. I  <br/>\nlearned that through unschooling &lt;g&gt;.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; my son is 5 1/2 and tomorrow he is going to spend the morning with  <br/>\n&gt; his cousins.<br/>\n&gt;<br/>\n&gt; A while ago, he had a sticker activity book we&#39;d got from the local  <br/>\n&gt; shop that his 2 younger cousins (5 & 7) were really interested in. I  <br/>\n&gt; said at the time if I saw any more I&#39;d get one for them too.<br/>\n&gt;<br/>\n&gt; So when I saw the shop had some similar books in stock, I bought one  <br/>\n&gt; of each, Ghosts, Pirates, Dinosaurs & Dragons. I showed them to my  <br/>\n&gt; son this evening & said they were to take with him tomorrow. He  <br/>\n&gt; could choose 2 to keep, we could start one tonight & he could take  <br/>\n&gt; his other chosen one plus the extra 2 over with him tomorrow. Then  <br/>\n&gt; he&#39;d bring his home while his cousins had one each to keep.<br/>\n&gt;<br/>\n&gt; He did choose after some consideration but then a bit later he came  <br/>\n&gt; & said he&#39;s not feeling like giving any of them away and he really  <br/>\n&gt; wants to keep all of them. We discussed it a bit, I pointed out how  <br/>\n&gt; he&#39;ll have 3 (including the original one which he still has) & I  <br/>\n&gt; wouldn&#39;t have bought so many if it wasn&#39;t that 2 were for his cousins.<br/>\n&gt;<br/>\n&gt; A bit later he came back through (I was clearing up the kitchen) and  <br/>\n&gt; said he&#39;d been thinking about it and wants to give just one to his  <br/>\n&gt; cousins & they can share it. I said it was an idea but it&#39;s quite  <br/>\n&gt; hard to use those books at the same time as someone else, to which  <br/>\n&gt; he replied they could have half the book each and just cut it in two.<br/>\n&gt;<br/>\n&gt; I think I should have bought 3 the same & then this wouldn&#39;t have  <br/>\n&gt; arisen. I did think about saying I could buy him more but I won&#39;t be  <br/>\n&gt; back at the shop before tomorrow and I&#39;m not sure if they&#39;re still  <br/>\n&gt; available.<br/>\n&gt;<br/>\n&gt; It doesn&#39;t matter too much as his cousins aren&#39;t expecting them (the  <br/>\n&gt; comments about them were back in the summer, we&#39;ve seen them lots  <br/>\n&gt; since & they&#39;ve never been mentioned, though I think they would be  <br/>\n&gt; excited to get them as a surprise).<br/>\n&gt;<br/>\n&gt; It just took me aback & I suppose I went into an automatic  <br/>\n&gt; (internal) response of how selfish so I&#39;d really appreciate any  <br/>\n&gt; comments about either how this fits developmentally or other ways I  <br/>\n&gt; could have handled it.<br/>\n&gt;<br/>\n&gt; I&#39;ve already learnt and benefitted a great deal from reading this  <br/>\n&gt; list, although still working on it all. This is my first post which  <br/>\n&gt; I hope is not too long :-)<br/>\n&gt;<br/>\n&gt; Many thanks, Abi<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Giving","postDate":"1259356922","msgId":48806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzQzMzOTFFLUQ5OTctNEUyOC1CNjdGLTEwMDlFQjkwQTZBQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhlcGQyMys2aDliQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlcGQyMys2aDliQGVHcm91cHMuY29tPg=="},"prevInTopic":48805,"nextInTopic":48807,"prevInTime":48805,"nextInTime":48807,"topicId":48804,"numMessagesInTopic":0,"msgSnippet":"-=A while ago, he had a sticker activity book we d got from the local shop that his 2 younger cousins (5 & 7) were really interested in. I said at the time if","messageBody":"<div id=\"ygrps-yiv-1744502537\">-=A while ago, he had a sticker activity book we&#39;d got from the local  <br/>\nshop that his 2 younger cousins (5 & 7) were really interested in. I  <br/>\nsaid at the time if I saw any more I&#39;d get one for them too.-=-<br/>\n<br/>\nYou didn&#39;t buy them for him.  I think as they were bought as a gift,  <br/>\nhe shouldn&#39;t have the option to keep them.  You could, though, offer  <br/>\nto buy him some other books (those or others).<br/>\n<br/>\nDover has some nice little sticker books and those are easily available.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":352545834,"authorName":"tiffermom@comcast.net","from":"tiffermom@...","profile":"tiffermomof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Giving","postDate":"1259356187","msgId":48805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NTA3MzM3NzMuNzYyNzMyMTI1OTM1NjE4NzMzNi5KYXZhTWFpbC5yb290QHN6MDAzOWEuZW1lcnl2aWxsZS5jYS5tYWlsLmNvbWNhc3QubmV0Pg==","inReplyToHeader":"PGhlcGQyMys2aDliQGVHcm91cHMuY29tPg=="},"prevInTopic":48804,"nextInTopic":48806,"prevInTime":48804,"nextInTime":48806,"topicId":48804,"numMessagesInTopic":0,"msgSnippet":"I think it is very normal for a five year old to not want to give away something.  I have had similar instants with all 4 of my kids around that age. ","messageBody":"<div id=\"ygrps-yiv-798316799\">I think it is very normal for a five year old to not want to give away something.  I have had similar instants with all 4 of my kids around that age.  Usually it is while buying a birthday gift for a friend or something like that.  If you are not against it maybe tell him he could give one to each cousin and then you could take him to the store to choose one more for himself at a later time.    If it really causes him distress I would just let him keep them since the other kids do not know about them.  Also if you tell him you bought them for his cousins and you want to give each of his cousins one too he may go along with it because it is what you want. <br/>\n<br/>\n<br/>\n<br/>\nTiffani <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;iblington&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:iblington@...\">iblington@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, November 27, 2009 12:33:07 PM GMT -08:00 US/Canada Pacific <br/>\nSubject: [AlwaysLearning] Giving <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nHi, <br/>\n<br/>\nmy son is 5 1/2 and tomorrow he is going to spend the morning with his cousins. <br/>\n<br/>\nA while ago, he had a sticker activity book we&#39;d got from the local shop that his 2 younger cousins (5 & 7) were really interested in. I said at the time if I saw any more I&#39;d get one for them too. <br/>\n<br/>\nSo when I saw the shop had some similar books in stock, I bought one of each, Ghosts, Pirates, Dinosaurs & Dragons. I showed them to my son this evening & said they were to take with him tomorrow. He could choose 2 to keep, we could start one tonight & he could take his other chosen one plus the extra 2 over with him tomorrow. Then he&#39;d bring his home while his cousins had one each to keep. <br/>\n<br/>\nHe did choose after some consideration but then a bit later he came & said he&#39;s not feeling like giving any of them away and he really wants to keep all of them. We discussed it a bit, I pointed out how he&#39;ll have 3 (including the original one which he still has) & I wouldn&#39;t have bought so many if it wasn&#39;t that 2 were for his cousins. <br/>\n<br/>\nA bit later he came back through (I was clearing up the kitchen) and said he&#39;d been thinking about it and wants to give just one to his cousins & they can share it. I said it was an idea but it&#39;s quite hard to use those books at the same time as someone else, to which he replied they could have half the book each and just cut it in two. <br/>\n<br/>\nI think I should have bought 3 the same & then this wouldn&#39;t have arisen. I did think about saying I could buy him more but I won&#39;t be back at the shop before tomorrow and I&#39;m not sure if they&#39;re still available. <br/>\n<br/>\nIt doesn&#39;t matter too much as his cousins aren&#39;t expecting them (the comments about them were back in the summer, we&#39;ve seen them lots since & they&#39;ve never been mentioned, though I think they would be excited to get them as a surprise). <br/>\n<br/>\nIt just took me aback & I suppose I went into an automatic (internal) response of how selfish so I&#39;d really appreciate any comments about either how this fits developmentally or other ways I could have handled it. <br/>\n<br/>\nI&#39;ve already learnt and benefitted a great deal from reading this list, although still working on it all. This is my first post which I hope is not too long :-) <br/>\n<br/>\nMany thanks, Abi <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":225471692,"authorName":"iblington","from":"&quot;iblington&quot; &lt;iblington@...&gt;","profile":"iblington","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Giving","postDate":"1259353987","msgId":48804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlcGQyMys2aDliQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48805,"prevInTime":48803,"nextInTime":48805,"topicId":48804,"numMessagesInTopic":0,"msgSnippet":"Hi, my son is 5 1/2 and tomorrow he is going to spend the morning with his cousins. A while ago, he had a sticker activity book we d got from the local shop","messageBody":"<div id=\"ygrps-yiv-1187925593\">Hi,<br/>\n<br/>\nmy son is 5 1/2 and tomorrow he is going to spend the morning with his cousins.<br/>\n<br/>\nA while ago, he had a sticker activity book we&#39;d got from the local shop that his 2 younger cousins (5 & 7) were really interested in. I said at the time if I saw any more I&#39;d get one for them too.<br/>\n<br/>\nSo when I saw the shop had some similar books in stock, I bought one of each, Ghosts, Pirates, Dinosaurs & Dragons. I showed them to my son this evening & said they were to take with him tomorrow. He could choose 2 to keep, we could start one tonight & he could take his other chosen one plus the extra 2 over with him tomorrow. Then he&#39;d bring his home while his cousins had one each to keep.<br/>\n<br/>\nHe did choose after some consideration but then a bit later he came & said he&#39;s not feeling like giving any of them away and he really wants to keep all of them. We discussed it a bit, I pointed out how he&#39;ll have 3 (including the original one which he still has) & I wouldn&#39;t have bought so many if it wasn&#39;t that 2 were for his cousins.<br/>\n<br/>\nA bit later he came back through (I was clearing up the kitchen) and said he&#39;d been thinking about it and wants to give just one to his cousins & they can share it. I said it was an idea but it&#39;s quite hard to use those books at the same time as someone else, to which he replied they could have half the book each and just cut it in two.<br/>\n<br/>\nI think I should have bought 3 the same & then this wouldn&#39;t have arisen. I did think about saying I could buy him more but I won&#39;t be back at the shop before tomorrow and I&#39;m not sure if they&#39;re still available. <br/>\n<br/>\nIt doesn&#39;t matter too much as his cousins aren&#39;t expecting them (the comments about them were back in the summer, we&#39;ve seen them lots since & they&#39;ve never been mentioned, though I think they would be excited to get them as a surprise).<br/>\n<br/>\nIt just took me aback & I suppose I went into an automatic (internal) response of how selfish so I&#39;d really appreciate any comments about either how this fits developmentally or other ways I could have handled it.<br/>\n<br/>\nI&#39;ve already learnt and benefitted a great deal from reading this list, although still working on it all. This is my first post which I hope is not too long :-) <br/>\n<br/>\nMany thanks, Abi</div>","specialLinks":[]}],"prevTopicId":48825,"nextTopicId":48828}}