{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":139187074,"authorName":"Mark and Julie","from":"&quot;Mark and Julie&quot; &lt;mjsolich@...&gt;","profile":"foxymophandlemama32","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling tv/Video game use - question","postDate":"1085277150","msgId":94489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTgwMWM0NDA2OCQ5Y2ExZWE5MCQ1YjYwMWFkM0BteWNvbXB1dGVyPg==","referencesHeader":"PGNkLmQ1YjQyNTUuMmRlMGQ3OTdAYW9sLmNvbT4="},"prevInTopic":94463,"nextInTopic":0,"prevInTime":94488,"nextInTime":94490,"topicId":94453,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1659942115\">&lt;&lt;  In the end, the unschooling is looking more like<br/>\n  the 6yo is spending time ALONE doing the video games more often than not,<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n<br/>\n&gt;&gt; Two weeks in is WAY too early to say &quot;in the end...&quot;<br/>\n </span></blockquote>  It&#39;s not NEARLY the end.&gt;&gt;<br/>\n<br/>\nI agree. We&#39;ve been unschooling for 18 months and my eldest son Jesse (10)<br/>\nhas only just reached the place where he is interested  in turning off the<br/>\nTV and joining us in a game or some art or cooking....<br/>\n<br/>\nI had to put aside many expectations of how I thought unschooling would look<br/>\nand how it would make me feel, which was hard but it did make me focus way<br/>\nmore on building up a close relationship with each child and looking for the<br/>\ngood that was happening every day in their lives.<br/>\n<br/>\nNow I can see that what we have is so much better than that which I<br/>\nenvisioned and I feel great about it. It just takes time and patience and<br/>\nlots of &#39;biting of the tongue&#39; &lt;g&gt;.<br/>\n<br/>\n And don&#39;t forget to breathe &lt;g&gt;.  Sandra, that has to be the best  advice<br/>\never!<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling tv/Video game use - question","postDate":"1085242775","msgId":94463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkLmQ1YjQyNTUuMmRlMGQ3OTdAYW9sLmNvbT4="},"prevInTopic":94456,"nextInTopic":94489,"prevInTime":94462,"nextInTime":94464,"topicId":94453,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/22/04 7:56:57 AM, brewstersears@sympatico.ca writes: ","messageBody":"<div id=\"ygrps-yiv-1860036285\">In a message dated 5/22/04 7:56:57 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brewstersears@...\">brewstersears@...</a> writes:<br/>\n<br/>\n&lt;&lt;  In the end, the unschooling is looking more like<br/>\n<br/>\nthe 6yo is spending time ALONE doing the video games more often than not, &gt;&gt;<br/>\n<br/>\nTwo weeks in is WAY too early to say &quot;in the end...&quot;<br/>\n<br/>\nIt&#39;s not NEARLY the end.<br/>\n<br/>\nKirby has played video games since he was five.  He&#39;s nearly 18.  He will go <br/>\ndays without playing.  But Thursday night, he and Marty signed on to a new <br/>\nonline game, and he played seven hours straight yesterday.  Then he went to work <br/>\nand Marty got on for the rest of the day and evening.   <br/>\n<br/>\nI could say &quot;In the end, they will play new and exciting games a lot, and <br/>\nwill go days without playing anything,&quot;  but is this &quot;in the end&quot;?  The people <br/>\nwho talked Kirby into getting in on that game are two older friends.  One is <br/>\njust back from college for the summer, and the other is 22 or so, fully employed, <br/>\nlives in an apartment.    Neither of them were homeschooled. <br/>\n<br/>\nIn the end, people are different, but in the end, it&#39;s better for everyone <br/>\ninvolved if people are living peaceful lives of choices instead of being managed <br/>\nor micromanaged by parents.<br/>\n<br/>\n-=- Whenever I become occupied, making<br/>\n<br/>\nbreakfast, changing a diaper, answering the phone, helping his sister - he<br/>\n<br/>\nsees this as an opportunity to play VG&#39;s.  Or, sometimes just waking up in<br/>\n<br/>\nthe morning is enough reason to play VG&#39;s, and often it is not possible for<br/>\n<br/>\nme to be with him. -=-<br/>\n<br/>\nYou&#39;re making it about you.  The game is exciting and alluring to him.  He&#39;s <br/>\nnot plaing because you&#39;re changing a diaper.  Let him play!<br/>\n<br/>\n-=-I also really, really, enjoy doing the activities my<br/>\n<br/>\ndaughter enjoys, and we invite him along, but he often declines.  (not<br/>\n<br/>\nalways - it depends on the day and the VG he&#39;s playing). -=-<br/>\n<br/>\nOnce he really believes that you will let him play the minute he gets home, <br/>\nif he wants to, he&#39;ll be MUCH more willing to walk away from the game to do <br/>\nsomething else.<br/>\n<br/>\n-=-I&#39;m worried that the &quot;researched&quot; detriments to media use may apply in this<br/>\n<br/>\nsituation, and I&#39;d love to hear anyone&#39;s comments on this. -=-<br/>\n<br/>\nThey have to do with schoolkids.  Much of social science and even cognitive <br/>\nscience these days is in support of school and &quot;school success.&quot;   Without <br/>\nschool as a factor, very little of it applies.<br/>\n<br/>\n-=-I can&#39;t seem to get around the fact that he often plays<br/>\n<br/>\nVG&#39;s alone, without me there.-=-<br/>\n<br/>\nTry to figure out what emotions you&#39;re having.  Is it guilt? Is it <br/>\nfrustration that your vision of homeschooling doesn&#39;t match this week&#39;s reality?  Is it <br/>\njealousy?  Wistfulness that he&#39;s growing up?  I&#39;ve had all those feelings <br/>\nabout my kids.<br/>\n<br/>\n-=-Is this kind of<br/>\n<br/>\nmedia use, where I&#39;m not able to be there right with him for most, or even<br/>\n<br/>\nhalf of the time, truly unschooling? -=-<br/>\n<br/>\nDon&#39;t think of it as &quot;media use.&quot;  Don&#39;t look at the world as though your <br/>\nchild is on the far side and all this &quot;media&quot; is being &quot;used&quot; between you and him.<br/>\n<br/>\nUnschooling is about you providing him an environment in which he can learn <br/>\nhis own way.  So look at it from the viewpoint of you standing right behind <br/>\nhim, enabling him to do what&#39;s fascinating to him right now.   <br/>\n<br/>\nDoes he like Lego?  If he got a $90 Lego set and played with it for two days, <br/>\nwould you say &quot;Is this kind of Lego use, where I&#39;m not able to be there right <br/>\nwith him for most, or even half of the time, truly unschooling?&quot;  If he gets <br/>\ninto fantasy fiction in a few years and is reading some Cherryh or Card series <br/>\nand wants to be by himself in a corner, reading, and you just take him lunch <br/>\nand he keeps reading, would you even wonder to yourself, &quot;Is this kind of book <br/>\nuse, where I&#39;m not able to be there right with him for most, or even half of <br/>\nthe time, truly unschooling?&quot; <br/>\n<br/>\n-=And if it isn&#39;t, how have other<br/>\n<br/>\nfamilies balanced the different needs/wants of all their children to share<br/>\n<br/>\nin their lives as much as possible?-=-<br/>\n<br/>\nWith two younger children, it seems you might just want to see the bright <br/>\nside of his being obsessed with something in a safe place, while you can spend <br/>\nmore time with the others.  <br/>\n<br/>\nIt sounds like things are going great at your house!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling tv/Video game use - question","postDate":"1085235931","msgId":94456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1YjgwMWM0NDAwOCRhM2I3MWZlMCQwMjAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PDEwODUwNzM4MDEuMjg4NS44NTA2Mi5tMjNAeWFob29ncm91cHMuY29tPiA8MDAzYzAxYzQzZjY2JDZjZmRjMTQwJDY0MDFhOGMwQHJtYndjMT4="},"prevInTopic":94454,"nextInTopic":94463,"prevInTime":94455,"nextInTime":94457,"topicId":94453,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-608488190\">&lt;&lt; Michele wrote: My 6yo son has been loving the true switch to<br/>\nunschooling - he&#39;s playing video games at every opportunity (it&#39;s been about<br/>\n2 weeks), and is so excited, frustrated, angry, overjoyed, proud - you name<br/>\nit, the emotions are running high. &gt;&gt;<br/>\n<br/>\nWell, two weeks is not a long time to adjust to any change.  Maybe he&#39;s<br/>\nenjoying the chance to play whenever he can since that is new to him.  Maybe<br/>\nafter a while when he realizes that the choice to play will always be open<br/>\nto him he may start to choose other activities as well.  Or maybe not! ;-)<br/>\n<br/>\n&lt;&lt; Whenever I become occupied, making breakfast, changing a diaper,<br/>\nanswering the phone, helping his sister - he sees this as an opportunity to<br/>\nplay VG&#39;s. &gt;&gt;<br/>\n<br/>\nIt sounds like he&#39;s finding lots of opportunities to do something he really<br/>\nenjoys!  And it sounds like he may not be sure you&#39;ll always let him play<br/>\nwhenever he wants, if he&#39;s often waiting until you&#39;re occupied to start<br/>\nplaying.  Give yourselves some time to adjust to this new level of freedom.<br/>\n<br/>\n&lt;&lt; I also really, really, enjoy doing the activities my daughter enjoys, and<br/>\nwe invite him along, but he often declines.  (not always - it depends on the<br/>\nday and the VG he&#39;s playing). &gt;&gt;<br/>\n<br/>\nThat sounds like he&#39;s making good decisions for himself ... considering the<br/>\nactivity you have offered and then deciding what is right for him at that<br/>\ntime.<br/>\n<br/>\n&lt;&lt; I just am noticing that I am spending less time with my 6yo son since<br/>\nwe&#39;ve started unlimited VG use, and I&#39;m a bit saddened by it. &gt;&gt;<br/>\n<br/>\nOn issues like these I like to follow my gut feeling.  If you feel in your<br/>\nheart that you are not spending enough time with him, try to address that.<br/>\nYou said you are offering the other activities to him and he is choosing<br/>\nvideo games.  So work with that; enjoy and support his choices.  There are<br/>\nlots of ways you can get involved with your son during the day.  We are<br/>\noften moving the game consoles around the house depending on the game being<br/>\nplayed, the other activities going on in the house etc.  Can you and your<br/>\ndaughter do your activities in the same room as he&#39;s playing?  When he gets<br/>\nstuck or frustrated in a game you can search for help/hints online<br/>\n(gamefaqs.com is great for that).  You can chat with him when he comes to<br/>\nshare exciting moments (as you mentioned).  You can drop by and ask<br/>\nquestions about his progress.  You can keep the 2yo occupied when he&#39;s<br/>\ngetting in the way (btdt). ;-)  You can bring him drinks, snacks or meals<br/>\nwhen he&#39;s particularly busy with a game.  You can find shows and magazines<br/>\nrelated to what he enjoys playing and surprise him.<br/>\n<br/>\n&lt;&lt; Another point to mention, I guess, is that my husband LOVES VG&#39;s as well,<br/>\nand will often join my 6yo son in the evenings and play with him. &gt;&gt;<br/>\n<br/>\nThat&#39;s great that your son and dh can enjoy this activity together!<br/>\n<br/>\n&lt;&lt;  how have other families balanced the different needs/wants of all their<br/>\nchildren to share in their lives as much as possible? &gt;&gt;<br/>\n<br/>\nI listen to the kids.  If they&#39;re playing video games and calling me often<br/>\nto come see something, I take the time to hang out for a while because they<br/>\nseem to be at an exciting spot.  If I go try to hang out and I&#39;m asked to<br/>\nleave (usually by the oldest during complicated play - I guess I&#39;m too<br/>\ndistracting &lt;g&gt;), then I leave.  If I want to do something with them I try<br/>\nto suggest something interesting enough for them to join me.  Whether it&#39;s<br/>\ncrafts, gardening, watching movies or playing video games, it&#39;s just the<br/>\ngive and take of living together.<br/>\n<br/>\nMy 12 yo son often plays video games &quot;alone&quot; but he knows I&#39;m around.  Last<br/>\nnight he was particularly upset about something that happened playing online<br/>\nand he came upstairs to find and tell me.  We ended up talking for a couple<br/>\nhours, first upstairs then back downstairs while he vented about what went<br/>\nwrong, ran through is options, came up with a plan, and a backup plan and<br/>\nthen we came back up to watch X-Play.  ;-)  It&#39;s pretty rare that we&#39;ll chat<br/>\nfor that long but he knows I&#39;m around when he needs me.  I do check in with<br/>\nhim regularly throughout the day (bringing food, chatting etc.) and he comes<br/>\nto find me when he has a question or something to share.  As I said, I go<br/>\nwith my gut feel about how much time I am / am not spending with each of my<br/>\n3 kids and try to adjust accordingly.<br/>\n<br/>\nPam L<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.livingjoyfully.ca\">http://www.livingjoyfully.ca</a></div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling tv/Video game use -\tquestion","postDate":"1085234222","msgId":94454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRDRENDZFLjI3MjMzJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwM2MwMWM0M2Y2NiQ2Y2ZkYzE0MCQ2NDAxYThjMEBybWJ3YzE+"},"prevInTopic":94453,"nextInTopic":94456,"prevInTime":94453,"nextInTime":94455,"topicId":94453,"numMessagesInTopic":0,"msgSnippet":"... I think you re asking two separate questions but lumping them together. You re asking if the situation you have is okay and you re asking if video games","messageBody":"<div id=\"ygrps-yiv-1688234236\">on 5/21/04 2:49 PM, Michele Sears at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brewstersears@...\">brewstersears@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m worried that the &quot;researched&quot; detriments to media use may apply in this<br/>\n&gt; situation, and I&#39;d love to hear anyone&#39;s comments on this.<br/>\n<br/>\n </span></blockquote>I think you&#39;re asking two separate questions but lumping them together.<br/>\nYou&#39;re asking if the situation you have is okay and you&#39;re asking if video<br/>\ngames are okay.<br/>\n<br/>\nWhat if the situation were reversed and you loved playing video games but<br/>\nyour daughter enjoyed gardening. And she was in the garden as soon as you<br/>\nwere on the phone or as soon as she was up in the morning or any opportunity<br/>\nshe could grab to be outside.<br/>\n<br/>\nThe disconnection between your son and the family isn&#39;t because of the video<br/>\ngames. It&#39;s because he&#39;s choosing to do something that resides in a place<br/>\nthat&#39;s away from the family. Anything could draw one member of the family<br/>\naway. You maintain the connections the same way you&#39;d maintain the<br/>\nconnections with any activity. By being with them when you can. Talking<br/>\nabout their interests. Bringing them snacks.<br/>\n<br/>\nThe advantage to video games over gardening is that you could move the games<br/>\nand TV so he&#39;s in an area where the family is more likely to be. :-)<br/>\n<br/>\nIs *he* feeling disconnected? You can ask him if he&#39;s feeling separated and<br/>\nif he&#39;d like to be able to play where you are more.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":93086594,"authorName":"Michele Sears","from":"&quot;Michele Sears&quot; &lt;brewstersears@...&gt;","profile":"birthinlove","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling tv/Video game use - question","postDate":"1085165343","msgId":94453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2MwMWM0M2Y2NiQ2Y2ZkYzE0MCQ2NDAxYThjMEBybWJ3YzE+","referencesHeader":"PDEwODUwNzM4MDEuMjg4NS44NTA2Mi5tMjNAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":94454,"prevInTime":94452,"nextInTime":94454,"topicId":94453,"numMessagesInTopic":0,"msgSnippet":"Hello, I have read most of the articles about video game/tv use, and understand that controlling your child with your own values will not enrich their lives,","messageBody":"<div id=\"ygrps-yiv-1933655135\">Hello,<br/>\n<br/>\n  I have read most of the articles about video game/tv use, and understand<br/>\nthat controlling your child with your own values will not enrich their<br/>\nlives, along with the fact that many of you believe their are many benefits<br/>\nin the process of playing video games/tv.  My 6yo son has been loving the<br/>\ntrue switch to unschooling - he&#39;s playing video games at every opportunity<br/>\n(it&#39;s been about 2 weeks), and is so excited, frustrated, angry, overjoyed,<br/>\nproud - you name it, the emotions are running high.  However, my concern is<br/>\nthis (eveyone&#39;s comments on the Life Learning article has helped me to<br/>\ncristilize my concerns):  With 3 children in my house, the 2 oldest often<br/>\nwant to do opposite things, with my 6 yo son often wanting to do<br/>\nmedia-related activities, and my 8yo daughter wants to do gardening, crafts,<br/>\nscrapbooking.  The 2 yo follows me, and annoys his siblings by &quot;getting<br/>\ninto&quot; what they&#39;re doing.  In the end, the unschooling is looking more like<br/>\nthe 6yo is spending time ALONE doing the video games more often than not,<br/>\nand this is for a few reasons.  Whenever I become occupied, making<br/>\nbreakfast, changing a diaper, answering the phone, helping his sister - he<br/>\nsees this as an opportunity to play VG&#39;s.  Or, sometimes just waking up in<br/>\nthe morning is enough reason to play VG&#39;s, and often it is not possible for<br/>\nme to be with him.  I also really, really, enjoy doing the activities my<br/>\ndaughter enjoys, and we invite him along, but he often declines.  (not<br/>\nalways - it depends on the day and the VG he&#39;s playing).  Or, the 2yo gets<br/>\nin the way while he&#39;s playing, so the 6yo asks me to take the 2yo upstairs.<br/>\nI just am noticing that I am spending less time with my 6yo son since we&#39;ve<br/>\nstarted unlimited VG use, and I&#39;m a bit saddened by it.  I do join him at<br/>\nsome point each day, and play the VG a bit (I really suck!), and I&#39;ve made a<br/>\npoint to watch movies with him, which has been REALLY lovely and he really<br/>\nappreciates, but I can&#39;t seem to get around the fact that he often plays<br/>\nVG&#39;s alone, without me there.  Another point to mention, I guess, is that my<br/>\nhusband LOVES VG&#39;s as well, and will often join my 6yo son in the evenings<br/>\nand play with him.  My 6yo will also run across the house and share exciting<br/>\nmoments, if I&#39;m not in the basement with him, so I get included in that way.<br/>\nI&#39;m worried that the &quot;researched&quot; detriments to media use may apply in this<br/>\nsituation, and I&#39;d love to hear anyone&#39;s comments on this.  Is this kind of<br/>\nmedia use, where I&#39;m not able to be there right with him for most, or even<br/>\nhalf of the time, truly unschooling?  And if it isn&#39;t, how have other<br/>\nfamilies balanced the different needs/wants of all their children to share<br/>\nin their lives as much as possible?<br/>\n<br/>\n  Michele</div>","specialLinks":[]}],"prevTopicId":94481,"nextTopicId":94461}}