{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"D Klement","from":"D Klement &lt;klement@...&gt;","replyTo":"LIST","senderId":"W8POlzmHtEntgMsLUV4P9EyZCpBi2DhDCuhlEkgNTEKm0wpmuNJQ4hCKkMD2qIjqahbPZt9_OW6TnsQ9vi6U4INxyA0uQlRq","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Wall Street Journal  front page article","postDate":"950484398","msgId":6450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MTcuNjQ1MC45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":6449,"nextInTime":6451,"topicId":6450,"numMessagesInTopic":0,"msgSnippet":"After I sent Darryl to Chapters today to find me Fridays WSJ I went on newsgroups and found somebody had kindly posted the entire front page article there.....","messageBody":"<div id=\"ygrps-yiv-1161635222\">After I sent Darryl to Chapters today to find me Fridays WSJ I went on<br/>\nnewsgroups and found somebody had kindly posted the entire front page<br/>\narticle there.....<br/>\nEnjoy....<br/>\nBuzz(Debbie)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nHome-Schooled Kids Defy<br/>\n            Stereotypes, Ace SAT Test<br/>\n            By DANIEL GOLDEN<br/>\n            Staff Reporter of THE WALL STREET JOURNAL<br/>\n<br/>\n<br/>\n            ATLANTA -- Jason Scoggins will never graduate from high<br/>\nschool,<br/>\nhave a class rank or be recommended by his guidance counselor. But<br/>\nOglethorpe<br/>\nUniversity wants him anyway.<br/>\n<br/>\n<br/>\n            Jason, who is 17 years old, was home-schooled by his mother.<br/>\nAfter he scored 1,570 out of a possible 1,600 on his SAT<br/>\ncollege-admissions<br/>\ntest -- with a perfect 800 in math -- Oglethorpe invited him to compete<br/>\nwith<br/>\nother top applicants for five scholarships valued at about $100,000<br/>\napiece.<br/>\nOf the 94 prospects in the Jan. 22 contest, eight were home-schoolers, <br/>\neach with SATs above 1,300.<br/>\n<br/>\n            The high scores are no fluke. As the movement grows larger<br/>\nand<br/>\nmore diverse, evidence is mounting that home-schooling, once confined to<br/>\nthe<br/>\npolitical and religious fringe, has achieved results not only on par<br/>\nwith<br/>\npublic education, but in some ways surpassing it. Though home-schooling<br/>\nmay<br/>\nnever be feasible for most families, the data offer little comfort to<br/>\nthose<br/>\nwho advocate a standardized curriculum as the best hope for improving<br/>\nAmerican education. After all, each home-based<br/>\npupil follows a unique lesson plan.<br/>\n<br/>\n            Jason&#39;s twin brother, Jeremy, also home-schooled, scored<br/>\n1,480<br/>\non his SAT. &quot;I was afraid we were the rogues of the education<br/>\ncommunity,&quot; <br/>\nsays Jeremy, who plans to attend the University of Georgia or the<br/>\nGeorgia<br/>\nInstitute of Technology. &quot;It isn&#39;t that way anymore. People know that if<br/>\nwe&#39;ve been home-schooled, we&#39;ll do a little better than everyone else.&quot;<br/>\n<br/>\n            Though it is hard to track a movement that remains partly<br/>\nunderground, advocates say that 1.5 million children nationwide are<br/>\nbeing<br/>\ntaught at home; independent researchers put the figure closer to one<br/>\nmillion.<br/>\n<br/>\nThe federal Education Department estimated the total in 1996 at 700,000<br/>\nto<br/>\n750,000; it expects to issue a revised count soon. In any case,<br/>\nhome-schoolers far outnumber the 400,000 students attending charter<br/>\nschools,<br/>\na more mainstream alternative. Total public- and private-school<br/>\nenrollment in the U.S. is about 50 million.<br/>\n<br/>\n            The growth in home-schooling reflects not only religious or<br/>\neducational concerns, but also alarm over school violence. Soon after<br/>\nlast<br/>\nspring&#39;s Columbine High School murders, one home-schooling magazine ran<br/>\nthe<br/>\nheadline: &quot;Tragedy in Colorado: Isn&#39;t It Time Your Kids Were Safe at<br/>\nHome?&quot;<br/>\nThis past September, the start of the first new school year since the<br/>\nslayings, the number of registered home-schoolers in Colorado surged<br/>\n10.1%.<br/>\n<br/>\n            The SAT and the ACT, the nation&#39;s other major<br/>\ncollege-entrance<br/>\ntest, have begun asking exam takers whether they were home-schooled. The<br/>\n3,257 ACT takers and 2,219 SAT takers who last year identified<br/>\nthemselves as<br/>\nhome-schoolers are fewer than might be expected if a million or more<br/>\nstudents are being educated at home. But researchers say such students <br/>\noften are reluctant to declare themselves for privacy reasons or for<br/>\nfear of<br/>\ndiscrimination. Moreover, many taught at home in lower grades later<br/>\nattend<br/>\nhigh school.<br/>\n<br/>\n            Nonetheless, self-identified home-schoolers have bettered<br/>\nthe<br/>\nnational averages on the ACT for the past three years running, scoring<br/>\nan<br/>\naverage 22.7 last year, compared with 21 for their more traditional<br/>\npeers,<br/>\non a scale of one to 36. Home-schoolers scored 23.4 in English, well<br/>\nabove the<br/>\n20.5 national average; and 24.4 in reading, compared with a mean of<br/>\n21.4.<br/>\nThe gap was closer in science (21.9 vs. 21.0), and home-schoolers scored<br/>\nbelow<br/>\nthe national average in math, 20.4 to 20.7.<br/>\n<br/>\n            On the SAT, which began its tracking last year,<br/>\nhome-schoolers<br/>\nscored an average 1,083 (verbal 548, math 535), 67 points above the<br/>\nnational <br/>\naverage of 1,016. Similarly, on the 10 SAT2 achievement tests most<br/>\nfrequently <br/>\ntaken by home-schoolers, they surpassed the national average on nine,<br/>\nincluding <br/>\nwriting, physics and French.<br/>\n<br/>\n            Income and Achievement<br/>\n<br/>\n            With average family incomes of $40,000 to $50,000, lower<br/>\nthan<br/>\nthe $50,000-to-$60,000 median rung, the home-schoolers defied the<br/>\ndemographic<br/>\ncorrelation between high incomes and high SAT scores. They also<br/>\ncontradict<br/>\nthe stereotype that they are strictly rural white fundamentalists.<br/>\nNearly 4%<br/>\nare black. Another 4% are Hispanic. And their parents have more<br/>\neducation<br/>\nthan the national norm.<br/>\n<br/>\n                  Join the Discussion: What will the trend towards<br/>\nhome-schooling mean for the U.S. education system? Can home-schooling<br/>\ntechniques be used in public education?<br/>\n<br/>\n            Maralee Mayberry, chairwoman of the sociology department at<br/>\nthe<br/>\nUniversity of Nevada at Las Vegas and author of a book on<br/>\nhome-schooling,<br/>\nwarns that the data only document the existence of a top tier of<br/>\nhome-school<br/>\nwhiz kids; there also may be an unstudied bottom layer of failures.<br/>\nStill,<br/>\nshe says, research has shown that the key elements in effective<br/>\neducation<br/>\nare small class size, individualized instruction, and a disciplined,<br/>\nnurturing<br/>\nenvironment -- all characteristics of home-schooling.<br/>\n<br/>\n            Sandra Feldman, president of the American Federation of<br/>\nTeachers, says the test data don&#39;t cast doubt on the value of teachers. <br/>\n&quot;Why draw any grand conclusions?&quot; she asks, since so few home-schoolers<br/>\ntake <br/>\nthe SAT and ACT. &quot;I just say I&#39;m happy for them. These are parents who<br/>\nare very <br/>\nhighly motivated, teaching their kids at home and doing a very good<br/>\njob,&quot; she says.<br/>\nShe adds, however, that public schools need to do more to challenge<br/>\ngifted<br/>\nstudents if they are to avoid losing some of them to home-schooling.<br/>\n<br/>\n            Once in college, home-schoolers appear to be living up to<br/>\ntheir<br/>\ntest scores. Those enrolled at Boston University in the past four years<br/>\nhave<br/>\na 3.3 grade-point average, out of a perfect four. Similarly, Georgia&#39;s<br/>\nKennesaw State University found that its home-schooled students had<br/>\nhigher-than-average GPAs as college freshmen.<br/>\n<br/>\n            At Kennesaw State, both the president and the vice president<br/>\nof<br/>\nthe student government were educated at home. The president, John M.<br/>\nFuchko<br/>\nIII, whose mother began teaching him after he was labeled hyperactive in<br/>\nkindergarten, says home-schoolers will change college as much as college<br/>\nchanges them. He predicts that they will pressure colleges to<br/>\nindividualize<br/>\ninstruction and stop insisting on surve courses as prerequisites for<br/>\nmore<br/>\nadvanced studies.<br/>\n<br/>\n            &quot;In home-schooling, you don&#39;t have to sit for half a year<br/>\nstudying something you already know,&quot; says the 22-year-old senior. &quot;If<br/>\nyou&#39;re prepared to go to the next level, you take it to the next level.<br/>\nHome-schooling breeds enterprising people.&quot;<br/>\n<br/>\n            That enterprise has impressed many secular colleges, and<br/>\nmost<br/>\nhave modified their admissions policies to accommodate home-schoolers. A<br/>\nrecent survey by the National Center for Home Education, a<br/>\nVirginia-based<br/>\nadvocacy group, found that 68% of colleges now accept parent-prepared<br/>\ntranscripts or portfolios in place of an accredited diploma. That<br/>\nincludes<br/>\nStanford University, which last fall accepted 27% of home-schooled<br/>\napplicants<br/>\n-- nearly double its overall acceptance rate.<br/>\n<br/>\n            Valuable Skills<br/>\n<br/>\n            &quot;Home-schoolers bring certain skills -- motivation,<br/>\ncuriosity,<br/>\nthe capacity to be responsible for their education -- that high schools<br/>\ndon&#39;t induce very well,&quot; says Jon Reider, Stanford&#39;s senior associate<br/>\ndirector <br/>\nof admissions.<br/>\n<br/>\n            Despite such inroads, religious colleges still draw a<br/>\ndisproportionate number of home-schoolers. For example, at Oral Roberts<br/>\nUniversity in Tulsa, Okla., 309 students -- more than 10% of the student<br/>\nbody were home-schooled for at least a year. Oral Roberts offers a<br/>\n$2,000<br/>\nscholarship for home-schoolers, while Nyack College, a Christian school<br/>\nin<br/>\nNyack, N.Y., provides as much as $12,000. And this fall, Christian<br/>\nhome-schoolers are planning to open their own college in Purcellville,<br/>\nVa.<br/>\n<br/>\n            Skepticism about home-schoolers&#39; credentials lingers,<br/>\nhowever.<br/>\nThe American Association of Collegiate Registrars and Admissions<br/>\nOfficers<br/>\nwarned members last December that the rise in home-schooling creates<br/>\n&quot;significant potential for conflict&quot; with applicants because colleges<br/>\nmay<br/>\nneed &quot;supplementary materials&quot; to gauge academic preparedness.<br/>\n<br/>\n            In 1997, North Carolina and New Mexico restricted public<br/>\ncolleges from asking home-schooled applicants to submit more test scores <br/>\nthan regular applicants. But that same year, Georgia&#39;s board of regents <br/>\ntightened state-college admissions rules for home-schoolers, requiring<br/>\nthem <br/>\nto pass eight SAT2 subject tests, which are entirely optional for other<br/>\nstudents;<br/>\nthey also face hurdles in getting financial aid. Georgia&#39;s Hope<br/>\nscholarship<br/>\nprogram pays all tuition at state colleges for Georgia high-school<br/>\ngraduates<br/>\nwith B averages who don&#39;t get federal financial aid. But home-schoolers<br/>\nqualify only retroactively, if they earn a B average as college<br/>\nfreshmen.<br/>\n<br/>\n            Exploiting a Niche<br/>\n<br/>\n            The disparity has angered home-schoolers -- and helped<br/>\ncreated a<br/>\nniche for Oglethorpe, which hopes to boost full-time enrollment to 1,000<br/>\nfrom 800 and its endowment to $100 million from $32 million. &quot;When we<br/>\nstarted<br/>\ngoing after home-schoolers, I thought it would be a gold mine,&quot; says<br/>\nAdmissions Director Barbara Henry. &quot;The trouble is, other colleges<br/>\nstarted<br/>\naccepting them, too.&quot;<br/>\n<br/>\n            Mrs. Henry, who says she used to dismiss home-schoolers as<br/>\n&quot;crackpots&quot; before she got to know them, has positioned Oglethorpe as<br/>\ntheir<br/>\nhome away from home. The school hosts home-school curriculum fairs on<br/>\nits<br/>\nfaux-Oxford campus, lets home-schoolers use its athletic facilities, and<br/>\nencourages precocious 14- and 15-year-olds to enroll part time. To stay<br/>\nahead in the recruitment race, it also has started including<br/>\nhome-schoolers <br/>\nin its annual scholarship competition. Last year, for the first time, a<br/>\nhome-schooler won one of the full scholarships.<br/>\n<br/>\n            Maggie Bryson, the winner, had become so bored in fifth<br/>\ngrade<br/>\nthat she refused to go back to school. Her mother, a nurse, shortened<br/>\nher<br/>\nown work hours and began home-schooling her daughter. When Maggie was<br/>\n13, her<br/>\nmother sent her for physical education to Oglethorpe, where track coach<br/>\nBob<br/>\nUnger had started a weekly track-and-field class for home-schoolers. Two<br/>\nyears later, Maggie began taking academic courses there. With a 1,430<br/>\nSAT<br/>\nscore, including 800 on the verbal, she applied<br/>\nto eight colleges and was accepted at seven, including Oglethorpe.<br/>\n<br/>\n            Vocal and Direct<br/>\n<br/>\n            Now a freshman, Ms. Bryson has an A-minus average and is<br/>\nteaching herself Arabic and ancient Egyptian hieroglyphics in her spare <br/>\ntime. But she still is adapting to classroom etiquette. &quot;We<br/>\nhome-schoolers <br/>\ntend to be very vocal and talk to the professor directly,&quot; she says.<br/>\n&quot;It might bother other students a little bit.&quot;<br/>\n<br/>\n            Jason Scoggins is no intellectual wallflower, either. He was<br/>\nso<br/>\ninfuriated at being ineligible for a &quot;star student&quot; honor given by a<br/>\nteachers&#39; union -- the award is based partly on class rank -- he<br/>\nconsulted a<br/>\nlawyer. He has written to Georgia state universities, criticizing extra<br/>\ntesting requirements for home-schoolers. Both he and Jeremy, who have <br/>\nentered into a friendly test-taking rivalry, aced the SAT2 subject tests<br/>\nand <br/>\nhave taken so many advanced-placement tests, which are scored on a<br/>\none-to-five <br/>\nscale and confer college credits, that they could enter college as<br/>\nsophomores.<br/>\n<br/>\n            &quot;I&#39;ve taken eight advanced-placement exams and gotten fives<br/>\non<br/>\nall of them,&quot; says Jason. &quot;He&#39;s taken seven and gotten fives on four of<br/>\nthem.&quot;<br/>\n<br/>\n            &quot;He can&#39;t stand for me to score better than he does,&quot; Jeremy<br/>\nshrugs. &quot;So far, I haven&#39;t.&quot;<br/>\n<br/>\n            Financial aid is likely to determine where the twins go to<br/>\ncollege, and whether they can afford to live on campus. Their father,<br/>\nMickey<br/>\nScoggins, who didn&#39;t attend college, supports his wife and five children<br/>\n--<br/>\nthe twins; Joshua, 15; Jonathan, 9; and baby Joanna -- with his job as a<br/>\nfurniture-store manager. But the Scogginses, who own a modest house on a<br/>\nthree-acre wooded lot in Monroe, 35 miles east of Atlanta, say they<br/>\ndon&#39;t<br/>\nhave enough money for college tuitions.<br/>\n<br/>\n            The twins have been taught at home since fourth grade by<br/>\ntheir<br/>\nmother, Ellen Scoggins, who is also teaching Joshua and Jonathan. A<br/>\ndevout<br/>\nChristian and former public-school teacher, with a master&#39;s degree in<br/>\neducation, she believes that academics come first; neither twin may have<br/>\na<br/>\ngirlfriend before college.<br/>\n<br/>\n            Virtual-Reality Frogs<br/>\n<br/>\n            At first, Mrs. Scoggins used a curriculum from Bob Jones<br/>\nUniversity in Greenville, S.C., which sells texts and educational<br/>\nservices<br/>\nfor home-schoolers. Later, she experimented with other materials. The<br/>\nfamily<br/>\nspends $3,000 a year on textbooks, computer programs and exam fees and<br/>\nmakes<br/>\nextensive use of the local library. The twins use the Internet as well, <br/>\ndissecting virtual-reality frogs for biology.<br/>\nTheir mother grades their schoolwork. Jason&#39;s grade-point average is<br/>\n3.97,<br/>\nmarred only by a B in Latin. Jeremy is a close second, at 3.91.<br/>\n<br/>\n            In his spare time, Jason participates in 4-H and Gavel Club,<br/>\na<br/>\npublic-speaking organization, or watches his favorite TV show, &quot;Who<br/>\nWants to<br/>\nBe a Millionaire?&quot; To his regret, he is a year too young to be a<br/>\ncontestant.<br/>\nBut he can pursue another lucrative prize -- the Oglethorpe scholarship.<br/>\n<br/>\n            In the lobby of the Oglethorpe performing-arts center, many<br/>\nof<br/>\nthe contestants are fidgeting, aware that their comments in two<br/>\nseminars,<br/>\nand a writing assignment, will determine their financial aid. (Losers<br/>\nare<br/>\nguaranteed $10,500 a year, or $42,000.) But Jason seems serene. &quot;It&#39;s<br/>\nalmost<br/>\nlike a nice philosophical debate with some friends,&quot; he says.<br/>\n<br/>\n            Once they split into groups for the first seminar, he is<br/>\nready.<br/>\nHis head cocked to one side, Jason listens as other students begin<br/>\ndiscussing<br/>\na subject he has considered before: the travails of American education<br/>\n--<br/>\nand, specifically, the work of E.D. Hirsch Jr., a leading proponent of<br/>\nthe<br/>\nidea that schools are failing because there is no national canon.<br/>\n<br/>\n            Jason has another view: Public schools will never excel<br/>\nbecause<br/>\nthey lack &quot;intellectual capital&quot; and have to compensate for too many<br/>\nsocial<br/>\nproblems. &quot;They have drug-education programs that take away from the<br/>\nthree<br/>\nR&#39;s,&quot; he says. &quot;I haven&#39;t been in real schools very often. But when I&#39;ve<br/>\nseen them, they&#39;re wild. The parents don&#39;t care enough. I know it&#39;s said<br/>\nthat<br/>\nschools should be agents of socialization. But that&#39;s not their role.<br/>\nTheir<br/>\nrole is to impart knowledge.&quot;<br/>\n<br/>\n            The other students gape, astonished by the attack, and<br/>\nsomewhat<br/>\ndefensive. &quot;My friends are all ghetto kids,&quot; says Joseph &quot;Jo Jo&quot;<br/>\nBrisendine<br/>\nfrom Rockdale County High School in Conyers, Ga. &quot;They&#39;re smarter than<br/>\nyou<br/>\ngive them credit for.&quot;<br/>\n<br/>\n            The next day, an ice storm shuts down Oglethorpe&#39;s phones.<br/>\nBut<br/>\nDennis Matthews, dean of enrollment management, reaches the Scogginses<br/>\non a<br/>\ncell phone with the news. Jason has tied for the top score and won a<br/>\nfull<br/>\nscholarship. Less demonstrative than the TV millionaires, Jason quietly<br/>\nsays, &quot;Thank you.&quot; Then he gives his mother, who is coaxing the baby <br/>\nto take a nap,the thumbs-up sign.<br/>\n<br/>\n-- <br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   <br/>\n The Klement Family       &quot;Education is what survives when <br/>\n Darryl, Debbie,           what has been learned has been <br/>\n Kathleen, Nathan &        forgotten&quot;<br/>\n Samantha                  B.F. Skinner in &quot;New Scientist&quot;.<br/>\n e-mail- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:klement@...\">klement@...</a> <br/>\n Canadian homeschool page: http:&#92;&#92;www.flora.org/homeschool-ca/<br/>\n Ont. Federation of Teaching Parents: http:&#92;&#92;www.flora.org/oftp/ <br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~</div>","specialLinks":[]}],"prevTopicId":6445,"nextTopicId":6432}}