{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":34,"messages":[{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...","replyTo":"LIST","senderId":"fFCIaPOLgIP_W6NqTsiTjMhy-B1z2ODkytVDxFD93bIBLoFdpuz_9Tu7tXyG_yN4lJuVjEGuK-j6MtMbybDf03DujPdC3LM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928616678","msgId":577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41NC41NzcuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":563,"nextInTopic":590,"prevInTime":576,"nextInTime":578,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Hi Lois: Thanks for your thoughtful response. Your family s college experience sounds wonderful; your children had the benefit of varied resources and a wide","messageBody":"<div id=\"ygrps-yiv-1192477032\">Hi Lois:<br/>\n<br/>\nThanks for your thoughtful response. Your family&#39;s college experience<br/>\nsounds wonderful; your children had the benefit of varied resources and a<br/>\nwide range of contacts while there with you. Yes, public school is very<br/>\ndivisive to the family unit, separating siblings and children and parents.<br/>\nI hated that feeling that something was not quite right when my son went on<br/>\nthat schoolbus.<br/>\n<br/>\nI have to say that my parents have gradually tried to understand my<br/>\nmotivations for wanting to try homeschooling, although they still question<br/>\n&quot;how will he (my son) learn everything he has to know?&quot;  And  &quot;how are you<br/>\ngoing to make him to learn about subjects that he doesn&#39;t like?&quot;  I try to<br/>\nexplain my feelings: I don&#39;t think because a state school board decides<br/>\nwhat children should know that this is the definitive book of knowledge.<br/>\nAnd no, I am not going to force him to &quot;study&quot; a subject that is of no<br/>\ninterest to him right now; that would only push him further away from it.<br/>\nWe saw that happen in school this year. The school instituted a mandatory<br/>\nreading program complete with a competition and prizes. My son had learned<br/>\nby himself to read at about age 4, and had always enjoyed reading with me<br/>\nat bedtime. But now, because he was forced to do it, he didn&#39;t want to read<br/>\nanymore, especially at the end of the program. He is gradually coming back<br/>\nto reading, but only the books he likes, not the ones recommended in school.<br/>\n<br/>\nI wish I had had the option to learn at home when I was a child. I was very<br/>\nshy and terrified of tests and failing, even though I was a &quot;model&quot;<br/>\nstudent. I would have preferred to stay home and read and draw and make<br/>\nthings with my mom. But if you had asked me then, I would probably have<br/>\nsaid I liked school because I thought I should like it. Our culture<br/>\nrevolves around &quot;education&quot; (not learning) as a rite of passage. Too bad it<br/>\nis a rite that is a trial-by-fire.<br/>\n<br/>\nI look forward to hearing more of your comments!<br/>\n<br/>\nOlivia</div>","specialLinks":[]},{"userId":0,"authorName":"Lois Hoover","from":"Lois Hoover &lt;lhoover@...","replyTo":"LIST","senderId":"hxcO5AbJB1uEpDL8v7R2z1bqqVK-Rm1xrj7o10woBvV7dsOJue0K2D0_eGGqe0VAqxNDhTNbCKYR5G7OxWc9n6ke7326","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928605207","msgId":563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41NC41NjMuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":548,"nextInTopic":577,"prevInTime":562,"nextInTime":564,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"... Hi Olivia, How I wish that  I had been smart enough to search out options when mine were that age.  I watched my first born climb onto that huge bus on the","messageBody":"<div id=\"ygrps-yiv-358590811\"><blockquote><span title=\"ireply\">&gt;From: Olivia &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liv2learn@...\">liv2learn@...</a>&gt;<br/>\n&gt;&gt;<br/>\n&gt;I am new to this list so I guess I should  just jump in and introduce<br/>\n&gt;myself. My name is Olivia and I live in Mass. We will &quot;officially&quot; be<br/>\n&gt;homeschooling/unschooling one 6yo at the end of kindergarten this June. In<br/>\n&gt;reality, we will simply be going back to the kinds of fun things we had<br/>\n&gt;time to do before the intrusion of school schedules.<br/>\n<br/>\n </span></blockquote>Hi Olivia,<br/>\n<br/>\nHow I wish that  I had been smart enough to search out options when mine<br/>\nwere that age.  I watched my first born climb onto that huge bus on the<br/>\nfirst of many morning with a gut feeling that this was wrong. My children<br/>\nhad attended a wonderful daycare in the center of my college, and that<br/>\nseemed okay. I had scheduled my classes so as not to have to be there all<br/>\nday or even every day. The boys felt like they were living a part of my<br/>\nlife at the same time. That may sound strange, but by the time that I<br/>\ngraduated they knew things about the university that I hadn&#39;t known until<br/>\nthey told me, they visited the planetarium, the biology museum, the library<br/>\nand more. But ps that was different. I wasn&#39;t there to stop in between<br/>\nclasses and take them out with me, we couldn&#39;t walk over the bridge now and<br/>\ntell the story of the three trolls like we&#39;d done. Where the day care<br/>\nallowed us to remain a family unit still, ps took my son away from me. I<br/>\nwas now only supposed to show up if invited which bothered me. The things<br/>\nmy son came home with were horrible, and he began to wet himself out of<br/>\nfear almost everyday.  I knew it was wrong but didn&#39;t know I had an option.<br/>\nEach day seemed to get worse, until at the end of his 6th grade, he left<br/>\nand has slowly become a wonderful teen with a great deal of self esteem and<br/>\nself respect finally.<br/>\n<br/>\n<br/>\n I am a little nervous<br/>\n<blockquote><span title=\"ireply\"> &gt;about mentioning to people that my son will not be going to first grade in<br/>\n&gt;the fall; I hate having to explain our reasons over and over again to that<br/>\n&gt;puzzled or disapproving look on people&#39;s faces.<br/>\n<br/>\n </span></blockquote>Maybe you don&#39;t have to. Not many around us even think about it. And some<br/>\nwho do are so supportive, many with smaller children will ask questions and<br/>\nremark how they have decided to keep their children home also. To those who<br/>\nhave questioned, I have different approaches. To the cashier at the grocery<br/>\nstore or something who asks why? I simply remark &quot;because we love it&quot; and<br/>\nkeep on with my business at hand. Friends I&#39;ve answered more indepth when<br/>\nthey are serious and not just trying to show me the errors of my ways. But<br/>\nI&#39;ve walked away from friendships which had lasted up til then almost 15<br/>\nyears because I wouldn&#39;t take being treated disrespectfully for our<br/>\ndecisions. Family, well, after telling them why, if they didn&#39;t accept it I<br/>\nsimply said that they had the chance to make the decisions they felt were<br/>\nappropriate for their families and now it was our chance to make our<br/>\ndecisions. I also told them I wouldn&#39;t tolerate disrespect from them for<br/>\nour decisions over education.  That worked and now even my grandparents who<br/>\nin the beginning were very against it are thrilled by the way my children<br/>\nhave blossomed in the two years we&#39;ve been home together.<br/>\n <br/>\n<br/>\n Also, I worry about my<br/>\n<blockquote><span title=\"ireply\"> &gt;only-child son not having  many non-adult playmates available once public<br/>\n&gt;school resumes in September. We are working on finding similarly-minded<br/>\n&gt;families in the area.<br/>\n&gt;<br/>\n </span></blockquote>I wouldn&#39;t worry about that too much IMO, I find that the younger the<br/>\nchild, the less they seem to need others in the same age group around. As<br/>\nthey mature, they tend to find one or two close friends within a couple<br/>\nyear age span and keep those friends for most of their lives. Even in<br/>\nschool, I didn&#39;t have many friends and those I did, didn&#39;t even go to my<br/>\nschool.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I wasn&#39;t going to post just yet, but Julie&#39;s comments about &quot;manufactured&quot;<br/>\n&gt;children struck a chord with me. While sitting on the sidelines of my son&#39;s<br/>\n&gt;sporting events and on a recent school field trip, I had the chance to hear<br/>\n&gt;lots of conversations about how &quot;busy&quot; kids are: that is, how they are<br/>\n&gt;shuttled from one place to another while parents work. <br/>\n<br/>\n </span></blockquote>This is true it seems everywhere (at least in the US) While my boys played<br/>\nlocal soccer for years, parents would ask us if they played baseball at the<br/>\nsame time, I&#39;d say no we chose one sport for summer, they&#39;d ask which<br/>\nsoccer traveling league we were on, I&#39;d say none that the costs and time<br/>\ntook too much from other activities that we wanted. I was told that it&#39;s a<br/>\nparents responsiblity to provide all this, it was as if becoming a slave<br/>\nwith a vehicle was what turned out good children. I didn&#39;t agree and found<br/>\nthat while the season for soccer seemed too short at times, my children<br/>\ndidn&#39;t desire/want the hectic schedule that these families believed they<br/>\nhad to have.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wonder how many kids who say they like school do so<br/>\n&gt;only to please parents, or because school is better than the alternative of<br/>\n&gt;all-day day-care or being home alone.<br/>\n&gt;<br/>\n </span></blockquote>Isn&#39;t it amazing how many say they love school. I have a friend who&#39;s<br/>\nchildren still go to school. her daughter (10) tells us how much she likes<br/>\nschool, then she will ask my 11 yo son what he did today. He will tell her<br/>\nand she will remark with &quot;Not fair!&quot;.  I don&#39;t think many know they have an<br/>\noption or because school starts at such an early age, they can&#39;t imagine a<br/>\nlife outside of school.  When my boys were in school, they came home to<br/>\nwant to veg out in front of the tv, summer vacations became boring, and<br/>\nthey really didn&#39;t have many interests. But once the decision was made to<br/>\nhs and they had their time to deschool they came up with several hobbies<br/>\nand found ways that were enjoyable to fill their time. Now they can&#39;t<br/>\nimagine sitting in a classroom all day anymore.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;OK, thanks for sharing the soap-box! LOL<br/>\n&gt;(Next time I&#39;ll try for not so long and rambling!)<br/>\n&gt;<br/>\n </span></blockquote>Don&#39;t do that, I enjoyed your ramble.<br/>\n<br/>\nLois</div>","specialLinks":[]},{"userId":0,"authorName":"KintHM@xxx.xxx","from":"KintHM@...","replyTo":"LIST","senderId":"54oT07nnUbkEgh3hLJuxVUfeuIO5YWQb_WhlrhdAbG2u5eH287p1pf2Y6Dnq4XqpY6a_N50","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928598473","msgId":548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41My41NDguOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":538,"nextInTopic":563,"prevInTime":547,"nextInTime":549,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/5/1999 8:14:56 AM Pacific Daylight Time, Pinderscmb@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-580065562\">In a message dated 6/5/1999 8:14:56 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Pinderscmb@...\">Pinderscmb@...</a> writes:<br/>\n<br/>\n&lt;&lt; Perhaps you touched a nerve with you friend and it was a sensitive one at <br/>\n that.  Some people are uncomfortable with being challenged to look at <br/>\n something differently.  She may have felt threatened by the information.  <br/>\n Maybe she didn&#39;t like thinking that she wasn&#39;t doing the best thing for her <br/>\n kids and that made her feel bad.  &gt;&gt;<br/>\n<br/>\nI had a friend like that a few years ago. She was constantly belittling our <br/>\nchoice to homeschool and making me feel rotten (I am NOT a person who likes <br/>\nto argue). I finally figured out that she was angry with me because I was <br/>\ntrying to be different and she can&#39;t understand that concept. She has to have <br/>\nthe cars, house, clothes ect that everyone else has, and that I stepped out <br/>\nof her comfort zone was scary for her. I try very hard NOT to discuss our <br/>\nhomeschooling life simply because I don&#39;t want to make others feel like I&#39;m <br/>\nputting them down for their educational choices. So while my friends rant and <br/>\nrave about the school system, I just keep my mouth shut and smile. <br/>\n<br/>\nMarti In Wa</div>","specialLinks":[]},{"userId":0,"authorName":"Pinderscmb@xxx.xxx","from":"Pinderscmb@...","replyTo":"LIST","senderId":"Zb0w3cnB983xoDWVS9i8FwnnoYB6cdK7-GaFTURpUYxhH8HkPdvnY7gQBlhq5IKDoWq-mTNEEvtE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928595653","msgId":538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41My41MzguOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":514,"nextInTopic":548,"prevInTime":537,"nextInTime":539,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Robin, Perhaps you touched a nerve with you friend and it was a sensitive one at that.  Some people are uncomfortable with being challenged to look at ","messageBody":"<div id=\"ygrps-yiv-990938592\">Robin, <br/>\nPerhaps you touched a nerve with you friend and it was a sensitive one at <br/>\nthat.  Some people are uncomfortable with being challenged to look at <br/>\nsomething differently.  She may have felt threatened by the information.  <br/>\nMaybe she didn&#39;t like thinking that she wasn&#39;t doing the best thing for her <br/>\nkids and that made her feel bad.  I don&#39;t discuss this with my sister at all. <br/>\n She sends her kids to preschool which is really an all day daycare center <br/>\nunder the guise of a school and the older one goes to school.  If I told her <br/>\nabout the reasons why I homeschool, she would definitely think I was <br/>\ncriticizing here and saying that she was a bad mother.<br/>\n<br/>\nCindy</div>","specialLinks":[]},{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...","replyTo":"LIST","senderId":"us6Fk76KtOk0Hrh-VPAA0zfWSWwQQG-AqJvMIENUAyKOsyZbTg781gvXc9CjQOCNTqE53alUTIvZjHf03XX26cer2JDjVHw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928563249","msgId":514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41Mi41MTQuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":511,"nextInTopic":538,"prevInTime":513,"nextInTime":515,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Teresa: Of course I had to check my mail before I went to bed!  I think my friend is not having people ask about homeschooling in a pleasant, ","messageBody":"<div id=\"ygrps-yiv-83360936\">Teresa:<br/>\n<br/>\nOf course I had to check my mail before I went to bed!  I think my friend<br/>\nis not having people ask about homeschooling in a pleasant,<br/>\ninformation-seeking way, but rather it&#39;s putting her in a defensive<br/>\nposition. She doesn&#39;t want to have to spend all of her visit, every visit,<br/>\nexplaining that they are really doing ok, that the kids are happy, and this<br/>\nis truly the best option for their family. Sometimes it&#39;s nice just to have<br/>\nfriendly conversation. I guess she&#39;s been having some negative responses<br/>\nfrom friends, and in front of her kids. We love to talk about homeschooling<br/>\n to interested parties, but always defending oneself can be draining. ( I<br/>\ndo appreciate all the help people have given me during my homeschooling<br/>\nresearch, and, maybe someday (I hope) when I have more experience, I can<br/>\nshare that help too.) Right now we need to build our confidence first.<br/>\n<br/>\nSorry, I really didn&#39;t mean to agitate you just before bedtime!  Thanks for<br/>\nyour perspective!<br/>\n<br/>\nOlivia<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;wow, I was just about to go to bed, but reading your note got me!  <br/>\n&gt;I guess it all depends on how you look at things.  I find that I love it when <br/>\n&gt;people want to talk to me about homeschooling.  I guess I am a teacher at <br/>\n&gt;heart, but I love to help newbies.  No one ever helped me, I just sorta had <br/>\n&gt;to fend for myself, guess that is why I am not much into joining groups.  <br/>\n&gt;Even new people to chat rooms on AOL.  I like to help, someone did take the <br/>\n&gt;time to help me learn how to download and play wavs, and new people never <br/>\n&gt;know how.  Anyway, my point, I would find this a great teaching experience <br/>\n&gt;instead of feeling weird.  I so enjoy what I do that I can&#39;t resist talking <br/>\n&gt;about it.  So....., no, I don&#39;t think we need to get new friends, just look <br/>\n&gt;at the situation in a different light.  If it still bothers you, or rather <br/>\n&gt;your friend, then you might want to get new friends!! <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Hsmotgo@xxx.xxx","from":"Hsmotgo@...","replyTo":"LIST","senderId":"h3F68jRAg_APi_37hu8FgWO2DgbOCX2nHOYAc3QBk72Llt3TOuTuMbrmzQ2J7k7iANACrPjX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928559878","msgId":511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41Mi41MTEuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":508,"nextInTopic":514,"prevInTime":510,"nextInTime":512,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/4/99 11:49:37 PM EST, liv2learn@geocities.com writes: ","messageBody":"<div id=\"ygrps-yiv-346445299\">In a message dated 6/4/99 11:49:37 PM EST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liv2learn@...\">liv2learn@...</a> writes:<br/>\n<br/>\n&lt;&lt; A friend who homeschools her 4 children called today to say how<br/>\n uncomfortable she is finding it to attend events with pre-homeschool<br/>\n playgroups and friends who have just found out she is homeschooling. She<br/>\n said she feels like a circus curiosity! People always turn the conversation<br/>\n towards the HS subject and away from general chit-chat &gt;&gt;<br/>\n<br/>\n<br/>\nOlivia,<br/>\nwow, I was just about to go to bed, but reading your note got me!  <br/>\nI guess it all depends on how you look at things.  I find that I love it when <br/>\npeople want to talk to me about homeschooling.  I guess I am a teacher at <br/>\nheart, but I love to help newbies.  No one ever helped me, I just sorta had <br/>\nto fend for myself, guess that is why I am not much into joining groups.  <br/>\nEven new people to chat rooms on AOL.  I like to help, someone did take the <br/>\ntime to help me learn how to download and play wavs, and new people never <br/>\nknow how.  Anyway, my point, I would find this a great teaching experience <br/>\ninstead of feeling weird.  I so enjoy what I do that I can&#39;t resist talking <br/>\nabout it.  So....., no, I don&#39;t think we need to get new friends, just look <br/>\nat the situation in a different light.  If it still bothers you, or rather <br/>\nyour friend, then you might want to get new friends!! <br/>\nAm I ratteling here? It is late, I am dead, I apologize!<br/>\nnite,<br/>\nTeresa  ; &gt;</div>","specialLinks":[]},{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...","replyTo":"LIST","senderId":"Z8RIoWgRSaeDroAo20Rmvt-kWVI3f2x0CwKbHkSUZPNkATI7EnS9xzh4PV9RUCCBaadosdf9I_VSW5E8FhKjECc7zsnU4OU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928558062","msgId":508,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41Mi41MDguOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":506,"nextInTopic":511,"prevInTime":507,"nextInTime":509,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Teresa: About being with people who get it philosophically: A friend who homeschools her 4 children called today to say how uncomfortable she is finding it","messageBody":"<div id=\"ygrps-yiv-1488448351\">Teresa:<br/>\n<br/>\nAbout being with people who &quot;get it&quot; philosophically:<br/>\n<br/>\nA friend who homeschools her 4 children called today to say how<br/>\nuncomfortable she is finding it to attend events with pre-homeschool<br/>\nplaygroups and friends who have just found out she is homeschooling. She<br/>\nsaid she feels like a circus curiosity! People always turn the conversation<br/>\ntowards the HS subject and away from general chit-chat. Some people have<br/>\ntreated her homeschooling like a situation from which she needs to be<br/>\nrescued. They talk about getting her help and getting her son back to<br/>\nschool as if &quot;why would she want to be with her kids all day!&quot;  Also, they<br/>\ndiscuss all this in front of her very perceptive kids, who later ask what<br/>\nthat person was talking about. She feels that people put her oldest son<br/>\n(almost 6yo) in a very uncomfortable position when they ask about school,<br/>\nwhat grade he is in (he said  &quot;I don&#39;t know&quot; - they don&#39;t follow grades),<br/>\nor ask him why he doesn&#39;t want to go to school. Do we really need to find a<br/>\nwhole new set of acquaintances when homeschooling? Hopefully not, but it<br/>\nwould make it so much easier to start from scratch!<br/>\n<br/>\nOlivia</div>","specialLinks":[]},{"userId":0,"authorName":"Hsmotgo@xxx.xxx","from":"Hsmotgo@...","replyTo":"LIST","senderId":"ZTpZaprgdzI7br7JdqUtEqcH2BZiZnKOQ-hkovk5p4HYsv8laCqpoaIbPXDHzBN7CJ5o8iv6","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928554400","msgId":506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41Mi41MDYuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":505,"nextInTopic":508,"prevInTime":505,"nextInTime":507,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/4/99 10:39:05 PM EST, liv2learn@geocities.com writes: ","messageBody":"<div id=\"ygrps-yiv-1876425435\">In a message dated 6/4/99 10:39:05 PM EST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liv2learn@...\">liv2learn@...</a> writes:<br/>\n<br/>\n&lt;&lt; Thanks for the welcome. I find it so much more relaxing to spend time with<br/>\n people who &quot;get it&quot;...that is, can understand my feelings without too much<br/>\n explanation &gt;&gt;<br/>\n   O ;  &gt;        I Know!!!<br/>\n<br/>\n<br/>\nTeresa</div>","specialLinks":[]},{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...","replyTo":"LIST","senderId":"o5Hz_XppkrZmoCl8O6RH0TTHrGVrcDepKbH-9HsUj7zcXMZLPoKgDhuxp5UY8ynXkPTehlmSxHrFgWDwHmLSAz5NO89NPOI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928553824","msgId":505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41Mi41MDUuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":501,"nextInTopic":506,"prevInTime":504,"nextInTime":506,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Teresa: Thanks for the welcome. I find it so much more relaxing to spend time with people who get it ...that is, can understand my feelings without too much ","messageBody":"<div id=\"ygrps-yiv-945520426\">Teresa:<br/>\n<br/>\nThanks for the welcome. I find it so much more relaxing to spend time with<br/>\npeople who &quot;get it&quot;...that is, can understand my feelings without too much<br/>\nexplanation. Unfortunately, there will always be times, like when we run<br/>\ninto a neighbor or someone from a former school, when I&#39;ll have to explain<br/>\nwhy my son isn&#39;t going to school anymore. I should just print up a sheet of<br/>\nquestions and answers ahead of time and pass them out at the beginning of a<br/>\nconversation. LOL  Yes, I feel badly for kids whose parents talk about them<br/>\nin such negative ways, especially while the kids are present. Adults don&#39;t<br/>\nthink that kids are listening, but then you hear those comments repeated<br/>\nlater by the kids: obviously they were tuning in quite clearly. <br/>\n<br/>\nOlivia<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Olivia,<br/>\n&gt;Hi and welcome!  You are so right about not letting anyone convince you <br/>\n&gt;otherwise!  Do what is right for you and your family.  I have never had to <br/>\n&gt;defend myself about home schooling, everyone I meet wants to know about it <br/>\n&gt;and how they can get started.  But, I know some people that do and I really <br/>\n&gt;feel sorry that that has to happen.  I know people that can&#39;t wait for school <br/>\n&gt;to start to &quot;get rid&quot; of their kids .  Can you imagine how their kids must <br/>\n&gt;feel to hear their parents  say that, or see them type that in the chat <br/>\n&gt;rooms?  It really makes me sad.  I am so thankful that I have a husband that <br/>\n&gt;is supportive, as I am sure all of us are!  <br/>\n&gt;Anyway, hang in there<br/>\n&gt;Teresa<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;&quot;Congratulations to &#39;Voice-Diary,&#39; our latest ONElist of the Week. <br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com\">http://www.onelist.com</a> <br/>\n&gt;Visit our homepage and share with us how ONElist is changing YOUR life!<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;Check it out!<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...","replyTo":"LIST","senderId":"XhUNhM5p15aThD1z9ZULzcmkKIMq14iOko76wCgbljBYJ6QWdK3Ff9nljMczLXnjzrfMCgm0MXPswAww0hsSfaqIvu5nRhA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928553095","msgId":501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41MS41MDEuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":499,"nextInTopic":505,"prevInTime":500,"nextInTime":502,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"... I am about 30 minutes south of Framingham. Near Hopkinton where the Boston Marathon starts. How has your homeschooling experience been in NH? It s nice to","messageBody":"<div id=\"ygrps-yiv-1134313292\"><blockquote><span title=\"ireply\">&gt;Diana:<br/>\n<br/>\n </span></blockquote>I am about 30 minutes south of Framingham. Near Hopkinton where the Boston<br/>\nMarathon starts. How has your homeschooling experience been in NH? It&#39;s<br/>\nnice to meet another New Englander here on this list!<br/>\n<br/>\nOlivia<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Diana Asberry &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diasberry@...\">diasberry@...</a>&gt;<br/>\n&gt;<br/>\n&gt;Hi Olivia! Where in Mass.?  We live on the Seacoast of NH.<br/>\n&gt;Diana Asberry<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diasberry@...\">diasberry@...</a><br/>\n&gt;<br/>\n&gt;<br/>\n </span></blockquote>-</div>","specialLinks":[]},{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...","replyTo":"LIST","senderId":"1BBU75BNLx0G8cOJg06KwXobJBmqIaksknMDuDFdiw0SBrkIvJBDNn4jRaG4ebN9dbiuEw03GdvkSeCPuJruUKT-EOpIXiE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928552801","msgId":499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41MS40OTkuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":489,"nextInTopic":501,"prevInTime":498,"nextInTime":500,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Christina: I do hate that what do you do all day question, as if home maintenance and raising a child haven t any value. At least by staying home we have the","messageBody":"<div id=\"ygrps-yiv-717224692\">Christina:<br/>\n<br/>\nI do hate that &quot;what do you do all day&quot; question, as if home maintenance<br/>\nand raising a child haven&#39;t any value. At least by staying home we have the<br/>\nopportunity to know what our child is doing all day. That is important to me.<br/>\n<br/>\n(And I can honestly say I haven&#39;t eaten a single bon-bon! LOL)<br/>\n<br/>\nOlivia<br/>\n  <br/>\n<blockquote><span title=\"qreply\"> &gt;Most of my friends, are Stay At Home moms.....so I have lots of support.  But <br/>\n&gt;a lot of my husbands family don&#39;t understand.  I exspecially hate it when <br/>\n&gt;they ask &quot;well what do you do all day?&quot;.  Like I am sitting on couch, <br/>\n&gt;watching soaps, eating bon-bons.  (okay I admit to watching soaps when I <br/>\n&gt;can......&lt;g&gt;).  <br/>\n&gt;<br/>\n&gt;Anyway, after many years of being home I am finally am a position where I can <br/>\n&gt;state that this is the ONLY place I want to be and its best for MY kids.  <br/>\n&gt;Christina<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;Looking to expand your world?<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com\">http://www.onelist.com</a><br/>\n&gt;ONElist has nearly 160,000 e-mail communities from which to chose!<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;Check it out!<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Hsmotgo@xxx.xxx","from":"Hsmotgo@...","replyTo":"LIST","senderId":"hzxlwXDpD_JdNUMro-v_Jt_9AtWujQor3M6m0j4uZfSsrN2dYa2LN1dH_zfkKugTRQDsAdxA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928548427","msgId":489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41MS40ODkuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":485,"nextInTopic":499,"prevInTime":488,"nextInTime":490,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/4/99 11:58:55 AM EST, liv2learn@geocities.com writes: ","messageBody":"<div id=\"ygrps-yiv-1947931927\">In a message dated 6/4/99 11:58:55 AM EST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liv2learn@...\">liv2learn@...</a> writes:<br/>\n<br/>\n&lt;&lt; . I know, in<br/>\n my heart, that there is nothing wrong with wanting to be home with my son,<br/>\n even if other people try to convince me otherwise, especially if that is<br/>\n what he wants too &gt;&gt;<br/>\nOlivia,<br/>\nHi and welcome!  You are so right about not letting anyone convince you <br/>\notherwise!  Do what is right for you and your family.  I have never had to <br/>\ndefend myself about home schooling, everyone I meet wants to know about it <br/>\nand how they can get started.  But, I know some people that do and I really <br/>\nfeel sorry that that has to happen.  I know people that can&#39;t wait for school <br/>\nto start to &quot;get rid&quot; of their kids .  Can you imagine how their kids must <br/>\nfeel to hear their parents  say that, or see them type that in the chat <br/>\nrooms?  It really makes me sad.  I am so thankful that I have a husband that <br/>\nis supportive, as I am sure all of us are!  <br/>\nAnyway, hang in there<br/>\nTeresa</div>","specialLinks":[]},{"userId":0,"authorName":"Hsmotgo@xxx.xxx","from":"Hsmotgo@...","replyTo":"LIST","senderId":"MYy1xo9rwm2NFSSN_SQ5APYk8T2VohWTxBCRvBv0WzJAScd7p6MotpH_oTl-v5MTBVEZcLht","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928547309","msgId":485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41MS40ODUuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":463,"nextInTopic":489,"prevInTime":484,"nextInTime":486,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Nanci, I am a great one for chatting on aol.  Love parent soup chat rooms.  Course, since this list has been up, I haven t had time to chat!!  But hey, put me","messageBody":"<div id=\"ygrps-yiv-228014819\">Nanci,<br/>\nI am a great one for chatting on aol.  Love parent soup chat rooms.  Course, <br/>\nsince this list has been up, I haven&#39;t had time to chat!!  But hey, put me on <br/>\nyour buddy list and give me a holler!<br/>\nTeresa</div>","specialLinks":[]},{"userId":0,"authorName":"Diana Asberry","from":"Diana Asberry &lt;diasberry@...","replyTo":"LIST","senderId":"POWJnBcDZ59MVW15gBt0D1656Lkc6u1JHXc7taxFpR2FmdCKDWTIlj5hwK6QNO2ZMdou1q6CzNuIunnjQen12gtD0YshTIL6upP7_Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928532359","msgId":463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41MC40NjMuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":455,"nextInTopic":485,"prevInTime":462,"nextInTime":464,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Hi Olivia! Where in Mass.?  We live on the Seacoast of NH. Diana Asberry diasberry@hotmail.com ... From: Olivia  Reply-To:","messageBody":"<div id=\"ygrps-yiv-1198967613\">Hi Olivia! Where in Mass.?  We live on the Seacoast of NH.<br/>\nDiana Asberry<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diasberry@...\">diasberry@...</a><br/>\n<br/>\n<br/>\n----Original Message Follows----<br/>\nFrom: Olivia &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liv2learn@...\">liv2learn@...</a>&gt;<br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a><br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a><br/>\nSubject: Re: [Unschooling-dotcom] Friends(?)/Family<br/>\nDate: Fri, 04 Jun 1999 12:57:00 -0400<br/>\n<br/>\nFrom: Olivia &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liv2learn@...\">liv2learn@...</a>&gt;<br/>\n<br/>\nHello to all:<br/>\n<br/>\nI am new to this list so I guess I should  just jump in and introduce<br/>\nmyself. My name is Olivia and I live in Mass. We will &quot;officially&quot; be<br/>\nhomeschooling/unschooling one 6yo at the end of kindergarten this June. In<br/>\nreality, we will simply be going back to the kinds of fun things we had<br/>\ntime to do before the intrusion of school schedules. I am a little nervous<br/>\nabout mentioning to people that my son will not be going to first grade in<br/>\nthe fall; I hate having to explain our reasons over and over again to that<br/>\npuzzled or disapproving look on people&#39;s faces. Also, I worry about my<br/>\nonly-child son not having  many non-adult playmates available once public<br/>\nschool resumes in September. We are working on finding similarly-minded<br/>\nfamilies in the area.<br/>\n<br/>\nI wasn&#39;t going to post just yet, but Julie&#39;s comments about &quot;manufactured&quot;<br/>\nchildren struck a chord with me. While sitting on the sidelines of my son&#39;s<br/>\nsporting events and on a recent school field trip, I had the chance to hear<br/>\nlots of conversations about how &quot;busy&quot; kids are: that is, how they are<br/>\nshuttled from one place to another while parents work. Some kids never see<br/>\na parent from 7AM to 7PM. A very large number of my son&#39;s kindergarten<br/>\nclassmates this year went right to day-care from school. (This makes it<br/>\nhard to have friends outside of school if you don&#39;t go to daycare.)<br/>\n<br/>\nI am a stay-at-home mom (a rarity around here), and people always ask when<br/>\nI will be going back to work, or say  they couldn&#39;t stand to be at home all<br/>\nday with their kids. I began to feel like something was wrong with me<br/>\nbecause I wanted to have my son close to home and felt like something was<br/>\nnot right about turning over my little boy to an anonymous school system<br/>\nthat is not welcoming to parents in the classroom. I am sure that other<br/>\nparents must feel isolated from their children once they go to school, but<br/>\nthey are told by society that they have to learn to &quot;let go&quot;. I thank a<br/>\nfriend of mine for suggesting the idea of homeschooling last fall. Like a<br/>\nlot of people here, I started by searching the internet and read my first<br/>\nHolt book &quot;How Children Learn&quot; and it was a breath of fresh air. I know, in<br/>\nmy heart, that there is nothing wrong with wanting to be home with my son,<br/>\neven if other people try to convince me otherwise, especially if that is<br/>\nwhat he wants too. I am glad to be able to give him the option of learning<br/>\noutside of school. I wonder how many kids who say they like school do so<br/>\nonly to please parents, or because school is better than the alternative of<br/>\nall-day day-care or being home alone.<br/>\n<br/>\nOK, thanks for sharing the soap-box! LOL<br/>\n(Next time I&#39;ll try for not so long and rambling!)<br/>\n<br/>\nOlivia<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------<br/>\nLooking for a new hobby?  Want to make a new friend?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com\">http://www.onelist.com</a><br/>\nCome join one of nearly 160,000 e-mail communities at ONElist!<br/>\n------------------------------------------------------------------------<br/>\nCheck it out!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n<br/>\n<br/>\n_______________________________________________________________<br/>\nGet Free Email and Do More On The Web. Visit <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.msn.com\">http://www.msn.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"ChrissR123@xxx.xxx","from":"ChrissR123@...","replyTo":"LIST","senderId":"YgjIW1yPK5dYQOLbl1SyW5bVpiN4BraDJlskjua-QpeGq0vuVibZhrTYMvFbTAgZMnpdh67i5daw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928525174","msgId":455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41MC40NTUuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":446,"nextInTopic":463,"prevInTime":454,"nextInTime":456,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/4/99 8:59:02 AM PST, liv2learn@geocities.com writes: ","messageBody":"<div id=\"ygrps-yiv-1888340030\">In a message dated 6/4/99 8:59:02 AM PST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liv2learn@...\">liv2learn@...</a> writes:<br/>\n<br/>\n&lt;&lt; I know, in  my heart, that there is nothing wrong with wanting to be home <br/>\nwith my son, even if other people try to convince me otherwise, especially if <br/>\nthat is<br/>\n what he wants too. I am glad to be able to give him the option of learning<br/>\n outside of school. &gt;&gt;<br/>\n<br/>\nI agree.  <br/>\nMost of my friends, are Stay At Home moms.....so I have lots of support.  But <br/>\na lot of my husbands family don&#39;t understand.  I exspecially hate it when <br/>\nthey ask &quot;well what do you do all day?&quot;.  Like I am sitting on couch, <br/>\nwatching soaps, eating bon-bons.  (okay I admit to watching soaps when I <br/>\ncan......&lt;g&gt;).  <br/>\n<br/>\nAnyway, after many years of being home I am finally am a position where I can <br/>\nstate that this is the ONLY place I want to be and its best for MY kids.  <br/>\nChristina</div>","specialLinks":[]},{"userId":0,"authorName":"claudia partick","from":"&quot;claudia partick&quot; &lt;pinintree@...","replyTo":"LIST","senderId":"mRLU8ZcNIoRhYLDegWeAFYiPCWeGTWFjahCWUznvnkHnEs58JGu2nAq_m7h9gRfckxw3OP13-wODqFVYJhxoHY4ZZ9eXmu2-p19MZUWplCVpkQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928519082","msgId":446,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40OS40NDYuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":439,"nextInTopic":455,"prevInTime":445,"nextInTime":447,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Nanci K. I am on icq and would love to talk to other unschooler one on one. my email address is pinintree@earthlink.net  email me directly and we can exchange ","messageBody":"<div id=\"ygrps-yiv-676260832\">Nanci K.<br/>\nI am on icq and would love to talk to other unschooler one on one. my email<br/>\naddress is <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pinintree@...\">pinintree@...</a>  email me directly and we can exchange<br/>\nicq #s.<br/>\nclaudia in kansas<br/>\n-----Original Message-----<br/>\nFrom: Thomas and Nanci Kuykendall &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tn-k4of5@...\">tn-k4of5@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a>&gt;<br/>\nDate: Thursday, June 03, 1999 11:42 PM<br/>\nSubject: Re: [Unschooling-dotcom] Friends(?)/Family<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;From: Thomas and Nanci Kuykendall &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tn-k4of5@...\">tn-k4of5@...</a>&gt;<br/>\n&gt;<br/>\n&gt;Gee thanks Marti!<br/>\n&gt;I am curious about anyone here who chats using AOL online or ICQ.  I use<br/>\n&gt;both, and always have them on when I am online, so I can be contacted.  It<br/>\n&gt;helps me deal with my &#39;emotional isolation&#39; if I can blow off steam<br/>\n&gt;chatting with folks in the evening.  I find it really helpful for dealing<br/>\n&gt;with adoption issues when my adoption aqaintances are online and I am sure<br/>\n&gt;I would fine it the same for unschooling friends.<br/>\n&gt;<br/>\n&gt;It would be nice to have some folks to call friends again.  It has been a<br/>\n&gt;long time, with lots of moving, getting married and having babies, and all<br/>\n&gt;the friends I used to have things in common with don&#39;t have time for me<br/>\n&gt;now, in their professional lives.  I really miss having folks over for a<br/>\n&gt;relaxing evening of adult conversation and good food.  I grow weary of<br/>\n&gt;conversations about monsters, dragons, A Bug&#39;s Life,  hockey, soccer, etc<br/>\n&gt;from a two year old&#39;s perspective!  I feel like I am regressing!<br/>\n&gt;<br/>\n&gt;Nanci K. in Idaho<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;How has ONElist changed your life?<br/>\n&gt;Share your story with us at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com\">http://www.onelist.com</a><br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;Check it out!<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...","replyTo":"LIST","senderId":"neks3iiRufaektJe_ZiiAIc7vVA99r-CdcjA87e45g9EHh8LGXpeWQ2ZnePJJWcYKFsBoWgSRYW1jAULNesnmDtrG0lX1Dc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928515420","msgId":439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40OS40MzkuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":434,"nextInTopic":446,"prevInTime":438,"nextInTime":440,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Hello to all: I am new to this list so I guess I should  just jump in and introduce myself. My name is Olivia and I live in Mass. We will officially be ","messageBody":"<div id=\"ygrps-yiv-1856625277\">Hello to all:<br/>\n<br/>\nI am new to this list so I guess I should  just jump in and introduce<br/>\nmyself. My name is Olivia and I live in Mass. We will &quot;officially&quot; be<br/>\nhomeschooling/unschooling one 6yo at the end of kindergarten this June. In<br/>\nreality, we will simply be going back to the kinds of fun things we had<br/>\ntime to do before the intrusion of school schedules. I am a little nervous<br/>\nabout mentioning to people that my son will not be going to first grade in<br/>\nthe fall; I hate having to explain our reasons over and over again to that<br/>\npuzzled or disapproving look on people&#39;s faces. Also, I worry about my<br/>\nonly-child son not having  many non-adult playmates available once public<br/>\nschool resumes in September. We are working on finding similarly-minded<br/>\nfamilies in the area.<br/>\n<br/>\nI wasn&#39;t going to post just yet, but Julie&#39;s comments about &quot;manufactured&quot;<br/>\nchildren struck a chord with me. While sitting on the sidelines of my son&#39;s<br/>\nsporting events and on a recent school field trip, I had the chance to hear<br/>\nlots of conversations about how &quot;busy&quot; kids are: that is, how they are<br/>\nshuttled from one place to another while parents work. Some kids never see<br/>\na parent from 7AM to 7PM. A very large number of my son&#39;s kindergarten<br/>\nclassmates this year went right to day-care from school. (This makes it<br/>\nhard to have friends outside of school if you don&#39;t go to daycare.) <br/>\n<br/>\nI am a stay-at-home mom (a rarity around here), and people always ask when<br/>\nI will be going back to work, or say  they couldn&#39;t stand to be at home all<br/>\nday with their kids. I began to feel like something was wrong with me<br/>\nbecause I wanted to have my son close to home and felt like something was<br/>\nnot right about turning over my little boy to an anonymous school system<br/>\nthat is not welcoming to parents in the classroom. I am sure that other<br/>\nparents must feel isolated from their children once they go to school, but<br/>\nthey are told by society that they have to learn to &quot;let go&quot;. I thank a<br/>\nfriend of mine for suggesting the idea of homeschooling last fall. Like a<br/>\nlot of people here, I started by searching the internet and read my first<br/>\nHolt book &quot;How Children Learn&quot; and it was a breath of fresh air. I know, in<br/>\nmy heart, that there is nothing wrong with wanting to be home with my son,<br/>\neven if other people try to convince me otherwise, especially if that is<br/>\nwhat he wants too. I am glad to be able to give him the option of learning<br/>\noutside of school. I wonder how many kids who say they like school do so<br/>\nonly to please parents, or because school is better than the alternative of<br/>\nall-day day-care or being home alone.<br/>\n<br/>\nOK, thanks for sharing the soap-box! LOL<br/>\n(Next time I&#39;ll try for not so long and rambling!)<br/>\n<br/>\nOlivia</div>","specialLinks":[]},{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...","replyTo":"LIST","senderId":"F9wGqBi-QI5effSYYmgvo3L3qOCgTtBOcZ8YyeJNon6wy8z1bc2SboWnstGyVWUQXJp_M4rOVrsPCTwIG6QCq04KT27KNor3l2AG8njTgstDt9dFEG_97I8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928513238","msgId":434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40OS40MzQuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":407,"nextInTopic":439,"prevInTime":433,"nextInTime":435,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"... I ve learned only to share my excitement with like minded/open ... Diana (I love your name, by the way!) Thanks for the sympathy.  However, I find it","messageBody":"<div id=\"ygrps-yiv-1235459688\">At 07:12 AM 6/4/99 PDT, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Diana Asberry &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diasberry@...\">diasberry@...</a>&gt;<br/>\n </span></blockquote>I&#39;ve learned only to share my excitement with like minded/open <br/>\n<blockquote><span title=\"ireply\"> &gt;minded friends (who won&#39;t feel intimidated).<br/>\n<br/>\n<br/>\n </span></blockquote>Diana (I love your name, by the way!)<br/>\n<br/>\nThanks for the sympathy.  However, I find it difficult to manage all my<br/>\nstress relief, shoulder crying and comiserating, as well as all my<br/>\ncomraderie and sharing of mutual excitement and ideas, over the internet.<br/>\nI don&#39;t know anyone in person who is &#39;like minded.&#39; <br/>\n<br/>\n I like to get together for tea with girlfriends while my kids are sleeping<br/>\n(not happening) or go out to lunch together at a little cafe (not<br/>\nhappening) or have couples and single friends over for dinner and<br/>\nconversation (not happening.)  I am also a very physically affectionate<br/>\nperson and I enjoy being tactile with people.  I like to hug my friends and<br/>\nbe close to them when we are talking and sharing.  But I don&#39;t have any<br/>\ngood friends here like that.  We moved too recently and I am too shy and<br/>\ncautious with strangers in person.  The ladies in the Playgroup seem to be<br/>\nmaintaining their emotional comfort distance, and my husband is always<br/>\nnagging me to make some better friends, as he knows I need them.  <br/>\n<br/>\nNanci K. in Idaho</div>","specialLinks":[]},{"userId":0,"authorName":"julie1264","from":"&quot;julie1264&quot; &lt;julie1264@...","replyTo":"LIST","senderId":"tHkRANw7wP0argP_QYGTiPmbDAR4OUy6LBse3lrgQ3WndZc-1BRiNQq29TJUUxWCQkE51ujbT-ZnxASn4gtx3AKvWdHvDenzTd9dnw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928502203","msgId":407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40OC40MDcuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":402,"nextInTopic":434,"prevInTime":406,"nextInTime":408,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Robin, Nanci and Others: Would it help either of you to know in a sense that your are the better person?  I always try to think that way when I run into","messageBody":"<div id=\"ygrps-yiv-1177425716\">Robin, Nanci and Others:<br/>\n<br/>\nWould it help either of you to know in a sense that your are the better person?  I always try to think that way when I run into opposition like this.<br/>\n<br/>\nI came to this situation when we were having our kids.  Why didn&#39;t I have an ultrasound or a couple of them??  What childbirth with no epidural??  No epitsomy(sp?)???  Breastfeeding???  Breastfeeding past six weeks??  Not going back to work???  What about your great job??  No babysitters???  How can you stand the kids all day???  Homeschool???   The list goes on...<br/>\n<br/>\nI am sure these are all things all of you have heard in the past.  I have gotten past the point of defending myself and almost shrug my shoulders and walk away.  My dh and I have come to the conclusion the WE GET IT!!!  We have to grow and nuture our kids, not give birth, start them in early school programs not necessairly for the benefit of learning but just to get them out of our hair.  We have to be involved in everything they do.  <br/>\n<br/>\nI have had my dd in a kid&#39;s music class since she was 3 months(she is now 2) which she just loves.  The other parents were discussing, pre-preschool and why didn&#39;t the park district have more classes for kids that weren&#39;t parent involved?  My mouth dropped.  They are only 2!!  How can you not be involved??  One mom was saying that she was trying to figure a way to get her ds in prescool early just to have more time to herself.  <br/>\n<br/>\nQuite frankly. the thought of preschool sort of made me sad.  I have seen my daughter progress so much over the first two years of her life, could I let someone else have the privlege of seeing her draw picture of her family, and etc.  I guess that is why the idea of homeschooling came so naturally to us.  God gave us these children to grow, not manufactor like a pair of shoes and hope the person who gets them treats them well.<br/>\n<br/>\nI think that is the country&#39;s biggest problem right now, kids are manufactored not grown.  Be confident in knowing that you are growing good children who are going to be responsible active particpants of future society.  It is the other peoples&#39; children you have to worry about.<br/>\n<br/>\nHope this helps...<br/>\n<br/>\nI will get off of my soap box now!!!<br/>\n<br/>\n<br/>\nJulie G.</div>","specialLinks":[]},{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...","replyTo":"LIST","senderId":"i6s72SiHvHOgLRw1Z-TS_Fq0hh9DQ8QVfPNzgid_A0JdKAOrBArRFVKXldak4sJmsx2yglnViNhxEcIUEiwuz3LRnujVLOVSq3sAXUsJ_WHT835q_cjMFUA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928471663","msgId":402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ny40MDIuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":391,"nextInTopic":407,"prevInTime":401,"nextInTime":403,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Gee thanks Marti! I am curious about anyone here who chats using AOL online or ICQ.  I use both, and always have them on when I am online, so I can be","messageBody":"<div id=\"ygrps-yiv-1613994490\">Gee thanks Marti!<br/>\nI am curious about anyone here who chats using AOL online or ICQ.  I use<br/>\nboth, and always have them on when I am online, so I can be contacted.  It<br/>\nhelps me deal with my &#39;emotional isolation&#39; if I can blow off steam<br/>\nchatting with folks in the evening.  I find it really helpful for dealing<br/>\nwith adoption issues when my adoption aqaintances are online and I am sure<br/>\nI would fine it the same for unschooling friends.  <br/>\n<br/>\nIt would be nice to have some folks to call friends again.  It has been a<br/>\nlong time, with lots of moving, getting married and having babies, and all<br/>\nthe friends I used to have things in common with don&#39;t have time for me<br/>\nnow, in their professional lives.  I really miss having folks over for a<br/>\nrelaxing evening of adult conversation and good food.  I grow weary of<br/>\nconversations about monsters, dragons, A Bug&#39;s Life,  hockey, soccer, etc<br/>\nfrom a two year old&#39;s perspective!  I feel like I am regressing!  <br/>\n<br/>\nNanci K. in Idaho</div>","specialLinks":[]},{"userId":0,"authorName":"KintHM@xxx.xxx","from":"KintHM@...","replyTo":"LIST","senderId":"ncA87wTZlUyu2oOjB5pVo5t9wrpZZ7b6X_Wgkgj0YSB_32exPN38piwtYmkj9FuO42A8gGc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928469559","msgId":391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ny4zOTEuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":387,"nextInTopic":402,"prevInTime":390,"nextInTime":392,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/1999 8:56:18 PM Pacific Daylight Time, tn-k4of5@if.rmci.net writes: ","messageBody":"<div id=\"ygrps-yiv-181672812\">In a message dated 6/3/1999 8:56:18 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tn-k4of5@...\">tn-k4of5@...</a> writes:<br/>\n<br/>\n&lt;&lt; :( feeling blue! (Not Aquatinted, Marti.)<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>I am just NOT going to live that one down am I? :o) <br/>\n<br/>\nI am going over to the AOL homeschool forum and see if I can find someone for <br/>\nyou to play with in TF. There MUST be others out there!!! I know that in <br/>\nBoise we had a couple of different unschooling/nonmorman groups to choose <br/>\nfrom. I will let you know what I find out.....<br/>\n<br/>\nMarti in Wa</div>","specialLinks":[]},{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...","replyTo":"LIST","senderId":"I_gLrORVEeZ1zWlKJOoAplzkBSiMKkpskv0uIKO9Af1LHZUpZWP_FZf7w0J-L_vu1FUQgdMxl3s0IrkPMPtXSmIT0kp-eYjy8557D-k70DeoMWfytmtezaM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928468864","msgId":387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ny4zODcuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":385,"nextInTopic":391,"prevInTime":386,"nextInTime":388,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"... valid ... Robin, I hear you.  I have a very small group of friends here, consisting of the other mothers in my playgroup.  I don t make friends easily","messageBody":"<div id=\"ygrps-yiv-245478354\">At 05:32 PM 6/3/99 -0700, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Robin Stark &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robinstark@...\">robinstark@...</a>&gt;<br/>\n&gt;<br/>\n&gt;I had an experience this morning where my best friend, I&#39;m at a loss for what<br/>\n&gt;to do because it&#39;s going to be hard for me to get over her closed mind.<br/>\n&gt;<br/>\n&gt;What she is saying is that her opinion, which is based on NOTHING is more<br/>\n </span></blockquote>valid<br/>\n<blockquote><span title=\"ireply\"> &gt;than my opinion, which is based on a lot of time and research and the love<br/>\n&gt;of my children. <br/>\n&gt;Robin Stark<br/>\n<br/>\n<br/>\n </span></blockquote>Robin,<br/>\nI hear you.  I have a very small group of friends here, consisting of the<br/>\nother mothers in my playgroup.  I don&#39;t make friends easily owing to some<br/>\nshyness and my fear of judgement or rejection, although I am (I believe) a<br/>\nfairly articulate and intelligent person, and I know I am a loyal and<br/>\nthoughtful friend.  It took me a long time to get to know these women, and<br/>\nwe are still mostly more acquaintances than friends.  Today I shared my<br/>\nexcitement with them about unschooling and all the information I was<br/>\ndiscovering on the internet.  They told me they thought the &quot;lack of<br/>\naccountability&quot; for Idaho homeschoolers was &quot;awful&quot; and that many people<br/>\nwould probably not teach their children the basic necessities.  They went<br/>\non to say &quot;How are you going to socialize you kids when there are not many<br/>\nother homeschoolers around here?&quot;  I tried to explain that there are other,<br/>\nnon-homeschool related social outlets (like this playgroup!!) scouts, youth<br/>\ngroups, 4H, on and on.  They nodded, but seemed dissatisfied.  <br/>\n<br/>\nI dropped the subject after a few more unsuccessful minutes of trying to<br/>\nhelp them see the positives of unschooling.  I tried to tell them that I<br/>\nbelieve that many children have been failed by the ps system.  They told me<br/>\nthat was &quot;not true&quot;, even though I, myself, am a case in point and I know a<br/>\nnumber of other adults, and kids now in ps who are similarly affected.<br/>\nLike my next door neighbors, and my niece and nephew to name just a few.  <br/>\n<br/>\nI am really disappointed!  I don&#39;t get to go out much and talk to other<br/>\nMothers or have any social outlets because my children are so little and<br/>\ncan&#39;t keep up with a very large outing and their nap and feeding schedules<br/>\noften vary depending on a number of factors.  Also it&#39;s hard to do anything<br/>\nwhen both hands are occupied with one toddler who runs away laughing at<br/>\nevery opportunity and one who is still very unsteady on his feet and must<br/>\nusually be carried.  The other moms in the playgroup take their children to<br/>\nkinder-gym and kinder-music and stuff like that.  But I don&#39;t see a need<br/>\nfor that, and we have plenty of fun right here at home, or in the local<br/>\nplayground.  I am desperate to meet someone around here with similar age<br/>\nkids and similar interests in homeschooling/unschooling.  We are not<br/>\nreligiously affiliated, and the in the large Mormon and fundamental<br/>\nChirstian population here it is hard to find friends who won&#39;t judge you or<br/>\ntry to convert you.<br/>\n<br/>\n:( feeling blue! (Not Aquatinted, Marti.)<br/>\n<br/>\nNanci in Idaho</div>","specialLinks":[]},{"userId":0,"authorName":"Diana Asberry","from":"Diana Asberry &lt;diasberry@...","replyTo":"LIST","senderId":"P5AvCtAjLexRlIi1j6FtDjSD9VUrYTDwV735-57WXEbPijg31DlbSiHDH-R0iVethtLmrzbc_M-VE48PcRlG8lxSyDNGyGddZjzgsw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928467439","msgId":385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ny4zODUuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":382,"nextInTopic":387,"prevInTime":384,"nextInTime":386,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Denise: You are RIGHT ON!  I ve been mainly lurking, but had to express my thoughts on your statements. (I m feeling the need to qualify myself, since I","messageBody":"<div id=\"ygrps-yiv-1375306754\">Denise:<br/>\nYou are RIGHT ON!  I&#39;ve been mainly lurking, but had to express my thoughts <br/>\non your statements.<br/>\n(I&#39;m feeling the need to qualify myself, since I haven&#39;t introduced myself, <br/>\nyet:  I come from a psychology back-ground & as a matter of fact, my MIL is <br/>\na psychologist-who has been quite supportive of our parenting/educating <br/>\ndecisions...)<br/>\nAnyway<br/>\nYES, these people see our choices as a threat to them.  They will not be <br/>\nconvinced.  Don&#39;t even bother trying.  They have been in denial of their <br/>\nabilities to choose options outside of their realm.  They are threated that <br/>\nwe may feel superior, like they&#39;re being judged--so they get defensive and <br/>\njudge us.  (...the best defense is a good offense...someone once said)<br/>\nThey are more comfortable with feeling helpless, not questioning authority, <br/>\nand acting like they can&#39;t be part of the solution to what ails this <br/>\nsociety. (the &quot;boys will be boys&quot; mentality when their child bullies <br/>\nsomeone...)<br/>\nThey take comfort in their denial that the horrible acts among this <br/>\ncountry&#39;s high schools, will never happen to them....  (today, maybe...)<br/>\n<br/>\nDiana Asberry<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;IMHO, the reason many people (like your friend) are so angered at our<br/>\n </span></blockquote>unschooling decision is because deep inside, they are jealous at seeing<br/>\nsomeone else take control, charge, and power over their life...... it forces<br/>\nthem to look truthfully at their own life.<br/>\n<br/>\nI think trying to &quot;convince&quot; others that unschooling is the right thing<br/>\nto do is like trying to convince someone to change their religion or<br/>\nsomething like that, just because we think they should. .......Embracing<br/>\nunschooling was a process for me; a journey. How do you &quot;explain&quot; that<br/>\nto someone else? Why should we be required to? We don&#39;t have to explain<br/>\nto them why we go to the church we do, or why we shop at the grocery<br/>\nstore we do, etc., etc.<br/>\n<br/>\nI also think that most people truly believe that public school education<br/>\nin this country is in big trouble, but they are not willing to do<br/>\nanything about it. And those of us who ARE willing to do something about<br/>\nit, are threatening to them.<br/>\n<br/>\nMy two cents...<br/>\n<br/>\nDenise, a tea lover in South Carolina<br/>\nStop by for a cup of tea ~ <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.angelfire.com/sc/tealover\">http://www.angelfire.com/sc/tealover</a><br/>\n<br/>\n----------------------------------------------------------------------<br/>\n<br/>\n<br/>\n_______________________________________________________________<br/>\nGet Free Email and Do More On The Web. Visit <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.msn.com\">http://www.msn.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"LammiesX6@aol.com","from":"LammiesX6@...","replyTo":"LIST","senderId":"YoRRrK0wwI_eMEK3X8E40tnA1AtGFi3A84YmWRrR238XpTMXg07ZF2ybJEZP16gse0yNy8_iVe8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928465846","msgId":382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ny4zODIuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":381,"nextInTopic":385,"prevInTime":381,"nextInTime":383,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/99 4:32:02 PM PST, robinstark@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1510472708\">In a message dated 6/3/99 4:32:02 PM PST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robinstark@...\">robinstark@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\n So I tried to tell her. I sent her one article from the free emails from<br/>\n the Home Ed Magazine. ONE article. I was going to try to spoonfeed her. She<br/>\n couldn&#39;t even read that. She knows absolutely NOTHING about the subject,<br/>\n but she has already formed her opinion. I&#39;m telling you, I &#39;bout crapped my<br/>\n drawers. I have know this woman longer than I&#39;ve known my husband (16<br/>\n years), and I never knew she was so narrow-minded. I&#39;m at a loss for what<br/>\n to do because it&#39;s going to be hard for me to get over her closed mind.<br/>\n <br/>\n What she is saying is that her opinion, which is based on NOTHING -- she<br/>\n has already admitted the knows nothing about the subject -- is more valid<br/>\n than my opinion, which is based on a lot of time and research and the love<br/>\n of my children. Boy, the more I think about it, the madder I get.<br/>\n <br/>\n Robin Stark<br/>\n <br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>Robink, you need to tell her that she can NOT offer HER opinions on <br/>\nhomeschooling until she has read at LEAST as many books and articles on the <br/>\nsubject as you have.  An informed, negative opinion is one thing.  Choosing <br/>\nignorance is another.  Shut the door on her opinions now and save yourself <br/>\nsome grief.<br/>\n<br/>\nMary</div>","specialLinks":[]},{"userId":0,"authorName":"Robin Stark","from":"Robin Stark &lt;robinstark@...","replyTo":"LIST","senderId":"J7iZplg_6BsuM6u3hu2jTlGJhQR6XvZOUmumVCmXMleRtz7u4QaD6xhxTRXEXd65ruKKjryxINiB_R5suMOcl93HUBKbUHUE5ihSFnI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928465319","msgId":380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ni4zODAuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":369,"nextInTopic":381,"prevInTime":379,"nextInTime":381,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"... Nance, I must have left out a puzzle piece here. My friend s only child is 32 years old, just got married. We are only talking about MY children, who are ","messageBody":"<div id=\"ygrps-yiv-394182975\"><blockquote><span title=\"ireply\">&gt; I&#39;m sure she just wants the<br/>\n&gt;best for her children too.  If both of you can keep from being negative about<br/>\n&gt;the other ones choices (which sounds hard because of course you will each<br/>\n&gt;want to talk about your kids), it would seem a shame to sour such a long<br/>\n&gt;friendship when everyone is just trying to do their best.<br/>\n<br/>\n </span></blockquote>Nance,<br/>\nI must have left out a puzzle piece here. My friend&#39;s only child is 32<br/>\nyears old, just got married. We are only talking about MY children, who are<br/>\nher godchildren. So she has a vested interest in them (7 and 2 years). But<br/>\nit doesn&#39;t sound like it because she&#39;s not even willing to learn one tidbit<br/>\nof info regarding home/unschooling. She loves them, I know, so I would have<br/>\nthought she would have taken an interest in this -- even if she disagreed.<br/>\nI would have thought she would want to know more so she could THEN form her<br/>\nopinion.<br/>\n<br/>\n-----<br/>\n<blockquote><span title=\"ireply\"> &gt;We don&#39;t have to explain<br/>\n&gt;to them why we go to the church we do, or why we shop at the grocery<br/>\n&gt;store we do, etc., etc.<br/>\n&gt;<br/>\n&gt;I also think that most people truly believe that public school education<br/>\n&gt;in this country is in big trouble, but they are not willing to do<br/>\n&gt;anything about it. And those of us who ARE willing to do something about<br/>\n&gt;it, are threatening to them.<br/>\n<br/>\n </span></blockquote>Denise,<br/>\nI think you hit several nails on the head. I shouldn&#39;t be trying to<br/>\nexplain. I&#39;m going to force myself to stop that right away. And yes, I<br/>\nthink people are scared or threatened when we show we CAN do something<br/>\ndifferent than the norm. My friend is from the school of &quot;Well, we&#39;ve<br/>\nalways done it this way, so we will continue to do it this way.&quot; That<br/>\ndoesn&#39;t make it right, though. I sound confident, don&#39;t I? I&#39;m not. But I<br/>\nwill work on that, too.<br/>\n<br/>\n-----<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I am so sorry cus i know it must hurt.<br/>\n<br/>\n </span></blockquote>Andi,<br/>\nYou are right here. I guess I&#39;m not so much mad as hurt. Although, I think<br/>\nthat&#39;s a fine line. Yes, she hurt my feelings when she showed me she didn&#39;t<br/>\ngive a crap for my opinion. All this time I thought we were on equal<br/>\nfooting, ond now I guess she&#39;s always been too smart for me, or so she<br/>\napparently thinks (has thought). I know we will have to speak on the phone<br/>\nto work this out, but I don&#39;t feel like it now. I need some time with my<br/>\nthoughts.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n- - - - - - - -<br/>\nRobin Stark</div>","specialLinks":[]},{"userId":0,"authorName":"ChrissR123@xxx.xxx","from":"ChrissR123@...","replyTo":"LIST","senderId":"vWkslNO3dVnU5cE43Lm9HHLFuKK8I1fVRljGwUswMYKA1MNXN8exQkDMPPcyEdccOjCLlmycxjLc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928465193","msgId":381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ni4zODEuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":380,"nextInTopic":382,"prevInTime":380,"nextInTime":382,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/99 4:31:55 PM PST, robinstark@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-476325451\">In a message dated 6/3/99 4:31:55 PM PST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robinstark@...\">robinstark@...</a> writes:<br/>\n<br/>\n&lt;&lt; But before she told me this, in a previous email she said, &quot;I guess the<br/>\n main thing I&#39;m concerned about is that they&#39;re going to miss out on social<br/>\n things at school and that they won&#39;t have a varied curriculum.  Also, how<br/>\n do they get a diploma or credits for going to college?  I don&#39;t know<br/>\n anything about these things.  What about proms, football games, etc.,<br/>\n things that I really loved in school.  Tell me.&quot; &gt;&gt;<br/>\n<br/>\nRobin,<br/>\nEven though she asked for explanations, it sounds like (unfortunantly) she <br/>\nhad her mind made up already.  Its to bad.  <br/>\nChristina</div>","specialLinks":[]},{"userId":0,"authorName":"mainmom@xxxxx.xxx","from":"mainmom@...","replyTo":"LIST","senderId":"sT9ywY51No94RVEG4q6d-3rACqi_SX87jQ8TmPF2bbO0my27tNtDD-Wbah8gPmvbcKy7N4IG0Dk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928463496","msgId":369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ni4zNjkuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":368,"nextInTopic":380,"prevInTime":368,"nextInTime":370,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"Denise wrote: ","messageBody":"<div id=\"ygrps-yiv-599336047\">Denise wrote:<br/>\n&lt;&lt;I also think that most people truly believe that public school<br/>\neducation in this country is in big trouble, but they are not willing to<br/>\ndo anything about it. And those of us who ARE willing to do something<br/>\nabout it, are threatening to them.&gt;&gt;<br/>\n<br/>\nI believe this so much and thought it was so well put, that I wanted<br/>\neveryone to read it again!<br/>\n<br/>\nMary in FL</div>","specialLinks":[]},{"userId":0,"authorName":"Marbleface@xxx.xxx","from":"Marbleface@...","replyTo":"LIST","senderId":"rAsaGmMN8TNZtkmxxPM2IPn8RdpRzKW_n3KiZRJGdND0mKNUuhieZ8wG7gsnDofzkHRFUbke4LLr","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928462807","msgId":368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ni4zNjguOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":366,"nextInTopic":369,"prevInTime":367,"nextInTime":369,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/4/99 12:31:50 AM !!!First Boot!!!, robinstark@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-677250522\">In a message dated 6/4/99 12:31:50 AM !!!First Boot!!!, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robinstark@...\">robinstark@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\n What she is saying is that her opinion, which is based on NOTHING -- she<br/>\n has already admitted the knows nothing about the subject -- is more valid<br/>\n than my opinion, which is based on a lot of time and research and the love<br/>\n of my children. Boy, the more I think about it, the madder I get.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I hope you have had a chance to relax after all that!  It seems to me that <br/>\nshe has made her choice and you have made yours.  I&#39;m sure she just wants the <br/>\nbest for her children too.  If both of you can keep from being negative about <br/>\nthe other ones choices (which sounds hard because of course you will each <br/>\nwant to talk about your kids), it would seem a shame to sour such a long <br/>\nfriendship when everyone is just trying to do their best.<br/>\n<br/>\nGood luck.<br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":0,"authorName":"Tea Lover Denise","from":"Tea Lover Denise &lt;jalecroy@...","replyTo":"LIST","senderId":"9yx3ie7ayzdtXkWjgzId3SvMlSX1kowtZNVbUurzJ72t9rqcpegchBepMX_Bt_vRqIbXyLJdfn-hc5-v0-xUChziwYarLeVGse7G6GBs","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Friends(?)/Family","postDate":"928460809","msgId":366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Ni4zNjYuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":356,"nextInTopic":368,"prevInTime":365,"nextInTime":367,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1986516697\">&lt;Robin said: &quot;I had an experience this morning where my best friend, who<br/>\nlives in Los Angeles to my Tacoma, WA, told me not to send her any<br/>\ninformation on homeschooling or unschooling. She said she just didn&#39;t<br/>\nagree with me and that she had her way and I had my way and that was the<br/>\nway it was. She said she didn&#39;t want to argue about it, so we just<br/>\ncouldn&#39;t talk about it. (We haven&#39;t argued about it. In fact, we&#39;ve<br/>\nhardly talked about it.) But before she told me this, in a previous<br/>\nemail she said, &quot;I guess the main thing I&#39;m concerned about is that<br/>\nthey&#39;re going to miss out on social things at school and that they won&#39;t<br/>\nhave a varied curriculum.  Also, how do they get a diploma or credits<br/>\nfor going to college?  I don&#39;t know anything about these things.  What<br/>\nabout proms, football games, etc., things that I really loved in<br/>\nschool.  Tell me.&quot; So I tried to tell her. I sent her one article from<br/>\nthe free emails from the Home Ed Magazine. ONE article. I was going to<br/>\ntry to spoonfeed her. She couldn&#39;t even read that. She knows absolutely<br/>\nNOTHING about the subject, but she has already formed her opinion. I&#39;m<br/>\ntelling you, I &#39;bout crapped my drawers. I have know this woman longer<br/>\nthan I&#39;ve known my husband (16 years), and I never knew she was so<br/>\nnarrow-minded. I&#39;m at a loss for what to do because it&#39;s going to be<br/>\nhard for me to get over her closed mind. What she is saying is that her<br/>\nopinion, which is based on NOTHING -- she has already admitted the knows<br/>\nnothing about the subject -- is more valid than my opinion, which is<br/>\nbased on a lot of time and research and the love of my children. Boy,<br/>\nthe more I think about it, the madder I get.&gt; <br/>\n<br/>\nRobin ~<br/>\n<br/>\nI know exactly how you feel. My friends, too, have severely questioned<br/>\nmy unschooling choice. When they are just asking me general questions<br/>\nabout it, I can sense their disapproval. I&#39;ve learned to say as little<br/>\nas possible, but I think that the unschooling website section about how<br/>\nto explain it to other people is going to be helpful with regard to<br/>\ncertain &quot;buzz words&quot; which might prove beneficial.<br/>\n<br/>\nIMHO, the reason many people (like your friend) are so angered at our<br/>\nunschooling decision is because deep inside, they are jealous at seeing<br/>\nsomeone else take control, charge, and power over their life. Think<br/>\nabout it: most women we know are on the fast track and life, in essence,<br/>\nis controlling them. When they see another woman who is taking charge of<br/>\nher life and (probably) doing so at some level of sacrifice, it forces<br/>\nthem to look truthfully at their own life. At least, that&#39;s what I see<br/>\nhappening with a couple of my girlfriends. I even hear them make<br/>\ncomments like, &quot;Maybe I should have homeschooled my kids,&quot; but then they<br/>\ngo right back to questioning my choice.<br/>\n<br/>\nI think trying to &quot;convince&quot; others that unschooling is the right thing<br/>\nto do is like trying to convince someone to change their religion or<br/>\nsomething like that, just because we think they should. In my case,<br/>\nunschooling was a discovery I had to make for myself, just like my being<br/>\nborn again was a discovery I had to make for myself. Embracing<br/>\nunschooling was a process for me; a journey. How do you &quot;explain&quot; that<br/>\nto someone else? Why should we be required to? We don&#39;t have to explain<br/>\nto them why we go to the church we do, or why we shop at the grocery<br/>\nstore we do, etc., etc.<br/>\n<br/>\nI also think that most people truly believe that public school education<br/>\nin this country is in big trouble, but they are not willing to do<br/>\nanything about it. And those of us who ARE willing to do something about<br/>\nit, are threatening to them.<br/>\n<br/>\nMy two cents...<br/>\n<br/>\nDenise, a tea lover in South Carolina<br/>\nStop by for a cup of tea ~ <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.angelfire.com/sc/tealover\">http://www.angelfire.com/sc/tealover</a></div>","specialLinks":[]},{"userId":0,"authorName":"Robin Stark","from":"Robin Stark &lt;robinstark@...","replyTo":"LIST","senderId":"fjASgktk8pea8auJ85YPEZToqxKZO6G6_vvk5DRPw8bw19f-5zrmi2OjeLw53HnO2C_mJXYkPtV0wzpUAITnztNB-bGD3n_DzYdQAIk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Friends(?)/Family","postDate":"928456355","msgId":356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40NS4zNTYuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":366,"prevInTime":355,"nextInTime":357,"topicId":356,"numMessagesInTopic":0,"msgSnippet":"I had an experience this morning where my best friend, who lives in Los Angeles to my Tacoma, WA, told me not to send her any information on homeschooling or","messageBody":"<div id=\"ygrps-yiv-1167218795\">I had an experience this morning where my best friend, who lives in Los<br/>\nAngeles to my Tacoma, WA, told me not to send her any information on<br/>\nhomeschooling or unschooling. She said she just didn&#39;t agree with me and<br/>\nthat she had her way and I had my way and that was the way it was. She said<br/>\nshe didn&#39;t want to argue about it, so we just couldn&#39;t talk about it. (We<br/>\nhaven&#39;t argued about it. In fact, we&#39;ve hardly talked about it. )<br/>\n<br/>\nBut before she told me this, in a previous email she said, &quot;I guess the<br/>\nmain thing I&#39;m concerned about is that they&#39;re going to miss out on social<br/>\nthings at school and that they won&#39;t have a varied curriculum.  Also, how<br/>\ndo they get a diploma or credits for going to college?  I don&#39;t know<br/>\nanything about these things.  What about proms, football games, etc.,<br/>\nthings that I really loved in school.  Tell me.&quot;<br/>\n<br/>\nSo I tried to tell her. I sent her one article from the free emails from<br/>\nthe Home Ed Magazine. ONE article. I was going to try to spoonfeed her. She<br/>\ncouldn&#39;t even read that. She knows absolutely NOTHING about the subject,<br/>\nbut she has already formed her opinion. I&#39;m telling you, I &#39;bout crapped my<br/>\ndrawers. I have know this woman longer than I&#39;ve known my husband (16<br/>\nyears), and I never knew she was so narrow-minded. I&#39;m at a loss for what<br/>\nto do because it&#39;s going to be hard for me to get over her closed mind.<br/>\n<br/>\nWhat she is saying is that her opinion, which is based on NOTHING -- she<br/>\nhas already admitted the knows nothing about the subject -- is more valid<br/>\nthan my opinion, which is based on a lot of time and research and the love<br/>\nof my children. Boy, the more I think about it, the madder I get.<br/>\n<br/>\nRobin Stark<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;Ann,<br/>\n&gt;     Unfortunately, we have done so in a way.  We don&#39;t see my parents even a<br/>\n&gt;third as much as we used to, and our relationship is very strained now.  I<br/>\n&gt;hate to see it happen like that, but whenever I bend just a little and<br/>\n&gt;apologize, they seem to think that I am admitting that I am wrong, and they<br/>\n&gt;come in and try to take charge again.  With my husbands help, I am firmly<br/>\n&gt;standing my ground, but my parents are not happy with that effect, and they<br/>\n&gt;have pulled away because of it.<br/>\n&gt;Tami in In<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;&quot;Congratulations to &#39;Voice-Diary,&#39; our latest ONElist of the Week.<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com\">http://www.onelist.com</a><br/>\n&gt;Visit our homepage and share with us how ONElist is changing YOUR life!<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;Check it out!<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n<br/>\n </span></blockquote>- - - - - - - -<br/>\nRobin Stark</div>","specialLinks":[]}],"prevTopicId":680,"nextTopicId":639}}