{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":313036834,"authorName":"strawlis","from":"&quot;strawlis&quot; &lt;lisberning@...&gt;","profile":"strawlis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling through a crisis","postDate":"1278119499","msgId":55633,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwbTJvYithajc4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg=="},"prevInTopic":55631,"nextInTopic":0,"prevInTime":55632,"nextInTime":55634,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"... Biggest thing I can share is that you have the power of choice, if unschooling is important to you and putting them back in school is not an option you","messageBody":"<div id=\"ygrps-yiv-820801034\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;joanne.lopers&quot; &lt;wilmalv@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I was hoping to hear of some stories of others who have really pushed through...<br/>\n<br/>\n </span></blockquote>Biggest thing I can share is that you have the power of choice, if unschooling is important to you and putting them back in school is not an option you want to consider...Than you have choices, like, there are unschooling families that work opposite shifts, there are families, like mine, that learned to live on a lot less. There is always another option or way to look at at problem.  The worst is feeling stuck. Can you give us specifics we can help you with? <br/>\n<br/>\n Also I would share, that I think its very important to involve the kids in the process as much as possible.  When my DH lost his job,(he was out of work for a little over 11 months) the first thing we did was tighten the belt...cutting all the extras, girls had a say on what went and what we keep. There was so many things we could have done and would have done to keep our lifestyle. We sought out and got public assistance (namely food stamps and medical insurance for the girls). We did qualify for unemployment. I offered to go back to work..my dh ask that I not, he knew he could not be present for our children, he was to put it simply depressed and wanted space to focus on recharging himself and his career. <br/>\n<br/>\nOther than cutting out some major expensive trips we had planned (we still traveled ,in fact, we got a cross country road trip all expenses paid, from a job offer DH took but, did not work out)...our life flowed much as did before crisis, waking daily and pursuing what brought us joy.  I think that is what&#39;s so wonderful about this lifestyle is more about an attitude, or feeling of abundance than it is about quantitative measures.  Open up to the possibility that you can make it work and you can. Having lots of money doesn&#39;t make unschooling work...being and feeling generous does.<br/>\n<br/>\nI have lots of examples, as I&#39;m sure others do, of things that can help you feel less stuck, for specific problems, please share some worries if you can, so they can be addressed.<br/>\n<br/>\nElisabeth mama to Liv(11) and Lex(9)</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling through a crisis","postDate":"1278113307","msgId":55631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdFMkJFQTAyLUYzN0YtNDU1QS1BOEJDLUNCNkUzMjZGNUVDRkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg==","referencesHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg=="},"prevInTopic":55626,"nextInTopic":55633,"prevInTime":55630,"nextInTime":55632,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"I looked back at some posts about stealing and explosiveness and following rules. I wonder if some of what your boys are going through has something to do with","messageBody":"<div id=\"ygrps-yiv-791969818\">I looked back at some posts about stealing and explosiveness and  <br/>\nfollowing rules. I wonder if some of what your boys are going through  <br/>\nhas something to do with your financial uncertainty (and therefore,  <br/>\nhow you might be reacting)?<br/>\n<br/>\nMany times, kids can sense worry and discomfort in their parents, even  <br/>\nwhen their parents aren&#39;t talking about it. That&#39;s not to say you must  <br/>\ntell them every little thing about a financial situation, but they  <br/>\nneed to know they will be safe and loved and taken care of no matter  <br/>\nwhat. Parents&#39; fears can translate into kids&#39; fears, which can come  <br/>\nout in all sorts of ways, and can be completely fantastical.<br/>\n<br/>\nCould your financial crisis be part of what&#39;s going on?<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 2, 2010, at 1:08 AM, joanne.lopers wrote:<br/>\n<br/>\n&gt; I was hoping to hear of some stories of others who have really  <br/>\n&gt; pushed through a crisis as an unschooler.  We are experiencing  <br/>\n&gt; financial ruin and it has been extreemly difficult for me to stay in  <br/>\n&gt; the moment and focused on the kids in such uncertain times.  We  <br/>\n&gt; don&#39;t live near any family (so I feel isolated) and I am finding the  <br/>\n&gt; stress crippling. I don&#39;t want to loose all that I have gained from  <br/>\n&gt; unschooling but I am not sure I am going to be able to continue.<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling through a crisis","postDate":"1278100416","msgId":55626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2Mjg0NC41NzEyNC5xbUB3ZWIxMTA0MDUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg==","referencesHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg=="},"prevInTopic":55618,"nextInTopic":55631,"prevInTime":55625,"nextInTime":55627,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"***We are experiencing financial ruin and it has been extreemly difficult for me to stay in the moment and focused on the kids in such uncertain times*** ","messageBody":"<div id=\"ygrps-yiv-2003165993\">***We are experiencing financial ruin and it has been extreemly difficult for me to stay in the moment and focused on the kids in such uncertain times***<br/>\n<br/>\nChange your perspective.  Do you have food?  Clothing?  Shelter?  Transportation?  Is everyone healthy?  Is there money coming in?<br/>\n<br/>\nFinancial ruin means different things to different people, so careful on that one!  If you are about to lose your house and have your car repo-ed, what&#39;s the worst that can happen after that?  Bankruptcy?  You live in a tent for the summer in a campground?  You buy a little trailer and live in a trailer park for a while?  Sometimes it helps to play the worst case scenario in your head to see all that you DO have!  You aren&#39;t a dust bowl family traveling with your cart with all your meager belongings, looking for scraps of food on your travel to nowhere.<br/>\n<br/>\nWe live in a culture of wealth, and people take it for granted until they lose some of it.<br/>\n<br/>\nFind the joy in what you DO have!  Make some delicious bread, heck, make some cupcakes with homemade frosting!  Go for walks and ride bikes, check out videos and games from the library, look for all the freebie things in your town.  Go to the thrift store next time you need something.<br/>\n<br/>\nThere are kids who go to school whose parents have lost their jobs and they&#39;ve lost their house and car and have to move away from friends and their schools.  That can happen to anybody and has little to do with unschooling.  It&#39;s summer too and most kids wouldn&#39;t be in school anyway.  Think short term, what can you do by school time to keep on going?  What does unschooling require to continue?<br/>\n<br/>\nSure, having resources is wonderful, but even those that have abundance, have limits in what they can do.  Less resources mean more limits, but wait, does it?  Or does it mean different limits?  Focus on what you CAN do, not what you CANNOT do.  If the kids have been taking horseback riding lessons, and swimming lessons, and flute lessons, and go to the movies once a week and out to eat 2 or 3 times a week and clothes shopping at least once a month and suddenly those things are gone, that can be very very hard to acclimate to.  Kids do though, and even easier if they have a can do mom, who finds creative and resourceful ways to meet as many needs as possible.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":431583163,"authorName":"Jason & Stephanie","from":"&quot;Jason & Stephanie&quot; &lt;jay_steph93@...&gt;","profile":"mom_to_kbcj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling through a crisis","postDate":"1278090779","msgId":55618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5NzRDNzkwMUIxOTQ3OENCRUQ5OTVCRUY3RjIzN0QwQGd4Mjgwc3NmM2ZjMGZlPg==","referencesHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg=="},"prevInTopic":55616,"nextInTopic":55626,"prevInTime":55617,"nextInTime":55619,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"I was hoping to hear of some stories of others who have really pushed through a crisis as an unschooler.  We are experiencing financial ruin and it has been","messageBody":"<div id=\"ygrps-yiv-414846527\">I was hoping to hear of some stories of others who have really pushed through a crisis as an unschooler.  We are experiencing financial ruin and it has been extreemly difficult for me to stay in the moment and focused on the kids in such uncertain times.  We don&#39;t live near any family (so I feel isolated) and I am finding the stress crippling. I don&#39;t want to loose all that I have gained from unschooling but I am not sure I am going to be able to continue.  <br/>\n  Joanne&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  ******Last year from September through December, my husband was unemployed.  No income, no unemployment etc....It was the hardest financial time in our life. The stress was unreal, I also have some health issues and my anxiety and blood pressure were terrible then.<br/>\n<br/>\n  We have always unschooled so the kids just kept living and learning. Yes we had no money and didn&#39;t even know where our food was coming from. We had financial help from internet friends and met some local people and hooked up with getting food.We ended up losing the internet but really just briefly. We foreclosed on our house and focused on moving. <br/>\n<br/>\n  It is all a blur now.<br/>\n<br/>\n  In my opinion, living is learning, unschooling is living, this is real life. <br/>\n<br/>\n  I don&#39;t understand why you don&#39;t think you can continue to unschool?<br/>\n<br/>\n  In my mind it&#39;s not something you do, it&#39;s something you live.<br/>\n<br/>\n  Stephanie<br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.learningthroughliving-stephanie.blogspot.com\">http://www.learningthroughliving-stephanie.blogspot.com</a><br/>\n<br/>\n  &quot;It&#39;s not that I feel that school is a good idea gone wrong,&quot; he says, &quot;but a wrong idea from the word go. It&#39;s a nutty notion that we can have a place where nothing but learning happens, cut off from the rest of life.&quot;<br/>\n  ~John Holt<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling through a crisis","postDate":"1278088456","msgId":55616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwbDRlOCttOGcxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg=="},"prevInTopic":55614,"nextInTopic":55618,"prevInTime":55615,"nextInTime":55617,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"When we were having our financial crisis, a few years ago, it helped me to remember that unschooling was one of the good parts of my life. It helped me to","messageBody":"<div id=\"ygrps-yiv-1952025876\">When we were having our financial crisis, a few years ago, it helped me to remember that unschooling was one of the good parts of my life. It helped me to focus on joy and how much I love the people in my life - my kids and my partner and my friends. It helped to take a little time away from frantically searching for financial solutions and play or watch movies - to really treat myself gently and kindly like I was getting over the flu or something - and use those moments to spend time savoring my loved ones company and letting them have the pleasure of mine. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling through a crisis","postDate":"1278084861","msgId":55614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3MTM4Ni4yODEwMS5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg==","referencesHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg=="},"prevInTopic":55613,"nextInTopic":55616,"prevInTime":55613,"nextInTime":55615,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"Joanne, 2008 and 2009 were really hard financially for us too. I am in the process of going bankrupt, our income was slashed to 1/3 or more and it was hard. ","messageBody":"<div id=\"ygrps-yiv-708749095\">Joanne, 2008 and 2009 were really hard financially for us too.<br/>\nI am in the process of going bankrupt, our income was slashed to 1/3 or more <br/>\nand it was hard.<br/>\nI was extremely stressed and having no money in the bank for days was terifying.<br/>\nWe used all our savings and retirement funds so we were left without any money.<br/>\nSeveral of our most valuable cows died to add to the mess and the import/export of embryos from Minnesota<br/>\nwas put in a halt due to Tuberculosis somewhere in the state ( we made money on it ).<br/>\n<br/>\nIT will change!<br/>\nThis year things are looking up. Our herd is TB free tested and certified and exports are open again, we have some really valuable cows <br/>\nagain and I have really been able to work with very little money even more creatively. I was not a spender to begin with and I have really learned a great deal more of saving and living with less.<br/>\n<br/>\nThere were times that I was very stressed and my patience was less than but I tried to take many deep breaths<br/>\nand focus on the moment with my kids.<br/>\nAt least my kids were healthy ! That is more important than the other stuff.<br/>\nI learned all the things we could do with little or no money( lots),<br/>\nI talked honestly with my young children and they have been so wonderful about it.<br/>\nThey , even when frustrated for not being able to get or do something, were very understanding and<br/>\njust really amazing.<br/>\nI have learned a lot from it.<br/>\nFriends were great and supportive. Family was not as supportive but did not say much as I know<br/>\nthey think I should go to work and put kids in school ( one side of the family).<br/>\n<br/>\nI say be honest with the kids but be aware not to make them feel afraid of the future or what will happen.<br/>\nBe positive and strong.<br/>\nFind all the things you guys can do for fun that are free or very cheap.<br/>\nCut coupons together, go look for sales together.<br/>\nTake deep breaths and be with your kids.<br/>\nIt is just money and you can do it.<br/>\nReally!<br/>\nI learned to budget so much better and I went back to having a huge garden.<br/>\nThere is so much you can do to make a go of it with little money.<br/>\nThere are lots of blogs that can help but I lost all my links with my older laptop.<br/>\nStart with Freecycle and Craigslist.<br/>\nLike my washer died and I have a really nice on free from Craigslist.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling through a crisis","postDate":"1278082288","msgId":55613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMkRGQ0YwLjUwNjA2MDJAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg==","referencesHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg=="},"prevInTopic":55612,"nextInTopic":55614,"prevInTime":55612,"nextInTime":55614,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"... You don t lose what you ve gained --- even if the kids go to school, they go with the experience and understanding that came from unschooling. -pam","messageBody":"<div id=\"ygrps-yiv-361354065\">On 7/2/2010 1:08 AM, joanne.lopers wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t want to loose all that I have gained from unschooling but I am <br/>\n&gt; not sure I am going to be able to continue. <br/>\n<br/>\n </span></blockquote>You don&#39;t lose what you&#39;ve gained --- even if the kids go to school, <br/>\nthey go with the experience and understanding that came from unschooling.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling through a crisis","postDate":"1278081276","msgId":55612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxRDAyQkY4LUNFQjYtNDRDNS1CODk5LTY0QjA5MEE1NTY5QkBzdXBlbm4uY29tPg==","inReplyToHeader":"PDYyREQ2MUUwLTY4MEYtNDcwMS1BNjQ1LUMwQzVDRTA0Mjg2MEBzdXBlbm4uY29tPg==","referencesHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPiA8N0I3OEE3MTgtMDdFNy00RTlBLThFRDUtOTA0OTkxRTIyNjc2QFNhbmRyYWRvZGQuY29tPiA8NjJERDYxRTAtNjgwRi00NzAxLUE2NDUtQzBDNUNFMDQyODYwQHN1cGVubi5jb20+"},"prevInTopic":55610,"nextInTopic":55613,"prevInTime":55611,"nextInTime":55613,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"... Replying to myself to say that your answers way well be different than mine have been; heck, mine might be different another time. But figuring out the","messageBody":"<div id=\"ygrps-yiv-1045184831\">On Jul 2, 2010, at 10:31 AM, Su Penn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Maybe it helps for me to chime in and say I&#39;ve been there, recently, and it really does pretty much come down to Sandra&#39;s question. I would ask myself questions like that, and the answers really clarified things for me:<br/>\n<br/>\n </span></blockquote>Replying to myself to say that your answers way well be different than mine have been; heck, mine might be different another time. But figuring out the cut-through-the-BS, bottom-line questions can be very clarifying.<br/>\n<br/>\nSu</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling through a crisis","postDate":"1278081098","msgId":55610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyREQ2MUUwLTY4MEYtNDcwMS1BNjQ1LUMwQzVDRTA0Mjg2MEBzdXBlbm4uY29tPg==","inReplyToHeader":"PDdCNzhBNzE4LTA3RTctNEU5QS04RUQ1LTkwNDk5MUUyMjY3NkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPiA8N0I3OEE3MTgtMDdFNy00RTlBLThFRDUtOTA0OTkxRTIyNjc2QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":55609,"nextInTopic":55612,"prevInTime":55609,"nextInTime":55611,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"... I had started a long answer about a recent financial/health crisis I dealt with, both of which we re still recovering from and will be for awhile. But","messageBody":"<div id=\"ygrps-yiv-1262636222\">On Jul 2, 2010, at 10:03 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=- We are experiencing financial ruin and it has been extreemly  <br/>\n&gt; difficult for me to stay in the moment and focused on the kids in such  <br/>\n&gt; uncertain times. -=-<br/>\n&gt; <br/>\n&gt; Would it be easier if they were in school?<br/>\n&gt; <br/>\n&gt; Sometimes that&#39;s the only question you need to ask yourself to snap  <br/>\n&gt; out of the stuck-place.<br/>\n<br/>\n </span></blockquote>I had started a long answer about a recent financial/health crisis I dealt with, both of which we&#39;re still recovering from and will be for awhile. But Sandra boiled it down right here. Maybe it helps for me to chime in and say I&#39;ve been there, recently, and it really does pretty much come down to Sandra&#39;s question. I would ask myself questions like that, and the answers really clarified things for me:<br/>\n<br/>\n1. Would it be easier for _me_ if they were in school? Maybe, sometimes. But I have friends with kids in school and they have their own whole set of stresses to deal with, some of which would be harder for me than having the kids at home, even when I was very unwell and extremely irritable. I really wasn&#39;t sure which side of the balance this one would fall on if I put them in school (especially since I&#39;d still have had Yehva, the World&#39;s Second-Most Active Two-Year Old, at home).<br/>\n<br/>\n2. Would the kids be happier in school right now? This was a big cobweb-clearer for me. My stress and my fatigue were leading to irritability, I was not being the peaceful mom I wanted to be, and I was always comparing our lives &quot;as they were&quot; to how I thought they ideally should be (and had been before the crises). But my partner would remind me that the boys were actually doing great--I wasn&#39;t engaged so much with them, and that wouldn&#39;t be great long-term, but they were enjoying themselves and keeping busy nonetheless.<br/>\n<br/>\nSu, mom to Eric, 9; Carl, 6; Yehva, almost 3</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling through a crisis","postDate":"1278079432","msgId":55609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCNzhBNzE4LTA3RTctNEU5QS04RUQ1LTkwNDk5MUUyMjY3NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg==","referencesHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg=="},"prevInTopic":55604,"nextInTopic":55610,"prevInTime":55608,"nextInTime":55610,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"-=- We are experiencing financial ruin and it has been extreemly difficult for me to stay in the moment and focused on the kids in such uncertain times. -=- ","messageBody":"<div id=\"ygrps-yiv-1024171453\">-=- We are experiencing financial ruin and it has been extreemly  <br/>\ndifficult for me to stay in the moment and focused on the kids in such  <br/>\nuncertain times. -=-<br/>\n<br/>\nWould it be easier if they were in school?<br/>\n<br/>\nSometimes that&#39;s the only question you need to ask yourself to snap  <br/>\nout of the stuck-place.<br/>\n<br/>\nIf it WOULD be better or easier, school is free and probably not so  <br/>\nfar away.<br/>\n<br/>\nIf it would not be better, then remember you&#39;re making a choice, and  <br/>\npart of that choice involves making unschooling better than school  <br/>\nwould be.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":361639019,"authorName":"joanne.lopers","from":"&quot;joanne.lopers&quot; &lt;wilmalv@...&gt;","profile":"joanne.lopers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling through a crisis","postDate":"1278058117","msgId":55604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwazZxNStpMW43QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":55609,"prevInTime":55603,"nextInTime":55605,"topicId":55604,"numMessagesInTopic":0,"msgSnippet":"I was hoping to hear of some stories of others who have really pushed through a crisis as an unschooler.  We are experiencing financial ruin and it has been","messageBody":"<div id=\"ygrps-yiv-1085502043\">I was hoping to hear of some stories of others who have really pushed through a crisis as an unschooler.  We are experiencing financial ruin and it has been extreemly difficult for me to stay in the moment and focused on the kids in such uncertain times.  We don&#39;t live near any family (so I feel isolated) and I am finding the stress crippling. I don&#39;t want to loose all that I have gained from unschooling but I am not sure I am going to be able to continue.  <br/>\nJoanne</div>","specialLinks":[]}],"prevTopicId":55627,"nextTopicId":55640}}