{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":77070457,"authorName":"Sanguinegirl83@aol.com","from":"Sanguinegirl83@...","profile":"sanguinegirl83","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Specific Suggestions","postDate":"1092113405","msgId":97599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhLjU1OGYxYzFhLjJlNDlhZGZkQGFvbC5jb20+"},"prevInTopic":97195,"nextInTopic":0,"prevInTime":97598,"nextInTime":97600,"topicId":97187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/2/2004 9:15:51 AM Eastern Daylight Time, ... Just a little FYI-the organic carrots do not have the nitrates, which comes from the","messageBody":"<div id=\"ygrps-yiv-1813344563\">In a message dated 8/2/2004 9:15:51 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I read<br/>\n&gt; something about how fresh carrots are too high in nitrites <br/>\n<br/>\n </span></blockquote>Just a little FYI-the organic carrots do not have the nitrates, which comes <br/>\nfrom the synthetic fertilizers used in &quot;standard&quot; farming.<br/>\n<br/>\nPeace,<br/>\nSang<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Specific Suggestions","postDate":"1091454150","msgId":97195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzQwMWM0Nzg5NiQ4ZWJmZjliMCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+","referencesHeader":"PEJEMzJGQjAzLjU2MTglaGVhdGhlcmV0dGVAY29tY2FzdC5uZXQ+IDwwMWFmMDFjNDc4OTAkNmRjMTM5YTAkNjQwMWE4YzBATU9MRTI2OTAwPg=="},"prevInTopic":97187,"nextInTopic":97599,"prevInTime":97194,"nextInTime":97196,"topicId":97187,"numMessagesInTopic":0,"msgSnippet":"Sometimes making things *easy* instead of *simple* (which reeks with a certain kind of consumerism) is the easiest path towards enjoying your family **********","messageBody":"<div id=\"ygrps-yiv-1650483852\">Sometimes making things *easy* instead of<br/>\n*simple* (which reeks with a certain kind of consumerism) is the easiest<br/>\npath towards enjoying your family <br/>\n<br/>\n**********<br/>\n<br/>\n<br/>\nThis is soooooo key at my house.  I try to make things as easy as possible. If things are easy for me, then my life is easier, and my attitude is lighter.  I had to learn to not feel guilty over the fact that I was choosing to make things easier.  Our culture prides itself on martyrdom.<br/>\n<br/>\nI will make one other suggestion though. I&#39;ve been taking anti-depressants.  Without them I was much more more panicked about little things.  I felt &quot;out of control&quot; and &quot;guilty&quot; about everything whether there was a reason to or not.  I mentally rehash things over and over again in order to settle them in my mind.  I decided to try medication as a last resort and I only wish I had done it sooner.<br/>\n<br/>\nNow I feel like I can settle things in my mind and move on.  I don&#39;t dwell on things, and I feel much more able to focus.  All of this affects my kids because I can enjoy them so much more.<br/>\n<br/>\nYou may want to look into this. It might just make things a little less scary for you while you figure things out.<br/>\n<br/>\nKristen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Specific Suggestions","postDate":"1091451517","msgId":97187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYWYwMWM0Nzg5MCQ2ZGMxMzlhMCQ2NDAxYThjMEBNT0xFMjY5MDA+","referencesHeader":"PEJEMzJGQjAzLjU2MTglaGVhdGhlcmV0dGVAY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":97195,"prevInTime":97186,"nextInTime":97188,"topicId":97187,"numMessagesInTopic":0,"msgSnippet":"Since I had my second child my ... my ... only ... call ... obstacles ... ============== There have already been some great suggestions. My suggestion would be","messageBody":"<div id=\"ygrps-yiv-1109404637\">Since I had my second child my<br/>\n<blockquote><span title=\"ireply\"> &gt; parenting goals have been very simple.  My very basic goal was to not hit<br/>\n </span></blockquote>my<br/>\n<blockquote><span title=\"ireply\"> &gt; kids. The others all seem like easy to me like providing organic food,<br/>\n </span></blockquote>only<br/>\n<blockquote><span title=\"ireply\"> &gt; using non toxic stuff in my house, read to them, make sure they get to<br/>\n </span></blockquote>call<br/>\n<blockquote><span title=\"ireply\"> &gt; their grandmas often enough to have a clue who they are.<br/>\n&gt; That just isn&#39;t enough anymore.  It seems like one of the biggest<br/>\n </span></blockquote>obstacles<br/>\n<blockquote><span title=\"ireply\"> &gt; for me is play.<br/>\n </span></blockquote>==============<br/>\n<br/>\nThere have already been some great suggestions. My suggestion would be to<br/>\nshift your thinking of the word &quot;simple.&quot; The simple that I&#39;m reading above<br/>\nis laden with guilt--at least in how I once saw those same issues. Sometimes<br/>\nsimple isn&#39;t going to be organic or non-toxic or politically correct, and<br/>\nsometimes with small children that&#39;s okay because being with them in peace<br/>\nand love is more important (sorry folks) than saving the world. If you think<br/>\nin terms of raising peaceful, happy people that won&#39;t repeat the same<br/>\npatterns, then you are, in fact, changing the world and making it a better<br/>\nplace in an arguably far more meaningful way. Sometimes being able to clean<br/>\nup a mess quickly and easily is more important than making sure everything<br/>\nis labeled organic and non-toxic. Sometimes making things *easy* instead of<br/>\n*simple* (which reeks with a certain kind of consumerism) is the easiest<br/>\npath towards enjoying your family and achieveing your number one goal: not<br/>\nto hit your kids. If you focus on easy and joy and peace and happiness,<br/>\nhowever, maybe you&#39;ll go one step further than that and not *want* to hit<br/>\nyour kids.<br/>\n<br/>\nI had three babies under three--all in diapers--1000 miles away from any<br/>\nfamily. I know how hard things can be! I vividly remember laying my body<br/>\nacross the door to the playroom when I was pregnant with my third. Being<br/>\ndown on the floor with the girls really seemed to make a huge difference<br/>\nrather than sitting on a couch or chair, and I could doze off after building<br/>\na few block towers, knowing that they would have to crawl/ climb over me to<br/>\nget out of the room. I didn&#39;t have anyone to come in to help out, so for me,<br/>\nlife was all about coping strategies--finding ways to meet everyone&#39;s needs<br/>\nwhenever possible. Not necessarily perfect, but happy.<br/>\n<br/>\nWhen my first was born, I vowed only to use cloth diapers, organic food, the<br/>\nwhole shebang. Her skin was so sensitive that I used only water wipes after<br/>\nchanges--couldn&#39;t use diaper wipes for months--like 6 or 7. After a month of<br/>\nbattling with persistent diaper rash and dh&#39;s grandmother telling me that I<br/>\nwas just going to have to boil those diapers on the top of my stove (no<br/>\ndiaper service where we lived), I called it quits. Disposable diapers, no<br/>\ndiaper rash and a much happier baby and mama. When she was 6 mos. old, I<br/>\nstarted making all of her baby food from scratch, mixed only with<br/>\nbreastmilk--all the while thinking to myself what an amazing mother I was<br/>\nand what a great job I was doing. Well, after the fact sometime around the<br/>\ntime my second was going to start solids (who by the way never took baby<br/>\nfood anyway and just went straight to table food at around 10 mos), I read<br/>\nsomething about how fresh carrots are too high in nitrites or something for<br/>\nbabies and that baby food carrots were actually better. Don&#39;t know if that&#39;s<br/>\ntrue, but it did show me that there was a whole lot wrapped up in mothering<br/>\nperfectly. Emily&#39;s favorite food had been carrots--her skin had even turned<br/>\nan orange tinge because of them. Here I was filled with guilt because I&#39;d<br/>\nmade her carrots from scratch! Perfect turned out to be not so perfect after<br/>\nall.<br/>\n<br/>\nYour goals up above still seem to me to be about perfection, and let&#39;s be<br/>\nhonest--perfection is anything but simple! Shift your goals toward truly<br/>\nsimplifying your life by first off letting go of the perfectionism.<br/>\nPerfectionism also tends to be more about the mother than the children, and<br/>\nwhat folks on this board are trying to get you to do is to focus on the kids<br/>\ninstead of yourself and on yourself instead of your kids in ways that are<br/>\nhealthy and productive. Right now the ways that you&#39;re focusing on both<br/>\nyourself and your kids seem to be unhealthy, causing you to stagnate in a<br/>\npretty bad place. Shift from trying to mother perfectly to trying to mother<br/>\njoyfully. Shift from trying to play with your kids to trying to connect with<br/>\nyour kids. Shift from trying to escape to trying to find peace and joy.<br/>\n<br/>\nThe specifics strategies to acheive those goals will only come from trial<br/>\nand error--finding what works for you and your kids. For me, the strategies<br/>\ndiffer. Sometimes late in the day, I make myself a cappuccino and that&#39;s<br/>\nenough to boost and comfort and focus on me. Sometimes the kids and I will<br/>\nclimb in my bed together and pop in a DVD. Sometimes we&#39;ll pull out a<br/>\nboardgame or go play on the climbing wall. Sometimes we&#39;ll jump in the car<br/>\nand go someplace we&#39;ve never been. Sometimes we&#39;ll make milkshakes or<br/>\nmake-your-own sundaes. For us, the key is usually to shake things up a bit,<br/>\nbecause if we&#39;re starting to get on each other&#39;s nerves, it usually means<br/>\nwe&#39;re in a rut and getting antsy.<br/>\n<br/>\nGood luck!<br/>\n<br/>\n--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a></div>","specialLinks":[]}],"prevTopicId":97562,"nextTopicId":97549}}