{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:question on resources for adults","postDate":"1261425780","msgId":49197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxMzE3OC4yNjc3NS5xbUB3ZWIxMTA0MTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhnb2Vrcyt0czk1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhnb2Vrcyt0czk1QGVHcm91cHMuY29tPg=="},"prevInTopic":49194,"nextInTopic":0,"prevInTime":49196,"nextInTime":49198,"topicId":49146,"numMessagesInTopic":0,"msgSnippet":"***My second year I became passionate in choreography and composition, which was promptly shut down by my practical, science-minded father (his quote to me","messageBody":"<div id=\"ygrps-yiv-1852571685\">***My second year I became passionate in choreography and composition, which was promptly shut down by my practical, science-minded father (his quote to me was, I will not pay for you to sing and dance your way through college). ***<br/>\n<br/>\nIt offends my sense of being to know that people still don&#39;t see a connection between choreography and composition and the sciences.  I&#39;m sorry that happened to you.  I&#39;m sorry your father couldn&#39;t see beyond his own narrow definition of what science can encompass.<br/>\n<br/>\nI would have loved to have gone to Evergreen.  I had a friend that did and loved it.  Her parents payed for her college.  Mine didn&#39;t.  I got to choose whatever I wanted to study, but it had to be a state school that I could afford.  I studied dance and art, which my parents would&#39;ve gladly payed for if they could have.  They did take over a smaller loan as a graduation present, which was sweet.<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240358028,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;foehn_jye@...&gt;","profile":"foehn_jye","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:question on resources for adults","postDate":"1261419996","msgId":49194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhnb2Vrcyt0czk1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU3NzE1NWE5MDkxMjIwMjMxM28zMTBjNTkzNGpiMmFiYzYzNDM2Y2Y4YzdiQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49191,"nextInTopic":49197,"prevInTime":49193,"nextInTime":49195,"topicId":49146,"numMessagesInTopic":0,"msgSnippet":"I also went to Evergreen, and that is where I discovered that passion can exist in learning what one is interested in. Ironically, my interests varied each","messageBody":"<div id=\"ygrps-yiv-1132414467\">I also went to Evergreen, and that is where I discovered that passion can exist in learning what one is interested in.<br/>\n<br/>\nIronically, my interests varied each year I was there. My first year my passion was literature and mythology, and a program met my needs, and introduced me to a new interest in natural history. My second year I became passionate in choreography and composition, which was promptly shut down by my practical, science-minded father (his quote to me was, I will not pay for you to sing and dance your way through college). Being optimistic and ever-changing I embarked upon the study of mycology (the study of fungi) and lichen biology and ended up with a bachelor&#39;s of science much to the satisfaction of my father.  I left Evergreen 16 years ago, and I have continued to be highly passionate about learning everything I can in a hodge-podge of different fields--herbal medicine, Chinese medicine, labor and birthing, web-development, outdoor retail, adventure guiding, cycling, ecological fire recovery, unschooling, and the list goes on.<br/>\n<br/>\nHopefully this mans reflection on his current situation will be the springboard he needs to listen to his own heart, learning to be patient while he listens, and having the courage to make a change if one is needed.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, aimee wiman &lt;mamanandi@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I went to a great college for a while that definitely took life experience<br/>\n&gt; into account for credit.  evergreen state college.  No grades, create your<br/>\n&gt; own major, projects are learner based.  Loved it.  nandi<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":326490917,"authorName":"aimee wiman","from":"aimee wiman &lt;mamanandi@...&gt;","profile":"mamanandi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:question on resources for adults","postDate":"1261379594","msgId":49191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NzE1NWE5MDkxMjIwMjMxM28zMTBjNTkzNGpiMmFiYzYzNDM2Y2Y4YzdiQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49160,"nextInTopic":49194,"prevInTime":49190,"nextInTime":49192,"topicId":49146,"numMessagesInTopic":0,"msgSnippet":"I went to a great college for a while that definitely took life experience into account for credit.  evergreen state college.  No grades, create your own","messageBody":"<div id=\"ygrps-yiv-1377630041\">I went to a great college for a while that definitely took life experience<br/>\ninto account for credit.  evergreen state college.  No grades, create your<br/>\nown major, projects are learner based.  Loved it.  nandi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] question on resources for adults","postDate":"1260995979","msgId":49160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExMDdCNkFFLUMyODktNDRGQy1BMzUzLUJCRjMwRkJFQjg4OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDMzODE4MS4xMDYzNy5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PEQ2ODcyMEZDLTQzRTAtNDhGMi1BREZCLTVBNDE3RDU3QjdBNkBTYW5kcmFEb2RkLmNvbT4gPDMzODE4MS4xMDYzNy5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49159,"nextInTopic":49191,"prevInTime":49159,"nextInTime":49161,"topicId":49146,"numMessagesInTopic":0,"msgSnippet":"Thanks for all these. I m passing them on to the guy who asked, and having an exchange with him too. Sandra","messageBody":"<div id=\"ygrps-yiv-1574500949\">Thanks for all these. I&#39;m passing them on to the guy who asked, and  <br/>\nhaving an exchange with him too.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] question on resources for adults","postDate":"1260995128","msgId":49159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzODE4MS4xMDYzNy5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEQ2ODcyMEZDLTQzRTAtNDhGMi1BREZCLTVBNDE3RDU3QjdBNkBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PEQ2ODcyMEZDLTQzRTAtNDhGMi1BREZCLTVBNDE3RDU3QjdBNkBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":49156,"nextInTopic":49160,"prevInTime":49158,"nextInTime":49160,"topicId":49146,"numMessagesInTopic":0,"msgSnippet":"***While I genuinely value this opportunity and where it may lead, it ultimately feels lacking in actual education (no matter how heavy the workload).***   ","messageBody":"<div id=\"ygrps-yiv-1737668441\">***While I genuinely value this opportunity and where it may lead, it <br/>\nultimately feels lacking in actual education (no matter how heavy the <br/>\nworkload).***<br/>\n <br/>\nWhen I was in college, I was having a conversation with the person who had been the head of the dance department.  The university I attended hired a new person to head the fine and performing arts, with the intent to eliminate the dance program easily and smoothly without a community outcry.  He was very good at it, and the students didn&#39;t catch wind of it happening until right before it happened.  They gave all the students that were trying to earn a degree, 1 yr after the elimination of the dance program to finish their degree.  Everyone had half a year to finish the dance classes before they were gone and another year to finish all the other requirements.<br/>\n <br/>\nThere was no way I could do all the other requirements, because up until that point I had been taking tons of geology and anthropology classes alongside my dance classes.  None of them applied to my degree.  A dance degree at the time, required sociology and biology for the sciences and social sciences.<br/>\n <br/>\nSo, back to where I started here... I was talking with the person that had headed the dance department, sometime during the year following the demise of the program and sort of bemoaning the fact that I hadn&#39;t taken any of the required courses for my degree, mostly because they didn&#39;t interest me, so I had been putting them off.  I made a meeting with the new dean (that was a long and complicated affair) and asked him to let me have credit for my social science and sciences with my geology and anthropology.  He didn&#39;t want to deal with me or any other dance student so he gave me the credit and away I went.  I relayed all this to my former instructor/advisor and she said to me, that we, as people, only really truly learn something when we are ready to learn it and that it was just as well that I didn&#39;t take those classes because I wouldn&#39;t have gotten from them what I really needed since the interest wasn&#39;t there, but that one day it may become<br/>\n relevant and then I could learn it on my own.<br/>\n <br/>\nIt was one of those moments in your life when you&#39;ve suddenly been enlightened by something that changes everything for you from that moment forward.<br/>\n <br/>\nI understand why biology and sociology were required courses.  What surprised and delighted me was how much anthropology applied to dance.  None of the anthropology professors had encountered a dance student in their classes wanting to study dance through anthropology, yet they knew of some well known anthropologists who had done just that and were excited to share it with me.  It&#39;s too bad universities couldn&#39;t be more flexible in this manner.<br/>\n <br/>\nThe other thing I learned through dealing with all that, is that, if as a student, you want something from the university and it seems as if it isn&#39;t happening and that doors close and there is layer and layer of beauracracy, that if you are persistent and talk to the right people, you can make things happen.<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":239308464,"authorName":"Lang","from":"&quot;Lang&quot; &lt;lizasheehan@...&gt;","profile":"poppygirllang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question on resources for adults","postDate":"1260991297","msgId":49156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhnYmMwMSs4ZmE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ2ODcyMEZDLTQzRTAtNDhGMi1BREZCLTVBNDE3RDU3QjdBNkBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":49154,"nextInTopic":49159,"prevInTime":49155,"nextInTime":49157,"topicId":49146,"numMessagesInTopic":0,"msgSnippet":"Hi Sandra,  I don t post very often, but this man s question begged a response from me.  He could try augmenting with internships, fellowships, teaching intro","messageBody":"<div id=\"ygrps-yiv-466017916\">Hi Sandra,  I don&#39;t post very often, but this man&#39;s question begged a response from me.  He could try augmenting with internships, fellowships, teaching intro courses himself, and my all time favorite, volunteer work.  I&#39;m not talking about helping to dish out mashed potatoes at a homeless shelter on Christmas (thought great, it is a one time thing).  Volunteering your time can be a great way to be exposed to things you would normally not see, feel, hear...opportunities to realize that learning happens all the time?  I think so. <br/>\n<br/>\nI think that in conventional learning institutions it can be easy to equate learning with classes, books--reading and listening only.  I think that actively DOING can awake other parts of the brain/body.<br/>\n<br/>\nAfter doing these new and interesting things one can ponder at the end of the day/week and realize how much one has &quot;learned&quot;.  <br/>\nexperience = learning<br/>\n<br/>\nliza in los angeles<br/>\ndd, poppy, 4<br/>\nds, shepard, 16 mo&#39;s</div>","specialLinks":[]},{"userId":368013603,"authorName":"Dellos Family","from":"&quot;Dellos Family&quot; &lt;dellos2daeast@...&gt;","profile":"n2cre8n","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:question on resources for adults","postDate":"1260990932","msgId":49154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4REFDOTVEQTlFMDQyNDA4RjBCNjIyQzdCMjY0QjU2QE1vbXNQcmVjaW91cz4="},"prevInTopic":49146,"nextInTopic":49156,"prevInTime":49153,"nextInTime":49155,"topicId":49146,"numMessagesInTopic":0,"msgSnippet":"If he is studying something he loves, it should come easy (IMHO).  For example, my passion is art when I m not HSing or attending to family stuff.  I read art","messageBody":"<div id=\"ygrps-yiv-1730552903\">If he is studying something he loves, it should come easy (IMHO).  For example, my passion is art when I&#39;m not HSing or attending to family stuff.  I read art blogs, I buy mixed media books and magazines to learn more and inspire me, I attend one weekend-long workshop per year, I create whenever I can . . . I add it into my life in little ways, wherever I can.  <br/>\n<br/>\nI think it would be a great value for him to add to his own learning.  Subscribe to magazines that pertain to what he is learning in college, find local sites/attractions/museum to see, research online for blogs or studies, create a journal/scrapbook/blog of his adventure, make appointments with people that do what he&#39;s in college for and talk with them about it, etc.  <br/>\n<br/>\nSometimes, for me to get my mind to seek deeper into creative ideas I need to watch a great movie or listen to music.  I have a playlist called &quot;mom&#39;s art tunes&quot; because they are the songs that get me to immediately go to my creative place and forget about everything else.<br/>\n<br/>\nIt reminds me of my 12 yr old ds that suddenly said, &quot;I want to learn more about WWII&quot;.  He has already studied this and knows a great deal, but he&#39;s drawn to it and wants more.  So I asked him how and he stated books, military channel, and museums.  So we are getting those things gathered and lined up and are excited about it.<br/>\n<br/>\nJust my thoughts - I applaud him for finding your site and seeking out the answer - it&#39;s probably more obvious than he thinks!<br/>\nDiana<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"question on resources for adults","postDate":"1260940716","msgId":49146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ2ODcyMEZDLTQzRTAtNDhGMi1BREZCLTVBNDE3RDU3QjdBNkBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":49154,"prevInTime":49145,"nextInTime":49147,"topicId":49146,"numMessagesInTopic":0,"msgSnippet":"I m vague on these things and am hoping people here will have more knowledge. I got an e-mail: __________ Hello, Sandra. I am so happy to have found your site","messageBody":"<div id=\"ygrps-yiv-181016412\">I&#39;m vague on these things and am hoping people here will have more  <br/>\nknowledge.<br/>\n<br/>\nI got an e-mail:<br/>\n__________<br/>\n<br/>\nHello, Sandra. I am so happy to have found your site and your  <br/>\nabundance of ideas.<br/>\n<br/>\nI am a middle-aged man, did not enjoy my public school experience from  <br/>\nnursery-school onward, and was a poor student through high school.<br/>\n<br/>\nAfter years of occupational floundering, I am now a college sophomore  <br/>\nat a state university and doing very well academically, but again  <br/>\nfeeling disillusioned by conventional, institutional curriculum and  <br/>\nfaculty which seem mostly oriented toward enforcing/rewarding rote  <br/>\nprocedure.<br/>\n<br/>\nWhile I genuinely value this opportunity and where it may lead, it  <br/>\nultimately feels lacking in actual education (no matter how heavy the  <br/>\nworkload).<br/>\n<br/>\nI understand this is not exactly what you address, but do you have any  <br/>\n&quot;un-schooling&quot; advice for adults, how to make the most of such a  <br/>\ncontext, or constructive alternatives to augment this experience with  <br/>\neither parallel studies or unfamiliar perspectives? Are there online  <br/>\ncommunities which address these interests and concerns?<br/>\n<br/>\nThank you for your time, and for your site.<br/>\n__________<br/>\nMy response:<br/>\n__________<br/>\n<br/>\nI don&#39;t think there are yet, but probably will be someday.   I think  <br/>\nthere are some colleges that will give credit for outside experiences,  <br/>\nbut i really don&#39;t know which ones they are. I&#39;ve heard stories over  <br/>\nthe years.<br/>\n<br/>\n-=-I understand this is not exactly what you address, but do you have  <br/>\nany &quot;un-schooling&quot; advice for adults, how to make the most of such a  <br/>\ncontext, or constructive alternatives to augment this experience with  <br/>\neither parallel studies or unfamiliar perspectives?-=-<br/>\n<br/>\nI&#39;ll ask some people and get back with you, but in general, as to the  <br/>\nthings I deal with, I would recommend that you look at changing your  <br/>\nown perspective about what is &quot;learning&quot; and what is not.  When the  <br/>\nworld is divided into &quot;actual education&quot; (your phrase) and other  <br/>\nthings, it&#39;s a false dichotomy.  The more you think about learning and  <br/>\nthe less you think about &quot;education&quot; (or teaching, or school, or  <br/>\nclasses) the more you&#39;ll see learning everywhere.<br/>\n<br/>\nUntil I get back with you, maybe look at these things:&#92;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teaching\">http://sandradodd.com/teaching</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nSandra<br/>\n__________<br/>\nWhat else should I tell him?  I really don&#39;t know.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":49188,"nextTopicId":48865}}