{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":147376218,"authorName":"liza sabater","from":"liza sabater &lt;listdiva@...&gt;","profile":"lm_sabater","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: LOTR and Have To vs. Choose To [was: Have to vs. choose to]","postDate":"1072550961","msgId":86940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxRkNFRUNFLTM4OUQtMTFEOC04Qjk1LTAwMDM5M0I4NEZCNkBjdWx0dXJla2l0Y2hlbi5jb20+","inReplyToHeader":"PEJDMTJCRUEzLjIyNEM5JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":86899,"nextInTopic":0,"prevInTime":86939,"nextInTime":86941,"topicId":86882,"numMessagesInTopic":0,"msgSnippet":"... Last night we saw the extended version of LOTR Two Towers. The added scenes definitely give more depth to the characters. I ve never read the books --and","messageBody":"<div id=\"ygrps-yiv-789843917\">On Saturday, December 27, 2003, at 04:44  AM, Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; on 12/26/03 4:48 PM, Ren at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> wrote:<br/>\n&gt;<br/>\n&gt;&gt; Seeing our life work, our choices through the eyes of gratitude change<br/>\n&gt;&gt; everything.<br/>\n&gt;<br/>\n&gt; People will roll their eyes when I suggest they read Pollyanna. Disney<br/>\n&gt; ruined the book for lots of people. It isn&#39;t about a girl who&#39;s <br/>\n&gt; terminally<br/>\n&gt; happy. It&#39;s about a girl who consciously chooses to find the good in <br/>\n&gt; life.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Last night we saw the extended version of LOTR Two Towers. The added <br/>\nscenes definitely give more depth to the characters. I&#39;ve never read <br/>\nthe books --and don&#39;t want to until AFTER I see The Return of the King. <br/>\nSince I am a &#39;blank slate&#39;, I was particularly struck at how important <br/>\nSamwise is. What&#39;s that line he says towards the end? &quot;Why am I  doing <br/>\nthis? Because I want to believe there is still good in the world&quot; ... <br/>\nor something like that. It&#39;s such a simple and yet such a powerful <br/>\nmoment. It comes right after the juxtaposition of the heroes at Helms <br/>\nDeep and the relationship between the Gondor brothers and their father. <br/>\nSamwise words put the whole story into perspective  for me.<br/>\n<br/>\nHere&#39;s a movie that puts into context the HAVE TOs we construct around <br/>\nus and the CHOOSE TOs that we accept or decline. I got that this second <br/>\ninstallment is about all the choices the heroes make to accomplish <br/>\ntheir tasks. But these are not given, structured or permanent tasks <br/>\n--especially when it comes to Aragorn and the others. Their tasks keep <br/>\nchanging as the situations keep changing. Their hope, their ultimate <br/>\ngoal --of restoring peace, of defeating the forces of darkness-- that <br/>\nis what moves them from task to task.<br/>\n<br/>\nI can&#39;t remember who posted about how they stopped getting late to her <br/>\nschools assemblies once she was given the task to organize them. And <br/>\nshe responded to the effect of &quot;I was horrified at the thought of <br/>\nletting the whole school down&quot;. Well, VOILA! There was her higher sense <br/>\nof purpose. The word &#39;organizing&#39; is inconsequential because it does <br/>\nnot describe ALL the tasks she was involved in to make these meetings <br/>\nhappen.<br/>\n<br/>\nMy 6 year-old son some time ago declared he wanted to be the best <br/>\nskateboarder ever, just like Tony Hawk. He has not touched his <br/>\nskateboard in a while. He has a toy skateboard, he wants a &#39;real&#39; <br/>\nskateboard. So what has he been doing? He&#39;s been saving money to get <br/>\nhimself a real one. I tell him, Evan, honey, you can still use what you <br/>\nhave. He says, &quot;That&#39;s OK, there&#39;s other things I can do&quot;. So he <br/>\nskates. He&#39;s got amazing upper body strength (it&#39;s weird to see a kid <br/>\nwith muscles) because he likes to do the monkey bars and practice pull <br/>\nups. He plays falling down all the time. Jumping and just literally <br/>\nhitting the ground. I told him once that the most important part of <br/>\nskating/skateboarding is learning how to fall. I guess that&#39;s why he <br/>\nhas these falling games. Did I say his wrists are quite solid? He is <br/>\ncoming up with all these little tasks that I can see will build up to <br/>\nthe experience he needs to be a good skateboarder.<br/>\n<br/>\nI guess it comes out of our health experience. There are so many issues <br/>\nto tackle with out combined ailments that health is an ongoing process, <br/>\nnot a one shot &quot;get rid of it and get well&quot; situation. Managing <br/>\nallergies is to live in a constant state of awareness --loss sight of <br/>\nwhat you are eating and you can end up in the hospital. That&#39;s why I <br/>\ndon&#39;t diet anymore. Though overweight, I am the healthiest I have been <br/>\nin years. So this new life with allergies involves more than <br/>\nrestrictions, it involves a new approach to living and a whole new set <br/>\nof tasks. Dieting worked once in my life but it does not now. So in my <br/>\nquest for health, more than imposing the tasks, I am opening at <br/>\ndiscovering, just like Aragorn, what my next job is.<br/>\n<br/>\nTo get back to the whole idea of schedules and procrastination, I think <br/>\nthat a higher purpose, one bigger beyond the &quot;oh, I just like XYZ&quot;, <br/>\nmight be what the kids need.  Does it mean that if the kids don&#39;t know <br/>\nwhy they are doing this for that they are wrong or misguided? No, it <br/>\njust means that, that they do not know. It may be then the reason for <br/>\nthe mothers to back off a little bit, to allow their kids to find their <br/>\nhigher purpose.<br/>\n<br/>\nI can&#39;&#39;t wait to see LOTR 3.<br/>\n<br/>\nl i z a<br/>\n=========================<br/>\nwww.culturekitchen.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Have to vs. choose to","postDate":"1072518259","msgId":86899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDMTJCRUEzLjIyNEM5JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDMxMjI2LjEzNDgyOC4xODQ2My42OTI1MDJAd2VibWFpbDI0Lm55Yy51bnRkLmNvbT4="},"prevInTopic":86890,"nextInTopic":86940,"prevInTime":86898,"nextInTime":86900,"topicId":86882,"numMessagesInTopic":0,"msgSnippet":"... People will roll their eyes when I suggest they read Pollyanna. Disney ruined the book for lots of people. It isn t about a girl who s terminally happy.","messageBody":"<div id=\"ygrps-yiv-2019408600\">on 12/26/03 4:48 PM, Ren at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Seeing our life work, our choices through the eyes of gratitude change<br/>\n&gt; everything.<br/>\n<br/>\n </span></blockquote>People will roll their eyes when I suggest they read Pollyanna. Disney<br/>\nruined the book for lots of people. It isn&#39;t about a girl who&#39;s terminally<br/>\nhappy. It&#39;s about a girl who consciously chooses to find the good in life.<br/>\n<br/>\nWe listened to it on tape. It&#39;s a *wonderful* book.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Have to vs. choose to","postDate":"1072485865","msgId":86890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMi4zYjllN2E1My4yZDFlMmZlOUBhb2wuY29tPg=="},"prevInTopic":86882,"nextInTopic":86899,"prevInTime":86889,"nextInTime":86891,"topicId":86882,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/26/2003 3:51:46 PM Central Standard Time, starsuncloud@netzero.net writes: When I m sick, I can be grateful I have family to care for me","messageBody":"<div id=\"ygrps-yiv-2127359700\">In a message dated 12/26/2003 3:51:46 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\nWhen I&#39;m sick, I can be grateful I have family to care for me and that I can <br/>\nrecover from whatever is ailing me, unlike many folks suffering much worse <br/>\nfates.<br/>\n<br/>\n~~~<br/>\n<br/>\nTen THOUSAND people died in an earthquake in Iran yesterday.  We&#39;re bitchin&#39; <br/>\nabout the dishes.<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Have to vs. choose to","postDate":"1072475303","msgId":86882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMjI2LjEzNDgyOC4xODQ2My42OTI1MDJAd2VibWFpbDI0Lm55Yy51bnRkLmNvbT4="},"prevInTopic":0,"nextInTopic":86890,"prevInTime":86881,"nextInTime":86883,"topicId":86882,"numMessagesInTopic":0,"msgSnippet":"Maybe dishes make other people joyful. Maybe that s why they think I should be joyful while doing dishes. Hmmm . . . maybe I am OK not being joyful every ","messageBody":"<div id=\"ygrps-yiv-1872517141\">&quot;Maybe dishes make other people joyful. Maybe that&#39;s why they think I should <br/>\nbe joyful while doing dishes. Hmmm . . . maybe I am OK not being joyful every <br/>\nminute. Maybe this isn&#39;t a problem for me. Maybe I don&#39;t need someone to tell <br/>\nme it&#39;s OK not to be ceaselessly joyful.&quot;<br/>\n<br/>\nI don&#39;t know anyone that is ceaselessly joyful! We all have our ups and downs, sure. But we can always choose to see the silver lining so to speak. Seeing the world with eyes of gratitude may be a more practical way to explain it.<br/>\nFor instance, washing dishes may not be my favorite activity, I can think of many things I prefer. But I can choose to grumble and feel bummed that I &quot;have to&quot; do this &quot;chore&quot; OR I can choose to be grateful to have hot running water, my loved ones alive and with me to use dishes, to have food to need dishes for etc...there is SO much to be grateful for in the simple act of washing dishes.<br/>\nAnytime I feel resentment building up I try to look at the activity or situation in the light of death. If the one I loved were gone, cleaning up after them or reminding them of something for the thousandth time might seem endearing, rather than irritating. I&#39;m quite sure I&#39;d miss lego parts strewn through the house if Jared was gone from my life.<br/>\n<br/>\nSeeing our life work, our choices through the eyes of gratitude change everything. When financial difficulties set in, I can be grateful for our health, for our togetherness and the true wealth we DO enjoy in this country. When I&#39;m sick, I can be grateful I have family to care for me and that I can recover from whatever is ailing me, unlike many folks suffering much worse fates.<br/>\n<br/>\nWe have the ability to choose gratefulness in any situation. For me, this has been life changing, though I still have a long ways to go! And I have tried very hard to take the words &quot;have to&quot; out of my vocabulary. Some of you may feel it&#39;s just semantics, but it&#39;s empowering to see everything I do as a choice.<br/>\nWhen I&#39;m getting ready for work I have caught myself saying &quot;I have to get to work now&quot; and stopped myself, saying &quot; I CHOOSE to go to work and I need to be there soon&quot;. Simple? Perhaps. But sometimes the simplest details lead to more mindful living. The richness of abundant living is in the details.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":86927,"nextTopicId":86914}}