{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: We&#39;re not really learning?? How to respond to that.","postDate":"1258836638","msgId":48755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4MzUyMS44NDIwOC5xbUB3ZWIxMTA0MTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhlN2Y3YytpYWZsQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlN2Y3YytpYWZsQGVHcm91cHMuY29tPg=="},"prevInTopic":48750,"nextInTopic":0,"prevInTime":48754,"nextInTime":48756,"topicId":48733,"numMessagesInTopic":0,"msgSnippet":"***However, there are just some days when friends beg to come over to play, and they really just want to play with all our stuff. I don t mind usually, but","messageBody":"<div id=\"ygrps-yiv-15127702\">***However, there are just some days when friends beg to come over to play, and they really just want to play with all our stuff. I don&#39;t mind usually, but sometimes I need help finding some healthy boundaries.***<br/>\n <br/>\nI&#39;ve told friends that come over, point blank, &quot;I thought you were here to play with____, and she seems to be in the other room playing something else.  Perhaps we should find something mutual to play with.&quot;<br/>\n <br/>\n ***My kids like their friends, but sometimes they want to play games my kids are burned out on or siblings (not my kids) fight over taking turns with game consoles or computers.***<br/>\n <br/>\nWe have a sibling pair across the street from us, younger boy and a girl Margaux&#39;s age.  Margaux made friends with the boy because he didn&#39;t make the kindergarten cut off date last year and was around.  She didn&#39;t like his sister though because she&#39;s mean and bossy.  When we&#39;d let them both over, they would fight constantly, but it was always the older sister that initiated it, so Margaux, being really wise to this, decided that the sister wasn&#39;t allowed over, and told the girl why.  Now she won&#39;t play with either one, because the little boy started doing the same kind of mean things.  That, and telling her that she was going to hell for saying curse words.  That just made her mad, so she tells him everytime he comes over and wants to play that she doesn&#39;t want to because he&#39;s mean and a liar.  I try to intercept the door as much as possible to spare him.  I honestly don&#39;t know why he keeps coming over to try to play.<br/>\n <br/>\n ***We had friends (kids) come over once to play and jumped right on our computers and my kids went to the basement to play the game console down there. I felt so frustrated and not sure how to react to any of that.***<br/>\n <br/>\nMy experience says that, that is a recipe for disaster.  If my kids aren&#39;t using the computers, then they are strictly off limits.  My kids know internet safety and how to best avoid viruses and such, and they need to be supervising their friends a little with the computers.  Other kids do not usually know internet safety or how to avoid viruses.  Not only that, other kids, and again, this is my experience, will use the time at our house to go to sites that they aren&#39;t allowed to go to at home.  We had one kid in particular that I wouldn&#39;t allow to use the computers at all, ever.   <br/>\n <br/>\nNow that Chamille brings older friends over, I don&#39;t sweat it so much, but when they were all pre-teen and just newly teen, that was our practice with the computers.  Chamille was totally for this because she didn&#39;t want her computer destroyed any more than we did.  Margaux had a friend that kept coming over and they would play kid games together, and as soon as I wasn&#39;t looking, the girl would start doing google searches of innappropriate things.  She was 8, then 9.  I had to sit and monitor her when they did computer games and if I couldn&#39;t, then she couldn&#39;t play them.<br/>\n<br/>\n***I know how I would react if I weren&#39;t such a kind, loving, and giving person. But I don&#39;t want to be taken advantage of either. How have you wise women found healthy boundaries?***<br/>\n <br/>\nIt&#39;s your house and your stuff that you pay for and upkeep.  If other kids use it and don&#39;t respect your stuff in the manner in which you expect, then don&#39;t let them use it.  If everyone is playing and getting along and using things appropriately, then let them.  If your kids aren&#39;t into playing on the computers or gaming consoles and want to do other things, then, I&#39;d insist the other kids do so too, or work out a rotating system of sorts where everyone gets to do a little bit of everything.  It&#39;s not a hard and fast rule here, it&#39;s a play it by ear sort of thing.  Chamille had a long time friend that would come over and be on the computer or play video games and hardly interact with Chamille at all, but they&#39;d be in the same room together, hanging out and showing each other things here and there.  It worked, but he was the exception.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223130287,"authorName":"Krisula Moyer","from":"Krisula Moyer &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: We&#39;re not really learning?? How to respond to that.","postDate":"1258810198","msgId":48750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMDdEODI0LTExRUEtNDZGOS05NkMzLTVEOEZDMzFGMTkwMEBnbWFpbC5jb20+"},"prevInTopic":48747,"nextInTopic":48755,"prevInTime":48749,"nextInTime":48751,"topicId":48733,"numMessagesInTopic":0,"msgSnippet":"... being she is willing to put up with their intermittent unpleasant treatment of her for the sake of the fun games that they do enjoy. Perhaps they have ","messageBody":"<div id=\"ygrps-yiv-1225960636\">Robyn said:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The other idea we have discussed is whether it&#39;s &quot;worth it&quot;. For the time <br/>\n </span></blockquote>being she is willing to put up with their intermittent unpleasant treatment <br/>\nof her for the sake of the fun games that they do enjoy. Perhaps they have <br/>\nsimilar feelings, that they are willing to put up with whatever her faults <br/>\nare for the sake of playing with her wii, or having enough people to play <br/>\nthe fantasy games they enjoy together.&lt;&lt;<br/>\n<br/>\nI really like this response.  It&#39;s nice to turn the unpleasant part of this relationship into a chance to learn about relationships and about oneself.  The focus on empathy and friendship puts it all into perspective. <br/>\n<br/>\nKrisula Moyer<br/>\nThe Seer, the novel <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":199576968,"authorName":"Heather","from":"&quot;Heather&quot; &lt;brownsplus2@...&gt;","profile":"brownsplus2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: We&#39;re not really learning?? How to respond to that.","postDate":"1258766380","msgId":48747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlN2Y3YytpYWZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJCMDFFMTE5QjJEODQ2ODlCMEJCQ0RGMkEyRjFEQUEyQFJvYnluUEM+"},"prevInTopic":48743,"nextInTopic":48750,"prevInTime":48746,"nextInTime":48748,"topicId":48733,"numMessagesInTopic":0,"msgSnippet":"... ______________________ It is funny you mentioned this b/c that is something I have been struggling with. I know it is worth it! However, there are just","messageBody":"<div id=\"ygrps-yiv-1258077253\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The other idea we have discussed is whether it&#39;s &quot;worth it&quot;. For the time being she is willing to put up with their intermittent unpleasant treatment of her for the sake of the fun games that they do enjoy. Perhaps they have similar feelings, that they are willing to put up with whatever her faults are for the sake of playing with her wii, or having  enough people to play the fantasy games they enjoy together.<br/>\n&gt; <br/>\n </span></blockquote>______________________ <br/>\n<br/>\nIt is funny you mentioned this b/c that is something I have been struggling with. I know it is worth it! However, there are just some days when friends beg to come over to play, and they really just want to play with all our stuff. I don&#39;t mind usually, but sometimes I need help finding some healthy boundaries. My kids like their friends, but sometimes they want to play games my kids are burned out on or siblings (not my kids) fight over taking turns with game consoles or computers. We had friends (kids) come over once to play and jumped right on our computers and my kids went to the basement to play the game console down there. I felt so frustrated and not sure how to react to any of that. <br/>\n<br/>\nI know how I would react if I weren&#39;t such a kind, loving, and giving person. But I don&#39;t want to be taken advantage of either. How have you wise women found healthy boundaries? Our home is fun and with very few restrictions so kids seem to be drawn here a lot. I love kids and my boys are mostly social, so we don&#39;t usually mind. Sometimes I just feel a little overwhelmed and surprised by all the kids in our life. But there are times I feel it is too much.<br/>\n<br/>\n~Heather Brown<br/>\nHolden and Camden&#39;s mom</div>","specialLinks":[]},{"userId":199576968,"authorName":"Heather","from":"&quot;Heather&quot; &lt;brownsplus2@...&gt;","profile":"brownsplus2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: We&#39;re not really learning?? How to respond to that.","postDate":"1258760319","msgId":48743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlNzk5dithaTI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBNTE2QUM5LUQ4RDctNEVCMy04M0YzLUU0MkFGRUNDRjlDREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48739,"nextInTopic":48747,"prevInTime":48742,"nextInTime":48744,"topicId":48733,"numMessagesInTopic":0,"msgSnippet":"Thanks so much for all the wonderful insights. I feel so much better now. I suppose some of the thoughts mentioned are the reasons I never worried before, and","messageBody":"<div id=\"ygrps-yiv-1592721900\">Thanks so much for all the wonderful insights. I feel so much better now. I suppose some of the thoughts mentioned are the reasons I never worried before, and I have gone over many of those same ideas with my sons in the past. Not sure why I was annoyed all the sudden more than usual. I believed it was b/c my oldest is almost 8 and I want to be sure he still feels alright with his schooled friends, and the remarks that are made now and again. I feel better knowing how others have handled it and that we can work things out. I do not want to make anyone feel badly. These are people we have known awhile and live very near us. So thank you for the positive ideas. We will keep plugging away and be careful not to rub anything in. That is one thing I feel may have triggered the remark. The schooled friend had a rough day, I am sure. He was not in his usual happy place yesterday. I think my oldest son realized that, and didn&#39;t take any offense at all. I truly believe kids come over sometimes to escape the negative of their world. It can be an honor, but also makes me really sad if I think about it too long. And I don&#39;t let it interfere with the times we truly need space.<br/>\n<br/>\nPeace to all and thanks again!<br/>\n<br/>\n~Heather Brown</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: We&#39;re not really learning?? How to respond to that.","postDate":"1258751687","msgId":48739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNTE2QUM5LUQ4RDctNEVCMy04M0YzLUU0MkFGRUNDRjlDREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhlNnZrcitzMTZpQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlNnZrcitzMTZpQGVHcm91cHMuY29tPg=="},"prevInTopic":48738,"nextInTopic":48743,"prevInTime":48738,"nextInTime":48740,"topicId":48733,"numMessagesInTopic":0,"msgSnippet":"-=- As soon as he found out that you can indeed learn without going to school he has been begging to be homeschooled.-=- And that is honestly a problem. There","messageBody":"<div id=\"ygrps-yiv-1237122736\">-=- As soon as he found out that you can indeed learn without going to  <br/>\nschool he has been begging to be homeschooled.-=-<br/>\n<br/>\nAnd that is honestly a problem.<br/>\n<br/>\nThere were families that didn&#39;t want my kids around because my kids&#39;  <br/>\nknowledge put the lie to the parental claims and assurances about  <br/>\nschool.<br/>\n<br/>\nIt&#39;s not cool for unschoolers to flaunt their freedom and show off  <br/>\ntheir easy, fun lives in front of schooling families.  It&#39;s way  <br/>\ntackier, I think, than for some poor schoolkid to say &quot;I don&#39;t think  <br/>\nyou&#39;ll be able to get a job when you grow up&quot; and for my kid to come  <br/>\nand talk to me about it later.<br/>\n<br/>\nUnschoolers DO learn.  Not at the same rate of speed, not on the same  <br/>\ncurve, sometimes ahead, sometimes behind, but without the shame or  <br/>\nglory the school kids get for ahead or behind.  It might be worth  <br/>\npointing out to your kids, on the side, when the other people aren&#39;t  <br/>\nanywhere around, that school repeats the same information for several  <br/>\nyears running, because not all the kids get it the first time, or the  <br/>\nsecond time, but with unschooling kids get it when they get it, and  <br/>\nthere doesn&#39;t need to be any repetition.<br/>\n<br/>\nHolly was used overtly as a bad example by a school-at-home family we  <br/>\nknow.  &quot;You don&#39;t want to be like Holly,&quot; the mom told the daughter.    <br/>\nThat was because Holly was ten and couldn&#39;t read.  Kristy was two  <br/>\nyears younger and couldn&#39;t read either.  But the mom wanted to press,  <br/>\nand so held Holly up as the boogey-man proof of what happens without  <br/>\nlessons.<br/>\n<br/>\nHolly was more amused than hurt, because even before she could read  <br/>\nshe could see manipulation in parents, and knew what shaming looked  <br/>\nlike.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: We&#39;re not really learning?? How to respond to that.","postDate":"1258750427","msgId":48738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlNnZrcitzMTZpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlNmtlNit1aGRwQGVHcm91cHMuY29tPg=="},"prevInTopic":48737,"nextInTopic":48739,"prevInTime":48737,"nextInTime":48739,"topicId":48733,"numMessagesInTopic":0,"msgSnippet":"... I dont know about your specific situation but in the past for us it isnt that the kids have been told that homeschooled kids are not learning.  It has been","messageBody":"<div id=\"ygrps-yiv-1807919884\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Heather&quot; &lt;brownsplus2@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Some schooled kids are told by their parents that homeschooled kids are not learning b/c they are not in school. I don&#39;t care what people tell their kids. However, when those kids (9 year-olds) come to my house and make those remarks to my kids when I am not in the room, I am offended. <br/>\n<br/>\n </span></blockquote>I dont know about your specific situation but in the past for us it isnt that the kids have been told that homeschooled kids are not learning.  It has been that they have been told that the reason they have to go to school is to learn and if they dont, how will they learn xyorz.<br/>\nOne little boy came up to a friend of ours and asked her, not meanly or anything, how she knows how to read since she doesnt go to school.  His parents had never said anything like that but they had told him when he asked why he had to go to schoool that it was so he could learn to read. So he assumed you dont learn to read unless you go to school.  As soon as he found out that you can indeed learn without going to school he has been begging to be homeschooled.</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] We&#39;re not really learning?? How to respond to that.","postDate":"1258749739","msgId":48737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCMDFFMTE5QjJEODQ2ODlCMEJCQ0RGMkEyRjFEQUEyQFJvYnluUEM+","inReplyToHeader":"PGhlNmtlNit1aGRwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlNmtlNit1aGRwQGVHcm91cHMuY29tPg=="},"prevInTopic":48736,"nextInTopic":48738,"prevInTime":48736,"nextInTime":48738,"topicId":48733,"numMessagesInTopic":0,"msgSnippet":"It s not just school kids - school-at-homers do that with unschoolers too. It has recently begun with our neighbor kids who persist in asking Jayn to read or","messageBody":"<div id=\"ygrps-yiv-2135509017\">It&#39;s not just school kids - school-at-homers do that with unschoolers too. <br/>\nIt has recently begun with our neighbor kids who persist in asking Jayn to <br/>\nread or spell words (out of context) of various lengths and saying things <br/>\nlike she&#39;s stupid because she can&#39;t read or spell all these odd words. Their <br/>\nmother has only recently started making them do spelling lists. They also <br/>\nmake rude comments about her penmanship. Their mother has introduced <br/>\npenmanship practice books, like I remember torturing me when I was a kid in <br/>\nBrisbane visiting my grandparents. (Everything wrong with that is a topic <br/>\nfor another post.)<br/>\n<br/>\nI have talked with Jayn about the things that she *can* do very well (like <br/>\ndraw and devise stories), the words she *can* read and understand, and also <br/>\nabout the concepts of jealousy - that Jayn is free to enjoy her day (and <br/>\nwatch what she likes and eat what she likes) without being forced to do <br/>\nthings like spelling lists, that she can continue to ask me to spell words <br/>\nfor her, when her friends are probably sent to the dictionary, that she can <br/>\nchoose what to read. I also talked to her about her vocabulary, how strong <br/>\nit is. I suggested that she could memorize the spelling of a couple of long <br/>\nwords that she already uses regularly and properly (like &quot;assiduous&quot;) and <br/>\nflip them back when they ask her how to spell something with which she is <br/>\nunfamiliar.<br/>\n<br/>\nIt bothers me because she is starting to be frustrated and it negatively <br/>\naffects her enjoyment. I have asked her if her other homeschooled friends, <br/>\nthe ones who actively seek her out and have chosen to be her friends for <br/>\nmore than just reasons of convenient proximity, treat her this way, and she <br/>\nsays, &quot;no&quot;.<br/>\n<br/>\nThe other idea we have discussed is whether it&#39;s &quot;worth it&quot;. For the time <br/>\nbeing she is willing to put up with their intermittent unpleasant treatment <br/>\nof her for the sake of the fun games that they do enjoy. Perhaps they have <br/>\nsimilar feelings, that they are willing to put up with whatever her faults <br/>\nare for the sake of playing with her wii, or having  enough people to play <br/>\nthe fantasy games they enjoy together.<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Heather&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brownsplus2@...\">brownsplus2@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Friday, November 20, 2009 9:42 AM<br/>\nSubject: [AlwaysLearning] We&#39;re not really learning?? How to respond to <br/>\nthat.<br/>\n<br/>\n<br/>\n&gt; Some schooled kids are told by their parents that homeschooled kids are <br/>\n&gt; not learning b/c they are not in school. I don&#39;t care what people tell <br/>\n&gt; their kids. However, when those kids (9 year-olds) come to my house and <br/>\n&gt; make those remarks to my kids when I am not in the room, I am offended. My <br/>\n&gt; kids are not bothered by it though. My kids are confident and secure, more <br/>\n&gt; so than I am---I suppose. I know I have heard this discussed before---but <br/>\n&gt; it was years ago. Can anyone please tell me if you blow it off yourself or <br/>\n&gt; do you address the issue somehow? The child who is saying these things has <br/>\n&gt; made comments in front of my husband as well and my husband was offended. <br/>\n&gt; I can&#39;t remember now what was said, but I thought we had addressed it <br/>\n&gt; already.<br/>\n&gt;<br/>\n&gt; Also wondering if it were really a non-issue would our almost 8 year old <br/>\n&gt; bring it up to us when his friend goes home? In the past these things did <br/>\n&gt; not bother me as much. Maybe I am taking things too personally?<br/>\n&gt;<br/>\n&gt; I am feeling as if some space would be a good idea from schooled kids now <br/>\n&gt; that my kids are getting older. We have homeschooled/unschooled friends, <br/>\n&gt; just not in our neighborhood.<br/>\n&gt;<br/>\n&gt; Thank you for any links to archives on this or personal thoughts.<br/>\n&gt;<br/>\n&gt; ~Heather Brown<br/>\n&gt; Mom to Holden (nearly 8) and Camden (5)<br/>\n&gt; Living in Iowa<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com<br/>\nVersion: 8.5.425 / Virus Database: 270.14.74/2515 - Release Date: 11/20/09 <br/>\n08:02:00 </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] We&#39;re not really learning?? How to respond to that.","postDate":"1258748932","msgId":48736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMDZGQzA0LjIwNTA2MDJAbWFjLmNvbT4=","inReplyToHeader":"PGhlNmtlNit1aGRwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlNmtlNit1aGRwQGVHcm91cHMuY29tPg=="},"prevInTopic":48733,"nextInTopic":48737,"prevInTime":48735,"nextInTime":48737,"topicId":48733,"numMessagesInTopic":0,"msgSnippet":"... Way way way way too personally. The other kids only know school and they only know that school is where they are supposed to learn. So they re just being","messageBody":"<div id=\"ygrps-yiv-2100410380\">On 11/20/2009 9:42 AM, Heather wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Also wondering if it were really a non-issue would our almost 8 year old bring it up to us when his friend goes home? In the past these things did not bother me as much. Maybe I am taking things too personally?<br/>\n&gt;<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Way way way way too personally. The other kids only know school and they <br/>\nonly know that school is where they are supposed to learn. So they&#39;re <br/>\njust being logical when they don&#39;t think your kids are learning. They&#39;re <br/>\nreally, for them, just stating the facts.<br/>\n<br/>\nWhen my kids brought these kinds of things to my attention, we all had a <br/>\nlittle giggle and talked about how these poor school kids just don&#39;t <br/>\nreally get it - how learning happens all the time, not just in a <br/>\nclassroom with a teacher. I&#39;d remind my kids to be kind and not rub it <br/>\nin that they are learning without schooling while their poor friend is <br/>\nstuck going to school.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":199576968,"authorName":"Heather","from":"&quot;Heather&quot; &lt;brownsplus2@...&gt;","profile":"brownsplus2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"We&#39;re not really learning?? How to respond to that.","postDate":"1258738950","msgId":48733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlNmtlNit1aGRwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48736,"prevInTime":48732,"nextInTime":48734,"topicId":48733,"numMessagesInTopic":0,"msgSnippet":"Some schooled kids are told by their parents that homeschooled kids are not learning b/c they are not in school. I don t care what people tell their kids.","messageBody":"<div id=\"ygrps-yiv-572106933\">Some schooled kids are told by their parents that homeschooled kids are not learning b/c they are not in school. I don&#39;t care what people tell their kids. However, when those kids (9 year-olds) come to my house and make those remarks to my kids when I am not in the room, I am offended. My kids are not bothered by it though. My kids are confident and secure, more so than I am---I suppose. I know I have heard this discussed before---but it was years ago. Can anyone please tell me if you blow it off yourself or do you address the issue somehow? The child who is saying these things has made comments in front of my husband as well and my husband was offended. I can&#39;t remember now what was said, but I thought we had addressed it already.<br/>\n<br/>\nAlso wondering if it were really a non-issue would our almost 8 year old bring it up to us when his friend goes home? In the past these things did not bother me as much. Maybe I am taking things too personally?<br/>\n<br/>\nI am feeling as if some space would be a good idea from schooled kids now that my kids are getting older. We have homeschooled/unschooled friends, just not in our neighborhood. <br/>\n<br/>\nThank you for any links to archives on this or personal thoughts. <br/>\n<br/>\n~Heather Brown<br/>\nMom to Holden (nearly 8) and Camden (5)<br/>\nLiving in Iowa</div>","specialLinks":[]}],"prevTopicId":48726,"nextTopicId":48749}}