{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":144808972,"authorName":"Kim J. Flowers","from":"&quot;Kim J. Flowers&quot; &lt;kim@...&gt;","profile":"kimjflowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Couple mommy questions....","postDate":"1135999834","msgId":110926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjMxMDIwMjQ5LjA5RjVFNEQyNEB0eWxlci5jcy50YW11LmVkdT4=","inReplyToHeader":"PDIwMDUxMjMwMDUwNDQwLjQyNTU1LnFtYWlsQHdlYjgxMTEwLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":110919,"nextInTopic":0,"prevInTime":110925,"nextInTime":110927,"topicId":110902,"numMessagesInTopic":0,"msgSnippet":"Well, he has been checked out by the doc.  Nothing physical that they found. BUT, I took the sling idea (sorta).  I carried him around in the backpack that we","messageBody":"<div id=\"ygrps-yiv-39716425\">Well, he has been checked out by the doc.  Nothing physical that they found.<br/>\nBUT, I took the sling idea (sorta).  I carried him around in the backpack<br/>\nthat we usually only use when we go hiking, well, it worked like a charm!  I<br/>\ncarried him around in it all day!  I got an amazing amount of work done<br/>\naround the house!  FANTASTIC IDEA!!!<br/>\n <br/>\n Kim Flowers - Wife to Nolan for 10 years <br/>\nStay at Home Mama of 4 wonderful boys<br/>\n&quot;I would rather have someone hate me for who I am than like me for who <br/>\nI am not&quot;.<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>] On Behalf Of NANCY OWENS<br/>\nSent: Thursday, December 29, 2005 11:05 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: [UnschoolingDiscussion] Couple mommy questions....<br/>\n<br/>\n<br/>\nGet your little guy a sling. You don&#39;t even have to go out an spend $$$ on<br/>\none. There are free patterns on-line. My sister has this great vintage sheet<br/>\n(twin sized, and the material used in sheets is perfect for slings) that she<br/>\nfolds and ties at her shoulder or wraps it around her waist and back to<br/>\nsling her youngest behind her like Asian women do. There is a book called<br/>\nBaby-Gami or something like that (maybe baby origami?) anyway it shows all<br/>\nsorts of unique ways to bundle babies of all ages and it has quite a nice<br/>\nsection on slings and how to make some great ones. I saw it the other day at<br/>\nthe library and flipped through it, keeping it in mind for this spring. If<br/>\nyou sling him, on your side or on your back he can always be with you and<br/>\nyou can still have the other boys with you, you can cook, clean, what ever<br/>\nneeds done at that moment. AND he gets in on allll the action. <br/>\n   <br/>\n  It&#39;s too bad you aren&#39;t nursing. I assume there were some sort of issues.<br/>\nI think doctors and dentists want toddlers off the bottle because the nipple<br/>\nisn&#39;t natural and it (can?) affects tooth development. (I know I have<br/>\npersonal beliefs that pop up when I see a child older than a year or so with<br/>\na bottle or pacifier, but those are mostly those nasty little voices of<br/>\nfriends and relatives that I have learned to ignore. Maybe if it is those<br/>\nvoices, your mom, mom-in-law, who ever that is in your head telling you to<br/>\nget him off, can you work hard on ignoring them?) That aside, let him have<br/>\nthat bottle for some more time. Both my kids nursed till around three. BUT<br/>\nJack still had a need for me, my warmth, softness, smell, something. When he<br/>\nwas hurt, tired, grumpy, he would climb on my lap, curl up against my<br/>\nbreast, and slip a hand inside or up my shirt and put his hand between my<br/>\nbreasts and kind of pet the top side, above my bra line. Used to drive Darin<br/>\ncrazy. &lt;g&gt; He was so ready<br/>\nfor those to be *ours* again! <br/>\n   <br/>\n  Darin got our Tinkerbell a little (very, omg, soft) stuffed monkey for<br/>\nChristmas. I&#39;m already sleeping with it in anticipation of her birth. That<br/>\nway if there are times I absolutely can&#39;t hold her, or someone else is, I<br/>\ncan wrap it up with her too. I did that for both the other kids. Moly loved<br/>\nher&#39;s, Jack must&#39;ve known there was no substitute for mom. &lt;g&gt;  If you don&#39;t<br/>\nalready, can you start sleeping with your little guy? Bring his favorite<br/>\nanimal or blanket to bed with you too. That way it starts smelling like you.<br/>\nI know this sounds like promoting a wookie or whatever, but if it works... <br/>\n   <br/>\n  As for the others *touching* his toys and him not liking that at all...<br/>\nAre they old enough for you to explain that, for the time being, they need<br/>\nto let the youngest be the youngest? Does that make sense? I have a boy and<br/>\ngirl, very close in age, so many toys are shared, but there are also (and<br/>\nmore so as they have gotten older) many more things that are just Moly&#39;s or<br/>\njust Jack&#39;s. Are your others old enough to understand that concept? Its<br/>\nhard, I know, but not as hard as being attacked by a one year old, who<br/>\ndoesn&#39;t have the capacity to understand sharing. And you really can&#39;t expect<br/>\nhim to. <br/>\n   <br/>\n  Good luck!<br/>\n  ~Nancy<br/>\n   <br/>\n  <br/>\n&quot;Kim J. Flowers&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kim@...\">kim@...</a>&gt; wrote:<br/>\n  These are things that I haven&#39;t experienced with such extremity before<br/>\nwith<br/>\nmy other kids.....<br/>\n<br/>\nFor the last few weeks, Conner (12 months old) has been so incredibly clingy<br/>\nthat if I am not holding him or sitting on the floor with him he screams. <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nVisit the Unschooling website and message boards:<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt; <br/>\n<br/>\n<br/>\n<br/>\n  _____  <br/>\n<br/>\nYAHOO! GROUPS LINKS <br/>\n<br/>\n<br/>\n\t<br/>\n*\t Visit your group &quot;UnschoolingDiscussion<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion\">http://groups.yahoo.com/group/UnschoolingDiscussion</a>&gt; &quot; on the web.<br/>\n  <br/>\n<br/>\n*\t To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a>?subject=Unsubscrib<br/>\ne&gt; <br/>\n  <br/>\n<br/>\n*\t Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt; . <br/>\n<br/>\n<br/>\n  _____  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240085865,"authorName":"NANCY OWENS","from":"NANCY OWENS &lt;nancy-owens@...&gt;","profile":"nancyeddsowens","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] late bottle users was Couple mommy questions....","postDate":"1135967488","msgId":110919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjMwMTgzMTI4LjQ3NDU3LnFtYWlsQHdlYjgxMTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEIzNEExQjI4LTA3NzQtNEFFRi1CQTlFLUY4RDBEMkI0MTlBMEBkaWVyYXVlci5uZXQ+"},"prevInTopic":110914,"nextInTopic":110926,"prevInTime":110918,"nextInTime":110920,"topicId":110902,"numMessagesInTopic":0,"msgSnippet":"Su Penn  wrote:     ****I m just tossing that out there. Nancy said she has a personal reaction to older kids with pacifiers and bottles;","messageBody":"<div id=\"ygrps-yiv-61198740\">Su Penn &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:supenn@...\">supenn@...</a>&gt; wrote:     ****I&#39;m just tossing that out there. Nancy said she has a personal  <br/>\nreaction to older kids with pacifiers and bottles; since I have had a  <br/>\npersonal investment in this question, I&#39;ve done a little research and  <br/>\nthought I&#39;d share it.<br/>\n<br/>\nSu (who can remember getting uncomfortable when kids who were old  <br/>\nenough to talk were still nursing...how we change! And who still  <br/>\nhates to see kids carrying bottles of juice around the grocery  <br/>\nstore :-/ )*****<br/>\n  Well, I did write that my reaction was all about those nasty voices we were discussing on another thread. &lt;g&gt; Just one more thing to work on. And I tell myself, when I catch myself thinking bad things (when I see an older child with a bottle or pacifier), that these kids moms are the same moms who used to look badly at me when they saw me nursing my three year olds! (or worse when I was tandem nursing a newborn and a two year old) Now I say to myself, &#39;Why get upset? This isn&#39;t your concern, these kids are meeting their needs just like your kids met theirs.&#39; And I ask myself where the negative thoughts come from. My mom, grandma, aunts, friends, MIL... the list is endless. All of these same women chastised me for nursing so long. But in the beginning it was all, &#39;oh wonderful, your doing whats best for the baby...&#39; My sister will wink and nudge me as she asks if I&#39;m going to be a lactivist or a breast-nazi with this new one. So really, it doesn&#39;t matter, are the kids happy? Are<br/>\n they getting their suck needs met? Does it matter how? You are going to get looks if you nurse much past a year, or if your child has a bottle, pacifier, or thumb in his mouth past two. Its all about social acceptance. You already buck the norm by homeschooling, you&#39;ve really rocked the boat by unschooling, let your little guy have his bottle till he&#39;s ready to give it up. Put all those nifty four and six dollar cups up until he asks for them. With three older brothers he&#39;ll want a cup soon enough. Then you&#39;ll start missing those baby days. &lt;g&gt;   ~Nancy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252551372,"authorName":"Su Penn","from":"Su Penn &lt;supenn@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] late bottle users was Couple mommy questions....","postDate":"1135955845","msgId":110914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzNEExQjI4LTA3NzQtNEFFRi1CQTlFLUY4RDBEMkI0MTlBMEBkaWVyYXVlci5uZXQ+","inReplyToHeader":"PDIwMDUxMjMwMDUwNDQwLjQyNTU1LnFtYWlsQHdlYjgxMTEwLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDUxMjMwMDUwNDQwLjQyNTU1LnFtYWlsQHdlYjgxMTEwLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":110911,"nextInTopic":110919,"prevInTime":110913,"nextInTime":110915,"topicId":110902,"numMessagesInTopic":0,"msgSnippet":"I have a 4 1/2 year old who never nursed (broke my heart). He still takes a bottle, which we like because it keeps him so well hydrated. Last summer, when my","messageBody":"<div id=\"ygrps-yiv-660454458\">I have a 4 1/2 year old who never nursed (broke my heart). He still  <br/>\ntakes a bottle, which we like because it keeps him so well hydrated.  <br/>\nLast summer, when my friends were all worrying about their kids  <br/>\ndrinking enough, I knew Eric was drinking enough because he was  <br/>\nhaving 3-4 8 oz bottles of mixed (soy or dairy) milk and water every  <br/>\nday as well as whatever other drinks he wanted. It helped me relax  <br/>\nabout him having it when a friend who is a pediatrician said to me,  <br/>\n&quot;Su, why worry about it? It&#39;s just another way of having a drink!&quot;  <br/>\nShe also seconded the idea that kids have a strong need to suck until  <br/>\nthey&#39;re 6 or even older.<br/>\n<br/>\nEric is also a thumb-sucker, and he has performed auto-orthodontia to  <br/>\nthe extent that he has a perfect little thumb-sized gap between his  <br/>\nupper two left teeth. I was getting a lot of pressure from my dentist  <br/>\nto &quot;make him stop&quot; (as if I could!), so I did a lot of research, and  <br/>\nfound that even though your dentist might tell you bottles, thumb- <br/>\nsucking, pacifiers etc. can damage teeth (or even damage the bones of  <br/>\nthe face), the research doesn&#39;t back that up. One article I found  <br/>\nthat reviewed the literature from dental journals found that even  <br/>\nthough kids can move their teeth with these things, any problems  <br/>\nusually self-correct if the kids stop by the time they&#39;re 6 or 7, and  <br/>\nthat even if the kids don&#39;t, it doesn&#39;t create any additional need  <br/>\nfor orthodontia beyond what they would have needed anyway. A big  <br/>\nrelief to me. I&#39;d be glad to hunt up a reference if anyone wants it  <br/>\nbut I&#39;m already making the whole family late so I won&#39;t do it right now.<br/>\n<br/>\nI&#39;m just tossing that out there. Nancy said she has a personal  <br/>\nreaction to older kids with pacifiers and bottles; since I have had a  <br/>\npersonal investment in this question, I&#39;ve done a little research and  <br/>\nthought I&#39;d share it.<br/>\n<br/>\nSu (who can remember getting uncomfortable when kids who were old  <br/>\nenough to talk were still nursing...how we change! And who still  <br/>\nhates to see kids carrying bottles of juice around the grocery  <br/>\nstore :-/ )<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 30, 2005, at 12:04 AM, NANCY OWENS wrote:<br/>\n&gt;   It&#39;s too bad you aren&#39;t nursing. I assume there were some sort of  <br/>\n&gt; issues. I think doctors and dentists want toddlers off the bottle  <br/>\n&gt; because the nipple isn&#39;t natural and it (can?) affects tooth  <br/>\n&gt; development. (I know I have personal beliefs that pop up when I see  <br/>\n&gt; a child older than a year or so with a bottle or pacifier, but  <br/>\n&gt; those are mostly those nasty little voices of friends and relatives  <br/>\n&gt; that I have learned to ignore. Maybe if it is those voices, your  <br/>\n&gt; mom, mom-in-law, who ever that is in your head telling you to get  <br/>\n&gt; him off, can you work hard on ignoring them?) That aside, let him  <br/>\n&gt; have that bottle for some more time. </span></blockquote></div>","specialLinks":[]},{"userId":240085865,"authorName":"NANCY OWENS","from":"NANCY OWENS &lt;nancy-owens@...&gt;","profile":"nancyeddsowens","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Couple mommy questions....","postDate":"1135919080","msgId":110911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjMwMDUwNDQwLjQyNTU1LnFtYWlsQHdlYjgxMTEwLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDIwMDUxMjI5MjEyMDEwLjhBMzI0NEQyNEB0eWxlci5jcy50YW11LmVkdT4="},"prevInTopic":110908,"nextInTopic":110914,"prevInTime":110910,"nextInTime":110912,"topicId":110902,"numMessagesInTopic":0,"msgSnippet":"Get your little guy a sling. You don t even have to go out an spend $$$ on one. There are free patterns on-line. My sister has this great vintage sheet (twin","messageBody":"<div id=\"ygrps-yiv-538278185\">Get your little guy a sling. You don&#39;t even have to go out an spend $$$ on one. There are free patterns on-line. My sister has this great vintage sheet (twin sized, and the material used in sheets is perfect for slings) that she folds and ties at her shoulder or wraps it around her waist and back to sling her youngest behind her like Asian women do. There is a book called Baby-Gami or something like that (maybe baby origami?) anyway it shows all sorts of unique ways to bundle babies of all ages and it has quite a nice section on slings and how to make some great ones. I saw it the other day at the library and flipped through it, keeping it in mind for this spring. If you sling him, on your side or on your back he can always be with you and you can still have the other boys with you, you can cook, clean, what ever needs done at that moment. AND he gets in on allll the action. <br/>\n   <br/>\n  It&#39;s too bad you aren&#39;t nursing. I assume there were some sort of issues. I think doctors and dentists want toddlers off the bottle because the nipple isn&#39;t natural and it (can?) affects tooth development. (I know I have personal beliefs that pop up when I see a child older than a year or so with a bottle or pacifier, but those are mostly those nasty little voices of friends and relatives that I have learned to ignore. Maybe if it is those voices, your mom, mom-in-law, who ever that is in your head telling you to get him off, can you work hard on ignoring them?) That aside, let him have that bottle for some more time. Both my kids nursed till around three. BUT Jack still had a need for me, my warmth, softness, smell, something. When he was hurt, tired, grumpy, he would climb on my lap, curl up against my breast, and slip a hand inside or up my shirt and put his hand between my breasts and kind of pet the top side, above my bra line. Used to drive Darin crazy. &lt;g&gt; He was so ready<br/>\n for those to be *ours* again! <br/>\n   <br/>\n  Darin got our Tinkerbell a little (very, omg, soft) stuffed monkey for Christmas. I&#39;m already sleeping with it in anticipation of her birth. That way if there are times I absolutely can&#39;t hold her, or someone else is, I can wrap it up with her too. I did that for both the other kids. Moly loved her&#39;s, Jack must&#39;ve known there was no substitute for mom. &lt;g&gt;  If you don&#39;t already, can you start sleeping with your little guy? Bring his favorite animal or blanket to bed with you too. That way it starts smelling like you. I know this sounds like promoting a wookie or whatever, but if it works... <br/>\n   <br/>\n  As for the others *touching* his toys and him not liking that at all... Are they old enough for you to explain that, for the time being, they need to let the youngest be the youngest? Does that make sense? I have a boy and girl, very close in age, so many toys are shared, but there are also (and more so as they have gotten older) many more things that are just Moly&#39;s or just Jack&#39;s. Are your others old enough to understand that concept? Its hard, I know, but not as hard as being attacked by a one year old, who doesn&#39;t have the capacity to understand sharing. And you really can&#39;t expect him to. <br/>\n   <br/>\n  Good luck!<br/>\n  ~Nancy<br/>\n   <br/>\n  <br/>\n&quot;Kim J. Flowers&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kim@...\">kim@...</a>&gt; wrote:<br/>\n  These are things that I haven&#39;t experienced with such extremity before with<br/>\nmy other kids.....<br/>\n<br/>\nFor the last few weeks, Conner (12 months old) has been so incredibly clingy<br/>\nthat if I am not holding him or sitting on the floor with him he screams. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Couple mommy questions....","postDate":"1135908902","msgId":110908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjMwMDIxNTAyLjQyNzczLnFtYWlsQHdlYjUzODA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDg3MkFBQTY4LUIyMDMtNDY1Qi05Q0VDLTc0ODIwQTYzMEI0MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":110906,"nextInTopic":110911,"prevInTime":110907,"nextInTime":110909,"topicId":110902,"numMessagesInTopic":0,"msgSnippet":"First I want to say that this discussion probably should be dealt with lightly and we should go on to more directly unschooling-related things.  This question","messageBody":"<div id=\"ygrps-yiv-1366098069\">First I want to say that this discussion probably should be dealt with lightly and we should go on to more directly unschooling-related things.  This question might be better for a list about very young children.  Maybe a La Leche League list would be better.<br/>\n   <br/>\n  ****<br/>\n   <br/>\n  I had wondered about this, but forgot which list it was.  It would be a good topic for the Always Unschooled list at  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysUnschooled/\">http://groups.yahoo.com/group/AlwaysUnschooled/</a> .  Not so much LaLeche League as it&#39;s not really about nursing, tho I guess it could fit in the gentle parenting themes.  <br/>\n   <br/>\n  Sylvia<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nMom to Will (20) Andy (9) and Dan (4.5) <br/>\n <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! for Good - Make a difference this year. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Couple mommy questions....","postDate":"1135908075","msgId":110906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3MkFBQTY4LUIyMDMtNDY1Qi05Q0VDLTc0ODIwQTYzMEI0MUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDUxMjI5MjEyMDEwLjhBMzI0NEQyNEB0eWxlci5jcy50YW11LmVkdT4=","referencesHeader":"PDIwMDUxMjI5MjEyMDEwLjhBMzI0NEQyNEB0eWxlci5jcy50YW11LmVkdT4="},"prevInTopic":110905,"nextInTopic":110908,"prevInTime":110905,"nextInTime":110907,"topicId":110902,"numMessagesInTopic":0,"msgSnippet":"First I want to say that this discussion probably should be dealt with lightly and we should go on to more directly unschooling-related things.  This question","messageBody":"<div id=\"ygrps-yiv-1047742538\">First I want to say that this discussion probably should be dealt  <br/>\nwith lightly and we should go on to more directly unschooling-related  <br/>\nthings.  This question might be better for a list about very young  <br/>\nchildren.  Maybe a La Leche League list would be better.<br/>\n<br/>\n<br/>\n-=-I know he isn&#39;t sick or not feeling well.-=-<br/>\n<br/>\nYou don&#39;t *KNOW* that, so maybe the strongest you should&#39;ve said was  <br/>\n&quot;I don&#39;t think&quot; or &quot;I don&#39;t see symptoms that...&quot;<br/>\n<br/>\nMy nephew seemed VERY unhappy for a long while when he was a year  <br/>\nold, and couldn&#39;t seem to get comfortable, and car seats made him  <br/>\nscream worse than anything, and after they tested everything they  <br/>\ncould think of, it turned out one of his testicles was growing in a  <br/>\nweird kind of spirally way and it just hurt all the time.   For that  <br/>\nhe had no fever, no snot, no listlessness.  There were no symptoms of  <br/>\nnot feeling well.<br/>\n<br/>\nI&#39;m not suggesting your son has a testicular condition, I&#39;m saying  <br/>\nyou shouldn&#39;t be so sure that you *know* he&#39;s feeling fine.<br/>\n<br/>\n-=-Conner will NOT use a sippy cup, straw cup or anything else. We  <br/>\nhave tried<br/>\nseveral different brands. I don&#39;t want to take his bottle away, but I  <br/>\nwould<br/>\nlike him to use a cup during awake times. Suggestions? I do  <br/>\neventually want<br/>\nto wean him off his bottle-=-<br/>\n<br/>\nOH...You&#39;re not nursing him?<br/>\nBummer.  That itself could be helpful.<br/>\n<br/>\nIt&#39;s not worth &quot;weaning&quot; him off a bottle especially if he&#39;s needy  <br/>\nright now.  What&#39;s the point?  Are you in a competition with some  <br/>\nother family to get your kid &quot;weaned&quot;?  Let him have the friggin&#39;  <br/>\nbottle.<br/>\n<br/>\n-=-but I have to get him to take a cup first! He<br/>\nsimply won&#39;t do it and I don&#39;t want to force him or anything.  I  <br/>\nguess I was<br/>\njust hoping he would want to use a cup.-=-<br/>\n<br/>\nYou&#39;re not just hoping, though.  You&#39;re pressuring him with several  <br/>\ndifferent brands.<br/>\n<br/>\nMaybe he feels like you&#39;re trying to keep him from being the baby (or  <br/>\na baby) and that&#39;s why he&#39;s exerting his babyness.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Couple mommy questions....","postDate":"1135907222","msgId":110905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjMwMDE0NzAzLjUwMTcwLnFtYWlsQHdlYjUzODEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDUxMjI5MjEyMDEwLjhBMzI0NEQyNEB0eWxlci5jcy50YW11LmVkdT4="},"prevInTopic":110902,"nextInTopic":110906,"prevInTime":110904,"nextInTime":110906,"topicId":110902,"numMessagesInTopic":0,"msgSnippet":"Also, I have never experienced this either with any of the other boys.  Conner will NOT use a sippy cup, straw cup or anything else. We have tried several","messageBody":"<div id=\"ygrps-yiv-1907895505\">Also, I have never experienced this either with any of the other boys.  Conner will NOT use a sippy cup, straw cup or anything else. We have tried several different brands. I don&#39;t want to take his bottle away, but I would like him to use a cup during awake times. Suggestions? I do eventually want to wean him off his bottle, but I have to get him to take a cup first! He simply won&#39;t do it and I don&#39;t want to force him or anything.  I guess I was just hoping he would want to use a cup.<br/>\n   <br/>\n  *****<br/>\n   <br/>\n  If the bottle is what makes him happy, let him have it.  I have three boys who nursed for varying lengths of time -- the oldest two weaned before 1 year, and both took a bottle well past one year.  The oldest was a few months past 2, the second was a few months past 3 when we gave up bottles.  The youngest is almost 5 and has promised he will wean on his birthday next month. None used a cup by 12 mos, or even 24 mos reliably.  <br/>\n   <br/>\n  I don&#39;t understand the big rush parents (more likely doctors) seem to have to get a child off the bottle by 12 mos.  Figuring that current life expectancy is 85 yrs, then nursing, or using a bottle -- or whatever meets the sucking need (a valid physical and emotional need, btw) for even 4 years is a tiny portion of his whole life.  It&#39;s not like a child who isn&#39;t using a cup at 12 mos will still be using a bottle & nipple at 7 or 8 (tho some do still thumb-suck at those ages).  <br/>\n   <br/>\n  Sylvia<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nMom to Will (20) Andy (9) and Dan (4.5) <br/>\n <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\n Yahoo! DSL Something to write home about. Just $16.99/mo. or less<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":144808972,"authorName":"Kim J. Flowers","from":"&quot;Kim J. Flowers&quot; &lt;kim@...&gt;","profile":"kimjflowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Couple mommy questions....","postDate":"1135896480","msgId":110902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjI5MjEyMDEwLjhBMzI0NEQyNEB0eWxlci5jcy50YW11LmVkdT4="},"prevInTopic":0,"nextInTopic":110905,"prevInTime":110901,"nextInTime":110903,"topicId":110902,"numMessagesInTopic":0,"msgSnippet":"These are things that I haven t experienced with such extremity before with my other kids..... For the last few weeks, Conner (12 months old) has been so","messageBody":"<div id=\"ygrps-yiv-1039331322\">These are things that I haven&#39;t experienced with such extremity before with<br/>\nmy other kids.....<br/>\n <br/>\nFor the last few weeks, Conner (12 months old) has been so incredibly clingy<br/>\nthat if I am not holding him or sitting on the floor with him he screams. I<br/>\ncan&#39;t get anything done. Also, if one of the other boys sits in my lap he<br/>\nscreams and tears and pulls their hair and skin until they get up. I cannot<br/>\neven read a book sitting by him or he will scream and climb on me until I<br/>\nput it down.  Even if one of the other boys touches one of his toys he<br/>\nscreams bloody murder until they stop touching it.  Right now as I am typing<br/>\nwith one finger, he is screaming at me. Any suggestions or ideas as to how<br/>\nlong this lasts or anything??  I know he isn&#39;t sick or not feeling well.  He<br/>\nis  a completely different baby when he is sick or teething.  I mean this is<br/>\nso incredibly extreme.  The other boys went through clingy stages, but not<br/>\nlike this.  I have even tried having him help me when I need to do<br/>\nsomething, but he won&#39;t.  If my complete attention is not on him, he screams<br/>\nat me.  I have no idea what is going on.  We have never just left him to<br/>\ncry, or ignored his needs or anything like that.  But he is acting like if<br/>\nhe doesn&#39;t scream, his needs won&#39;t get met which has never been the case.<br/>\n <br/>\nAlso, I have never experienced this either with any of the other boys.<br/>\nConner will NOT use a sippy cup, straw cup or anything else. We have tried<br/>\nseveral different brands. I don&#39;t want to take his bottle away, but I would<br/>\nlike him to use a cup during awake times. Suggestions? I do eventually want<br/>\nto wean him off his bottle, but I have to get him to take a cup first! He<br/>\nsimply won&#39;t do it and I don&#39;t want to force him or anything.  I guess I was<br/>\njust hoping he would want to use a cup.<br/>\n <br/>\nHe also still doesn&#39;t sleep through the night.  Only one of my other kids<br/>\n(who didn&#39;t sleep for longer than 2 hours until the age of 3) went through<br/>\nthis.  I am not so much worried about this part, but any suggestions would<br/>\nbe helpful.  He still eats at night too.<br/>\n <br/>\nThanks for any help or suggestions with my littlest guy!<br/>\n<br/>\n <br/>\n Kim Flowers - Wife to Nolan for 10 years <br/>\nStay at Home Mama of 4 wonderful boys<br/>\n&quot;I would rather have someone hate me for who I am than like me for who <br/>\nI am not&quot;.<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":110871,"nextTopicId":110903}}