{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":65837075,"authorName":"Dave and Shannon","from":"&quot;Dave and Shannon&quot; &lt;davenshan@...&gt;","profile":"shan_who","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Serious Play","postDate":"1053619205","msgId":70357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhFRUVKSFBHQ0tQRkdQTUVMTk9ESUVGRERDQUEuZGF2ZW5zaGFuQG1pbmRzcHJpbmcuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":70356,"nextInTime":70358,"topicId":70357,"numMessagesInTopic":0,"msgSnippet":"I just read someone s post about their child doing a lot of fantasy play and was wondering if anyone else s child was like this.  then I was reading the ","messageBody":"<div id=\"ygrps-yiv-1800666460\">I just read someone&#39;s post about their child doing a lot of fantasy play and<br/>\nwas wondering if anyone else&#39;s child was like this.  then I was reading the<br/>\nUnschooling.com online news mag and found this.  so I thought I&#39;d share.<br/>\nSerious Play<br/>\nFor a healthy and active fantasy life children need time, space, and<br/>\npri-vacy, or at least only as much companionship as they choose. Obviously<br/>\nschool, or any other large-group situation --- day care center, nursery<br/>\nschool, play group, etc. --- does not allow much of this. Perhaps worst of<br/>\nall, they are usually under the eye and control of adults who, even if they<br/>\nwill allow children a fantasy life, feel they have to watch it, under-stand<br/>\nwhat it means, judge it, make use of it. It was for just this reason that a<br/>\nwell-meaning and quite highly praised book, written about ten years ago,<br/>\ncalled Fantasy and Feeling in Childhood, seemed and still seems to me deeply<br/>\nmistaken. The gist of it (and there may well be many books like it) was that<br/>\nif we, i.e., people who work in schools, paid enough attention to the<br/>\nfantasy lives of children, we could learn to understand them and bend them<br/>\nto our own purposes.<br/>\nThis would be a great mistake and a great wrong. Instead, we should be<br/>\ncontent to watch and enjoy as much of children&#39;s fantasy lives as they will<br/>\nlet us see, and to take part in them, if the children ask us to and if we<br/>\ncan do so happily and unselfconsciously. Otherwise, we should leave them<br/>\nalone. Children&#39;s fantasy is useful and important to them for many rea-sons,<br/>\nbut above all because it is theirs, the one part of their lives which is<br/>\nwholly under their control. We must resist the temptation to make it ours.<br/>\nWe must also resist the equally great temptation to think that this part of<br/>\nchildren&#39;s lives is less important than the parts where they are doing<br/>\nsomething &quot;serious&quot; --- reading, or writing, or doing schoolwork, or<br/>\nsome-thing that we want them to do --- or to think that we can only allow<br/>\nthem time for fantasy after all the important work is done, as we might give<br/>\nthem a piece of candy after a meal. For children, play and fantasy are one<br/>\nof the main courses of the meal. Children should be able to do them, not<br/>\njust in what little tag ends of time remain after all the &quot;important&quot; work<br/>\nis done, but when they are most full of energy and enthusiasm. We talk these<br/>\ndays of &quot;quality time.&quot; Children need quality time for their fantasy and<br/>\nplay as much as for their reading or math. They need to play well as much as<br/>\nthey need to read well. Indeed, we would probably find if we looked into it<br/>\nthat children who are not good at playing, dreaming, fan-tasizing, are<br/>\nusually not much good at reading either.<br/>\n<br/>\n<br/>\nShannon Buckley<br/>\nMom to Connor 3-15-97, Carsten born at home 4-27-99/5-19-00 and Quinn born<br/>\nat home 8-08-02 <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":65613,"nextTopicId":70315}}