{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":8378727,"authorName":"zenmomma *","from":"&quot;zenmomma *&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re: special needs children...","postDate":"1045085239","msgId":58556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEtRjIwMUREQ2U1bXBIbm8wMDAwODRjYUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":58555,"nextInTime":58557,"topicId":58556,"numMessagesInTopic":0,"msgSnippet":"... Take a few deep cleansing breaths and try to experience only this moment. Try to focus your energy on calming yourself and letting the answer to this ","messageBody":"<div id=\"ygrps-yiv-751172370\"><blockquote><span title=\"ireply\">&gt;&gt;OK. . now what? &gt;&gt;<br/>\n<br/>\n </span></blockquote>::BREATHE::<br/>\n<br/>\nTake a few deep cleansing breaths and try to experience only this moment. <br/>\nTry to focus your energy on calming yourself and letting the answer to this <br/>\nproblem present itself to you. I have just had an especially challenging <br/>\ncouple of weeks with my dd, and so I understand how difficult is is to let <br/>\ngo of the emotion and frustration surrounding what&#39;s going on. But it can be <br/>\ndone and once you do, your mind will open up to a different way, a different <br/>\npath to take.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I really think that it&#39;s helpful for folks to talk about thier real life <br/>\n&gt;&gt;challanges and to see that they are NOT alone in facing them. &gt;&gt;<br/>\n<br/>\n </span></blockquote>You are definitely NOT alone. :o)  We all have our moments and so do our <br/>\nkids. Moments pass. Remember that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My 11 yo is ADHD, and he probably has several other &quot; disablities&quot; that <br/>\n&gt;&gt;have never been diagnosed officially. I know he has a lot of traits of <br/>\n&gt;&gt;central processing deficits. He can be very aggressive.. emotionally <br/>\n&gt;&gt;distraught, mood swings, depressed, introverted, low self esteem.&gt;&gt;<br/>\n<br/>\n </span></blockquote>He probably also has some really wonderful, endearing, and creative <br/>\nqualities too though, right? I try not to be a label junkie, but I do accept <br/>\nthat it&#39;s sometimes helpful as a shorthand description of what a family is <br/>\ndealing with. I like to be mindful though to always keep my kids&#39; wonderful, <br/>\ntrue selves as my conscious and subconscious picture of them. Their <br/>\nchallenges are just that, challenges. They do not tell anything about Who <br/>\nThey Are.<br/>\n<br/>\nIs there any history of clinical depression in your family BTW? We have <br/>\nstrong family history and my son got hit with it badly at about age 11. This <br/>\njust might be something to consider along with everything else.<br/>\n<br/>\nAs far as the video games and tantrums go, I think I would try talking to <br/>\nhim when he&#39;s not playing or frustrated. (If he&#39;ll talk that is.) It&#39;s <br/>\neasier to get to the bottom of a frustration when they&#39;re not right in the <br/>\nmiddle of it. You may have tried this, but it never hurts to try again. Or <br/>\ntry talking about frustration in general. Talk about how it&#39;s okay to get <br/>\nfrustrated. It&#39;s okay to want to yell or hit something. But it&#39;s not okay to <br/>\n  to hurt each other or break things that belong to the family. Maybe give <br/>\nhim a punching bag or trampoline to work out some of those urges. Don&#39;t try <br/>\nto stop them, channel them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;There were a total of 5 controllers for N64.. Now, we&#39;re down to 1.. <br/>\n&gt;&gt;Either Ethan or JP broke all of them.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Personally, I wouldn&#39;t keep replacing them forever. He has no incentive then <br/>\nto try a different method of displaying his anger. And anyway, it&#39;s just too <br/>\nexpensive. I&#39;m honest with my kids about how much we make and have and how <br/>\nmuch we can spend on things. If the money&#39;s not there, it&#39;s not there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;They scream, cry, cuss, throw things. Hit each other, basically throw <br/>\n&gt;&gt;INTENSE temper tantrums.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Well, tantrums happen. Some people are hard wired to naturally calm <br/>\nthemselves and deal with frustration. Others have to work at it. Venting, to <br/>\nme, is okay. Hitting, breaking things or hurting each other is not.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I have to MAKE.. yes.. MAKE, physically pick up or manuever them to go out <br/>\n&gt;&gt;with me. Its not a good idea to leave a 7 and 11 yo at home alone and its <br/>\n&gt;&gt;not fair for the Anna and I to stay home all the time.&gt;&gt;<br/>\n<br/>\n </span></blockquote>I understand. Do they generally have trouble with transitions? Casey (my 9yo <br/>\ndd) has a LOT of trouble transitioning to anything. Even things she loves. I <br/>\nneed to make sure to give her lots of warning ahead of time and many gentle <br/>\nreminders of what&#39;s coming. I&#39;ll bring her her food if she needs to eat <br/>\nbefore we go and help her with her socks if she needs me to. My announcement <br/>\nof &quot;It&#39;s time to go&quot; is usually way ahead of the last minute. I give her <br/>\ntime to get used to the idea. When it&#39;s not an option to stay home doing <br/>\nwhat she&#39;s doing (if Conor needs to be somewhere) then it&#39;s not an option <br/>\nand she has to go. She does know, however, that I always try to arrange it <br/>\nso that there is an option for her not to go out if she doesn&#39;t want to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;WHAT THE HELL IS FUN ABOUT THAT??? Or.. what is being &quot;learned&quot;?? Its <br/>\n&gt;&gt;nothing but a terriblly exhaustive stress on me and them and thier sibs. <br/>\n&gt;&gt; &gt;&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s all such a puzzle isn&#39;t it? There&#39;s obviously something compelling that <br/>\nkeeps drawing them back to this situation. Maybe some talking in their <br/>\ndowntime, maybe right before bed, will give you some insight into what they <br/>\ngetting from all this.<br/>\n<br/>\n&lt;&lt;I came in.. and asked what was wrong.. He screamed. &quot;IM NOT TELLING YOU&quot; <br/>\nOk.. well, how can I help if I dont know what is wrong.. ?!?!?! &gt;&gt;<br/>\n<br/>\nOh this is so frustrating, isn&#39;t it?! Casey has a hard time telling me <br/>\nwhat&#39;s wrong too. It&#39;s like she just can&#39;t let go of it. I really don&#39;t know <br/>\nwhy she shuts down like this, I just know that she does. So I try to work <br/>\nwith what I do know and what will seem to calm the situation a bit. As <br/>\nparents, we just have to work with what is, and not spend our energies <br/>\nworrying about what isn&#39;t. Try saying...My child is upset and frustrated and <br/>\nout of control. I need to help him calm himself. I need to protect my other <br/>\nchildren so he doesn&#39;t lash out at them. I need to remain calm.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;JP screamed and yelled at me for 20 more minutes or so.&gt;&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s okay to tell him that it NOT okay to treat you this way. If you aren&#39;t <br/>\nscreaming at him, then he should not be screaming at you. It&#39;s okay to <br/>\nrespect yourslef and state your boundaries.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I tried to calm him down too.. Soothe him.. explain to him that the N64 is <br/>\n&gt;&gt;&quot;not fun&quot; if its causing this kind of conflict.&gt;&gt;<br/>\n<br/>\n </span></blockquote>The soothing and calming is good. The talk about the N64 would probably be <br/>\nbetter received if it was removed from the situation. Keep it for that <br/>\nnighttime, gentle, casual talk.<br/>\n<br/>\nTell yourself again what is wonderful about your kids. It will make dealing <br/>\nwith this difficult situation a little easier.<br/>\n<br/>\nLife is good.<br/>\n<br/>\n~Mary<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nTired of spam? Get advanced junk mail protection with MSN 8. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a></div>","specialLinks":[]}],"prevTopicId":58514,"nextTopicId":58519}}