{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":73026482,"authorName":"Christine Nigro","from":"Christine Nigro &lt;imtired@...&gt;","profile":"monstermomma8080","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Choosing Gameboys?","postDate":"1137102983","msgId":111167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1RDA0Q0E3LTgzQjYtMTFEQS1CMkIyLTAwMEE5NTkxMTlEMEBvcHRvbmxpbmUubmV0Pg==","inReplyToHeader":"PDExMzcwODU2OTAuMzM1LjU4NjY4Lm0xN0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":111166,"nextInTime":111168,"topicId":111167,"numMessagesInTopic":0,"msgSnippet":"Hi Beth, my kids have the DS and LOVE it!! My 8yo can play any game that he gets on it and had no trouble figuring out how to use the touch screen or stylus","messageBody":"<div id=\"ygrps-yiv-664681139\">Hi Beth, my kids have the DS and LOVE it!! My 8yo can play any game <br/>\nthat he gets on it and had no trouble figuring out how to use the touch <br/>\nscreen or stylus pen. My 5yo can play a few games and also doesn&#39;t have <br/>\nany problems using the touch screen/stylus pen or using the usual arrow <br/>\npad. They also had the SP&#39;s but quickly traded them in for the DS&#39;s as <br/>\nthe DS has more options and different types of games you can play <br/>\nbecause of the touch screen and stylus pen. Also, the DS will play <br/>\ngameboy advance games on it but only on the top screen. My 3yo dd has <br/>\nbecome interested in the DS and tries to play Nintendog, Warioware, and <br/>\nother Mario type games. She&#39;s now asking for her own.<br/>\n<br/>\nWe have a variety of consoles here as well. The one that my kids seem <br/>\nto use the most is the PS2. They also got and still get a lot of <br/>\nthrills out of playing with the GameCube. They love playing Mario games <br/>\nwith GC. They tried the donkey konga bongos and that was two thumbs <br/>\ndown. PS2 offers more game varieties for different ages (the kids have <br/>\ngames as well as Dh and I), there are also cool accessories like the <br/>\neyetoy. My kids LOVE eyetoy. It&#39;s a camera that hooks up to the system. <br/>\nThe camera will be included with certain game packs like eyetoy 1 & 2, <br/>\neyetoy antigrav, and sometimes there are games that do not include the <br/>\ncamera. But anyway, your movements is what makes the game so much fun! <br/>\nWe have a blast as a family taking turns doing the karate game or the <br/>\nwindow washing game. For Christmas, I bought something for the family <br/>\ncalled Guitar Hero. It&#39;s a guitar controller that you connect to the <br/>\nconsole and it comes with a game. You rock out like a crazy--very fun!! <br/>\nIt&#39;s similar to DDR (dance dance revolution) which is a dance pad <br/>\ncontroller for a dance moves game, also very fun =D<br/>\n<br/>\nI would definitely avoid getting the Xbox 360. It was never ready to be <br/>\nshipped--far too many problems for such an expensive item. Sometime <br/>\nthis year PS3 will be coming out along with Nintendo&#39;s new Revolution <br/>\n(I believe is replacing GC, there will not be a new GC made-I could be <br/>\nwrong).<br/>\n<br/>\nAnyway, I think each of the consoles have something different to offer. <br/>\nIt will depend on what games your child likes too. Maybe she can surf <br/>\nthe net looking at the different games each console offers. Perhaps <br/>\nthere is one that has more games she&#39;d enjoy over any other. And of <br/>\ncourse, you don&#39;t always have to get them new, try a game shop that <br/>\nsells games/handhelds/consoles used.<br/>\n<br/>\nChristine</div>","specialLinks":[]}],"prevTopicId":111164,"nextTopicId":8539}}