{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"The White&#39;s","from":"&quot;The White&#39;s&quot; &lt;jwwjr@...&gt;","replyTo":"LIST","senderId":"leTWg9O3Fm6Q9KHIMyqAb1dTc93nfK2ExKrMxizY5iKRfd5PJOHnvMIg3jeEkRoFxiZZ-E_W8Z2vbhRcHU6vAbDgk7q-d3CJ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"For Lorrie","postDate":"958661157","msgId":8555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWUwMWJmYzBkNyRjODkzZTMyMCQ4NzIxMWJkMEBuZW9jb21tLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":8554,"nextInTime":8556,"topicId":8555,"numMessagesInTopic":0,"msgSnippet":"Hi Lorrie and welcome, I wanted to share some thoughts about reading.  First of all, I really believe in delayed academics and following a child s own schedule","messageBody":"<div id=\"ygrps-yiv-354692509\">Hi Lorrie and welcome,<br/>\nI wanted to share some thoughts about reading.  First of all, I really<br/>\nbelieve in delayed academics and following a child&#39;s own schedule with<br/>\nregard to learning things.  That&#39;s what unschooling is to me, child-led.<br/>\nJust like letting the child learn to potty or wean or ride a bike or climb a<br/>\ntree, if you wait until the child is ready it&#39;s a lot easier.<br/>\n<br/>\nBut mostly I wanted to say that although I like your idea about a treasure<br/>\nhunt as a way to get you son to read, I don&#39;t think that external rewards<br/>\nare the right way to encourage him.  I have always felt that if you start<br/>\n&quot;paying&quot; a child to do anything then it becomes a quest for the reward only.<br/>\nI have never given my child gold stars or other external rewards.  We don&#39;t<br/>\nsign up for Book-It or the summer reading program at the library because I<br/>\ndon&#39;t want him reading a certain number of books just to get his prize.  I<br/>\nwant him to read just because it&#39;s fun.<br/>\n<br/>\nSo I agree with what others have posted, let your son pick things he would<br/>\nlike to read.  Let him check out books just to look at.  Read to him every<br/>\nday.  Read things to him that are above his reading level....I have a 7 year<br/>\nold son.  We&#39;ve read the Harry Potter Books, The Hobbit and are now reading<br/>\nRedwall.  He loves these books.  He also listens to a lot of books on tape,<br/>\nespecially in the car, like Johnny Tremain, Ella Enchanted, Jeremy Thatcher<br/>\nDragon Hatcher.  He&#39;s actually started reading some of Bruce Coville&#39;s stuff<br/>\nthis year.<br/>\n<br/>\nOnce your son sees what kind of fun stuff is in books, he&#39;ll want to read.<br/>\nDon&#39;t stick to things &quot;on his reading level&quot;.   And try not to reward him<br/>\nexternally, let the reward of enjoying a book be all there is.  He&#39;ll learn<br/>\nto love it without the pressure.  Public schools operate on external rewards<br/>\nonly, hence grades and gold stars and &quot;free time&quot; if you finish something<br/>\nearly, etc.  Try not to let your home become like schools.<br/>\n<br/>\nIf you haven&#39;t read it yet, I would recommend Mary Griffith&#39;s The<br/>\nUnschoolers Handbook.  It&#39;s a practical guide to letting your child learn<br/>\nfrom everyday life.<br/>\n<br/>\nGood luck and try not to stress over it.  Take this spring and summer to<br/>\ndeschool & learn even more about homeschooling.<br/>\n<br/>\nCindy</div>","specialLinks":[]}],"prevTopicId":8550,"nextTopicId":8560}}