{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"zFC2dQhoiB7vw6gV6McXeDY2ue3wg2qNGcbdIR8gK2sDvsGeQTakdTCYx69eUngF2aTatVq5LInpVFcvptdKD9qA3_SBvQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan news: Reclusive youngsters","postDate":"970905598","msgId":13616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMDA3MDc1OS5RQUEyNjMwMUBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13615,"nextInTime":13617,"topicId":13616,"numMessagesInTopic":0,"msgSnippet":"Hi all, Here is yet another news story that ran a couple days ago in Japan on the emotional scars of Japanese schoolchildren. This story focuses on the","messageBody":"<div id=\"ygrps-yiv-933174028\">Hi all,<br/>\n<br/>\nHere is yet another news story that ran a couple days ago in Japan on the <br/>\nemotional scars of Japanese schoolchildren.<br/>\n<br/>\nThis story focuses on the phenomenon known as *hiki-komori*, literally <br/>\n&quot;locking oneself away,&quot; in Japanese. An alarming number of Japanese <br/>\nyouths seem to be undergoing this emotional crisis now and the &quot;experts&quot; <br/>\nseem almost at a loss as to how to deal with it.<br/>\n<br/>\nThis article does a good job of covering the issue in general. But <br/>\nunfortunately, the story stops short of investigating the undeniable <br/>\nlinks between *hiki-komori* and school. Perhaps the &quot;experts&quot; just <br/>\nhaven&#39;t gotten around to researching that particular connection yet.<br/>\n<br/>\nIn the meantime, Japanese children in droves are losing their very spirit <br/>\nand direction in life....  <br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n--------------------------------------<br/>\n<br/>\nAsahi Evening News - 5 October 2000<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.asahi.com/english/asahi/1005/asahi100501.html\">http://www.asahi.com/english/asahi/1005/asahi100501.html</a><br/>\n<br/>\n<br/>\nTHE SCARY &#39;REAL WORLD&#39; OF RECLUSIVE YOUNGSTERS<br/>\n<br/>\n<br/>\nIn early August, more than 100 parents gathered at a community center in <br/>\nOmiya, Saitama Prefecture, to discuss what was wrong with their children. <br/>\nOne 59-year-old mother spoke about her 32-year-old son who had hardly <br/>\nventured out of the home for 10 years, bathing only once a month, rarely <br/>\nspeaking to his family and sometimes behaving violently.<br/>\n<br/>\nThe mother said she had consulted public health officials and hospitals, <br/>\nnone of which were able to come up with convincing explanations or <br/>\nsuggestions for treatment.<br/>\n<br/>\nAnother parent complained about a 29-year-old son, whose only <br/>\ncommunication over the previous five years had been in the form of <br/>\nwritten notes left on the kitchen table with instructions such as: &quot;Get <br/>\nme a video-game magazine&quot; or &quot;Do something about the dog that keeps <br/>\nbarking all day.&quot;<br/>\n<br/>\nYet another parent spoke of her teenage son washing his hands so <br/>\nfrequently that they were always raw, and who refused to attend school <br/>\nbecause both the school and its students were &quot;dirty.&quot; He even admonished <br/>\nhis mother to keep her hands clean.<br/>\n<br/>\nThis tendency toward reclusiveness among young people -- a phenomenon <br/>\nknown as *hikikomori* (social withdrawal) -- seems to be rising at an <br/>\nalarming rate. The meeting in August was part of a growing movement by <br/>\nconfused and troubled parents to seek mutual support and professional <br/>\nhelp. Late last year in Saitama Prefecture alone, four separate groups of <br/>\nparents joined together in mutual support organizations.<br/>\n<br/>\nTraditionally viewed as a domestic problem caused by poor parenting, <br/>\n*hikikomori* has been neglected by the government and social service <br/>\norganizations alike. While they are now finally starting to address the <br/>\nproblem, they have yet to come up with much in the way of effective <br/>\nsolutions or treatments.<br/>\n<br/>\n&quot;This is not a problem that can be solved by the family alone,&quot; said <br/>\nMasahisa Okuyama, 55, one of the organizers of the August meeting, who, <br/>\nalong with his wife had been forced to move from their house into an <br/>\napartment 18 months earlier by the growing violence of their 25-year-old <br/>\nson.<br/>\n<br/>\n&quot;Even though we need support from public institutions, when parents seek <br/>\nadvice from public health offices, children&#39;s welfare agencies, hospitals <br/>\nand police, they end up just getting the runaround, and find themselves <br/>\nfeeling isolated and exhausted,&quot; he said. &quot;We want the government to set <br/>\nup facilities that we have access to and that we feel we can turn to for <br/>\nhelp,&quot; he added.<br/>\n<br/>\nTakehiko Yoshikawa, the director of the mental health institute of the <br/>\nNational Center for Mental Health and Neurology, takes the crisis <br/>\nseriously. He calls *hikikomori* &quot;a mental health problem that concerns <br/>\neveryone,&quot; arguing that if it isn&#39;t addressed now, there will be dire <br/>\nconsequences in the future.<br/>\n<br/>\n&quot;Perhaps the hijacking (of a bus by a 17-year-old boy from Saga <br/>\nPrefecture last May) left a strong impression. There is a growing trend <br/>\nto regard reclusive young people as future criminals,&quot; he said. &quot;This <br/>\nperception is wrong and dangerous. *Hikikomori* is a national mental <br/>\nhealth problem.&quot; The teenage hijacker had a history of reclusiveness.<br/>\n<br/>\nPsychiatrist Tamaki Saito, an expert on *hikikomori*, defines the <br/>\ncondition as young people who show no other signs of neurological or <br/>\npsychiatric disorders, who shut themselves up at home and refuse to take <br/>\npart in social activities for six months or more. The condition usually <br/>\nstarts with a refusal to go to school and often continues into the 20s or <br/>\n30s. Afterward, sufferers may re-emerge into a normal adulthood.<br/>\n<br/>\nNo one -- neither parents nor specialists nor the youths themselves -- <br/>\ncan explain the causes of *hikikomori* or how to recover from it. The <br/>\ncondition varies from case to case and there is no set cure. Some people <br/>\nare able to return to society after spending time at private <br/>\ninstitutions, while others react better to medication.<br/>\n<br/>\nA 21-year-old man who seems to have made a dramatic recovery from a few <br/>\nyears ago, recalled the period when he started to stay away from school.<br/>\n<br/>\n&quot;One year in June when I was a third-year junior high school student, I <br/>\nfound myself simply unable to go to school,&quot; he said.<br/>\n<br/>\nHis inability to get up and go to school had been growing for about a <br/>\nyear. Even when he did force himself out of bed, it took him longer and <br/>\nlonger to leave the house.<br/>\n<br/>\nHe lingered in the bathroom, spending 15 minutes washing his hands, and <br/>\nup to three hours in the bath.<br/>\n<br/>\nAlthough he managed to graduate from junior high school and enter a <br/>\nprivate senior high school, for the first 10 days, he was unable to <br/>\nsummon up the courage to attend.<br/>\n<br/>\nFinally, at the urging of his father, the boy saw a neurologist who <br/>\ndiagnosed him with an obsessive-compulsive disorder. His parents arranged <br/>\nfor him to enter a private institution in Chiba Prefecture for children <br/>\nwho refused to go to school. The boy left his parents&#39; home and moved <br/>\ninto an apartment.<br/>\n<br/>\nAt the institution, the boy met other children who shared similar <br/>\nproblems. He found them easier to communicate with than his school peers. <br/>\nNo one thought his tendency to spend long periods in the bathroom was <br/>\nstrange. Gradually, his condition improved.<br/>\n<br/>\nA young man who shut himself up in his home for about six months during <br/>\nhis final year in junior high school tells a similar story.<br/>\n<br/>\n&quot;I hardly remember anything from that time,&quot; he said. &quot;A lot of things <br/>\nseemed to be happening at once.&quot;<br/>\n<br/>\nTwo and a half years ago, the 18-year-old boy moved from his home into a <br/>\ndormitory run by a private organization to help troubled youth live <br/>\nindependently.<br/>\n<br/>\nHe began to feel more comfortable in this environment, since the people <br/>\nhe met knew nothing about him. His confidence returned and a year later <br/>\nhe applied for a part-time job.<br/>\n<br/>\nLooking back on his more reclusive days, a 25-year-old college student in <br/>\nthe Kansai region who lives with his parents and younger brother, thinks <br/>\nall he really wanted was for his parents to recognize and appreciate him.<br/>\n<br/>\nHe says that, at the time, about once every two weeks he reacted <br/>\nviolently to trivial remarks by his mother by punching holes in the wall <br/>\nand breaking furniture.<br/>\n<br/>\nFor three years, until recently, the man rarely left his room, and <br/>\nalthough he managed to enter college, he was unable to make friends or <br/>\nwork with others.<br/>\n<br/>\n&quot;It was painful staying home all day doing nothing,&quot; he said. &quot;Even <br/>\nthough I wanted to go out, I couldn&#39;t.&quot;<br/>\n<br/>\nEventually his parents advised him to see a psychiatrist, who prescribed <br/>\na course of medication. The man&#39;s condition improved and he returned to <br/>\ncollege.<br/>\n<br/>\nMichizo Miki, a school counselor in Himeji, Hyogo Prefecture, who offers <br/>\ncounseling to the parents of troubled children says that an important <br/>\nelement of a successful outcome is simple listening.<br/>\n<br/>\n&quot;When people come to me for advice, I give them a full and attentive <br/>\nhearing,&quot; said Miki. &quot;But since the symptoms of the condition differ from <br/>\nperson to person, there is no set formula to deal with every case.&quot;<br/>\n<br/>\nA 25-year-old man in Aichi Prefecture who has made giant strides in <br/>\nrecovering from *hikikomori* has begun writing to children with similar <br/>\nproblems. The names were supplied to him by a parents&#39; association.<br/>\n<br/>\n&quot;Why not get together with people who share the same problem,&quot; he wrote. <br/>\n&quot;It might be helpful to meet older people who have overcome it.&quot;<br/>\n<br/>\nNone of the recipients of his letters has yet replied, but the man is <br/>\nhopeful.<br/>\n<br/>\n&quot;I know that in their hearts, every one of them wants to be understood by <br/>\nothers,&quot; he said.<br/>\n<br/>\n<br/>\nCopyright 2000 Asahi Shimbun</div>","specialLinks":[]}],"prevTopicId":13593,"nextTopicId":13620}}