{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[UnschoolingDiscussion] A good day","postDate":"1076277527","msgId":90554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMy4zZWM5NjQ2Ni4yZDU4MGIxN0Bhb2wuY29tPg=="},"prevInTopic":82079,"nextInTopic":0,"prevInTime":90553,"nextInTime":90555,"topicId":82079,"numMessagesInTopic":0,"msgSnippet":"I am trying to place the feeling I have today, peace, joy, contentment, or all I am not sure. The reason is really something simple and I am sure a good number","messageBody":"<div id=\"ygrps-yiv-1368889594\">I am trying to place the feeling I have today, peace, joy, contentment, or <br/>\nall I am not sure. The reason is really something simple and I am sure a good <br/>\nnumber people would look at me like I was nuts if I shared why with them.<br/>\n<br/>\nMy husband took our son snowboarding today, well, actually to work to teach <br/>\nsnowboarding. Not such a big deal but to me it is. Pete doesn&#39;t have to work <br/>\ntoday, he told them yesterday he would come in if he could. He did work <br/>\nyesterday and I took him and later returned to pick him up, spending about 3 hours on <br/>\nthe road. This has been a big commitment on all our parts. What is so <br/>\nwonderful to me is that dad is taking a part and willingly. He has always been a great <br/>\ndad but he was raised in a family that does not take children seriously. When <br/>\nI first mentioned that Pete was going to take this job I could see my MIL <br/>\nthought I was crazy, that this was going to be a big waste of my time. My own <br/>\nmother said she wouldn&#39;t do it but she can see that I am fine with it and want to <br/>\ndo it and that she supports whatever I want to do.<br/>\n<br/>\nMy 23yro son told me during a conversation the other day that &quot;Dad has really <br/>\nchanged since we (the older boys) were younger.&quot; He is so right!<br/>\n<br/>\nSo, my joy does not come because I did not have to drive, I would have <br/>\nwillingly. My joy comes from knowing that dad understands (or is beginning to) what <br/>\nwe are doing. He went today because he wanted to, because he knew if was <br/>\nimportant to Pete and because he wanted to spend the time with Pete in the car, he <br/>\ntold me it was quality time, LOL. If you would have told me 5 years ago that <br/>\nthis day would come I am not sure I would have believed it. This is the same <br/>\nman who I had to talk into letting me pull the younger son out even though &quot;He <br/>\nwasn&#39;t having any problems&quot; in school. The same man who has agreed to attend <br/>\nthe Unschooling Conference in August..WOOHOO!<br/>\n<br/>\nLaura<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":61726942,"authorName":"Karen McLaughlin","from":"&quot;Karen McLaughlin&quot; &lt;karenmcl@...&gt;","profile":"veganpoweredmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion]A good day","postDate":"1065287091","msgId":82079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGEwMWMzOGE5OSRhYzMyZGRmMCQzNWI3Mjc0MEBEZWxsT25lPg==","referencesHeader":"PGI4LjQ4YjVjMzQ4LjJjYWZhNjQzQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":90554,"prevInTime":82078,"nextInTime":82080,"topicId":82079,"numMessagesInTopic":0,"msgSnippet":"We had a particularly nice day yesterday...thought I would share! We started out the day with all four of us snuggled under the duvet until close to 9:00-it","messageBody":"<div id=\"ygrps-yiv-2059477415\">We had a particularly nice day yesterday...thought I would share!<br/>\n<br/>\nWe started out the day with all four of us snuggled under the duvet until<br/>\nclose to 9:00-it was cold, windy and overcast so we didn&#39;t feel too<br/>\nmotivated to get out of bed. We could hear all the schoolkids outside making<br/>\ntheir way to school (we live a block from the school). We finally got up so<br/>\nJoe (dh) could take Nathan (4) to his gymnastics class at the Y. After<br/>\nNathan and Joe left, Noah (almost 6) and I (still in pj&#39;s &lt;g&gt;) started<br/>\nmaking some oatmeal cookies, which Noah had asked to do today when we were<br/>\ntucking him in bed last night. Noah was running back and forth between the<br/>\nliving room (watching Scooby Doo Christmas video) and helping me with the<br/>\ncookies-he really only likes to help with the measuring parts (and the<br/>\neating of course). As I was finishing up baking the cookies, Joe & Nathan<br/>\ngot back. Nathan was very excited about using the trampoline and the balance<br/>\nbeam and &quot;slithering like a snake&quot; at gymnastics, which he demonstrated for<br/>\nme with gusto.<br/>\n<br/>\nJoe had a quick lunch and went back out to do some yardwork for one of his<br/>\nlawncare customers. The boys and I weren&#39;t hungry for lunch yet (too many<br/>\ncookies &lt;g&gt;) so they watched a bit of a video, played with Legos/Bionicles<br/>\nand a Power Rangers CD on the computer. They&#39;re all excited because they&#39;ve<br/>\ninherited our old computer so they don&#39;t have to wait for me to get off the<br/>\ncomputer anymore! While they were doing all that, I was reading email and<br/>\nsetting up a few things on the new computer system. An email came through<br/>\nfrom one of the women on our local homeschool list, saying that there was a<br/>\npicture of Joe and the boys (Joe pulling the boys on their tandem<br/>\ntrail-a-bike) in that day&#39;s paper. I thought this was pretty funny because<br/>\nneither Joe or  I knew the picture had run (I didn&#39;t even know it had been<br/>\ntaken in the first place; it had been taken on Wednesday when Joe was coming<br/>\nhome from running errands downtown with the boys and he had forgotten to<br/>\nmention it to me). So I went and picked up the paper which was sitting on<br/>\nthe dining room table and found the photo. I showed it to the boys, they<br/>\nthought it was no big deal (reminded me of Sandra&#39;s article about how Holly<br/>\ntakes the world for granted-this is Noah&#39;s second time in the paper and<br/>\nNathan&#39;s third, so I guess to them it *is* no big deal!).<br/>\n<br/>\nWe finally all got hungry and the boys decided they wanted veggie dogs for<br/>\nlunch. I made them two each (only one bun each though) and they polished<br/>\nthose off and asked for more. There were only 3 more left in the package so<br/>\nI cooked them up and they split them. I had some leftovers from the night<br/>\nbefore. We all had another cookie or two. By this time I was really feeling<br/>\nlike I wanted to have a shower and get dressed so off I went while the boys<br/>\nwent back to their Legos. As I was getting out of the shower, I hear someone<br/>\ncoming in the house. I figure it&#39;s Joe running in to pick up something he&#39;s<br/>\nforgotten, but it was my parents dropping in for a surprise visit (very<br/>\nunusual for them!) They live a half hour&#39;s drive from us so usually visits<br/>\nare planned but they were on their way back from a Woodcarving Show and<br/>\ndecided to stop in. Nathan ran to get them cookies and we visited for a bit,<br/>\nthen my dad helped me set up my new printer/scanner/copier which I am very<br/>\nexcited about! We then tested it out by making a copy of the newspaper photo<br/>\nfor my mom, then we scanned the photo and started playing around with it.<br/>\nAfter my parents left (close to 4:00) I realize I never started the laundry,<br/>\nso I run downstairs to do that. The boys decide they need popsicles so I<br/>\ngrab some from the downstairs freezer on the way up. I also realize I don&#39;t<br/>\nhave a clue what I&#39;m going to make for dinner and that Joe and I are going<br/>\nout to see a play tonight (our anniversary gift to each other). I rummage<br/>\naround in the fridge, see we have peppers, a patty pan  [summer] squash,<br/>\ncarrots. I remember that I wanted to use up this &quot;tofu helper&quot; mix that I<br/>\nbought for our camping trip this summer but never used, so came up with a<br/>\ntofu, veggies and sauce concoction with orange couscous for dinner. Joe came<br/>\nback and we sat down to eat, but the boys weren&#39;t hungry (not surprising<br/>\nafter 4 hotdogs each!) and continued playing.<br/>\n<br/>\nThey started playing this &quot;raccoon game&quot;. We have been reading this story<br/>\ncalled _A Week of Raccoons_ (basic premise: an elderly couple go outside<br/>\nevery morning to find damage done by raccoons-in the garbage one day, drank<br/>\nthe sugar water from the hummingbird feeder, ate a fish out of a bucket of<br/>\nwater, etc. The man sets a wooden-cage type trap every day, catches a<br/>\nraccoon, and drives him out to the pine forest. Every day he catches a new<br/>\nraccoon and the whole trap-trip thing repeats itself). The boys had taken<br/>\nthe two large boxes from the new computer and were pretending they were the<br/>\nraccoons in the traps. Noah wanted to be the Wednesday raccoon, and Nathan<br/>\nwanted to be the Monday raccoon. They asked Joe to put them in the fire<br/>\nengine tent and drive them to the pine forest, so he did. It was *very*<br/>\ncute.<br/>\n<br/>\nAfter dinner, I was desperately trying to clean off our large coffee table a<br/>\nbit so the babysitter wouldn&#39;t think we were total slobs-it was covered with<br/>\nLego, videos, books, part of a jigsaw puzzle and these cool plaster of paris<br/>\ndinosaur fossils Joe made with the boys the other day from a kit Nathan got<br/>\nfor his birthday last weekend. I picked up the fossil pieces to put them in<br/>\na place where they were less likely to get smashed, and remembered that the<br/>\nboys had asked to paint the fossils but we hadn&#39;t got round to it, so now<br/>\nit&#39;s probably going to be one of today&#39;s projects.<br/>\n<br/>\nOur babysitter (much loved by the boys) arrived and the boys were showing<br/>\nher around our new place excitedly (we moved in July and she hasn&#39;t sit for<br/>\nus since we moved). As we left they were all snuggled up on the couch with<br/>\npopcorn and a video.<br/>\n<br/>\nJoe and I took the bus downtown to see the play (a musical comedy called<br/>\nBeehive featuring lots of 60&#39;s tunes) which we really enjoyed. We got home<br/>\njust after 10 pm and Nathan was asleep, but Noah was still awake so I went<br/>\nand read him a story - a new one we just got from the library that the<br/>\nsitter had read to him and he was really excited about. He was quite<br/>\nconcerned when we got to the part where a little boy was riding a Snow<br/>\nLeopard. He looked at me quite seriously and said &quot;Mom, he shouldn&#39;t be<br/>\ndoing that! Leopards are carnivores! He&#39;s going to get eaten!&quot;. We talked a<br/>\nbit about the difference between make-believe and real life, then I gave him<br/>\na goodnight hug. He said &quot;mom, you&#39;re the best mom a boy could have&quot;. What a<br/>\ngreat ending to a fun day!!!<br/>\n<br/>\nKaren</div>","specialLinks":[]}],"prevTopicId":90508,"nextTopicId":90526}}