{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":66170646,"authorName":"V","from":"&quot;V&quot; &lt;live2learninscv@...&gt;","profile":"live2learninscv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"PART 2:  CBS story:  Homeschooling Nightmares","postDate":"1066173101","msgId":82919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtaHZyZStsbHRtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":82918,"nextInTime":82920,"topicId":82919,"numMessagesInTopic":0,"msgSnippet":"If the last story made you mad- read this one. Here is their Tuesday story that will air tonight. Vicky Home Schooling Nightmares LOS ANGELES, Oct. 14, 2003 ","messageBody":"<div id=\"ygrps-yiv-7122488\">If the last story made you mad- read this one.<br/>\nHere is their Tuesday story that will air tonight.<br/>\n<br/>\nVicky<br/>\n<br/>\n<br/>\nHome Schooling Nightmares<br/>\nLOS ANGELES, Oct. 14, 2003<br/>\n<br/>\n&lt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cbsnews.com/stories/2003/10/14/\">http://www.cbsnews.com/stories/2003/10/14/</a><br/>\neveningnews/main578007.shtml &gt;<br/>\n<br/>\n (Photo: CBS)<br/>\n<br/>\nAndrea Yates gained national attention when she drowned <br/>\nher five children in a bathtub. Deanna Laney, told investigators <br/>\nshe beat her three sons with rocks, killing two of them. Both <br/>\nmothers taught their children at home.<br/>\n<br/>\nDIG DEEPER<br/>\n<br/>\nTop 5 Reasons Why Parents Home School:<br/>\n*\tCan provide better education at home <br/>\n*\tReligious reasons <br/>\n*\tPoor learning environment at school <br/>\n*\tFamily reasons <br/>\n*\tTo develop character and morality <br/>\n<br/>\nCourtesy of the U.S. Dept. of Ed.<br/>\n------------------------------------------------------------------------<br/>\n<br/>\nFAQs:<br/>\n<br/>\n*\tWhat are some of the benefits of home schooling?<br/>\nFor many, the deepest and most abiding benefit of home <br/>\nschooling is the claiming (or reclaiming) of their family. <br/>\nHome schooling families spend incredible amounts of time <br/>\ntogether living, learning and playing. Many families like the <br/>\nflexibility home schooling provides both parents and children. <br/>\nChildren can learn about things they are interested in at a <br/>\ntime in their lives when they are ready to learn. No <br/>\npreconceived schedule forces them ahead or holds them <br/>\nback. Vacations and outings can be planned for times when <br/>\nthe family is ready, and often when the crowds are smaller <br/>\nand the costs lower. <br/>\n<br/>\n*\tAre parents really qualified to teach their children?<br/>\nParents are their children&#39;s first and best teachers for most <br/>\nof their formative years. Only parents will put these specific <br/>\nchildren&#39;s needs first and search for the very best learning <br/>\nresources for their particular children. Children in a home <br/>\nschooling situation receive individualized, personal attention <br/>\nfrom someone who has a vested interest in their success - <br/>\ntheir parents. If a parent is not qualified to teach a particular <br/>\nsubject that a child needs or wants to learn, they have many <br/>\noptions: hire a tutor, barter for instruction, get together with <br/>\nother families to create a class, learn along with the child, <br/>\nor find a community, distance-learning or online class.<br/>\n<br/>\nCourtesy of the Ore. Home Ed. Network <br/>\n(CBS) It is estimated that 850,000 children in this country <br/>\nare home-schooled -- the overwhelming majority by parents <br/>\nwho have only the best interests of their children at heart. <br/>\n<br/>\nBut homeschooling is largely unregulated. A CBS News <br/>\ninvestigation reports how some children have suffered <br/>\nabuse -- and much worse -- while no one was watching. <br/>\n------------------------------------------------------------------------<br/>\n<br/>\n<br/>\nNeil and Christy Edgar will be sentenced next month in <br/>\nKansas for abusing and murdering their 9-year-old son. <br/>\nHe suffocated after his head was wrapped in duct tape <br/>\nas a punishment for taking food without permission. <br/>\n<br/>\nIt&#39;s a shocking case, but as CBS News Correspondent <br/>\nVince Gonzales reports, not an isolated one. A CBS News <br/>\ninvestigation found dozens of cases of parents convicted or <br/>\naccused of murder or child abuse who were teaching their <br/>\nchildren at home, out of the public eye. <br/>\n<br/>\n&quot;A lot of reports for suspected abuse or neglect are made <br/>\nby the schools when they observe children coming in that <br/>\nmay be bruised or not well fed,&quot; says Marcia Herman-<br/>\nGiddens, of the North Carolina Child Advocacy Institute. <br/>\n<br/>\nIn Iowa, a father is serving life, and a mother goes on <br/>\ntrial later this month, for killing their 10-year-old adopted <br/>\nson and burying him at their house. Because they were <br/>\nhome schooling, no one noticed he was missing for <br/>\nmore than a year. <br/>\n<br/>\nThere are two notorious Texas cases. <br/>\n<br/>\nAndrea Yates gained national attention when she drowned <br/>\nher five children in a bathtub. Deanna Laney, told <br/>\ninvestigators she beat her three sons with rocks, killing <br/>\ntwo of them. Both mothers taught their children at home. <br/>\n<br/>\n&quot;The genuine home schoolers are doing a great job with <br/>\ntheir children, but there is a subgroup of people that are <br/>\nkeeping them in isolation, keeping them from public view <br/>\nbecause the children often do have visible injuries,&quot; says <br/>\nHerman-Giddens. <br/>\n<br/>\nEven a very public home school success story can hide a <br/>\nprivate dark side. Marjorie Lavery says her father beat her <br/>\nbefore the National Spelling Bee then threatened to kill her <br/>\nafter she came in second. He pleaded guilty to child <br/>\nendangerment after she testified about years of cruelty. <br/>\n<br/>\nHal Young and other home school advocates vigorously <br/>\ndefend the right to teach their children at home without <br/>\ngovernment intrusion. <br/>\n<br/>\n&quot;The cases that you&#39;ve mentioned are very, very rare - <br/>\nextremely rare,&quot; says Young. <br/>\n<br/>\n&quot;There&#39;s not a pattern there, there&#39;s not a trend,&quot; says <br/>\nYoung. &quot;It&#39;s not something you can point your finger at <br/>\nand say there&#39;s this vast undercurrent, because there&#39;s <br/>\nnot.&quot; <br/>\n<br/>\nBut it&#39;s hard to know how widespread abuse might be <br/>\nbecause the government doesn&#39;t keep track. It doesn&#39;t <br/>\neven know how many children are taught at home in this <br/>\ncountry. <br/>\n<br/>\nIn eight states, parents don&#39;t have to tell anyone they&#39;re <br/>\nhome schooling. Unlike teachers, in 38 states and the <br/>\nDistrict of Columbia, parents need virtually no <br/>\nqualifications to home school. Not one state requires <br/>\ncriminal background checks to see if parents have <br/>\nabuse convictions. <br/>\n<br/>\nThe Edgars now face life in prison. The dilemma raised <br/>\nby their case and others: how to protect parents&#39; rights <br/>\nto raise their children and still protect children from <br/>\nparents who abuse them. <br/>\n<br/>\n------------------------------------------------------------------------</div>","specialLinks":[]}],"prevTopicId":82905,"nextTopicId":82921}}