{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: &#39;Excessive&#39; PC Usage Help! - Newbie","postDate":"1286483378","msgId":57706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQzI3RkM4LUNCNkQtNDU5Qy1BN0I5LTE5ODhBMTBGMkQ4RkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGk4a3BnNStrNzR2QGVHcm91cHMuY29tPg==","referencesHeader":"PGk4a3BnNStrNzR2QGVHcm91cHMuY29tPg=="},"prevInTopic":57705,"nextInTopic":0,"prevInTime":57705,"nextInTime":57707,"topicId":57682,"numMessagesInTopic":0,"msgSnippet":"... That was the case with my daughter, also. She determined that she could actually read (to her satisfaction) when she was able to decipher reticulated","messageBody":"<div id=\"ygrps-yiv-1824459028\"><blockquote><span title=\"ireply\">&gt; When they were little it was Zoo Tycoon and Age of Mythology and  <br/>\n&gt; Neopets, which is where my littlest learned to read, though she was  <br/>\n&gt; still in school at the time. It definitely wasn&#39;t the teacher who  <br/>\n&gt; taught her, it was wanting to play Zoo Tycoon without help.<br/>\n<br/>\n </span></blockquote>That was the case with my daughter, also. She determined that she  <br/>\ncould actually read (to her satisfaction) when she was able to  <br/>\ndecipher &quot;reticulated giraffe&quot; &lt;g&gt;.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; There&#39;s Club Penguin and Toon Town, the Sims, Dungeons and Dragons  <br/>\n&gt; on-line, text-based role-playing games, Facebook, Live Journal, all  <br/>\n&gt; of which offer a huge amount of opportunities to learn as well as to  <br/>\n&gt; interact socially.<br/>\n&gt; All of mine have, over the years, progressed from &#39;just&#39; playing  <br/>\n&gt; games to reading, and then to writing, fanfiction for favorite books  <br/>\n&gt; and movies and television shows, and my oldest, who just started  <br/>\n&gt; community college this year, has learned a staggering amount in more  <br/>\n&gt; subjects I than it&#39;s worth anyone&#39;s time to list here by researching  <br/>\n&gt; and reading on the internet.<br/>\n<br/>\n </span></blockquote>Exactly. Senna has made many online friends through the forums  <br/>\nassociated with World of Warcraft.  She&#39;s recently been writing round- <br/>\nrobin Pokemon stories with other gamers on Petopia, a hunter/pet  <br/>\nforum. She has friends both in real life and online from playing World  <br/>\nof Warcraft. Same with deviantArt, where she uploads her computer  <br/>\ndrawings and writes fan fiction. I find it interesting that she&#39;s  <br/>\nfairly &quot;well-rounded&quot; from what she&#39;s researched online (sometimes  <br/>\nwith my help), given that for about 5 years, her focus has been on  <br/>\ngaming. Some people would find it surprising, but I don&#39;t.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ANd they still all &#39;just&#39; play games as well, of course. And the  <br/>\n&gt; only limit we&#39;ve generally made on their computer time over the  <br/>\n&gt; years, other than occasional paranoid lapses we&#39;ve regretted, is the  <br/>\n&gt; necessity of sharing two computers between the three of them.<br/>\n<br/>\n </span></blockquote>Senna was recently limited by her computer getting a &quot;ransom-ware&quot;  <br/>\ntrojan virus. We shared my MacBook these last few days, but she&#39;s  <br/>\nlived happily without being able to play WoW (she prefers her PC for  <br/>\ngaming). She found other things to do and happily gave me the laptop  <br/>\nwhenever I needed it.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":331885657,"authorName":"Jennifer Schuelein","from":"&quot;Jennifer Schuelein&quot; &lt;fairiedust66@...&gt;","profile":"jenfromtx6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &#39;Excessive&#39; PC Usage Help! - Newbie","postDate":"1286480711","msgId":57705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4bDgwNyszb3ZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4amR2cyt2NDM5QGVHcm91cHMuY29tPg=="},"prevInTopic":57701,"nextInTopic":57706,"prevInTime":57704,"nextInTime":57706,"topicId":57682,"numMessagesInTopic":0,"msgSnippet":"I recently had a talk with my son about doing one thing for the entire day and how he might want to break up his day with other activities (of his choice). He","messageBody":"<div id=\"ygrps-yiv-252960849\">I recently had a talk with my son about doing one thing for the entire day and how he might want to break up his day with other activities (of his choice). He was playing his DS for an entire day and it was making him tired and cranky. So, I sat him down and had a mature conversation with him (make sure you aren&#39;t negative about the computer). My husband thought our son would ignore our conversation and not make any changes in his habits. Well, yesterday during one of my &quot;check in&quot; moments with Xander, we talked about how he was taking a break from his DS on his own accord. He decided to plan the comic book he is going to start creating instead of DS time. This was especially exciting for me because he had just gotten a brand new game for which he waited for months and about which he was very excited. Usually when he gets a new game, he plays it for days on end. This time, he gave himself a break like I had suggested and was very pleased with himself and happy. I reported this info to my husband and he was happily surprised. <br/>\n<br/>\nLearning via computer is wonderful and some kids do learn via electronic media better than others (my son is an example), but I understand your desire for your daughter to break up her day with other activities. When you talk to her, give her suggestions for other activities even if it&#39;s just taking half an hour to play with a family pet, take a walk outside or really anything in which she has an interest. You could also ask her to help you with an activity, but don&#39;t make a big fuss over it being time away from the computer. Make it a small thing instead of a huge issue of contention. <br/>\n<br/>\nThe more you restrict, I fear the more your daughter will resent you and crave the computer as an act of defiance. I try to make these type of things a mutual decision between the two of us. You can include your daughter in the decision for what she will do with her break from the computer time. Let her pick and give her back some of the power she feels she has lost. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;unschooling_permission2enjoylife&quot; &lt;yeshi_khadro@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; We are new to Unschooling, attended 1st ever conference in Australia, reading Winning Parent, Winnng Child and other US books. So much sounds and rings true however at present my fears of too much computer use are winning. After one month my 8yo daughter will play the PC for up to 10 hours/day, avg. 7 hours most days. She is very tired later at night but hasn&#39;t been able to listen to her bodily signs yet to step away. When we go out she can only think about the computer and constantly asks when we will be going home or it is a struggle to get out of the house without her resisting to leave for love of the PC. I assumed there would be a transition period that would go on much longer than 6 weeks however in the meantime I am becoming anxious, my partner (not her father) is expressing concerns and comments to her and her father would not be happy if he knew how much she used the PC as well. All of this has led to me restricting her use which even I feel guilty about as I was starting to see her trust that what she does with her time &#39;was her choice&#39;. I do feel as though I have betrayed that trust now. Again, I really feel that what I have learnt from and about US in this short time has been of great benefit in our daily lives, however I really need some advice about this situation. Newbie!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &#39;Excessive&#39; PC Usage Help! - Newbie","postDate":"1286479342","msgId":57701,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4bDZsZStybzh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4amR2cyt2NDM5QGVHcm91cHMuY29tPg=="},"prevInTopic":57696,"nextInTopic":57705,"prevInTime":57700,"nextInTime":57702,"topicId":57682,"numMessagesInTopic":0,"msgSnippet":"... One month isn t very long! While it may be, as others have suggested, that your daughter has a big preference for learning via the computer, its also","messageBody":"<div id=\"ygrps-yiv-1756401652\">&lt;yeshi_khadro@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;After one month my 8yo daughter...<br/>\n<br/>\n </span></blockquote>One month isn&#39;t very long! While it may be, as others have suggested, that your daughter has a big preference for learning via the computer, its also important to remember that she&#39;s only just begun to deschool. She&#39;s still soaking up every moment she can get of something that was previously limited (at least by circumstance - if she had to do school for hours a day previously that limited the amount of time she had to do what she wanted). Give her time to soak it all in! <br/>\n<br/>\nBring her snacks, rub her shoulders and kiss the top of her head now and then to let her know you&#39;re happy that she&#39;s happy. Sit and watch what she&#39;s doing, ask her questions when its convenient to her - while a screen is loading, perhaps, not when something exciting is going on (use good manners!).  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; my partner (not her father) is expressing concerns and comments to her and her father would not be happy if he knew how much she used the PC as well<br/>\n </span></blockquote>***************<br/>\n<br/>\nAll the more reason to spend time with her while she&#39;s on the computer, so you can &quot;spin&quot; things from a more positive perspective. What kinds of things is she enjoying right now? If you&#39;re struggling to figure out how &quot;PC usage&quot; could be described in positive terms, I&#39;m sure people here can help you!<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":239656830,"authorName":"d2churchill","from":"&quot;d2churchill&quot; &lt;d2churchill@...&gt;","profile":"d2churchill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &#39;Excessive&#39; PC Usage Help! - Newbie","postDate":"1286465861","msgId":57696,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4a3BnNStrNzR2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4a21lcitsaDJkQGVHcm91cHMuY29tPg=="},"prevInTopic":57695,"nextInTopic":57701,"prevInTime":57695,"nextInTime":57697,"topicId":57682,"numMessagesInTopic":0,"msgSnippet":"New here, though I ve been reading for a while. And that is exactly the point I wanted to make, Bob. The computer s not just a time sink, my kids have found an","messageBody":"<div id=\"ygrps-yiv-1185876878\">New here, though I&#39;ve been reading for a while. And that is exactly the point I wanted to make, Bob. The computer&#39;s not just a time sink, my kids have found an almost infinite variety of things to occupy them and learn from on the computer over the years. When they were little it was Zoo Tycoon and Age of Mythology and Neopets, which is where my littlest learned to read, though she was still in school at the time. It definitely wasn&#39;t the teacher who taught her, it was wanting to play Zoo Tycoon without help. <br/>\n<br/>\nThere&#39;s Club Penguin and Toon Town, the Sims, Dungeons and Dragons on-line, text-based role-playing games, Facebook, Live Journal, all of which offer a huge amount of opportunities to learn as well as to interact socially. All of mine have, over the years, progressed from &#39;just&#39; playing games to reading, and then to writing, fanfiction for favorite books and movies and television shows, and my oldest, who just started community college this year, has learned a staggering amount in more subjects I than it&#39;s worth anyone&#39;s time to list here by researching and reading on the internet. ANd they still all &#39;just&#39; play games as well, of course. And the only limit we&#39;ve generally made on their computer time over the years, other than occasional paranoid lapses we&#39;ve regretted, is the necessity of sharing two computers between the three of them. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Bob Collier&quot; &lt;bobcollier@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Schuyler &lt;s.waynforth@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; We are funny in what we sanction. Computers aren&#39;t among the goods of the world. <br/>\n&gt; &gt; If she&#39;d spent all night reading a book or building a structure or doing <br/>\n&gt; &gt; something tactile and solid and &quot;real&quot; would your concerns be the same? Or would <br/>\n&gt; &gt; you feel that she&#39;d accomplished something more valuable? <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Just a thought while I&#39;m thinking it.<br/>\n&gt; <br/>\n&gt; My son Patrick, now 15, has had since he came out of school at the age of seven (and before) a preference for electronic media over traditional forms of media. And that&#39;s what it is - his preference. So, I could say that rather than having &quot;his nose stuck in a book all day&quot;, he&#39;s &quot;glued to a computer screen all day&quot;. These preoccupations are in my view two forms of the same thing and I think most parents would look at me in disbelief if I suggested that there&#39;s such a thing as excessive book usage.<br/>\n&gt; <br/>\n&gt; Bob<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &#39;Excessive&#39; PC Usage Help! - Newbie","postDate":"1286462747","msgId":57694,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4a21lcitsaDJkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI2OTg4OS45MDQwLnFtQHdlYjg2MjA3Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":57692,"nextInTopic":57695,"prevInTime":57693,"nextInTime":57695,"topicId":57682,"numMessagesInTopic":0,"msgSnippet":"... Just a thought while I m thinking it. My son Patrick, now 15, has had since he came out of school at the age of seven (and before) a preference for","messageBody":"<div id=\"ygrps-yiv-218081612\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; We are funny in what we sanction. Computers aren&#39;t among the goods of the world. <br/>\n&gt; If she&#39;d spent all night reading a book or building a structure or doing <br/>\n&gt; something tactile and solid and &quot;real&quot; would your concerns be the same? Or would <br/>\n&gt; you feel that she&#39;d accomplished something more valuable? <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>Just a thought while I&#39;m thinking it.<br/>\n<br/>\nMy son Patrick, now 15, has had since he came out of school at the age of seven (and before) a preference for electronic media over traditional forms of media. And that&#39;s what it is - his preference. So, I could say that rather than having &quot;his nose stuck in a book all day&quot;, he&#39;s &quot;glued to a computer screen all day&quot;. These preoccupations are in my view two forms of the same thing and I think most parents would look at me in disbelief if I suggested that there&#39;s such a thing as excessive book usage.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":76043661,"authorName":"lamortimer","from":"&quot;lamortimer&quot; &lt;lori@...&gt;","profile":"lamortimer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &#39;Excessive&#39; PC Usage Help! - Newbie","postDate":"1286460243","msgId":57695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4a2swaitrNGliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI2OTg4OS45MDQwLnFtQHdlYjg2MjA3Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":57694,"nextInTopic":57696,"prevInTime":57694,"nextInTime":57696,"topicId":57682,"numMessagesInTopic":0,"msgSnippet":"Thank you for mentioning Evil Genius! I ve never heard of it, but the name and your brief description sent me off to Wikipedia, where I learned more about the","messageBody":"<div id=\"ygrps-yiv-137021152\">Thank you for mentioning Evil Genius! I&#39;ve never heard of it, but the name and your brief description sent me off to Wikipedia, where I learned more about the game and that it&#39;s perfect for my son. Adding it to our list of things to get....<br/>\n<br/>\nCheers,<br/>\n<br/>\nLori<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;The other night Simon was playing a game he&#39;d just <br/>\n&gt; gotten called Evil Genius. He told Linnaea he&#39;d come up to bed in a minute or <br/>\n&gt; two when she went up at midnight. He didn&#39;t come up &#39;til 4 and he couldn&#39;t <br/>\n&gt; believe that it was 4 hours rather than a half an hour or so since she&#39;d gone to <br/>\n&gt; bed. It&#39;s really cool to me that he spent 4 hours planning this hideout, making <br/>\n&gt; this whole world, putting in all these little details, and didn&#39;t even notice <br/>\n&gt; that the time had passed. It&#39;s amazing focus and detail orientation and drive <br/>\n&gt; and passion. </span></blockquote></div>","specialLinks":[]},{"userId":299051558,"authorName":"Michelle Hogan","from":"Michelle Hogan &lt;michelle.hogan@...&gt;","profile":"michelle.hogan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] &#39;Excessive&#39; PC Usage Help! - Newbie","postDate":"1286456213","msgId":57692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4MTMwMS41NDMxMi5xbUB3ZWI1NzEwMi5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PDI2OTg4OS45MDQwLnFtQHdlYjg2MjA3Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":57689,"nextInTopic":57694,"prevInTime":57691,"nextInTime":57693,"topicId":57682,"numMessagesInTopic":0,"msgSnippet":"What Schuyler said, absolutely! I used to try and limit video gaming and computers and television until I realized I was making a bigger deal out of it than my","messageBody":"<div id=\"ygrps-yiv-378183293\">What Schuyler said, absolutely! I used to try and limit video gaming and computers and television until I realized I was making a bigger deal out of it than my kids were. Once I let go and started saying yes more often, I found that they play - and often play together - and then go do something else, like act out the game outside or build a city with cardboard boxes. Through the computer and video games, my 5-year-old has learned to read almost entirely on his own (I help when asked). He loves books, but the books he likes are very big and complex - huge dictionaries of the human body and big books on flight and space. But he can&#39;t read these yet. The books that are his &quot;speed&quot; at the library, he finds boring and repetitive. He wants to read big things, but isn&#39;t there yet - so he reads while playing games and can pick out words in his big books.<br/>\nAnyway, I digress. I have found that once I let go of the shoulds and the woulds, I realized that I didn&#39;t care if my kids were reading on the computer through their games. I used to read &quot;Choose Your Own Adventure&quot; books. Just because it&#39;s not a book doesn&#39;t mean it isn&#39;t learning. <br/>\nMy oldest - who is off traveling the country now (he&#39;s 18) - used to spend hours playing political simulation games. Developing countries, trading commodities, that kind of thing. He knows more about politics and understands more about culture and international issues than I ever will! All from playing computer games. <br/>\nWe do have some computer limits - but they are just about time. Because I have 6 kids in the house and only 3 available computers, we have to share and give everyone a chance. I&#39;ve noticed, though, that we have fewer arguments about this, even, since I let go of controlling it.<br/>\nIt takes time. Once a child learns that he can access his heart&#39;s desire whenever he wants, he doesn&#39;t covet it as much and feels free to explore other things, without the worry of &quot;losing&quot; that first passion.<br/>\nGood luck!Michelle <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 10/7/10, Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nSubject: Re: [AlwaysLearning] &#39;Excessive&#39; PC Usage Help! - Newbie<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Thursday, October 7, 2010, 4:56 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      The more you take the computer away, limit it, hide it behind the curtain, the <br/>\n<br/>\nless she&#39;ll be likely to choose to do something else. <br/>\n<br/>\n<br/>\n<br/>\nPam Sorooshian wrote a response about the costs of limiting television that uses <br/>\n<br/>\nice cream as an example. You can read it <br/>\n<br/>\nhere: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/t/economics.\">http://www.sandradodd.com/t/economics.</a> Pam is using an economic model of <br/>\n<br/>\nthe value of an item which describes things based on their utility. Things have <br/>\n<br/>\na utility based on what they bring to an individual. Computers have a fairly <br/>\n<br/>\nhigh utility in our home, and for me, because I don&#39;t have my own computer, they <br/>\n<br/>\nhave a very high marginal utility. Because I am limited in my access to the <br/>\n<br/>\ncomputer I prize the time I have on the computer quite highly. As Pam writes <br/>\n<br/>\n&quot;When you restrict an activity, you keep the person at the point where the <br/>\n<br/>\nmarginal utility is really high.&quot; So what you are doing by restricting your <br/>\n<br/>\ndaughter&#39;s access to something that already has a high utility for her is <br/>\n<br/>\nraising it&#39;s marginal utility. <br/>\n<br/>\n<br/>\n<br/>\nYou are keeping count, or poor you. Focus is a fantastic thing. And computers <br/>\n<br/>\nare fantastically engaging. The other night Simon was playing a game he&#39;d just <br/>\n<br/>\ngotten called Evil Genius. He told Linnaea he&#39;d come up to bed in a minute or <br/>\n<br/>\ntwo when she went up at midnight. He didn&#39;t come up &#39;til 4 and he couldn&#39;t <br/>\n<br/>\nbelieve that it was 4 hours rather than a half an hour or so since she&#39;d gone to <br/>\n<br/>\nbed. It&#39;s really cool to me that he spent 4 hours planning this hideout, making <br/>\n<br/>\nthis whole world, putting in all these little details, and didn&#39;t even notice <br/>\n<br/>\nthat the time had passed. It&#39;s amazing focus and detail orientation and drive <br/>\n<br/>\nand passion. <br/>\n<br/>\n<br/>\n<br/>\nWe are funny in what we sanction. Computers aren&#39;t among the goods of the world. <br/>\n<br/>\nIf she&#39;d spent all night reading a book or building a structure or doing <br/>\n<br/>\nsomething tactile and solid and &quot;real&quot; would your concerns be the same? Or would <br/>\n<br/>\nyou feel that she&#39;d accomplished something more valuable? <br/>\n<br/>\n<br/>\n<br/>\nIt often helps to allay any doubts I have for me to spend more time hanging out <br/>\n<br/>\nwith Simon or Linnaea. Seeing what they are interested in and finding out why <br/>\n<br/>\nthey are such interesting things has comforted me and laid my mind to rest on <br/>\n<br/>\nmany occasions. I trust that they are interested in something because it is <br/>\n<br/>\ninteresting and not because it is addictive or dangerous or controlling them in <br/>\n<br/>\nsome strange way. <br/>\n<br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\nFrom: unschooling_permission2enjoylife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yeshi_khadro@...\">yeshi_khadro@...</a>&gt;<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n<br/>\nSent: Thursday, 7 October, 2010 4:15:08<br/>\n<br/>\nSubject: [AlwaysLearning] &#39;Excessive&#39; PC Usage Help! - Newbie<br/>\n<br/>\n<br/>\n<br/>\nWe are new to Unschooling, attended 1st ever conference in Australia, reading <br/>\n<br/>\nWinning Parent, Winnng Child and other US books. So much sounds and rings true <br/>\n<br/>\nhowever at present my fears of too much computer use are winning. After one <br/>\n<br/>\nmonth my 8yo daughter will play the PC for up to 10 hours/day, avg. 7 hours most <br/>\n<br/>\ndays. She is very tired later at night but hasn&#39;t been able to listen to her <br/>\n<br/>\nbodily signs yet to step away. When we go out she can only think about the <br/>\n<br/>\ncomputer and constantly asks when we will be going home or it is a struggle to <br/>\n<br/>\nget out of the house without her resisting to leave for love of the PC. I <br/>\n<br/>\nassumed there would be a transition period that would go on much longer than 6 <br/>\n<br/>\nweeks however in the meantime I am becoming anxious, my partner (not her father) <br/>\n<br/>\nis expressing concerns and comments to her and her father would not be happy if <br/>\n<br/>\nhe knew how much she used the PC as well. All of this has led to me restricting <br/>\n<br/>\nher use which even I feel guilty about as I was starting to see her trust that <br/>\n<br/>\nwhat she does with her time &#39;was her choice&#39;. I do feel as though I have <br/>\n<br/>\nbetrayed that trust now. Again, I really feel that what I have learnt from and <br/>\n<br/>\nabout US in this short time has been of great benefit in our daily lives, <br/>\n<br/>\nhowever I really need some advice about this situation. Newbie!  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] &#39;Excessive&#39; PC Usage Help! - Newbie","postDate":"1286441762","msgId":57689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2OTg4OS45MDQwLnFtQHdlYjg2MjA3Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":57682,"nextInTopic":57692,"prevInTime":57688,"nextInTime":57690,"topicId":57682,"numMessagesInTopic":0,"msgSnippet":"The more you take the computer away, limit it, hide it behind the curtain, the less she ll be likely to choose to do something else. Pam Sorooshian wrote a","messageBody":"<div id=\"ygrps-yiv-486169209\">The more you take the computer away, limit it, hide it behind the curtain, the <br/>\nless she&#39;ll be likely to choose to do something else. <br/>\n<br/>\nPam Sorooshian wrote a response about the costs of limiting television that uses <br/>\nice cream as an example. You can read it <br/>\nhere: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/t/economics.\">http://www.sandradodd.com/t/economics.</a> Pam is using an economic model of <br/>\nthe value of an item which describes things based on their utility. Things have <br/>\na utility based on what they bring to an individual. Computers have a fairly <br/>\nhigh utility in our home, and for me, because I don&#39;t have my own computer, they <br/>\nhave a very high marginal utility. Because I am limited in my access to the <br/>\ncomputer I prize the time I have on the computer quite highly. As Pam writes <br/>\n&quot;When you restrict an activity, you keep the person at the point where the <br/>\nmarginal utility is really high.&quot; So what you are doing by restricting your <br/>\ndaughter&#39;s access to something that already has a high utility for her is <br/>\nraising it&#39;s marginal utility. <br/>\n<br/>\nYou are keeping count, or poor you. Focus is a fantastic thing. And computers <br/>\nare fantastically engaging. The other night Simon was playing a game he&#39;d just <br/>\ngotten called Evil Genius. He told Linnaea he&#39;d come up to bed in a minute or <br/>\ntwo when she went up at midnight. He didn&#39;t come up &#39;til 4 and he couldn&#39;t <br/>\nbelieve that it was 4 hours rather than a half an hour or so since she&#39;d gone to <br/>\nbed. It&#39;s really cool to me that he spent 4 hours planning this hideout, making <br/>\nthis whole world, putting in all these little details, and didn&#39;t even notice <br/>\nthat the time had passed. It&#39;s amazing focus and detail orientation and drive <br/>\nand passion. <br/>\n<br/>\nWe are funny in what we sanction. Computers aren&#39;t among the goods of the world. <br/>\nIf she&#39;d spent all night reading a book or building a structure or doing <br/>\nsomething tactile and solid and &quot;real&quot; would your concerns be the same? Or would <br/>\nyou feel that she&#39;d accomplished something more valuable? <br/>\n<br/>\nIt often helps to allay any doubts I have for me to spend more time hanging out <br/>\nwith Simon or Linnaea. Seeing what they are interested in and finding out why <br/>\nthey are such interesting things has comforted me and laid my mind to rest on <br/>\nmany occasions. I trust that they are interested in something because it is <br/>\ninteresting and not because it is addictive or dangerous or controlling them in <br/>\nsome strange way. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: unschooling_permission2enjoylife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yeshi_khadro@...\">yeshi_khadro@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Thursday, 7 October, 2010 4:15:08<br/>\nSubject: [AlwaysLearning] &#39;Excessive&#39; PC Usage Help! - Newbie<br/>\n<br/>\nWe are new to Unschooling, attended 1st ever conference in Australia, reading <br/>\nWinning Parent, Winnng Child and other US books. So much sounds and rings true <br/>\nhowever at present my fears of too much computer use are winning. After one <br/>\nmonth my 8yo daughter will play the PC for up to 10 hours/day, avg. 7 hours most <br/>\ndays. She is very tired later at night but hasn&#39;t been able to listen to her <br/>\nbodily signs yet to step away. When we go out she can only think about the <br/>\ncomputer and constantly asks when we will be going home or it is a struggle to <br/>\nget out of the house without her resisting to leave for love of the PC. I <br/>\nassumed there would be a transition period that would go on much longer than 6 <br/>\nweeks however in the meantime I am becoming anxious, my partner (not her father) <br/>\nis expressing concerns and comments to her and her father would not be happy if <br/>\nhe knew how much she used the PC as well. All of this has led to me restricting <br/>\nher use which even I feel guilty about as I was starting to see her trust that <br/>\nwhat she does with her time &#39;was her choice&#39;. I do feel as though I have <br/>\nbetrayed that trust now. Again, I really feel that what I have learnt from and <br/>\nabout US in this short time has been of great benefit in our daily lives, <br/>\nhowever I really need some advice about this situation. Newbie!  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":392629073,"authorName":"unschooling_permission2enjoylife","from":"&quot;unschooling_permission2enjoylife&quot; &lt;yeshi_khadro@...&gt;","profile":"unschooling_permission2enjoylife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"&#39;Excessive&#39; PC Usage Help! - Newbie","postDate":"1286421308","msgId":57682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4amR2cyt2NDM5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":57689,"prevInTime":57681,"nextInTime":57683,"topicId":57682,"numMessagesInTopic":0,"msgSnippet":"We are new to Unschooling, attended 1st ever conference in Australia, reading Winning Parent, Winnng Child and other US books. So much sounds and rings true","messageBody":"<div id=\"ygrps-yiv-926311487\">We are new to Unschooling, attended 1st ever conference in Australia, reading Winning Parent, Winnng Child and other US books. So much sounds and rings true however at present my fears of too much computer use are winning. After one month my 8yo daughter will play the PC for up to 10 hours/day, avg. 7 hours most days. She is very tired later at night but hasn&#39;t been able to listen to her bodily signs yet to step away. When we go out she can only think about the computer and constantly asks when we will be going home or it is a struggle to get out of the house without her resisting to leave for love of the PC. I assumed there would be a transition period that would go on much longer than 6 weeks however in the meantime I am becoming anxious, my partner (not her father) is expressing concerns and comments to her and her father would not be happy if he knew how much she used the PC as well. All of this has led to me restricting her use which even I feel guilty about as I was starting to see her trust that what she does with her time &#39;was her choice&#39;. I do feel as though I have betrayed that trust now. Again, I really feel that what I have learnt from and about US in this short time has been of great benefit in our daily lives, however I really need some advice about this situation. Newbie!</div>","specialLinks":[]}],"prevTopicId":57677,"nextTopicId":57707}}