{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] some ideas","postDate":"1093287854","msgId":98772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LjMxMGNhNmMxLjJlNWI5OWFlQGFvbC5jb20+"},"prevInTopic":98766,"nextInTopic":0,"prevInTime":98771,"nextInTime":98773,"topicId":98660,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/23/04 11:01:28 AM, aburlingame@centurytel.net writes: ","messageBody":"<div id=\"ygrps-yiv-991511207\">In a message dated 8/23/04 11:01:28 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> writes:<br/>\n<br/>\n&lt;&lt; I can see the sense in just getting things ready to do, and when I remember<br/>\n<br/>\nto do that, things go much more smoothly.  Like last night when their movie<br/>\n<br/>\nended, there was ingredients for edible dough set up on the table.  They<br/>\n<br/>\njust jumped right in! &gt;&gt;<br/>\n<br/>\nI started doing kids&#39; birthday parties that way when they were little, and I <br/>\nstill do it.  If there are two places they&#39;re toggling between (like patio and <br/>\nliving room, at the old house, and library and kitchen here) I go and take <br/>\ndown and set up the next phase--food, game, cake, gifts) while they&#39;re occupied <br/>\nin the other place, then when they change rooms I go straighten up and <br/>\nre-stage the room they just left.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] some ideas","postDate":"1093278758","msgId":98766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzgwMWM0ODkyZSRjZWYwMWQwMCRjNWI2Y2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDIwMDQwODIyMTE1MjI0LkxTTVQ0MDQubXRhMTEuYWRlbHBoaWEubmV0QGxlaWdoPg=="},"prevInTopic":98722,"nextInTopic":98772,"prevInTime":98765,"nextInTime":98767,"topicId":98660,"numMessagesInTopic":0,"msgSnippet":"My kids could never resist a new warm batch of home-made play dough and the bucket of cookie cutters.  Do you have a recipe? ========== I have several of","messageBody":"<div id=\"ygrps-yiv-1758535614\">My kids could never resist a new warm batch of home-made play dough and the<br/>\nbucket of cookie cutters.  Do you have a recipe?<br/>\n==========<br/>\n<br/>\nI have several of MaryAnn Kohl&#39;s books and we do this quite a bit.<br/>\nYesterday we made edible dough with peanut butter, corn syrup, powdered<br/>\nsugar and powdered milk.  It was fun.  We all ate a little, but it was so<br/>\nrich.  The texture was different than other doughs we have made and we liked<br/>\nthe oiliness of it.  We had a good time.<br/>\n<br/>\n============<br/>\n A pot of water on towels on the floor with barbies or beanies is always<br/>\nfun. (and some shaving cream or a little shampoo)  They can each have their<br/>\nown pot of  water and they get clean to boot.<br/>\n============<br/>\n<br/>\nWe do a version of this too, but I haven&#39;t tried the shaving cream or<br/>\nbeanies.  Thanks for the tip!<br/>\n<br/>\nI can see the sense in just getting things ready to do, and when I remember<br/>\nto do that, things go much more smoothly.  Like last night when their movie<br/>\nended, there was ingredients for edible dough set up on the table.  They<br/>\njust jumped right in!<br/>\n<br/>\nThanks for the reminder!<br/>\n<br/>\n~Andrea</div>","specialLinks":[]},{"userId":42924764,"authorName":"Marjorie Kirk","from":"&quot;Marjorie Kirk&quot; &lt;mkirk@...&gt;","profile":"mdlfkirk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] gradually changing ( Why isn&#39;t this working!?)","postDate":"1093188945","msgId":98722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODIyMTUzNi5pN01GYVdWZTAyMzM4NkBtcy1zbXRwLTAzLWVyaTAub2hpb3JkYy5yci5jb20+","inReplyToHeader":"PDAyOTgwMWM0ODdlYSQzNTc4MjVlMCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98712,"nextInTopic":98766,"prevInTime":98721,"nextInTime":98723,"topicId":98660,"numMessagesInTopic":0,"msgSnippet":"Andrea, I understand completely how you feel.  My kids were 1,3 and 5 when we moved to a new city for DH s job.  The plan was supposed to be that he would go ","messageBody":"<div id=\"ygrps-yiv-735661490\">Andrea,<br/>\n<br/>\nI understand completely how you feel.  My kids were 1,3 and 5 when we moved<br/>\nto a new city for DH&#39;s job.  The plan was supposed to be that he would go<br/>\nfrom a job where he worked from home and traveled half the time to a regular<br/>\n9-5 job with occasional travel.  What we ended up with instead was a 7-7<br/>\noffice job where he was traveling almost as often!  Add to this the fact<br/>\nthat I left all of my mom friends in the old city and accidentally moved<br/>\ninto The Stepford Village from Hell!<br/>\n<br/>\nI was so overwhelmed and isolated and unhappy.  I got short tempered with<br/>\nthe kids, depressed and cried everyday, at least once.<br/>\n<br/>\nHere are a few suggestions.  Take what might work and leave the rest.<br/>\n<br/>\n*Try to find a friend or two.  Take the kids to story time at the library or<br/>\nbookstore, go to a park, La Leche League Meeting (if applicable), homeschool<br/>\nsupport group, etc.  Anywhere you might strike up a conversation with<br/>\nanother like-minded mom.  Sometimes it helps just have a short<br/>\nI-know-what-you&#39;re-going-through conversation with another mom at the<br/>\nplayground.<br/>\n<br/>\n*If you can, put a few things out at night after the kids go to bed that<br/>\nmight be interesting to them the next day.  Set out paper and glue and<br/>\nfeathers ,pom poms, sequins, etc for an impromptu art project. Or play-doh<br/>\nwith cookie cutters and rolling pins.  Rice and bean tub with measuring<br/>\nspoons and cups. <br/>\n<br/>\n*When everyone seems a little crabby, put on some great music and Dance!<br/>\n<br/>\n* When things get really bad, just add water!  I don&#39;t know why, but water<br/>\nis a great relaxing diversion.  Put them in the tub, take them outside to<br/>\nwash the car, fill a tub with bubbly water to play in, get out the<br/>\nsprinkler......anything wet.  (I had a friend confide once that they had<br/>\nsuch a bad day, her son was on his third bath!)<br/>\n<br/>\n* When a long movie is coming to an end, and you think all hell might break<br/>\nout, get them a snack tray to share about 15-20 minutes before then end of<br/>\nthe movie.  You also might want to have an optional activity planned right<br/>\nafterwards.  Like &quot;Hey, now that the movie is over, who wants to help me<br/>\nbake cookies?&quot; or &quot;I was thinking about washing the car, anyone want to<br/>\nhelp?&quot;.<br/>\n<br/>\n* Find something YOU want to do while they are watching TV and do it.  They<br/>\nmay decide it looks interesting and join you.  If not, you still get to do<br/>\nsomething of your own choosing.<br/>\n<br/>\n* If the noise of the TV running constantly bugs you (and I can relate,<br/>\nbecause I have a hard time even with background music that I choose!) you<br/>\ncan compromise.  &quot;I know you guys really like to watch the TV, but I need a<br/>\nlittle quiet for a while.  How about we watch a movie, then turn the TV off<br/>\nfor an hour?&quot;<br/>\n<br/>\nI hope some of these are useful to you.<br/>\n<br/>\nGood luck, and keep us posted on how things go.<br/>\n<br/>\nMarjorie</div>","specialLinks":[]},{"userId":177721839,"authorName":"Game-Enthusiast","from":"&quot;Game-Enthusiast&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"some ideas","postDate":"1093175546","msgId":98712,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODIyMTE1MjI0LkxTTVQ0MDQubXRhMTEuYWRlbHBoaWEubmV0QGxlaWdoPg==","inReplyToHeader":"PDAyOTgwMWM0ODdlYSQzNTc4MjVlMCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98699,"nextInTopic":98722,"prevInTime":98711,"nextInTime":98713,"topicId":98660,"numMessagesInTopic":0,"msgSnippet":"My kids could never resist a new warm batch of home-made play dough and the bucket of cookie cutters.  Do you have a recipe? Also, when my kids were small,","messageBody":"<div id=\"ygrps-yiv-1066679941\">My kids could never resist a new warm batch of home-made play dough and the<br/>\nbucket of cookie cutters.  Do you have a recipe?  <br/>\nAlso, when my kids were small, taking them outside when things were starting<br/>\nto get tense, always worked.  They also really like playing with water.  A<br/>\npot of water on towels on the floor with barbies or beanies is always fun.<br/>\n(and some shaving cream or a little shampoo)  They can each have their own<br/>\npot of  water and they get clean to boot.  Shaving cream on the table to<br/>\ndraw in is fun too.  Once we even brought the kiddie pool into the kitchen<br/>\nin mid winter and filled it up and had a beach party.  Lots of towels, our<br/>\npool had a small slide!  And the kitchen floor got clean too.  Maybe you<br/>\ncould think of some things that would be really new to them and make a list<br/>\nand when things are falling apart, you could refer to the list with<br/>\nenthusiasm and pick something to do.  &quot;I have a great idea, come here...&quot;<br/>\nWho can resist that?<br/>\n <br/>\nAngela <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] gradually changing ( Why isn&#39;t this working!?)","postDate":"1093139344","msgId":98699,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyOTgwMWM0ODdlYSQzNTc4MjVlMCQxY2FlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PGNmLjE0OTg0YzNhLjJlNTkxZjAwQGFvbC5jb20+"},"prevInTopic":98660,"nextInTopic":98712,"prevInTime":98698,"nextInTime":98700,"topicId":98660,"numMessagesInTopic":0,"msgSnippet":"The magic phrase is next time, but you need to mean it. ================= I use this, and yes, it does work just fine, and I do mean it. ================= ","messageBody":"<div id=\"ygrps-yiv-298795285\">The magic phrase is &quot;next time,&quot; but you need to mean it.<br/>\n=================<br/>\n<br/>\nI use this, and yes, it does work just fine, and I do mean it.<br/>\n<br/>\n=================<br/>\nCoulnd&#39;t the older two watch the movie while you took the baby for a walk<br/>\naround the house or lay down with her elsewhere?  If you expect full-group<br/>\nagreement all the time,  you&#39;re expecting something you&#39;re unlikely to get.<br/>\n=================<br/>\n<br/>\nI didn&#39;t mean to give the impression that I expect consensus.  In this<br/>\nparticular case, the movie was one that I needed to watch with them, in case<br/>\nit was scary for them or whatever.  And also because they asked me to watch<br/>\nit with them.  (Close Encounters of the Third Kind)  Otherwise, I would have<br/>\ndone just as you suggest, taken the baby away to do something else.  I&#39;ve<br/>\ndone that many times, believe me! LOL<br/>\n<br/>\n==============<br/>\n I wouldn&#39;t have asked.  I would have cut up some snacks and put them out on<br/>\na plate to let them choose through the day.<br/>\n==============<br/>\n<br/>\nI do this too, but I can see why that would have helped in this particular<br/>\nsituation to have just done that instead of asking.  I could have gotten the<br/>\nred vines AND some other things, protein included, to entice them, and then<br/>\nnot worried about it.    When I do put platters out, they eat all of it up<br/>\nfor the most part.  Hmmm....this is an important insight for me.<br/>\n<br/>\n===========<br/>\nOne shared platter prevents who has more, who didn&#39;t finish, etc...<br/>\n===========<br/>\n<br/>\nYes, I actually did put out one shared platter, except for the red vines,<br/>\nwhich they wanted control of.  I use platters of food quite often.<br/>\nSometimes they bicker over who is grabbing the last piece, but I keep<br/>\nreminding them that they can have more food if they are still hungry when it<br/>\nis all gone.<br/>\n<br/>\n============<br/>\n It&#39;s cheaper than future therapy.<br/>\nAnd it&#39;s not waste if they get fed to birds or hamsters or put in a compost<br/>\npile.<br/>\n============<br/>\n<br/>\nYes, I can see this.  I think I need to work on my own attitude about waste<br/>\nand such.<br/>\n<br/>\n===========<br/>\n Can you use more alluring distractions than &quot;no&quot; or &quot;enough&quot;?<br/>\n===========<br/>\n<br/>\nOf course I can, and DO.  My grabbing her firmly and saying, &quot;Enough.  I<br/>\ndon&#39;t like to be screamed at!&quot;  is an example of my losing my patience in<br/>\nthe fray.  She was being so unreasonable and I was getting tired and<br/>\nfrustrated.  It was a perfect place to breathe, but I didn&#39;t.<br/>\n<br/>\n==========<br/>\nInstead of saing, &quot;No more movie,&quot; can you set up a fun table of something<br/>\nin another room, and lure them there as soon as the movie&#39;s over?<br/>\n===========<br/>\n<br/>\nThis seems like a really sensible and useful idea for me.  I think the only<br/>\nreason I haven&#39;t done more of this type of thing lately is because I&#39;m<br/>\noverwhelmed and need a break.  When they are happy with a movie, I often<br/>\nforget to look ahead to the end of the movie.  Instead I either watch with<br/>\nthem and enjoy the peace, or I try to catch up on housework, or I am doing<br/>\nsomething with the baby.  I think I would like to be caught up, but even<br/>\nwhen I am, it&#39;s hard to keep up.  Anyway, I know this will get easier as<br/>\nthey get older.<br/>\n<br/>\n=============<br/>\n I know it&#39;s hard to have babies. Sorry if this all seems dismissive.  I<br/>\ndon&#39;t mean to be.  Maybe it&#39;s like discussing whether childbirth hurts.  It<br/>\ndoes hurt.  That part can&#39;t be changed.  Having babies at home means too<br/>\nlittle sleep, conflicting requests and demands, exhaustion.  Frustration.<br/>\nThe kinder you are now, the better things will be next year, next month,<br/>\nnext week, tomorrow, and now.<br/>\n============<br/>\n<br/>\nNo, I understand that you don&#39;t mean to be dismissive.  I don&#39;t feel<br/>\ndismissed.  I&#39;m thankful for yours and everyone else&#39;s time and help.  You<br/>\nhelp me to see things differently sometimes and sometimes you remind of what<br/>\nI know and this is good. I have a 15 yo son as well, and I remember how<br/>\nthings got easier in many ways as he got older.  Still, he was one kid<br/>\ncompared to the three I have now, and he was VERY mellow.  Very.  Still is.<br/>\nI wish I could let things flow around me the way he does.  I need a good<br/>\nmeditative practice, and I will work harder at developing that.  Thanks for<br/>\ntaking the time to read and respond to my emotional, frustrated posts.<br/>\n<br/>\n~Andrea</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"gradually changing ( Why isn&#39;t this working!?)","postDate":"1093125376","msgId":98660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmLjE0OTg0YzNhLjJlNTkxZjAwQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":98699,"prevInTime":98659,"nextInTime":98661,"topicId":98660,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/21/2004 12:35:33 PM Mountain Daylight Time, aburlingame@centurytel.net writes: Yesterday we went shopping. All the recent posts had me","messageBody":"<div id=\"ygrps-yiv-659994540\">In a message dated 8/21/2004 12:35:33 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> writes:<br/>\nYesterday we went shopping. All the recent posts had me inspired.  When 4 yo <br/>\nasked me for Red Vines, I said, &quot;yeah, grab a bag for us.&quot;  Then 3 yo <br/>\nimmediately wanted chocolate teddy bear graham crackers.  &quot;OK.&quot;  MY budget is so <br/>\nstrict that I shouldn&#39;t have been buying this stuff, but I was inspired to let them <br/>\npick.  Well, they of course wanted EVERY single sweet treat they saw. <br/>\n<br/>\n---------------------------------<br/>\n<br/>\nThe magic phrase is &quot;next time,&quot; but you need to mean it.<br/>\n<br/>\n<br/>\n-= We tried to watch a movie at their request (they&#39;d already watched 3 that <br/>\nday), but the baby wouldn&#39;t let us and it was getting late, -=-<br/>\n<br/>\nCoulnd&#39;t the older two watch the movie while you took the baby for a walk <br/>\naround the house or lay down with her elsewhere?  If you expect full-group <br/>\nagreement all the time,  you&#39;re expecting something you&#39;re unlikely to get.<br/>\n<br/>\n-=-I suggested watching the movie later the next day, and 4 yo was fine, but <br/>\n3 yo balked, even though she wasn&#39;t really watching the show anyway.  She <br/>\nfinally came around, though grumpily and she was obviously tired at 10:30.-=-<br/>\n<br/>\nCould you have done something with her in the same room?  Coloring, <br/>\nPlaydough, lego, sorting, cutting paper?<br/>\nCould you rock her to sleep (if the baby was already down)?<br/>\n<br/>\n-=- Would she like an apple or some cheese?  4 yo squeals, &quot;Yes! and <br/>\napple!and some chocolate bears!&quot;  3 yo screams, &quot;NO and stomps her feet and crosses <br/>\nher arms and demands red vines.&quot;  -=-<br/>\n<br/>\nI wouldn&#39;t have asked.  I would have cut up some snacks and put them out on a <br/>\nplate to let them choose through the day.<br/>\n<br/>\nIt sounds like the questions and answers are frustrting you.  Try to arrange <br/>\nchoices without the asking and answering and aproving and disapproving in <br/>\ncases where you can.<br/>\n<br/>\n-=- I gave her another red vine, cored and sliced and apple and gave everyone <br/>\nsome bears.  4 yo says she doesn&#39;t have enough bears even before eating one.  <br/>\nI told her that if she was still hungry afterward and wanted more, she could <br/>\nhave some-=-<br/>\n<br/>\nOne shared platter prevents who has more, who didn&#39;t finish, etc.<br/>\n<br/>\n-=-Before I could even get the dish water started, 4 yo says she is full and <br/>\nleaves the table full of uneaten apple wedges--beautiful, crispy, tart-sweet <br/>\nBraeburns that she used to love.  I bite my tongue and ate them myself even <br/>\nthough I&#39;m not hungry. -=-<br/>\n<br/>\nZip loc bag in the fridge would&#39;ve prevented you eating them or being grouchy.<br/>\n<br/>\n-=-  I hate to see them turn brown and go to waste.  Then, about 20 minutes <br/>\nlater, 4 yo comes up to me and says she&#39;s hungry.  She asked me for chocolate <br/>\nbears.  3 yo asked for more red vines. -=-<br/>\n<br/>\nIt&#39;s cheaper than future therapy.<br/>\nAnd it&#39;s not waste if they get fed to birds or hamsters or put in a compost <br/>\npile.<br/>\n<br/>\n-=-I&#39;m sorry this is so long.  It doesn&#39;t even scratch the surface of what <br/>\ngoes on around here.  Though we also have fun, many of our days are filled with <br/>\nfighting, crying,  and whining.  I just don&#39;t know what to do.  -=-<br/>\n<br/>\nIf you give yourself two choices each time you&#39;re deciding what to do, you&#39;ll <br/>\ngradually ratchet toward better decisions.   Moving from frustration to <br/>\ntogetherness isn&#39;t a one-step trip.  But taking the first step puts you in position <br/>\nto take the second one.<br/>\n<br/>\nCan you cut red vines into little pieces? (If kids would hate that, never <br/>\nmind.)<br/>\nCan you use more alluring distractions than &quot;no&quot; or &quot;enough&quot;?  Instead of <br/>\nsaing, &quot;No more movie,&quot; can you set up a fun table of something in another room, <br/>\nand lure them there as soon as the movie&#39;s over?<br/>\n<br/>\nWhen a baby is holding something dangerous, it works better to offer her <br/>\nsomethig eciting.  Often she&#39;ll just drop the forgotten dangerous item.  If you <br/>\ntry to wrestle it away, though, the baby cries and feels deprived, instead of <br/>\nfeeling she&#39;s just gotten hold of something beautiful and better.<br/>\n<br/>\nI know it&#39;s hard to have babies. Sorry if this all seems dismissive.  I don&#39;t <br/>\nmean to be.  Maybe it&#39;s like discussing whether childbirth hurts.  It does <br/>\nhurt.  That part can&#39;t be changed.  Having babies at home means too little <br/>\nsleep, conflicting requests and demands, exhaustion.  Frustration.   The kinder you <br/>\nare now, the better things will be next year, next month, next week, <br/>\ntomorrow, and now.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":98761,"nextTopicId":98753}}