{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"imitation leaning","postDate":"1177568231","msgId":28484,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTU1RTFBOEY2MUEyRS1BRUMtMTJERjJAV0VCTUFJTC1SRTEwPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":28483,"nextInTime":28485,"topicId":28484,"numMessagesInTopic":0,"msgSnippet":"I thought this might inspire some comments!  ~Kelly Imitation Learning by Robert Genn Researchers at the Volen Center for Complex Systems at Brandeis ","messageBody":"<div id=\"ygrps-yiv-1673057991\">I thought this might inspire some comments! &lt;g&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\nImitation Learning<br/>\nby Robert Genn<br/>\n<br/>\n<br/>\nResearchers at the Volen Center for Complex Systems at Brandeis <br/>\nUniversity have taken a second look at &quot;imitation learning.&quot; It seems <br/>\nthat when natural talent is added to one&#39;s flagrant imitation of <br/>\nothers, what results may be the dual assets needed to gain proficiency. <br/>\nRepeated practice and focused desire come into the equation as well. <br/>\n&quot;We are trying to determine what strategies will optimize imitation <br/>\nlearning,&quot; says study co-author Robert Sekular. &quot;These strategies are <br/>\ncrucial for acquiring many of the skills needed in daily life. A lot of <br/>\nwhat we do is learned by watching and imitating others.&quot; This includes <br/>\ntying our shoes, feeding ourselves and, apparently, creating art.<br/>\n<br/>\nHumans have a natural tendency--in some cases a necessity--to do things <br/>\nin the &quot;correct&quot; way. Much basic learning is done in &quot;monkey see, <br/>\nmonkey do&quot; methodology. This goes for sophisticated procedures as well. <br/>\nNovice heart surgeons, for example, learn order, technique and <br/>\nproficiency by watching seasoned pros. Golf swings are refined by <br/>\nplaying Tiger&#39;s videos. Complex ballet steps are mastered by observing <br/>\nthe legs and feet of expert ballet dancers. It&#39;s the honoured principle <br/>\nof the &quot;demo.&quot; While some human activities are more formalized than <br/>\nothers, &quot;visual recipe gathering&quot; is part of our psyche.<br/>\n<br/>\nThe visual arts present a problem in this area. Time-tested processes <br/>\nand academic principles are, of course, valuable, but when large <br/>\nnumbers of artists begin to imitate one another a kind of rigor mortis <br/>\ncreeps into the creative landscape. Art often expects and demands that <br/>\none artist be unique from the next. Artists on a quest to find &quot;the <br/>\nsecret&quot; can easily fall into the imitation pit. In art, there&#39;s no <br/>\nsingle, golden way.<br/>\nIdeally, individualists need to sidestep imitation learning and instead <br/>\nrely on direct observation of either the physical world or the universe <br/>\nof the human mind. That&#39;s why self-education is so important in the <br/>\nvisual arts. Becoming a student of your own processes and following <br/>\nyour nose in the quietude of your workspace can be the most effective <br/>\nroute to private bliss and public success.<br/>\n<br/>\nMany art schools understand and exemplify this dichotomy by teaching <br/>\nlittle but attitude. This is often a mistake. Those experts at Brandeis <br/>\nsay we grab our basics by imitation learning, but it seems it is only <br/>\nlater that we get a decent grab at attitude.<br/>\n<br/>\nBest regards,<br/>\n<br/>\nRobert<br/>\n<br/>\nPS: &quot;All education must be, in the end, self-education.&quot;<br/>\n(Robert Henri)<br/>\n<br/>\nEsoterica: If you accept the proposition, as many do, that imitation <br/>\nlearning is the swiftest way to proficiency in the arts, a certain <br/>\nobligation comes with your process. Sooner or later you must give a <br/>\npersonal spin and attempt to raise your standards beyond that of your <br/>\nimitated master. Apart from being valuable in the building of <br/>\nself-esteem, this move is vital to wider acceptance and is more in <br/>\nharmony with the idealized wisdom of art history. There is a price to <br/>\npay if you don&#39;t. In the words of landscape painter A. Y. Jackson, <br/>\n&quot;Those who follow are always behind.&quot;<br/>\n<br/>\n<br/>\n-------------------<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]}],"prevTopicId":28483,"nextTopicId":28485}}