{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Shannon Brophy","from":"&quot;Shannon Brophy&quot; &lt;shannon@...&gt;","replyTo":"LIST","senderId":"Q-O4hGO5DRCbEtFGFvC5AO553NMBdt1CvPalbcGYPO3ZicHIEx1RPmc0Wgr1S_cxinPmGZVq6rFQPc7TyVWpbCeQUEyjfAR34a8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Off Topic-Chronic Fatigue  and other illness","postDate":"954453455","msgId":7524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMmUwMWJmOWE5MiRmNGYwZmNjMCQwNDQ1YmE4Y0B5b2dhLmNvbT4=","inReplyToHeader":"PGE4LjMxODBjZjIuMjYxNGZkN2NAYW9sLmNvbT4="},"prevInTopic":7498,"nextInTopic":0,"prevInTime":7523,"nextInTime":7525,"topicId":7498,"numMessagesInTopic":0,"msgSnippet":"I got to hear Dr. Luc de Schepper speak, and I have a friend who studies in his school and have read his book too. He says that homeopathy is truly effective","messageBody":"<div id=\"ygrps-yiv-1925875787\">I got to hear<br/>\nDr. Luc<br/>\nde Schepper speak, and I have a friend who studies in his school and have<br/>\nread his book too. He says that homeopathy is truly effective for ADD kids<br/>\nby looking at them as unique individuals and identifying physical, mental,<br/>\nand especially emotional symptoms and then precribing a remedy.  I wanted to<br/>\nmention that<br/>\nChronic fatigue and other illness can be caused with wheat allergy. Celiac<br/>\nsprue (spelling?) disease means that those who suffer have to really cut out<br/>\nall wheat and lots of other things like spices that have additives, and even<br/>\nlicking stamps-in order to get better.  It is often missed by medical people<br/>\nas a possibility, and can be tested for.<br/>\nForgive me if it has been mentioned as I haven&#39;t been following the<br/>\ndiscussion closely.<br/>\nShannon</div>","specialLinks":[]},{"userId":0,"authorName":"kayelle42@aol.com","from":"kayelle42@...","replyTo":"LIST","senderId":"Zp24iSfx0vu6cu1ygkTXEdZu4mFJ8cvHbXp9hTW0IXdksWpI83tFesIz_T6FU7Ob6vYIKz4bkdI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Off Topic-Chronic Fatigue  and other illness","postDate":"954442620","msgId":7498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE4LjMxODBjZjIuMjYxNGZkN2NAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":7524,"prevInTime":7497,"nextInTime":7499,"topicId":7498,"numMessagesInTopic":0,"msgSnippet":"Dear Susan, Tammy, Teresa and anyone else who wants info on CF, The info that i want to share with you comes from a book called Human Condition: Critical.","messageBody":"<div id=\"ygrps-yiv-1914726138\">Dear Susan, Tammy, Teresa and anyone else who wants info on CF,<br/>\n         The info that i want to share with you comes from a book called <br/>\n&quot;Human Condition: Critical.&quot;  It is written by a man named Dr. Luc <br/>\ndeSchepper.  He is an MD Ph.d,  acupuncturist and classical homeopath.  I had <br/>\nthe great privilege of having this man as my Dr. for a few years and I can <br/>\nsay he is a genius at what he does. He has written many books and teaches  <br/>\nhomeopathy at a medical college to traditional dr.s. In case you are <br/>\nunfamiliar - homeopathy is a 200 year old medicine based on the belief that <br/>\nlike cures like.  If, for example, you are stung by a bee, then the venom <br/>\nfrom a bee taken in an infinitesimal amount [called a &#39;&quot;remedy&quot;] will boost <br/>\nthe body&#39;s own immune system into healing itself.  I can personally attest to <br/>\nthe miracle of homeopathy as I have been using it for 10 years.  <br/>\n     Anyway, I was rereading Dr. Luc&#39;s book the other day when I noticed all <br/>\nthe info on CF and other auto-immune diseases.  I knew that I had recently <br/>\n&quot;met&quot; someone on the internet with CF and I really want to help.  I will <br/>\nQuote some of the info to you here and if it sounds like something you would <br/>\nlike to know more about, I would say try to get the book.  I got it in my hf <br/>\nstore but I am sure B&N has it. Also the book explains the whole concept of <br/>\nhomeopathy which would also help.<br/>\n      One of the basic philosophies of homeopathy is that the physical <br/>\nsymptoms often begin with some emotional trauma.  Many people will say &quot;I <br/>\nhave never been quite right since.&quot;------ .. In homeopathy, that incident <br/>\nwhich preceded the beginning of an illness is very important.  I have a <br/>\nfriend who came down with  Lyme&#39;s disease and eventually MS - all after her <br/>\ndivorce.  I know  a woman who was diagnosed with breast cancer 6 months after <br/>\nmoving away from friends and family in Iowa to NJ.  Not everyone who <br/>\nexperiences emotional trauma will develop serious illness - but many people <br/>\nare sensitive to begin with and these people may become ill.  When the body <br/>\nis having difficulty handling grief or anger or loss, etc., they lose their <br/>\nvital energy thus allowing illness in.<br/>\n        Here is a quote from the book, &quot; We need to look at the patient when <br/>\nhe was in his beginning stage of the disease, and try to get an idea about <br/>\nhis simple change of  state before his health was compromised. How can we <br/>\nexpect to treat the disease in an intelligent way if we do not know what the <br/>\nbeginnings are?... In Chapter 4 I outlined many emotional factors leading to <br/>\na state of chronic exhaustion. [ hearing bad news,broken heart, nursing loved <br/>\nones, guilt feelings, business failure, lost ambition & disappointment, <br/>\nloneliness, jealousy, home-sickness,etc.]   &quot;All of them are possible <br/>\ncausative factors of CFIDS and need to be repaired with homeopathic remedies <br/>\nif we want to be successful in fighting this disease.  ...Don&#39;t forget, we <br/>\nview this diseased state as a decrease in vital energy.  Once this energy has <br/>\nreached a certain low level, the patient is susceptible to viruses, bacteria, <br/>\nyeast and parasites, which are consequences Not causes.&quot; <br/>\n           There are a few more pages on CFIDS and other illnessess after <br/>\nthis that you can read.  Also, dr. Luc says that he covers CFIDS in his other <br/>\nbook, &quot;Full of Life&quot;  which I do not have.  The main difference between <br/>\nhomeopathy and western medicine is that the homeopathic physician is more <br/>\ninterested in the symptoms of Each individual patient; not their diagnosis.  <br/>\n2 people with CFIDS will probably not get the same remedy. <br/>\n      I hope this helps somebody: I really feel I was led to read this book <br/>\nto help someone.  It is a book that I own and I have already read, yet I was <br/>\ncompelled to pick it up again just a few days ago.  If anyone needs more info <br/>\nI would be glad to help if I can.  I personally KNOW the power and miracle of <br/>\nhomeopathy and would be happy to help someone else make the same discovery!   <br/>\njackie</div>","specialLinks":[]}],"prevTopicId":7482,"nextTopicId":7527}}