{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306870112","msgId":61369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxQ0NDNkRFLTg5Q0MtNEZEMy1CMkQ1LTg2Q0M0M0IzMjFDNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEMzMjI4RjkyLTVBRTMtNDU3OS05OTBFLTJBRTRFQ0REQTQ2REBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDc2NzVGMEIzLUIxMDUtNEZBQi05NTJBLUNCMjRCMzM4QjcyQ0Bkcml6emxlLmNvbT4gPEMzMjI4RjkyLTVBRTMtNDU3OS05OTBFLTJBRTRFQ0REQTQ2REBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61355,"nextInTopic":0,"prevInTime":61368,"nextInTime":61370,"topicId":61355,"numMessagesInTopic":0,"msgSnippet":"... Many people assume a list is for social connection. It s where they will share bits of their unschooling lives with others who have similar ideas about","messageBody":"<div id=\"ygrps-yiv-734511538\">On May 31, 2011, at 12:18 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; the list needs to be about ideas IN AN UNSCHOOLING LIGHT<br/>\n<br/>\n </span></blockquote>Many people assume a list is for social connection. It&#39;s where they  <br/>\nwill share bits of their unschooling lives with others who have  <br/>\nsimilar ideas about kids.<br/>\n<br/>\nThis list isn&#39;t that. This list is different.<br/>\n<br/>\nThe Always Learning list is a place where for 5 minutes, for an hour,  <br/>\npeople can -- choose to! -- set aside their current views about  <br/>\nchildren and learning and immerse themselves in thinking that&#39;s fully  <br/>\nfocused on creating more joyful learning and living for kids. While  <br/>\nsomeone is reading here, the ideas they experience from the list will  <br/>\nhave no compromise from that focus. It&#39;s a place to temporarily  <br/>\nexperience what full on radical unschooling is like.<br/>\n<br/>\nOnce someone steps away from the list, they can take with them as much  <br/>\nor as little of that view as they want. They can even fully reject it  <br/>\nall and carry on with their own views.<br/>\n<br/>\nNo one&#39;s thoughts are controlled! Everyone&#39;s free to think and do  <br/>\nwhatever they believe is best for their family. Everyone&#39;s free to  <br/>\nhold different values than those expressed by long time unschoolers on  <br/>\nthe list. But to create the immersive experience, the ideas are  <br/>\nscrutinized to stay focused on children&#39;s joyful living and learning.<br/>\n<br/>\nThere are plenty of places -- lists, message boards, face to face  <br/>\ngroups -- where people can share thoughts with other unschoolers.  <br/>\nThere are only a few places where people can experience what life  <br/>\nlooks like when a focus on joyful learning and living is fully embraced.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fwd: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306858712","msgId":61355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzMjI4RjkyLTVBRTMtNDU3OS05OTBFLTJBRTRFQ0REQTQ2REBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDc2NzVGMEIzLUIxMDUtNEZBQi05NTJBLUNCMjRCMzM4QjcyQ0Bkcml6emxlLmNvbT4="},"prevInTopic":0,"nextInTopic":61369,"prevInTime":61354,"nextInTime":61356,"topicId":61355,"numMessagesInTopic":0,"msgSnippet":"The agenda for this list is stated AT LENGTH, and the list is nearly ten years old.  I ll respond to other bits in another e-mail. My reason for sending this","messageBody":"<div id=\"ygrps-yiv-752401258\">The agenda for this list is stated AT LENGTH, and the list is nearly ten years old.  I&#39;ll respond to other bits in another e-mail.  <br/>\n<br/>\nMy reason for sending this to the list rather than dealing with it privately is that I&#39;m on a trip in England, I&#39;m visiting a home-educating family in Durham, and dinner is nearly on the table.  No one was &quot;publically humiliated,&quot; the list needs to be about ideas IN AN UNSCHOOLING LIGHT, not about all the ideas in the world.  My participation in this list is not an invitation for people to follow me home and insult me in private.  <br/>\n<br/>\nSandra<br/>\n<br/>\nBegin forwarded message:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: Sacha Davis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sacha@...\">sacha@...</a>&gt;<br/>\n&gt; Date: May 31, 2011 7:06:28 AM MDT<br/>\n&gt; To: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\n&gt; Subject: Re: [AlwaysLearning] Marriage-problem, request for ideas<br/>\n&gt; <br/>\n<br/>\n&gt; Sandra - thanks for the input.  Guess I&#39;ve been &quot;schooled&quot; in unschooling.  Kind of ironic.  <br/>\n&gt; <br/>\n&gt; I *was* sharing my experience.  I did not say leave, but gave context that my suggestions come from a certain place and a certain life experience, and my response is shaped by that, which is why I shared what I would do.  I did not &quot;vote&quot;, I did not say &quot;girlfriend, dump the chump, pack your bags and leave right now.&quot;  I said this is MY world view and she&#39;s in a situation that is untenable, and I would make a certain choice which shapes what I say and suggest and how I support.  I cannot take myself out of my writings.  If I did not reveal my own background and my own what I feel is judgement, then I wouldn&#39;t be fully vetted.  I actually feel it would be deceptive.  <br/>\n&gt; <br/>\n&gt; People will tell you that there are all different ways to unschool, but clearly not all different schools of thought.  Instead of being inclusive, it can be a group that is dogmatic and judgmental of different voices, which I think is sad.  I don&#39;t hugely appreciate being publicly humiliated but that is how the leadership in this movement makes sure people don&#39;t stray off the agenda.  The thing is, who is setting the agenda and what right do they have?  In reality you have no more right than I do.  <br/>\n&gt; <br/>\n&gt; Of course you&#39;ll say that this is not what this list is for, and while you don&#39;t own unschooling, you do own the list.  The email you sent was actually NOT about unschooling.  I guess support for people living with drug users and considering whether or not they should stay married is actually NOT what this list is for as well.  But it&#39;s your list and your rules to violate.   <br/>\n&gt; <br/>\n&gt; I stick around because I find the theory interesting and I&#39;m on my own journey with unschooling.  I post occasionally because I can&#39;t help myself.  But over all, I think you are doing  yourself and your movement a disservice, which is sad because unschooling is an amazing thing and it&#39;s too bad that people get turned off by this type of interaction.  I&#39;ve seen this conflict over and over in internet communities - who do you serve, yourselves or the public.  It almost always comes down to yourselves.    <br/>\n&gt; <br/>\n&gt; Thanks for listening.  I&#39;m quite positive this will fall on deaf ears but at least I got it off my chest.  Luckily none of this will change the path I&#39;ve chosen for my family and I still remain dedicated to unschooling despite being now labeled as someone who has &quot;the kind of thinking one might do without ever having been involved with unschooling&quot;.  Kiss of death, eh? <br/>\n&gt; <br/>\n&gt; Sacha<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Sacha L. Davis<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sacha@...\">sacha@...</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On May 31, 2011, at 1:29 AM, Sandra Dodd wrote:<br/>\n&gt; <br/>\n&gt;&gt; -=-My personal decision would be different than yours. I wouldn&#39;t even be writing to a list asking whether or not I should stay. But since you&#39;ve stated that you don&#39;t want to walk away for many reasons...-=-<br/>\n&gt;&gt; <br/>\n&gt;&gt; I don&#39;t think she wanted the list to vote and make a decision for her, or even to recommend a final decision, but to share experiences, ideas, and possible options to help her think about it herself.<br/>\n&gt;&gt; <br/>\n&gt;&gt; There are MANY people who will say, always, &quot;leave.&quot; The considerations when children are involved should be larger, and slower, than if it&#39;s a childless woman leaving a man. A mother can&#39;t leave the father of her children without having made an irreparable change in all their lives. <br/>\n&gt;&gt; <br/>\n&gt;&gt; And on top of that, the kind of thinking one might do without ever having been involved with unschooling might not apply to someone who has moved toward making decisions for different kinds of reasons, and in a different way.<br/>\n&gt;&gt; <br/>\n&gt;&gt; Sandra<br/>\n&gt;&gt; <br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":61344,"nextTopicId":61327}}