{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Optimism in parenting","postDate":"1096165644","msgId":99824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNqNTllYyttNDBkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":99823,"nextInTime":99825,"topicId":99824,"numMessagesInTopic":0,"msgSnippet":"I m on a roll with posting tonight. Thoughts keep popping and I need to express them. My mother and her husband are here from out of town to be with us over","messageBody":"<div id=\"ygrps-yiv-1420171035\">I&#39;m on a roll with posting tonight. Thoughts keep popping and I need to express them.<br/>\n<br/>\nMy mother and her husband are here from out of town to be with us over the weekend. <br/>\nThey&#39;ve been very supportive of all our parenting choices all along. When we switched over <br/>\nto unschooling, my mom was curious in that wonderfully supportive way. (I&#39;m lucky.)<br/>\n<br/>\nWell, today she told me how much she saw the wisdom of this kind of educational <br/>\nphilosophy and how it was impacting her grandparenting. She found herself really paying <br/>\nattention to the unique ways our kids express themselves and then thinking how she and <br/>\nher husband could fit in to who they are.<br/>\n<br/>\nOne funny example of how this worked itself out. My 8 yr old daughter decorated her <br/>\ngranddad with all kinds of objects (leaves, a blanket, a hair brush, a dog chew toy, etc.) to <br/>\ncreate a &quot;human collage.&quot; My mom laughed because she said that she and her husband <br/>\nhad talked about letting the kids have their way with them and not being fussy old people. <br/>\nThisw was a surprising manifestation of that commitment! <br/>\n<br/>\nIt was such a magical picture to watch emerge. My step dad sat quietly while my daughter <br/>\nworked her art on him. They didn&#39;t need to talk. They just needed to connect and the <br/>\ngrandpa acted as a willing human canvas. We took photographs at the end.<br/>\n<br/>\nThat picture of supportive creativity spoke to me. <br/>\n<br/>\nUnschooling, I&#39;ve noticed, creates optimism. We see good in the natural bent of our <br/>\nchildren. We affirm that good and look for ways to support and enhance it. There is space <br/>\nfor their quirks and gifts and we say yes to them.<br/>\n<br/>\nI told my husband tonight that what I value most about the women on this list is their <br/>\nunflappable faith in their kids. It&#39;s just so nice to be a part of a group who think their kids <br/>\nare cool and capable and interesting. <br/>\n<br/>\nJulie B</div>","specialLinks":[]}],"prevTopicId":99819,"nextTopicId":99831}}