{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"question for Pam S","postDate":"1040331636","msgId":52457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNi4xZDZkYzY0ZC4yYjMzOGQ3NEBjcy5jb20+"},"prevInTopic":52426,"nextInTopic":0,"prevInTime":52456,"nextInTime":52458,"topicId":52426,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/19/02 2:14:06 PM Central Standard Time, Unschooling-dotcom@yahoogroups.com writes: Thank you SO much for that clarification Pam. It fits","messageBody":"<div id=\"ygrps-yiv-37365732\">In a message dated 12/19/02 2:14:06 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\nThank you SO much for that clarification Pam. It fits right in with what I <br/>\nfelt NHEN does.<br/>\nI had posted their information when someone else had mentioned HSLDA and then <br/>\nthis other person chimed in with why they would not support NHEN.<br/>\nWhich is too bad. I posted what you wrote and hopefully that will help clear <br/>\nthings up.<br/>\nThanks again,<br/>\nRen<br/>\n&quot;Knowledge will not always take the place of simple observation.&quot;<br/>\n                                                        ~Arnold Lobel<br/>\nUnschooling support at pensacolaunschoolers.com</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re: question for Pam S","postDate":"1040319551","msgId":52426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM4OEY5MjEyLTEzNzgtMTFENy1CQ0Q1LTAwMDM5M0NFRkE1QUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDEwNDAzMTM1NDMuMTIxOS42MDUzNS5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":52457,"prevInTime":52425,"nextInTime":52427,"topicId":52426,"numMessagesInTopic":0,"msgSnippet":"We don t define who is and who isn t homeschooling - we leave it up to people to do that for themselves. Common sense would tell us that someone who sends","messageBody":"<div id=\"ygrps-yiv-2053069201\">We don&#39;t define who is and who isn&#39;t homeschooling - we leave it up to <br/>\npeople to do that for themselves. Common sense would tell us that <br/>\nsomeone who sends their kid to school full time and does homework with <br/>\nthem in the evening is NOT homeschooling and nobody at NHEN would ever <br/>\nconsider that homeschooling.<br/>\n<br/>\nI know why the statement was made, however. There are people who are <br/>\nreally concerned that homeschooling,the term itself, should not be used <br/>\nto describe anybody who has any involvement with public schools <br/>\nwhatsoever. They want NHEN to define homeschooling in that way - very <br/>\nvery specifically so that anybody with any such involvement would be <br/>\ndefined as NOT a homeschooler. Our problem with this is that, first, <br/>\nthere is disagreement within the homeschooling community over this very <br/>\nissue - in fact it is an EXTREMELY hot topic and has the potential to <br/>\ntear the homeschooling community apart. As individuals we NHEN board <br/>\nmembers have our own opinions, of course, but we have to keep our <br/>\nspecific and rather limited organizational mission in full view - NHEN <br/>\nprovides information and networking opportunities for anyone with an <br/>\ninterest in homeschooling (this would include legislators, news media, <br/>\nlibrarians, for example). Our information is available to all, we don&#39;t <br/>\ndiscriminate based on religion, political views, homeschooling style or <br/>\nother such choices, including the choice of utilizing some sort of <br/>\npublic school services. However, NHEN very strongly supports the right <br/>\nof parents to take full responsibility for their own children&#39;s <br/>\neducation free of any government involvement at all. We have a lengthy <br/>\ndocument, for example, which provides strong arguments as to why <br/>\nhomeschoolers should not be subject to any government regulation or <br/>\noversight. We&#39;ve provided that document to homeschoolers to use when <br/>\nthey have been faced with threats of increased regulation.<br/>\n<br/>\nWe are very very clearly supportive of parents rights to choose full <br/>\neducational independence.<br/>\n<br/>\nWe have no reason to &quot;define&quot; homeschooling, though. Our work doesn&#39;t <br/>\nrequire us to do that - we provide our information to all.<br/>\n<br/>\nThere are those who want us to make some sort of statement that we do <br/>\nnot support parental choices which involve public school district <br/>\nprograms such as hybrid homeschooling/classroom schooling or such as <br/>\npublically-funded charter schools which support homebased learning or <br/>\npublic school independent study programs, etc. They wish us to make a <br/>\nstatement that homeschooling is defined ONLY as parents educating their <br/>\nchildren without any government involvement or oversight. NHEN has <br/>\nchosen not to make such a statement - primarily because it is a huge <br/>\ngigantic can of worms that we simply do not feel any need to open - we <br/>\nfeel that our scarce time and energy and resources are better used in <br/>\nproviding actual support for freedom from oversigh, for example.<br/>\n<br/>\nRemember, NHEN doesn&#39;t &quot;do&quot; the work that should belong to local and <br/>\nstate people - we provide backup support for them, we help them get <br/>\nconnected with people who might be able to provide assistance and with <br/>\ninformation that might help them - but we don&#39;t act FOR them.<br/>\n<br/>\nSo - that&#39;s the long answer.<br/>\nThe short answer is that there are a few people out there who want NHEN <br/>\nto be something it is not - a sort of secular HSLDA - which will define <br/>\nwho is and who isn&#39;t a legitimate homeschooler. Because we don&#39;t define <br/>\nit, they are making up extreme and ridiculous scenarios such as the one <br/>\ndescribed in your post. We don&#39;t want to even START down the road of <br/>\nsaying: &quot;Yes, YOU are a homeschooler and YOU are not and YOU are and <br/>\nYou aren&#39;t.&quot; Trying to get that right across all states - some with <br/>\nlegal definitions of homeschooling, some without, some with public <br/>\nschool home-based learning programs that involve less government <br/>\noversight than other states require in their actual homeschooling laws <br/>\n- it is just WAY too much - too difficult - to messy - and we have very <br/>\nlimited resources. Our time is better spent elsewhere. So we don&#39;t have <br/>\nsuch a statement. Not having a statement about who is a &quot;real&quot; <br/>\nhomeschooler and who is not - doesn&#39;t mean that ANYBODY is considered a <br/>\nhomeschooler. If someone says they don&#39;t want to make a statement about <br/>\nwho is a real Christian, that doesn&#39;t mean she thinks Jews are <br/>\nChristians.<br/>\n<br/>\nOn Thursday, December 19, 2002, at 07:59 AM, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Pam,<br/>\n&gt; I&#39;m involved in another list that is all about linking unschoolers all <br/>\n&gt; over<br/>\n&gt; the world. This comment came up when I posted a link to NHEN<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;The very reason I do not  support NHEN.  A parent that sends their <br/>\n&gt; child to<br/>\n&gt; public school full time but does homework with their child in the <br/>\n&gt; evening<br/>\n&gt; (which is mandatory in most states) is considered homeschooling by <br/>\n&gt; NHEN.<br/>\n&gt; That I can not agree with.&quot;<br/>\n&gt;<br/>\n&gt; Is this true? I never got the idea that they supported this. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":52452,"nextTopicId":52111}}