{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":11185857,"authorName":"howlinlady","from":"&quot;howlinlady&quot; &lt;howlin@...&gt;","profile":"howlinlady","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"WA and AEPs","postDate":"1012207063","msgId":3098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzMzJrbitxbTBuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":3097,"nextInTime":3099,"topicId":3098,"numMessagesInTopic":0,"msgSnippet":"I d like to add my two cents about our concerns about the Alternative Education Programs in Washington State. As Nichoel stated, these programs are getting","messageBody":"<div id=\"ygrps-yiv-793214021\">I&#39;d like to add my two cents about our concerns about the Alternative<br/>\nEducation Programs in Washington State.<br/>\n<br/>\nAs Nichoel stated, these programs are getting people in their<br/>\nprograms by telling them they will be homeschooling, but once<br/>\nenrolled in the program, by statute they are not &quot;homeschooling&quot;.<br/>\nThey are in a public school program.  We are concerned about the<br/>\ndisctinction because of accountability.  The people in these programs<br/>\nare held up as examples of homeschooling.  These people don&#39;t mind<br/>\nbeing supervised, being tested etc.  The people are told they must <br/>\ntake the WASL - homeschoolers are not required to take the WASL test  <br/>\nand public schooled children can opt out of it as well - but they <br/>\naren&#39;t told this.  So we are concerned that they are not being given <br/>\nthe facts as outlined in the statutes of the state.  We don&#39;t object <br/>\nto their choice but we are concerned about how this &quot;model&quot; of <br/>\nhomeschooling can affect our right to homeschool in the future. One<br/>\nof the reasons I homeschool my children is because I don&#39;t believe I<br/>\nneed to be guided and supervised and I don&#39;t believe that testing is <br/>\nthe best way to evaluate how much my children are learning.  So when<br/>\nthese programs are used as models of homeschooling - with supervision <br/>\nand testing  - and the public sees this &quot;model&quot; of supervision and <br/>\naccountability as the new wave in the homeschooling community, we are <br/>\nconcerned that the laws will be changed to reflect the &quot;model&quot; as the <br/>\nonly way to legally homeschool in this state. Personally, I am <br/>\ncomfortable with the homeschooling laws as they are.  And I believe <br/>\nthat it is every parent&#39;s right to choose how their children are <br/>\neducated, be it public, private, AEP or homeschooling. We are not <br/>\ntrying to be critical of parents choices, nor are we trying to be <br/>\ndivisive.  Many of us are concerned about changes to our laws based<br/>\non the trends we are seeing of homeschoolers flocking to these <br/>\nprograms - and under false pretenses. Then the powers that be see this <br/>\ntrend, and in their concern that all children be given a quality <br/>\neducation and their belief that the state has an obligation to make <br/>\nsure homeschooled children are getting that quality education, they <br/>\nthen work to tighten the reins on all of us - for the public good of <br/>\ncourse. And they are using the AEPs as examples of successful <br/>\nhomeschooling with accountability.<br/>\n<br/>\nThat&#39;s my rant - did I make my concerns clear?<br/>\n<br/>\nLisa</div>","specialLinks":[]}],"prevTopicId":3075,"nextTopicId":3073}}