{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"George Prudden & Barda Allen","from":"George Prudden & Barda Allen &lt;aringo@...&gt;","replyTo":"LIST","senderId":"imgWNGs8Feib0ANJpp0PWHcSWaBt7nUVKmpzJObY7R-ld_U7vZnV_9ljMBX2qKsq4K1wtu5W6R0yO7i9BXEibhjypkgJZg7rFbMJp2eUalFhKmHuxsg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Intro:","postDate":"986173139","msgId":17722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2RUQyQUYzLkUzJWFyaW5nb0Bxd2VzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":17721,"nextInTime":17723,"topicId":17722,"numMessagesInTopic":0,"msgSnippet":"Hi, This is so great,I was checking out the Clonlara website and through that I came across everything else.    Well, now for the intro... We are Barda A.","messageBody":"<div id=\"ygrps-yiv-1470410\">Hi, This is so great,I was checking out the Clonlara website and through<br/>\nthat I came across everything else.    Well, now for the intro...<br/>\nWe are Barda A. Allen & George A. Prudden, married with 5 kids, Amy-19,<br/>\nHubbard-15, Nathaniel-13, David-9 and BJ-6, last names Allen/Prudden. Our<br/>\nfamily lives in Helena, MT, in a house that is over 100 yrs old. We have<br/>\nhomeschooled since our oldest was school age. When #1d was a preschooler she<br/>\nhad a brief encounter with a Montessori school- that is an eye-opening story<br/>\nin itself, we are unschoolers, all 7 of us!<br/>\nGeo. is a craftsman in many trades. In &#39;99 we spent a year in CA where he<br/>\nrebuilt my sisters houseboat. He self-taught himself carpentry, electrical<br/>\nplumbing, ceramic and stone tiling, actually all the construction trades.<br/>\nOur motto was &quot;If you don&#39;t want it done right, don&#39;t call&quot;.That ad in the<br/>\npaper brought us lots of repeat customers for years. He also repairs musical<br/>\ninstruments, as he worked for 13 yrs in a music store in Chicago. We have<br/>\ntravelled alot over the years and stayed with friends in the midwest and<br/>\nthey always had a job for Geo. to do.  We haven&#39;t travelled at all for more<br/>\nthan a year and now he is involved in two bands. The most recent one is<br/>\ncalled &quot;The B Sharps&quot; music that moves and inspires with lounge nouveau<br/>\nstyle. He has a vision of making music his road to financial freedom and<br/>\neverytime he gets paid from a job he gives 10% to the church.    #1d is<br/>\nworking on her GED this year, she has always resisted any &quot;school&quot; stuff,<br/>\nbut now wants to know it all. She has been working in the cooking field for<br/>\nover 2 yrs now. Her 1st job was in a deli. Last June she got hired at On<br/>\nBrdway as a line cook. She also works at a place called The Staggering Ox as<br/>\nCS. She says she is going to culinary school.  #1s is being mentored by Phil<br/>\nM. who wanted to pass on what he knows about business. Last fall I asked #1s<br/>\nwhat he wanted to learn during the school year, his said computers. I<br/>\nthought our neighbors could be a wealth of information as one uses Mac and<br/>\nthe other windows. However , along came Phil and #1s is on his way to really<br/>\nmastering more than I could imagine. He is learning how to buy items at<br/>\ngarage/estate sales and sell them on e-bay. Phil also is teaching him the<br/>\nconstruction trade and how to shovel large piles of snow! When #1s is at<br/>\nhome he can be found online playing games and talking to friends, through<br/>\nthis his spelling and typing skills are sharpened, as are his computer<br/>\nskills. He can think for himself and is not swayed by the crowd.    #2s<br/>\nworks very part-time at the best coffee place in the USA. This is what he<br/>\nwanted to do this year. He takes orders, washes cups, gophers to the bank,<br/>\nthe real food store, down the street for buckets of ice, makes italian<br/>\nsodas, entertains small children so the parents get a break and plays chess<br/>\nwith customers. Oh, yes, he also handles money! He has a desk in the owners<br/>\noffice with a computer and does school work there too. Finally he is<br/>\nstarting to take a real interest in reading.   #3s loves to ride his bike<br/>\nand his razor. He is musically inclined and takes piano lessons from piano<br/>\nartists when we come across them. He learned to read a couple years ago.<br/>\n#2d is a tomboy, though she does have dolls which she will play with. She is<br/>\ninterested in reading and math. She is very observing  and asks lots of ?&#39;s<br/>\nMe, my babies are growing and now I concentrate on producing streams of<br/>\nincome. I produce weavings, work 3x&#39;s/wk at the Brdwter Athelic Club so we<br/>\nhave a free membership. I&#39;m also in NWM. Check out my website at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.retirequickly.com/41749\">http://www.retirequickly.com/41749</a>  An exciting and refreshingly different<br/>\nNWM company, let&#39;s retire debt together!   Last, but not least, I am a<br/>\nNikken Wellness Consultant, helping people to create balance in their lives,<br/>\nproviding them with products for a healthier lifestyle and offering magnetic<br/>\nmassage.  <br/>\nStand in nothingness and you can create anything.<br/>\nBarda A. Allen</div>","specialLinks":[]}],"prevTopicId":17720,"nextTopicId":17727}}