{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"seemingly off topic long answers to  2 questions","postDate":"1113483896","msgId":22011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhLjExMjhhZTk5LjJmOGZjNDc4QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":22010,"nextInTime":22012,"topicId":22011,"numMessagesInTopic":0,"msgSnippet":"Short answers can be wonderful. This isn t one of those. People who want to wait for good short answers should feel free to skip  this by.  Sandra In a","messageBody":"<div id=\"ygrps-yiv-766047304\">Short answers can be wonderful.<br/>\nThis isn&#39;t one of those.  <br/>\nPeople who want to wait for good short answers should feel free to skip  this <br/>\nby. &lt;g&gt;<br/>\n <br/>\nSandra<br/>\n <br/>\nIn a message dated 4/14/2005 3:29:18 AM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:woodjmac3@...\">woodjmac3@...</a> writes lots of :<br/>\n<br/>\nI know. . . .   I know from the depths of my  being.<br/>\n<br/>\n<br/>\n-------------------------------<br/>\n <br/>\nThose statements bothered me.  The substance of them didn&#39;t bother  me, but <br/>\nthe form did--not grammatically or logically, but philosophically and  in terms <br/>\nof physiology.<br/>\n<br/>\n<br/>\nThen we come up against language.<br/>\n <br/>\nHad you said &quot;I believe that...&quot; it would&#39;ve been  softened.<br/>\nAnd had I not grown up in an atmosphere in which people knew things  because <br/>\nin the depths of their beings they knew it was true, my little  &quot;alert&quot; lights <br/>\nwouldn&#39;t go off.<br/>\n <br/>\nAnd that comes to the two questions:<br/>\n <br/>\n-=-1) How come knowing these things I sometimes find it so hard to  implement <br/>\nthem. -=-<br/>\n<br/>\n<br/>\nEverything you listed has to do with theory and practice of attachment  <br/>\nparenting and unschooling.  That&#39;s cool with me!  As stated, they  are ideals <br/>\nalmost in the realm of virtues (and when we live by principle  instead of rules, <br/>\nthat IS in the realm of philosophy/belief, and so the best  we can do is <br/>\napproach our ideas as nearly as we can).<br/>\n <br/>\nYou were really stating principles that make logical sense to you,  things <br/>\nyou intellectually believe to be viable and true, and probably things  you&#39;ve <br/>\nseen work with your own children and others.   That&#39;s  legitimate, and that&#39;s <br/>\nhow beliefs become convictions.<br/>\n<br/>\n<br/>\n-=-2) As I know these are right am I being conceited or as I  believe just <br/>\nmore aware than those who do not.-=-<br/>\n <br/>\nYou&#39;re more aware of the topics you&#39;re discussing, I think.  You&#39;re  <br/>\nfocussing your thought and energy and BEing on being that kind of  parent.  It&#39;s the <br/>\nlooming in the forefront of your awareness.   That&#39;s not a bad thing.  But in <br/>\nmany people&#39;s lives something else is  looming at the forefront.  (And then in <br/>\nsome people&#39;s lives, nothing much  looms, they play on a flatter field, <br/>\nemotionally.  Fervor isn&#39;t one of  their emotions.)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nBesides thinking about attachment parenting, and before that and during,  <br/>\nI&#39;ve also spent a lot of time talking/thinking/writing/debating (kinda same  <br/>\nstuff we do on the discussion list and other such places) about virtue and  <br/>\nbelief, so this all jumped out at me.   In that area, I&#39;ve come to  believe that <br/>\nthere are three levels of &quot;belief&quot;:  an idea, a theory and a  conviction.<br/>\n <br/>\nAn idea doesn&#39;t have to be original, but can be something we&#39;ve borrowed to  <br/>\ntry out, to think about, to hold as possibly worth believing.   Then  if it <br/>\nworks we believe it, but we need to really wear it around, ride it, sleep  on <br/>\nit, try it out in different environments, test it.  If it stands up to  all <br/>\nother beliefs it meets and still seems true and best, and if we have  experienced <br/>\ngood results and find no reason to abandon the belief for something  we think <br/>\nis better, then it becomes a conviction.  We are convinced.<br/>\n <br/>\nThose are all words to try to describe levels of confidence that I think  are <br/>\ncombinations of logic and biochemistry.  Is something a calm belief or  an <br/>\nagitated, nervous belief?  Does it flow deep and still like a conviction  or <br/>\ndoes it hop around like little idea?  Does it ask little questions  inside us all <br/>\nthe time like a belief?<br/>\n <br/>\nThere&#39;s a place inside the brain (recent research has shown) where fervor  <br/>\nand religious experience live, are formed, react, &quot;spark.&quot;  As with other  <br/>\nbiochemical things, science is just newly discovering and unravelling what&#39;s up,  <br/>\nbut when there is a deep personal experience/feeling/thought involving a  <br/>\nperson&#39;s relationship to the rest of the universe, that&#39;s the part of the brain  <br/>\nthat&#39;s stimulated (so people are attempting to clarify and prove and examine  <br/>\nmore closely).<br/>\n <br/>\nWhen someone is emotionally and in other ways invested in something as big  <br/>\nas life to them, they get that feeling of just knowing deep in their  being.<br/>\n <br/>\nThat leads to love and religion.   That wasn&#39;t your question, but  that might <br/>\nbe part of your answer.<br/>\n <br/>\nMore in other posts,<br/>\n <br/>\n <br/>\nSandra<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22007,"nextTopicId":22013}}